{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":13,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: potty training","postDate":"1355528263","msgId":49332,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGthZ2Q4NytoYm51QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBSjJIanpDazFqejA9K19UVXI2PXorZ1dickZUVE1HQz0zdFEzdWdOYzMtXys1QWNfd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49331,"nextInTopic":0,"prevInTime":49331,"nextInTime":49333,"topicId":49318,"numMessagesInTopic":0,"msgSnippet":"... Ah! this is a common point of confusion among parents, one promulgated by educational theorists going back to Maria Montessori. Readiness is a very","messageBody":"<div id=\"ygrps-yiv-1886562459\">Katerina Koleva &lt;katerina.kolevablisss@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &quot;Anything before 2 is early&quot;.<br/>\n&gt; That is the assumption I am talking about.<br/>\n&gt; Many kids can be ready before they turn two.<br/>\n<br/>\n </span></blockquote>Ah! this is a common point of confusion among parents, one promulgated by educational theorists going back to Maria Montessori. &quot;Readiness&quot; is a very important consideration in teaching, but only one factor in terms of actual learning, and really only a factor in terms of its absence if you see what I mean. If a child isn&#39;t ready, he or she *can&#39;t* learn something. But the fact that a person is &quot;ready&quot; doesn&#39;t mean it&#39;s time to learn, it just means learning is now within the realm of comfortable possibility.<br/>\n<br/>\nToddlers are busy people, busy learning about the world. There&#39;s no real need for a busy, engaged toddler to learn to use the toilet if it&#39;s not something he or she wants to do. It Is true that many toddlers are fascinated with their bodies, curious about what comes out of them, and thrilled to find they have some control over the process. I remember my daughter happily stopping and starting her pee at will. The weather was warm so I moved her out onto the porch so she could play with this exciting new maneuver to her heart&#39;s content without me fretting over the carpets and furniture, and it didn&#39;t take more than a couple repetitions before she would dash outside the moment she wanted to pee. In the fall, when it got cold, she was happy to switch to the potty. I don&#39;t recall how old she was... 2ish. Her birthday is in August and she started... oh, in the spring I suppose, so before she was actually 2. That&#39;s how important the numbers are - almost ten years later I&#39;ve forgotten them. <br/>\n<br/>\nBut none of that came from any expectation on my part. Like many toddlers, she liked to be naked during the day. From an unschooling perspective, the important thing was I was sensitive to her interests and preferences. By being sensitive to her interests and preferences, I created an environment which supported her in her endeavors, even when they were a bit odd by some standards. Had she resisted being moved when peeing, I would have found some other solution - put down cloths or a bowl or something, I suppose. And eventually, she still would have learned to use the toilet because it&#39;s something the people around her were doing. <br/>\n<br/>\nIt does help to let kids into the bathroom while people are using it and provide information of the kind they like, but what kind of information will depend on the child. Potty books, potty games, potty songs, little potties, inserts, step-stools - all of those are kinds of information. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If a kid is never left without a diaper until he<br/>\n&gt; is 3,4,5 it would be harder for him to use the toilet compared with a<br/>\n&gt; situation when Mum show him there IS another option.<br/>\n<br/>\n </span></blockquote>It&#39;s not an option if a child doesn&#39;t like to be bare - and some kids abhor being bare, strange as that may seem if you have an easygoing nudist in your home ;) And yet those kids can and do still learn to use a toilet without lessons, using the other information and resources parents place at their disposal. <br/>\n<br/>\nI think it can be helpful to reassure parents who come from a more... straightlaced? background that it&#39;s totally okay to let kids run around the house bare-bottomed if they want to (maybe not outside, depends, but inside, sure). That&#39;s a good, helpful idea to spread around. But there&#39;s no need to tie it to anything in particular. It doesn&#39;t hurt anything, doesn&#39;t ruin the kids - and really doesn&#39;t ruin the furniture if you&#39;re thoughtful and sensible and engaged and take some precautions. The important thing - the really, really important thing - is not to make using the toilet an Issue. It&#39;s just one of the many many Many things little kids are busy learning. It&#39;s okay if they do it a little later - they&#39;re still learning other wonderful things, I promise ;)<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: potty training","postDate":"1355525646","msgId":49331,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGthZ2FtZSs1NWJvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBSjJIanpDazFqejA9K19UVXI2PXorZ1dickZUVE1HQz0zdFEzdWdOYzMtXys1QWNfd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49330,"nextInTopic":49332,"prevInTime":49330,"nextInTime":49332,"topicId":49318,"numMessagesInTopic":0,"msgSnippet":"Since there has been some confusion on the subject of Elimination Communication I m posting the link to a website devoted to the topic and people can take","messageBody":"<div id=\"ygrps-yiv-997662868\">Since there has been some confusion on the subject of &quot;Elimination Communication&quot; I&#39;m posting the link to a website devoted to the topic and people can take specific questions there. I haven&#39;t looked it over very hard and am not responsible for the content etc etc:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diaperfreebaby.org/?&MMN_position=1:1\">http://www.diaperfreebaby.org/?&MMN_position=1:1</a><br/>\n<br/>\nHere&#39;s a quote from their home page:<br/>\n<br/>\n&lt;&lt;Elimination Communication (EC) is NOT potty training. It is a gentle, natural, non-coercive process by which a baby, preferably beginning in early infancy, learns with the loving assistance of parents and caregivers to communicate about and address his or her elimination needs. This practice makes conventional potty training unnecessary.<br/>\n<br/>\nParents and caregivers who practice EC are often surprised by just how quickly they begin to experience clear and consistent communication with their infant; next to this, early potty independence is seen only as a frequently-occurring side benefit.&gt;&gt;</div>","specialLinks":[]},{"userId":487208120,"authorName":"Katerina Koleva","from":"Katerina Koleva &lt;katerina.kolevablisss@...&gt;","profile":"jkaterina","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: potty training","postDate":"1355515206","msgId":49330,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBSjJIanpDazFqejA9K19UVXI2PXorZ1dickZUVE1HQz0zdFEzdWdOYzMtXys1QWNfd0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGthZnQ5MytqdW9lQGVHcm91cHMuY29tPg==","referencesHeader":"PENBS2hkYndLc2tVRjRTbjJ2Nk9FUVVINng2eEN3TzhIeEhmUXBqbXJ4Yk81SlZuQWpvQUBtYWlsLmdtYWlsLmNvbT4JPGthZnQ5MytqdW9lQGVHcm91cHMuY29tPg=="},"prevInTopic":49329,"nextInTopic":49331,"prevInTime":49329,"nextInTime":49331,"topicId":49318,"numMessagesInTopic":0,"msgSnippet":"Anything before 2 is early . That is the assumption I am talking about. Many kids can be ready before they turn two. Communication is important and so is","messageBody":"<div id=\"ygrps-yiv-1059102219\">&quot;Anything before 2 is early&quot;.<br/>\nThat is the assumption I am talking about.<br/>\nMany kids can be ready before they turn two. Communication is important and<br/>\nso is partership,isn&#39;t it? If a kid is never left without a diaper until he<br/>\nis 3,4,5 it would be harder for him to use the toilet compared with a<br/>\nsituation when Mum show him there IS another option. Providing a choice.</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: potty training","postDate":"1355511907","msgId":49329,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGthZnQ5MytqdW9lQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBS2hkYndLc2tVRjRTbjJ2Nk9FUVVINng2eEN3TzhIeEhmUXBqbXJ4Yk81SlZuQWpvQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49328,"nextInTopic":49330,"prevInTime":49328,"nextInTime":49330,"topicId":49318,"numMessagesInTopic":0,"msgSnippet":"... In terms of supporting kids as they learn about the world, it can be helpful to think about phrases like help them understand . Is the child asking a","messageBody":"<div id=\"ygrps-yiv-575767538\">Claire Mesa &lt;roselady4@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;what I was saying<br/>\n&gt; about sitting on the potty by the TV or while reading them a story was only<br/>\n&gt; a way to help them understand what they were trying to do<br/>\n<br/>\n </span></blockquote>In terms of supporting kids as they learn about the world, it can be helpful to think about phrases like &quot;help them understand&quot;. Is the child asking a question or otherwise Seeking to understand? If so, then it makes sense to help them out, the way you might help a friend who was lacking some particular information or skills. For instance, if a friend of mine wanted to learn how to knit, I might come and sit with her while she tries so that I&#39;m on hand to answer questions and help her understand the process and principles. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My point was this, that perhaps many kids will learn it more easily and<br/>\n&gt; willingly at a younger age. <br/>\n<br/>\n </span></blockquote>Sitting a child down on a potty chair until they perform - at any age - is a lesson, pure and simple. It doesn&#39;t start with seeing what a child wants to do, it starts with an adult who wants to teach. And kids learn perfectly well Without being taught - that&#39;s the important thing in terms of unschooling. Learning doesn&#39;t require teaching. Without lessons, but with support and information, kids still learn to use the toilet independently. Some even do it &quot;early&quot; - because that&#39;s when the subject is interesting to them. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sometimes children at a young age try to help their parents around the<br/>\n&gt; house and they don&#39;t let them and then they try to get them to do it when<br/>\n&gt; their older and by that time they have become complacent about not helping.<br/>\n<br/>\n </span></blockquote>I would say &quot;discouraged&quot; rather than &quot;complacent&quot; but otherwise that&#39;s a good point. Unschooling isn&#39;t about doing everything for children all the time, it&#39;s about seeing what kids want to learn and being their friend and helper in their endeavors. <br/>\n<br/>\nA lot of children are thrilled to learn to do some basic cleaning and household tasks as toddlers - it&#39;s exciting to them, and allows them to feel wise and capable and powerful in their own realm... if they are choosing to it and are supported in that choice. But it is also true that household tasks lose their excitement in just a few years - it&#39;s not exactly rocket science, and kids go on to want to learn more interesting things, no longer the willing housekeeping buddies they were as toddlers. That&#39;s A Good Thing! It&#39;s Wonderful that they&#39;re so busy learning about the world they haven&#39;t a moment to help around the house. And if you look at what kids do and see their perspectives, you can see that they are still naturally thoughtful and helpful, it just doesn&#39;t look like a three year old wiping down the counters any more - it looks like a five year old making mom her very own mud pie, or a seven year old writing her a story, or a ten year old feeding the cat and leaving cat-food all across the counter in the process. <br/>\n<br/>\nEventually, without lessons or chores - they&#39;ll develop the perspective which allows them to be generous in ways which are thoughtful from an adult viewpoint - usually around adolescence, if they&#39;re surrounded with grace and generosity and appreciation for the things they do. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; It&#39;s hard to show someone how to use a potty over fears and such.<br/>\n<br/>\n </span></blockquote>Fortunately, you don&#39;t have to. There are other ways to learn than by direct instruction and kids are masters of knowing how to learn in their own ways. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":235156828,"authorName":"Claire Mesa","from":"Claire Mesa &lt;roselady4@...&gt;","profile":"cmesa4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: potty training","postDate":"1355510509","msgId":49328,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBS2hkYndLc2tVRjRTbjJ2Nk9FUVVINng2eEN3TzhIeEhmUXBqbXJ4Yk81SlZuQWpvQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGthZTIxZittcjduQGVHcm91cHMuY29tPg==","referencesHeader":"PENBS2hkYncrZjFDU0VfVU1GVjM5UWFKUnJ3NGJtN0N1eStZLWN4WXlzPXRKUTdaUm00d0BtYWlsLmdtYWlsLmNvbT4gPGthZTIxZittcjduQGVHcm91cHMuY29tPg=="},"prevInTopic":49327,"nextInTopic":49329,"prevInTime":49327,"nextInTime":49329,"topicId":49318,"numMessagesInTopic":0,"msgSnippet":"Perhaps I should rephrase some things as I can see of it seems to make the wrong point. It s not meant to say that you have to have a goal of a certain age. It","messageBody":"<div id=\"ygrps-yiv-1660735534\">Perhaps I should rephrase some things as I can see of it seems to make the<br/>\nwrong point.<br/>\n<br/>\n  It&#39;s not meant to say that you have to have a goal of a certain age. It<br/>\nis also not meant to point out to someone who has an older child that they<br/>\nmade some kind of mistake or to offer advice to her to start younger as<br/>\nthat would be silly.<br/>\n<br/>\nSome of what I did would be helpful at any age and btw what I was saying<br/>\nabout sitting on the potty by the TV or while reading them a story was only<br/>\na way to help them understand what they were trying to do or give them<br/>\ntheir first experience actually going in the potty and I only did it for<br/>\nshort periods.<br/>\n<br/>\nMy point was this, that perhaps many kids will learn it more easily and<br/>\nwillingly at a younger age. I found it it to be the natural age in most<br/>\ncases for wanting to learn. And really what I did was help them. Babies<br/>\nlearn a lot by mimicking. One of my son&#39;s saw my other son go potty so<br/>\noften, he just started doing it. That&#39;s not always a possibility but that&#39;s<br/>\nwhy they should see their parents or someone often enough and they need to<br/>\ndo it in a potty or a special seat so they need to be shown that.<br/>\n<br/>\nI did give some M&M&#39;s but the main thing in making a big deal is to place<br/>\npositive value and attention on it--just letting them know they did a good<br/>\njob. I placed no attention on mistakes.<br/>\n<br/>\nNo one should get serious or worried about it at any age as that won&#39;t help.<br/>\n<br/>\nThere is no absolute need I agree--I just found it to work and I found the<br/>\nkids were very happy to learn at that age, I think they themselves prefer<br/>\nthat most of the time if they have been introduced to the idea.<br/>\n<br/>\nI thought some people may not realize it could be done early on and that it<br/>\nmight be easier and more natural.<br/>\n<br/>\nI remember I learned to tie my shoes and dress myself and my mother<br/>\ncontinued to do it for me and I just decided it was easier to let her do<br/>\nit. That kind of thing happens sometimes too.<br/>\n<br/>\nSometimes children at a young age try to help their parents around the<br/>\nhouse and they don&#39;t let them and then they try to get them to do it when<br/>\ntheir older and by that time they have become complacent about not helping.<br/>\n<br/>\nThey want a job sometimes when they are too young and can&#39;t get one and<br/>\nthen give up on the idea when old enough.<br/>\n<br/>\nSo my only point is sometimes a child wants to do something at a younger<br/>\nage or is more interested and it&#39;s good to keep ones eyes open to that or<br/>\ngive them some help so they know what it&#39;s about.<br/>\n<br/>\nBut there are other toilet issues that can come up when a child is older.<br/>\nOne of my children when he was 4 became very frightened of using public<br/>\ntoilets or toilets at schools because of a fan breaking in the bathroom and<br/>\nmaking a loud noise and something he saw on TV. We helped him with<br/>\nsolutions that made him less afraid etc...<br/>\n<br/>\nIf a child is nervous with his clothes off, perhaps getting him used to<br/>\nwearing a little less little by little would help and let him talk about it<br/>\nwithout probing too much--he may have seen something that frightened him.<br/>\nIt&#39;s hard to show someone how to use a potty over fears and such. I would<br/>\npersonally help him slowly get over some of his fears first and having<br/>\nstories about the potty are great and experiencing others doing it in some<br/>\nway and anything that helps him feel more friendly toward potties or having<br/>\nless clothes o or whatever makes the child nervous.</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: potty training","postDate":"1355510391","msgId":49327,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGthZnJwbitmZHBsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBSjJIanpBUHJ1ZlVhd2JGcz1NWW1ZMnpORVIydFd2Q0Q3Q1lobVdEMU9HZlNKSDVDZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49326,"nextInTopic":49328,"prevInTime":49326,"nextInTime":49328,"topicId":49318,"numMessagesInTopic":0,"msgSnippet":"... EC - Elimination Communication, works essentially along the same lines as unschooling. It s not a potty Training method any more than unschooling is an","messageBody":"<div id=\"ygrps-yiv-1493468693\">Katerina Koleva &lt;katerina.kolevablisss@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I learned about Elimination Communication when my older child was<br/>\n&gt; one. Practiced it part-time and by 18 months he was out of nappies.<br/>\n<br/>\n </span></blockquote>EC - Elimination Communication, works essentially along the same lines as unschooling. It&#39;s not a potty Training method any more than unschooling is an educational method, it&#39;s a set of principles which can help parents communicate more effectively with infants and toddlers. It doesn&#39;t guarantee you&#39;ll never use a diaper (or never a disposable diaper) or that children will potty train early - and anything before 2yrs is early! It&#39;s actually not uncommon for EC kids to be able to use the potty early, but want to be in diapers when they get to that super-mobile stage between 2 and 4 - it&#39;s just so much easier for them to forget the whole business for awhile, while the whole rest of the world is so much more exciting. <br/>\n<br/>\nJust like any good set of principles (unschooling principles, NVC principles, pick your favorites) the biggest catch is that it&#39;s easy to get stuck using those principles as rules. The important part about EC is the &quot;communication&quot; part - and communication begins with looking and listening and striving to see things from another person&#39;s perspective. Parents often forget that and try to get Kids to do the looking, listening and striving rather than doing those things themselves. <br/>\n<br/>\nKids grow so fast - mine are 11 and 19, so potty issues are long past in my home. But communication is something we still work on. I still remind myself to slow down and listen to what my kids have to say, sometimes, rather than jumping right into what I want. I still remind myself to step back when I&#39;m frustrated and really look at them, what they&#39;re trying to tell me with their words and actions, and not jump to conclusions based in my own needs and baggage. How you communicate with your kids over toileting issues isn&#39;t practice for communication later, it&#39;s part of your relationship with your kids now - a relationship which will grow and change based on the choices you make.  <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":487208120,"authorName":"Katerina Koleva","from":"Katerina Koleva &lt;katerina.kolevablisss@...&gt;","profile":"jkaterina","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: potty training","postDate":"1355492753","msgId":49326,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBSjJIanpBUHJ1ZlVhd2JGcz1NWW1ZMnpORVIydFd2Q0Q3Q1lobVdEMU9HZlNKSDVDZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGthZTIxZittcjduQGVHcm91cHMuY29tPg==","referencesHeader":"PENBS2hkYncrZjFDU0VfVU1GVjM5UWFKUnJ3NGJtN0N1eStZLWN4WXlzPXRKUTdaUm00d0BtYWlsLmdtYWlsLmNvbT4JPGthZTIxZittcjduQGVHcm91cHMuY29tPg=="},"prevInTopic":49325,"nextInTopic":49327,"prevInTime":49325,"nextInTime":49327,"topicId":49318,"numMessagesInTopic":0,"msgSnippet":"I learned about Elimination Communication when my older child was one. Practiced it part-time and by 18 months he was out of nappies. When I say practiced it I","messageBody":"<div id=\"ygrps-yiv-1805481376\">I learned about Elimination Communication when my older child was<br/>\none. Practiced it part-time and by 18 months he was out of nappies. When I<br/>\nsay practiced it I mean I left him with cotton underwear or without<br/>\nanything for a few hours a day so he can get aware of his bodily functions,<br/>\nsee the wet pool on the floor etc.<br/>\nAccording to EC kids learn that they need to pee and soil in the nappies<br/>\nfirst and then we try to teach/train them about the toilet afterwords.<br/>\n<br/>\n<br/>\n<br/>\n2012/12/14 Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; I would just let them sit on the potty and read a book to them at first<br/>\n&gt; so<br/>\n&gt; &gt; they would eventually pee<br/>\n&gt;<br/>\n&gt; A potty seat in front of the tv can help work too - but it totally depends<br/>\n&gt; on having a child who&#39;s willing to sit (bare bottomed) on the potty seat<br/>\n&gt; for that long. When Mo was a toddler, I called her &quot;my 90mph kid&quot; - she was<br/>\n&gt; on the go any time she wasn&#39;t asleep. I didn&#39;t get much of anything done<br/>\n&gt; for a couple years.<br/>\n&gt;<br/>\n&gt; &gt; I have a completely different experience with potty training children.<br/>\n&gt;<br/>\n&gt; Unschooling isn&#39;t really about training children. It begins with the<br/>\n&gt; premise that learning is natural and individual; that people, even<br/>\n&gt; children, learn what&#39;s important and interesting to them when they are<br/>\n&gt; ready to do so. With children &quot;ready&quot; is tied in part to biology and in<br/>\n&gt; part to temperament - not just for toileting but for any kind of learning.<br/>\n&gt; That&#39;s why it&#39;s really important for parents to know that it&#39;s Okay if a<br/>\n&gt; child Isn&#39;t toileting independently by a particular age. It&#39;s not the fault<br/>\n&gt; of the mom for failing to &quot;do it right&quot; - kids grow and develop differently<br/>\n&gt; and can have very different needs.<br/>\n&gt;<br/>\n&gt; &gt;I would make a very big deal out it as a<br/>\n&gt; &gt; great accomplishment<br/>\n&gt;<br/>\n&gt; Reward systems are sometimes helpful for a short time If your goal is to<br/>\n&gt; teach a person something specific. Unfortunately, unless a person is asking<br/>\n&gt; specifically to be taught, teaching gets in the way of learning. If your<br/>\n&gt; goal is to support the people you love as they explore the world, lessons<br/>\n&gt; and rewards won&#39;t help.<br/>\n&gt;<br/>\n&gt; &gt;&gt;It was a very normal age to do it at<br/>\n&gt; &gt; the time but I found it a very easy age.<br/>\n&gt;<br/>\n&gt; For some it will be - some kids actually do learn to use the toilet mostly<br/>\n&gt; independently by 2. But there&#39;s no need to make that a goal unless you plan<br/>\n&gt; to put your kids in day care or preschool - and even then there will be<br/>\n&gt; some natural &quot;failures&quot; because some kids won&#39;t be ready for a few more<br/>\n&gt; years.<br/>\n&gt;<br/>\n&gt; ---Meredith<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: potty training","postDate":"1355451247","msgId":49325,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGthZTIxZittcjduQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBS2hkYncrZjFDU0VfVU1GVjM5UWFKUnJ3NGJtN0N1eStZLWN4WXlzPXRKUTdaUm00d0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49322,"nextInTopic":49326,"prevInTime":49324,"nextInTime":49326,"topicId":49318,"numMessagesInTopic":0,"msgSnippet":"... A potty seat in front of the tv can help work too - but it totally depends on having a child who s willing to sit (bare bottomed) on the potty seat for","messageBody":"<div id=\"ygrps-yiv-1038730435\"><blockquote><span title=\"ireply\">&gt; I would just let them sit on the potty and read a book to them at first so<br/>\n&gt; they would eventually pee<br/>\n<br/>\n </span></blockquote>A potty seat in front of the tv can help work too - but it totally depends on having a child who&#39;s willing to sit (bare bottomed) on the potty seat for that long. When Mo was a toddler, I called her &quot;my 90mph kid&quot; - she was on the go any time she wasn&#39;t asleep. I didn&#39;t get much of anything done for a couple years. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have a completely different experience with potty training children.<br/>\n<br/>\n </span></blockquote>Unschooling isn&#39;t really about training children. It begins with the premise that learning is natural and individual; that people, even children, learn what&#39;s important and interesting to them when they are ready to do so. With children &quot;ready&quot; is tied in part to biology and in part to temperament - not just for toileting but for any kind of learning. That&#39;s why it&#39;s really important for parents to know that it&#39;s Okay if a child Isn&#39;t toileting independently by a particular age. It&#39;s not the fault of the mom for failing to &quot;do it right&quot; - kids grow and develop differently and can have very different needs. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I would make a very big deal out it as a<br/>\n&gt; great accomplishment<br/>\n<br/>\n </span></blockquote>Reward systems are sometimes helpful for a short time If your goal is to teach a person something specific. Unfortunately, unless a person is asking specifically to be taught, teaching gets in the way of learning. If your goal is to support the people you love as they explore the world, lessons and rewards won&#39;t help. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;It was  a very normal age to do it at<br/>\n&gt; the time but I found it a very easy age.<br/>\n<br/>\n </span></blockquote>For some it will be - some kids actually do learn to use the toilet mostly independently by 2. But there&#39;s no need to make that a goal unless you plan to put your kids in day care or preschool - and even then there will be some natural &quot;failures&quot; because some kids won&#39;t be ready for a few more years. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":235156828,"authorName":"Claire Mesa","from":"Claire Mesa &lt;roselady4@...&gt;","profile":"cmesa4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: potty training","postDate":"1355426375","msgId":49322,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBS2hkYncrZjFDU0VfVU1GVjM5UWFKUnJ3NGJtN0N1eStZLWN4WXlzPXRKUTdaUm00d0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGthZDg3YitwbmEwQGVHcm91cHMuY29tPg==","referencesHeader":"PDEzNTUzOTE2ODYuODk4MTEuYW5kcm9pZE1vYmlsZUB3ZWIxNjQ5MDQubWFpbC5iZjEueWFob28uY29tPiA8a2FkODdiK3BuYTBAZUdyb3Vwcy5jb20+"},"prevInTopic":49321,"nextInTopic":49325,"prevInTime":49321,"nextInTime":49323,"topicId":49318,"numMessagesInTopic":0,"msgSnippet":"I have a completely different experience with potty training children. I have 4 boys and all of them except the youngest were potty trained by 18 months and","messageBody":"<div id=\"ygrps-yiv-1785808862\">I have a completely different experience with potty training children. I<br/>\nhave 4 boys and all of them except the youngest were potty trained by 18<br/>\nmonths and the youngest was potty trained a little bit after 2 and he was<br/>\nonly a bit more challenging because he went to preschool and I was working.<br/>\nI also took care of other people&#39;s children and I still do and back when my<br/>\nchildren were young like that I had great success with potty training by<br/>\nabout 18 months except when the parents didn&#39;t get involved. None of them<br/>\nwere ever not ready or not excited to do it. At that age I found that they<br/>\nwere always happy and proud to do anything they were capable of that was<br/>\nmore grown-up. It is important for them to see mommy and daddy go to the<br/>\nbathroom and other siblings if possible really helps. I didn&#39;t even have to<br/>\npotty train my 3rd son he saw my 2nd son get on the toilet with a special<br/>\nseat on it and just copied him, he never used a regular potty like I would<br/>\nusually start with. I never used pull ups, just regular training pants,<br/>\nunderwear, as little clothing as possible at first--in fact no pants around<br/>\nthe house worked best at first.<br/>\n<br/>\nI would just let them sit on the potty and read a book to them at first so<br/>\nthey would eventually pee and then I would make a very big deal out it as a<br/>\ngreat accomplishment, there was never anything wrong said about mistakes.<br/>\nFor a couple of them I gave something like a couple M&Ms each time too.<br/>\nThey learned real quick and they were happy to learn it, it was not any<br/>\nkind of pushing a child not ready. It was  a very normal age to do it at<br/>\nthe time but I found it a very easy age.<br/>\n<br/>\nI also found the trick to not peeing at night is not to put a diaper on<br/>\nvery early in the game and just put something there to protect the bed. I<br/>\nwould do this as soon as the child knew how to use a potty and was doing it<br/>\nregularly and rarely were there pee accidents at night.<br/>\n<br/>\nI know everyone is different but my personal experience is that the younger<br/>\nbabes, mine or other people&#39;s were always happy and willing----so maybe<br/>\ngive it a try if your kids are still younger.<br/>\n<br/>\nThere are terrible people who abuse young children for not going potty and<br/>\nperhaps that&#39;s why it became encouraged to do it older, that and maybe it<br/>\nmakes more money for Pull-ups, lol.<br/>\n<br/>\n<br/>\n<br/>\nClaire<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Dec 13, 2012 at 1:53 PM, Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt;&gt; I offered beautiful panties of their choice for when they were out of<br/>\n&gt; diapers.<br/>\n&gt; ************<br/>\n&gt;<br/>\n&gt; When Mo was first moving beyond diapers we discovered she couldn&#39;t sleep<br/>\n&gt; in panties without peeing. If she slept with a bare bottom, she would be<br/>\n&gt; dry. If she wore a diaper to bed, she would pee. So somehow she could tell<br/>\n&gt; the difference between being bare and having something on her bottom -<br/>\n&gt; asleep or half asleep - but not the difference between a diaper and<br/>\n&gt; panties.<br/>\n&gt;<br/>\n&gt; ---Meredith<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nNeed last minute gifts?<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://EasyGiftsandFlowers.com\">http://EasyGiftsandFlowers.com</a><br/>\nTalking Mp3 Players!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://Talkingmp3players.com\">http://Talkingmp3players.com</a><br/>\n<br/>\n Unlimited Quality 4G Cell Service only $49 per<br/>\nmonth&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.solavei.com/roselady\">http://www.solavei.com/roselady</a>&gt;<br/>\n Works with the new Google Galaxy Nexus!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] potty training","postDate":"1355425187","msgId":49321,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUzNUEwQjFCLUU0MzMtNDA0Mi1COUM3LUM5Nzg3NEU2QkI5OEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGthZDg3YitwbmEwQGVHcm91cHMuY29tPg==","referencesHeader":"PGthZDg3YitwbmEwQGVHcm91cHMuY29tPg=="},"prevInTopic":49320,"nextInTopic":49322,"prevInTime":49320,"nextInTime":49322,"topicId":49318,"numMessagesInTopic":0,"msgSnippet":"... And Kat did the same awake. When she was learning she didn t want the diaper on. She could feel when she needed to go if her bottom was bare. I wish I d","messageBody":"<div id=\"ygrps-yiv-1181895052\">On Dec 13, 2012, at 1:53 PM, Meredith wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If she slept with a bare bottom, she would be dry.<br/>\n<br/>\n </span></blockquote>And Kat did the same awake. When she was learning she didn&#39;t want the diaper on. She could feel when she needed to go if her bottom was bare.<br/>\n<br/>\nI wish I&#39;d known about Elimination Communication when she was born. Diapers probably get in the way of a lot of kids figuring out the toilet.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: potty training","postDate":"1355424811","msgId":49320,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGthZDg3YitwbmEwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNTUzOTE2ODYuODk4MTEuYW5kcm9pZE1vYmlsZUB3ZWIxNjQ5MDQubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":49319,"nextInTopic":49321,"prevInTime":49319,"nextInTime":49321,"topicId":49318,"numMessagesInTopic":0,"msgSnippet":"... ************ When Mo was first moving beyond diapers we discovered she couldn t sleep in panties without peeing. If she slept with a bare bottom, she would","messageBody":"<div id=\"ygrps-yiv-500311977\"><blockquote><span title=\"ireply\">&gt;&gt; I offered beautiful panties of their choice for when they were out of diapers.<br/>\n </span></blockquote>************<br/>\n<br/>\nWhen Mo was first moving beyond diapers we discovered she couldn&#39;t sleep in panties without peeing. If she slept with a bare bottom, she would be dry. If she wore a diaper to bed, she would pee. So somehow she could tell the difference between being bare and having something on her bottom - asleep or half asleep - but not the difference between a diaper and panties. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":179855323,"authorName":"bkind28","from":"&quot;bkind28&quot; &lt;bkind28@...&gt;","profile":"bkind28","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: potty training","postDate":"1355424214","msgId":49319,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGthZDdrbStkZjA5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNTUzOTE2ODYuODk4MTEuYW5kcm9pZE1vYmlsZUB3ZWIxNjQ5MDQubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":49318,"nextInTopic":49320,"prevInTime":49318,"nextInTime":49320,"topicId":49318,"numMessagesInTopic":0,"msgSnippet":"My son would go potty at daycare but not for me. I never pushed it. Just after 3 he told me in Dillard s he had to potty, I ran like a lunitic with him under","messageBody":"<div id=\"ygrps-yiv-1507082379\">My son would go potty at daycare but not for me. I never pushed it. Just after 3 he told me in Dillard&#39;s he had to potty, I ran like a lunitic with him under my arm like a football. He had accidents until at least 6 though because he never liked to stop playing. The doctor told my mom 35 years ago that you don&#39;t train a child, they train you.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; <br/>\n&gt; Sent from Yahoo! Mail on Android<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":278539714,"authorName":"stefanie stringfellow","from":"stefanie stringfellow &lt;bellumswife77@...&gt;","profile":"chikashanumpa","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"1"},"subject":"Re: potty training","postDate":"1355391686","msgId":49318,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTUzOTE2ODYuODk4MTEuYW5kcm9pZE1vYmlsZUB3ZWIxNjQ5MDQubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":49319,"prevInTime":49317,"nextInTime":49319,"topicId":49318,"numMessagesInTopic":0,"msgSnippet":"I am American Indian and have noticed in many tribal communities that children aren t potty trained . In Alaska 3-6 years is common. And its not a big deal.","messageBody":"<div id=\"ygrps-yiv-332855306\">I am American Indian and have noticed in many tribal communities that children aren&#39;t &quot;potty trained&quot;. In Alaska 3-6 years is common. And its not a big deal. Children go themselves. Personally I think potty training is parent training. <br/>\n<br/>\nI encourage my three year old to go potty. I guess it&#39;s bribery but I keep m&m&#39;s on hand and he and anyone who gets him to sit on the potty gets some. That&#39;s about it. He now often poops and pees on the potty, but not always. It really isn&#39;t a big deal. He chooses to go or not go. It&#39;s not a big deal. He&#39;s my youngest.<br/>\n<br/>\nMy four year old daughter is adopted and has some attachment difficulty. She isn&#39;t potty dry. My other boys trained at 4,4 and 5.<br/>\nMy girls stopped wearing diapers at 2 and 3 years. I offered beautiful panties of their choice for when they were out of diapers.<br/>\n<br/>\nBlessings,<br/>\nStefanie in AK<br/>\nMom to 7<br/>\n<br/>\n<br/>\nSent from Yahoo! Mail on Android<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":49305,"nextTopicId":49307}}