{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":138085708,"authorName":"earthmothergypsy","from":"&quot;earthmothergypsy&quot; &lt;earthmothergypsy@...&gt;","profile":"earthmothergypsy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling and large families(long)","postDate":"1091723610","msgId":2546,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNldG5ncStrZDVkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNldGY4Nys4ZWFqQGVHcm91cHMuY29tPg=="},"prevInTopic":2542,"nextInTopic":0,"prevInTime":2545,"nextInTime":2547,"topicId":2477,"numMessagesInTopic":0,"msgSnippet":"... such an effect on how happy or upset he was. My kids are the same way.  :) The *way* something is done or handled can make all the difference in the","messageBody":"<div id=\"ygrps-yiv-323331826\">aj wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;but it never occured to him that the _way_ you did it could have <br/>\n </span></blockquote>such an effect on how happy or upset he was.&gt;<br/>\n<br/>\nMy kids are the same way.  :)  <br/>\nThe *way* something is done or handled can make all the difference in <br/>\nthe world.  It can create a good outcome or a bad one.  So our <br/>\nfamilies had a crash course in how to do things in a way that didn&#39;t <br/>\ncause an &quot;explosive/uncooperative&quot; reaction in the kids.  <br/>\n<br/>\n~A</div>","specialLinks":[]},{"userId":78615010,"authorName":"mamaaj2000","from":"&quot;mamaaj2000&quot; &lt;mamaaj2000@...&gt;","profile":"mamaaj2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling and large families(long)","postDate":"1091715143","msgId":2542,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNldGY4Nys4ZWFqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDkuMmZlNzIwOTkuMmU0MzhiYWJAYW9sLmNvbT4="},"prevInTopic":2540,"nextInTopic":2546,"prevInTime":2541,"nextInTime":2543,"topicId":2477,"numMessagesInTopic":0,"msgSnippet":"... know (not ... respect for  their ... realize  they ... our  house. This was a big issue with a (former) neighbor, who s 9. He has very controling parents","messageBody":"<div id=\"ygrps-yiv-209541486\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Tuckervill@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; For some reason it is a really hard idea to grasp for the kids I <br/>\n </span></blockquote>know (not  <br/>\n<blockquote><span title=\"ireply\"> &gt; my kids).  I guess mostly because they&#39;re not raised to have <br/>\n </span></blockquote>respect for  their <br/>\n<blockquote><span title=\"ireply\"> &gt; bodies.  I have seen the idea light up in some kids when they <br/>\n </span></blockquote>realize  they <br/>\n<blockquote><span title=\"ireply\"> &gt; can stop people from touching *them*, too, at least when they&#39;re at <br/>\n </span></blockquote>our  house. <br/>\n<br/>\nThis was a big issue with a (former) neighbor, who&#39;s 9. He has very <br/>\ncontroling parents and he assumed that he could do things to my kids. <br/>\nNot mean things, but if I said it was time to go, he&#39;d try to carry <br/>\none of the kids to the door. Or strap Mikey in his car seat. But <br/>\nMikey is really sensitive to having people touch him sometimes. The <br/>\nneighbor learned to ask &quot;Can I strap you in now?&quot; etc. I mean, Mikey <br/>\nwas going to get strapped in, but it never occured to him that the <br/>\n_way_ you did it could have such an effect on how happy or upset <br/>\nMikey was. And that it mattered!<br/>\n<br/>\nThen they moved. After only 2 weeks away, he came by and drove both <br/>\nkids nuts trying to control them. <br/>\n<br/>\nOther kids like to pick Caroline up and put her in the wagon or <br/>\nsomething and look at me when she fusses. &quot;Well, if she says no, put <br/>\nher down.&quot; Confusion, but then, yeh, the light comes on. <br/>\n<br/>\n--aj, &quot;corrupting&quot; one neighbor child at a time, heh, heh, heh</div>","specialLinks":[]},{"userId":96795689,"authorName":"Tuckervill@aol.com","from":"Tuckervill@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: unschooling and large families(long)","postDate":"1091711403","msgId":2540,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkuMmZlNzIwOTkuMmU0MzhiYWJAYW9sLmNvbT4="},"prevInTopic":2527,"nextInTopic":2542,"prevInTime":2539,"nextInTime":2541,"topicId":2477,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/4/2004 5:06:38 PM Central Standard Time, scubamama@earthlink.net writes: This is  one of my hot buttons, because I WAS the child, and I","messageBody":"<div id=\"ygrps-yiv-817553683\">In a message dated 8/4/2004 5:06:38 PM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:scubamama@...\">scubamama@...</a> writes:<br/>\n<br/>\nThis is  one of my hot buttons, because I WAS the child, and I had no <br/>\nadvocate. I  do speak up for the child to be heard. I don&#39;t believe <br/>\nthat anyone has a  right to do anything to anyone that they don&#39;t want <br/>\ndone to them. My son  knows I feel this way, sometimes he does <br/>\ncontinue. So, I try to empower  the other child to see that they can <br/>\nchoose to use their words to tell my  son to stop, they can leave, <br/>\nthey can ask their parent or other adult for  help<br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nThis is one of the few principles we use that readily boils down to a  rule.  <br/>\nI rarely have to enforce it with my own children, but when there are  lots of <br/>\nkids here I usually have to reiterate.  We usually say something  like, &quot;No <br/>\nmeans no.  If someone wants you to stop doing something to them,  you stop.  <br/>\nAnyone has the right to say &quot;no&quot; about their body.&quot;<br/>\n <br/>\nThere are so many implications and applications to this principle.   From an <br/>\nunwanted kiss on the cheek (all of my son have been known to want to  plant <br/>\nkisses on their friends without consent) to molestation to outright  bullying.  <br/>\nLearning to follow the principle, and applying it  to your own body, can put a <br/>\nstop to all of them.  I think it&#39;s my  responsibility for my sons to learn <br/>\nthat &#39;no means no&#39;.  <br/>\n <br/>\nFor some reason it is a really hard idea to grasp for the kids I know (not  <br/>\nmy kids).  I guess mostly because they&#39;re not raised to have respect for  their <br/>\nbodies.  I have seen the idea light up in some kids when they realize  they <br/>\ncan stop people from touching *them*, too, at least when they&#39;re at our  house. <br/>\n <br/>\n <br/>\nKaren<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":140240070,"authorName":"eriksmama2001","from":"&quot;eriksmama2001&quot; &lt;scubamama@...&gt;","profile":"eriksmama2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling and large families(long)","postDate":"1091657084","msgId":2527,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNlcm1ocytrMXByQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEwNC40Y2U5NDc3YS4yZTQxNDMxNEBhb2wuY29tPg=="},"prevInTopic":2477,"nextInTopic":2540,"prevInTime":2526,"nextInTime":2528,"topicId":2477,"numMessagesInTopic":0,"msgSnippet":"If other kids don t like it I try to stop my son with this information. I don t want him to do things to other people that they do not want done to them. I","messageBody":"<div id=\"ygrps-yiv-1580032334\">If other kids &quot;don&#39;t like it&quot; I try to stop my son with this <br/>\ninformation. I don&#39;t want him to do things to other people that they <br/>\ndo not want done to them. I explain that the other person is <br/>\nintimidated and feels threatened (assuming the child has conveyed a <br/>\ndesire for the behavior to stop). I give my son the cues to look for  <br/>\nsuch as the child is running away and screaming stop, or crying, etc. <br/>\nI do not hover, nor do I &quot;let him go&quot; without information any more <br/>\nthan I would if we were in a place where physical things could be <br/>\ndamaged. I think that it is damaging to a child to have no one <br/>\nadvocate for them when they clearly are wanting something to stop. I <br/>\nbelieve that I am complicit in the damage if I do not dissent. Just <br/>\nas when a child is crying for a parent to stop doing something to <br/>\nthem, I try to empathize with the child. <br/>\n<br/>\nThis is one of my hot buttons, because I WAS the child, and I had no <br/>\nadvocate. I do speak up for the child to be heard. I don&#39;t believe <br/>\nthat anyone has a right to do anything to anyone that they don&#39;t want <br/>\ndone to them. My son knows I feel this way, sometimes he does <br/>\ncontinue. So, I try to empower the other child to see that they can <br/>\nchoose to use their words to tell my son to stop, they can leave, <br/>\nthey can ask their parent or other adult for help. <br/>\n<br/>\nSimilarly, I empower my son to use his words to ask someone to stop <br/>\ndoing something to him that he doesn&#39;t want done. He knows he can <br/>\ntell me to stop. I do. His body is his to control. But I do give him <br/>\nmy opinion, and strongly when he is doing something to someone <br/>\nagainst their will. If it is physically hurtful, I remove him. I can <br/>\nnot remember when this may have happened last, before he understood <br/>\nthat some of his behavior could inflict pain probably. I don&#39;t know <br/>\nthat there is any benefit to giving my opinion strongly, perhaps even <br/>\na disadvantage, but I am emphatic about people&#39;s rights to their body.<br/>\nGiving him information is the key. He can&#39;t read minds and we are all <br/>\nslower at picking up social cues when we are busy, hungary or tired.<br/>\n<br/>\nWe do discuss taking turns and sharing before going to places that <br/>\nthis is likely to be an issue. We discuss that it is hard to take <br/>\nturns and find fun things to do when we are tired or hungary. We have <br/>\ndiscussed this phenomena so many times that now when he has a hard <br/>\ntime taking a turn or waiting for a turn and I mention that I see <br/>\nthat it is hard to take turns, he says &quot;I&#39;m hungary&quot; and he dis-<br/>\nengages and comes for something to eat. Then he is more patient, just <br/>\nas I am when I am not tired or hungary myself. We never use any type <br/>\nof punishment. I do explain though that people do not want to play if <br/>\nthey can&#39;t have a turn. We wants to play. He is learning to enjoy <br/>\nwatching someone else take a turn. It is a progression I want to <br/>\nfacilitate and not let him flounder alone.<br/>\n<br/>\nPat<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Mattamandab@a... wrote:<br/>\n&gt; I&#39;ve been thinking about a recent comment and this thread.<br/>\n&gt; Unschoolers may not tend to &quot;ignore&quot; their children&#39;s behavior at <br/>\nthe park <br/>\n&gt; more than other hsers- but maybe they have come to unschooling <br/>\nbecause their <br/>\n&gt; children are very active, spirited, whatever you want to call it, <br/>\nso unschooling <br/>\n&gt; is what works best with their children and their learning styles.  <br/>\n(kind of <br/>\n&gt; like what came first the chicken or the egg?)<br/>\n&gt; <br/>\n&gt; My son (age 4) is very &quot;spirited&quot; I&#39;d call him, and did not play <br/>\nwell with <br/>\n&gt; many of the other kids we used to play with.  When he was about 2 <br/>\n1/2 we stopped <br/>\n&gt; going to planned activities and play groups and tried just playing <br/>\nat home, <br/>\n&gt; and interacting with other children in limited setting like <br/>\nplaygrounds and the <br/>\n&gt; library.  As he&#39;s gotten older, we&#39;ve been able to attend more <br/>\nplaygroup type <br/>\n&gt; activities and playground days.<br/>\n&gt; <br/>\n&gt; He&#39;s still very active and loud, sometimes other children are put <br/>\noff by his <br/>\n&gt; behavior (growling and roaring at them in play).  Some days we have <br/>\nto leave, <br/>\n&gt; not very often anymore.   But I give him a wide latitude about what <br/>\nbehaviors <br/>\n&gt; are ok, and which I need to stop immediately.  Many other parents <br/>\nwould not <br/>\n&gt; let their kids do some of the things he does at the park (for <br/>\nexample- roar and <br/>\n&gt; play dinosaur while playing chase, other kids don&#39;t always like <br/>\nit), but if we <br/>\n&gt; left everytime he did that, he would never get out of the house.  <br/>\n&gt; <br/>\n&gt; If no one is getting hurt or in danger, I try to let him go.  I <br/>\nthink all <br/>\n&gt; kids need to learn to play without their parent&#39;s hovering over <br/>\nthem.  When he <br/>\n&gt; was 2 (he&#39;s very big for his age) and would push kids down or run <br/>\ninto them, I <br/>\n&gt; did have to stand right over him when he was near other kids (so <br/>\nmuch for <br/>\n&gt; parent&#39;s getting to interact with adults, huh?).  But now he <br/>\ndoesn&#39;t need that so I <br/>\n&gt; can step back a bit.  Obviously if things start to get too rough, I <br/>\ndo <br/>\n&gt; intervene.<br/>\n&gt; <br/>\n&gt; Also, he&#39;s getting much better and needs the practice of <br/>\ninteractions.  He&#39;s <br/>\n&gt; started to talk to other kids alot more during play, and realize <br/>\nwhen people <br/>\n&gt; don&#39;t want to play with him because of how he&#39;s acted.  It&#39;s nice <br/>\nto see him <br/>\n&gt; begin to make friends and be able to go to a playground and play <br/>\nnicely with <br/>\n&gt; kids he&#39;s just met.<br/>\n&gt; <br/>\n&gt; I also have a daughter age 1 who he plays with very well.  We may <br/>\nor may not <br/>\n&gt; have any more children.  It depends on how things go in the next <br/>\nyear or so.  <br/>\n&gt; Right now my hands are full with these 2.  But I can&#39;t imagine <br/>\ntrying to <br/>\n&gt; &quot;teach&quot; my children like school at home.  I used to be a special ed <br/>\nteacher.  <br/>\n&gt; Unschooling sounds the way to go!<br/>\n&gt; Just my (well more than) 2 cents.<br/>\n&gt; Amanda<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":166215589,"authorName":"Mattamandab@aol.com","from":"Mattamandab@...","profile":"amandabokus","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling and large families(long)","postDate":"1091561748","msgId":2477,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwNC40Y2U5NDc3YS4yZTQxNDMxNEBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":2527,"prevInTime":2476,"nextInTime":2478,"topicId":2477,"numMessagesInTopic":0,"msgSnippet":"I ve been thinking about a recent comment and this thread. Unschoolers may not tend to ignore their children s behavior at the park more than other hsers-","messageBody":"<div id=\"ygrps-yiv-132807837\">I&#39;ve been thinking about a recent comment and this thread.<br/>\nUnschoolers may not tend to &quot;ignore&quot; their children&#39;s behavior at the park <br/>\nmore than other hsers- but maybe they have come to unschooling because their <br/>\nchildren are very active, spirited, whatever you want to call it, so unschooling <br/>\nis what works best with their children and their learning styles.  (kind of <br/>\nlike what came first the chicken or the egg?)<br/>\n<br/>\nMy son (age 4) is very &quot;spirited&quot; I&#39;d call him, and did not play well with <br/>\nmany of the other kids we used to play with.  When he was about 2 1/2 we stopped <br/>\ngoing to planned activities and play groups and tried just playing at home, <br/>\nand interacting with other children in limited setting like playgrounds and the <br/>\nlibrary.  As he&#39;s gotten older, we&#39;ve been able to attend more playgroup type <br/>\nactivities and playground days.<br/>\n<br/>\nHe&#39;s still very active and loud, sometimes other children are put off by his <br/>\nbehavior (growling and roaring at them in play).  Some days we have to leave, <br/>\nnot very often anymore.   But I give him a wide latitude about what behaviors <br/>\nare ok, and which I need to stop immediately.  Many other parents would not <br/>\nlet their kids do some of the things he does at the park (for example- roar and <br/>\nplay dinosaur while playing chase, other kids don&#39;t always like it), but if we <br/>\nleft everytime he did that, he would never get out of the house.  <br/>\n<br/>\nIf no one is getting hurt or in danger, I try to let him go.  I think all <br/>\nkids need to learn to play without their parent&#39;s hovering over them.  When he <br/>\nwas 2 (he&#39;s very big for his age) and would push kids down or run into them, I <br/>\ndid have to stand right over him when he was near other kids (so much for <br/>\nparent&#39;s getting to interact with adults, huh?).  But now he doesn&#39;t need that so I <br/>\ncan step back a bit.  Obviously if things start to get too rough, I do <br/>\nintervene.<br/>\n<br/>\nAlso, he&#39;s getting much better and needs the practice of interactions.  He&#39;s <br/>\nstarted to talk to other kids alot more during play, and realize when people <br/>\ndon&#39;t want to play with him because of how he&#39;s acted.  It&#39;s nice to see him <br/>\nbegin to make friends and be able to go to a playground and play nicely with <br/>\nkids he&#39;s just met.<br/>\n<br/>\nI also have a daughter age 1 who he plays with very well.  We may or may not <br/>\nhave any more children.  It depends on how things go in the next year or so.  <br/>\nRight now my hands are full with these 2.  But I can&#39;t imagine trying to <br/>\n&quot;teach&quot; my children like school at home.  I used to be a special ed teacher.  <br/>\nUnschooling sounds the way to go!<br/>\nJust my (well more than) 2 cents.<br/>\nAmanda<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":2538,"nextTopicId":2553}}