{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":281007366,"authorName":"Leslie Kowalski","from":"Leslie Kowalski &lt;lrkowalski@...&gt;","profile":"lkowalsk","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"another new member intro","postDate":"1174143975","msgId":22301,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlCNjA4QzI2LTg2MjUtNDlEMi05RDEzLUMxRDE0QTlGOTIzREB2ZXJpem9uLm5ldD4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":22300,"nextInTime":22302,"topicId":22301,"numMessagesInTopic":0,"msgSnippet":"Hi there, I joined the list a few weeks ago (Hi Katharine!) and I ve been soaking it all in (as well as Rue Kream s book - wow, it s great!). I m Leslie, and I","messageBody":"<div id=\"ygrps-yiv-1675483003\">Hi there,<br/>\n<br/>\nI joined the list a few weeks ago (Hi Katharine!) and I&#39;ve been  <br/>\nsoaking it all in (as well as Rue Kream&#39;s book - wow, it&#39;s great!).<br/>\n<br/>\nI&#39;m Leslie, and I have 2 daughters - Tess (7) and Paige (4), and a dh  <br/>\n(Tim).  We live in Central NJ.  We became interested in HSing when  <br/>\nTess was a toddler, but I found it very, very hard to make the jump  <br/>\nto it.  I was terrified (of all the typical stuff new HSers are  <br/>\nscared of), but intrigued.  I was especially worried about other&#39;s  <br/>\nopinions of me (which I still struggle with, but years of extended  <br/>\nbreastfeeding, family bed, attachment parenting, and now HSing has  <br/>\nhelped me to get over that for the most part!).<br/>\n<br/>\nTess started school at an early 5 years old (Kindergarten) at our  <br/>\nlocal public school (one of the &quot;best&quot; school systems in NJ, and we  <br/>\nmoved to the town for it - LOL) and all was well for awhile (except  <br/>\nfor that pesky feeling that what I really wanted to do was HS!).   <br/>\nAbout 2 months in, she melted down, and became hysterical every day.   <br/>\nWe were so stressed out, that we really could not see clearly, and I  <br/>\nam so sad to say that we kept her going to school - thinking that she  <br/>\nwould &quot;turn the corner&quot; (and being told that by the teacher and  <br/>\nprincipal over and over).  Anyway, we finally came to our senses and  <br/>\ntook her out of school over the winter break.  Within a few months of  <br/>\nthat we could see that the &quot;nervous habits&quot; (and big anxieties) that  <br/>\nshe had always had (since about 3 years old) were actually tics (or  <br/>\nanxieties from feeling them).  They became worse and worse, and we  <br/>\nrealized that she has Tourette&#39;s Syndrome (TS).  It&#39;s interesting  <br/>\nthat we couldn&#39;t see it earlier given our backgrounds (both my  <br/>\nhusband and I have PhD&#39;s in biochemistry, with emphasis on  <br/>\nneuroscience, and I have tics in my family (including a distant  <br/>\ncousin with TS), as well as having tics myself (which I didn&#39;t  <br/>\nrealize were tics until we realize Tess had TS)).  It&#39;s a good  <br/>\nexample of how it is sometimes hard to see your own life clearly.<br/>\n<br/>\nFor HSing, I&#39;ve been doing a mixture of structured (mostly Waldorf  <br/>\nstuff) and unstructured learning.  All the time, though, I&#39;ve been  <br/>\nreading about unschooling, which calls to my heart, but not being  <br/>\ntotally able to make what I often called a &quot;leap of faith&quot; (which I  <br/>\nthink less and less now).  Knowing Katharine (who&#39;s been very patient  <br/>\nwith me!), reading a bunch of great unschooling books, and joining  <br/>\nthis group have all helped me to move along in this journey.  I&#39;ve  <br/>\nrealized that Tess has does not have a full sense of control of her  <br/>\nbody and feelings (through her tics, major anxieties, etc).  Because  <br/>\nof this, I&#39;ve seen her as always seeking control, which I have  <br/>\nreacted to pretty negatively.  Over time, I lost a lot of my  <br/>\nattachment parenting skills, and become more micromanaging, nit- <br/>\npicky, etc.  I think I was trying to make her what she had been  <br/>\nbefore the TS started.  Paige has started to show a lot of anxieties,  <br/>\nand some tic-like behavior, over the past few months (similar timing  <br/>\nto Tess).  This has sent me for a loop, and set my parenting back  <br/>\nanother notch (I would say the same for my dh).  We are starting to  <br/>\ncome out of it now.  What we didn&#39;t realize until very recently is  <br/>\nhow much we&#39;ve turned to seeking control (which is all that was  <br/>\nmodeled for us by both of our parents), rather than on joy.  We are  <br/>\nbecoming more unschool-ish as time goes on, and I&#39;m trying to focus  <br/>\non joy more and more.<br/>\n<br/>\nI&#39;m sure I&#39;ll have lots of questions as time goes on (I do have one  <br/>\nthat I will post separately).  Looking forward to learning more and  <br/>\nmore!  I&#39;m also hoping to go to the conference in September!<br/>\n<br/>\nLeslie</div>","specialLinks":[]}],"prevTopicId":22123,"nextTopicId":22253}}