{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":313036834,"authorName":"strawlis","from":"&quot;strawlis&quot; &lt;lisberning@...&gt;","profile":"strawlis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: moving...or not?","postDate":"1262887727","msgId":42806,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhpNTd2Zis2N2ZzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhpMXRoZitnNXJoQGVHcm91cHMuY29tPg=="},"prevInTopic":42795,"nextInTopic":0,"prevInTime":42805,"nextInTime":42807,"topicId":42792,"numMessagesInTopic":0,"msgSnippet":"...  , Elli  ... Moving is big! and I agree with Alex that you should as a family openly discuss","messageBody":"<div id=\"ygrps-yiv-1643359797\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt; , &quot;Elli&quot; &lt;elinorsparks@...&gt;<br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; So, anyway.  Thoughts?  Observations?<br/>\n<br/>\n </span></blockquote>Moving is big! and I agree with Alex that you should as a family openly<br/>\ndiscuss all the the reason for and against and how each of you  would be<br/>\naffected...we just moved across the country from Williamsburg,VA to  CA<br/>\n(near Sacremento) and there have been lots of tears...In our case DH was<br/>\noffered a job and after being unemployed for several months he was very<br/>\neager to take the offer......we chose to go with him, cause as a family<br/>\nwe agreed that being together was the most important..(other options<br/>\nwere considered)   even though it meant leaving so much that we had<br/>\ngrown to love, pets, a home and most importantly for my 11yr old dd,<br/>\ngreat friends. (who btw just happen to live in Richmond VA =D)<br/>\n<br/>\nAs it turns out the job did not work out and we are now working on<br/>\nheading back...but what I want to share is this...through out this whole<br/>\nmove, our girls where and are totally involved in the  process and we&#39;ve<br/>\nworked with them to meet thier needs as they arise....thing<br/>\nlike...planning our route to meet up with friends for a large part of<br/>\nour journey, encouranging facebook connections, buying webcams, getting<br/>\na better texting plan..LOL...and and most importantly not stopping the<br/>\nway we live our lives...waking daily free to choose what will bring us<br/>\njoy.<br/>\n<br/>\nSounds like you have lots of options/opputunities to stay connected to<br/>\nthe Richmond Area...so talk them thru...see what her concerns<br/>\nare...sometimes it&#39;s harder for children to see possibility...and<br/>\nsometimes they really just need to be heard and to have  thier loss  be<br/>\nacknowlegded.  We have learned to really listen...and in most of the all<br/>\nthe difficult cases..the girls came up with the solution and we happily<br/>\nhelped carry them out.<br/>\n<br/>\nElisabeth mama to Liv(11) and Lex(9)<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] moving...or not?","postDate":"1262803005","msgId":42795,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwNjM0MS4xMDE1Mi5xbUB3ZWI4MTUwNS5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGhpMXRoZitnNXJoQGVHcm91cHMuY29tPg==","referencesHeader":"PGhpMXRoZitnNXJoQGVHcm91cHMuY29tPg=="},"prevInTopic":42792,"nextInTopic":42806,"prevInTime":42794,"nextInTime":42796,"topicId":42792,"numMessagesInTopic":0,"msgSnippet":"Sit down and talk your kids about how things would be and the advantages and disadvantages. If they do not want to move then... Can you buy the land, keep","messageBody":"<div id=\"ygrps-yiv-1207752132\">Sit down and talk your kids about how things would be and the advantages and disadvantages.<br/>\nIf they do not want to move then...<br/>\n<br/>\nCan you buy the land, keep commuting to work and wait to build te dream house for the next few years?<br/>\nYour kids are getting to an age where kids really want to be do things with their friends.<br/>\nTime goes fast. Soon they will be older and driving, maybe even move out.<br/>\nYour husband and you will be able to build the dream house and move out to the country then.<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":237471585,"authorName":"Elli","from":"&quot;Elli&quot; &lt;elinorsparks@...&gt;","profile":"sistergoddesselli","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"moving...or not?","postDate":"1262778735","msgId":42792,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhpMXRoZitnNXJoQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":42795,"prevInTime":42790,"nextInTime":42793,"topicId":42792,"numMessagesInTopic":0,"msgSnippet":"Hi all - Nearly one year radical unschooling, and really enJOYing it! This list is a great place for community wisdom, which is why I am coming to you with my","messageBody":"<div id=\"ygrps-yiv-291458151\">Hi all - <br/>\n<br/>\nNearly one year radical unschooling, and really enJOYing it!<br/>\n<br/>\nThis list is a great place for community wisdom, which is why I am coming to you with my latest question.<br/>\n<br/>\nI&#39;ve got a new job at a place where I&#39;ve always wanted to work, doing something I know how to do very well.  I am happy and content with my day.<br/>\n<br/>\nHubby is home with the kids now, learning how to be a radical unschooler.  He&#39;s loving that too.  With the help of Retrouvaille, our communication and personal healing is moving along deliciously.<br/>\n<br/>\nWe&#39;ve got Sophia, 12, and Peter, 9.<br/>\n<br/>\nSophia is building friendships.  Took her nearly the whole year to find a way that made sense to her to do this while being not in school.  Lots of on-line conversations, now, combined with an activity once a month or so.  She is really enjoying herself.<br/>\n<br/>\nPeter is pretty happy too.<br/>\n<br/>\nHere&#39;s the dilemma:  <br/>\n<br/>\nMy job is an hour away.  Long drive.  Some days I can work from home - maybe once a week or so.  The other days, I drive in.  We live in the city of Richmond, VA.  I&#39;ve always wanted to live in the country (which is where my job is located).  We found a beautiful piece of property - 10 acres, 1/2 woods, 1/2 pasture, a spring fed creek, part of a larger parcel that we can use for our animals if we want, horses already on the land and with owners willing to have them stay there for a while, a place to live nearby while we build the modern home that hubby is designing and has always wanted to build.  We&#39;ll get chickens, a cow, maybe a pig someday...  PERFECT!!  <br/>\n<br/>\nI love the land and so do the other members of my family.<br/>\n<br/>\nSophia, however, has expressed sadness at the thought of moving away from her friends.  Peter is a little sad about that.  Sophia is a lot sadness.<br/>\n<br/>\nThe land is 35 minutes to my work and is in a county with land prices we can afford. The land is 90 minutes to Richmond.  The county closer to Richmond is out of our budget. <br/>\n<br/>\nI plan to bring Sophia back to Richmond for the monthly dance she attends and other activities with her friends that she manifests.  My parents live in Richmond, and she and I could easily stay at their house over night while coming in town (not her first choice, I think my mom is a little intense for her).  I would need to go to Richmond several times a month for work meetings, and given that we homeschool, she could easily come with me.  I could schedule the meetings to coincide with the afterschool hours, dropping her off at a friend&#39;s house for a visit.<br/>\n<br/>\nRight now, memories of how I felt when my parents told me we were moving during my high school years are being triggered for me.  My parents talked about it twice - once during 9th grade and the second time during 11th grade.  They moved after 11th grade leaving me with friends of the family to finish out my senior year, during which time I spiraled down into my first episode of depression - nothing that hospitalized me, but certainly noticeable to others.  During 9th grade, when I thought we were going to move, I was just starting to build a romantic relationship with a friend in our group of friends.  This felt like &quot;the one&quot; to me.  And, when my parents told me we were moving, I cut things off with him.  Only to find out later we weren&#39;t moving.  I suppose I could have tried to start things up again, but I didn&#39;t, right away.  I&#39;ve always struggled with my feelings around that.  He and I dated in my senior year and into my first year of college.  Again, I broke up with him the summer after my freshman college year.  I was really getting depressed by that point, and my communication skills sorely lacked.  I found it so difficult over the years to process my feelings about that breakup.  <br/>\n<br/>\nSo, when I see my daughter shed a tear at the thought of moving or express her sadness about the idea, all of the feelings from my past experience about a family move comes up for me.  As a result, right now I simply feel numb about the idea of moving instead of excited as I originally did when we found the land two months ago.<br/>\n<br/>\nWe are planning to make an offer on the land this week and go for refinancing with cash out so we can purchase the land.  We&#39;ll put our house on the market, sell it, and then move out to a house near our land that we will rent until we complete the building process.  All of this should take about a year.  Interest rates are starting to creep up, and we&#39;d like to lock in sooner rather than later so we can get the low rates.  Ah, writing that brings up another trigger for me...we&#39;ve refinanced two other times for cash out, making our mortgage go up, and requiring my employment in order to cover that added cost when what I really wanted to be doing was staying home with the kids.  I am content with the situation now, as long as the kids can home-school and either hubby or I are with them during the day.  I am cool with hubby having a chance at that.  But, there is some baggage there too regarding who earns the income in our house...  <br/>\n<br/>\nFunny thing is, when Sophia was struggling with finding a new way to build friendships, different than the way did at school, she would tell us she wanted to move.  She would find pictures of houses all over the world, show them to us, and demand to move there.  <br/>\n<br/>\nSo, anyway.  Thoughts?  Observations?  How would you apply Radical Unschooling philosophy to this situation in order to make a commitment one way or another?<br/>\n<br/>\nThanks a bunch.  I look forward to your ideas.<br/>\n<br/>\nWarmly,<br/>\n<br/>\nElli</div>","specialLinks":[]}],"prevTopicId":42798,"nextTopicId":42746}}