{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":61290046,"authorName":"Maisha Khalfani","from":"Maisha Khalfani &lt;maitai373@...&gt;","profile":"maitai373","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fwd: [nvc-parenting] Do you want to share NVC with parents?","postDate":"1175535754","msgId":22951,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3NzY0NC43NTM4Mi5xbUB3ZWI1MjIxMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":22950,"nextInTime":22952,"topicId":22951,"numMessagesInTopic":0,"msgSnippet":"Dear parents, I am excited to tell you about the NVC Parent Peer Leadership Program (PPLP). If you have any interest in sharing NVC with parents, or if you","messageBody":"<div id=\"ygrps-yiv-222954590\">Dear parents,<br/>\n<br/>\nI am excited to tell you about the NVC Parent Peer Leadership Program <br/>\n(PPLP). If you have any interest in sharing NVC with parents, or if <br/>\nyou know parents who may be interested in this opportunity, please <br/>\nread on or pass this information to other people in your community.<br/>\n<br/>\nThe PPLP is a nine-month program aimed at nurturing and developing <br/>\nleaders who are committed to spreading NVC to parents in their <br/>\ncommunities, especially in those regions where there are no NVC <br/>\ntrainers. The pilot year of this project is nearing completion and <br/>\nhas been a tremendous success. We are celebrating the growth <br/>\nexperienced by individual participants, the deepening connection in <br/>\nmany of their families, and the fact that NVC groups for parents have <br/>\nbeen launched around the U.S. and Canada!<br/>\n<br/>\nThe PPLP is a program of the Peaceful Families, Peaceful World <br/>\nProject that I lead for the Center for Nonviolent Communication and <br/>\nBayNVC. Brief information is posted below; full details and an <br/>\napplication packet can be requested by emailing Karin at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nvcparenting@...\">nvcparenting@...</a>.<br/>\n<br/>\nI hope to meet some of you through this program!<br/>\n<br/>\nWarmly,<br/>\n<br/>\nInbal<br/>\n<br/>\n--<br/>\n<br/>\nInbal Kashtan<br/>\n<br/>\nPeaceful Families, Peaceful World, a joint project of CNVC and BayNVC<br/>\n<br/>\nParent Peer Leadership Program (PPLP) Information:<br/>\n<br/>\nThe PPLP is a nine-month program aimed at nurturing and developing <br/>\nleaders who are committed to spreading NVC to parents in their <br/>\ncommunities, especially in those regions where there are no NVC <br/>\ntrainers. Through a variety of program components, the PPLP hopes to <br/>\nprovide parent peer leaders the experience, skills and support they <br/>\nneed to successfully support other parents who want to learn and <br/>\npractice NVC in their families.<br/>\n<br/>\nThe PPLP begins in August 2007 and runs through April 2008. It <br/>\nincludes a week-long family camp, regularly scheduled teleclasses, <br/>\nweekly study suggestions, buddy relationships, and individualized <br/>\ntele-support. The only residential aspect of the program is the <br/>\nfamily camp that will take place in Calistoga, Northern California <br/>\nfrom August 13-19. About 20 peer leaders will be selected to <br/>\nparticipate in the program based on a number of different criteria <br/>\nincluding experience and skill with NVC; commitment to living NVC in <br/>\ntheir families; geographical location (with priority given to those <br/>\nwho cannot easily access opportunities for NVC leadership development <br/>\nor training in working with parents); and ability to commit to the <br/>\nvarious program components. We anticipate that most participants will <br/>\nbe parents, but non-parents who want to focus primarily on sharing <br/>\nNVC with parents are also welcome. We estimate that the program will <br/>\ninvolve a 4-8 hour weekly commitment from participants, not including <br/>\nthe time spent at Family Camp. In addition, our intention is that all <br/>\nparticipants will initiate and lead parent groups focused on empathy <br/>\nand NVC practice in their local communities starting together during <br/>\nthe program (in early 2008) and continuing for at least one year <br/>\nafter the end of the program. To support their leadership, program <br/>\nparticipants will receive a detailed curriculum and additional <br/>\nmaterials.<br/>\n<br/>\nFamily Camp:<br/>\n<br/>\nThe PPLP family camp will be held from August 13-19 at Mountain Home <br/>\nRanch Retreat, in Calistoga, California. MHRR is about 1 hr. and 15 <br/>\nminutes north of San Francisco, and features over 300 acres of hiking <br/>\ntrails, two swimming pools, a tennis court, basketball, volleyball, <br/>\nlabyrinth, game room, lake fishing, large fire pit and more. <br/>\nAccommodations include rooms or cabins for each family and a few tent <br/>\nspaces. See www.mtnhomeranch.com/home.html for more information and <br/>\nphotos of the site.<br/>\n<br/>\nThe daily schedule at family camp includes structured learning with <br/>\nlots of opportunities to play together, eat together, rest and relax. <br/>\nMornings usually find parents in session together while their <br/>\nchildren participate in the Children&#39;s Program led by NVC-trained <br/>\nadults (and possibly teens). Although the intention for this time is <br/>\nfor children and adults to be in separate activities, children will <br/>\nhave free access to their parents at all times. After lunch and <br/>\nempathy groups for the parents we have a few hours of unstructured <br/>\ntime for families to connect and play together. Evenings include some <br/>\ntime for everyone to be together to play and do role plays, as well <br/>\nas more time for parents and children to engage in separate activities.<br/>\n<br/>\nFinancial Contribution Requested:<br/>\n<br/>\nThe PPLP has three distinct categories of contributions:<br/>\n<br/>\nPPLP Tuition: We request a $1,100-$2,200 sliding scale tuition <br/>\ncontribution for the whole 9-month program. This covers <br/>\nparticipants’ tuition for family camp and all other program <br/>\ncomponents.<br/>\n<br/>\nFamily Camp Basic Expenses: Basic Expenses contributions are intended <br/>\nto cover lodging and food, facility use, supplies, and miscellaneous <br/>\nexpenses for the full camp. The contribution we request for Basic <br/>\nExpenses varies according to your choice of accommodation and the <br/>\nages of your children. It ranges from $365-560 per adult, and $75-345 <br/>\nper child.<br/>\n<br/>\nFamily Camp Tuition: Family Camp tuition contribution is requested <br/>\nfor family members (children and additional adults who come to attend <br/>\nthe parents’ program) who are participating in the camp but who are <br/>\nnot participating in the PPLP. Family Camp tuition ranges from <br/>\n$300-900 per adult and $200-500 per child.<br/>\n<br/>\nAs always, we hope and intend to include applicants regardless of <br/>\nability to pay. In addition to scholarships, we also offer extended <br/>\npayment plans and volunteer opportunities. We also encourage people <br/>\nto seek support from their local communities and will give applicants <br/>\nsome ideas for how to do that.<br/>\n<br/>\nApplication Process & Timelines:<br/>\n<br/>\nInterested applicants are asked to contact Karin at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nvcparenting@...\">nvcparenting@...</a> to receive a full application packet. <br/>\nApplications are due April 13, and we anticipate making decisions by <br/>\nMay 15. Late applications will be accepted provided there is space in <br/>\nthe program.<br/>\n<br/>\nContact Information<br/>\n<br/>\nEmail: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nvcparenting@...\">nvcparenting@...</a> (please put PPLP application in <br/>\nthe subject line)<br/>\n<br/>\nPhone: Karin Morris, 1-510-655-5680, M-F 9:00am-2:00pm (PST, <br/>\nCalifornia, USA)<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n         <br/>\n<br/>\n<br/>\n          Namaste<br/>\n  Maisha <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://khalfanifamilyadventures.blogspot.com\">http://khalfanifamilyadventures.blogspot.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.dmuuc.org\">http://www.dmuuc.org</a> <br/>\n<br/>\n      <br/>\n           <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":22942,"nextTopicId":22936}}