{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":194903596,"authorName":"Ruth G","from":"&quot;Ruth G&quot; &lt;grayfamily9@...&gt;","profile":"ladybird579","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Dilemma","postDate":"1125529723","msgId":6448,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDgwMWM1YWU4MCRlZWFmMjVmMCQyYWUwNjQ1M0BwY2FiYTFkMzU1NTE5Zj4=","referencesHeader":"PDIwMDUwODMxMTc0NDIzLjQ0MS5xbWFpbEB3ZWIzMDIwMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":6444,"nextInTopic":0,"prevInTime":6447,"nextInTime":6449,"topicId":6435,"numMessagesInTopic":0,"msgSnippet":"Hi Christine No offence taken. I really don t care if he does the course or not. He chose it in the first place -not me -and if he doesn t decide to do it he","messageBody":"<div id=\"ygrps-yiv-1194398586\">Hi Christine<br/>\nNo offence taken. I really don&#39;t care if he does the course or not. He chose it in the first place -not me -and if he doesn&#39;t decide to do it he will find something else to do. I think I was guiltyof being over enthusistic about it but only cos Ig enuinely thougth it was something he was going to. My only fear I suppose is his reaction to stopping if he does as he will see it as a failure if he gives it up. He told me that tonight. It is that I am trying to get around.  I am more unschooled than him tbh.  I have book I am going to see if he wants to read about unschooled teenagers and see if that helps him. Thanks Christine cos asking me about the fear clarified it that it is a bit but not in the way you thought. I don&#39;t want him to be like he was in school. I don&#39;t want him to become miserable and unhappy again and that is my fear.  I agree he has to work it himself out but knowing him sometimes he needs someone to say stuff out loud til we get to what is the crux of it.  Oh your parents sound like mine lol.  The stuff I got put on me cos they thought I ought to do it for my own good and they only loved me was untrue. I took me years to undo that thinking.<br/>\n<br/>\nRuth<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210090779,"authorName":"Christine Headley","from":"Christine Headley &lt;krissy8444@...&gt;","profile":"krissy8444","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Dilemma","postDate":"1125510263","msgId":6444,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwODMxMTc0NDIzLjQ0MS5xbWFpbEB3ZWIzMDIwMS5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDAwMGMwMWM1YWU0ZSRjYzUwNjRiMCRiZmMzNjQ1M0BwY2FiYTFkMzU1NTE5Zj4="},"prevInTopic":6435,"nextInTopic":6448,"prevInTime":6443,"nextInTime":6445,"topicId":6435,"numMessagesInTopic":0,"msgSnippet":"Dear Ruth, I am a new homeschooler who decided to home school based on John Holt and unschooling ideas.  I am not experienced by anyone s standards, I am","messageBody":"<div id=\"ygrps-yiv-1680949688\">Dear Ruth,<br/>\nI am a &quot;new&quot; homeschooler who decided to home school<br/>\nbased on John Holt and unschooling ideas.  I am not<br/>\nexperienced by anyone&#39;s standards, I am sure, however,<br/>\nI think you need to let him figure this out.<br/>\nI can tell you really are concerned about your son and<br/>\nreally want to help him be the best he can be and<br/>\nreach his goals - which I&#39;m sure you believe he can<br/>\ndo!  I was &quot;helped&quot; by my parents under the excuse of<br/>\nlove and concern for most of my life and realized that<br/>\nit really wasn&#39;t love and concern but fear.  Fear from<br/>\nmy parents that &quot;this would happen, or that would<br/>\nhappen, etc.&quot;  If you examine how you are feeling<br/>\ninside and find that it is fear, take a step back and<br/>\nbreathe.<br/>\nWhen we take action based on fear, we don&#39;t become our<br/>\n&quot;full&quot; and &quot;whole&quot; selves.<br/>\nJust my two cents, hope I haven&#39;t offended you.<br/>\nTake care.<br/>\nChristine<br/>\n<br/>\n<br/>\n--- Ruth G &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grayfamily9@...\">grayfamily9@...</a>&gt;<br/>\nwrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt;   I wonder what any of you thought about this.<br/>\n&gt; <br/>\n&gt;   My son has always been very interested in history<br/>\n&gt; since being unschooled. He wanted to take an online<br/>\n&gt; course in English History last year which he did and<br/>\n&gt; completed it.  Then he asked if he could do a Open<br/>\n&gt; University course. I looked into it and was told he<br/>\n&gt; needed a qualification first so he decided to do a<br/>\n&gt; online Diploma in Egyptology.  He was adamant he<br/>\n&gt; wanted this course so I duly paid up the £195 for it<br/>\n&gt; and bought him a load of books he needed.  Then it<br/>\n&gt; has all fallen apart. Ds only really likes ancient<br/>\n&gt; history or medieval and not Egyptian  He find it it<br/>\n&gt; hard working to assumptions rather than any proven<br/>\n&gt; facts. He is struggling and unhappy.  Issues are if<br/>\n&gt; he stops he will feel a failure in his own eyes- <br/>\n&gt; not mine. ( and he KNOWS this) If he continues he<br/>\n&gt; will get more and more depressed over it all.  Dh<br/>\n&gt; growled mildly about the money to which hasn&#39; t<br/>\n&gt; helped.  ( dh&#39;s eh??) The only way forward I can see<br/>\n&gt; is ask for a deferrment but if I do I don&#39;t think he<br/>\n&gt; will ever do it anyway. Also I don&#39;t think it is an<br/>\n&gt; option as only a full refund within a time scale was<br/>\n&gt; offered and it has gone past that now. Or tell him<br/>\n&gt; to stop. I think he wants my pemission to stop but<br/>\n&gt; don&#39;t know why cos he has never needed it before.He<br/>\n&gt; has always been free to stop when he wants .I know<br/>\n&gt; is this course has turned him from a happy child who<br/>\n&gt; could talk all day about history to a sullen, sulky<br/>\n&gt; teenager.  I  think his learning is up to him.  It<br/>\n&gt; is his self esteem that is a stake tho. For an<br/>\n&gt; unschooled chid he does put exacting standards on<br/>\n&gt; himself but he has Aspergers Syndrome and this is<br/>\n&gt; probably why. I have tried to talk with him but he<br/>\n&gt; ends up crying.<br/>\n&gt; <br/>\n&gt;   Ruth<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been<br/>\n&gt; removed]<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":194903596,"authorName":"Ruth G","from":"&quot;Ruth G&quot; &lt;grayfamily9@...&gt;","profile":"ladybird579","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Dilemma","postDate":"1125508190","msgId":6435,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGMwMWM1YWU0ZSRjYzUwNjRiMCRiZmMzNjQ1M0BwY2FiYTFkMzU1NTE5Zj4=","referencesHeader":"PGRmNGlqOStuajAyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":6444,"prevInTime":6434,"nextInTime":6436,"topicId":6435,"numMessagesInTopic":0,"msgSnippet":"I wonder what any of you thought about this. My son has always been very interested in history since being unschooled. He wanted to take an online course in","messageBody":"<div id=\"ygrps-yiv-640949661\">I wonder what any of you thought about this.<br/>\n<br/>\n  My son has always been very interested in history since being unschooled. He wanted to take an online course in English History last year which he did and completed it.  Then he asked if he could do a Open University course. I looked into it and was told he needed a qualification first so he decided to do a online Diploma in Egyptology.  He was adamant he wanted this course so I duly paid up the £195 for it and bought him a load of books he needed.  Then it has all fallen apart. Ds only really likes ancient history or medieval and not Egyptian  He find it it hard working to assumptions rather than any proven facts. He is struggling and unhappy.  Issues are if he stops he will feel a failure in his own eyes-  not mine. ( and he KNOWS this) If he continues he will get more and more depressed over it all.  Dh growled mildly about the money to which hasn&#39; t helped.  ( dh&#39;s eh??) The only way forward I can see is ask for a deferrment but if I do I don&#39;t think he will ever do it anyway. Also I don&#39;t think it is an option as only a full refund within a time scale was offered and it has gone past that now. Or tell him to stop. I think he wants my pemission to stop but don&#39;t know why cos he has never needed it before.He has always been free to stop when he wants .I know is this course has turned him from a happy child who could talk all day about history to a sullen, sulky teenager.  I  think his learning is up to him.  It is his self esteem that is a stake tho. For an unschooled chid he does put exacting standards on himself but he has Aspergers Syndrome and this is probably why. I have tried to talk with him but he ends up crying.<br/>\n<br/>\n  Ruth<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":6417,"nextTopicId":6446}}