{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Unschooling knowledge","postDate":"1312041018","msgId":47103,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyMEZERTkxRkUwRjQ3QUNCMTI2QTM1MTJCRjZBQkRCQGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PDEzMTE5NjEzNTYuMjcyNDMuWWFob29NYWlsTmVvQHdlYjQ0ODE1Lm1haWwuc3AxLnlhaG9vLmNvbT4="},"prevInTopic":47088,"nextInTopic":0,"prevInTime":47102,"nextInTime":47104,"topicId":47077,"numMessagesInTopic":0,"msgSnippet":"***What is your response when someone challenges your knowledge and ways of unschooling?*** I don t think I really felt challenged.  People had questions and","messageBody":"<div id=\"ygrps-yiv-1572217392\">***What is your response when someone challenges your knowledge and ways of unschooling?***<br/>\n<br/>\nI don&#39;t think I really felt challenged.  People had questions and criticisms and I was sometimes a little hurt or irritated but I don&#39;t think anyone challenged my knowledge.   I&#39;m still learning about learning. &lt;g&gt;   I&#39;m still thinking about unschooling, everyday.   The real challenge was being better, being a better mom, doing more, giving parenting and my son more consideration.  <br/>\n<br/>\nI had one sister in law who would send me articles about the benefits of education, clips of what great public schools were doing, expert&#39;s opinions on kids and homeschooling.   It irked me some, but she quit, eventually.    She never had kids and was not going to be a huge part of our lives (she lives in another state) so I was able to put it in perspective.   <br/>\n<br/>\nAt some point I started offering questioners books to read.  I had some bookmarks made with book titles and authors and would sometimes say, &quot;Read these and you&#39;ll understand my point of view better.  I&#39;d love to talk about it with you!&quot;    As far as I know, no one read any of the books I suggested. &lt;g&gt; <br/>\n<br/>\nThings change.   Family members sometimes outgrow their worry as they see your kids growing and learning and living happy lives.  <br/>\n<br/>\nI have opinions about the way family and friends parented their kids.  I think it&#39;s ok for others to have opinions about the way I do things.  Their opinions don&#39;t have to be a problem for me.   <br/>\n<br/>\nIn discussions with other unschoolers I appreciated  having my ideas questioned.  It helped me think more and better.   I&#39;m grateful every day for people who challenged my thinking and helped me learn. <br/>\n<br/>\n***Yes there are books out there and some of us have read them***<br/>\n<br/>\nThere are books, websites, blogs, news articles, videos, conferences...   Live your life in a way that supports your learning and increases the joy in your family.   That will give you the information and confidence you need to respond to critics, or ignore them comfortably. &lt;g&gt;<br/>\n<br/>\n*** As a parent do you feel that you have the knowledge required to unschool successfully? ***<br/>\n<br/>\nThe question, put that way, is difficult to answer.   I felt I had the ability to help my son learn and grow.  I never imagined myself to be so knowledgeable I could answer all his questions but I knew there would be some way to get the information we needed or wanted.  So, while I&#39;m not the most intelligent person I&#39;m smart enough to know what I don&#39;t know and go looking for the answers, and resourceful enough to know where I might find them. &lt;g&gt;   <br/>\n<br/>\nI remember asking teachers questions and getting answers like, &quot;You don&#39;t need to know that&quot; or, &quot;we won&#39;t be getting into that&quot; or &quot;we&#39;ll get to that later.&quot;     I can say that I felt I could do no worse than a teacher in an over crowded classroom with time and curriculum constraints.   <br/>\n<br/>\n Sharing knowledge and ideas is important but there&#39;s so much more to learning than one person sharing knowledge with another.   Learning is so personal, so much about discovery, exploration, experience. If a parent can be positive and supportive and interesting, find resources when they&#39;re wanted, offer opportunities for play and exploration and adventure,  unschooling can be wonderful.   <br/>\n<br/>\nCan you unschool successfully?  The answer will depend, in part, on what you think successful unschooling would look like, what you&#39;re willing to do, what you can do, and what you expect. <br/>\n  <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Unschooling knowledge","postDate":"1311986684","msgId":47083,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTE5ODY2ODQuNjA1NjUuWWFob29NYWlsTmVvQHdlYjgxNTAzLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDEzMTE5NjEzNTYuMjcyNDMuWWFob29NYWlsTmVvQHdlYjQ0ODE1Lm1haWwuc3AxLnlhaG9vLmNvbT4=","referencesHeader":"PDEzMTE5NjEzNTYuMjcyNDMuWWFob29NYWlsTmVvQHdlYjQ0ODE1Lm1haWwuc3AxLnlhaG9vLmNvbT4="},"prevInTopic":47082,"nextInTopic":47085,"prevInTime":47082,"nextInTime":47084,"topicId":47077,"numMessagesInTopic":0,"msgSnippet":"what kind of knowledge are you talking about? Are you talking about subjects like Math? Or are you talking about knowledge about how children learn?   Alex","messageBody":"<div id=\"ygrps-yiv-2073272464\">what kind of knowledge are you talking about?<br/>\nAre you talking about subjects like Math?<br/>\nOr are you talking about knowledge about how children learn?<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling knowledge","postDate":"1311986543","msgId":47082,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowdmsxZityb21rQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMTE5NjEzNTYuMjcyNDMuWWFob29NYWlsTmVvQHdlYjQ0ODE1Lm1haWwuc3AxLnlhaG9vLmNvbT4="},"prevInTopic":47081,"nextInTopic":47083,"prevInTime":47081,"nextInTime":47083,"topicId":47077,"numMessagesInTopic":0,"msgSnippet":"... ******************* Define successfully ? The last conversation I ever had with the pricipal at the local public school, he told me if Ray (then 13)","messageBody":"<div id=\"ygrps-yiv-1113323964\">Debora Solarski &lt;debora4avon@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; As a parent do you feel that you have the knowledge required to unschool successfully?<br/>\n </span></blockquote>*******************<br/>\n<br/>\nDefine &quot;successfully&quot;?<br/>\n<br/>\nThe last conversation I ever had with the pricipal at the local public school, he told me if Ray (then 13) stayed in school he would be in juvenile detention by the end of the year and prison before he graduated. He&#39;ll be 18 soon, and I&#39;m pleased to say that after five years of unschooling neither of those predictions have come true. We have, by those standards, succeeded beyond the capabilities of the school. <br/>\n<br/>\nHappily, &quot;keeping Ray out of prison&quot; wasn&#39;t the sum total of our goals. At almost-18, he spends most of his time with other young adults - not high school kids, because he finds them generally immature and uninformed. Just on those grounds I&#39;d say unschooling was successful. He&#39;s better prepared than his age-peers for life because he&#39;s been living it while they&#39;ve been in school. <br/>\n<br/>\nKids leave school with so little in the ways of social skills, life skills and self-confidence, with so little ability to self-motivate and make thoughtful decisions that I don&#39;t worry that my unschooling 10yo will be at any kind of disadvantage. At worst - absolute worst - her life will give her equivalently bad skills and confidence, and I&#39;m pretty confident from the evidence to date she&#39;ll be better off than that even if she decides to try school for herself at some point.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; What is your response when someone challenges your knowledge and ways of unschooling?<br/>\n </span></blockquote>*********************<br/>\n<br/>\nI tell them that when they&#39;ve spent as much time studying home-education as I have I&#39;m willing to discuss the topic and give them a web address. If they&#39;re not homeschoolers, I give them the A to Zs Home&#39;s Cool address<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://homeschooling.gomilpitas.com/\">http://homeschooling.gomilpitas.com/</a><br/>\n which tends to end the discussion right there. If they Are homeschoolers but not interested in unschooling, I recommend they look at information for parents and teachers of gifted children and tell them unschooling works along those kinds of principles. If they are actually interested in unschooling I send them here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling\">http://sandradodd.com/unschooling</a><br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":321860186,"authorName":"Sara Uselton","from":"&quot;Sara Uselton&quot; &lt;saralouwho@...&gt;","profile":"reflectionmommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unschooling knowledge","postDate":"1311986407","msgId":47088,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowdmp0NytwNmpyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENPTDEyMy1XNDJDNDMzM0RFREY2MjI4RDhBRUFGRkIwMzcwQHBoeC5nYmw+"},"prevInTopic":47085,"nextInTopic":47103,"prevInTime":47087,"nextInTime":47089,"topicId":47077,"numMessagesInTopic":0,"msgSnippet":"I really agree with all of this.  I m always saying, when someone has a problem with someone else, it s their problem, they own it.  It s always about their","messageBody":"<div id=\"ygrps-yiv-1624700276\">I really agree with all of this.  I&#39;m always saying, when someone has a problem with someone else, it&#39;s their problem, they own it.  It&#39;s always about their own life and insecurities in some way.  <br/>\n<br/>\nSara<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Andrea Hartman &lt;hartmandrea@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; My children are young, 6 and 8, and we really learn together.  They are into volcanos right now.  Sure, I know the basics, but we are reading about different types of rocks, different types of lava, different types of volcanoes, and famous volcanos.  I didn&#39;t know most of this information previously.  Thus, I am learning it with them.<br/>\n&gt; When people challenge, it is (in my opinion) rooted in their own fear of the fragility of their own belief system.  TRULY confident people are very accepting of others.  They give respect to others, and to themselves.  Someone challenging you shows their own lack of confidence.<br/>\n&gt; I employ a good sense of humor, and laugh and shrug it off.  Sure, you can have an argument, you can engage.  Or, you can choose not to engage.  Is it worth it?  Who cares what they think?  It matters what you believe.  Follow your children and your intuition.<br/>\n&gt; I love this quote:  &quot;An error does not become truth by reason of multiplied propagation, nor does truth become error because nobody sees it.&quot;<br/>\n&gt; Follow your truth.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":86487535,"authorName":"Renée Cooper","from":"=?iso-8859-1?B?UmVu6WUgQ29vcGVy?= &lt;rmilller@...&gt;","profile":"reneem29","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Unschooling knowledge","postDate":"1311985183","msgId":47085,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTE0Ny1XMzI5QUNCNTk4NDlFRjlDOTNBOUIzQkM4MzYwQHBoeC5nYmw+","inReplyToHeader":"PDEzMTE5NjEzNTYuMjcyNDMuWWFob29NYWlsTmVvQHdlYjQ0ODE1Lm1haWwuc3AxLnlhaG9vLmNvbT4=","referencesHeader":"PDEzMTE5NjEzNTYuMjcyNDMuWWFob29NYWlsTmVvQHdlYjQ0ODE1Lm1haWwuc3AxLnlhaG9vLmNvbT4="},"prevInTopic":47083,"nextInTopic":47088,"prevInTime":47084,"nextInTime":47086,"topicId":47077,"numMessagesInTopic":0,"msgSnippet":"// As a parent do you feel that you have the knowledge required to unschool successfully?  Yes there are books out there and some of us have read them.  What","messageBody":"<div id=\"ygrps-yiv-2057396135\">// As a parent do you feel that you have the knowledge required to unschool successfully?  Yes there are books out there and some of us have read them.  What is your response when someone challenges your knowledge and ways of unschooling? //<br/>\n <br/>\nI&#39;m assuming when you are challenged that it is similar to the challenge to a homeschooler -- i.e. you&#39;re not an expert, in this case you don&#39;t have a degree in &quot;alternative education&quot;, so how can you possibly expect to do as well as trained professionals?<br/>\n <br/>\nI&#39;m optimistic that we (my husband and I) can find the opportunities, mentors, materials, media, friends, etc. that our kids need as they grow, as well as our own ability to support, love and encourage them.  We will continue to learn about unschooling throughout our journey, through online interactions, meeting other families, going to our local conference, reading, etc.<br/>\n <br/>\nIs that &quot;the knowledge required to unschool successfully&quot;?  I don&#39;t know.  Maybe the real knowledge required to unschool successfully is something only you have anyway:  intimate knowledge of your kids from infancy onwards.   (and what&#39;s &quot;success&quot; look like for unschooling, anyway?  I&#39;m not sure it looks anything like brick-and-mortar school success, especially in regards to some sort of linear continual knowledge progression during their school-age years)<br/>\n <br/>\n-Renee<br/>\n <br/>\n <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n \t\t \t   \t\t  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":321860186,"authorName":"Sara Uselton","from":"&quot;Sara Uselton&quot; &lt;saralouwho@...&gt;","profile":"reflectionmommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unschooling knowledge","postDate":"1311985137","msgId":47081,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowdmlsaCtqbHFqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEI2Q0I3ODlBLUMwNTItNDMwNi1CNUQ5LURENUI3MjFBMzE5QkBhdHQubmV0Pg=="},"prevInTopic":47080,"nextInTopic":47082,"prevInTime":47080,"nextInTime":47082,"topicId":47077,"numMessagesInTopic":0,"msgSnippet":"I have to second Lesley here.  I used to feel the need to defend all my child-rearing practices, but I realize now that I did that out of a sense of insecurity","messageBody":"<div id=\"ygrps-yiv-822420986\">I have to second Lesley here.  I used to feel the need to defend all my child-rearing practices, but I realize now that I did that out of a sense of insecurity on my part.  I&#39;ve grown a lot over the past few years, and I&#39;ve gained a lot of self-esteem, thankfully.  Now I don&#39;t often bother to care what other people think of what I do.  I respond similarly to Lesley.  I find a good response to any question that isn&#39;t really a question, but a challenge, is to say something like, &quot;well, every family must make choices about what they believe is right for their individual family.&quot;  If they persist, I just sort of mirror their statement back to them, and then say something like, &quot;well, everyone has a different perspective on these things.&quot;  I keep going until they give up. <br/>\n<br/>\nIf YOU are worried about whether or not you know enough to unschool, then I would explore your own doubts, and forget about the doubts of others.  I have had similar moments of worry.  I usually just delve into some unschooling reading, books or online, and I usually find that my worries disappear pretty quickly.  <br/>\n<br/>\nGood luck,<br/>\nSara<br/>\n <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Lesley Cross &lt;lesleycross@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Not entirely sure what you&#39;re asking- if you mean how do we know we know enough to share with our kids, or if we know enough about educational theory to defend unschooling.  When you ask what my response is when someone challenges  our choice to unschool- well, they don&#39;t.  If they would I&#39;d likely not defend, just state that we all need to choose what works for our own families, pass the bean dip. <br/>\n&gt; <br/>\n&gt; While I&#39;m an unschooling advocate, I&#39;m not a recruiter and I don&#39;t need to convince anyone else that what we do is right for us, because no one else&#39;s opinion matters.   We&#39;re in compliance with our state laws and it&#39;s no one else&#39;s business.   I could defend, but choose not to put my energy into feeding others&#39; negativity (if they are honestly and politely curious, it&#39;s another story).  <br/>\n&gt; <br/>\n&gt; Lesley <br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lesleyreidcross.wordpress.com\">http://www.lesleyreidcross.wordpress.com</a><br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":482623530,"authorName":"Lesley Cross","from":"Lesley Cross &lt;lesleycross@...&gt;","profile":"decldc1992","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Unschooling knowledge","postDate":"1311977788","msgId":47078,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI2Q0I3ODlBLUMwNTItNDMwNi1CNUQ5LURENUI3MjFBMzE5QkBhdHQubmV0Pg==","inReplyToHeader":"PDEzMTE5NjEzNTYuMjcyNDMuWWFob29NYWlsTmVvQHdlYjQ0ODE1Lm1haWwuc3AxLnlhaG9vLmNvbT4=","referencesHeader":"PDEzMTE5NjEzNTYuMjcyNDMuWWFob29NYWlsTmVvQHdlYjQ0ODE1Lm1haWwuc3AxLnlhaG9vLmNvbT4="},"prevInTopic":47077,"nextInTopic":47080,"prevInTime":47077,"nextInTime":47079,"topicId":47077,"numMessagesInTopic":0,"msgSnippet":"Not entirely sure what you re asking- if you mean how do we know we know enough to share with our kids, or if we know enough about educational theory to defend","messageBody":"<div id=\"ygrps-yiv-565649501\">Not entirely sure what you&#39;re asking- if you mean how do we know we know enough to share with our kids, or if we know enough about educational theory to defend unschooling.  When you ask what my response is when someone challenges  our choice to unschool- well, they don&#39;t.  If they would I&#39;d likely not defend, just state that we all need to choose what works for our own families, pass the bean dip. <br/>\n<br/>\nWhile I&#39;m an unschooling advocate, I&#39;m not a recruiter and I don&#39;t need to convince anyone else that what we do is right for us, because no one else&#39;s opinion matters.   We&#39;re in compliance with our state laws and it&#39;s no one else&#39;s business.   I could defend, but choose not to put my energy into feeding others&#39; negativity (if they are honestly and politely curious, it&#39;s another story).  <br/>\n<br/>\nLesley <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lesleyreidcross.wordpress.com\">http://www.lesleyreidcross.wordpress.com</a></div>","specialLinks":[]},{"userId":344870988,"authorName":"Andrea Hartman","from":"Andrea Hartman &lt;hartmandrea@...&gt;","profile":"hartmandrea","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Unschooling knowledge","postDate":"1311977143","msgId":47080,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENPTDEyMy1XNDJDNDMzM0RFREY2MjI4RDhBRUFGRkIwMzcwQHBoeC5nYmw+","inReplyToHeader":"PDEzMTE5NjEzNTYuMjcyNDMuWWFob29NYWlsTmVvQHdlYjQ0ODE1Lm1haWwuc3AxLnlhaG9vLmNvbT4=","referencesHeader":"PDEzMTE5NjEzNTYuMjcyNDMuWWFob29NYWlsTmVvQHdlYjQ0ODE1Lm1haWwuc3AxLnlhaG9vLmNvbT4="},"prevInTopic":47078,"nextInTopic":47081,"prevInTime":47079,"nextInTime":47081,"topicId":47077,"numMessagesInTopic":0,"msgSnippet":"My children are young, 6 and 8, and we really learn together.  They are into volcanos right now.  Sure, I know the basics, but we are reading about different","messageBody":"<div id=\"ygrps-yiv-814787519\">My children are young, 6 and 8, and we really learn together.  They are into volcanos right now.  Sure, I know the basics, but we are reading about different types of rocks, different types of lava, different types of volcanoes, and famous volcanos.  I didn&#39;t know most of this information previously.  Thus, I am learning it with them.<br/>\nWhen people challenge, it is (in my opinion) rooted in their own fear of the fragility of their own belief system.  TRULY confident people are very accepting of others.  They give respect to others, and to themselves.  Someone challenging you shows their own lack of confidence.<br/>\nI employ a good sense of humor, and laugh and shrug it off.  Sure, you can have an argument, you can engage.  Or, you can choose not to engage.  Is it worth it?  Who cares what they think?  It matters what you believe.  Follow your children and your intuition.<br/>\nI love this quote:  &quot;An error does not become truth by reason of multiplied propagation, nor does truth become error because nobody sees it.&quot;<br/>\nFollow your truth.</div>","specialLinks":[]},{"userId":330983344,"authorName":"Debora Solarski","from":"Debora Solarski &lt;debora4avon@...&gt;","profile":"debora4avon","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Unschooling knowledge","postDate":"1311961356","msgId":47077,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTE5NjEzNTYuMjcyNDMuWWFob29NYWlsTmVvQHdlYjQ0ODE1Lm1haWwuc3AxLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":47078,"prevInTime":47076,"nextInTime":47078,"topicId":47077,"numMessagesInTopic":0,"msgSnippet":"As a parent do you feel that you have the knowledge required to unschool successfully?  Yes there are books out there and some of us have read them.  What is","messageBody":"<div id=\"ygrps-yiv-1863289010\">As a parent do you feel that you have the knowledge required to unschool successfully?  Yes there are books out there and some of us have read them.  What is your response when someone challenges your knowledge and ways of unschooling?<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":47061,"nextTopicId":46990}}