{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":14,"messages":[{"userId":218449772,"authorName":"zenmomma@comcast.net","from":"zenmomma@...","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] broader learning and ramblings","postDate":"1145227005","msgId":12157,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA0MTYyMDA2MjIzNi4zNzAuNDQ0MkM2RkQwMDBCQkU5NTAwMDAwMTcyMjIwOTIyNDYyNzBFMDMwMzAxMDMwMjBBOTZAY29tY2FzdC5uZXQ+"},"prevInTopic":12145,"nextInTopic":0,"prevInTime":12156,"nextInTime":12158,"topicId":11982,"numMessagesInTopic":0,"msgSnippet":"... They need to trust their interests with you and trust that when something becomes disagreeable, you will help them find solutions. This becomes very","messageBody":"<div id=\"ygrps-yiv-974232106\"><blockquote><span title=\"ireply\">&gt;&gt;Children need to trust that you are their partner.<br/>\n </span></blockquote>They need to trust their interests with you and trust that when<br/>\nsomething becomes disagreeable, you will help them find solutions.&gt;&gt;<br/>\n<br/>\nThis becomes very important later on too. I want my teen and almost teen to trust that I am a safe person to come to when something feels wrong to them. I want them to know that I am someone they can call without fear to drive them home from a party that&#39;s getting uncomfortable. Or that I am someone they can trust when needing sensitive advice. That kind of trust builds up over years.<br/>\n<br/>\n--<br/>\n~Mary<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://zenmommasgarden.blogspot.com/\">http://zenmommasgarden.blogspot.com/</a><br/>\n<br/>\n&quot;The miracle is not to walk on water. The miracle is to walk on the<br/>\ngreen earth, dwelling deeply in the present moment and feeling truly<br/>\nalive.&quot;<br/>\n                                   ~Thich Nhat Hanh<br/>\n<br/>\n -------------- Original message ----------------------<br/>\nFrom: &quot;Ren Allen&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt;</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] broader learning and ramblings","postDate":"1145214435","msgId":12145,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYwQjZGOUExLUY5MTMtNDM4OC04N0Q1LThGMEQ2OUE0QkMxNEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDYwNDE1MTA0My4xZnVNMDU0QzAzTmwzNGEwQG14LWhlcnJvbi5hdGwuc2EuZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDIwMDYwNDE1MTA0My4xZnVNMDU0QzAzTmwzNGEwQG14LWhlcnJvbi5hdGwuc2EuZWFydGhsaW5rLm5ldD4="},"prevInTopic":12140,"nextInTopic":12157,"prevInTime":12144,"nextInTime":12146,"topicId":11982,"numMessagesInTopic":0,"msgSnippet":"... My daughter and I have been messing about with Japanese for years not getting very far. It would be really nice if I already had the skill. Perhaps if my","messageBody":"<div id=\"ygrps-yiv-87938914\">On Apr 15, 2006, at 12:18 AM, Misty Felner wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; By high school though I<br/>\n&gt; actually started appreciating that my mother made me do it.<br/>\n<br/>\n </span></blockquote>My daughter and I have been messing about with Japanese for years not  <br/>\ngetting very far. It would be really nice if I already had the skill.<br/>\n<br/>\nPerhaps if my mother had made me take Japanese lessons, I would be  <br/>\nfluent today.<br/>\n<br/>\nPerhaps I would hate anything and everything Japanese.<br/>\n<br/>\nIt *is* much easier to already have a skill than to acquire one. Some  <br/>\nskills we can pick up as a side effect of doing something we enjoy.  <br/>\nSome skills, will require more practice.<br/>\n<br/>\nWhile we agree with people who say they&#39;re glad their parents made  <br/>\nthem practice at something they now enjoy as adults because we too  <br/>\nwould love to already have inside of us skills to do X, Y Z so we  <br/>\ncould enjoy them  now without the bother of learning, we don&#39;t see  <br/>\nthe -- far more numerous (in your family&#39;s case 66%!) -- people who  <br/>\nsay they hate &quot;X&quot; because their parents made them do it as a child.<br/>\n<br/>\nWhile having skills is great, if we force practice on kids the far  <br/>\nmore likely outcome is that they will want to stay far far away from  <br/>\nit once they&#39;re adults. How many people leave school wanting nothing  <br/>\nto do with learning after 12 years of practice. How many people don&#39;t  <br/>\nread because of the bad associations they have with school and being  <br/>\nmade to practice reading?<br/>\n<br/>\nJoyce<br/>\nAnswers to common unschooling questions:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://home.earthlink.net/~fetteroll/rejoycing/\">http://home.earthlink.net/~fetteroll/rejoycing/</a><br/>\nBlog of writing prompts for speculative fiction writers:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://dragonwritingprompts.blogsome.com/\">http://dragonwritingprompts.blogsome.com/</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":212934673,"authorName":"Pampered Chef Michelle","from":"&quot;Pampered Chef Michelle&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] broader learning and ramblings","postDate":"1145207697","msgId":12140,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA0MTYxMDE0eWEwMzBiODFqZmM2M2JjOTlhZjIxMWJmOUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDIwMDYwNDE2MTMyNDM5LjM3ODUucW1haWxAd2ViNTI3MDQubWFpbC55YWhvby5jb20+","referencesHeader":"PDhDODJGNkExODhDRTA2MC0xRjU0LTlEN0BtYmxrLXI0Mi5zeXNvcHMuYW9sLmNvbT4JIDwyMDA2MDQxNjEzMjQzOS4zNzg1LnFtYWlsQHdlYjUyNzA0Lm1haWwueWFob28uY29tPg=="},"prevInTopic":12138,"nextInTopic":12145,"prevInTime":12139,"nextInTime":12141,"topicId":11982,"numMessagesInTopic":0,"msgSnippet":"... Is $XXX worth more than your child s love of living?  I look at life as the opportunity to try things.  That does not mean complete things or accomplish ","messageBody":"<div id=\"ygrps-yiv-86799739\">On 4/16/06, Ellen Christian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:scentednights2002@...\">scentednights2002@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; You have already spent $XXX on them joining this sport. The money is<br/>\n&gt; non-refundable and there is no extra money to put them in another sport. Do<br/>\n&gt; you just let them quit & explain that you cannot pay for another<br/>\n&gt; sport/activity at this point? Do you tell them they can quit if they like<br/>\n&gt; but then they will have to wait until next season to do something different?<br/>\n<br/>\n<br/>\n </span></blockquote>Is $XXX worth more than your child&#39;s love of living?  I look at life as the<br/>\nopportunity to try things.  That does not mean complete things or accomplish<br/>\nthings.  Just try them.  Think of life as a huge smorgasborg.  You can have<br/>\nas much of it as you want.  You can go through and try a little bit of this<br/>\nand a little bit of that and see if you like it.  If you do you can always<br/>\ngo get more.  If you don&#39;t then you try something different until you find<br/>\nthat thing that you like.<br/>\n<br/>\nI realize that activities cost money and aren&#39;t free.  However, that doesn&#39;t<br/>\nmean that the desire needs to be quashed by the limitation of funds.  And<br/>\nsometimes it is just the facts of life that limit us.  For instance with<br/>\nsports (since that is where you started) a child might try baseball and<br/>\ndecide that it isn&#39;t right.  However another sport such as soccer might not<br/>\nbegin until the fall.  Hopefully by then you will have the resources to be<br/>\nable to let your child participate in another sport.<br/>\n<br/>\nMary Elayne takes gymnastics.  She thought she might like it, but she wasn&#39;t<br/>\nsure.  I was hesitant to spend $150 a month for gymnastics classes. I did a<br/>\nlittle searching and talking and found that our Y offers gymnastics classes<br/>\nfor only $30 a month and the coach was wonderful.  So she agreed to try it<br/>\n*and* the coach let her come to the first class for free.  (I found out<br/>\nlater that his kids are also homeschooled.)  She liked it and so has<br/>\ncontinued.  At one point she got really frustrated with gymnastics because<br/>\nher cartwheels were not to her expectations.  So we talked to the coaches<br/>\nand they agreed to work with her so she decided that she woudl stay.<br/>\nEverytime she has met an obstacle and thought of quitting we have talked<br/>\nabout what it is that is frustrating her and have been able to find a way to<br/>\nget past that obstacle.  The other day she finally did an almost perfect<br/>\ncartwheel (after 2 years of gymnastics) and said to me on the way home, &quot;I&#39;m<br/>\nso glad you got Coach Jessie to help me learn to do my cartwheels!&quot;  If she<br/>\nwere truly unhappy with gymnastics and we couldn&#39;t find a way to work with<br/>\nthe problem that she faced I would have no problems letting her quit.<br/>\n<br/>\nWould I allow a child to choose to quit if they just said, &quot;I want to<br/>\nquit?&quot;  No.  I would talk with the child and find out what it is about what<br/>\nthey are doing that they dislike.  It may be at the end of our conversation<br/>\nthat I realize the child truly is unhappy and allow the child to quit the<br/>\nactivity.  I would do the same if my co-parent came home one day and said,<br/>\n&quot;I want to quit work.&quot;  I would talk with him about why he wants to quit,<br/>\nwhat is frustrating him, whether he has talked to his manager (or someone<br/>\nelse) about the problem(s) and what he proposes to do if he does quit.  The<br/>\nsame things I would talk to my child about.<br/>\n<br/>\nOur children are fairly aware of our financial standings.  They know that if<br/>\nthey truly want to do something we will work towards helping meet that<br/>\ngoal.  I&#39;ll work harder on my business so we can afford it or Dan will find<br/>\na quick side job (fairly easy in the computer industry) to bring in a little<br/>\nextra.  However, if I had spent a large sum of money on a project and then<br/>\nthey quit doing it and wanted to do something else I would be honest that I<br/>\njust can&#39;t afford XYZ program right now but perhaps we could attempt to do<br/>\nsomething similar until we can afford it.  For instance let&#39;s say it is an<br/>\nart class they want to take but I can&#39;t afford.  I would offer to buy them<br/>\nsome art supplies that they can experiment with until I can afford to pay<br/>\nfor the class.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--<br/>\nMichelle<br/>\nIndependent Kitchen Consultant #413652<br/>\nThe Pampered Chef<br/>\n850-474-0817<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.pamperedchef.biz/michellelr\">http://www.pamperedchef.biz/michellelr</a><br/>\nAsk me how you can save 60% on some of our most favorite products!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"broader learning and ramblings","postDate":"1145205007","msgId":12138,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUxdHJlZit0a2QxQGVHcm91cHMuY29tPg=="},"prevInTopic":12134,"nextInTopic":12140,"prevInTime":12137,"nextInTime":12139,"topicId":11982,"numMessagesInTopic":0,"msgSnippet":"You have already spent $XXX on them joining this sport. The money is non-refundable and there is no extra money to put them in another sport. Do you  just let","messageBody":"<div id=\"ygrps-yiv-1205410177\">&quot;You have already spent $XXX on them joining this sport. The money is <br/>\nnon-refundable and there is no extra money to put them in another<br/>\nsport. Do you  just let them quit & explain that you cannot pay for<br/>\nanother sport/activity at  this point?&quot;<br/>\n<br/>\nWhen a parent spends money on a sport (or any other activity)the point<br/>\nis to broaden the child&#39;s world, help them enjoy an activity and<br/>\npossibly learn something new about themselves or their world.<br/>\nForcing them to stay in, does none of that.<br/>\n<br/>\nIn fact, the money is MORE wasted if you make your child keep doing<br/>\nsomething they find distasteful. They&#39;re learning to hate the thing<br/>\nthey&#39;re doing (not your real goal righ?) and resent you. The worst<br/>\npart about it, is they&#39;ll be a LOT more relunctant to bring up<br/>\ninterests with you. They&#39;ll be darn sure NOT to ask to join anything<br/>\nelse, if it can turn into a disagreeable experience in which they are<br/>\nunable to exercise free will.<br/>\n<br/>\nUnschooling is about trust.<br/>\nChildren need to trust that you are their partner.<br/>\nThey need to trust their interests with you and trust that when<br/>\nsomething becomes disagreeable, you will help them find solutions.<br/>\n<br/>\nThey can understand a budget. They will not be as understanding about<br/>\nforce...but they WILL learn to hide things from you. Not the best<br/>\nenvironment for unschooling.<br/>\n<br/>\nI turned Trevor off to baseball when he was younger, by pushing him to<br/>\nfinish the season when he wanted to quit. What was the TRUE issue? The<br/>\nfact that my child wanted to quit, or what other people would think?<br/>\nWe let other parent&#39;s scorn influence us too often I believe. Screw<br/>\nthose other parents, I have to answer to my CHILD, not them.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] broader learning and ramblings","postDate":"1145203367","msgId":12134,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNDE2MTYwMjQ3LjUyNzkwLnFtYWlsQHdlYjUzODA5Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDIwMDYwNDE2MTMyNDM5LjM3ODUucW1haWxAd2ViNTI3MDQubWFpbC55YWhvby5jb20+"},"prevInTopic":12113,"nextInTopic":12138,"prevInTime":12133,"nextInTime":12135,"topicId":11982,"numMessagesInTopic":0,"msgSnippet":"How would you deal with a child who decided they wanted to join a sport - you paid for them to join the team, bought their uniform t-shirt, bought their sports","messageBody":"<div id=\"ygrps-yiv-801736197\">How would you deal with a child who decided they wanted to join a sport - you paid for them to join the team, bought their uniform t-shirt, bought their sports equipment, etc. and after a few lessons they decided they wanted to quick.<br/>\n   <br/>\nYou have already spent $XXX on them joining this sport. The money is non-refundable and there is no extra money to put them in another sport. Do you just let them quit & explain that you cannot pay for another sport/activity at this point? Do you tell them they can quit if they like but then they will have to wait until next season to do something different?<br/>\n   <br/>\n******<br/>\n   <br/>\n  I&#39;d let them quit.  If they asked to try another sport AND I we really couldn&#39;t afford it, I&#39;d say we can&#39;t afford it now, but let&#39;s figure out a way to do it as soon as we can.  I would not say &#39;it&#39;s because you wasted our money on the last sport&#39; or &#39;you can&#39;t start a new sport for this much time, because you quit the last one.&#39;  All those things are punitive and angry.  <br/>\n   <br/>\n  I just spend $75 to sign Dan up for soccer this coming August.  He asked several weeks ago.  We talked about what soccer would involve -- wearing a uniform and real shoes (only mentioned because those are enough to dissuade Andy from most sports),  regular practices, rules, shin pads, etc.  I checked back with him several times, and yep, he still wants very much to play soccer.  When I told him this morning that I&#39;d signed him up for soccer, he was thrilled!  <br/>\n   <br/>\n  Andy has recently asked for archery lessons, but only once he&#39;s 10 in June.  I don&#39;t know why he wants to wait, but it&#39;s his choice not mine.  I&#39;ve been looking for places he can learn archery.  Before this, it&#39;s been horseback riding, bowling, and swimming.  He loves riding but not for more than about 30 minutes at a time.  He absolutely love bowling, so do that as often as we can (tho he hates the lane-switching in league style bowling, so we play free-style).  He explored swimming, but has no desire to either wear a speedo or compete, so he chose to skip the available swim team here.  Whatever he chooses to do with archery will be just fine with us.  <br/>\n   <br/>\n  When Will tried baseball for a summer season he loved it so much that we signed him up for &#39;fall ball.&#39;  Within two weeks, he had decided he hated fall ball, so he quit, with our support when the coach asked him to reconsider.<br/>\n   <br/>\n  As for money spent -- the money&#39;s already gone, beating up on your kid&#39;s psyche won&#39;t bring that money back, and it won&#39;t bring any joy so don&#39;t do it.  Then not only is the money wasted, so is that opportunity to love and truly support your child.  Really nothing for your money spent. <br/>\n   <br/>\n<br/>\n<br/>\n          Sylvia, Mom to <br/>\n  Will, 21 and out on his own<br/>\n  Andy, almost 10 and Dan, 5 <br/>\n     <br/>\n  Let the beauty you love be what you do  --  Rumi<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nNew Yahoo! Messenger with Voice. Call regular phones from your PC and save big.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":124939329,"authorName":"Ellen Christian","from":"Ellen Christian &lt;scentednights2002@...&gt;","profile":"scentednights2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: broader learning and ramblings","postDate":"1145198629","msgId":12113,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNDE2MTQ0MzQ5LjQwMDM3LnFtYWlsQHdlYjUyNzA4Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGUxdGs5NisyNDAxQGVHcm91cHMuY29tPg=="},"prevInTopic":12110,"nextInTopic":12134,"prevInTime":12112,"nextInTime":12114,"topicId":11982,"numMessagesInTopic":0,"msgSnippet":"Hi Joanne - Yes, it happened to me a few years ago. Sarah wanted to play softball. She had played it before & had enjoyed it so I paid for her to join the","messageBody":"<div id=\"ygrps-yiv-808359084\">Hi Joanne - Yes, it happened to me a few years ago. Sarah wanted to play softball. She had played it before & had enjoyed it so I paid for her to join the team, bought the team shirt, bought the necessary stuff she had outgrown, etc. She played it twice & hated the coach and wanted to quit. I did let her quit because I didn&#39;t think it was healthy to force her to do this if she really had a problem with the coach (who was a jerk btw). But we didn&#39;t have any money to sign her up for something different. We are in a very rural area and there are very very few &quot;free&quot; activities and no neighborhood children to play with. She understood why we couldn&#39;t sign her up for something else.<br/>\n   <br/>\n  On the other hand, she was in soccer last season and the coach was HORRID. I mean truly nasty. She would criticize the other teams players by saying mean things about them (like their weight, etc.).  When the girls came off the field she would say &quot;what the hell was that?&quot; meaning their playing wasn&#39;t good. She wouldn&#39;t put most of the girls out on the field because they weren&#39;t &quot;good enough&quot; to win so most of the girls just sat on the benches the whole time & played for 5 minutes. I was tempted to pull Sarah out simply because I don&#39;t feel that&#39;s a healthy environment for a child but Sarah wanted to stay in because she wanted to play in the games. She hated the practices & hated the coach (who actually made her CRY) but loved to play when she was on the field. So I let her stay in. However I did complain to the coach & spoke to several other parents who also complained to her &quot;boss&quot; and she was not chosen to coach this season thank heaven.<br/>\n   <br/>\n  Ellen<br/>\n<br/>\nJoanne &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:billyandjoanne@...\">billyandjoanne@...</a>&gt; wrote:<br/>\n  Hi Ellen,<br/>\n<br/>\nHas this happened to you or is it hypothetical? <br/>\n<br/>\n<br/>\nEllen LaFleche-Christian - Garden Zone 4<br/>\n  Moonlight Creations Jewelry & Gifts <a rel=\"nofollow\" target=\"_blank\" href=\"http://moonlight-creations-jewelry.com\">http://moonlight-creations-jewelry.com</a> <br/>\n  Receive a recipe every day <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/ARecipeADay/\">http://groups.yahoo.com/group/ARecipeADay/</a><br/>\n   <br/>\n   <br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nNew Yahoo! Messenger with Voice. Call regular phones from your PC and save big.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185550057,"authorName":"Joanne","from":"&quot;Joanne&quot; &lt;billyandjoanne@...&gt;","profile":"billyandjoanne","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: broader learning and ramblings","postDate":"1145197670","msgId":12110,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUxdGs5NisyNDAxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDYwNDE2MTMyNDM5LjM3ODUucW1haWxAd2ViNTI3MDQubWFpbC55YWhvby5jb20+"},"prevInTopic":12109,"nextInTopic":12113,"prevInTime":12109,"nextInTime":12111,"topicId":11982,"numMessagesInTopic":0,"msgSnippet":"Hi Ellen, Has this happened to you or is it hypothetical? Money is sometimes tight here so if one of my kids wanted to join a sport that involved paying a lot","messageBody":"<div id=\"ygrps-yiv-361955886\">Hi Ellen,<br/>\n<br/>\nHas this happened to you or is it hypothetical? <br/>\n<br/>\nMoney is sometimes tight here so if one of my kids wanted to join a <br/>\nsport that involved paying a lot of uniforms and equipment, I would <br/>\nexpose them to it several times first to see if it&#39;s what they <br/>\nthought it would be. Maybe we would go watch them play a few times <br/>\nor I would try and get a game together with their friends. I did <br/>\nthat with Shawna and soccer. She wanted to join a soccer team so we <br/>\nwent and watched a few times. I also bought a soccer ball and we <br/>\ntook it with us to our homeschool group and she played with the kids <br/>\nthere. It ended up being enough for her and she decided she didn&#39;t <br/>\nwant to join the team after all...she just wanted to play with the <br/>\nball and play with her friends.    <br/>\n<br/>\nWe watched the Karate Kid last month and Jacqueline wanted to take <br/>\nlessons. While I was looking into it, I borrowed some karate videos <br/>\nfrom the library for her. She did them every morning for a week and <br/>\nthen told me she changed her mind and wanted to take a dance class <br/>\ninstead. <br/>\n<br/>\nBeing a former dance studio owner, I told her all about the classes <br/>\nand what it would be like. I found a place that gives the first <br/>\nclass free and she loved it. Instead of buying the leotards and <br/>\ntights from the studio, I bought them at Walmart and saved quite a <br/>\nbit. She enjoys the class very much but if she wanted to quit right <br/>\nnow, I would have no problem with it. <br/>\n<br/>\n~ Joanne ~<br/>\nMom to Jacqueline (7), Shawna (10) & Cimion (13)<br/>\nAdopted into our hearts October 30, 2003<br/>\nhttp://anunschoolinglife.blogspot.com/<br/>\nhttp://foreverparents.com<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n--- In unschoolingbasics@yahoogroups.com, Ellen Christian <br/>\n&lt;scentednights2002@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; How would you deal with a child who decided they wanted to join a <br/>\n </span></blockquote>sport - you paid for them to join the team, bought their uniform t-<br/>\nshirt, bought their sports equipment, etc. and after a few lessons <br/>\nthey decided they wanted to quick.<br/>\n<blockquote><span title=\"ireply\"> &gt;    <br/>\n&gt;   You have already spent $XXX on them joining this sport. The <br/>\n </span></blockquote>money is non-refundable and there is no extra money to put them in <br/>\nanother sport. Do you just let them quit & explain that you cannot <br/>\npay for another sport/activity at this point? Do you tell them they <br/>\ncan quit if they like but then they will have to wait until next <br/>\nseason to do something different?<br/>\n<blockquote><span title=\"ireply\"> &gt;    <br/>\n&gt;   Ellen<br/>\n&gt; <br/>\n&gt; kbcdlovejo@... wrote:<br/>\n&gt;   My husband and I have often discussed what we would do if dd <br/>\n </span></blockquote>joined<br/>\n<blockquote><span title=\"ireply\"> &gt; something, &quot;say a team sport&quot; and a quarter way or half way <br/>\n </span></blockquote>through the<br/>\n<blockquote><span title=\"ireply\"> &gt; season wanted to quit b/c she wasn&#39;t any good, bored, whatever.  I <br/>\n </span></blockquote>feel <br/>\n<blockquote><span title=\"ireply\"> &gt; that<br/>\n&gt; she has an obligation to the team and should stick it out for the <br/>\n&gt; season.<br/>\n&gt; My husband feels she should be able to quit at anytime.  I&#39;m <br/>\n </span></blockquote>curious if <br/>\n<blockquote><span title=\"ireply\"> &gt; any<br/>\n&gt; of you would agree with my side.<br/>\n&gt; <br/>\n&gt; -=-=-=-<br/>\n&gt; <br/>\n&gt; Nope.<br/>\n&gt; <br/>\n&gt; I think the child could learn that he&#39;s not in charge of his wants <br/>\n </span></blockquote>and <br/>\n<blockquote><span title=\"ireply\"> &gt; needs. If given the choice, he may decide that his obligation <br/>\n </span></blockquote>outweighs <br/>\n<blockquote><span title=\"ireply\"> &gt; his boredom or ability. But given NO choice, he may decide never <br/>\n </span></blockquote>to <br/>\n<blockquote><span title=\"ireply\"> &gt; play again because someone else&#39;s need was put over his own.<br/>\n&gt; <br/>\n&gt; A child who has the choice to say &quot;no&quot; when he&#39;s done will more <br/>\n </span></blockquote>likely <br/>\n<blockquote><span title=\"ireply\"> &gt; say &quot;yes&quot; because he *can*.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Ellen LaFleche-Christian - Garden Zone 4<br/>\n&gt;   Moonlight Creations Jewelry & Gifts http://moonlight-creations-<br/>\n </span></blockquote>jewelry.com <br/>\n<blockquote><span title=\"ireply\"> &gt;   Receive a recipe every day <br/>\n </span></blockquote>http://groups.yahoo.com/group/ARecipeADay/<br/>\n<blockquote><span title=\"ireply\"> &gt;    <br/>\n&gt;    <br/>\n&gt; <br/>\n&gt; \t\t<br/>\n&gt; ---------------------------------<br/>\n&gt; Blab-away for as little as 1¢/min. Make  PC-to-Phone Calls using <br/>\n </span></blockquote>Yahoo! Messenger with Voice.<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] broader learning and ramblings","postDate":"1145197109","msgId":12109,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNDE2LjA4MTgyOS4yOTA0LjIuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":12105,"nextInTopic":12110,"prevInTime":12108,"nextInTime":12110,"topicId":11982,"numMessagesInTopic":0,"msgSnippet":"***How would you deal with a child who decided they wanted to join a sport - you paid for them to join the team, bought their uniform t-shirt, bought their","messageBody":"<div id=\"ygrps-yiv-967840978\">***How would you deal with a child who decided they wanted to join a<br/>\nsport - you paid for them to join the team, bought their uniform t-shirt,<br/>\nbought their sports equipment, etc. and after a few lessons they decided<br/>\nthey wanted to quit. ***<br/>\n<br/>\nI&#39;d let him quit. <br/>\n<br/>\nAs adults we have more experience in the world and we know better what<br/>\nkinds of activities we might enjoy making a commitment to.  Even so<br/>\nsometimes we start a thing and discover it&#39;s not what we expected,<br/>\ndoesn&#39;t fulfill us the way we thought it might, doesn&#39;t give us what we<br/>\nhoped to get from it.   <br/>\n<br/>\nI think it would be a terrible waste of time for anyone to keep doing<br/>\nsomething that wasn&#39;t good for them, emotionally or spiritually or<br/>\nphysically or whatever.  <br/>\n<br/>\nAnd I think it&#39;s dangerous, really, to set up a feeling in our kids that<br/>\nthey have to stick it out if they hate something.  None of us would want<br/>\nour daughters to stick it out if her boyfriend was abusing her.  None of<br/>\nus would want our teens to stay if the priest was touching them.  None of<br/>\nus would want our kids to &quot;stick it out&quot; if an employer was cheating<br/>\nthem.   <br/>\n<br/>\nHaving the power to make choices helps us learn to make good choices.  It<br/>\ngives us experience and insight into ourselves.  <br/>\n<br/>\nI also think if a kid knows he will have to stick with a thing even if it<br/>\nturns out he hates it, he will be less likely to try other things for<br/>\nfear of being trapped in a situation he cannot abide.  The freedom to<br/>\nchoose will let our kids try many things, will open up the world to them<br/>\nand help them learn more about themselves and everything else. <br/>\n<br/>\n***You have already spent $XXX on them joining this sport. The money is<br/>\nnon-refundable and there is no extra money to put them in another sport.<br/>\nDo you just let them quit & explain that you cannot pay for another<br/>\nsport/activity at this point? Do you tell them they can quit if they like<br/>\nbut then they will have to wait until next season to do something<br/>\ndifferent?***<br/>\n<br/>\nSometimes when something is &quot;non refundable&quot; it really is refundable and <br/>\nyou just have to ask.  <br/>\nSometimes parents can borrow money or volunteer in exchange for a childs<br/>\nparticipation.  <br/>\nSometimes parents can find a different group or organize a group of their<br/>\nown for the same kind of experience.  <br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":30983993,"authorName":"Lesa McMahon-Lowe","from":"&quot;Lesa McMahon-Lowe&quot; &lt;lesajm@...&gt;","profile":"lesamlowe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] broader learning and ramblings","postDate":"1145195718","msgId":12105,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExNS1EQVY2RkU0NzFDNzc5RDNBNjBFODBBMzVEM0M2MEBwaHguZ2JsPg==","referencesHeader":"PGUxdGZmZitkbDRjQGVHcm91cHMuY29tPg=="},"prevInTopic":12104,"nextInTopic":12109,"prevInTime":12104,"nextInTime":12106,"topicId":11982,"numMessagesInTopic":0,"msgSnippet":"... You re still not seeing children in a very good light if you think force and coercion are the only ways they ll find deep fulfillment in an activity.","messageBody":"<div id=\"ygrps-yiv-337173165\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;If it&#39;s truly fulfilling for you, you WOULD have chosen it again.\r<br/>\n </span></blockquote>You&#39;re still not seeing children in a very good light if you think\r<br/>\nforce and coercion are the only ways they&#39;ll find deep fulfillment in\r<br/>\nan activity.&lt;&lt;&lt;\r<br/>\n\r<br/>\nYeah, ditto... forcing someone to do something does not cause deep<br/>\nfulfillment... only resentment over time.\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n~*~*~\r<br/>\nLesa M.\r<br/>\nLIFE Academy\r<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://lifeacademy.homeschooljournal.net/\">http://lifeacademy.homeschooljournal.net/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] broader learning and ramblings","postDate":"1145195300","msgId":12104,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDODJGNzM4RTdERUQ5Qy0xRjU0LUFCQ0BtYmxrLXI0Mi5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PDIwMDYwNDE2MTMyNDM5LjM3ODUucW1haWxAd2ViNTI3MDQubWFpbC55YWhvby5jb20+"},"prevInTopic":12099,"nextInTopic":12105,"prevInTime":12103,"nextInTime":12105,"topicId":11982,"numMessagesInTopic":0,"msgSnippet":"... From: Ellen Christian  How would you deal with a child who decided they wanted to join a sport - you paid for them to join the","messageBody":"<div id=\"ygrps-yiv-1319020354\">-----Original Message-----<br/>\nFrom: Ellen Christian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:scentednights2002@...\">scentednights2002@...</a>&gt;<br/>\n<br/>\n    How would you deal with a child who decided they wanted to join a <br/>\nsport - you<br/>\npaid for them to join the team, bought their uniform t-shirt, bought <br/>\ntheir<br/>\nsports equipment, etc. and after a few lessons they decided they wanted <br/>\nto<br/>\nquick.<br/>\n<br/>\n  You have already spent $XXX on them joining this sport. The money is<br/>\nnon-refundable and there is no extra money to put them in another <br/>\nsport. Do you<br/>\njust let them quit & explain that you cannot pay for another <br/>\nsport/activity at<br/>\nthis point? Do you tell them they can quit if they like but then they <br/>\nwill have<br/>\nto wait until next season to do something different?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nDuncan wanted to take karate. I paid for two classes. He got the <br/>\nuniform. He decided it was something he wanted to do. We paid for a <br/>\nmonth. After two more lessons, he was frightened by one of the really <br/>\nbig &quot;bear&quot; instructors. Didn&#39;t wan t o go back. I suggested he go back <br/>\none more time. He did, but didn&#39;t want to go back again. Done. <br/>\nFinished. He may decide to pick it up again. Hard to tell.<br/>\n<br/>\nHe wanted to take fencing. I fell in love with the sport and joined <br/>\nhim. He quit. I&#39;m still going. Who&#39;da thunk??<br/>\n<br/>\nI would tell him that that was fine. He could quit now and try again <br/>\nsometime in the future if ge got interested in it again.<br/>\n<br/>\nHe knows the value of money. He knows we can&#39;t afford every little <br/>\nthing. He also knows that we will try to do whatever we can to help him <br/>\nachieve his goals. So if it&#39;s a matter of money, he&#39;s willing to wait. <br/>\nHe knows that he can quit and go back if he ever has a desire to. he <br/>\nknows that there are no strings attached to what we give him/do for him.<br/>\n<br/>\nWe haven&#39;t run into the above situation, but if we did, he&#39;s understand <br/>\nand be OK with that. He trusts us not to lie or make him do things he&#39;s <br/>\nuncomfortable with. He also knows that we would try to give him <br/>\nwhatever we can..<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a></div>","specialLinks":[]},{"userId":124939329,"authorName":"Ellen Christian","from":"Ellen Christian &lt;scentednights2002@...&gt;","profile":"scentednights2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] broader learning and ramblings","postDate":"1145193879","msgId":12099,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNDE2MTMyNDM5LjM3ODUucW1haWxAd2ViNTI3MDQubWFpbC55YWhvby5jb20+","inReplyToHeader":"PDhDODJGNkExODhDRTA2MC0xRjU0LTlEN0BtYmxrLXI0Mi5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":12095,"nextInTopic":12104,"prevInTime":12098,"nextInTime":12100,"topicId":11982,"numMessagesInTopic":0,"msgSnippet":"How would you deal with a child who decided they wanted to join a sport - you paid for them to join the team, bought their uniform t-shirt, bought their sports","messageBody":"<div id=\"ygrps-yiv-772157895\">How would you deal with a child who decided they wanted to join a sport - you paid for them to join the team, bought their uniform t-shirt, bought their sports equipment, etc. and after a few lessons they decided they wanted to quick.<br/>\n   <br/>\n  You have already spent $XXX on them joining this sport. The money is non-refundable and there is no extra money to put them in another sport. Do you just let them quit & explain that you cannot pay for another sport/activity at this point? Do you tell them they can quit if they like but then they will have to wait until next season to do something different?<br/>\n   <br/>\n  Ellen<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> wrote:<br/>\n  My husband and I have often discussed what we would do if dd joined<br/>\nsomething, &quot;say a team sport&quot; and a quarter way or half way through the<br/>\nseason wanted to quit b/c she wasn&#39;t any good, bored, whatever.  I feel <br/>\nthat<br/>\nshe has an obligation to the team and should stick it out for the <br/>\nseason.<br/>\nMy husband feels she should be able to quit at anytime.  I&#39;m curious if <br/>\nany<br/>\nof you would agree with my side.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nNope.<br/>\n<br/>\nI think the child could learn that he&#39;s not in charge of his wants and <br/>\nneeds. If given the choice, he may decide that his obligation outweighs <br/>\nhis boredom or ability. But given NO choice, he may decide never to <br/>\nplay again because someone else&#39;s need was put over his own.<br/>\n<br/>\nA child who has the choice to say &quot;no&quot; when he&#39;s done will more likely <br/>\nsay &quot;yes&quot; because he *can*.<br/>\n<br/>\n<br/>\nEllen LaFleche-Christian - Garden Zone 4<br/>\n  Moonlight Creations Jewelry & Gifts <a rel=\"nofollow\" target=\"_blank\" href=\"http://moonlight-creations-jewelry.com\">http://moonlight-creations-jewelry.com</a> <br/>\n  Receive a recipe every day <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/ARecipeADay/\">http://groups.yahoo.com/group/ARecipeADay/</a><br/>\n   <br/>\n   <br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nBlab-away for as little as 1¢/min. Make  PC-to-Phone Calls using Yahoo! Messenger with Voice.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"broader learning and ramblings","postDate":"1145192751","msgId":12095,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUxdGZmZitkbDRjQGVHcm91cHMuY29tPg=="},"prevInTopic":12089,"nextInTopic":12099,"prevInTime":12094,"nextInTime":12096,"topicId":11982,"numMessagesInTopic":0,"msgSnippet":"  I think my mother was a little bit excessive in her demands, but had she followed in the unschooling approach I would have given it up after only a year or","messageBody":"<div id=\"ygrps-yiv-1782466616\">&quot;  I think my mother was a little<br/>\nbit excessive in her demands, but had she followed in the unschooling<br/>\napproach I would have given it up after only a year or two.  And would<br/>\nnot have this great fulfillment in my life.&quot;<br/>\n<br/>\nIf it&#39;s truly fulfilling for you, you WOULD have chosen it again.<br/>\nYou&#39;re still not seeing children in a very good light if you think<br/>\nforce and coercion are the only ways they&#39;ll find deep fulfillment in<br/>\nan activity.<br/>\n<br/>\nMost kids dabble with a variety of things and those interests get<br/>\nhoned more in later years. <br/>\nI took piano. I finally convinced my Mum to let me stop lessons after<br/>\na few years and by the time I was 17 I wanted to take them again. Did<br/>\nmy folks help me? NO. <br/>\nI still would like to play piano.  My learning is my own.<br/>\nMy schooling and parents HINDERED the joy of learning, just like yours<br/>\ndid. That is not going to stop me from the joy of learning today.<br/>\n<br/>\nIf your child drops something for many years, what is the harm in<br/>\nthat? If they pick it up again, they learned something valuable by<br/>\nbeing TRUSTED. If they don&#39;t pick it up again, it wasn&#39;t<br/>\ninteresting/valuable enough to them...either way they learned<br/>\nsomething about what they love and don&#39;t love. Great!!<br/>\n<br/>\nForcing a child to continue with something they don&#39;t want to do, only<br/>\nteaches them resentment and hurts your relationship.<br/>\n<br/>\nI think it&#39;s really amusing when people credit their parents for<br/>\nforcing them to do something they didn&#39;t enjoy and they eventually got<br/>\nsomething from the activity.<br/>\nUnschooled kids are getting deeply, richly involved in their interests<br/>\nwithout all the yucky feelings surrounding it. They also have that<br/>\ninternal knowledge that the power to learn and learn well is within<br/>\nTHEM...not from the force of a parent. I cringe when I hear someone<br/>\ncrediting a parent for something they were forced to do against their<br/>\nwill....what a yucky way to feel about yourself, that you couldn&#39;t<br/>\nhave done something worthy without force. <br/>\n<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] broader learning and ramblings","postDate":"1145191237","msgId":12089,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDODJGNkExODhDRTA2MC0xRjU0LTlEN0BtYmxrLXI0Mi5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PDIwMDYwNDE1MTA0My40OTQ0NDEwNmE2MWZjQHJseS14YTAxLm14LmFvbC5jb20+"},"prevInTopic":11982,"nextInTopic":12095,"prevInTime":12088,"nextInTime":12090,"topicId":11982,"numMessagesInTopic":0,"msgSnippet":"... From: Misty Felner  I think I posted about this before, but as in grade school my mother forced me and my brother and sister to take 6","messageBody":"<div id=\"ygrps-yiv-1743174512\">-----Original Message-----<br/>\nFrom: Misty Felner &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:misty@...\">misty@...</a>&gt;<br/>\n<br/>\n I think I posted about this<br/>\nbefore, but as in grade school my mother forced me and my brother and <br/>\nsister<br/>\nto take 6 yrs of piano lessons (what she deemed the amount of time to <br/>\nmake<br/>\nus skilled enough to be able to pick up and play any sheet music we&#39;d <br/>\nlike)<br/>\npracticing 30 minutes a day.<br/>\n<br/>\n-=-=-<br/>\n<br/>\nWhere did she get those numbers? And why didn&#39;t *she* do that rather <br/>\nthan force children to?<br/>\n<br/>\n-=-=<br/>\n<br/>\n When I was a child I hated that my mother made<br/>\nme do this.  I resented it so much that my brother and I used to cover <br/>\nfor<br/>\neach other and lie about the practice we had done.<br/>\n<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nIt made both of you liars and cheats, filled with resentment.<br/>\n<br/>\nBummer<br/>\n<br/>\n--=---=-=-<br/>\n.<br/>\n By high school though I<br/>\nactually started appreciating that my mother made me do it.  I got into<br/>\nchoir and music and actually regretted having not practiced more so <br/>\nthat I<br/>\nwould be an even better player.  In college when I needed a break I&#39;d go<br/>\ndown to the lobby of my dorm and play.<br/>\n<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nYou don&#39;t think that given space and the freedom to choose when to play <br/>\n---and even to take a break when it was no longer fun---you don&#39;t think <br/>\nyou would have chosen to continue playing here and there? You don&#39;t <br/>\nthink you would have pursued it *ever* on your own? You don&#39;t think you <br/>\nwere capable of making those decisions?<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\n<br/>\n  Of the 3 of us I am the only one who as an adult still plays and owns <br/>\na piano.<br/>\n<br/>\n-=-==-<br/>\n<br/>\nBut one out of three ain&#39;t bad, huh?<br/>\n<br/>\n-=-=-=-<br/>\n  I think my mother was a little<br/>\nbit excessive in her demands, but had she followed in the unschooling<br/>\napproach I would have given it up after only a year or two.  And would <br/>\nnot<br/>\nhave this great fulfillment in my life.<br/>\n<br/>\n =-=-=-=-<br/>\n<br/>\nYou don&#39;t know that. Your siblings certainly do though!<br/>\n<br/>\n=-==-=-<br/>\n<br/>\nMy husband and I have often discussed what we would do if dd joined<br/>\nsomething, &quot;say a team sport&quot; and a quarter way or half way through the<br/>\nseason wanted to quit b/c she wasn&#39;t any good, bored, whatever.  I feel <br/>\nthat<br/>\nshe has an obligation to the team and should stick it out for the <br/>\nseason.<br/>\nMy husband feels she should be able to quit at anytime.  I&#39;m curious if <br/>\nany<br/>\nof you would agree with my side.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nNope.<br/>\n<br/>\nI think the child could learn that he&#39;s not in charge of his wants and <br/>\nneeds. If given the choice, he may decide that his obligation outweighs <br/>\nhis boredom or ability. But given NO choice, he may decide never to <br/>\nplay again because someone else&#39;s need was put over his own.<br/>\n<br/>\nA child who has the choice to say &quot;no&quot; when he&#39;s done will more likely <br/>\nsay &quot;yes&quot; because he *can*.<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a></div>","specialLinks":[]},{"userId":217204862,"authorName":"Misty Felner","from":"&quot;Misty Felner&quot; &lt;misty@...&gt;","profile":"mistyfelner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"broader learning and ramblings","postDate":"1145074725","msgId":11982,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDExNDQyODQ5NzQuMTU3NS44MTAyMC5tMjlAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":12089,"prevInTime":11981,"nextInTime":11983,"topicId":11982,"numMessagesInTopic":0,"msgSnippet":"... Michelle wrote: But don t force that exposure on him. I ve been struggling a little bit with this topic.  Especially since my daughter is young, I feel","messageBody":"<div id=\"ygrps-yiv-230835175\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; I do have a comment on why it might be good for kids<br/>\n&gt; to learn more broadly than specialists later in life.<br/>\n&gt; I&#39;m NOT saying this works for all kids or that it&#39;s<br/>\n&gt; THE way to go. Just presenting the idea that I think<br/>\n&gt; exposure to more choices and areas of expertise is a<br/>\n&gt; goal of mine for my son and for education in general.<br/>\n<br/>\n </span></blockquote>Michelle wrote: <br/>\nBut don&#39;t force that exposure on him.  <br/>\n<br/>\nI&#39;ve been struggling a little bit with this topic.  Especially since my<br/>\ndaughter is young, I feel it&#39;s important to expose her to as much as<br/>\npossible to find out where her interests lie.  I think I posted about this<br/>\nbefore, but as in grade school my mother forced me and my brother and sister<br/>\nto take 6 yrs of piano lessons (what she deemed the amount of time to make<br/>\nus skilled enough to be able to pick up and play any sheet music we&#39;d like)<br/>\npracticing 30 minutes a day.  When I was a child I hated that my mother made<br/>\nme do this.  I resented it so much that my brother and I used to cover for<br/>\neach other and lie about the practice we had done.  By high school though I<br/>\nactually started appreciating that my mother made me do it.  I got into<br/>\nchoir and music and actually regretted having not practiced more so that I<br/>\nwould be an even better player.  In college when I needed a break I&#39;d go<br/>\ndown to the lobby of my dorm and play.  Of the 3 of us I am the only one who<br/>\nas an adult still plays and owns a piano.  I think my mother was a little<br/>\nbit excessive in her demands, but had she followed in the unschooling<br/>\napproach I would have given it up after only a year or two.  And would not<br/>\nhave this great fulfillment in my life.  <br/>\n<br/>\nMy husband and I have often discussed what we would do if dd joined<br/>\nsomething, &quot;say a team sport&quot; and a quarter way or half way through the<br/>\nseason wanted to quit b/c she wasn&#39;t any good, bored, whatever.  I feel that<br/>\nshe has an obligation to the team and should stick it out for the season.<br/>\nMy husband feels she should be able to quit at anytime.  I&#39;m curious if any<br/>\nof you would agree with my side.<br/>\n<br/>\nRyam wrote: <br/>\nI&#39;m not much into force about anything except<br/>\nhealth/safety. However I&#39;ve had many jobs where I<br/>\nneeded skills that weren&#39;t part of the major focus of<br/>\nthe job. For example as a social worker I needed to<br/>\ntype so I could do all the form filling required. <br/>\n<br/>\nYet another thing my mother stepped in and made me do was to take typing in<br/>\nhigh school as one of my &quot;electives&quot;.  Another thing I am very thankful for.<br/>\n<br/>\nRyam wrote:<br/>\nSure I could have tried to learn these things at the<br/>\npoint when I desperately needed them at work, but it<br/>\nwas also nice to already have them. If I hadn&#39;t had<br/>\nthem I couldn&#39;t have done the job.<br/>\n<br/>\nThat&#39;s how I feel about playing the piano.  Sure I got interested in it<br/>\nlater on, but at that time I would not have wanted to just be beginning to<br/>\nlearn, I was glad I already had the skill.<br/>\n<br/>\n<br/>\nMisty</div>","specialLinks":[]}],"prevTopicId":12155,"nextTopicId":12137}}