{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":242367849,"authorName":"Karen","from":"&quot;Karen&quot; &lt;kb@...&gt;","profile":"busy_karen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE:intense & very strong willed 4 year old (now adding Biomedical Underpinnings)","postDate":"1193711104","msgId":27430,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxZTYwMWM4MWE5YyQxNWUzY2M1MCQ0MWFiNjRmMCRAY29tPg==","inReplyToHeader":"","referencesHeader":""},"prevInTopic":27429,"nextInTopic":0,"prevInTime":27429,"nextInTime":27431,"topicId":27426,"numMessagesInTopic":0,"msgSnippet":"Cosmetic re-post: Sorry--I see that the paragraph separations had started running together, making it hard to read.  Here, I have tried to fix that. Original","messageBody":"<div id=\"ygrps-yiv-962041822\">Cosmetic re-post: Sorry--I see that the paragraph separations had started<br/>\nrunning together, making it hard to read.  Here, I have tried to fix that.<br/>\n<br/>\n<br/>\nOriginal testimonial post:<br/>\n<br/>\nRE: Feingold program and biomedical approach<br/>\n<br/>\n(Long post, so I have broken it into sections with headings.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Most of the &quot;diets&quot; that are out there that say they help ADHD only help<br/>\n </span></blockquote>those that ALSO have food sensitivities that cause the ADHD symptoms.<br/>\n<br/>\nWhat I have witnessed statistically is that the vast majority of those with<br/>\nADHD symptoms actually do have those food sensitivities (discovered only<br/>\nafter the possibility is explored systematically), which is exactly why the<br/>\nproperly-executed and individually-tailored diets are helping so many.  <br/>\n<br/>\nMy journey as a skeptic:<br/>\nI was a big skeptic of the ability of diet (beyond a balanced diet) and<br/>\nsupplements to help ADHD.  I thought I was too educated to fall for that<br/>\nnaturopathic stuff.  I had read statements from the American Academy of<br/>\nPediatrics and CHADD and couldnt figure out why parents were still<br/>\nbothering to pursue nutritionally-based alternative treatments.  My DD<br/>\nWhitney is adopted and ADHD-wise, she is a carbon copy of her birthfather.<br/>\nSo it seemed to me that it was clearly genetics in her case.  I thought,<br/>\nSince its so obvious that its genetic, it is very unlikely that food<br/>\nsensitivities would play a role in her case anyway.  Besides, it seemed to<br/>\nme that if it was food-related (digestive tract-related), I would see more<br/>\nups and downs in her behavior, rather than the consistent non-stop<br/>\nhyperactive-impulsive 24/7 Texas Tornado, as we called her.<br/>\n<br/>\nBut I was relentless in my pursuit of more information about ADHDall<br/>\naspects in all forms.  One day it occurred to me that food sensitivities<br/>\nthemselves can have a genetic component.  But I still wasnt convinced<br/>\nenough that it would help her for us to go through the hassle of trying a<br/>\ndifficult elimination diet; our household was chaotic enough already.<br/>\nHowever, she had had chronic headaches for a long time, and her doctors at<br/>\nthat time did not seem interested in pursuing a cause.  I felt that I had to<br/>\ndo *something* about her headaches.  It seemed that an elimination diet such<br/>\nas Feingold would have a greater likelihood of at least helping her<br/>\nheadaches.  But before I could bring myself to pay for a Feingold<br/>\nAssociation membership, I still wanted more independent evidence that I was<br/>\nnot about to be scammed.  The membership is relatively cheap, but it was the<br/>\nprinciple of not giving even one dollar to scammers.  As a result of a bit<br/>\nof further research, I found this article in BBC News and others like it:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://news.bbc.co.uk/1/hi/education/2404169.stm\">http://news.bbc.co.uk/1/hi/education/2404169.stm</a><br/>\n<br/>\nI also found interesting results on a website which allows users to rate<br/>\nvarious treatments for each of various medical conditions.  For the<br/>\nhyperactive Impulsive type, the users currently rate Diet: Feingold 8.7<br/>\nout of 10.  They rate Adderall 7.1, Dexedrine 9.0,  Methylphenidate 6.9,<br/>\nRitalin LA 8.0, and Strattera 4.6.  (If the ratings were to factor in the<br/>\nimportance of treating underlying causes, I believe that the Feingold<br/>\nprogram would rate much higher in comparison to the medications.  I have now<br/>\nwitnessed the difference in Whitneys personality on Metadate CD, which<br/>\nworked well for her as far medication goes, versus dietary intervention.<br/>\nWith the latter, her little personality shines through much more tangibly.)<br/>\nThe site with the treatment ratings:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.revolutionhealth.com/drugs-treatments?stype=c&display_treatments=\">http://www.revolutionhealth.com/drugs-treatments?stype=c&display_treatments=</a><br/>\nt&q=Attention+Deficit+Hyperactivity+Disorder%2FAttention+Deficit+Disorder+pr<br/>\nedominant+hyperative-impulsive<br/>\n<br/>\nTaking the plunge:<br/>\n<br/>\nAs a result of this and other data (including posts on<br/>\nFeingold-Program4us@YahooGroups), I finally took the plunge.  Within 1 ½<br/>\nweeks of starting the diet, her headaches were gone and have not returned.<br/>\nThat was many months ago.  Over the following few weeks, I began to realize<br/>\nthat we were seeing improvements in many of her ADHD symptoms, including<br/>\neye-contact, listening, self-control, attitude, and cooperation.  In her<br/>\ncase, her hyperactivity seemed to remain until we started the additional<br/>\nprotocol of supplements and further dietary restriction under the<br/>\nsupervision of a DAN! Doctor.  Also, she appears healthier overall.  I just<br/>\nnow remembered how pale she used to look at times.  Her appetite has<br/>\nimproved, even when compared to when she was not on medication.  She has<br/>\nbecome less of a picky eater.  Her signs of anxiety (picking at lip, biting<br/>\nnails) have disappeared.  Her TV addiction is gone.  She no longer makes<br/>\nnegative comments about herself.  (Yes, she had severe symptoms of ADHD.)  I<br/>\nwas so used to the old meltdowns over small issues (after the meds wore off<br/>\nin the afternoon) that I sometimes still brace for a meltdown when I have to<br/>\ndeny her something, when, to my pleasant surprise, she moves right on<br/>\nwithout a trace of disappointment.<br/>\n<br/>\nMore evidence:<br/>\n<br/>\nI would have continued to think that only 3 percent or so, as indicated by<br/>\nthe mainstream medical community, are helped by dietary intervention, and<br/>\nthat Whitney was one of them.  I *would* have thought thatif it hadnt been<br/>\nfor the overwhelming evidence that I encountered to the contrary during my<br/>\njourney.  I recently heard it said that truth hangs together.  That really<br/>\nstruck a chord with me, as I have gleaned pieces of information and<br/>\nfamilies stories from so many different sources over time.  These pieces<br/>\nbegan to slowly fit together as do pieces of a puzzle.  Even on support<br/>\ngroups that are treatment neutral, when the topic of dietary intervention<br/>\narises, almost all I ever witness are posts about how helpful it has been.  <br/>\nIn fact, I have yet to discover a family either through personal<br/>\nconversation or through online support groups who systematically tried the<br/>\nFeingold program and did not ultimately witness noticeable improvements.<br/>\n(This is certainly not to say that the effectiveness rate overall is as high<br/>\nas what I have witnessed.  These are just the facts of my personal<br/>\nexperience.)  I am aware that there are occasional posts (quite the<br/>\nexception) on the Feingold list by families who have not seen very much in<br/>\nresults so far.  Usually, the moderator or others on the list encourage such<br/>\nfamilies to review their skin-care products, toothpastes, home cleaning<br/>\nagents, brands of vitamins, etc.  I have not noticed whether those families<br/>\n(or that family; it may have been only one) eventually saw more results.<br/>\nThe Feingold Association recognizes that some ADHD-sufferers do not respond<br/>\nto the Feingold program alone.  The Association suggests that additional<br/>\ndietary intervention, such as avoiding corn syrup, MSG, gluten, casein, may<br/>\nbe required in some cases.  It also recognizes that many are helped further<br/>\n(as was Whitney) through DAN! Protocols.<br/>\n<br/>\nI shared our experience with two families in my community, who then<br/>\n(skeptically in one case) tried Feingold.  No skepticism remains in either<br/>\nfamily.  When I share Whitneys success with friends and acquaintances, they<br/>\nsometimes tell me about someone they know who had a similar experience with<br/>\ndietary intervention.  Again, I never hear the oppositethat they know of<br/>\nsomeone for whom it did not work.<br/>\n<br/>\nThose who are on the cutting edge of the biomedical approaches are<br/>\nincreasingly recognizing the link/overlap between ADHD and autism.  The<br/>\nreason many parents are also of this opinion is that they have seen their<br/>\nchildren improve from Autism to having ADHD only, and, not uncommonly, they<br/>\ncontinue to improve from there.  So it was interesting to discover that,<br/>\nafter Whitney underwent lab tests as ordered by her DAN! Doctor, her urinary<br/>\noxalates were found to be over 73 (mmol/mol creatinine).  The median level<br/>\nfor neurotypical children is around 12; for autistic around 71.  (There were<br/>\nsome other lab results that also came back out of normal range, but not as<br/>\nmuch so as for autistic children.)  <br/>\n<br/>\nI mention this about oxalates in order to introduce another puzzle piece in<br/>\nmy experience with ADHD and biomedical causes.  I set up a lunch with<br/>\nsomeone who had facilitated a few local CHADD support-group meetings.  Her<br/>\nadult son has ADHD, and she works professionally with ADHD-sufferers, so I<br/>\nwanted to share with her what I had learned.  She did not know much about<br/>\ndietary intervention, but she was aware that her son reacted to artificial<br/>\nfood coloring.  When I told her about the link between oxalates and kidney<br/>\nstones, she told me that her son had already passed three stones, and he is<br/>\nonly in his twenties!<br/>\n<br/>\nThese are just a few examples of the confirmations that I encounter at every<br/>\nturn that the vast majority of ADHD-sufferers would probably see significant<br/>\nimprovement through individualized biomedical treatment approaches<br/>\n(including dietary intervention and supplements).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They do not help the true ADHD since that is a brain chemical /transmitter<br/>\n </span></blockquote>disconnection and not some dye or food product causing it.<br/>\n<br/>\nThe biomedical professional community seems to now be of the opinion that<br/>\nthis is not an either/or proposition.  In other words, yes, ADHD involves<br/>\nproblems with chemical transmitters in the brain, *and* the evidence is in<br/>\nthat, for a majority, biomedical issues (including digestive disorders and<br/>\nfood-sensitivities) are causing the neurotransmitters not to fire<br/>\nneurotypically.<br/>\n<br/>\nThe studies:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; BUT, I do know from a family members experiences that dyes (usually reds)<br/>\n </span></blockquote>and some food products do cause hyperactivity and outbursts.  So if you take<br/>\nthose foods away it helps greatly. All in all, a diet cannot fix ADHD, it<br/>\nhas been proven over and over again.  <br/>\n<br/>\nMight you be able to share your sources for this proof?  Im not trying to<br/>\nput you on the spot, but I would like to be able to review and perhaps<br/>\neventually respond.  (My whole goal here is to prevent families from being<br/>\ndissuaded from trying the biomedical approach based on faulty evidence<br/>\nregarding success rates.  I dont want to see other children and parents<br/>\nsuffer needlessly, when there is so relatively little to be lost in trying<br/>\nsuch an approach.)  <br/>\n<br/>\nFor example, most of the studies to date addressed only artificial colorings<br/>\nand preservatives (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.feingold.org/pg-research.html)\">http://www.feingold.org/pg-research.html)</a>.  Yet the lay<br/>\nperson ends up with the impression that the whole Feingold program has been<br/>\nstudied.  Let me explain why such results are very misleading, even about<br/>\nthe additives that *were* tested, due to what I call the masking effect.<br/>\nThe experience of families on the Feingold program is that *any* category of<br/>\ninfraction can cause a behavioral reaction.  So, it requires the elimination<br/>\nof *all* categories of banned foods to achieve good results in many cases.<br/>\nIt is like a car chained to a fence by four strong chains.  If you cut one<br/>\nchain, and then test (however scientifically) to see if the car can move<br/>\nwhen one chain is cut, you might wrongly conclude that cutting chains is an<br/>\nineffective remedy for a stubborn car.  The three other chains masked what<br/>\nwould have otherwise tested as an effective measure for releasing the car.<br/>\nMy research has shown that most who try Feingold discover that they are<br/>\nsensitive to at least some of the fruits and vegetables which are high in<br/>\nsalycilates.  (Such  fruits and vegetables are eliminated during the first<br/>\nstage of the Feingold program.)  Such sensitivities in test participants<br/>\nwould have masked the effectiveness of the elimination of other banned<br/>\nfoods.<br/>\n<br/>\nThere was a double-blind, placebo-controlled study of the effects of<br/>\nartificial food colorings and benzoate preservatives on hyperactivity.  Not<br/>\nsurprisingly, the conclusion was that these additives had an adverse effect<br/>\non the children.  What is surprising is that the test used only 20 mg per<br/>\nday of coloring, considering that only one tablespoon of green ketchup (the<br/>\nstudy was in the UK) contains 150 mg of coloring.  Imagine how much *more*<br/>\nimpressive the test results might have been had it been designed to more<br/>\nclosely match the real world.<br/>\n<br/>\nHere is the Feingold link to studies and articles published in peer reviewed<br/>\njournals: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.feingold.org/pg-research.html.\">http://www.feingold.org/pg-research.html.</a>  <br/>\n<br/>\nEvidence can come from many sources, and the attempt-to-be-scientific<br/>\ncommunity does not have a corner on it, especially when they do a poor job<br/>\nof duplicating the real world.  It seems to me that real-world evidence is<br/>\nparents who witness their childrens behavior and response to dietary<br/>\nintervention in the real world, and then share it so that others in the real<br/>\nworld may benefit.<br/>\n<br/>\nFollowing a biomedical approach:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But food sensitivities it does help, so if it lowers the childs symptoms<br/>\n </span></blockquote>then it is worth it for most.  The Feingold diet is extremely hard to follow<br/>\n& maintain and most people cannot do it long.  <br/>\n<br/>\nThe Feingold program is a lot of work in the beginning in terms of being<br/>\ntime-consuming.  Those of us who continue to follow Feingold report that it<br/>\nsoon becomes relatively easy, once the new routines are established.  Was<br/>\nthere a study on what percentage of those starting Feingold were able to<br/>\ncontinue it?  These claims about how hard the program is are part of what<br/>\ndissuaded me for too long from starting on what turned out to be a<br/>\nmiraculous journey.  <br/>\n<br/>\nThe question is Is it worth it?  To me, absolutely.  Once I realized that<br/>\nWhitney really has digestive tract issues, what other aspects of her health<br/>\ncould be affected in insidious ways over time if she does not receive proper<br/>\ndietary treatment (as though living with ADHD alone was not enough of a<br/>\nchallenge)?  If this real-world evidence is valid, all of us involved with<br/>\nADHD might ask ourselves the same question about ourselves and our loved<br/>\nones.<br/>\n<br/>\nBesides Feingold, Whitney is gluten-free, casein-free, and<br/>\noxalates-restricted, so my workload is much greater than that required for<br/>\nFeingold alone.  Yet the extra time required to control her diet is more<br/>\nthan made up for by the reduced workload of parenting a far less challenging<br/>\nchild, by having a household that is many times more calm than it was.<br/>\nAlso, the food control workload is not emotionally draining the way<br/>\nparenting a challenging child was.<br/>\n<br/>\nChildrens compliance with dietary control:<br/>\n<br/>\nAnother important point for those considering a biomedical approach is that<br/>\nthe longer you wait (i.e. the older your child becomes), the harder it is to<br/>\ngain your childs compliance, which could, in turn, impact the rest of your<br/>\nchilds life.  Also, it may seem daunting, because you know how hard it will<br/>\nbe to gain compliance from your oppositional child.  It may be harder at<br/>\nfirst, but remember that as childrens health (and brain function) improve,<br/>\nso does their level of compliance (and harmony in the home).<br/>\n<br/>\nHelp for adult ADHD also:<br/>\n<br/>\nThese approaches seem to also have a high rate of success among adults with<br/>\nAD/HD (including my moms husband, who started Feingold earlier this year).<br/>\nHoping this Helped:<br/>\nI so hope this helps.  The only reason that I have spent so much of my<br/>\nprecious and limited time on this is for the sake of other sweet children<br/>\n(like my dear Whitney) and their parents.  It would be easy for me to forget<br/>\nabout support groups now that things are so much easier in my life.  But<br/>\nthat would feel like, Ive got mine; pull up the ladder.  When ADHD<br/>\naffects so many, so profoundly, I cannot, in good conscience, do that.<br/>\n<br/>\nKaren in Temecula wine country</div>","specialLinks":[]},{"userId":242367849,"authorName":"Karen","from":"&quot;Karen&quot; &lt;kb@...&gt;","profile":"busy_karen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:intense & very strong willed 4 year old (now adding Biomedical Underpinnings)","postDate":"1193698873","msgId":27429,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxODMwMWM4MWE3ZiQ5YjNhMDllMCRkMWFlMWRhMCRAY29tPg=="},"prevInTopic":27428,"nextInTopic":27430,"prevInTime":27428,"nextInTime":27430,"topicId":27426,"numMessagesInTopic":0,"msgSnippet":"Finally, below is my long testimonial as a former skeptic about diet and supplements for ADHD.  It is in the form of replies to a post (on another list)","messageBody":"<div id=\"ygrps-yiv-309519026\">Finally, below is my long testimonial as a former skeptic about diet and<br/>\nsupplements for ADHD.  It is in the form of replies to a post (on another<br/>\nlist) challenging their effectiveness.  Its not just about how it worked<br/>\nfor us; its also about the evidence that the success rates are tremendous.<br/>\nIts quite long, but I urge list-mates who may be dealing with these issues<br/>\nto print it out and read it at your leisure, so that you dont miss out on<br/>\nany parts which may be important to you in your journey.<br/>\n<br/>\nKaren<br/>\n<br/>\n<br/>\nOriginal testimonial post:<br/>\n<br/>\nRE: Feingold program and biomedical approach<br/>\n(Long post, so I have broken it into sections with headings.)<br/>\n<blockquote><span title=\"ireply\"> &gt;  Most of the &quot;diets&quot; that are out there that say they help ADHD only help<br/>\n </span></blockquote>those that ALSO have food sensitivities that cause the ADHD symptoms.<br/>\nWhat I have witnessed statistically is that the vast majority of those with<br/>\nADHD symptoms actually do have those food sensitivities (discovered only<br/>\nafter the possibility is explored systematically), which is exactly why the<br/>\nproperly-executed and individually-tailored diets are helping so many.  <br/>\nMy journey as a skeptic:<br/>\nI was a big skeptic of the ability of diet (beyond a balanced diet) and<br/>\nsupplements to help ADHD.  I thought I was too educated to fall for that<br/>\nnaturopathic stuff.  I had read statements from the American Academy of<br/>\nPediatrics and CHADD and couldnt figure out why parents were still<br/>\nbothering to pursue nutritionally-based alternative treatments.  My DD<br/>\nWhitney is adopted and ADHD-wise, she is a carbon copy of her birthfather.<br/>\nSo it seemed to me that it was clearly genetics in her case.  I thought,<br/>\nSince its so obvious that its genetic, it is very unlikely that food<br/>\nsensitivities would play a role in her case anyway.  Besides, it seemed to<br/>\nme that if it was food-related (digestive tract-related), I would see more<br/>\nups and downs in her behavior, rather than the consistent non-stop<br/>\nhyperactive-impulsive 24/7 Texas Tornado, as we called her.<br/>\nBut I was relentless in my pursuit of more information about ADHDall<br/>\naspects in all forms.  One day it occurred to me that food sensitivities<br/>\nthemselves can have a genetic component.  But I still wasnt convinced<br/>\nenough that it would help her for us to go through the hassle of trying a<br/>\ndifficult elimination diet; our household was chaotic enough already.<br/>\nHowever, she had had chronic headaches for a long time, and her doctors at<br/>\nthat time did not seem interested in pursuing a cause.  I felt that I had to<br/>\ndo *something* about her headaches.  It seemed that an elimination diet such<br/>\nas Feingold would have a greater likelihood of at least helping her<br/>\nheadaches.  But before I could bring myself to pay for a Feingold<br/>\nAssociation membership, I still wanted more independent evidence that I was<br/>\nnot about to be scammed.  The membership is relatively cheap, but it was the<br/>\nprinciple of not giving even one dollar to scammers.  As a result of a bit<br/>\nof further research, I found this article in BBC News and others like it:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://news.bbc.co.uk/1/hi/education/2404169.stm\">http://news.bbc.co.uk/1/hi/education/2404169.stm</a><br/>\nI also found interesting results on a website which allows users to rate<br/>\nvarious treatments for each of various medical conditions.  For the<br/>\nhyperactive Impulsive type, the users currently rate Diet: Feingold 8.7<br/>\nout of 10.  They rate Adderall 7.1, Dexedrine 9.0,  Methylphenidate 6.9,<br/>\nRitalin LA 8.0, and Strattera 4.6.  (If the ratings were to factor in the<br/>\nimportance of treating underlying causes, I believe that the Feingold<br/>\nprogram would rate much higher in comparison to the medications.  I have now<br/>\nwitnessed the difference in Whitneys personality on Metadate CD, which<br/>\nworked well for her as far medication goes, versus dietary intervention.<br/>\nWith the latter, her little personality shines through much more tangibly.)<br/>\nThe site with the treatment ratings:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.revolutionhealth.com/drugs-treatments?stype=c&display_treatments=\">http://www.revolutionhealth.com/drugs-treatments?stype=c&display_treatments=</a><br/>\nt&q=Attention+Deficit+Hyperactivity+Disorder%2FAttention+Deficit+Disorder+pr<br/>\nedominant+hyperative-impulsive <br/>\nTaking the plunge:<br/>\nAs a result of this and other data (including posts on<br/>\nFeingold-Program4us@YahooGroups), I finally took the plunge.  Within 1 ½<br/>\nweeks of starting the diet, her headaches were gone and have not returned.<br/>\nThat was many months ago.  Over the following few weeks, I began to realize<br/>\nthat we were seeing improvements in many of her ADHD symptoms, including<br/>\neye-contact, listening, self-control, attitude, and cooperation.  In her<br/>\ncase, her hyperactivity seemed to remain until we started the additional<br/>\nprotocol of supplements and further dietary restriction under the<br/>\nsupervision of a DAN! Doctor.  Also, she appears healthier overall.  I just<br/>\nnow remembered how pale she used to look at times.  Her appetite has<br/>\nimproved, even when compared to when she was not on medication.  She has<br/>\nbecome less of a picky eater.  Her signs of anxiety (picking at lip, biting<br/>\nnails) have disappeared.  Her TV addiction is gone.  She no longer makes<br/>\nnegative comments about herself.  (Yes, she had severe symptoms of ADHD.)  I<br/>\nwas so used to the old meltdowns over small issues (after the meds wore off<br/>\nin the afternoon) that I sometimes still brace for a meltdown when I have to<br/>\ndeny her something, when, to my pleasant surprise, she moves right on<br/>\nwithout a trace of disappointment.<br/>\nMore evidence:<br/>\nI would have continued to think that only 3 percent or so, as indicated by<br/>\nthe mainstream medical community, are helped by dietary intervention, and<br/>\nthat Whitney was one of them.  I *would* have thought thatif it hadnt been<br/>\nfor the overwhelming evidence that I encountered to the contrary during my<br/>\njourney.  I recently heard it said that truth hangs together.  That really<br/>\nstruck a chord with me, as I have gleaned pieces of information and<br/>\nfamilies stories from so many different sources over time.  These pieces<br/>\nbegan to slowly fit together as do pieces of a puzzle.  Even on support<br/>\ngroups that are treatment neutral, when the topic of dietary intervention<br/>\narises, almost all I ever witness are posts about how helpful it has been.  <br/>\nIn fact, I have yet to discover a family either through personal<br/>\nconversation or through online support groups who systematically tried the<br/>\nFeingold program and did not ultimately witness noticeable improvements.<br/>\n(This is certainly not to say that the effectiveness rate overall is as high<br/>\nas what I have witnessed.  These are just the facts of my personal<br/>\nexperience.)  I am aware that there are occasional posts (quite the<br/>\nexception) on the Feingold list by families who have not seen very much in<br/>\nresults so far.  Usually, the moderator or others on the list encourage such<br/>\nfamilies to review their skin-care products, toothpastes, home cleaning<br/>\nagents, brands of vitamins, etc.  I have not noticed whether those families<br/>\n(or that family; it may have been only one) eventually saw more results.<br/>\nThe Feingold Association recognizes that some ADHD-sufferers do not respond<br/>\nto the Feingold program alone.  The Association suggests that additional<br/>\ndietary intervention, such as avoiding corn syrup, MSG, gluten, casein, may<br/>\nbe required in some cases.  It also recognizes that many are helped further<br/>\n(as was Whitney) through DAN! Protocols.<br/>\nI shared our experience with two families in my community, who then<br/>\n(skeptically in one case) tried Feingold.  No skepticism remains in either<br/>\nfamily.  When I share Whitneys success with friends and acquaintances, they<br/>\nsometimes tell me about someone they know who had a similar experience with<br/>\ndietary intervention.  Again, I never hear the oppositethat they know of<br/>\nsomeone for whom it did not work.<br/>\nThose who are on the cutting edge of the biomedical approaches are<br/>\nincreasingly recognizing the link/overlap between ADHD and autism.  The<br/>\nreason many parents are also of this opinion is that they have seen their<br/>\nchildren improve from Autism to having ADHD only, and, not uncommonly, they<br/>\ncontinue to improve from there.  So it was interesting to discover that,<br/>\nafter Whitney underwent lab tests as ordered by her DAN! Doctor, her urinary<br/>\noxalates were found to be over 73 (mmol/mol creatinine).  The median level<br/>\nfor neurotypical children is around 12; for autistic around 71.  (There were<br/>\nsome other lab results that also came back out of normal range, but not as<br/>\nmuch so as for autistic children.)  <br/>\n<br/>\nI mention this about oxalates in order to introduce another puzzle piece in<br/>\nmy experience with ADHD and biomedical causes.  I set up a lunch with<br/>\nsomeone who had facilitated a few local CHADD support-group meetings.  Her<br/>\nadult son has ADHD, and she works professionally with ADHD-sufferers, so I<br/>\nwanted to share with her what I had learned.  She did not know much about<br/>\ndietary intervention, but she was aware that her son reacted to artificial<br/>\nfood coloring.  When I told her about the link between oxalates and kidney<br/>\nstones, she told me that her son had already passed three stones, and he is<br/>\nonly in his twenties!<br/>\n<br/>\nThese are just a few examples of the confirmations that I encounter at every<br/>\nturn that the vast majority of ADHD-sufferers would probably see significant<br/>\nimprovement through individualized biomedical treatment approaches<br/>\n(including dietary intervention and supplements).<br/>\n<blockquote><span title=\"ireply\"> &gt; They do not help the true ADHD since that is a brain chemical /transmitter<br/>\n </span></blockquote>disconnection and not some dye or food product causing it.<br/>\nThe biomedical professional community seems to now be of the opinion that<br/>\nthis is not an either/or proposition.  In other words, yes, ADHD involves<br/>\nproblems with chemical transmitters in the brain, *and* the evidence is in<br/>\nthat, for a majority, biomedical issues (including digestive disorders and<br/>\nfood-sensitivities) are causing the neurotransmitters not to fire<br/>\nneurotypically.<br/>\nThe studies:<br/>\n<blockquote><span title=\"ireply\"> &gt; BUT, I do know from a family members experiences that dyes (usually reds)<br/>\n </span></blockquote>and some food products do cause hyperactivity and outbursts.  So if you take<br/>\nthose foods away it helps greatly. All in all, a diet cannot fix ADHD, it<br/>\nhas been proven over and over again.  <br/>\nMight you be able to share your sources for this proof?  Im not trying to<br/>\nput you on the spot, but I would like to be able to review and perhaps<br/>\neventually respond.  (My whole goal here is to prevent families from being<br/>\ndissuaded from trying the biomedical approach based on faulty evidence<br/>\nregarding success rates.  I dont want to see other children and parents<br/>\nsuffer needlessly, when there is so relatively little to be lost in trying<br/>\nsuch an approach.)  <br/>\nFor example, most of the studies to date addressed only artificial colorings<br/>\nand preservatives (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.feingold.org/pg-research.html)\">http://www.feingold.org/pg-research.html)</a>.  Yet the lay<br/>\nperson ends up with the impression that the whole Feingold program has been<br/>\nstudied.  Let me explain why such results are very misleading, even about<br/>\nthe additives that *were* tested, due to what I call the masking effect.<br/>\nThe experience of families on the Feingold program is that *any* category of<br/>\ninfraction can cause a behavioral reaction.  So, it requires the elimination<br/>\nof *all* categories of banned foods to achieve good results in many cases.<br/>\nIt is like a car chained to a fence by four strong chains.  If you cut one<br/>\nchain, and then test (however scientifically) to see if the car can move<br/>\nwhen one chain is cut, you might wrongly conclude that cutting chains is an<br/>\nineffective remedy for a stubborn car.  The three other chains masked what<br/>\nwould have otherwise tested as an effective measure for releasing the car.<br/>\nMy research has shown that most who try Feingold discover that they are<br/>\nsensitive to at least some of the fruits and vegetables which are high in<br/>\nsalycilates.  (Such  fruits and vegetables are eliminated during the first<br/>\nstage of the Feingold program.)  Such sensitivities in test participants<br/>\nwould have masked the effectiveness of the elimination of other banned<br/>\nfoods.<br/>\nThere was a double-blind, placebo-controlled study of the effects of<br/>\nartificial food colorings and benzoate preservatives on hyperactivity.  Not<br/>\nsurprisingly, the conclusion was that these additives had an adverse effect<br/>\non the children.  What is surprising is that the test used only 20 mg per<br/>\nday of coloring, considering that only one tablespoon of green ketchup (the<br/>\nstudy was in the UK) contains 150 mg of coloring.  Imagine how much *more*<br/>\nimpressive the test results might have been had it been designed to more<br/>\nclosely match the real world.<br/>\nHere is the Feingold link to studies and articles published in peer reviewed<br/>\njournals: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.feingold.org/pg-research.html.\">http://www.feingold.org/pg-research.html.</a>  <br/>\nEvidence can come from many sources, and the attempt-to-be-scientific<br/>\ncommunity does not have a corner on it, especially when they do a poor job<br/>\nof duplicating the real world.  It seems to me that real-world evidence is<br/>\nparents who witness their childrens behavior and response to dietary<br/>\nintervention in the real world, and then share it so that others in the real<br/>\nworld may benefit.<br/>\nFollowing a biomedical approach:<br/>\n<blockquote><span title=\"ireply\"> &gt; But food sensitivities it does help, so if it lowers the childs symptoms<br/>\n </span></blockquote>then it is worth it for most.  The Feingold diet is extremely hard to follow<br/>\n& maintain and most people cannot do it long.  <br/>\nThe Feingold program is a lot of work in the beginning in terms of being<br/>\ntime-consuming.  Those of us who continue to follow Feingold report that it<br/>\nsoon becomes relatively easy, once the new routines are established.  Was<br/>\nthere a study on what percentage of those starting Feingold were able to<br/>\ncontinue it?  These claims about how hard the program is are part of what<br/>\ndissuaded me for too long from starting on what turned out to be a<br/>\nmiraculous journey.  <br/>\n<br/>\nThe question is Is it worth it?  To me, absolutely.  Once I realized that<br/>\nWhitney really has digestive tract issues, what other aspects of her health<br/>\ncould be affected in insidious ways over time if she does not receive proper<br/>\ndietary treatment (as though living with ADHD alone was not enough of a<br/>\nchallenge)?  If this real-world evidence is valid, all of us involved with<br/>\nADHD might ask ourselves the same question about ourselves and our loved<br/>\nones.<br/>\n<br/>\nBesides Feingold, Whitney is gluten-free, casein-free, and<br/>\noxalates-restricted, so my workload is much greater than that required for<br/>\nFeingold alone.  Yet the extra time required to control her diet is more<br/>\nthan made up for by the reduced workload of parenting a far less challenging<br/>\nchild, by having a household that is many times more calm than it was.<br/>\nAlso, the food control workload is not emotionally draining the way<br/>\nparenting a challenging child was.<br/>\n<br/>\nChildrens compliance with dietary control:<br/>\n<br/>\nAnother important point for those considering a biomedical approach is that<br/>\nthe longer you wait (i.e. the older your child becomes), the harder it is to<br/>\ngain your childs compliance, which could, in turn, impact the rest of your<br/>\nchilds life.  Also, it may seem daunting, because you know how hard it will<br/>\nbe to gain compliance from your oppositional child.  It may be harder at<br/>\nfirst, but remember that as childrens health (and brain function) improve,<br/>\nso does their level of compliance (and harmony in the home).<br/>\n<br/>\nHelp for adult ADHD also:<br/>\n<br/>\nThese approaches seem to also have a high rate of success among adults with<br/>\nAD/HD (including my moms husband, who started Feingold earlier this year).<br/>\nHoping this Helped:<br/>\nI so hope this helps.  The only reason that I have spent so much of my<br/>\nprecious and limited time on this is for the sake of other sweet children<br/>\n(like my dear Whitney) and their parents.  It would be easy for me to forget<br/>\nabout support groups now that things are so much easier in my life.  But<br/>\nthat would feel like, Ive got mine; pull up the ladder.  When ADHD<br/>\naffects so many, so profoundly, I cannot, in good conscience, do that.<br/>\n<br/>\nKaren in Temecula wine country</div>","specialLinks":[]},{"userId":242367849,"authorName":"Karen","from":"&quot;Karen&quot; &lt;kb@...&gt;","profile":"busy_karen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:intense & very strong willed 4 year old (now adding Biomedical Underpinnings)","postDate":"1193698543","msgId":27428,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxN2YwMWM4MWE3ZSRkNzBiMWI5MCQ4NTIxNTJiMCRAY29tPg=="},"prevInTopic":27427,"nextInTopic":27429,"prevInTime":27427,"nextInTime":27429,"topicId":27426,"numMessagesInTopic":0,"msgSnippet":"The following is offered as evidence that the symptoms of ADHD for many represent sub-optimal functioning as opposed to just a personality difference: 1)\tThe","messageBody":"<div id=\"ygrps-yiv-1274684486\">The following is offered as evidence that the symptoms of ADHD for many<br/>\nrepresent sub-optimal functioning as opposed to just a personality<br/>\ndifference:<br/>\n<br/>\n1)\tThe growing body of evidence that behavior tends to &quot;normalize&quot; when<br/>\ntoxic food additives (or other offending foods) are eliminated.<br/>\n<br/>\n2) ADHD-like symptoms are often produced by a sleep disorder and then<br/>\ndisappear when the sleep issue is corrected, such as with tonsil removal<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://news.ktar.com/?nid=6&sid=565800.\">http://news.ktar.com/?nid=6&sid=565800.</a>  Also, sleep studies show that when<br/>\nhealthy, neuro-typical people are sleep deprived, they develop ADHD symptoms<br/>\n(until normal sleep is restored).  More than 40% of patients with ADHD<br/>\nreport significant sleep disturbance including insomnia and parasomnias.<br/>\n3)\tThe research is said to be fairly conclusive about smaller size of a<br/>\ncertain section of the brain, but I believe that the size may return to<br/>\nnormal when blood flow is increased to that part of the brain through<br/>\ndietary intervention, etc.<br/>\n4)\tSymptoms mimicked after head injuries.<br/>\n5)\tThe symptoms of ADHD correlate with the following to a significantly<br/>\nhigher degree:<br/>\n- Learning disabilities<br/>\n- Stuttering: Studies show that as many as 26% also stutter<br/>\n- Forgetfulness<br/>\n- Smoking of mother while pregnant<br/>\n- Childhood lead exposure<br/>\n- Chinks in the myelin sheath (insulation) that protects cerebral nerve<br/>\ncells (Girls tend to manufacture significantly more myelin sheath than boys,<br/>\nwhich may finally explain why so many more boys than girls have ADHD)<br/>\n- Fetal alcohol syndrome<br/>\n- Birth trauma<br/>\n- Concentrations of lead in the blood, exposure to lead<br/>\n- &quot;Left-neglect&quot; (This is when the brain sometimes misses visual cues on the<br/>\nleft side of one&#39;s field of vision, especially when bored, because the right<br/>\nside of brain seems to be involved in keeping us alert/awake when bored.)<br/>\n- Different eye-movement pattern (when watching something) from those<br/>\nwithout ADHD.  (In fact, there have been many breakthroughs in improving<br/>\nsymptoms of ADHD through &quot;behavioral optometry&quot;.)<br/>\n- Maternal stress (including emotional) doubles the risk of ADHD.<br/>\n- Allergic shiners (under the eyes)<br/>\n           - Sensory processing issues.<br/>\n           - More driving errors, car accidents. <br/>\n           - Bedwetting.<br/>\n           - Various digestive disorders<br/>\n 6)  In Neurology / Neuroscience News :  &quot;.Applying the model to children&#39;s<br/>\nbehavior revealed that stop signal task times are significantly longer in<br/>\nchildren with            attention deficit and hyperactivity disorders than<br/>\nin other children&quot; .<br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.medicalnewstoday.com/medicalnews.php?newsid=68295&nfid=rssfeeds)\">http://www.medicalnewstoday.com/medicalnews.php?newsid=68295&nfid=rssfeeds)</a><br/>\n<br/>\nFrom an article in the Rapid City Journal:<br/>\n&quot;ADD is viewed as a mental disorder, but it actually stems from brain<br/>\nstarvation, brain poisoning, overall brain stress and genetics. (Refer to my<br/>\nSeptember article for a description of all six ADD types. In its broad<br/>\ndefinition, ADD encompasses hyperactivity as well as other similar<br/>\nimbalances.)<br/>\n<br/>\nPsychiatrist Charles Gant, in his book &quot;ADD and ADHD Complementary Medicine<br/>\nSolutions,&quot; writes, &quot;Absolutely 100 percent of human beings, without<br/>\nexception, can be made to display the symptoms of inattentiveness by simply<br/>\ndriving their brains into chemical imbalance, either with enough of a toxin<br/>\nexposure (brain poisoning) and/or with enough of a nutritional deficiency<br/>\n(brain starvation).&quot;<br/>\n<br/>\nGant continues his reasoning by encouraging readers to remember the way they<br/>\nfelt when they had a bad case of flu. &quot;Did you become inattentive, restless<br/>\nand fidgety and have trouble sleeping? Did you lose motivation, feel lazy<br/>\nand lose interest in work? Did you become irritable and uncooperative? Of<br/>\ncourse you did. Are flu symptoms caused by psychological problems, by lack<br/>\nof social support or poor parenting? Of course not. That&#39;s ridiculous.<br/>\n<br/>\n&quot;The symptoms of inattentiveness, restlessness, fidgetiness, insomnia,<br/>\nlaziness, irritability and uncooperativeness were caused by brain poisoning<br/>\nwith viral and other toxins, and possibly worsened by malnutrition and<br/>\ndehydration.&quot;<br/>\n<br/>\nDid you just say &quot;wow&quot; because you have never thought about this? After the<br/>\nflu is over, we can balance our brain by nutritional support and cleansing<br/>\nour body and brain from poison; in the same way most ADD sufferers can<br/>\nrestore their brains to normal function by addressing all of the causes of<br/>\nits starvation and poisoning.&quot;<br/>\n<br/>\n<br/>\nFinally for now, from<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://news.yahoo.com/s/afp/20070412/hl_afp/healthchildren_070412154123\">http://news.yahoo.com/s/afp/20070412/hl_afp/healthchildren_070412154123</a> :<br/>\n&quot;A research team led by Professor Johannes Hebebrand of the University of<br/>\nDuisburg-Essen in western Germany studied 329 families in which one child<br/>\nhad attention-deficit hyperactivity disorder syndrome.  They found that a<br/>\ngreat majority -- around 70 percent -- had a combination of three mutations<br/>\nin the gene for the so-called dopamine transporter linked to hyperactivity.<br/>\n&#39;People who have this combination in both copies of the gene have a 2.5<br/>\nincreased ADHD risk. People with only one copy of this variant still have<br/>\nalmost twice the risk,&#39; Hebebrand said in a statement.&quot;<br/>\nI have a feeling that this mutation confers susceptibility to digestive<br/>\ndisorders.<br/>\n<br/>\nKaren</div>","specialLinks":[]},{"userId":242367849,"authorName":"Karen","from":"&quot;Karen&quot; &lt;kb@...&gt;","profile":"busy_karen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:intense & very strong willed 4 year old (now adding Biomedical Underpinnings)","postDate":"1193697957","msgId":27427,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxN2UwMWM4MWE3ZCQ3OWE4NWJkMCQ2Y2Y5MTM3MCRAY29tPg=="},"prevInTopic":27426,"nextInTopic":27428,"prevInTime":27426,"nextInTime":27428,"topicId":27426,"numMessagesInTopic":0,"msgSnippet":"My response to someone on another list: .","messageBody":"<div id=\"ygrps-yiv-320725196\">My response to someone on another list:<br/>\n<br/>\n.&lt;  Can someone give me information on Feingold, SCD, GFCF and supplements?<br/>\n<br/>\n...<br/>\n<br/>\nwww.feingold.org<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Feingold-Program4us@yahoogroups.com\">Feingold-Program4us@yahoogroups.com</a><br/>\n<br/>\nSCD = Specific Carbohydrate Diet (I think).  That&#39;s about all I know on SCD<br/>\n(besides that parents report good success with it).<br/>\n<br/>\nGFCF = gluten free (wheat and other), casein free (milk protein)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:GFCFKids@yahoogroups.com\">GFCFKids@yahoogroups.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:GFCFrecipes@yahoogroups.com\">GFCFrecipes@yahoogroups.com</a><br/>\n<br/>\nFor supplements: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ADHD_DrugFree@yahoogroups.com\">ADHD_DrugFree@yahoogroups.com</a><br/>\n<br/>\nAdditional resources:<br/>\nHealing the New Childhood Epidemics: Autism, ADHD, Asthma, and Allergies:<br/>\nThe Groundbreaking Program for the 4-A Disorders by Kenneth Bock, M.D., and<br/>\nCameron Stauth<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.naturaladd.com/resources/articles/nutrition_adhd.html\">http://www.naturaladd.com/resources/articles/nutrition_adhd.html</a><br/>\nChildren with Starving Brains, by Jane Hersey<br/>\nThe Brain-Gut Connection<br/>\nGut and Psychology Syndrome<br/>\nSpecial Diets for Special Kids<br/>\nWhy Can&#39;t My Child Behave by Jane Hersey<br/>\n12 Effective Ways to Help Your ADD/ADHD Child by Laura J. Stevens, M.S.<br/>\n<br/>\n<br/>\n<br/>\nKaren</div>","specialLinks":[]},{"userId":242367849,"authorName":"Karen","from":"&quot;Karen&quot; &lt;kb@...&gt;","profile":"busy_karen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:intense & very strong willed 4 year old (now adding Biomedical Underpinnings)","postDate":"1193697826","msgId":27426,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNzQwMWM4MWE3ZCQyYjkzNTg1MCQ4MmJhMDhmMCRAY29tPg=="},"prevInTopic":0,"nextInTopic":27427,"prevInTime":27425,"nextInTime":27427,"topicId":27426,"numMessagesInTopic":0,"msgSnippet":"To Julie and all who can really relate, These behaviors are very consistent with those of ADHD (as it is defined). I have been a huge researcher on this topic","messageBody":"<div id=\"ygrps-yiv-528459403\">To Julie and all who can really relate,<br/>\n<br/>\nThese behaviors are very consistent with those of ADHD (as it is defined).<br/>\nI have been a huge researcher on this topic due to my DD&#39;s similar/related<br/>\nissues (mostly former issues).  These behaviors are an *important sign* that<br/>\nthere are biomedical issues that need to be addressed.<br/>\n<br/>\nFor my DD, these behaviors are mostly former issues due to the Feingold<br/>\nprogram/diet (www.feingold.org) plus a gluten-free, casein-free diet, and<br/>\ndietary supplements under the supervision of her DAN! doctor.  DAN! stands<br/>\nfor Defeat Autism Now!, but these approaches are working well for a majority<br/>\nof those with ADHD.  Contrary to what the mainstream medical community would<br/>\nlead us to believe, the Feingold program is helping the vast majority of<br/>\nthose with these types of behavioral issues.  It is not always the *total*<br/>\nanswer, but it is usually an important foundational layer of improvement.<br/>\nOften, additional dietary supplements are required *regardless* of how<br/>\nbalanced the diet is.  Many of these children have chemical/nutritional<br/>\nimbalances such as low zinc, and many other issues of the digestive tract.<br/>\n<br/>\nMUST READ:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.dreddyclinic.com/ADHD/Digestive_&_Metabolic_Problems_Abound_in_Pa\">http://www.dreddyclinic.com/ADHD/Digestive_&_Metabolic_Problems_Abound_in_Pa</a><br/>\ntients_With_ADHD_&_Autism.pdf:<br/>\n  &quot;&#39;The GI tract in most of these patients is, to put it bluntly, a total<br/>\nmess&#39;, said Dr. Bradstreet. He insisted that without cleaning up the gut<br/>\nproblems, it is impossible to make headway in resolving ADHD and autism.<br/>\nLower GI dysfunction, enzyme deficiencies and impairments of hepatic<br/>\ndetoxification pathways are very common.&quot;<br/>\n<br/>\nI have been &quot;connecting the dots&quot; with both research and my experience with<br/>\nmany people in my life.  This stuff is very legitimate *and* important.<br/>\nUntreated underlying biomedical issues can lead to progressive problems<br/>\nthroughout life, both behavioral and physical.  Any doctor will not do.<br/>\nThey should know about the Organic Acid Test and others.<br/>\n<br/>\nI have more to say but will use separate posts for brevity.<br/>\n<br/>\n<br/>\n<br/>\nFor the sake of children and adults with ADHD and related conditions,<br/>\n<br/>\nKaren</div>","specialLinks":[]}],"prevTopicId":27419,"nextTopicId":27281}}