{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":184269211,"authorName":"rebecca de","from":"rebecca de &lt;rebeccadehate@...&gt;","profile":"rebeccadehate","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] just starting...","postDate":"1199711727","msgId":28786,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg1NDcxNy43MzYwNi5xbUB3ZWI1NjEwMy5tYWlsLnJlMy55YWhvby5jb20+","inReplyToHeader":"PGZsc2Z0OSt1YmtjQGVHcm91cHMuY29tPg=="},"prevInTopic":28783,"nextInTopic":0,"prevInTime":28785,"nextInTime":28787,"topicId":28783,"numMessagesInTopic":0,"msgSnippet":"Jesika, I m a lot like you are! my friend introduced me to unschooling a couple years ago (she s been unschooling her child since she was right out of","messageBody":"<div id=\"ygrps-yiv-1021778523\">Jesika,<br/>\n   <br/>\n     I&#39;m a lot like you are! my friend introduced me to unschooling a couple years ago (she&#39;s been unschooling her child since she was right out of kindergarten, her child is now 14 and phenomenal I must say...) anyway, I was having &quot;trouble&quot; with what and how to discipline my child when she said &quot;hey, why don&#39;t you look at this group&gt;&gt;&quot; so I did and light bulbs came on!! Since then I&#39;ve been observing and asking questions and unschooling myself basically.  I&#39;m a single mother so  figuring out how to make unschooling work is different -- but not undoable.  Ok so I&#39;ve been working and I worked at a daycare/preschool for a good 8 months. Which gave me an opportunity to try out my knew teaching degree, since I taught the pre-school portion for a while, and my sons got to come to work with me.  Now , here&#39;s the tricky part, even though I saw my son grow tremondously during that time I&#39;m not sure if it was just do to being in the &quot;schooly&quot; environment or if that was the year he<br/>\n would have normally grown socially.  Prior to working there I was going to a moms club functions and he was already learning his social skills there.  Personally, I grew there and also found out that I wanted to lean more towards unschooling for sure.  I was always in a mind struggle of wanting to let the kids at the daycare be more free but my boss wanted a straight and narrow structure, kids sitting at rug time (when they were only 2 - 21/2), quiet when transitioning from one thing to another, etc  etc...  I tried to always keep things moving so they weren&#39;t bored -- but at the same time it was what I wanted them to do not what they really wanted -- hence hyper children!! Imagine that.   So with that said I wouldn&#39;t beat yourself up for allowing your child to go to headstart.  He&#39;s only there for a  2-3 hours right (I started to send mine briefly but he really didn&#39;t want to get on the bus and I wasn&#39;t driving 4 days a week... lucked out though started daycare right<br/>\n after this...) and I know they give them quite a bit of free time (45 minutes I think) where they have lots of choices to choose from and I think the children get to pick ... then there&#39;s usually some rug time which is usually fast paced, a fun book and singing, and then some craft and snack usually.  Time goes pretty quick for them .  However, it is still structure and what the teacher choose rather than the children... but in my opinion I don&#39;t think he&#39;ll have to much unschooling to do..(but I&#39;m not a real experience unschooler yet). A suggestion I have is if you need that time to yourself (and you do1!!!) perhaps you could join a moms club of sort (MOMS INTL <br/>\n  moms offering moms support is international and may have one near you) and many of them have a child care co-op set up, then your child can have the socialization and you can have some freedom.  <br/>\nDoes all of this make sense? Just remember that what you choose for your family is the right thing to do at that time! As you grow and feel more comfortable with the process of unschooling it will fall into place!  I have to tell myself this all the time because I&#39;m slowly allowing myself to unschool and am leaning harder on doing it completely but I have choose to let my son go to kindergarten this year due to my working, unsurety, etc.  It was the right choice for the time.  I also have a controlling mother that I am learning to let go of the control and not allow her opinion to deter me. Which it does often!  <br/>\n   <br/>\n  Oh, I believe it&#39;s on Sandra Dodd&#39;s website that there is some information on unschooling while still letting your kids school.   <br/>\n   <br/>\n  well these are my thoughts and I hope they helped a little.  <br/>\njesika2starr &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jesika2starr@...\">jesika2starr@...</a>&gt; wrote:<br/>\n          Hello- <br/>\nI&#39;m Jesika. I&#39;ve been in this group forever it seems , but i never <br/>\nreally paid much attention until now. I wanted to secure my spot when <br/>\nmy DS was a baby, now hes 4 and has a 2 yo brother. so the time is <br/>\ngetting closer for me to be looking more into this thing. i had my <br/>\nmessages on daily digest for years, and rarely read them. I just <br/>\nrecently changed it to see every email. my mom made a comment to me <br/>\nthe other day, she said &quot; YA, know, I finally &quot;get&quot; unschooling <br/>\nnow.... I see that Echo(my DS) WANTS to learn, he wants to work on <br/>\nhis ABCs and #s&quot;<br/>\nthat was a huge thing for me , because we lived with her when i <br/>\nfound out about unschooling and she and my DH weren&#39;t thrilled about <br/>\nit. so here I am making baby steps. I do have him in head-start now- <br/>\nmainly for the break for me and social interaction for him.- but i <br/>\ndo not plan on sending him to regular school. Im curious about what <br/>\nyall think of headstart, will he need to be deschooled?- should i <br/>\njust take him out now?- he still has another year + the rest of this <br/>\none he can be there.<br/>\nAnother thing - i hope this isnt against the rules or anything, but i <br/>\nwas reading up on Dr. Ron Paul. and he is all for homeschooling and <br/>\nhelping families with it . as it is now - how do homeschooled or <br/>\nunschooled kids &quot;graduate&quot;.. and is it recognized at colleges?<br/>\nDr. Ron Pauls campaign site mentioned something about that - how he <br/>\nwould make sure that was done. Im just new to this and all these <br/>\npieces are falling into my lap - and it doesnt seem like a <br/>\ncoinincidence, so i feel now was the time to introduce myself and ask <br/>\na few questions. thanks yall.<br/>\njesika-mom to Echo 4 and Epic 2.<br/>\n<br/>\n<br/>\n<br/>\n                         <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nNever miss a thing.   Make Yahoo your homepage.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":107504422,"authorName":"jesika2starr","from":"&quot;jesika2starr&quot; &lt;jesika2starr@...&gt;","profile":"jesika2starr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"just starting...","postDate":"1199686377","msgId":28783,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZsc2Z0OSt1YmtjQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":28786,"prevInTime":28782,"nextInTime":28784,"topicId":28783,"numMessagesInTopic":0,"msgSnippet":"Hello- I m Jesika. I ve been in this group forever it seems , but i never really paid much attention until now. I wanted to secure my spot when my DS was a","messageBody":"<div id=\"ygrps-yiv-1523056239\">Hello- <br/>\nI&#39;m Jesika. I&#39;ve been in this group forever it seems , but i never <br/>\nreally paid much attention until now. I wanted to secure my spot when <br/>\nmy DS was a baby, now hes 4 and has a 2 yo brother. so  the time is <br/>\ngetting closer for me to be looking more into this thing. i had my <br/>\nmessages on daily digest for years, and rarely read them.  I just <br/>\nrecently changed it to see every email. my mom made a comment to me <br/>\nthe other day, she said &quot; YA, know, I finally &quot;get&quot; unschooling <br/>\nnow.... I see that Echo(my DS) WANTS to learn, he wants to work on <br/>\nhis ABCs and #s&quot;<br/>\n that was a huge thing for me , because we lived with her when i <br/>\nfound out about unschooling and she and my DH weren&#39;t thrilled about <br/>\nit.  so here I am making baby steps. I do have him in head-start now- <br/>\nmainly for the break  for me and social interaction for him.- but i <br/>\ndo not plan on sending him to regular school. Im curious about what <br/>\nyall think of headstart, will he need to be deschooled?- should i <br/>\njust take him out now?- he still has another year + the rest of this  <br/>\none he can be there.<br/>\nAnother thing - i hope this isnt against the rules or anything, but i <br/>\nwas reading up on Dr. Ron Paul. and he is all for homeschooling and <br/>\nhelping families with it . as it is now -  how do homeschooled or <br/>\nunschooled kids &quot;graduate&quot;.. and is it recognized at colleges?<br/>\nDr. Ron Pauls campaign site mentioned something about that - how he <br/>\nwould make sure  that was done. Im just new to this and all these <br/>\npieces are falling into my lap - and it doesnt seem like a <br/>\ncoinincidence, so i feel now was the time to introduce myself and ask <br/>\na few questions. thanks yall.<br/>\njesika-mom to Echo 4 and Epic 2.</div>","specialLinks":[]}],"prevTopicId":28785,"nextTopicId":28792}}