{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":275092036,"authorName":"nani","from":"nani &lt;nanismith@...&gt;","profile":"sophia_amara","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: feeling tired of it","postDate":"1244677368","msgId":40425,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk1OTc1QjA3LUFBNDAtNDE2QS05QzRCLUI1OENDOUJEOTc0OUBtYWMuY29tPg=="},"prevInTopic":40423,"nextInTopic":0,"prevInTime":40424,"nextInTime":40426,"topicId":40416,"numMessagesInTopic":0,"msgSnippet":"Thanks everyone for your replies. I did come to realize that my exhaustion has nothing to do with unschooling and everything with feeling like I don t get a","messageBody":"<div id=\"ygrps-yiv-431449406\">Thanks everyone for your replies. I did come to realize that my  <br/>\nexhaustion has nothing to do with unschooling and everything with  <br/>\nfeeling like I don&#39;t get a &quot;real&quot; break, as well as PMS and possibly  <br/>\nan underlying health issue that leads to feeling exhausted so much. I  <br/>\nwill certainly take steps in finding what can rebalance me and  <br/>\ntherefore my kids.<br/>\nHowever feeling like I have interests too, to carve out a niche  <br/>\nagainst the constant demand to be a mom, to regain my drive in life,  <br/>\nand to feel fulfilled I will need to restructure some aspects of my  <br/>\ndaily life. It&#39;s been so long now and I&#39;m so drained that I need to  <br/>\nwork on nutrition first, then find some alone time here or there (for  <br/>\nme to look forward to it has to be planned) and then add a new workout  <br/>\nregime that will invigorate me.<br/>\nSomething like that ;-)<br/>\nthanks for your support!<br/>\nNatalie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":47438875,"authorName":"Janice","from":"&quot;Janice&quot; &lt;janicecoleman@...&gt;","profile":"jwjcoleman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: feeling tired of it","postDate":"1244552637","msgId":40422,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgwbG1qdCtuZGc0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIyMDk4NS43ODczLnFtQHdlYjg2MjAxLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":40421,"nextInTopic":40423,"prevInTime":40421,"nextInTime":40423,"topicId":40416,"numMessagesInTopic":0,"msgSnippet":"... I felt that way when I had toddlers.  I did find a solution that helped which was to swap babysitting with someone in our playgroup. Is there someone who","messageBody":"<div id=\"ygrps-yiv-414589970\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; Maybe I&#39;m putting too much pressure on myself, but I&#39;m feeling really  <br/>\n&gt; tired of unschooling my kids (ages 2 and 4) at this point. I don&#39;t get  <br/>\n&gt; much of a break, as my dh feels pressured to make money with his  <br/>\n&gt; business and we&#39;re on the brink of financial collapse, as in we don&#39;t  <br/>\n&gt; know yet how to pay next months rent and food. <br/>\n<br/>\n </span></blockquote>I felt that way when I had toddlers.  I did find a solution that helped which was to swap babysitting with someone in our playgroup.<br/>\nIs there someone who you could switch off with a morning each week for babysitting?  For instance, she takes your kids on Tues. and you take hers on Thurs. Perhaps you could work those hours, or just do something for yourself like go to the library by yourself, join a local club, etc. Not only will you get a chance to recharge your batteries, but so will the other mom; so, its a twofer!<br/>\n<br/>\nJanice<br/>\n <br/>\nWhat we want to see is the child in pursuit of knowledge, not knowledge in pursuit of the child. - George Bernard Shaw</div>","specialLinks":[]},{"userId":62589750,"authorName":"JudithAnneMurphy@aol.com","from":"JudithAnneMurphy@...","profile":"shepherdlass","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: feeling tired of it","postDate":"1244545565","msgId":40423,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMxNS4zZWQ2M2E2MS4zNzVmOWMxZEBhb2wuY29tPg=="},"prevInTopic":40422,"nextInTopic":40425,"prevInTime":40422,"nextInTime":40424,"topicId":40416,"numMessagesInTopic":0,"msgSnippet":"-=- But  it isn t the unschooling that is coming between you and your children, it s  money, it s lying in bed making lists of things that have to happen for","messageBody":"<div id=\"ygrps-yiv-1979879554\">-=- But  it isn&#39;t the unschooling that is coming between you and your <br/>\nchildren, it&#39;s  money, it&#39;s lying in bed making lists of things that have to <br/>\nhappen for your  life to improve, it&#39;s stress, it&#39;s all the rest of life that is <br/>\nmaking it hard.  -=- <br/>\n-=-So  for awhile, I had a sign that I put up on my mirror that said &quot;It´s<br/>\nNOT the  unschooling, it´s ___________ and then I would fill in the<br/>\nblank. It´s not  the unschooling, it´s P.M.S. (That was a big one, thus<br/>\nthe once a month  nature of my panic attacks.) or It´s not the<br/>\nunschooling, it´s flu season. Or  it´s not the unschooling it´s time for<br/>\nthe in-laws to visit. (Another  biggie.) After I filled in enough<br/>\ndifferent variations, I realized that I  really needed only one sign to<br/>\nremind me what it´s all about. It´s not the  unschooling, it´s LIFE.-=- <br/>\nI&#39;m  so grateful that this thread came through right now, because (although <br/>\nour  situation is different to Nani&#39;s - and probably far less tiring) we&#39;ve <br/>\njust  had one of those weekends.  <br/>\nJess  has had one of her regular bouts of tonsillitis, and I think we&#39;ve <br/>\nbeen  suffering from the same bug at a low level.  Plus there&#39;s a fair bit of  <br/>\npre-teen hormonal stuff happening - the beginnings of PMS and  all.  And my <br/>\nexhaustion from a bad patch in my part-time job.  So,  this last weekend <br/>\nwhile we&#39;ve been cooped up in the house, I&#39;ve been convinced  Jess will become <br/>\nagoraphobic, or a computer games addict (this from a mother  who&#39;s normally <br/>\nevangelical about the wonder of the PC) and I&#39;ve been hovering  between <br/>\ntrying to convince myself that everything&#39;s okay and serious panic that  <br/>\nunschooling doesn&#39;t suit us.  And yet, I know deep down that most of the  things <br/>\nthat have been affecting us are completely external to  unschooling. <br/>\nI&#39;m  DEFINITELY going to put a sign on my mirror today. <br/>\nJude  x<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] feeling tired of it","postDate":"1244469530","msgId":40421,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyMDk4NS43ODczLnFtQHdlYjg2MjAxLm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDUwMEZBREY4LUJCNkQtNDdEMC1CMDFFLTg2RTg0ODlDMzQzRUBtYWMuY29tPg==","referencesHeader":"PDUwMEZBREY4LUJCNkQtNDdEMC1CMDFFLTg2RTg0ODlDMzQzRUBtYWMuY29tPg=="},"prevInTopic":40419,"nextInTopic":40422,"prevInTime":40420,"nextInTime":40422,"topicId":40416,"numMessagesInTopic":0,"msgSnippet":"It sounds like you suffering from a severe case of Mary Gold s It s not the unschooling, it s LIFE. http://sandradodd.com/gold/journey is the talk that s","messageBody":"<div id=\"ygrps-yiv-1021846814\">It sounds like you suffering from a severe case of Mary Gold&#39;s &quot;It&#39;s not the unschooling, it&#39;s LIFE.&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/gold/journey\">http://sandradodd.com/gold/journey</a> is the talk that&#39;s from. <br/>\n--------------<br/>\n<br/>\nI would add one more thing into that mix and that is balance. It’s<br/>\nunderstanding that all of life, and the learning that’s all wrapped up<br/>\nin our lives, has a natural rhythm, a natural balance to it.<br/>\nUnschooling isn’t something that looks the same every day. It’s not<br/>\nalways Shakespeare and it’s not always Sponge Bob. Some days will feel<br/>\nlike a learning bonanza, and others will just laze away providing the<br/>\nlulls that are needed for our brains to process and incorporate new<br/>\ninformation.<br/>\n<br/>\n<br/>\nThere were times, especially during that first year of unschooling that<br/>\nit seemed that at least once a month I was certain that unschooling was<br/>\nnot the way for us. It was a failure. It was not working. Stuff was<br/>\ngetting in the way. The kids were bored or I was cranky or the TV was<br/>\nbugging the heck out of me. That of course meant that they weren’t<br/>\nlearning anything, they would never learn anything and this whole<br/>\nunschooling experiment was a BIG failure!! <br/>\n<br/>\n<br/>\nBut it would pass, as cycles naturally do. And just as naturally my<br/>\nchildren would emerge with a newfound passion, a particularly<br/>\ninsightful question or a great new interest to pursue. Suddenly<br/>\nunschooling was working again. Imagine that. And as I began to get a<br/>\nfeel for this rhythm of our natural days and nights and weeks and<br/>\nmonths, I could see that it was NOT the unschooling that was the<br/>\nproblem. It was any number of normal, natural life occurrences. <br/>\n<br/>\n<br/>\nSo for awhile, I had a sign that I put up on my mirror that said “It’s<br/>\nNOT the unschooling, it’s ___________ and then I would fill in the<br/>\nblank. It’s not the unschooling, it’s P.M.S. (That was a big one, thus<br/>\nthe once a month nature of my panic attacks.) or It’s not the<br/>\nunschooling, it’s flu season. Or it’s not the unschooling it’s time for<br/>\nthe in-laws to visit. (Another biggie.) After I filled in enough<br/>\ndifferent variations, I realized that I really needed only one sign to<br/>\nremind me what it’s all about. It’s not the unschooling, it’s LIFE. <br/>\n<br/>\n<br/>\nIf you find yourself getting stressed and doubtful you might want to<br/>\ncreate your own sign, with your own understanding of what will fill in<br/>\nyour stress blanks. Perhaps it’s a pregnancy, a nursing toddler or a<br/>\nfearful 7-year-old. These are all occurrences in the natural path of<br/>\nour life cycles. We can let them get in the way and use them as an<br/>\nexcuse, or we can flow with them, around them and through them. Part of<br/>\nlife is about accepting those things that just ARE. Things happen. But<br/>\nit doesn’t mean that our kids are suddenly unable to learn. It just<br/>\nmeans that life is happening. And when life happens, learning happens<br/>\ntoo. <br/>\n<br/>\n---------------<br/>\n<br/>\nis the bit I&#39;m particularly thinking about. You are suffering from a stressful life and that&#39;s the thing you have to figure out how to deal with. How would it help to not be unschooling? What would be better for 2 and 4 year old and you if you had them in preschool or daycare? If those things are so much better for you and your family you should do that. But it isn&#39;t the unschooling that is coming between you and your children, it&#39;s money, it&#39;s lying in bed making lists of things that have to happen for your life to improve, it&#39;s stress, it&#39;s all the rest of life that is making it hard. <br/>\n<br/>\n<br/>\nCome up with a list of things that might help. Ask on your local list to see if there is anyone who might be willing to watch your kids for a little while, maybe in your house while you are home even. Set your kids up in the middle of the day, when you are feeling overwhelmed, with a movie and some food and a really cozy space and go sit somewhere comfortable and read, or just drift off. Get some of those relaxation tapes or mediate, do something so that you can refresh yourself. <br/>\n<br/>\n<br/>\nReally, though, imagine what it would be if you weren&#39;t at home with your children right now. What would you be doing? Would you be working some job and seeing your children at the edges of the day, in the morning rushing to get them to some place by a certain time and in the evening picking them up on the way home? Would you be constantly juggling their needs against your own instead of setting up a situation where the moments conflict between what you need and what they need are less frequent? Is the world you are imagining a life that came before children instead of a life that can honestly be encorporated with children? <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: nani &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nanismith@...\">nanismith@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Sunday, 7 June, 2009 10:20:30 PM<br/>\nSubject: [unschoolingbasics] feeling tired of it<br/>\n<br/>\nMaybe I&#39;m putting too much pressure on myself, but I&#39;m feeling really  <br/>\ntired of unschooling my kids (ages 2 and 4) at this point. I don&#39;t get  <br/>\nmuch of a break, as my dh feels pressured to make money with his  <br/>\nbusiness and we&#39;re on the brink of financial collapse, as in we don&#39;t  <br/>\nknow yet how to pay next months rent and food. I haven&#39;t followed my  <br/>\ncareer path, so I could unschool my kids and be there for them,  but  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"N CONFER","from":"N CONFER &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"feeling tired of it","postDate":"1244466652","msgId":40419,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1OTQ5NS40MzM4My5xbUB3ZWI4MzgwMS5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":40417,"nextInTopic":40421,"prevInTime":40418,"nextInTime":40420,"topicId":40416,"numMessagesInTopic":0,"msgSnippet":"Another Mom to a 2 and 4 year-old who is feeling stressed out. And this one is under financial stress as well.  It s hard. It is hard. Juggling money is","messageBody":"<div id=\"ygrps-yiv-388545181\">Another Mom to a 2 and 4 year-old who is feeling stressed out. And this one is under financial stress as well. <br/>\nIt&#39;s hard. It is hard. Juggling money is difficult. Caring for 2 toddlers is difficult -- no matter how you do it. It is physically and emotionally tiring. The combination can be draining.<br/>\nI have no solution -- other than the fact that they will get older and money problems ebb and flow. <br/>\nTake breaks when you can, get outside, pay the bills as you can and call the others to let them know you will be late, eat well, get enough sleep. All the stuff we all know we are supposed to do. Try to enjoy your kids. Lay off the &quot;progress&quot; idea and just enjoy. These can be lovely ages but everyone has their tear-your-hair-out moments. :)<br/>\nNance<br/>\n<br/>\nMaybe I&#39;m putting too much pressure on myself, but I&#39;m feeling really <br/>\ntired of unschooling my kids (ages 2 and 4) at this point. I don&#39;t get <br/>\nmuch of a break, as my dh feels pressured to make money with his <br/>\nbusiness and we&#39;re on the brink of financial collapse, as in we don&#39;t <br/>\nknow yet how to pay next months rent and food. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: feeling tired of it","postDate":"1244431142","msgId":40417,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgwaHZ2Nitzb3U2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDUwMEZBREY4LUJCNkQtNDdEMC1CMDFFLTg2RTg0ODlDMzQzRUBtYWMuY29tPg=="},"prevInTopic":40416,"nextInTopic":40419,"prevInTime":40416,"nextInTime":40418,"topicId":40416,"numMessagesInTopic":0,"msgSnippet":"~~Maybe I m putting too much pressure on myself, but I m feeling really tired of unschooling my kids (ages 2 and 4) at this point.~~ Technically they aren t","messageBody":"<div id=\"ygrps-yiv-953246091\">~~Maybe I&#39;m putting too much pressure on myself, but I&#39;m feeling really tired of unschooling my kids (ages 2 and 4) at this point.~~<br/>\n<br/>\n<br/>\nTechnically they aren&#39;t even school age yet, so &quot;not schooling&quot; them is just being their parent. Being a good parent should be the focus at whatever age your children are.<br/>\n<br/>\n<br/>\n~~ I don&#39;t get much of a break, as my dh feels pressured to make money with his business and we&#39;re on the brink of financial collapse, as in we don&#39;t know yet how to pay next months rent and food.~~<br/>\n<br/>\nThat&#39;s a life issue. You are the parents, you chose to have children and provide for them and until that is taken care of then it&#39;s a lot harder for joyful learning to happen.<br/>\n<br/>\n<br/>\n~~ Anyhow, just as this pressure is mounting I feel tired of being the one who is responsible for every bit of unschooling progress, ideas of what to do with the kids or even just playing with them.~~<br/>\n<br/>\nWhat do you mean by unschooling &quot;progress&quot;? Unschooling is about living life. Being with your children and enjoying them is a choice. Having children is a choice. Instead of thinking about &quot;progress&quot; or unschooling or anything else, figure out how to be fully present for your children.<br/>\n<br/>\n~~I&#39;m craving alone time to regroup my thoughts and enthusiasm, but I feel I need more than just a few hours, I feel I need DAYS and DAYS away. ~~<br/>\n<br/>\nIs it possible that you are dealing with depression? Either environmental (tough financial situations can do that) or chemical? You could get days and days away if you didn&#39;t have your children. Picture them not being in your life at all and maybe that will help you reframe just how important they really are and how precious time is. Children die. Parents die. Every moment together is a gift. Finding ways to fill yourself up every day would be better than running away for days and days. Don&#39;t let it get to the point where you want to leave for days. <br/>\n<br/>\nSmall children can be exhausting, true...but I feel that&#39;s part of the package of having children.<br/>\n<br/>\n<br/>\n~~ That&#39;s how I feel. I&#39;m impatient, sigh a lot, hate the  <br/>\nchores I constantly have to do and feel like my kids might be better off in a preschool.~~<br/>\n<br/>\nThey&#39;d be better off with people who truly enjoy them and want to spend time with them...so BE that person. The chores you have are a choice. The life you have is a choice. Things happen that we don&#39;t choose, but the life we have IS a choice and recognizing that can be a big step towards acceptance and change. <br/>\n<br/>\n~~Unschooling and constantly ebing around my kids  <br/>\n<blockquote><span title=\"ireply\"> &gt; takes so much out of me and I don&#39;t have many ideas anymore.~~<br/>\n<br/>\n </span></blockquote>Find people who enjoy children a lot and start hanging out with them. That should get ideas and energy flowing. Find people who wouldn&#39;t mind watching them once in a while and try to pinpoint the source of your distress. Is it the money? Is it having children? Is it the way you&#39;re percieving your own life that you chose? All of those things are worth thinking about. <br/>\n<br/>\nUnschooling isn&#39;t a recipe for some &quot;perfect&quot; life (though I think our lives are pretty durn great). But the first step towards anything, is to ENJOY parenting. Enjoy your children. The first step has little to do with unschooling and everything to do with being a better parent. If a person enjoys their children and cares deeply about being a mindful parent, then unschooling can be something worth talking about. <br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":275092036,"authorName":"nani","from":"nani &lt;nanismith@...&gt;","profile":"sophia_amara","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"feeling tired of it","postDate":"1244409630","msgId":40416,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwMEZBREY4LUJCNkQtNDdEMC1CMDFFLTg2RTg0ODlDMzQzRUBtYWMuY29tPg=="},"prevInTopic":0,"nextInTopic":40417,"prevInTime":40415,"nextInTime":40417,"topicId":40416,"numMessagesInTopic":0,"msgSnippet":"Maybe I m putting too much pressure on myself, but I m feeling really tired of unschooling my kids (ages 2 and 4) at this point. I don t get much of a break,","messageBody":"<div id=\"ygrps-yiv-889561333\">Maybe I&#39;m putting too much pressure on myself, but I&#39;m feeling really  <br/>\ntired of unschooling my kids (ages 2 and 4) at this point. I don&#39;t get  <br/>\nmuch of a break, as my dh feels pressured to make money with his  <br/>\nbusiness and we&#39;re on the brink of financial collapse, as in we don&#39;t  <br/>\nknow yet how to pay next months rent and food. I haven&#39;t followed my  <br/>\ncareer path, so I could unschool my kids and be there for them,  but  <br/>\nI&#39;m in a rut here.<br/>\nAnyhow, just as this pressure is mounting I feel tired of being the  <br/>\none who is responsible for every bit of unschooling progress, ideas of  <br/>\nwhat to do with the kids or even just playing with them. I&#39;m craving  <br/>\nalone time to regroup my thoughts and enthusiasm, but I feel I need  <br/>\nmore than just a few hours, I feel I need DAYS and DAYS away. I once  <br/>\nread a synopsis of a play in which a mother boarded herself into a  <br/>\ncloset with all her camping gear and would not come out anymore, she  <br/>\njust had it. That&#39;s how I feel. I&#39;m impatient, sigh a lot, hate the  <br/>\nchores I constantly have to do and feel like my kids might be better  <br/>\noff in a preschool. Unschooling and constantly ebing around my kids  <br/>\ntakes so much out of me and I don&#39;t have many ideas anymore. I admire  <br/>\nmoms or other people who actually GET energy from being around  <br/>\nchildren, in my case it sucks energy out of me. How can I plug this  <br/>\nhole??<br/>\nHave any of you been in my shoes?<br/>\nNatalie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":40289,"nextTopicId":40432}}