{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":23,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: autism","postDate":"1210917428","msgId":32898,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQTg1MzBDRjNERDE2MS0xNTY4LTIwNzVAd2VibWFpbC1kZDAzLnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PGcwaG5tZithMjRwQGVHcm91cHMuY29tPg=="},"prevInTopic":32890,"nextInTopic":0,"prevInTime":32896,"nextInTime":32899,"topicId":32741,"numMessagesInTopic":0,"msgSnippet":"... From: Paul H. Beaulieu II  I have been reading the posts on the group for answers to my questions about unschooling, and was","messageBody":"<div id=\"ygrps-yiv-602323691\">-----Original Message-----<br/>\nFrom: Paul H. Beaulieu II &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ballou12400@...\">ballou12400@...</a>&gt;<br/>\n<br/>\nI have been reading the posts on the group for answers to my questions<br/>\nabout unschooling, and was fustrated that I could not find answers to<br/>\nsome of my core concerns.<br/>\n<br/>\n-=-=-=--=<br/>\n<br/>\nThen you&#39;re not looking hard enough.<br/>\n<br/>\nWe&#39;ve answered all the questions and concerns you may have for years. I <br/>\nbet there&#39;s not *one* we haven&#39;t heard! &lt;g&gt;<br/>\n<br/>\nHave you read the archives here? Or just the last three days&#39; worth of <br/>\nmessages?<br/>\n<br/>\nHave you looked at and read through all of  <br/>\nwww.sandradodd.com/unschooling  or  www.joyfullyrejoycing.com ?<br/>\n<br/>\nHave you read Rue&#39;s book, Parenting a Free Child, An Unschooled Life?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n This is not only new to me and change can be<br/>\na bit difficult especially since i am proposing changing from something<br/>\nthat i know mainly how it works to an environment i am unfamiliar<br/>\nwith.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nJust as each and every one of us has/is.<br/>\n<br/>\nI don&#39;t think there&#39;s ONE person here who was unschooled as a child <br/>\n(except my 20 year old son, who occasionally reads here). We were all <br/>\ntraditionally parented (some better than others), and we all went to <br/>\nschool (some better than others).<br/>\n<br/>\nYou are no different.<br/>\n<br/>\nThe difference is that we have walked on both sides of the fence, and <br/>\nyou have been only on one. *WE* have made an educated decision. *You* <br/>\nare basing things on only one set of data.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\n Also i have not experienced any personal horrors in my own life<br/>\nnor in my daughters that were caused by traditional methods.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nMy childhood was decent. Not as good as it could have been. Not as good <br/>\nas my children&#39;s. But I was privileged in many ways. My school <br/>\nexperience was quite good, seeing as there was no homeschool option <br/>\nback then. I have a &quot;good education.&quot;<br/>\n<br/>\nI bet that, when you start actually *thinking* about the childhood you <br/>\nhad versus the childhood you *could* have had had your parents known <br/>\nbetter, you may feel different about your and your parents&#39; <br/>\n&quot;traditional methods.&quot;<br/>\n<br/>\nHad we not found this path, my boys would be in school. It&#39;s just that <br/>\nwe found something better. A lot better.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nI aknowledge that US appeals to my head and my heart but am a little<br/>\nskeptical without some sense of real understanding of the future.<br/>\n<br/>\n-==-=-=-<br/>\n<br/>\nAnd as soon as you can *tell* me the future, I&#39;ll buy that statement.<br/>\n<br/>\nNo one understands the future.<br/>\n<br/>\n-==-=-=-=-<br/>\n<br/>\nRemember i am putting the most valuable person in my life at risk here.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nAnd we&#39;re not?<br/>\n<br/>\n-=-=-=-==-<br/>\n<br/>\nplease recall what it was like to make these decisions for the first<br/>\ntime.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nI do. And it&#39;s scary. But as soon as you *understand* it, unschooling <br/>\nand mindful parenting make all the sense in the world.<br/>\n<br/>\nYou have to be open to it though. Quit fighting. Question with an open <br/>\nmind---not thinking about how it *won&#39;t* work. Think about how it <br/>\n*will*.<br/>\n<br/>\nSchools work with your weaknesses. Unschooling works with your <br/>\nstrengths.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nNow admittedly, my awareness of my frustration level should have caused<br/>\nme to stop and calm down and collect my thoughts better before writing<br/>\nto an open forum.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nDeep breaths. Give us concrete examples.<br/>\n<br/>\nThere&#39;s really not a question you can ask that we haven&#39;t already <br/>\nanswered at least once.<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: autism","postDate":"1210911946","msgId":32890,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwajJjYStjOThzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGcwaG5tZithMjRwQGVHcm91cHMuY29tPg=="},"prevInTopic":32878,"nextInTopic":32898,"prevInTime":32889,"nextInTime":32891,"topicId":32741,"numMessagesInTopic":0,"msgSnippet":"~~This is not only new to me and change can be a bit difficult especially since i am proposing changing from something that i know mainly how it works to an","messageBody":"<div id=\"ygrps-yiv-534133262\">~~This is not only new to me and change can be<br/>\na bit difficult especially since i am proposing changing from something<br/>\nthat i know mainly how it works to an environment i am unfamiliar<br/>\nwith.~~<br/>\n<br/>\n<br/>\nBelieve me, you&#39;ll find a lot of understanding about that issue, many<br/>\nof us have been there.<br/>\n<br/>\nI appreciate your ability to come back after that &quot;thrashing&quot; and<br/>\nbeing willing to openly discuss unschooling. I admit to having my<br/>\nfeathers ruffled in the first go round.:) I have a very intense child<br/>\nwho would probably have been diagnosed with a couple of labels but we<br/>\nchose to avoid that as we felt equipped to support him without that. <br/>\n<br/>\nI think you&#39;ll find an amazing amount of sympathy for the questions<br/>\nand fears that arise when one first encounters this lifestyle. So many<br/>\nof us have faced those questions, dug really deep and faced our fears.<br/>\nWhen someone comes along and accuses us of being willingly<br/>\nignorant...well, that&#39;s a tough one to swallow after SO much<br/>\nquestioning, stretching, changing and being willing to go where we<br/>\nweren&#39;t sure about going!<br/>\n<br/>\nSo anyway, I think if you can handle the intensity of those posts,<br/>\nyou&#39;ll be quite comfortable with a list designed for discussion<br/>\npurposes. Oh, critical thinking highly encouraged.:)<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: autism","postDate":"1210881673","msgId":32870,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZjkwMWM4YjZjNiQ2ZDY0MmE4MCQwMzAxYThjMEBiaWdzdXJwcmlzZT4="},"prevInTopic":32850,"nextInTopic":32878,"prevInTime":32869,"nextInTime":32871,"topicId":32741,"numMessagesInTopic":0,"msgSnippet":"I m far behind and haven t read this whole thread yet. *** we had her in a montessori school at first thinking that the freedom to learn would engender a sense","messageBody":"<div id=\"ygrps-yiv-797211560\">I&#39;m far behind and haven&#39;t read this whole thread yet.<br/>\n<br/>\n*** we had her in a montessori school at first<br/>\nthinking that the freedom to learn would engender a sense of self<br/>\ngratification and hopefully catapult her into a state of fulfillment<br/>\nthat i read about on this board.***<br/>\n<br/>\nThis is an unschooling list, not a Montessori list.   If you were expecting to see the benefits of unschooling while your daughter was enrolled in school that was an unrealistic expectation.   You should have expected the benefits of a Montessori education (whatever those are) and if she didn&#39;t receive those then that&#39;s a matter you should take up with her school.   <br/>\n<br/>\n***however that failed to materialize as<br/>\nshe chose to perseverate on specific tasks and areas so much that she<br/>\nwas turning into a one trick pony. ***<br/>\n<br/>\nLots of people specialize and do well.  We may think of Stephen Hawking as a physicist or mathematics professor but he&#39;s also someone&#39;s son, husband, father, grandfather, friend.  There&#39;s more to every life than what onlookers see.  Sometimes parents write that their kids aren&#39;t doing anything when the truth is their kids aren&#39;t doing the kinds of things the parents think they ought to be doing.   Sometimes they write and say &quot;all he ever does is....&quot; or something similar and in every case I&#39;ve seen, after the parent writes more, we find out the kid is doing LOTS of things, just not things the parent thinks of as meaningful.   <br/>\n<br/>\nKids who learn by immersing themselves in a certain thing until they&#39;ve absorbed everything they want can look to outsiders like they&#39;re only doing one thing.  But there&#39;s a lot going on in a learning mind, lots of connections being made and no matter how involved and intense a kid is they are always doing something else.  They eventually stop to sleep... they eat...they visit with family members, and in doing those things, they&#39;re learning all the time, too. <br/>\n<br/>\n&quot;One trick pony&quot; is pretty demeaning.  I know if you&#39;d given it more thought you could have come up with half a dozen things your daughter enjoyed doing.  You might have had to look beyond the things you consider worthwhile.    Maybe you don&#39;t understand yet that unschooling doesn&#39;t mean your daughter will learn school subjects.  It means she&#39;ll learn what she&#39;s interested in and that may not look at all like anything you&#39;d find in a school.<br/>\n<br/>\n*** while i am inclined to believe<br/>\nthat some children advance themselves by inner drive and desire to<br/>\nlearn and grow without incentive or direction, *** <br/>\n<br/>\nWhat you wrote is difficult to follow but I think you&#39;re saying you believe incentive and direction must come from outside the child.   Children have their own direction and pursue their own interests very well.  They might need our help getting to what they want but they certainly don&#39;t need us to decide for them what they want.    When a child wants something they don&#39;t need us offering up rewards or punishments.  We can offer help in whatever form they need and they&#39;ll pursue what they&#39;re interested in until they&#39;ve had enough.   <br/>\n<br/>\n***just as we can clearly<br/>\nsay that some children can eat peanut butter with joy and others are<br/>\nallergic it is only reasonable to understand and to believe that the<br/>\nsame is true for a learning and living style like RU.***<br/>\n  <br/>\nLearning is not a histamine response.&lt;g&gt;  It doesn&#39;t seem reasonable at all to think that since some kids have allergies that means some other kids can&#39;t learn, so maybe you meant something else.  You maybe meant all kids are different and so you can&#39;t see how one thing can work for all kids.  Unschooling isn&#39;t like school where someone decides what every kid should know and then tries to cram it into each kid the same way at the same time.  Unschooling is living life and picking up information in a natural way.   It will not look like school learning, it can&#39;t be tested for and it probably won&#39;t hit the dots on a scope and sequence chart.   It&#39;s individual and natural and that&#39;s why it works for every child.  Every child learns what they want to learn.  It doesn&#39;t mean your daughter will have mastered algebra by the time she&#39;s fourteen.  It will mean if she&#39;s interested in algebra (or knitting or rebuilding transmissions, or playing piano or making paper airplanes) she&#39;ll have the time and freedom to learn as much as she wants. <br/>\n<br/>\n***to carte blanche say that this methodology would work as well for<br/>\na child with autism as one without is in my sincere opinion either<br/>\nwillfully untruthful or benignly ignorant.***<br/>\n<br/>\nAutistic children will benefit from a learning environment that meets their specific needs.    Just like every other kid.  Unschooling lets parents meet the needs of their children.  But there&#39;s a big difference between meeting the needs of a child and pacifying the worries of a parent who wants to direct a child&#39;s learning.     Some parents can&#39;t get it, can&#39;t get comfortable with the idea that while kids might need our help to get to what they want they don&#39;t need us to tell them what they should want.   It might be too far out of your comfort zone to let your child learn what she wants to learn in her own way and in her own time but that does not mean unschooling wouldn&#39;t work for her.    It&#39;s not a methodology like you&#39;re  familiar with from school.  You won&#39;t get to decide what subjects are important for her to study.  You get to help your daughter do what she&#39;s interested in doing. <br/>\n<br/>\nThere&#39;s good reading at www.joyfullyrejoycing.com and www.sandradodd.com/unschooling and  www.natrualchild.org/articles.  <br/>\n<br/>\n <br/>\nDeb Lewis<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":277072861,"authorName":"Paul H. Beaulieu II","from":"&quot;Paul H. Beaulieu II&quot; &lt;ballou12400@...&gt;","profile":"ballou12400","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: autism","postDate":"1210868239","msgId":32878,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwaG5tZithMjRwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg4MjkuMzEwNjUucW1Ad2ViMzYxMDEubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":32870,"nextInTopic":32890,"prevInTime":32877,"nextInTime":32879,"topicId":32741,"numMessagesInTopic":0,"msgSnippet":"Ok, here goes. First off, I feel that I should and need to appologize for my tone in my initial post it was combative and that really should not have happened.","messageBody":"<div id=\"ygrps-yiv-588564776\">Ok, here goes.   <br/>\n<br/>\n<br/>\nFirst off, I feel that I should and need to appologize for my tone in <br/>\nmy initial post it was combative and that really should not have <br/>\nhappened.  My goal is not to anger anyone on or off this list/group. <br/>\n <br/>\nI have been reading the posts on the group for answers to my questions <br/>\nabout unschooling, and was fustrated that I could not find answers to <br/>\nsome of my core concerns.  This is not only new to me and change can be <br/>\na bit difficult especially since i am proposing changing from something <br/>\nthat i know mainly how it works to an environment i am unfamiliar <br/>\nwith.  Also i have not experienced any personal horrors in my own life <br/>\nnor in my daughters that were caused by traditional methods. I <br/>\naknowledge that US appeals to my head and my heart but am a little <br/>\nskeptical without some sense of real understanding of the future. <br/>\nRemember i am putting the most valuable person in my life at risk here. <br/>\nplease recall what it was like to make these decisions for the first <br/>\ntime.  <br/>\n<br/>\nNow admittedly, my awareness of my frustration level should have caused <br/>\nme to stop and calm down and collect my thoughts better before writing <br/>\nto an open forum. <br/>\n<br/>\nLastly, I would like to thank Pat, Ren, Joyce and Sharissa13 for <br/>\nactually having real concrete things to say you were quite helpful.<br/>\n<br/>\nPaul</div>","specialLinks":[]},{"userId":340685235,"authorName":"olearydeborah","from":"&quot;olearydeborah&quot; &lt;olearydeborah@...&gt;","profile":"olearydeborah","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: autism","postDate":"1210858413","msgId":32850,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwaGUzZCtwb2E2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGcwOXRraCtjcmVoQGVHcm91cHMuY29tPg=="},"prevInTopic":32838,"nextInTopic":32870,"prevInTime":32849,"nextInTime":32851,"topicId":32741,"numMessagesInTopic":0,"msgSnippet":"Paul, if you think your daughter is doing well, fine.  She is only 8. When you get to the middle grades you may regret allowing her to remain. I made that","messageBody":"<div id=\"ygrps-yiv-860017973\">Paul, if you think your daughter is doing well, fine.  She is only 8.<br/>\n When you get to the middle grades you may regret allowing her to<br/>\nremain. I made that mistake. I could go on and on about the watered<br/>\ndown curriculum, etc.  If you haven&#39;t read any books by John Holt,<br/>\nplease do so.  They will help you gain perspective on the difference<br/>\nbetween learning and being taught. <br/>\n<br/>\nAs for my son on the spectrum...taking him out of the public school<br/>\nsystem has had an possitive impact on him.  Not only is he learning in<br/>\nfreedom and learning at a more advanced level (his own choice) than<br/>\nthe &quot;standardized curriculum&quot; he was being fed, but he is also living<br/>\nwithout medication.  <br/>\n<br/>\nI see my son&#39;s &quot;perseverations&quot; as gifts.  Therein lies our difference<br/>\nin philosphy. As for ASD adults Temple Grandin credits her own mother<br/>\nwith believing in her. I would also put Thomas Edison&#39;s mom is this<br/>\nsame category.  <br/>\n<br/>\nDeb<br/>\n<br/>\nIn <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Paul H. Beaulieu II&quot;<br/>\n&lt;ballou12400@...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; I am sorry but here i must disagree whole heartedly.  I have been <br/>\n&gt; lurking and reading what i can as i am interested in the whole <br/>\n&gt; unschooling concept as a person who i am considering spending the rest <br/>\n&gt; of my life with is currently engaging in un-everything with her <br/>\n&gt; children. my 8 year old daughter who is on the spectrum and for the <br/>\n&gt; record is very high functioning has progressed very well within a <br/>\n&gt; public school environment. we had her in a montessori school at first <br/>\n&gt; thinking that the freedom to learn would engender a sense of self <br/>\n&gt; gratification and hopefully catapult her into a state of fulfillment <br/>\n&gt; that i read about on this board. however that failed to materialize as <br/>\n&gt; she chose to perseverate on specific tasks and areas so much that she <br/>\n&gt; was turning into a one trick pony.  once we transferred her to a <br/>\n&gt; typical public school system who, governed by federal law and baby sat <br/>\n&gt; ba an attentive and educated father, gives my daughter an environment <br/>\n&gt; where she is thriving and lives a wonderfully joy filled life. i find <br/>\n&gt; to my surprise the kids in her class are not only not offensive to her <br/>\n&gt; but fall over themselves to make her feel welcome and included.  i <br/>\n&gt; understand that all children do not have her school experiences but i <br/>\n&gt; would say i find that in direct proportion to the involvement and <br/>\n&gt; maneer of involvement of the parents.  while i am inclined to believe <br/>\n&gt; that some children advance themselves by inner drive and desire to <br/>\n&gt; learn and grow without incentive or direction, just as we can clearly <br/>\n&gt; say that some children can eat peanut butter with joy and others are <br/>\n&gt; allergic it is only reasonable to understand and to believe that the <br/>\n&gt; same is true for a learning and living style like RU.  I have read a <br/>\n&gt; lot of things in the last week on this group and many have been quite <br/>\n&gt; insightful while others are clearly based on ignorance of the human <br/>\n&gt; body and its chemical make up.  I am chosing to treat the group like a <br/>\n&gt; chicken dinner i eat the meat and throw out the bones at this point, <br/>\n&gt; however autism is an area that i have specific personal experience and <br/>\n&gt; act as an advocate for a number of children in my community and knowing <br/>\n&gt; what i KNOW about this neurological disorder i can unequivocally say <br/>\n&gt; that to carte blanche say that this methodology would work as well for <br/>\n&gt; a child with autism as one without is in my sincere opinion either <br/>\n&gt; willfully untruthful or benignly ignorant. in either case it is not <br/>\n&gt; something i can in good conscience let pass without comment. what i <br/>\n&gt; have yet to see is the adult children who have been raised this way <br/>\n&gt; with RU and where are their testimonies?  where are the parents of 22 <br/>\n&gt; year olds who were raised this way for 20 or so of their years. i hear <br/>\n&gt; story after story of people who are trying this and trying that, who <br/>\n&gt; have been doing this for 2 3 or 5 years and have a 6 or 9 yr old even a <br/>\n&gt; few who have teens who have been raised in other ways who once switched <br/>\n&gt; to Ru are doing well after 1 year, i say scientifically that is not <br/>\n&gt; sufficient data. please direct me if there are those who can to the <br/>\n&gt; long term results not the theories.  I am sorry if my directness <br/>\n&gt; offends any but my daughter is worth more to me that all of your <br/>\n&gt; feelings combined and i will gladly offend all of you if it would help <br/>\n&gt; her by helping me get to the truth of something that may work or not <br/>\n&gt; work with and for her.<br/>\n&gt; <br/>\n&gt; that said,  Have a wonderful day.<br/>\n&gt; <br/>\n&gt; Paul Beaulieu<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: autism","postDate":"1210803756","msgId":32838,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwZm9uYys1dGtwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1Mzk1ODIzQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":32837,"nextInTopic":32850,"prevInTime":32837,"nextInTime":32839,"topicId":32741,"numMessagesInTopic":0,"msgSnippet":"~~Has everything to do with whether the parents are willing to put the time and energy into changing basically everything they thought they knew from the","messageBody":"<div id=\"ygrps-yiv-1862297388\">~~Has everything to do with whether the parents are willing to put the<br/>\ntime and energy into changing basically everything they thought they<br/>\nknew from the ground up and learn from their children. And if someone is<br/>\nnot able to put in the time to see each individual child as a wonderful<br/>\nWHOLE being and not a set of behaviors and perseverations and whatever<br/>\nother diagnostic stuff they&#39;ve come up with, then it&#39;s not going to<br/>\n&quot;work&quot;. ~~<br/>\n<br/>\nExactly!<br/>\nI agree completely. <br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":110899439,"authorName":"Sharissa13","from":"Sharissa13 &lt;sharissa13@...&gt;","profile":"sharissa13","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: autism","postDate":"1210786914","msgId":32837,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4MjkuMzEwNjUucW1Ad2ViMzYxMDEubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":32826,"nextInTopic":32838,"prevInTime":32836,"nextInTime":32838,"topicId":32741,"numMessagesInTopic":0,"msgSnippet":"Just a little confused... what is RU? My 9 (soon to be 10) year old son has autism. Initially, he was going to special ed classes at the public school... kinda","messageBody":"<div id=\"ygrps-yiv-1667704879\">Just a little confused... what is RU?<br/>\n<br/>\nMy 9 (soon to be 10) year old son has autism.<br/>\nInitially, he was going to special ed classes at the<br/>\npublic school... kinda like kindergarten, 1/2 day 5<br/>\ntimes a week. And there was good that did come from<br/>\nit. There was negative too... but I felt at the time<br/>\nthat the good outweighed the bad. Then we tried to<br/>\nmainstream him into regular kindergarten with a full<br/>\ntime aide (he&#39;s high functioning). That was when it<br/>\nall went terribly south. I&#39;ve been homeschooling him<br/>\never since and I think he&#39;s doing so much better. We<br/>\ndon&#39;t completely unschool... as I have to push him a<br/>\nlittle sometimes, but I try to give him as much<br/>\nfreedom as possible (his dad isn&#39;t happy with the<br/>\nunschool approach... he thinks I&#39;m doing it wrong and<br/>\nhe&#39;s worried that our son isn&#39;t learning the<br/>\nrequirements that all children are supposed to learn<br/>\nin school).<br/>\n<br/>\n*shrug* I think it works for us.</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: autism","postDate":"1210783971","msgId":32826,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1Mzk1ODIzQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":32823,"nextInTopic":32837,"prevInTime":32825,"nextInTime":32827,"topicId":32741,"numMessagesInTopic":0,"msgSnippet":"I kinda agree that RU *won t* work in all families. Has nothing to do with whether or not any/all of the children are on the autism spectrum. Has everything to","messageBody":"<div id=\"ygrps-yiv-1229631982\">I kinda agree that RU *won&#39;t* work in all families. Has nothing to do<br/>\nwith whether or not any/all of the children are on the autism spectrum.<br/>\nHas everything to do with whether the parents are willing to put the<br/>\ntime and energy into changing basically everything they thought they<br/>\nknew from the ground up and learn from their children. And if someone is<br/>\nnot able to put in the time to see each individual child as a wonderful<br/>\nWHOLE being and not a set of behaviors and perseverations and whatever<br/>\nother diagnostic stuff they&#39;ve come up with, then it&#39;s not going to<br/>\n&quot;work&quot;. It&#39;s not a set procedure or set of instructions - it&#39;s not &quot;do 2<br/>\nhours of sitting on the floor face to face three times per week and all<br/>\nwill be well&quot; It&#39;s actually pretty messy, this living life with other<br/>\npeople thing. Because every person is different than you are and does<br/>\nthings differently, sees the world differently, reacts differently.<br/>\nThat&#39;s not &quot;broken&quot; that&#39;s just different. But different gets messy. And<br/>\n&quot;more different&quot; is more messy, so it &quot;has to&quot; be &#39;controlled&#39; enough to<br/>\nsqueeze into the usual and accepted level of messiness (or does it?).<br/>\n<br/>\nSure, there are probably good ideas within the clinical information on<br/>\nassisting people with autism be at peace within themselves and able to<br/>\ncope with the big wide world and those ideas can and should be<br/>\nincorporated in whatever way works best for the individuals involved.<br/>\nThat doesn&#39;t mean that RU and raising a child on the spectrum are<br/>\nincompatible. That just means lots and lots of working, and observing,<br/>\nand revising, and do-overs to find what tools are most useful for any<br/>\nindividual at a given time/situation.<br/>\n<br/>\nDeb <br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":274177100,"authorName":"Vickisue Gray","from":"Vickisue Gray &lt;vickisue_gray@...&gt;","profile":"viickisan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: autism","postDate":"1210782530","msgId":32823,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0OTg1Mi4yMTk4MS5xbUB3ZWI1NDEwMi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":32818,"nextInTopic":32826,"prevInTime":32822,"nextInTime":32824,"topicId":32741,"numMessagesInTopic":0,"msgSnippet":"Ren...Kelly....You two, crack me up! Thanks for hanging in there and encouraging us all to be better parents raising happy children.  I ve only been","messageBody":"<div id=\"ygrps-yiv-354733712\">Ren...Kelly....You two, crack me up!<br/>\n   <br/>\n  Thanks for hanging in there and encouraging us all to be better parents raising happy children.  I&#39;ve only been &#39;officially&#39; unschooling for just over two and half years, so can&#39;t claim &#39;years&#39; of experience, but I&#39;m a firm believer in all that you say.  I&#39;ve watched the joy and wonder return to my son&#39;s life since we switched to RU.  I&#39;m so much happier, too!<br/>\n   <br/>\n  Thanks!<br/>\n  Vicki ~  Mom to dd 18, dd 16, ds 10.5<br/>\n   <br/>\n   <br/>\n   <br/>\n<br/>\n       <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":200309583,"authorName":"Pat","from":"&quot;Pat&quot; &lt;burnspaj@...&gt;","profile":"pootar111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: autism","postDate":"1210752450","msgId":32818,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwZTZrMittODdwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGcwZG82ait0bGU5QGVHcm91cHMuY29tPg=="},"prevInTopic":32812,"nextInTopic":32823,"prevInTime":32817,"nextInTime":32819,"topicId":32741,"numMessagesInTopic":0,"msgSnippet":"***  I notice there are a number of people with autistic kids on this list. ... I, like you, initially believed that school would be good and helpful for my","messageBody":"<div id=\"ygrps-yiv-1085560902\">***  I notice there are a number of people with autistic kids on this<br/>\n list.<br/>\n<blockquote><span title=\"ireply\"> &gt;  <br/>\n&gt; How does RU work for them?<br/>\n&gt; ***<br/>\n<br/>\n </span></blockquote>I, like you, initially believed that school would be good and helpful<br/>\nfor my high functioning autisic son.  After all, I had no previous<br/>\nexperience with autism and having a thorough system of teachers, <br/>\ndoctors and therapists on hand seemed reasonable to me at the time. I<br/>\nwas involved, I was informed, I was there every day. Unfortunately, I<br/>\nalso ended up watching my child lose confidence, joy, ability and<br/>\nself-esteem while buying into the belief that the &#39;experts&#39; were doing<br/>\nwhat was best for him.  Yes he learned to do schooly things, but<br/>\nmostly he learned to hate who he was. <br/>\n<br/>\nIt took me longer than I care to admit, but I pulled him out of school<br/>\nwhen I finally realized that they were not helping him, they were<br/>\ndeeply hurting him. He even told me this himself at some point, while<br/>\nI continued to assure him that he would be fine once we completed the<br/>\nnext round of OT, or social skills classes, or testing, or whatever<br/>\nthe hell was next on the long list of these truly trial-and-error<br/>\nprograms. <br/>\n<br/>\nWe are now unschooling. We are just beginning to see some of the &quot;old<br/>\nJack&quot; return.  It was almost completely wiped out by 4 years of<br/>\nschool. He says, &quot;I just want things to be like they were before.&quot;<br/>\nPerhaps this is not your experience with school and autism. I hope it<br/>\ndoes not become yours. But it is ours.<br/>\n <br/>\nDo you really think that research can tell you how your child will or<br/>\nwill not function in a system full of unknowns? <br/>\n<br/>\nThere is no kind of research to calculate the &quot;facts&quot; you are looking<br/>\nfor. School has not been scientifically tested against all the variables. <br/>\n<br/>\nPat</div>","specialLinks":[]},{"userId":315167313,"authorName":"guideforthree","from":"&quot;guideforthree&quot; &lt;guideforthree@...&gt;","profile":"guideforthree","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: autism","postDate":"1210737683","msgId":32812,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwZG82ait0bGU5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMDkwMWM4YjNlMSQxNmRkMTQyMCQ0NDk3M2M2MCRAY29tLmF1Pg=="},"prevInTopic":32811,"nextInTopic":32818,"prevInTime":32811,"nextInTime":32813,"topicId":32741,"numMessagesInTopic":0,"msgSnippet":"*** I notice there are a number of people with autistic kids on this list. How does RU work for them? *** I think that you will find that those of us on this","messageBody":"<div id=\"ygrps-yiv-525875206\">***<br/>\nI notice there are a number of people with autistic kids on this list.<br/>\n <br/>\nHow does RU work for them?<br/>\n***<br/>\n<br/>\nI think that you will find that those of us on this list who actually <br/>\nare RUers are pretty damn happy with the lives our spectrum kids have.  <br/>\nIt&#39;s amazing how any child can blossom when you learn to love him and <br/>\naccept him as he is - instead of trying to fix him - because, as I am <br/>\nfond of saying, my boy is not broken.<br/>\n<br/>\nTina</div>","specialLinks":[]},{"userId":315167313,"authorName":"guideforthree","from":"&quot;guideforthree&quot; &lt;guideforthree@...&gt;","profile":"guideforthree","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: autism","postDate":"1210736114","msgId":32811,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwZG1saStqNzgxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDQTgyQkZFMDc4NEYwRC0xNkFDLTIzMzJAd2VibWFpbC1tZTA5LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":32810,"nextInTopic":32812,"prevInTime":32810,"nextInTime":32812,"topicId":32741,"numMessagesInTopic":0,"msgSnippet":"*** i understand that all children do not have her school experiences but i would say i find that in direct proportion to the involvement and maneer of","messageBody":"<div id=\"ygrps-yiv-2082360692\">***<br/>\ni understand that all children do not have her school experiences but <br/>\ni would say i find that in direct proportion to the involvement and<br/>\nmaneer of involvement of the parents.<br/>\n***<br/>\n<br/>\nI took a teaching job at my son&#39;s school so I could be more <br/>\ninvolved.  His teacher is a good friend of mine - we go to each <br/>\nothers houses, have each other in speed dial, etc.  I brought a <br/>\nspecialist in from Emory University to do an autism workshop with the <br/>\nentire school staff.  I paid an ungodly sum of money for my son to <br/>\nattend a private school where he would have a 6:1 student:teacher <br/>\nratio.  I fought the system to force them to provide OT for my boy.<br/>\n<br/>\nAND you want to say I wasn&#39;t involved.  In what dimension are living <br/>\nthat it makes it ok for you to make those kind of assumptions?<br/>\n<br/>\nI took all of my kids out of school a little over a year ago.  We <br/>\nstarted RU last fall.  I&#39;ve seen an amazing improvement in my boy.  <br/>\nHe no longer monologues about Bionicles (I guess you could say RU <br/>\ncured him of being a &quot;one trick pony,&quot; to use your phrase). His <br/>\nstimming has completely dissappeared - yeah!  I could go on about all <br/>\nof the positive changes, but you don&#39;t really care about making a <br/>\nchild&#39;s life wonderful in the here and now, do you?<br/>\n<br/>\nDon&#39;t assume you are the only person on this list with a child on the <br/>\nspectrum.  Don&#39;t assume you are the only one who gives a damn.  Don&#39;t <br/>\nassume you know everything.<br/>\n<br/>\nTina (who loves what RU has done for her beloved Aspie)</div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"&quot;diana jenner&quot; &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: autism","postDate":"1210729753","msgId":32810,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDgwNTEzMTg0OXQxYzkyMTczY3ZhYWY0NjliOTgzMDM2MTkyQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDJEQkExQjg1LTQzOTgtNDA3Ny1COEVELUExQkVDNTA2ODZGRUB2ZXJpem9uLm5ldD4=","referencesHeader":"PGcwOXRraCtjcmVoQGVHcm91cHMuY29tPgkgPDJEQkExQjg1LTQzOTgtNDA3Ny1COEVELUExQkVDNTA2ODZGRUB2ZXJpem9uLm5ldD4="},"prevInTopic":32804,"nextInTopic":32811,"prevInTime":32809,"nextInTime":32811,"topicId":32741,"numMessagesInTopic":0,"msgSnippet":"... Unschooling always works for all children. I *can* say it. Human beings are built to learn, it s what we *do.* It is also true, and more important to","messageBody":"<div id=\"ygrps-yiv-902996149\"><blockquote><span title=\"ireply\">&gt; &gt; i can unequivocally say<br/>\n&gt; &gt; that to carte blanche say that this methodology would work as well for<br/>\n&gt; &gt; a child with autism as one without is in my sincere opinion either<br/>\n&gt; &gt; willfully untruthful or benignly ignorant.<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Unschooling always works for all children. I *can* say it. Human beings are<br/>\nbuilt to learn, it&#39;s what we *do.*<br/>\nIt is also true, and more important to understand, unschooling doesn&#39;t<br/>\nalways work for all parents (especially those who are products of the system<br/>\nthemselves, and *more* especially for those who liked life within the<br/>\nsystem). It&#39;s a lot of work, it&#39;s a building of relationships where society<br/>\nwould have them be torn down, it&#39;s like a holistic intimacy - facilitating<br/>\njoyful life in the moment. Every child brings gifts, unschooling gives us<br/>\nfar more opportunities to receive those gifts and appreciate them. And learn<br/>\na whole heck of a lot about your own self in the process (which seems to be<br/>\nan across the board benefit to this lifestyle).<br/>\nI&#39;m lots and lots of things, including crazy and maybe a bit loud and<br/>\noutspoken (just a bit :::bg:::), though *not* willfully untruthful nor<br/>\nbenignly ignorant. Intelligence can be bliss, too :)<br/>\n-- <br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: autism","postDate":"1210701756","msgId":32804,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJEQkExQjg1LTQzOTgtNDA3Ny1COEVELUExQkVDNTA2ODZGRUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGcwOXRraCtjcmVoQGVHcm91cHMuY29tPg==","referencesHeader":"PGcwOXRraCtjcmVoQGVHcm91cHMuY29tPg=="},"prevInTopic":32784,"nextInTopic":32810,"prevInTime":32803,"nextInTime":32805,"topicId":32741,"numMessagesInTopic":0,"msgSnippet":"... Unschooling isn t stand back and let them go. It s awareness of what a child needs and helping them get that.. ... Rather than seeing this as a negative,","messageBody":"<div id=\"ygrps-yiv-675231739\">On May 12, 2008, at 1:09 PM, Paul H. Beaulieu II wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; we had her in a montessori school at first<br/>\n&gt; thinking that the freedom to learn would engender a sense of self<br/>\n&gt; gratification and hopefully catapult her into a state of fulfillment<br/>\n&gt; that i read about on this board<br/>\n<br/>\n </span></blockquote>Unschooling isn&#39;t stand back and let them go. It&#39;s awareness of what  <br/>\na child needs and helping them get that..<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; however that failed to materialize as<br/>\n&gt; she chose to perseverate on specific tasks and areas so much that she<br/>\n&gt; was turning into a one trick pony<br/>\n<br/>\n </span></blockquote>Rather than seeing this as a negative, it would be helpful to ask  <br/>\nparents of autistic children what their experiences were.<br/>\n<br/>\nIf you begin with &quot;This, this and this is where you&#39;re wrong, now  <br/>\nprove that I&#39;m wrong in my assumptions,&quot; it&#39;s going to be a whole lot  <br/>\nmore difficult for you to get useful answers. People here answer  <br/>\nvoluntarily. Why should they spend time on someone who begins from a  <br/>\npoint of antagonism when they could spend their time on someone who  <br/>\nsays essentially &quot;I&#39;ve done my research. This appeals to me. I some  <br/>\nplaces where I&#39;m confused.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  i find<br/>\n&gt; to my surprise the kids in her class are not only not offensive to her<br/>\n&gt; but fall over themselves to make her feel welcome and included.<br/>\n<br/>\n </span></blockquote>A very atypical school experience for most kids.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  i<br/>\n&gt; understand that all children do not have her school experiences but i<br/>\n&gt; would say i find that in direct proportion to the involvement and<br/>\n&gt; maneer of involvement of the parents.<br/>\n<br/>\n </span></blockquote>I can only guess what the above means.<br/>\n<br/>\nIf you mean that kids have great experiences in school because their  <br/>\nparents are involved I wish that were all it took. If that were so,  <br/>\nschools would have found a way to tap that power long ago.  <br/>\nOccasionally a dynamic will work with the right mix of people, but  <br/>\nit&#39;s not recreatable. If that sounds ignorant, what you&#39;re saying is  <br/>\nthat despite 10s of 1000s of educators spending their life trying to  <br/>\nimprove schools since the tail end of the 1950&#39;s (Sputnik was the big  <br/>\npush), finally your school has discovered that it&#39;s parent  <br/>\ninvolvement that works. Does that sound feasible?<br/>\n<br/>\nIf you want research, try John Holt&#39;s books and read them in order.  <br/>\nHe began with school reform. You can see the evolution of his  <br/>\nthoughts and why he ultimately concluded that schools can&#39;t work  <br/>\nbecause learning needs the freedom to explore. (Which, again, is more  <br/>\nthan your idea of let them explore on their own.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; while i am inclined to believe<br/>\n&gt; that some children advance themselves by inner drive and desire to<br/>\n&gt; learn and grow without incentive or direction<br/>\n<br/>\n </span></blockquote>Some kids are independent learners. Unschooling isn&#39;t independent  <br/>\nlearning. Unschooling takes more parent involvement than any other  <br/>\nform of homeschooling.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  i can unequivocally say<br/>\n&gt; that to carte blanche say that this methodology would work as well for<br/>\n&gt; a child with autism as one without is in my sincere opinion either<br/>\n&gt; willfully untruthful or benignly ignorant.<br/>\n<br/>\n </span></blockquote>You can state it, but is it true? Lots of teachers would  <br/>\nunequivocally state that kids won&#39;t learn to read or do math without  <br/>\ninstruction. They &quot;know&quot; that&#39;s true because, even with the &quot;best  <br/>\ninstruction&quot; some kids succeed and some kids fail.<br/>\n<br/>\nBut, they&#39;re basing their conclusions on speculation, not knowledge.  <br/>\nOnly unschoolers have seen what kids are capable of both with and  <br/>\nwithout direct instruction. We know the effects of each. Only  <br/>\nunschoolers have a control group for the experiment. Educators only  <br/>\nhave guesses.<br/>\n<br/>\nYou&#39;d get better answers if you sincerely ask for the experiences of  <br/>\nparents with autistic kids without attacking them and everyone else.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; what i<br/>\n&gt; have yet to see is the adult children who have been raised this way<br/>\n&gt; with RU and where are their testimonies?  where are the parents of 22<br/>\n&gt; year olds who were raised this way for 20 or so of their years<br/>\n<br/>\n </span></blockquote>Autistic kids? Or all kids? Those stories come out over time. My  <br/>\ndaughter is 16. She&#39;s not only an incredibly nice kid (I&#39;m biased but  <br/>\nother adults have spontaneously said so :-) but living her life  <br/>\ntowards college. She&#39;s been taking college classes since she was 11  <br/>\njust for fun.<br/>\n<br/>\nIt&#39;s not a fluke and it&#39;s not a crap shoot. The parenting decisions I  <br/>\nmade have been turned over and discussed and held up for examination.  <br/>\nI&#39;ve seen the results in my daughter and in the children of the  <br/>\nunschooling parents I&#39;ve known for 12 years. It&#39;s not a theory. It&#39;s  <br/>\ncritical thinking and observation.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; i say scientifically that is not<br/>\n&gt; sufficient data<br/>\n<br/>\n </span></blockquote>If you want data, we&#39;re not going to hand it to you. It comes out  <br/>\nwhen people ask relevant questions, not at one person&#39;s command. It&#39;s  <br/>\nin the archives and you can dig for it. Now, if you want to pay  <br/>\nsomeone for their time, you could make an offer! Otherwise it&#39;s more  <br/>\nefficient to use my time to help people who&#39;ve done their own  <br/>\nresearch and aren&#39;t beginning from a point of view of &quot;Prove it to me.&quot;<br/>\n<br/>\nThere&#39;s also the archives at:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.google.com/group/UnschoolingDiscussion\">http://groups.google.com/group/UnschoolingDiscussion</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion\">http://groups.yahoo.com/group/UnschoolingDiscussion</a> (it&#39;s old home)<br/>\n<br/>\nYou might also find some useful answers at my website. It&#39;s written  <br/>\nby a former engineer:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com\">http://joyfullyrejoycing.com</a><br/>\n<br/>\nAny discussion, though, bring here.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; please direct me if there are those who can to the<br/>\n&gt; long term results not the theories.<br/>\n<br/>\n </span></blockquote>Come to an unschooling conference and you can see the results first  <br/>\nhand. I&#39;ve been involved with unschooling since my daughter was 4 and  <br/>\nmany of the people I began with are still around with grown or nearly  <br/>\ngrown kids answering questions.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am sorry if my directness<br/>\n&gt; offends any but my daughter is worth more to me that all of your<br/>\n&gt; feelings combined and i will gladly offend all of you if it would help<br/>\n&gt; her by helping me get to the truth of something that may work or not<br/>\n&gt; work with and for her.<br/>\n<br/>\n </span></blockquote>I&#39;m really not sure how offending people and being belligerent and  <br/>\ndemanding that people volunteer their time in a specific way to help  <br/>\nyou could possibly help your daughter.<br/>\n<br/>\nAsk questions in a way that shows that you&#39;re open to trying to  <br/>\nunderstand and people will be more than happy to help. Begin from a  <br/>\npoint of view of &quot;You&#39;re wrong and show me that you aren&#39;t,&quot; and it  <br/>\nisn&#39;t likely to get you very much.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa Gray","from":"Melissa Gray &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: autism","postDate":"1210655664","msgId":32784,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3MDUwRDE0LTgxREItNEJFQy1CMERGLTlCOUZFMTJEQzA5OUBjb3gubmV0Pg==","inReplyToHeader":"PGcwOXRraCtjcmVoQGVHcm91cHMuY29tPg==","referencesHeader":"PGcwOXRraCtjcmVoQGVHcm91cHMuY29tPg=="},"prevInTopic":32780,"nextInTopic":32804,"prevInTime":32783,"nextInTime":32785,"topicId":32741,"numMessagesInTopic":0,"msgSnippet":"Well, Ren summed it up nicely. I second the raspberry. You, sir, are not the only person with autism experience on the board, and I replied to the question as","messageBody":"<div id=\"ygrps-yiv-1023500455\">Well, Ren summed it up nicely. I second the raspberry.<br/>\n<br/>\nYou, sir, are not the only person with autism experience on the  <br/>\nboard, and I replied to the question as the mother of FOUR CHILDREN  <br/>\non the spectrum. After advocating in public schools for over six  <br/>\nyears, not only for my children in our district, but over two dozen  <br/>\nothers across the state, I can say I have plenty of experience in  <br/>\npublic education for children with autism. I can also state that I  <br/>\nwas fully and completely involved in my children&#39;s education,  <br/>\nspending over half of every day in the school building itself. It is  <br/>\nquite offensive to assume that because those children did not due  <br/>\nwell in public schools, that the parents (myself and others) are  <br/>\ninattentive and uninvolved.<br/>\n<br/>\nAn involved parent is helpful, yes, but so is respect for the person  <br/>\nwith autism (rather than calling them &#39;one trick ponies&#39;) and working  <br/>\nwithin their comfort level, will help them just as much as forcing  <br/>\nthem into situations in which they feel they must change who they are  <br/>\nin to be respected. I KNOW several unschooling children with autism  <br/>\noutside of my own four, and I do know that it works very well.  <br/>\nPerhaps it is the parenting, as you suggest. Since you did not  <br/>\nunschool your daughter, and have such strong opinions against it that  <br/>\nit would not work, I suggest that you don&#39;t have the data to prove  <br/>\nthat it would not work.<br/>\n<br/>\n<br/>\nMelissa<br/>\nMom to Joshua, Breanna, Emily, Rachel, Samuel, Daniel and Avari<br/>\nWife to Zane<br/>\n<br/>\nblog me at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives.blogspot.com/\">http://startlinglives.blogspot.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives365.blogspot.com\">http://startlinglives365.blogspot.com</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On May 12, 2008, at 12:09 PM, Paul H. Beaulieu II wrote:<br/>\n&gt; I am sorry but here i must disagree whole heartedly. I have been<br/>\n&gt; lurking and reading what i can as i am interested in the whole<br/>\n&gt; unschooling concept as a person who i am considering spending the rest<br/>\n&gt; of my life with is currently engaging in un-everything with her<br/>\n&gt; children. my 8 year old daughter who is on the spectrum and for the<br/>\n&gt; record is very high functioning has progressed very well within a<br/>\n&gt; public school environment. we had her in a montessori school at first<br/>\n&gt; thinking that the freedom to learn would engender a sense of self<br/>\n&gt; gratification and hopefully catapult her into a state of fulfillment<br/>\n&gt; that i read about on this board. however that failed to materialize as<br/>\n&gt; she chose to perseverate on specific tasks and areas so much that she<br/>\n&gt; was turning into a one trick pony. once we transferred her to a<br/>\n&gt; typical public school system who, governed by federal law and baby sat<br/>\n&gt; ba an attentive and educated father, gives my daughter an environment<br/>\n&gt; where she is thriving and lives a wonderfully joy filled life. i find<br/>\n&gt; to my surprise the kids in her class are not only not offensive to her<br/>\n&gt; but fall over themselves to make her feel welcome and included. i<br/>\n&gt; understand that all children do not have her school experiences but i<br/>\n&gt; would say i find that in direct proportion to the involvement and<br/>\n&gt; maneer of involvement of the parents. while i am inclined to believe<br/>\n&gt; that some children advance themselves by inner drive and desire to<br/>\n&gt; learn and grow without incentive or direction, just as we can clearly<br/>\n&gt; say that some children can eat peanut butter with joy and others are<br/>\n&gt; allergic it is only reasonable to understand and to believe that the<br/>\n&gt; same is true for a learning and living style like RU. I have read a<br/>\n&gt; lot of things in the last week on this group and many have been quite<br/>\n&gt; insightful while others are clearly based on ignorance of the human<br/>\n&gt; body and its chemical make up. I am chosing to treat the group like a<br/>\n&gt; chicken dinner i eat the meat and throw out the bones at this point,<br/>\n&gt; however autism is an area that i have specific personal experience and<br/>\n&gt; act as an advocate for a number of children in my community and  <br/>\n&gt; knowing<br/>\n&gt; what i KNOW about this neurological disorder i can unequivocally say<br/>\n&gt; that to carte blanche say that this methodology would work as well for<br/>\n&gt; a child with autism as one without is in my sincere opinion either<br/>\n&gt; willfully untruthful or benignly ignorant. in either case it is not<br/>\n&gt; something i can in good conscience let pass without comment. what i<br/>\n&gt; have yet to see is the adult children who have been raised this way<br/>\n&gt; with RU and where are their testimonies? where are the parents of 22<br/>\n&gt; year olds who were raised this way for 20 or so of their years. i hear<br/>\n&gt; story after story of people who are trying this and trying that, who<br/>\n&gt; have been doing this for 2 3 or 5 years and have a 6 or 9 yr old  <br/>\n&gt; even a<br/>\n&gt; few who have teens who have been raised in other ways who once  <br/>\n&gt; switched<br/>\n&gt; to Ru are doing well after 1 year, i say scientifically that is not<br/>\n&gt; sufficient data. please direct me if there are those who can to the<br/>\n&gt; long term results not the theories. I am sorry if my directness<br/>\n&gt; offends any but my daughter is worth more to me that all of your<br/>\n&gt; feelings combined and i will gladly offend all of you if it would help<br/>\n&gt; her by helping me get to the truth of something that may work or not<br/>\n&gt; work with and for her.<br/>\n&gt;<br/>\n&gt; that said, Have a wonderful day.<br/>\n&gt;<br/>\n&gt; Paul Beaulieu<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: autism","postDate":"1210654246","msgId":32780,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwYjZuNitxdDhuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDQTgyQkZFMDc4NEYwRC0xNkFDLTIzMzJAd2VibWFpbC1tZTA5LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":32774,"nextInTopic":32784,"prevInTime":32779,"nextInTime":32781,"topicId":32741,"numMessagesInTopic":0,"msgSnippet":"~~i hear story after story of people who are trying this and trying that,who have been doing this for 2 3 or 5 years and have a 6 or 9 yr old even a few who","messageBody":"<div id=\"ygrps-yiv-1912687958\">~~i hear story after story of people who are trying this and trying<br/>\nthat,who have been doing this for 2 3 or 5 years and have a 6 or 9 yr<br/>\nold even a few who have teens who have been raised in other ways who<br/>\nonce switched to Ru are doing well after 1 year, i say scientifically<br/>\nthat is not sufficient data.<br/>\n~~<br/>\n<br/>\nThis made me laugh out loud.<br/>\nI know many grown unschoolers...in fact, several of them will be<br/>\nspeaking at the upcoming NE Unschooling conference including one of my<br/>\ngrown unschoolers AND Kelly&#39;s grown unschooler. Oh, and the unschooled<br/>\ngrown girlfriend of my son.<br/>\n<br/>\nWe&#39;ve been educating ourselves without the school system for the<br/>\nbetter part of my oldest child&#39;s lifetime (18) and radically<br/>\nunschooling since 2000. If you  need &quot;sufficient data&quot; rather than<br/>\nanalytical discussion, then this isn&#39;t the list for you.<br/>\n<br/>\nFunny, I feel like wiggling my fingers, sticking my tongue out and<br/>\nsaying &quot;ppphhhhhffffft&quot; right now. Sign of immaturity I&#39;m quite sure.:)<br/>\n<br/>\nHow&#39;s that for &quot;sufficient data&quot;?<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Re: autism","postDate":"1210649021","msgId":32774,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQTgyQkZFMDc4NEYwRC0xNkFDLTIzMzJAd2VibWFpbC1tZTA5LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PGcwOXRraCtjcmVoQGVHcm91cHMuY29tPg=="},"prevInTopic":32771,"nextInTopic":32780,"prevInTime":32773,"nextInTime":32775,"topicId":32741,"numMessagesInTopic":0,"msgSnippet":"... From: Paul H. Beaulieu II  however that failed to materialize as she chose to perseverate on specific tasks and areas so much that","messageBody":"<div id=\"ygrps-yiv-608246473\">-----Original Message-----<br/>\nFrom: Paul H. Beaulieu II &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ballou12400@...\">ballou12400@...</a>&gt;<br/>\n<br/>\n<br/>\n however that failed to materialize as<br/>\nshe chose to perseverate on specific tasks and areas so much that she<br/>\nwas turning into a one trick pony.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nI&#39;m sorry that&#39;s how you saw your daughter.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n  i find to my surprise the kids in her class are not only not offensive <br/>\nto her<br/>\nbut fall over themselves to make her feel welcome and included.<br/>\n<br/>\n-=-=-<br/>\n<br/>\nGreat. I hope that doesn&#39;t change over time.<br/>\n<br/>\nMy guess is that it *will* however.<br/>\n<br/>\nBut good luck with that.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\n   i understand that all children do not have her school experiences but <br/>\ni<br/>\nwould say i find that in direct proportion to the involvement and<br/>\nmaneer of involvement of the parents.<br/>\n<br/>\n-==-=-<br/>\n<br/>\nReally?<br/>\n<br/>\nLike...maybe...a *very* involved and interested parent might be able to <br/>\nmake a lot of headway with such a special child? Like...maybe a parent <br/>\nwho was there 24/7, honoring Who The Child Is at every moment and being <br/>\npresent---both in body and mind---might be able to help her be her best <br/>\npossible self?<br/>\n<br/>\nImagine that.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nwhile i am inclined to believe<br/>\nthat some children advance themselves by inner drive and desire to<br/>\nlearn and grow without incentive or direction,<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nDo you think that? That children learn and grow with NO incentive or <br/>\ndirection?<br/>\n<br/>\nI&#39;ve *never* met a child with no incentive and no direction. Maybe you <br/>\nhave, but *I* have never met a one.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n<br/>\n just as we can clearly<br/>\nsay that some children can eat peanut butter with joy and others are<br/>\nallergic it is only reasonable to understand and to believe that the<br/>\nsame is true for a learning and living style like RU.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nHow&#39;s that?<br/>\n<br/>\nThat some kids are &quot;allergic&quot; to unschooling? Allergic to natural <br/>\nlearning? That some kids just don&#39;t learn?<br/>\n<br/>\nThat&#39;s not my experience.<br/>\n<br/>\nI&#39;m having a really hard time following. Maybe I&#39;m &quot;not too well <br/>\nequipped.&quot;<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nI have read a lot of things in the last week on this group and many <br/>\nhave been quite<br/>\ninsightful while others are clearly based on ignorance of the human<br/>\nbody and its chemical make up.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nPlease give me an example of my ignorance.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n I am chosing to treat the group like a<br/>\nchicken dinner i eat the meat and throw out the bones at this point,<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nThat&#39;s good.<br/>\n<br/>\n-=-=-=-==-<br/>\n<br/>\nhowever autism is an area that i have specific personal experience and<br/>\nact as an advocate for a number of children in my community and knowing<br/>\nwhat i KNOW about this neurological disorder i can unequivocally say<br/>\nthat to carte blanche say that this methodology would work as well for<br/>\na child with autism as one without is in my sincere opinion either<br/>\nwillfully untruthful or benignly ignorant.<br/>\n<br/>\n-=-=-=-=<br/>\n<br/>\nThen this is not the place for you. You might like to try other lists <br/>\nwhere people will buy that crap.<br/>\n<br/>\nIf you believe the writers here to be &quot;willfully untruthful OR benignly <br/>\nignorant,&quot; then it&#39;s time for you to exit.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nwhat i have yet to see is the adult children who have been raised this <br/>\nway<br/>\nwith RU and where are their testimonies?  where are the parents of 22<br/>\nyear olds who were raised this way for 20 or so of their years.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nAs soon as we have 100 twenty-year-old children with autism, then <br/>\nyou&#39;ll listen?<br/>\n<br/>\nOk. Hang around and wait. And keep sending your daughter to school. Let <br/>\nus know how that works out for you---in 12 years, when she&#39;s 20.<br/>\n<br/>\nUnschooled children are *just* now becoming adults. Just these last few <br/>\nyears. Young children&#39;s parents are *finally* seeing that school <br/>\ndoesn&#39;t work with their children with autism, so they&#39;re willing to try <br/>\nsomething that honors the child Where He Is NOW instead of relying on <br/>\nthe schools---schools with their &quot;new concepts&quot; every other year, <br/>\nschools with their loud noises and bright lights and major stressors, <br/>\nschools with their authority and <br/>\n&quot;this-is-the-way-we-do-it-don&#39;t-question-us-and-our-methods&quot; attitudes.<br/>\n<br/>\n-=-=-=-=-=-=-<br/>\n<br/>\ni hear story after story of people who are trying this and trying that, <br/>\nwho<br/>\nhave been doing this for 2 3 or 5 years and have a 6 or 9 yr old even a<br/>\nfew who have teens who have been raised in other ways who once switched<br/>\nto Ru are doing well after 1 year, i say scientifically that is not<br/>\nsufficient data.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nFine. Many parents here have HAPPY, functioning, delightful kids. With <br/>\nautism. But don&#39;t let that convince you. Rely on schooled children&#39;s <br/>\nstories---there are so many success stories there. &lt;snort&gt;<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nplease direct me if there are those who can to the<br/>\nlong term results not the theories.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nPlease direct me to those who have anything BUT a theory.<br/>\n<br/>\nIf schools *WORKED*, all children would come out perfectly adjusted and <br/>\nbrilliant.<br/>\n<br/>\nSchools are based on the *theory* that some stranger I&#39;ve never met <br/>\nelse knows what *my* child needs to know to be Who He Is. Some theory.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nI am sorry if my directness offends<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nNo, your nasty, snotty condescending attitude offends and won&#39;t be <br/>\ntolerated.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nany but my daughter is worth more to me that all of your feelings <br/>\ncombined<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nThen, by all means, keep her in school where the powers that be will <br/>\nwatch over her and make sure she follows their rules and agendas. Their <br/>\ntheories hold so much more water.<br/>\n<br/>\nYou certainly don&#39;t need us.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nand i will gladly offend all of you if it would help<br/>\nher by helping me get to the truth of something that may work or not<br/>\nwork with and for her.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nOffending a group of people who work very hard to make many children&#39;s <br/>\nlives wonderful is no way to start asking for help.<br/>\n<br/>\nMaybe my husband can be of more assistance. To quote you: we here at UB <br/>\nsimply &quot;arent too well equiped to make cogent arguement for all the <br/>\ncomplexities that are embodied with a full tilt life alteration such as <br/>\nthis.&quot;<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: autism","postDate":"1210645170","msgId":32771,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwYXRyaStmam1pQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGcwOXRraCtjcmVoQGVHcm91cHMuY29tPg=="},"prevInTopic":32765,"nextInTopic":32774,"prevInTime":32770,"nextInTime":32772,"topicId":32741,"numMessagesInTopic":0,"msgSnippet":"~~i have specific personal experience and act as an advocate for a number of children in my community and knowing what i KNOW about this neurological disorder","messageBody":"<div id=\"ygrps-yiv-2125372522\">~~i have specific personal experience and<br/>\nact as an advocate for a number of children in my community and knowing<br/>\nwhat i KNOW about this neurological disorder i can unequivocally say<br/>\nthat to carte blanche say that this methodology would work as well for<br/>\na child with autism as one without is in my sincere opinion either<br/>\nwillfully untruthful or benignly ignorant.~~<br/>\n<br/>\nYou are sure assuming a lot for someone with such little experience<br/>\nand time at this list. Some of us DO have quite a bit of knowledge and<br/>\nfirst hand experience with autism and other &quot;disorders&quot; (I don&#39;t view<br/>\nthem as disorders, but differences).<br/>\n<br/>\nRU works for EVERY child because it is all about meeting the child&#39;s<br/>\nneeds, whatever those may be. There is no willing ignorance or an<br/>\nounce of untruth. Maybe you should get to know more of our stories and<br/>\nmore of the families here before you make such broad and sweeping<br/>\nstatements.<br/>\n<br/>\nIf you&#39;d like to read more about an RU advocate with several autistic<br/>\nchildren (some of them quite severely autistic) you can google Cindy<br/>\nGaddis if you care to learn just how the RU lifestyle plays out with<br/>\nvery distinct and intense needs.<br/>\n<br/>\nRight here at this list, we have parents with autistic children...some<br/>\nmore than one who are living the RU lifestyle all while honoring their<br/>\nchild&#39;s unique needs.<br/>\n<br/>\nYou can&#39;t possibly understand what radical unschooling means if you<br/>\nthink it means leaving the child to their own devices. Stick around<br/>\nand you might learn.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":277072861,"authorName":"Paul H. Beaulieu II","from":"&quot;Paul H. Beaulieu II&quot; &lt;ballou12400@...&gt;","profile":"ballou12400","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: autism","postDate":"1210612177","msgId":32765,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwOXRraCtjcmVoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDlERUM3MjVBLUIwNTUtNDlDQy05QjUzLTM2MTNDREU1MjM2Q0Bjb3gubmV0Pg=="},"prevInTopic":32752,"nextInTopic":32771,"prevInTime":32764,"nextInTime":32766,"topicId":32741,"numMessagesInTopic":0,"msgSnippet":"I am sorry but here i must disagree whole heartedly.  I have been lurking and reading what i can as i am interested in the whole unschooling concept as a","messageBody":"<div id=\"ygrps-yiv-1499304817\">I am sorry but here i must disagree whole heartedly.  I have been <br/>\nlurking and reading what i can as i am interested in the whole <br/>\nunschooling concept as a person who i am considering spending the rest <br/>\nof my life with is currently engaging in un-everything with her <br/>\nchildren. my 8 year old daughter who is on the spectrum and for the <br/>\nrecord is very high functioning has progressed very well within a <br/>\npublic school environment. we had her in a montessori school at first <br/>\nthinking that the freedom to learn would engender a sense of self <br/>\ngratification and hopefully catapult her into a state of fulfillment <br/>\nthat i read about on this board. however that failed to materialize as <br/>\nshe chose to perseverate on specific tasks and areas so much that she <br/>\nwas turning into a one trick pony.  once we transferred her to a <br/>\ntypical public school system who, governed by federal law and baby sat <br/>\nba an attentive and educated father, gives my daughter an environment <br/>\nwhere she is thriving and lives a wonderfully joy filled life. i find <br/>\nto my surprise the kids in her class are not only not offensive to her <br/>\nbut fall over themselves to make her feel welcome and included.  i <br/>\nunderstand that all children do not have her school experiences but i <br/>\nwould say i find that in direct proportion to the involvement and <br/>\nmaneer of involvement of the parents.  while i am inclined to believe <br/>\nthat some children advance themselves by inner drive and desire to <br/>\nlearn and grow without incentive or direction, just as we can clearly <br/>\nsay that some children can eat peanut butter with joy and others are <br/>\nallergic it is only reasonable to understand and to believe that the <br/>\nsame is true for a learning and living style like RU.  I have read a <br/>\nlot of things in the last week on this group and many have been quite <br/>\ninsightful while others are clearly based on ignorance of the human <br/>\nbody and its chemical make up.  I am chosing to treat the group like a <br/>\nchicken dinner i eat the meat and throw out the bones at this point, <br/>\nhowever autism is an area that i have specific personal experience and <br/>\nact as an advocate for a number of children in my community and knowing <br/>\nwhat i KNOW about this neurological disorder i can unequivocally say <br/>\nthat to carte blanche say that this methodology would work as well for <br/>\na child with autism as one without is in my sincere opinion either <br/>\nwillfully untruthful or benignly ignorant. in either case it is not <br/>\nsomething i can in good conscience let pass without comment. what i <br/>\nhave yet to see is the adult children who have been raised this way <br/>\nwith RU and where are their testimonies?  where are the parents of 22 <br/>\nyear olds who were raised this way for 20 or so of their years. i hear <br/>\nstory after story of people who are trying this and trying that, who <br/>\nhave been doing this for 2 3 or 5 years and have a 6 or 9 yr old even a <br/>\nfew who have teens who have been raised in other ways who once switched <br/>\nto Ru are doing well after 1 year, i say scientifically that is not <br/>\nsufficient data. please direct me if there are those who can to the <br/>\nlong term results not the theories.  I am sorry if my directness <br/>\noffends any but my daughter is worth more to me that all of your <br/>\nfeelings combined and i will gladly offend all of you if it would help <br/>\nher by helping me get to the truth of something that may work or not <br/>\nwork with and for her.<br/>\n<br/>\nthat said,  Have a wonderful day.<br/>\n<br/>\nPaul Beaulieu</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa Gray","from":"Melissa Gray &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: autism","postDate":"1210604697","msgId":32752,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlERUM3MjVBLUIwNTUtNDlDQy05QjUzLTM2MTNDREU1MjM2Q0Bjb3gubmV0Pg==","inReplyToHeader":"PGcwOWtvaSs2ZXJzQGVHcm91cHMuY29tPg==","referencesHeader":"PGcwOWtvaSs2ZXJzQGVHcm91cHMuY29tPg=="},"prevInTopic":32751,"nextInTopic":32765,"prevInTime":32751,"nextInTime":32753,"topicId":32741,"numMessagesInTopic":0,"msgSnippet":"YES! School helped not at all. With our more affected child, the very early education was led by a very dedicated sweet teacher, and it wasn t harmful.","messageBody":"<div id=\"ygrps-yiv-953679503\">YES! School helped not at all. With our more affected child, the very  <br/>\nearly education was led by a very dedicated sweet teacher, and it  <br/>\nwasn&#39;t harmful. However, after kindergarden it was hell on earth. My  <br/>\nolder child had the same issues...diagnosed as clinically depressed  <br/>\nbecause of school.  All because they were different.<br/>\n<br/>\nMelissa<br/>\nMom to Joshua, Breanna, Emily, Rachel, Samuel, Daniel and Avari<br/>\nWife to Zane<br/>\n<br/>\nblog me at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives.blogspot.com/\">http://startlinglives.blogspot.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives365.blogspot.com\">http://startlinglives365.blogspot.com</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On May 12, 2008, at 9:38 AM, Ren Allen wrote:<br/>\n<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;The Patersons&quot;<br/>\n&gt; &lt;tuipiri@...&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; Hey all,<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; I notice there are a number of people with autistic kids on this  <br/>\n&gt; list.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; How does RU work for them?<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Cecily<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; The real question in my mind, is how would school help them? If<br/>\n&gt; unschooling is good for the &quot;average&quot; kid, then why wouldn&#39;t it be<br/>\n&gt; great for kids with special challenges who might be crushed even worse<br/>\n&gt; by the school system?<br/>\n&gt;<br/>\n&gt; RU works for every child, because it&#39;s all about the parents meeting<br/>\n&gt; them where they&#39;re at and helping meet their needs.<br/>\n&gt;<br/>\n&gt; Ren<br/>\n&gt; learninginfreedom.com<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa Gray","from":"Melissa Gray &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] autism","postDate":"1210604348","msgId":32751,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVCQUYzMTcxLUFFNjktNDVCMy05MDUzLThDOTc4MDBEQzNBOEBjb3gubmV0Pg==","inReplyToHeader":"PDAwMDkwMWM4YjNlMSQxNmRkMTQyMCQ0NDk3M2M2MCRAY29tLmF1Pg==","referencesHeader":"PDAwMDkwMWM4YjNlMSQxNmRkMTQyMCQ0NDk3M2M2MCRAY29tLmF1Pg=="},"prevInTopic":32749,"nextInTopic":32752,"prevInTime":32750,"nextInTime":32752,"topicId":32741,"numMessagesInTopic":0,"msgSnippet":"Works great for all of my kids on the spectrum, and all the ones off as well. Melissa Mom to Joshua, Breanna, Emily, Rachel, Samuel, Daniel and Avari Wife to","messageBody":"<div id=\"ygrps-yiv-1152657961\">Works great for all of my kids on the spectrum, and all the ones off  <br/>\nas well.<br/>\n<br/>\n<br/>\nMelissa<br/>\nMom to Joshua, Breanna, Emily, Rachel, Samuel, Daniel and Avari<br/>\nWife to Zane<br/>\n<br/>\nblog me at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives.blogspot.com/\">http://startlinglives.blogspot.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives365.blogspot.com\">http://startlinglives365.blogspot.com</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On May 11, 2008, at 10:34 PM, The Patersons wrote:<br/>\n<br/>\n&gt; Hey all,<br/>\n&gt;<br/>\n&gt; I notice there are a number of people with autistic kids on this list.<br/>\n&gt;<br/>\n&gt; How does RU work for them?<br/>\n&gt;<br/>\n&gt; Cecily<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: autism","postDate":"1210603090","msgId":32749,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwOWtvaSs2ZXJzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMDkwMWM4YjNlMSQxNmRkMTQyMCQ0NDk3M2M2MCRAY29tLmF1Pg=="},"prevInTopic":32741,"nextInTopic":32751,"prevInTime":32748,"nextInTime":32750,"topicId":32741,"numMessagesInTopic":0,"msgSnippet":"... The real question in my mind, is how would school help them? If unschooling is good for the average kid, then why wouldn t it be great for kids with","messageBody":"<div id=\"ygrps-yiv-510422069\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;The Patersons&quot;<br/>\n&lt;tuipiri@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Hey all,<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; I notice there are a number of people with autistic kids on this list.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; How does RU work for them?<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Cecily<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>The real question in my mind, is how would school help them? If<br/>\nunschooling is good for the &quot;average&quot; kid, then why wouldn&#39;t it be<br/>\ngreat for kids with special challenges who might be crushed even worse<br/>\nby the school system?<br/>\n<br/>\nRU works for every child, because it&#39;s all about the parents meeting<br/>\nthem where they&#39;re at and helping meet their needs.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com<br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":341368225,"authorName":"The Patersons","from":"&quot;The Patersons&quot; &lt;tuipiri@...&gt;","profile":"tuipiri","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"autism","postDate":"1210563270","msgId":32741,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDkwMWM4YjNlMSQxNmRkMTQyMCQ0NDk3M2M2MCRAY29tLmF1Pg=="},"prevInTopic":0,"nextInTopic":32749,"prevInTime":32740,"nextInTime":32742,"topicId":32741,"numMessagesInTopic":0,"msgSnippet":"Hey all, I notice there are a number of people with autistic kids on this list. How does RU work for them? Cecily [Non-text portions of this message have been","messageBody":"<div id=\"ygrps-yiv-18721959\">Hey all,<br/>\n<br/>\n <br/>\n<br/>\nI notice there are a number of people with autistic kids on this list.<br/>\n<br/>\n <br/>\n<br/>\nHow does RU work for them?<br/>\n<br/>\n <br/>\n<br/>\nCecily<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":32855,"nextTopicId":32819}}