{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":276731379,"authorName":"robin.bentley@comcast.net","from":"robin.bentley@...","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Snarky comments etc.","postDate":"1185990262","msgId":25411,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA4MDEyMDA3MTc0NC4yMTAwMi40NkIwQzY3NjAwMDIxNDJEMDAwMDUyMEEyMjA2OTk5NzM1OTcwQTA0OUIwMjBBMEREMjAyMDcwRDAxOURAY29tY2FzdC5uZXQ+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":25410,"nextInTime":25412,"topicId":25411,"numMessagesInTopic":0,"msgSnippet":"I consider myself a very sensitive person.  Therefore, if I were to ask a question, I will have read enough to know the tone of the list to understand that the","messageBody":"<div id=\"ygrps-yiv-1174015128\">I consider myself a very sensitive person.  Therefore, if I were to ask a question, I will have read enough to know the tone of the list to understand that the wise people here will give me answers straight up, without the &quot;there-there, you&#39;re doing fine&quot; patronizing tone that occurs on other lists.  I come here for this straightforward kind of advice, in spite of my sensitivity.  I&#39;ve read long enough here (and at AlwaysLearning and UnschoolingDiscussion to name a couple) to see most, if not all, of my questions answered without me ever asking them!  I imagine there are legions of lurkers in the same boat.  We learn and learn and learn, in our own way.<br/>\n<br/>\nI have great respect for people who post their questions, since it is hard for me to do, especially those who truly are here to learn how they can do things better.  I understand that it&#39;s a complete paradigm shift for some people and it can be quite uncomfortable to be called on one&#39;s entrenched and unexamined ideas.   It&#39;s good to cut those folks some slack, because they usually demonstrate they are attempting to &quot;get it&quot;.  <br/>\n<br/>\nI&#39;m less patient with others who post in the most combative of ways, attempting to call out long-term radical unschoolers (people who are living proof that RU not only &quot;works&quot; but is the best way I&#39;ve seen to have a wonderful and joyful relationship with one&#39;s children).  I usually skip their posts after awhile, because I&#39;ve heard it all before and I&#39;m tired of the same old unconvincing arguments that no tv/punishment/arbitrary rules/whatever are better than or at least equal to RUing (I read the replies, though, because that&#39;s where I learn more about RU, in the continual clarifying).  <br/>\n<br/>\nI have enormous respect for the list owners/moderators/list mainstays who answer the same questions over and over again without losing it and shouting &quot;Get a grip, you people!&quot; (though perhaps they do that in private &lt;g&gt;).  And I&#39;ve met many &quot;RU-ier than thou&quot; families in person.  Well, thank goodness for them!  If they are doing it better than I, then I still have something to learn.  <br/>\n<br/>\nSometimes empathy and support for old ideas is exactly the opposite of what is needed when moving towards an RU life.  If I can&#39;t be challenged to change my old ways of doing things, I might never understand that there&#39;s a better, more peaceful way to live with my child.  Sometimes I have to be hit over the head with the information, because if I get the &quot;it&#39;s okay, you know your child best&quot; kind of answer, I&#39;ll stay right where I am.  Then the question becomes &quot;am I here to learn and grow&quot; or &quot;am I here to have my current ideas and methods validated&quot;?<br/>\n<br/>\nPeople get plenty of empathy and support in person at unschooling conferences.  Empathy and support to keep moving in an RU direction, which, ostensibly, one is there to do (the reasons are less clear, I think, for being on email lists).   As others have said about online exchanges: think of the person giving her RU advice as sitting beside you, giving you the straight goods, but having a smile on her face and open arms for a hug, if needed.  And you can get that irl at a conference.  I highly recommend it!<br/>\n<br/>\nRobin B.<br/>\n<br/>\nP.S.  Phew, that took me days to write and I&#39;m not happy with it yet.  Maybe that&#39;s another reason I don&#39;t post much &lt;g&gt;.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":25406,"nextTopicId":25417}}