{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":206058243,"authorName":"Geneva Goza","from":"&quot;Geneva Goza&quot; &lt;gozas@...&gt;","profile":"nevagoza","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] got one for ya!!","postDate":"1132211800","msgId":7766,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDExMTcyMDA1MDIwNC4zMDE1LjQzN0JFNTJBMDAwMTg5QzMwMDAwMEJDNzIyMDA3MzU4MzQwRTAzMDMwMTAzMDIwQTk2QGNvbWNhc3QubmV0Pg=="},"prevInTopic":7765,"nextInTopic":0,"prevInTime":7765,"nextInTime":7767,"topicId":7736,"numMessagesInTopic":0,"msgSnippet":"MaRY - THANKS for your reply and for sharing your wisdom!  I really appreciate it.  I have a feeling you are correct, it s the not worrying part that is a","messageBody":"<div id=\"ygrps-yiv-905328134\">MaRY - THANKS for your reply and for sharing your wisdom!  I really<br/>\nappreciate it.  I have a feeling you are correct, it&#39;s the not worrying part<br/>\nthat is a challenge!<br/>\nAgain thank you. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;My question is this. Echo has never expressed any type of romantic<br/>\n </span></blockquote>feelings or play with any other kids so this is all very new for me.  I have<br/>\nnoticed lately that lately when they play &quot;family&quot; Aanaleese always likes to<br/>\nbring the role playing into bedtime.where the mom and dad are going to<br/>\nbed...<br/>\n<br/>\n...I&#39;m just wondering in a nut shell if this all sounds okay and if you<br/>\nwould be comfortable with all of this.&gt;&gt;<br/>\n<br/>\nThis all sounds sweet and innocent to me.  As long as you can talk freely<br/>\nwith Echo and check in periodically to make sure both kids are comfortable<br/>\nwith the game, I wouldn&#39;t worry.<br/>\n<br/>\n--<br/>\n~Mary, unschooling mom to Conor (16) and Casey (11)</div>","specialLinks":[]},{"userId":218449772,"authorName":"zenmomma@comcast.net","from":"zenmomma@...","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] got one for ya!!","postDate":"1132193066","msgId":7765,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExMTcyMDA1MDIwNC4zMDE1LjQzN0JFNTJBMDAwMTg5QzMwMDAwMEJDNzIyMDA3MzU4MzQwRTAzMDMwMTAzMDIwQTk2QGNvbWNhc3QubmV0Pg=="},"prevInTopic":7736,"nextInTopic":7766,"prevInTime":7764,"nextInTime":7766,"topicId":7736,"numMessagesInTopic":0,"msgSnippet":"... ...I m just wondering in a nut shell if this all sounds okay and if you would be comfortable with all of this. This all sounds sweet and innocent to me.","messageBody":"<div id=\"ygrps-yiv-2025221256\"><blockquote><span title=\"ireply\">&gt;&gt;My question is this. Echo has never expressed any type of romantic feelings or play with any other kids so this is all very new for me.  I have noticed lately that lately when they play &quot;family&quot; Aanaleese always likes to bring the role playing into bedtime.where the mom and dad are going to bed...<br/>\n<br/>\n </span></blockquote>...I&#39;m just wondering in a nut shell if this all sounds okay and if you would be comfortable with all of this.&gt;&gt;<br/>\n<br/>\nThis all sounds sweet and innocent to me.  As long as you can talk freely with Echo and check in periodically to make sure both kids are comfortable with the game, I wouldn&#39;t worry.<br/>\n<br/>\n--<br/>\n~Mary, unschooling mom to Conor (16) and Casey (11)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/CorvallisTLC/\">http://groups.yahoo.com/group/CorvallisTLC/</a><br/>\n<br/>\n<br/>\n&quot;The miracle is not to walk on water. The miracle is to walk on the<br/>\ngreen earth, dwelling deeply in the present moment and feeling truly<br/>\nalive.&quot;</div>","specialLinks":[]},{"userId":206058243,"authorName":"Geneva Goza","from":"&quot;Geneva Goza&quot; &lt;gozas@...&gt;","profile":"nevagoza","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"got one for ya!!","postDate":"1132042945","msgId":7736,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{},"prevInTopic":0,"nextInTopic":7765,"prevInTime":7735,"nextInTime":7737,"topicId":7736,"numMessagesInTopic":0,"msgSnippet":"My son Echo is almost 5 yo.  We came to unschooling about a yr and a half ago and that has led us closer to TCS and radical unschooling.  I recognize that it","messageBody":"<div id=\"ygrps-yiv-1100712836\">My son Echo is almost 5 yo.  We came to unschooling about a yr and a half<br/>\nago and that has led us closer to TCS and radical unschooling.  I recognize<br/>\nthat it is a journey and dh and I have lots to learn but more than anything<br/>\nI want/try to be respectful, patient and understanding.  Now for my dilemma<br/>\n- Echo has a friend Aanaleese, she is 5.5 and homeschooled in a very relaxed<br/>\nway, her mom and I have been friends for about a year and I consider her<br/>\nvery dear and I see our friendship as a very important one that I want to<br/>\nnurture and grow old with - I hope that makes sense.  I have lots of<br/>\ngirlfriends but I see her and her family as special.<br/>\n<br/>\nAanaleese and Echo play together about once per week, sometimes more.<br/>\n<br/>\n <br/>\n<br/>\nIn the past couple of mos, when she visits they play &quot;family&quot;, where Echo is<br/>\nthe dad, Aanaleese is the mom and my 2 yo daughter is either the gma or more<br/>\nrecently the daughter.  Echo and Aanaleese are very loving and nurturing to<br/>\ntheir &quot;daughter&quot; and honestly I have teared up over some of the sweet<br/>\nsituations that have come up in their &quot;parenting&quot; of their &quot;daughter&quot;.  I<br/>\ncan go into more detail as needed.<br/>\n<br/>\n <br/>\n<br/>\nMy question is this.Echo has never expressed any type of romantic feelings<br/>\nor play with any other kids so this is all very new for me.  I have noticed<br/>\nlately that lately when they play &quot;family&quot; Aanaleese always likes to bring<br/>\nthe role playing into bedtime.where the mom and dad are going to bed.  So<br/>\nthis basically means 2 5 yo  going to bed in the middle of the day.  What do<br/>\nthey do - they lie in bed.  There has been talk of &quot;would you like to take<br/>\nyour wedding ring off and put it on the table with mine&quot; etc.  It&#39;s all very<br/>\ninnocent and sweet and I feel proud that they both have loving relationships<br/>\nto model.  Dh and I are very affectionate and always have been without<br/>\nfeeling shameful or as if we should not kiss/hug in front of the kids.<br/>\n<br/>\n <br/>\n<br/>\nAgain, I am happy to divuldge any info to help you understand the goings on<br/>\nwithout typing it all out now.  I&#39;m just wondering in a nut shell if this<br/>\nall sounds okay and if you would be comfortable with all of this.  In my<br/>\nheart I am okay with it but not sure &quot;how&quot; to handle it or if I should<br/>\n&quot;handle&quot; anything in th e first place.  We have a 2 story house where the<br/>\nkids have 2 bedrooms and a bath upstairs.  When my kids are home without<br/>\nfriends over, they choose to be downstairs with me ut when they have<br/>\nAanaleese over, they choose to be upstairs.I do pop in and visit with them,<br/>\nI also invite them down to do other things with me but when Aanaleese is<br/>\nover they are almost always in character it seems.  There are 3 beds<br/>\nupstairs as well as a pretend kitchen, living area, dinette, dress up box<br/>\netc.so that is the &#39;family&#39;s&quot; homestead and when I try to involve myself<br/>\nthey obviously do not want/need me there.<br/>\n<br/>\n <br/>\n<br/>\nOn Friday.the kids came down for a snack and while I was preparing it, I<br/>\npeeked into the living room to see Echo and Aanaleese in eachother&#39;s arms.<br/>\nWell ithought it was very sweet but at the same time (was it MY upbringing<br/>\nthat triggered these feelings?) it did make me a tad uncomfortable.  Again,<br/>\nit was very innocent and loving looking.Echo says she is his best friend<br/>\never and he loves her very much OR do I need to have a talk with my son.<br/>\n<br/>\n <br/>\n<br/>\nI guess I am just a bit confused.are they too young?  My parents shamed me<br/>\nfor this sort of thing and I don&#39;t want to make them feel shameful - they<br/>\nreally do love eachother, but they are 5!!!!  Gotta go now but I look<br/>\nforward to some feed back and hearing what you all would do/ have done in<br/>\nthis situation.<br/>\n<br/>\n <br/>\n<br/>\nGeneva Goza<br/>\n<br/>\nPersonal Chef Services<br/>\n<br/>\n214-660-0231<br/>\n<br/>\n214-663-0141 cell<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gozas@...\">gozas@...</a><br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":7759,"nextTopicId":7787}}