{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":18,"messages":[{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help me think this thru please...","postDate":"1306154963","msgId":46757,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4MDRBNzg5QFVOSUJMQUIuQ05DU09GVFdBUkUuY29tPg=="},"prevInTopic":46756,"nextInTopic":0,"prevInTime":46756,"nextInTime":46758,"topicId":46711,"numMessagesInTopic":0,"msgSnippet":"... We ALWAYS eat something before any family gathering (even Thanksgiving and such) - that way we re not snacking so much for one thing (and overeating in","messageBody":"<div id=\"ygrps-yiv-628011641\"><blockquote><span title=\"ireply\">&gt; It wouldn&#39;t hurt to look for alternatives to those kinds of situations. Don&#39;t plan on eating with family, if at all possible - combined family meals can be reallllly stressfull!<br/>\n<br/>\n </span></blockquote>We ALWAYS eat something before any family gathering (even Thanksgiving and such) - that way we&#39;re not snacking so much for one thing (and overeating in ways that aren&#39;t healthy for us given our medical issues) and also so that if DS decides he doesn&#39;t want to sit and eat at the table, he doesn&#39;t need to &quot;Thanks but he had lunch already and he&#39;s been snacking on the crackers and cheese, so he&#39;s fine reading in the living room right now. If he gets hungry, we&#39;ll get him something later. I&#39;ll be sure to call him when your amazing cheesecake is being served.&quot; It makes him (and us) a bit crazy when family members are harping on their kids to eat their dinner - when the kids (and adults) have been snacking for the last 2 or 3 hours on everything from cheese and crackers to fruit and veggies to chips (or crisps to those across the Pond) to assorted baked goods. But, we&#39;ve also tried to help DS understand that (a) we&#39;re not about to do that (b) we can&#39;t change them right away -but we can maybe be an example of an alternate way of being (c) he can just be polite and say &quot;no thanks&quot; or, his usual &quot;I&#39;m good right now&quot; and we&#39;ll back him in if they try to push the issue.<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Help me think this thru please...","postDate":"1306154339","msgId":46756,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4MDRBNzZFQFVOSUJMQUIuQ05DU09GVFdBUkUuY29tPg=="},"prevInTopic":46753,"nextInTopic":46757,"prevInTime":46755,"nextInTime":46757,"topicId":46711,"numMessagesInTopic":0,"msgSnippet":"... It always confused DS when other kids were being punished or controlled when he was littler. As he got older, DH and I would remind him before going into","messageBody":"<div id=\"ygrps-yiv-2014511422\"><blockquote><span title=\"ireply\">&gt; They were trying to make his cousin sit still and calm down at the time and this could definitely be what upset him.<br/>\n<br/>\n </span></blockquote>It always confused DS when other kids were being &quot;punished&quot; or controlled when he was littler. As he got older, DH and I would remind him before going into situations like that that no matter what Aunt and Uncle were doing, we had his back (in situation and age appropriate ways). What was MOST important, though, was acting on that - when people would &quot;gently&quot; (as far as they were concerned it was gentle) try to get DS to do something &quot;c&#39;mon over here and eat your dinner because we&#39;ve got cake for dessert!&quot; I&#39;d make sure to say something like &quot;Can I have my cake first? I want to make sure I&#39;ve got room for it!&quot; or whatever - and sometimes (with some relatives) explicitly say &quot;He can have cake whether he has dinner or not&quot; By 5 or 6 years old, he knew to just check in with us if he was uncertain about something or if someone was trying to control him - and we would have a &quot;unwinding&quot; session on the drive home where he could vent (verbally) things like &quot;Why do grown-ups force kids to eat their whole dinner so they can have dessert when the grown-ups don&#39;t do that?&quot; He&#39;s learned over time that he can just politely say &quot;Thanks but no thanks&quot; or whatever and refer whomever to us if they need clarification that yes, it&#39;s perfectly fine for him to just eat dessert or no, he doesn&#39;t have to do that if he chooses not to.<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help me think this thru please...","postDate":"1306094180","msgId":46753,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlyYnBwNCtvdDFiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlyYjl2Mys3bG9oQGVHcm91cHMuY29tPg=="},"prevInTopic":46752,"nextInTopic":46756,"prevInTime":46752,"nextInTime":46754,"topicId":46711,"numMessagesInTopic":0,"msgSnippet":"... ******************** That can be hard on kids - watching other kids be bullied by their parents. A lot of unschooling kids react strongly to images like","messageBody":"<div id=\"ygrps-yiv-1665176925\">&quot;Robin&quot; &lt;robinlaroy@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I am actually not sure my son was even that upset when he was screaming.  He wasn&#39;t crying or visably sad.  I don&#39;t think any one tried to make him directly sit still or eat, and we always let him come and go from the table, even at the ILs, despite what my SIL and BIL do with their kids.  They were trying to make his cousin sit still and calm down at the time and this could definitely be what upset him.  <br/>\n </span></blockquote>********************<br/>\n<br/>\nThat can be hard on kids - watching other kids be bullied by their parents. A lot of unschooling kids react strongly to images like that on tv and movies, so its not surprising that one would be upset or offended in person. To a little kid, watching another child be made to sit still and calm down looks scary. <br/>\n<br/>\nLittle kids like to be able to feel powerful, and using a big, loud voice creates a big sense of power! So it also makes sense that he would fall back on his big powerful voice in a situation that was leaving him feeling a bit powerless - he couldn&#39;t help his cousin, but he could get everyone&#39;s attention on himself. <br/>\n<br/>\nIt wouldn&#39;t hurt to look for alternatives to those kinds of situations. Don&#39;t plan on eating with family, if at all possible - combined family meals can be reallllly stressfull! And if you can&#39;t resist a family meal now and then, be sure not to leave your little guy alone with other family members for now - they can&#39;t/won&#39;t help the way you will, and he needs you to help him figure out how to deal with these people. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":172077574,"authorName":"Robin","from":"&quot;Robin&quot; &lt;robinlaroy@...&gt;","profile":"robinlaroy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help me think this thru please...","postDate":"1306077987","msgId":46752,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlyYjl2Mys3bG9oQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlyNjAxYytpMjg5QGVHcm91cHMuY29tPg=="},"prevInTopic":46743,"nextInTopic":46753,"prevInTime":46751,"nextInTime":46753,"topicId":46711,"numMessagesInTopic":0,"msgSnippet":"Thanks for all the answers.  It really helps. Right now my son is in a big screaming stage.  Partly he likes to hear his own voice get so loud, and he does","messageBody":"<div id=\"ygrps-yiv-393033260\">Thanks for all the answers.  It really helps.  <br/>\n<br/>\nRight now my son is in a big screaming stage.  Partly he likes to hear his own voice get so loud, and he does this outside or in the playroom, or in his room or other places where he likes to hear the echos and experience his voice.  <br/>\n<br/>\nBut he also seems to really want to test boundaries right now or at least other peoples comfort levels.  At this family gathering usually his aunt or uncle or grandma are rather &#39;controlling&#39; not directed at him, but at his close in age cousin.  She has some very controlling parents and I think this can be very confusing for my son.  I am guessing something like this happened, but I was in the kitchen, still in eye sight, serving the pudding at that moment.  So I am not exactly sure what happened before the screaming started at my MILs.  <br/>\n<br/>\nI really like the idea of having a signal.  When he was younger, I know in chaotic situations he would usually ask to nurse and I would take the opportunity to find a secluded spot in the house to reconnect and take time out from everything else.  It makes so much sense to still have those moments even if nursing isn&#39;t involved.  I am actually not sure my son was even that upset when he was screaming.  He wasn&#39;t crying or visably sad.  I don&#39;t think any one tried to make him directly sit still or eat, and we always let him come and go from the table, even at the ILs, despite what my SIL and BIL do with their kids.  They were trying to make his cousin sit still and calm down at the time and this could definitely be what upset him.  <br/>\n<br/>\nThank you again,<br/>\nRobin</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Help me think this thru please...","postDate":"1306010496","msgId":46743,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4MDRBNjMyQFVOSUJMQUIuQ05DU09GVFdBUkUuY29tPg=="},"prevInTopic":46736,"nextInTopic":46752,"prevInTime":46742,"nextInTime":46744,"topicId":46711,"numMessagesInTopic":0,"msgSnippet":"... We ve always done this when social occasions were at our house. We d set up little stack tables in the living room, get the kids served first, get a movie","messageBody":"<div id=\"ygrps-yiv-161988575\"><blockquote><span title=\"ireply\">&gt;It helps a lot to look for alternatives to requiring kids to join adults at formal meals. If there are several children, a &quot;kids table&quot; with kid-friendly foods and even some fun activity can be a great way to make meal time a positive social experience for little kids -<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>We&#39;ve always done this when social occasions were at our house. We&#39;d set up little stack tables in the living room, get the kids served first, get a movie in the DVD player and let them relax at their own level while the adults ate and talked boring grown up talk.<br/>\n<br/>\n<br/>\n<br/>\nOn occasion, at gatherings, I&#39;ve deliberately filled my plate and DS&#39; plate and then taken BOTH of them to the other room and sat in there with him (and any other kids who could convince their parents it was okay - I&#39;d smile and say Sure s/he can join us!) thus keeping contact with DS (instead of segregating him away from the adults), getting some time away from the boring adult chatter (which I sometimes need), and proactively making the situation more manageable over all (some parents seemed really happy that it was &quot;okay&quot; to allow their kids to not sit at the table and all).<br/>\n<br/>\n<br/>\n<br/>\n-Deb R<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Help me think this thru please...","postDate":"1305984718","msgId":46736,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlyOGVzZStvNWdAZUdyb3Vwcy5jb20+","inReplyToHeader":"PGlyNjNjcyt0M2x1QGVHcm91cHMuY29tPg=="},"prevInTopic":46730,"nextInTopic":46743,"prevInTime":46735,"nextInTime":46737,"topicId":46711,"numMessagesInTopic":0,"msgSnippet":"And it comes in handy for older people too. Can t stand one more minute of the wonderful family gathering? Eye contact with DH and we are out of there! :) ","messageBody":"<div id=\"ygrps-yiv-1904755559\">And it comes in handy for older people too. Can&#39;t stand one more minute of the &quot;wonderful&quot; family gathering? Eye contact with DH and we are out of there! :)<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Debra Rossing &lt;debra.rossing@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; Something that helped when DS was younger was pre-arranging a place and a signal when we were going to be elsewhere (at the ILs for example) so that it didn&#39;t feel like a punishment but rather gave him the power to control the situation<br/>\n&gt; ********************<br/>\n&gt; <br/>\n&gt; Yes! both my kids have benefitted from having &quot;escape routes&quot; - places they could go or ways they could exit from a difficult situation. This has become *vitally* important for Ray as he&#39;s moved into the teen years. As a young man who looks older than he is, he&#39;s found a need to extricate himself from situations that were becoming dangerous. <br/>\n&gt; <br/>\n&gt; ---Meredith <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  - I feel like screaming so I&#39;m going to the screaming place. He&#39;d come to me and simply say We need to talk (or just signal me from across the room depending on the situation) and we&#39;d meet up in the pre-arranged location (sometimes the bathroom, sometimes a &#39;guest room&#39;, sometimes outside depending on the circumstances - outside wasn&#39;t great during New England winters). I&#39;d also look for &#39;triggers&#39; - being packed into a room with a dozen or more other people was one - so I&#39;d pro-actively call him to be with me in our other location for a bit. In your example, I might simply have grabbed his pudding and spoon and taken it with us to the other room (and picked a location that was okay for the pudding to be in if eating in the living room is a hot button at that house). Just my two cents looking in on what you&#39;ve written but it sounds like maybe he was feeling lost and overwhelmed with all the chit chat, noise, over stimulation, etc and screaming was a way to get some attention and vent some pent up stress. People sometimes were startled when DS would come and slam into me or I&#39;d hold up my hand and he&#39;d punch at it for a bit - but those were pre-arranged strategies for him to let off steam in a manner that was safe in tight situations. It must sometimes have looked pretty odd to see us hand wrestling and such while I just continued to chit chat (if that was okay, sometimes he needed both physical outlet and full attention).<br/>\n&gt; &gt; <br/>\n&gt; &gt; Deb R<br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; **********************************************************************<br/>\n&gt; &gt; This email and any files transmitted with it are confidential and<br/>\n&gt; &gt; intended solely for the use of the individual or entity to whom they<br/>\n&gt; &gt; are addressed. If you have received this email in error please notify<br/>\n&gt; &gt; the system manager.<br/>\n&gt; &gt; <br/>\n&gt; &gt; This footnote also confirms that this email message has been swept by<br/>\n&gt; &gt; MIMEsweeper for the presence of computer viruses.<br/>\n&gt; &gt; <br/>\n&gt; &gt; www.mastercam.com<br/>\n&gt; &gt; **********************************************************************<br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help me think this thru please...","postDate":"1305907420","msgId":46730,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlyNjNjcyt0M2x1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4MDRBMkYzQFVOSUJMQUIuQ05DU09GVFdBUkUuY29tPg=="},"prevInTopic":46728,"nextInTopic":46736,"prevInTime":46729,"nextInTime":46731,"topicId":46711,"numMessagesInTopic":0,"msgSnippet":"... ******************** Yes! both my kids have benefitted from having escape routes - places they could go or ways they could exit from a difficult","messageBody":"<div id=\"ygrps-yiv-1542039263\">Debra Rossing &lt;debra.rossing@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Something that helped when DS was younger was pre-arranging a place and a signal when we were going to be elsewhere (at the ILs for example) so that it didn&#39;t feel like a punishment but rather gave him the power to control the situation<br/>\n </span></blockquote>********************<br/>\n<br/>\nYes! both my kids have benefitted from having &quot;escape routes&quot; - places they could go or ways they could exit from a difficult situation. This has become *vitally* important for Ray as he&#39;s moved into the teen years. As a young man who looks older than he is, he&#39;s found a need to extricate himself from situations that were becoming dangerous. <br/>\n<br/>\n---Meredith <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n - I feel like screaming so I&#39;m going to the screaming place. He&#39;d come to me and simply say We need to talk (or just signal me from across the room depending on the situation) and we&#39;d meet up in the pre-arranged location (sometimes the bathroom, sometimes a &#39;guest room&#39;, sometimes outside depending on the circumstances - outside wasn&#39;t great during New England winters). I&#39;d also look for &#39;triggers&#39; - being packed into a room with a dozen or more other people was one - so I&#39;d pro-actively call him to be with me in our other location for a bit. In your example, I might simply have grabbed his pudding and spoon and taken it with us to the other room (and picked a location that was okay for the pudding to be in if eating in the living room is a hot button at that house). Just my two cents looking in on what you&#39;ve written but it sounds like maybe he was feeling lost and overwhelmed with all the chit chat, noise, over stimulation, etc and screaming was a way to get some attention and vent some pent up stress. People sometimes were startled when DS would come and slam into me or I&#39;d hold up my hand and he&#39;d punch at it for a bit - but those were pre-arranged strategies for him to let off steam in a manner that was safe in tight situations. It must sometimes have looked pretty odd to see us hand wrestling and such while I just continued to chit chat (if that was okay, sometimes he needed both physical outlet and full attention).<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; Deb R<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; **********************************************************************<br/>\n&gt; This email and any files transmitted with it are confidential and<br/>\n&gt; intended solely for the use of the individual or entity to whom they<br/>\n&gt; are addressed. If you have received this email in error please notify<br/>\n&gt; the system manager.<br/>\n&gt; <br/>\n&gt; This footnote also confirms that this email message has been swept by<br/>\n&gt; MIMEsweeper for the presence of computer viruses.<br/>\n&gt; <br/>\n&gt; www.mastercam.com<br/>\n&gt; **********************************************************************<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help me think this thru please...","postDate":"1305904610","msgId":46728,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlyNjBsMitiYjdqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlyNWFjNStpNHAwQGVHcm91cHMuY29tPg=="},"prevInTopic":46727,"nextInTopic":46730,"prevInTime":46727,"nextInTime":46729,"topicId":46711,"numMessagesInTopic":0,"msgSnippet":"... ***************** One of the marvelous aspects of unschooling is discovering there s no need for that kind of behavior toward children - it doesn t help","messageBody":"<div id=\"ygrps-yiv-1134478897\">&quot;Betty&quot; &lt;bettyjeanmarino@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;YOU are not the boss- I am the boss. When I tell you to do something you do it! Now go in there and do it!&quot;<br/>\n </span></blockquote>*****************<br/>\n<br/>\nOne of the marvelous aspects of unschooling is discovering there&#39;s no need for that kind of behavior toward children - it doesn&#39;t help them learn to be better people, if anything it gets in the way. That&#39;s a wonder to me, I was raised to expect parents as bosses and children as peons so I&#39;m overjoyed to know that kids actually learn more that is good without that kind of parenting. <br/>\n<br/>\nKids don&#39;t need bosses to learn. They do need help and support, but only the kind of help and support they need. A person who is falling apart doesn&#39;t need scolding - that might get him to swallow down his needs and feelings, but not in any kind of positive way (setting aside feelings in an emergency is a good thing, setting aside feelings for someone else&#39;s convenience isn&#39;t). <br/>\n<br/>\nIf a parent considers him or herself the &quot;boss&quot; its worth thinking what kind of boss you want to be. If you want to be a benevolent dictator, then work on benevolence. Don&#39;t set your children up to fall apart in social situations, help them cope, look for alternatives that let them be kids without getting in the way of others&#39; needs. If you set a child up to fail and then scold him for it, you&#39;re just a despot - and I doubt that&#39;s the kind of relationship you want with your beloved child. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Help me think this thru please...","postDate":"1305903980","msgId":46727,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlyNjAxYytpMjg5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlyNGZiaithOXAwQGVHcm91cHMuY29tPg=="},"prevInTopic":46723,"nextInTopic":46728,"prevInTime":46726,"nextInTime":46728,"topicId":46711,"numMessagesInTopic":0,"msgSnippet":"In the short run, remove him from the room and bring the pudding, too. There s no need to leave it behind. It doesn t help to try to talk to a young child when","messageBody":"<div id=\"ygrps-yiv-360155288\">In the short run, remove him from the room and bring the pudding, too. There&#39;s no need to leave it behind. It doesn&#39;t help to try to talk to a young child when he or she is having a meltdown - it doesn&#39;t help adults, for that matter. People need time to react and move past those big intense feelings before they can think. <br/>\n<br/>\nIn the longer term, its a good idea to think about why he melted down - its hard on many little kids to be required to sit and sit and be bored, and &quot;eating dinner&quot; can be that sort of situation. That&#39;s not helpful for children. They don&#39;t learn much good being made to sit at a table unhappily. It helps a lot to look for alternatives to requiring kids to join adults at formal meals. If there are several children, a &quot;kids table&quot; with kid-friendly foods and even some fun activity can be a great way to make meal time a positive social experience for little kids - and that&#39;s what you want at a family gathering, to create positive social experiences so that your kids have a chance of liking their relatives ;)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I have since tried to figure out what the screaming is for, but my question is more what do I do when it&#39;s actually happening.  Any ideas??<br/>\n </span></blockquote>*******************<br/>\n<br/>\nMany toddlers do go through a screaming stage - and it can last for several years, I think Ray was still bending metal with his voice until he was 5 or 6, but those were short-duration screams. Since you said your son wasn&#39;t stopping, I&#39;d assume he&#39;s overwhelmed and needing some help and attention.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Help me think this thru please...","postDate":"1305894520","msgId":46723,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlyNW1wbys0bnZvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlyNGZiaithOXAwQGVHcm91cHMuY29tPg=="},"prevInTopic":46722,"nextInTopic":46727,"prevInTime":46722,"nextInTime":46724,"topicId":46711,"numMessagesInTopic":0,"msgSnippet":"You handled it just fine. Nance","messageBody":"<div id=\"ygrps-yiv-164433634\">You handled it just fine.<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Robin&quot; &lt;robinlaroy@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi,  I am Robin, mom to J, 5 in July, and S, just turned two.  A situation occurred a couple weeks ago and I don&#39;t like how I handled it, but I am not sure what I should have done differently.  <br/>\n&gt; We, my husband, kids and I, were at my in-laws for Mothers Day, eating dessert with my MIL, FIL, two SILs and there husbands, as well as my 3 and 1 year old neices.  My son decided to start screaming, which he does a lot lately, and he is ear piercing loud, too.  So, I tried to talk to him, empathize, express my feelings of frustration, offer an alternate place where we could go to scream (outside), etc., but, honestly, I doubt he could hear a word I was saying given that I could barely hear myself.  I ended up picking him up and removing him from the table to the living room where we could talk.  But the whole time I was moving him, he was saying &quot;Let me go.  I want my pudding.  Put me down.&quot;. And once in the other room he wanted to go out until I told him it sounded like maybe we should both calm down and talk before we go back in.  I explained that what he was doing was physically hurting everyones ears.  <br/>\n&gt; My problem with the situation was me having to physically remove him.  I feel like it was a total invasion of his space, but I am not sure what alternatives I had.  I mean, even our unschooling friends are impressed with J&#39;s ability to scream so loud your ears hurt.  And he wasn&#39;t stopping.  I have since tried to figure out what the screaming is for, but my question is more what do I do when it&#39;s actually happening.  Any ideas??<br/>\n&gt; Thanks for any help you can give.<br/>\n&gt; Warmly,<br/>\n&gt; Robin<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Help me think this thru please...","postDate":"1305893014","msgId":46722,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4MDRBMkYzQFVOSUJMQUIuQ05DU09GVFdBUkUuY29tPg=="},"prevInTopic":46719,"nextInTopic":46723,"prevInTime":46721,"nextInTime":46723,"topicId":46711,"numMessagesInTopic":0,"msgSnippet":"Something that helped when DS was younger was pre-arranging a place and a signal when we were going to be elsewhere (at the ILs for example) so that it didn t","messageBody":"<div id=\"ygrps-yiv-1570162191\">Something that helped when DS was younger was pre-arranging a place and a signal when we were going to be elsewhere (at the ILs for example) so that it didn&#39;t feel like a punishment but rather gave him the power to control the situation - I feel like screaming so I&#39;m going to the screaming place. He&#39;d come to me and simply say We need to talk (or just signal me from across the room depending on the situation) and we&#39;d meet up in the pre-arranged location (sometimes the bathroom, sometimes a &#39;guest room&#39;, sometimes outside depending on the circumstances - outside wasn&#39;t great during New England winters). I&#39;d also look for &#39;triggers&#39; - being packed into a room with a dozen or more other people was one - so I&#39;d pro-actively call him to be with me in our other location for a bit. In your example, I might simply have grabbed his pudding and spoon and taken it with us to the other room (and picked a location that was okay for the pudding to be in if eating in the living room is a hot button at that house). Just my two cents looking in on what you&#39;ve written but it sounds like maybe he was feeling lost and overwhelmed with all the chit chat, noise, over stimulation, etc and screaming was a way to get some attention and vent some pent up stress. People sometimes were startled when DS would come and slam into me or I&#39;d hold up my hand and he&#39;d punch at it for a bit - but those were pre-arranged strategies for him to let off steam in a manner that was safe in tight situations. It must sometimes have looked pretty odd to see us hand wrestling and such while I just continued to chit chat (if that was okay, sometimes he needed both physical outlet and full attention).<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Help me think this thru please...","postDate":"1305887508","msgId":46719,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZCRkQwMEI3LTVEMDktNDM0Mi1BMDlDLTNEOThENTQ1MzUyMEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDYxMDg4Mi43NDQyMS5xbUB3ZWI4NzMxNS5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PGlyNWFjNStpNHAwQGVHcm91cHMuY29tPiA8NjEwODgyLjc0NDIxLnFtQHdlYjg3MzE1Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":46718,"nextInTopic":46722,"prevInTime":46718,"nextInTime":46720,"topicId":46711,"numMessagesInTopic":0,"msgSnippet":"... Yes. If a parent would like her kids to be kind and compassionate, she needs to live those values. Use kindness and compassion as tools to help them. If,","messageBody":"<div id=\"ygrps-yiv-638076762\">On May 20, 2011, at 6:19 AM, Schuyler wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but are<br/>\n&gt; instead dealing with their own difficulties has helped me to be kind.<br/>\n<br/>\n </span></blockquote>Yes. If a parent would like her kids to be kind and compassionate, she  <br/>\nneeds to live those values. Use kindness and compassion as tools to  <br/>\nhelp them.<br/>\n<br/>\nIf, on the other hand, she wants her kids to manhandle an annoying or  <br/>\nuncooperative sibling or child who is weaker than they are, then, yes,  <br/>\ndo that to them.<br/>\n<br/>\nEvery day is an opportunity to put our values into practice as we  <br/>\nsolve problems. If someone values yelling, overpowering someone, being  <br/>\nthe one in control, then do that. Because kids will learn how to  <br/>\nhandle future problems from what we use to help them with their  <br/>\nproblems today.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Help me think this thru please...","postDate":"1305886758","msgId":46718,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxMDg4Mi43NDQyMS5xbUB3ZWI4NzMxNS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGlyNWFjNStpNHAwQGVHcm91cHMuY29tPg==","referencesHeader":"PGlyNWFjNStpNHAwQGVHcm91cHMuY29tPg=="},"prevInTopic":46717,"nextInTopic":46719,"prevInTime":46717,"nextInTime":46719,"topicId":46711,"numMessagesInTopic":0,"msgSnippet":"This isn t unschooling. This is just one of many ways that parents can and do work to separate themselves from their children. I wouldn t recommend this at ","messageBody":"<div id=\"ygrps-yiv-215965162\">This isn&#39;t unschooling. This is just one of many ways that parents can and do <br/>\nwork to separate themselves from their children. I wouldn&#39;t recommend this at <br/>\nall. At best your child would swallow their screams, their moment of unhappiness <br/>\nand hide it away. At worst nothing would change. At best they&#39;d thank you years <br/>\nlater for being such a loving and disciplining parent even while choosing not to <br/>\ncome and see you that often and passing on the unhappiness that you gave them to <br/>\ntheir own children. At worst they&#39;d disconnect from you at the first <br/>\nopportunity. <br/>\n<br/>\n<br/>\nI&#39;m not the boss in my house. I&#39;m not the boss over someone else. I&#39;m the <br/>\nresponsible party and the accountable adult, but I&#39;m not really the boss. I&#39;ve <br/>\nmanaged to be kind enough and generous enough that both Simon and Linnaea will <br/>\nlisten to me. I&#39;ve earned their respect. I could still lose it, it could still <br/>\ncrumble away from me if I chose to use my size and my position as parent to my <br/>\nadvantage and not to theirs. It&#39;s worked to my advantage to see myself less as <br/>\nan authority figure and lesson teacher and more as a helper and engager and <br/>\nsometimes as a person with better access to knowledge and some prior experience. <br/>\nIt has also worked well to see Simon and Linnaea as people working to do their <br/>\nbest in any given situation. If they are upset, if they are unhappy or unkind, <br/>\nseeing that they aren&#39;t doing those things to make someone suffer but are <br/>\ninstead dealing with their own difficulties has helped me to be kind. I am the <br/>\nadult, I am the one who has had a lot longer to try and learn to be more patient <br/>\nand more kind. It isn&#39;t fair for me to expect them to be more than I can be in <br/>\nany given moment. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Betty &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bettyjeanmarino@...\">bettyjeanmarino@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Friday, 20 May, 2011 9:56:37<br/>\nSubject: [unschoolingbasics] Re: Help me think this thru please...<br/>\n<br/>\nAll I can say is how I would have handled the situation. Pick the kid straight <br/>\nup on of the chair and place him in the next room. Squat down to his level, wag <br/>\nyour finger in this face and say &quot;YOU are not the boss- I am the boss. When I <br/>\ntell you to do something you do it! Now go in there and do it!&quot;<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Help me think this thru please...","postDate":"1305886420","msgId":46717,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0RkVCMjY5LThGMEYtNDM4Qy04QTg4LTNDMEEyODA1QUY0OEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGlyNWFjNStpNHAwQGVHcm91cHMuY29tPg==","referencesHeader":"PGlyNWFjNStpNHAwQGVHcm91cHMuY29tPg=="},"prevInTopic":46715,"nextInTopic":46718,"prevInTime":46716,"nextInTime":46718,"topicId":46711,"numMessagesInTopic":0,"msgSnippet":"... And if you were horribly upset by a problem to the point where you couldn t contain yourself how would you feel if your husband manhandled you out of the","messageBody":"<div id=\"ygrps-yiv-1770662107\"><blockquote><span title=\"ireply\">&gt; Pick the kid straight up on of the chair and place him in the next  <br/>\n&gt; room. Squat down to his level, wag your finger in this face and say  <br/>\n&gt; &quot;YOU are not the boss- I am the boss. When I tell you to do  <br/>\n&gt; something you do it! Now go in there and do it!&quot;<br/>\n<br/>\n </span></blockquote>And if you were horribly upset by a problem to the point where you  <br/>\ncouldn&#39;t contain yourself how would you feel if your husband  <br/>\nmanhandled you out of the room?<br/>\n<br/>\nHow would it feel if he ignored your problem and jumped to the  <br/>\nconclusion that your crying was all about him and an intent to control  <br/>\nhim? How would it feel if he, in essence, told you he didn&#39;t care  <br/>\nabout your feelings or your problem, only that you presented a good  <br/>\nimage to make him look like a husband that had you under control? And  <br/>\nthat you needed to get back in the room and do that?<br/>\n<br/>\nWould it draw the two of you closer? Would you love him all the more?  <br/>\nWould you feel you could depend on him to be by your side to help you  <br/>\nthrough a crisis and support you and be there for you?<br/>\n<br/>\nOr would you feel abandoned and like it was up to you to figure things  <br/>\nout on your own? And perhaps that if you had some crisis the last  <br/>\nperson in the world you&#39;d turn to is your husband?<br/>\n<br/>\nConventional parenting puts a great deal of emphasis on appearances.  <br/>\nIf kids don&#39;t show they&#39;re upset, don&#39;t show that they&#39;re needy, don&#39;t  <br/>\nshow that they can&#39;t handle something, then it&#39;s presumed the child is  <br/>\nfine.<br/>\n<br/>\nConventional parenting focuses a great deal on making kids less  <br/>\ninconvenient.<br/>\n<br/>\nAnd those focuses show their results by the time the kids are teens  <br/>\nwhen the teens are less needful of grown ups to do for them. And they  <br/>\nreject the parents control just as the parents have been rejecting the  <br/>\nkids all along.<br/>\n<br/>\nIf anyone here wants to avoid snarky, rebellious teens, don&#39;t do what  <br/>\nthe poster said. Instead, be your child&#39;s partner starting today.  <br/>\nAssume the child is not trying to make your life more difficult.  <br/>\nAssume the child is doing the best he can. And if screaming is the  <br/>\nbest he can do, then he&#39;s really really hurting. And having someone he  <br/>\ntrusts be mean and horrible to him will blow a huge damaging hole in  <br/>\nthe relationship.<br/>\n<br/>\nBe the one your kids can lean on and depend on. *Trust* that they  <br/>\ndon&#39;t want to be dependent their whole lives. *Trust* that they don&#39;t  <br/>\nlike feeling out of control and will be able to handle upsetness  <br/>\nbetter as they mature, as their self-awareness grows, as they are  <br/>\nsoothed and helped to find tools they can use to handle situations.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; All I can say is how I would have handled the situation.<br/>\n<br/>\n </span></blockquote>And that&#39;s how conventional parenting is passed on. It&#39;s random ideas  <br/>\nthat &quot;work&quot; traded back and forth without an inkling of understanding  <br/>\nof why they worked for one family. Or, importantly, what &quot;worked&quot;  <br/>\nmeans. For most parents &quot;works&quot; means kids do what the parents think  <br/>\nis best. It&#39;s all about control.<br/>\n<br/>\nAnd many many parents have barely functioning relationships with their  <br/>\nkids by the time the kids are teens. As their growing up, the kids may  <br/>\nbe -- as far as the parents can see -- doing what the parents tell  <br/>\nthem to, but by creating an atmosphere where parents are struggling to  <br/>\nmaintain power and control over kids, the relationship takes on  <br/>\naspects of master/slave or imperious boss/powerless employee. Neither  <br/>\nof those are recommended if you want a great relationship with someone!<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":268202999,"authorName":"Betty","from":"&quot;Betty&quot; &lt;bettyjeanmarino@...&gt;","profile":"bettyjeanmarino","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help me think this thru please...","postDate":"1305881797","msgId":46715,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlyNWFjNStpNHAwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlyNGZiaithOXAwQGVHcm91cHMuY29tPg=="},"prevInTopic":46713,"nextInTopic":46717,"prevInTime":46714,"nextInTime":46716,"topicId":46711,"numMessagesInTopic":0,"msgSnippet":"All I can say is how I would have handled the situation. Pick the kid straight up on of the chair and place him in the next room. Squat down to his level, wag","messageBody":"<div id=\"ygrps-yiv-1169230274\">All I can say is how I would have handled the situation. Pick the kid straight up on of the chair and place him in the next room. Squat down to his level, wag your finger in this face and say &quot;YOU are not the boss- I am the boss. When I tell you to do something you do it! Now go in there and do it!&quot;</div>","specialLinks":[]},{"userId":277288379,"authorName":"Dawn Hall","from":"Dawn Hall &lt;hallfamily8@...&gt;","profile":"mrshallinohio","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Help me think this thru please...","postDate":"1305859053","msgId":46713,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBTkxrVGluTnNWYXRVN2IrSytEempmNjFreG80YUpyWC1BQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGlyNGZiaithOXAwQGVHcm91cHMuY29tPg==","referencesHeader":"PGlyNGZiaithOXAwQGVHcm91cHMuY29tPg=="},"prevInTopic":46712,"nextInTopic":46715,"prevInTime":46712,"nextInTime":46714,"topicId":46711,"numMessagesInTopic":0,"msgSnippet":"I think you did the right thing.  I also think you ought to consider if there is any sensory issue involved that brings on his screaming fits?  If so, you","messageBody":"<div id=\"ygrps-yiv-1692752480\">I think you did the right thing.  I also think you ought to consider if<br/>\nthere is any sensory issue involved that brings on his screaming fits?  If<br/>\nso, you could see if it is something that you could avoid, change, or help<br/>\nhim adapt to.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, May 19, 2011 at 9:15 PM, Robin &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robinlaroy@...\">robinlaroy@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; My son decided to start screaming, which he does a lot lately, and he is<br/>\n&gt; ear piercing loud, too. So, I tried to talk to him, empathize, express my<br/>\n&gt; feelings of frustration, offer an alternate place where we could go to<br/>\n&gt; scream (outside), etc., but, honestly, I doubt he could hear a word I was<br/>\n&gt; saying given that I could barely hear myself.<br/>\n&gt;<br/>\n<br/>\n-- <br/>\nLove, Dawn<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Help me think this thru please...","postDate":"1305858095","msgId":46712,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ5NTU5MzQwLUQ5QzItNDExOS05Q0NGLTk2MTdCRTQ4OTYwOEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGlyNGZiaithOXAwQGVHcm91cHMuY29tPg==","referencesHeader":"PGlyNGZiaithOXAwQGVHcm91cHMuY29tPg=="},"prevInTopic":46711,"nextInTopic":46713,"prevInTime":46711,"nextInTime":46713,"topicId":46711,"numMessagesInTopic":0,"msgSnippet":"... He was invading everyone else s space with his screaming. Yes, remove him. Do it compassionately. You re not punishing him. You re taking him somewhere","messageBody":"<div id=\"ygrps-yiv-620846839\">On May 19, 2011, at 9:15 PM, Robin wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My problem with the situation was me having to physically remove  <br/>\n&gt; him. I feel like it was a total invasion of his space<br/>\n<br/>\n </span></blockquote>He was invading everyone else&#39;s space with his screaming.<br/>\n<br/>\nYes, remove him. Do it compassionately. You&#39;re not punishing him.  <br/>\nYou&#39;re taking him somewhere where he can cry, making it possible for  <br/>\nothers to have more peace. No one gets to behave anyway they want  <br/>\naround other people.<br/>\n<br/>\nThis might help:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/breathing\">http://sandradodd.com/breathing</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":172077574,"authorName":"Robin","from":"&quot;Robin&quot; &lt;robinlaroy@...&gt;","profile":"robinlaroy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Help me think this thru please...","postDate":"1305854131","msgId":46711,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlyNGZiaithOXAwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":46712,"prevInTime":46710,"nextInTime":46712,"topicId":46711,"numMessagesInTopic":0,"msgSnippet":"Hi,  I am Robin, mom to J, 5 in July, and S, just turned two.  A situation occurred a couple weeks ago and I don t like how I handled it, but I am not sure","messageBody":"<div id=\"ygrps-yiv-1462856602\">Hi,  I am Robin, mom to J, 5 in July, and S, just turned two.  A situation occurred a couple weeks ago and I don&#39;t like how I handled it, but I am not sure what I should have done differently.  <br/>\nWe, my husband, kids and I, were at my in-laws for Mothers Day, eating dessert with my MIL, FIL, two SILs and there husbands, as well as my 3 and 1 year old neices.  My son decided to start screaming, which he does a lot lately, and he is ear piercing loud, too.  So, I tried to talk to him, empathize, express my feelings of frustration, offer an alternate place where we could go to scream (outside), etc., but, honestly, I doubt he could hear a word I was saying given that I could barely hear myself.  I ended up picking him up and removing him from the table to the living room where we could talk.  But the whole time I was moving him, he was saying &quot;Let me go.  I want my pudding.  Put me down.&quot;. And once in the other room he wanted to go out until I told him it sounded like maybe we should both calm down and talk before we go back in.  I explained that what he was doing was physically hurting everyones ears.  <br/>\nMy problem with the situation was me having to physically remove him.  I feel like it was a total invasion of his space, but I am not sure what alternatives I had.  I mean, even our unschooling friends are impressed with J&#39;s ability to scream so loud your ears hurt.  And he wasn&#39;t stopping.  I have since tried to figure out what the screaming is for, but my question is more what do I do when it&#39;s actually happening.  Any ideas??<br/>\nThanks for any help you can give.<br/>\nWarmly,<br/>\nRobin</div>","specialLinks":[]}],"prevTopicId":46714,"nextTopicId":46767}}