{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:Saying Yes, examples!","postDate":"1269988617","msgId":43559,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvdHVlOSttOGJ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDQzlFMzU1Q0IzMDM3Ni1FM0MtRURFOUB3ZWJtYWlsLW0wODMuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":43556,"nextInTopic":0,"prevInTime":43558,"nextInTime":43560,"topicId":43556,"numMessagesInTopic":0,"msgSnippet":"... ************************* Sometimes explaining helps, other times it can aggravate the situation. My kids would have done better with something simpler,","messageBody":"<div id=\"ygrps-yiv-1300201003\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, AECANGORA@... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;dd1, came down stairs and asked to watch one of her shows and started to react when daddy said not right now.  I pointed out to her that we have been a lot less controlling of how much and what she watches, and that she needed to be respectful of other family members when they are watching. <br/>\n </span></blockquote>*************************<br/>\n<br/>\nSometimes explaining helps, other times it can aggravate the situation. My kids would have done better with something simpler, like &quot;its his turn right now&quot;. I&#39;m trying to imagine talking about control and turn-taking sounding like something other than a mini-lecture - from me it would be lecturing, for sure! <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":132876517,"authorName":"AECANGORA@aol.com","from":"AECANGORA@...","profile":"amy_aec","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:Saying Yes, examples!","postDate":"1269963157","msgId":43556,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQzlFMzU1Q0IzMDM3Ni1FM0MtRURFOUB3ZWJtYWlsLW0wODMuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":0,"nextInTopic":43559,"prevInTime":43555,"nextInTime":43557,"topicId":43556,"numMessagesInTopic":0,"msgSnippet":"Hi, I am new to radical unschooling as well and am still in the learning stage.  I thought I would share a couple of examples of situations that we have had","messageBody":"<div id=\"ygrps-yiv-369342136\">Hi,<br/>\n<br/>\n  <br/>\nI am new to radical unschooling as well and am still in the learning stage.  I thought I would share a couple of examples of situations that we have had here lately and how I&#39;ve handled them.<br/>\n<br/>\nFist, I think that the advice to &quot;Say Yes, more often&quot; means to rethink why you are saying no and if it can&#39;t be yes, is there a third option.  I don&#39;t think it means that you have to give up all your values and personal boundaries at once.  it doesn&#39;t mean that you have to become a people pleaser and meet everyone&#39;s needs while neglecting your own.<br/>\n<br/>\nTwo Examples of recent situations in our family.<br/>\n1.  Sat. morning TV - My husband was the first one up and was watching TV.  (Something he gets to do very little of during the week.)  Emma, dd1, came down stairs and asked to watch one of her shows and started to react when daddy said not right now.  I pointed out to her that we have been a lot less controlling of how much and what she watches, and that she needed to be respectful of other family members when they are watching.  I also told her that she was more than welcome to watch what she wanted when he was done.  Interestingly, after breakfast, when he turned off the TV, she was so engrossed in a book that she did not turn it on until much later.<br/>\n<br/>\n2.  Yesterday after school (Emma choose to go last year) asked if we could go to a movie.  Since we were able to find one that we cold get to in time and still be home for bed-time I said yes.  I also said yes to the root beer forgetting that Barg&#39;s has caffeine.  (I had one too!)  Needless to say we both had trouble unwinding.  I let her read in bed until she turned out the light and fell asleep.  A little later she woke up from a bad dream and wanted me to sit in her room until she fell back to sleep.  I was still down stairs trying to unwind and watching TV.  The old me would have either sat in the room while resenting it the whole time or fussed and fumed at her about how I had done this nice thing for her and now needed time to myself.  The new me grabbed her blanket and pillow and told her to come downstairs and lay on the couch.  She watched TV with me for about half an hour and then fell asleep.  I then got an extra blanket for her and left a light on so she wouldn&#39;t get scared and could see to come upstairs if she woke up.  In the end, we both got what we needed.  She needed to be near me and I needed to unwind before going to bed.  (Note:  I was actually prepared to let her stay home today, but she got up and went with no problem.)<br/>\n<br/>\nI hope that helps. I had other examples, but have had to rewrite this twice no due to internet issues - ugh! I think the point it to see how each persons needs can be met without infringing on others.  I think that as the girls see that we are trying to accommodate them, they will be more willing to accept it when we cant accommodate them due to outside circumstances.  <br/>\n<br/>\nAmy C.<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":43512,"nextTopicId":43564}}