{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":118,"messages":[{"userId":254952563,"authorName":"aidansutherland","from":"&quot;aidansutherland&quot; &lt;aidansutherland@...&gt;","profile":"aidansutherland","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Advice needed","postDate":"1232115818","msgId":37823,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdrcTU5YSs0MmlhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdrbmh0MStlbzhyQGVHcm91cHMuY29tPg=="},"prevInTopic":37819,"nextInTopic":37824,"prevInTime":37822,"nextInTime":37824,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"... now. ... I took my GED when I was 16, too. It really was easy, though I did take a prep class. However, I have so rarely come across any occasions where it","messageBody":"<div id=\"ygrps-yiv-566866166\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;raisingexplorers&quot;<br/>\n&lt;raisingexplorers@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt;  He know that I dropped out of school in 11th grade for medical<br/>\n&gt; reasons and took my GED and passed with flying colors.  No prep or<br/>\n&gt; studying at all.  But he is assuming that the GED has gotten harder<br/>\n </span></blockquote>now.  <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I took my GED in either 1999 or 2000 and it wasn&#39;t hard. This was 2 or<br/>\n&gt; 3 years after I dropped out of school (where I was flunking everything<br/>\n&gt; anyhow), so plenty of time to forget almost everything. LOL<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I took my GED when I was 16, too. It really was easy, though I did<br/>\ntake a prep class. However, I have so rarely come across any occasions<br/>\nwhere it did me any good, I really question why I did it at all. I<br/>\nmean, if he wants to go to college, I think he should do it. But a GED<br/>\nis not much of a goal in itself because as an adult, no-one questions<br/>\nwhether I finished high school or not. There are so few jobs where<br/>\nthey are going to check and see if you graduated high school. What<br/>\ndoes he see doing in the future he&#39;s imagining? If it involves<br/>\nanything with more requirements than grocery store cashier or factory<br/>\nworker, you could help him to stop sweating the small stuff. Because<br/>\nlearning the kind of basic math they test for on the GED probably<br/>\nwon&#39;t be all that hard for him, and is just one step of the journey.</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"&quot;Faith Void&quot; &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: World of Warcraft ( was: Advice needed)","postDate":"1232113319","msgId":37817,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkwMTE2MDU0MW4xNzk5YjIxMG02YzdlYjQ3NjQ3M2NlMjI2QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDQ2OTkzNTc4MDkwMTE1MTkwNms3NTkxMTQyNWtkMWU5YjhmMDdmMTdlNzIzQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDY1MzgxNS44MjEwNy5xbUB3ZWIzMzUwMi5tYWlsLm11ZC55YWhvby5jb20+CSA8NTM2MjU4LjE0NzIwLnFtQHdlYjU0MTEwLm1haWwucmUyLnlhaG9vLmNvbT4JIDw2N2E5ZDc1MDA5MDExNTE4MTJ3NDdhNDRlOWVyMjk4YmZmZDk2OTQxNDk0ZEBtYWlsLmdtYWlsLmNvbT4JIDw0Njk5MzU3ODA5MDExNTE5MDZrNzU5MTE0MjVrZDFlOWI4ZjA3ZjE3ZTcyM0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":37815,"nextInTopic":37818,"prevInTime":37816,"nextInTime":37818,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"I am wondering why you/we as a culture call it gaming addiction?  To me that sounds like blame instead of taking the responsibility for your choice of using","messageBody":"<div id=\"ygrps-yiv-1714592765\">I am wondering why you/we as a culture call it gaming addiction?  To me that<br/>\nsounds like blame instead of taking the responsibility for your choice of<br/>\nusing escapism to avoid life&#39;s issues for a while. I was abused as a child,<br/>\nraped as my first sexual experience and I have an anxiety and personality<br/>\ndisorder. I do not use these as an excuse for dealing with my issues and<br/>\nmoving forward to be the best parent I can for my children. I do not use<br/>\nfear as a reason for controlling my child. I have addiction and alcoholism<br/>\nin my family as well. I could go on, but what i am getting at is it is an<br/>\nexcuse to use the word addiction.<br/>\n<br/>\nFaith<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Jan 15, 2009 at 10:06 PM, Dan Lake &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:danthedad@...\">danthedad@...</a>&gt; wrote:<br/>\n<br/>\n&gt;   Karen,<br/>\n&gt; Here is your link. Looks like it was Starcraft and not WoW, sorry about<br/>\n&gt; that. I know, it&#39;s an isolated instance. He had all the joy he could handle<br/>\n&gt; I guess.<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://news.bbc.co.uk/1/hi/technology/4137782.stm\">http://news.bbc.co.uk/1/hi/technology/4137782.stm</a><br/>\n&gt;<br/>\n&gt; Faith,<br/>\n&gt; My education mostly predates unschooling. I was not &quot;nurtured and<br/>\n&gt; supported&quot;<br/>\n&gt; by my dad who died in 1983 and my mom who has not spoken to me since our<br/>\n&gt; first child was born in 2001. I don&#39;t blame them and I don&#39;t blame WoW<br/>\n&gt; either. I had some issues to work through that it sounds like your kids<br/>\n&gt; will<br/>\n&gt; never know. Despite all of that, there are in fact people (~4% of WoW<br/>\n&gt; players) who play more than 80 hours per week. Probably most of them are<br/>\n&gt; escaping something as I did to some degree. Probably none of them are<br/>\n&gt; unschooled.<br/>\n&gt;<br/>\n&gt; Nowhere did I or would I discourage people from playing WoW or other games.<br/>\n&gt; But for some people on here to say that there is no such thing as gaming<br/>\n&gt; addiction, internet addiction is ridiculous. Further, to call me names for<br/>\n&gt; sharing a personal experience that is obviously not my proudest time<br/>\n&gt; doesn&#39;t<br/>\n&gt; feel unschooly to me either.<br/>\n&gt;<br/>\n&gt; ~Da<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":267621540,"authorName":"Brenna Shugarts","from":"Brenna Shugarts &lt;bshugarts@...&gt;","profile":"bshugarts","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: World of Warcraft ( was: Advice needed)","postDate":"1232110359","msgId":37819,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5MTA5My45MDkyMy5xbUB3ZWIzMzUwMy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":37818,"nextInTopic":37823,"prevInTime":37818,"nextInTime":37820,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"Once again to each his own & i have a 23 yr old who hates his father because his father was absentee his whole life.  My 11 & 12 yr old girls are just as","messageBody":"<div id=\"ygrps-yiv-1806222966\">Once again to each his own & i have a 23 yr old who hates his father because his father was absentee his whole life.  My 11 & 12 yr old girls are just as well adjusted as your wonderful children are except that they have an absentee father.Seems that maybe I have touched a sensitive spot for some, or people just really have to much time on there hands. it was just a hamless warning. Please read Dans info if you do not believe that it can become a real addiction. There are countless website available about this info as well. Not saying no video games just becareful.Love & Light brenna<br/>\n<br/>\n<br/>\n<br/>\nreputation is what men & women think of us. character is what God & the angels know of us.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Thu, 1/15/09, Pamela Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: Pamela Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt;<br/>\nSubject: Re: [unschoolingbasics] Re: World of Warcraft ( was: Advice needed)<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Thursday, January 15, 2009, 9:49 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nOn Jan 15, 2009, at 4:16 PM, Brenna Shugarts wrote:<br/>\n<br/>\n&gt; he refuses to accept his addiction & no his parents did not support <br/>\n&gt; him. His father was a major acholoic & mother too busy w/ step <br/>\n&gt; father & self help seminars to worry about him. Good Luck to you & <br/>\n&gt; what you decide w/ it.<br/>\n&gt;<br/>\n<br/>\nI don&#39;t need good luck. My youngest child is going to be 18 in two <br/>\nweeks and my kids are all three happy and productive and successful <br/>\nand living really good lives.<br/>\n<br/>\nOne thing you might want to consider, though, is that the life of an <br/>\nunschooled child is one in which there is a rich tapestry of <br/>\nexperience offered and tremendous support provided by the parents. <br/>\nPlaying video games in that environment is not escapism, it is a <br/>\nchoice to do something for the love of it. Moving positively toward <br/>\nsomething (choosing to play video games for the pure joy of it) is <br/>\nvery very different than moving away from something (playing video <br/>\ngames to avoid facing problems in one&#39;s life).<br/>\n<br/>\nStill, I feel for you and I&#39;m really sorry you&#39;re facing such problems.<br/>\n<br/>\n-pam<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":267621540,"authorName":"Brenna Shugarts","from":"Brenna Shugarts &lt;bshugarts@...&gt;","profile":"bshugarts","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"2"},"subject":"Re: [unschoolingbasics] Re: World of Warcraft ( was: Advice needed)","postDate":"1232109807","msgId":37818,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0NjczNi45ODY5NS5xbUB3ZWIzMzUwMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":37817,"nextInTopic":37819,"prevInTime":37817,"nextInTime":37819,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"Dan... Thank you... you said it beautifully. Brenna reputation is what men & women think of us. character is what God & the angels know of us. ... From: Dan","messageBody":"<div id=\"ygrps-yiv-364621178\">Dan... Thank you... you said it beautifully. Brenna<br/>\n<br/>\n<br/>\n<br/>\nreputation is what men & women think of us. character is what God & the angels know of us.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Thu, 1/15/09, Dan Lake &lt;danthedad@...&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: Dan Lake &lt;danthedad@...&gt;<br/>\nSubject: Re: [unschoolingbasics] Re: World of Warcraft ( was: Advice needed)<br/>\nTo: unschoolingbasics@yahoogroups.com<br/>\nDate: Thursday, January 15, 2009, 3:10 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI&#39;m not going to say that someone should impose limits on another person<br/>\nand I strongly believe in supporting my kids&#39; and wife&#39;s passions. I&#39;ll also<br/>\nsay that some of you have never met someone suffering from video game<br/>\naddiction. Some people (I&#39;m one of them) have seriously addictive<br/>\nmentalities and find the virtual world such an incredible escape from the<br/>\n&quot;real&quot; world that they completely check out. The built-in systems of<br/>\nactivities and small rewards are more than entertaining to some and become<br/>\nan extremely addictive driver of behavior. There are countless documented<br/>\ncases of people losing their jobs, failing school (I know, who cares right?)<br/>\nand even divorced due to video game addiction and the resulting neglect of<br/>\neverything and everyone around. People have even died from starvation or<br/>\nmalnutrition while playing WoW, LotR, Everquest, UO, etc.<br/>\n<br/>\nI&#39;ll go out on a limb here and hopefully add some credibility to my story by<br/>\nsaying that my wife and I played WoW for almost 2 years together. We<br/>\nexperienced at least 8-10 hours of &quot;joy&quot; every day during that period. I<br/>\nplayed at work, we played together at home, we played when the kids were<br/>\nsleeping, awake, eating, you name it. The leveling, resource gathering,<br/>\nquests, raids, and rep grinding were all we thought about day and night. We<br/>\nlost touch with every real world friend we had known save one, despite how<br/>\nmuch they expressed concern for us. Between me and my wife we gained 100<br/>\npounds. It really didn&#39;t matter because there was always another purple epic<br/>\nsword or staff our mount or raid boss to conquer. One day we left the water<br/>\nrunning while playing and the entire upstairs of our house filled with<br/>\nwater. When we got up from playing at 4am (I had to be at work at 7am), the<br/>\ncarpet in our office was like a marsh. We only played 6 months more after<br/>\nthat happened.<br/>\n<br/>\nAs a kid, I played dozens of similar games, the most notable being the<br/>\nUltima 1 - Ultima 8 series. The difference with these games is that they all<br/>\nhad an ending where the game can be beaten or won. The last game I &quot;won&quot; was<br/>\nUltima 4 which took me about 2 months playing every day after school. This<br/>\nwas in 1985. Once the game was over, it was back to the real world for a<br/>\nwhile for a &quot;reality check&quot;. With WoW, the game never ever ends and you can<br/>\nnever obtain or attain the highest levels of gear and proficiencies no<br/>\nmatter how many thousands of hours you commit to it. If you are &quot;casual&quot;<br/>\nthen you might have a great social time, but your progress will stop hard at<br/>\nsome point. The amount of time commitment during what is unfortunately<br/>\ncalled the &quot;end game&quot; stage increases exponentially and this is a common<br/>\nformula among most MMORPGs.<br/>\n<br/>\nAre the games fun, yes of course! But, video game addiction is as real as<br/>\nalchoholism or gambling addiction. I&#39;ve met hundreds of in-game addicts. If<br/>\nthere is someone in your life who has stopped eating, bathing, or leaving<br/>\nthe house, you have a right to be concerned (even if they are just reading<br/>\nbooks I would argue). Should you force your will on others? No way. Anyone<br/>\nwho known an alchoholic will tell you the first step to recovery is<br/>\nrecognizing you have a problem. Tell your husband/wife/ kids that you miss<br/>\nthem and the types of interactions you used to have together. Ultimately<br/>\nthere needs to be a balance between the video game and the people, places,<br/>\nthings and SELF that you care about in your real world.<br/>\n<br/>\nThere is nothing at all bad about playing WoW. It is an incredible world to<br/>\nexplore. I have been back to Azeroth a few times in the past 2-3 years but I<br/>\ndon&#39;t find it very fun because I&#39;m not willing to put in the time to<br/>\n&quot;succeed&quot; and my friends are all once again in the real world. I would<br/>\nencourage people to try out WoW even though I wasn&#39;t able to hold my<br/>\nconjured glacier water and murloc fin soup.<br/>\n<br/>\n~Dan<br/>\n<br/>\nSome links for you. They are not mine, but might help someone.<br/>\nhttp://www.olganon. org/<br/>\nhttp://en.wikipedia .org/wiki/ Video_game_ addiction<br/>\n<br/>\nOn Thu, Jan 15, 2009 at 10:03 AM, Faith Void &lt;littlemsvoid@ gmail.com&gt; wrote:<br/>\n<br/>\n&gt; What I am reading is that you are suggesting that:<br/>\n&gt;<br/>\n&gt; A) People you don&#39;t know should place arbitrary limits on their children&#39;s<br/>\n&gt; activities because of your fear that they might become so full of joy with<br/>\n&gt; a<br/>\n&gt; game that they will want nothing else when they grown up.<br/>\n&gt;<br/>\n&gt; B) That there is something wrong with your husband because he doesn&#39;t like<br/>\n&gt; his job more than a video game.<br/>\n&gt;<br/>\n&gt; C) That 10 hours of joy is bad if it is in front of a video game.<br/>\n&gt;<br/>\n&gt; D) That you feel like their is something lacking in your husband&#39;s life due<br/>\n&gt; to playing video games so much as a child.<br/>\n&gt;<br/>\n&gt; E) You are attempting to control an adult that you choose to marry.<br/>\n&gt;<br/>\n&gt; a) I feel like placing limits is more likely to create an imbalance that<br/>\n&gt; will last until adulthood. I think arbitrary limits inhibit a respectful<br/>\n&gt; trusting relationship between two people. I prefer to celebrate my<br/>\n&gt; children&#39;s and my husband&#39;s passions and interests. I find that<br/>\n&gt; participating in or sharing the joy brings more joy and friendship and<br/>\n&gt; love.<br/>\n&gt;<br/>\n&gt; b) Perhaps your husband needs a more fullfilling job. One that brings joy<br/>\n&gt; to<br/>\n&gt; him instead of sucks it from him. Perhaps the activities that you are<br/>\n&gt; talking about are less interesting than the game he loves. My husband LOVES<br/>\n&gt; WoW. He plays frequently. He also loves his work and family. Because he<br/>\n&gt; loves and enjoys them all he finds balance.<br/>\n&gt;<br/>\n&gt; c) If someone found 10 straight hours of joy while reading would that be<br/>\n&gt; ok?<br/>\n&gt; If someone found 10 straight hours of joy at church would that be ok? If<br/>\n&gt; someone found 10 hours of joy working on physics problems? Why would one<br/>\n&gt; passion or pursuit be better than another?<br/>\n&gt;<br/>\n&gt; d) You husband is exactly who he needs to be right now at this moment.<br/>\n&gt; Regret is a waste of energy and a vacuum to joy. Sure my life would have<br/>\n&gt; been different if xy or z didn;t happen. Reality is that xyz did happen, it<br/>\n&gt; shaped who I am. I like who I am. If I regret those things I am expressing<br/>\n&gt; a<br/>\n&gt; dissatisfaction with who I AM. Instead if I don&#39;t like something I am doing<br/>\n&gt; I changer that.<br/>\n&gt;<br/>\n&gt; e) I thing trying to control your husband (or children) is just going to<br/>\n&gt; cause resentment and anger. Perhaps you could find a way to celebrate his<br/>\n&gt; video game obsession. Bring him special food while he plays, sit next to<br/>\n&gt; him<br/>\n&gt; and rub his shoulders that must be stressed from working a job he doesn&#39;t<br/>\n&gt; love.<br/>\n&gt;<br/>\n&gt; Faith<br/>\n&gt;<br/>\n&gt; On Thu, Jan 15, 2009 at 8:13 AM, Brenna Shugarts &lt;bshugarts@yahoo. com&lt;bshugarts%40yahoo. com&gt;<br/>\n&gt; &gt;wrote:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; oh, ladies PLEASE limit your childs time on this game. My husband has<br/>\n&gt; &gt; been addicted to it for years! i can&#39;t get him off of it. he looks for<br/>\n&gt; ways<br/>\n&gt; &gt; to stay home from activities/work so he can play. I have seen him<br/>\n&gt; actually<br/>\n&gt; &gt; sit for 10 hrs!!! there also was a virus on one of the scripts & it fried<br/>\n&gt; &gt; our last computer. (about 3 months ago) Hope you all don&#39;t think i am<br/>\n&gt; being<br/>\n&gt; &gt; to nosy just conserned. i often wonder what he could have done w/ his<br/>\n&gt; life<br/>\n&gt; &gt; had he not spent so much time on the games. I know as a mother noone<br/>\n&gt; wants<br/>\n&gt; &gt; to say that about there children. Love & Light. Brenna<br/>\n&gt; &gt;<br/>\n&gt; &gt; reputation is what men & women think of us. character is what God & the<br/>\n&gt; &gt; angels know of us.<br/>\n&gt; &gt;<br/>\n&gt; &gt; -<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; --<br/>\n&gt; http://faithvoid. blogspot. com/<br/>\n&gt; www.bearthmama. com<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: World of Warcraft ( was: Advice needed)","postDate":"1232102876","msgId":37815,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNCRDc3RkYwLTAwRTEtNEFCRS05OEIzLTY5MDI3RTQ0MjA5M0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDQ2OTkzNTc4MDkwMTE1MTkwNms3NTkxMTQyNWtkMWU5YjhmMDdmMTdlNzIzQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDY1MzgxNS44MjEwNy5xbUB3ZWIzMzUwMi5tYWlsLm11ZC55YWhvby5jb20+IDw1MzYyNTguMTQ3MjAucW1Ad2ViNTQxMTAubWFpbC5yZTIueWFob28uY29tPiA8NjdhOWQ3NTAwOTAxMTUxODEydzQ3YTQ0ZTllcjI5OGJmZmQ5Njk0MTQ5NGRAbWFpbC5nbWFpbC5jb20+IDw0Njk5MzU3ODA5MDExNTE5MDZrNzU5MTE0MjVrZDFlOWI4ZjA3ZjE3ZTcyM0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":37814,"nextInTopic":37817,"prevInTime":37814,"nextInTime":37816,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"... I d say he had little joy and was escaping from a life that was devoid of it. *Why* did he play to the point of death? The game didn t do it. It was","messageBody":"<div id=\"ygrps-yiv-36354600\">On Jan 15, 2009, at 10:06 PM, Dan Lake wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Here is your link. Looks like it was Starcraft and not WoW, sorry  <br/>\n&gt; about<br/>\n&gt; that. I know, it&#39;s an isolated instance. He had all the joy he  <br/>\n&gt; could handle<br/>\n&gt; I guess.<br/>\n<br/>\n </span></blockquote>I&#39;d say he had little joy and was escaping from a life that was  <br/>\ndevoid of it.<br/>\n<br/>\n*Why* did he play to the point of death? The game didn&#39;t do it. It  <br/>\nwas whatever was going on in his life that drove him to want to  <br/>\ncommit suicide.<br/>\n<br/>\nIt muddles thinking to see two identical surface behaviors (many  <br/>\nhours of game playing) and assume there&#39;s a connection. What is  <br/>\ncausing the behavior is the key, not the behavior itself.<br/>\n<br/>\nWe can&#39;t take away everything that someone might use to commit  <br/>\nsuicide! To prevent suicide people need to get to the root causes.  <br/>\nIt&#39;s possible if there were no video games he wouldn&#39;t have had the  <br/>\ncourage to kill himself another way. But should society&#39;s inability  <br/>\nto support someone who is spiraling down into depression mean we  <br/>\nshould deprive millions of people who happily play games because they  <br/>\nenjoy them?<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: World of Warcraft ( was: Advice needed)","postDate":"1232102346","msgId":37814,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI1QzVFNDExLUM3QzUtNERFNy1BMzk2LTdEMzY1QzZDQ0RCRkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDQ2OTkzNTc4MDkwMTE1MTkxNGwxZDdjYmY3YXFjNDMxYzcxOTMxM2ZmODA4QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDgwMzYxMy4yODI5Mi5xbUB3ZWIzMzUwNy5tYWlsLm11ZC55YWhvby5jb20+IDxBQjIzNEU3NS0zQ0I0LTRDMDYtOTQzMS0zMDlGNTdFMjI4NERAbWFjLmNvbT4gPDQ2OTkzNTc4MDkwMTE1MTkxNGwxZDdjYmY3YXFjNDMxYzcxOTMxM2ZmODA4QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":37812,"nextInTopic":37815,"prevInTime":37813,"nextInTime":37815,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"... But keeping kids away from games won t prevent escape or prevent depression. The behavior is a symptom not a cause. Removing what is used as an alleviator","messageBody":"<div id=\"ygrps-yiv-1708166443\">On Jan 15, 2009, at 10:14 PM, Dan Lake wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Unschooling, although wonderful is not magic.<br/>\n&gt; It&#39;s still possible that kids could become unhappy or depressed and  <br/>\n&gt; escape<br/>\n&gt; into drugs, video games, or something else entirely.<br/>\n<br/>\n </span></blockquote>But keeping kids away from games won&#39;t prevent escape or prevent  <br/>\ndepression. The behavior is a symptom not a cause. Removing what is  <br/>\nused as an alleviator doesn&#39;t remove the cause.<br/>\n<br/>\nIn fact if there&#39;s enough fear and control from the parents it might  <br/>\ncause depression. Feeling out of control and fearful are certainly  <br/>\ngood reasons for escape.<br/>\n<br/>\nAn unschooling parent shouldn&#39;t assume escapism from behavior. A  <br/>\nunschooling parent should be involved in their child&#39;s world enough  <br/>\nto know what&#39;s going on.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But to say, &quot;that could never happen to my child&quot; is naive<br/>\n&gt; and insulting to kids who might really be suffering from depression  <br/>\n&gt; or other<br/>\n&gt; issues beyond the direct visibility of the parents.<br/>\n<br/>\n </span></blockquote>Which is why we discuss relationships so much and help parents stay  <br/>\nconnected to their kids.<br/>\n<br/>\nIf you&#39;re reading the surface of the responses and seeing people  <br/>\n*only* say &quot;Let your kids play as much as they want,&quot; you need to  <br/>\nread more and deeper. The goal is to help kids be happy. Happy isn&#39;t  <br/>\nachieved when parents detach from kids to let them do whatever they  <br/>\nwant. That&#39;s neglect. Happy is helped by remaining connected.  <br/>\nConnected might be playing with them, learning enough to have  <br/>\nconversations, bringing them food, finding other kids to play with,  <br/>\nhelping them find cheats and walkthroughs on line, buying the gaming  <br/>\nmagazines and guides, going to conventions, helping them take breaks  <br/>\nat a convenient pause point to go to the bathroom, and for kids who  <br/>\nare carrying the tension of play into life a parent can help them  <br/>\nbecome more aware and find strategies to sidetrack it before it grows  <br/>\nso large they can&#39;t handle it. And so on.<br/>\n<br/>\nUnschooling and mindful parenting is *very* hands on.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":334795970,"authorName":"Dan Lake","from":"&quot;Dan Lake&quot; &lt;danthedad@...&gt;","profile":"dlake97124","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: World of Warcraft ( was: Advice needed)","postDate":"1232075654","msgId":37809,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2OTkzNTc4MDkwMTE1MTkxNGwxZDdjYmY3YXFjNDMxYzcxOTMxM2ZmODA4QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEFCMjM0RTc1LTNDQjQtNEMwNi05NDMxLTMwOUY1N0UyMjg0REBtYWMuY29tPg==","referencesHeader":"PDgwMzYxMy4yODI5Mi5xbUB3ZWIzMzUwNy5tYWlsLm11ZC55YWhvby5jb20+CSA8QUIyMzRFNzUtM0NCNC00QzA2LTk0MzEtMzA5RjU3RTIyODREQG1hYy5jb20+"},"prevInTopic":37808,"nextInTopic":37811,"prevInTime":37808,"nextInTime":37810,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"Thanks Pam, this is basically the point I was trying to make. Escapism is often the cause of addiction. Unschooling, although wonderful is not magic. It s","messageBody":"<div id=\"ygrps-yiv-1215269007\">Thanks Pam, this is basically the point I was trying to make. Escapism is<br/>\noften the cause of addiction. Unschooling, although wonderful is not magic.<br/>\nIt&#39;s still possible that kids could become unhappy or depressed and escape<br/>\ninto drugs, video games, or something else entirely. If done properly,<br/>\nunschooling should give all the options of the world and alleviate most<br/>\nsources of unhappiness in a typical child&#39;s life (bullying, homework, fear<br/>\nof failure, ...). But to say, &quot;that could never happen to my child&quot; is naive<br/>\nand insulting to kids who might really be suffering from depression or other<br/>\nissues beyond the direct visibility of the parents.<br/>\n<br/>\n~Dan<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Jan 15, 2009 at 6:49 PM, Pamela Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt;wrote:<br/>\n<br/>\n&gt;<br/>\n&gt; On Jan 15, 2009, at 4:16 PM, Brenna Shugarts wrote:<br/>\n&gt;<br/>\n&gt; &gt; he refuses to accept his addiction & no his parents did not support<br/>\n&gt; &gt; him. His father was a major acholoic & mother too busy w/ step<br/>\n&gt; &gt; father & self help seminars to worry about him. Good Luck to you &<br/>\n&gt; &gt; what you decide w/ it.<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; I don&#39;t need good luck. My youngest child is going to be 18 in two<br/>\n&gt; weeks and my kids are all three happy and productive and successful<br/>\n&gt; and living really good lives.<br/>\n&gt;<br/>\n&gt; One thing you might want to consider, though, is that the life of an<br/>\n&gt; unschooled child is one in which there is a rich tapestry of<br/>\n&gt; experience offered and tremendous support provided by the parents.<br/>\n&gt; Playing video games in that environment is not escapism, it is a<br/>\n&gt; choice to do something for the love of it. Moving positively toward<br/>\n&gt; something (choosing to play video games for the pure joy of it) is<br/>\n&gt; very very different than moving away from something (playing video<br/>\n&gt; games to avoid facing problems in one&#39;s life).<br/>\n&gt;<br/>\n&gt; Still, I feel for you and I&#39;m really sorry you&#39;re facing such problems.<br/>\n&gt;<br/>\n&gt; -pam<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":334795970,"authorName":"Dan Lake","from":"&quot;Dan Lake&quot; &lt;danthedad@...&gt;","profile":"dlake97124","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: World of Warcraft ( was: Advice needed)","postDate":"1232075186","msgId":37811,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2OTkzNTc4MDkwMTE1MTkwNms3NTkxMTQyNWtkMWU5YjhmMDdmMTdlNzIzQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDY3YTlkNzUwMDkwMTE1MTgxMnc0N2E0NGU5ZXIyOThiZmZkOTY5NDE0OTRkQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDY1MzgxNS44MjEwNy5xbUB3ZWIzMzUwMi5tYWlsLm11ZC55YWhvby5jb20+CSA8NTM2MjU4LjE0NzIwLnFtQHdlYjU0MTEwLm1haWwucmUyLnlhaG9vLmNvbT4JIDw2N2E5ZDc1MDA5MDExNTE4MTJ3NDdhNDRlOWVyMjk4YmZmZDk2OTQxNDk0ZEBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":37809,"nextInTopic":37812,"prevInTime":37810,"nextInTime":37812,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"Karen, Here is your link. Looks like it was Starcraft and not WoW, sorry about that. I know, it s an isolated instance. He had all the joy he could handle I","messageBody":"<div id=\"ygrps-yiv-1709963393\">Karen,<br/>\nHere is your link. Looks like it was Starcraft and not WoW, sorry about<br/>\nthat. I know, it&#39;s an isolated instance. He had all the joy he could handle<br/>\nI guess.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://news.bbc.co.uk/1/hi/technology/4137782.stm\">http://news.bbc.co.uk/1/hi/technology/4137782.stm</a><br/>\n<br/>\nFaith,<br/>\nMy education mostly predates unschooling. I was not &quot;nurtured and supported&quot;<br/>\nby my dad who died in 1983 and my mom who has not spoken to me since our<br/>\nfirst child was born in 2001. I don&#39;t blame them and I don&#39;t blame WoW<br/>\neither. I had some issues to work through that it sounds like your kids will<br/>\nnever know. Despite all of that, there are in fact people (~4% of WoW<br/>\nplayers) who play more than 80 hours per week. Probably most of them are<br/>\nescaping something as I did to some degree. Probably none of them are<br/>\nunschooled.<br/>\n<br/>\nNowhere did I or would I discourage people from playing WoW or other games.<br/>\nBut for some people on here to say that there is no such thing as gaming<br/>\naddiction, internet addiction is ridiculous. Further, to call me names for<br/>\nsharing a personal experience that is obviously not my proudest time doesn&#39;t<br/>\nfeel unschooly to me either.<br/>\n<br/>\n~Dan<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Jan 15, 2009 at 6:12 PM, Karen Swanay &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:luvbullbreeds@...\">luvbullbreeds@...</a>&gt;wrote:<br/>\n<br/>\n&gt;   My husband, myself, and my kids 12 and 10, all play Star Wars Galaxies<br/>\n&gt; Online. We have multiple addictive personalities in our genograms. We<br/>\n&gt; still manage to eat and get the house work done.<br/>\n&gt;<br/>\n&gt; If you want to be a slug and do nothing....you&#39;ll find ways to do that.<br/>\n&gt; Don&#39;t blame a game or a game system for your faults and lack of will. These<br/>\n&gt; &quot;drama and danger&quot; stories have the stench of urban legend about them.<br/>\n&gt; People died from malnutrition from playing WoW? Where&#39;s that story?<br/>\n&gt; Where&#39;s the death certificate? I want to see that.<br/>\n&gt;<br/>\n&gt; Karen<br/>\n&gt; To be wronged is nothing unless you continue to remember it. ~Confucius<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: World of Warcraft ( was: Advice needed)","postDate":"1232074173","msgId":37808,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFCMjM0RTc1LTNDQjQtNEMwNi05NDMxLTMwOUY1N0UyMjg0REBtYWMuY29tPg==","inReplyToHeader":"PDgwMzYxMy4yODI5Mi5xbUB3ZWIzMzUwNy5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDgwMzYxMy4yODI5Mi5xbUB3ZWIzMzUwNy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":37806,"nextInTopic":37809,"prevInTime":37807,"nextInTime":37809,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"... I don t need good luck. My youngest child is going to be 18 in two weeks and my kids are all three happy and productive and successful and living really","messageBody":"<div id=\"ygrps-yiv-2005739024\">On Jan 15, 2009, at 4:16 PM, Brenna Shugarts wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; he refuses to accept his addiction & no his parents did not support  <br/>\n&gt; him. His father was a major acholoic & mother too busy w/ step  <br/>\n&gt; father & self help seminars to worry about him. Good Luck to you &  <br/>\n&gt; what you decide w/ it.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I don&#39;t need good luck. My youngest child is going to be 18 in two  <br/>\nweeks and my kids are all three happy and productive and successful  <br/>\nand living really good lives.<br/>\n<br/>\nOne thing you might want to consider, though, is that the life of an  <br/>\nunschooled child is one in which there is a rich tapestry of  <br/>\nexperience offered and tremendous support provided by the parents.  <br/>\nPlaying video games in that environment is not escapism, it is a  <br/>\nchoice to do something for the love of it. Moving positively toward  <br/>\nsomething (choosing to play video games for the pure joy of it) is  <br/>\nvery very different than moving away from something (playing video  <br/>\ngames to avoid facing problems in one&#39;s life).<br/>\n<br/>\nStill, I feel for you and I&#39;m really sorry you&#39;re facing such problems.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"&quot;Karen Swanay&quot; &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: World of Warcraft ( was: Advice needed)","postDate":"1232071961","msgId":37806,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3YTlkNzUwMDkwMTE1MTgxMnc0N2E0NGU5ZXIyOThiZmZkOTY5NDE0OTRkQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDUzNjI1OC4xNDcyMC5xbUB3ZWI1NDExMC5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDY1MzgxNS44MjEwNy5xbUB3ZWIzMzUwMi5tYWlsLm11ZC55YWhvby5jb20+CSA8NTM2MjU4LjE0NzIwLnFtQHdlYjU0MTEwLm1haWwucmUyLnlhaG9vLmNvbT4="},"prevInTopic":37805,"nextInTopic":37808,"prevInTime":37805,"nextInTime":37807,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"My husband, myself, and my kids 12 and 10, all play Star Wars Galaxies Online.  We have multiple addictive personalities in our genograms.  We still manage to","messageBody":"<div id=\"ygrps-yiv-404044897\">My husband, myself, and my kids 12 and 10, all play Star Wars Galaxies<br/>\nOnline.  We have multiple addictive personalities in our genograms.  We<br/>\nstill manage to eat and get the house work done.<br/>\n<br/>\nIf you want to be a slug and do nothing....you&#39;ll find ways to do that.<br/>\nDon&#39;t blame a game or a game system for your faults and lack of will.  These<br/>\n&quot;drama and danger&quot; stories have the stench of urban legend about them.<br/>\nPeople died from malnutrition from playing WoW?  Where&#39;s that story?<br/>\nWhere&#39;s the death certificate?  I want to see that.<br/>\n<br/>\nKaren<br/>\nTo be wronged is nothing unless you continue to remember it.  ~Confucius<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":215778715,"authorName":"Jodi Bezzola","from":"Jodi Bezzola &lt;jodibezzola@...&gt;","profile":"jodibezzola","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: World of Warcraft ( was: Advice needed)","postDate":"1232070275","msgId":37805,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUzNjI1OC4xNDcyMC5xbUB3ZWI1NDExMC5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDY1MzgxNS44MjEwNy5xbUB3ZWIzMzUwMi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":37803,"nextInTopic":37806,"prevInTime":37804,"nextInTime":37806,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"...   ~~PLEASE limit your childs time on this game. My husband has been addicted to it for years! i can t get him off of it. he looks for ways to stay home","messageBody":"<div id=\"ygrps-yiv-1036072721\"><blockquote><span title=\"qreply\">--- On Thu, 1/15/09, Brenna Shugarts &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bshugarts@...\">bshugarts@...</a>&gt; wrote:<br/>\n <br/>\n~~PLEASE limit your childs time on this game. My husband has been addicted to it for years! i can&#39;t get him off of it. he looks for ways to stay home from activities/work so he can play. I have seen him actually sit for 10 hrs!!! there also was a virus on one of the scripts & it fried our last computer. (about 3 months ago) Hope you all don&#39;t think i am being to nosy just conserned. i often wonder what he could have done w/ his life had he not spent so much time on the games. I know as a mother noone wants to say that about there children.~~<br/>\n <br/>\nTo me, this really highlights the concept of working through the fears we as parents may have, in order to fully respect and support the interests of our kids.  <br/>\n <br/>\nComparing the results of growing up in an alcoholic, chaotic, home to being raised in a peaceful, joyful, mindful, respectful, home, is no more helpful than comparing apples to bananas.  This kind of comparing just feeds the fear we are trying to understand and heal, and in turn offer our kids something better.  I still have a little (very unhelpful!) voice in my head that comes to life every time my girls have watched more than about 3 hours of tv at once, and I&#39;m still a work in progress.  I don&#39;t know about you, but my kids having *more* of everything than what I received as a child (respect, freedom, etc.), *really* pushes my buttons sometimes!<br/>\n <br/>\nThe people on this list who have older kids, and who have parented mindfully, are the ones to look to for what results come from mindful, respectful, unschooly parenting.  Let&#39;s ask Joyce, and Kelly, and Ren, and Rue, and a host of others here with older kids what the results are  - I have a feeling their kids are turning out just fine :).<br/>\n <br/>\nJodi<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":147283564,"authorName":"Jill Parmer","from":"Jill Parmer &lt;jparmer@...&gt;","profile":"jparm02","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: World of Warcraft ( was: Advice needed)","postDate":"1232067623","msgId":37803,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0NUUxMUI2LUZBMjEtNEMzQy1CNDhGLUE2MURCMDREQzg4MEBmcmlpLmNvbT4=","inReplyToHeader":"PEJBWTEzNC1XNTY1MjU2QjhGQjc2QjM1RUY4OTYyQUEzRDcwQHBoeC5nYmw+","referencesHeader":"PDEyMzIwMjcyNDYuNDczLjY4OTMxLm00NUB5YWhvb2dyb3Vwcy5jb20+IDxCQVkxMzQtVzU2NTI1NkI4RkI3NkIzNUVGODk2MkFBM0Q3MEBwaHguZ2JsPg=="},"prevInTopic":37802,"nextInTopic":37805,"prevInTime":37802,"nextInTime":37804,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"Hey Sue, We are!  We started on that realm (alliance characters) when we first got WoW because it was the suggested realm.  My dd (Addi 14), plays there","messageBody":"<div id=\"ygrps-yiv-1996235357\">Hey Sue,<br/>\n<br/>\nWe are!  We started on that realm (alliance characters) when we first  <br/>\ngot WoW because it was the suggested realm.  My dd (Addi 14), plays  <br/>\nthere mostly, but I get on every now and again.   Her main characters  <br/>\nare:  Tiibby (two i&#39;s) (36 gnome warrior), Flahdy (46 Nelf hunter).<br/>\n<br/>\n~Jill<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jan 15, 2009, at 3:32 PM, Sue Roenke wrote:<br/>\n<br/>\n&gt; Are there any unschoolers in the Hydraxis realm? My 16 yo daughter  <br/>\n&gt; is on that realm and I would love to have her connect with other  <br/>\n&gt; homeschoolers.<br/>\n&gt; Sue<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"&quot;Faith Void&quot; &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: World of Warcraft ( was: Advice needed)","postDate":"1232066911","msgId":37802,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkwMTE1MTY0OG0xYjYzZmE4MGljZDg4NzZiOGY0NGQwODBAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDQ2OTkzNTc4MDkwMTE1MTIxMHYyYTYxMzY0MmxhMmEyMzdmZDUyYTY4YzkyQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDY1MzgxNS44MjEwNy5xbUB3ZWIzMzUwMi5tYWlsLm11ZC55YWhvby5jb20+CSA8Y2M2MTIwYTEwOTAxMTUxMDAzdDNhYjRiZjhwYmI1MjIwOTgzNmEzZjFjZUBtYWlsLmdtYWlsLmNvbT4JIDw0Njk5MzU3ODA5MDExNTEyMTB2MmE2MTM2NDJsYTJhMjM3ZmQ1MmE2OGM5MkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":37800,"nextInTopic":37803,"prevInTime":37801,"nextInTime":37803,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"Dan were you unschooled? were you fully nurtured and supported by your parents as a child? This is a board for unschoolers and those on the path towards","messageBody":"<div id=\"ygrps-yiv-1125717089\">Dan<br/>\nwere you unschooled?<br/>\nwere you fully nurtured and supported by your parents as a child?<br/>\n<br/>\nThis is a board for unschoolers and those on the path towards unschooling.<br/>\nWe are aiming towards respectful parenting and loving partnerships. Stopping<br/>\nchildren from playing video games because they might become addicts is as<br/>\nridiculous as stopping your children from eating because they might become<br/>\nover eaters. What one might to do is respectful guide their children towards<br/>\nbalance, allowing their internal pendulum to swing a little.<br/>\n<br/>\nFaith<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Jan 15, 2009 at 3:10 PM, Dan Lake &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:danthedad@...\">danthedad@...</a>&gt; wrote:<br/>\n<br/>\n&gt;    I&#39;m not going to say that someone should impose limits on another<br/>\n&gt; person<br/>\n&gt; and I strongly believe in supporting my kids&#39; and wife&#39;s passions. I&#39;ll<br/>\n&gt; also<br/>\n&gt; say that some of you have never met someone suffering from video game<br/>\n&gt; addiction. Some people (I&#39;m one of them) have seriously addictive<br/>\n&gt; mentalities and find the virtual world such an incredible escape from the<br/>\n&gt; &quot;real&quot; world that they completely check out. The built-in systems of<br/>\n&gt; activities and small rewards are more than entertaining to some and become<br/>\n&gt; an extremely addictive driver of behavior. There are countless documented<br/>\n&gt; cases of people losing their jobs, failing school (I know, who cares<br/>\n&gt; right?)<br/>\n&gt; and even divorced due to video game addiction and the resulting neglect of<br/>\n&gt; everything and everyone around. People have even died from starvation or<br/>\n&gt; malnutrition while playing WoW, LotR, Everquest, UO, etc.<br/>\n&gt;<br/>\n&gt; I&#39;ll go out on a limb here and hopefully add some credibility to my story<br/>\n&gt; by<br/>\n&gt; saying that my wife and I played WoW for almost 2 years together. We<br/>\n&gt; experienced at least 8-10 hours of &quot;joy&quot; every day during that period. I<br/>\n&gt; played at work, we played together at home, we played when the kids were<br/>\n&gt; sleeping, awake, eating, you name it. The leveling, resource gathering,<br/>\n&gt; quests, raids, and rep grinding were all we thought about day and night. We<br/>\n&gt; lost touch with every real world friend we had known save one, despite how<br/>\n&gt; much they expressed concern for us. Between me and my wife we gained 100<br/>\n&gt; pounds. It really didn&#39;t matter because there was always another purple<br/>\n&gt; epic<br/>\n&gt; sword or staff our mount or raid boss to conquer. One day we left the water<br/>\n&gt; running while playing and the entire upstairs of our house filled with<br/>\n&gt; water. When we got up from playing at 4am (I had to be at work at 7am), the<br/>\n&gt; carpet in our office was like a marsh. We only played 6 months more after<br/>\n&gt; that happened.<br/>\n&gt;<br/>\n&gt; As a kid, I played dozens of similar games, the most notable being the<br/>\n&gt; Ultima 1 - Ultima 8 series. The difference with these games is that they<br/>\n&gt; all<br/>\n&gt; had an ending where the game can be beaten or won. The last game I &quot;won&quot;<br/>\n&gt; was<br/>\n&gt; Ultima 4 which took me about 2 months playing every day after school. This<br/>\n&gt; was in 1985. Once the game was over, it was back to the real world for a<br/>\n&gt; while for a &quot;reality check&quot;. With WoW, the game never ever ends and you can<br/>\n&gt; never obtain or attain the highest levels of gear and proficiencies no<br/>\n&gt; matter how many thousands of hours you commit to it. If you are &quot;casual&quot;<br/>\n&gt; then you might have a great social time, but your progress will stop hard<br/>\n&gt; at<br/>\n&gt; some point. The amount of time commitment during what is unfortunately<br/>\n&gt; called the &quot;end game&quot; stage increases exponentially and this is a common<br/>\n&gt; formula among most MMORPGs.<br/>\n&gt;<br/>\n&gt; Are the games fun, yes of course! But, video game addiction is as real as<br/>\n&gt; alchoholism or gambling addiction. I&#39;ve met hundreds of in-game addicts. If<br/>\n&gt; there is someone in your life who has stopped eating, bathing, or leaving<br/>\n&gt; the house, you have a right to be concerned (even if they are just reading<br/>\n&gt; books I would argue). Should you force your will on others? No way. Anyone<br/>\n&gt; who known an alchoholic will tell you the first step to recovery is<br/>\n&gt; recognizing you have a problem. Tell your husband/wife/kids that you miss<br/>\n&gt; them and the types of interactions you used to have together. Ultimately<br/>\n&gt; there needs to be a balance between the video game and the people, places,<br/>\n&gt; things and SELF that you care about in your real world.<br/>\n&gt;<br/>\n&gt; There is nothing at all bad about playing WoW. It is an incredible world to<br/>\n&gt; explore. I have been back to Azeroth a few times in the past 2-3 years but<br/>\n&gt; I<br/>\n&gt; don&#39;t find it very fun because I&#39;m not willing to put in the time to<br/>\n&gt; &quot;succeed&quot; and my friends are all once again in the real world. I would<br/>\n&gt; encourage people to try out WoW even though I wasn&#39;t able to hold my<br/>\n&gt; conjured glacier water and murloc fin soup.<br/>\n&gt;<br/>\n&gt; ~Dan<br/>\n&gt;<br/>\n&gt; Some links for you. They are not mine, but might help someone.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.olganon.org/\">http://www.olganon.org/</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Video_game_addiction\">http://en.wikipedia.org/wiki/Video_game_addiction</a><br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":267621540,"authorName":"Brenna Shugarts","from":"Brenna Shugarts &lt;bshugarts@...&gt;","profile":"bshugarts","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: World of Warcraft ( was: Advice needed)","postDate":"1232065017","msgId":37798,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgwMzYxMy4yODI5Mi5xbUB3ZWIzMzUwNy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":37796,"nextInTopic":37799,"prevInTime":37797,"nextInTime":37799,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"he refuses to accept his addiction & no his parents did not support him. His father was a major acholoic & mother too busy w/ step father & self help","messageBody":"<div id=\"ygrps-yiv-2109047389\">he refuses to accept his addiction & no his parents did not support him. His father was a major acholoic & mother too busy w/ step father & self help seminars to worry about him. Good Luck to you & what you decide w/ it.<br/>\n<br/>\n<br/>\n<br/>\nreputation is what men & women think of us. character is what God & the angels know of us.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Thu, 1/15/09, Pamela Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: Pamela Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt;<br/>\nSubject: Re: [unschoolingbasics] Re: World of Warcraft ( was: Advice needed)<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Thursday, January 15, 2009, 1:24 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nOn Jan 15, 2009, at 5:13 AM, Brenna Shugarts wrote:<br/>\n<br/>\n&gt; oh, ladies PLEASE limit your childs time on this game. My husband <br/>\n&gt; has been addicted to it for years! i can&#39;t get him off of it.<br/>\n&gt; he looks for ways to stay home from activities/work so he can play. <br/>\n&gt; I have seen him actually sit for 10 hrs!!! there also was a virus on <br/>\n&gt; one of the scripts & it fried our last computer. (about 3 months <br/>\n&gt; ago) Hope you all don&#39;t think i am being to nosy just conserned. i <br/>\n&gt; often wonder what he could have done w/ his life had he not spent so <br/>\n&gt; much time on the games. I know as a mother noone wants to say that <br/>\n&gt; about there children. Love & Light. Brenna<br/>\n<br/>\nWhat does your husband have to say about this?<br/>\n<br/>\nAlso, was HE brought up by parents who supported his interests?<br/>\n<br/>\n-pam<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":762518,"authorName":"Sue Roenke","from":"Sue Roenke &lt;oliveoyl_123@...&gt;","profile":"sroenke","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: World of Warcraft ( was: Advice needed)","postDate":"1232058774","msgId":37799,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEzNC1XNTY1MjU2QjhGQjc2QjM1RUY4OTYyQUEzRDcwQHBoeC5nYmw+","inReplyToHeader":"PDEyMzIwMjcyNDYuNDczLjY4OTMxLm00NUB5YWhvb2dyb3Vwcy5jb20+","referencesHeader":"PDEyMzIwMjcyNDYuNDczLjY4OTMxLm00NUB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":37798,"nextInTopic":37800,"prevInTime":37798,"nextInTime":37800,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"Are there any unschoolers in the Hydraxis  realm?  My 16 yo daughter is on that realm and I would love to have her connect with other homeschoolers. Sue ","messageBody":"<div id=\"ygrps-yiv-70914912\">Are there any unschoolers in the Hydraxis  realm?  My 16 yo daughter is on that realm and I would love to have her connect with other homeschoolers.<br/>\nSue<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":334795970,"authorName":"Dan Lake","from":"&quot;Dan Lake&quot; &lt;danthedad@...&gt;","profile":"dlake97124","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"2"},"subject":"Re: [unschoolingbasics] Re: World of Warcraft ( was: Advice needed)","postDate":"1232050209","msgId":37800,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2OTkzNTc4MDkwMTE1MTIxMHYyYTYxMzY0MmxhMmEyMzdmZDUyYTY4YzkyQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGNjNjEyMGExMDkwMTE1MTAwM3QzYWI0YmY4cGJiNTIyMDk4MzZhM2YxY2VAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PDY1MzgxNS44MjEwNy5xbUB3ZWIzMzUwMi5tYWlsLm11ZC55YWhvby5jb20+CSA8Y2M2MTIwYTEwOTAxMTUxMDAzdDNhYjRiZjhwYmI1MjIwOTgzNmEzZjFjZUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":37799,"nextInTopic":37802,"prevInTime":37799,"nextInTime":37801,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"I m not going to say that someone should impose limits on another person and I strongly believe in supporting my kids and wife s passions. I ll also say that","messageBody":"<div id=\"ygrps-yiv-1823693306\">I&#39;m not going to say that someone should impose limits on another person<br/>\nand I strongly believe in supporting my kids&#39; and wife&#39;s passions. I&#39;ll also<br/>\nsay that some of you have never met someone suffering from video game<br/>\naddiction. Some people (I&#39;m one of them) have seriously addictive<br/>\nmentalities and find the virtual world such an incredible escape from the<br/>\n&quot;real&quot; world that they completely check out. The built-in systems of<br/>\nactivities and small rewards are more than entertaining to some and become<br/>\nan extremely addictive driver of behavior. There are countless documented<br/>\ncases of people losing their jobs, failing school (I know, who cares right?)<br/>\nand even divorced due to video game addiction and the resulting neglect of<br/>\neverything and everyone around. People have even died from starvation or<br/>\nmalnutrition while playing WoW, LotR, Everquest, UO, etc.<br/>\n<br/>\nI&#39;ll go out on a limb here and hopefully add some credibility to my story by<br/>\nsaying that my wife and I played WoW for almost 2 years together. We<br/>\nexperienced at least 8-10 hours of &quot;joy&quot; every day during that period. I<br/>\nplayed at work, we played together at home, we played when the kids were<br/>\nsleeping, awake, eating, you name it. The leveling, resource gathering,<br/>\nquests, raids, and rep grinding were all we thought about day and night. We<br/>\nlost touch with every real world friend we had known save one, despite how<br/>\nmuch they expressed concern for us. Between me and my wife we gained 100<br/>\npounds. It really didn&#39;t matter because there was always another purple epic<br/>\nsword or staff our mount or raid boss to conquer. One day we left the water<br/>\nrunning while playing and the entire upstairs of our house filled with<br/>\nwater. When we got up from playing at 4am (I had to be at work at 7am), the<br/>\ncarpet in our office was like a marsh. We only played 6 months more after<br/>\nthat happened.<br/>\n<br/>\nAs a kid, I played dozens of similar games, the most notable being the<br/>\nUltima 1 - Ultima 8 series. The difference with these games is that they all<br/>\nhad an ending where the game can be beaten or won. The last game I &quot;won&quot; was<br/>\nUltima 4 which took me about 2 months playing every day after school. This<br/>\nwas in 1985. Once the game was over, it was back to the real world for a<br/>\nwhile for a &quot;reality check&quot;. With WoW, the game never ever ends and you can<br/>\nnever obtain or attain the highest levels of gear and proficiencies no<br/>\nmatter how many thousands of hours you commit to it. If you are &quot;casual&quot;<br/>\nthen you might have a great social time, but your progress will stop hard at<br/>\nsome point. The amount of time commitment during what is unfortunately<br/>\ncalled the &quot;end game&quot; stage increases exponentially and this is a common<br/>\nformula among most MMORPGs.<br/>\n<br/>\nAre the games fun, yes of course! But, video game addiction is as real as<br/>\nalchoholism or gambling addiction. I&#39;ve met hundreds of in-game addicts. If<br/>\nthere is someone in your life who has stopped eating, bathing, or leaving<br/>\nthe house, you have a right to be concerned (even if they are just reading<br/>\nbooks I would argue).  Should you force your will on others? No way. Anyone<br/>\nwho known an alchoholic will tell you the first step to recovery is<br/>\nrecognizing you have a problem. Tell your husband/wife/kids that you miss<br/>\nthem and the types of interactions you used to have together. Ultimately<br/>\nthere needs to be a balance between the video game and the people, places,<br/>\nthings and SELF that you care about in your real world.<br/>\n<br/>\nThere is nothing at all bad about playing WoW. It is an incredible world to<br/>\nexplore. I have been back to Azeroth a few times in the past 2-3 years but I<br/>\ndon&#39;t find it very fun because I&#39;m not willing to put in the time to<br/>\n&quot;succeed&quot; and my friends are all once again in the real world. I would<br/>\nencourage people to try out WoW even though I wasn&#39;t able to hold my<br/>\nconjured glacier water and murloc fin soup.<br/>\n<br/>\n~Dan<br/>\n<br/>\nSome links for you. They are not mine, but might help someone.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.olganon.org/\">http://www.olganon.org/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Video_game_addiction\">http://en.wikipedia.org/wiki/Video_game_addiction</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Jan 15, 2009 at 10:03 AM, Faith Void &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:littlemsvoid@...\">littlemsvoid@...</a>&gt; wrote:<br/>\n<br/>\n&gt;   What I am reading is that you are suggesting that:<br/>\n&gt;<br/>\n&gt; A) People you don&#39;t know should place arbitrary limits on their children&#39;s<br/>\n&gt; activities because of your fear that they might become so full of joy with<br/>\n&gt; a<br/>\n&gt; game that they will want nothing else when they grown up.<br/>\n&gt;<br/>\n&gt; B) That there is something wrong with your husband because he doesn&#39;t like<br/>\n&gt; his job more than a video game.<br/>\n&gt;<br/>\n&gt; C) That 10 hours of joy is bad if it is in front of a video game.<br/>\n&gt;<br/>\n&gt; D) That you feel like their is something lacking in your husband&#39;s life due<br/>\n&gt; to playing video games so much as a child.<br/>\n&gt;<br/>\n&gt; E) You are attempting to control an adult that you choose to marry.<br/>\n&gt;<br/>\n&gt; a) I feel like placing limits is more likely to create an imbalance that<br/>\n&gt; will last until adulthood. I think arbitrary limits inhibit a respectful<br/>\n&gt; trusting relationship between two people. I prefer to celebrate my<br/>\n&gt; children&#39;s and my husband&#39;s passions and interests. I find that<br/>\n&gt; participating in or sharing the joy brings more joy and friendship and<br/>\n&gt; love.<br/>\n&gt;<br/>\n&gt; b) Perhaps your husband needs a more fullfilling job. One that brings joy<br/>\n&gt; to<br/>\n&gt; him instead of sucks it from him. Perhaps the activities that you are<br/>\n&gt; talking about are less interesting than the game he loves. My husband LOVES<br/>\n&gt; WoW. He plays frequently. He also loves his work and family. Because he<br/>\n&gt; loves and enjoys them all he finds balance.<br/>\n&gt;<br/>\n&gt; c) If someone found 10 straight hours of joy while reading would that be<br/>\n&gt; ok?<br/>\n&gt; If someone found 10 straight hours of joy at church would that be ok? If<br/>\n&gt; someone found 10 hours of joy working on physics problems? Why would one<br/>\n&gt; passion or pursuit be better than another?<br/>\n&gt;<br/>\n&gt; d) You husband is exactly who he needs to be right now at this moment.<br/>\n&gt; Regret is a waste of energy and a vacuum to joy. Sure my life would have<br/>\n&gt; been different if xy or z didn;t happen. Reality is that xyz did happen, it<br/>\n&gt; shaped who I am. I like who I am. If I regret those things I am expressing<br/>\n&gt; a<br/>\n&gt; dissatisfaction with who I AM. Instead if I don&#39;t like something I am doing<br/>\n&gt; I changer that.<br/>\n&gt;<br/>\n&gt; e) I thing trying to control your husband (or children) is just going to<br/>\n&gt; cause resentment and anger. Perhaps you could find a way to celebrate his<br/>\n&gt; video game obsession. Bring him special food while he plays, sit next to<br/>\n&gt; him<br/>\n&gt; and rub his shoulders that must be stressed from working a job he doesn&#39;t<br/>\n&gt; love.<br/>\n&gt;<br/>\n&gt; Faith<br/>\n&gt;<br/>\n&gt; On Thu, Jan 15, 2009 at 8:13 AM, Brenna Shugarts &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bshugarts@...\">bshugarts@...</a>&lt;bshugarts%40yahoo.com&gt;<br/>\n&gt; &gt;wrote:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; oh, ladies PLEASE limit your childs time on this game. My husband has<br/>\n&gt; &gt; been addicted to it for years! i can&#39;t get him off of it. he looks for<br/>\n&gt; ways<br/>\n&gt; &gt; to stay home from activities/work so he can play. I have seen him<br/>\n&gt; actually<br/>\n&gt; &gt; sit for 10 hrs!!! there also was a virus on one of the scripts & it fried<br/>\n&gt; &gt; our last computer. (about 3 months ago) Hope you all don&#39;t think i am<br/>\n&gt; being<br/>\n&gt; &gt; to nosy just conserned. i often wonder what he could have done w/ his<br/>\n&gt; life<br/>\n&gt; &gt; had he not spent so much time on the games. I know as a mother noone<br/>\n&gt; wants<br/>\n&gt; &gt; to say that about there children. Love & Light. Brenna<br/>\n&gt; &gt;<br/>\n&gt; &gt; reputation is what men & women think of us. character is what God & the<br/>\n&gt; &gt; angels know of us.<br/>\n&gt; &gt;<br/>\n&gt; &gt; -<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; --<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\n&gt; www.bearthmama.com<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: World of Warcraft ( was: Advice needed)","postDate":"1232043843","msgId":37796,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM1MEU5NjFBLUNGRDMtNEZCMi05NzU0LTJFMTYzNzE2RTg2Q0BtYWMuY29tPg==","inReplyToHeader":"PDY1MzgxNS44MjEwNy5xbUB3ZWIzMzUwMi5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDY1MzgxNS44MjEwNy5xbUB3ZWIzMzUwMi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":37795,"nextInTopic":37798,"prevInTime":37795,"nextInTime":37797,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"... What does your husband have to say about this? Also, was HE brought up by parents who supported his interests? -pam","messageBody":"<div id=\"ygrps-yiv-1198090812\">On Jan 15, 2009, at 5:13 AM, Brenna Shugarts wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; oh, ladies PLEASE limit your childs time on this game. My husband  <br/>\n&gt; has been addicted to it for years! i can&#39;t get him off of it.<br/>\n&gt; he looks for ways to stay home from activities/work so he can play.  <br/>\n&gt; I have seen him actually sit for 10 hrs!!! there also was a virus on  <br/>\n&gt; one of the scripts & it fried our last computer. (about 3 months  <br/>\n&gt; ago) Hope you all don&#39;t think i am being to nosy just conserned. i  <br/>\n&gt; often wonder what he could have done w/ his life had he not spent so  <br/>\n&gt; much time on the games. I know as a mother noone wants to say that  <br/>\n&gt; about there children. Love & Light. Brenna<br/>\n<br/>\n </span></blockquote>What does your husband have to say about this?<br/>\n<br/>\nAlso, was HE brought up by parents who supported his interests?<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"&quot;Faith Void&quot; &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: World of Warcraft ( was: Advice needed)","postDate":"1232042599","msgId":37795,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkwMTE1MTAwM3QzYWI0YmY4cGJiNTIyMDk4MzZhM2YxY2VAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDY1MzgxNS44MjEwNy5xbUB3ZWIzMzUwMi5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDY1MzgxNS44MjEwNy5xbUB3ZWIzMzUwMi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":37792,"nextInTopic":37796,"prevInTime":37794,"nextInTime":37796,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"What I am reading is that you are suggesting that: A) People you don t know should place arbitrary limits on their children s activities because of your fear","messageBody":"<div id=\"ygrps-yiv-1512798692\">What I am reading is that you are suggesting that:<br/>\n<br/>\nA) People you don&#39;t know should place arbitrary limits on their children&#39;s<br/>\nactivities because of your fear that they might become so full of joy with a<br/>\ngame that they will want nothing else when they grown up.<br/>\n<br/>\nB) That there is something wrong with your husband because he doesn&#39;t like<br/>\nhis job more than a video game.<br/>\n<br/>\nC) That 10 hours of joy is bad if it is in front of a video game.<br/>\n<br/>\nD) That you feel like their is something lacking in your husband&#39;s life due<br/>\nto playing video games so much as a child.<br/>\n<br/>\nE) You are attempting to control an adult that you choose to marry.<br/>\n<br/>\na) I feel like placing limits is more likely to create an imbalance that<br/>\nwill last until adulthood. I think arbitrary limits inhibit a respectful<br/>\ntrusting relationship between two people. I prefer to celebrate my<br/>\nchildren&#39;s and my husband&#39;s passions and interests. I find that<br/>\nparticipating in or sharing the joy brings more joy and friendship and love.<br/>\n<br/>\n<br/>\nb) Perhaps your husband needs a more fullfilling job. One that brings joy to<br/>\nhim instead of sucks it from him. Perhaps the activities that you are<br/>\ntalking about are less interesting than the game he loves. My husband LOVES<br/>\nWoW. He plays frequently. He also loves his work and family. Because he<br/>\nloves and enjoys them all he finds balance.<br/>\n<br/>\nc) If someone found 10 straight hours of joy while reading would that be ok?<br/>\nIf someone found 10 straight hours of joy at church would that be ok? If<br/>\nsomeone found 10 hours of joy working on physics problems? Why would one<br/>\npassion or pursuit be better than another?<br/>\n<br/>\nd) You husband is exactly who he needs to be right now at this moment.<br/>\nRegret is a waste of energy and a vacuum to joy. Sure my life would have<br/>\nbeen different if xy or z didn;t happen. Reality is that xyz did happen, it<br/>\nshaped who I am. I like who I am. If I regret those things I am expressing a<br/>\ndissatisfaction with who I AM. Instead if I don&#39;t like something I am doing<br/>\nI changer that.<br/>\n<br/>\ne) I thing trying to control your husband (or children) is just going to<br/>\ncause resentment and anger. Perhaps you could find a way to celebrate his<br/>\nvideo game obsession. Bring him special food while he plays, sit next to him<br/>\nand rub his shoulders that must be stressed from working a job he doesn&#39;t<br/>\nlove.<br/>\n<br/>\nFaith<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Jan 15, 2009 at 8:13 AM, Brenna Shugarts &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bshugarts@...\">bshugarts@...</a>&gt;wrote:<br/>\n<br/>\n&gt;   oh, ladies PLEASE limit your childs time on this game. My husband has<br/>\n&gt; been addicted to it for years! i can&#39;t get him off of it. he looks for ways<br/>\n&gt; to stay home from activities/work so he can play. I have seen him actually<br/>\n&gt; sit for 10 hrs!!! there also was a virus on one of the scripts & it fried<br/>\n&gt; our last computer. (about 3 months ago) Hope you all don&#39;t think i am being<br/>\n&gt; to nosy just conserned. i often wonder what he could have done w/ his life<br/>\n&gt; had he not spent so much time on the games. I know as a mother noone wants<br/>\n&gt; to say that about there children. Love & Light. Brenna<br/>\n&gt;<br/>\n&gt; reputation is what men & women think of us. character is what God & the<br/>\n&gt; angels know of us.<br/>\n&gt;<br/>\n&gt; -<br/>\n&gt;<br/>\n<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":356810011,"authorName":"raisingexplorers","from":"&quot;raisingexplorers&quot; &lt;raisingexplorers@...&gt;","profile":"raisingexplorers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Advice needed","postDate":"1232030433","msgId":37790,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdrbmh0MStlbzhyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTEzNy1EQVYxMDQ5MEJFNjk0NjU4ODQzOUI5OEUxOTRENjBAcGh4LmdibD4="},"prevInTopic":37789,"nextInTopic":37792,"prevInTime":37789,"nextInTime":37791,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"... reasons and took my GED and passed with flying colors.  No prep or studying at all.  But he is assuming that the GED has gotten harder now. I took my GED","messageBody":"<div id=\"ygrps-yiv-421449764\"><blockquote><span title=\"ireply\">&gt;  He know that I dropped out of school in 11th grade for medical<br/>\n </span></blockquote>reasons and took my GED and passed with flying colors.  No prep or<br/>\nstudying at all.  But he is assuming that the GED has gotten harder now.  <br/>\n<br/>\nI took my GED in either 1999 or 2000 and it wasn&#39;t hard. This was 2 or<br/>\n3 years after I dropped out of school (where I was flunking everything<br/>\nanyhow), so plenty of time to forget almost everything. LOL<br/>\n<br/>\nThe thing that makes the GED test so easy is that almost all of it is<br/>\nmultiple choice... and much of the test gives you context clues in<br/>\npassages and such, that will help you get the right answer. Even if<br/>\nyou come to a hard part.. you still have a 25% chance of getting the<br/>\nright answer... but, I&#39;d raise that even further because they always<br/>\nput at least one answer that is so completely ridiculous that no one<br/>\nwould choose it. LOL</div>","specialLinks":[]},{"userId":267621540,"authorName":"Brenna Shugarts","from":"Brenna Shugarts &lt;bshugarts@...&gt;","profile":"bshugarts","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: World of Warcraft ( was: Advice needed)","postDate":"1232025206","msgId":37792,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MzgxNS44MjEwNy5xbUB3ZWIzMzUwMi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":37790,"nextInTopic":37795,"prevInTime":37791,"nextInTime":37793,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"oh, ladies PLEASE limit your childs time on this game. My husband has been addicted to it for years! i can t get him off of it. he looks for ways to stay home","messageBody":"<div id=\"ygrps-yiv-566913666\">oh, ladies PLEASE limit your childs time on this game. My husband has been addicted to it for years! i can&#39;t get him off of it. he looks for ways to stay home from activities/work so he can play. I have seen him actually sit for 10 hrs!!! there also was a virus on one of the scripts & it fried our last computer. (about 3 months ago) Hope you all don&#39;t think i am being to nosy just conserned. i often wonder what he could have done w/ his life had he not spent so much time on the games. I know as a mother noone wants to say that about there children. Love & Light. Brenna<br/>\n<br/>\n<br/>\n<br/>\nreputation is what men & women think of us. character is what God & the angels know of us.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Wed, 1/14/09, Jill Parmer &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jparmer@...\">jparmer@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: Jill Parmer &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jparmer@...\">jparmer@...</a>&gt;<br/>\nSubject: Re: [unschoolingbasics] Re: World of Warcraft ( was: Advice needed)<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Wednesday, January 14, 2009, 8:34 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nOn Jan 14, 2009, at 5:46 PM, Kelly Lovejoy wrote:<br/>\n<br/>\n&gt; You might want to consider hooking him up with Horde or Unschoolers <br/>\n&gt; on WoW. Venture Co.<br/>\n&gt;<br/>\n&gt; Jill---do you have the immediate WoW info?<br/>\n<br/>\nYou got all the info right, Kelly.<br/>\nRealm: The Venture Co.<br/>\nGuild name: Horde of Unschoolers<br/>\nPatrick informed me that it is not always obvious....horde <br/>\ncharacters. :-)<br/>\n<br/>\n&gt; Duncan just joined. He&#39;s talked with David at least once. Hasn&#39;t <br/>\n&gt; met up with Luke---that I know of.<br/>\n<br/>\nCoolio. What&#39;s his character&#39;s name?<br/>\n<br/>\nLuke is on lots of characters and starts many a guild, so it&#39;s often <br/>\na mystery where he is in Azeroth. We just started some twin orc <br/>\nhunters (Tek (Luke) and Teik (me)) who we use for role play and <br/>\ngenerosity to other horde players and induce fear of death to <br/>\nalliance players.<br/>\n<br/>\nDave and I were just talking that we have plenty of high characters <br/>\nnow, and can help people with dungeon runs when they need them to <br/>\nhelp people level, and play with us higher characters. I&#39;ll post <br/>\ninfo at unschooling_ gamers when we have dungeon runs set, also people <br/>\ncan use the in-game calendar to announce plans for groups. We often <br/>\ndo guild runs on Friday nights.<br/>\n<br/>\nLook for these players for invite to the guild: Bedwyr, Aeolos, <br/>\nTakulah, Jilam, Lokkan. And please tell us who you are, and/or your <br/>\nMom/Dad&#39;s name from this list so we know who you are.<br/>\n<br/>\n~Jill<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":147283564,"authorName":"Jill Parmer","from":"Jill Parmer &lt;jparmer@...&gt;","profile":"jparm02","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: World of Warcraft ( was: Advice needed)","postDate":"1231983251","msgId":37789,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDMEJGMTQyLTg5NkMtNEU0NS1CQkQ5LUI2NDBFMEZFNDM3M0BmcmlpLmNvbT4=","inReplyToHeader":"PDhDQjQ0QzFEODc2RDUyNy00MkMtNTVCQE1CTEstTTEzLnN5c29wcy5hb2wuY29tPg==","referencesHeader":"PGdrbDNnMit0NGN0QGVHcm91cHMuY29tPiA8QkFZMTM3LURBVjEwNDkwQkU2OTQ2NTg4NDM5Qjk4RTE5NEQ2MEBwaHguZ2JsPiA8OENCNDRDMUQ4NzZENTI3LTQyQy01NUJATUJMSy1NMTMuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":37788,"nextInTopic":37790,"prevInTime":37788,"nextInTime":37790,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"... You got all the info right, Kelly. Realm:  The Venture Co. Guild name:  Horde of Unschoolers Patrick informed me that it is not always obvious....horde ","messageBody":"<div id=\"ygrps-yiv-887706980\">On Jan 14, 2009, at 5:46 PM, Kelly Lovejoy wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You might want to consider hooking him up with Horde or Unschoolers  <br/>\n&gt; on WoW. Venture Co.<br/>\n&gt;<br/>\n&gt; Jill---do you have the immediate WoW info?<br/>\n<br/>\n </span></blockquote>You got all the info right, Kelly.<br/>\nRealm:  The Venture Co.<br/>\nGuild name:  Horde of Unschoolers<br/>\nPatrick informed me that it is not always obvious....horde  <br/>\ncharacters.  :-)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Duncan just joined. He&#39;s talked with David at least once. Hasn&#39;t  <br/>\n&gt; met up with Luke---that I know of.<br/>\n<br/>\n </span></blockquote>Coolio.  What&#39;s his character&#39;s name?<br/>\n<br/>\nLuke is on lots of characters and starts many a guild, so it&#39;s often  <br/>\na mystery where he is in Azeroth.  We just started some twin orc  <br/>\nhunters (Tek (Luke) and Teik (me)) who we use for role play and  <br/>\ngenerosity to other horde players and induce fear of death to  <br/>\nalliance players.<br/>\n<br/>\nDave and I were just talking that we have plenty of high characters  <br/>\nnow, and can help people with dungeon runs when they need them to  <br/>\nhelp people level, and play with us higher characters.   I&#39;ll post  <br/>\ninfo at unschooling_gamers when we have dungeon runs set, also people  <br/>\ncan use the in-game calendar to announce plans for groups.  We often  <br/>\ndo guild runs on Friday nights.<br/>\n<br/>\nLook for these players for invite to the guild:  Bedwyr, Aeolos,  <br/>\nTakulah, Jilam, Lokkan.   And please tell us who you are, and/or your  <br/>\nMom/Dad&#39;s name from this list so we know who you are.<br/>\n<br/>\n~Jill<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Advice needed","postDate":"1231980392","msgId":37788,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQjQ0QzFEODc2RDUyNy00MkMtNTVCQE1CTEstTTEzLnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PEJBWTEzNy1EQVYxMDQ5MEJFNjk0NjU4ODQzOUI5OEUxOTRENjBAcGh4LmdibD4=","referencesHeader":"PGdrbDNnMit0NGN0QGVHcm91cHMuY29tPiA8QkFZMTM3LURBVjEwNDkwQkU2OTQ2NTg4NDM5Qjk4RTE5NEQ2MEBwaHguZ2JsPg=="},"prevInTopic":37786,"nextInTopic":37789,"prevInTime":37787,"nextInTime":37789,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"You might want to consider hooking him up with Horde or Unschoolers on WoW. Venture Co.  Jill---do you have the immediate WoW info? Duncan just joined. He s","messageBody":"<div id=\"ygrps-yiv-980514052\">You might want to consider hooking him up with Horde or Unschoolers on WoW. Venture Co. <br/>\n<br/>\n<br/>\n<br/>\nJill---do you have the immediate WoW info? Duncan just joined. He&#39;s talked with David at least once. Hasn&#39;t met up with Luke---that I know of.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nBut getting to know other unschoolers who DON&#39;T have these doubts would help a lot!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nConference? TONS around now! <br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Deborah Markley &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:markley4@...\">markley4@...</a>&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nMy son and I have been talking more.  He know that I dropped out of school in <br/>\n11th grade for medical reasons and took my GED and passed with flying colors.  <br/>\nNo prep or studying at all.  But he is assuming that the GED has gotten harder <br/>\nnow.  He plays World of Warcraft a lot and has many friends that he is in <br/>\ncontact with thru WOW and I think they may be a factor in his &quot;worry&quot;.  <br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":320883197,"authorName":"Joanna Weir","from":"Joanna Weir &lt;jo.home.ed@...&gt;","profile":"jo_159_anna","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Advice needed","postDate":"1231966850","msgId":37812,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVkMWJmM2UwOTAxMTQxMzAwaDY3ZTliNDU0czdmZDg4ZTYzY2RjMTA4ZjFAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PEJBWTEzNy1EQVYxMDQ5MEJFNjk0NjU4ODQzOUI5OEUxOTRENjBAcGh4LmdibD4=","referencesHeader":"PGdrbDNnMit0NGN0QGVHcm91cHMuY29tPgkgPEJBWTEzNy1EQVYxMDQ5MEJFNjk0NjU4ODQzOUI5OEUxOTRENjBAcGh4LmdibD4="},"prevInTopic":37811,"nextInTopic":37814,"prevInTime":37811,"nextInTime":37813,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"Hi I m new on here (from England), with one 11 yr old son just starting to unschool. Just a quick note to pass on this link for an amazing website with ","messageBody":"<div id=\"ygrps-yiv-1806245215\">Hi<br/>\nI&#39;m new on here (from England), with one 11 yr old son just starting to<br/>\nunschool.<br/>\n<br/>\nJust a quick note to pass on this link for an amazing website with<br/>\neverything to do with math. :)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.khanacademy.org\">http://www.khanacademy.org</a><br/>\n<br/>\nThere have 700+ videos on YouTube covering everything from basic<br/>\narithmetic and algebra to differential equations, physics, and finance<br/>\nwhich have been recorded by Salman Khan. He has also developed a free,<br/>\nadaptive math program.<br/>\n<br/>\nHope this might be useful<br/>\nBest wishes<br/>\nJo<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Jan 14, 2009 at 8:31 PM, Deborah Markley &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:markley4@...\">markley4@...</a>&gt; wrote:<br/>\n<br/>\n&gt;   Thanks everyone for the suggestions -<br/>\n&gt;<br/>\n&gt; I&#39;m afraid I&#39;m not much help to him in the Math department. I really suck<br/>\n&gt; at math and never got past Algebra. I pretty much failed that.<br/>\n&gt;<br/>\n&gt; The one thing that made him feel so much better is that a friend his age is<br/>\n&gt; doing horribly with long division and my son thinks that long division is<br/>\n&gt; incredibly easy - this has helped give him quite a boost!<br/>\n&gt; -es in this topic<br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/message/37775;_ylc=X3oDMTM3cGQ2cWZ1BF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRtc2dJZAMzNzc4NgRzZWMDZnRyBHNsawN2dHBjBHN0aW1lAzEyMzE5NjUxMTQEdHBjSWQDMzc3NzU-\">http://groups.yahoo.com/group/unschoolingbasics/message/37775;_ylc=X3oDMTM3cGQ2cWZ1BF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRtc2dJZAMzNzc4NgRzZWMDZnRyBHNsawN2dHBjBHN0aW1lAzEyMzE5NjUxMTQEdHBjSWQDMzc3NzU-</a>&gt;(<br/>\n&gt; 7)  Reply (via web post)<br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/post;_ylc=X3oDMTJybmJhZjkyBF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRtc2dJZAMzNzc4NgRzZWMDZnRyBHNsawNycGx5BHN0aW1lAzEyMzE5NjUxMTQ-?act=reply&messageNum=37786\">http://groups.yahoo.com/group/unschoolingbasics/post;_ylc=X3oDMTJybmJhZjkyBF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRtc2dJZAMzNzc4NgRzZWMDZnRyBHNsawNycGx5BHN0aW1lAzEyMzE5NjUxMTQ-?act=reply&messageNum=37786</a>&gt;| Start<br/>\n&gt; a new topic<br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/post;_ylc=X3oDMTJmb3M3aG5uBF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRzZWMDZnRyBHNsawNudHBjBHN0aW1lAzEyMzE5NjUxMTQ-\">http://groups.yahoo.com/group/unschoolingbasics/post;_ylc=X3oDMTJmb3M3aG5uBF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRzZWMDZnRyBHNsawNudHBjBHN0aW1lAzEyMzE5NjUxMTQ-</a>&gt;<br/>\n&gt;  Messages&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/messages;_ylc=X3oDMTJmNnB0N2VvBF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRzZWMDZnRyBHNsawNtc2dzBHN0aW1lAzEyMzE5NjUxMTM-\">http://groups.yahoo.com/group/unschoolingbasics/messages;_ylc=X3oDMTJmNnB0N2VvBF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRzZWMDZnRyBHNsawNtc2dzBHN0aW1lAzEyMzE5NjUxMTM-</a>&gt;|<br/>\n&gt; Files&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/files;_ylc=X3oDMTJnMXFkOTdmBF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRzZWMDZnRyBHNsawNmaWxlcwRzdGltZQMxMjMxOTY1MTEz\">http://groups.yahoo.com/group/unschoolingbasics/files;_ylc=X3oDMTJnMXFkOTdmBF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRzZWMDZnRyBHNsawNmaWxlcwRzdGltZQMxMjMxOTY1MTEz</a>&gt;|<br/>\n&gt; Photos&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/photos;_ylc=X3oDMTJmOWw2M2V0BF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRzZWMDZnRyBHNsawNwaG90BHN0aW1lAzEyMzE5NjUxMTM-\">http://groups.yahoo.com/group/unschoolingbasics/photos;_ylc=X3oDMTJmOWw2M2V0BF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRzZWMDZnRyBHNsawNwaG90BHN0aW1lAzEyMzE5NjUxMTM-</a>&gt;|<br/>\n&gt; Polls&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/polls;_ylc=X3oDMTJnNzR1ZnVhBF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRzZWMDZnRyBHNsawNwb2xscwRzdGltZQMxMjMxOTY1MTEz\">http://groups.yahoo.com/group/unschoolingbasics/polls;_ylc=X3oDMTJnNzR1ZnVhBF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRzZWMDZnRyBHNsawNwb2xscwRzdGltZQMxMjMxOTY1MTEz</a>&gt;|<br/>\n&gt; Members&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/members;_ylc=X3oDMTJmOTRlOXY1BF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRzZWMDZnRyBHNsawNtYnJzBHN0aW1lAzEyMzE5NjUxMTM-\">http://groups.yahoo.com/group/unschoolingbasics/members;_ylc=X3oDMTJmOTRlOXY1BF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRzZWMDZnRyBHNsawNtYnJzBHN0aW1lAzEyMzE5NjUxMTM-</a>&gt;<br/>\n&gt;  MARKETPLACE<br/>\n&gt;  ------------------------------<br/>\n&gt; From kitchen basics to easy recipes - join the Group from Kraft Foods<br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.ard.yahoo.com/SIG=13rbsp5rk/M=493064.12016295.13271503.10835568/D=groups/S=1705081972:MKP1/Y=YAHOO/EXP=1231972314/L=/B=6Y8DHkPDhFw-/J=1231965114282762/A=5530388/R=0/SIG=11nuutlas/*http://explore.yahoo.com/groups/kraftmealsmadesimple/\">http://us.ard.yahoo.com/SIG=13rbsp5rk/M=493064.12016295.13271503.10835568/D=groups/S=1705081972:MKP1/Y=YAHOO/EXP=1231972314/L=/B=6Y8DHkPDhFw-/J=1231965114282762/A=5530388/R=0/SIG=11nuutlas/*http://explore.yahoo.com/groups/kraftmealsmadesimple/</a>&gt;<br/>\n&gt;   [image: Yahoo! Groups]&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/;_ylc=X3oDMTJlMTlvb2MzBF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRzZWMDZnRyBHNsawNnZnAEc3RpbWUDMTIzMTk2NTExNA--\">http://groups.yahoo.com/;_ylc=X3oDMTJlMTlvb2MzBF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRzZWMDZnRyBHNsawNnZnAEc3RpbWUDMTIzMTk2NTExNA--</a>&gt;<br/>\n&gt; Change settings via the Web&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/join;_ylc=X3oDMTJnZjRlM3IxBF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRzZWMDZnRyBHNsawNzdG5ncwRzdGltZQMxMjMxOTY1MTE0\">http://groups.yahoo.com/group/unschoolingbasics/join;_ylc=X3oDMTJnZjRlM3IxBF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRzZWMDZnRyBHNsawNzdG5ncwRzdGltZQMxMjMxOTY1MTE0</a>&gt;(Yahoo! ID required)<br/>\n&gt; Change settings via email: Switch delivery to Daily Digest&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-digest@yahoogroups.com\">unschoolingbasics-digest@yahoogroups.com</a>?subject=Email+Delivery:+Digest&gt;| Switch<br/>\n&gt; format to Traditional&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-traditional@yahoogroups.com\">unschoolingbasics-traditional@yahoogroups.com</a>?subject=Change+Delivery+Format:+Traditional&gt;<br/>\n&gt;  Visit Your Group<br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics;_ylc=X3oDMTJlZzBpY2VoBF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRzZWMDZnRyBHNsawNocGYEc3RpbWUDMTIzMTk2NTExNA--\">http://groups.yahoo.com/group/unschoolingbasics;_ylc=X3oDMTJlZzBpY2VoBF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRzZWMDZnRyBHNsawNocGYEc3RpbWUDMTIzMTk2NTExNA--</a>&gt;| Yahoo!<br/>\n&gt; Groups Terms of Use &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt; | Unsubscribe<br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a>?subject=&gt;<br/>\n&gt;    Recent Activity<br/>\n&gt;<br/>\n&gt;    -  15<br/>\n&gt;    New Members&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/members;_ylc=X3oDMTJnam1ybWtuBF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRzZWMDdnRsBHNsawN2bWJycwRzdGltZQMxMjMxOTY1MTEz\">http://groups.yahoo.com/group/unschoolingbasics/members;_ylc=X3oDMTJnam1ybWtuBF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRzZWMDdnRsBHNsawN2bWJycwRzdGltZQMxMjMxOTY1MTEz</a>&gt;<br/>\n&gt;<br/>\n&gt;  Visit Your Group<br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics;_ylc=X3oDMTJmMzIybHZnBF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRzZWMDdnRsBHNsawN2Z2hwBHN0aW1lAzEyMzE5NjUxMTM-\">http://groups.yahoo.com/group/unschoolingbasics;_ylc=X3oDMTJmMzIybHZnBF9TAzk3MzU5NzE0BGdycElkAzEyNzg5NTEzBGdycHNwSWQDMTcwNTA4MTk3MgRzZWMDdnRsBHNsawN2Z2hwBHN0aW1lAzEyMzE5NjUxMTM-</a>&gt;<br/>\n&gt;  Sitebuilder<br/>\n&gt;<br/>\n&gt; Build a web site&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.ard.yahoo.com/SIG=13opn23qf/M=493064.12016255.12445662.8674578/D=groups/S=1705081972:NC/Y=YAHOO/EXP=1231972314/L=/B=6o8DHkPDhFw-/J=1231965114282762/A=4025304/R=0/SIG=12uhb64pb/*http://us.rd.yahoo.com/evt=44092/*http://smallbusiness.yahoo.com/webhosting/sitebuilding.php\">http://us.ard.yahoo.com/SIG=13opn23qf/M=493064.12016255.12445662.8674578/D=groups/S=1705081972:NC/Y=YAHOO/EXP=1231972314/L=/B=6o8DHkPDhFw-/J=1231965114282762/A=4025304/R=0/SIG=12uhb64pb/*http://us.rd.yahoo.com/evt=44092/*http://smallbusiness.yahoo.com/webhosting/sitebuilding.php</a>&gt;<br/>\n&gt;<br/>\n&gt; quickly & easily<br/>\n&gt;<br/>\n&gt; with Sitebuilder.<br/>\n&gt;  Yahoo! Groups<br/>\n&gt;<br/>\n&gt; Going Green Zone&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.ard.yahoo.com/SIG=13ohhv6e8/M=493064.12016272.13280354.8674578/D=groups/S=1705081972:NC/Y=YAHOO/EXP=1231972314/L=/B=648DHkPDhFw-/J=1231965114282762/A=5541753/R=0/SIG=11ckn2mo6/*http://advision.webevents.yahoo.com/green/\">http://us.ard.yahoo.com/SIG=13ohhv6e8/M=493064.12016272.13280354.8674578/D=groups/S=1705081972:NC/Y=YAHOO/EXP=1231972314/L=/B=648DHkPDhFw-/J=1231965114282762/A=5541753/R=0/SIG=11ckn2mo6/*http://advision.webevents.yahoo.com/green/</a>&gt;<br/>\n&gt;<br/>\n&gt; Resources for a greener planet.<br/>\n&gt;<br/>\n&gt; Resources for a greener you.<br/>\n&gt;  Yahoo! Groups<br/>\n&gt;<br/>\n&gt; Dog Zone&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.ard.yahoo.com/SIG=13olnjrjg/M=493064.12016263.12445670.8674578/D=groups/S=1705081972:NC/Y=YAHOO/EXP=1231972314/L=/B=7I8DHkPDhFw-/J=1231965114282762/A=4836041/R=0/SIG=11o19ppl5/*http://advision.webevents.yahoo.com/dogzone/index.html\">http://us.ard.yahoo.com/SIG=13olnjrjg/M=493064.12016263.12445670.8674578/D=groups/S=1705081972:NC/Y=YAHOO/EXP=1231972314/L=/B=7I8DHkPDhFw-/J=1231965114282762/A=4836041/R=0/SIG=11o19ppl5/*http://advision.webevents.yahoo.com/dogzone/index.html</a>&gt;<br/>\n&gt;<br/>\n&gt; Connect w/others<br/>\n&gt;<br/>\n&gt; who love dogs.<br/>\n&gt;   .<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":84400733,"authorName":"Deborah Markley","from":"&quot;Deborah Markley&quot; &lt;markley4@...&gt;","profile":"dmarkley4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Advice needed","postDate":"1231965118","msgId":37786,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEzNy1EQVYxMDQ5MEJFNjk0NjU4ODQzOUI5OEUxOTRENjBAcGh4LmdibD4=","referencesHeader":"PGdrbDNnMit0NGN0QGVHcm91cHMuY29tPg=="},"prevInTopic":37785,"nextInTopic":37788,"prevInTime":37785,"nextInTime":37787,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"Thanks everyone for the suggestions - I m afraid I m not much help to him in the Math department.  I really suck at math and never got past Algebra.  I pretty","messageBody":"<div id=\"ygrps-yiv-932849527\">Thanks everyone for the suggestions - <br/>\n<br/>\nI&#39;m afraid I&#39;m not much help to him in the Math department.  I really suck at math and never got past Algebra.  I pretty much failed that.  I barely passed history, but that was with a D and it was only because my boyfriend loved history and helped me.  <br/>\n<br/>\nMy son and I have been talking more.  He know that I dropped out of school in 11th grade for medical reasons and took my GED and passed with flying colors.  No prep or studying at all.  But he is assuming that the GED has gotten harder now.  He plays World of Warcraft a lot and has many friends that he is in contact with thru WOW and I think they may be a factor in his &quot;worry&quot;.  <br/>\n<br/>\nThe one thing that made him feel so much better is that a friend his age is doing horribly with long division and my son thinks that long division is incredibly easy - this has helped give him quite a boost!<br/>\n<br/>\nAgain, thanks for the advice.  We are heading to the library this weekend and I think he will probably get a GED prep book (or whatever it&#39;s called).<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: aidansutherland <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Wednesday, January 14, 2009 11:22 AM<br/>\n  Subject: [unschoolingbasics] Re: Advice needed<br/>\n<br/>\n<br/>\n  --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Deborah Markley&quot;<br/>\n  &lt;markley4@...&gt; wrote:<br/>\n  &gt;<br/>\n  &gt; Started out homeschooling, then went to unschooling. Have been<br/>\n  doing that for about 3 years now, but since my son is thinking more<br/>\n  and more about the future, he wants to get ready for his GED and<br/>\n  therefore feels he needs to &quot;learn&quot; the &quot;right stuff&quot; to get it right.<br/>\n  I keep telling him not to worry, but he refuses to listen. he is<br/>\n  really upset about this Math thing and all the other things he hasn&#39;t<br/>\n  &quot;learned&quot; but refuses to see all the things that he has learned, you<br/>\n  know what I mean? He is just really scared of what his future will be<br/>\n  like without a &quot;school&quot; education...<br/>\n<br/>\n  Why doesn&#39;t he teach himself math with your help? I&#39;m trying to brush<br/>\n  up right now on the math I learned in school, so I can take the<br/>\n  placement test at community college. I found some great books at the<br/>\n  library, and many great online tutorials. One site even has videos of<br/>\n  what I swear is my 7th grade teacher using a dry erase board. <br/>\n<br/>\n  It sounds almost like you&#39;re taking this as a philosophical issue,<br/>\n  like he&#39;s tearing down unschooling. From what you say, I hear that he<br/>\n  wants to feel competent and has decided on the only solution he can<br/>\n  think of- school. Maybe you can ask him about his concerns, his goals<br/>\n  for himself, and his ideas on how to get where he wants to go. If you<br/>\n  keep arguing with him that everything&#39;s fine when he clearly thinks<br/>\n  it&#39;s not, he will just keep arguing back. But if you can get on the<br/>\n  same side as him, you can use your greater experience to help him find<br/>\n  alternatives to school.<br/>\n<br/>\n  Does anyone remember/can anyone point to the blog entry by that kid<br/>\n  who tried school for a year and wrote about his experiences? He went<br/>\n  in with wide open eyes and was amazed by how right his parents were!<br/>\n  The kids were immature and ignorant, there was a lot of wasted time.<br/>\n  He really laid it all out there. This would be a great read for your son. <br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":254952563,"authorName":"aidansutherland","from":"&quot;aidansutherland&quot; &lt;aidansutherland@...&gt;","profile":"aidansutherland","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Advice needed","postDate":"1231950145","msgId":37785,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdrbDNnMit0NGN0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTEzNy1EQVY1QUQyNzIyRkU0OTY4MzhBMDNGRUY5NEQ2MEBwaHguZ2JsPg=="},"prevInTopic":37784,"nextInTopic":37786,"prevInTime":37784,"nextInTime":37786,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"... doing that for about 3 years now, but since my son is thinking more and more about the future, he wants to get ready for his GED and therefore feels he","messageBody":"<div id=\"ygrps-yiv-1276914189\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Deborah Markley&quot;<br/>\n&lt;markley4@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Started out homeschooling, then went to unschooling.  Have been<br/>\n </span></blockquote>doing that for about 3 years now, but since my son is thinking more<br/>\nand more about the future, he wants to get ready for his GED and<br/>\ntherefore feels he needs to &quot;learn&quot; the &quot;right stuff&quot; to get it right.<br/>\n I keep telling him not to worry, but he refuses to listen.  he is<br/>\nreally upset about this Math thing and all the other things he hasn&#39;t<br/>\n&quot;learned&quot; but refuses to see all the things that he has learned, you<br/>\nknow what I mean?  He is just really scared of what his future will be<br/>\nlike without a &quot;school&quot; education...<br/>\n<br/>\nWhy doesn&#39;t he teach himself math with your help? I&#39;m trying to brush<br/>\nup right now on the math I learned in school, so I can take the<br/>\nplacement test at community college. I found some great books at the<br/>\nlibrary, and many great online tutorials. One site even has videos of<br/>\nwhat I swear is my 7th grade teacher using a dry erase board. <br/>\n<br/>\nIt sounds almost like you&#39;re taking this as a philosophical issue,<br/>\nlike he&#39;s tearing down unschooling. From what you say, I hear that he<br/>\nwants to feel competent and has decided on the only solution he can<br/>\nthink of- school. Maybe you can ask him about his concerns, his goals<br/>\nfor himself, and his ideas on how to get where he wants to go. If you<br/>\nkeep arguing with him that everything&#39;s fine when he clearly thinks<br/>\nit&#39;s not, he will just keep arguing back. But if you can get on the<br/>\nsame side as him, you can use your greater experience to help him find<br/>\nalternatives to school.<br/>\n<br/>\nDoes anyone remember/can anyone point to the blog entry by that kid<br/>\nwho tried school for a year and wrote about his experiences? He went<br/>\nin with wide open eyes and was amazed by how right his parents were!<br/>\nThe kids were immature and ignorant, there was a lot of wasted time.<br/>\nHe really laid it all out there. This would be a great read for your son.</div>","specialLinks":[]},{"userId":356810011,"authorName":"raisingexplorers","from":"&quot;raisingexplorers&quot; &lt;raisingexplorers@...&gt;","profile":"raisingexplorers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Advice needed","postDate":"1231949675","msgId":37784,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdrbDMxYitocDAyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTEzNy1EQVYxMkM2MEE3QzgxNkQ0QUVDNUFFREYyOTREOTBAcGh4LmdibD4="},"prevInTopic":37781,"nextInTopic":37785,"prevInTime":37783,"nextInTime":37785,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"I just want to say that the GED test is surprisingly easy. I was completely flunking out of school... I mean with 9s, 13s, etc. skipping school more than half","messageBody":"<div id=\"ygrps-yiv-431823583\">I just want to say that the GED test is surprisingly easy. I was<br/>\ncompletely flunking out of school... I mean with 9s, 13s, etc.<br/>\nskipping school more than half the year.. and I aced three portions of<br/>\nthe test and made above average scores on the rest of it. <br/>\n<br/>\nThis is a school flunkie who did not study AT ALL, for the GED test. <br/>\n<br/>\nBut, in order to boost his self confidence, maybe you could check out<br/>\na GED study book from the library and let him see just how hard it<br/>\nwill be for him. Our state also offers GED study classes to boost your<br/>\nchances, before taking the test. They are free, except for the<br/>\nworkbooks, I think, which are like $30. Anyway, there are maybe 6<br/>\n2-hour long classes and there is an instructor.. but, they don&#39;t<br/>\n*teach* they are just there to help if people have questions about<br/>\nthings in the workbooks.</div>","specialLinks":[]},{"userId":84400733,"authorName":"Deborah Markley","from":"&quot;Deborah Markley&quot; &lt;markley4@...&gt;","profile":"dmarkley4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Advice needed","postDate":"1231901107","msgId":37781,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEzNy1EQVY1QUQyNzIyRkU0OTY4MzhBMDNGRUY5NEQ2MEBwaHguZ2JsPg==","referencesHeader":"PGdrajRyMCt1cXVkQGVHcm91cHMuY29tPiA8QkFZMTM3LURBVjEyQzYwQTdDODE2RDRBRUM1QUVERjI5NEQ5MEBwaHguZ2JsPiA8M0M3ODNCQTEtNzEwRS00QzM5LUI4MjQtMDQwODc2QkZDRDQ2QG1hYy5jb20+"},"prevInTopic":37780,"nextInTopic":37784,"prevInTime":37780,"nextInTime":37782,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"Started out homeschooling, then went to unschooling.  Have been doing that for about 3 years now, but since my son is thinking more and more about the future,","messageBody":"<div id=\"ygrps-yiv-1170811098\">Started out homeschooling, then went to unschooling.  Have been doing that for about 3 years now, but since my son is thinking more and more about the future, he wants to get ready for his GED and therefore feels he needs to &quot;learn&quot; the &quot;right stuff&quot; to get it right.  I keep telling him not to worry, but he refuses to listen.  he is really upset about this Math thing and all the other things he hasn&#39;t &quot;learned&quot; but refuses to see all the things that he has learned, you know what I mean?  He is just really scared of what his future will be like without a &quot;school&quot; education...<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Pamela Sorooshian <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Tuesday, January 13, 2009 9:39 PM<br/>\n  Subject: Re: [unschoolingbasics] Advice needed<br/>\n<br/>\n<br/>\n<br/>\n  On Jan 13, 2009, at 2:59 PM, Deborah Markley wrote:<br/>\n<br/>\n  &gt; I would really like to hear what kind of response you get to this. <br/>\n  &gt; My son is 15 and we recently moved from FL to WV. He has no desire <br/>\n  &gt; at all to go to public school, but is talking about taking his GED. <br/>\n  &gt; He also feels dumb and that he&#39;s not up to speed on &quot;normal&quot; school <br/>\n  &gt; subjects (he is having just a horrible time with math).<br/>\n<br/>\n  I&#39;m confused. Having a horrible time with math? What math? Are you <br/>\n  unschooling? For how long?<br/>\n<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt; He is so afraid to even think about the GED and now, at the ripe old <br/>\n  &gt; age of 15, he is very concerned about his future.<br/>\n<br/>\n  Maybe you could either send him to Not-Back-to-School Camp or you <br/>\n  could go together to an unschooling conference - sounds like he needs <br/>\n  to meet other unschooled kids and young adults who didn&#39;t do school <br/>\n  and would also have been considerably &quot;behind&quot; if tested on typical <br/>\n  school subjects but are doing quite amazing and wonderful things with <br/>\n  their lives. We know that school isn&#39;t the be-all and end-all of <br/>\n  childhood, but it might seem that way to him if he doesn&#39;t understand <br/>\n  unschooling. If he&#39;s interested, he could read &quot;The Teenage Liberation <br/>\n  Handbook&quot; by Grace Llewelyn (at least the first half). Sounds like he <br/>\n  doesn&#39;t really know what unschooling is all about. My kids didn&#39;t buy <br/>\n  into or accept the idea that they ought to learn what school kids were <br/>\n  being taught. They were not impressed at all with what their schooled <br/>\n  friends were studying in school. They had their own interests and <br/>\n  pursued them with great gusto. I&#39;m going to talk to them later about <br/>\n  their attitude and why they were not concerned. They&#39;re past it at <br/>\n  this point - one has graduated from college with lots of honors and <br/>\n  has a great career and is continuing some post-grad studies; another <br/>\n  has almost completed all her general ed requirements with straight As <br/>\n  and is transferring from community college to a university; the third <br/>\n  has taken college courses that interest her (including political <br/>\n  science, math, and sign language along with lots of music, theater, <br/>\n  and dance) and also has almost all A&#39;s. So - like I said - they are <br/>\n  beyond worrying about any comparisons to schooled kids. They are 24, <br/>\n  21, and 18 (in a couple of weeks).<br/>\n<br/>\n  -pam<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Advice needed","postDate":"1231900763","msgId":37780,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNDNzgzQkExLTcxMEUtNEMzOS1CODI0LTA0MDg3NkJGQ0Q0NkBtYWMuY29tPg==","inReplyToHeader":"PEJBWTEzNy1EQVYxMkM2MEE3QzgxNkQ0QUVDNUFFREYyOTREOTBAcGh4LmdibD4=","referencesHeader":"PGdrajRyMCt1cXVkQGVHcm91cHMuY29tPiA8QkFZMTM3LURBVjEyQzYwQTdDODE2RDRBRUM1QUVERjI5NEQ5MEBwaHguZ2JsPg=="},"prevInTopic":37778,"nextInTopic":37781,"prevInTime":37779,"nextInTime":37781,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"... I m confused. Having a horrible time with math? What math? Are you unschooling? For how long? ... Maybe you could either send him to Not-Back-to-School","messageBody":"<div id=\"ygrps-yiv-2005274636\">On Jan 13, 2009, at 2:59 PM, Deborah Markley wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I would really like to hear what kind of response you get to this.   <br/>\n&gt; My son is 15 and we recently moved from FL to WV.  He has no desire  <br/>\n&gt; at all to go to public school, but is talking about taking his GED.   <br/>\n&gt; He also feels dumb and that he&#39;s not up to speed on &quot;normal&quot; school  <br/>\n&gt; subjects (he is having just a horrible time with math).<br/>\n<br/>\n </span></blockquote>I&#39;m confused. Having a horrible time with math? What math? Are you  <br/>\nunschooling? For how long?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; He is so afraid to even think about the GED and now, at the ripe old  <br/>\n&gt; age of 15, he is very concerned about his future.<br/>\n<br/>\n </span></blockquote>Maybe you could either send him to Not-Back-to-School Camp or you  <br/>\ncould go together to an unschooling conference - sounds like he needs  <br/>\nto meet other unschooled kids and young adults who didn&#39;t do school  <br/>\nand would also have been considerably &quot;behind&quot; if tested on typical  <br/>\nschool subjects but are doing quite amazing and wonderful things with  <br/>\ntheir lives. We know that school isn&#39;t the be-all and end-all of  <br/>\nchildhood, but it might seem that way to him if he doesn&#39;t understand  <br/>\nunschooling. If he&#39;s interested, he could read &quot;The Teenage Liberation  <br/>\nHandbook&quot; by Grace Llewelyn (at least the first half). Sounds like he  <br/>\ndoesn&#39;t really know what unschooling is all about. My kids didn&#39;t buy  <br/>\ninto or accept the idea that they ought to learn what school kids were  <br/>\nbeing taught. They were not impressed at all with what their schooled  <br/>\nfriends were studying in school. They had their own interests and  <br/>\npursued them with great gusto. I&#39;m going to talk to them later about  <br/>\ntheir attitude and why they were not concerned. They&#39;re past it at  <br/>\nthis point - one has graduated from college with lots of honors and  <br/>\nhas a great career and is continuing some post-grad studies; another  <br/>\nhas almost completed all her general ed requirements with straight As  <br/>\nand is transferring from community college to a university; the third  <br/>\nhas taken college courses that interest her (including political  <br/>\nscience, math, and sign language along with lots of music, theater,  <br/>\nand dance) and also has almost all A&#39;s. So - like I said - they are  <br/>\nbeyond worrying about any comparisons to schooled kids. They are 24,  <br/>\n21, and 18 (in a couple of weeks).<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":84400733,"authorName":"Deborah Markley","from":"&quot;Deborah Markley&quot; &lt;markley4@...&gt;","profile":"dmarkley4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Advice needed","postDate":"1231887559","msgId":37778,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEzNy1EQVYxMkM2MEE3QzgxNkQ0QUVDNUFFREYyOTREOTBAcGh4LmdibD4=","referencesHeader":"PGdrajRyMCt1cXVkQGVHcm91cHMuY29tPg=="},"prevInTopic":37775,"nextInTopic":37780,"prevInTime":37777,"nextInTime":37779,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"I would really like to hear what kind of response you get to this.  My son is 15 and we recently moved from FL to WV.  He has no desire at all to go to public","messageBody":"<div id=\"ygrps-yiv-775563847\">I would really like to hear what kind of response you get to this.  My son is 15 and we recently moved from FL to WV.  He has no desire at all to go to public school, but is talking about taking his GED.  He also feels dumb and that he&#39;s not up to speed on &quot;normal&quot; school subjects (he is having just a horrible time with math).  <br/>\n<br/>\nHe is so afraid to even think about the GED and now, at the ripe old age of 15, he is very concerned about his future.  <br/>\n<br/>\nI just don&#39;t know what to tell him - There aren&#39;t many unschool resources here in the hills!  LOL<br/>\n<br/>\nDeb<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Tracy <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Tuesday, January 13, 2009 5:33 PM<br/>\n  Subject: [unschoolingbasics] Advice needed<br/>\n<br/>\n<br/>\n  My 16 year old son wants to go to school because he feels like he&#39;s<br/>\n  missing out on schoolish things - like dances and socializing. He<br/>\n  feels he&#39;s dumb because he&#39;s not up to speed on school subjects like<br/>\n  math. I don&#39;t know what to do...I don&#39;t want him to go to school, but<br/>\n  he has an idealized view of it.<br/>\n<br/>\n  He works and has started karate recently and we go to the mall and<br/>\n  movies, etc. It&#39;s not like he&#39;s kept in seclusion.<br/>\n<br/>\n  If he went back to public school - what are the procedures? Would he<br/>\n  be tested to see what grade level he&#39;d be in? I kept no concrete<br/>\n  records of what we did over the years. <br/>\n<br/>\n  Advice would be greatly appreciated!<br/>\n<br/>\n  ~ Tracy<br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":148869672,"authorName":"Tracy","from":"&quot;Tracy&quot; &lt;rosehavencottage@...&gt;","profile":"rosehavencottage","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Advice needed","postDate":"1231885984","msgId":37775,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdrajRyMCt1cXVkQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":37778,"prevInTime":37774,"nextInTime":37776,"topicId":37775,"numMessagesInTopic":0,"msgSnippet":"My 16 year old son wants to go to school because he feels like he s missing out on schoolish things - like dances and socializing. He feels he s dumb because","messageBody":"<div id=\"ygrps-yiv-1257389551\">My 16 year old son wants to go to school because he feels like he&#39;s<br/>\nmissing out on schoolish things - like dances and socializing. He<br/>\nfeels he&#39;s dumb because he&#39;s not up to speed on school subjects like<br/>\nmath. I don&#39;t know what to do...I don&#39;t want him to go to school, but<br/>\nhe has an idealized view of it.<br/>\n<br/>\nHe works and has started karate recently and we go to the mall and<br/>\nmovies, etc. It&#39;s not like he&#39;s kept in seclusion.<br/>\n<br/>\nIf he went back to public school - what are the procedures? Would he<br/>\nbe tested to see what grade level he&#39;d be in? I kept no concrete<br/>\nrecords of what we did over the years. <br/>\n<br/>\nAdvice would be greatly appreciated!<br/>\n<br/>\n~ Tracy</div>","specialLinks":[]}],"prevTopicId":37914,"nextTopicId":37984}}