{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":23,"messages":[{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] deschooling/syracuse","postDate":"1358386213","msgId":49412,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI1QkY1RjAzLUUxQUYtNDNGNS1BQUNCLTI2NDdGQjVCMTlCRUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEzNTgzMjQ2OTkuNjc2MDcuWWFob29NYWlsTmVvQHdlYjE3MjIwNi5tYWlsLmlyMi55YWhvby5jb20+","referencesHeader":"PDEzNTgzMjQ2OTkuNjc2MDcuWWFob29NYWlsTmVvQHdlYjE3MjIwNi5tYWlsLmlyMi55YWhvby5jb20+"},"prevInTopic":49411,"nextInTopic":0,"prevInTime":49411,"nextInTime":49413,"topicId":49372,"numMessagesInTopic":0,"msgSnippet":"... On this list people are sharing more than educated opinions. We re analyzing what actually happens in unschooling families to help people understand how","messageBody":"<div id=\"ygrps-yiv-145831522\">On Jan 16, 2013, at 3:24 AM, d miller wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Glad to see that you have done your research and made and educated opinion about what you think is best for your child.  <br/>\n<br/>\n </span></blockquote>On this list people are sharing more than educated opinions. We&#39;re analyzing what actually happens in unschooling families to help people understand how and why unschooling works so they can make more thoughtful decisions.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I simply put the information out for those to consider.  <br/>\n<br/>\n </span></blockquote>It&#39;s very helpful when joining any group to spend some time hanging back to get a flavor of how the group works. <br/>\n<br/>\nAnything posted to the list will be scrutinized under an unschooling light. Anything with principles that aren&#39;t universally helpful to unschoolers, is pulled apart on the list to analyze its potential pitfalls for unschoolers.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I re read my email and thought I made it clear that this was the<br/>\n&gt; information that I read considering the possible dangers of the<br/>\n&gt; media and how to overcome it. I stated this was a few years ago<br/>\n&gt; and encouraged others to look at it and choose for themselves.  <br/>\n<br/>\n </span></blockquote>Why would you pass on information that you knew was old? (If you heard it only a few years ago, it was old even then.)<br/>\n<br/>\nMost social groups are based on passing on &quot;what works for us&quot;. That&#39;s the best that can be done when each person may have different goals. But here, what&#39;s shared is around the singular goal of opening the world for kids to explore. It&#39;s what this list offers to do for its members. Often that means helping parents overcome their fears with good solid information about what happens in unschooling families.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; That is what we do with research read and just because something<br/>\n&gt; supports or debunks does not make it right one way or the other.  <br/>\n<br/>\n </span></blockquote>If the research isn&#39;t good, it isn&#39;t supporting or debunking. It&#39;s misleading.<br/>\n<br/>\nAnd much of what people refer to as research is often popular misinterpretations of research.<br/>\n<br/>\nWhat works much better for discussing unschooling is looking at our own kids&#39; behavior, discussing why it happens, looking at principles that support learning and great relationships, In essence we&#39;re doing our own research. Most research is done on schooled kids and can&#39;t compensate for the negative effects of school so the results often aren&#39;t relevant to unschooling.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I also stated that my children&#39;s personalities do not cope well with the tv.  We rarely use it and when we do we interact with them.  <br/>\n<br/>\n<br/>\n </span></blockquote>It&#39;s more helpful to many people to discuss the principles that support learning and grow great relationships for all humans. And then for individual families to share how it looks in their family if they think it will add to someone&#39;s understanding of the problem being discussed. <br/>\n<br/>\nHow this list works isn&#39;t easy to grasp by explanation. It&#39;s easier to get from reading for a couple of weeks. Most people are looking for a social sharing list, and it&#39;s understood that how this list works isn&#39;t everyone&#39;s cup of tea. But for those who do enjoy the analysis, it works really well.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: deschooling/syracuse","postDate":"1358379959","msgId":49411,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtkN2UzbitoZzVpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNTgyNjIwNDAuNTUzNTIuWWFob29NYWlsTmVvQHdlYjE3MjIwNS5tYWlsLmlyMi55YWhvby5jb20+"},"prevInTopic":49410,"nextInTopic":49412,"prevInTime":49410,"nextInTime":49412,"topicId":49372,"numMessagesInTopic":0,"msgSnippet":"... *************** Some people find shows or movies are perfect for relaxing - middle of the afternoon, when kids are tired but don t want to nap, or at","messageBody":"<div id=\"ygrps-yiv-61781156\">d miller  wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; we rarely watch tv because it is too exciting for my children who have a hard enough time calming down without it.<br/>\n </span></blockquote>***************<br/>\n<br/>\nSome people find shows or movies are perfect for relaxing - middle of the afternoon, when kids are tired but don&#39;t want to nap, or at night. Other people find shows and movies wake them up! More often it depends on the specific content - there are shows and movies I can&#39;t possibly fall asleep to, others are very soothing. <br/>\n<br/>\nThe same can be said of baths, going for a walk, reading, listening to music, or socializing. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; they are super sensitive and highly creative so even the most dull and boring will send them into crazy mode.<br/>\n </span></blockquote>***************<br/>\n<br/>\nIt&#39;s possible it&#39;s not the tv, itself. If you&#39;ve had limited tv from the start, the limitation factor itself can have exactly that effect. It&#39;s also possible you have unrealistic expectations as to how most kids watch tv. In homes where kids have free choice as to what and when to watch, watching a show or movie may be accompanied by a lot of other activity - building, drawing, jumping, spinning, running around... kids are busy people! If you&#39;ve grown up with &quot;sit down and watch&quot; expectations, then their &quot;craziness&quot; might be nothing of the sort - or it might be a reaction to your attempts to get them to conform to a standard which doesn&#39;t work for them. It&#39;s also possible they&#39;re not all that interested in tv and need a lot more social contact, instead. &lt;shrug&gt; <br/>\n<br/>\nI&#39;m throwing out alternative ideas because your expectations will affect what you &quot;see&quot; in terms of your kids&#39; behavior. If you think &quot;tv has a negative effect on children&quot; you&#39;re more likely to look for evidence which supports that. What happens if you step back from that assumption? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;tv just does not work for us at the moment<br/>\n<br/>\n </span></blockquote>I&#39;m guessing from your comments that your kids are still pretty young. As they get older, you may find that tv, movies, and other video options are marvelous resources for highly sensitive, creative children. Many highly sensitive people for instance, find the internet to be a fantastic way to meet others with similar interests without the stress of socializing face-to-face. And many young artists find movies, games, and the internet to be marvelous sources of inspiration and feedback from their peers. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":325022287,"authorName":"d miller","from":"d miller &lt;tsukiusagi@...&gt;","profile":"tsukiusagi","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: deschooling/syracuse","postDate":"1358324699","msgId":49410,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTgzMjQ2OTkuNjc2MDcuWWFob29NYWlsTmVvQHdlYjE3MjIwNi5tYWlsLmlyMi55YWhvby5jb20+"},"prevInTopic":49409,"nextInTopic":49411,"prevInTime":49409,"nextInTime":49411,"topicId":49372,"numMessagesInTopic":0,"msgSnippet":"To all those who responded about the tv.  Glad to see that you have done your research and made and educated opinion about what you think is best for your","messageBody":"<div id=\"ygrps-yiv-1805453104\">To all those who responded about the tv.  Glad to see that you have done your research and made and educated opinion about what you think is best for your child.  I simply put the information out for those to consider.  It&#39;s called sharing information and I am happy to see that others have shared back. I re read my email and thought I made it clear that this was the information that I read considering the possible dangers of the media and how to overcome it.  I stated this was a few years ago and encouraged others to look at it and choose for themselves.  That is what we do with research read and just because something supports or debunks does not make it right one way or the other.  I also stated that my children&#39;s personalities do not cope well with the tv.  We rarely use it and when we do we interact with them.  <br/>\n<br/>\nThank you for the post with regards to the myths of tv watching.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":345817076,"authorName":"Sylvia Woodman","from":"Sylvia Woodman &lt;sylvia057@...&gt;","profile":"sylviawoodman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: deschooling/syracuse/my tv rant","postDate":"1358319308","msgId":49409,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTUhKS0w5Uk9FVGdmRDNpYnZtMnR3cStYOUdERVNYZUVTUTFrWk5fNDJFZFF6a0NhQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4M0M5OEMyNzRAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+","referencesHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4M0M5OEMyNzRAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":49408,"nextInTopic":49410,"prevInTime":49408,"nextInTime":49410,"topicId":49372,"numMessagesInTopic":0,"msgSnippet":"I d like to also chime in on the fact that kids tend not to notice what doesn t interest them.  When I was a kid my family vacationed on Cape Cod every summer.","messageBody":"<div id=\"ygrps-yiv-1277910972\">I&#39;d like to also chime in on the fact that kids tend not to notice what<br/>\ndoesn&#39;t interest them.  When I was a kid my family vacationed on Cape Cod<br/>\nevery summer.  My grandparents were writers and they had a number of<br/>\nfriends who were involved in various arts groups in Provincetown.<br/>\n Provincetown, for those who don&#39;t know, has for many many many years been<br/>\nvery welcoming of gay and lesbian people and people could be very open<br/>\nabout their sexuality there.  I have lots of memories of watching the<br/>\nannual Carnival parade in August (think Gay Pride parade meets Mardi Gras)<br/>\nhowever I, as a child, never &quot;saw&quot; (and by that I mean noticed) a single<br/>\ngay person until the summer I was twelve.  Up until then I was fascinated<br/>\nby costumes! floats! music!<br/>\n<br/>\nSylvia (Gabriella 8 &Harry 6)<br/>\n<br/>\n<br/>\nOn Tue, Jan 15, 2013 at 4:25 PM, Debra Rossing<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:debra.rossing@...\">debra.rossing@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; Morgan likes the series, but she&#39;s started to get a little irritated at<br/>\n&gt; the booty shots - they&#39;re silly and waste time which could be used to<br/>\n&gt; further the plot or set the scene better, or add to the character<br/>\n&gt; development.<br/>\n&gt;<br/>\n&gt; Yeah, DH (yes, that&#39;s hubby) was watching a few anime series on NetFlix<br/>\n&gt; and wanted me to watch with him to share the stuff he&#39;d found. The first<br/>\n&gt; series seemed like it might have been interesting but those underwear<br/>\n&gt; flashes were just too distractingly annoying (I agree with Mo - they could<br/>\n&gt; use the time to advance the story not spend so much time animating<br/>\n&gt; underwear!) so he found another series that had little to none of that and<br/>\n&gt; we both enjoyed that series (it was &#39;Kaze no stigma&#39; aka Mark of the Wind<br/>\n&gt; not sure if I spelled it right).<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Deb R<br/>\n&gt;<br/>\n&gt; **********************************************************************<br/>\n&gt; This email and any files transmitted with it are confidential and<br/>\n&gt; intended solely for the use of the individual or entity to whom they<br/>\n&gt; are addressed. If you have received this email in error please notify<br/>\n&gt; the system manager.<br/>\n&gt;<br/>\n&gt; This footnote also confirms that this email message has been swept by<br/>\n&gt; MIMEsweeper for the presence of computer viruses.<br/>\n&gt;<br/>\n&gt; www.mastercam.com<br/>\n&gt; **********************************************************************<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: deschooling/syracuse/my tv rant","postDate":"1358285117","msgId":49408,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4M0M5OEMyNzRAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":49407,"nextInTopic":49409,"prevInTime":49407,"nextInTime":49409,"topicId":49372,"numMessagesInTopic":0,"msgSnippet":"... Yeah, DH (yes, that s hubby) was watching a few anime series on NetFlix and wanted me to watch with him to share the stuff he d found. The first series","messageBody":"<div id=\"ygrps-yiv-600787574\"><blockquote><span title=\"ireply\">&gt; Morgan likes the series, but she&#39;s started to get a little irritated at the booty shots - they&#39;re silly and waste time which could be used to further the plot or set the scene better, or add to the character development.<br/>\n<br/>\n </span></blockquote>Yeah, DH (yes, that&#39;s hubby) was watching a few anime series on NetFlix and wanted me to watch with him to share the stuff he&#39;d found. The first series seemed like it might have been interesting but those underwear flashes were just too distractingly annoying (I agree with Mo - they could use the time to advance the story not spend so much time animating underwear!) so he found another series that had little to none of that and we both enjoyed that series (it was &#39;Kaze no stigma&#39; aka Mark of the Wind not sure if I spelled it right).<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: deschooling/syracuse/my tv rant","postDate":"1358284804","msgId":49407,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4M0M5OEMyNUZAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":49406,"nextInTopic":49408,"prevInTime":49406,"nextInTime":49408,"topicId":49372,"numMessagesInTopic":0,"msgSnippet":"... Did a little guffaw at that (not at you, at the statement). When DS was 5, he absolutely loved 007. He played the videogames which had two modes - single","messageBody":"<div id=\"ygrps-yiv-838481398\"><blockquote><span title=\"ireply\">&gt; The only real problem that I have with TV is all the sexual content.  My daughter is eight.<br/>\n<br/>\n </span></blockquote>Did a little guffaw at that (not at you, at the statement). When DS was 5, he absolutely loved 007. He played the videogames which had two modes - single player and cooperative. He had DH play through the single player to unlock all the cool gadgets then the two of them played co-op. So, when a Bond film festival was coming up one weekend, I mentioned it. We even planned for special snacks and easy meal-type foods and all so we could all watch as much/as little as we chose. I was a bit trepidatious (sp?) about it - all those Bond girls and their skimpy (or missing) clothing, the situations, the innuendo. DS saw NONE of that. He wasn&#39;t old enough to catch the double entendre names for one thing. He was more caught up in the gadgets and villains and chase scenes and such. Fast forward about 5 years. Another Bond film was on. Somewhere along the way he mentioned &quot;Boy, he kisses a lot of girls!&quot; to which I replied &quot;Yeah, he does. I don&#39;t think real life is like that, even for spies.&quot; And moved along to the movie again. Now he&#39;s 14 (Kelly - can you believe that Joshua is 14 already?! He&#39;s taller than me now!) and knows the basics of sex (and has for a number of years) and it&#39;s really no big deal.<br/>\n<br/>\nI can&#39;t really think of many commercials that are all that embarrassingly sexual that a child would pick up on. Feminine products maybe but an 8 yr old girl is probably old enough to start understanding the &quot;coming attractions&quot;. ED meds probably don&#39;t even register, they&#39;re usually just pretty, romantic scenes with somebody talking a lot. We love watching Star Trek and I can&#39;t say as I&#39;ve seen anything overtly sexual in content in the commercials (and we watch it on multiple channels - BBC America has STNG, TVLand sometimes has old episodes, etc).<br/>\n<br/>\nWhenever I see comments like this, I can&#39;t help but flash to the old Monty Python sketch about &quot;all this sex on the telly. I mean, I keep falling off!&quot; :- )<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: deschooling/syracuse/my tv rant","postDate":"1358277516","msgId":49406,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTgyNzc1MTYuMTYxMjkuWWFob29NYWlsTmVvQHdlYjE4MjIwMS5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PGtkNDgwYStqOTd2QGVHcm91cHMuY29tPg==","referencesHeader":"PDEzNTgyNjcwODcuODg2NDIuWWFob29NYWlsTmVvQHdlYjE2MDQwMi5tYWlsLmJmMS55YWhvby5jb20+IDxrZDQ4MGErajk3dkBlR3JvdXBzLmNvbT4="},"prevInTopic":49405,"nextInTopic":49407,"prevInTime":49405,"nextInTime":49407,"topicId":49372,"numMessagesInTopic":0,"msgSnippet":"There are lots of strong women on Anime! One of my favorites is Spice and Wolf Got to love Holo ( or Horo)!   Alex Polikowsky       ","messageBody":"<div id=\"ygrps-yiv-1959449308\">There are lots of strong women on Anime!<br/>\nOne of my favorites is Spice and Wolf<br/>\nGot to love Holo ( or Horo)!<br/>\n <br/>\nAlex Polikowsky<br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n________________________________<br/>\n From: Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSent: Tuesday, January 15, 2013 12:43 PM<br/>\nSubject: [unschoolingbasics] Re: deschooling/syracuse/my tv rant<br/>\n <br/>\n<br/>\n  <br/>\nAmy Morgan  wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; But her interests are Star Trek, DC/Marvel comic cartoons, Transformers, and the like<br/>\n </span></blockquote>*************<br/>\n<br/>\nA couple nights ago Mo and I were watching an anime series about female astronauts and space pilots. It&#39;s been awhile since we watched any of it and I&#39;d forgotten just how many... booty shots for want of a better term - were in the series. No chance for a gratuitous look at a character&#39;s underwear was missed. I was surprised. Morgan likes the series, but she&#39;s started to get a little irritated at the booty shots - they&#39;re silly and waste time which could be used to further the plot or set the scene better, or add to the character development. <br/>\n<br/>\nIt&#39;s not an uncommon complaint among women who enjoy comics, manga, and anime - so much is drawn with the interests of young males in  mind. But neither Morgan nor any of the women I&#39;m getting to know online (I never got into comics as a kid, so I&#39;m trying to learn about them now) are suffering from some kind of negative-self-image as a result of their love of comics. They want better portrayals of women because they think well of themselves and want to see that reflected in their favorite characters. <br/>\n<br/>\nThat&#39;s interesting to me because I&#39;ve heard a lot of noise over the years about how sexist images of women destroy women&#39;s sense of self. It doesn&#39;t seem to hold true of women who have, for years, sought out stories of interest to them.<br/>\n<br/>\n---Meredith<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] deschooling/syracuse/my tv rant","postDate":"1358277157","msgId":49405,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNERjdBQjM0LUQ4QzgtNDgwMi05OEVBLUU3MThFMzIwRkU1RUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGtkNDgwYStqOTd2QGVHcm91cHMuY29tPg==","referencesHeader":"PGtkNDgwYStqOTd2QGVHcm91cHMuY29tPg=="},"prevInTopic":49404,"nextInTopic":49406,"prevInTime":49404,"nextInTime":49406,"topicId":49372,"numMessagesInTopic":0,"msgSnippet":"... Yes! Don t sell your daughter s intelligence and sense of self so short to believe she d trust commercials to tell her what to think of herself. She isn t","messageBody":"<div id=\"ygrps-yiv-1273093699\">On Jan 15, 2013, at 1:43 PM, Meredith wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They want better portrayals of women because they think well of<br/>\n&gt; themselves and want to see that reflected in their favorite characters.<br/>\n<br/>\n </span></blockquote>Yes! Don&#39;t sell your daughter&#39;s intelligence and sense of self so short to believe she&#39;d trust commercials to tell her what to think of herself. She isn&#39;t surrounded by real girls competing for boys&#39; attention. She isn&#39;t surrounded by the message that unless a guy likes her she isn&#39;t worth much.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: deschooling/syracuse/my tv rant","postDate":"1358277146","msgId":49404,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTgyNzcxNDYuNTU1NzUuWWFob29NYWlsTmVvQHdlYjE4MjIwNC5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PDEzNTgyNjcwODcuODg2NDIuWWFob29NYWlsTmVvQHdlYjE2MDQwMi5tYWlsLmJmMS55YWhvby5jb20+","referencesHeader":"PDEzNTgyNjIwNDAuNTUzNTIuWWFob29NYWlsTmVvQHdlYjE3MjIwNS5tYWlsLmlyMi55YWhvby5jb20+IDwxMzU4MjY2MTg0LjQxNTY0LllhaG9vTWFpbE5lb0B3ZWIxODIyMDQubWFpbC5iZjEueWFob28uY29tPiA8MTM1ODI2NzA4Ny44ODY0Mi5ZYWhvb01haWxOZW9Ad2ViMTYwNDAyLm1haWwuYmYxLnlhaG9vLmNvbT4="},"prevInTopic":49403,"nextInTopic":49405,"prevInTime":49403,"nextInTime":49405,"topicId":49372,"numMessagesInTopic":0,"msgSnippet":"Sexual content?   Some kids do not like to see others kissing. If my child did not I would help by not having shows with that on when I am watching or","messageBody":"<div id=\"ygrps-yiv-1760011744\">Sexual content? <br/>\n Some kids do not like to see others kissing. If my child did not I would help by not having shows with that on when I am watching or letting them know in advance there will be kissing so we can avoid it.<br/>\n But in my experience 8 year old girls are not looking for sexual content on TV  and if there are innuendos it usually goes over their heads. It is also my experience that what they want to watch is usually very kid friendly.<br/>\nThe list  of your girl&#39;s interests is great and I do not see a problem with any of it  and what is with commercials that bother you?<br/>\nWhat are you afraid of?<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n________________________________<br/>\n From: Amy Morgan &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:amymorgan1970@...\">amymorgan1970@...</a>&gt;<br/>\nTo: &quot;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt; <br/>\nSent: Tuesday, January 15, 2013 10:24 AM<br/>\nSubject: Re: [unschoolingbasics] Re: deschooling/syracuse/my tv rant<br/>\n <br/>\n<br/>\n  <br/>\nThe only real problem that I have with TV is all the sexual content.  My daughter is eight.  I like to keep most of that out.  So we have lots of DVDs and she asks before watching something.  But her interests are Star Trek, DC/Marvel comic cartoons, Transformers, and the like.  Commercials are the worst thing.  Some of them embarrass me.   We watch Pawn Stars, American Pickers, and stuff like that.<br/>\n <br/>\nAmy M.    Mrs.Rooster<br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: deschooling/syracuse/my tv rant","postDate":"1358275402","msgId":49403,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtkNDgwYStqOTd2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNTgyNjcwODcuODg2NDIuWWFob29NYWlsTmVvQHdlYjE2MDQwMi5tYWlsLmJmMS55YWhvby5jb20+"},"prevInTopic":49402,"nextInTopic":49404,"prevInTime":49402,"nextInTime":49404,"topicId":49372,"numMessagesInTopic":0,"msgSnippet":"... ************* A couple nights ago Mo and I were watching an anime series about female astronauts and space pilots. It s been awhile since we watched any of","messageBody":"<div id=\"ygrps-yiv-1219490761\">Amy Morgan  wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; But her interests are Star Trek, DC/Marvel comic cartoons, Transformers, and the like<br/>\n </span></blockquote>*************<br/>\n<br/>\nA couple nights ago Mo and I were watching an anime series about female astronauts and space pilots. It&#39;s been awhile since we watched any of it and I&#39;d forgotten just how many... booty shots for want of a better term - were in the series. No chance for a gratuitous look at a character&#39;s underwear was missed. I was surprised. Morgan likes the series, but she&#39;s started to get a little irritated at the booty shots - they&#39;re silly and waste time which could be used to further the plot or set the scene better, or add to the character development. <br/>\n<br/>\nIt&#39;s not an uncommon complaint among women who enjoy comics, manga, and anime - so much is drawn with the interests of young males in  mind. But neither Morgan nor any of the women I&#39;m getting to know online (I never got into comics as a kid, so I&#39;m trying to learn about them now) are suffering from some kind of negative-self-image as a result of their love of comics. They want better portrayals of women because they think well of themselves and want to see that reflected in their favorite characters. <br/>\n<br/>\nThat&#39;s interesting to me because I&#39;ve heard a lot of noise over the years about how sexist images of women destroy women&#39;s sense of self. It doesn&#39;t seem to hold true of women who have, for years, sought out stories of interest to them.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: deschooling/syracuse/my tv rant","postDate":"1358275357","msgId":49402,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRkMxNjczOTdFRTI1Qy0xNUE0LTJERUVDQHdlYm1haWwtZDA4NS5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PDEzNTgyNjcwODcuODg2NDIuWWFob29NYWlsTmVvQHdlYjE2MDQwMi5tYWlsLmJmMS55YWhvby5jb20+","referencesHeader":"PDEzNTgyNjIwNDAuNTUzNTIuWWFob29NYWlsTmVvQHdlYjE3MjIwNS5tYWlsLmlyMi55YWhvby5jb20+IDwxMzU4MjY2MTg0LjQxNTY0LllhaG9vTWFpbE5lb0B3ZWIxODIyMDQubWFpbC5iZjEueWFob28uY29tPiA8MTM1ODI2NzA4Ny44ODY0Mi5ZYWhvb01haWxOZW9Ad2ViMTYwNDAyLm1haWwuYmYxLnlhaG9vLmNvbT4="},"prevInTopic":49401,"nextInTopic":49403,"prevInTime":49401,"nextInTime":49403,"topicId":49372,"numMessagesInTopic":0,"msgSnippet":"... From: Amy Morgan  -=-==-The only real problem that I have with TV is all the sexual content. -=-=-=-= I hope you re having","messageBody":"<div id=\"ygrps-yiv-2115009643\">-----Original Message-----<br/>\n<br/>\nFrom: Amy Morgan &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:amymorgan1970@...\">amymorgan1970@...</a>&gt;<br/>\n<br/>\n<br/>\n-=-==-The only real problem that I have with TV is all the sexual content. -=-=-=-=<br/>\n<br/>\n<br/>\n<br/>\nI hope you&#39;re having conversations NOW about sex. Not involved/technical stuff, but answering her questions as they come up. It IS a biological function that she most likely WILL engage in. Best to start answering small questions as they pop up rather than hide it all until some &quot;magical&quot; age. And at that magical age, with no basis of reference, how sill she---or YOU--be able to bring it up, no to mention explain it?<br/>\n<br/>\n<br/>\nSmall questions answered honestly and simply when they are asked.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-=-=-=-=-  Commercials are the worst thing.  Some of them embarrass me.-=-=-=-=-<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nCommercials are springboards. Wonderful springboards. They can certainly be annoying (gotta love TiVo!), but they can open doors to all sorts of questions.<br/>\n<br/>\n<br/>\n<br/>\nI can&#39;t remember being embarrassed by a commercial in decades. Maybe while at college at the frat house when a maxipad commercial would come on? Really---what&#39;s embarrassing now? What would be too embarrassing to talk with a child about in the comfort of your own den?<br/>\n<br/>\n<br/>\n<br/>\nAs uncomfortable as SouthPark and Family Guy can be, what BRILLIANT conversation openers they were/are for my boys!<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n<br/>\n <br/>\n <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: deschooling/syracuse/my tv rant","postDate":"1358274547","msgId":49401,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtkNDc1aitzY2FoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNTgyNjcwODcuODg2NDIuWWFob29NYWlsTmVvQHdlYjE2MDQwMi5tYWlsLmJmMS55YWhvby5jb20+"},"prevInTopic":49400,"nextInTopic":49402,"prevInTime":49400,"nextInTime":49402,"topicId":49372,"numMessagesInTopic":0,"msgSnippet":"... **************** Does she Want to see sexual content? Probably not. It s kind and thoughtful to help a friend find the sorts of things she wants to see and","messageBody":"<div id=\"ygrps-yiv-1676422551\">Amy Morgan  wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; The only real problem that I have with TV is all the sexual content.  My daughter is eight.<br/>\n </span></blockquote>****************<br/>\n<br/>\nDoes she Want to see sexual content? Probably not. It&#39;s kind and thoughtful to help a friend find the sorts of things she wants to see and avoid the kinds of things she doesn&#39;t. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Commercials are the worst thing.  Some of them embarrass me.<br/>\n<br/>\n </span></blockquote>It will help to see them as potential conversation-starters. If she asks, keep your answers short and factual - she&#39;ll let you know if she wants more information. Right now, most of what&#39;s causing you to squirm is likely going right over her head.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] deschooling/syracuse/my tv rant","postDate":"1358274173","msgId":49400,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZENjAxNkE4LUVDREUtNDNENS1CQzkyLUIxQzRGMUJBMTVBNEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEzNTgyNjcwODcuODg2NDIuWWFob29NYWlsTmVvQHdlYjE2MDQwMi5tYWlsLmJmMS55YWhvby5jb20+","referencesHeader":"PDEzNTgyNjIwNDAuNTUzNTIuWWFob29NYWlsTmVvQHdlYjE3MjIwNS5tYWlsLmlyMi55YWhvby5jb20+IDwxMzU4MjY2MTg0LjQxNTY0LllhaG9vTWFpbE5lb0B3ZWIxODIyMDQubWFpbC5iZjEueWFob28uY29tPiA8MTM1ODI2NzA4Ny44ODY0Mi5ZYWhvb01haWxOZW9Ad2ViMTYwNDAyLm1haWwuYmYxLnlhaG9vLmNvbT4="},"prevInTopic":49399,"nextInTopic":49401,"prevInTime":49399,"nextInTime":49401,"topicId":49372,"numMessagesInTopic":0,"msgSnippet":"... But unschooling isn t about you and what you like. It s about helping your child find what she enjoys and avoid what she doesn t enjoy. Is she seeing","messageBody":"<div id=\"ygrps-yiv-213865477\">On Jan 15, 2013, at 11:24 AM, Amy Morgan wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The only real problem that I have with TV is all the sexual content.  <br/>\n<br/>\n </span></blockquote>But unschooling isn&#39;t about you and what you like. It&#39;s about helping your child find what she enjoys and avoid what she doesn&#39;t enjoy.<br/>\n<br/>\nIs she seeing things *she* doesn&#39;t want to see? Do you have some ideas on how she can avoid such things?<br/>\n<br/>\nAre there too many channels? Does she want you to block some so there&#39;s less to scroll through?<br/>\n<br/>\nAre you watching with her to explain things when she asks questions?<br/>\n<br/>\nI found my daughter had an internal tuner-outer for anything that didn&#39;t interest her. Sex and sex-appeal content hold little interest for kids. My daughter had free access to loads of channels but she found ways to get to the channels and shows she enjoyed, paying no attention to the others stuff.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Commercials are the worst thing.  Some of them embarrass me. <br/>\n<br/>\n </span></blockquote>Is she even noticing them?<br/>\n<br/>\nIf you call attention to them as something to be avoided or explained, you&#39;re likely to call attention to them.<br/>\n<br/>\nKids are generally pretty good about finding other things to pay attention to when something that doesn&#39;t interest them comes along. Which is why teachers have to work so hard to get kids to pay attention ;-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: deschooling/syracuse","postDate":"1358268239","msgId":49397,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRkMxNTZBNUNCNkI1OS0xNUE0LTJDRkU0QHdlYm1haWwtZDA4NS5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PDEzNTgyNjIwNDAuNTUzNTIuWWFob29NYWlsTmVvQHdlYjE3MjIwNS5tYWlsLmlyMi55YWhvby5jb20+","referencesHeader":"PDEzNTgyNjIwNDAuNTUzNTIuWWFob29NYWlsTmVvQHdlYjE3MjIwNS5tYWlsLmlyMi55YWhvby5jb20+"},"prevInTopic":49396,"nextInTopic":49399,"prevInTime":49396,"nextInTime":49398,"topicId":49372,"numMessagesInTopic":0,"msgSnippet":"Funny. That s how I feel about school: it alters the human brain patterns and fosters a short attention span. That s NOT what I see when my children or I watch","messageBody":"<div id=\"ygrps-yiv-558950551\">Funny. That&#39;s how I feel about school: it alters the human brain patterns and fosters a short attention span. That&#39;s NOT what I see when my children or I watch tv/play games. It&#39;s more like an intense focus---often for very long periods of time.<br/>\n<br/>\n<br/>\nOddly, yoga and meditation work to imbue an hypnotic/meditative-like state. And people pay big bucks for and work hard at developing that state.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI think it&#39;s REALLY important to disregard whatever &quot;study&quot; is currently out there and really look at YOUR OWN children. <br/>\n<br/>\n<br/>\nAll the different media have not negatively affected either of my children. In fact, I think they are better for ALL media---artistic/electronic/digital/news/print/social. I think the MORE we can expose our children to the better.<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: d miller &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tsukiusagi@...\">tsukiusagi@...</a>&gt;<br/>\n<br/>\n<br/>\nThis is a sort of side note regarding electronic media and children brain <br/>\ndevelopment.  From my understanding tv alters the human brain patterns and <br/>\nfosters short attention spans. (something about a sort of hypnotic/meditative <br/>\nlike state) The short attention spans are caused, supposebly, because of the way <br/>\ntv interacts with the brain but I gather more so from the super quick editing <br/>\nthat is now the norm.  <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":415930464,"authorName":"Amy Morgan","from":"Amy Morgan &lt;amymorgan1970@...&gt;","profile":"amymorgan1970","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: deschooling/syracuse/my tv rant","postDate":"1358267087","msgId":49399,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTgyNjcwODcuODg2NDIuWWFob29NYWlsTmVvQHdlYjE2MDQwMi5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PDEzNTgyNjYxODQuNDE1NjQuWWFob29NYWlsTmVvQHdlYjE4MjIwNC5tYWlsLmJmMS55YWhvby5jb20+","referencesHeader":"PDEzNTgyNjIwNDAuNTUzNTIuWWFob29NYWlsTmVvQHdlYjE3MjIwNS5tYWlsLmlyMi55YWhvby5jb20+IDwxMzU4MjY2MTg0LjQxNTY0LllhaG9vTWFpbE5lb0B3ZWIxODIyMDQubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":49397,"nextInTopic":49400,"prevInTime":49398,"nextInTime":49400,"topicId":49372,"numMessagesInTopic":0,"msgSnippet":"The only real problem that I have with TV is all the sexual content.  My daughter is eight.  I like to keep most of that out.  So we have lots of DVDs and","messageBody":"<div id=\"ygrps-yiv-1839955649\">The only real problem that I have with TV is all the sexual content.  My daughter is eight.  I like to keep most of that out.  So we have lots of DVDs and she asks before watching something.  But her interests are Star Trek, DC/Marvel comic cartoons, Transformers, and the like.  Commercials are the worst thing.  Some of them embarrass me.   We watch Pawn Stars, American Pickers, and stuff like that.<br/>\n <br/>\nAmy M.    Mrs.Rooster<br/>\n  <br/>\n          <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: deschooling/syracuse","postDate":"1358266184","msgId":49396,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTgyNjYxODQuNDE1NjQuWWFob29NYWlsTmVvQHdlYjE4MjIwNC5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PDEzNTgyNjIwNDAuNTUzNTIuWWFob29NYWlsTmVvQHdlYjE3MjIwNS5tYWlsLmlyMi55YWhvby5jb20+","referencesHeader":"PDEzNTgyNjIwNDAuNTUzNTIuWWFob29NYWlsTmVvQHdlYjE3MjIwNS5tYWlsLmlyMi55YWhvby5jb20+"},"prevInTopic":49395,"nextInTopic":49397,"prevInTime":49395,"nextInTime":49397,"topicId":49372,"numMessagesInTopic":0,"msgSnippet":"  ","messageBody":"<div id=\"ygrps-yiv-1770651254\">  <br/>\n&lt;&lt;&lt;&lt;&lt;&lt;&lt;&quot;This is a sort of side note regarding electronic media and children brain development.  From my understanding tv alters the human brain patterns and fosters short attention spans. (something about a sort of hypnotic/meditative like state) The short attention spans are caused, supposebly, because of the way tv interacts with the brain but I gather more so from the super quick editing that is now the norm.  The problems that tv causes can be counterated by engaging them in what they are watching&#39;.  So asking questions about what they are watching and relating it to their life during the show and referring back to the show when out and about. &quot;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nMany studies have debunked the notion that electronic media damages brain development. Studies have actually shown that it is beneficial for the brain.<br/>\nIt makes no sense that something that put  a brain in a meditative state ( like meditation) will also cause short attention spans. Are monks that meditate several hours a day people that have  short attention spans?<br/>\n<br/>\nHere are some links:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.businessinsider.com/heres-why-experts-think-playing-video-games-actually-make-you-smarter-2012-1?op=1\">http://www.businessinsider.com/heres-why-experts-think-playing-video-games-actually-make-you-smarter-2012-1?op=1</a><br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/screentime\">http://sandradodd.com/screentime</a><br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/tv\">http://sandradodd.com/tv</a>  ( follow all the links and you will even find one that has criticism about TV just like you posted !)<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&quot;As for violence and tv...from sociological research it seems that tv reinforces what they see in their life.  So if they are in a particularly violent area and wathing violent films then it will likely reinforce that this is how life is to over simplify.&quot;&gt;&gt;&gt;&gt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/videogames/\">http://sandradodd.com/videogames/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://video.msnbc.msn.com/the-cycle/50412970#50412970\">http://video.msnbc.msn.com/the-cycle/50412970#50412970</a> ( new study in violence and video games)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/violence/\">http://sandradodd.com/violence/</a><br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;&quot;we rarely watch tv because it is too exciting for my children who have a hard enough time calming down without it.  they are super sensitive and highly creative so even the most dull and boring will send them into crazy mode.  therefore we avoid it and I am open with them as to the reasons why and they are open for negotiations when we have better ways of handling our emotions.  every child is different and tv just does not work for us at the moment&quot;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nIt maybe that they get really excited because TV is limited and restricted. It maybe because TV makes them excited and full of ideas they want to try it out! And that is good!!!!! <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/t/economics\">http://sandradodd.com/t/economics</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/t/whatif\">http://sandradodd.com/t/whatif</a><br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;&quot;Again, I feel sure this area of research has moved on from when I initially looked at things (and feel sure there are critics as well) and would encourage anyone who has concerns or interest to have a nosy.&quot;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\nYes. Remember when margarine was really good for your hear?  TV and electronic media are just tools and  they are not powerful things that will make your brain have short attention span. I read a lot on my computer and that is different than watching a movie or playing a game. It is all good. It has no power over me because I get to chose what I want. If my kids watch something and get excited about it I think that is awesome! I have a truck load of stuffed, plush creatures are from video games and cartoons and they were inspired by &quot;electronic media&quot; and my kids have played hours and hours and hours for years with those in their pretend games, together and sweetly. <br/>\nMaybe instead of looking at studies you could join your kids up and watch with them with an open mind and heart.  That way you won&#39;t be so fearful of it!<br/>\n<br/>\nAlex Polikowsky <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: deschooling/syracuse","postDate":"1358266052","msgId":49395,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE4M0E2NDMwLTM2RDktNEQyRi1CRURBLTRDRkQ3RkUyRkFCNUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEzNTgyNjIwNDAuNTUzNTIuWWFob29NYWlsTmVvQHdlYjE3MjIwNS5tYWlsLmlyMi55YWhvby5jb20+","referencesHeader":"PDEzNTgyNjIwNDAuNTUzNTIuWWFob29NYWlsTmVvQHdlYjE3MjIwNS5tYWlsLmlyMi55YWhvby5jb20+"},"prevInTopic":49394,"nextInTopic":49396,"prevInTime":49394,"nextInTime":49396,"topicId":49372,"numMessagesInTopic":0,"msgSnippet":"... This is really old information that keeps getting passed on because people don t trust their own abilities to look objectively at what they fear. It s much","messageBody":"<div id=\"ygrps-yiv-1354450609\">On Jan 15, 2013, at 10:00 AM, d miller wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; From my understanding tv alters the human brain patterns and fosters<br/>\n&gt; short attention spans. (something about a sort of hypnotic/meditative like state) <br/>\n<br/>\n </span></blockquote>This is really old information that keeps getting passed on because people don&#39;t trust their own abilities to look objectively at what they fear. It&#39;s much easier, much safer to fear and find &quot;research&quot; that supports those fears.<br/>\n<br/>\nAll research done on school-aged children is done on schooled children. Two bad things about that. One, a lot of research is focused on getting kids to perform better in school. Or using school performance as an indicator of the effects. Two, the schooled kids have a wide range of parenting and all go to school. Without a control group with one philosophy of parenting, with no school, there&#39;s no way for the researchers to eliminate the effects of parenting and school.<br/>\n<br/>\nMuch better in terms of unschooling is to look at what happens with real unschooled children. Since unschooling parents create a rich environment for the child to choose from, kids who find TV fits their learning style can watch considerably more than their schooled counterparts. Without the need to use TV to de-stress from school, kids make thoughtful choices based on what they&#39;re curious about. Even if the parents can&#39;t figure out what the kids are getting from particular shows!<br/>\n<br/>\nIf TV caused the problems &quot;researchers&quot; say it does, unschooling kids should show far more pronounced effects, far more than schooled children. And yet they don&#39;t. There&#39;s no sign of negative altering of their brain patterns. (Any differences between schooled and unschooled kids tend to be positive, but that comes from having their preferences and interests honored.) Unschooled kids can pay attention to programs that engage them without flipping channels every few minutes. Since they learn tons there&#39;s no sign they&#39;re hypnotized or meditating.<br/>\n<br/>\n(And I, who did use TV to de-stress after school, also learned tons. I have vast knowledge base of 30s, 40s and 50s social mores to tap into that I got from watching old movies on TV. Among many other things.)<br/>\n<br/>\nI think what TV has shown most clearly by what *looks* like kids with shorter attention spans is that kids have realized their learning world doesn&#39;t need to be as dull as school! 50 years ago, school offered more books, different ideas, different opportunities than kids could find at home. Though it was dull, there was at least some interesting things there. The same is no longer true. With the internet, the world can come right into your home. Anything a child might want to know about is only a few clicks away.<br/>\n<br/>\nSchool is using the same tools they were 100 years ago with a teacher, a &quot;chalk&quot; board, desks, books and pencils.<br/>\n<br/>\nTV doesn&#39;t shorten kids&#39; attention spans. It works with brains that can absorb more and faster than adults have supposed children can. And, since TV -- and the internet and available videos -- is so vast, if kids prefer a slower pace, they can find it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The problems that tv causes can be counterated by engaging them in what they are watching&#39;<br/>\n<br/>\n </span></blockquote>The biggest problem isn&#39;t TV. It&#39;s moms who are relieved when kids turn to TV because it means the moms get a break. TV doesn&#39;t cause kids to disconnect. Moms choose to disconnect when their kids turn to TV (and video games and the internet.)<br/>\n<br/>\nUnschooling moms should be with their kids. They should actively watch enough to know what their kids are talking about when they talk about a show. They should connect to their kids through their interests (in shows and anything else their kids enjoy) If kids are watching the 27th rerun of a favorite show, moms should be nearby when kids are watching. Rearrange the house and activities so mom doesn&#39;t need to be off in one part of the house often while the kids watch. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; we rarely watch tv because it is too exciting for my children <br/>\n&gt; who have a hard enough time calming down without it.<br/>\n<br/>\n </span></blockquote>If there&#39;s a problem and mom comes up with a single solution, then maintaining the solution becomes the new problem.<br/>\n<br/>\nThat&#39;s not the problem solving approach that&#39;s fostered here.<br/>\n<br/>\nIf, instead, mom supports the kids exploring many solutions, they not only become better problem solvers, they will explore tools that will be useful for a life time that will include TV.<br/>\n<br/>\nIf any parents have kids who get &quot;un-calm&quot; from TV, I&#39;m sure there are parents here who&#39;ve had such children and can pass on some ideas that worked for them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  therefore we avoid it and I am open with them as to the reasons <br/>\n&gt; why and they are open for negotiations when we have better <br/>\n&gt; ways of handling our emotions.<br/>\n<br/>\n </span></blockquote>They are growing and changing everyday. The problems of yesterday may not be the problems of today. But you&#39;ve now decided because of past behavior that your kids are too excited by TV. But they can&#39;t test their excitement boundaries to see if they&#39;ve changed from last week. They can&#39;t get to know their own boundaries, what will trigger them, what will help. They can&#39;t get to know how those boundaries are changing.<br/>\n<br/>\nThe answer isn&#39;t to throw up hands and let them figure it out themselves. The answer is to support them as they continually test and explore their limitations, figure out who they are, what they like, what they don&#39;t like.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; tv just does not work for us<br/>\n<br/>\n<br/>\n </span></blockquote>As far as unschooling is concerned, I think it&#39;s unhelpful to think in terms of &quot;we&quot;. As an unschooling parent, mom is supporting children with their individual needs and likes and dislikes. &quot;We&quot; can make it too easy for Mom to mistake her own comfort zone as everyone&#39;s comfort zone.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":325022287,"authorName":"d miller","from":"d miller &lt;tsukiusagi@...&gt;","profile":"tsukiusagi","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: deschooling/syracuse","postDate":"1358262040","msgId":49394,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTgyNjIwNDAuNTUzNTIuWWFob29NYWlsTmVvQHdlYjE3MjIwNS5tYWlsLmlyMi55YWhvby5jb20+"},"prevInTopic":49386,"nextInTopic":49395,"prevInTime":49393,"nextInTime":49395,"topicId":49372,"numMessagesInTopic":0,"msgSnippet":"This is a sort of side note regarding electronic media and children brain development.  From my understanding tv alters the human brain patterns and fosters","messageBody":"<div id=\"ygrps-yiv-589037467\">This is a sort of side note regarding electronic media and children brain development.  From my understanding tv alters the human brain patterns and fosters short attention spans. (something about a sort of hypnotic/meditative like state) The short attention spans are caused, supposebly, because of the way tv interacts with the brain but I gather more so from the super quick editing that is now the norm.  The problems that tv causes can be counterated by engaging them in what they are watching&#39;.  So asking questions about what they are watching and relating it to their life during the show and referring back to the show when out and about. <br/>\n<br/>\nAs for violence and tv...from sociological research it seems that tv reinforces what they see in their life.  So if they are in a particularly violent area and wathing violent films then it will likely reinforce that this is how life is to over simplify.<br/>\n<br/>\nwe rarely watch tv because it is too exciting for my children who have a hard enough time calming down without it.  they are super sensitive and highly creative so even the most dull and boring will send them into crazy mode.  therefore we avoid it and I am open with them as to the reasons why and they are open for negotiations when we have better ways of handling our emotions.  every child is different and tv just does not work for us at the moment<br/>\n<br/>\nAgain, I feel sure this area of research has moved on from when I initially looked at things (and feel sure there are critics as well) and would encourage anyone who has concerns or interest to have a nosy.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: deschooling/syracuse","postDate":"1358156022","msgId":49386,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtkMGpkbStiaTdxQGVHcm91cHMuY29tPg=="},"prevInTopic":49375,"nextInTopic":49394,"prevInTime":49385,"nextInTime":49387,"topicId":49372,"numMessagesInTopic":0,"msgSnippet":"... Jen, have you ever asked yourself WHY certain groups have created and promoted such a negative association with electronic media? Teachers organizations","messageBody":"<div id=\"ygrps-yiv-1099764866\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;jenit1025&quot;  wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Hi,<br/>\n&gt; <br/>\n&gt; I&#39;m very new to unschooling my 2 school aged children 7, and 5 were<br/>\n&gt; going to a Charter school until a couple weeks before christmas.<br/>\n&gt;  We&#39;re still going through the de-schooling process and I have<br/>\n&gt; anxieties about them watching too much tv or playing on the computer<br/>\n&gt; all day.  ...<br/>\n<br/>\n </span></blockquote>Jen, have you ever asked yourself WHY certain groups have created and promoted such a negative association with electronic media? Teachers&#39; organizations and pediatricians have been promoting the idea that there is something &quot;wrong&quot; with TV and the internet an video games, but without any real explanation as to WHY they are opposed to these forms of entertainment and learning. Watching TV, using computers, and playing video games are all as informative/educational as they are entertaining. Electronic media also stimulates kids&#39; imaginations. It is, on the whole, CREATED by well-educated people with great imaginations!<br/>\n<br/>\nMost kids who enjoy electronic media ALSO enjoy playing with toys, doing some art or music activities, participating in something athletic, going to interesting places, and playing with other kids.<br/>\n<br/>\nWhat other things do your kids enjoy doing? What do you enjoy doing with them?<br/>\n<br/>\nI used to watch a lot of TV with my kids. We played some video games together. We looked at interesting websites and videos together. We had some great conversations that were sparked by electronic media! We also watched TV and played online games, etc, separately. But that wasn&#39;t the ONLY thing we ever did!<br/>\n<br/>\nI didn&#39;t limit electronic media time in our house. But my kids also played with toys, did art and craft projects, played musical instruments, played outside, participated in various active/exercise activities, read and listened to books, took a few classes - of their own choice - with homeschoolers, and played with friends regularly.<br/>\n<br/>\nI do hope you find other homeschooled and unschooled kids for your kids to play with. But, when you and they are home, and if they have lots of options to choose from, and you are available to do other things with them, then if they choose to watch TV and use the computer, you needn&#39;t feel anxious about it. The anxiety about TV and computers has been instilled in you by anti-electronic-media groups who do this mostly out of a sense of fear of change, a stodgy reluctance to accept new media, and the &quot;education-industrial-complex&quot; trying to keep control and relevance in a world where it is becoming obsolete. <br/>\n<br/>\nOn the other hand, if that doesn&#39;t mean you shouldn&#39;t try to engage your kids in other activities. Which leads back to: what else do you and they like to do together?<br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":154304522,"authorName":"","from":"unschoolingbasics-owner@yahoogroups.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: deschooling/syracuse","postDate":"1358086301","msgId":49375,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtjdWZhdCtjcDhjQGVHcm91cHMuY29tPg=="},"prevInTopic":49374,"nextInTopic":49386,"prevInTime":49374,"nextInTime":49376,"topicId":49372,"numMessagesInTopic":0,"msgSnippet":"Please take local chit-chat off the list! Thanks!","messageBody":"<div id=\"ygrps-yiv-1866704549\">Please take local chit-chat off the list! Thanks!<br/>\n---Meredith</div>","specialLinks":[]},{"userId":235672062,"authorName":"Summer on the hill with beans","from":"Summer on the hill with beans &lt;homemadepuddin@...&gt;","profile":"icountsheep","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] deschooling/syracuse","postDate":"1358039649","msgId":49374,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBR0hEVDQ5RXBtUVBaeURXdC1paHc0T1VKWFE9UEdZR1RKWGl6SHVwa2EzV3hwUHQxUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGtjc2ttbitxNHRrQGVHcm91cHMuY29tPg==","referencesHeader":"PGtjc2ttbitxNHRrQGVHcm91cHMuY29tPg=="},"prevInTopic":49373,"nextInTopic":49375,"prevInTime":49373,"nextInTime":49375,"topicId":49372,"numMessagesInTopic":0,"msgSnippet":"Jen, We are still deschooling too, and in the Hamilton area...about 1 hr. away from you.  We are really trying to meet other unschoolers too.  My kids 8,5 were","messageBody":"<div id=\"ygrps-yiv-1700039651\">Jen,<br/>\n<br/>\nWe are still deschooling too, and in the Hamilton area...about 1 hr. away<br/>\nfrom you.  We are really trying to meet other unschoolers too.  My kids 8,5<br/>\nwere in public school untill 2 months ago.  I have a 1.5 yr. old too.  We<br/>\nwould love to meet up and talk about the process / play!<br/>\n<br/>\nSummer<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Jan 12, 2013 at 4:31 PM, jenit1025 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jen.tsimis@...\">jen.tsimis@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Hi,<br/>\n&gt;<br/>\n&gt; I&#39;m very new to unschooling my 2 school aged children 7, and 5 were going<br/>\n&gt; to a Charter school until a couple weeks before christmas. We&#39;re still<br/>\n&gt; going through the de-schooling process and I have anxieties about them<br/>\n&gt; watching too much tv or playing on the computer all day. I was wondering if<br/>\n&gt; there&#39;s any Syracuse, NY unschoolers I can get my kids involved with.<br/>\n&gt;<br/>\n&gt; Thanks,<br/>\n&gt;<br/>\n&gt; Jen<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: deschooling/syracuse","postDate":"1358035956","msgId":49373,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtjc3U1aytyNThuQGVHcm91cHMuY29tPg=="},"prevInTopic":49372,"nextInTopic":49374,"prevInTime":49372,"nextInTime":49374,"topicId":49372,"numMessagesInTopic":0,"msgSnippet":"There are links to US unschooling groups here: http://sandradodd.com/world#us and other groups further up the same page - the general link is here: ","messageBody":"<div id=\"ygrps-yiv-1540870153\">There are links to US unschooling groups here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/world#us\">http://sandradodd.com/world#us</a><br/>\n<br/>\nand other groups further up the same page - the general link is here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/world\">http://sandradodd.com/world</a><br/>\n<br/>\n&quot;jenit1025&quot;  wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;my 2 school aged children 7, and 5 were going to a Charter school until a couple weeks before christmas.  We&#39;re still going through the de-schooling process <br/>\n </span></blockquote>****************<br/>\n<br/>\nIt helps to completely disregard any regular vacation time as part of deschooling - it&#39;s just vacation and kids will do what they usually do on vacation, maybe with more gusto. Even if you&#39;ve told them &quot;no more school&quot; they can&#39;t really believe it, down in their guts, until school starts again and they don&#39;t go. So at best they&#39;ve had... what? a week of deschooling? So they&#39;re still in full fledged &quot;recovery&quot; mode. They&#39;re resting and only just starting to heal. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I have anxieties about them watching too much tv or playing on the computer all day.<br/>\n </span></blockquote>************<br/>\n<br/>\nIf they were sick and needed to rest and recover, you might not mind so much - and if so, that&#39;s a good analogy to use while you&#39;re adapting to new ideas and expectations. They&#39;re sick of school and schoolishness and need time to get well again. Let them relax in ways which work best for them. <br/>\n<br/>\nWhile they&#39;re relaxing, spend time with them, getting to know them, what they enjoy and find interesting as people, rather than students. That means watching some tv and playing some games with them - not frowning criticism and deriding what they enjoy, but looking to see the interest and value from their perspective. What sorts of shows do they like to watch? Which games do they like to play? What sorts of things do they like to do online? The really great thing about tv, video games and social media is you get to see those things directly and connect more directly with your kids - unlike, for instance, reading books which is such an isolating activity in comparison. Sure, you can read the same books, but it&#39;s nowhere near as interactive and personal as watching a show together or playing a game together. <br/>\n<br/>\nHere&#39;s a link to help you get started deschooling:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":547576412,"authorName":"jenit1025","from":"&quot;jenit1025&quot; &lt;jen.tsimis@...&gt;","profile":"jenit1025","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"deschooling/syracuse","postDate":"1358026263","msgId":49372,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtjc2ttbitxNHRrQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":49373,"prevInTime":49371,"nextInTime":49373,"topicId":49372,"numMessagesInTopic":0,"msgSnippet":"Hi, I m very new to unschooling my 2 school aged children 7, and 5 were going to a Charter school until a couple weeks before christmas.  We re still going","messageBody":"<div id=\"ygrps-yiv-787968121\">Hi,<br/>\n<br/>\nI&#39;m very new to unschooling my 2 school aged children 7, and 5 were going to a Charter school until a couple weeks before christmas.  We&#39;re still going through the de-schooling process and I have anxieties about them watching too much tv or playing on the computer all day.  I was wondering if there&#39;s any Syracuse, NY unschoolers I can get my kids involved with.<br/>\n<br/>\nThanks,<br/>\n<br/>\nJen</div>","specialLinks":[]}],"prevTopicId":49392,"nextTopicId":49414}}