{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":237503152,"authorName":"barndogzzz@wmconnect.com","from":"barndogzzz@...","profile":"artofthefire","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Life without chores; thanksRen/help! & intro :o)","postDate":"1139056447","msgId":9766,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI1YS42NDEyNTllLjMxMTVmOTNmQHdtY29ubmVjdC5jb20+"},"prevInTopic":9758,"nextInTopic":0,"prevInTime":9765,"nextInTime":9767,"topicId":9754,"numMessagesInTopic":0,"msgSnippet":"Hello Leslie, Thank you for your response! The need and want for your life and home to have some sort of order and at least a bit of, LOL, cleanliness is a","messageBody":"<div id=\"ygrps-yiv-471282267\">Hello Leslie,<br/>\nThank you for your response! The need and want for your life and home to have <br/>\nsome sort of order and at least a bit of, LOL, &quot;cleanliness&quot; is a hard <br/>\nsituation WITH kids! I am not neurotic about them leaving messes around here at all, <br/>\nI just get tired of having to pick up after them all the time! It&#39;s <br/>\nexhausting! BUT, then I look at them and remember that they are, as you said, <br/>\n&quot;recovering from their school lives of Have to&#39;s&quot;, and my heart does soften! ....But <br/>\nthen I turn around and see the &quot;stuff&quot; that is all over the house and I think <br/>\nGEESH! here we go again! &lt;g&gt; &quot;<br/>\n<br/>\n****it would be helpful to me if you take your dish to the <br/>\nkitchen.&quot;    A little shift in emphasis,***** <br/>\nI know you are right, I remember when I was young, if my Mom or Dad yelled <br/>\n(which for my Dad was all the time) and got all nasty about asking me to do <br/>\nthings, I rebelled big time and of course, also ended up in a bad mood. I knew if <br/>\nI wrote to this group I would get a big shove in the right direction! hee hee! <br/>\nJust what I needed! My kids would thank you! and probably my husband too!<br/>\n<br/>\nThanks for the insight,<br/>\nNancy<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":92643757,"authorName":"Leslie530@aol.com","from":"Leslie530@...","profile":"lescather","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Life without chores; thanksRen/help! & intro :o)","postDate":"1139006285","msgId":9758,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5NS40ZTMwMWVjLjMxMTUzNTRkQGFvbC5jb20+"},"prevInTopic":9754,"nextInTopic":9766,"prevInTime":9757,"nextInTime":9759,"topicId":9754,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/3/2006 4:55:13 P.M. Eastern Standard Time, barndogzzz@wmconnect.com writes: Any time  I do say things like Hey, would you please take","messageBody":"<div id=\"ygrps-yiv-1412633013\">In a message dated 2/3/2006 4:55:13 P.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barndogzzz@...\">barndogzzz@...</a> writes:<br/>\n<br/>\nAny time  I do say things like &quot;Hey, would you please take your <br/>\ndishes to the  kitchen&quot; sometimes you would think I was asking them to clean <br/>\nthe <br/>\ntoilet!  LOL! <br/>\n<br/>\n<br/>\n<br/>\n********&#39;<br/>\n <br/>\nHi Nancy!  This is such a hard situation.  We have to mix  family dynamics, a <br/>\nhistory of &quot;have to&#39;s&quot;, and our children&#39;s  personalities.  Neither of my <br/>\nchildren are natural cleaners.  I think  your issues are a challenge for many <br/>\nfamilies.<br/>\n <br/>\nIt is easy and understandable to slip into feeling like we wait on our  <br/>\nchildren like servants!  I try to keep an attitude of gift giving.  It  is a gift <br/>\nfor a child to not &quot;have to&quot; clean up, and your children are  recovering from <br/>\ntheir school lives of &quot;have to&quot;.<br/>\n <br/>\nThe reason I picked the above quote is not that there is anything wrong  with <br/>\nit, it is a legitimate request.  I have tweaked it recently with my  kids.  I <br/>\nhave been saying &quot;it would be helpful to me if you take your dish  to the <br/>\nkitchen&quot;.    A little shift in emphasis, but I have  noticed a difference in some <br/>\nof those little things, fewer candy wrappers and  dirty clothes on the floor <br/>\nand more dishes brought back in the kitchen.  <br/>\n <br/>\nLeslie in SC<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":237503152,"authorName":"barndogzzz@wmconnect.com","from":"barndogzzz@...","profile":"artofthefire","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Life without chores; thanksRen/help! & intro :o)","postDate":"1139000438","msgId":9754,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5OS40ZTIzNWJmLjMxMTUxZTc2QHdtY29ubmVjdC5jb20+"},"prevInTopic":0,"nextInTopic":9758,"prevInTime":9753,"nextInTime":9755,"topicId":9754,"numMessagesInTopic":0,"msgSnippet":"Wow, what an awesome post! THANK YOU REN! (and Danielle!) for swiping and sharing it with us! That was just what I needed to hear! I m fairly new here to","messageBody":"<div id=\"ygrps-yiv-954409528\">Wow, what an awesome post! THANK YOU REN! (and Danielle!) for &quot;swiping&quot; and <br/>\nsharing it with us! That was just what I needed to hear!<br/>\nI&#39;m fairly new here to this list (been enjoying it immensely)! and also <br/>\npretty new to un/hsing. I&#39;ve only posted a couple times here and never really <br/>\nintro. myself, I guess I should now, especially cuz I need some advice on this one <br/>\nBIG TIME! <br/>\n<br/>\nMy name is Nancy, we pulled our dd&#39;s (101/2 & 12) out of ps about a yr. ago. <br/>\nWe had always talked about hsing, my dh loved the idea, always wanted us to <br/>\nand so did I, but I was always too big of a chicken to just go for it.(da, took <br/>\nme long enough to see the light!) I had finally just gotten so tired of <br/>\nwatching our dd&#39;s love of learning slowly diminish down to almost despising it. <br/>\nWatching them become more and more turned off towards learning made me sick to my <br/>\nstomach, let alone watching all of the other garbage that goes on in the ps <br/>\nsystem and I did see PLENTY of it. I can&#39;t imagine ever sending them back there, <br/>\nunless, I suppose, if they really wanted to, but I don&#39;t think I have to <br/>\nworry about that, at least not for now! They LOVE unschooling, heck, what kid <br/>\nwouldn&#39;t!? I know I would have when I was growing up! &lt;g&gt; When their friends ask <br/>\nthem if they ever miss school and want to come back I always here them say, <br/>\n&quot;Are you kidding!? Why would I want to do that!&quot; We are all so much more happier <br/>\nnow, I can&#39;t believe the difference unschooling has made in our lives! <br/>\n<br/>\nNot that there haven&#39;t been a few bumps along the road! We have been &quot;DE&quot; <br/>\nschooling ever since we pulled them out a yr ago and I have a feeling we all <br/>\nstill are! Which brings me to what I need advice on... chores and helping around <br/>\nthe house! <br/>\n<br/>\nOver the yrs. we have gotten into such a bad &quot;habit&quot; of looking at what <br/>\nshould be just plain & simple kindness like &quot;helping around the house&quot; as a BIG <br/>\nCHORE instead of what Danielle just decried in this post. I think that was just <br/>\nbeautiful. I have noticed our youngest do the sort of things mentioned in her <br/>\npost now and then, but they, especially our oldest, look at cooking or helping <br/>\nprepare meal as &quot;yuk! work&quot; and if I invite them to help me, they (again, <br/>\nespecially our oldest) are immediately turned off. I allow that and just say &quot;OK, <br/>\nmaybe another time. But man, I would LOVE to spend time with them in that way! <br/>\nThey do help take care of the animals most of the time without too much <br/>\nhassle but anything else like picking up around the house, forget it. It just turns <br/>\ninto a big hassle and I end up doing most of it. what a drag! &lt;g&gt;<br/>\n<br/>\nI&#39;m afraid we are very far away from the place where Danielle is and I really <br/>\nwant that for us! Just not sure how to stop the behavior that got us where we <br/>\nare now. Any time I do say things like &quot;Hey, would you please take your <br/>\ndishes to the kitchen&quot; sometimes you would think I was asking them to clean the <br/>\ntoilet! LOL! <br/>\n<br/>\nWhen they were in school, it always seemed like we were in a hurry to get <br/>\nthings done, etc., and that (I think) is where the habit started. Always having <br/>\nto &quot;get things done&quot; in time for ... whatever was happening at the time. <br/>\n(sounds so silly now) It seemed like we were always on the go. We have slowed the <br/>\npace way down since hsing but those old habits are still here and as they say, <br/>\nsometimes old habits die hard. I am hoping some of you will have some <br/>\nsuggestions on how to break this awful &quot;habit&quot; we have all gotten so accustomed to. Do <br/>\nmost of you just &quot;do it all&quot; and maybe someday they&#39;ll pitch in happily?? Our <br/>\ngirls are not that young and they are very independent in many ways. I just <br/>\nwish they would want to be more involved with all of it, but also feel good <br/>\nabout it at the same time.I hope I&#39;m making sense as to what is happening around <br/>\nhere! :o) I&#39;ll stop now, guess I was venting a bit also!<br/>\n<br/>\nMaybe you&#39;ve touched on this subject before so I&#39;m sorry to have the need to <br/>\nbring it up again here! This is just one of the biggest obstacles we have come <br/>\nacross since leaving the whole schooly stuff behind us! Well, besides those <br/>\npesky friends/relatives who &quot;mean well&quot; and are &quot;just concerned&quot; about our <br/>\ndecision to hs! But, that&#39;s another post I suppose, one I&#39;m sure you&#39;ve all <br/>\ntouched on many times! Anything ideas you have to offer would be GREATLY <br/>\nappreciated! <br/>\n<br/>\nThanks for listening!<br/>\nNancy<br/>\ncheck out my art!<br/>\n&lt;A HREF=&quot;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.picturetrail.com/nancysart&quot;\">http://www.picturetrail.com/nancysart&quot;</a>&gt;Click here: PictureTrail&lt;/A&gt;  or <br/>\n&lt;A HREF=&quot;<a rel=\"nofollow\" target=\"_blank\" href=\"http://carverscompanion.com/Ezine/Vol9Issue3/KMenendez/KMenendez2.html&quot;\">http://carverscompanion.com/Ezine/Vol9Issue3/KMenendez/KMenendez2.html&quot;</a>&gt;Click here: Woodcarver On-Line Magazine, Pyrography News, No. 34&lt;/A&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":9763,"nextTopicId":9757}}