{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":359907606,"authorName":"AllisonR","from":"&quot;AllisonR&quot; &lt;earlyhiker@...&gt;","profile":"earlyhiker","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Krabby Patties, Software Platform and Video games causing stress","postDate":"1259163269","msgId":42182,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlamlxNStvMnZoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc0OTcyLjQ5MDg5LnFtQHdlYjg2MjA0Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":42178,"nextInTopic":0,"prevInTime":42181,"nextInTime":42183,"topicId":42148,"numMessagesInTopic":0,"msgSnippet":"I read this.  I read this again.  I went and took a long shower, thought about it, had a yogurt, dried my hair.  Read this again.  I have printed this out and","messageBody":"<div id=\"ygrps-yiv-1658549668\">I read this.  I read this again.  I went and took a long shower, thought about it, had a yogurt, dried my hair.  Read this again.  I have printed this out and it is hanging where I can see it... a blessing especially before the expectations of the holidays and many family birthdays come rolling around.  Thanks you, Schuyler.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; It helps a lot if you retell the story. The story you&#39;ve told is of you the suffering cook who has to spend too much of your day catering to their food whims. It&#39;s easy to get overwhelmed by a story that has you chained to the kitchen fixing foods for whimsical folks. They get all the fun of whimsy and you get stuck with the labor of accomodating their whimsy. If you retell your story... </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Krabby Patties, Software Platform and Video games causing stress","postDate":"1259139522","msgId":42178,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0OTcyLjQ5MDg5LnFtQHdlYjg2MjA0Lm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDkxMDc2Mi44NDU3OC5xbUB3ZWIxODAzMDMubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDkxMDc2Mi44NDU3OC5xbUB3ZWIxODAzMDMubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":42168,"nextInTopic":42182,"prevInTime":42177,"nextInTime":42179,"topicId":42148,"numMessagesInTopic":0,"msgSnippet":"... and dinner. I gave up making everyone eat at the same time and I am unwilling to keep warming food up. I understand that I am trying to accomodate the","messageBody":"<div id=\"ygrps-yiv-1897573710\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;I love feeding my family. I am happy to feed them breakfast, lunch<br/>\n </span></blockquote>and dinner. I gave up making everyone eat at the same time and I am<br/>\nunwilling to keep warming food up. I understand that I am trying to<br/>\naccomodate the various needs in my family. How do I do that without<br/>\nabandoning my own needs? I feel resentful because I think I spend too<br/>\nmuch of my day catering to their  food whims. I have started saying<br/>\nthat I&#39;m happy to make something they want with them. Usually, they<br/>\ndecline and either give up on that food or say that I should make it<br/>\nfor them. Is it fair that I should do something for them that I don&#39;t<br/>\nnecesarily want to do and they have no interest in helping?&lt;&lt;&lt;<br/>\n<br/>\nIt helps a lot if you retell the story. The story you&#39;ve told is of you the suffering cook who has to spend too much of your day catering to their food whims. It&#39;s easy to get overwhelmed by a story that has you chained to the kitchen fixing foods for whimsical folks. They get all the fun of whimsy and you get stuck with the labor of accomodating their whimsy. If you retell your story, if you see yourself as the one who is fueling their whimsy, making their flights of fancy possible, as the one who makes all the rest possible and happy and joyful and about the thing, then you get to be an active player in the story. And you can have your own fanciful flights. I had a blast making bento lunches for Linnaea and Simon for a bit. Making candy was also a momentary whimsy for me. Homemade bagels with wonderful toppings, platters that keep them and friends going for a while during intense and focused gaming, soy chai lattes with fantastic foam, challah, a<br/>\n deathly red velvet cake that oozed red pudding for halloween, lots of things that make us all smile. All my flights of fancy. And all of which helps to keep them from melting down post game when the focus wanes and they realize just how hungry they are. There was a study done on activity and eating patterns. Apparently mental activity takes more calories to maintain then physical activity. Your brain is your most expensive organ, even when you are exercising. So, gaming makes you hungry, really hungry. If your children are hungry they are much more likely to fight and be grouchy with everyone around them. <br/>\n<br/>\nYou may also want to look for ways around your perspective that feeding him where he is can destroy the house and your day. I&#39;ve got crumbs ground in the carpet. Or I did, but we bought a steam cleaner the other day and I have been having a blast atomising dirt around the house with steam billowing up around me like the best haunted house dry ice machine can produce. But there are ways I could have avoided the crumbs if I were so inclined. I could have gotten a sheet to put down around where they were eating. I used to put down a plastic mat that we got from a Mister Donuts in Japan by using our customer loyalty card enough times. It was the same thing I&#39;d use if they were playing with playdoh. Thinking through the problem can help you to come up with more options than the no you&#39;ve given Joyce&#39;s suggestion. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Krabby Patties, Software Platform and Video games causing stress","postDate":"1259107979","msgId":42168,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlaHNxYithdTJwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDkxMDc2Mi44NDU3OC5xbUB3ZWIxODAzMDMubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":42165,"nextInTopic":42178,"prevInTime":42167,"nextInTime":42169,"topicId":42148,"numMessagesInTopic":0,"msgSnippet":"... ********************* Can you put a vinyl table cloth on the floor around where he s playing? We have a small plastic table that stays by the game-play","messageBody":"<div id=\"ygrps-yiv-1595176730\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Toby Rosenberg &lt;philipntoby@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Yes, bringing him food does help. However, it&#39;s only helpful to me if I bring veggies that are not going to make a huge mess. Otherwise, I end up with crumbs ground into our carpet. <br/>\n </span></blockquote>*********************<br/>\n<br/>\nCan you put a vinyl table cloth on the floor around where he&#39;s playing? We have a small plastic table that stays by the game-play chair that I periodically scrub down, but not every day. Its broad enough to catch most crumbs.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Is it fair that I should do something for them that I don&#39;t necesarily want to do and they have no interest in helping?<br/>\n </span></blockquote>********************<br/>\n<br/>\nEverything you do is a choice. You can choose to make food grudgingly, or refuse to make food equally grudgingly, and choose to have that sentiment be a part of your daily life. You can also choose to see what you do for your loved ones as gifts, acts of graciousness on your part. That&#39;s not something you choose just once and its done! It can be an ongoing effort to shift your thinking and awareness to being more gracious and giving. <br/>\n<br/>\nWhen you divide your life up into &quot;fair&quot; and &quot;not fair&quot; then life stinks. Life isn&#39;t fair! There&#39;s no balance, no equality in day to day life. That can be something to weigh you down, or it can be an opportunity to see life from a different perspective. When someone is needy, its a marvelous opportunity to be giving! to spread a little more love and kindness and goodness in the world. That&#39;s an Amazing gift! Its why some people devote their lives to charitable work, you know, so that they can have the gift of anothers neediness to uplift them. You can choose to be uplifted by the simplicity of bringing a snack to a hungry child. <br/>\n<br/>\nToby, you sound like you feel really &quot;stuck&quot; right now - that you feel like you don&#39;t have a lot of control in your life. Its easy, when you&#39;re feeling stuck, to find ways to be resentful, but that also only intensifies that feeling of powerlessness. It builds and builds. Finding ways for you to feel more powerful in your life may be beyond the scope of this list. But you Do have the power to decide how you will be to your kids. You have the power to change the only thing anyone really has power over, your own self. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":235225792,"authorName":"Kelly","from":"&quot;Kelly&quot; &lt;kelly@...&gt;","profile":"dogsheeptiger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:Krabby Patties, Software Platform and Video games causing stress","postDate":"1259095419","msgId":42165,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2QzQ5NzUyRDAwMzRBNUM4MDA3M0U1REMxN0EyQTEwQERFU0s2Mj4="},"prevInTopic":42164,"nextInTopic":42168,"prevInTime":42164,"nextInTime":42166,"topicId":42148,"numMessagesInTopic":0,"msgSnippet":"... uses to fight with his brother, or act in a very excitable and annoying way. We have discussed with him some strategies to release this pent up energy ","messageBody":"<div id=\"ygrps-yiv-1013265129\"><blockquote><span title=\"ireply\">&gt;&gt;Usually after he finishes a game he has a lot of pent up energy that he<br/>\n </span></blockquote>uses to fight with his brother, or act in a very excitable and annoying way.<br/>\nWe have discussed with him some strategies to release this pent up energy<br/>\nafter a game including going to the basement to jump, or play a sport.  He<br/>\nhasn&#39;t followed through on that.&lt;&lt;<br/>\n<br/>\n <br/>\n<br/>\nI agree with the other responses posted so far. I also wondered how old your<br/>\nson is, as your approach might be different for a 5 year old than, say, a 10<br/>\nyear old. I was also wondering, when you say &quot;he hasn&#39;t followed through on<br/>\nthat,&quot; if you have helped him make the transition from game-time to physical<br/>\nplay time. My now 6 year old daughter has been a pretty intense game player<br/>\nsince she was 4 years old. We noticed right away how drained, stressed,<br/>\nupset she could be after playing non-stop all day. My husband or I would<br/>\ncheck in with her frequently, ask her questions about the game, hold her<br/>\nglass of water/juice with a straw in it up to her mouth so she could drink<br/>\nwithout stopping her game, and feed her bites of food so we were sure she<br/>\nwas being nourished as she played. Honestly, I felt a little nutty doing<br/>\nthis, but after reading so many posts on this subject (on this site) from<br/>\npeople who had been there, I went with it. I&#39;m glad I did. Her gaming has<br/>\nbeen a very positive thing in her life, and by now, she is, for the most<br/>\npart, able to sense herself when she needs to eat/drink/take a break. Had I<br/>\nleft it entirely up to her to follow suggestions we had talked about, I&#39;m<br/>\nnot sure it would have gone this way. She was too young to take full<br/>\nresponsibility for the follow-through. She felt supported in her interest,<br/>\nwe helped her keep her humor so the draining effect was minimized, and when<br/>\nshe was done, she had a mom and/or dad ready to play or snuggle, depending<br/>\non her mood/needs.<br/>\n<br/>\n <br/>\n<br/>\nKelly<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar@earthlink.net","from":"&lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: Krabby Patties, Software Platform and Video games causing stress","postDate":"1259095070","msgId":42164,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPSUVERkRDQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDkxMDc2Mi44NDU3OC5xbUB3ZWIxODAzMDMubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":42161,"nextInTopic":42165,"prevInTime":42163,"nextInTime":42165,"topicId":42148,"numMessagesInTopic":0,"msgSnippet":"... Everybody likes to be served every once in a while. :-) In our house, we have a dynamic where I will ask the kids to serve me. If my oldest is in the","messageBody":"<div id=\"ygrps-yiv-573041395\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; I&#39;m happy to teach him how to warm up some of his own food but for the most part he is uninterested as he likes me to serve him .&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>  Everybody likes to be served every once in a while. :-) In our house, we have a dynamic where I will ask the kids to serve me. If my oldest is in the kitchen and I am busy, I will ask her to bring me stuff or prepare something for me. It isn&#39;t all of the time but it happens. Sometimes they tell me no because it would be too hard. That is okay but I do use it as an opportunity to discuss how important it is to help each other. I also draw a comparison between when they ask me to do stuff for them and I tell them no. Sometimes, I will jokingly tell them, &quot;I&#39;ll remember that the next time you want something.&quot; You have to be careful with that because it can come across as very mean and punitive. We are a very silly family and we joke a lot. Role playing games often times help kids see a different perspective. <br/>\n<br/>\n  I love feeding my family. I am happy to feed them breakfast, lunch and dinner. I gave up making everyone eat at the same time and I am unwilling to keep warming food up. I understand that I am trying to accomodate the various needs in my family. How do I do that without abandoning my own needs? I feel resentful because I think I spend too much of my day catering to their  food whims. I have started saying that I&#39;m happy to make something they want with them. Usually, they decline and either give up on that food or say that I should make it for them. Is it fair that I should do something for them that I don&#39;t necesarily want to do and they have no interest in helping?<br/>\n   <br/>\n<br/>\n  How old are your kids? If you have a microwave, teach them how to warm it up themselves. My 5 year old always wants me to do stuff for her but I am not always able to because she has 3 siblings and I work from home. So, I will talk her through doing things for herself. If she wants something heated up, I will talk her through getting a bowl and putting her food in the bowl and then putting it in the microwave and then pushing the correct buttons. If I am not in a position where I can do it for her or talk her through it, I will give her options of what to eat that she can prepare herself. If she is unwilling to do it herself, then she will have to wait until I am finished with what I am doing. I always try to make sure that there is food in the kitchen that she can get for herself. Sit down with the kids and have a brainstorming session of what they would like to eat and what they can prepare for themselves. My kids can do microwave popcorn by themselves so I make sure that we have it around all of the time. It might mean that you keep snack cakes around or even some cut up fruits and veggies that don&#39;t require any sort of preparation. Can they all reach the plates and eating utensils? Some of the lack of willingness can stem from being unable to physically access what they want. I do tell my kids no but I try to reserve those times for when I am truly busy and unable to do it. I will tell my kids to please come in the kitchen and help. I don&#39;t see anything wrong with that. However, if they are truly busy, I will do it for them because that is the way things work around here. We try to help each other out whenever we can. When do you feel the most resentful? <br/>\n<br/>\n  There is nothing wrong with telling the kids how you feel. Whenever we have a situation that I don&#39;t know how to handle or that makes me feel resentful, I take it to the kids and ask them for ideas. If you see it as a chore and hate doing it, then why would your kids want to do it? <br/>\n<br/>\n  Connie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":294879737,"authorName":"Toby Rosenberg","from":"Toby Rosenberg &lt;philipntoby@...&gt;","profile":"philipntoby@sbcglobal.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Krabby Patties, Software Platform and Video games causing stress","postDate":"1259089723","msgId":42161,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkxMDc2Mi44NDU3OC5xbUB3ZWIxODAzMDMubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDhGMTkzQ0U3LUI1QkEtNEVBQi05MjczLTI3OTVDMEUxQzUxMEB2ZXJpem9uLm5ldD4="},"prevInTopic":42156,"nextInTopic":42164,"prevInTime":42160,"nextInTime":42162,"topicId":42148,"numMessagesInTopic":0,"msgSnippet":"My son definitely gets overly hungry playing/watching videos and then he comes to me screaming and yelling how I m a terrible Mom because I don t feed him.","messageBody":"<div id=\"ygrps-yiv-1315561768\">My son definitely gets overly hungry playing/watching videos and then he comes to me screaming and yelling how I&#39;m a terrible Mom because I don&#39;t feed him. Yes, bringing him food does help. However, it&#39;s only helpful to me if I bring veggies that are not going to make a huge mess. Otherwise, I end up with crumbs ground into our carpet. Today, I&#39;ve been sick. It&#39;s lunchtime.. I warmed up Mac n&#39; Cheese for my 2 year old. I politely asked my son (who had a friend over) to finish the round on the video game and come to eat the food. He completely ignored me. So I came to him a second time and told him to pause it so he could eat. After ignoring me again, I turned off the TV. He didn&#39;t complain. He came upstairs and ate his lunch. Then he noticed a board game out on the table and got involved in it. He&#39;s ate and played for about 45 minutes before returning to the basement for more video games. <br/>\n <br/>\nI&#39;m not saying it&#39;s right that I turned the TV off for him. I just have not found another way that works better for both of us. If I had left the matter alone, he might have gotten hungry in an hour or so. At that point, he would have come looking to me for food and I would have felt resentful.  I don&#39;t want to prepare numerous meals around everyone&#39;s different schedules. In addition, as I mentioned, I am not feeling well and I&#39;m trying to minimize what I need to do.<br/>\n <br/>\nI&#39;m happy to teach him how to warm up some of his own food but for the most part he is uninterested as he likes me to serve him.<br/>\n <br/>\n I love feeding my family. I am happy to feed them breakfast, lunch and dinner. I gave up making everyone eat at the same time and I am unwilling to keep warming food up. I understand that I am trying to accomodate the various needs in my family. How do I do that without abandoning my own needs? I feel resentful because I think I spend too much of my day catering to their  food whims. I have started saying that I&#39;m happy to make something they want with them. Usually, they decline and either give up on that food or say that I should make it for them. Is it fair that I should do something for them that I don&#39;t necesarily want to do and they have no interest in helping?<br/>\n <br/>\nToby<br/>\n <br/>\n<blockquote><span title=\"qreply\"> --- On Tue, 11/24/09, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;<br/>\nSubject: Re: [unschoolingbasics] Re: Krabby Patties, Software Platform and Video games causing stress<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Tuesday, November 24, 2009, 7:04 AM<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\nOn Nov 23, 2009, at 3:25 PM, plaidpanties666 wrote:<br/>\n<br/>\n&gt; With no restrictions at all, Mo takes breaks periodically.<br/>\n<br/>\nBut not all kids will! :-) If someone&#39;s child isn&#39;t, it isn&#39;t because <br/>\nyou&#39;re doing it wrong. It&#39;s because they&#39;re having so much fun that <br/>\nthey don&#39;t notice they&#39;re getting hungry or antsy. I&#39;ve been known to <br/>\ndo the same and I&#39;ve had a lot more practice! ;-)<br/>\n<br/>\nBring them food. Suggest a fun big movement activity when they reach <br/>\na pausing point. Or if the game&#39;s intense or brand new, be with them <br/>\nand be aware of the flow of the game and offer some change up -- or a <br/>\ntrip to the bathroom ;-) -- when they reach a pausing point.<br/>\n<br/>\nIt&#39;s an opportunity to help them find ways to destress that will be <br/>\nuseful even as an adult. *And* it&#39;s an opportunity to figure out ways <br/>\nnot to impose your destress solutions on them and be their partner <br/>\ninstead ;-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Krabby Patties, Software Platform and Video games causing stress","postDate":"1259064244","msgId":42156,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhGMTkzQ0U3LUI1QkEtNEVBQi05MjczLTI3OTVDMEUxQzUxMEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGhlZXIzMitsdW1qQGVHcm91cHMuY29tPg==","referencesHeader":"PGhlZXIzMitsdW1qQGVHcm91cHMuY29tPg=="},"prevInTopic":42153,"nextInTopic":42161,"prevInTime":42155,"nextInTime":42157,"topicId":42148,"numMessagesInTopic":0,"msgSnippet":"... But not all kids will! :-) If someone s child isn t, it isn t because you re doing it wrong. It s because they re having so much fun that they don t notice","messageBody":"<div id=\"ygrps-yiv-1342619687\">On Nov 23, 2009, at 3:25 PM, plaidpanties666 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; With no restrictions at all, Mo takes breaks periodically.<br/>\n<br/>\n </span></blockquote>But not all kids will! :-) If someone&#39;s child isn&#39;t, it isn&#39;t because  <br/>\nyou&#39;re doing it wrong. It&#39;s because they&#39;re having so much fun that  <br/>\nthey don&#39;t notice they&#39;re getting hungry or antsy. I&#39;ve been known to  <br/>\ndo the same and I&#39;ve had a lot more practice! ;-)<br/>\n<br/>\nBring them food. Suggest a fun big movement activity when they reach  <br/>\na pausing point. Or if the game&#39;s intense or brand new, be with them  <br/>\nand be aware of the flow of the game and offer some change up -- or a  <br/>\ntrip to the bathroom ;-) -- when they reach a pausing point.<br/>\n<br/>\nIt&#39;s an opportunity to help them find ways to destress that will be  <br/>\nuseful even as an adult. *And* it&#39;s an opportunity to figure out ways  <br/>\nnot to impose your destress solutions on them and be their partner  <br/>\ninstead ;-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Krabby Patties, Software Platform and Video games causing stress","postDate":"1259007906","msgId":42153,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlZXIzMitsdW1qQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM3MDI5My41NDc1My5xbUB3ZWI4ODAwNy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":42152,"nextInTopic":42156,"prevInTime":42152,"nextInTime":42154,"topicId":42148,"numMessagesInTopic":0,"msgSnippet":"... If the kids aren t enthusiastic about dinner it may be time to rethink how you do that meal, maybe rethink the whole idea of meal time in general. If the","messageBody":"<div id=\"ygrps-yiv-487579215\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, CM Jane Lavineway &lt;jlalbums@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I love the idea of making Krabby patties!  I was just wishing for some fun supper ideas.  My kids seem to dauddle through their supper only to be starved and eat a ton for snack an hour later. When my husband asked why that was, my oldest son said: &quot;because we get to chose what to eat at snack&quot;.  I think he would chose a Krabby pattie.  He loves Sponge Bob.<br/>\n&gt;*******************<br/>\n<br/>\n </span></blockquote>If the kids aren&#39;t enthusiastic about dinner it may be time to rethink how you do that meal, maybe rethink the whole idea of &quot;meal time&quot; in general. If the kids are getting most of their nutrition from snacks, anyway, then provide more snacks - more food readily available all the time. You can have some things the kids like that can be reheated quickly and easily in a microwave for hot dishes, some prepared foods like muffins, and then mixed snack plates with cheese and crackers, fruit, nuts, popcorn, chips... whatever the kids are happy to eat. Its not really that much more prep than trying to make a meal for a family (and you don&#39;t have the aarrgh! factor of kids not eating your labor of love!). Then &quot;dinner&quot; can be tailored to more adult tastes and kids are welcome to join, to sample foods or bring a snack of their own, or just hang out and socialize. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I also had a question about Programming Platforms.  Which one are you referring to?  Where can I download one?<br/>\n </span></blockquote>********************<br/>\n<br/>\nThe on Mo uses is Alice, which is a free &quot;educational&quot; program from Carnegie Melon (and sorry not to have a link at the moment, I&#39;m not at my regular computer). I know there are others out there, some free, some not. Many of the free games sites now have a &quot;make your own game&quot; section where you can create games, too. Check the big ones like Nick Jr and Cartoon Network - Mo goes to those a lot and I&#39;ve seen her create games on one or the other.. maybe both. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I was wondering for those of you who let your children play video games with no restrictions, how do your children deal with the stress?  Do you have any similar problems with stress and fighting after games.  I am sure with no restrictions, my son would play video games all day at the expense of any other physical or mental stimulation. <br/>\n </span></blockquote>*********************<br/>\n<br/>\nWith no restrictions at all, Mo takes breaks periodically. I also bring her snacks if I realize she&#39;s been allllllll wrapped up in a game for awhile. Food helps - a lot of that grouchiness is hunger! Sometimes I invite Mo to come do something fun with me, but she also knows she&#39;s free to run around a bit inside, jump on some of the furniture, etc. So she doesn&#39;t feel &quot;limited&quot; by her own desire to take a break. She can run in cirlces or jump on the chair during a &quot;loading&quot; screen without interrupting her own flow. <br/>\n<br/>\nIn the past, when she was just starting to get into games, we had a lot more big body toys in the living room - not all at once, but one at a time, since our house is small. But we&#39;d have a bouncy ball or a skateboard, or sit-n-spin to entice her to move around a bit. Now if she&#39;s really antsy she&#39;ll go out to the trampoline for awhile, or run around outside. <br/>\n<br/>\nIts really not true to say you &quot;know&quot; your kid would do such-and-such if you lifted all restrictions if you&#39;ve never tried it. There are a whole host of behaivors that happen because of restrictions. Once a person has a chance to live without restrictions those behaviors change dramatically. There&#39;s a transitional period, though, and that&#39;s where its easy to get stuck and say &quot;see? he can&#39;t do it&quot; when what you&#39;re seeing is a whole build up of reactions being worked out of his system.<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":96745299,"authorName":"Professional Parenting","from":"&quot;Professional Parenting&quot; &lt;jarnall@...&gt;","profile":"oooffca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Krabby Patties, Software Platform and Video games causing stress","postDate":"1259004759","msgId":42152,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZmQwMWNhNmM3MyRiN2ZkMjU2MCQ4MzAwYThjMEByZWR3aW5lPg==","referencesHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPTUVDRkRDQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+"},"prevInTopic":42151,"nextInTopic":42153,"prevInTime":42151,"nextInTime":42153,"topicId":42148,"numMessagesInTopic":0,"msgSnippet":"My seven year old loves Krabbie Patties and he makes up the formula! ... Judy Arnall Parenting Speaker, Trainer and Author of Canadian bestseller:  Discipline","messageBody":"<div id=\"ygrps-yiv-1249799995\">My seven year old loves Krabbie Patties and he makes up the formula!<br/>\n<br/>\n-------------------------------------------------------------------------------------------------<br/>\nJudy Arnall<br/>\nParenting Speaker, Trainer and Author of Canadian bestseller:  Discipline Without Distress: 135 <br/>\ntools for raising caring, Responsible children without time-out, spanking, punishment or bribery <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar@earthlink.net","from":"&lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Krabby Patties, Software Platform and Video games causing stress","postDate":"1259004052","msgId":42151,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPTUVDRkRDQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDM3MDI5My41NDc1My5xbUB3ZWI4ODAwNy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":42148,"nextInTopic":42152,"prevInTime":42150,"nextInTime":42152,"topicId":42148,"numMessagesInTopic":0,"msgSnippet":"... fun supper ideas.  My kids seem to dauddle through their supper only to be starved and eat a ton for snack an hour later. When my husband asked why that","messageBody":"<div id=\"ygrps-yiv-1720727254\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; I love the idea of making Krabby patties!  I was just wishing for some<br/>\n </span></blockquote>fun supper ideas.  My kids seem to dauddle through their supper only to be<br/>\nstarved and eat a ton for snack an hour later. When my husband asked why<br/>\nthat was, my oldest son said: &quot;because we get to chose what to eat at<br/>\nsnack&quot;.  I think he would chose a Krabby pattie.  He loves Sponge Bob. &lt;&lt;&lt;&lt;<br/>\n<br/>\nWe always try to include the kids on the decision making when it comes to<br/>\nwhat to have for our meals. We have done breakfast for dinner.  Every now<br/>\nand then, we will do brownies for breakfast where we get up and bake<br/>\nbrownies first thing in the morning. We have bought snack trays and had them<br/>\nfor dinner. We have a joke where we have &quot;duck and fish&quot; (duck under the<br/>\ntable and fish for food), which is just a silly way of saying we are not<br/>\ngoing to cook and will instead all go into the kitchen and pick out whatever<br/>\nwe feel like eating.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt; My oldest loves video games.  I have had to restrict him as he gets<br/>\n </span></blockquote>extremely stressed and agitated when he plays for a long period.  Usually<br/>\nafter he finishes a game he has a lot of pent up energy that he uses to<br/>\nfight with his brother, or act in a very excitable and annoying way.  We<br/>\nhave discussed with him some strategies to release this pent up energy after<br/>\na game including going to the basement to jump, or play a sport.  He hasn&#39;t<br/>\nfollowed through on that.  I was wondering for those of you who let your<br/>\nchildren play video games with no restrictions, how do your children deal<br/>\nwith the stress?  Do you have any similar problems with stress and fighting<br/>\nafter games.  I am sure with no restrictions, my son would play video games<br/>\nall day at the expense of any other physical or mental stimulation.  I just<br/>\ncan&#39;t get past the belief that this is not in a child&#39;s best interest..  How<br/>\ndo you ensure your kids are staying physically fit if they don&#39;t  chose to?<br/>\n&lt;&lt;&lt;&lt;<br/>\n<br/>\nHow old is he? What kind of restrictions do you have?<br/>\n<br/>\nWhen my daughter gets stressed after playing a game, I encourage her to talk<br/>\nabout the game. Sometimes that helps. Encouraging her to tell me about the<br/>\ngame helps bridge the gap between the gaming world and the real world. Part<br/>\nof the problem could be that he is experiencing a let down when he finishes<br/>\na game. You could ask him what game he is going to tackle next. Or, instead<br/>\nof relying on him to follow through, you could help him by trying to engage<br/>\nhim in something physical like racing you to the mail box (he may be too old<br/>\nfor that) or engaging in a friendly pillow fight.<br/>\n<br/>\nIf he is a teenager, then you may just have to back off and quit nagging<br/>\nhim. I am not saying that you are nagging but that could be how he is<br/>\nperceiving it. When I was a teen, if my mom brought something up more than<br/>\ntwice, I felt like she was nagging me and didn&#39;t trust me and it would set<br/>\nup a combative dynamic between us.<br/>\n<br/>\nI see two things going on here. One, some of the frustration could be caused<br/>\nby the limiting. Your son may feel like he can&#39;t finish a game because he<br/>\nalways has to stop according to your whims. With our daughter, she plays<br/>\nmainly computer games. We have a &quot;rule&quot; that applies to everyone and we shut<br/>\nthe network (and computers) down before we go to bed. If she wants to play a<br/>\ngame after that, she can play on her Nintendo DS for as long as she wants.<br/>\nWhen we started that, she would hide in her room and stay on the DS forever.<br/>\nAfter a while, she started coming out into the main room and playing it.<br/>\n<br/>\nDoes he eat while he is playing? Part of the stress and agitation could be<br/>\nhunger. I have to periodically stop my daughter and encourage her to eat<br/>\nsomething because she gets so wrapped up in her games that she forgets to<br/>\neat and then gets agitated and stressed.<br/>\n<br/>\nThis sounds more like your issue than your sons. I am not trying to be mean<br/>\nbut kids are pretty good about regulating themselves when they are given the<br/>\nfreedom to do so. Have you ever played a very stimulating video game? He is<br/>\nprobably getting more mental stimulation from that game then you could ever<br/>\nimagine. To help ease some of my fears (I had a lot of them), I have tried<br/>\nto play video games with my daughter and have her explain the game to me or<br/>\ntell me what the goal of the game is. It is amazing how much kids really do<br/>\nlearn when playing games. Also, depending on the game, some of them require<br/>\na lot of hand eye coordination, which is directly related to physical<br/>\nactivity. If you are not staying home 24/7, then the physical activity<br/>\naspect will eventually work itself out. We are part of a local group that<br/>\nhas park days that we try to attend. When we have days out, we try to pack<br/>\nthem full to make sure that she is getting ample physical activities. We<br/>\nalso try to do stuff to lure her away from the video games. If it doesn&#39;t<br/>\nwork, it isn&#39;t a big deal but sometimes planning another favorite activity<br/>\nwill help her to take a break from the video games.<br/>\n<br/>\nConnie<br/>\n  <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":282596530,"authorName":"CM Jane Lavineway","from":"CM Jane Lavineway &lt;jlalbums@...&gt;","profile":"jlalbums","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"1"},"subject":"Krabby Patties, Software Platform and Video games causing stress","postDate":"1258985089","msgId":42148,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM3MDI5My41NDc1My5xbUB3ZWI4ODAwNy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":42151,"prevInTime":42147,"nextInTime":42149,"topicId":42148,"numMessagesInTopic":0,"msgSnippet":"I love the idea of making Krabby patties!  I was just wishing for some fun supper ideas.  My kids seem to dauddle through their supper only to be starved and","messageBody":"<div id=\"ygrps-yiv-2049533678\">I love the idea of making Krabby patties!  I was just wishing for some fun supper ideas.  My kids seem to dauddle through their supper only to be starved and eat a ton for snack an hour later. When my husband asked why that was, my oldest son said: &quot;because we get to chose what to eat at snack&quot;.  I think he would chose a Krabby pattie.  He loves Sponge Bob.<br/>\n<br/>\nI also had a question about Programming Platforms.  Which one are you referring to?  Where can I download one?<br/>\n<br/>\nMy oldest loves video games.  I have had to restrict him as he gets extremely stressed and agitated when he plays for a long period.  Usually after he finishes a game he has a lot of pent up energy that he uses to fight with his brother, or act in a very excitable and annoying way.  We have discussed with him some strategies to release this pent up energy after a game including going to the basement to jump, or play a sport.  He hasn&#39;t followed through on that.  I was wondering for those of you who let your children play video games with no restrictions, how do your children deal with the stress?  Do you have any similar problems with stress and fighting after games.  I am sure with no restrictions, my son would play video games all day at the expense of any other physical or mental stimulation.  I just can&#39;t get past the belief that this is not in a child&#39;s best interest..  How do you ensure your kids are staying physically fit if they don&#39;t<br/>\n chose to?<br/>\n<br/>\n<br/>\nTo Your Success and Happiness,<br/>\n <br/>\nJane<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":42175,"nextTopicId":42157}}