{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":177721839,"authorName":"Angela S.","from":"&quot;Angela S.&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] games + movies for older kids/adults?","postDate":"1157118843","msgId":17015,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNjQwMWM2Y2RjZSQxODgzMWE0MCQ2NTAwYThjMEBlYm9ueT4=","inReplyToHeader":"PEEwRDE5Qjk4LUI1NzMtNDdFRS1CREQ2LTQ5N0M1QjM3N0M4NkBnbWFpbC5jb20+"},"prevInTopic":17013,"nextInTopic":17017,"prevInTime":17014,"nextInTime":17016,"topicId":17007,"numMessagesInTopic":0,"msgSnippet":"Do you lay with your dd when she goes to sleep or does she go to her own room?  If you sleep with her and if you know she is tired and you go to bed with her,","messageBody":"<div id=\"ygrps-yiv-810177682\">Do you lay with your dd when she goes to sleep or does she go to her own<br/>\nroom?  If you sleep with her and if you know she is tired and you go to bed<br/>\nwith her, you could get back up after.  If she doesn&#39;t think she is missing<br/>\nanything then maybe it won&#39;t matter.  You don&#39;t have to tell her your<br/>\ngetting back up.  But also, maybe once she finds out that she isn&#39;t missing<br/>\nanything that is interesting to her she&#39;ll be ok to go to bed while your<br/>\nstill up.  (my kids don&#39;t want to do that though but I need MORE sleep than<br/>\nthey do so I always go to bed when they do anyway.)  could she fall asleep<br/>\non the couch while you are watching TV?<br/>\n<br/>\n <br/>\n<br/>\nAngela<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a><br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":129999023,"authorName":"John and Amanda Slater","from":"John and Amanda Slater &lt;fourslaterz@...&gt;","profile":"fourslaterz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] going to bed was games + movies for older kids/adults?","postDate":"1157117675","msgId":17017,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwOTAxMTMzNDM1Ljg4Njg4LnFtYWlsQHdlYjUzOTExLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PEEwRDE5Qjk4LUI1NzMtNDdFRS1CREQ2LTQ5N0M1QjM3N0M4NkBnbWFpbC5jb20+"},"prevInTopic":17015,"nextInTopic":0,"prevInTime":17016,"nextInTime":17018,"topicId":17007,"numMessagesInTopic":0,"msgSnippet":"Now that she has no bedtimes, I have the feeling she won t ever want to go to bed before us, at least knowing that we will be awake doing something fun. Recent","messageBody":"<div id=\"ygrps-yiv-622440269\">Now that she has no bedtimes, I have the feeling she won&#39;t ever want  <br/>\n to go to bed before us, at least knowing that we will be awake doing  <br/>\n something fun. <br/>\n<br/>\n   <br/>\n                                                 Recent Activity<br/>\n                          <br/>\n           19<br/>\n       New Members<br/>\n                         <br/>\n           4<br/>\n       New Photos<br/>\n                                                                     <br/>\n                      Visit Your Group           <br/>\n                  SPONSORED LINKS<br/>\n                                     <br/>\n   Home schooling curriculum                     <br/>\n   Parenting issue                     <br/>\n   Home schooling material                     <br/>\n   Home schooling resource                     <br/>\n   Home schooling high school                   <br/>\n       <br/>\n                                                                 Y! GeoCities<br/>\n Share More<br/>\n Create a blog, web<br/>\n site, and more.<br/>\n                  <br/>\n                                              Y! Toolbar<br/>\n   Get it Free!<br/>\n   easy 1-click access<br/>\n   to your groups.<br/>\n                   <br/>\n                                              Yahoo! Groups<br/>\n   Start a group<br/>\n   in 3 easy steps.<br/>\n   Connect with others.<br/>\n                   <br/>\n           <br/>\n          <br/>\n      .<br/>\n <br/>\n  <br/>\n   <br/>\n <br/>\n <br/>\n ****Why would you do something she would view as fun after she goes to bed?  We plan family activities and include the boys.  A movie or a game we would all like.  What would she view as fun?  The idea of watching boring adult tv will cease to be fun when she is allowed to watch things that interest her.  I would try to offer her the same activites during the day or whenever you have more energy.  Put on a bathing suit (or not) and get in the tub with her if she wants.  Whatever activities she feels like she is missing do with her during the day.  When you want to do things with your SO at night, settle her in another room.  Listening to music, playing computer, or watching tv.  At some point you may have to tell her that you have had enough for today.  My boys are 5 and 3, and they know that I sometimes need a break.  Sometimes I can just ask them to play for a few minutes alone, but it often goes much better when I help them.  Like now when they are watching tv and I am<br/>\n on the computer.  I admit sometimes it goes better than others, and you will have to use different strategies with a 1 yo, but think creatively and solutions will come.  <br/>\n   <br/>\n Amanda<br/>\n          <br/>\n \t\t\t\t<br/>\n---------------------------------<br/>\nGet your own web address for just $1.99/1st yr. We&#39;ll help. Yahoo! Small Business.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":280005589,"authorName":"Solé","from":"=?ISO-8859-1?Q?Sol=E9?= &lt;solelokuai@...&gt;","profile":"solelokua","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] games + movies for older kids/adults?","postDate":"1157115742","msgId":17013,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEwRDE5Qjk4LUI1NzMtNDdFRS1CREQ2LTQ5N0M1QjM3N0M4NkBnbWFpbC5jb20+","inReplyToHeader":"PDAwNDQwMWM2Y2RiZiRhZjk0YTVjMCQ2NTAwYThjMEBlYm9ueT4=","referencesHeader":"PDAwNDQwMWM2Y2RiZiRhZjk0YTVjMCQ2NTAwYThjMEBlYm9ueT4="},"prevInTopic":17010,"nextInTopic":17015,"prevInTime":17012,"nextInTime":17014,"topicId":17007,"numMessagesInTopic":0,"msgSnippet":"Hello, (thank you Angela for both of your replies :-)) ... Yeah, I asked a few days ago here if I should tell her officially that we were unschooling now and","messageBody":"<div id=\"ygrps-yiv-1024260878\">Hello,<br/>\n<br/>\n(thank you Angela for both of your replies :-))<br/>\n<br/>\nAm 01.09.2006 um 14:10 schrieb Angela S.:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am not sure if you just told your dd that she has no rules now  <br/>\n&gt; that you<br/>\n&gt; are unschoolers or what but it can be VERY overwhelming for a child  <br/>\n&gt; with a<br/>\n&gt; lot of rules to all of a sudden have no rules. It works much better  <br/>\n&gt; if you<br/>\n&gt; just start saying yes more often to things you might have said no  <br/>\n&gt; to before<br/>\n&gt; without having thought about it. &quot;Can I stay up to finish watching  <br/>\n&gt; this<br/>\n&gt; show?&quot; YES &quot;Will you stay with me while I go to sleep?&quot; Sure.<br/>\n&gt;<br/>\n&gt; Angela<br/>\n<br/>\n </span></blockquote>Yeah, I asked a few days ago here if I should tell her &quot;officially&quot;  <br/>\nthat we were unschooling now and that there would be no rules. People  <br/>\ntold me to just say yes more and to  not use arbitrary &quot;nos&quot;, and  <br/>\nsuggested that only if she asks we should tell her. So I did, and  <br/>\nthat was actually also in my mind. But a day after my question in the  <br/>\nlist, she actually asked me, wondering &quot;where do you have that all  <br/>\nfrom?? why am I allowed to do xx and yy?&quot; So I told her that we have  <br/>\nbeen informing ourselves about new ways of raising our children and  <br/>\nthat we wanted our children to grow up in freedom. We talked a bit  <br/>\nabout it and although I never said anything about lifting rules, she  <br/>\nkind of derived from our conversation that it would be so. She&#39;s very  <br/>\nclever :-) Before yesterday for example, she happily helped us  <br/>\ncleaning the kitchen, drying the dishes. My boyfriend had to suddenly  <br/>\ntak care of ds (1) who needed to be fed and whatever. And so she  <br/>\nsaid, hey, where is Maurice?? He should be helping us! or something  <br/>\nlike that. Then I said, well, he has to take care of ds. And then she  <br/>\nsaid &quot;nobody HAS to do ANYTHING!!!... (actually my bf and I  <br/>\nafterwards commented that she&#39;s been saying that a few times and she  <br/>\nalways SHOUTS it out loud, as to tell the WHOLE world, that she is  <br/>\nFREE now :-) Which we kind of like).. then I was like err err..  <br/>\nhum... well yeah.. and I remembered Joyce Fetterols Website where  <br/>\nsomewhere it is written that we should be aware of the fact that  <br/>\nactually, we don&#39;t HAVE to clean up, etc, we CHOOSE to, because we  <br/>\ndon&#39;t want the (natural) consequences to happen. So I told her, well  <br/>\nyeah, he doesn&#39;t HAVE to but he doesn&#39;t want to hear ds whining and  <br/>\nso on. But from then on I understood that she kind of &quot;got&quot; it  <br/>\nalready without us saying anything. Maybe I shouldn&#39;t have said  <br/>\nanything about &quot;freedom&quot;, but I was really unprepared brecause I  <br/>\ndidn&#39;t expect such a question so quickly. Probably she wondered  <br/>\ninstantly because before we had a million rules. *Sigh* what can we  <br/>\ndo now?<br/>\n<br/>\nNow that she has no bedtimes, I have the feeling she won&#39;t ever want  <br/>\nto go to bed before us, at least knowing that we will be awake doing  <br/>\nsomething fun. Buhuhu, I want my own freedom back ;-) But I can never  <br/>\ngo back to coercive methods again because now they seem very cruel to  <br/>\nme. And I believe it is the best for my child and how can I just do  <br/>\nsomething which is not the best, only because I&#39;m too lazy?<br/>\n<br/>\nMaybe you have suggestions how to clean up what I messed up already...<br/>\n<br/>\nJohanna</div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela S.","from":"&quot;Angela S.&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] games + movies for older kids/adults?","postDate":"1157112659","msgId":17010,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDQwMWM2Y2RiZiRhZjk0YTVjMCQ2NTAwYThjMEBlYm9ueT4=","inReplyToHeader":"PEJGRjE0MUJCLURGQUQtNEJGMi1CNTA5LTY1QkY3MTgxRjBCM0BnbWFpbC5jb20+"},"prevInTopic":17007,"nextInTopic":17013,"prevInTime":17009,"nextInTime":17011,"topicId":17007,"numMessagesInTopic":0,"msgSnippet":"Sole, It sounds as if you are reading about Unschooling as if there are some rules to follow and if you just follow them correctly, you ll get the results you ","messageBody":"<div id=\"ygrps-yiv-1380251196\">Sole,<br/>\n<br/>\nIt sounds as if you are reading about Unschooling as if there are some rules<br/>\nto follow and if you just follow them correctly, you&#39;ll get the results you<br/>\nwant and that some of us already have.  The problem is, you have to listen<br/>\nto your child.  Your child is telling you (not in words maybe) that the Sims<br/>\ngame bothers her.  Can you help her to understand (through regular talking<br/>\nduring other times) that the Sims thief isn&#39;t real and that even though<br/>\nthere are some thieves in real life it&#39;s unlikely that they&#39;ll ever come to<br/>\nyour house.  My kids always worked through things that bothered them by play<br/>\nacting.  Maybe you could take turns playing the thief if you think it&#39;ll<br/>\nwork for her.  <br/>\n<br/>\n <br/>\n<br/>\n It sounds like she is sort of rebelling against rules you have had and<br/>\nwanting to do things that were once off limits but not with really making<br/>\nconscious choices about what she wants to do.  If you know scary movies will<br/>\nbother her, tell her that but not in a way that makes her think you are the<br/>\nknow it all and she doesn&#39;t know enough, but in a way that you would a<br/>\nfriend who doesn&#39;t like scary movies.  My kids, who have been free to watch<br/>\nas much TV and whatever, since they were maybe 4 and 6 years old (I began by<br/>\njust saying yes more when they asked to watch and it was Arthur and animal<br/>\nplanet that they liked) have never decided to watch scary movies just<br/>\nbecause they could. They have no interest in any movies that are overtly<br/>\nsexual and they say yuck and close their eyes when people kiss.  (They are<br/>\nalmost 10 and 11.75)  Despite their freedoms they aren&#39;t drawn to porn, soft<br/>\nor not.  (actually they don&#39;t know it exists)  They aren&#39;t drawn to scary<br/>\nmovies and they know that I don&#39;t warm them off a show for any other reason<br/>\nthan having their best interests at heart.<br/>\n<br/>\n <br/>\n<br/>\nI am not sure if you just told your dd that she has no rules now that you<br/>\nare unschoolers or what but it can be VERY overwhelming for a child with a<br/>\nlot of rules to all of a sudden have no rules.  It works much better if you<br/>\njust start saying yes more often to things you might have said no to before<br/>\nwithout having thought about it.  &quot;Can I stay up to finish watching this<br/>\nshow?&quot;  YES  &quot;Will you stay with me while I go to sleep?&quot;  Sure.  <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\nAngela<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a> <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":280005589,"authorName":"Solé","from":"=?ISO-8859-1?Q?Sol=E9?= &lt;solelokuai@...&gt;","profile":"solelokua","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"games + movies for older kids/adults?","postDate":"1157107222","msgId":17007,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJGRjE0MUJCLURGQUQtNEJGMi1CNTA5LTY1QkY3MTgxRjBCM0BnbWFpbC5jb20+"},"prevInTopic":0,"nextInTopic":17010,"prevInTime":17006,"nextInTime":17008,"topicId":17007,"numMessagesInTopic":0,"msgSnippet":"Hey again... ...and then we have another problem. Of course, she s been playing computer ALL day long. That s no problem and she needs to catch up. I really","messageBody":"<div id=\"ygrps-yiv-1747145433\">Hey again...<br/>\n<br/>\n...and then we have another problem. Of course, she&#39;s been playing  <br/>\ncomputer ALL day long. That&#39;s no problem and she needs to catch up. I  <br/>\nreally don&#39;t mind. BUT I read in unschooling sites that we shouldn&#39;t  <br/>\nrestrict the *kind* of games either (for instance violent games). Nor  <br/>\nthe kind of TV programs even if they are for adults (?) We really  <br/>\ndon&#39;t know how to handle this because... for instance, we don&#39;t have  <br/>\nany violent games and she wouldn&#39;t want them now either, but we have  <br/>\nThe Sims for instance, a game which I enjoy very much as well. But  <br/>\nthere is a thief with a mini-bag who comes and puts extremely big  <br/>\nthings in his very small bag. She played that all day long and really  <br/>\nenjoyed it, but now she is afraid that this thief with a small bag  <br/>\nwould come. She was even afraid to talk about it loud, because she  <br/>\nthought he could hear us form outside. Now The Sims is rather  <br/>\nharmless! In the game, you can have a an alarm and then the police  <br/>\nautomatically comes. Now she said, we didn&#39;t even have an alarm. I  <br/>\ndon&#39;t want to buy an alarm now, this was really somethign we never  <br/>\nwanted because we hate security freaks who close everything 5 times  <br/>\nand everythign, i don&#39;t want to imprison myself, and plus, it&#39;s  <br/>\nexpensive. We do have a little &quot;chain&quot; to double lock the door which  <br/>\nwe never use. But yesterday we used it, extra for her. Now I&#39;m  <br/>\nthinking, THe Sims is SO harmless, she cannot even handle that, how  <br/>\nwill she handle other more scary games. And with TV, my boyfriend  <br/>\nasked if she could watch everything for adults as well. I said that I  <br/>\nwasn&#39;t sure and so on, I guessed yes. We are absolutely SURE that as  <br/>\nsoon as her computer catching-up need is over, she will switch to TV  <br/>\nand she WILL stop at (soft)-pornographic programs (which are on  <br/>\nnormal TV very late at night) and/or scary movies! Then SHE said, she  <br/>\n&quot;liked&quot; scary movies. Well... maybe she does but she is already  <br/>\nscared of a stupid unrealistic comic style thief with mini bags! I  <br/>\ndidn&#39;t even know how I could help her with her fear because just  <br/>\nsaying &quot;there is no thief&quot; is not helpful at all, and also, the  <br/>\npossibility that a real thief comes is not high, but there is a  <br/>\nchance, so it&#39;s a lie anyway. The chain didn&#39;t help (and what if he  <br/>\nhas something to destroy it?), and that we could call the police  <br/>\nneither (and what if we don&#39;t hear him?) and that we didn&#39;t have  <br/>\nanyting worth stealing neither (and what if he steals me?) and so  <br/>\non... How could I explain there are no aliens and all the other  <br/>\nunrealistic scary things there might be??<br/>\n<br/>\nThank you<br/>\nJohanna<br/>\n<br/>\n(dd 7 yrs)</div>","specialLinks":[]}],"prevTopicId":16989,"nextTopicId":17002}}