{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Greetings!  New with a few questions","postDate":"1286126487","msgId":44927,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4YWUybitxYmVsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk4YWRpcys4bWxzQGVHcm91cHMuY29tPg=="},"prevInTopic":44926,"nextInTopic":0,"prevInTime":44926,"nextInTime":44928,"topicId":44916,"numMessagesInTopic":0,"msgSnippet":"Ack! Sorry! I Still don t have the hang of the laptop! anyone know how to disable hot keys ? anyway, here s the link I didn t add: ","messageBody":"<div id=\"ygrps-yiv-768977603\">Ack! Sorry! I Still don&#39;t have the hang of the laptop! anyone know how to disable &quot;hot keys&quot;? <br/>\n<br/>\nanyway, here&#39;s the link I didn&#39;t add:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<br/>\nand I wanted to comment on this:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;&gt;One example would be the ability to evaluate the credibility and recognize biases in the media.<br/>\n </span></blockquote>****************<br/>\n<br/>\nThis is a good example of one of the &quot;gaps&quot; in conventional education, because it doesn&#39;t give people the tools to do this at all. <br/>\n<br/>\nPeople pursuing their interests, however, are more likely to dig down into topics - why does this source say one thing and this other something different? That comes up even reading fiction - if something, say the French Revolution, is mentioned in one context and then you read about it in another with a different viewpoint, it sparks questions. Questions are good things! <br/>\n<br/>\nIf your son is very discriminating about what he reads - say he questions what he reads about history and science and wants to see a variety of sources - then that&#39;s because the topic is of interest to him. You can&#39;t Give someone that kind of interest and curiosity, though, no matter how good, how well tailored, the curriculum. At best you can get someone to parrot some predigested answers about the relative perspectives on this or that - but you&#39;ll be pulling your hair out if what you really want is some original thought and analysis because that Only comes with personal interest.</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Greetings!  New with a few questions","postDate":"1286125980","msgId":44926,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4YWRpcys4bWxzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk4OHA2OCt0Y2FkQGVHcm91cHMuY29tPg=="},"prevInTopic":44924,"nextInTopic":44927,"prevInTime":44925,"nextInTime":44927,"topicId":44916,"numMessagesInTopic":0,"msgSnippet":"... **************** Have you read about deschooling yet? It can take a year or more for kids to go from the narrowed down set of interests that come from","messageBody":"<div id=\"ygrps-yiv-715335979\">&quot;Natasha&quot; &lt;casaknox@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I think part of my problem is that I somehow expected that when I stepped out of the driver&#39;s seat, there would be an instantaneous transformation, and she would suddenly develop a whole bunch of interests that she had had before just by sheer virtue of the fact that she was no free to explore her interests<br/>\n </span></blockquote>****************<br/>\n<br/>\nHave you read about deschooling yet? It can take a year or more for kids to go from the narrowed down set of interests that come from imposed learning to *starting* to branch out on their own. But if ballet continues to be her passion in a year, branching out could look like wanting to see examples of modern dance or getting interested in ballet costumes - it may be all ballet all the time for years! But you can&#39;t study ballet without learning about mathematics and history and politics and music and literature and and and....<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;One example would be the ability to evaluate the credibility and recognize biases in the media.<br/>\n </span></blockquote>***************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Hello Meredith,<br/>\n&gt; <br/>\n&gt; Thanks for your thoughtful reply to my post, and the link.  Some of your conclusions were not quite right, however, many of them were bang on, and what&#39;s more, your perceptiveness helped me to realize certain biases that I&#39;m harbouring, that I wasn&#39;t even aware of, so I thank you for that.<br/>\n&gt; <br/>\n&gt; I think part of my problem is that I somehow expected that when I stepped out of the driver&#39;s seat, there would be an instantaneous transformation, and she would suddenly develop a whole bunch of interests that she had had before just by sheer virtue of the fact that she was no free to explore her interests, that whole bunch of stuff would just crop up.  And when that didn&#39;t happen, I was confused and upset.  I realize now, how ridiculous and unfair it is.  It was a hidden expectation that I didn&#39;t even realize that I had until I started trying to articulate my concerns.<br/>\n&gt; <br/>\n&gt; ****What any person does for pleasure is also a source of learning. What does she enjoy reading?****<br/>\n&gt; <br/>\n&gt; She pretty much reads the same five or six books over and over again, and has been doing so for the past two years.  On the one hand, I was much like that as a child.  I enjoyed reliving my favorite stories again and again, so I understand where she&#39;s coming from in the regard, but on the other hand, I do wish she were open to incorporating additional books.  I have suggested and brought home literally hundreds of books for her of all genres - particularly her favorite genre which is light humour/family, and she refuses to even crack the cover of most of them.  I&#39;ll read with her at bedtime, as a low key way of introducing the books, but never ceases to amaze me how few of them actually capture her interest enough that she will continue reading them on her own.  <br/>\n&gt; <br/>\n&gt; ****We&#39;re trained to value the &quot;well rounded education&quot;*** <br/>\n&gt; <br/>\n&gt; I do in fact value a well rounded education, though not in the traditional academic sense.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ***Unschooling won&#39;t guarantee a well rounded education. If that&#39;s your goal, then unschooling probably isn&#39;t for you. ***<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; This is a good point, and one which I need to carefully consider, and will be painstakingly working through over the next year or so.  I do value a well rounded education in areas that I consider important, which are not necessarily academic, but if learned well, have the potential to contribute to academic success, but do not have to be applied in that manner.  One example would be the ability to evaluate the credibility and recognize biases in the media.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Greetings!  New with a few questions","postDate":"1286117486","msgId":44923,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRDMxMjE5NkE1QTAyQy0xQUI0LTFCNkFEQHdlYm1haWwtbTAxMS5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PDdEMEI0MEE0MUI1NDRCM0E4Q0ExRDc1QzJBMENBMkIzQENvbm5pZVBDPg==","referencesHeader":"PGk4ODduMCtrZjJuQGVHcm91cHMuY29tPiA8N0QwQjQwQTQxQjU0NEIzQThDQTFENzVDMkEwQ0EyQjNAQ29ubmllUEM+"},"prevInTopic":44922,"nextInTopic":44924,"prevInTime":44922,"nextInTime":44924,"topicId":44916,"numMessagesInTopic":0,"msgSnippet":"... you feel that unschooling is a beneficial for all children, or has it been your experience that a more guided and structured approach would be beneficial","messageBody":"<div id=\"ygrps-yiv-749574082\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Has anyone had these fears when transitioning to an unschooling approach? Do <br/>\n </span></blockquote>you feel that unschooling is a beneficial for all children, or has it been your <br/>\nexperience that a more guided and structured approach would be beneficial for <br/>\ncertain children?&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<br/>\n<br/>\nBallet. You think she can&#39;t learn all she ever needs to know by studying ballet? My son learn everything he needed to know by studying magic, then by skateboarding, then by filmmaking, drumming, travelling, outdoor leadership, farming, and writing.<br/>\n<br/>\n<br/>\nEACH of those things seemed like THE thing he was going to do/be for the rest of his life. Right now, at 22, he&#39;s writing a novel based on his travels and experiences. (And he was not made to read or write from 13-18! He said he hated reading and writing after we pulled him from school and said that he would never read or write again, and *I* couldn&#39;t make him!) He totally immersed himself in each of those things to the exclusion of everything else. He lived and breathed each one at the time. And we treated each one as THE lifelong passion/future career we thought it was. It was absolutely the best decision we could have made.<br/>\n<br/>\n<br/>\nLet&#39;s say she *does* become a ballerina. With ABT or the Royal Ballet. Leting her---and *encouraging* her to dance, dance, dance will be the best preparation you can give her.<br/>\n<br/>\n<br/>\nLet&#39;s say she drops it like a hot potato in six months (like Cameron). She still will have learned sooo much, and she will know her own limitations. She will have met people brilliant in their related fields---set designers, costume designers, choreographers, photographers, critics, musicians, composers, and managers, as well as other ballerinas. She might find that she prefers one of those other careers even more than actual dancing.<br/>\n<br/>\n<br/>\nIf YOU will assist her in immersing herself in ballet, she will learn all the school required subjects, just not in the same way. She&#39;ll learn to read and write (buy her ballet magazine subscriptions and books about dance and dancers, encourage her to write different dancers and tell them how beautiful and athletic she thinks they are), math (dancing IS math, but there&#39;s also buying those new toe shoes every other month and how much that new tutu costs), social studies (dance throughout the ages and from all over the world, dance as recreation and therapy, dancers as a social rung), science (physics! and geometry). She WILL learn these things---sespecially if you help her *explore* dance rather than pooh-pooh it as &quot;not academic&quot; enough.<br/>\n<br/>\n<br/>\nFind books and magazine (reading). Watch movies: White Nights, The Turning Pointe, Fed and Ginger (backwards and in high heels!), Dirty Dancing, Footloose, Flashdance, Strictly Ballroom, Save the Last Dance, Billy Elliot, Amadeus (*tiny* dance scene, but worth the history!). Attend every ballet within a 12 hour drive (and watch all the learning that happens during THAT trip!). Sign her up for special weekend intensives with some top dance teachers/choreographers. Put a huge mirror and ballet barre in her bedroom or in the basement/attic---and don&#39;t forget the hardwood flooring! Go to dance clothing stores and try on every leotard.<br/>\n<br/>\n<br/>\nImmerse her in ballet. You WON&#39;T be disappointed. She WILL be learning---and waaaay more than through some text book. It&#39;s just up to you to see the learning that happens while she&#39;s happily bathing in dance.<br/>\n<br/>\n<br/>\nShe&#39;s unschooling already. *You&#39;re* the problem that must be tackled! &lt;g&gt; <br/>\n<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Greetings!  New with a few questions","postDate":"1286115361","msgId":44922,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRDMxMUNBNDY0OUNCOC0xQUI0LTFBRjZCQHdlYm1haWwtbTAxMS5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PGk4OXBzditvZW9lQGVHcm91cHMuY29tPg=="},"prevInTopic":44921,"nextInTopic":44923,"prevInTime":44921,"nextInTime":44923,"topicId":44916,"numMessagesInTopic":0,"msgSnippet":"So I wrote this: Dear Mom and Dad, I love you. I don t like it when you tell me what to do. Please stop doing that.  Thanks. Love, Elli ps. Sometimes I want","messageBody":"<div id=\"ygrps-yiv-1979060628\">So I wrote this:<br/>\n<br/>\nDear Mom and Dad,<br/>\n<br/>\nI love you.<br/>\n<br/>\nI don&#39;t like it when you tell me what to do.<br/>\n<br/>\nPlease stop doing that.  Thanks.<br/>\n<br/>\nLove,<br/>\n<br/>\nElli<br/>\n<br/>\nps. Sometimes I want your advice.  When I do, I will let you know.<br/>\n<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nThat&#39;s BRILLIANT!<br/>\n<br/>\n<br/>\nOne of the things I tell parents with meddling grandparents is to ask the Grands: &quot;Do you think you did a good job raising and parenting ME? Do you think I am a capable adult because of the way you reared me?&quot;<br/>\n<br/>\n<br/>\nIf the answer is yes, say, &quot;Then you need to trust me to do what *I* think is best. Back off and let me parent and educate MY children the way my spouse and I choose.&quot;<br/>\n<br/>\n<br/>\nIf they answer no, say, &quot;Then you need to back WAY off and not perpetuate the inadequate example that was set for me! It must stop NOW!&quot;<br/>\n<br/>\n<br/>\nEither way, YOU (and your kids) win!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Greetings!  New with a few questions","postDate":"1286114823","msgId":44921,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdEMEI0MEE0MUI1NDRCM0E4Q0ExRDc1QzJBMENBMkIzQENvbm5pZVBDPg==","inReplyToHeader":"PGk4ODduMCtrZjJuQGVHcm91cHMuY29tPg==","referencesHeader":"PGk4ODduMCtrZjJuQGVHcm91cHMuY29tPg=="},"prevInTopic":44920,"nextInTopic":44922,"prevInTime":44920,"nextInTime":44922,"topicId":44916,"numMessagesInTopic":0,"msgSnippet":"From: Natasha Sent: Saturday, October 02, 2010 4:20 PM To: unschoolingbasics@yahoogroups.com Subject: [unschoolingbasics] Greetings! New with a few questions ","messageBody":"<div id=\"ygrps-yiv-1445138422\">From: Natasha <br/>\nSent: Saturday, October 02, 2010 4:20 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSubject: [unschoolingbasics] Greetings! New with a few questions<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;Has anyone had these fears when transitioning to an unschooling approach? Do you feel that unschooling is a beneficial for all children, or has it been your experience that a more guided and structured approach would be beneficial for certain children?&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I think most parents have these fears no matter what learning method their child is using. Unschooling can be a bit scarier than some learning methods because there aren&#39;t any tests to prove that your child is learning. I went through 12+ years of public schooling and have forgotten most of what I learned. I feel like most of my learning began after I got out of graduate school because only then was I able to freely explore topics that interested me. <br/>\n<br/>\nWhen I began to deliberately unschool, I was very afraid that my daughter wasn&#39;t learning what I felt she needed to learn. She wanted to spend all day on the computer playing one particular game. I was kind of freaked out about it until I sat down and really watched what she was doing. I took the time to sit down and write out everything that she was learning. I was really surprised to see that she was learning math, business, economics, and a host of other things. As a result of her computer time, she is an excellent speller and can type 25 words a minute. (My husband and I took an online test to see how fast we could type out of curiosity and she wanted to do it too.) Now she tests herself regularly to see if she can get any better. It&#39;s weird because she is only 9 and knows about stuff that is pretty advanced. She probably doesn&#39;t know the stuff that other 9 year olds know but that doesn&#39;t matter because she is not other 9 year olds. She is herself with her own interests, likes, and dislikes. <br/>\n<br/>\nIf your daughter loves ballet, feed that passion. She may continue to love it for a while or she may lose interest. Either way, go with it. My middle daughter&#39;s love for Pokemon has sprouted into her learning things that I never could have imagined. It does take an effort on my part to quell my fears at times. Whenever I get uptight or worried, I quietly sit back and watch and take stock. I would think that there would be a lot of valuable skills to be learned from ballet. Body movement and body awareness is a valuable thing to have. Knowing all of the different dance moves and dance techniques is something else that she is learning. Every dance class that I have been in relies heavily on counting. Cooperation is another skill that is very valuable and might even be more important than some of the academic skills. As a librarian, I can say that the ability to read for pleasure is just as important as the ability to read for information. If you can read for pleasure, then reading is seen as something that is fun and it makes it a lot easier when you do want to actually read for information. Your daughter may not be reading for information right now because she may not have had the need yet. After I got out of school, reading for pleasure and for information became one in the same. Schools and traditional thinking are what has separated reading into pleasure vs. information. Both are equally as important. You might try to look into doing some research on Gardner&#39;s theory of multiple intelligences. The basic theory is that everyone has a different learning style and would be better served if they were allowed to learn using their strength. Here is a link with some of the basics: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.tecweb.org/styles/gardner.html\">http://www.tecweb.org/styles/gardner.html</a> Reading some information about it might make you feel better about letting your daughter focus on ballet. I have had to do a lot of reading to help me deconstruct my ideas about the importance of academics.<br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\n<br/>\nNo virus found in this incoming message.<br/>\nChecked by AVG - www.avg.com <br/>\nVersion: 9.0.856 / Virus Database: 271.1.1/3173 - Release Date: 10/02/10 13:05:00<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":237471585,"authorName":"Elli","from":"&quot;Elli&quot; &lt;elinorsparks@...&gt;","profile":"sistergoddesselli","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Greetings!  New with a few questions","postDate":"1286105823","msgId":44920,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4OXBzditvZW9lQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk4ODduMCtrZjJuQGVHcm91cHMuY29tPg=="},"prevInTopic":44919,"nextInTopic":44921,"prevInTime":44919,"nextInTime":44921,"topicId":44916,"numMessagesInTopic":0,"msgSnippet":"Hi Natasha - I d like to share how I approached my mother.  She lives in town with my dad.  Both played a big role in our lives as babysitters when our kids","messageBody":"<div id=\"ygrps-yiv-1165841890\">Hi Natasha - <br/>\n<br/>\nI&#39;d like to share how I approached my mother.  She lives in town with my dad.  Both played a big role in our lives as babysitters when our kids were young.  We started homeschooling when the kids were in 7 and 10.  They are now 9 and 12.  We started unschooling within the first month of homeschooling.  I love it.  But my parents don&#39;t.  They were teachers and my extended family is filled with educators.  My parents have been eager to offer their unsolicited opinions about the topic.  I&#39;ve not been interested in hearing their thoughts on the subject.  And my kids have been confused by their meddling.  <br/>\n<br/>\nI am using harsh words in describing their behavior.  I know.<br/>\n<br/>\nThings came to a head this summer when my parents sent me and my hubby a letter stating that it was time for us to get the kids back in school.  They wrote that it didn&#39;t matter which school - public or private - they would support us in what ever way they could, although they couldn&#39;t help with tuition.  <br/>\n<br/>\nIt took me a while to move through my emotions but when I did I was ready to hear the loving guidance of my daughter, &quot;Mommy, you always tell me to treat others in the way I would want to be treated, so talk to Grandma in the way you&#39;d want someone to talk to you.&quot; <br/>\n<br/>\nSo I wrote this:<br/>\n<br/>\nDear Mom and Dad,<br/>\n<br/>\nI love you.<br/>\n<br/>\nI don&#39;t like it when you tell me what to do.<br/>\n<br/>\nPlease stop doing that.  Thanks.<br/>\n<br/>\nLove,<br/>\n<br/>\nElli<br/>\n<br/>\nps. Sometimes I want your advice.  When I do, I will let you know.<br/>\n<br/>\nI sent this letter (which is precisely the way I would want my daughter to let me know that I had overstepped her boundaries by given her unsolicited advice.)<br/>\n<br/>\nAnd my parents didn&#39;t say a thing.  Although...recently they purchased a subscription to Smithsonian Magazine for us.  Strewing!!  They are helping out by strewing!!  Brilliant!!<br/>\n<br/>\nI am so glad I found a way to express my boundaries to them, and to say it in a way that communicated my love for them.<br/>\n<br/>\nBest wishes!<br/>\n<br/>\n- Elli<br/>\n<br/>\nps. my kids explore the world in completely different ways.  At first it was so much fun to watch my daughter dive into life as an unschooler.  She spent the first 7 months making videos - acting, filming, directing, posting on line.  I am an artist and her approach made sense to me and made me feel proud.  I loved bragging about her exploration to others.  My son just played video games. Yikes is what I thought about him.  And, oh, I am so embarrassed - all day video games - yuck - who can brag about that. <br/>\n<br/>\nI&#39;ve since learned that it is not my role to brag about either one of them.  They are doing and learning and having fun and loving each other and us and life is good because we&#39;ve stopped trying to control them.  They have their own things they want to explore and they do so in their own ways.  We live life as if school didn&#39;t exist.  &quot;Life is the classroom, Love is the lesson&quot; is one of my favorite un-schooling bumper stickers.<br/>\n<br/>\nI&#39;ve been able to see the brilliance of each.<br/>\n<br/>\nI just read a quote that sums it up for me:<br/>\n<br/>\n&quot;Everybody is a genius. But if you judge a fish by its ability to climb a tree, it will live its whole life believing that it is stupid.&quot;<br/>\n<br/>\nâ&quot; Albert Einstein<br/>\n<br/>\nI&#39;d caution you against judging your daughter and her approach to life and learning.</div>","specialLinks":[]},{"userId":458570010,"authorName":"Natasha","from":"&quot;Natasha&quot; &lt;casaknox@...&gt;","profile":"natashaknox2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Greetings!  New with a few questions","postDate":"1286072328","msgId":44924,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4OHA2OCt0Y2FkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk4OGdidCtnY29kQGVHcm91cHMuY29tPg=="},"prevInTopic":44923,"nextInTopic":44926,"prevInTime":44923,"nextInTime":44925,"topicId":44916,"numMessagesInTopic":0,"msgSnippet":"Hello Meredith, Thanks for your thoughtful reply to my post, and the link.  Some of your conclusions were not quite right, however, many of them were bang on,","messageBody":"<div id=\"ygrps-yiv-885268394\">Hello Meredith,<br/>\n<br/>\nThanks for your thoughtful reply to my post, and the link.  Some of your conclusions were not quite right, however, many of them were bang on, and what&#39;s more, your perceptiveness helped me to realize certain biases that I&#39;m harbouring, that I wasn&#39;t even aware of, so I thank you for that.<br/>\n<br/>\nI think part of my problem is that I somehow expected that when I stepped out of the driver&#39;s seat, there would be an instantaneous transformation, and she would suddenly develop a whole bunch of interests that she had had before just by sheer virtue of the fact that she was no free to explore her interests, that whole bunch of stuff would just crop up.  And when that didn&#39;t happen, I was confused and upset.  I realize now, how ridiculous and unfair it is.  It was a hidden expectation that I didn&#39;t even realize that I had until I started trying to articulate my concerns.<br/>\n<br/>\n****What any person does for pleasure is also a source of learning. What does she enjoy reading?****<br/>\n<br/>\nShe pretty much reads the same five or six books over and over again, and has been doing so for the past two years.  On the one hand, I was much like that as a child.  I enjoyed reliving my favorite stories again and again, so I understand where she&#39;s coming from in the regard, but on the other hand, I do wish she were open to incorporating additional books.  I have suggested and brought home literally hundreds of books for her of all genres - particularly her favorite genre which is light humour/family, and she refuses to even crack the cover of most of them.  I&#39;ll read with her at bedtime, as a low key way of introducing the books, but never ceases to amaze me how few of them actually capture her interest enough that she will continue reading them on her own.  <br/>\n<br/>\n****We&#39;re trained to value the &quot;well rounded education&quot;*** <br/>\n<br/>\nI do in fact value a well rounded education, though not in the traditional academic sense.<br/>\n<br/>\n<br/>\n***Unschooling won&#39;t guarantee a well rounded education. If that&#39;s your goal, then unschooling probably isn&#39;t for you. ***<br/>\n<br/>\n<br/>\nThis is a good point, and one which I need to carefully consider, and will be painstakingly working through over the next year or so.  I do value a well rounded education in areas that I consider important, which are not necessarily academic, but if learned well, have the potential to contribute to academic success, but do not have to be applied in that manner.  One example would be the ability to evaluate the credibility and recognize biases in the media.</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Greetings!  New with a few questions","postDate":"1286063293","msgId":44919,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4OGdidCtnY29kQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk4ODduMCtrZjJuQGVHcm91cHMuY29tPg=="},"prevInTopic":44916,"nextInTopic":44920,"prevInTime":44918,"nextInTime":44920,"topicId":44916,"numMessagesInTopic":0,"msgSnippet":"... ***************** Changing the way you think about learning is a good thing! This might help: http://sandradodd.com/checklists If your dd is intersted in","messageBody":"<div id=\"ygrps-yiv-928760503\">&quot;Natasha&quot; &lt;casaknox@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I am trying to think about the learning process in a different way, however, I do often get concerned about the gaps that are already starting to emerge in her learning, since I stopped coercing her into doing things like math workbooks.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nChanging the way you think about learning is a good thing! This might help:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/checklists\">http://sandradodd.com/checklists</a><br/>\n<br/>\nIf your dd is intersted in ballet, let her live and breathe ballet. Get her movies and books about ballet and balerinas, take her to as many shows as you possibly can, ask what kinds of music she likes and get her more of it. Look into ballerinas like Kate Bush who started writing music or rethinking dance because the traditional stuff didn&#39;t work for them. But all of this only if she wants - don&#39;t make it a big &quot;unit study&quot; make it about feeding her passion. What lights her up? Give her more of that. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Although she is a strong reader, she reads exclusively for pleasure, rather than information.<br/>\n </span></blockquote>***************<br/>\n<br/>\nThere&#39;s a gap in your understanding of learning, right there. What any person does for pleasure is also a source of learning. What does she enjoy reading? I read a lot of light fantasy fiction for pleasure and have learned about history, philosophy, mechanics, art, sociology, etiquette, heraldry, latin, falconry... And I&#39;ve learned a whole heck of a lot about writing itself, about grammer, scene and setting, characterization, plot, foreshadowing... All that stuff that seemed dry and dull and flowed in one ear and out on the test papers in school fascinates me in the context of things I like to read. Let her read for fun! Fun is a big part of how people learn naturally. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Her preferred method of acquiring information seems to be experiential<br/>\n </span></blockquote>***************<br/>\n<br/>\nIf she Enjoys reading, then this isn&#39;t true - she simply doesn&#39;t enjoy reading things you consider informational or educational. So don&#39;t worry about her &quot;only&quot; learning experientially. <br/>\n<br/>\nThat being said, there&#39;s a whole lot of value in experiential learning. Some things are best learned experientially - ballet&#39;s a good example. The thing about experiential learning is that it is frequently very scientific - very experimental. From the perspective of a parent, that can be pretty intimidating because She&#39;s the one making the hypotheses and testing them out and it will be hard for you to know how to help her for awhile. It can help to step back a little and try to get a sense of her process so that you can discover what Will help. Maybe getting her more resources. Maybe taking her places. Maybe listening to her complain when she tries something and it doesn&#39;t work out the way she wants. Don&#39;t Look for science, though! Look for a kid who always seems to want to do things her way first - that&#39;s what I mean by scientific and experimental. You can tell her what you think all you want, but that&#39;s just your hypothesis. She&#39;ll be running her own tests, thank you. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I do often get concerned about the gaps that are already starting to emerge in her learning<br/>\n </span></blockquote>****************<br/>\n<br/>\nYour son has gaps in his learning, too - you&#39;ve just learned to value some kinds of learning over others. You see workbook math as more significant than the mathematics of timing, the geometry of pose, and the calculus of moving an articulated curve in three dimension. You see &quot;literature&quot; as more important than &quot;recreational reading&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Has anyone had these fears when transitioning to an unschooling approach?<br/>\n </span></blockquote>*************<br/>\n<br/>\nMost parents do. We&#39;re trained to value the &quot;well rounded education&quot; - the very education college professors and employers complain leaves enormous gaps in a young adult&#39;s knowledge. <br/>\n<br/>\nUnschooling won&#39;t guarantee a well rounded education. If that&#39;s your goal, then unschooling probably isn&#39;t for you. It Is good for a person who &quot;learns differently&quot; who learns experientially and dives in deep to her passions. Unschooling could be absolutely the best thing for your daughter - but it depends a whole lot on you trusting that her natural learning process contains exaclty what she needs for Her to learn about the world. <br/>\n<br/>\n---Meredith (Mo 9, Ray 17)</div>","specialLinks":[]},{"userId":458570010,"authorName":"Natasha","from":"&quot;Natasha&quot; &lt;casaknox@...&gt;","profile":"natashaknox2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Greetings!  New with a few questions","postDate":"1286054432","msgId":44916,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4ODduMCtrZjJuQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":44919,"prevInTime":44915,"nextInTime":44917,"topicId":44916,"numMessagesInTopic":0,"msgSnippet":"Hello everyone, I m Natasha.  I have three children ds 10, dd 8, and ds 2.  We have been homeschooling since day one, and have taken a fairly ecclectic","messageBody":"<div id=\"ygrps-yiv-742845106\">Hello everyone,<br/>\n<br/>\nI&#39;m Natasha.  I have three children ds 10, dd 8, and ds 2.  We have been homeschooling since day one, and have taken a fairly ecclectic approach.  <br/>\n<br/>\nI&#39;m trying a few new things this year, one of which is to eliminate all coercive elements to my children&#39;s learning (aside from insisting that they follow through on their commitments and promises).  <br/>\n<br/>\nDs 10, is very much an autodidact.  He&#39;s interested in many different areas, and he dives in.  My role in his learning, is largely just teaching him how to access various resources in support of his diverse interests, helping him with time management and planning, and occasionally encouraging him to persist when he hits a rough spot and feels like giving up.  <br/>\n<br/>\nDd 8, learns differently.  She basically only has one interest (ballet).  When it comes to ballet, she would train all day if I let her, but at her age, I have concerns about the potential damage that she could do to her body by dancing even more than she already does.  Other than that, I have not succeeded in piquing her interest in anything else.  Although she is a strong reader, she reads exclusively for pleasure, rather than information.  Her preferred method of acquiring information seems to be experiential, and her preference is so strong, that she doesn&#39;t seem to have a secondary learning method. <br/>\n<br/>\nI&#39;m losing my resolve to unschool - at least for her.  It is easy for me to stand behind unschooling philosophy with ds because of his way of learning and natural curiosity for, and love of traditional academic subjects.  I am trying to change my own heart and mind.  I am trying to think about the learning process in a different way, however, I do often get concerned about the gaps that are already starting to emerge in her learning, since I stopped coercing her into doing things like math workbooks.  This uncertainty is compounded by my mother&#39;s (retired public school teacher, with whom we share a home) unsolicited input and criticism.  <br/>\n<br/>\nHas anyone had these fears when transitioning to an unschooling approach?  Do you feel that unschooling is a beneficial for all children, or has it been your experience that a more guided and structured approach would be beneficial for certain children?</div>","specialLinks":[]}],"prevTopicId":44925,"nextTopicId":44844}}