{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":245967711,"authorName":"whisperingoaks2","from":"&quot;whisperingoaks2&quot; &lt;lindamgreen@...&gt;","profile":"whisperingoaks2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"reading/writing with little children--some thoughts","postDate":"1164033195","msgId":19091,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVqc2ViYitndHM3QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":19090,"nextInTime":19092,"topicId":19091,"numMessagesInTopic":0,"msgSnippet":"My favorite quote from John Holt is:  If we tried to teach kids to talk, they would never learn. With that in mind, here are some thoughts on reading/writing","messageBody":"<div id=\"ygrps-yiv-1368554347\">My favorite quote from John Holt is:  &quot;If we tried to teach kids to talk, they would never <br/>\nlearn.&quot;    <br/>\n<br/>\n With that in mind, here are some thoughts on reading/writing with little children from my <br/>\nown exprience.   Let me know if this is helpful.      <br/>\n<br/>\nWhen my son was little, my husband and I looked at books with him and read to and with <br/>\nhim from the time he had any interest (pre-toddler) until he lost interest (about age 5 or 6) <br/>\nin doing this together.    We had no tv, and our favorite thing was the 3 of us cuddling up <br/>\ntogether and reading children&#39;s books together.   We always had a stack from the library, <br/>\nand I was very choosy in picking them out.    I figured that if I loved the book, our son <br/>\nwould love it too, and if it looked boring to me, it would not attract him either.  I looked <br/>\nfor illustrations that charmed me and I loved text that had dialog and sounds, or had a <br/>\nrhythm and a beat.  There were a few books that illustrated songs, which we sang to him, <br/>\nas well as other songs.   Mother Goose books seemed to have a special attraction, with <br/>\ntheir short poetry and catchy rhythm and rhyme, as well as sharing part of our heritage.   <br/>\nWe did this only when our son wanted to, which he usually did.  This was a very close, <br/>\nspecial and loving time we all three had together and we did it &#39;most every day and <br/>\nspontaneously whenever we could.  <br/>\n<br/>\n (If you have your own Mother Goose, or any beautiful book with short rhymes, or <br/>\ncharming short stories, which you often read --or sing--together, then when the child is <br/>\ninterested in looking at the words, he will already know what the words are, which will <br/>\nhelp him later decipher the &quot;reading code&quot;.  The rhyming aspect is a special attraction to <br/>\nlistening to and remembering the words.)  <br/>\n<br/>\nAnd I don&#39;t remember exactly what we did with alphabet books, but I have had these <br/>\nthoughts about them since:   That a beautifully illustrated alphabet book of some kind is a <br/>\ntreasure to have in one&#39;s own library.  (I was browsing through our local megabookstore <br/>\nrecently and had difficulty finding either a good Mother Goose or a good alphabet book.)     <br/>\nI think  it is best if an alphabet book includes lower case letters, as the recognition of and <br/>\nsound of the lower case letters is much more helpful than the name of capital letters.  <br/>\n(That is, I think it&#39;s a general principle to give the child the most useful information first. )    <br/>\nFor example, instead of focusing on &quot;D&quot; and saying &quot;dee&quot;, you could focus on &quot;d&quot; and say <br/>\n&quot;duh&quot; to identify that symbol.  (Keep the &quot;uh&quot; short, as it&#39;s not really part of &quot;d&quot;.)  This is <br/>\nnot &quot;teaching reading&quot;, but it&#39;s identifying symbols just like you would identify a cow or a <br/>\nchair.  And this does have an advantage in that the child has a leg up when he is ready to <br/>\n&quot;read&quot;.     <br/>\n<br/>\nAlso, if the child is sounding out words, it might be helpful for the adult to know to <br/>\nverbalize, if it comes up, that besides  regular &quot;sound out&quot; words, there are sit-together <br/>\nletters that make one sound (like &quot;sh&quot;), and there are puzzle words that are impossible to <br/>\nsound out.     (Readers know this but some might not have thought about it or how to say <br/>\nit to a child.)    I don&#39;t even know when our son &quot;learned to read&quot;, as we had no concern <br/>\nabout it and we just shared things about words whenever it came up.  (However, he did <br/>\nread early, which I think is an advantage because reading is such fun and it builds <br/>\nconfidence.)   I guess what I&#39;m trying to say is that learning to read is not really an event--<br/>\nit&#39;s a gestation process over years that starts in infancy with speech and progresses <br/>\nthrough the little child&#39;s intense desire to explore everything and know what everything is, <br/>\nincluding what those little squiggles are on signs and notes and computers and tv and <br/>\neverywhere in our environment that relate to speech.   <br/>\n<br/>\nAlso, if your family is writing notes to each other and writing in other ways, the little child <br/>\nis likely to &quot;write&quot; too, as they pick up whatever is in their environment.    A lot of you are <br/>\nprobably writing a daily journal of activities (which is one way to meet homeschooling <br/>\nrequirements in my state).    Also, I find writing a note is a great way to get out feelings <br/>\nwhen there is anger or frustration between people.   In a note, you can say all you want to <br/>\nsay without being interrupted, and it gives people a space between in which to calm down <br/>\nand reflect.   And about writing, a huge mistake most schools make is to make the child <br/>\ncorrect spelling which quickly shuts down any desire for the child to write.   This is <br/>\nequivalent to saying, &quot;Don&#39;t talk until you can say the words correctly&quot;, which would make <br/>\na child mute fast.    My experience is that spelling mainly corrects itself over time and <br/>\nexperience, but it can always be addressed specifically at some later point if desired.   But, <br/>\nas I see it, speaking, writing and reading are all different aspects of the same bag which <br/>\nthe little child tends to naturally absorb together from the environment--whatever is <br/>\nhappening a lot all around him over a long period of time. <br/>\n<br/>\nLinda</div>","specialLinks":[]}],"prevTopicId":18964,"nextTopicId":19017}}