{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":186887125,"authorName":"Claudia","from":"&quot;Claudia&quot; &lt;claudia2@...&gt;","profile":"aquacat59","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Réf. : Re: [unschoolingbasics] help","postDate":"1095340983","msgId":3188,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxNDk5M0I3LjAwMDAwMS4wMzk2OEBDQUxJPg==","referencesHeader":"PDAwNGMwMWM0OWJlZiRkYzViNWE4MCQwMjAwYThjMEB5b3VybzBrd2t3OWp3Yz4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":3187,"nextInTime":3189,"topicId":3188,"numMessagesInTopic":0,"msgSnippet":"I like your input, Julie :)))) Thanks Claudia ... De : unschoolingbasics@yahoogroups.com Date : 09/16/04 15:20:08 A : unschoolingbasics@yahoogroups.com Sujet :","messageBody":"<div id=\"ygrps-yiv-2059361190\">I like your input, Julie :)))) Thanks\r<br/>\n\r<br/>\nClaudia\r<br/>\n\r<br/>\n\r<br/>\n \r<br/>\n-------Message original-------\r<br/>\n \r<br/>\nDe : unschoolingbasics@yahoogroups.com\r<br/>\nDate : 09/16/04 15:20:08\r<br/>\nA : unschoolingbasics@yahoogroups.com\r<br/>\nSujet : Re: [unschoolingbasics] help\r<br/>\n \r<br/>\nThis is probably going to get me in trouble here but I can&#39;t say that I<br/>\nwould just sit and swallow everything if someone (anyone, adults included)<br/>\nwas continually yelling and screaming at me when I was doing my best to try<br/>\nand help them.\r<br/>\n\r<br/>\nThe occassional meltdown or even not so occassional I can do.  My 5yo can be<br/>\none to go off on people over and over again for the slightest provocation so<br/>\nI understand where Sheree is coming from.\r<br/>\n\r<br/>\nI think I would do the things I can think of to help out...offering limited<br/>\nchoices to help with decision making, making sure there was cuddle time,<br/>\ntrying to listen through the anger....but if it went on and on, I would<br/>\nprobably remove myself from the situation.\r<br/>\n\r<br/>\nExample:  Dan (5) had gotten to where no matter what anyone did if they<br/>\nweren&#39;t reading his mind and knowing just exactly what he wanted done, he<br/>\nwould yell at them, throw things, call them names, etc..  I can usually make<br/>\na joke and get him out of it but he was doing it to the other kids in the<br/>\nfamily as well.  It wasn&#39;t fair for the other 5yo to be hit or yelled at<br/>\nbecause she did something that was perceived by Dan as a slight of some kind<br/>\n\r<br/>\n\r<br/>\nSo I stopped Dan in the beginning of one of his torrents and said &quot;It is ok<br/>\nto be mad or sad.  You can come to me and I will hug you and rub your back<br/>\nuntil you feel better but it is absolutely not ok to scream and yell at<br/>\npeople.&quot;  and I bearhugged him and walked off.\r<br/>\n\r<br/>\nSince then, he comes runnning to me out of the blue a lot and just hugs me<br/>\nfor a minute and says he loves me and runs back off to play.  He still has<br/>\nmeltdowns ever so often but he really is trying to use me as a resource.\r<br/>\n\r<br/>\nJust a thought.\r<br/>\n\r<br/>\nJulie S.\r<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- \r<br/>\n  From: Sherri-Lee Pressman \r<br/>\n  To: unschoolingbasics@yahoogroups.com \r<br/>\n  Sent: Wednesday, September 15, 2004 4:13 PM\r<br/>\n  Subject: RE: [unschoolingbasics] help\r<br/>\n\r<br/>\n\r<br/>\n  Hi Julie,\r<br/>\n\r<br/>\n  I have said &quot;what would you like?&quot; because if we don&#39;t start with that and\r<br/>\n  she has something in mind, she gets very angry at us having the nerve to\r<br/>\n  suggest anything. So that is the first question. If she has nothing in<br/>\nmind\r<br/>\n  then she says &quot;I don&#39;t know&quot; and I start making suggestions. I always tell\r<br/>\n  her what I am having first, because she often wants that too and then I<br/>\nonly\r<br/>\n  have to make one thing. If it is rejected, then I offer other  things to<br/>\nher\r<br/>\n  as you suggest.\r<br/>\n\r<br/>\n  Thanks for the ideas, they confirmed what I was doing in that department<br/>\nwas\r<br/>\n  ok at least:)\r<br/>\n\r<br/>\n  Sherri-Lee\r<br/>\n  Need safe and natural health products?\r<br/>\n  http://www.aloeessence.com\r<br/>\n\r<br/>\n  -----Original Message-----\r<br/>\n  From: J. Stauffer [mailto:jnjstau@...] \r<br/>\n  Sent: Wednesday, September 15, 2004 5:55 AM\r<br/>\n  To: unschoolingbasics@yahoogroups.com\r<br/>\n  Subject: Re: [unschoolingbasics] help\r<br/>\n\r<br/>\n  &lt;&lt;&lt;&lt;And with giving her more choices, she seemed to be less capable of\r<br/>\n  dealing with them, almost overwhelmed by them (which still might be the<br/>\ncase\r<br/>\n  I guess)I was thinking of pulling back on that.&gt;&gt;&gt;&gt;\r<br/>\n\r<br/>\n  I don&#39;t know how you are handling this but open-ended questions can be\r<br/>\n  overwhelming for young kids, like &quot;what would you like for breakfast?&quot;,\r<br/>\n  particularly kids not used to making those kinds of decisions or that are\r<br/>\n  currently stressed.\r<br/>\n\r<br/>\n  You might try offering her a couple of options and if those don&#39;t appeal<br/>\nto\r<br/>\n  her, perhaps a couple of more options, like &quot;How about oatmeal or<br/>\ncheerios?&quot;\r<br/>\n\r<br/>\n  Just a thought.\r<br/>\n\r<br/>\n  Julie S.\r<br/>\n\r<br/>\n\r<br/>\n    ----- Original Message ----- \r<br/>\n    From: Sherri-Lee Pressman \r<br/>\n    To: unschoolingbasics@yahoogroups.com \r<br/>\n    Sent: Tuesday, September 14, 2004 11:22 PM\r<br/>\n    Subject: RE: [unschoolingbasics] help\r<br/>\n\r<br/>\n\r<br/>\n    Robyn,\r<br/>\n\r<br/>\n    What a fantastic post, this is exactly what I needed to hear.\r<br/>\n\r<br/>\n    I *knew* her behaviour was age appropriate, not pleasant but not\r<br/>\n  surprising\r<br/>\n    for her age. I just didn&#39;t expect it to feel so personal. I guess that<br/>\nis\r<br/>\n    increased by my pregnancy hormones.\r<br/>\n\r<br/>\n    I read your post this morning and it energized me for our day. We had a\r<br/>\n  much\r<br/>\n    better day and in fact I managed to have more energy and a more positive\r<br/>\n    approach. She asked me to get her water, when it was inconvenient for me\r<br/>\n  and\r<br/>\n    not her, I just did it. The surprise and pleasure in her voice was\r<br/>\n    noticeable. Did it make her feel special?\r<br/>\n\r<br/>\n    She did  not speak in an angry or demanding tone so I didn&#39;t have to\r<br/>\n  ignore\r<br/>\n    it, but perhaps that was because I wasn&#39;t so impatient.\r<br/>\n\r<br/>\n    Yes I am overwhelmed and feeling a bit resentful. Thank you for\r<br/>\n  articulating\r<br/>\n    it because it helped me to see it. My dh, works very hard and in my\r<br/>\n  opinion,\r<br/>\n    doesn&#39;t do all he could around here to help with the parenting. I don&#39;t\r<br/>\n    expect him to do housework or anything but he goes in fits and spurts in\r<br/>\n  his\r<br/>\n    parenting interests and that does add to my stress. Lately however, he<br/>\nhas\r<br/>\n    been pitching in more without my having to ask and that has helped a lot<br/>\n\r<br/>\n  He\r<br/>\n    spends time with her each morning wrestling and playing and then time<br/>\nwith\r<br/>\n    her again each evening after dinner. This is new and has been very\r<br/>\n    appreciated. I told him that today and he seemed to appreciate me saying\r<br/>\n    that and did even more today.\r<br/>\n\r<br/>\n    I met with a woman yesterday to come in and help with house stuff after\r<br/>\n  the\r<br/>\n    baby comes, but decided we will get her in once a week starting now to<br/>\ndo\r<br/>\n    house cleaning, laundry, making beds etc. So that is a good decision<br/>\nthat\r<br/>\n  I\r<br/>\n    am sure will help.\r<br/>\n\r<br/>\n    It is good to hear the indecisiveness is normal too... still frustrating\r<br/>\n  but\r<br/>\n    reassuring. It can really get to me, cause I really don&#39;t care what<br/>\ncolour\r<br/>\n    of hair she gives polly pocket when she is playing on the website you\r<br/>\n  know?\r<br/>\n    Maybe it is her way of trying to get me involved with what she is doing?\r<br/>\n\r<br/>\n    I am breathing... and trying to not expect respect from her... that<br/>\nseems\r<br/>\n    harder when you are feeling resentful right? Ok... thank you SO much for\r<br/>\n    your thoughts on this, it really was so helpful to come downstairs to<br/>\nread\r<br/>\n    this this morning, AND to hear it will pass hopefully fairly soon:) \r<br/>\n\r<br/>\n    I was beginning to think that this behaviour was a result of our shift<br/>\nto\r<br/>\n    unschooling as it was the only big change I could think of that we had\r<br/>\n  done\r<br/>\n    recently. And with giving her more choices, she seemed to be less<br/>\ncapable\r<br/>\n  of\r<br/>\n    dealing with them, almost overwhelmed by them (which still might be the\r<br/>\n  case\r<br/>\n    I guess)I was thinking of pulling back on that.\r<br/>\n\r<br/>\n    Anyway, thank you again for your help today,\r<br/>\n\r<br/>\n    Sherri-Lee\r<br/>\n    Need safe and natural health products?\r<br/>\n    http://www.aloeessence.com\r<br/>\n    -----Original Message-----\r<br/>\n    From: Robyn Coburn [mailto:dezigna@...] \r<br/>\n    Sent: Tuesday, September 14, 2004 3:14 AM\r<br/>\n    To: unschoolingbasics@yahoogroups.com\r<br/>\n    Subject: RE: [unschoolingbasics] help\r<br/>\n\r<br/>\n    &lt;&lt;&lt;Hannah (4.5) has become the most difficult, uncooperative, unpleasant\r<br/>\n    child\r<br/>\n    for me to be around and it seems so specific to me. Maybe she is mad at\r<br/>\n  me.\r<br/>\n    mad about the baby she has been looking forward to? About my lack of\r<br/>\n  energy\r<br/>\n    in the last month?\r<br/>\n    Situations: unless I give her exactly what she wants when she wants it<br/>\nshe\r<br/>\n    screams and yells at me &quot;you promised&quot; (even if I didn&#39;t), &quot;you have to&quot;<br/>\n\r<br/>\n    &quot;but I WANNNTTTTT  you to/it&quot; etc. Anything I say &quot;no&quot; to is greeted<br/>\nwith\r<br/>\n    screaming and hollering and yelling and the biggest temper tantrums she\r<br/>\n  has\r<br/>\n    ever had&gt;&gt;&gt;&gt;&gt;\r<br/>\n\r<br/>\n    If you read some of the Child Development books (eg: &quot;Child Behavior<br/>\nfrom\r<br/>\n    one til ten&quot; or &quot;Your Four Year Old&quot; by Louise Ames) from Gessell\r<br/>\n  Institute\r<br/>\n    (and don&#39;t read the school preparedness chapters because they are\r<br/>\n    irrelevant, and ignore the Cry it out sleep suggestions obviously) you<br/>\nmay\r<br/>\n    be relieved to learn that they consider much of this type of behavior\r<br/>\n    typical of 4.5 year olds. Whether their suggestions are of any use to<br/>\nyou\r<br/>\n    would be another matter.\r<br/>\n\r<br/>\n    Jayn (4.75) does many, in fact almost all of the same obnoxious<br/>\nbehaviors,\r<br/>\n    but in your case I would guess that they are being exacerbated by your\r<br/>\n  very\r<br/>\n    pregnant situation - both in terms of your emotionally vunerable state,\r<br/>\n    physical energy limitations, and Hannah&#39;s possible regressive reaction<br/>\nto\r<br/>\n    the upcoming baby.\r<br/>\n\r<br/>\n    &lt;&lt;&lt;&lt; I can&#39;t really say yes to everything. I try to say yes often, but\r<br/>\n    I just can&#39;t and won&#39;t say yes to every demand of hers. And that is how\r<br/>\n  they\r<br/>\n    are issued these days. demands. not asking: &quot;mommy do this!&quot; &quot;mommy I<br/>\nneed\r<br/>\n    this&quot; &quot;mommy I can&#39;t do this&quot; (with the assumption that I will just<br/>\n*know*\r<br/>\n    what to do to fix it and then if I go and do something it is the wrong\r<br/>\n  thing\r<br/>\n    (no matter what I do) and she screams at me for that too.&gt;&gt;&gt;&gt;\r<br/>\n\r<br/>\n    Look really hard at the &quot;no&#39;s&quot; you are saying. There is a huge<br/>\ndifference\r<br/>\n    between &quot;can&#39;t&quot; and &quot;won&#39;t&quot;. \r<br/>\n\r<br/>\n    If you can, absolutely ignore the demanding tone of voice and fulfill<br/>\nthe\r<br/>\n    request cheerfully anyway, which is what I do mostly with Jayn. It does\r<br/>\n  take\r<br/>\n    the wind out of the incipient meltdown a lot of the time. Sometimes I\r<br/>\n    mention in passing that she sounded really demanding or angry to me when\r<br/>\n  she\r<br/>\n    spoke, but I never reply in kind to her. \r<br/>\n\r<br/>\n    When she has an angry blasting meltdown, I let Jayn&#39;s anger just bounce\r<br/>\n  off\r<br/>\n    me, like a beach ball you aren&#39;t catching - it will get less (or impinge\r<br/>\n  on\r<br/>\n    you less). I&#39;m talking about &quot;detachment&quot; from her emotions, NOT<br/>\nignoring\r<br/>\n    her or her requests. Just not allowing her frenzy to get me upset, while\r<br/>\n    still validating emotions back - &quot;you sound very angry/frustrated&quot;. She\r<br/>\n  will\r<br/>\n    go on and I will say something very neutral like &quot;What a shame.&quot; It<br/>\nhelps\r<br/>\n    her go through the meltdown, and restore her own balance. \r<br/>\n\r<br/>\n    Sometimes I also remind Jayn to take some deep breaths if she is<br/>\nstarting\r<br/>\n  to\r<br/>\n    get angry. Sometimes her only relief is still to shriek. One good one<br/>\nand\r<br/>\n    she is often better.\r<br/>\n\r<br/>\n    &lt;&lt;&lt;She is asking me to do so much more for her too (is this also in\r<br/>\n  reaction\r<br/>\n    to\r<br/>\n    the baby coming?) &quot;mommy get me some water&quot; even though she is standing\r<br/>\n  with\r<br/>\n    her cup right beside the water tower and I have just sat down at the\r<br/>\n    opposite end of the room. Am I really supposed to get up and get that<br/>\nfor\r<br/>\n    her? Every 10 minutes there is a new demand more food, more water, more\r<br/>\n  toys\r<br/>\n    all something I have to do for her, &gt;&gt;&gt;\r<br/>\n\r<br/>\n    There is a lot of overwhelm and resentment coming through in your post -\r<br/>\n    lot&#39;s of emphatic negative words. Are you getting enough help with the<br/>\nday\r<br/>\n    to day stuff like the housework? Are you getting any support from dh for\r<br/>\n    your emotional ups and downs as hormones shift? Are you trying to do too\r<br/>\n    much, when all you want to do is sit and contemplate the new baby? If<br/>\nyou\r<br/>\n    can find a way to transfer responsibility for everything other than<br/>\nHannah\r<br/>\n    and your own immediate comfort to someone else (a temporary house<br/>\ncleaning\r<br/>\n    service? Ordering in dinner? Paying someone to come in and do the<br/>\nlaundry?\r<br/>\n    Home delivery of groceries?) maybe you won&#39;t feel so overwhelmed. \r<br/>\n\r<br/>\n    &lt;&lt;&lt;&lt;and yet she has developed and complete\r<br/>\n    inability to making decisions. She wants me to pick her clothes and then\r<br/>\n    rejects everything I chose. When I ask her to do it. no she can&#39;t make a\r<br/>\n    decision. She will just say &quot;I am hungry&quot; and I am supposed to mind read\r<br/>\n  and\r<br/>\n    know what she wants, because she can&#39;t decide, but every thing I suggest\r<br/>\n  is\r<br/>\n    rejected. When I give up after I run out of suggestions, we have another\r<br/>\n    melt down and anger at me and her screaming that she can&#39;t decide and I\r<br/>\n  have\r<br/>\n    to do it for her. Hell we even had a melt down today because she couldn<br/>\nt\r<br/>\n    decide which toys to bring with us to the grocery store and wanted me to\r<br/>\n    decide for her. She wants me to do all these things, but if I try to\r<br/>\n  explain\r<br/>\n    anything to her about anything, she screams at me &quot;I don&#39;t want to hear\r<br/>\n  you\r<br/>\n    now&quot;.&gt;&gt;&gt;&gt;&gt;\r<br/>\n\r<br/>\n    This indecisiveness is also a kind of normal development phase with some\r<br/>\n    personalities, according to what I have read, although she *is*\r<br/>\n    communicating clearly and definitively when she says she &quot;doesn&#39;t want<br/>\nto\r<br/>\n    hear you now&quot;. Short phrases, not long reasoned explanations, might be<br/>\nthe\r<br/>\n    solution here. As much as you may want her to understand where you are\r<br/>\n    coming from, emotionally or intellectually, it shouldn&#39;t be her\r<br/>\n    responsibility to have to do so. She may feel your explaining as an\r<br/>\n    emotional burden.\r<br/>\n\r<br/>\n    One of the things I do with Jayn when she is rejecting all the\r<br/>\n  possibilities\r<br/>\n    for say a snack, is just let it go, with &quot;well I don&#39;t know dear. What<br/>\ndo\r<br/>\n    you think?&quot; or &quot;That&#39;s all we have.&quot; Then I wait it out. Usually she<br/>\nsoon\r<br/>\n    after comes back with the phrase, &quot;I guess I could have .....&quot;. Waiting\r<br/>\n    (without engaging) for the readiness to decide, with or without the\r<br/>\n  meltdown\r<br/>\n    behavior, can seem like an eternity. It really is less time than you\r<br/>\n  think.\r<br/>\n\r<br/>\n\r<br/>\n    Just because she is screaming that you have to do it for her, doesn&#39;t<br/>\nmean\r<br/>\n    you actually do have to decide for her. She really won&#39;t choose to<br/>\nstarve.\r<br/>\n\r<br/>\n    &lt;&lt;&lt;If I go on the phone she starts making noise, after being quiet for\r<br/>\n    hours,&gt;&gt;&gt;&gt;\r<br/>\n\r<br/>\n    Are you interacting with her when she is quietly playing, or only in\r<br/>\n    response to her getting loud or initiating requests? Jayn sometimes\r<br/>\n  doesn&#39;t\r<br/>\n    like it when my attention is diverted from her by the phone, but<br/>\nsometimes\r<br/>\n  I\r<br/>\n    just have to stick my finger in my spare ear, momentarily, when it is a\r<br/>\n    business call for dh (usually just taking a quick message). If she has\r<br/>\n  been\r<br/>\n    playing quietly, I sometimes forget that she may be viewing me as an\r<br/>\n    audience to her fantasy play and sees the phone as an interruption of<br/>\nour\r<br/>\n    &quot;conversation&quot;. I ask her to please be quiet - I have to say that<br/>\nusually\r<br/>\n    she subsides to a point. However I rarely make outgoing calls without\r<br/>\n  first\r<br/>\n    negotiating with her for some time to do so.\r<br/>\n\r<br/>\n    &lt;&lt;&lt;&lt;&lt;if I start to talk to my dh, she starts to sing loud so we can&#39;t<br/>\nhear\r<br/>\n    eachother, or talking or screaming about something. If I want to watch a\r<br/>\n    show, after hours of her watching her shows, she all of a sudden starts\r<br/>\n    talking and talking out loud about everything possible as loud as\r<br/>\n    possible.&gt;&gt;&gt;&gt;\r<br/>\n\r<br/>\n    Jayn switches the set off repeatedly - so we have stopped engaging in<br/>\nthat\r<br/>\n    particular battle. Dh goes to watch in the other room. I have just<br/>\nbecome\r<br/>\n    resigned to recording everything I hope to view. Sometimes if I put on a\r<br/>\n  DVD\r<br/>\n    for her, I can go to the bedroom and watch TV with dh for a while. In\r<br/>\n  terms\r<br/>\n    of interrupting our conversations, it is usually because Jayn is after<br/>\nhis\r<br/>\n    attention rather than mine. Could your dh give her some intense playing\r<br/>\n    attention for a while in the evening when you are most drained?\r<br/>\n\r<br/>\n    &lt;&lt;&lt;How do I handle this and respect her and me.\r<br/>\n    Cause I don&#39;t feel very respected or respectful right now.&gt;&gt;&gt;&gt;\r<br/>\n\r<br/>\n    Breathe and try to stay centered. One thing may be to stop expecting\r<br/>\n    &quot;respect&quot; from her. The idea behind modeling respectful treatment of her\r<br/>\n  and\r<br/>\n    the other family members to each other, is that *eventually* she will<br/>\nalso\r<br/>\n    behave that kind way automatically and naturally. She is behaving 4.5 at\r<br/>\n  the\r<br/>\n    moment. It will pass. Jayn is already less obnoxious than she was three\r<br/>\n    months ago. \r<br/>\n\r<br/>\n    This is going to sound dumb, but try and get some rest, OK?\r<br/>\n\r<br/>\n    Robyn L. Coburn \r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n    ---\r<br/>\n    Outgoing mail is certified Virus Free.\r<br/>\n    Checked by AVG anti-virus system (http://www.grisoft.com).\r<br/>\n    Version: 6.0.752 / Virus Database: 503 - Release Date: 9/3/2004\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n    Yahoo! Groups Links\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n          Yahoo! Groups Sponsor \r<br/>\n                ADVERTISEMENT\r<br/>\n               \r<br/>\n         \r<br/>\n         \r<br/>\n\r<br/>\n\r<br/>\n <br/>\n----------------------------------------------------------------------------\r<br/>\n  --\r<br/>\n    Yahoo! Groups Links\r<br/>\n\r<br/>\n      a.. To visit your group on the web, go to:\r<br/>\n      http://groups.yahoo.com/group/unschoolingbasics/\r<br/>\n        \r<br/>\n      b.. To unsubscribe from this group, send an email to:\r<br/>\n      unschoolingbasics-unsubscribe@yahoogroups.com\r<br/>\n        \r<br/>\n      c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of<br/>\nService.\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n  [Non-text portions of this message have been removed]\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n  Yahoo! Groups Links\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n        Yahoo! Groups Sponsor \r<br/>\n              ADVERTISEMENT\r<br/>\n             \r<br/>\n       \r<br/>\n       \r<br/>\n\r<br/>\n\r<br/>\n-----------------------------------------------------------------------------<br/>\n\r<br/>\n  Yahoo! Groups Links\r<br/>\n\r<br/>\n    a.. To visit your group on the web, go to:\r<br/>\n    http://groups.yahoo.com/group/unschoolingbasics/\r<br/>\n      \r<br/>\n    b.. To unsubscribe from this group, send an email to:\r<br/>\n    unschoolingbasics-unsubscribe@yahoogroups.com\r<br/>\n      \r<br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n[Non-text portions of this message have been removed]\r<br/>\n\r<br/>\n\r<br/>\nYahoo! Groups Sponsor\r<br/>\nADVERTISEMENT\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\nYahoo! Groups Links\r<br/>\n\r<br/>\nTo visit your group on the web, go to:\r<br/>\nhttp://groups.yahoo.com/group/unschoolingbasics/\r<br/>\n  \r<br/>\nTo unsubscribe from this group, send an email to:\r<br/>\nunschoolingbasics-unsubscribe@yahoogroups.com\r<br/>\n  \r<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. \r<br/>\n\r<br/>\n\r<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]}],"prevTopicId":3172,"nextTopicId":3189}}