{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":42,"messages":[{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Flip a penny Tuesday","postDate":"1137592330","msgId":9157,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ5OEM4MEU0LTkwRDEtNDlGQy1CREY5LUI2RkUxMThBMjdGM0BlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwNDQwMWM2MWI4ZiQxMjBhODM3MCRhMzZjZjdhNUBob21lY3B1MjAwNjAxMD4=","referencesHeader":"PDAwNDQwMWM2MWI4ZiQxMjBhODM3MCRhMzZjZjdhNUBob21lY3B1MjAwNjAxMD4="},"prevInTopic":9156,"nextInTopic":9168,"prevInTime":9156,"nextInTime":9158,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"... I think it will help if you step back away from this one post about this one website and look at the issue in terms of what type of wording will help","messageBody":"<div id=\"ygrps-yiv-1537172036\">On Jan 17, 2006, at 12:54 PM, S Drag-teine wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So I really I want to know is why I shouldn&#39;t use any resource that  <br/>\n&gt; will<br/>\n&gt; benefit my son if he want to learn it?<br/>\n<br/>\n </span></blockquote>I think it will help if you step back away from this one post about  <br/>\nthis one website and look at the issue in terms of what type of  <br/>\nwording will help people who want to unschool but still have panic  <br/>\nattacks that their children are behind or aren&#39;t learning what they  <br/>\nshould.<br/>\n<br/>\nSome unschoolers, new or experienced, can take activities wrapped up  <br/>\nin schoolish clothing and do them because they&#39;re fun without even  <br/>\nthinking in terms of Important Things Their Kids Should Learn From This.<br/>\n<br/>\nBut since this is a beginner&#39;s list, it&#39;s respectful to keep in mind  <br/>\nthere are plenty of people who are trying to get away from thinking  <br/>\nof teaching and treating their kids as vessels to be filled with  <br/>\nStuff They Must Know. And then right on the list that&#39;s intended to  <br/>\nhelp guide them is an activity that pulls them back into the mode of  <br/>\nthinking they&#39;re trying to get away from. It fills them full of angst  <br/>\nbecause they haven&#39;t been doing any activities directed at getting  <br/>\nparticular information into their kids. They&#39;re afraid that their  <br/>\nkids don&#39;t know who Ben Franklin, who is obviously Very Important,  <br/>\nand don&#39;t know probability from probity and that&#39;s Very Important too.<br/>\n<br/>\nI was going to suggest comparing the list to an AA meeting where some  <br/>\npeople will be fine while others drink but others aren&#39;t ready to  <br/>\neven smell alcohol without getting cravings. But that demonizes the  <br/>\nactivity. And it isn&#39;t the activity that was a problem, it was the  <br/>\ndressing around it, the Here&#39;s Something That&#39;s Really Important To  <br/>\nGet Into Your Kids Who Will Suffer If They Aren&#39;t Doing Such Things.<br/>\n<br/>\nIt&#39;s not the activity. It&#39;s not that many unschoolers can&#39;t use the  <br/>\nactivity and ignore the schoolishness of it. It&#39;s that what&#39;s offered  <br/>\non a beginner&#39;s list should help people move towards unschooling.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Bedtimes","postDate":"1137569375","msgId":9152,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDAwNzMwMWM2MWJhNiRjOThjMTYwMCRhMzZjZjdhNUBob21lY3B1MjAwNjAxMD4="},"prevInTopic":9128,"nextInTopic":9153,"prevInTime":9151,"nextInTime":9153,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1531432796\">&lt;&lt;&lt;&lt;&lt; My son is five and I really like the unschooling this moment topic<br/>\nbecause it makes me realize that everyone is doing what I am doing in their<br/>\nown way.<br/>\nWhat does everyone do as far as sleep schedules?<br/>\n<br/>\nPart of the reason I ask is that we occasionally watch television and movies<br/>\nthat I prefer the children not be exposed to yet if at all. My rule is that<br/>\nQuentin (age 5) must be in his room usually watching a movie before we watch<br/>\nthese shows. &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nYou already had someone mention the idea of recording your shows - we have a<br/>\nsatellite and it has been a great thing for freeing us from the temporal<br/>\ntyranny of scheduling. We all get to record our shows.<br/>\n<br/>\nWe have never had the mindset that we wanted to send Jayn away from us. Nor<br/>\nhave we had a house that would accommodate such a desire even if we had one!<br/>\n<br/>\n<br/>\nFor a long time dh and I used to get our alone time in the mornings before<br/>\nJayn awoke, rather than the traditional in the evening. Now we seem to be on<br/>\ndifferent schedules most of the time. It is sometimes a strain between dh<br/>\nand I, to have less time to talk without interruption. We get around it part<br/>\nof the time by phoning, and by taking the opportunity when Jayn, now 6, is<br/>\nbusy with her own concerns. Mostly we just try to maintain the awareness<br/>\nthat this time is temporary - the tv shows will come again, or end up on<br/>\ndvd.<br/>\n<br/>\nNot as a recommendation but just as a demonstration of what Unschooling can<br/>\nencompass, here is the ongoing saga of our unusual rotating sleep schedule:<br/>\n<br/>\n&lt;&lt;&lt; Jayn lives on a 26-28 hour day. She sleeps for close to 10 hours and<br/>\nthen stays awake for 16 - 18. Since the world is rotating once every 24<br/>\nhours, this means we (she and I) are on a permanent slow march around the<br/>\nclock. Sometimes she divides her sleep into two 5 hour sessions on a<br/>\ncompletely unpredictable basis. In our household we are generally over the<br/>\ncourse of a month or 5 weeks spending about a third of that time on a &quot;night<br/>\nshift&quot; when Jayn gets up in the early evening and goes to be after the sun<br/>\nhas risen. Another part of the time she is getting up in the middle of the<br/>\nnight and going to bed in the mid afternoon - this is usually when she will<br/>\ntake a nap and somehow flip around to being on either nights or days. <br/>\n<br/>\nShe has never had a set bedtime, and when a toddler simply went to sleep<br/>\nwith us. Dh and I were fortunate in that he was at home after a knee<br/>\nreplacement for the vast majority of her young life, so he and I were able<br/>\nto have our adult together time in the morning. Recently he has returned to<br/>\nwork in the film business, on a varying schedule, so one of the limiting<br/>\nfactors in how I am able to cope with the pushing through to nights is the<br/>\nneed to avoid disturbing his rest. In the past, Jayn has been able to be<br/>\nawake for a couple of extra hours in the bedroom watching tv and asking<br/>\nperiodically for a snack, while I snoozed. Now that dynamic occurs with me<br/>\non the increasingly uncomfortable (as we both age) sofa. [Or I bring a snack<br/>\nbag, similar to our park day food bag, into the bedroom so I don&#39;t have to<br/>\nget up.]<br/>\n<br/>\nJayn is not comfortable being alone and lonely during the nights, so I stay<br/>\nwith her. These quiet, intense times have been the scene of some of our most<br/>\nenriched imaginative games and discussions. They can be wonderful nights. It<br/>\nis only when she does her sudden flips that I have a serious tiredness<br/>\nproblem. When she moves into it gradually, I am able to just follow her,<br/>\nstill usually getting up an hour or so sooner than she awakens. I keep<br/>\nmyself alert by typing on the computer sometimes, when she is engaged with<br/>\nher dolls. Sometimes she watches DVD&#39;s, and there are times when I watch<br/>\nsome other DVD&#39;s on my computer or the portable player at the same time. <br/>\n<br/>\nBeing up all night has some restrictions that are not manifest during the<br/>\nday. The first is obviously the need for quiet. Luckily our apartments have<br/>\nwonderfully thick walls, and have all been soundproofed by the Los Angeles<br/>\nAirport Authority. I have to help Jayn avoid jumping games, as we are on the<br/>\nsecond floor. She gets her activity by doing sofa jumping, cycling on the<br/>\nexercise bike, and after the sun comes up. <br/>\n<br/>\nThe other restriction is the limited social contact she has during that 10<br/>\n[now more like 6 days] day(night) period. We struggle to get to her just<br/>\nreconvened dance class (1pm on Tuesdays) and the park playdate following.<br/>\nSometimes she is literally getting out of bed to rush to class, at other<br/>\ntimes, about to go to bed as soon as we get home....<br/>\n <br/>\n....It is a fine balance between going places at a certain time and how long<br/>\nthe drive home then is - sometimes a nap during that drive is utterly<br/>\ndisastrous. It only takes 15 minutes of sleeping for Jayn to be refreshed<br/>\nenough for seven more energetic hours, regardless of when she awoke that<br/>\n&quot;morning&quot;. <br/>\n<br/>\nAwakening her when she doesn&#39;t wish to get up is futile. She has chosen to<br/>\nmiss birthday parties and sleep instead. Trying to manipulate her into<br/>\nsleeping - even with nursing, darkened rooms, quiet time, warm baths, valium<br/>\n(JUST KIDDING!) any kind of trick at all - is equally pointless. She has<br/>\nkept on playing and chatting happily for hours after I would have expected<br/>\ncollapse. <br/>\n<br/>\nThe only time that we ever have any kind of emotional conflict or issues<br/>\nbetween us over sleeping, is when I am not being acceptant of Jayn&#39;s<br/>\nschedule. It is true that I am sometimes tired. However I have to choose to<br/>\nnot be resentful or fight her process, or I am tired *and* grumpy. I adapt<br/>\nmy other activities - cleaning, laundry, shopping, errands - around her.<br/>\nThank goodness for 24 hour markets!<br/>\n<br/>\nDh makes time to play with Jayn when he gets home from work [and lots of<br/>\nother times too!]. Again the only times when there are conflicts between us,<br/>\nare when he loses his sense of acceptance about the sleep schedule - if he<br/>\nis feeling lonely or left out. Most of the time he is a miracle of<br/>\nacceptance.<br/>\n<br/>\nI have the expectation that this is temporary. I have been sometimes<br/>\nreassured by other Unschoolers that this will likely pass. Eventually Jayn<br/>\nmay need fewer sleep hours so her days will regulate back to being 24 hours<br/>\nlong. Also she will gradually become more self sufficient and less needy of<br/>\ncompany or assistance, so in time I will be free to follow my own preference<br/>\nof sleeping, which is to go to bed between midnight and 2am and rise around<br/>\n10-10.30am. (Theater hours) For all I know she will become the same morning<br/>\nperson my dh is. Or she may be a night owl, which is what I suspect.<br/>\n<br/>\nI occasionally talk to her about what she is missing by being awake at night<br/>\ninstead of during the day. She often talks about activities she wants to be<br/>\npart of - such as ice skating or gymnastics. I will have to make sure that<br/>\nthese classes are not early in the morning. Our ability to get to something<br/>\nregularly scheduled before 11am would often be pretty impaired by both my<br/>\ntiredness and her schedule.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nI let Jayn know that I am tired and thinking about bed by saying that I<br/>\n&quot;don&#39;t have much left in me - about 10 minutes.&quot; It helps to alert her to<br/>\nthe upcoming transition. <br/>\n<br/>\nRobyn L. Coburn <br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Free Edition.<br/>\nVersion: 7.1.375 / Virus Database: 267.14.20/232 - Release Date: 1/17/2006</div>","specialLinks":[]},{"userId":157089938,"authorName":"S Drag-teine","from":"&quot;S Drag-teine&quot; &lt;dragteine@...&gt;","profile":"dragteine76","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Flip a penny Tuesday","postDate":"1137532386","msgId":9156,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwOGIwMWM2MWJhYSRkMGEyMTAzMCRhMzZjZjdhNUBob21lY3B1MjAwNjAxMD4=","inReplyToHeader":"PDQzQ0Q1NTk2LjkwODA5MDRAZ2NpLm5ldD4="},"prevInTopic":9153,"nextInTopic":9157,"prevInTime":9155,"nextInTime":9157,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"Yes, my son as well, hmm - we have several squashed pennies I wonder if there is a difference between the squashed pennies? Shannon ","messageBody":"<div id=\"ygrps-yiv-1588846856\">Yes, my son as well, hmm - we have several squashed pennies I wonder if<br/>\nthere is a difference between the squashed pennies?<br/>\n<br/>\nShannon <br/>\n<br/>\n~&gt;|&lt;~.~&gt;|&lt;~.~&gt;|&lt;~.~&gt;|&lt;~.~&gt;|&lt;~.~&gt;|&lt;~ <br/>\nDid you know?... <br/>\n--most well-known brands of lipstick contain lead? <br/>\n--air fresheners have toxic ingredients you aren&#39;t supposed to breathe? <br/>\n--most household cleaners have carcinogens and neurotoxins such as<br/>\nformaldehyde, phenols and/or phosphates? <br/>\n--of 2,983 everyday products, 884 have toxic chemicals? <br/>\n<br/>\nI&#39;m glad we switched! <br/>\nWe are now safer and healthier, using toxic-free products and saving money,<br/>\ntoo. Call (212) 990-6214 for a 10 minute prerecorded presentation or contact<br/>\nme directly.<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>] On Behalf Of Breezy Stevens/ Lady<br/>\nLasairíona of Creavanore<br/>\nSent: Tuesday, January 17, 2006 3:38 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: Re: [unschoolingbasics] Flip a penny Tuesday<br/>\n<br/>\nDeb Lewis wrote:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Ren,  a while back NPR covered a coin flipping experiment.  If you google<br/>\n&gt; &quot;NPR coin flip&quot; or some such you might find it.  It was pretty funny and<br/>\n&gt; if I remember they found the way a penny landed had a lot to do with the<br/>\n&gt; way a penny started. &lt;g&gt;<br/>\n&gt;<br/>\n&gt; What about copper pennies vs. zinc?  Squished pennies, verses drilled<br/>\n&gt; pennies?  Indian head pennies vs. Lincoln head? &lt;g&gt;<br/>\n&gt;<br/>\n&gt; Deb Lewis<br/>\n<br/>\n<br/>\n </span></blockquote>Oooooh, fascinating stuff...I bet my daughter will LOVE this! Hmm...<br/>\n<br/>\nBreezy<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\nYahoo! Groups Links</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Flip a penny Tuesday","postDate":"1137532112","msgId":9104,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRxam1jZysxbGlsQGVHcm91cHMuY29tPg=="},"prevInTopic":9103,"nextInTopic":9110,"prevInTime":9103,"nextInTime":9105,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"Not to nitpick too much, but can t something be both fun and educational simultaneously? I certainly enjoy many things that are educational , as do my","messageBody":"<div id=\"ygrps-yiv-1616712051\">&quot;Not to nitpick too much, but can&#39;t something be both &#39;fun&#39; and<br/>\n&#39;educational&#39; simultaneously? I certainly enjoy many things that are<br/>\n&#39;educational&#39;, as do my children. I don&#39;t really care what the point<br/>\nof the experiment is to them- it&#39;s fun for us!&quot;<br/>\n<br/>\nYes of course!! But the very term &quot;educational&quot; makes some of us<br/>\nleery...ONLY because &quot;educational&quot; gets valued over fun so much in our<br/>\nsocity.<br/>\nIf a person is having fun, it IS &quot;educational&quot;.<br/>\nBut here, you&#39;ll find us saying &quot;if it&#39;s fun, they&#39;re LEARNING&quot; rather<br/>\nthan &quot;ecuational&quot;.<br/>\n<br/>\nYour last statement &quot;I don&#39;t really care what the point of the<br/>\nexperiment is to them-it&#39;s fun for us&quot; tells me you&#39;ve got it figured<br/>\nout! It&#39;s not what we&#39;re doing, nearly so much as WHY. You&#39;re doing it<br/>\nbecause it&#39;s fun, not to get some subject covered or push something<br/>\ninto your childs head. COOL!<br/>\n<br/>\nNothing wrong with the term, but I&#39;m sure everyone can see how our<br/>\nsociety focuses on &quot;ecuational&quot; and loses sight of the CHILD right in<br/>\nfront of their eyes, whose joy they are squashing while ignoring all<br/>\nthe FUN they could be having.<br/>\n<br/>\nFun is living is life is learning....it all goes hand in hand with<br/>\nunschooling. That&#39;s the beauty of it for me.<br/>\nWhen my children are having fun, I value that above any special<br/>\n&quot;educational&quot; video, project, show, activity or book!! Fun is learning.<br/>\nA family that plays together LEARNS together...that&#39;s my motto.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":218449772,"authorName":"zenmomma@comcast.net","from":"zenmomma@...","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Flip a penny Tuesday","postDate":"1137531758","msgId":9102,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMTcyMDA2MjEwMi44NzEyLjQzQ0Q1QjZFMDAwQkQzNzYwMDAwMjIwODIyMDczMDA3OTMwRTAzMDMwMTAzMDIwQTk2QGNvbWNhc3QubmV0Pg=="},"prevInTopic":9099,"nextInTopic":9103,"prevInTime":9101,"nextInTime":9103,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"... addressed how to approach this in an unschooling fashon rather than what appears to be confrontational and dismissive. Well we ve gotten past that first","messageBody":"<div id=\"ygrps-yiv-487008566\"><blockquote><span title=\"ireply\">&gt;&gt;I understand your concerns about deschooling and working at helping parents to get away from something.  I just wish that your original post had<br/>\n </span></blockquote>addressed how to approach this in an unschooling fashon rather than what<br/>\nappears to be confrontational and dismissive.&gt;&gt;<br/>\n<br/>\nWell we&#39;ve gotten past that first post now thankfully. :o) Deb is a cool unschooler and regular poster. You&#39;re a newbie and we&#39;re glad you&#39;re here! So what&#39;s going on in your  unschooling house right now? Did you respond to that post yet? (I have trouble keeping track of all the names.)<br/>\n<br/>\n -------------- Original message ----------------------<br/>\nFrom: seana saxon &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:seana.saxon@...\">seana.saxon@...</a>&gt;<br/>\n<br/>\n<br/>\n--<br/>\n~Mary, unschooling mom to Conor (16) and Casey (11)<br/>\n<br/>\n&quot;Just today I&#39;m going to be utterly present for my children, I&#39;m going to be in their world (not just doing my own thing while they do theirs), I&#39;m going to really hear them, I&#39;m going to prepare myself to be present starting right now.&quot;<br/>\n                            ~Ren Allen<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":157089938,"authorName":"S Drag-teine","from":"&quot;S Drag-teine&quot; &lt;dragteine@...&gt;","profile":"dragteine76","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Bedtimes","postDate":"1137530656","msgId":9128,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNzMwMWM2MWJhNiRjOThjMTYwMCRhMzZjZjdhNUBob21lY3B1MjAwNjAxMD4=","inReplyToHeader":"PDAwNDMwMWM2MWI4NyQwNmEyYjgyMCRhMzZjZjdhNUBob21lY3B1MjAwNjAxMD4="},"prevInTopic":9110,"nextInTopic":9152,"prevInTime":9127,"nextInTime":9129,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"My son is five and I really like the unschooling this moment topic because it makes me realize that everyone is doing what I am doing in their own way. What","messageBody":"<div id=\"ygrps-yiv-1440834977\">My son is five and I really like the unschooling this moment topic because<br/>\nit makes me realize that everyone is doing what I am doing in their own way.<br/>\nWhat does everyone do as far as sleep schedules?<br/>\n<br/>\nPart of the reason I ask is that we occasionally watch television and movies<br/>\nthat I prefer the children not be exposed to yet if at all. My rule is that<br/>\nQuentin (age 5) must be in his room usually watching a movie before we watch<br/>\nthese shows.<br/>\n<br/>\nAny feed back would be helpful.<br/>\n<br/>\nShannon <br/>\n<br/>\n~&gt;|&lt;~.~&gt;|&lt;~.~&gt;|&lt;~.~&gt;|&lt;~.~&gt;|&lt;~.~&gt;|&lt;~ <br/>\nDid you know?... <br/>\n--most well-known brands of lipstick contain lead? <br/>\n--air fresheners have toxic ingredients you aren&#39;t supposed to breathe? <br/>\n--most household cleaners have carcinogens and neurotoxins such as<br/>\nformaldehyde, phenols and/or phosphates? <br/>\n--of 2,983 everyday products, 884 have toxic chemicals? <br/>\n<br/>\nI&#39;m glad we switched! <br/>\nWe are now safer and healthier, using toxic-free products and saving money,<br/>\ntoo. Call (212) 990-6214 for a 10 minute prerecorded presentation or contact<br/>\nme directly.</div>","specialLinks":[]},{"userId":81783378,"authorName":"Breezy Stevens/ Lady Lasairíona of Crea","from":"=?ISO-8859-1?Q?Breezy_Stevens/_Lady_Lasair=EDona_of_Creav?= =?ISO-8859-1?Q?anore?= &lt;redgoddess@...&gt;","profile":"breezy_goddess","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Flip a penny Tuesday","postDate":"1137530262","msgId":9099,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzQ0Q1NTk2LjkwODA5MDRAZ2NpLm5ldD4=","inReplyToHeader":"PDIwMDYwMTE3LjEzMjYwNy4zMTcyLjguZGR6aW1sZXdAanVuby5jb20+","referencesHeader":"PDIwMDYwMTE3LjEzMjYwNy4zMTcyLjguZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":9098,"nextInTopic":9102,"prevInTime":9098,"nextInTime":9100,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"... Oooooh, fascinating stuff...I bet my daughter will LOVE this! Hmm... Breezy","messageBody":"<div id=\"ygrps-yiv-1393292785\">Deb Lewis wrote:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Ren,  a while back NPR covered a coin flipping experiment.  If you google<br/>\n&gt; &quot;NPR coin flip&quot; or some such you might find it.  It was pretty funny and<br/>\n&gt; if I remember they found the way a penny landed had a lot to do with the<br/>\n&gt; way a penny started. &lt;g&gt;<br/>\n&gt;<br/>\n&gt; What about copper pennies vs. zinc?  Squished pennies, verses drilled<br/>\n&gt; pennies?  Indian head pennies vs. Lincoln head? &lt;g&gt;<br/>\n&gt;<br/>\n&gt; Deb Lewis<br/>\n<br/>\n<br/>\n </span></blockquote>Oooooh, fascinating stuff...I bet my daughter will LOVE this! Hmm...<br/>\n<br/>\nBreezy</div>","specialLinks":[]},{"userId":81783378,"authorName":"Breezy Stevens/ Lady Lasairíona of Crea","from":"=?ISO-8859-1?Q?Breezy_Stevens/_Lady_Lasair=EDona_of_Creav?= =?ISO-8859-1?Q?anore?= &lt;redgoddess@...&gt;","profile":"breezy_goddess","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Flip a penny Tuesday","postDate":"1137529922","msgId":9103,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzQ0Q1NDQyLjkwNjA3MDhAZ2NpLm5ldD4=","inReplyToHeader":"PGRxamlvaysyZTU5QGVHcm91cHMuY29tPg==","referencesHeader":"PGRxamlvaysyZTU5QGVHcm91cHMuY29tPg=="},"prevInTopic":9102,"nextInTopic":9104,"prevInTime":9102,"nextInTime":9104,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"... Too funny! My daughter was fascinated by that possibility as well. We actually got 5 heads and 5 tails- which I thought was an unlikely result... Breezy","messageBody":"<div id=\"ygrps-yiv-1845829777\">Ren Allen wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Right now, we&#39;ve moved way beyond the activity and are<br/>\n&gt; testing out the theory that Jared had about starting with heads up or<br/>\n&gt; tails up.<br/>\n<br/>\n<br/>\n </span></blockquote>Too funny! My daughter was fascinated by that possibility as well. We <br/>\nactually got 5 heads and 5 tails- which I thought was an unlikely result...<br/>\n<br/>\nBreezy</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] school & students was Flip a penny Tuesday","postDate":"1137529884","msgId":9094,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMTE3LjEzMzEyNC4zMTcyLjkuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":9092,"nextInTopic":9098,"prevInTime":9093,"nextInTime":9095,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"***an opportunity to have fun and participate in data collection with others from around the country,*** Data collection can be fun.  Dylan has collected cut","messageBody":"<div id=\"ygrps-yiv-938168758\">***an opportunity to have <br/>\nfun and participate in data collection with others from around the <br/>\ncountry,***<br/>\n<br/>\nData collection can be fun.  Dylan has collected cut worm data, and has<br/>\nparticipated in feeder watch surveys and House Finch eye disease surveys.<br/>\n   <br/>\n<br/>\nI think you can find the results of the last &quot;once and for all&quot; Ben<br/>\nFranklin coin flip through google. &lt;g&gt;<br/>\n<br/>\n***watch Rosencrantz and Gildenstern are Dead just <br/>\nfor the fun of making the connection to probability and coin flipping <br/>\nand play.***<br/>\n<br/>\nGreat movie!  Great fun!<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":157089938,"authorName":"S Drag-teine","from":"&quot;S Drag-teine&quot; &lt;dragteine@...&gt;","profile":"dragteine76","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] school & students was Flip a penny Tuesday","postDate":"1137529621","msgId":9110,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNzAwMWM2MWJhNCQ2MDk1NDZhMCRhMzZjZjdhNUBob21lY3B1MjAwNjAxMD4=","inReplyToHeader":"PDAzODc2MTA1LTQzQ0ItNEU5Ri1BMTEwLUYxQzhCMjU0MkIyOUBkaWVyYXVlci5uZXQ+"},"prevInTopic":9104,"nextInTopic":9128,"prevInTime":9109,"nextInTime":9111,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"*I looked forward to homeschooling as a way of being free from evaluating my kids according to the standards of an institution I have very little respect for* ","messageBody":"<div id=\"ygrps-yiv-1314123077\">*I looked forward to homeschooling  <br/>\nas a way of being free from evaluating my kids according to the  <br/>\nstandards of an institution I have very little respect for*<br/>\n<br/>\nI completely agree and hope to get to that point. Currently I am under<br/>\npublic school and next year I will be under an umbrella school so that I can<br/>\nget there. <br/>\n<br/>\nShannon<br/>\n<br/>\n~&gt;|&lt;~.~&gt;|&lt;~.~&gt;|&lt;~.~&gt;|&lt;~.~&gt;|&lt;~.~&gt;|&lt;~ <br/>\nDid you know?...<br/>\n--most well-known brands of lipstick contain lead?<br/>\n--air fresheners have toxic ingredients you aren&#39;t supposed to breathe?<br/>\n--most household cleaners have carcinogens and neurotoxins such as<br/>\nformaldehyde, phenols and/or phosphates?<br/>\n--of 2,983 everyday products, 884 have toxic chemicals?<br/>\n<br/>\nI&#39;m glad we switched!<br/>\nWe are now safer and healthier, using toxic-free products and saving money,<br/>\ntoo. Call (212) 990-6214 for a 10 minute prerecorded presentation or contact<br/>\nme directly.<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>] On Behalf Of Su Penn<br/>\nSent: Tuesday, January 17, 2006 11:38 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: Re: [unschoolingbasics] school & students was Flip a penny Tuesday<br/>\n<br/>\nWhen I came out as a lesbian at 19, I felt like I could look back  <br/>\nthrough my life and see signs I hadn&#39;t recognized all the way back to  <br/>\nelementary school (of course, I &quot;went back in&quot; years later due to my  <br/>\nrelationship with David...but that&#39;s another story).<br/>\n<br/>\nWhen I started attending Quaker meeting and learning about Quaker  <br/>\nfaith and practice, I realized that I had been strongly drawn to  <br/>\nQuakerly ideas for years, especially in some poems of Walt Whitman&#39;s  <br/>\nI had loved since high school.<br/>\n<br/>\nIt&#39;s like that with unschooling, too! One of the early warning signs  <br/>\nthat I was destined to be an unschooler was that, even when I thought  <br/>\nI was going to &quot;homeschool&quot; (&quot;We&#39;ll do classical education and my  <br/>\nchildren will know Latin! We&#39;ll do Charlotte Mason and my children  <br/>\nwill be richly versed in wonderful literature!&quot;) it made no sense to  <br/>\nme when I heard people call their children &quot;students&quot; or talk about  <br/>\nwhat grade they were in. I was puzzled when people referred to &quot;My  <br/>\nfifth grader...&quot; I didn&#39;t see why anyone would want to think of their  <br/>\nkid as assigned to a school grade (or even do the mental work of  <br/>\nkeeping track of what grade their kid would be in!). I thought school  <br/>\ngrades were so arbitrary that they&#39;d have little or no relation to  <br/>\nour lives as homeschoolers. I figured my kid might be doing &quot;sixth  <br/>\ngrade&quot; math and &quot;fourth grade&quot; science at the same time, that based  <br/>\non his interests and talents he&#39;d move faster and farther in some  <br/>\nthings than in others. But I figured even more that I wouldn&#39;t even  <br/>\nknow what &quot;grade level&quot; he was at.<br/>\n<br/>\nWhen I hear homeschooling parents say, &quot;My child reads three grade  <br/>\nlevels ahead,&quot; I&#39;m just agog that they would keep track of a thing  <br/>\nlike that (and the ones who tell me how many years and months ahead  <br/>\ntheir kids are just astonish me). I looked forward to homeschooling  <br/>\nas a way of being free from evaluating my kids according to the  <br/>\nstandards of an institution I have very little respect for--if I  <br/>\nwanted them graded according to school standards, I always thought,  <br/>\nI&#39;d send them to school. (I feel the same way when I homeschooling  <br/>\nmom talks about &quot;grading papers.&quot; WTH?)<br/>\n<br/>\nSo clearly I had a natural bent toward unschooling! It just doesn&#39;t  <br/>\nseem useful to me to overlay &quot;teacher&quot; and &quot;student&quot; on our parent/ <br/>\nchild relationships. How do teachers treat students? What assumptions  <br/>\ndo they make about who knows what and how it&#39;s going to be  <br/>\ncommunicated? About where the authority lies? About who decides what  <br/>\nis important? About how much input students are &quot;allowed&quot;? About who  <br/>\nhas to sit where? When I think about what it is like to be a student  <br/>\n(and what it is like to be a teacher, because I do that work now part- <br/>\ntime), that&#39;s not a relationship I want to have with my kids.<br/>\n<br/>\nOne of the reasons I didn&#39;t see myself grading or keeping track of  <br/>\ngrade level was that I didn&#39;t want to make an idol of &quot;academic  <br/>\nachievement.&quot; I won&#39;t go into details, but high academic achievement  <br/>\ndidn&#39;t do me a lot of good--and over-valuing it did me even less  <br/>\ngood, undermining my self-esteem. It also limited me to doing only  <br/>\nwhat the surprisingly low standards of the schools required. OK, I  <br/>\nwill go into details (smile). My first semester in graduate school,  <br/>\none of my professors called me in for a conference after I&#39;d written  <br/>\nmy first paper for her. &quot;I gave you an A,&quot; she told me. &quot;I had to  <br/>\nbecause it&#39;s A work. But I could tell it wasn&#39;t your best work. I  <br/>\ncould tell you tossed it off. I want you to do better!&quot; It made no  <br/>\nsense to me at all. Why would I work harder if papers I tossed off  <br/>\nwere worth an A? &quot;Tossed-off&quot; work had gotten me As all through high  <br/>\nschool and undergraduate work at a supposedly demanding university.<br/>\n<br/>\nI didn&#39;t want my kids to be limited that way. I didn&#39;t want them to  <br/>\nbe measured by someone else&#39;s standards and fall short--and I didn&#39;t  <br/>\nwant them to fall short of their own potential because someone else&#39;s  <br/>\nstandards were so low.<br/>\n<br/>\nComing to unschooling has been a flowering of that seed, that seed  <br/>\nbeing one of the things that led me to homeschool in the first place.<br/>\n<br/>\nSu<br/>\n<br/>\np.s. My negative reaction to the &quot;flip a penny&quot; project wasn&#39;t the  <br/>\nK-12 thing so much as the claim that it would &quot;show once and for all&quot;  <br/>\nwhether heads or tails come up more--do these people know anything  <br/>\nabout probability &lt;g&gt;?<br/>\n<br/>\np.p.s. My kids are busily engaged on a project right now that I would  <br/>\nnever have allowed pre-unschooling: they&#39;re pulling all the toys off  <br/>\nthe shelves in the living room to see how big a pile they make  <br/>\n(they&#39;re 4 and almost-2). I did say to Eric, 4, &quot;do you think you&#39;ll  <br/>\nhelp me pick it all up later?&quot; Eric: &quot;yes.&quot; Me: &quot;Ok, we&#39;ll have a  <br/>\npick-up party after lunch.&quot; I&#39;ll issue invitations and they&#39;ll come  <br/>\nif they want &lt;g&gt;.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jan 17, 2006, at 12:16 AM, Ren Allen wrote:<br/>\n<br/>\n&gt; There are quite a few newer members to the list, so maybe we can have<br/>\n&gt; a conversation about how our children are not students, how we don&#39;t<br/>\n&gt; see them as a certain grade and how to get more schoolish thoughts out<br/>\n&gt; of our lives and heads! That&#39;s always a good thing.<br/>\n<br/>\n<br/>\n <br/>\nYahoo! Groups Links </span></blockquote></div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Flip a penny Tuesday","postDate":"1137529567","msgId":9092,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMTE3LjEzMjYwNy4zMTcyLjguZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":9091,"nextInTopic":9094,"prevInTime":9091,"nextInTime":9093,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"***Right now, we ve moved way beyond the activity and are testing out the theory that Jared had about starting with heads up or tails up.*** Ren,  a while back","messageBody":"<div id=\"ygrps-yiv-289357566\">***Right now, we&#39;ve moved way beyond the activity and are<br/>\ntesting out the theory that Jared had about starting with heads up or<br/>\ntails up.***<br/>\n<br/>\nRen,  a while back NPR covered a coin flipping experiment.  If you google<br/>\n&quot;NPR coin flip&quot; or some such you might find it.  It was pretty funny and<br/>\nif I remember they found the way a penny landed had a lot to do with the<br/>\nway a penny started. &lt;g&gt;<br/>\n<br/>\nWhat about copper pennies vs. zinc?  Squished pennies, verses drilled<br/>\npennies?  Indian head pennies vs. Lincoln head? &lt;g&gt; <br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Flip a penny Tuesday","postDate":"1137529231","msgId":9091,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMTE3LjEzMjAzMi4zMTcyLjcuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":9090,"nextInTopic":9092,"prevInTime":9090,"nextInTime":9092,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"***I  think people will get more help discussing why something is schooly instead of assuming they shouldn t see it or participate in it at all.*** Why a","messageBody":"<div id=\"ygrps-yiv-644809619\">***I  think <br/>\npeople will get more help discussing &quot;why&quot; something is schooly instead<br/>\nof  <br/>\nassuming they shouldn&#39;t see it or participate in it at all.***<br/>\n<br/>\n&quot;Why&quot; a thing is schooly is more obvious than why a schooly thing can<br/>\npotentially trip up new unschoolers.  Kelly wrote &quot;The Three Stages of<br/>\nUnschooling&quot; and mentions some of the advantages of getting school<br/>\nthoughts and activities out of our heads, especially as new unschoolers. <br/>\n<br/>\n<br/>\nI didn&#39;t &quot;assume&quot; new unschoolers shouldn&#39;t see the schooly thing or<br/>\nparticipate.  I didn&#39;t assume it was schooly.  I went and looked and saw<br/>\nthe schooliness &lt;g&gt; and because this list is here for newbies I cautioned<br/>\nschool activities can be problematic for some new unschoolers.  <br/>\n<br/>\n*** I do agree it is sort of a weird project, I still haven&#39;t quite<br/>\nfigured out  <br/>\nwhat Ben has to do with flipping pennies! ***<br/>\n<br/>\n&quot;A penny saved is a penny earned&quot;  ???  They were flipping penny&#39;s,<br/>\nspecifically, not any old coin.  <br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":81783378,"authorName":"Breezy Stevens/ Lady Lasairíona of Crea","from":"=?ISO-8859-1?Q?Breezy_Stevens/_Lady_Lasair=EDona_of_Creav?= =?ISO-8859-1?Q?anore?= &lt;redgoddess@...&gt;","profile":"breezy_goddess","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Flip a penny Tuesday","postDate":"1137529213","msgId":9098,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzQ0Q1MTdELjMwNjAxMDJAZ2NpLm5ldD4=","inReplyToHeader":"PDIwMDYwMTE2LjIyMjg0NS4yNzk2LjUuZGR6aW1sZXdAanVuby5jb20+","referencesHeader":"PDIwMDYwMTE2LjIyMjg0NS4yNzk2LjUuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":9094,"nextInTopic":9099,"prevInTime":9097,"nextInTime":9099,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"... Not to nitpick too much, but can t something be both fun and educational simultaneously? I certainly enjoy many things that are educational , as do my","messageBody":"<div id=\"ygrps-yiv-701158783\">Deb Lewis wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; The point of this list is unschooling.  The point of the Franklin<br/>\n&gt; Institute is education.  I don&#39;t think the point of that experiment is<br/>\n&gt; &quot;fun.&quot;  <br/>\n<br/>\n </span></blockquote>Not to nitpick too much, but can&#39;t something be both &#39;fun&#39; and <br/>\n&#39;educational&#39; simultaneously? I certainly enjoy many things that are <br/>\n&#39;educational&#39;, as do my children. I don&#39;t really care what the point of <br/>\nthe experiment is to them- it&#39;s fun for us!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; If it&#39;s fun then anyone of any age will enjoy it, not *just* &quot;students&quot;<br/>\n&gt; not *just* those in the &quot;K-12&quot; range.<br/>\n<br/>\n </span></blockquote>Of course, but a 2-year-old might have a bit of a hard time <br/>\nparticipating, don&#39;t you think? Hence the &#39;linguistic shorthand&#39; remark.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I don&#39;t think we need linguistic shorthand to say &quot;fun.&quot;  &quot;Fun&quot; seems<br/>\n&gt; pretty short.   Does &quot;spread the word in the K-12 community&quot; sound like<br/>\n&gt; shorthand for &quot;fun?&quot;  Is it appropriate for an unschooling list?<br/>\n&gt;<br/>\n </span></blockquote>So some people might have a differernt viewpoint from our own, and may <br/>\nspeak accordingly. I think that pretty much anything is appropriate for <br/>\nan unschooling list. Should I disallow my kids to attend Space Night at <br/>\nthe local Elementary School because it&#39;s held on school premises, <br/>\ntargeted at school students, and formatted in a schoolish manner? If my <br/>\nkids are following their passions, absolutely not. I worry sometimes <br/>\nthat unschoolers can have just as narrow a viewpoint as school teachers, <br/>\nonly in the opposite direction. I think it&#39;s more important to be open <br/>\nto inspiration, passion, and fun wherever they may be found than to <br/>\nworry that something is &#39;schoolish&#39;.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Right, but I was talking about the responsibility we have to new<br/>\n&gt; unschoolers on a list about unschooling.   I think helping them move<br/>\n&gt; beyond the world and language of school is essential to understanding<br/>\n&gt; unschooling.  <br/>\n<br/>\n </span></blockquote>Right, as long as it doesn&#39;t close their minds to certain activities or <br/>\npursuits. I think we need to remember to let the whole world open up, <br/>\nnot just to close off one tunnel and open another one. What I worry <br/>\nabout is the child who truly enjoys organized academic activities being <br/>\ndiscouraged from following their interests simply because the adult <br/>\nperceives it as being schoolish. I have one of these kids (possibly <br/>\ntwo!), and it&#39;s taken me 4 years to be able to let go and listen to her <br/>\non this one.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; It think avoiding schoolish things might be exactly what some new<br/>\n&gt; unschoolers should do.  Some people new to unschooling at first can&#39;t see<br/>\n&gt; learning without teaching.  There&#39;s a reason we talk so much about<br/>\n&gt; deschooling.  <br/>\n<br/>\n </span></blockquote>Right, so let&#39;s try to focus on following our passions and inspirations <br/>\n(following our bliss, if you will), rather than focusing on what NOT to do.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It won&#39;t hurt us to think about this or talk about it on an unschooling<br/>\n&gt; list, but a former school at home mom who &quot;encourages&quot; her still<br/>\n&gt; deschooling child to sit down and fill out the official worksheet and<br/>\n&gt; maybe read this or that little lesson and submit that fun data could be<br/>\n&gt; damaging weeks or months of deschooling, thinking she&#39;s just offering<br/>\n&gt; something fun. <br/>\n<br/>\n </span></blockquote>Right again. And again, the problem here is not the activity or the <br/>\nformat, but the &#39;encouragement&#39; of the mother.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m urging care especially because this is a list for<br/>\n&gt; new unschoolers.<br/>\n&gt;<br/>\n </span></blockquote>I agree, but I wish to add a little caution in the other direction as <br/>\nwell, from someone who&#39;s been a bit, shall we say, rabid about it?<br/>\n<br/>\nJust for the record, my 11-year-old, who usually doesn&#39;t haul it out of <br/>\nbed until noon or later, was up at 8:00 this morning, because she was so <br/>\nexcited about the experiment. She thought it was so cool that people all <br/>\nover the place were  participating. When we were done, she took her <br/>\nTooth Fairy money and wanted to register to have it tracked at <br/>\nwheresgeorge.com , and from there we went to the Secret Service website <br/>\nand learned how to spot counterfeit money...not bad for someone who very <br/>\noften doesn&#39;t want to do anything but watch TV...:) It&#39;s wonderful to <br/>\nsee her get excited about something!<br/>\n<br/>\nPlease know that I&#39;m not trying to cause an argument here, but I know <br/>\nfrom experience that it&#39;s easy to close your mind to certain things and <br/>\nadopt an &#39;us&#39; (homeschoolers or unschoolers) against &#39;them&#39; (schools, <br/>\nthe government, etc.) attitude, and to feel like what we do is right, <br/>\nand therefore, everything they do is wrong. I&#39;m not accusing, I&#39;m <br/>\nspeaking from my own experience.<br/>\n<br/>\nBlessings,<br/>\nBreezy</div>","specialLinks":[]},{"userId":229237531,"authorName":"Danielle Conger","from":"Danielle Conger &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] school & students was Flip a penny Tuesday","postDate":"1137528491","msgId":9088,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzQ0Q0RUFCLjYwNTA3QGdtYWlsLmNvbT4=","inReplyToHeader":"PDAzODc2MTA1LTQzQ0ItNEU5Ri1BMTEwLUYxQzhCMjU0MkIyOUBkaWVyYXVlci5uZXQ+","referencesHeader":"PGRxaHVpditjMGN1QGVHcm91cHMuY29tPiA8MDM4NzYxMDUtNDNDQi00RTlGLUExMTAtRjFDOEIyNTQyQjI5QGRpZXJhdWVyLm5ldD4="},"prevInTopic":9086,"nextInTopic":9089,"prevInTime":9087,"nextInTime":9089,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"... Or, those who are interested could see this as an opportunity to have fun and participate in data collection with others from around the country, to","messageBody":"<div id=\"ygrps-yiv-237512891\">Su Penn wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; p.s. My negative reaction to the &quot;flip a penny&quot; project wasn&#39;t the <br/>\n&gt; K-12 thing so much as the claim that it would &quot;show once and for all&quot; <br/>\n&gt; whether heads or tails come up more--do these people know anything <br/>\n&gt; about probability &lt;g&gt;?<br/>\n<br/>\n </span></blockquote>Or, those who are interested could see this as an opportunity to have <br/>\nfun and participate in data collection with others from around the <br/>\ncountry, to perhaps do their own continued research, and, last but <br/>\ncertainly not least, to watch Rosencrantz and Gildenstern are Dead just <br/>\nfor the fun of making the connection to probability and coin flipping <br/>\nand play.<br/>\n<br/>\n-- <br/>\n~~Danielle<br/>\nEmily (8), Julia (7), Sam (5)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.danielleconger.com/Homeschool/Welcomehome.html\">http://www.danielleconger.com/Homeschool/Welcomehome.html</a><br/>\n<br/>\n~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*<br/>\n<br/>\n&quot;With our thoughts, we make the world.&quot; ~~Buddha</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Flip a penny Tuesday","postDate":"1137528404","msgId":9089,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRxamlvaysyZTU5QGVHcm91cHMuY29tPg=="},"prevInTopic":9088,"nextInTopic":9090,"prevInTime":9088,"nextInTime":9090,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"I do agree it is sort of a weird project, I still haven t quite figured out what Ben has to do with flipping pennies! One of his famous quotes is a penny","messageBody":"<div id=\"ygrps-yiv-1217968282\">&quot;I do agree it is sort of a weird project, I still haven&#39;t quite<br/>\nfigured out what Ben has to do with flipping pennies!&quot;<br/>\n<br/>\nOne of his famous quotes is &quot;a penny saved is a penny earned&quot;...:)<br/>\n<br/>\nand he WAS quite a scientist and philosopher.  <br/>\n<br/>\nSierra is out flipping pennies at the moment, and needs me...I&#39;ll<br/>\ndescribe how we had fun with the activity, in a very non-schoolish<br/>\nmanner later. Right now, we&#39;ve moved way beyond the activity and are<br/>\ntesting out the theory that Jared had about starting with heads up or<br/>\ntails up.<br/>\nSo far we&#39;ve proven nothing, but laughed a whole bunch.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Flip a penny Tuesday","postDate":"1137527951","msgId":9086,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMTE3LjEyNTkxMi4zMTcyLjYuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":9085,"nextInTopic":9088,"prevInTime":9085,"nextInTime":9087,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"***I was put off by the way the statement was made.*** This is an example of meta-discussion.  The reason meta-discussion is a violation of the posting","messageBody":"<div id=\"ygrps-yiv-217102006\">***I was put off by the way the statement was made.***<br/>\n<br/>\nThis is an example of meta-discussion.  The reason meta-discussion is a<br/>\nviolation of the posting policies is simple: <br/>\nReaders cannot know &quot;the way&quot; the statement was made.  <br/>\n<br/>\nReaders can&#39;t know whether the poster banged it out angrily or tapped it<br/>\nout lightly and happily believing it funny and clever or simply thought<br/>\nit would be a good time to mention unschoolers don&#39;t have students or<br/>\ngrade levels.  <br/>\n<br/>\nMeta-discussions almost always begin when a reader, in response to<br/>\ninternal feelings of defensiveness, gives a negative &quot;voice&quot; or &quot;tone&quot; to<br/>\nsomeone else&#39;s post.  <br/>\n<br/>\nList members are free to post about the *ideas* of students and grade<br/>\nlevels in regard to unschooling but meta-discussion is in violation of<br/>\nthe list posting policies.   <br/>\n<br/>\nIt&#39;s easy to see by one exchange how meta-discussion could potentially<br/>\nderail a list from it&#39;s stated purpose.  And one purpose of this list is<br/>\nhelping new unschoolers move beyond &quot;school think.&quot;   <br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":218449772,"authorName":"zenmomma@comcast.net","from":"zenmomma@...","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Flip a penny Tuesday","postDate":"1137527714","msgId":9090,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMTcyMDA2MTk1NS4yOTExNC40M0NENEJBMjAwMDIzMzI2MDAwMDcxQkEyMjA3MDIwODUzMEUwMzAzMDEwMzAyMEE5NkBjb21jYXN0Lm5ldD4="},"prevInTopic":9089,"nextInTopic":9091,"prevInTime":9089,"nextInTime":9091,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"... But remember what Hobbes (the tiger) said. If nobody makes you do it, it counts as fun. :o) I ll show it to Casey today. She may think it s cool and","messageBody":"<div id=\"ygrps-yiv-1092638682\"><blockquote><span title=\"ireply\">&gt;&gt;I don&#39;t think the point of that experiment is&quot;fun.&quot;   &gt;&gt;<br/>\n<br/>\n </span></blockquote>But remember what Hobbes (the tiger) said. &quot;If nobody makes you do it, it counts as fun.&quot; :o) I&#39;ll show it to Casey today. She may think it&#39;s cool and participate or she may think it&#39;s nothing special and decline my offer.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;a former school at home mom who &quot;encourages&quot; her still<br/>\n </span></blockquote>deschooling child to sit down and fill out the official worksheet and<br/>\nmaybe read this or that little lesson and submit that fun data could be<br/>\ndamaging weeks or months of deschooling&gt;&gt;<br/>\n<br/>\nVery true. So perhaps we should be mindful to put in a disclaimer when we post activities from schooly sites. Just a quick...I know this is kind of schooly but it could be fun to participate in a relaxed manner...would be a good intro.<br/>\n<br/>\n<br/>\n--<br/>\n~Mary, unschooling mom to Conor (16) and Casey (11)<br/>\n<br/>\n&quot;Just today I&#39;m going to be utterly present for my children, I&#39;m going to be in their world (not just doing my own thing while they do theirs), I&#39;m going to really hear them, I&#39;m going to prepare myself to be present starting right now.&quot;<br/>\n                            ~Ren Allen<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":92643757,"authorName":"Leslie530@aol.com","from":"Leslie530@...","profile":"lescather","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Flip a penny Tuesday","postDate":"1137527197","msgId":9085,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk5LjZlNDM1NzVlLjMwZmVhMzlkQGFvbC5jb20+"},"prevInTopic":9083,"nextInTopic":9086,"prevInTime":9084,"nextInTime":9086,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"I posted the link and I do apologize sending it without a schooly -  proceed with caution note.  I meant to, but I was  multi-tasking....not usually a good","messageBody":"<div id=\"ygrps-yiv-1777388612\">I posted the link and I do apologize sending it without a &quot;schooly -  proceed <br/>\nwith caution&quot; note.  I meant to, but I was  multi-tasking....not usually a <br/>\ngood idea for me.<br/>\n <br/>\nI understand the points Deb made in her later posts.  Like this  one:<br/>\n <br/>\n***Right, but I was talking about the responsibility we have to  new<br/>\nunschoolers on a list about unschooling.   I think helping them  move<br/>\nbeyond the world and language of school is essential to  understanding<br/>\nunschooling. *****<br/>\n <br/>\nMy view is that we are minorities (unschoolers) within a minority  <br/>\n(homeschoolers) and we are just going to accept some language and some  form-filling-out <br/>\nto participate in some things.   In fact, language  and procedures are part <br/>\nof life.  And just because it is a school project  doesn&#39;t mean our own <br/>\nfamilies won&#39;t enjoy it (in fact, we will probably enjoy it  more).<br/>\n <br/>\nAnd as this is a discussion list, not a school, let&#39;s discuss it!  I  think <br/>\npeople will get more help discussing &quot;why&quot; something is schooly instead of  <br/>\nassuming they shouldn&#39;t see it or participate in it at all.<br/>\n <br/>\nI do agree it is sort of a weird project, I still haven&#39;t quite figured out  <br/>\nwhat Ben has to do with flipping pennies!  <br/>\n <br/>\nleslie in SC<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":157089938,"authorName":"S Drag-teine","from":"&quot;S Drag-teine&quot; &lt;dragteine@...&gt;","profile":"dragteine76","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: Flip a penny Tuesday","postDate":"1137520470","msgId":9153,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDQwMWM2MWI4ZiQxMjBhODM3MCRhMzZjZjdhNUBob21lY3B1MjAwNjAxMD4=","inReplyToHeader":"PDUxZTg2YTRlMDYwMTE3MDA0MHU0OTlmNjBlc2MwYzU2YWIwNDljNTYwZWZAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":9152,"nextInTopic":9156,"prevInTime":9152,"nextInTime":9154,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"I feel responsible for this whole mess and discussion which though has put me off a little - I have learned from as well and hope that no one has become too","messageBody":"<div id=\"ygrps-yiv-1437004571\">I feel responsible for this whole mess and discussion which though has put<br/>\nme off a little - I have learned from as well and hope that no one has<br/>\nbecome too offended.<br/>\n<br/>\nWhile no one may have meant to be huffy about the way things were said they<br/>\nwere interpreted as so. Instead of saying we don&#39;t have students and there<br/>\nare no K-12 here. Actually, that was the verbage used by the person writing<br/>\nnot the website. The website does mention students and again I don&#39;t&#39; find<br/>\nthe word students offensive because it has more meaning to me then others.<br/>\n<br/>\nWhile the website does mention students anyone can participate and while<br/>\nthey do ask what grade the selection is like K-5, 6-8, 9-12 or other. Choose<br/>\nother if the grades truly offend you. It really is no more then saying...  5<br/>\n- 12, 12 - 14, 15 - 18 or Older. And while the Franklin Institute is a<br/>\nlearning center it is no different the Aquarium or the Science Center or<br/>\nSmithsonian - (this is an honest question) should we stay away from those as<br/>\nwell? <br/>\n<br/>\nI believe in using any resources no matter who they are directed for... if<br/>\nmy son likes them. There are things that he plays with that he uses in an<br/>\nalternative manor then the manufacture&#39;s suggested method and others that he<br/>\nplays just the way the manufacture thought children would neither is by my<br/>\ndoing.<br/>\n<br/>\nI don&#39;t like being told that I should do this or I shouldn&#39;t do that...<br/>\nunschooling for me is about doing what is best for my child and only me and<br/>\nmy child can really know what is best. Just to clarify I take a guidance<br/>\nmethod when it comes to my son. If there is something that I think he might<br/>\nlike we check it out - if he says no and I really want to do it - I bring it<br/>\nhome and do it by myself. Sometimes he joins me and sometimes he just<br/>\nbenefits from the result.<br/>\n<br/>\nIf he wants to do it - I let him lead even if that still results in me doing<br/>\nit under his instruction or even harder when he tells me to leave even when<br/>\nI am not being controlling.<br/>\n<br/>\nSo I really I want to know is why I shouldn&#39;t use any resource that will<br/>\nbenefit my son if he want to learn it?<br/>\n<br/>\nShannon<br/>\n<br/>\n~&gt;|&lt;~.~&gt;|&lt;~.~&gt;|&lt;~.~&gt;|&lt;~.~&gt;|&lt;~.~&gt;|&lt;~<br/>\n<br/>\nDid you know?...<br/>\n--most well-known brands of lipstick contain lead?<br/>\n--air fresheners have toxic ingredients you aren&#39;t supposed to breathe?<br/>\n--most household cleaners have carcinogens and neurotoxins such as<br/>\n             formaldehyde, phenols and/or phosphates?<br/>\n--of 2,983 everyday products, 884 have toxic chemicals?<br/>\n<br/>\nI&#39;m glad we switched!<br/>\nWe are now safer and healthier, using toxic-free products and saving money,<br/>\ntoo. Call (212) 990-6214 for a 10 minute prerecorded presentation or contact<br/>\nme directly.<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>] On Behalf Of seana saxon<br/>\nSent: Tuesday, January 17, 2006 3:40 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: Re: [unschoolingbasics] Re: Flip a penny Tuesday<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 1/17/06, Deb Lewis &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;  ***your original comment was the first post I read on this list and it<br/>\n&gt; was really rather off-putting.***<br/>\n&gt;<br/>\n&gt; Were you put off that unschoolers don&#39;t have students or that this is not<br/>\n&gt; a K-12 community?<br/>\n&gt;<br/>\n<br/>\nNeither, I was put off by the way the statement was made.  I tried to say<br/>\nthat as politely as I could.  I don&#39;t need to purpetuate this issue.  I<br/>\nthought I might be helpful in letting you know that the way you posted was<br/>\nnot something I, as a new member, appreciated.  I do hope to lurk and gleen<br/>\nfrom this group but for now I will stop contributing to this thread.<br/>\n<br/>\nSeana<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n <br/>\nYahoo! Groups Links </span></blockquote></div>","specialLinks":[]},{"userId":157089938,"authorName":"S Drag-teine","from":"&quot;S Drag-teine&quot; &lt;dragteine@...&gt;","profile":"dragteine76","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: Flip a penny Tuesday","postDate":"1137517015","msgId":9083,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDMwMWM2MWI4NyQwNmEyYjgyMCRhMzZjZjdhNUBob21lY3B1MjAwNjAxMD4=","inReplyToHeader":"PDIwMDYwMTE2LjIyMjg0NS4yNzk2LjUuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":9080,"nextInTopic":9085,"prevInTime":9082,"nextInTime":9084,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"**It think avoiding schoolish things might be exactly what some new unschoolers should do.  Some people new to unschooling at first can t see learning without","messageBody":"<div id=\"ygrps-yiv-2141090184\">**It think avoiding schoolish things might be exactly what some new<br/>\nunschoolers should do.  Some people new to unschooling at first can&#39;t see<br/>\nlearning without teaching.**<br/>\n<br/>\nNow wait! That is unfair. My son - who brought me four movies today and<br/>\nannounced that he wanted to watch them today. I don&#39;t think he is feeling<br/>\nwell and that is usually what he does when he is sick. I told me they were<br/>\nhaving a coin flipping thing on the internet and he said he wanted to do it.<br/>\n<br/>\nNow, let me explain that my husband flips a coin three times to make a<br/>\ndecision when he can&#39;t decide. My son is also to inherit a large coin<br/>\ncollection that has been in our family several generations and so coins have<br/>\nbeen a big part of our lives. We count coins and money and money is probably<br/>\nour biggest math curriculum if we even have one. Flipping coins in our house<br/>\nis a big deal!<br/>\n<br/>\nSo anyway, I printed out the sheet and he flipped the coin and I recorded<br/>\nfor him and then we got online and enter the info and then he went to<br/>\nwatching his movies. Telling anyone what they should or shouldn&#39;t do is<br/>\noffensive to me. Why should I avoid one thing or another if I know my son<br/>\nwill enjoy doing it?<br/>\n<br/>\nShannon<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>] On Behalf Of Deb Lewis<br/>\nSent: Tuesday, January 17, 2006 12:29 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: [unschoolingbasics] Re: Flip a penny Tuesday<br/>\n<br/>\n***Yup, that is the point, isn&#39;t it?***<br/>\n<br/>\nThe point of this list is unschooling.  The point of the Franklin<br/>\nInstitute is education.  I don&#39;t think the point of that experiment is<br/>\n&quot;fun.&quot;   <br/>\n<br/>\n***I think it can be thought of as linguistic shorthand- it <br/>\ngives you an idea of at what ages kids might enjoy this. ***<br/>\n<br/>\nIf it&#39;s fun then anyone of any age will enjoy it, not *just* &quot;students&quot;<br/>\nnot *just* those in the &quot;K-12&quot; range. <br/>\n<br/>\nI don&#39;t think we need linguistic shorthand to say &quot;fun.&quot;  &quot;Fun&quot; seems<br/>\npretty short.   Does &quot;spread the word in the K-12 community&quot; sound like<br/>\nshorthand for &quot;fun?&quot;  Is it appropriate for an unschooling list? <br/>\n<br/>\n***And just <br/>\nbecause it&#39;s an organized experiment doesn&#39;t mean it&#39;s counter to <br/>\nunschooling.***<br/>\n <br/>\nRight, but I was talking about the responsibility we have to new<br/>\nunschoolers on a list about unschooling.   I think helping them move<br/>\nbeyond the world and language of school is essential to understanding<br/>\nunschooling.   <br/>\n <br/>\n***I think excluding <br/>\ncertain things because they&#39;re in a format that a school would use is <br/>\nagainst the spirit of unschooling. ***<br/>\n<br/>\nIt think avoiding schoolish things might be exactly what some new<br/>\nunschoolers should do.  Some people new to unschooling at first can&#39;t see<br/>\nlearning without teaching.  There&#39;s a reason we talk so much about<br/>\ndeschooling.   <br/>\nIt won&#39;t hurt us to think about this or talk about it on an unschooling<br/>\nlist, but a former school at home mom who &quot;encourages&quot; her still<br/>\ndeschooling child to sit down and fill out the official worksheet and<br/>\nmaybe read this or that little lesson and submit that fun data could be<br/>\ndamaging weeks or months of deschooling, thinking she&#39;s just offering<br/>\nsomething fun.   I&#39;m urging care especially because this is a list for<br/>\nnew unschoolers. <br/>\n <br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n <br/>\nYahoo! Groups Links</div>","specialLinks":[]},{"userId":252551372,"authorName":"Su Penn","from":"Su Penn &lt;supenn@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] school & students was Flip a penny Tuesday","postDate":"1137515880","msgId":9080,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzODc2MTA1LTQzQ0ItNEU5Ri1BMTEwLUYxQzhCMjU0MkIyOUBkaWVyYXVlci5uZXQ+","inReplyToHeader":"PGRxaHVpditjMGN1QGVHcm91cHMuY29tPg==","referencesHeader":"PGRxaHVpditjMGN1QGVHcm91cHMuY29tPg=="},"prevInTopic":9070,"nextInTopic":9083,"prevInTime":9079,"nextInTime":9081,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"When I came out as a lesbian at 19, I felt like I could look back through my life and see signs I hadn t recognized all the way back to elementary school (of","messageBody":"<div id=\"ygrps-yiv-500478193\">When I came out as a lesbian at 19, I felt like I could look back  <br/>\nthrough my life and see signs I hadn&#39;t recognized all the way back to  <br/>\nelementary school (of course, I &quot;went back in&quot; years later due to my  <br/>\nrelationship with David...but that&#39;s another story).<br/>\n<br/>\nWhen I started attending Quaker meeting and learning about Quaker  <br/>\nfaith and practice, I realized that I had been strongly drawn to  <br/>\nQuakerly ideas for years, especially in some poems of Walt Whitman&#39;s  <br/>\nI had loved since high school.<br/>\n<br/>\nIt&#39;s like that with unschooling, too! One of the early warning signs  <br/>\nthat I was destined to be an unschooler was that, even when I thought  <br/>\nI was going to &quot;homeschool&quot; (&quot;We&#39;ll do classical education and my  <br/>\nchildren will know Latin! We&#39;ll do Charlotte Mason and my children  <br/>\nwill be richly versed in wonderful literature!&quot;) it made no sense to  <br/>\nme when I heard people call their children &quot;students&quot; or talk about  <br/>\nwhat grade they were in. I was puzzled when people referred to &quot;My  <br/>\nfifth grader...&quot; I didn&#39;t see why anyone would want to think of their  <br/>\nkid as assigned to a school grade (or even do the mental work of  <br/>\nkeeping track of what grade their kid would be in!). I thought school  <br/>\ngrades were so arbitrary that they&#39;d have little or no relation to  <br/>\nour lives as homeschoolers. I figured my kid might be doing &quot;sixth  <br/>\ngrade&quot; math and &quot;fourth grade&quot; science at the same time, that based  <br/>\non his interests and talents he&#39;d move faster and farther in some  <br/>\nthings than in others. But I figured even more that I wouldn&#39;t even  <br/>\nknow what &quot;grade level&quot; he was at.<br/>\n<br/>\nWhen I hear homeschooling parents say, &quot;My child reads three grade  <br/>\nlevels ahead,&quot; I&#39;m just agog that they would keep track of a thing  <br/>\nlike that (and the ones who tell me how many years and months ahead  <br/>\ntheir kids are just astonish me). I looked forward to homeschooling  <br/>\nas a way of being free from evaluating my kids according to the  <br/>\nstandards of an institution I have very little respect for--if I  <br/>\nwanted them graded according to school standards, I always thought,  <br/>\nI&#39;d send them to school. (I feel the same way when I homeschooling  <br/>\nmom talks about &quot;grading papers.&quot; WTH?)<br/>\n<br/>\nSo clearly I had a natural bent toward unschooling! It just doesn&#39;t  <br/>\nseem useful to me to overlay &quot;teacher&quot; and &quot;student&quot; on our parent/ <br/>\nchild relationships. How do teachers treat students? What assumptions  <br/>\ndo they make about who knows what and how it&#39;s going to be  <br/>\ncommunicated? About where the authority lies? About who decides what  <br/>\nis important? About how much input students are &quot;allowed&quot;? About who  <br/>\nhas to sit where? When I think about what it is like to be a student  <br/>\n(and what it is like to be a teacher, because I do that work now part- <br/>\ntime), that&#39;s not a relationship I want to have with my kids.<br/>\n<br/>\nOne of the reasons I didn&#39;t see myself grading or keeping track of  <br/>\ngrade level was that I didn&#39;t want to make an idol of &quot;academic  <br/>\nachievement.&quot; I won&#39;t go into details, but high academic achievement  <br/>\ndidn&#39;t do me a lot of good--and over-valuing it did me even less  <br/>\ngood, undermining my self-esteem. It also limited me to doing only  <br/>\nwhat the surprisingly low standards of the schools required. OK, I  <br/>\nwill go into details (smile). My first semester in graduate school,  <br/>\none of my professors called me in for a conference after I&#39;d written  <br/>\nmy first paper for her. &quot;I gave you an A,&quot; she told me. &quot;I had to  <br/>\nbecause it&#39;s A work. But I could tell it wasn&#39;t your best work. I  <br/>\ncould tell you tossed it off. I want you to do better!&quot; It made no  <br/>\nsense to me at all. Why would I work harder if papers I tossed off  <br/>\nwere worth an A? &quot;Tossed-off&quot; work had gotten me As all through high  <br/>\nschool and undergraduate work at a supposedly demanding university.<br/>\n<br/>\nI didn&#39;t want my kids to be limited that way. I didn&#39;t want them to  <br/>\nbe measured by someone else&#39;s standards and fall short--and I didn&#39;t  <br/>\nwant them to fall short of their own potential because someone else&#39;s  <br/>\nstandards were so low.<br/>\n<br/>\nComing to unschooling has been a flowering of that seed, that seed  <br/>\nbeing one of the things that led me to homeschool in the first place.<br/>\n<br/>\nSu<br/>\n<br/>\np.s. My negative reaction to the &quot;flip a penny&quot; project wasn&#39;t the  <br/>\nK-12 thing so much as the claim that it would &quot;show once and for all&quot;  <br/>\nwhether heads or tails come up more--do these people know anything  <br/>\nabout probability &lt;g&gt;?<br/>\n<br/>\np.p.s. My kids are busily engaged on a project right now that I would  <br/>\nnever have allowed pre-unschooling: they&#39;re pulling all the toys off  <br/>\nthe shelves in the living room to see how big a pile they make  <br/>\n(they&#39;re 4 and almost-2). I did say to Eric, 4, &quot;do you think you&#39;ll  <br/>\nhelp me pick it all up later?&quot; Eric: &quot;yes.&quot; Me: &quot;Ok, we&#39;ll have a  <br/>\npick-up party after lunch.&quot; I&#39;ll issue invitations and they&#39;ll come  <br/>\nif they want &lt;g&gt;.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jan 17, 2006, at 12:16 AM, Ren Allen wrote:<br/>\n<br/>\n&gt; There are quite a few newer members to the list, so maybe we can have<br/>\n&gt; a conversation about how our children are not students, how we don&#39;t<br/>\n&gt; see them as a certain grade and how to get more schoolish thoughts out<br/>\n&gt; of our lives and heads! That&#39;s always a good thing. </span></blockquote></div>","specialLinks":[]},{"userId":234405261,"authorName":"seana saxon","from":"seana saxon &lt;seana.saxon@...&gt;","profile":"seanasaxon","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Flip a penny Tuesday","postDate":"1137487200","msgId":9070,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxZTg2YTRlMDYwMTE3MDA0MHU0OTlmNjBlc2MwYzU2YWIwNDljNTYwZWZAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDIwMDYwMTE3LjAxMDIzMy4yNzk2LjYuZGR6aW1sZXdAanVuby5jb20+","referencesHeader":"PDIwMDYwMTE3LjAxMDIzMy4yNzk2LjYuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":9069,"nextInTopic":9080,"prevInTime":9069,"nextInTime":9071,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"... Neither, I was put off by the way the statement was made.  I tried to say that as politely as I could.  I don t need to purpetuate this issue.  I thought I","messageBody":"<div id=\"ygrps-yiv-904517831\">On 1/17/06, Deb Lewis &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;  ***your original comment was the first post I read on this list and it<br/>\n&gt; was really rather off-putting.***<br/>\n&gt;<br/>\n&gt; Were you put off that unschoolers don&#39;t have students or that this is not<br/>\n&gt; a K-12 community?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Neither, I was put off by the way the statement was made.  I tried to say<br/>\nthat as politely as I could.  I don&#39;t need to purpetuate this issue.  I<br/>\nthought I might be helpful in letting you know that the way you posted was<br/>\nnot something I, as a new member, appreciated.  I do hope to lurk and gleen<br/>\nfrom this group but for now I will stop contributing to this thread.<br/>\n<br/>\nSeana<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Flip a penny Tuesday","postDate":"1137484953","msgId":9069,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMTE3LjAxMDIzMy4yNzk2LjYuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":9068,"nextInTopic":9070,"prevInTime":9068,"nextInTime":9070,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"***your original comment was the first post I read on this list and it was really rather off-putting.*** Were you put off that unschoolers don t have students","messageBody":"<div id=\"ygrps-yiv-1366145170\">***your original comment was the first post I read on this list and it<br/>\nwas<br/>\nreally rather off-putting.***<br/>\n<br/>\nWere you put off that unschoolers don&#39;t have students or that this is not<br/>\na K-12 community?  <br/>\n<br/>\n***I, and other new members, may be new to<br/>\nunschooling but I have a hard time believing that we newbies all that<br/>\nlocked<br/>\ninto anything if we&#39;re on this list.***<br/>\n<br/>\nIt&#39;s not an insult.  Unschooling is a radical concept and even some who<br/>\nthink of themselves as very radical can get stuck.<br/>\nIt comes up again and again when people say &quot;But what about math?&quot;  or<br/>\n&quot;How will they learn to diagram sentences&quot; or &quot;They&#39;d watch TV all day if<br/>\nI let them.&quot;   If everyone had it instantly figured out and clear in<br/>\ntheir minds they wouldn&#39;t stop for information at a list called<br/>\nunschooling basics. <br/>\n<br/>\n***I also don&#39;t want to<br/>\nbreak the rule of &quot;not discussing a posts language&quot; as was indicated on<br/>\nthe<br/>\nwelcome letter. ***<br/>\n<br/>\n&quot;...off-putting.&quot;  Yes, qualifies as meta discussion and it happens even<br/>\nwhen list members have the best intentions.  It&#39;s unavoidable but since<br/>\nit has the potential to derail a list it&#39;s discouraged. <br/>\n<br/>\n***But as the post was basically about language I don&#39;t know<br/>\nif I am or not.***<br/>\n<br/>\nPosting about words that can be stumbling blocks to unschooling thinking<br/>\nis not meta discussion.   <br/>\n<br/>\n***I just wish that your original post had<br/>\naddressed how to approach this in an unschooling fashon rather than what<br/>\nappears to be confrontational and dismissive.***<br/>\n<br/>\nMy post was exactly about my concern that new unschoolers might have<br/>\ndifficulty approaching a school oriented experiment in an unschooling<br/>\nfashion.  I don&#39;t think unschoolers need to devise unschoolish ways to do<br/>\nwhat schools do.  This is not good science.  This activity&#39;s been<br/>\ndesigned to keep kids busy while they&#39;re marched through a curriculum.  <br/>\nSome unschoolers might find it fun.  If not a single new unschooling mom<br/>\nor dad becomes confused that a list for new unschoolers provided a link<br/>\nto a school site, complete with lesson plans, it was still a careless<br/>\npost for this list, sent as it was to the &quot;K-12 community.&quot;  <br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":234405261,"authorName":"seana saxon","from":"seana saxon &lt;seana.saxon@...&gt;","profile":"seanasaxon","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Flip a penny Tuesday","postDate":"1137480076","msgId":9068,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxZTg2YTRlMDYwMTE2MjI0MWc1OGFiMWVmOGcxNDU4OGI0YWI1ZTQ2NzNiQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDIwMDYwMTE2LjIyMjg0NS4yNzk2LjUuZGR6aW1sZXdAanVuby5jb20+","referencesHeader":"PDIwMDYwMTE2LjIyMjg0NS4yNzk2LjUuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":9065,"nextInTopic":9069,"prevInTime":9067,"nextInTime":9069,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"... But, your original comment was the first post I read on this list and it was really rather off-putting.  I, and other new members, may be new to ","messageBody":"<div id=\"ygrps-yiv-1087988526\">On 1/16/06, Deb Lewis &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Right, but I was talking about the responsibility we have to new<br/>\n&gt; unschoolers on a list about unschooling.   I think helping them move beyond<br/>\n&gt; the world and language of school is essential to understanding<br/>\n&gt; unschooling.<br/>\n<br/>\n<br/>\n </span></blockquote>But, your original comment was the first post I read on this list and it was<br/>\nreally rather off-putting.  I, and other new members, may be new to<br/>\nunschooling but I have a hard time believing that we newbies all that locked<br/>\ninto anything if we&#39;re on this list.<br/>\n<br/>\nI am new and don&#39;t want to start out offending anyone.  I also don&#39;t want to<br/>\nbreak the rule of &quot;not discussing a posts language&quot; as was indicated on the<br/>\nwelcome letter.  But as the post was basically about language I don&#39;t know<br/>\nif I am or not.<br/>\n<br/>\nI, for one, was very appreciative to get the information on something that I<br/>\nwould not have known about otherwise.<br/>\n<br/>\nI understand your concerns about deschooling and working at helping parents<br/>\nto get away from something.  I just wish that your original post had<br/>\naddressed how to approach this in an unschooling fashon rather than what<br/>\nappears to be confrontational and dismissive.<br/>\n<br/>\nThanks for your consideration and being here as a resource,<br/>\nSeana Saxon<br/>\nWild Child Weaver of my two beautiful angels<br/>\nGenevieve and Elissa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Flip a penny Tuesday","postDate":"1137475725","msgId":9065,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMTE2LjIyMjg0NS4yNzk2LjUuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":9063,"nextInTopic":9068,"prevInTime":9064,"nextInTime":9066,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"***Yup, that is the point, isn t it?*** The point of this list is unschooling.  The point of the Franklin Institute is education.  I don t think the point of","messageBody":"<div id=\"ygrps-yiv-816248814\">***Yup, that is the point, isn&#39;t it?***<br/>\n<br/>\nThe point of this list is unschooling.  The point of the Franklin<br/>\nInstitute is education.  I don&#39;t think the point of that experiment is<br/>\n&quot;fun.&quot;   <br/>\n<br/>\n***I think it can be thought of as linguistic shorthand- it <br/>\ngives you an idea of at what ages kids might enjoy this. ***<br/>\n<br/>\nIf it&#39;s fun then anyone of any age will enjoy it, not *just* &quot;students&quot;<br/>\nnot *just* those in the &quot;K-12&quot; range. <br/>\n<br/>\nI don&#39;t think we need linguistic shorthand to say &quot;fun.&quot;  &quot;Fun&quot; seems<br/>\npretty short.   Does &quot;spread the word in the K-12 community&quot; sound like<br/>\nshorthand for &quot;fun?&quot;  Is it appropriate for an unschooling list? <br/>\n<br/>\n***And just <br/>\nbecause it&#39;s an organized experiment doesn&#39;t mean it&#39;s counter to <br/>\nunschooling.***<br/>\n <br/>\nRight, but I was talking about the responsibility we have to new<br/>\nunschoolers on a list about unschooling.   I think helping them move<br/>\nbeyond the world and language of school is essential to understanding<br/>\nunschooling.   <br/>\n <br/>\n***I think excluding <br/>\ncertain things because they&#39;re in a format that a school would use is <br/>\nagainst the spirit of unschooling. ***<br/>\n<br/>\nIt think avoiding schoolish things might be exactly what some new<br/>\nunschoolers should do.  Some people new to unschooling at first can&#39;t see<br/>\nlearning without teaching.  There&#39;s a reason we talk so much about<br/>\ndeschooling.   <br/>\nIt won&#39;t hurt us to think about this or talk about it on an unschooling<br/>\nlist, but a former school at home mom who &quot;encourages&quot; her still<br/>\ndeschooling child to sit down and fill out the official worksheet and<br/>\nmaybe read this or that little lesson and submit that fun data could be<br/>\ndamaging weeks or months of deschooling, thinking she&#39;s just offering<br/>\nsomething fun.   I&#39;m urging care especially because this is a list for<br/>\nnew unschoolers. <br/>\n <br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Flip a penny Tuesday","postDate":"1137474975","msgId":9063,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRxaHVpditjMGN1QGVHcm91cHMuY29tPg=="},"prevInTopic":9061,"nextInTopic":9065,"prevInTime":9062,"nextInTime":9064,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"I disagree. I think it can be thought of as linguistic shorthand- it gives you an idea of at what ages kids might enjoy this. And just because it s an","messageBody":"<div id=\"ygrps-yiv-95644143\">&quot;I disagree. I think it can be thought of as linguistic shorthand- it<br/>\ngives you an idea of at what ages kids might enjoy this. And just<br/>\nbecause it&#39;s an organized experiment doesn&#39;t mean it&#39;s counter to<br/>\nunschooling.&quot;<br/>\n<br/>\nIt&#39;s up to each of us how we use any resource out there of course.<br/>\nIt IS confusing to newer unschoolers I&#39;m sure, how some of us might<br/>\nuse &quot;schooly&quot; looking resources when our children request them, BUT<br/>\nthe activity that was brought here was simply that, an activity.<br/>\n<br/>\nNot a promotion of the site, not an encouragement for parents to<br/>\ndevote any time to a subject, just a fun &quot;flip a penny ten times&quot; for<br/>\nBenjamin Franklin&#39;s Birthday. The activity itself is harmless and fun,<br/>\nunless pushed or coerced.<br/>\n<br/>\nThere are quite a few newer members to the list, so maybe we can have<br/>\na conversation about how our children are not students, how we don&#39;t<br/>\nsee them as a certain grade and how to get more schoolish thoughts out<br/>\nof our lives and heads! That&#39;s always a good thing.<br/>\n<br/>\nBut flipping a penny won&#39;t get in the way of unschooling, unless a<br/>\nparent requires it, or tries to turn it into a math lesson or sees it<br/>\nas more valuable than something their child is really interested in,<br/>\nbut we&#39;re here to encourage less of that and more of joyful exploration!:)<br/>\n<br/>\nRen<br/>\nlearinginfreedom.com</div>","specialLinks":[]},{"userId":81783378,"authorName":"Breezy Stevens/ Lady Lasairíona of Crea","from":"=?ISO-8859-1?Q?Breezy_Stevens/_Lady_Lasair=EDona_of_Creav?= =?ISO-8859-1?Q?anore?= &lt;redgoddess@...&gt;","profile":"breezy_goddess","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Flip a penny Tuesday","postDate":"1137470938","msgId":9061,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzQ0M2RERBLjMwNjAzMDJAZ2NpLm5ldD4=","inReplyToHeader":"PDIwMDYwMTE2LjIwNDgzMi4yNzk2LjIuZGR6aW1sZXdAanVuby5jb20+","referencesHeader":"PDIwMDYwMTE2LjIwNDgzMi4yNzk2LjIuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":9060,"nextInTopic":9063,"prevInTime":9060,"nextInTime":9062,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"... Yup, that is the point, isn t it? ... I disagree. I think it can be thought of as linguistic shorthand- it gives you an idea of at what ages kids might","messageBody":"<div id=\"ygrps-yiv-976684294\">Deb Lewis wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; ***Nope, but it&#39;s still fun!   :)***<br/>\n<br/>\n </span></blockquote>Yup, that is the point, isn&#39;t it?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I&#39;m not objecting to people sending cool things to the list.  <br/>\n&gt; But lot&#39;s of new members on this list don&#39;t fully understand unschooling<br/>\n&gt; and offering that link up for K-12 students couldn&#39;t further anyone&#39;s<br/>\n&gt; understanding.<br/>\n<br/>\n </span></blockquote>I disagree. I think it can be thought of as linguistic shorthand- it <br/>\ngives you an idea of at what ages kids might enjoy this. And just <br/>\nbecause it&#39;s an organized experiment doesn&#39;t mean it&#39;s counter to <br/>\nunschooling.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;       <br/>\n&gt;<br/>\n&gt; The word &quot;student&quot; is not a word many of us would use about our kids.<br/>\n&gt; Not many of our unschoolers lives are divided into subjects.<br/>\n<br/>\n </span></blockquote>Even if we don&#39;t call them students, or learners, or whatever, that is <br/>\ncertainly one valid way of describing them. I admit that I&#39;m just as <br/>\nmuch of a student as my kids...and I hope that doesn&#39;t change, no matter <br/>\nhow old any of us gets.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;     <br/>\n&gt;<br/>\n&gt; I think it matters that the web page is school oriented in every way, has<br/>\n&gt; an official worksheet and teacher lesson plans.<br/>\n<br/>\n </span></blockquote>I&#39;ve been a strict unschooler (if that isn&#39;t a contradiction in terms!) <br/>\nfor 4 years now, and I disagree. Not only is it succinct and clear, but <br/>\nsome kids just plain like doing these kinds of things. I don&#39;t <br/>\nnecessarily encourage my kids to do things because they&#39;re considered <br/>\n&#39;educational&#39;, but I don&#39;t discourage them either. I think excluding <br/>\ncertain things because they&#39;re in a format that a school would use is <br/>\nagainst the spirit of unschooling. If I find something cool, and I think <br/>\nthis is very cool, I ask my kids if they&#39;d like to do it. They know <br/>\nthat, just like everyone else, they&#39;re free to say no if they&#39;re not <br/>\ninterested. I don&#39;t shy away from making suggestions, because I&#39;m part <br/>\nof the family too, and my ideas and suggestions are just as valid as <br/>\ntheirs. There are lots of things they&#39;d never even know about if I <br/>\nhadn&#39;t told them. And if they weren&#39;t told and found out later, they <br/>\nmight be upset. ...<br/>\n<br/>\nJust my $.02...<br/>\n<br/>\nBlessings,<br/>\nBreezy<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;  <br/>\n&gt;<br/>\n&gt; Deb Lewis <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Flip a penny Tuesday","postDate":"1137469711","msgId":9060,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMTE2LjIwNDgzMi4yNzk2LjIuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":9059,"nextInTopic":9061,"prevInTime":9059,"nextInTime":9061,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"***Nope, but it s still fun!   :)*** I m not objecting to people sending cool things to the list. But lot s of new members on this list don t fully understand","messageBody":"<div id=\"ygrps-yiv-557240984\">***Nope, but it&#39;s still fun!   :)***<br/>\n<br/>\nI&#39;m not objecting to people sending cool things to the list.   <br/>\nBut lot&#39;s of new members on this list don&#39;t fully understand unschooling<br/>\nand offering that link up for K-12 students couldn&#39;t further anyone&#39;s<br/>\nunderstanding.        <br/>\n<br/>\nThe word &quot;student&quot; is not a word many of us would use about our kids. <br/>\nNot many of our unschoolers lives are divided into subjects.     <br/>\n<br/>\nI think it matters that the web page is school oriented in every way, has<br/>\nan official worksheet and teacher lesson plans.   <br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Flip a penny Tuesday","postDate":"1137469252","msgId":9059,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRxaHAwNCszdTBpQGVHcm91cHMuY29tPg=="},"prevInTopic":9057,"nextInTopic":9060,"prevInTime":9058,"nextInTime":9060,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"And as K-12 is only a level indicator like age is and the Earth is a community...  Yeah, but K-12 is a false level, based on a very bizarre system. I like","messageBody":"<div id=\"ygrps-yiv-343225970\">&quot;And as K-12 is only a level indicator like age is and the Earth is a<br/>\ncommunity... &quot;<br/>\n<br/>\nYeah, but K-12 is a false level, based on a very bizarre system.<br/>\nI like the etymology you brought in about the origins of<br/>\n&quot;student&quot;...seems very unlike anything the schools do.<br/>\n<br/>\nFor the record, I don&#39;t have students in my home, I have children. And<br/>\nnobody is at any grade level, but I still like activities that call<br/>\nthings grade level sometimes....poor souls don&#39;t know any other way to<br/>\nlabel children. sigh.:)<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"7"},"subject":"Flip a penny Tuesday","postDate":"1137466597","msgId":9057,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRxaG1kNStvdmltQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":9059,"prevInTime":9056,"nextInTime":9058,"topicId":9057,"numMessagesInTopic":0,"msgSnippet":"This isn t the K-12 community and we don t have students. Nope, but it s still fun!:) Ren, who loves Ben Franklin, a true autodidact and forward thinker","messageBody":"<div id=\"ygrps-yiv-1177694238\">&#39;This isn&#39;t the K-12 community and we don&#39;t have students.&quot;<br/>\n<br/>\nNope, but it&#39;s still fun!:)<br/>\n<br/>\nRen, who loves Ben Franklin, a true autodidact and forward thinker</div>","specialLinks":[]}],"prevTopicId":9324,"nextTopicId":9283}}