{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Sorry...send that one too soon!","postDate":"1315953367","msgId":47266,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0b2xzbitkcHZyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo0bnZidSttbjc3QGVHcm91cHMuY29tPg=="},"prevInTopic":47264,"nextInTopic":0,"prevInTime":47265,"nextInTime":47267,"topicId":47260,"numMessagesInTopic":0,"msgSnippet":"... **************** How much is that fight worth to you in terms of your personal energy level? That s something to think about. Kids helping out don t","messageBody":"<div id=\"ygrps-yiv-769752439\">&quot;Kimmie&quot; &lt;kimmie_ruth@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I do have a question, though. From what I&#39;ve read so far by various unschoolers, it seems there is no requirement even for housework for the kids? How does this work? I have fibromyalgia and simply cannot do it all on my own (though I probably would if I could), and need my kids to help out with things. However, it&#39;s always a fight to get them to do it.<br/>\n </span></blockquote>****************<br/>\n<br/>\nHow much is that fight &quot;worth&quot; to you in terms of your personal energy level? That&#39;s something to think about. Kids &quot;helping out&quot; don&#39;t necessarily make things easier! It might be significantly easier on you to re-think how you get housework done - how would you manage if your kids couldn&#39;t help at all? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;How can I encourage them to help out without forcing them? <br/>\n<br/>\n </span></blockquote>First and most importantly, see them as very busy people engaged in important work of their own - even when they&#39;re doing sedentary things like read or watch tv. They&#39;re busy learning and discovering. Asking them to stop what they&#39;re doing to help with tasks which they don&#39;t find appealing gets in the way of their learning and discovery. <br/>\n<br/>\nNext, see the ways they help - and try to - already. It Won&#39;t look like &quot;pitching in with the housework&quot; much of the time, but if you pay attention, you&#39;ll see your kids as people who like to do nice things for you and for each other. Value those things. <br/>\n<br/>\nAt the same time, when you do housework, notice what you do and how you do it. Do you see it as a chore? Or a chance to do something kind for the people you live with? If you&#39;re doing housework grudginly, your kids won&#39;t see it as something they want to do. If they&#39;ve been fighting against housework for some time, then they&#39;ll need some time to recover, too, before They can see it as a worthwhile way to extend kindness to another person. <br/>\n<br/>\nWith All that in mind, do ask for help - but Ask ask, don&#39;t phrase a demand as a question and call it asking. They get to say &quot;I&#39;m busy&quot; or even &quot;I really don&#39;t feel like it&quot; Because they are busy people engaged in important work of their own. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I want to encourage them to learn how to care for their environment, but doing it all myself doesn&#39;t seem very inspiring to them.<br/>\n </span></blockquote>****************<br/>\n<br/>\nAhhhh, it&#39;s not *just8 because you can&#39;t - you want them to learn something specific. See that expectation and then step away from it. They won&#39;t learn what you want them to learn right now. They don&#39;t need decades to learn to keep house, they&#39;ll either pick up the skills quickly and lose interest (and they&#39;re busy people, remember!) *or* they won&#39;t have the *ability* to do what you want until puberty anyway - like figure out how to organize a messy space. And some things they won&#39;t ever see a reason for doing the way you do them. Fold the laundry? My 18yo doesn&#39;t fold laundry. My 10yo folds her clothes Her Way and doesn&#39;t like mine one bit.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Sorry...send that one too soon!","postDate":"1315946997","msgId":47264,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyRDJEMzYxLTk4QUYtNDk1Qi1CQjczLUZGMUJGOUU5REMzMUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGo0bnZidSttbjc3QGVHcm91cHMuY29tPg==","referencesHeader":"PGo0bnZidSttbjc3QGVHcm91cHMuY29tPg=="},"prevInTopic":47262,"nextInTopic":47266,"prevInTime":47263,"nextInTime":47265,"topicId":47260,"numMessagesInTopic":0,"msgSnippet":"... It s not a rule. It s from recognizing that whenever one person imposes solutions to their needs on another person, it creates resentment, tears at the","messageBody":"<div id=\"ygrps-yiv-1966042257\">On Sep 13, 2011, at 12:11 PM, Kimmie wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; From what I&#39;ve read so far by various unschoolers, it seems there is  <br/>\n&gt; no requirement even for housework for the kids?<br/>\n<br/>\n </span></blockquote>It&#39;s not a rule. It&#39;s from recognizing that whenever one person  <br/>\nimposes solutions to their needs on another person, it creates  <br/>\nresentment, tears at the relationship and results in very poor quality  <br/>\nhelp!<br/>\n<br/>\nIf, instead, one person fully owns the tasks, recognizes that any help  <br/>\nis a gift the other person is giving them, it&#39;s much easier to be  <br/>\nsincere when you approach others for assistance.<br/>\n<br/>\nHow would you ask a friend? When you ask your kids, do you ask them in  <br/>\nthe same way you would a friend? If they are less than enthusiastic,  <br/>\nare you understanding as you would be of a friend -- as in assuming  <br/>\nthe friend really has more important things to do and perhaps feels  <br/>\npressured to help you. If you&#39;re treating your kids in ways that would  <br/>\ndamage a friendship, then it&#39;s damaging your relationship with your  <br/>\nkids.<br/>\n<br/>\nWhat often works with kids is inviting them along to keep you company.  <br/>\nDraw them -- or one for some one on one time -- into what you need to  <br/>\ndo. Involve them in a natural, non-pressured way in the task. Just as  <br/>\nyou might with a friend who was hanging out with you.<br/>\n<br/>\nKids -- all people! -- like to feel useful, like they matter. People  <br/>\nlove helping others when they know they&#39;re actually helping and their  <br/>\nhelp isn&#39;t expected. They get to give their help as a gift.<br/>\n<br/>\nNo one likes to feel like conscripted labor. Especially if their labor  <br/>\nis complained about!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have fibromyalgia and simply cannot do it all on my own (though I  <br/>\n&gt; probably would if I could), and need my kids to help out with things.<br/>\n<br/>\n </span></blockquote>You&#39;re *choosing* to use your kids to meet your needs/wants. The more  <br/>\nyou&#39;re open to other options, the more you&#39;re open to changing the  <br/>\nproblem or seeing it in a new way, the easier it is to get help! If  <br/>\nsomeone chooses to sit quietly in a corner out of several options to  <br/>\nstay out of the way, it&#39;s easy for them to quietly sit in a corner. If  <br/>\nsomeone forces them to sit in the corner so they&#39;re not bothering  <br/>\npeople, they&#39;re likely to protest!<br/>\n<br/>\nFirst, give a serious look at the things you want done. Rethink  <br/>\nwhether it really needs done, and if it really needs done in the way  <br/>\nyou&#39;re doing it. What ways can it be simplified? What other ways are  <br/>\nthere to do it?<br/>\n<br/>\nToys can be thrown into bins rather than stowed neatly. Food can be  <br/>\nserved on paper plates. If there are fewer clothes in rotation,  <br/>\nthere&#39;s less laundry to do. If clean and dirty clothes are stored near  <br/>\nwhere they&#39;re washed, it&#39;s much easier to take care of them. Invite a  <br/>\nhomeschooler to be a paid helper.<br/>\n<br/>\nEvery solution comes with good and bad points so don&#39;t dismiss  <br/>\nsomething just because it has a downside you don&#39;t like. Paper plates  <br/>\nare &quot;expensive&quot; but how expensive are they really? Is the expense  <br/>\nworth it for now? (I once had it in mind that space heaters are &quot;too  <br/>\nexpensive&quot; so didn&#39;t want to run it while my daughter took a shower  <br/>\nfor a whole half hour. But I calculated it out. It costs about a  <br/>\nnickel to run for half an hour.)<br/>\n<br/>\nInvolve your kids in rethinking the tasks. Own the tasks -- and your  <br/>\nlimitations. The less they feel the asking is a new way of making them  <br/>\nhelp you, the more helpful they&#39;re likely to be. (Bring the tasks here  <br/>\ntoo and ask for ideas :-) Kids are often out of the box thinkers!  <br/>\nDon&#39;t dismiss their ideas. Write them down. (They&#39;re likely to come up  <br/>\nwith some wacky ones ;-) but there may be brilliance in the ideas when  <br/>\nlooked at from a different direction.)<br/>\n<br/>\n(Not all kids will enjoy brainstorming. Or there may be baggage in the  <br/>\nway like fear you&#39;re trying to convince them they have to help. But  <br/>\nthe more sincere you are in trying to find ways to *not* rely on them  <br/>\nto help, the more likely they will pitch in!)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I want to encourage them to learn how to care for their environment,  <br/>\n&gt; but doing it all myself doesn&#39;t seem very inspiring to them.<br/>\n<br/>\n </span></blockquote>Usually when someone has an agenda for someone else -- no matter how  <br/>\ngood, and fine, and noble they think the agenda is -- it&#39;s met with a  <br/>\nprofound lack of enthusiasm, if not downright resistance.<br/>\n<br/>\nIf you husband believed you had it in you to be a gourmet cook, and  <br/>\nhis focus became about helping you become the better you he thought  <br/>\nyou could be, would it feel like he loved who you were or loved some  <br/>\nideal he wanted to remake you into?<br/>\n<br/>\nThis is human nature. There&#39;s no getting around it. If someone feels  <br/>\nanother person sees them as in need of fixing -- even if they secretly  <br/>\nagree -- they&#39;re likely to resist being fixed.<br/>\n<br/>\nThe best approach is to love people for exactly who they are right now.<br/>\n<br/>\nI will mention that when my daughter was under 12 even tasks I thought  <br/>\nwere simple -- like matching socks or folding towels -- she treated as  <br/>\nif they were overwhelmingly complex. As puberty approached, I could  <br/>\nsee a shift in how her brain worked. And the tasks became simple for  <br/>\nher.<br/>\n<br/>\nThough I don&#39;t have problems with depression, there was one year as  <br/>\nChristmas (and it&#39;s stress) approached, I looked at the mess in months  <br/>\nof accumulated mess in the hallway that &quot;had to&quot; be cleaned up and  <br/>\nfelt overwhelmed, like it was an insurmountable problem that I had no  <br/>\nidea how how to begin tackling. I suspect that&#39;s how most kids feel  <br/>\nabout even a small mess. It&#39;s just an big lump of confusion and they  <br/>\ndon&#39;t know what to do or where to begin.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Sorry...send that one too soon!","postDate":"1315935348","msgId":47262,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4MEFEOUZFNTlAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":47260,"nextInTopic":47264,"prevInTime":47261,"nextInTime":47263,"topicId":47260,"numMessagesInTopic":0,"msgSnippet":"If you need real help, ask for it. Keep in mind that asking, really ASKING, means that No is a possible answer. Where you ve most unschoolers say no","messageBody":"<div id=\"ygrps-yiv-243293108\">If you need real help, ask for it. Keep in mind that asking, really ASKING, means that No is a possible answer. Where you&#39;ve most unschoolers say &quot;no housework/chores&quot; what it looks like is more like &quot;no arbitrarily assigned chore charts, with attendant reward/punishment&quot;. I ask my son to help out all the time. For example, last Wednesday, hubby was prepping dinner (he&#39;s the at home parent and a fabulous cook!) Wednesday is also the day that the trash barrel and the recycling barrel go to the curb. We prefer to get them to the curb before dark for various reasons. I asked DS to grab the kitchen recycling bin (a smaller bin that can hold several days&#39; worth of recycling that gets dumped into the larger outdoor barrel) and dump it into the recycling barrel while I collected the household trash from the various small trashcans around the house. He could have said No; In a minute; Okay. He chose (based on his current activity) to just pause what he was doing and take care of it. He even took the barrel to the curb (which I hadn&#39;t even asked!) It all got done easily. BUT (here&#39;s the hard part) we&#39;ve got a lot of time in already in this interaction. He knows he can say No or In a minute without repercussions. He also knows that there&#39;s no promise of a &#39;reward&#39; for doing it either (aside from a thank you - same as I would say Thank you to you if you helped me with the trash barrel). We&#39;ve had YEARS of helping him, YEARS of no &#39;chore charts&#39;, YEARS of simply doing what needed doing and asking him along, YEARS of ALLOWING him to help - even when his 3 yr old self was barely able to evenly fold dish towels (and that takes some restraint on the adult&#39;s part, to not critique or &#39;fix&#39; what was done in good faith, but to accept the help generously and provide assistance/guidance when asked and not before).<br/>\n<br/>\nKeep in mind that your priorities are not theirs - they probably have no thought whatsoever for &quot;caring for their environment&quot;. That&#39;s your priority. Their priority is whatever it is they are doing Right Now. Most of the housework in our house is based on the same principles as everything else: be safe, respect others. So, leaving wee Lego pieces on the stairs is OUT - that&#39;s not safe. Pushing my books onto the floor to make space for something is not respecting my stuff (or me). So, there&#39;s discussion involved (here&#39;s one from when DS was about 3 or 4 - he&#39;s 13 now): &quot;Hey &lt;DS&gt;, it looks like &#39;stoopid hound&#39; likes to chew on Legos. Those sharp corners probably aren&#39;t very safe for him to chew (much less what they do to his digestion! Yes, I&#39;ve found multi-colored dog droppings in the yard!). Let&#39;s try to figure out a way to make it safe for him and fun for you to still play with your Legos.&quot; Note the inclusive &quot;we&quot; type language - it&#39;s not HIS job, it&#39;s not MY job, it&#39;s OUR job to figure this out. In this circumstance, we ended up putting an old king size sheet on the floor for Lego play. Thus, when Lego play was done for the hour or the day, we could grab the corners and collect up the Legos easily and pop the whole thing right into a big Rubbermaid bin. Easy in, easy out, less multi colored dog doo. Making tasks small and simple is important - saying &quot;clean the kitchen&quot; is hard (even for adults); saying &quot;please put the forks from the dish drainer into the silverware drawer, with the rest of the forks&quot; is easier. To this day, and hubby and I are well past 10 yrs old!), if we&#39;re having company (more than the usual household cleaning), we make a list of bits - I&#39;ll label sections &quot;Kitchen&quot;, &quot;Bathroom&quot;, &quot;Living Room&quot; and then under each is a list of sub-tasks: clean mirror, clean sink/counter, clean toilet, shake out mat, sweep floor, fresh hand towels, light candle. Little bite size pieces that can be done in almost any order by whomever has the time/space/energy to do them. Along the way, there might be side-tasks &quot;Hey &lt;DS&gt;, I&#39;m about to sweep in the living room, would you please pick up the shoes and put them in the shoe corner?&quot; He might just do it; he might say &quot;Just a sec, gotta get through this battle so I can pause&quot;; etc.<br/>\n<br/>\nAlso, what is YOUR attitude toward the housework? If it&#39;s drudgery, heck yeah, who in their right mind would want to help with it? If, however, the household tasks are seen as simply part of the day to day life in the household, no better or worse than sorting the mail, watching TV, eating dinner, it changes the whole dynamic. And, yes, your attitude, whether verbalized or not, will color how they view things. It&#39;s pretty amazing how quickly things go downhill at our house if I bring home a lousy attitude after a long day at work. If I can either adjust my attitude during the drive home or simply get it out in the open &quot;hey guys I had a really rough day today, I want to apologize ahead of time for anything I may do or say that is grumpy&quot; So, I guess this kinda goes back to the beginning in a way - get your Real needs out on the table &quot;Hey gang, I&#39;m having a really bad day today with my health. I&#39;m needing your help with preparing lunch. Kid A - please get the forks; Kid B - bring over the cups; Kid C - grab the bread from the counter and bring it to the table; I&#39;ll grab the PBJ and a spreading utensil.&quot; The flip side might be, when you&#39;re having a better day, to simply set the table and include any of the offspring who happen by &quot;Kid A, while I&#39;m setting the table, can you grab the jam from the fridge. Thanks&quot;<br/>\n<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":262558962,"authorName":"Kimmie","from":"&quot;Kimmie&quot; &lt;kimmie_ruth@...&gt;","profile":"kimmie_ruth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Sorry...send that one too soon!","postDate":"1315930302","msgId":47260,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0bnZidSttbjc3QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":47262,"prevInTime":47259,"nextInTime":47261,"topicId":47260,"numMessagesInTopic":0,"msgSnippet":"My 2 year old was trying to help me type and that message got sent too soon! :) Anyway, that year we sent them back and then last year were difficult. School","messageBody":"<div id=\"ygrps-yiv-1001157182\">My 2 year old was trying to help me type and that message got sent too soon! :) Anyway, that year we sent them back and then last year were difficult. School was such a beat-down, they were exhausted when they came home, and didn&#39;t want to learn anything because they were being forced to &quot;learn&quot; at school. It wasn&#39;t a difficult decision to bring them home. And when I hear people say they are so relieved their kids are back in school so they can have a break--I don&#39;t get that. I mean, I get wanting to have a break sometimes, as my kids can be very difficult, but sending them to school was never a relief! It was stressful.<br/>\n<br/>\nAnyway, my husband is a cop, and is more detail-oriented than I (pretty much everyone is more than I because I am not at all), and feels like we have to make sure they &quot;learn something&quot;. I told him, however, that what they needed was to decompress and get the bad school taste out of their mouths, and remember how fun it is just to learn. He has accepted this better and more quickly than I expected! My family might have a harder time accepting our approach, but they&#39;ll get over it.<br/>\n<br/>\nI do have a question, though. From what I&#39;ve read so far by various unschoolers, it seems there is no requirement even for housework for the kids? How does this work? I have fibromyalgia and simply cannot do it all on my own (though I probably would if I could), and need my kids to help out with things. However, it&#39;s always a fight to get them to do it. How can I encourage them to help out without forcing them? I want to encourage them to learn how to care for their environment, but doing it all myself doesn&#39;t seem very inspiring to them.<br/>\n<br/>\nAlso, how do y&#39;all deal with sibling issues, especially when they are together all the time? Maybe things will improve after we&#39;ve been at home a while? <br/>\n<br/>\nWell anyway, I&#39;m excited to get to know people on here, and hear how other families go about their days and learn and do life.<br/>\n<br/>\nKimmie</div>","specialLinks":[]}],"prevTopicId":47224,"nextTopicId":47241}}