{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":285320662,"authorName":"Johanna","from":"Johanna &lt;dialog@...&gt;","profile":"solelokua","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"looking for Au-Pair again!","postDate":"1225202649","msgId":36806,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFERjc4NkUwLUYwMEItNDQ0OC04MERGLTNCRDYzMzFBMjA0RkB1bmVyem9nZW4uZGU+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":36805,"nextInTime":36807,"topicId":36806,"numMessagesInTopic":0,"msgSnippet":"Hello, some of you might remember me -- Johanna from Germany :-) A year ago, I wrote here and in other mailinglists looking for an unschooling Au- Pair -- and","messageBody":"<div id=\"ygrps-yiv-1512753933\">Hello,<br/>\n<br/>\nsome of you might remember me -- Johanna from Germany :-) A year ago,  <br/>\nI wrote here and in other mailinglists looking for an unschooling Au- <br/>\nPair -- and we found someone! Thank you, whoever forwarded the message  <br/>\nto the right person! Now a year has passed, our friend is going home  <br/>\nsoon and we are looking again!<br/>\n<br/>\nWe are looking for an Au-Pair, though it should be someone who is as  <br/>\nrespectful with kids as we are, so we thought an unschooler would be  <br/>\nperfect -- we also unschool our kids (as far as German law allows).<br/>\n<br/>\nDoes any one happen to know anybody who&#39;d like to spend a 6, 9 or 12  <br/>\nmonths in Germany?<br/>\n<br/>\nWorking as an Au-Pair...<br/>\n<br/>\n... you pay your flight here and back yourself<br/>\n... you eat with the host family and have an own lockable room (has to  <br/>\nbe at least 8qm, but ours is bigger) in the family&#39;s home (both of  <br/>\nwhich you don&#39;t have to pay)<br/>\n... you help with household whenever it is related with the kids<br/>\n... you help with the care of the kids, so the parents can work, also  <br/>\nyou babysit 1-2 times in the week if required<br/>\n... you don&#39;t work more than 6 hours a day and not more than 30 hours  <br/>\na week (babysitting included)<br/>\n... you get an allowance of 260 € per month, also during vacation<br/>\n... you have a vacation of 4 weeks if you stay 1 year, or else 2 days  <br/>\nper month if you stay less than a year (one has to stay at least 6  <br/>\nmonths)<br/>\n... you pay your own language course (in Germany: German), the host  <br/>\nfamily has to allow you time to go there<br/>\n... you have at least one free day in the week, at least one of those  <br/>\nin the month has to be a sunday<br/>\n... you&#39;d have a real contract. All the formalities would be taken  <br/>\ncare of by an agency (which we can choose together), normally, the  <br/>\ncontact making through the agency doesn&#39;t cost anything for the Au- <br/>\nPair (but for us).<br/>\n... the host family pays your health insurance, also an insurance for  <br/>\nthings you break or loose, and also in case you damage the kids or the  <br/>\nhost family in some way<br/>\n... the agency normally offers cheap city tours in Europe for the Au- <br/>\nPairs and meetings with other Au-Pairs (like Rome for 175 € I don&#39;t  <br/>\nknow how many days, though, I guess for the weekend)<br/>\n<br/>\n<br/>\nAn Au-Pair does NOT:<br/>\n... clean up the whole house or wash underwear of the host family :)<br/>\n... take care of the kids the whole time<br/>\n... make ALL meals for the whole family<br/>\n<br/>\n<br/>\nThe rest will have to be accorded between us (for example, how much  <br/>\ntime to spend on the phone, which kinds work to do in the household  <br/>\netc.)<br/>\n<br/>\nYou can find a lot more information on the internet of course.<br/>\n<br/>\nWe live in Leipzig, which is a thriving city 2 car hours from Berlin.  <br/>\nWe&#39;ve got three kids: Our daughter, 9 (she&#39;s in a school wich  <br/>\nunschools, unfortunately we can&#39;t fully unschool because it is illegal  <br/>\nin Germany, so it has to be in a building), and two sons: one is 3  <br/>\nyears old and the baby is 5 months old.<br/>\n<br/>\nWe -- both parents -- work mostly at home so you wouldn&#39;t have to stay  <br/>\nwith the kids the whole day alone, but rather with us. We enjoy being  <br/>\nwith our kids but we also really do have to and want to work, so this  <br/>\nis the solution we&#39;ve come up with :-) You&#39;d be taking care of the two  <br/>\nboys, and you should be able to carry the very little one around in a  <br/>\nbaby carrier :-)<br/>\n<br/>\nWe are NOT very tidy and clean, rather unorganized. We don&#39;t smoke,  <br/>\nand we wouldn&#39;t want someone who smokes :-) We eat in parts organic  <br/>\nfood, but only what we can afford. My partner is vegetarian  <br/>\n(pescetarian), the rest of the family is not, we eat a lot of fish and  <br/>\ndon&#39;t cook much meat because it&#39;s just too much work to cook two  <br/>\ndishes, but we wouldn&#39;t mind if you did cook your own meat.<br/>\n<br/>\nWe have internet :-D and a WII and a TV. We do family activitites in  <br/>\nthe weekends and we especially have rather little time to go out with  <br/>\nthe kids during weekdays, which is what we&#39;d expect you to do  <br/>\nespecially with the three year old (as long as he wants to :-)).<br/>\n<br/>\nYou need to speak German in Level A1 according to regulations. This  <br/>\nwill be tested with three questions by we donÄt know exactly who. If  <br/>\nyou are from Europe (EU) or have a second passport from a EU-Country,  <br/>\nlanguage skills won&#39;t be required (they just don&#39;t test it). With us  <br/>\nand the kids you can speak English or Spanish if you feel more  <br/>\ncomfortable with (though  you&#39;d probably want to improve your German).<br/>\n<br/>\nBefore making up a contract, we want to have e-mail contact, hopefully  <br/>\nchat and videochat contact and of course by phone.<br/>\n<br/>\nIf anyone can help us, thank you very much! Please contact us via: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dialog@...\">dialog@...</a> <br/>\n  -- we&#39;re on no-mail in the mailinglists! Feel free to forward to  <br/>\nother unschooling, continuum concept, consensual living, attachment  <br/>\nparenting etc. mailinglists and to your friends from anywhere around  <br/>\nthe world!<br/>\n<br/>\nJohanna<br/>\n<br/>\n<br/>\n<br/>\n--<br/>\nwww.unerzogen.de<br/>\nwww.unerzogen-magazin.de<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://de.groups.yahoo.com/group/unerzogen/\">http://de.groups.yahoo.com/group/unerzogen/</a><br/>\n<br/>\n<br/>\n<br/>\n--<br/>\n(Mit Sohn (2), Tochter (9) und Baby *31.05.08!)<br/>\n<br/>\n-------------------------------------------------<br/>\nGeflüstert wird nicht! - UNERZOGEN<br/>\nwww.unerzogen-magazin.de<br/>\n-------------------------------------------------</div>","specialLinks":[]}],"prevTopicId":36744,"nextTopicId":36808}}