{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Food and Fear (VERY VERY LONG!)","postDate":"1152882335","msgId":15755,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0QTUyQUMzLUFFRUMtNDVDNi1CMzBGLUY1NTkyQzhGMURFOEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGU5NmMxNytoazZlQGVHcm91cHMuY29tPg==","referencesHeader":"PGU5NmMxNytoazZlQGVHcm91cHMuY29tPg=="},"prevInTopic":15737,"nextInTopic":0,"prevInTime":15754,"nextInTime":15756,"topicId":15710,"numMessagesInTopic":0,"msgSnippet":"... Yes, of course. Especially when they re little and they think we know everything :-) But every trust me that turns out not to be right whittles away at","messageBody":"<div id=\"ygrps-yiv-275022657\">On Jul 13, 2006, at 4:56 PM, techwritercsbn wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But in the context of a solid, trusting, loving relationship, might<br/>\n&gt; they believe us even if they can&#39;t see the effects?<br/>\n<br/>\n </span></blockquote>Yes, of course. Especially when they&#39;re little and they think we know  <br/>\neverything :-) But every &quot;trust me&quot; that turns out not to be right  <br/>\nwhittles away at their trust in us.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but<br/>\n&gt; my child might not understand the research yet.<br/>\n<br/>\n </span></blockquote>That&#39;s why it&#39;s more honest to present information in terms of what  <br/>\nwe believe and let go of the fears that they&#39;ll make different choices.<br/>\n<br/>\nMaybe it will make it clearer if I make the distinction between what  <br/>\nI choose to buy for the family (since that&#39;s my role) and what my  <br/>\ndaughter can buy/choose/eat for herself. For instance if she picks up  <br/>\nmargarine in the store instead of butter I can tell her I prefer  <br/>\nbutter because of the hydrogenated oils in margarine. If she wants to  <br/>\nknow more I can tell her what I&#39;ve read. (If she wanted to try  <br/>\nmargarine, I&#39;d probably suggest trying the packets at a restaurant  <br/>\njust because we don&#39;t use spreads much so a whole stick would be  <br/>\naround forever. But if she really wanted to try now, I&#39;d just buy it  <br/>\nbecause the price of one stick ($1 maybe?) isn&#39;t much of a sacrifice.)<br/>\n<br/>\nWhat I pass on provides her with information in helping her make her  <br/>\nown decisions. I don&#39;t want to make her feel bad about choosing  <br/>\ndifferently. I don&#39;t want to frighten her into making the decisions I  <br/>\ndo. Because it really isn&#39;t necessary. With food she can experiment.  <br/>\nThere isn&#39;t anything in the grocery store that is going to cause  <br/>\nlasting harm if she tries it, even if she tries a lot of it because  <br/>\nthe foundation of her diet isn&#39;t heavily laden with &quot;unpronounceables&quot;.<br/>\n<br/>\nI should point out that the above isn&#39;t about &quot;the right unschooling  <br/>\ndiet&quot;. ;-) It&#39;s about parents living principles, providing an  <br/>\nenvironment we think is important, while giving the child freedom to  <br/>\nchoose for themselves. It applies whether the parents&#39; principles and  <br/>\nenvironment are vegan or organic or Christian or green or close to  <br/>\nnature or anti-consumer or whatever.<br/>\n<br/>\nWith cigarettes and drugs she also has the information from  <br/>\nconversations that have popped up over the years. And I know I can&#39;t  <br/>\ncontrol what she will ultimately do but I think it&#39;s highly unlikely  <br/>\nthat she&#39;ll do either for a variety of off-putting reasons, not the  <br/>\nleast of which is the expense. I think most kids start smoking 1) to  <br/>\nfit in with their friends 2) to choose differently than their parents  <br/>\nwould choose for them. When life is all about &quot;choosing&quot; what your  <br/>\nparents want you to choose -- which isn&#39;t really a choice! -- kids  <br/>\nwill often choose something they don&#39;t really want when they&#39;re out  <br/>\nof their parents&#39; sight just to be able to choose. It&#39;s only slightly  <br/>\nmore of a choice to choose the forbidden, but when choice is limited  <br/>\nit probably feels like freedom!<br/>\n<br/>\nIf my daughter started smoking, no, I wouldn&#39;t buy them for her.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;d hope we have<br/>\n&gt; enough trust that she wouldn&#39;t disbelieve me because she sees people<br/>\n&gt; who are fine eating everything under the sun.<br/>\n<br/>\n </span></blockquote>The key, of course, is trust! And really the whole conversation isn&#39;t  <br/>\nreally about food but about the principles of maintaining our  <br/>\nchildren&#39;s trust in us and giving them a safe environment to  <br/>\nexperiment and choose in.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 1) If eating unhealthfully does not cause immediate and apparent<br/>\n&gt; negative effects, children won&#39;t trust parents that tell them about<br/>\n&gt; the dangers of certain dietary choices because they can&#39;t see/feel<br/>\n&gt; said effects<br/>\n<br/>\n </span></blockquote>No. I did say that or something similar but to a child, that&#39;s what  <br/>\nit will feel like if a parent is afraid the child will make choices  <br/>\nother than what the parents wants them to. If the parent&#39;s attitude  <br/>\nis &quot;You need to make this choice because other choices will harm  <br/>\nyou,&quot; when kids go out in the world and see people who aren&#39;t being  <br/>\nharmed, they&#39;re going to know it&#39;s a lie.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 2) Humans crave, and thus eat, only what the body needs and will<br/>\n&gt; achieve a healthy dietary balance if raised in a family that imposes<br/>\n&gt; no dietary limits<br/>\n<br/>\n </span></blockquote>No, that&#39;s obviously not true! I don&#39;t need Dove chocolate! ;-)  <br/>\n(Except for whatever the chemical is in chocolate that women often  <br/>\ncrave right before their periods ;-) But I believe, when given the  <br/>\nfreedom to choose, our bodies will be drawn to the nutrition they&#39;re  <br/>\n*in need of*. If we&#39;re shy on calcium, we&#39;ll feel like eating  <br/>\nsomething with calcium without consciously thinking &quot;I need calcium.&quot;<br/>\n<br/>\nMaybe most accurate to say is that children will naturally be drawn  <br/>\nto the basic nutrition they need from what they&#39;re provided and what  <br/>\nthey&#39;re used to. Will that naturally be optimal? I don&#39;t know. And  <br/>\nthat&#39;s the decision each will have to decide for themselves. Maybe  <br/>\nsomeone -- and I&#39;m not saying you! just speaking in generalities --  <br/>\nwill decide that their highest priority is making sure no unnatural  <br/>\nsubstances will pass the lips of their children. But since here, on  <br/>\nthis list, we believe relationships are most important and there  <br/>\nisn&#39;t a way to exert that much control without compromising the  <br/>\nrelationship in someway, that idea won&#39;t be given equal weight on the  <br/>\nlist!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 3) Smoking leads to disease, but the link between nutrition and<br/>\n&gt; disease is not as strong<br/>\n<br/>\n </span></blockquote>That I do believe. I think there&#39;s strong evidence that some choices  <br/>\nare better than others. (Though genetics plays a factor so there  <br/>\nisn&#39;t one right choice for all.) I make some &quot;better safe than sorry&quot;  <br/>\ndecisions about the diet I provide for my family. I won&#39;t say &quot;Trans- <br/>\nfatty acids are poison and I can&#39;t let you eat them.&quot; But I will say  <br/>\n&quot;I prefer to avoid them in the decisions I make for the family and  <br/>\nnot take the chance.&quot; (Though I do like Oreos!)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also, why does a comparison with cigarettes make people upset?  Is it<br/>\n&gt; not the same philosophical point i.e. limiting choice in a child that<br/>\n&gt; you would not limit in an adult?<br/>\n<br/>\n </span></blockquote>Not upset. I don&#39;t see cigarettes and food as a valid comparison and  <br/>\nit just muddles the thinking.<br/>\n<br/>\nYes, we all draw the line somewhere on what we will expose and  <br/>\nintroduce to our children. The point isn&#39;t to give them everything as  <br/>\nthough all were equal, but to provide access *to what interests them*  <br/>\nand a safe environment to explore in. I also need to run things  <br/>\nthrough my daughter&#39;s life that I think she might be interested in.  <br/>\nCigarettes just don&#39;t fall into &quot;interested&quot; or &quot;think she might be  <br/>\ninterested&quot; categories. She isn&#39;t interested in porn or talky adult  <br/>\nmovies or cock fights or hunting ....<br/>\n<br/>\nWe could speculate what if she wanted to try something I think is  <br/>\ndangerous but real examples work better because, as reasonable as the  <br/>\nquestion &quot;What if she wants to smoke?&quot; sounds, the situation doesn&#39;t  <br/>\ncomes out of no where and made up scenarios can be what if&#39;d to the  <br/>\npoint where they don&#39;t match anyone&#39;s life.  (While still *sounding*  <br/>\nplausible.)<br/>\n<br/>\nParents have helped their kids try out things the parents are nervous  <br/>\nabout like ATVs and horror movies. It&#39;s a lot more useful to discuss  <br/>\nthings that kids have actually asked to try rather than speculate  <br/>\nabout &quot;What if?&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; we give our kids the information and then let them choose,<br/>\n&gt; fully support the choice even if it isn&#39;t one we&#39;d make if the danger<br/>\n&gt; isn&#39;t apparent right then lest they not trust us, etc.<br/>\n<br/>\n </span></blockquote>That *is* what we&#39;re talking about. :-)<br/>\n<br/>\nThat&#39;s not the attitude of most people who come to unschooling boards  <br/>\nand are certain they are right about nutrition (and plastic and TV  <br/>\nand ....) and how they will make sure their kids have only access to  <br/>\nwhat is right and good.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; A kid isn&#39;t likely to drop dead<br/>\n&gt; from smoking 10 packs of cigarettes or eating 10 gallons of ice<br/>\n&gt; cream.  They are both likely to look and feel equally healthy.<br/>\n&gt;<br/>\n&gt; Is there no one who sees this as a valid parallel?<br/>\n<br/>\n </span></blockquote>I think the big difference is there&#39;s so much that&#39;s unattractive  <br/>\nabout smoking that few kids are going to ask mom to buy them  <br/>\ncigarettes so they can try because they saw Sorcha&#39;s parents smoking!  <br/>\nBut they *will* likely ask to have some food they&#39;ve tried elsewhere.  <br/>\nOr a violent video game. Or to see a scary movie. How we handle those  <br/>\nreal scenarios is much more helpful than speculating about kids  <br/>\ntrying cigarettes.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And there are no studies that show that kids without limits are<br/>\n&gt; healthier than their limited counterparts either<br/>\n<br/>\n </span></blockquote>The discussion shouldn&#39;t be about what we believe is healthy but how  <br/>\nwe handle our children&#39;s explorations beyond our values about whether  <br/>\nfears of what children will do if they aren&#39;t controlled are true or  <br/>\nnot. My point in point out how kids aren&#39;t eating nothing but junk  <br/>\nfood (or doing nothing but watch TV, or doing nothing by IMing their  <br/>\nfriends) isn&#39;t that they&#39;ll naturally be as healthy as a child raised  <br/>\nvegan (as just as an example since maybe studies will show vegans  <br/>\naren&#39;t that healthy ;-) but that they will gravitate towards  <br/>\nnutritious food. As nutritious as you would serve? Probably not. Is  <br/>\nit necessary? We can&#39;t really know.<br/>\n<br/>\nTo the best of my ability I provide what I believe to be a healthful  <br/>\nenvironment and I pass on why I make the choices I do.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve never seen a kid shun all nutritious<br/>\n&gt; food -- though my nephew (always unlimited) will not eat anything<br/>\n&gt; resembling a vegetable.<br/>\n<br/>\n </span></blockquote>And maybe that&#39;s just his body chemistry! About the only vegetable my  <br/>\nfather in law would eat was peas and I think that&#39;s true of 2 of his  <br/>\nsons. (My husband will eat most vegetables but his favorite is peas.)  <br/>\nIs it nature or nurture? I suspect some of each.<br/>\n<br/>\nMy daughter ate a large variety of foods until she was 4 and then her  <br/>\ntaste changed and it narrowed down to a few until 11ish and then it  <br/>\nexpanded again and she&#39;ll try just about anything again. I don&#39;t know  <br/>\nwhy. It&#39;s not uncommon for that to happen to kids. But they *seem* to  <br/>\nget the nutrition they need.<br/>\n<br/>\nIf science could determine the *optimal* chemistry for each  <br/>\nindividual, would she have passed? I have no idea. And I think it&#39;s  <br/>\nhelpful not to worry about it! I think we&#39;re trained too much to  <br/>\nworry that there&#39;s too much that we can&#39;t know unless we&#39;re an expert  <br/>\nand our intuition and natural instincts too much looked down upon.  <br/>\nThat&#39;s not an easy conclusion for me to come to being of an  <br/>\nengineering/scientific bent! ;-) I want hard facts and data and there  <br/>\nto be a Right Answer. But life just feels more pleasant when we skim  <br/>\nthe surface to glean some information and just live life and trust.  <br/>\nMy gut feeling is that as long as we eat relatively naturally (hard  <br/>\nto define that simply) that we&#39;re going to increase the odds a great  <br/>\ndeal. But any diet changes above and beyond that are only going to  <br/>\nincrease the odds a bit and only for some people.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I agree here, except that most schooled kids I know have diets that<br/>\n&gt; sound exactly like the diets described on this and other unschooling<br/>\n&gt; boards (some healthy, some not).<br/>\n<br/>\n </span></blockquote>And it probably comes down to what mom provides. Kids are more likely  <br/>\nto eat whole foods if that&#39;s what they equate with a loving home  <br/>\n*and* they aren&#39;t made to feel guilty about choosing or forbidden to  <br/>\neat non-whole foods.<br/>\n<br/>\nMaybe to sum it up, there&#39;s two ways to increase the chance of kids  <br/>\nliking hot dogs: 1) provide them as part of the regular diet or 2)  <br/>\nforbid them. ;-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; During a<br/>\n&gt; mindless urge to munch, I might just grab that which is most<br/>\n&gt; convenient.<br/>\n<br/>\n </span></blockquote>Which is why many parents come to the conclusion their kids prefer  <br/>\njunk food to nutritious food. Often it&#39;s because junk food is  <br/>\nconvenient!<br/>\n<br/>\nAnd that&#39;s why people suggest making nutritious food as convenient or  <br/>\nmore convenient than snack food. We  can keep the chips out of sight  <br/>\n(so kids eat them when they want rather than because they&#39;re easy)  <br/>\nand put a platter of veggies, fruits, crackers and dips out where  <br/>\nkids can grab it easily.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m perhaps offending some people (hence the need<br/>\n&gt; to defend personal household diets?)<br/>\n<br/>\n </span></blockquote>No, not at all. We&#39;re not defending diets but emphasizing that choice  <br/>\nisn&#39;t the path to anarchy and a steady diet of junk food parked in  <br/>\nfront of the TV where they watch whatever happens to come on ;-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Actually, what you&#39;ve said goes against the science out there if you<br/>\n&gt; look at a unprocessed, plant-based diet vs. any other diet.<br/>\n<br/>\n </span></blockquote>I&#39;ve probably said it enough ;-) but it&#39;s helpful not to see the  <br/>\ndiscussion specifically about food, but about eliminating fear of  <br/>\nwhat will happen if we don&#39;t control our kids and make them make the  <br/>\n&quot;choices&quot; we would for them.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":187549037,"authorName":"techwritercsbn","from":"&quot;techwritercsbn&quot; &lt;techwritercsbn@...&gt;","profile":"techwritercsbn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and Fear (VERY VERY LONG!)","postDate":"1152825469","msgId":15732,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU5NmQ5dCtocWJpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU5NjNxcCtvZDhhQGVHcm91cHMuY29tPg=="},"prevInTopic":15718,"nextInTopic":15737,"prevInTime":15731,"nextInTime":15733,"topicId":15710,"numMessagesInTopic":0,"msgSnippet":"... it ... God, I loved Pop Tarts (frosted cherry)!  Have to have one once in a while!  I should review the archives.  It may have been another list, but I","messageBody":"<div id=\"ygrps-yiv-386043066\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Kiersten Pasciak&quot; <br/>\n&lt;kjl8@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I don&#39;t believe anyone here has ever mentioned &quot;stocking&quot; the house <br/>\n&gt; with unasked for things. We have been discussing how people handle <br/>\n </span></blockquote>it <br/>\n<blockquote><span title=\"ireply\"> &gt; when kids ASK for something. As they get older, they will sometimes <br/>\n&gt; ask for things outside your comfort zone. Perhaps even a Pop-Tart :)<br/>\n<br/>\n </span></blockquote>God, I loved Pop Tarts (frosted cherry)!  Have to have one once in a <br/>\nwhile!  I should review the archives.  It may have been another list, <br/>\nbut I thought I had seen many people saying we always buy lots and <br/>\nlots of XYZ or keep a bowl of M&Ms out, etc.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If you make statements about how <br/>\n&gt; dangerous or unhealthy things are and they don&#39;t personally SEE <br/>\n </span></blockquote>that, <br/>\n<blockquote><span title=\"ireply\"> &gt; they may not trust what you say. When it comes to important <br/>\n </span></blockquote>decisions <br/>\n<blockquote><span title=\"ireply\"> &gt; later on, you may not even be consulted.<br/>\n<br/>\n </span></blockquote>I guess I&#39;m lucky then, because I could *show* them.  But I&#39;m trying <br/>\nto avoid the fear tactics :)  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think one of the most important part of unschooling is helping <br/>\n </span></blockquote>our <br/>\n<blockquote><span title=\"ireply\"> &gt; children learn how and where to look for information. In the case <br/>\n </span></blockquote>of <br/>\n<blockquote><span title=\"ireply\"> &gt; cigarettes, it is not difficult to find scientific studies on the <br/>\n&gt; effects of smoking, pictures of what it does to internal organs or <br/>\n&gt; your mouth and teeth, or to know someone in real life who is <br/>\n </span></blockquote>suffering <br/>\n<blockquote><span title=\"ireply\"> &gt; from a smoking related illness. Or to talk to smokers about what <br/>\n </span></blockquote>they <br/>\n<blockquote><span title=\"ireply\"> &gt; like about it/ what they don&#39;t, have they ever tried to quit, etc.<br/>\n<br/>\n </span></blockquote>Yes, and I guess I can do that with excessive fats and coronary <br/>\nartery disease, diabetics and sugar, etc., but that seems like <br/>\nscaring them into not smoking, not eating sugar, not eating fats, <br/>\netc., doesn&#39;t it?<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; It is just as easy to help them learn about sources for nutrition <br/>\n&gt; information. With nutrition, however, it is more complex that <br/>\n </span></blockquote>smoking. <br/>\n<blockquote><span title=\"ireply\"> &gt; Just because you believe, for example, that low-fat or vegetarian <br/>\n </span></blockquote>is <br/>\n<blockquote><span title=\"ireply\"> &gt; best, that doesn&#39;t make it best for EVERYONE. <br/>\n<br/>\n </span></blockquote>True, and we all have different priorities as well.  Still, <br/>\nregardless what any of us believe or want to believe, excepting for <br/>\nspecific medical conditions, the same nutrient needs apply to almost <br/>\nevery human.  We need real food -- and not just 75%.  There is a <br/>\nwonderful variety of foods from which to get those nutrients.  But I <br/>\nwill say, to get enough nutrients, there isn&#39;t a lot of room for <br/>\nlower-nutrient foods (maybe a few hundred calories a day max), <br/>\nbecause the sheer volume of produce alone is so filling :)  <br/>\n<br/>\nI&#39;ve also gone through multiple ways of eating (though variations on <br/>\nattempting to get more healthful).  My favorite was &quot;starchatarian&quot; <br/>\nwhich is where I thought I was vegetarian, but really only had a <br/>\nsalad or two a day, some beans, and maybe one cooked vege and a piece <br/>\nof fruit.  The rest was processed, refined, fatty, salty, you name <br/>\nit.  Not healthy at all and that was when I labeled <br/>\nmyself &quot;vegetarian&quot;.  Most of my calories didn&#39;t come from nutrient-<br/>\nrich stuff at the end of the day.  Now I don&#39;t really have a label <br/>\n(whew!).      <br/>\n<br/>\nWe all have to do what is best for us with the information we have.  <br/>\nI&#39;m working to give the kids the info, but in the meantime........??</div>","specialLinks":[]},{"userId":187549037,"authorName":"techwritercsbn","from":"&quot;techwritercsbn&quot; &lt;techwritercsbn@...&gt;","profile":"techwritercsbn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and Fear (VERY VERY LONG!)","postDate":"1152824167","msgId":15737,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU5NmMxNytoazZlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDYwNzEzMTg1MjM3LjUyMTU5LnFtYWlsQHdlYjU0NDA1Lm1haWwueWFob28uY29tPg=="},"prevInTopic":15732,"nextInTopic":15755,"prevInTime":15736,"nextInTime":15738,"topicId":15710,"numMessagesInTopic":0,"msgSnippet":"... Oh yes, she eats as much as she wants.  I m just preparing for the future, as many have said her willingness and enjoyment of all these foods might change.","messageBody":"<div id=\"ygrps-yiv-380292409\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Manisha Kher &lt;m_kher@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; If she doesn&#39;t even like most of it, why are you so<br/>\n&gt; concerned? It sounds like she&#39;s eating as much as she<br/>\n&gt; wants. <br/>\n<br/>\n </span></blockquote>Oh yes, she eats as much as she wants.  I&#39;m just preparing for the <br/>\nfuture, as many have said her willingness and enjoyment of all these <br/>\nfoods might change.<br/>\n<br/>\n   <br/>\n<blockquote><span title=\"ireply\"> &gt; I have never introduced non-nutritious food on my own.<br/>\n&gt; For me the question has always been about what do I do<br/>\n&gt; when they ask for something that is not particularly<br/>\n&gt; nutritious. Then I offer other equivalent choices or<br/>\n&gt; buy it. I explain why I think it&#39;s not nutritious -<br/>\n&gt; just the facts mostly sugar, no protein, too many<br/>\n&gt; additives etc. I also try to balance it by offering<br/>\n&gt; some nutritious choices. For example, if my kids want<br/>\n&gt; coco puffs cereal we buy it. But my daughter needs a<br/>\n&gt; lot of fiber. So I explain to her about coco puffs not<br/>\n&gt; having enough fiber and that she should eat some<br/>\n&gt; high-fiber food later in the day. <br/>\n&gt; <br/>\n&gt; In general, I try to accentuate the positive. So I<br/>\n&gt; keep providing healthy choices without taking away the<br/>\n&gt; unhealthy ones.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Thank you!!!  This is exactly what I need to hear.   <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; A lot of people have talked about sneakyness and<br/>\n&gt; hoarding behaviour. There&#39;s also another problem I<br/>\n&gt; want to avoid and that is loss of credibility/trust.<br/>\n&gt; If I tell my kids that say coke is bad and they see<br/>\n&gt; other people drinking with no bad effects, they&#39;re<br/>\n&gt; soon going to start discounting what I say. I don&#39;t<br/>\n&gt; want that to happen.<br/>\n<br/>\n </span></blockquote>But in the context of a solid, trusting, loving relationship, might <br/>\nthey believe us even if they can&#39;t see the effects?  I mean, I <br/>\ncouldn&#39;t see the effects lifestyle had on many healthy-looking <br/>\nappearing humans that I&#39;ve seen on autopsy, but its there.  When the <br/>\ndata is good over years and multiple populations, I might see it, but <br/>\nmy child might not understand the research yet.  I&#39;d hope we have <br/>\nenough trust that she wouldn&#39;t disbelieve me because she sees people <br/>\nwho are fine eating everything under the sun.  <br/>\n<br/>\nBut yes, that is my main concern....that they will not feel safe in <br/>\nthe context of our relationship to be able to be honest.  Totally <br/>\nagree.  <br/>\n<br/>\nI want to find a way to do both.  Perhaps I&#39;m dreaming the impossible <br/>\ndream!!!  :)</div>","specialLinks":[]},{"userId":244360311,"authorName":"Deb","from":"&quot;Deb&quot; &lt;soggyboysmom@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and Fear (VERY VERY LONG!)","postDate":"1152819179","msgId":15718,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU5Njc1YitzdDI3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU5NjNxcCtvZDhhQGVHcm91cHMuY29tPg=="},"prevInTopic":15716,"nextInTopic":15732,"prevInTime":15717,"nextInTime":15719,"topicId":15710,"numMessagesInTopic":0,"msgSnippet":"... LOL the most likely thing to keep DS from smoking is the price of the things. He s quite frugal about most stuff and I don t think he d go for having to","messageBody":"<div id=\"ygrps-yiv-1617724134\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Kiersten Pasciak&quot; <br/>\n&lt;kjl8@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;In the case of <br/>\n&gt; cigarettes, it is not difficult to find scientific studies on the <br/>\n&gt; effects of smoking, pictures of what it does to internal organs or <br/>\n&gt; your mouth and teeth, or to know someone in real life who is <br/>\n&gt;suffering <br/>\n&gt; from a smoking related illness. Or to talk to smokers about what <br/>\n&gt;they <br/>\n&gt; like about it/ what they don&#39;t, have they ever tried to quit, etc.<br/>\n </span></blockquote>LOL the most likely thing to keep DS from smoking is the price of the <br/>\nthings. He&#39;s quite frugal about most stuff and I don&#39;t think he&#39;d go <br/>\nfor having to shell out all that money for something that&#39;s gone so <br/>\nfast (and smells awful - MIL and others in the family smoke and he <br/>\nwon&#39;t even hug Grandma if she&#39;s recently had a cigarette because of <br/>\nthe smell and we don&#39;t try to force him).<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":8667530,"authorName":"Manisha Kher","from":"Manisha Kher &lt;m_kher@...&gt;","profile":"m_kher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Food and Fear (VERY VERY LONG!)","postDate":"1152816754","msgId":15716,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNzEzMTg1MjM3LjUyMTU5LnFtYWlsQHdlYjU0NDA1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDIwMDYwNzEzMTY1NDEwLjU1ODQ2LnFtYWlsQHdlYjMyNjExLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":15714,"nextInTopic":15718,"prevInTime":15715,"nextInTime":15717,"topicId":15710,"numMessagesInTopic":0,"msgSnippet":"... If she doesn t even like most of it, why are you so concerned? It sounds like she s eating as much as she wants. ... I have never introduced non-nutritious","messageBody":"<div id=\"ygrps-yiv-453987419\">--- Christe Bruderlin &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:techwritercsbn@...\">techwritercsbn@...</a>&gt;<br/>\nwrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;She opens it all and tastes lots<br/>\n&gt; of it and usually eats some if there is chocolate<br/>\n&gt; (my genes!), but she doesn&#39;t seem to like most of it<br/>\n&gt; (if perhaps only because it tastes foreign to her?)<br/>\n&gt; and gives or throws a lot away.  <br/>\n<br/>\n </span></blockquote>If she doesn&#39;t even like most of it, why are you so<br/>\nconcerned? It sounds like she&#39;s eating as much as she<br/>\nwants. <br/>\n   <br/>\n<blockquote><span title=\"ireply\"> &gt; I truly want to make life joyous and fun and to not<br/>\n&gt; cause my children to feel deprived.  Isn&#39;t there a<br/>\n&gt; way to do this without stocking the house with<br/>\n&gt; non-food foods?  Is it really best to introduce and<br/>\n&gt; readily supply Pop Tarts when they are perfectly<br/>\n&gt; happy eating natural foods for breakfast?  <br/>\n </span></blockquote>I have never introduced non-nutritious food on my own.<br/>\nFor me the question has always been about what do I do<br/>\nwhen they ask for something that is not particularly<br/>\nnutritious. Then I offer other equivalent choices or<br/>\nbuy it. I explain why I think it&#39;s not nutritious -<br/>\njust the facts mostly sugar, no protein, too many<br/>\nadditives etc. I also try to balance it by offering<br/>\nsome nutritious choices. For example, if my kids want<br/>\ncoco puffs cereal we buy it. But my daughter needs a<br/>\nlot of fiber. So I explain to her about coco puffs not<br/>\nhaving enough fiber and that she should eat some<br/>\nhigh-fiber food later in the day. <br/>\n<br/>\nIn general, I try to accentuate the positive. So I<br/>\nkeep providing healthy choices without taking away the<br/>\nunhealthy ones.<br/>\n<br/>\nA lot of people have talked about sneakyness and<br/>\nhoarding behaviour. There&#39;s also another problem I<br/>\nwant to avoid and that is loss of credibility/trust.<br/>\nIf I tell my kids that say coke is bad and they see<br/>\nother people drinking with no bad effects, they&#39;re<br/>\nsoon going to start discounting what I say. I don&#39;t<br/>\nwant that to happen.<br/>\n<br/>\nManisha<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":150688296,"authorName":"Kiersten Pasciak","from":"&quot;Kiersten Pasciak&quot; &lt;kjl8@...&gt;","profile":"kierstenpasciak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and Fear (VERY VERY LONG!)","postDate":"1152815769","msgId":15714,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU5NjNxcCtvZDhhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDYwNzEzMTY1NDEwLjU1ODQ2LnFtYWlsQHdlYjMyNjExLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":15710,"nextInTopic":15716,"prevInTime":15713,"nextInTime":15715,"topicId":15710,"numMessagesInTopic":0,"msgSnippet":"...  wrote: That is truly wonderful and it is exactly what I m feel I am doing too (and hoping to continue). I truly want to make life","messageBody":"<div id=\"ygrps-yiv-1609249749\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Christe Bruderlin <br/>\n&lt;techwritercsbn@...&gt; wrote:<br/>\nThat is truly wonderful and it is exactly what I&#39;m feel I am doing too <br/>\n(and<br/>\nhoping to continue). I truly want to make life joyous and fun and to <br/>\nnot cause<br/>\nmy children to feel deprived. Isn&#39;t there a way to do this without <br/>\nstocking the<br/>\nhouse with non-food foods? Is it really best to introduce and readily <br/>\nsupply<br/>\nPop Tarts when they are perfectly happy eating natural foods for <br/>\nbreakfast<br/>\n<br/>\n--------------<br/>\nI don&#39;t believe anyone here has ever mentioned &quot;stocking&quot; the house <br/>\nwith unasked for things. We have been discussing how people handle it <br/>\nwhen kids ASK for something. As they get older, they will sometimes <br/>\nask for things outside your comfort zone. Perhaps even a Pop-Tart :)<br/>\n<br/>\nThe point others have tried to make is that you cannot control their <br/>\nchoices when you are not present. If you make statements about how <br/>\ndangerous or unhealthy things are and they don&#39;t personally SEE that, <br/>\nthey may not trust what you say. When it comes to important decisions <br/>\nlater on, you may not even be consulted.<br/>\n<br/>\nI think one of the most important part of unschooling is helping our <br/>\nchildren learn how and where to look for information. In the case of <br/>\ncigarettes, it is not difficult to find scientific studies on the <br/>\neffects of smoking, pictures of what it does to internal organs or <br/>\nyour mouth and teeth, or to know someone in real life who is suffering <br/>\nfrom a smoking related illness. Or to talk to smokers about what they <br/>\nlike about it/ what they don&#39;t, have they ever tried to quit, etc.<br/>\n<br/>\nIt is just as easy to help them learn about sources for nutrition <br/>\ninformation. With nutrition, however, it is more complex that smoking. <br/>\nJust because you believe, for example, that low-fat or vegetarian is <br/>\nbest, that doesn&#39;t make it best for EVERYONE. <br/>\n<br/>\nI know because I have been trying many different ways of eating over <br/>\nthe years to find what works for me. Vegetarian does not work. Even <br/>\nwith careful eating, I was weak and did not feel well. Soy does not <br/>\nwork, in fact it makes me very ill as it affects my thyroid (this is <br/>\nnot true for everyone). Whole grains with gluten (which I love) were <br/>\nmaking it difficult to function properly as I wasn&#39;t absorbing enough <br/>\nB vitamins and wound up supplementing after going to several doctors <br/>\nto find out what was wrong. At this point I am sold on &quot;Nourishing <br/>\nTraditions&quot; for me, which focuses on eating foods high in enzymes (not <br/>\nprocessed) and beneficial bacteria, eating enough fats to feel well, <br/>\nand eating fermented foods. I am also adding coconut oil and cod liver <br/>\noil to my diet because these things are helping me have energy and <br/>\nfeel well. They may make someone else feel terrible. I would not want <br/>\nmy kids to have no say or worse to stop listening to their bodies <br/>\nsaying &quot;this is not working for ME!&quot;.<br/>\n<br/>\nKiersten<br/>\nmom to Jacob 4 1/2 and Emma 3<br/>\n<br/>\nKiersten</div>","specialLinks":[]},{"userId":187549037,"authorName":"Christe Bruderlin","from":"Christe Bruderlin &lt;techwritercsbn@...&gt;","profile":"techwritercsbn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Food and Fear (VERY VERY LONG!)","postDate":"1152809650","msgId":15710,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNzEzMTY1NDEwLjU1ODQ2LnFtYWlsQHdlYjMyNjExLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDExNTI3NDk4MDMuODA3Mi40Nzc3Ny5tMjhAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":15714,"prevInTime":15709,"nextInTime":15711,"topicId":15710,"numMessagesInTopic":0,"msgSnippet":"Hi Mary, Thanks for hearing what I have to say.  I hear what you have to say as well, and mirror those concerns. I have seen that happen as well (deprived kids","messageBody":"<div id=\"ygrps-yiv-1397164018\">Hi Mary,<br/>\n<br/>\nThanks for hearing what I have to say.  I hear what you have to say as well, and mirror those concerns.<br/>\n <br/>\nI have seen that happen as well (deprived kids with hoarding behavior), which is why I am concerned.  But I have also seen it go the opposite direction.  Maybe it is in the way the parents present things (as Kelly alluded to).  For example, we have a friend who is very healthfoodsy.  Her daughter (9) has no limits on what she orders at restaurants or what she eats at parties.  However, what has been in the house has been very limited and consisted mainly of things almost everyone can agree are great for the body (veggies, fruits, food in its natural state, etc.).  When she goes out, she orders pretty much the same stuff she&#39;s always had at home (and joyfully!!!).  I did see her order a sandwich that came on a croissant with cheese, but she picked them both off and ate the insides.  I&#39;m not going to comment on whether her mother&#39;s particular food choices (or hers) are &quot;good&quot; or &quot;bad,&quot; but it is one example (and I&#39;ve seen a handful of others) where what the child eats out and<br/>\n about closely mimics what is provided in the home.  Oh, I have two friends (both grown men) who were raised vegetarian for religious reasons.  One was Muslim and is now agnostic (though loving and respectful of his family).  One was 7th Day Adventist and is now loosely Christian.  Both are still vegetarian and say that though they&#39;ve tried it, they just never developed a taste for meat.  I have seen this time and time again...where adults seem to still gravitate toward the foods they had in the home.  I&#39;ve seen the opposite, too, but the point is that perhaps the food isn&#39;t the source of the rebellion in some of the cases people have mentioned?<br/>\n <br/>\nI have a huge family and we have a variety of friends with kids of various ages in all walks of life.  Most have unlimited supplies of standard readily-available standard kid fair (those Rice Krispie treats, Oreos, Uncrustables, soda, candy or whathaveyou along with fruits, veggies, etc.) and she isn&#39;t very interested so far in foods she isn&#39;t used to...even after having a bite (we are usually in other people&#39;s homes 2-3x a week).  Now, I will say at parties with Pinatas or goodie bags full of candy, she gets as excited as everyone else about the candy (as do I...I tell her to run for the candy when the pinata breaks, etc. and truly have fun with her during these events contrary to how my posts might sound LOL).  She opens it all and tastes lots of it and usually eats some if there is chocolate (my genes!), but she doesn&#39;t seem to like most of it (if perhaps only because it tastes foreign to her?) and gives or throws a lot away.  <br/>\n <br/>\n&quot;I also want to warn you that feeling good because your kids make <br/>\ngood to you choices sets you up to feel bad when they don&#39;t.&quot;<br/>\n <br/>\nI appreciate this, although I don&#39;t feel bad at all when she makes choices that might not necessarily feel like the best choices.  I don&#39;t know anybody who always makes the best choices (and I don&#39;t think I&#39;d want to :).  It isn&#39;t about perfectionism for me.  I don&#39;t think life would be any fun if we never had what we wanted for pure pleasure -- I sometimes just like &quot;being bad!&quot;  he he he.  It is more about the percentage for me.   For me, if the majority (80-90%) of our family&#39;s choices are natural foods (unprocessed, blah blah blah), I would worry not an ounce if my child had a full-fat pastrami on white with fries followed by a pile of cake and ice-cream washed down with a Coke or a martini.  :)  At parties, I help her open the candy and joke with her about giving it all to me, etc.  :)  <br/>\n<br/>\n&quot;I am aware of what my world has to offer and I help myself and children be safe and joyful in this world of strange chemicals.&quot;<br/>\n <br/>\nThat is truly wonderful and it is exactly what I&#39;m feel I am doing too (and hoping to continue).  I truly want to make life joyous and fun and to not cause my children to feel deprived.  Isn&#39;t there a way to do this without stocking the house with non-food foods?  Is it really best to introduce and readily supply Pop Tarts when they are perfectly happy eating natural foods for breakfast?  Are those of you with teens willing to also supply the endless cigarettes if, after mindfully parenting, their choice is to smoke?  I ask this because if I did loosen up more in the home, where would I draw the line.  <br/>\n <br/>\nIs what I&#39;m proposing so different or is it just that we all draw the lines in different places and that, in reality, all of you might limit certain things, but just have different viewpoints on the damaging effects of different foods?<br/>\n <br/>\nAnd, are there RU people out there who have raised children without buying them everything for consumption they desire who have older kids?  Are they totally eating the opposite?<br/>\n <br/>\nThanks!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":15754,"nextTopicId":15757}}