{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":61,"messages":[{"userId":136871563,"authorName":"ENSEMBLE S-WAYNFORTH","from":"ENSEMBLE S-WAYNFORTH &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Adult knowledge? (was Re: when did your kid(s) learn to read?)","postDate":"1207340825","msgId":31574,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2NjExMy40ODc2OC5xbUB3ZWI4NjIwMi5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":31573,"nextInTopic":31575,"prevInTime":31573,"nextInTime":31575,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"I wouldn t end up saying no. Well, I wouldn t be giving all the other information either. I d just go over and get some McDonalds. But it isn t a particularly","messageBody":"<div id=\"ygrps-yiv-435436553\">I wouldn&#39;t end up saying no. Well, I wouldn&#39;t be giving all the other information either. I&#39;d just go over and get some McDonalds. But it isn&#39;t a particularly desired good in my family. They used to go, largely to get the toys. But the food wasn&#39;t that appealling to Simon or Linnaea. Sometimes they want it. Sometimes so do I. But they don&#39;t like food that isn&#39;t as tasty as what we make at home. We ate at the zoo a few weeks ago, got some french fries and something else, and nobody enjoyed the food. So we make a point of bringing drinks and snacks from home when we go to the zoo. <br/>\n<br/>\nUsually at night more than one evening meal is made. Usually David and I have one thing and Simon or Linnaea may share, but then either Simon or Linnaea usually want their own thing. Tonight David and I had a shrimp curry, Simon had a bean and cheese burrito and Linnaea and her friend and baked potatoes with baked beans. The bean and cheese burrito was easy, just thrown together from leftovers. Baked potatoes and baked beans are easy as well. The shrimp curry is David&#39;s doing, so it wasn&#39;t a lot more work for me than a normal meal, nor for David, really. Dinner for them is less of a focus than it is for David or I. They eat when they are hungry throughout the day. I like having at least one clear meal in a day. And I enjoy making it. But I don&#39;t need them to eat it. I only offer it as a gift. <br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<br/>\n----- Original Message ----<br/>\n<br/>\nHow about letting them know that it is very tempting and easy to eat<br/>\ntoo many unhealthy foods at fast food places - that they make the<br/>\nservings way oversized, that they use a lot of fat and salt, which is<br/>\nprobably fine for once in a while but not good on a regular basis.<br/>\nGood point.  I think I generally do this.  But at some point (lespecially<br/>\nwhen they are really young), don&#39;t you just have to say &quot;No.&quot;  Otherwise, it<br/>\nturns into a lecture.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Adult knowledge? (was Re: when did your kid(s) learn to read?)","postDate":"1207340513","msgId":31573,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMzQ0JBN0MxLTg0QUEtNDgwMy1CMjVFLUQxQ0NGQTY0MzE0MkBtYWMuY29tPg==","inReplyToHeader":"PGZ0NTZoaStrMWdiQGVHcm91cHMuY29tPg==","referencesHeader":"PGZ0NTZoaStrMWdiQGVHcm91cHMuY29tPg=="},"prevInTopic":31572,"nextInTopic":31574,"prevInTime":31572,"nextInTime":31574,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"... Right. My kids are old now and they know a whole lot about nutrition. A LOT. I wasn t saying to lecture little kids. I was saying that telling them fast","messageBody":"<div id=\"ygrps-yiv-1813535329\">On Apr 4, 2008, at 5:22 AM, Ren Allen wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; ~~But at some point (lespecially<br/>\n&gt; when they are really young), don&#39;t you just have to say &quot;No.&quot;<br/>\n&gt; Otherwise, it turns into a lecture.~~<br/>\n&gt;<br/>\n&gt; No lecture. No &quot;no&quot;. Just eat the food in joy and peace and it will be<br/>\n&gt; healthy. Really.<br/>\n&gt; As they grow, trust that the ideas of healthy vs. unhealthy will be<br/>\n&gt; part of their learning process like everything else they&#39;re learning.<br/>\n<br/>\n </span></blockquote>Right. My kids are old now and they know a whole lot about nutrition.  <br/>\nA LOT. I wasn&#39;t saying to lecture little kids. I was saying that  <br/>\ntelling them fast food is unhealthy is really overstating it and you  <br/>\nlose your credibility if you&#39;re not scrupulously honest with your  <br/>\nkids. Truth: fast food places tend to offer much-too-large servings,  <br/>\ntoo much salt, and too much fat.  Truth: you can eat there and be  <br/>\nhealthy, but we adults tend to eat what we&#39;re served so we overeat and  <br/>\nconsume a lot of salt and fat. (But are your kids overeating or do  <br/>\nthey eat until they&#39;re full and stop.) Truth: fast food places offer  <br/>\nmore and more healthy alternatives, especially those aimed at kids, so  <br/>\nthat&#39;s great! Truth: you don&#39;t need to balance your nutrition for  <br/>\nevery meal. Fast food tends to be short ofn fruits and veggies, so  <br/>\nhave more of those at other times. Truth: eating fast food won&#39;t kill  <br/>\nyou or make you sick unless you choose it really a lot, and make poor  <br/>\nfast-food choices, over years. In fact, turns out that fat, even  <br/>\nsaturated fat, may not EVER have been the big problem we&#39;ve all been  <br/>\ntaught it was. Transfats, partially hydrogenated vegetable oils, seem  <br/>\nto be a far more guilty culprit and, these days, are disappearing even  <br/>\nfrom fast food. Salt - probably not a problem for children, more for  <br/>\nadults prone to high blood pressure.<br/>\n<br/>\nSo - take a fresh look at fast food maybe with a more open mind.<br/>\n<br/>\n  I&#39;m pretty sure Ren&#39;s kids are picking up on what is more or less  <br/>\nhealthy because she, herself, is interested in that and models healthy  <br/>\neating. So do I. I don&#39;t have to lecture the kids, I don&#39;t have to  <br/>\nmake any special effort to tell them. It comes up naturally and they  <br/>\nlearn, by making their own choices, what is healthy for themselves.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Adult knowledge? (was Re: when did your kid(s) learn to read?)","postDate":"1207339482","msgId":31572,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFEQzBFM0UzLTRCNzktNDRGNy04REE0LTY5Njg2OEFGQkQxQUBtYWMuY29tPg==","inReplyToHeader":"PDliY2E5ZTMwODA0MDQwMjQwbjI1Y2YyYzUxamQ0ZTI2N2QxYjg1OTgwNWJAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PDliY2E5ZTMwODA0MDIyMDAwdjc5MDZlNWZhZzE5MDhjYzRhMDQ4OWFhMDFAbWFpbC5nbWFpbC5jb20+IDxGQTA2Q0QwOS1EQTU5LTQzNEUtODJGQS1DMkFBODg3NjNGMjlAdmVyaXpvbi5uZXQ+IDw5YmNhOWUzMDgwNDA0MDI0MG4yNWNmMmM1MWpkNGUyNjdkMWI4NTk4MDViQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":31570,"nextInTopic":31573,"prevInTime":31571,"nextInTime":31573,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"... It is not a method. Right! You ve got it. ... It is a sort of set of basic beliefs about how humans learn. Based on those beliefs, there is a set of","messageBody":"<div id=\"ygrps-yiv-688236532\">On Apr 4, 2008, at 2:40 AM, Kim Musolff wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Unschooling is not<br/>\n&gt; about a formula for teaching/learning.<br/>\n<br/>\n </span></blockquote>It is not a &quot;method.&quot; Right! You&#39;ve got it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There are no rules to follow. It is<br/>\n&gt; about a way of thinking.<br/>\n<br/>\n </span></blockquote>It is a sort of set of basic beliefs about how humans learn. Based on  <br/>\nthose beliefs, there is a set of principles about how parents can  <br/>\nsupport learning in their children. But, the principles are broad,  <br/>\nthey don&#39;t tell you what to do, when to do it, how to do it.<br/>\nWhat we do, as unschoolers, is constantly consider how to apply those  <br/>\nbroad principles to the particular situations and circumstances that  <br/>\narise in our own real lives.<br/>\n<br/>\nSo I, for example, am constantly asking myself, &quot;How can I support my  <br/>\nchild&#39;s interest?&quot;<br/>\n<br/>\nTo relate this to the fast-food issue. I answer that by asking myself,  <br/>\n&quot;How can I support my child&#39;s interest in eating fast food?&quot;<br/>\nThen I go on to think about what it IS about the fast food that my  <br/>\nchild is really interested in. Is it because it is right there -  <br/>\nquickly in her hands when she&#39;s hungry? If so, I will work on having  <br/>\nfood with us that is quickly available when we&#39;re out and about. Etc.  <br/>\nEach of us has to do this thinking and pondering and creative thinking  <br/>\nfor ourselves.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think someone here (was it you, Joyce?) said<br/>\n&gt; that it is more about learning how to give each of your children  <br/>\n&gt; what THEY<br/>\n&gt; need to learn and grow. Like when my baby cries, I know what she  <br/>\n&gt; needs,<br/>\n&gt; because I know her. I finally get that. Yea!<br/>\n<br/>\n </span></blockquote>-pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Adult knowledge?","postDate":"1207338974","msgId":31570,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyNzFDNkEzLUQ1QTgtNEJDMS04MTc4LUM3QTlFMjIyQzJDQkBtYWMuY29tPg==","inReplyToHeader":"PDliY2E5ZTMwODA0MDQwMTUxazQ1YzFkZmE3bDNjODhhOWJmMWZmYjZiYjVAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PGZ0NDUzdCtoc2FvQGVHcm91cHMuY29tPiA8ZnQ0OGFlKzlybDNAZUdyb3Vwcy5jb20+IDw5YmNhOWUzMDgwNDA0MDE1MWs0NWMxZGZhN2wzYzg4YTliZjFmZmI2YmI1QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":31568,"nextInTopic":31572,"prevInTime":31569,"nextInTime":31571,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"... You really can make food that is healthy, at home, that is WAY better than fast food - and I mean that kids like better, not JUST healthier. Maybe fish and","messageBody":"<div id=\"ygrps-yiv-1254418017\">On Apr 4, 2008, at 1:51 AM, Kim Musolff wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m a certified health nut and I take my child to McDonald&#39;s when they<br/>\n&gt; ask.<br/>\n&gt; But how often do they ask? If they asked every day, would you take  <br/>\n&gt; them<br/>\n&gt; there? Our kids hardly ever asked to go to fast food restaurants  <br/>\n&gt; before we<br/>\n&gt; moved last summer. But when we were between houses for 3 months, we  <br/>\n&gt; ate out<br/>\n&gt; almost every night. Since then, our children have been asking to eat  <br/>\n&gt; fast<br/>\n&gt; food almost every time we pass one. They think it&#39;s normal now. And  <br/>\n&gt; the<br/>\n&gt; problem is that fast food tastes good. If you don&#39;t know (or think  <br/>\n&gt; about)<br/>\n&gt; what&#39;s in it, then it&#39;s much yummier than fish and rice for dinner.<br/>\n<br/>\n </span></blockquote>You really can make food that is healthy, at home, that is WAY better  <br/>\nthan fast food - and I mean that kids like better, not JUST healthier.  <br/>\nMaybe fish and rice just aren&#39;t foods your kids enjoy? You can make  <br/>\nfast-food like foods at home, even. Instead of fast-food french fries,  <br/>\nmake your own. Let the kids choose different seasonings to try on  <br/>\nthem. Bake them instead of frying them.<br/>\n<br/>\nMaybe you could take it as a challenge - come up with a set of foods  <br/>\nthat the kids choose over a stop at a fast food place.<br/>\n<br/>\nAlso, if they&#39;re wanting to stop when you&#39;re driving by, that might be  <br/>\na sign that you&#39;ve got somewhat hungry kids in the car - take more  <br/>\nsnacks along with you.<br/>\n<br/>\nInstead of forbidding or restricting fast food - make the alternatives  <br/>\nmuch more enticing. Help them KNOW that it is possible to fix healthy  <br/>\nfoods that are even better than fast food.<br/>\n<br/>\nIt works. I have a 17 yo, 20 yo, and 23 yo -- they could eat all the  <br/>\nfast food they want, they have their own money and are out on their  <br/>\nown quite often. They take food with them a lot. Yesterday my 17 yo  <br/>\nneeded to buy some lunch when she was out and she stopped at a 7-11  <br/>\nand bought bananas and peanut butter. Kind of a strange lunch? Still -  <br/>\nhealthy enough. She could have had pizza or a hamburger and fries.  <br/>\nEven when they EAT fast food, they choose the healthiest food they  <br/>\ncan. They LIKE the feeling of being healthy, and wholesome foods are  <br/>\nwhat appeals most to them. They didn&#39;t get this habit from me  <br/>\nrestricting them. They got it by being used to making their own  <br/>\nchoices, with me providing lots of good options to choose from.<br/>\n<br/>\nSometimes they would say, &quot;We&#39;re hungry, we want to stop at ......&quot;  <br/>\nThen I&#39;d say, &quot;We could do that. Or we could go home and eat  <br/>\nthat ..... that we made yesterday.&quot;  Fill in with some yummy thing  <br/>\nthat we have at home that I know they&#39;d really like.  You might have  <br/>\nto work at having those cool choices available at home, but it&#39;ll be  <br/>\nhabit after a while.<br/>\n<br/>\nYou sound kind of like you think all the healthy choices are  <br/>\nautomatically less appealing to the kids -- fish and rice sounds dull.  <br/>\nBut breakfast cookies or homemade bread and peanut butter or homemade  <br/>\ngranola or trail mix? We make brown basmati rice with cherries in it -  <br/>\nthat&#39;s a big favorite. Most kids have a few veggies they really like.  <br/>\nMost like to dip some kind of veggie in something like ranch dressing.  <br/>\nExperiment with healthy dips! We do a LOT of plain fat-free yogurt  <br/>\nwith cucumber very finely chopped up in it along with dried mint or  <br/>\ndried dill. Sometimes we put some raisins in it. Sometimes we put  <br/>\nchopped walnuts in it. This makes a great dip for toasted whole wheat  <br/>\npita bread or for those baby carrots or sticks of jicama or cucumber  <br/>\nsticks. Sliced apples are a big favorite - sprinkled with cinnamon -  <br/>\ncold or warmed up. I often put a handful of multi-grain Cheerios into  <br/>\na bowl with some fat-free flavored yogurt. Because we always have  <br/>\nplain fat-free yogurt in the fridge, I often flavor it myself with all  <br/>\nkinds of things that people might think are strange, but they&#39;re fun -  <br/>\ncinnamon, vanilla, lemon zest, cocoa powder, peanut butter, garlic,  <br/>\nand on and on. If you&#39;re making a flavor that you want sweet - you can  <br/>\nadd a little honey.<br/>\n<br/>\nSo - I guess what I&#39;m saying is that instead of restricting, focus on  <br/>\nbeing creative and put the effort into providing child-friendly  <br/>\nhealthy and fun food. Also, kids often don&#39;t really care about &quot;meals&quot;  <br/>\n- they enjoy grazing throughout the day. So they may not be very  <br/>\nhungry for dinner, but snacking like that&#39;s very healthy and let&#39;s you  <br/>\nfocus your mealtime more on what you and your spouse might enjoy  <br/>\nwithout worrying whether the kids are getting the nutrition they need.<br/>\n<br/>\nYou might enjoy reading, &quot;In Defense of Food,&quot; by Michael Pollan  <br/>\n(author of the Omnivore&#39;s Dilemma). It is about how we&#39;ve stopped  <br/>\nthinking of food as &quot;food&quot; and think of it as nutrients, instead.  <br/>\nReally thought-provoking - easy reading (easier than The Omnivore&#39;s  <br/>\nDilemma which I found kind of boring to get through, even though I  <br/>\nliked what he had to say).<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":241586873,"authorName":"barefootmamax4","from":"&quot;barefootmamax4&quot; &lt;barefootmamax4@...&gt;","profile":"barefootmamax4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Adult knowledge? (was Re: when did your kid(s) learn to read?)","postDate":"1207336115","msgId":31568,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ0NXViaityNDBrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFGMTAzMTRELTIwNEMtNDhCRi1BQjZFLTRFN0YwMTdERTdCRkBtYWMuY29tPg=="},"prevInTopic":31567,"nextInTopic":31570,"prevInTime":31567,"nextInTime":31569,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"... eat ... is ... basis.......... If you believe that fast food is unhealthy then I think it s fine to say so.People have a lot beliefs that cannot be","messageBody":"<div id=\"ygrps-yiv-1743324981\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Pamela Sorooshian <br/>\n&lt;pamsoroosh@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; On Apr 3, 2008, at 3:29 PM, barefootmamax4 wrote:<br/>\n&gt; <br/>\n&gt; &gt; I don&#39;t see anything wrong with just giving the knowlege that fast<br/>\n&gt; &gt; food is unhealthy,<br/>\n&gt; <br/>\n&gt; I see something wrong with overstatements. It reduces your  <br/>\n&gt; credibility. Give specifics that you can really back up with true  <br/>\n&gt; information.<br/>\n&gt; <br/>\n&gt; How about letting them know that it is very tempting and easy to <br/>\n </span></blockquote>eat  <br/>\n<blockquote><span title=\"ireply\"> &gt; too many unhealthy foods at fast food places - that they make the  <br/>\n&gt; servings way oversized, that they use a lot of fat and salt, which <br/>\n </span></blockquote>is  <br/>\n<blockquote><span title=\"ireply\"> &gt; probably fine for once in a while but not good on a regular <br/>\n </span></blockquote>basis..........<br/>\n<br/>\n If you believe that fast food is unhealthy then I think it&#39;s fine to <br/>\nsay so.People have a lot beliefs that cannot be scientifically proven <br/>\none way or another. Just look at the vaccine issue for an example. I <br/>\ndo not think it is wrong to make a statement like that. It is wrong <br/>\nto force your child to agree with you.<br/>\n<br/>\n It is true you can go to MC Donalds and order the salad. You can get <br/>\nhealthy food at fast food places. In that sense, I could be very <br/>\nexacting and say &quot;some fast food is bad for you, but the salad is OK&quot;.<br/>\n<br/>\n Personally, I believe that it is not the food itself as much as your <br/>\nemotional well being. We do go to Mc Donalds,drink soda,eat lots of <br/>\nsweets.I think if you are worrying that a food is unhealthy you are <br/>\ngetting stressed while eating it and the stress itself is more <br/>\nunhealthy than the food. A twinkie eaten with joy is just fine.<br/>\n There was a woman in our newspaper who was 102. When asked what her <br/>\nsecret was she said wonderbread and tea. Yet in any magazine you can <br/>\nread about the dangers of salt,hydrogenated oils, white bread and <br/>\nsugar. Science itself looses credibility when they say things <br/>\nlike &quot;eggs are bad for you&quot; then a few years later ...&quot;eggs are good <br/>\nfor you&quot;<br/>\n-Kelly</div>","specialLinks":[]},{"userId":136871563,"authorName":"ENSEMBLE S-WAYNFORTH","from":"ENSEMBLE S-WAYNFORTH &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Adult knowledge?","postDate":"1207333326","msgId":31567,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3Mzc0LjM5Mzk2LnFtQHdlYjg2MjAxLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":31564,"nextInTopic":31568,"prevInTime":31566,"nextInTime":31568,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"There is a book, and I can t remember the name at the moment, maybe I ll google it before I m done, that talks about how you get more nutrition out of the food","messageBody":"<div id=\"ygrps-yiv-2096570719\">There is a book, and I can&#39;t remember the name at the moment, maybe I&#39;ll google it before I&#39;m done, that talks about how you get more nutrition out of the food you enjoy than the food you don&#39;t enjoy. It makes sense. When you are stressed your immune system doesn&#39;t function as well, so it wouldn&#39;t be a hard stretch to imagine that your digestive system might not function as well either. I can&#39;t find the book, or the study. Sigh... Anyhow, if you eat something happily you are better able to derive nutrients from it than if you eat it under duress. <br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<br/>\n------------<br/>\nI think the knowledge involved in eating healthily is in large part your <br/>\nown experience of how you feel when eating this way or that. You can <br/>\nread a lot of different things about what is healthy and not healthy but <br/>\nfor me it comes down to how I feel and that is something only I have <br/>\nknowledge of for myself- and that my children can only have knowledge of <br/>\nfor themselves through their own experience. If I forbid them to eat <br/>\n&quot;junk food&quot; or any food I think is unhealthy- how will they gain that <br/>\nknowledge?<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223130287,"authorName":"Krisula","from":"&quot;Krisula&quot; &lt;krisula@...&gt;","profile":"krisulaula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Adult knowledge?","postDate":"1207327873","msgId":31564,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjQwMWM4OTY3NCQxODExMmE1MCQ2NzAyYThjMEBlcG1kZWxsaG9tZT4="},"prevInTopic":31563,"nextInTopic":31567,"prevInTime":31563,"nextInTime":31565,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"... healthier for a human being than being told their desire is crap. Happiness is good for you. Food is food. Some food is better for us than other foods,","messageBody":"<div id=\"ygrps-yiv-1209529585\"><blockquote><span title=\"ireply\">&gt;&gt;I would say a fun time eating and playing at McDonald&#39;s is a LOT<br/>\n </span></blockquote>healthier for a human being than being told their desire is crap.<br/>\nHappiness is good for you. <br/>\nFood is food. Some food is better for us than other foods, sure. But<br/>\nis there really a risk that if you are offering lots of healthy<br/>\nchoices and trusting them, that McDonald&#39;s will somehow ruin their<br/>\nhealth? Nah.&lt;&lt;<br/>\n<br/>\nI can remember taking my kids to McDonalds for winter playdates because they<br/>\nhad an indoor playground.  We usually ate there as well as played and  I<br/>\nalso brought apples and carrots because I knew those were things my kids<br/>\nliked.  I would bring enough apples for all the kids we met up with and just<br/>\nput them on the table.  I don&#39;t remember ever going home with extra apples.<br/>\nThe kids would eat those along with or instead of their other food.   They<br/>\nliked their fries and stuff and they liked their apples and we played and<br/>\nhad fun for hours.   <br/>\n<br/>\nFun memories,<br/>\n<br/>\nKrisula<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":220041937,"authorName":"hbmccarty","from":"hbmccarty &lt;hbmccarty@...&gt;","profile":"heather13068","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Adult knowledge?","postDate":"1207326997","msgId":31563,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3RjY1OTE1LjMwMDAwMDNAdHdjbnkucnIuY29tPg==","inReplyToHeader":"PGZ0NWs3bytkbzIxQGVHcm91cHMuY29tPg==","referencesHeader":"PGZ0NWs3bytkbzIxQGVHcm91cHMuY29tPg=="},"prevInTopic":31562,"nextInTopic":31564,"prevInTime":31562,"nextInTime":31564,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"I think the knowledge involved in eating healthily is in large part your own experience of how you feel when eating this way or that. You can read a lot of","messageBody":"<div id=\"ygrps-yiv-1087911341\">I think the knowledge involved in eating healthily is in large part your <br/>\nown experience of how you feel when eating this way or that. You can <br/>\nread a lot of different things about what is healthy and not healthy but <br/>\nfor me it comes down to how I feel and that is something only I have <br/>\nknowledge of for myself- and that my children can only have knowledge of <br/>\nfor themselves through their own experience. If I forbid them to eat <br/>\n&quot;junk food&quot; or any food I think is unhealthy- how will they gain that <br/>\nknowledge?<br/>\n<br/>\nHeather M.<br/>\n<br/>\nkeetry wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt;<br/>\n&gt; First, there is no real proof that french fries cause cancer or<br/>\n&gt; heart disease. We&#39;ve been exploring this idea of proof with the<br/>\n&gt; violent video game thread about whether or not scientific studies<br/>\n&gt; actually prove causation. Most times they do not. What they may show<br/>\n&gt; is correlation, which just means that one thing appears to be<br/>\n&gt; strongly associated with the other. However, especially when<br/>\n&gt; studying humans and human behavior, there is absolutely no way to<br/>\n&gt; exclude all other variables to make it possible to prove true<br/>\n&gt; causation. So, you can&#39;t *know* that french fries cause cancer or<br/>\n&gt; heart disease. You can *believe* that they do and that&#39;s your<br/>\n&gt; choice.<br/>\n&gt;<br/>\n&gt; __ </span></blockquote></div>","specialLinks":[]},{"userId":332901363,"authorName":"keetry","from":"&quot;keetry&quot; &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Adult knowledge?","postDate":"1207326806","msgId":31562,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ0NWw4bStoY292QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZ0NTZlbytqYWxtQGVHcm91cHMuY29tPg=="},"prevInTopic":31561,"nextInTopic":31563,"prevInTime":31561,"nextInTime":31563,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"... shared ... sex. ... Better ... WITH ... later ... This is exactly what I got once I let go of the idea that I could control my son. We talk about so many","messageBody":"<div id=\"ygrps-yiv-860346075\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Ren Allen&quot; <br/>\n&lt;starsuncloud@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I get<br/>\n&gt; such honesty from him at 18...about issues I would NEVER have <br/>\n </span></blockquote>shared<br/>\n<blockquote><span title=\"ireply\"> &gt; with my parents.<br/>\n&gt; <br/>\n&gt; I knew when he and his girlfriend made a conscious choice to have <br/>\n </span></blockquote>sex.<br/>\n<blockquote><span title=\"ireply\"> &gt; Forbidding sex or cigarettes or McDonalds is laughable really. <br/>\n </span></blockquote>Better<br/>\n<blockquote><span title=\"ireply\"> &gt; to trust that my children need to explore certain foods or ideas <br/>\n </span></blockquote>WITH<br/>\n<blockquote><span title=\"ireply\"> &gt; me alongside, than to forbid it and let them explore all alone <br/>\n </span></blockquote>later<br/>\n<blockquote><span title=\"ireply\"> &gt; in life.<br/>\n&gt; <br/>\n&gt; &gt; Ren<br/>\n&gt; learninginfreedom.com<br/>\n<br/>\n </span></blockquote>This is exactly what I got once I let go of the idea that I could <br/>\ncontrol my son. We talk about so many things that I could never talk <br/>\nto my parents about, even my mom who was very open about stuff. The <br/>\nproblem was that she was also judgemental even though she didn&#39;t try <br/>\nto control me with actions.<br/>\n<br/>\nMy son&#39;s friends are shocked at the things he says in front of me. <br/>\nThey marvel at the fact that he&#39;s not afraid to talk about these <br/>\nthings with me and that I don&#39;t freak out over it. I get to share <br/>\nwith him the information that I think is important so his only <br/>\ninfluence isn&#39;t whatever he hears on the street, so to speak. I also <br/>\nget to know more about his real life rather than the life most kids <br/>\nfeel they have to put on for their parents.<br/>\n<br/>\nHe had a girlfriend for a while who&#39;s parents were very controlling. <br/>\nShe was not allowed to have a boyfriend so they snuck around. Her <br/>\nparents had no idea what she was doing. She lied to them all the <br/>\ntime. Every once in a while she would get caught breaking a rule and <br/>\nshe would be grounded for months at a time. It was really crazy. It <br/>\nnever stopped her from doing those things. She would just figure out <br/>\nother ways to trick her parents. I couldn&#39;t help but think what a <br/>\nsad situation for her parents. They have no idea who thier daughter <br/>\nis. I don&#39;t want that kind of relationship with my children.<br/>\n<br/>\nNow I apply these principles to my relationship with my 4 year old. <br/>\nIf he asks for McDonalds, sometimes we go and sometimes we don&#39;t. It <br/>\ndepends on several factors. I provide plenty of healthy food for him <br/>\nat home that he enjoys as well. Sometimes he&#39;d prefer fish and rice <br/>\nrather than a cheeseburger Happy Meal. We ate out the other night <br/>\nand a lady commented on how impressed she was that he asked for and <br/>\nate a salad. There was no need to try to force or coerce him into <br/>\neating it. For dessert he wanted ice cream (not organic, probably <br/>\nnot even real ice cream) and carrot cake, off which he just ate the <br/>\nfrosting. I think he discovered he doesn&#39;t like carrot cake. He <br/>\nwouldn&#39;t have been able to determine that for himself if I hadn&#39;t <br/>\nlet him have that 2nd dessert.<br/>\n<br/>\nAlysia</div>","specialLinks":[]},{"userId":332901363,"authorName":"keetry","from":"&quot;keetry&quot; &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Adult knowledge?","postDate":"1207325752","msgId":31561,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ0NWs3bytkbzIxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDliY2E5ZTMwODA0MDQwMTA3aTI3NGY3MWEybmUxMWM0Yzc1ZTU4Njg4YmNAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":31557,"nextInTopic":31562,"prevInTime":31560,"nextInTime":31562,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"... people, it s ... for their ... because they ... good. ... even if they ... perspective ... that even ... own ... would you ... I am ... think of, and ... ","messageBody":"<div id=\"ygrps-yiv-252813621\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Kim Musolff&quot; <br/>\n&lt;kmoose75@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I don&#39;t quite get this viewpoint.  First of all, it&#39;s not other <br/>\n </span></blockquote>people, it&#39;s<br/>\n<blockquote><span title=\"ireply\"> &gt; my children.  Not that I own them, but that I love them.  I care <br/>\n </span></blockquote>for their<br/>\n<blockquote><span title=\"ireply\"> &gt; well-being.  Secondly, I do know better than them sometimes, <br/>\n </span></blockquote>because they<br/>\n<blockquote><span title=\"ireply\"> &gt; are children and I am an adult.  They know that french fries taste <br/>\n </span></blockquote>good.<br/>\n<blockquote><span title=\"ireply\"> &gt; They don&#39;t know that they cause cancer and heart disease.  And <br/>\n </span></blockquote>even if they<br/>\n<blockquote><span title=\"ireply\"> &gt; do, developmentally, they aren&#39;t always capable of putting into <br/>\n </span></blockquote>perspective<br/>\n<blockquote><span title=\"ireply\"> &gt; the health risks and the craving for fried food.  Are you saying <br/>\n </span></blockquote>that even<br/>\n<blockquote><span title=\"ireply\"> &gt; if I do know better, no matter what, I should let them make their <br/>\n </span></blockquote>own<br/>\n<blockquote><span title=\"ireply\"> &gt; decisions?<br/>\n&gt; <br/>\n&gt; Here&#39;s a question:  If your child wanted to smoke cigarettes, <br/>\n </span></blockquote>would you<br/>\n<blockquote><span title=\"ireply\"> &gt; allow that?  I am not asking this question to be confrontational, <br/>\n </span></blockquote>I am<br/>\n<blockquote><span title=\"ireply\"> &gt; asking it because it is the most extreme situation that I can <br/>\n </span></blockquote>think of, and<br/>\n<blockquote><span title=\"ireply\"> &gt; I am really trying to wrap my mind around this.<br/>\n&gt; <br/>\n&gt; Sometimes I really feel like I get unschooling, and other times, I <br/>\n </span></blockquote>think,<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;No, this can&#39;t be for me.&quot;  I am just thankful that at least you <br/>\n </span></blockquote>all are<br/>\n<blockquote><span title=\"ireply\"> &gt; discussing this with me!<br/>\n&gt; <br/>\n&gt; Kim<br/>\n<br/>\n<br/>\n </span></blockquote>First, there is no real proof that french fries cause cancer or <br/>\nheart disease. We&#39;ve been exploring this idea of proof with the <br/>\nviolent video game thread about whether or not scientific studies <br/>\nactually prove causation. Most times they do not. What they may show <br/>\nis correlation, which just means that one thing appears to be <br/>\nstrongly associated with the other. However, especially when <br/>\nstudying humans and human behavior, there is absolutely no way to <br/>\nexclude all other variables to make it possible to prove true <br/>\ncausation. So, you can&#39;t *know* that french fries cause cancer or <br/>\nheart disease. You can *believe* that they do and that&#39;s your <br/>\nchoice. <br/>\n<br/>\nInteresting that you should bring up the cigarette smoking because I <br/>\nhave had to deal with just this situation. My oldest son, who is now <br/>\n17, does smoke. I could not stop him no matter how much I wanted to. <br/>\nI&#39;m not sure exactly when he started but I think it was around 13 or <br/>\n14. He likes to tell me of a time when I found a pack of his <br/>\ncigarettes and took all of them out and broke them and threw them <br/>\naway.  That didn&#39;t stop him from smoking. It only made him very <br/>\nangry at me. I don&#39;t remember doing this at all but I&#39;m sure I did <br/>\nsince he remembers it so vividly. <br/>\n<br/>\nI have come to realize that all I can do is talk to him about my <br/>\nconcerns for him, including how difficult it is to quit. I have <br/>\nfirst hand knowledge of that since I smoked cigarettes for years and <br/>\nit took me years to quit. Do I think that at 13 or even 17 he can <br/>\ncompletely understand the possible long term effects of smoking? <br/>\nProbably not. I cannot control what he does, though. I asked him not <br/>\nto smoke in the house for the health and safety of the rest of us. <br/>\nMost of the time he respected that. I didn&#39;t give him a hard time <br/>\nabout smoking on my front porch. I even provided him with an ash <br/>\ntray because *I* did not want cigarette butts all over my front <br/>\nlawn. <br/>\n<br/>\nIt&#39;s his life, his body, his health, his choice. <br/>\n<br/>\nAlysia</div>","specialLinks":[]},{"userId":271637621,"authorName":"melissa_hice","from":"&quot;melissa_hice&quot; &lt;mhice@...&gt;","profile":"melissa_hice","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Adult knowledge?","postDate":"1207318097","msgId":31557,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ0NWNvaCtxZWxjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDliY2E5ZTMwODA0MDQwMTUxazQ1YzFkZmE3bDNjODhhOWJmMWZmYjZiYjVAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":31556,"nextInTopic":31561,"prevInTime":31556,"nextInTime":31558,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"I take my kids to McDonald s every Thursday.  They offer $1.29 Hamburger Happy Meals on that day.  We generally get apples instead of fries and they get milk","messageBody":"<div id=\"ygrps-yiv-1722260039\">I take my kids to McDonald&#39;s every Thursday.  They offer $1.29 <br/>\nHamburger Happy Meals on that day.  We generally get apples instead of <br/>\nfries and they get milk instead of soda.  One of the best things about <br/>\ngoing to our local McDonald&#39;s is that my children have developed a very <br/>\nwonderful relationship with the elderly host and hostess (husband and <br/>\nwife team).  They absoultely love going to McDonald&#39;s so that they can <br/>\nsee their good friends, Mr. Harry and Ms. Beverly.  They are like <br/>\ngrandparents to them.  <br/>\n<br/>\nMelissa</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Adult knowledge? (was Re: when did your kid(s) learn to read?)","postDate":"1207317250","msgId":31556,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1Mzk1NTdBQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":31553,"nextInTopic":31557,"prevInTime":31555,"nextInTime":31557,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"... tastes better We re having lasagna tomorrow - DH s world famous (lol) homemade lasagna - he makes the whole wheat herbed noodles from scratch! We hadn t","messageBody":"<div id=\"ygrps-yiv-916320016\"><blockquote><span title=\"ireply\">&gt;He said recently that he prefers real food to junk food- because it<br/>\n </span></blockquote>tastes better<br/>\nWe&#39;re having lasagna tomorrow - DH&#39;s &quot;world famous&quot; (lol) homemade<br/>\nlasagna - he makes the whole wheat herbed noodles from scratch! We<br/>\nhadn&#39;t had it in a while and DS (almost 10) mentioned last week that we<br/>\nhadn&#39;t had homemade pasta in a while and that it tastes better than the<br/>\nstore kind. Okay, so let&#39;s plan for it soon - and we did. <br/>\n<br/>\nDS has been &quot;in on&quot; discussions that DH and I have about our various<br/>\nhealth situations (he&#39;s got high blood pressure, I was diagnosed with<br/>\ntype 2 diabetes a year ago, so carbs, fats, and sodium are all up for<br/>\ndiscussion) - we don&#39;t &quot;lecture&quot; him but when DH and I are talking, DS<br/>\nmight ask a question like &quot;what is hydrogenated?&quot; Actually, though, some<br/>\nof the best information on nutrition has come from watching Good Eats (I<br/>\nloved when Alton Brown explained the differences between<br/>\nmonounsaturated, polyunsaturated, and saturated fat using a little<br/>\ntrolley car) and talking about what we&#39;re seeing/hearing. DS has the<br/>\nfreedom to choose what and when and how much he eats (we just never<br/>\nchanged that from when he was an infant and nursed on demand, for<br/>\nhowever long he wanted - the eat what, when, how much idea of free<br/>\nnursing as applied to solid foods). We&#39;ll answer questions and provide<br/>\ninformation and modelling (he&#39;s more likely to check a label than I am!)<br/>\n- he can eat just one potato chip if that&#39;s all he wants BECAUSE he<br/>\nknows he can have 20 if he wants or he can wait until later and have<br/>\nmore. There&#39;s a sense of abundance even when we&#39;re out of something and<br/>\nneed to wait until the next paycheck/grocery trip. DH and I have learned<br/>\nso much about healthy eating by watching our never food regulated DS -<br/>\nhe can just as easily eat half a doughnut, eat some homemade bread and<br/>\nsoup, then eat the rest of the doughnut as eat the whole doughnut first<br/>\nsimply because he knows that there&#39;s no &quot;deadline&quot; to get it done -<br/>\nit&#39;ll still be there and available later if he chooses to wait. He often<br/>\ngets a whopper jr (no pickles) but he knows that DH and I won&#39;t get that<br/>\n(I&#39;ll get a salad or a veggie burger if we&#39;re there) and he&#39;s coming to<br/>\nprefer going to places like Subway where he can get more veggies, less<br/>\nmeat (we&#39;re not vegetarian, we&#39;re more what I&#39;d call plant-based<br/>\nomnivores - we don&#39;t generally buy meats for home use but if we&#39;re out<br/>\nwe get whatever we want in that location). What&#39;s really humorous is<br/>\nwhen he piles a plate with steamed broccoli or avocado slices and people<br/>\nwonder how we &#39;get him&#39; to eat that (he generally opts for broccoli over<br/>\nfries whenever possible at restaurants) - it&#39;s really easy: don&#39;t make<br/>\nhim do it! He&#39;s got an interesting concept about things like halloween<br/>\ncandy and desserts and such: if you make kids eat all their dinner in<br/>\norder to get what they want (a sweet), then they&#39;ll override their body<br/>\nsaying it&#39;s full in order to eat the sweet because they&#39;ve &#39;earned&#39; it.<br/>\nHe&#39;s developed this idea in conversation with us and watching his<br/>\nyounger cousin be told &quot;you have to eat x or no y&quot; (you have to eat this<br/>\nserving of mac & cheese before you eat that slice of pumpkin pie for<br/>\ninstance...gee, they&#39;re not all that different when you get right down<br/>\nto it). <br/>\n<br/>\nDeb <br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"&quot;Karen Swanay&quot; &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Adult knowledge?","postDate":"1207315082","msgId":31553,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3YTlkNzUwMDgwNDA0MDYxOHIzMTE0YTY2OHNhNTEwMmU0MjZhYzM3ODQyQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGZ0NTZlbytqYWxtQGVHcm91cHMuY29tPg==","referencesHeader":"PDliY2E5ZTMwODA0MDQwMTA3aTI3NGY3MWEybmUxMWM0Yzc1ZTU4Njg4YmNAbWFpbC5nbWFpbC5jb20+CSA8ZnQ1NmVvK2phbG1AZUdyb3Vwcy5jb20+"},"prevInTopic":31551,"nextInTopic":31556,"prevInTime":31552,"nextInTime":31554,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"Kim, I am new to Unschooling and like you was (and sometimes still) have concerns and problems with the philosophy, or rather application of the philosophy in","messageBody":"<div id=\"ygrps-yiv-1845144211\">Kim,<br/>\n<br/>\nI am new to Unschooling and like you was (and sometimes still) have<br/>\nconcerns and problems with the philosophy, or rather application of<br/>\nthe philosophy in a particular situation.  Early on food was a big<br/>\nbugaboo for me.  I was overweight.  Very.  I&#39;m 5&#39;2&quot; and at my heaviest<br/>\nI weighed 235lbs.  I&#39;ve lost 100 lbs in 2 yrs.  I am also chronically<br/>\nill (Systemic Lupus, Fibromyalgia and Sjogren&#39;s Syndrome.)  So, I was<br/>\nreally sensitive to the idea that my boys might get fat.  And my 11 yr<br/>\nold is getting pudgy.  Anyway, I had this same pre-learning tantrum<br/>\nabout foods and just letting them eat whatever.  But Ren is right.  If<br/>\nyou control each and every mouthful of food you provide to your kids,<br/>\nthey will eat what they want when they can.  So I let it go.  It was<br/>\nnot easy.  I smiled and offered them the foods they wanted (although<br/>\nnot going out for fast food often because now we are talking going out<br/>\nand buying and that ran into some real life issues that we had to deal<br/>\nwith.)  But I&#39;d provide Cheese Its and other such &quot;crap&quot; and smile,<br/>\nbut in my head I&#39;d be screaming &quot;YOU ARE GOING TO GET SO FAT!!!&quot;<br/>\nBecause as I mentioned before, being fat is my bugaboo.  But I did<br/>\nthis in my head and was careful not to pass it along.  Despite some<br/>\nassertions that kids really know what you are thinking I think if you<br/>\nare careful you can think things and your kids will not know.  And<br/>\nthey didn&#39;t.  (That&#39;s how I got them to eat yogurt as babies, with a<br/>\nsmile and &quot;yummy!&quot; while inside I was gagging on the stench.)<br/>\n<br/>\nAnyway, there are a few shows on TV that we enjoy.  One is called &quot;You<br/>\nAre What You Eat&quot; it&#39;s on BBC America.  And it shows bad diets and<br/>\nwhat they do to people and what being on an 8 week detox diet can do<br/>\nfor folks.  We all watched it.  I didn&#39;t make them watch it.  And I<br/>\ncertainly NEVER said &quot;SEE!!! This will be YOU if you don&#39;t change your<br/>\nbad ways!&quot;  We just watched it because it was entertaining.  But they<br/>\nwere listening.  And another show, the name escapes me is about foods<br/>\nand our bodies and how to do a better job of feeding them.  The Dr who<br/>\nis on the show is Dr Oz anyway, we learned on that show how bad<br/>\nhydrogenated oils are for you and what they do to your liver.  Again,<br/>\nI didn&#39;t lecture and I didn&#39;t say &quot;You are killing yourself.&quot;  I just<br/>\ntalked about this new information actually WE talked about it.  It was<br/>\nsomething we didn&#39;t know.  My husband and I (my husband is a horrible<br/>\neater BTW) decided no hydrogenated oils for us.  Now the kids are kind<br/>\nof caught up in that because if I don&#39;t buy them they can&#39;t have them.<br/>\n But they got into reading labels too.  Foods they would choose<br/>\nnormally, they would choose different alternatives without the<br/>\nhydrogenated oils.  But I didn&#39;t insist.  They came to the decision on<br/>\ntheir own.  And yes, from time to time we ALL eat hydrogenated oils if<br/>\nwe are out or there is some item we want.  But overall we don&#39;t eat<br/>\nthem anymore.  Instead of buying cookies that are generally LOADED<br/>\nwith them (and high fructose corn syrup which we also avoid) I make<br/>\ncookies at home.  So it&#39;s not no cookies...it&#39;s how can we make<br/>\ncookies healthier?<br/>\n<br/>\nAlso I do not have artificial sweeteners here.  Because of my health<br/>\nissues, they all make my pain worse.  I have told the boys (not Morgan<br/>\nshe&#39;s just 3 and eats like a Chinese person so it&#39;s not an issue for<br/>\nher right now) that I&#39;d rather they try to avoid artificial sweeteners<br/>\nand that sugar isn&#39;t bad.  It&#39;s better if you want something sweet to<br/>\neat real sugar than chemical laden things.  But I don&#39;t insist.  I<br/>\nguide.  When we are at the store, if one of them picks up something<br/>\n&quot;Light&quot; because they believe it&#39;s a better food choice we read the<br/>\nlabel and see what&#39;s in it.  They decide then if they want it anyway<br/>\nor not.  I don&#39;t partake of it because *I* don&#39;t want to.  They know<br/>\nthat.  But they are welcome to have it.  We&#39;ve talked about how it<br/>\nmakes me feel and why I eye those products skeptically.  But that&#39;s<br/>\nnot beating them over the head with it.  That&#39;s just sharing<br/>\ninformation and there is a difference.  AND it&#39;s not scare tactics.  I<br/>\nhave anecdotal evidence from my own body that backs me up that when<br/>\n*I* drink or eat artificial sweeteners *I* am in more pain.  The boys<br/>\ncan ingest them with no issues.  If they choose to do so that&#39;s fine.<br/>\nI certainly have not said things I couldn&#39;t back up like &quot;Eating<br/>\nfrench fries causes cancer!&quot;  Because there isn&#39;t any real evidence to<br/>\nback that up.  My kids are smart and they know what studies are<br/>\nsupposed to show and what a representative sample is.  They know a<br/>\n&quot;study&quot; of 5 people that draws large conclusions is no study.<br/>\n<br/>\nWe also know someone who was in perfect health.  Jogged 6 miles a day,<br/>\nthin, beautiful, vegan.  Didn&#39;t smoke, didn&#39;t drink, and found liver<br/>\ncancer and was dead 8 weeks later.  Their grandfather was a smoker and<br/>\ngot lung cancer and died from it.  So they have seen both sides.  They<br/>\nask questions and I give them the factual information I have but I<br/>\nalso give them opinion but I tell them it&#39;s such.  &quot;I think smoking is<br/>\ngross.  Other people feel differently.&quot;  That is a statement of<br/>\nopinion and fact.  It is a fact that it is my opinion that smoking is<br/>\ngross.  It is fact that other people feel differently.  They will have<br/>\nto decide for themselves what they want to do.  But keeping it open<br/>\nfor us to discuss these issues makes it less likely they will try it.<br/>\nAnd as far as foods go...sometimes when we are out we do the fast food<br/>\nthing.  Because food shouldn&#39;t be punishment or reward.  Food is food.<br/>\n Some foods taste better than others.  We will sometimes eat something<br/>\nthat is *total crap* like the deep fried onions some places serve and<br/>\nwhile eating it we will talk about how bad it is for us but how very<br/>\ngood it tastes.  And more often than not it&#39;s the boys who bring it<br/>\nup.  It&#39;s OK to eat crap every now and again, and when we are all<br/>\nstuffing our faces with it and smiling and laughing it&#39;s so much<br/>\nbetter than us sitting around a table and choking down something I<br/>\npersonally find disgusting...fish...with everyone wishing they could<br/>\nbe eating something different.<br/>\n<br/>\nI guess what I&#39;m trying to say is that there is a larger picture<br/>\navailable and when I was looking at the very small picture (fat vs<br/>\nthin) I was missing the rest of the picture and passing along my food<br/>\nissues even though I thought I wasn&#39;t.  You will do what you can do<br/>\nwith this philosophy in the time frame that it works for you.  I<br/>\nfought against it in the beginning because I was looking at it as all<br/>\nor nothing.  If I can&#39;t do it all I might as well do nothing.  But<br/>\nwhen I let that go, I applied it where I could and made a conscious<br/>\neffort to let it take hold in other areas as well.  There are still<br/>\nthings I do say &quot;no&quot; to.  I just told Morgan &quot;No throwing&quot; when she<br/>\nhurled a wooden block in the direction of the TV.  There is a &quot;No<br/>\nThrowing&quot; rule in the living room for hard things.  But soft things<br/>\nare OK.  So I took the block and set it gently on the floor and threw<br/>\na soft &quot;OK to throw&quot; item at her.  She laughed and picked it up and is<br/>\nthrowing it around as we speak.  Likely I could have phrased it<br/>\nbetter.  But it&#39;s better than I would have done 9 yrs ago.  Come to<br/>\nthis as you can in the ways you can and it will eventually impose<br/>\nitself on other areas of your life.  You will see it work in one area<br/>\nand you will not be able to avoid seeing how it would work in another.<br/>\n At least that&#39;s how I see it.  But I haven&#39;t been at this very long,<br/>\njust about a year.<br/>\n<br/>\nhth<br/>\nKaren</div>","specialLinks":[]},{"userId":220041937,"authorName":"hbmccarty","from":"hbmccarty &lt;hbmccarty@...&gt;","profile":"heather13068","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Adult knowledge? (was Re: when did your kid(s) learn to read?)","postDate":"1207314577","msgId":31550,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3RjYyODkxLjYwODA3MDJAdHdjbnkucnIuY29tPg==","inReplyToHeader":"PGZ0NTZoaStrMWdiQGVHcm91cHMuY29tPg==","referencesHeader":"PGZ0NTZoaStrMWdiQGVHcm91cHMuY29tPg=="},"prevInTopic":31548,"nextInTopic":31551,"prevInTime":31549,"nextInTime":31551,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"Hi Kim- Control over food was the hardest thing for me to let go of- it was a very emotional process for me. My son has asthma which when he was younger was","messageBody":"<div id=\"ygrps-yiv-1574759012\">Hi Kim-<br/>\n<br/>\nControl over food was the hardest thing for me to let go of- it was a <br/>\nvery emotional process for me. My son has asthma which when he was <br/>\nyounger was markedly improved by avoiding gluten and refined foods in <br/>\ngeneral. The stakes are relatively high. However- control is not <br/>\nsomething I truly have over him, and that became apparent. What really <br/>\nhit me at one point is that even if somehow I managed to maintain <br/>\ncontrol over his diet when he lived at home(which I couldn&#39;t) - then he <br/>\nwould at one point leave home and begin binging on all the forbidden <br/>\nfoods and then really have some problems when I wasn&#39;t there to help <br/>\nhim. I much prefer to have him go through whatever process of learning <br/>\nabout how to maintain his own health- through whatever &quot;mistakes&quot; he <br/>\nneeds to make while he lives at home then when he is miles away. While I <br/>\nwas controlling his diet he was not learning to eat &quot;well&quot;- he was <br/>\nlearning that I was mean and controlling- that is all he could see.<br/>\n<br/>\nAlso- it become apparent that any type of control I attempted to have <br/>\nover him was hurting our relationship. This really became apparent as he <br/>\nreached the pre-teen years. Any influence I had would only come through <br/>\nputting our relationship first.  I only wish I had discovered this way <br/>\nof parenting long ago. I give him information WHEN he is open to it- <br/>\nsuch as when he asks- Mom- why do you get sick less than I do? Or why do <br/>\nyou buy this food instead of that food? He said recently that he prefers <br/>\nreal food to junk food- because it tastes better.<br/>\n<br/>\nI know this can feel like a  huge  step in trusting your children- but <br/>\nlike anything else- people will either learn it or not learn it- and <br/>\nforcing or prohibiting isn&#39;t helping them learn- it interferes.<br/>\n<br/>\nHeather M</div>","specialLinks":[]},{"userId":340081495,"authorName":"Mary Beth","from":"&quot;Mary Beth&quot; &lt;mbdaught@...&gt;","profile":"singingbirdmom2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Adult knowledge? (was Re: when did your kid(s) learn to read?)","postDate":"1207313910","msgId":31551,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ0NThsbStmcm5jQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZ0NTZoaStrMWdiQGVHcm91cHMuY29tPg=="},"prevInTopic":31550,"nextInTopic":31553,"prevInTime":31550,"nextInTime":31552,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"My kids have decided to avoid fast foods because of how it makes them feel.  They feel heavy or downright sick when they eat them.  None of them now choose","messageBody":"<div id=\"ygrps-yiv-512922104\">My kids have decided to avoid fast foods because of how it makes them <br/>\nfeel.  They feel heavy or downright sick when they eat them.  None of <br/>\nthem now choose fast foods, but it was their decision.  They now choose <br/>\nto go somewhere with salads or good bread and cheese and veggies.  My <br/>\nyoungest and decided to become a vegetarian, and it was because she <br/>\nloves animals so much.  She has influenced all of us to move in that <br/>\ndirection.  She recently told us that eating meat also influences the <br/>\nglobal environment.  My kids have been a great influence on me!  <br/>\n<br/>\nMary Beth</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Adult knowledge? (was Re: when did your kid(s) learn to read?)","postDate":"1207311730","msgId":31548,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ0NTZoaStrMWdiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDliY2E5ZTMwODA0MDQwMjI2bDcyNzAwNWI1djhmZDgwZDAyZDZmNmYzNjlAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":31547,"nextInTopic":31550,"prevInTime":31547,"nextInTime":31549,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"~~But at some point (lespecially when they are really young), don t you just have to say No. Otherwise, it turns into a lecture.~~ No lecture. No no . Just","messageBody":"<div id=\"ygrps-yiv-18678952\">~~But at some point (lespecially<br/>\nwhen they are really young), don&#39;t you just have to say &quot;No.&quot;<br/>\nOtherwise, it turns into a lecture.~~<br/>\n<br/>\n<br/>\nNo lecture. No &quot;no&quot;. Just eat the food in joy and peace and it will be<br/>\nhealthy. Really.<br/>\nAs they grow, trust that the ideas of healthy vs. unhealthy will be<br/>\npart of their learning process like everything else they&#39;re learning.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Adult knowledge?","postDate":"1207311640","msgId":31547,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ0NTZlbytqYWxtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDliY2E5ZTMwODA0MDQwMTA3aTI3NGY3MWEybmUxMWM0Yzc1ZTU4Njg4YmNAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":31546,"nextInTopic":31548,"prevInTime":31546,"nextInTime":31548,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"~!~Here s a question: If your child wanted to smoke cigarettes, would you allow that?~~ Do you believe that by not allowing something, it will actually keep ","messageBody":"<div id=\"ygrps-yiv-2133357434\">~!~Here&#39;s a question: If your child wanted to smoke cigarettes, would<br/>\nyou allow that?~~<br/>\n<br/>\nDo you believe that by not allowing something, it will actually keep<br/>\nyour child from doing it? Good luck with that.<br/>\n<br/>\nYou can keep your children from McDonald&#39;s most of the time right now,<br/>\nbecause they&#39;re young I assume. Anyone with older kids or teens knows<br/>\nfull well that a child will do the things they really desire as soon<br/>\nas they get away from a controlling parent. You&#39;re making that food<br/>\nseem really mystical and desirable.<br/>\n<br/>\nAs far as the cigarette issue, I knew when my oldest child tried a<br/>\ncigarette. He told me all about it and about the situation he&#39;d been<br/>\nin that caused him to try it. We talked about how it felt and what he<br/>\nthought. I didn&#39;t judge his choice as bad or good. We talked. I get<br/>\nsuch honesty from him at 18...about issues I would NEVER have shared<br/>\nwith my parents.<br/>\n<br/>\nI knew when he and his girlfriend made a conscious choice to have sex.<br/>\nForbidding sex or cigarettes or McDonalds is laughable really. Better<br/>\nto trust that my children need to explore certain foods or ideas WITH<br/>\nme alongside, than to forbid it and let them explore all alone later<br/>\nin life.<br/>\n<br/>\nIt&#39;s not true that McDonalds causes cancer and if you tell them that<br/>\nthey will meet people who eat those foods and are the epitome of<br/>\nhealth. Then what? Your credibility is shot. Cancer is partially<br/>\ngenetic and partically lifestyle induced. A lifestyle of health, with<br/>\nsome McDonald&#39;s thrown in is not going to harm most any average person.<br/>\n<br/>\nYour child will eat fries at some point, I could about bet. If they<br/>\ncan&#39;t trust you to not judge their desire for fries, how will they<br/>\ntrust you with the big issues like sex, drugs, tattoos etc???<br/>\n<br/>\nIf I had a craving for some ice cream and my dh informed me it was bad<br/>\nand told me &quot;no&quot;, it would create a situation in which he was in<br/>\npower. I don&#39;t want to be in a seat of power with my children, I<br/>\nprefer an environment where we are all learning together.<br/>\n<br/>\nInterestingly, if you came to my home you&#39;d hear a lot of talk about<br/>\nfossil fuels and food shortages and growing healthy foods. We have<br/>\nbees, we&#39;re growing a huge garden and these issues are part of our<br/>\nlives. Nobody gets some whopping &quot;that&#39;s not healthy&quot; judgement when<br/>\nthey want other foods though. In doing that, they trust me with<br/>\nconversations they might not otherwise trust me with. They&#39;re also<br/>\nvery balanced individuals because they explore all sorts of foods and<br/>\nthe idea of what THEIR own body needs vs. another person. <br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":333194003,"authorName":"Kim Musolff","from":"&quot;Kim Musolff&quot; &lt;kmoose75@...&gt;","profile":"little_minds_preschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Adult knowledge? (was Re: when did your kid(s) learn to read?)","postDate":"1207302048","msgId":31546,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDliY2E5ZTMwODA0MDQwMjQwbjI1Y2YyYzUxamQ0ZTI2N2QxYjg1OTgwNWJAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PEZBMDZDRDA5LURBNTktNDM0RS04MkZBLUMyQUE4ODc2M0YyOUB2ZXJpem9uLm5ldD4=","referencesHeader":"PDliY2E5ZTMwODA0MDIyMDAwdjc5MDZlNWZhZzE5MDhjYzRhMDQ4OWFhMDFAbWFpbC5nbWFpbC5jb20+CSA8RkEwNkNEMDktREE1OS00MzRFLTgyRkEtQzJBQTg4NzYzRjI5QHZlcml6b24ubmV0Pg=="},"prevInTopic":31545,"nextInTopic":31547,"prevInTime":31545,"nextInTime":31547,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"The poster was talking about school information here. The supposedly vital body of knowledge that educators impose on children (that most people forget 90%","messageBody":"<div id=\"ygrps-yiv-179328427\">The poster was talking about school information here. The supposedly<br/>\nvital &quot;body of knowledge&quot; that educators impose on children (that<br/>\nmost people forget 90% of ;-)<br/>\n<br/>\nMost parents worry how their kids will get all of that. When the tool<br/>\nof pushing that information into a child is removed for unschooling,<br/>\nthey still feel that need and seek other avenues that feel<br/>\n&quot;unschoolish&quot;, like looking for teachable moments.<br/>\n<br/>\nThe point is to work on eliminating the need to push in that body of<br/>\nknowledge rather than seek other ways to get it in.<br/>\n<br/>\n<br/>\nAha!  I think I get it now!  It&#39;s a perspective thing, not a &quot;rule&quot; that I<br/>\nmust follow! (Gee, was I schooled, or what?) I was just reading an<br/>\nunschooling book last night, and I had an epiphany.  Unschooling is not<br/>\nabout a formula for teaching/learning.  There are no rules to follow.  It is<br/>\nabout a way of thinking.  I think someone here (was it you, Joyce?) said<br/>\nthat it is more about learning how to give each of your children what THEY<br/>\nneed to  learn and grow.  Like when my baby cries, I know what she needs,<br/>\nbecause I know her.  I finally get that.  Yea!<br/>\n<br/>\nKim<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":333194003,"authorName":"Kim Musolff","from":"&quot;Kim Musolff&quot; &lt;kmoose75@...&gt;","profile":"little_minds_preschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Adult knowledge? (was Re: when did your kid(s) learn to read?)","postDate":"1207301210","msgId":31545,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDliY2E5ZTMwODA0MDQwMjI2bDcyNzAwNWI1djhmZDgwZDAyZDZmNmYzNjlAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDFGMTAzMTRELTIwNEMtNDhCRi1BQjZFLTRFN0YwMTdERTdCRkBtYWMuY29tPg==","referencesHeader":"PGZ0M2xvaCtvdm5mQGVHcm91cHMuY29tPgkgPDFGMTAzMTRELTIwNEMtNDhCRi1BQjZFLTRFN0YwMTdERTdCRkBtYWMuY29tPg=="},"prevInTopic":31543,"nextInTopic":31546,"prevInTime":31544,"nextInTime":31546,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"How about letting them know that it is very tempting and easy to eat too many unhealthy foods at fast food places - that they make the servings way oversized,","messageBody":"<div id=\"ygrps-yiv-3809102\">How about letting them know that it is very tempting and easy to eat<br/>\ntoo many unhealthy foods at fast food places - that they make the<br/>\nservings way oversized, that they use a lot of fat and salt, which is<br/>\nprobably fine for once in a while but not good on a regular basis.<br/>\nGood point.  I think I generally do this.  But at some point (lespecially<br/>\nwhen they are really young), don&#39;t you just have to say &quot;No.&quot;  Otherwise, it<br/>\nturns into a lecture.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":333194003,"authorName":"Kim Musolff","from":"&quot;Kim Musolff&quot; &lt;kmoose75@...&gt;","profile":"little_minds_preschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Adult knowledge?","postDate":"1207299097","msgId":31543,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDliY2E5ZTMwODA0MDQwMTUxazQ1YzFkZmE3bDNjODhhOWJmMWZmYjZiYjVAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGZ0NDhhZSs5cmwzQGVHcm91cHMuY29tPg==","referencesHeader":"PGZ0NDUzdCtoc2FvQGVHcm91cHMuY29tPiA8ZnQ0OGFlKzlybDNAZUdyb3Vwcy5jb20+"},"prevInTopic":31542,"nextInTopic":31545,"prevInTime":31542,"nextInTime":31544,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"I would say a fun time eating and playing at McDonald s is a LOT healthier for a human being than being told their desire is crap. It s one thing to say","messageBody":"<div id=\"ygrps-yiv-667453328\">I would say a fun time eating and playing at McDonald&#39;s is a LOT<br/>\nhealthier for a human being than being told their desire is crap.<br/>\nIt&#39;s one thing to say nicely, that we&#39;re not going to McDonalds because it&#39;s<br/>\nnot a healthy place to eat.  It&#39;s quite another to say their idea is crap.<br/>\nJust because you say no, does that really mean a child thinks his idea is<br/>\ncrap?  When I want to go out to eat, and my husband says, &quot;No,&quot; I don&#39;t<br/>\nassume he thinks my idea stinks.  Usually there is a good reason why he<br/>\ndoesn&#39;t want to go there.  We don&#39;t say no often, so once in awhile can&#39;t be<br/>\nbad.<br/>\n<br/>\n<br/>\nBut<br/>\nis there really a risk that if you are offering lots of healthy<br/>\nchoices and trusting them, that McDonald&#39;s will somehow ruin their<br/>\nhealth?<br/>\nI believe so.  I mean, i understand that McDonald&#39;s, once in awhile, will<br/>\nnot destroy your health if you generally make healthy food choices.  But<br/>\nwhat about helping children develop healthy habits?  If I took my children<br/>\nout to fast food every time they asked, until they were developmentally<br/>\nready to resist good-tasting food because of the health risks, that would be<br/>\nmore than just a few hamburgers.<br/>\n<br/>\nI&#39;m a certified health nut and I take my child to McDonald&#39;s when they<br/>\nask.<br/>\nBut how often do they ask?  If they asked every day, would you take them<br/>\nthere?  Our kids hardly ever asked to go to fast food restaurants before we<br/>\nmoved last summer.  But when we were between houses for 3 months, we ate out<br/>\nalmost every night.  Since then, our children have been asking to eat fast<br/>\nfood almost every time we pass one.  They think it&#39;s normal now.  And the<br/>\nproblem is that fast food tastes good.  If you don&#39;t know (or think about)<br/>\nwhat&#39;s in it, then it&#39;s much yummier than fish and rice for dinner.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":333194003,"authorName":"Kim Musolff","from":"&quot;Kim Musolff&quot; &lt;kmoose75@...&gt;","profile":"little_minds_preschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Adult knowledge?","postDate":"1207296427","msgId":31542,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDliY2E5ZTMwODA0MDQwMTA3aTI3NGY3MWEybmUxMWM0Yzc1ZTU4Njg4YmNAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGZ0NDUzdCtoc2FvQGVHcm91cHMuY29tPg==","referencesHeader":"PDliY2E5ZTMwODA0MDMwOTU0bDQ4MmQ0MTRieTJiMWM4ZTNmN2EyYzYwNTBAbWFpbC5nbWFpbC5jb20+CSA8ZnQ0NTN0K2hzYW9AZUdyb3Vwcy5jb20+"},"prevInTopic":31538,"nextInTopic":31543,"prevInTime":31541,"nextInTime":31543,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"I don t quite get this viewpoint.  First of all, it s not other people, it s my children.  Not that I own them, but that I love them.  I care for their ","messageBody":"<div id=\"ygrps-yiv-1634879944\">I don&#39;t quite get this viewpoint.  First of all, it&#39;s not other people, it&#39;s<br/>\nmy children.  Not that I own them, but that I love them.  I care for their<br/>\nwell-being.  Secondly, I do know better than them sometimes, because they<br/>\nare children and I am an adult.  They know that french fries taste good.<br/>\nThey don&#39;t know that they cause cancer and heart disease.  And even if they<br/>\ndo, developmentally, they aren&#39;t always capable of putting into perspective<br/>\nthe health risks and the craving for fried food.  Are you saying that even<br/>\nif I do know better, no matter what, I should let them make their own<br/>\ndecisions?<br/>\n<br/>\nHere&#39;s a question:  If your child wanted to smoke cigarettes, would you<br/>\nallow that?  I am not asking this question to be confrontational, I am<br/>\nasking it because it is the most extreme situation that I can think of, and<br/>\nI am really trying to wrap my mind around this.<br/>\n<br/>\nSometimes I really feel like I get unschooling, and other times, I think,<br/>\n&quot;No, this can&#39;t be for me.&quot;  I am just thankful that at least you all are<br/>\ndiscussing this with me!<br/>\n<br/>\nKim<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This bothered me, too. It&#39;s one thing to pass on your beliefs for<br/>\n&gt; other people to take or leave. It&#39;s another thing to not allow<br/>\n&gt; something because you think you *know* better.<br/>\n&gt;<br/>\n&gt; Alysia<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Adult knowledge? (was Re: when did your kid(s) learn to read?)","postDate":"1207290408","msgId":31538,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFGMTAzMTRELTIwNEMtNDhCRi1BQjZFLTRFN0YwMTdERTdCRkBtYWMuY29tPg==","inReplyToHeader":"PGZ0M2xvaCtvdm5mQGVHcm91cHMuY29tPg==","referencesHeader":"PGZ0M2xvaCtvdm5mQGVHcm91cHMuY29tPg=="},"prevInTopic":31536,"nextInTopic":31542,"prevInTime":31537,"nextInTime":31539,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"... I see something wrong with overstatements. It reduces your credibility. Give specifics that you can really back up with true information. How about letting","messageBody":"<div id=\"ygrps-yiv-1662494138\">On Apr 3, 2008, at 3:29 PM, barefootmamax4 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t see anything wrong with just giving the knowlege that fast<br/>\n&gt; food is unhealthy,<br/>\n<br/>\n </span></blockquote>I see something wrong with overstatements. It reduces your  <br/>\ncredibility. Give specifics that you can really back up with true  <br/>\ninformation.<br/>\n<br/>\nHow about letting them know that it is very tempting and easy to eat  <br/>\ntoo many unhealthy foods at fast food places - that they make the  <br/>\nservings way oversized, that they use a lot of fat and salt, which is  <br/>\nprobably fine for once in a while but not good on a regular basis.<br/>\n<br/>\nI eat VERY healthy, but I do eat fast food frequently. I eat a baked  <br/>\npotato and a garden salad at Wendy&#39;s. I eat a piled-high with veggies  <br/>\nsandwich or salad at Subway. I get a grilled chicken sandwich with no  <br/>\nsauce and double lettuce and tomatoes. I get a plain hamburger, every  <br/>\nonce in a while, with double lettuce and double tomatoes. I don&#39;t eat  <br/>\nfries or cheeseburgers or chicken nuggets or hash browns or milk  <br/>\nshakes or soda or apple turnovers or onion rings. I get a nonfat latte  <br/>\nat Starbucks with one of those little bags of almonds that they have  <br/>\nat the register. I get a whole wheat bagel and low-fat cream cheese. I  <br/>\nget a grilled veggie bare-bowl burrito with no cheese and extra fresh  <br/>\nsalsa at Baja Fresh. I get a Panda Bowl with mandarin chicken on  <br/>\nveggies (no noodles) at Panda Express. I LOVE Genghis Khan - the  <br/>\nmongolian barbeque place in many malls - I pile on the veggies with  <br/>\njust a little smidgen of lean chicken and no noodles.<br/>\n<br/>\nI could go on - I eat fast food very often, but I am very picky about  <br/>\nwhat I choose to eat.<br/>\n<br/>\n-pam<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Adult knowledge?","postDate":"1207280782","msgId":31536,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ0NDhhZSs5cmwzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZ0NDUzdCtoc2FvQGVHcm91cHMuY29tPg=="},"prevInTopic":31531,"nextInTopic":31538,"prevInTime":31535,"nextInTime":31537,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"~~I would not let them go to fast food restaurants anyway until they were ready to learn it--I would just say, No, McDonald s is not good for you. ~~ I would","messageBody":"<div id=\"ygrps-yiv-814185739\">~~I would not let them go to fast food restaurants<br/>\nanyway until they were ready to learn it--I would just say, &quot;No,<br/>\nMcDonald&#39;s is not good for you.&quot;~~<br/>\n<br/>\nI would say a fun time eating and playing at McDonald&#39;s is a LOT<br/>\nhealthier for a human being than being told their desire is crap.<br/>\nHappiness is good for you. <br/>\nFood is food. Some food is better for us than other foods, sure. But<br/>\nis there really a risk that if you are offering lots of healthy<br/>\nchoices and trusting them, that McDonald&#39;s will somehow ruin their<br/>\nhealth? Nah.<br/>\n<br/>\nI&#39;m a certified health nut and I take my child to McDonald&#39;s when they<br/>\nask. The happy memories far outweigh any unhealthiness in the food. My<br/>\nchild may or may not live to adulthood. I may or may not live to see<br/>\nthem into adulthood. I&#39;d rather they have fabulous memories of us<br/>\ndoing things together than memories of me saying &quot;no, it&#39;s bad for<br/>\nyou&quot; and creating a greater desire to explore that thing as soon as<br/>\nI&#39;m not around!<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":332901363,"authorName":"keetry","from":"&quot;keetry&quot; &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Adult knowledge?","postDate":"1207277501","msgId":31531,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ0NDUzdCtoc2FvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDliY2E5ZTMwODA0MDMwOTU0bDQ4MmQ0MTRieTJiMWM4ZTNmN2EyYzYwNTBAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":31522,"nextInTopic":31536,"prevInTime":31530,"nextInTime":31532,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"... learn ... anyway ... is not ... This bothered me, too. It s one thing to pass on your beliefs for other people to take or leave. It s another thing to not","messageBody":"<div id=\"ygrps-yiv-680324822\"><blockquote><span title=\"ireply\">&gt;  But if my knowledge is that fast<br/>\n&gt; food is not healthy for you, I would try to give them that knowledge,<br/>\n&gt; explaining why fast food is unhealthy.  And if they weren&#39;t ready to <br/>\n </span></blockquote>learn<br/>\n<blockquote><span title=\"ireply\"> &gt; that knowledge yet, I would not let them go to fast food restaurants <br/>\n </span></blockquote>anyway<br/>\n<blockquote><span title=\"ireply\"> &gt; until they were ready to learn it--I would just say, &quot;No, McDonald&#39;s <br/>\n </span></blockquote>is not<br/>\n<blockquote><span title=\"ireply\"> &gt; good for you.&quot;<br/>\n<br/>\n<br/>\n </span></blockquote>This bothered me, too. It&#39;s one thing to pass on your beliefs for <br/>\nother people to take or leave. It&#39;s another thing to not allow <br/>\nsomething because you think you *know* better. <br/>\n<br/>\nAlysia</div>","specialLinks":[]},{"userId":241586873,"authorName":"barefootmamax4","from":"&quot;barefootmamax4&quot; &lt;barefootmamax4@...&gt;","profile":"barefootmamax4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Adult knowledge? (was Re: when did your kid(s) learn to read?)","postDate":"1207261777","msgId":31522,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ0M2xvaCtvdm5mQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDliY2E5ZTMwODA0MDMwOTU0bDQ4MmQ0MTRieTJiMWM4ZTNmN2EyYzYwNTBAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":31511,"nextInTopic":31531,"prevInTime":31521,"nextInTime":31523,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"... knowledge, ... to learn ... restaurants anyway ... McDonald s is not ... What about if they disagree with you? You would not let them go until they learn","messageBody":"<div id=\"ygrps-yiv-1206694480\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Kim Musolff&quot; <br/>\n&lt;kmoose75@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\">  &gt;  But if my knowledge is that fast<br/>\n&gt; food is not healthy for you, I would try to give them that <br/>\n </span></blockquote>knowledge,<br/>\n<blockquote><span title=\"ireply\"> &gt; explaining why fast food is unhealthy.  And if they weren&#39;t ready <br/>\n </span></blockquote>to learn<br/>\n<blockquote><span title=\"ireply\"> &gt; that knowledge yet, I would not let them go to fast food <br/>\n </span></blockquote>restaurants anyway<br/>\n<blockquote><span title=\"ireply\"> &gt; until they were ready to learn it--I would just say, &quot;No, <br/>\n </span></blockquote>McDonald&#39;s is not<br/>\n<blockquote><span title=\"ireply\"> &gt; good for you.&quot;<br/>\n<br/>\n </span></blockquote> What about if they disagree with you? You would not let them go <br/>\nuntil they learn it? What will you do when they go even if you don&#39;t <br/>\nallow it? Is where the &quot;power&quot; comes in,to enforce them to learn what <br/>\nyou want/believe in? You could always say &quot;No, I will not take you&quot;. <br/>\nWhat will happen when they find other ways to get there like bikes or <br/>\nfriends or cars?<br/>\n I don&#39;t see anything wrong with just giving the knowlege that fast <br/>\nfood is unhealthy,but I don&#39;t see that knowlege as a power thing <br/>\neither. <br/>\n-Kelly</div>","specialLinks":[]},{"userId":333194003,"authorName":"Kim Musolff","from":"&quot;Kim Musolff&quot; &lt;kmoose75@...&gt;","profile":"little_minds_preschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Adult knowledge? (was Re: when did your kid(s) learn to read?)","postDate":"1207241671","msgId":31511,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDliY2E5ZTMwODA0MDMwOTU0bDQ4MmQ0MTRieTJiMWM4ZTNmN2EyYzYwNTBAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGZ0MnBhYSttcjFvQGVHcm91cHMuY29tPg==","referencesHeader":"PEZBMDZDRDA5LURBNTktNDM0RS04MkZBLUMyQUE4ODc2M0YyOUB2ZXJpem9uLm5ldD4JIDxmdDJwYWErbXIxb0BlR3JvdXBzLmNvbT4="},"prevInTopic":31501,"nextInTopic":31522,"prevInTime":31510,"nextInTime":31512,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"I don t get the seat of power thing at all. Just because I have more experience in some things doesn t give me more power, as there is always somebody who","messageBody":"<div id=\"ygrps-yiv-791659679\">I don&#39;t get the seat of power thing at all. Just because I have more<br/>\nexperience in some things doesn&#39;t give me more power, as there is<br/>\nalways somebody who knows things I don&#39;t. I know a lot about horses,<br/>\nbut not nearly as much about fishing as my 9 yr old does. If we have to<br/>\ncall an electrician to fix our light switch does that put him/her in<br/>\na &quot;seat of power?&quot; I suppose, since we pay the electrician for their<br/>\ninformation it could be, but I&#39;ll bet I still know more about horses!<br/>\n<br/>\nBut I&#39;m not saying that I have &quot;power&quot; just because I know something that<br/>\nthey don&#39;t.  I don&#39;t use it to get them to do things just because I feel<br/>\nlike I want to control them or because I need to feel powerful.  It&#39;s<br/>\nbecause I feel like certain information is vital to their happiness and/or<br/>\nwell-being.  If I knew more about horses and my son about fishing, I<br/>\nwouldn&#39;t force him to learn about horses.  But if my knowledge is that fast<br/>\nfood is not healthy for you, I would try to give them that knowledge,<br/>\nexplaining why fast food is unhealthy.  And if they weren&#39;t ready to learn<br/>\nthat knowledge yet, I would not let them go to fast food restaurants anyway<br/>\nuntil they were ready to learn it--I would just say, &quot;No, McDonald&#39;s is not<br/>\ngood for you.&quot;<br/>\n<br/>\nKim<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":241586873,"authorName":"barefootmamax4","from":"&quot;barefootmamax4&quot; &lt;barefootmamax4@...&gt;","profile":"barefootmamax4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Adult knowledge? (was Re: when did your kid(s) learn to read?)","postDate":"1207232650","msgId":31501,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ0MnBhYSttcjFvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEZBMDZDRDA5LURBNTktNDM0RS04MkZBLUMyQUE4ODc2M0YyOUB2ZXJpem9uLm5ldD4="},"prevInTopic":31493,"nextInTopic":31511,"prevInTime":31500,"nextInTime":31502,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"... get ... I am wondering if this is something like being in school where you are learning things out of context, like who invented the telephone when you are","messageBody":"<div id=\"ygrps-yiv-1699832766\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joyce Fetteroll <br/>\n&lt;jfetteroll@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; On Apr 2, 2008, at 11:00 PM, Kim Musolff wrote:<br/>\n&gt; <br/>\n&gt; &gt;&gt; The<br/>\n&gt; &gt;&gt; first implies a parent has information the child needs and should <br/>\n </span></blockquote>get<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;&gt; at some point. It puts the parent in the seat of power and does not<br/>\n&gt; &gt;&gt; allow for joint exploration much.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Why is it wrong to admit that  parents have certain information that<br/>\n&gt; &gt; children need?<br/>\n<br/>\n </span></blockquote>I am wondering if this is something like being in school where you are <br/>\nlearning things out of context, like who invented the telephone when <br/>\nyou are no where near a telephone,but studying inventors because it&#39;s <br/>\nin the curriculm. The other way, giving information about needing to <br/>\ndrink  when hot is probably being given in context,like on a hot day <br/>\nnot in the middle of winter. <br/>\n<br/>\nI don&#39;t get the seat of power thing at all. Just because I have more <br/>\nexperience in some things doesn&#39;t give me more power, as there is <br/>\nalways somebody who knows things I don&#39;t. I know a lot about horses, <br/>\nbut not nearly as much about fishing as my 9 yr old does. If we have to <br/>\ncall an electrician to fix our light switch does that put him/her in <br/>\na &quot;seat of power?&quot; I suppose, since we pay the electrician for their <br/>\ninformation it could be, but I&#39;ll bet I still know more about horses!<br/>\n-Kelly</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Adult knowledge? (was Re: when did your kid(s) learn to read?)","postDate":"1207215759","msgId":31493,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZBMDZDRDA5LURBNTktNDM0RS04MkZBLUMyQUE4ODc2M0YyOUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDliY2E5ZTMwODA0MDIyMDAwdjc5MDZlNWZhZzE5MDhjYzRhMDQ4OWFhMDFAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PDliY2E5ZTMwODA0MDIyMDAwdjc5MDZlNWZhZzE5MDhjYzRhMDQ4OWFhMDFAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":31492,"nextInTopic":31501,"prevInTime":31492,"nextInTime":31494,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"... The poster was talking about school information here. The supposedly vital body of knowledge that educators impose on children (that most people forget","messageBody":"<div id=\"ygrps-yiv-1409947910\">On Apr 2, 2008, at 11:00 PM, Kim Musolff wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; The<br/>\n&gt;&gt; first implies a parent has information the child needs and should get<br/>\n&gt;&gt; at some point. It puts the parent in the seat of power and does not<br/>\n&gt;&gt; allow for joint exploration much.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Why is it wrong to admit that  parents have certain information that<br/>\n&gt; children need?<br/>\n<br/>\n </span></blockquote>The poster was talking about school information here. The supposedly  <br/>\nvital &quot;body of knowledge&quot; that educators impose on children (that  <br/>\nmost people forget 90% of ;-)<br/>\n<br/>\nMost parents worry how their kids will get all of that. When the tool  <br/>\nof pushing that information into a child is removed for unschooling,  <br/>\nthey still feel that need and seek other avenues that feel  <br/>\n&quot;unschoolish&quot;, like looking for teachable moments.<br/>\n<br/>\nThe point is to work on eliminating the need to push in that body of  <br/>\nknowledge rather than seek other ways to get it in.<br/>\n<br/>\nUnschooled kids *will* acquire a body of knowledge but it will be  <br/>\nspecific to who they are and what their interests are.*  In a rich  <br/>\nenvironment they will absorb a lot of stuff that would have been  <br/>\npushed into them in school (and often promptly forgotten ;-) but it  <br/>\nwill be in a context that&#39;s meaningful to them. (Jokes for instance :-)<br/>\n<br/>\n* (And parents shouldn&#39;t worry if it looks like they know nothing but  <br/>\nWorld of Warcraft right now! ;-) The unschooling parent needs to  <br/>\nfigure out what they are learning -- perhaps by playing, perhaps  <br/>\nthrough conversations -- rather than look at what they aren&#39;t  <br/>\nlearning. It&#39;s the child&#39;s task to ease the parent&#39;s worry. It&#39;s up  <br/>\nto the parent to work on eliminating their own worry.)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Adult knowledge? (was Re: when did your kid(s) learn to read?)","postDate":"1207200223","msgId":31492,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxNTJBOEFGLURCQTktNDI2NC04OTYwLTkyMjE2QTY2MThFM0BtYWMuY29tPg==","inReplyToHeader":"PDliY2E5ZTMwODA0MDIyMDAwdjc5MDZlNWZhZzE5MDhjYzRhMDQ4OWFhMDFAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PDliY2E5ZTMwODA0MDIyMDAwdjc5MDZlNWZhZzE5MDhjYzRhMDQ4OWFhMDFAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":31491,"nextInTopic":31493,"prevInTime":31491,"nextInTime":31493,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"... You re hearing something that isn t being said - but I m not sure exactly what is making you think this is what people mean. -pam [Non-text portions of","messageBody":"<div id=\"ygrps-yiv-1384655544\">On Apr 2, 2008, at 8:00 PM, Kim Musolff wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The<br/>\n&gt; first implies a parent has information the child needs and should get<br/>\n&gt; at some point. It puts the parent in the seat of power and does not<br/>\n&gt; allow for joint exploration much.<br/>\n&gt;<br/>\n&gt; Why is it wrong to admit that parents have certain information that<br/>\n&gt; children need?<br/>\n<br/>\n<br/>\n </span></blockquote>You&#39;re hearing something that isn&#39;t being said - but I&#39;m not sure  <br/>\nexactly what is making you think this is what people mean.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":333194003,"authorName":"Kim Musolff","from":"&quot;Kim Musolff&quot; &lt;kmoose75@...&gt;","profile":"little_minds_preschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Adult knowledge? (was Re: when did your kid(s) learn to read?)","postDate":"1207191623","msgId":31491,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDliY2E5ZTMwODA0MDIyMDAwdjc5MDZlNWZhZzE5MDhjYzRhMDQ4OWFhMDFAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":0,"nextInTopic":31492,"prevInTime":31490,"nextInTime":31492,"topicId":31491,"numMessagesInTopic":0,"msgSnippet":"Ok.  I m just going to ask this question, because it s one of the barriers for me that keeps me from totally understanding unschooling.  I get this... It also","messageBody":"<div id=\"ygrps-yiv-1976271060\">Ok.  I&#39;m just going to ask this question, because it&#39;s one of the barriers<br/>\nfor me that keeps me from totally understanding unschooling.  I get this...<br/>\n<br/>\nIt also implies that when a child<br/>\nasks a question they want some kind of &quot;learning&quot; to take place when<br/>\nmaybe they just feel like talking, or putzing about with you and don&#39;t<br/>\nreally care about the answer at all.<br/>\n<br/>\nWhen my children ask questions, I do think about why they are asking it, and<br/>\ntry to answer accordingly.  I think I do a pretty good job judging if they<br/>\nare really curious about what they have asked, or if they are just trying to<br/>\nmake conversation.  And when I do misjudge, they let me know pretty quickly<br/>\nand I either back off (if I&#39;m getting to deep) or get more detailed (if I<br/>\nhaven&#39;t quite answered what they wanted to know).<br/>\n<br/>\nBut what I&#39;m really having a hard time fully grasping is this:<br/>\n<br/>\nThe<br/>\nfirst implies a parent has information the child needs and should get<br/>\nat some point. It puts the parent in the seat of power and does not<br/>\nallow for joint exploration much.<br/>\n<br/>\nWhy is it wrong to admit that  parents have certain information that<br/>\nchildren need?  I understand that adults don&#39;t give children nearly the<br/>\ncredit they deserve on knowing what they want to learn and when they want to<br/>\nlearn it.  I completely believe that children are naturally curious beings<br/>\nwho seek out knowledge and love to learn, and that they will continue to be<br/>\nthat way if they are given the constant freedom to do so.  And I also<br/>\nunderstand that anyone learns, only when they are motivated to do so, or if<br/>\nit has some meaning to them.<br/>\n<br/>\nBut I know that I, as an adult, know some things that my children do not.<br/>\nAnd while some of those things aren&#39;t important if, or when, my children<br/>\never decide to learn them (like, Shakespeare, trigonometry, or the history<br/>\nof Rome), aren&#39;t some things necessary for children to know *right now*?  What<br/>\nI really don&#39;t understand is why it is wrong of me to impart my knowledge<br/>\nwhen it comes to safety, health, or their ability to function (happily) in<br/>\nsociety as an adult.<br/>\n<br/>\nI&#39;m not saying that I know everything and my children do not.  For the most<br/>\npart, my children choose what to learn about and we explore things together<br/>\n(or they do it alone.)  They even teach me things (like how an engine<br/>\nworks!)  I don&#39;t sit them down and teach them lessons about these things.<br/>\nIt all happens spontaneously, as conversations or situations arise.  But in<br/>\nthese situations I do speak to them from experience, and I do feel like it<br/>\nis my duty as a parent to tell them things like &quot;we don&#39;t run out into the<br/>\nstreet without looking&quot; or &quot;when it&#39;s 102 degrees outside, you need to drink<br/>\nwater or you will get dehydrated.&quot;  I am an adult, experienced in life, and<br/>\nthere are just some things that I feel like would be neglectful if I did not<br/>\nreveal to them.  How do you get around these things as an unschooler?<br/>\n<br/>\nKim<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":31486,"nextTopicId":31503}}