{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":263098657,"authorName":"madonaverde","from":"&quot;madonaverde&quot; &lt;madonaverde@...&gt;","profile":"madonaverde","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: gifted","postDate":"1164743342","msgId":19389,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVraTNyZSs1aWhyQGVHcm91cHMuY29tPg=="},"prevInTopic":19387,"nextInTopic":0,"prevInTime":19388,"nextInTime":19390,"topicId":19379,"numMessagesInTopic":0,"msgSnippet":"I was one of those kids identified as gifted back in 5th grade or so.  I know that being shuffled into this category got me access to more educational","messageBody":"<div id=\"ygrps-yiv-45039558\">I was one of those kids identified as &quot;gifted&quot; back in 5th grade or<br/>\nso.  I know that being shuffled into this category got me access to<br/>\nmore educational opportunities in school that made it more interesting<br/>\n(eg programs, field trips etc etc etc that only the &quot;gifted&quot; classes<br/>\nwere offered/got to do).  For that, I will always be grateful.<br/>\n<br/>\nOn the other hand...<br/>\n<br/>\nBetween that and my IQ scores, I was also hounded many times over the<br/>\nyears for &quot;not living up to my &#39;potential&#39; &quot;.  Barf.  <br/>\n<br/>\nWhat that really meant is that I hated school and wasn&#39;t &quot;motivated&quot;<br/>\nto get A&#39;s all the time - even though I supposedly &quot;could, if I wanted<br/>\nto&quot; etc etc etc.  I had a great penchant for getting low b&#39;s and<br/>\noccasional c&#39;s on my midterm grades (the ones that didn&#39;t &quot;count&quot;),<br/>\nand then managing to pull them up to high b&#39;s/low a&#39;s by the time we<br/>\ngot to the ones that &quot;counted&quot;.  I did better on the assignments that<br/>\nI liked. Fancy that.  ;-)<br/>\n<br/>\nIt also meant that I was constantly comparing myself with the other<br/>\n&quot;gifted&quot; kids and wondering why I wasn&#39;t doing as well academically as<br/>\nthey were.  I gave myself a lot of hell in general for wondering why I<br/>\ndidn&#39;t do better, given that everyone else seemed to agree that I<br/>\n&quot;could&quot; do it because I was diagnosed as &quot;smart&quot; etc etc etc.<br/>\n<br/>\nI was also recruited for two different &quot;gifted&quot; magnet program in high<br/>\nschool (you couldn&#39;t even be considered for the program without a<br/>\ncertain minimum IQ score).  I was floored when a classmate of mine -<br/>\nwho I always considered extremely smart and much more articulate than<br/>\nI - wasn&#39;t being considered for one of the two programs because his IQ<br/>\napparently was lower than mine and did not meet the minimum.  <br/>\n<br/>\nAnd speaking of the other kinds of &quot;gifted&quot; that they don&#39;t test for....<br/>\n<br/>\nI did end up attending one of the above-mentioned magnet programs and<br/>\ncontinued to have academic issues.  In particular, the instructors<br/>\nwere trying to put us in these tight boxes that just didn&#39;t fit me (or<br/>\nmany of the other kids).  Some of the kids rebelled and just didn&#39;t<br/>\nperform, others (with wickedly strict and academia-is-god minded<br/>\nparents), simply went along with it anyway for fear of the wrath of<br/>\ntheir parents.  I couldn&#39;t.<br/>\n<br/>\nSo wanna know what I got busted for?<br/>\n<br/>\nBeing a &quot;social butterfly&quot;.  Meaning I wasn&#39;t clique-ish and got along<br/>\nwith EVERYONE in the class as opposed to clinging with a few select<br/>\npeople and denigrating the rest.  Meaning that I cared about more in<br/>\nlife than just &quot;getting the grades&quot;.  Meaning the guy that I was sorta<br/>\nkinda seeing at the time was in rebel mode and was screwing up with<br/>\nhis grades because he thought the system was bullshit too.  <br/>\n<br/>\nMeanwhile.<br/>\n<br/>\nMommy dearest (his, not mine), complained to the teacher that she<br/>\nthought it was MY fault for &quot;distracting&quot; the poor lad and thereby<br/>\ncausing his declining grades.  The (male chauvanist) teacher  called<br/>\nmy mom and I into a parent teacher conference and I was reprimanded. <br/>\nMade to sign a CONTRACT (or risk being kicked out of the program) that<br/>\nstated (among other things) that I would not contact said poor<br/>\nsuffering lad outside of class until my homework for the evening was<br/>\ndone. <br/>\n<br/>\nSo.<br/>\n<br/>\nAgainst the wall, said contract was signed.  A few weeks later, said<br/>\nsuffering lad told me he didn&#39;t want anything to do with me anymore<br/>\nbecause I wasn&#39;t enough of a &quot;go-getter&quot;. He then proceeded to<br/>\nactively harass and torment me (largely over academic issues - ie that<br/>\nhe was better/smarter than I) for the rest of my high school career. <br/>\nA few weeks after that, I left the program (although I did finish out<br/>\nHigh School at the same school).<br/>\n<br/>\nAfter high school, I went to a public college - UC Santa Barbara, got<br/>\nok grades, did a lot of fun stuff while staying drug-free and<br/>\nresponsible, stayed a &quot;social butterfly&quot; and was HAPPY.  He went to<br/>\nStanford (his mama determined which schools he would apply to - they<br/>\nwere all private/ivy league), remained an obnoxious ass, got hooked on<br/>\ndrugs and fried his brain.<br/>\n<br/>\nHmm. &quot;Gifted&quot;.<br/>\n<br/>\n;-)</div>","specialLinks":[]},{"userId":30983993,"authorName":"Lesa","from":"&quot;Lesa&quot; &lt;lesajm@...&gt;","profile":"lesamlowe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] re: gifted","postDate":"1164738937","msgId":19387,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExOS1EQVYxODY1NUQxRDEwNzQ0NTU0OTUwREREM0U1MEBwaHguZ2JsPg==","referencesHeader":"PGVrZ2o2ais0ZGU3QGVHcm91cHMuY29tPg=="},"prevInTopic":19385,"nextInTopic":19389,"prevInTime":19386,"nextInTime":19388,"topicId":19379,"numMessagesInTopic":0,"msgSnippet":"... nothing!","messageBody":"<div id=\"ygrps-yiv-813394301\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;It is a measurement of intelligence, which means what?............<br/>\n </span></blockquote>Absolutely \r<br/>\nnothing!&lt;&lt;&lt;\r<br/>\n\r<br/>\nAnd it&#39;s only a measurement of one type of intelligence.  It&#39;s a limited<br/>\nview of intelligence.  There&#39;s a book out now that discusses this.  I can&#39;t<br/>\nthink of the name of it, something about there being 5 types of intelligence<br/>\n\r<br/>\n \r<br/>\nLesa M.\r<br/>\nMy Blog: <a rel=\"nofollow\" target=\"_blank\" href=\"http://lifeacademy.homeschooljournal.net\">http://lifeacademy.homeschooljournal.net</a>\r<br/>\nMy eBay Store: <a rel=\"nofollow\" target=\"_blank\" href=\"http://store.auctiva.com/lesajm\">http://store.auctiva.com/lesajm</a>\r<br/>\n-------Original Message-------\r<br/>\n \r<br/>\nFrom: frozenandcold\r<br/>\nDate: 11/28/06 00:07:51\r<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>\r<br/>\nSubject: [unschoolingbasics] re: gifted\r<br/>\n \r<br/>\nSomething that I just keep thinking of as I am reading through these \r<br/>\nposts is that it is very interesting that we only use the \r<br/>\nterm &quot;gifted&quot; when we are talking about kids in school. I don&#39;t think \r<br/>\nI have ever heard a person refer to an adult as &quot;gifted&quot;. I hear, &quot;He \r<br/>\nis really good at building things&quot;, &quot;He is quite the musician&quot;, or &quot;He \r<br/>\nknows a lot about investments&quot; etc. but I don&#39;t ever hear &quot;He is \r<br/>\ngifted&quot; when talking about adults. It is an academic thing and I \r<br/>\nthink that is why us unschoolers get so yucked by it. It is a \r<br/>\nmeasurement of intelligence, which means what?.............Absolutely \r<br/>\nnothing!\r<br/>\n\r<br/>\nHeidi\r<br/>\n\r<br/>\n\r<br/>\n \r<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":212934673,"authorName":"Michelle Leifur Reid","from":"&quot;Michelle Leifur Reid&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: gifted","postDate":"1164737898","msgId":19385,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjExMjgxMDE4cDFiODU2YWFjbTczMzU1OWI3OTYxZjU4NWFAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGVraG8zaytua3ByQGVHcm91cHMuY29tPg==","referencesHeader":"PGVraGs5cCtzOWYyQGVHcm91cHMuY29tPiA8ZWtobzNrK25rcHJAZUdyb3Vwcy5jb20+"},"prevInTopic":19384,"nextInTopic":19387,"prevInTime":19384,"nextInTime":19386,"topicId":19379,"numMessagesInTopic":0,"msgSnippet":"... Not only are the tests testing certain KINDS of intelligence but also how well you preform in that particular environment - which has nothing to do with","messageBody":"<div id=\"ygrps-yiv-97887251\">On 11/28/06, Ren Allen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How do you quantify intelligence without a test? A test that really<br/>\n&gt; means very little because it is testing certain KINDS of intelligence.<br/>\n&gt; And if you can&#39;t quantify it, does it matter? The label &quot;intelligent&quot;<br/>\n&gt; is useless to me.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote> Not only are the tests testing certain KINDS of intelligence but also<br/>\nhow well you preform in that particular environment - which has<br/>\nnothing to do with whether or not you obtain the knowledge for which<br/>\nthey are seeking!  I suck at multiple choice tests, but I excel at<br/>\nwritten tests.<br/>\n<br/>\nAnd what exactly is intelligence?  Do I think that my children are<br/>\n&quot;intelligent&quot;  sure, but I also realize that it may be a bit of<br/>\nmother&#39;s bias :)  I hear them talking about things that I never would<br/>\nhave considered at their ages.  They have a world view that is vastly<br/>\ndifferent from my own when I was a child.  Their understanding of<br/>\nmathematical concepts amazes me because it was something I never was<br/>\nvery good at when I was in school.  Their play is indepth and complex,<br/>\nit goes beyond how I played as a child.  Perhaps I a childhood<br/>\nilliterate :)<br/>\n<br/>\nThere is a girl who bags groceries for me at the store.  She has<br/>\ntirsomy 21 (Down&#39;s Syndrome).  She remembers that I like paper over<br/>\nplastic even though I am there only once a week.  She is remarkable at<br/>\nbeing able to pack bags efficiently and compactly yet not making them<br/>\ntoo heavy.  She is very aware of who has had their breaks and who is<br/>\non break and who needs to take a break and what time they came in so<br/>\nthey need a break at such-n-such time.  Stuff I never keep track of at<br/>\nmy own job!  I think she is simply remarkable because she is so good<br/>\nat things that I can&#39;t do well.  I hear the other baggers (who also<br/>\ncollect shopping carts) talking about how &quot;stooooopid&quot; she is all the<br/>\ntime.  My only thought when I hear that is, &quot;Right.  And you are<br/>\nbagging groceries because all the rocket scientist jobs are taken up.&quot;<br/>\n Here is a young lady who has a unique talent and is happy in her job.<br/>\n She remembers people&#39;s names and that I have three children and when<br/>\nI go in without Dan she asks how he is doing.  Not quite what I would<br/>\ncall &quot;stoooopid&quot;  Is she intelligent?  Who knows.  Maybe it&#39;s me that<br/>\nisn&#39;t intelligent because I SUCK at bagging groceries and can&#39;t<br/>\nremember when *I* last had a break let alone my co-workers.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I prefer to seek understanding with descriptors that are less vague<br/>\n&gt; and hazy.<br/>\n<br/>\n </span></blockquote>Which makes me question why we even need to qualify intelligence to<br/>\nbegin with.  It truly doesn&#39;t equate to anything.  I&#39;ve met people<br/>\nwith very high IQ levels yet they can&#39;t remember to look both ways<br/>\nbefore crossing the street and forget to balance their checkbooks so<br/>\nare always one paycheck away from bancruptcy.  And I&#39;ve met people<br/>\nwith very low IQ&#39;s who have such a wonderful understanding of people<br/>\nand nature that I love to be around them just because of their<br/>\noutlooks on life.  We all have our unique talents and gifts.  Some of<br/>\nit is academic, some is artistic, some is philosophical, some is<br/>\nrational, some is athletic, some is empathic, etc etc etc.<br/>\n<br/>\nMichelle</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: gifted","postDate":"1164731316","msgId":19384,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVraG8zaytua3ByQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVraGs5cCtzOWYyQGVHcm91cHMuY29tPg=="},"prevInTopic":19382,"nextInTopic":19385,"prevInTime":19383,"nextInTime":19385,"topicId":19379,"numMessagesInTopic":0,"msgSnippet":"~~But, the awareness that my dh and ds are both highly sensitive provides insight into their perceptions and reactions being significantly different than my","messageBody":"<div id=\"ygrps-yiv-1719777960\">~~But,<br/>\nthe awareness that my dh and ds are both highly sensitive provides<br/>\ninsight into their perceptions and reactions being significantly<br/>\ndifferent than my own.~~<br/>\n<br/>\nYes, but to an aware, mindful parent, the intelligence level isn&#39;t<br/>\nsomething to be measured. It doesn&#39;t change the fact that we see the<br/>\nchild for who he/she is right now and respond to their needs. The<br/>\nunschooling philsophies are the same whether a child is &quot;highly<br/>\nintelligent&quot; or not (and the term &quot;intelligent&quot; is so subjective<br/>\nbecause there are SO many different kinds of intelligence<br/>\nanyway)....therefore rendering the label &quot;gifted&quot; or &quot;intelligent&quot; as<br/>\nfairly useless descriptors in my opinion.<br/>\n<br/>\nI&#39;ve met a real-life unschooling &quot;prodigy&quot;. A child and his mama<br/>\nstayed with us for a while and we became friends. She even cared for<br/>\nmy children in my absence. This wee child that was all of two years of<br/>\nage, chubby-cheeked, walking around in a diaper could read ANYTHING.<br/>\n<br/>\nHe&#39;d been reading since 16 months of age. Truly, fluently reading. He<br/>\ncould read my emails as I sat at the computer.....a bit jarring to say<br/>\nthe least. He could read the newspaper at my table. He appea&#92;red to be<br/>\na little toddler, yet he had this thirst for BIG ideas and knowledge.<br/>\n<br/>\nI love, love, love how his mama treated him. As a child that wanted<br/>\nanswers. She didn&#39;t label him, treat him as though he was anything but<br/>\nher precious and much-loved child. She responded to his needs in each<br/>\nmoment and honored his journey. He didn&#39;t want to read storybooks when<br/>\nshe offered, so they read the encyclopedia and other reference books<br/>\ntogether. <br/>\n<br/>\nHe was simply himself. She helped him get what he needed in each<br/>\nmoment, provided him with the things he loved and that&#39;s it. Isn&#39;t<br/>\nthat what every unschooling parent strives to do? She didn&#39;t see him<br/>\nas &quot;more intelligent&quot;, but as &quot;thirsty for knowledge of big ideas.&quot;<br/>\n<br/>\nUnderstanding our child&#39;s unique make-up IS helpful. I&#39;ve read about<br/>\nsensory integration issues and other descriptors in an effort to<br/>\nunderstand some of Jalen&#39;s behaviors. Seeking understanding is one<br/>\nthing, trying to define him as his behavior is a place I don&#39;t want to<br/>\nvisit. <br/>\n<br/>\nI think that in an unschooling household, the term &quot;intelligent&quot; is<br/>\nfairly useless. &quot;sensitive&quot; is a whole different matter, it is<br/>\nactually something you can define by how people respond to a variety<br/>\nof stimulus...though even with &quot;sensitive&quot; it looks hugely different<br/>\nfrom person to person.<br/>\n<br/>\nHow do you quantify intelligence without a test? A test that really<br/>\nmeans very little because it is testing certain KINDS of intelligence.<br/>\nAnd if you can&#39;t quantify it, does it matter? The label &quot;intelligent&quot;<br/>\nis useless to me.<br/>\n<br/>\nI prefer to seek understanding with descriptors that are less vague<br/>\nand hazy.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":287472904,"authorName":"wuweimama","from":"&quot;wuweimama&quot; &lt;wuweimama@...&gt;","profile":"wuweimama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: gifted","postDate":"1164727417","msgId":19382,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVraGs5cCtzOWYyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVrZ2o2ais0ZGU3QGVHcm91cHMuY29tPg=="},"prevInTopic":19379,"nextInTopic":19384,"prevInTime":19381,"nextInTime":19383,"topicId":19379,"numMessagesInTopic":0,"msgSnippet":"... think  I have ever heard a person refer to an adult as gifted .  I hear, He  is really good at building things , He is quite the musician , or He ","messageBody":"<div id=\"ygrps-yiv-1272969203\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;frozenandcold&quot;<br/>\n&lt;fivefreebirds@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Something that I just keep thinking of as I am reading through these <br/>\n&gt; posts is that it is very interesting that we only use the <br/>\n&gt; term &quot;gifted&quot; when we are talking about kids in school.  I don&#39;t<br/>\n </span></blockquote>think &gt; I have ever heard a person refer to an adult as &quot;gifted&quot;.  I<br/>\nhear, &quot;He &gt; is really good at building things&quot;, &quot;He is quite the<br/>\nmusician&quot;, or &quot;He &gt; knows a lot about investments&quot; etc. but I don&#39;t<br/>\never hear &quot;He is &gt; gifted&quot; when talking about adults.  It is an<br/>\nacademic thing and I &gt; think that is why us unschoolers get so yucked<br/>\nby it.&gt;&gt; <br/>\n<br/>\n***Heidi, I&#39;d agree with all of these observations; but the following<br/>\njust doesn&#39;t quite sit with me.  <br/>\n<br/>\n<br/>\n&lt;&lt;It is a &gt; measurement of intelligence, which means<br/>\nwhat?.............Absolutely &gt; nothing!<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n </span></blockquote>Like the descriptor &#39;highly sensitive&#39;, I believe the awareness of a<br/>\nchild&#39;s exceptional intelligence could help a parent to recognize the<br/>\n asynchronicity of their cognitive ability, perhaps from their<br/>\nemotional ability. It all falls back to eliminating *expectations* of<br/>\nothers to be &quot;at a defined level&quot; of performace by age, I agree. But,<br/>\nthe awareness that my dh and ds are both highly sensitive provides<br/>\ninsight into their perceptions and reactions being significantly<br/>\ndifferent than my own. <br/>\n<br/>\n<br/>\nPat</div>","specialLinks":[]},{"userId":236897304,"authorName":"frozenandcold","from":"&quot;frozenandcold&quot; &lt;fivefreebirds@...&gt;","profile":"frozenandcold","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"re: gifted","postDate":"1164693523","msgId":19379,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVrZ2o2ais0ZGU3QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":19382,"prevInTime":19378,"nextInTime":19380,"topicId":19379,"numMessagesInTopic":0,"msgSnippet":"Something that I just keep thinking of as I am reading through these posts is that it is very interesting that we only use the term gifted when we are","messageBody":"<div id=\"ygrps-yiv-2139697147\">Something that I just keep thinking of as I am reading through these <br/>\nposts is that it is very interesting that we only use the <br/>\nterm &quot;gifted&quot; when we are talking about kids in school.  I don&#39;t think <br/>\nI have ever heard a person refer to an adult as &quot;gifted&quot;.  I hear, &quot;He <br/>\nis really good at building things&quot;, &quot;He is quite the musician&quot;, or &quot;He <br/>\nknows a lot about investments&quot; etc. but I don&#39;t ever hear &quot;He is <br/>\ngifted&quot; when talking about adults.  It is an academic thing and I <br/>\nthink that is why us unschoolers get so yucked by it.  It is a <br/>\nmeasurement of intelligence, which means what?.............Absolutely <br/>\nnothing!<br/>\n<br/>\nHeidi</div>","specialLinks":[]}],"prevTopicId":19380,"nextTopicId":19344}}