{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Unsupportive family and friends","postDate":"1137181360","msgId":9006,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRxOHZyZytzYjdsQGVHcm91cHMuY29tPg=="},"prevInTopic":8989,"nextInTopic":0,"prevInTime":9005,"nextInTime":9007,"topicId":8976,"numMessagesInTopic":0,"msgSnippet":"Or the money because we have so many kids. Point one, how nurtured were they feeling in ps?  That was my first thought when I read your post!  Yeah, public","messageBody":"<div id=\"ygrps-yiv-1483395630\">&quot;Or the money because we have so many kids. Point one, how <br/>\nnurtured were they feeling in ps? &quot;<br/>\n<br/>\nThat was my first thought when I read your post!  Yeah, public school<br/>\nis SO nurturing for a child&#39;s soul....uh-huh. I&#39;d look at her like she<br/>\nwas nuts and keep on doing whatever I was doing.;)<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Unsupportive family and friends","postDate":"1137121051","msgId":8989,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRxNzR1citxMXZlQGVHcm91cHMuY29tPg=="},"prevInTopic":8986,"nextInTopic":9006,"prevInTime":8988,"nextInTime":8990,"topicId":8976,"numMessagesInTopic":0,"msgSnippet":"Someday maybe my own dad will fess up to the fact that what we are doing IS working. You never know. I got into some pretty heated debates with my Mum in the","messageBody":"<div id=\"ygrps-yiv-1306016407\">&quot;Someday maybe my own dad will fess up to the fact that what we are doing<br/>\nIS working.&quot;<br/>\n<br/>\nYou never know.<br/>\nI got into some pretty heated debates with my Mum in the early days,<br/>\nshe eventually became a big advocate for us and for homeschooling.<br/>\n<br/>\nI was just reading some archives of unschooling.com the other day and<br/>\nsaw where I was frustrated with some lame comments my Dad made a few<br/>\nyears ago.  He&#39;s really opened his mind up and sees the beauty in<br/>\nliving the free life now....he and my stepmom even showed up at the<br/>\nLive and Learn conference in St. Louis and listened to one of my talks!!<br/>\nYou just never know.....<br/>\n<br/>\nIn the mean time, they have no right to bully you, just shut that<br/>\nconversation right down. Hang in there...<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":125789604,"authorName":"Onesnotenough@aol.com","from":"Onesnotenough@...","profile":"justlikemama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unsupportive family and friends","postDate":"1137111171","msgId":8986,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJkMi4xMTU1OWE5LjMwZjg0YTgzQGFvbC5jb20+"},"prevInTopic":8983,"nextInTopic":8989,"prevInTime":8985,"nextInTime":8987,"topicId":8976,"numMessagesInTopic":0,"msgSnippet":"Malinda, I had ALMOST the same talk with my dad just yesterday.  Thank  goodness he tries not to nose around too much!  It lasted only a few  minutes, and the ","messageBody":"<div id=\"ygrps-yiv-2111683033\">Malinda, <br/>\n  I had ALMOST the same talk with my dad just yesterday.  Thank  goodness he <br/>\ntries not to nose around too much!  It lasted only a few  minutes, and the <br/>\nconversation  wasn&#39;t anything like what you  had with your dad.  My dad is <br/>\ntotally against homeschooling  itself ( even though my oldest ds got so depressed <br/>\nover school he was ready to  commit suicide). On that note, that is when I <br/>\nlearned to REALLY listen to  my kids from then on out.   I refuse to let anyone say <br/>\nagain  that ds said what he said because he was a kid and that&#39;s what kids  <br/>\ndo!  I&#39;ve learned to respect and listen to every word that comes out of  their <br/>\nmouths!   I guess I am trying to say in some way I  understand.  Not to put <br/>\nyour dad down, but why does he bully you like  that?   It just seems so unfair <br/>\nto me for him to corner you and put  you on the spot. <br/>\n   I don&#39;t know if its a father/daughter thing or  what, but it seems to me <br/>\nneither of our dads thinks we know a damn  thing!  Oh how aggravating!   <br/>\n  I agree with another member, if he is going to treat you that way,  maybe <br/>\nnot having him over for a LONG time is in order.   Or at least a  LONG talk <br/>\nbefore he comes over, letting him know that you are the mother,  and  you know <br/>\nwhat you are doing and why you are doing it.  We can&#39;t  control how someone <br/>\nfeels but we can control how they make us feel.  It may  take making him feel <br/>\nunwelcome to get your point across.  <br/>\n  Someday maybe my own dad will fess up to the fact that what we are  doing <br/>\nIS working.  I hope yours does too.  Hang in there.  Your  not alone!  And if <br/>\nyou feel in your heart what you are doing is right, then  it IS right!<br/>\nSyndi and sons<br/>\n <br/>\n&quot;Education is  an admirable thing, <br/>\nbut it is well to remember from time to time <br/>\nthat  nothing that is worth knowing can be taught.&quot; <br/>\nOscar  Wilde<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":145246818,"authorName":"Christy Mahoney","from":"&quot;Christy Mahoney&quot; &lt;unschooling1@...&gt;","profile":"unschooling1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Unsupportive family and friends","postDate":"1137104116","msgId":8979,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRxNmtkaytkanE3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwYzQwMWM2MTdiMyQ2NTU5OGJmMCQwOGJkZmVhOUBNQUxJTkRBPg=="},"prevInTopic":8978,"nextInTopic":8983,"prevInTime":8978,"nextInTime":8980,"topicId":8976,"numMessagesInTopic":0,"msgSnippet":"... battle right now.  With my husband in Iraq and a friend of ours dying over there last weekend, I need PEACE and JOY in my home right now. ... Malinda, I m","messageBody":"<div id=\"ygrps-yiv-377199521\"><blockquote><span title=\"ireply\">&gt; I know I should stand my ground more, but I just can&#39;t handle that <br/>\n </span></blockquote>battle right now.  With my husband in Iraq and a friend of ours dying <br/>\nover there last weekend, I need PEACE and JOY in my home right now.<br/>\n<blockquote><span title=\"ireply\"> &gt; Malinda<br/>\n<br/>\n </span></blockquote>Malinda, I&#39;m sorry that you had this difficult experience, but perhaps <br/>\nyou could tell your father this.  If it&#39;s too hard to talk to him, a <br/>\nletter might be a good idea.  I know how it is to have a husband gone <br/>\nand in danger, and that alone is an awful lot of stress.  Add <br/>\nbelligerent and argumentative parents - no way.  I also do not like to <br/>\nget into arguments, and I do not think that I would invite him back if <br/>\nI thought that he would do the same thing again.<br/>\n<br/>\nHopefully, with time, he&#39;ll be more accepting of your ideas.  If that <br/>\nnever happens, well, Tristan is your son and you are his mom.<br/>\n<br/>\n-Christy</div>","specialLinks":[]},{"userId":248175779,"authorName":"nrskay","from":"&quot;nrskay&quot; &lt;k_bird@...&gt;","profile":"nrskay","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Unsupportive family and friends","postDate":"1137101278","msgId":8978,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRxNmhrdStqYm4yQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwYzQwMWM2MTdiMyQ2NTU5OGJmMCQwOGJkZmVhOUBNQUxJTkRBPg=="},"prevInTopic":8977,"nextInTopic":8979,"prevInTime":8977,"nextInTime":8979,"topicId":8976,"numMessagesInTopic":0,"msgSnippet":"Malinda:  I m so sorry that your father is so unsupportive, even to the point of being belligerent. My BIL thinks that we are doing a dis-service to our dd for","messageBody":"<div id=\"ygrps-yiv-1144442105\">Malinda:  I&#39;m so sorry that your father is so unsupportive, even to <br/>\nthe point of being belligerent.  <br/>\n<br/>\nMy BIL thinks that we are doing a dis-service to our dd for not having <br/>\nher in PS.  He feels that all kids should learn to deal with bullies.  <br/>\nHis dd is in PS and has a lot of problems with other girls picking on <br/>\nher.  I told him that my dd doesn&#39;t need those kind of experiences to <br/>\nlearn how to deal with different types of people.<br/>\n<br/>\nIt&#39;s amazing to hear some of these statements from family and friends <br/>\nthinking they are more knowledgeable than you are.  <br/>\n<br/>\nBeing that I&#39;m new to unschoolig, sometimes I begin to question my <br/>\ndecision, then I snap out of it and realize I am doing the best thing <br/>\nfor my dd.<br/>\n<br/>\nKay</div>","specialLinks":[]},{"userId":244360311,"authorName":"Deb","from":"&quot;Deb&quot; &lt;soggyboysmom@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Unsupportive family and friends","postDate":"1137096767","msgId":8977,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRxNmQ3dit2ZGQ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwYzQwMWM2MTdiMyQ2NTU5OGJmMCQwOGJkZmVhOUBNQUxJTkRBPg=="},"prevInTopic":8976,"nextInTopic":8978,"prevInTime":8976,"nextInTime":8978,"topicId":8976,"numMessagesInTopic":0,"msgSnippet":"... We used homeschooling for the longest time until family could see DS just growing fine and dandy. Then we transitioned over to using unschooling most of","messageBody":"<div id=\"ygrps-yiv-573049971\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Malinda Mills&quot; <br/>\n&lt;saprswife@a...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; (I use the term homeschool instead of unschool with my folks.  They <br/>\n&gt;would never be able to grasp the concept of unschooling)<br/>\n&gt; <br/>\n&gt; Malinda<br/>\n&gt; <br/>\n </span></blockquote>We used &#39;homeschooling&#39; for the longest time until family could see DS <br/>\njust growing fine and dandy. Then we transitioned over to using <br/>\nunschooling most of the time now (unless we are indeed discussing <br/>\nhomeschooling in the generic sense globally, not just what we choose <br/>\nto do). Since they had no concept of homeschooling in it&#39;s inner <br/>\nworkings except what they saw us do, for them it became <br/>\ninterchangeable almost seamlessly.<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":179628783,"authorName":"Malinda Mills","from":"&quot;Malinda Mills&quot; &lt;saprswife@...&gt;","profile":"saprswife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Unsupportive family and friends","postDate":"1137096266","msgId":8976,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYzQwMWM2MTdiMyQ2NTU5OGJmMCQwOGJkZmVhOUBNQUxJTkRBPg==","referencesHeader":"PDQzYzVmMTAwLjI5ZWQxYTEzLjMyMDMuNzgyMUBteC5nbWFpbC5jb20+"},"prevInTopic":0,"nextInTopic":8977,"prevInTime":8975,"nextInTime":8977,"topicId":8976,"numMessagesInTopic":0,"msgSnippet":"Kay, I so sorry about you and your dd s experience.  I know several homeschooling families, and I don t think they will be too receptive to the idea that we","messageBody":"<div id=\"ygrps-yiv-1511068342\">Kay, I so sorry about you and your dd&#39;s experience.  I know several homeschooling families, and I don&#39;t think they will be too receptive to the idea that we are unschooling.  As of yet, they have not asked us what curriculum, etc. we are using (all are very rigid and schoolish with their approaches to homeschooling).  Unfortunately, one family has two kids that are very good friends of Tristan.  When they find out that we are unschooling, I can see those friendships being severed by their mom.  It will devastate my son. :o(<br/>\n<br/>\nTina, I am right there with you when it comes to family, except my biggest problem is my dad.  During my parents&#39; visit over Christmas he kept saying that I would need to &quot;mainstream&quot; Tristan back into school (whether it be public or private) ASAP.  Not wanting to get into an argument I would usually give somesort of noncommittal noise and change the subject.  Throughout the entire visit, he badgered me with questions in regards to curriculums and making sure Tristan learns the exact same things as other third graders (even to the point of wanting me to call the school district and to get the info, even down to textbook names! I don&#39;t think so! LOL).  He also harassed me in regards to the repercussions of Tristan falling behind the other kids his age, etc...<br/>\n<br/>\nThe morning they were due to leave, Dad cornered me and asked point blank &quot;so what IS your strategy for mainstreaming Tristan?&quot;  Ohhhhh, boy!  I answered that right now we were just living day to day, and Tristan going back to school would really depend on how homeschooling goes.  (which is true....if Tristan decides to go back to school, he does have the choice)  My dad went THROUGH THE ROOF.  He said that Tristan would get NOWHERE without a &quot;formal&quot; education.  I then cited a few high profile folks that were homeschooled, and this incensed him even more, calling them merely &quot;exceptions.&quot;  It was bad.....<br/>\n<br/>\nI know I should stand my ground more, but I just can&#39;t handle that battle right now.  With my husband in Iraq and a friend of ours dying over there last weekend, I need PEACE and JOY in my home right now.  I think I may just tell my dad that the subject of homeschooling is not a topic of dicussion right now.<br/>\n<br/>\n(I use the term homeschool instead of unschool with my folks.  They would never be able to grasp the concept of unschooling)<br/>\n<br/>\nMalinda<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":184851440,"authorName":"Tina","from":"&quot;Tina&quot; &lt;poey@...&gt;","profile":"raggedymommyof2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unsupportive family and friends","postDate":"1137064869","msgId":8983,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZWYwMWM2MTc2YSQ0YTExZjFhMCQ1ZTA5NzcxOEBjb21wdXRlcj4=","referencesHeader":"PDQzYzVmMTAwLjI5ZWQxYTEzLjMyMDMuNzgyMUBteC5nbWFpbC5jb20+IDwwMGM0MDFjNjE3YjMkNjU1OThiZjAkMDhiZGZlYTlATUFMSU5EQT4="},"prevInTopic":8979,"nextInTopic":8986,"prevInTime":8982,"nextInTime":8984,"topicId":8976,"numMessagesInTopic":0,"msgSnippet":"Malinda, I m so sorry you had to deal with that from your dad, especially right now.  My sincerest condolences on the loss of your friend, and I hope your","messageBody":"<div id=\"ygrps-yiv-790048593\">Malinda, I&#39;m so sorry you had to deal with that from your dad, especially right now.  My sincerest condolences on the loss of your friend, and I hope your husband comes home safely and soon.  We are anxiously awaiting notice in February to know if hubby will be headed there or elsewhere.  Part of me is scared to death, he only has 10 months left before he separates and we move on.  But also, we have been waiting for him to get orders for over 9 years now so in a way we are expecting it.  He&#39;s never been overseas, although he did get orders to Korea last October but had to turn them down because they would have carried past his enlistment and required a 2 year extension and since we have been making our exit plans for well over 6 years now, we decided to stick to them.  <br/>\n<br/>\nI use the term homeschool too, because most people don&#39;t know what unschooling is, and they don&#39;t really want to be educated and understand, they just want to judge.  It&#39;s not worth my energy.  Heck, most of them don&#39;t get homeschooling either, so I don&#39;t go into specifics about what we use or what we do because what&#39;s the point?  If you asked them what their child used in PS or what concepts they were studying this week, chances are pretty good they wouldn&#39;t be able to tell you, so why should you have to tell them??<br/>\n<br/>\nHang in there, and my thoughts will be with your husband and your family.<br/>\n<br/>\n°Ü°  Tina Rod.  °Ü°<br/>\n<br/>\nDysfunctional Domestic Diva<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":8994,"nextTopicId":8964}}