{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":410700632,"authorName":"sushieq@rocketmail.com","from":"&quot;sushieq@...&quot; &lt;susanlervold@...&gt;","profile":"sushieq@rocketmail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Whole-heartedly UnSchooling","postDate":"1324673363","msgId":47796,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpkMnBnaitzMGZhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpjdHA2Yis4NzMzQGVHcm91cHMuY29tPg=="},"prevInTopic":47792,"nextInTopic":0,"prevInTime":47795,"nextInTime":47797,"topicId":47786,"numMessagesInTopic":0,"msgSnippet":"I recently found Sandra Dodd s site and I ve made daily visits ever since!  It s an absolute gold mine of information and support, and I feel as though it s","messageBody":"<div id=\"ygrps-yiv-1568712750\">I recently found Sandra Dodd&#39;s site and I&#39;ve made daily visits ever since!  It&#39;s an absolute gold mine of information and support, and I feel as though it&#39;s one of those little unexpected gifts from G-d.  I&#39;m thrilled to be here, too, and am really looking forward to getting to know everyone and trading ideas and experiences.  I have so few people in my &quot;real&quot; life who understand (let alone respect) what I&#39;m doing and I&#39;m getting a little lonely--which has kind of caught me by surprise, since I&#39;ve become fairly hermity as I get older.<br/>\n<br/>\nAnyway, thank you for the responses, and I look forward to getting to know you better.  Merry Christmas (or whatever your family celebrates this time of year) to you all, and may the New Year bring personal growth and spiritual prosperity!<br/>\n<br/>\n--Susan</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Whole-heartedly UnSchooling","postDate":"1324590830","msgId":47792,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpkMDh0ZStmM2tkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpjdHA2Yis4NzMzQGVHcm91cHMuY29tPg=="},"prevInTopic":47788,"nextInTopic":47796,"prevInTime":47791,"nextInTime":47793,"topicId":47786,"numMessagesInTopic":0,"msgSnippet":"This is the sort of happy story I am used to hearing from unschoolers. Even with all the stops along the way. :) I m glad things are going so well for you and","messageBody":"<div id=\"ygrps-yiv-277857228\">This is the sort of happy story I am used to hearing from unschoolers. Even with all the stops along the way. :) I&#39;m glad things are going so well for you and yours.<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;sushieq@...&quot; &lt;susanlervold@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi everybody!  This started as a response to &quot;Happy Medium between Homeschooling and Unschooling&quot;, but since I haven&#39;t properly introduced myself, I thought now might be a good time.  I&#39;ve been lurking here for a bit and I&#39;ve liked what I&#39;ve seen.  My name is Susan, and my son, Matt, is 14; though we&#39;re a little later to the game than many others here, I&#39;ve found an abundance of good, applicable advice nonetheless.<br/>\n&gt; <br/>\n&gt; After years of excuse making, we finally took Matt out of public school last March. </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Whole-heartedly UnSchooling","postDate":"1324571658","msgId":47788,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjdm02YSs1bmUwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpjdHA2Yis4NzMzQGVHcm91cHMuY29tPg=="},"prevInTopic":47787,"nextInTopic":47792,"prevInTime":47787,"nextInTime":47789,"topicId":47786,"numMessagesInTopic":0,"msgSnippet":"... **************** Even with younger kids - Especially with kids who ve never been to school - that s the case. Parents need a lot more time to recover not","messageBody":"<div id=\"ygrps-yiv-632353987\">&quot;sushieq@...&quot; &lt;susanlervold@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; We are still in the process of &quot;de-schooling&quot;, and this process is as much (if not more) for me than it is for my son. <br/>\n </span></blockquote>****************<br/>\n<br/>\nEven with younger kids - Especially with kids who&#39;ve never been to school - that&#39;s the case. Parents need a lot more time to recover not just from our own years in school but from our years as school or homeschool parents.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I&#39;ve been good and indoctrinated.  I&#39;ll tell you, it&#39;s not until you try to detox from the indoctrination that you can see for yourself just how effective public school is in that regard <br/>\n </span></blockquote>*******************<br/>\n<br/>\nYes! Do you know the line from The Usual Suspects: the greatest trick the devil ever pulled was to convince the world he didn&#39;t exist? Compulsory school attendance has pulled a similar sort of trick - it&#39;s there all the time, dominating kids lives and those of their parents, and yet it&#39;s the elephant in the room when issues come up with kids. Bullying and other forms of violence, depression, escapism, rebellion... rarely ever does anyone look to compulsory schooling as a specific cause of any of those things. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;it&#39;s not until you try to detox from the indoctrination that you can see for yourself just how effective public school is...<br/>\n </span></blockquote>****************<br/>\n<br/>\nNot just school - once you step away from academics it&#39;s a little creepy how much parenting involves buying in to peer pressure and swallowing without thinking all the &quot;truisms&quot; about &quot;what children need&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I haven&#39;t learned this from pro-unschooling websites (though they&#39;ll tell you the same) but from my own bit of experience.<br/>\n </span></blockquote>************<br/>\n<br/>\nExperience is golden. <br/>\n<br/>\nIt&#39;s good to be skeptical of wild-eyed enthusiasts you meet on the internet ;) No one has to jump into unschooling with both feet - and very few people should. Ease in. Let the results give you reasons to go further. Here&#39;s a good collection of stories about &quot;getting&quot; unschooling:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/gettingit\">http://sandradodd.com/gettingit</a><br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":146052230,"authorName":"Sacha Davis","from":"&quot;Sacha Davis&quot; &lt;sacha@...&gt;","profile":"sacha_pie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [unschoolingbasics] Whole-heartedly UnSchooling","postDate":"1324523535","msgId":47787,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyOTguMTI4Ljk1LjIzOC41NC4xMzI0NTIzNTM1LnNxdWlycmVsQHdlYm1haWwuZHJpenpsZS5jb20+","inReplyToHeader":"PGpjdHA2Yis4NzMzQGVHcm91cHMuY29tPg==","referencesHeader":"IDxqY3RwNmIrODczM0BlR3JvdXBzLmNvbT4="},"prevInTopic":47786,"nextInTopic":47788,"prevInTime":47786,"nextInTime":47788,"topicId":47786,"numMessagesInTopic":0,"msgSnippet":"Beautifully said! S.","messageBody":"<div id=\"ygrps-yiv-503476700\">Beautifully said!<br/>\n<br/>\nS.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Hi everybody!  This started as a response to &quot;Happy Medium between<br/>\n&gt; Homeschooling and Unschooling&quot;, but since I haven&#39;t properly introduced<br/>\n&gt; myself, I thought now might be a good time.  I&#39;ve been lurking here for a<br/>\n&gt; bit and I&#39;ve liked what I&#39;ve seen.  My name is Susan, and my son, Matt, is<br/>\n&gt; 14; though we&#39;re a little later to the game than many others here, I&#39;ve<br/>\n&gt; found an abundance of good, applicable advice nonetheless.<br/>\n&gt;<br/>\n&gt; After years of excuse making, we finally took Matt out of public school<br/>\n&gt; last March.  I&#39;d gotten fed up with the values-oriented crap he was having<br/>\n&gt; to endure at school, and then several kids were suspended/expelled for<br/>\n&gt; selling drugs, so enough was enough.  Initially, we &quot;homeschooled&quot; through<br/>\n&gt; an independent study-style local charter school, but the curriculum was as<br/>\n&gt; lame as the stuff they were(n&#39;t) teaching at his old school (I don&#39;t know<br/>\n&gt; why that was a surprise to me).  Through that program we had to check in<br/>\n&gt; with a master teacher once a month to turn in work and to report Matt&#39;s<br/>\n&gt; status, so one day each month, before each meeting, Matt would bite the<br/>\n&gt; bullet and crank out that month&#39;s worth of work...it was ridiculous and<br/>\n&gt; meaningless, especially since almost all of the material was stuff he&#39;d<br/>\n&gt; done in elementary school, and he&#39;d been successful the first time around.<br/>\n&gt;  Since Matt was covering the material on his own혰including math혰without<br/>\n&gt; any problem, I discovered what should have been intuitive: he doesn&#39;t need<br/>\n&gt; a teacher!<br/>\n&gt;<br/>\n&gt; Just in the past year or so, I have spent countless hours educating myself<br/>\n&gt; about the genesis and goals of public education versus real learning.  The<br/>\n&gt; more I learn, the more I see the wisdom in whole-hearted unschooling.<br/>\n&gt; Ignorance is bliss, however, and I&#39;ve found that the more I learn, the<br/>\n&gt; sorrier I am that I didn&#39;t unschool since the beginning.  That&#39;s water<br/>\n&gt; under the bridge; I simply wasn&#39;t awake yet, but I am now, and it&#39;s better<br/>\n&gt; late than never!<br/>\n&gt;<br/>\n&gt; We are still in the process of &quot;de-schooling&quot;, and this process is as much<br/>\n&gt; (if not more) for me than it is for my son.  I was &quot;educated&quot; (&quot;trained&quot;<br/>\n&gt; is a much better word) in public schools for 19 years, and was raised by<br/>\n&gt; parents who were schooled the same way, so I&#39;ve been good and<br/>\n&gt; indoctrinated.  I&#39;ll tell you, it&#39;s not until you try to detox from the<br/>\n&gt; indoctrination that you can see for yourself just how effective public<br/>\n&gt; school is in that regard (that&#39;s a whole issue itself, but for another<br/>\n&gt; time).  Though I have more than a few moments of self-doubt, I KNOW we&#39;re<br/>\n&gt; now finally on the right path.  I also know that real, &quot;radical&quot;<br/>\n&gt; unschooling is the route to being the very best family we can be.  I<br/>\n&gt; haven&#39;t learned this from pro-unschooling websites (though they&#39;ll tell<br/>\n&gt; you the same) but from my own bit of experience.  Though I subjected Matt<br/>\n&gt; to public school, my parenting style has always been decidedly<br/>\n&gt; unschool-ish: I&#39;ve never believed in artificial consequences (aka:<br/>\n&gt; &quot;punishments&quot;) to arbitrary rules, and we have always treated Matt as an<br/>\n&gt; individual, separate from ourselves, with his own interests and talents.<br/>\n&gt; This has worked beautifully, though the results may be due to his easy<br/>\n&gt; nature more than anything we&#39;ve done.  In any event, our relationship is<br/>\n&gt; so far beyond anything I experienced with my parents (and my husband with<br/>\n&gt; his) that I can hardly believe it...I didn&#39;t even know it was possible.<br/>\n&gt;<br/>\n&gt; Anyway, I wish everyone a wonderful holiday and New Year.  I can&#39;t begin<br/>\n&gt; to express how much support I receive from all of you, strangers or not.<br/>\n&gt; It&#39;s interesting how critical others can be of lifestyles that don&#39;t even<br/>\n&gt; impact them (and even when I don&#39;t ask for their opinion!); it is<br/>\n&gt; wonderful indeed to know there&#39;s a place I can turn to where people won&#39;t<br/>\n&gt; think I&#39;m crazy!  --Susan<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":410700632,"authorName":"sushieq@rocketmail.com","from":"&quot;sushieq@...&quot; &lt;susanlervold@...&gt;","profile":"sushieq@rocketmail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Whole-heartedly UnSchooling","postDate":"1324509195","msgId":47786,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjdHA2Yis4NzMzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":47787,"prevInTime":47785,"nextInTime":47787,"topicId":47786,"numMessagesInTopic":0,"msgSnippet":"Hi everybody!  This started as a response to Happy Medium between Homeschooling and Unschooling , but since I haven t properly introduced myself, I thought","messageBody":"<div id=\"ygrps-yiv-679901248\">Hi everybody!  This started as a response to &quot;Happy Medium between Homeschooling and Unschooling&quot;, but since I haven&#39;t properly introduced myself, I thought now might be a good time.  I&#39;ve been lurking here for a bit and I&#39;ve liked what I&#39;ve seen.  My name is Susan, and my son, Matt, is 14; though we&#39;re a little later to the game than many others here, I&#39;ve found an abundance of good, applicable advice nonetheless.<br/>\n<br/>\nAfter years of excuse making, we finally took Matt out of public school last March.  I&#39;d gotten fed up with the values-oriented crap he was having to endure at school, and then several kids were suspended/expelled for selling drugs, so enough was enough.  Initially, we &quot;homeschooled&quot; through an independent study-style local charter school, but the curriculum was as lame as the stuff they were(n&#39;t) teaching at his old school (I don&#39;t know why that was a surprise to me).  Through that program we had to check in with a master teacher once a month to turn in work and to report Matt&#39;s status, so one day each month, before each meeting, Matt would bite the bullet and crank out that month&#39;s worth of work...it was ridiculous and meaningless, especially since almost all of the material was stuff he&#39;d done in elementary school, and he&#39;d been successful the first time around.  Since Matt was covering the material on his own혰including math혰without any problem, I discovered what should have been intuitive: he doesn&#39;t need a teacher!  <br/>\n<br/>\nJust in the past year or so, I have spent countless hours educating myself about the genesis and goals of public education versus real learning.  The more I learn, the more I see the wisdom in whole-hearted unschooling.  Ignorance is bliss, however, and I&#39;ve found that the more I learn, the sorrier I am that I didn&#39;t unschool since the beginning.  That&#39;s water under the bridge; I simply wasn&#39;t awake yet, but I am now, and it&#39;s better late than never!<br/>\n<br/>\nWe are still in the process of &quot;de-schooling&quot;, and this process is as much (if not more) for me than it is for my son.  I was &quot;educated&quot; (&quot;trained&quot; is a much better word) in public schools for 19 years, and was raised by parents who were schooled the same way, so I&#39;ve been good and indoctrinated.  I&#39;ll tell you, it&#39;s not until you try to detox from the indoctrination that you can see for yourself just how effective public school is in that regard (that&#39;s a whole issue itself, but for another time).  Though I have more than a few moments of self-doubt, I KNOW we&#39;re now finally on the right path.  I also know that real, &quot;radical&quot; unschooling is the route to being the very best family we can be.  I haven&#39;t learned this from pro-unschooling websites (though they&#39;ll tell you the same) but from my own bit of experience.  Though I subjected Matt to public school, my parenting style has always been decidedly unschool-ish: I&#39;ve never believed in artificial consequences (aka: &quot;punishments&quot;) to arbitrary rules, and we have always treated Matt as an individual, separate from ourselves, with his own interests and talents.  This has worked beautifully, though the results may be due to his easy nature more than anything we&#39;ve done.  In any event, our relationship is so far beyond anything I experienced with my parents (and my husband with his) that I can hardly believe it...I didn&#39;t even know it was possible.<br/>\n<br/>\nAnyway, I wish everyone a wonderful holiday and New Year.  I can&#39;t begin to express how much support I receive from all of you, strangers or not.  It&#39;s interesting how critical others can be of lifestyles that don&#39;t even impact them (and even when I don&#39;t ask for their opinion!); it is wonderful indeed to know there&#39;s a place I can turn to where people won&#39;t think I&#39;m crazy!  --Susan</div>","specialLinks":[]}],"prevTopicId":47762,"nextTopicId":47767}}