{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":29,"messages":[{"userId":177854869,"authorName":"uuhomeschooler2","from":"&quot;uuhomeschooler2&quot; &lt;publicprofile34@...&gt;","profile":"uuhomeschooler2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Chicks","postDate":"1240295822","msgId":39673,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzanBpZSs1Y3RpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdzOTFtMCtzbGJsQGVHcm91cHMuY29tPg=="},"prevInTopic":39658,"nextInTopic":0,"prevInTime":39672,"nextInTime":39674,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"Help found! We now have a place we can cycle to or very long walk to that is fairly convenient to keep our chicks.  It is part of our community garden and","messageBody":"<div id=\"ygrps-yiv-286217754\">Help found!<br/>\n<br/>\nWe now have a place we can cycle to or very long walk to that is fairly convenient to keep our chicks.  It is part of our community garden and others will share in the responsibility - including making the chicken tractor and feeding and watering while we are gone.  Yeah!  <br/>\n<br/>\nBut, I still wonder just how the kids will respond when we move them there.  Will it become a negative responsibility that feels like a hassle getting over there?  I am going to try hard to incorporate it into our exercise and nature life - to make it together time on our trek over there - to take time to enjoy the birds while we are there.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;uuhomeschooler2&quot; &lt;publicprofile34@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I understand what you are saying about the chicks, and want to embrace it.  The thing is, it is not just our burden.  In order to do the other things they love, we would be gone on weekends and other times.  Then, we have the huge task of finding people we trust to care for the birds.  This has been the crux of the problem the whole time.  We live IN Town in an historic district that allows only 2 chickens.  AND, we have 27 to care for in our basement at this moment with 5 needing to be shown at the fair and sold to return the money to the 4-H.  The family that was supposed to partner with us broke up and now we cannot use their farm or use them to help care for the chicks.  And, we have had 3 other people back out since then.  Just tonight, we had someone say we could use their land, but it means us driving twice a day about 10 minutes one-way (40 minutes a day driving) down a really rough road.  That will end up costing us lots of time and money in gas and tires.  Plus, we will have to build the coop and put up fencing and roofing to protect them - another expense we didn&#39;t plan.  And, the parent can&#39;t help because he works at a poultry plant.  So, we would have to rely on the two kids to be sure to care for the chickens whenever we were gone.  I&#39;m afraid this is a losing proposition because right now I can hardly get the kids to go down to our basement and we&#39;ve only had the chicks for 3 weeks!<br/>\n&gt; <br/>\n&gt; Also, we would lose time doing other things they love.  This weekend, we could have the option to go to some friends house and go canoeing and stay the weekend.  But, there is no one to take care of the chicks.  My daughter wants both, but I can&#39;t see imposing on other people constantly so that we can up and go whenever we want.  I&#39;d be more than happy if we owned our own land and had someone we could swap chores with so that it wasn&#39;t an issue.  But, it is.  So, how do I deal with this? <br/>\n&gt; <br/>\n&gt; I WANT to say yes, and I don&#39;t even mind helping with the chores - which I will have to f we drive.  But, I think the consequences are giving up other things they like and lots of money.<br/>\n&gt; <br/>\n&gt; What say ye, Ren?<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Our first &quot;yes&quot; and a question","postDate":"1240229108","msgId":39658,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlFRjBCQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":39643,"nextInTopic":39673,"prevInTime":39657,"nextInTime":39659,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"Nope -we re in CT but I grew up in NJ (where 80 and 287 cross is about a mile from my family home). CT is another no hassle state - we don t have to do","messageBody":"<div id=\"ygrps-yiv-1839711610\">Nope -we&#39;re in CT but I grew up in NJ (where 80 and 287 cross is about a\r<br/>\nmile from my family home). CT is another no hassle state - we don&#39;t have\r<br/>\nto do anything but pull the kids from school in writing (if they&#39;ve ever\r<br/>\nbeen enrolled; DS was never enrolled). We&#39;re also not considered private\r<br/>\nschools; we don&#39;t file notice of intent to homeschool (unless we choose\r<br/>\nto, it&#39;s voluntary).\r<br/>\n\r<br/>\nDeb R\r<br/>\n\r<br/>\n\r<br/>\n**********************************************************************\r<br/>\nThis email and any files transmitted with it are confidential and\r<br/>\nintended solely for the use of the individual or entity to whom they\r<br/>\nare addressed. If you have received this email in error please notify\r<br/>\nthe system manager.\r<br/>\n\r<br/>\nThis footnote also confirms that this email message has been swept by\r<br/>\nMIMEsweeper for the presence of computer viruses.\r<br/>\n\r<br/>\nwww.mastercam.com\r<br/>\n**********************************************************************\r<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":177854869,"authorName":"uuhomeschooler2","from":"&quot;uuhomeschooler2&quot; &lt;publicprofile34@...&gt;","profile":"uuhomeschooler2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Chicks","postDate":"1240026539","msgId":39643,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzYmlqYitjbjM3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdzYWhsMSs1NzE0QGVHcm91cHMuY29tPg=="},"prevInTopic":39637,"nextInTopic":39658,"prevInTime":39642,"nextInTime":39644,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"Don t try to talk them around to your way of seeing things, don t expect them to be happy about the situation. Its okay for them to be disappointed and angry.","messageBody":"<div id=\"ygrps-yiv-684796051\">Don&#39;t try to talk them around to your way of seeing things, don&#39;t expect them to be happy about the situation. Its okay for them to be disappointed and angry. Commiserate. It Sucks having to give up something you wanted to do. Its Not fair. Do you see what I&#39;m saying? You may have the best reasons in the world, but those reasons don&#39;t trump the way your kids are going to feel about it all. Its important to honor those feelings.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; ---Meredith (Mo 7, Ray 15)<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Yes, I see a little difference in the way it is done and conveyed.  I think they know how I feel, but maybe they don&#39;t.  It does suck.  I really do love the chicks.  I always wanted some myself.  Today we went to the feed store to buy more feed and saw some bantams.  We fell in love with them, too.  I want them just as much as they do.   But, I can&#39;t see spending 40 minutes just driving to take care of them everyday.  That could be the time spent WITH them, not driving to them.  Plus, we would have to build the entire structure, knowing that we really don&#39;t want to keep this drive up indefinitely, yet spending all the money on the coop and hen house.  That&#39;s a lot of dough.  <br/>\n<br/>\nMy daughter knows I want them and acknowledges is isn&#39;t reasonable to spend that money and driving time.  But, she says she wouldn&#39;t mind going over there.  We are still looking for other people and locations, but we&#39;ve only got a couple three weeks left.  I can give the 4-H office a couple days notice and they can find someone to take them, but then my kids can&#39;t take them to fair and they really want to do that.  <br/>\n<br/>\nBut, this weekend she wanted to go to a friends house and I had to say we can&#39;t unless we find someone to feed and water them.  It is a lot harder than leaving our cat!  He&#39;s easy!<br/>\n<br/>\nIt would all be so much simpler if we lived out of town!  But, that isn&#39;t the case right now.</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Chicks","postDate":"1239992801","msgId":39637,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzYWhsMSs1NzE0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdzOTFtMCtzbGJsQGVHcm91cHMuY29tPg=="},"prevInTopic":39630,"nextInTopic":39643,"prevInTime":39636,"nextInTime":39638,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"... ************************ These are important details - the entire situation has shifted dramatically from what your whole family agreed to do originally.","messageBody":"<div id=\"ygrps-yiv-299514248\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;uuhomeschooler2&quot; &lt;publicprofile34@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; The family that was supposed to partner with us broke up and now we cannot use their farm or use them to help care for the chicks.  And, we have had 3 other people back out since then. <br/>\n </span></blockquote>************************<br/>\n<br/>\nThese are important details - the entire situation has shifted dramatically from what your whole family agreed to do originally. Its totally reasonable to talk with your kids about that, put your heads together and do some brainstorming. Perhaps you could sell or give away most of the chicks - check with local feed stores and homeschooling groups to see if you can find takers for them. Where are you? Maybe someone on this list could stand a few chicks, for that matter. Or, if there are any health food stores in the area, see if you can post a flyer. Is there a food buying co-op or a local CSA? Those are great for networking with folks with small farms.<br/>\n<br/>\nIf you do end up making a top-down decision to get rid of the chicks, be as kind and gentle as you can, but also be prepared to appologise to the kids. Say &quot;I&#39;m sorry, I really can&#39;t find another way right now.&quot; Don&#39;t try to talk them around to your way of seeing things, don&#39;t expect them to be happy about the situation. Its okay for them to be disappointed and angry. Commiserate. It Sucks having to give up something you wanted to do. Its Not fair. Do you see what I&#39;m saying? You may have the best reasons in the world, but those reasons don&#39;t trump the way your kids are going to feel about it all. Its important to honor those feelings.<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":240684971,"authorName":"pellegrina@comcast.net","from":"pellegrina@...","profile":"elysgrl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Our first &quot;yes&quot; and a question","postDate":"1239982423","msgId":39628,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0NDY4OTY2MjAuMzUzNzAwMTIzOTk4MjQyMzcyOS5KYXZhTWFpbC5yb290QHN6MDExMGEud2VzdGNoZXN0ZXIucGEubWFpbC5jb21jYXN0Lm5ldD4=","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlFRURCQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":39625,"nextInTopic":39630,"prevInTime":39627,"nextInTime":39629,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"Hi Debra- I ll respond to both your emails in one shot, if you don t mind. First of all, great smashing ideas! I think Logan will get a kick out of them. I","messageBody":"<div id=\"ygrps-yiv-880024048\">Hi Debra- <br/>\n<br/>\n<br/>\n<br/>\nI&#39;ll respond to both your emails in one shot, if you don&#39;t mind. First of all, great smashing ideas! I think Logan will get a kick out of them. I like the idea of putting the more &quot;schoolish&quot; type things in his basket right alongside everything else--and yes, we are currently working our way through all the Captain Underpants books. (We read them aloud together, taking turns with the chapters. They are hilarious!) Anyway, if the feeling moves him to do a few workbook pages, he can just grab it and start working on it on his own. I&#39;m trying very hard to erase the invisible line in my head that separates the &quot;educational&quot; things from all his other stuff. <br/>\n<br/>\n<br/>\n<br/>\nAs far as keeping records, after getting feedback from you guys, I decided to just start a blog and write about what we do. In my state, the laws are practically non-existent (you&#39;re not in NJ by any chance, are you?). And I know that if anything ever came up, the onus is on the state to prove that we&#39;re NOT providing an equivalent education, rather than the other way around. Also, I don&#39;t know a single person that has ever happened to, and I&#39;ve been around homeschoolers for a good 20 years. After much consideration, I decided I&#39;m being paranoid, and I should just chill out, write my blog, and stop worrying about it. :) <br/>\n<br/>\n<br/>\n<br/>\nThanks again, <br/>\n<br/>\nDenise <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Debra Rossing&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:debra.rossing@...\">debra.rossing@...</a>&gt; <br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSent: Thursday, April 16, 2009 1:44:58 PM GMT -05:00 US/Canada Eastern <br/>\nSubject: [unschoolingbasics] Re: Our first &quot;yes&quot; and a question <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&gt; Don&#39;t most unschoolers have to be able to convert their daily <br/>\nactivities into &quot;eduspeak&quot; for the state? <br/>\nI wouldn&#39;t say &quot;most&quot; - in some states they have testing, some have <br/>\nlogs, etc. Whether a log is needed depends on the state laws - we don&#39;t <br/>\never have to show anyone anything UNLESS push comes to shove and someone <br/>\ntakes us to court (not an easy thing, since they&#39;d have to have grounds <br/>\nfor neglect to even start the ball rolling). So, KNOW your laws <br/>\nthoroughly. <br/>\n<br/>\nWhat I might suggest is just kept a &#39;diary&#39; of some sort where you just <br/>\nlist the activities, not fill in the &#39;subjects&#39;. Then, if you NEED to at <br/>\nsome point, you have the data to massage into what is expected and if <br/>\nnot, you don&#39;t ever have to even think in subjects at all. Where we are, <br/>\nthere&#39;s no reporting of any kind required (not even notice of intent <br/>\nonce the kids are withdrawn from school). If it became absolutely <br/>\nnecessary, I could probably sit down and whip up something that <br/>\n&#39;sounded&#39; as expected just by thinking about the stuff we&#39;ve done over <br/>\nthe last months (I could go ahead and look back at my wall calendar and <br/>\nemail calendar to see what was on our schedule in addition to the things <br/>\nI know are regular happenings/activities). In your situation, I&#39;d <br/>\nstrongly suggest that you ditch the subject page log and just jot notes <br/>\neach evening before bed of the things that struck you that do, stuff <br/>\nthat happened (such as you mentioned to your DS) WITHOUT trying to fit <br/>\nit to any kind of &#39;subject&#39; category. <br/>\n<br/>\nDeb R <br/>\n<br/>\n<br/>\n********************************************************************** <br/>\nThis email and any files transmitted with it are confidential and <br/>\nintended solely for the use of the individual or entity to whom they <br/>\nare addressed. If you have received this email in error please notify <br/>\nthe system manager. <br/>\n<br/>\nThis footnote also confirms that this email message has been swept by <br/>\nMIMEsweeper for the presence of computer viruses. <br/>\n<br/>\nwww.mastercam.com <br/>\n********************************************************************** <br/>\n<br/>\n[Non-text portions of this message have been removed] <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":222835102,"authorName":"Verna","from":"&quot;Verna&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Learn Nothing Day, was: Our first &quot;yes&quot; and a question","postDate":"1239975371","msgId":39625,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzYTBrYitrcnFvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdzOG84cit0bGRjQGVHcm91cHMuY29tPg=="},"prevInTopic":39623,"nextInTopic":39628,"prevInTime":39624,"nextInTime":39626,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"I actually got an email the other day from some group trying to sell a summer bridge curriculum that said in the subject line, BAD NEWS- Kids quite learning","messageBody":"<div id=\"ygrps-yiv-333889405\">I actually got an email the other day from some group trying to sell a summer bridge curriculum that said in the subject line, BAD NEWS- Kids quite learning during the summer!</div>","specialLinks":[]},{"userId":177854869,"authorName":"uuhomeschooler2","from":"&quot;uuhomeschooler2&quot; &lt;publicprofile34@...&gt;","profile":"uuhomeschooler2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Chicks","postDate":"1239943680","msgId":39630,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzOTFtMCtzbGJsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdzN2VicyszMjRjQGVHcm91cHMuY29tPg=="},"prevInTopic":39628,"nextInTopic":39637,"prevInTime":39629,"nextInTime":39631,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"I understand what you are saying about the chicks, and want to embrace it.  The thing is, it is not just our burden.  In order to do the other things they","messageBody":"<div id=\"ygrps-yiv-654527121\">I understand what you are saying about the chicks, and want to embrace it.  The thing is, it is not just our burden.  In order to do the other things they love, we would be gone on weekends and other times.  Then, we have the huge task of finding people we trust to care for the birds.  This has been the crux of the problem the whole time.  We live IN Town in an historic district that allows only 2 chickens.  AND, we have 27 to care for in our basement at this moment with 5 needing to be shown at the fair and sold to return the money to the 4-H.  The family that was supposed to partner with us broke up and now we cannot use their farm or use them to help care for the chicks.  And, we have had 3 other people back out since then.  Just tonight, we had someone say we could use their land, but it means us driving twice a day about 10 minutes one-way (40 minutes a day driving) down a really rough road.  That will end up costing us lots of time and money in gas and tires.  Plus, we will have to build the coop and put up fencing and roofing to protect them - another expense we didn&#39;t plan.  And, the parent can&#39;t help because he works at a poultry plant.  So, we would have to rely on the two kids to be sure to care for the chickens whenever we were gone.  I&#39;m afraid this is a losing proposition because right now I can hardly get the kids to go down to our basement and we&#39;ve only had the chicks for 3 weeks!<br/>\n<br/>\nAlso, we would lose time doing other things they love.  This weekend, we could have the option to go to some friends house and go canoeing and stay the weekend.  But, there is no one to take care of the chicks.  My daughter wants both, but I can&#39;t see imposing on other people constantly so that we can up and go whenever we want.  I&#39;d be more than happy if we owned our own land and had someone we could swap chores with so that it wasn&#39;t an issue.  But, it is.  So, how do I deal with this? <br/>\n<br/>\nI WANT to say yes, and I don&#39;t even mind helping with the chores - which I will have to f we drive.  But, I think the consequences are giving up other things they like and lots of money.<br/>\n<br/>\nWhat say ye, Ren?</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Learn Nothing Day, was: Our first &quot;yes&quot; and a question","postDate":"1239934043","msgId":39623,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzOG84cit0bGRjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE2NzExNTE1NTMuMzI0NzAxMTIzOTkxODMyNjI5MC5KYXZhTWFpbC5yb290QHN6MDExMGEud2VzdGNoZXN0ZXIucGEubWFpbC5jb21jYXN0Lm5ldD4="},"prevInTopic":39620,"nextInTopic":39625,"prevInTime":39622,"nextInTime":39624,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"~~ By the way, what is Learn Nothing Day??~~ It s a very funny and cool concept that Sandra Dodd thought up as a joke and turned it into an entire event.","messageBody":"<div id=\"ygrps-yiv-1306535105\">~~ By the way, what is Learn Nothing Day??~~<br/>\n<br/>\nIt&#39;s a very funny and cool concept that Sandra Dodd thought up as a joke and turned it into an entire event. People often ask how my kids learn anything without school but the idea that you could spend a whole day alive and learn nothing is laughable! Sandra thought that since unschoolers are learning all the time, they should take a day off (yeah right!).:)<br/>\n<br/>\nYou can read about the inspiration here:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/learnnothingday/2008\">http://sandradodd.com/learnnothingday/2008</a><br/>\n<br/>\nShe has pictures up from last year at the above link. Here in Eastern TN we had a bunch of unschoolers come from out of town (plus our local families) and spent the day swimming, picnicking, playing and having a generally awesome couple of days. When you look at Sandra&#39;s pics of Learn Nothing Day, you&#39;ll see a child with a huge marshmallow stick and about 10 marshmallows on it...that&#39;d be my Jalen!<br/>\n<br/>\nHere&#39;s my record of Learn Nothing Day:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://radicalunschooling.blogspot.com/2008/07/learnin-nuthin.html\">http://radicalunschooling.blogspot.com/2008/07/learnin-nuthin.html</a><br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Our first &quot;yes&quot; and a question","postDate":"1239923857","msgId":39612,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzOGVhaCtqc2duQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdzNnFncCthOXZkQGVHcm91cHMuY29tPg=="},"prevInTopic":39610,"nextInTopic":39618,"prevInTime":39611,"nextInTime":39613,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"... *********************** There have been some wonderful responses to this, already. This is more a picture of what it looks likes in one radically","messageBody":"<div id=\"ygrps-yiv-145719399\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;uuhomeschooler2&quot; &lt;publicprofile34@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; But, I can&#39;t figure out how to not insist and still let them have the chicks?  At what point to I follow through and give them away if I&#39;m the one doing it and reminding them and telling them to go take care of them, when I didn&#39;t want this burden on our freedom to begin with?  They still want and love the chicks - and are learning about them.  That part is great.  But, in the near future we will be gone a lot and they will be gone and guess who is left?  Dad or me.  Do I have to take care of them in order to be a responsive, unschooling parent?<br/>\n </span></blockquote>***********************<br/>\n<br/>\nThere have been some wonderful responses to this, already. This is more a picture of what it looks likes in one radically unschooling home.<br/>\n<br/>\nAny animal that comes into our home comes with the expectation that my partner and I will very likely end up taking care of it to some extent. There&#39;s never an issue of &quot;you (kid) have to be the one to feed it&quot;. They often do, but they also don&#39;t always, every day, without fail, take care of the pets. So, ultimately, pets are the adult responsibility in my home. <br/>\n<br/>\nThat all gets taken into account at the &quot;can I have it?&quot; stage of negotiations. When Ray wanted to adopt a stray dog last year, we worked with him to find some alternatives - I don&#39;t like dogs and don&#39;t want one, Morgan is afraid of dogs, so the dog living at our house wasn&#39;t a good option - although it was on the table! We talked with some of our neighbors who do dog-rescue to see if they&#39;d be willing to be the official caretakers of the dog, we also talked with Ray&#39;s bio mom, who has had dogs in the past. Eventually, Ray was able to find another family for the dog to live with. He didn&#39;t get to have the dog, but we also didn&#39;t start from &quot;No&quot; per se - we started from &quot;how can we make this work in a way that we can All feel okay about?&quot; <br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Our first &quot;yes&quot; and a question","postDate":"1239922085","msgId":39610,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzOGNqNStsY3QyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE2ODQxMzcwODYuMjc0MjE2MTIzOTgzMzM3NzI5OS5KYXZhTWFpbC5yb290QHN6MDExMGEud2VzdGNoZXN0ZXIucGEubWFpbC5jb21jYXN0Lm5ldD4="},"prevInTopic":39607,"nextInTopic":39612,"prevInTime":39609,"nextInTime":39611,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"... ************************* If he enjoys math, he may enjoy some of the fun toys and games from companies like Mindware - I tend to think of things like that","messageBody":"<div id=\"ygrps-yiv-2075657081\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, pellegrina@... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; He&#39;s already got mad math skills! ;) Seriously, he&#39;s such a math whiz that I&#39;m surprised he didn&#39;t just pick it up and work on it today for fun.<br/>\n </span></blockquote>*************************<br/>\n<br/>\nIf he enjoys math, he may enjoy some of the fun toys and games from companies like Mindware - I tend to think of things like that as &quot;geek toys&quot; rather than &quot;educational&quot; if you see the distinction ;)<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":240684971,"authorName":"pellegrina@comcast.net","from":"pellegrina@...","profile":"elysgrl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Our first &quot;yes&quot; and a question","postDate":"1239920039","msgId":39620,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NTQ1MDM3MTcuMzI1ODQ0MTIzOTkyMDAzOTc3My5KYXZhTWFpbC5yb290QHN6MDExMGEud2VzdGNoZXN0ZXIucGEubWFpbC5jb21jYXN0Lm5ldD4=","inReplyToHeader":"PDExNDY3ODI3MjIuMzI1ODE1MTIzOTkxOTk5MTcyNi5KYXZhTWFpbC5yb290QHN6MDExMGEud2VzdGNoZXN0ZXIucGEubWFpbC5jb21jYXN0Lm5ldD4="},"prevInTopic":39619,"nextInTopic":39623,"prevInTime":39619,"nextInTime":39621,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"Okay, that s the second ringing endorsement for this book. I m ordering it today. Thank you! Denise ... From: Jeff Sabo  To:","messageBody":"<div id=\"ygrps-yiv-1806482727\">Okay, that&#39;s the second ringing endorsement for this book. I&#39;m ordering it today. Thank you! <br/>\n<br/>\n<br/>\n<br/>\nDenise <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Jeff Sabo&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:freeboysdad@...\">freeboysdad@...</a>&gt; <br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSent: Thursday, April 16, 2009 12:52:32 AM GMT -05:00 US/Canada Eastern <br/>\nSubject: Re: [unschoolingbasics] Our first &quot;yes&quot; and a question <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&gt; <br/>\n&gt; Some books and sites that might be of interest: <br/>\n<br/>\n&gt; <br/>\n&gt; Parenting a Free Child, An Unschooled Life by Rue Kream <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.freechil\">http://www.freechil</a> <br/>\n&gt; d.info/ <br/>\n<br/>\nI&#39;ve said it before but it&#39;s worth repeating - Rue&#39;s book was the one thing that made me realize that it would all be okay. This is a must-read for unschoolers. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":240684971,"authorName":"pellegrina@comcast.net","from":"pellegrina@...","profile":"elysgrl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Our first &quot;yes&quot; and a question","postDate":"1239919949","msgId":39618,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU1ODgxNTc1NS4zMjU3ODgxMjM5OTE5OTQ5MTkwLkphdmFNYWlsLnJvb3RAc3owMTEwYS53ZXN0Y2hlc3Rlci5wYS5tYWlsLmNvbWNhc3QubmV0Pg==","inReplyToHeader":"PDY3MDAzMTE4MS4zMjUyNjExMjM5OTE5MjUxODM5LkphdmFNYWlsLnJvb3RAc3owMTEwYS53ZXN0Y2hlc3Rlci5wYS5tYWlsLmNvbWNhc3QubmV0Pg=="},"prevInTopic":39612,"nextInTopic":39619,"prevInTime":39617,"nextInTime":39619,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"Thank you, Robin! I m beginning to see what you mean about the Unschooling Handbook. Lots of great ideas, but I m realizing that what I m reading about here","messageBody":"<div id=\"ygrps-yiv-993620067\">Thank you, Robin! I&#39;m beginning to see what you mean about the Unschooling Handbook. Lots of great ideas, but I&#39;m realizing that what I&#39;m reading about here and on the sites you recommended is a totally different animal. N ot so much a method as an entire lifestyle. And why wouldn&#39;t it be? When you really think about the philosophy behind it (and I&#39;ve been reading Gatto and Holt as well), you see how the same freedom that&#39;s applied to learning can be applied to, well, everything! Parenting. Living. <br/>\n<br/>\n<br/>\n<br/>\nYou would think this would be a no-brainer for me. I was an attachment parent when my kids were little, I breastfed all of them into toddlerhood (and beyond). Heck, I was a La Leche League Leader and knew plenty of unschoolers back in the day. But when my kids hit school-age, I don&#39;t know, my childhood programming kicked in and I never even considered doing anything other than send them to public school. (Probably the fact that I&#39;m the daughter of a teacher and school administrator had a little something to do with that...) <br/>\n<br/>\n<br/>\n<br/>\nAnyway, I&#39;ve added both books to my wish list and will read them ASAP. (Oh, and I threw out the &quot;learning logs&quot;.) <br/>\n<br/>\nThanks again, <br/>\n<br/>\nDenise <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Robin Bentley&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robin.bentley@...\">robin.bentley@...</a>&gt; <br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSent: Thursday, April 16, 2009 12:20:55 AM GMT -05:00 US/Canada Eastern <br/>\nSubject: Re: [unschoolingbasics] Our first &quot;yes&quot; and a question <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&gt; <br/>\nI loved the stories about mohawks and smashing cars. It&#39;s good to take <br/>\na moment in each instance to look at automatic &quot;no&#39;s.&quot; Saying &quot;yes&quot; <br/>\nmore doesn&#39;t mean saying yes to every single thing &lt;g&gt;, but you&#39;re on <br/>\nthe right track. <br/>\n<br/>\n&gt; <br/>\n&gt; I guess I was thinking along those lines because I just finished The <br/>\n&gt; Unschooling Handbook, in which the chapters are divided up into <br/>\n&gt; &quot;school subjects&quot;, and how different kinds of everyday activities <br/>\n&gt; teach those things. <br/>\n<br/>\nAs far as I remember &quot;The Unschooling Handbook&quot; isn&#39;t about whole-life <br/>\nunschooling, but about an informal approach to academics. It might be <br/>\nuseful as a jumping-off point, and might help if you are constrained <br/>\nby state laws to write things down. But there are better places to <br/>\nlearn about unschooling. <br/>\n<br/>\n&gt; I was also mentally figuring out how I was going to classify <br/>\n&gt; everything we did on our &quot;learning log&quot;--a grid-like form I got from <br/>\n&gt; a book (the family who used it were unschoolers). I need to keep <br/>\n&gt; some kind of record of what we do, and be able to show (if we&#39;re <br/>\n&gt; ever asked) that we&#39;re providing &quot;an equivalent education&quot; to what <br/>\n&gt; he would be receiving in public school. <br/>\n<br/>\nDo you *have to*? <br/>\n<br/>\n&gt; Don&#39;t most unschoolers have to be able to convert their daily <br/>\n&gt; activities into &quot;eduspeak&quot; for the state? <br/>\n<br/>\nNo! And each state had completely different requirements. <br/>\n<br/>\n&gt; Am I worrying too much about record-keeping? It&#39;s difficult to look <br/>\n&gt; at that blank grid and NOT think in terms of fitting everything into <br/>\n&gt; neat subject areas. (Although I did homeschool two of my older kids <br/>\n&gt; for several years, and nobody ever asked to see my records.) <br/>\n<br/>\nThrow out the blank grids. They&#39;ll keep you mired in school-ish <br/>\nthinking - it won&#39;t help you in your unschooling journey. <br/>\n<br/>\nSome books and sites that might be of interest: <br/>\n<br/>\nParenting a Free Child, An Unschooled Life by Rue Kream <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.freechild.info/\">http://www.freechild.info/</a> <br/>\nThe Unschooling Unmanual by Jan Hunt //www.naturalchild.com/unmanual/ <br/>\n<br/>\nThese pages might help with the subject/teaching/learning stuff: <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/unschooling/teachingversuslearning.html\">http://joyfullyrejoycing.com/unschooling/teachingversuslearning.html</a> <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/subjects\">http://sandradodd.com/subjects</a> <br/>\n<br/>\nPoke around on those sites, too, for more good stuff! <br/>\n<br/>\nRobin B. <br/>\n<br/>\n[Non-text portions of this message have been removed] <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":240684971,"authorName":"pellegrina@comcast.net","from":"pellegrina@...","profile":"elysgrl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Our first &quot;yes&quot; and a question","postDate":"1239918326","msgId":39619,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2NzExNTE1NTMuMzI0NzAxMTIzOTkxODMyNjI5MC5KYXZhTWFpbC5yb290QHN6MDExMGEud2VzdGNoZXN0ZXIucGEubWFpbC5jb21jYXN0Lm5ldD4=","inReplyToHeader":"PGdzNWtyaitqODduQGVHcm91cHMuY29tPg=="},"prevInTopic":39618,"nextInTopic":39620,"prevInTime":39618,"nextInTime":39620,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"Thanks Meredith. :) Every day that goes by, I m breathing a little easier. I m already a relaxed parent by nature, meaning my kids don t have chores, lots of","messageBody":"<div id=\"ygrps-yiv-184539414\">Thanks Meredith. :) Every day that goes by, I&#39;m breathing a little easier. I&#39;m already a relaxed parent by nature, meaning my kids don&#39;t have chores, lots of rules, strict bedtimes, curfews, etc. So at least we don&#39;t have to unlearn all that stuff, too! I think I&#39;m just going to follow his lead, and let him initiate conversations about our homeschooling philosophy, which he understands at this point is a work in progress, and a partnership. <br/>\n<br/>\n<br/>\n<br/>\nBy the way, what is Learn Nothing Day?? <br/>\n<br/>\n<br/>\n<br/>\nDenise <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Meredith&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:meredith@...\">meredith@...</a>&gt; <br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSent: Wednesday, April 15, 2009 5:50:43 PM GMT -05:00 US/Canada Eastern <br/>\nSubject: [unschoolingbasics] Re: Our first &quot;yes&quot; and a question <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> , pellegrina@... wrote: <br/>\n&gt;&gt; But I only said that in my head. In reality, I took a deep breath, handed him a hammer and some safety goggles, and said, &quot;Sure.&quot; <br/>\n******************* <br/>\n<br/>\nSafety goggles are a good idea. Another is to put whatever (in this case cars) in a bag or baggie to catch small sharp flying pieces. <br/>\n<br/>\n&gt;&gt; He looked doubtful, very, very doubtful, kind of like he&#39;s wondering if Mom has any clue what she&#39;s doing after all. I told him we&#39;d talk about it tomorrow, that I was trying something a little different called unschooling. <br/>\n******************************* <br/>\n<br/>\nWhen Ray first came home I didn&#39;t talk much about unschooling but did talk a good bit about deschooling - how its important to take a break and &quot;get school out of your head&quot;. He was a little concerned that I had some sort of plan for getting school out of his head, like re-training him somehow, but I reassured him that it was more like being on vacation. <br/>\n<br/>\nWe talked more about unschooling after a few months had gone by and he&#39;d gotten used to the idea that he didn&#39;t Have to do things (school work, chores, etc). Then we were able to talk about things he was doing - skating, watching tv, and playing games, in particular - and the learning that was going on. He didn&#39;t want to talk too much about that, at that point. <br/>\n<br/>\nLast year when Learn Nothing Day came around he joked that we should all go to school for the day if we wanted to learn nothing - he couldn&#39;t imagine a day outside school without learning Something. <br/>\n<br/>\n---Meredith (Mo 7, Ray 15) <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Our first &quot;yes&quot; and a question","postDate":"1239903898","msgId":39607,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlFRURCQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":39605,"nextInTopic":39610,"prevInTime":39606,"nextInTime":39608,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"... activities into eduspeak for the state? I wouldn t say most  - in some states they have testing, some have logs, etc. Whether a log is needed depends","messageBody":"<div id=\"ygrps-yiv-722275889\"><blockquote><span title=\"ireply\">&gt; Don&#39;t most unschoolers have to be able to convert their daily\r<br/>\n </span></blockquote>activities into &quot;eduspeak&quot; for the state?\r<br/>\nI wouldn&#39;t say &quot;most&quot;  - in some states they have testing, some have\r<br/>\nlogs, etc. Whether a log is needed depends on the state laws - we don&#39;t\r<br/>\never have to show anyone anything UNLESS push comes to shove and someone\r<br/>\ntakes us to court (not an easy thing, since they&#39;d have to have grounds\r<br/>\nfor neglect to even start the ball rolling). So, KNOW your laws\r<br/>\nthoroughly. \r<br/>\n\r<br/>\nWhat I might suggest is just kept a &#39;diary&#39; of some sort where you just\r<br/>\nlist the activities, not fill in the &#39;subjects&#39;. Then, if you NEED to at\r<br/>\nsome point, you have the data to massage into what is expected and if\r<br/>\nnot, you don&#39;t ever have to even think in subjects at all. Where we are,\r<br/>\nthere&#39;s no reporting of any kind required (not even notice of intent\r<br/>\nonce the kids are withdrawn from school). If it became absolutely\r<br/>\nnecessary, I could probably sit down and whip up something that\r<br/>\n&#39;sounded&#39; as expected just by thinking about the stuff we&#39;ve done over\r<br/>\nthe last months (I could go ahead and look back at my wall calendar and\r<br/>\nemail calendar to see what was on our schedule in addition to the things\r<br/>\nI know are regular happenings/activities). In your situation, I&#39;d\r<br/>\nstrongly suggest that you ditch the subject page log and just jot notes\r<br/>\neach evening before bed of the things that struck you that do, stuff\r<br/>\nthat happened (such as you mentioned to your DS) WITHOUT trying to fit\r<br/>\nit to any kind of &#39;subject&#39; category.\r<br/>\n\r<br/>\nDeb R\r<br/>\n\r<br/>\n\r<br/>\n**********************************************************************\r<br/>\nThis email and any files transmitted with it are confidential and\r<br/>\nintended solely for the use of the individual or entity to whom they\r<br/>\nare addressed. If you have received this email in error please notify\r<br/>\nthe system manager.\r<br/>\n\r<br/>\nThis footnote also confirms that this email message has been swept by\r<br/>\nMIMEsweeper for the presence of computer viruses.\r<br/>\n\r<br/>\nwww.mastercam.com\r<br/>\n**********************************************************************\r<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"diana jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Our first &quot;yes&quot; and a question","postDate":"1239902183","msgId":39604,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDkwNDE2MTAxNnEzNjUwOTVhY2pjOTY0MWI1ZWRkNDM4NzBhQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdzNnFncCthOXZkQGVHcm91cHMuY29tPg==","referencesHeader":"PGdzNWtyaitqODduQGVHcm91cHMuY29tPiA8Z3M2cWdwK2E5dmRAZUdyb3Vwcy5jb20+"},"prevInTopic":39602,"nextInTopic":39605,"prevInTime":39603,"nextInTime":39605,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"Come along with me for a little bit.... we re gonna move things around. Re-imagine this paragraph as it could have been written by *your* mother; put in YOUR","messageBody":"<div id=\"ygrps-yiv-370110749\">Come along with me for a little bit.... we&#39;re gonna move things around.<br/>\nRe-imagine this paragraph as it could have been written by *your* mother;<br/>\nput in YOUR passion that you would have loved nothing more than to have had<br/>\nyour mother&#39;s approval and support of.  If you&#39;d overheard your mom speaking<br/>\nthis way about your passions, what kind of relationship would *you* want<br/>\nwith *her* -- then wonder if that is the relationship you want with *YOUR*<br/>\nkids.<br/>\nChances are, you (like the most of us) would like something much, much<br/>\nbetter.<br/>\nWhich means much, much different.<br/>\nWhich means we have to give up that opportunity to be the standing-over,<br/>\njudgmental, know-it-all-better-than-you grownup in our kids&#39; lives.<br/>\nWe get more. WE get to be on their TEAM. We get to work IN relationship with<br/>\nour kids, fueling those passions that were not fueled for the most of us.<br/>\nWe&#39;re venturing out onto foreign ground with this new fangled relationship<br/>\nstate, doing things in ways our parents, neighbors and cousins can&#39;t quite<br/>\nunderstand.<br/>\nAnd yet, when we&#39;re there, in the middle of chicks we&#39;d never dreamed we&#39;d<br/>\nhave in our lives (for me it&#39;s a big black fuzzy dog) and we *DO* -- we do<br/>\nwhat it is that will ensure, foster and protect JOY in each and every one of<br/>\nour lives.  I care for the dog because I LOVE that we have a dog for my son<br/>\nto love, who so desperately wanted one for years.  I care for the dog<br/>\njoyfully because I know that practicing doing the things I really didn&#39;t<br/>\nwant to do (very strongly), in the spirit of giving a gift to my entire<br/>\nfamily with JOY, creates a STRONG joy-making muscle in me.  I am now, too,<br/>\nappreciating the body that comes with waking a dog every-single-day, though<br/>\nmy transition from full-on couch potato to dog-runner has not been easy.<br/>\nStill, I found ways to make it *more* pleasant, found places to walk that<br/>\n*I* liked, found things to photograph along the way... I made the *gift* of<br/>\ncaring for our family&#39;s dog (we&#39;re a team, he&#39;s OURS) a pleasant one to give<br/>\n(as I&#39;d be giving it every day, that was really a gift for ME). And I&#39;ve had<br/>\nthe bonus of alone time, and a new found love of audio books.<br/>\nGive a little, heck, give A LOT, there&#39;s even more there for you to receive<br/>\nin return!<br/>\nAnd yeah, at the end of the day, it really is: Is this how I want my/their<br/>\nlife to end? With *this* energy? With *this* issue?<br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.blogspot.com<br/>\nhannahsashes.blogspot.com<br/>\ndianas365.blogspot.com<br/>\n<br/>\n<br/>\nOn Thu, Apr 16, 2009 at 1:33 AM, uuhomeschooler2<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:publicprofile34@...\">publicprofile34@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; How do you get out of doing chores? I keep thinking about the chicks my<br/>\n&gt; kids have for 4-H. I did NOT want them. I was very clear that if they wanted<br/>\n&gt; them, they HAD to take care of them - twice a day. They have tried to get<br/>\n&gt; out of it a couple times, and once I did it since I remembered they didn&#39;t<br/>\n&gt; and they were already asleep. But, I can&#39;t figure out how to not insist and<br/>\n&gt; still let them have the chicks? At what point to I follow through and give<br/>\n&gt; them away if I&#39;m the one doing it and reminding them and telling them to go<br/>\n&gt; take care of them, when I didn&#39;t want this burden on our freedom to begin<br/>\n&gt; with? They still want and love the chicks - and are learning about them.<br/>\n&gt; That part is great. But, in the near future we will be gone a lot and they<br/>\n&gt; will be gone and guess who is left? Dad or me. Do I have to take care of<br/>\n&gt; them in order to be a responsive, unschooling parent?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Our first &quot;yes&quot; and a question","postDate":"1239902032","msgId":39605,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlFRUQ5QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":39604,"nextInTopic":39607,"prevInTime":39604,"nextInTime":39606,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"... container of water overnight to make a huge ice cube to be smashed, for example Freeze some of the old hot wheels inside the block of ice even. A favorite","messageBody":"<div id=\"ygrps-yiv-1684331809\"><blockquote><span title=\"ireply\">&gt;&quot;I want to smash my toys&quot; could become freezing a big Tupperware\r<br/>\n </span></blockquote>container of water overnight to make a huge ice cube to be smashed, for\r<br/>\nexample\r<br/>\n\r<br/>\nFreeze some of the old hot wheels inside the block of ice even. A\r<br/>\nfavorite &quot;craft&quot; when I was an arts & crafts organizer at a week long\r<br/>\nsummer camp was smashing - we (the adult coordinators) would scope out\r<br/>\nsome interesting shaped rocks (maybe an inch in diameter) and spray\r<br/>\npaint them gold. Then we&#39;d mix up some plaster and pour it into paper\r<br/>\ncups. Let it firm up for a couple minutes then drop in the rock. Let it\r<br/>\nset and peel off the cup. Hand the kids a hammer and a nail (or other\r<br/>\nsimilar type tool) and let them sit out in the sunshine outside the door\r<br/>\nand mash that plaster to find the &#39;gold&#39;. It was so popular that we had\r<br/>\nto set up a waiting list because we couldn&#39;t keep up with the demand (it\r<br/>\ntook overnight to set the plaster properly and such so we couldn&#39;t do it\r<br/>\nquite &#39;on demand&#39;  - we&#39;d use the list to gauge how many to make each\r<br/>\nday and try to get each person on the list at least one shot at\r<br/>\n&#39;treasure&#39;).\r<br/>\n\r<br/>\nEvery so often DS will ask me to make him some &#39;math questions&#39; to do.\r<br/>\nSo I do it - I ask how many he wants me to do, what types (addition,\r<br/>\nmultiplication, etc), how big the numbers should get (does he want 4x5\r<br/>\nor 40x50), and any other parameters that might apply. I might check in\r<br/>\nwith him on whether he recognizes/understands certain symbology before\r<br/>\nusing it (for instance, the difference between 2+(2x5) and (2+2)x5 - is\r<br/>\nthe parenthetical order of operations something he &#39;gets&#39;). He can do\r<br/>\nall of the resulting questions, some of the questions, ask me to clarify\r<br/>\nthem, etc. Sometimes he wants me to check them, sometimes once he&#39;s gone\r<br/>\nthrough it he&#39;s done and doesn&#39;t care to have me check, and sometimes he\r<br/>\nwants me to explain them a bit, how/why it comes out the way it does.\r<br/>\nDoes it look like school? Maybe somewhat. Is it school? Nope - school\r<br/>\npresumes that the &#39;teacher&#39; is in charge and decides what and when and\r<br/>\nhow and such. Some unschooled kids choose to pick up a textbook on some\r<br/>\nsubject or other  - it actually looks like school. But the driving force\r<br/>\nis not the &#39;teacher&#39; but the &#39;learner&#39; and the motivation is internal to\r<br/>\nthe learner not externally enforced. If you&#39;ve already got workbooks,\r<br/>\nput them on the bookshelf next to the coloring books and the Captain\r<br/>\nUnderpants books and the Klingon-English dictionary (yes, we do own one\r<br/>\nof those - DH had it before we got married). None of them is &#39;better&#39; or\r<br/>\n&#39;worse&#39; than the other, they&#39;re all resource to be used when and how an\r<br/>\nindividual decides.\r<br/>\n\r<br/>\n\r<br/>\nDeb R\r<br/>\n\r<br/>\n\r<br/>\n**********************************************************************\r<br/>\nThis email and any files transmitted with it are confidential and\r<br/>\nintended solely for the use of the individual or entity to whom they\r<br/>\nare addressed. If you have received this email in error please notify\r<br/>\nthe system manager.\r<br/>\n\r<br/>\nThis footnote also confirms that this email message has been swept by\r<br/>\nMIMEsweeper for the presence of computer viruses.\r<br/>\n\r<br/>\nwww.mastercam.com\r<br/>\n**********************************************************************\r<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Our first &quot;yes&quot; and a question","postDate":"1239897846","msgId":39602,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2MDI1NC4xNjQ2OC5xbUB3ZWI4MTUwMi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGdzNnFncCthOXZkQGVHcm91cHMuY29tPg==","referencesHeader":"PGdzNnFncCthOXZkQGVHcm91cHMuY29tPg=="},"prevInTopic":39599,"nextInTopic":39604,"prevInTime":39601,"nextInTime":39603,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"Do I have to take care of them in order to be a responsive, unschooling parent? -=-=-=-=-=-= Why not? I say Yes take care of them. Help you kids, Join them in","messageBody":"<div id=\"ygrps-yiv-1948986899\">Do I have to take care of them in order to be a responsive, unschooling parent?<br/>\n<br/>\n-=-=-=-=-=-=<br/>\nWhy not? I say Yes take care of them.<br/>\nHelp you kids, Join them in the care IF they really want those animals.<br/>\nDo they really want them or are they just doing that to make you happy?<br/>\n<br/>\nI have many animals. My 3 year old might get a pony and I am still thinking if I want one more to take care of.<br/>\nI take care of their dogs, guinea pigs, cats and we are super busy ...oh I forgot the fish!<br/>\nI also want some chicken this year and I hope to make it happen.<br/>\nI absolutely know its a lot of work to have animals. We are Dairy Farmers and the cows here come first.<br/>\nI have worked with dogssince I was13 ( so 30 years!!) andwhen we were kids we had all kinds of animals.<br/>\nWe had guinea pigs, rats, snakes, monkey, poultry, turtles, dogs, cat, chicks, ducks,horses, just toname a few.<br/>\nMy parentsALWAYS took care of them with us. We all became really responsible pet owners.<br/>\nOurs parents would never let our animals suffer. They model caring for them andnever complained or forced us to.<br/>\nThey were busy parents and my dad took his few days off to do stuff around the house that included caring for our animals.<br/>\nWhat a gift they gave us. It was joyful and loving.<br/>\nWe had a great childhood with many great memories from having our many animals.<br/>\n<br/>\nTo be able to partner with your child and see unschooling blossom you will need to have a hugeparadigm change.<br/>\nIt is not us ( parents)X them( children). It is not about martyrdom either.<br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Our first &quot;yes&quot; and a question","postDate":"1239891132","msgId":39599,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzN2VicyszMjRjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdzNnFncCthOXZkQGVHcm91cHMuY29tPg=="},"prevInTopic":39597,"nextInTopic":39602,"prevInTime":39598,"nextInTime":39600,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"... Imagine the difference between making it clear that you do NOT want something they are fascinated with and partnering with them. Imagine the difference","messageBody":"<div id=\"ygrps-yiv-1470891328\"><blockquote><span title=\"ireply\">&gt;~~How do you get out of doing chores?  I keep thinking about the chicks my kids have for 4-H.  I did NOT want them.  I was very clear that if they wanted them, they HAD to take care of them - twice a day.~~<br/>\n<br/>\n<br/>\n </span></blockquote>Imagine the difference between making it clear that you do NOT want something they are fascinated with and partnering with them. Imagine the difference between your spouse being very supportive and excited about something YOU wanted and telling you it&#39;s YOUR problem and he won&#39;t  help you. What if you wanted a garden and he made it VERY clear that you were on your own, it was an imposition on his time and you better take care of it? What if he reminded you to get out there and deal with it? OR....<br/>\n<br/>\nWhat if he simply saw that you wanted it and decided to be kind and helpful and be there to help you with it as much as possible? What if he took joy in your newfound interest? Which scenario encourages a great relationship? What kind of feelings do you have towards the family member that chooses to embrace your interest and/or the one that makes it clear that the interest is YOUR problem?<br/>\n<br/>\nI know the gardening scenario is just made up...you could replace that with any interest you might have. Try to picture how it feels from the children&#39;s perspective. Can you imagine a child feeling overwhelmed by the task of caring for these creatures they love and want and having an adult sweetly come out and help them twice per day? Is the responsibility of the chicks really so much that you can&#39;t BE with them during this time and take joy in their interest?<br/>\n<br/>\nI&#39;m reading a lot about your stress in getting these kids to do lessons and classes they might not want, which is exhausting and mind-numbing in my opinion. But then the very thing they love and enjoy (the chicks) you are passing up a GREAT opportunity to connect with your children and be fully present for them. Quit trying to micromanage these kids and get into the moment with them!!<br/>\n<br/>\n<br/>\n ~They have tried to get out of it a couple times, and once I did it since I remembered they didn&#39;t and they were already asleep.  But, I can&#39;t figure out how to not insist and still let them have the chicks?~~<br/>\n<br/>\nYou can insist or you can partner with them and create some joy.<br/>\n<br/>\n ~~ At what point to I follow through and give them away if I&#39;m the one doing it and reminding them and telling them to go take care of them, when I didn&#39;t want this burden on our freedom to begin with?~~<br/>\n<br/>\nDon&#39;t. Don&#39;t give them away. Go do the chores with them and try to see how lucky you are to have kids who are interested in something so cool. If you end up as the only one caring for the chicks, it might be time to discuss whether they still want them. But if they do, HELP them find a way to make it work.<br/>\n<br/>\n<br/>\n ~~ They still want and love the chicks - and are learning about them.  That part is great.  But, in the near future we will be gone a lot and they will be gone and guess who is left?  Dad or me.  Do I have to take care of them in order to be a responsive, unschooling parent?~~<br/>\n<br/>\n<br/>\nYour kids want and love this thing before you and you resist it. They don&#39;t want some of the other things you insist they do. Can you see how huge of a roadblock this is for joyful unschooling? You have some choices to make about what matters most...<br/>\nsupporting the things your children ARE actually interested in or continuing to insist they do things they don&#39;t want AND be unsupportive about a very real interest they currently have.<br/>\n<br/>\nYour kids are alive and healthy. If one of them was dead and gone how would you feel about those chicks and the reminder of something they loved? How would you feel about the opportunity you have today to enter into a partnership WITH your child and the thing they love? WOuld you feel that you had taken every opportunity to create joy in your lives? Is the task of feeding some birds really worth taking ANY ounce of joy out of your lives?<br/>\n<br/>\nAll I have to do when something seems difficult or I start to resist it, is ask myself &quot;is this helping or hindering my relationship with this child?&quot; I don&#39;t want to put barriers between myself and my children. Helping them do the things they love IS a huge part of this parenting journey...unschooler or not.<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":336564039,"authorName":"Jennifer Croce","from":"Jennifer Croce &lt;jennifercroce37@...&gt;","profile":"jennifercroce37","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Our first &quot;yes&quot; and a question","postDate":"1239878447","msgId":39597,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY0MzMwMi41NDg0OS5xbUB3ZWI0NjAwMy5tYWlsLnNwMS55YWhvby5jb20+","inReplyToHeader":"PDM3OTM3MS4xNzIyOC5xbUB3ZWI1NTgwNy5tYWlsLnJlMy55YWhvby5jb20+","referencesHeader":"PDM3OTM3MS4xNzIyOC5xbUB3ZWI1NTgwNy5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":39595,"nextInTopic":39599,"prevInTime":39596,"nextInTime":39598,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"... I am new to unschooling and just finished Rue s book, it was wonderfully written and made me take a long hard look at myself and how I treat my children.","messageBody":"<div id=\"ygrps-yiv-1318885803\"><blockquote><span title=\"ireply\">&gt;I&#39;ve said it before but it&#39;s worth repeating - Rue&#39;s book was the one thing that made me realize that it would all be okay. This is a must-read for unschoolers. &lt;<br/>\n<br/>\n </span></blockquote>I am new to unschooling and just finished Rue&#39;s book, it was wonderfully written and made me take a long hard look at myself and how I treat my children. I realize I have a lot to learn and am slowing changing little things and seeing big results. It definitely helped me understand the basics of unschooling and how amazing an unschooling life can be. The more I learn about this lifestyle the more I wonder why people don&#39;t want to live this way. <br/>\n<br/>\nI took my first big step towards unschooling yesterday and gave my 6 year old the choice of whether or not she went to school that day(I plan tohomeschool in Sept).She wanted to go for the morning and have me pick her up after lunch which I did. It was an amazing day and at the end of it I asked her what she liked best aboutit, she replied &quot;everything, it was all fun!&quot;<br/>\n<br/>\nTake care,<br/>\nJen<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":177854869,"authorName":"uuhomeschooler2","from":"&quot;uuhomeschooler2&quot; &lt;publicprofile34@...&gt;","profile":"uuhomeschooler2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Our first &quot;yes&quot; and a question","postDate":"1239870809","msgId":39595,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzNnFncCthOXZkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdzNWtyaitqODduQGVHcm91cHMuY29tPg=="},"prevInTopic":39594,"nextInTopic":39597,"prevInTime":39594,"nextInTime":39596,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"... How do you get out of doing chores?  I keep thinking about the chicks my kids have for 4-H.  I did NOT want them.  I was very clear that if they wanted","messageBody":"<div id=\"ygrps-yiv-359702069\"><blockquote><span title=\"ireply\">&gt; We talked more about unschooling after a few months had gone by and he&#39;d gotten used to the idea that he didn&#39;t Have to do things (school work, chores, etc). <br/>\n<br/>\n<br/>\n </span></blockquote>How do you get out of doing chores?  I keep thinking about the chicks my kids have for 4-H.  I did NOT want them.  I was very clear that if they wanted them, they HAD to take care of them - twice a day.  They have tried to get out of it a couple times, and once I did it since I remembered they didn&#39;t and they were already asleep.  But, I can&#39;t figure out how to not insist and still let them have the chicks?  At what point to I follow through and give them away if I&#39;m the one doing it and reminding them and telling them to go take care of them, when I didn&#39;t want this burden on our freedom to begin with?  They still want and love the chicks - and are learning about them.  That part is great.  But, in the near future we will be gone a lot and they will be gone and guess who is left?  Dad or me.  Do I have to take care of them in order to be a responsive, unschooling parent?</div>","specialLinks":[]},{"userId":177854869,"authorName":"uuhomeschooler2","from":"&quot;uuhomeschooler2&quot; &lt;publicprofile34@...&gt;","profile":"uuhomeschooler2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Our first &quot;yes&quot; and a question","postDate":"1239869638","msgId":39594,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzNnBjNitsamhxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ5ZTVmY2M2LjIwMDE4ZTBhLjBkNDEuZmZmZjkxMzJAbXguZ29vZ2xlLmNvbT4="},"prevInTopic":39590,"nextInTopic":39595,"prevInTime":39593,"nextInTime":39595,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"So - Yes! and We re on break.  and We re going to die this year! are the main things to remember, right!? That is VERY helpful.","messageBody":"<div id=\"ygrps-yiv-751410984\">So - &quot;Yes!&quot; and<br/>\n &quot;We&#39;re on break.&quot;  and <br/>\n&quot;We&#39;re going to die this year!&quot; <br/>\nare the main things to remember, right!?<br/>\n<br/>\nThat is VERY helpful.</div>","specialLinks":[]},{"userId":284534827,"authorName":"Jeff Sabo","from":"Jeff Sabo &lt;freeboysdad@...&gt;","profile":"freeboysdad","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Our first &quot;yes&quot; and a question","postDate":"1239857552","msgId":39590,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM3OTM3MS4xNzIyOC5xbUB3ZWI1NTgwNy5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":39589,"nextInTopic":39594,"prevInTime":39589,"nextInTime":39591,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"... I ve said it before but it s worth repeating - Rue s book was the one thing that made me realize that it would all be okay. This is a must-read for","messageBody":"<div id=\"ygrps-yiv-309532572\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; Some books and sites that might be of interest:<br/>\n<br/>\n&gt; <br/>\n&gt; Parenting a Free Child, An Unschooled Life by Rue Kream  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.freechil\">http://www.freechil</a><br/>\n&gt; d.info/<br/>\n<br/>\n </span></blockquote>I&#39;ve said it before but it&#39;s worth repeating - Rue&#39;s book was the one thing that made me realize that it would all be okay. This is a must-read for unschoolers.</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Our first &quot;yes&quot; and a question","postDate":"1239855655","msgId":39589,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM1REIxQzRELTFFQ0QtNDY5Mi04ODJCLUIxN0E3QkY5MUE1REBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDE5NTIxNTgyOTIuMjcyMzMxMTIzOTgzMTExNTgyNS5KYXZhTWFpbC5yb290QHN6MDExMGEud2VzdGNoZXN0ZXIucGEubWFpbC5jb21jYXN0Lm5ldD4=","referencesHeader":"PDE5NTIxNTgyOTIuMjcyMzMxMTIzOTgzMTExNTgyNS5KYXZhTWFpbC5yb290QHN6MDExMGEud2VzdGNoZXN0ZXIucGEubWFpbC5jb21jYXN0Lm5ldD4="},"prevInTopic":39588,"nextInTopic":39590,"prevInTime":39588,"nextInTime":39590,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"... I loved the stories about mohawks and smashing cars. It s good to take a moment in each instance to look at automatic no s. Saying yes more doesn t","messageBody":"<div id=\"ygrps-yiv-1812685613\"><blockquote><span title=\"ireply\">&gt;<br/>\n </span></blockquote>I loved the stories about mohawks and smashing cars. It&#39;s good to take  <br/>\na moment in each instance to look at automatic &quot;no&#39;s.&quot; Saying &quot;yes&quot;  <br/>\nmore doesn&#39;t mean saying yes to every single thing &lt;g&gt;, but you&#39;re on  <br/>\nthe right track.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I guess I was thinking along those lines because I just finished The  <br/>\n&gt; Unschooling Handbook, in which the chapters are divided up into  <br/>\n&gt; &quot;school subjects&quot;, and how different kinds of everyday activities  <br/>\n&gt; teach those things.<br/>\n<br/>\n </span></blockquote>As far as I remember &quot;The Unschooling Handbook&quot; isn&#39;t about whole-life  <br/>\nunschooling, but about an informal approach to academics. It might be  <br/>\nuseful as a jumping-off point, and might help if you are constrained  <br/>\nby state laws to write things down. But there are better places to  <br/>\nlearn about unschooling.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I was also mentally figuring out how I was going to classify  <br/>\n&gt; everything we did on our &quot;learning log&quot;--a grid-like form I got from  <br/>\n&gt; a book (the family who used it were unschoolers). I need to keep  <br/>\n&gt; some kind of record of what we do, and be able to show (if we&#39;re  <br/>\n&gt; ever asked) that we&#39;re providing &quot;an equivalent education&quot; to what  <br/>\n&gt; he would be receiving in public school.<br/>\n<br/>\n </span></blockquote>Do you *have to*?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Don&#39;t most unschoolers have to be able to convert their daily  <br/>\n&gt; activities into &quot;eduspeak&quot; for the state?<br/>\n<br/>\n </span></blockquote>No!  And each state had completely different requirements.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Am I worrying too much about record-keeping? It&#39;s difficult to look  <br/>\n&gt; at that blank grid and NOT think in terms of fitting everything into  <br/>\n&gt; neat subject areas. (Although I did homeschool two of my older kids  <br/>\n&gt; for several years, and nobody ever asked to see my records.)<br/>\n<br/>\n </span></blockquote>Throw out the blank grids. They&#39;ll keep you mired in school-ish  <br/>\nthinking - it won&#39;t help you in your unschooling journey.<br/>\n<br/>\nSome books and sites that might be of interest:<br/>\n<br/>\nParenting a Free Child, An Unschooled Life by Rue Kream  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.freechild.info/\">http://www.freechild.info/</a><br/>\nThe Unschooling Unmanual by Jan Hunt  //www.naturalchild.com/unmanual/<br/>\n<br/>\nThese pages might help with the subject/teaching/learning stuff:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/unschooling/teachingversuslearning.html\">http://joyfullyrejoycing.com/unschooling/teachingversuslearning.html</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/subjects\">http://sandradodd.com/subjects</a><br/>\n<br/>\nPoke around on those sites, too, for more good stuff!<br/>\n<br/>\nRobin B.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":240684971,"authorName":"pellegrina@comcast.net","from":"pellegrina@...","profile":"elysgrl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Our first &quot;yes&quot; and a question","postDate":"1239833377","msgId":39588,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2ODQxMzcwODYuMjc0MjE2MTIzOTgzMzM3NzI5OS5KYXZhTWFpbC5yb290QHN6MDExMGEud2VzdGNoZXN0ZXIucGEubWFpbC5jb21jYXN0Lm5ldD4=","inReplyToHeader":"PDE3NGRmOWRjMDkwNDE1MDk1MWwzNDNmNGI4djFjMWI5NzZjZTkyZDlkMWJAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":39587,"nextInTopic":39589,"prevInTime":39587,"nextInTime":39589,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"Hi Marina-- Thank you for your response! ","messageBody":"<div id=\"ygrps-yiv-764956176\">Hi Marina-- <br/>\n<br/>\n<br/>\n<br/>\nThank you for your response! <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&lt;I think honesty is good, so explaining your reasons were a good &lt;place to start. Expecting him to understand and agree &lt;immediately that recreating school at home will not be allowed &lt;doesn&#39;t take his expections or needs for security or safety into &lt;your lifestyle change. He is stating a need and may <br/>\n&lt;have to reassure himself he can add and subtract in a more &lt;formal manner; so whether it is to do formal math or smash a &lt;toy car there is no need to judge. If he self-directs and insists on &lt;a workbook for math why not give him one or ask him to &lt;consider making up his own &quot;worksheets&quot;. <br/>\n<br/>\n<br/>\n<br/>\nI agree with this 100%. I haven&#39;t given him the impression that workbooks are now verboten--they&#39;re actually sitting right out on the kitchen counter where he left them. (He already did some on his own, last week while he was still in p.s.) He&#39;s a kid who LOVES that kind of thing, so I would never abruptly take them away. I just think that he was waiting for me to say, &quot;Okay now, Logan, today I want you to sit down and do pages 5 and 6...&quot; because to him, homeschooling means that I am now his teacher and should be directing him. <br/>\n<br/>\n&lt;Also, asking his opinion on what he feels comfortable doing &lt;might reveal his need to wean from school slowly, why not &lt;honor that need? If he wants to schedule time and work on &lt;&quot;Math&quot; in the way school presents math divorced from context, &lt;he may find his skills have appeared out of nowhere and when <br/>\n&lt;he &quot;tests himself&quot; with the workbook will feel very confident &lt;about not needing to decontextualize any discipline in order to &lt;learn it. <br/>\n<br/>\n<br/>\n<br/>\nHe&#39;s already got mad math skills! ;) Seriously, he&#39;s such a math whiz that I&#39;m surprised he didn&#39;t just pick it up and work on it today for fun. He also loves those timed tests (his school called it &quot;rocket math&quot;) and I offered to print a few of those for him, but he wasn&#39;t into it today. I guess I&#39;m trying to find a balance between suggesting, encouraging and supporting without slipping into &quot;teacher mode&quot;, which would be all too easy since that&#39;s what he wants me to do. I respect his need for direction, but at the same time, I&#39;d like to help him understand that he can direct his own learning now. When I homeschooled my two older kids years ago, they became way too dependent on me to tell them what to do. I would like to avoid getting into that dynamic if at all possible. For now, we&#39;re just going to take it verrrry slowly, but I appreciate the reminder to carefully consider his needs. Thank you! <br/>\n<br/>\n<br/>\n<br/>\nDenise <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Our first &quot;yes&quot; and a question","postDate":"1239832243","msgId":39585,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzNWtyaitqODduQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU2MDM3MjExMy4yMzQzODQxMjM5Nzc3NDI1NDU0LkphdmFNYWlsLnJvb3RAc3owMTEwYS53ZXN0Y2hlc3Rlci5wYS5tYWlsLmNvbWNhc3QubmV0Pg=="},"prevInTopic":39583,"nextInTopic":39587,"prevInTime":39584,"nextInTime":39586,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"... ******************* Safety goggles are a good idea. Another is to put whatever (in this case cars) in a bag or baggie to catch small sharp flying pieces. ","messageBody":"<div id=\"ygrps-yiv-2112086872\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, pellegrina@... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; But I only said that in my head. In reality, I took a deep breath, handed him a hammer and some safety goggles, and said, &quot;Sure.&quot;<br/>\n </span></blockquote>*******************<br/>\n<br/>\nSafety goggles are a good idea. Another is to put whatever (in this case cars) in a bag or baggie to catch small sharp flying pieces.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; He looked doubtful, very, very doubtful, kind of like he&#39;s wondering if Mom has any clue what she&#39;s doing after all. I told him we&#39;d talk about it tomorrow, that I was trying something a little different called unschooling. <br/>\n </span></blockquote>*******************************<br/>\n<br/>\nWhen Ray first came home I didn&#39;t talk much about unschooling but did talk a good bit about deschooling - how its important to take a break and &quot;get school out of your head&quot;. He was a little concerned that I had some sort of plan for getting school out of his head, like re-training him somehow, but I reassured him that it was more like being on vacation. <br/>\n<br/>\nWe talked more about unschooling after a few months had gone by and he&#39;d gotten used to the idea that he didn&#39;t Have to do things (school work, chores, etc). Then we were able to talk about things he was doing - skating, watching tv, and playing games, in particular - and the learning that was going on. He didn&#39;t want to talk too much about that, at that point. <br/>\n<br/>\nLast year when Learn Nothing Day came around he joked that we should all go to school for the day if we wanted to learn nothing - he couldn&#39;t imagine a day outside school without learning Something.<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":240684971,"authorName":"pellegrina@comcast.net","from":"pellegrina@...","profile":"elysgrl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Our first &quot;yes&quot; and a question","postDate":"1239831115","msgId":39587,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5NTIxNTgyOTIuMjcyMzMxMTIzOTgzMTExNTgyNS5KYXZhTWFpbC5yb290QHN6MDExMGEud2VzdGNoZXN0ZXIucGEubWFpbC5jb21jYXN0Lm5ldD4=","inReplyToHeader":"PDI3NzU2ODM1NC4yNzExODMxMjM5ODI5ODYwODYxLkphdmFNYWlsLnJvb3RAc3owMTEwYS53ZXN0Y2hlc3Rlci5wYS5tYWlsLmNvbWNhc3QubmV0Pg=="},"prevInTopic":39585,"nextInTopic":39588,"prevInTime":39586,"nextInTime":39588,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"Brad, thank you so much for your response! This, especially, was very helpful to me: ","messageBody":"<div id=\"ygrps-yiv-842078851\">Brad, thank you so much for your response! This, especially, was very helpful to me: <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&lt;On deschooling: <br/>\n&lt;I don&#39;t know that he needs to know the terms &quot;unschooling&quot; or &lt;&quot;deschooling&quot;, or really anything about the process initially. The &lt;next time he asks &quot;when are we starting?&quot; tell him that since he &lt;stopped going to public school, he now gets a very long &lt;vacation to do whatever he wants...a summer break, if <br/>\n&lt;you will, or a long spring break. When you talked to him about <br/>\n&lt;math/reading/science/music appreciation, you were talking &lt;&quot;schoolish&quot;. <br/>\n<br/>\n<br/>\n<br/>\nI guess I was thinking along those lines because I just finished The Unschooling Handbook, in which the chapters are divided up into &quot;school subjects&quot;, and how different kinds of everyday activities teach those things. I was also mentally figuring out how I was going to classify everything we did on our &quot;learning log&quot;--a grid-like form I got from a book (the family who used it were unschoolers). I need to keep some kind of record of what we do, and be able to show (if we&#39;re ever asked) that we&#39;re providing &quot;an equivalent education&quot; to what he would be receiving in public school. Don&#39;t most unschoolers have to be able to convert their daily activities into &quot;eduspeak&quot; for the state? Am I worrying too much about record-keeping? It&#39;s difficult to look at that blank grid and NOT think in terms of fitting everything into neat subject areas. (Although I did homeschool two of my older kids for several years, and nobody ever asked to see my records.) <br/>\n<br/>\n<br/>\n&lt; Deschooling is about the parents questioning <br/>\n&lt;their own beliefs, in my mind. Don&#39;t think about deschooling &lt;your son--focus on you. <br/>\n<br/>\n<br/>\n<br/>\nI can see I have my work cut out for me! <br/>\n<br/>\n&lt;Forget about math and &quot;music appreciation&quot;--what the heck is <br/>\n&lt;&quot;music appreciation&quot;, anyway, and who cares about that &lt;subject other than teachers who get paid to teach it? <br/>\n<br/>\n<br/>\n<br/>\nThat was me trying to fill up a space on the grid with &quot;watched American Idol.&quot; Quite a stretch, I know. <br/>\n<br/>\n&lt;To borrow Diana Jenner&#39;s thinking on this (gawd, this has been &lt;so helpful to me): What would your life look like if your son had &lt;an incurable disease that will probably mean death in 2009? &lt;How would your days look if your only goals were to connect &lt;with him and hear his desires and feed them by playing with &lt;him and helping him play...to help him enjoy life to the <br/>\n&lt;fullest? <br/>\n<br/>\n<br/>\n<br/>\nThat was very helpful to me, too. What a powerful question. A little perspective does wonders. <br/>\n<br/>\n&lt;Just tell him he&#39;s on break, and have fun!!! -=b. <br/>\n<br/>\n<br/>\n<br/>\nWe ended up having a casual conversation in the car today in which I did just that. I didn&#39;t mention deschooling, or unschooling, or school at all. I just said that we were free. :) <br/>\n<br/>\n<br/>\n<br/>\nThanks again, <br/>\n<br/>\nDenise <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":301108410,"authorName":"Marina DeLuca-Howard","from":"Marina DeLuca-Howard &lt;delucahoward@...&gt;","profile":"matedgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Our first &quot;yes&quot; and a question","postDate":"1239814316","msgId":39583,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3NGRmOWRjMDkwNDE1MDk1MWwzNDNmNGI4djFjMWI5NzZjZTkyZDlkMWJAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDQ5ZTVmY2M2LjIwMDE4ZTBhLjBkNDEuZmZmZjkxMzJAbXguZ29vZ2xlLmNvbT4=","referencesHeader":"PDU2MDM3MjExMy4yMzQzODQxMjM5Nzc3NDI1NDU0LkphdmFNYWlsLnJvb3RAc3owMTEwYS53ZXN0Y2hlc3Rlci5wYS5tYWlsLmNvbWNhc3QubmV0PgkgPDQ5ZTVmY2M2LjIwMDE4ZTBhLjBkNDEuZmZmZjkxMzJAbXguZ29vZ2xlLmNvbT4="},"prevInTopic":39581,"nextInTopic":39585,"prevInTime":39582,"nextInTime":39584,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"... I think honesty is good, so explaining your reasons were a good place to start.  Expecting him to understand and agree immediately that recreating school","messageBody":"<div id=\"ygrps-yiv-1703352169\"><blockquote><span title=\"ireply\">&gt; he said to me, &quot;When are we going to start homeschooling?&quot;<br/>\n&gt; I said, &quot;We already did. Today, you had reading, math, science,<br/>\n&gt; music appreciation...&quot;<br/>\n&gt; &quot;I didn&#39;t have math!&quot; he burst out. Meaning, he didn&#39;t do any work in<br/>\n&gt; the math workbooks I bought before I decided on unschooling.<br/>\n&gt; &quot;Sure you did. We played Monopoly and you were the banker.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I think honesty is good, so explaining your reasons were a good place to<br/>\nstart.  Expecting him to understand and agree immediately that recreating<br/>\nschool at home will not be allowed doesn&#39;t take his expections or needs for<br/>\nsecurity or safety into your lifestyle change.  He is stating a need and may<br/>\nhave to reassure himself he can add and subtract in a more formal manner; so<br/>\nwhether it is to do formal math or smash a toy car there is no need to<br/>\njudge.  If he self-directs and insists on a workbook for math why not give<br/>\nhim one or ask him to consider making up his own &quot;worksheets&quot;.  This is<br/>\nabout his comfort level, after all..  I am guessing you will end up watching<br/>\nthe pleasant surprize as his speed at problem solving increases .<br/>\n<br/>\nAlso, asking his opinion on what he feels comfortable doing might reveal his<br/>\nneed to wean from school slowly, why not honor that need?  If he wants to<br/>\nschedule time and work on &quot;Math&quot; in the way school presents math divorced<br/>\nfrom context, he may find his skills have appeared out of nowhere and when<br/>\nhe &quot;tests himself&quot; with the workbook will feel very confident about not<br/>\nneeding to decontextualize any discipline in order to learn it.<br/>\n<br/>\nMarina<br/>\n<br/>\n<br/>\n2009/4/15 Brad Holcomb &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:list.brad@...\">list.brad@...</a>&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Congrats on finding the Yes in situations. Believe me, it gets easier and<br/>\n&gt; easier and easier. Also, remember that a Yes will often be very different<br/>\n&gt; from the initial request. You&#39;ll get better at finding solutions, and he&#39;ll<br/>\n&gt; get better at finding them, too.<br/>\n&gt;<br/>\n&gt; &quot;I want to smash my toys&quot; could become freezing a big Tupperware container<br/>\n&gt; of water overnight to make a huge ice cube to be smashed, for example. Or,<br/>\n&gt; instead of just giving him a hammer and goggles, help him use a power drill<br/>\n&gt; or other tool to really mangle those Hot Wheels!! Many many many options,<br/>\n&gt; and you can be as involved as he wants you to be. Unschooling is extremely<br/>\n&gt; hands-on. Listen to your son, and look for the underlying desires,<br/>\n&gt; especially when he&#39;s wanting to do something that gives an instant &quot;Oh<br/>\n&gt; No!!&quot;<br/>\n&gt; reaction in you.<br/>\n&gt;<br/>\n&gt; &gt; he said to me, &quot;When are we going to start homeschooling?&quot;<br/>\n&gt; &gt; I said, &quot;We already did. Today, you had reading, math, science,<br/>\n&gt; &gt; music appreciation...&quot;<br/>\n&gt; &gt; &quot;I didn&#39;t have math!&quot; he burst out. Meaning, he didn&#39;t do any work in<br/>\n&gt; &gt; the math workbooks I bought before I decided on unschooling.<br/>\n&gt; &gt; &quot;Sure you did. We played Monopoly and you were the banker. You were<br/>\n&gt; adding<br/>\n&gt;<br/>\n&gt; &gt; and subtracting, budgeting and buying things, making change, and you were<br/>\n&gt;<br/>\n&gt; &gt; doing it all in your head, too.&quot;<br/>\n&gt;<br/>\n&gt; On deschooling:<br/>\n&gt; I don&#39;t know that he needs to know the terms &quot;unschooling&quot; or<br/>\n&gt; &quot;deschooling&quot;,<br/>\n&gt; or really anything about the process initially. The next time he asks &quot;when<br/>\n&gt; are we starting?&quot; tell him that since he stopped going to public school, he<br/>\n&gt; now gets a very long vacation to do whatever he wants...a summer break, if<br/>\n&gt; you will, or a long spring break. When you talked to him about<br/>\n&gt; math/reading/science/music appreciation, you were talking &quot;schoolish&quot;. You<br/>\n&gt; were all set to bring school into your home until recently, but now you&#39;re<br/>\n&gt; unschooling. Unschooling looks *nothing* like school or homeschool. Yes, I<br/>\n&gt; know it&#39;s considered a &quot;form&quot; of homeschooling. But arguing with your child<br/>\n&gt; to prove (to him? to yourself?) that he&#39;s still learning &quot;school stuff&quot; by<br/>\n&gt; playing Monopoly won&#39;t help you deschool. It not only stops deschooling in<br/>\n&gt; its tracks, but puts you back to square one. As in, due to that interaction<br/>\n&gt; yesterday, consider *today* your very first day of personal deschooling.<br/>\n&gt; Every time you slip into schoolish &quot;how is he learning math today?&quot;<br/>\n&gt; thinking, deschooling starts all over. If he was involved in the schoolish<br/>\n&gt; discussion, deschooling starts over from square one for him, too.<br/>\n&gt; Deschooling could take a matter of weeks/months, OR it could take many<br/>\n&gt; months/years, depending on how willing you are to just Let Go of the idea<br/>\n&gt; that kids need edumacation. Deschooling is about the parents questioning<br/>\n&gt; their own beliefs, in my mind. Don&#39;t think about deschooling your<br/>\n&gt; son--focus on you.<br/>\n&gt;<br/>\n&gt; What will help the most is just taking a break. A looooong break. Forget<br/>\n&gt; about school. Forget about math and &quot;music appreciation&quot;--what the heck is<br/>\n&gt; &quot;music appreciation&quot;, anyway, and who cares about that subject other than<br/>\n&gt; teachers who get paid to teach it? JUST PLAY! Play music on the stereo,<br/>\n&gt; loud, and dance. Get some bongos and go crazy. Get him some drumsticks so<br/>\n&gt; he can bang on things (inside and outside).<br/>\n&gt;<br/>\n&gt; To borrow Diana Jenner&#39;s thinking on this (gawd, this has been so helpful<br/>\n&gt; to<br/>\n&gt; me): What would your life look like if your son had an incurable disease<br/>\n&gt; that will probably mean death in 2009? How would your days look if your<br/>\n&gt; only goals were to connect with him and hear his desires and feed them by<br/>\n&gt; playing with him and helping him play...to help him enjoy life to the<br/>\n&gt; fullest?<br/>\n&gt;<br/>\n&gt; Just tell him he&#39;s on break, and have fun!!! -=b.<br/>\n&gt;<br/>\n&gt; --<br/>\n&gt; Brad in Boulder, CO<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://holcombs.org\">http://holcombs.org</a><br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>-- <br/>\nAn ordinary person will save the world by living as though she can<br/>\n.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":291997784,"authorName":"Brad Holcomb","from":"&quot;Brad Holcomb&quot; &lt;list.brad@...&gt;","profile":"bholcomb48","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Our first &quot;yes&quot; and a question","postDate":"1239809212","msgId":39581,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5ZTVmY2M2LjIwMDE4ZTBhLjBkNDEuZmZmZjkxMzJAbXguZ29vZ2xlLmNvbT4=","inReplyToHeader":"PDU2MDM3MjExMy4yMzQzODQxMjM5Nzc3NDI1NDU0LkphdmFNYWlsLnJvb3RAc3owMTEwYS53ZXN0Y2hlc3Rlci5wYS5tYWlsLmNvbWNhc3QubmV0Pg==","referencesHeader":"PDU2MDM3MjExMy4yMzQzODQxMjM5Nzc3NDI1NDU0LkphdmFNYWlsLnJvb3RAc3owMTEwYS53ZXN0Y2hlc3Rlci5wYS5tYWlsLmNvbWNhc3QubmV0Pg=="},"prevInTopic":39580,"nextInTopic":39583,"prevInTime":39580,"nextInTime":39582,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"Congrats on finding the Yes in situations.  Believe me, it gets easier and easier and easier.  Also, remember that a Yes will often be very different from the","messageBody":"<div id=\"ygrps-yiv-915183054\">Congrats on finding the Yes in situations.  Believe me, it gets easier and<br/>\neasier and easier.  Also, remember that a Yes will often be very different<br/>\nfrom the initial request.  You&#39;ll get better at finding solutions, and he&#39;ll<br/>\nget better at finding them, too.<br/>\n<br/>\n&quot;I want to smash my toys&quot; could become freezing a big Tupperware container<br/>\nof water overnight to make a huge ice cube to be smashed, for example.  Or,<br/>\ninstead of just giving him a hammer and goggles, help him use a power drill<br/>\nor other tool to really mangle those Hot Wheels!!  Many many many options,<br/>\nand you can be as involved as he wants you to be.  Unschooling is extremely<br/>\nhands-on.  Listen to your son, and look for the underlying desires,<br/>\nespecially when he&#39;s wanting to do something that gives an instant &quot;Oh No!!&quot;<br/>\nreaction in you.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; he said to me, &quot;When are we going to start homeschooling?&quot; <br/>\n&gt; I said, &quot;We already did. Today, you had reading, math, science, <br/>\n&gt; music appreciation...&quot; <br/>\n&gt; &quot;I didn&#39;t have math!&quot; he burst out. Meaning, he didn&#39;t do any work in <br/>\n&gt; the math workbooks I bought before I decided on unschooling. <br/>\n&gt; &quot;Sure you did. We played Monopoly and you were the banker. You were adding<br/>\n<br/>\n&gt; and subtracting, budgeting and buying things, making change, and you were <br/>\n&gt; doing it all in your head, too.&quot;<br/>\n<br/>\n </span></blockquote>On deschooling:<br/>\nI don&#39;t know that he needs to know the terms &quot;unschooling&quot; or &quot;deschooling&quot;,<br/>\nor really anything about the process initially.  The next time he asks &quot;when<br/>\nare we starting?&quot; tell him that since he stopped going to public school, he<br/>\nnow gets a very long vacation to do whatever he wants...a summer break, if<br/>\nyou will, or a long spring break.  When you talked to him about<br/>\nmath/reading/science/music appreciation, you were talking &quot;schoolish&quot;.  You<br/>\nwere all set to bring school into your home until recently, but now you&#39;re<br/>\nunschooling.  Unschooling looks *nothing* like school or homeschool.  Yes, I<br/>\nknow it&#39;s considered a &quot;form&quot; of homeschooling.  But arguing with your child<br/>\nto prove (to him?  to yourself?) that he&#39;s still learning &quot;school stuff&quot; by<br/>\nplaying Monopoly won&#39;t help you deschool.  It not only stops deschooling in<br/>\nits tracks, but puts you back to square one.  As in, due to that interaction<br/>\nyesterday, consider *today* your very first day of personal deschooling.<br/>\nEvery time you slip into schoolish &quot;how is he learning math today?&quot;<br/>\nthinking, deschooling starts all over.  If he was involved in the schoolish<br/>\ndiscussion, deschooling starts over from square one for him, too.<br/>\nDeschooling could take a matter of weeks/months, OR it could take many<br/>\nmonths/years, depending on how willing you are to just Let Go of the idea<br/>\nthat kids need edumacation.  Deschooling is about the parents questioning<br/>\ntheir own beliefs, in my mind.  Don&#39;t think about deschooling your<br/>\nson--focus on you.<br/>\n<br/>\nWhat will help the most is just taking a break.  A looooong break.  Forget<br/>\nabout school.  Forget about math and &quot;music appreciation&quot;--what the heck is<br/>\n&quot;music appreciation&quot;, anyway, and who cares about that subject other than<br/>\nteachers who get paid to teach it?  JUST PLAY!  Play music on the stereo,<br/>\nloud, and dance.  Get some bongos and go crazy.  Get him some drumsticks so<br/>\nhe can bang on things (inside and outside).<br/>\n<br/>\nTo borrow Diana Jenner&#39;s thinking on this (gawd, this has been so helpful to<br/>\nme):  What would your life look like if your son had an incurable disease<br/>\nthat will probably mean death in 2009?  How would your days look if your<br/>\nonly goals were to connect with him and hear his desires and feed them by<br/>\nplaying with him and helping him play...to help him enjoy life to the<br/>\nfullest?<br/>\n<br/>\nJust tell him he&#39;s on break, and have fun!!! -=b.<br/>\n<br/>\n<br/>\n--<br/>\nBrad in Boulder, CO<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://holcombs.org\">http://holcombs.org</a></div>","specialLinks":[]},{"userId":240684971,"authorName":"pellegrina@comcast.net","from":"pellegrina@...","profile":"elysgrl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Our first &quot;yes&quot; and a question","postDate":"1239777425","msgId":39580,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU2MDM3MjExMy4yMzQzODQxMjM5Nzc3NDI1NDU0LkphdmFNYWlsLnJvb3RAc3owMTEwYS53ZXN0Y2hlc3Rlci5wYS5tYWlsLmNvbWNhc3QubmV0Pg=="},"prevInTopic":0,"nextInTopic":39581,"prevInTime":39579,"nextInTime":39581,"topicId":39580,"numMessagesInTopic":0,"msgSnippet":"Hi everyone-- This is my first post since my intro a couple weeks ago. I ve been reading like a fiend and learning so much! My son Logan, 7, had his last day","messageBody":"<div id=\"ygrps-yiv-1483210800\">Hi everyone-- <br/>\n<br/>\n<br/>\n<br/>\nThis is my first post since my intro a couple weeks ago. I&#39;ve been reading like a fiend and learning so much! My son Logan, 7, had his last day of public school a week ago, so we&#39;re now &quot;official&quot; unschoolers. <br/>\n<br/>\n<br/>\n<br/>\nI had read that it&#39;s not a great idea to make any grand pronouncements, to just start gently by saying &quot;yes&quot; more. So the first question that tested me--&quot;Hey, Mom, now that we&#39;re homeschooling, can I get a mohawk?&quot;--I said &quot;yes&quot;. In the very recent past, this would have been an instant knee-jerk &quot;no.&quot; I would have been worried about what people would think--of ME. But it&#39;s his head, right? We got some weird looks on Easter, but he actually looks pretty cool. I gotta admit, I kind of admire the fact that he&#39;s self-possessed enough at 7 to just let his freak flag fly. :) <br/>\n<br/>\n<br/>\n<br/>\nThat first &quot;yes&quot; felt really really good, and soon another opportunity presented itself: &quot;Mom, can I go outside and smash some of my Hot Wheels with a hammer?&quot; First, knee-jerk reaction was &quot;No! I paid good money for those cars! Plus you&#39;ll smash your finger or shoot your eye out with flying hot wheel shards! Why would you want to do something so destructive anyway?&quot; <br/>\n<br/>\n<br/>\n<br/>\nBut I only said that in my head. In reality, I took a deep breath, handed him a hammer and some safety goggles, and said, &quot;Sure.&quot; He literally did a double-take. &quot;Really??&quot; &quot;Sure, why not? You&#39;ve got like 400 of them. You can spare a few.&quot; I watched him through the window. He was so happy! Every so often he&#39;d run in and proudly show me a particularly mangled one. <br/>\n<br/>\n<br/>\n<br/>\nSo, the baby steps are going well so far. My question involves DEschooling, I suppose. Today, after what I thought was a particularly unschoolish day--we played the Wii together, we ran some errands, went to the library, read some books, played Monopoly, made dinner, watched American Idol (go Adam!)--he said to me, &quot;When are we going to start homeschooling?&quot; <br/>\n<br/>\n<br/>\n<br/>\nI said, &quot;We already did. Today, you had reading, math, science, music appreciation...&quot; <br/>\n<br/>\n<br/>\n<br/>\n&quot;I didn&#39;t have math!&quot; he burst out. Meaning, he didn&#39;t do any work in the math workbooks I bought before I decided on unschooling. <br/>\n<br/>\n<br/>\n<br/>\n&quot;Sure you did. We played Monopoly and you were the banker. You were adding and subtracting, budgeting and buying things, making change, and you were doing it all in your head, too.&quot; <br/>\n<br/>\n<br/>\n<br/>\nHe looked doubtful, very, very doubtful, kind of like he&#39;s wondering if Mom has any clue what she&#39;s doing after all. I told him we&#39;d talk about it tomorrow, that I was trying something a little different called unschooling. <br/>\n<br/>\n<br/>\n<br/>\nSo...any advice on what I should tell him at this point? It&#39;s clear that he has certain expectations that involve me acting more like a teacher. I thought I&#39;d start by asking him what he&#39;s been expecting homeschooling to be like, what he wants it to be like, and go from there. I would love to hear from anyone that made the transition from structured or public school to unschooling, and how I might help Logan ease into the idea, without making it seem like some big, scary, life-changing thing right off the bat (even though I am very cognizant of the fact that it may well turn out to be all of those things!) <br/>\n<br/>\n<br/>\n<br/>\nThank you so much in advance for any and all advice, and if there&#39;s anything naively un-unschoolish in my post, I&#39;m sure you&#39;ll let me know. :) <br/>\n<br/>\nDenise <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":39654,"nextTopicId":39685}}