{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":16,"messages":[{"userId":136944076,"authorName":"Jenna Robertson","from":"Jenna Robertson &lt;mamamole@...&gt;","profile":"Mamamole","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"re-enrolled - was: First day of unschooling","postDate":"1252537774","msgId":41279,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyMDM1NC4yODU0My5xbUB3ZWI2NTcxMS5tYWlsLmFjNC55YWhvby5jb20+","inReplyToHeader":"PEI1QjlCOEMyRjkwNjQ5NkJCMTRBQTJGNjkwOEUxRDE4QHlvdXJxOTRianZ0bDByPg=="},"prevInTopic":41274,"nextInTopic":0,"prevInTime":41278,"nextInTime":41280,"topicId":41214,"numMessagesInTopic":0,"msgSnippet":"My middle daughter re-enrolled in school today.  I want to thank everyone on this list who took the time to respond and post links.  It was a huge struggle","messageBody":"<div id=\"ygrps-yiv-1713309565\">My middle daughter re-enrolled in school today.  I want to thank everyone on this list who took the time to respond and post links.  It was a huge struggle for me to let go of my idea of our new life together and accept her choice.  I had worked so hard to embrace unschooling, and to separate myself mentally and emotionally from the school (where I&#39;ve been very involved for 6 years) that it was hard to shift gears.<br/>\n <br/>\nI can say that while I still wish she was staying home w/ us, I am now fairly at peace w/ the situation.  She was able to get into the class w/ her teacher from last year who she loves and who is a family friend.  He sees the wonderful qualities our daughter has and supports her in being herself (as much as is possible in the classroom....)  We appreciate his and the Principal&#39;s willingness to put Clare in his class since it was the largest class in the grade so she should have been placed in one of the other classes.<br/>\n <br/>\nClare and I have talked about how this is her choice and I&#39;ll do my best to support her decisions at school (regarding homework/work/activities) just as I&#39;m trying to support her decisions at home.  <br/>\n <br/>\nMy other two daughters still hope that Clare will eventually decide to stay home w/ us, some day.  My youngest is fairly sad that her sister won&#39;t be home to keep her company.   <br/>\n <br/>\nThank you to everyone who helped make this day easier for me, and in turn for Clare because her mother could actually be supportive and understanding (eventually).<br/>\n <br/>\n:)<br/>\nJenna <br/>\n <br/>\n <br/>\n <br/>\n&quot;If I had influence with the good fairy who is supposed to preside over the christening of all children, I would ask that her gift to each child in the world be a sense of wonder so indestructible that it would last throughout life.&quot; <br/>\n               - Rachel Carson <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":362437716,"authorName":"Paul & Camille","from":"&quot;Paul & Camille&quot; &lt;morlingfamily@...&gt;","profile":"campaulmace","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] First day of unschooling","postDate":"1252285305","msgId":41274,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI1QjlCOEMyRjkwNjQ5NkJCMTRBQTJGNjkwOEUxRDE4QHlvdXJxOTRianZ0bDByPg==","referencesHeader":"PDU5NDkzNy41OTgyNS5xbUB3ZWI2NTcwMS5tYWlsLmFjNC55YWhvby5jb20+IDxFRUZGMDhFNzZENkE0QjEyOUFEQTJBQkMxRTJDRkM3REB5b3VycTk0Ymp2dGwwcj4gPDQwNjBBN0I1LTU2QUMtNEQxRS1BMkMxLTgyMENBNjQ0Qjg5QUB2ZXJpem9uLm5ldD4gPEREQUY1NEUzNkZDODREMjY4REM5RUVCMEMxQThFQkIwQHlvdXJxOTRianZ0bDByPiA8MUQyNDdEOTItOTNBNC00OEQ2LThBRUQtRDIyODBGMEU0NTEyQHZlcml6b24ubmV0Pg=="},"prevInTopic":41271,"nextInTopic":41279,"prevInTime":41273,"nextInTime":41275,"topicId":41214,"numMessagesInTopic":0,"msgSnippet":"Thankyou Joyce, I will look up those websites and have a search as you suggested. Thankyou for the time you took to help with some solutions - and yes I dont","messageBody":"<div id=\"ygrps-yiv-1699154999\">Thankyou Joyce,<br/>\n<br/>\nI will look up those websites and have a search as you suggested.  <br/>\n<br/>\nThankyou for the time you took to help with some solutions - and yes I dont want to try and teach her - she cant and wont learn unless she wants too - now that shouldnt be a surprise should it ;)<br/>\n<br/>\nBlessings,  Camille <br/>\n   <br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":220041937,"authorName":"Heather","from":"Heather &lt;hbmccarty@...&gt;","profile":"heathermccarty1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: First day of unschooling/school choice link","postDate":"1252240489","msgId":41271,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBQTNBQzY5LjgwNzAxMDFAdHdjbnkucnIuY29tPg==","inReplyToHeader":"PGg3cnRwYStyb3M2QGVHcm91cHMuY29tPg==","referencesHeader":"PGg3cnRwYStyb3M2QGVHcm91cHMuY29tPg=="},"prevInTopic":41270,"nextInTopic":41274,"prevInTime":41270,"nextInTime":41272,"topicId":41214,"numMessagesInTopic":0,"msgSnippet":"http://www.sandradodd.com/schoolchoice This page IS helpful - I have revisited it lately, again. My kids both have been intererested in school on and off and","messageBody":"<div id=\"ygrps-yiv-1980695473\"><a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com/schoolchoice\">http://www.sandradodd.com/schoolchoice</a><br/>\n<br/>\nThis page IS helpful - I have revisited it lately, again. My kids both <br/>\nhave been intererested in school on and off and my son, 16, is finally <br/>\ntrying it out this fall. Sorting through all my strong feelings on it <br/>\nhas been challenging but absolutely essential for getting to a place <br/>\nfrom which I can help him make the best decision for him. I am kind of <br/>\nlooking forward to it, now, as I am just really curious. He starts this <br/>\nWednesday at a brand new charter school. I am just looking at it as one <br/>\nof many many choices he could make of things to do out there in the <br/>\nworld. My kids focus as unschoolers as they approached the teen years <br/>\nhas been to be out there in the world, more than staying at home. As <br/>\nschool is the main one for people their age- it seems logical that they <br/>\nwould want to choose it at some point, just to see. <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com/schoolchoice\">http://www.sandradodd.com/schoolchoice</a>&gt;<br/>\n<br/>\nAlso we have been talking some about kids who choose school at the <br/>\nrun.ning, if you&#39;d like to join us there.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://familyrun.ning.com/group/choosingschool\">http://familyrun.ning.com/group/choosingschool</a><br/>\n<br/>\nHeather (in NY)<br/>\n<br/>\nplaidpanties666 wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;  <br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; You might want to read over at Sandra&#39;s site (sorry my computer is <br/>\n&gt; clunky at the moment, so my links aren&#39;t accessible) on the topic of <br/>\n&gt; school choice and also giftedness for more thoughts in those two areas.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a>?subject=&gt;<br/>\n&gt; .<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] First day of unschooling","postDate":"1252239364","msgId":41270,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFEMjQ3RDkyLTkzQTQtNDhENi04QUVELUQyMjgwRjBFNDUxMkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEREQUY1NEUzNkZDODREMjY4REM5RUVCMEMxQThFQkIwQHlvdXJxOTRianZ0bDByPg==","referencesHeader":"PDU5NDkzNy41OTgyNS5xbUB3ZWI2NTcwMS5tYWlsLmFjNC55YWhvby5jb20+IDxFRUZGMDhFNzZENkE0QjEyOUFEQTJBQkMxRTJDRkM3REB5b3VycTk0Ymp2dGwwcj4gPDQwNjBBN0I1LTU2QUMtNEQxRS1BMkMxLTgyMENBNjQ0Qjg5QUB2ZXJpem9uLm5ldD4gPEREQUY1NEUzNkZDODREMjY4REM5RUVCMEMxQThFQkIwQHlvdXJxOTRianZ0bDByPg=="},"prevInTopic":41251,"nextInTopic":41271,"prevInTime":41269,"nextInTime":41271,"topicId":41214,"numMessagesInTopic":0,"msgSnippet":"... Yes, it s a book but I think it would be more useful if she were around since it s a lot about changing a parent s perspective to be more open to living","messageBody":"<div id=\"ygrps-yiv-448647827\">On Sep 4, 2009, at 6:17 PM, Paul & Camille wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is Guerrilla Learning you mentioned the book? Do you think it would  <br/>\n&gt; be helpful for me to get it?<br/>\n<br/>\n </span></blockquote>Yes, it&#39;s a book but I think it would be more useful if she were  <br/>\naround since it&#39;s a lot about changing a parent&#39;s perspective to be  <br/>\nmore open to living and learning to avoid reinforcing the pervasive  <br/>\nmessage that school is the be all and end all of learning.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Even though she doesnt live at home anymore she still texts or  <br/>\n&gt; calls me whenever she is going to make a decision to run it by me,  <br/>\n&gt; e.g moving house, buying/selling a car, jobs, going away, anything  <br/>\n&gt; - and to be honest to get my approval!!! I cant figure this out, as  <br/>\n&gt; I help her as much as I can but leave the decision to her - as its  <br/>\n&gt; her life. She has been like that since leaving school - as though  <br/>\n&gt; she doesnt have the confidence or doesnt believe she has the skills  <br/>\n&gt; to make decisions herself, only follow the rules.<br/>\n<br/>\n </span></blockquote>It&#39;s a pretty pervasive message in school that kids need to sit down,  <br/>\nshut up and they&#39;ll be given all the things they need to begin life.  <br/>\nHow much kids buy into that depends on their personality.<br/>\n<br/>\n<br/>\n<br/>\nI suspect what&#39;s happening is that, when faced with a decision, she  <br/>\nfeels like there&#39;s a hundred important factors to consider and  <br/>\ndoesn&#39;t know what to do with them all. She probably just gets  <br/>\noverwhelmed by them all clamoring for attention. Or maybe she never  <br/>\neven gets to the point where the factors are clear. It might remain a  <br/>\nvague idea that there&#39;s so much to consider and she&#39;s going to miss  <br/>\nstuff if she even tries to think about it.<br/>\n<br/>\n<br/>\n<br/>\nMaybe you could ask more questions to help her draw out what she  <br/>\nreally wants. Help her start analyzing the situation rather than  <br/>\ndoing it for her.<br/>\n<br/>\n<br/>\n<br/>\nIf you search on decision making techniques, you&#39;ll find a lot of  <br/>\nstrategies you could use to ask questions and help her sort out the  <br/>\njumble. The first two have short overviews and the last links to more  <br/>\nin depth discussion of the techniques.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.life123.com/health/self-improvement/decision-making/\">http://www.life123.com/health/self-improvement/decision-making/</a> <br/>\ndecision-making-techniques.shtml<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://blog.potterzot.com/decision-making-techniques/\">http://blog.potterzot.com/decision-making-techniques/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mindtools.com/pages/main/newMN_TED.htm\">http://www.mindtools.com/pages/main/newMN_TED.htm</a><br/>\n<br/>\n<br/>\n<br/>\nSeems to me someone mentioned a problem solving or decision making  <br/>\nbook for kids that might have some approaches so it doesn&#39;t sound  <br/>\nlike you&#39;re trying to teach her ;-) If you search in the archives for  <br/>\n&quot;problem solving&quot; or &quot;decision making&quot; book, something might pop up.<br/>\n<br/>\n<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":365960144,"authorName":"Maria Kirk","from":"Maria Kirk &lt;mariakirk888@...&gt;","profile":"mariakirk888","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] First day of unschooling","postDate":"1252109449","msgId":41251,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyOTQwOC42MDUzMS5xbUB3ZWI0NjAxMi5tYWlsLnNwMS55YWhvby5jb20+","inReplyToHeader":"PDU5NDkzNy41OTgyNS5xbUB3ZWI2NTcwMS5tYWlsLmFjNC55YWhvby5jb20+"},"prevInTopic":41249,"nextInTopic":41270,"prevInTime":41250,"nextInTime":41252,"topicId":41214,"numMessagesInTopic":0,"msgSnippet":"Hi Jenna, y daughter is 13, and last month she thought she wanted to go back to school this year after cutting short the last one (she decided in the middle of","messageBody":"<div id=\"ygrps-yiv-342523445\">Hi Jenna,<br/>\ny daughter is 13, and last month she thought she wanted to go back to school this year after cutting short the last one (she decided in the middle of the year that she wanted to stay at home and sleep in, which she did, and really enjoys it). Now after telling me that she wanted to skip this year, and start new at the highschool level, she is mostly decided in not going to school at all after all, ever again, only of course in the future to take college classes if she gets interested in a particular subject. What I started to do is her chores without announcing it, I just get ahead of her in putting the dishes away in my natural joyful way, and so she feels no ackwardness or anything like that. She just feel very welcome staying on bed as long as she wants, reading on her bed, drawing, and now writing as much as she is inspired to do so. I do nothing to stop her or start her on anything, not even to joing us at the table when we are ready for dinner, but<br/>\n I provide always for her, and let her know that anytime that she is ready to eat, her meal will be waiting for her. This has been working so fine that the time spent in the computer, and with the wii has been little by little been replace by watching movies together in the daytime, and with my 11 year ald son. She is looking forward to the conference next week to meet more teens so, for this reason she decided to unschool as well, but now I know that mainly because she knows now that she can do with her time what she really wants, and that really gets her inspired. I know that if we really show them a better quality of attention, they start getting in their own groove, and less and less they need us, and more and more they actually want to be around us. It&#39;s not the quantity of time that matters in any path, but the quality. The unconditional love, and respect is what touches us the most as individuals, and if we are not getting it we should ask<br/>\n ourselves why. I love this quote from Gandhi, &quot;Be the change you want to see in the world&quot;. Let us be the change we want to see in our children. Let&#39;s go deeper within, to perceive the new world without. <br/>\n <br/>\nTrusting this would help,<br/>\n <br/>\nMaria.<br/>\n <br/>\nMaria Kirk    <br/>\n858-776-5629<br/>\n    <br/>\n“When words are scarce they are seldom spent in vain” <br/>\nWilliam Shakespeare.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Wed, 9/2/09, Jenna Robertson &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamamole@...\">mamamole@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: Jenna Robertson &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamamole@...\">mamamole@...</a>&gt;<br/>\nSubject: [unschoolingbasics] First day of unschooling<br/>\nTo: &quot;Unschooling Basics&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nDate: Wednesday, September 2, 2009, 5:21 PM<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\nI don&#39;t actually view this as our first day of unschooling, but it&#39;s the first day of school for our district.  My almost 10 year old daughter has been in a total rage about not going back to school since yesterday afternoon.  She has had mixed feelings about unschooling, but she was also the one who complained the most about going to school, schoolwork, homework, and all the social crap.  She tends to be very passionate and expresses her emotions dramatically - has all her life.  <br/>\n <br/>\n <br/>\nRight now she&#39;s demanding that she be able to go back to school.  She says, rightly, that we said she could choose what she does.  However, she&#39;s never know anything but school, change is hard and scary, she&#39;s feeling left out of &quot;normal life&quot; and I truly believe that unschooling will be great for her if she&#39;d give it a chance.<br/>\n <br/>\nWe are trying Very hard to be patient.  But she&#39;s not willing to discuss things rationally at this point so we can&#39;t get past the &quot;I want to go to school NOW!&quot; part.  We&#39;ve been struggling as parents to be unconditional w/ her because she seems to want us to set limits and get angry.  Obviously she&#39;s most likely testing to see what we&#39;ll do, and honestly we feel like we fail at being patient and understanding way too often, which makes feel like perhaps this just isn&#39;t working for this child and us as parents.  It&#39;s working great w/ the oldest and o.k. w/ the youngest.<br/>\n <br/>\nI&#39;m taking them to a park we love to make s&#39;mores and play in the river today - feels like a total bribe or something now instead of the joyful celebration of our freedom I&#39;d planned. <br/>\n <br/>\nI also feel like the other two girls aren&#39;t getting to express or experience their own emotions related to not going back to school (not to mention mine!) because the middle one is expressing hers so much.  <br/>\n <br/>\nI appreciated Meredith&#39;s assurance that her stepson found he didn&#39;t miss school.  I&#39;m just wondering if we can give this a go long enough for my daughter to realize she enjoys it and doesn&#39;t miss school because she&#39;s so determined to go back to school w/out even seeing how it feels not to go to school.  On the other hand, she has had a few moments where she&#39;s more rational and says that she&#39;ll give it a try, but those moments pass quickly and she&#39;s back to yelling.  Yes, I want her to choose, but I feel like school is a conditioned response - brainwashing - something that is such a societal norm that it may be too hard for her to choose not to go even if that really is best for her at this point.<br/>\n <br/>\nHave any of you had to keep very busy at first to fill the void of school?  I hear about kids wanting to play video games or watch TV/movies, but do some kids need what seems to amount to distracting them from the lure of school?<br/>\n <br/>\n:)<br/>\nJenna<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n&quot;If I had influence with the good fairy who is supposed to preside over the christening of all children, I would ask that her gift to each child in the world be a sense of wonder so indestructible that it would last throughout life.&quot; <br/>\n               - Rachel Carson <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":362437716,"authorName":"Paul & Camille","from":"&quot;Paul & Camille&quot; &lt;morlingfamily@...&gt;","profile":"campaulmace","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] First day of unschooling","postDate":"1252102643","msgId":41249,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEREQUY1NEUzNkZDODREMjY4REM5RUVCMEMxQThFQkIwQHlvdXJxOTRianZ0bDByPg==","referencesHeader":"PDU5NDkzNy41OTgyNS5xbUB3ZWI2NTcwMS5tYWlsLmFjNC55YWhvby5jb20+IDxFRUZGMDhFNzZENkE0QjEyOUFEQTJBQkMxRTJDRkM3REB5b3VycTk0Ymp2dGwwcj4gPDQwNjBBN0I1LTU2QUMtNEQxRS1BMkMxLTgyMENBNjQ0Qjg5QUB2ZXJpem9uLm5ldD4="},"prevInTopic":41241,"nextInTopic":41251,"prevInTime":41248,"nextInTime":41250,"topicId":41214,"numMessagesInTopic":0,"msgSnippet":"Thankyou Joyce, I do believe she was totally changed by school.  She was always one of those children that followed the rules to the letter when at school, and","messageBody":"<div id=\"ygrps-yiv-1428420899\">Thankyou Joyce,<br/>\n<br/>\nI do believe she was totally changed by school.  She was always one of those children that followed the rules to the letter when at school, and now she doesnt seem to be confident in herself.  Its like she learnt to live by rules and now without someone telling her what to do she doesnt know what to do.<br/>\n<br/>\nEven though she doesnt live at home anymore she still texts or calls me whenever she is going to make a decision to run it by me, e.g moving house, buying/selling a car, jobs, going away, anything - and to be honest to get my approval!!!  I cant figure this out, as I help her as much as I can but leave the decision to her - as its her life.  She has been like that since leaving school - as though she doesnt have the confidence or doesnt believe she has the skills to make decisions herself, only follow the rules.  Of course noone else can make the right decision for her.  Ive found that as long as I think its okay, she will just bound into it.  This of course has left her open to being used and abused by friends, who are that way inclined.<br/>\n<br/>\nI am always looking for ways to help her but really am unsure how too.  Is Guerrilla Learning you mentioned the book?  Do you think it would be helpful for me to get it?  Any advice would be greatly appreciated, thanks.  The aftermath of school - being a learner not a thinker, and I believe as you say many many of us are like that.  Im so glad that my youngest will not be going to school - he is such a thinker that it makes my head spin :)<br/>\n<br/>\nBlessings,  Camille<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Joyce Fetteroll <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Friday, September 04, 2009 12:00 AM<br/>\n  Subject: Re: [unschoolingbasics] First day of unschooling<br/>\n<br/>\n<br/>\n    <br/>\n  On Sep 2, 2009, at 7:22 PM, Paul & Camille wrote:<br/>\n<br/>\n  &gt; She attended regular school for the record and maybe things would <br/>\n  &gt; have been alot different for her had she stayed home.<br/>\n<br/>\n  This is important information when sharing about kids on an <br/>\n  unschooling list! If what unschoolers are doing has no effect on <br/>\n  kids, then we might as well send them to school and explore our own <br/>\n  interests outside the family.<br/>\n<br/>\n  &gt; Letting her do as she wanted in her case didnt help<br/>\n  &gt;<br/>\n<br/>\n  For at least 12 years she didn&#39;t get to do as she wanted so it&#39;s not <br/>\n  surprising that a little taste of freedom isn&#39;t enough. New <br/>\n  unschoolers are advised that it takes at least one month for each <br/>\n  month in school to deschool. And those months need to be consecutive <br/>\n  so moms need to restart the deschooling clock if they slip back into <br/>\n  schoolish ways. (I&#39;m betting there parents here who are still <br/>\n  suffering from the aftereffects of school because they never got to <br/>\n  spend a whole year just chilling. Some of the damage never really <br/>\n  goes away.)<br/>\n<br/>\n  When food or TV is controlled, it&#39;s not uncommon for kids to binge <br/>\n  when given freedom. (And why saying yes more rather than &quot;Have at <br/>\n  it!&quot; is more useful advice! ;-) Having hours not only controlled by <br/>\n  school, but having society denigrate off hours spent exploring topics <br/>\n  that aren&#39;t &quot;worthy&quot; of time, are all like prison bars. We accept all <br/>\n  that control as common and the way life is, but once someone has <br/>\n  stepped far away from school, it&#39;s shocking how much it feels like <br/>\n  living in a box where you can interact only with what is given to you <br/>\n  and are judged on your choices whenever you venture outside of the box.<br/>\n<br/>\n  Just because school is common and pervasive doesn&#39;t mean it isn&#39;t <br/>\n  damaging. It&#39;s probably a rare person who isn&#39;t changed from how they <br/>\n  would have been if they&#39;d been unschooled.<br/>\n<br/>\n  You can&#39;t turn back the clock to change her past, but you can change <br/>\n  her right now life. If she&#39;s still living in the house, Guerilla <br/>\n  Learning might have some ways you can help her explore her interests <br/>\n  and find ways to chill. It could be she feels pressure to start being <br/>\n  an adult because of her age but never got the chance to be free to do <br/>\n  &quot;nothing&quot;. (Which for unschooled kids is always something even if it <br/>\n  looks like nothing from the outside. Even for schooled kids nothing <br/>\n  is always something, but quite often is recovery from the pressure of <br/>\n  school.) Can you take some time out to explore with her some <br/>\n  interests that have *no* ulterior motive (like mind improvement, <br/>\n  better job skills) for being done? Things that may be totally outside <br/>\n  her usual interests. Or deeper involvement in some of her interests?<br/>\n<br/>\n  Joyce<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: First day of unschooling","postDate":"1252096618","msgId":41241,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3cnRwYStyb3M2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQzNTI5LjczOTEzLnFtQHdlYjY1NzA1Lm1haWwuYWM0LnlhaG9vLmNvbT4="},"prevInTopic":41234,"nextInTopic":41249,"prevInTime":41240,"nextInTime":41242,"topicId":41214,"numMessagesInTopic":0,"msgSnippet":"... ********************* It much more important to consider how your dd would feel about the class than its... hmmm, level of academic achievement, if you see","messageBody":"<div id=\"ygrps-yiv-2049664777\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Jenna Robertson &lt;mamamole@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;The other has a 3rd and 4th combined, and while I have experience w/ her as a teacher and think she&#39;s great, the class would be a bad fit for my oldest in the 4th grade class &quot;gifted&quot; daughter since it&#39;s already differentiated downward, not up.<br/>\n </span></blockquote>*********************<br/>\n<br/>\nIt much more important to consider how your dd would feel about the class than its... hmmm, level of academic achievement, if you see what I mean. If that&#39;s an issue for your daughter, that&#39;s one thing. But if the teacher is someone she&#39;ll like and the class seems like its an adequate fit, socially (if its even possible to tell) than that&#39;s a good reason for her to be there, if she wants to be in school. The more you can get away from thinking in schoolish terms, even when dealing with school itself, the better chance you&#39;ll have of helping your dd meet her needs and figure out what she wants to do and where she wants to be! <br/>\n<br/>\nYou might want to read over at Sandra&#39;s site (sorry my computer is clunky at the moment, so my links aren&#39;t accessible) on the topic of school choice and also giftedness for more thoughts in those two areas. <br/>\n<br/>\n---Meredith (Mo 8, Ray 15)</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: First day of unschooling","postDate":"1252020838","msgId":41233,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3cGpwNitxcG01QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQzMTA5OS44NTgzNy5xbUB3ZWIzOTUwNC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":41230,"nextInTopic":41234,"prevInTime":41232,"nextInTime":41234,"topicId":41214,"numMessagesInTopic":0,"msgSnippet":"... **************************** Maybe it would help you to start a big project of your own - start a new hobby or set yourself a research project. Give","messageBody":"<div id=\"ygrps-yiv-1599607156\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Jacquie Krauskopf &lt;home_maker97@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;    My son is 9 now and we are trying unschooling for the first time. He is so happy at how we are getting along. I however, get nervous. I feel like i am on a tightrope and someone greased it and removed the net below! I hope this works it is so much more relaxed to do then school at home.<br/>\n </span></blockquote>****************************<br/>\n<br/>\nMaybe it would help you to start a big project of your own - start a new hobby or set yourself a research project. Give yourself something to focus on besides your son. If your used to doing school at home then some of the unsettled feeling is coming from you needing something else to do with all the time and energy that went into school at home. If you did a lot of planning and organizing for that, look for something new to plan and to organize.<br/>\n<br/>\nIts also a good idea to keep in mind that this is a transition that&#39;s affecting everyone in the family - so You&#39;re transitioning too. How do you deal with transitions? What works for you to help you be relatively balanced in a time of uncertainty? Look for things you can do for yourself, to take care of yourself. When you get ants in the pants, remind yourself that its a transition! Its taking you time to get used to a new way of being. <br/>\n<br/>\n---Meredith (Mo 8, Ray 15)</div>","specialLinks":[]},{"userId":136944076,"authorName":"Jenna Robertson","from":"Jenna Robertson &lt;mamamole@...&gt;","profile":"Mamamole","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] First day of unschooling","postDate":"1252020798","msgId":41234,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzNTI5LjczOTEzLnFtQHdlYjY1NzA1Lm1haWwuYWM0LnlhaG9vLmNvbT4=","inReplyToHeader":"PDJGQUVCRTkxLTY4QkYtNDUwRC1CRjI3LTMwQUE1MjNBREJDQUB2ZXJpem9uLm5ldD4="},"prevInTopic":41233,"nextInTopic":41241,"prevInTime":41233,"nextInTime":41235,"topicId":41214,"numMessagesInTopic":0,"msgSnippet":"Thank you to everyone for sharing about your person experiences :).   We are still struggling and things have gotten even more complicated because I said I d","messageBody":"<div id=\"ygrps-yiv-628560343\">Thank you to everyone for sharing about your person experiences :).<br/>\n <br/>\nWe are still struggling and things have gotten even more complicated because I said I&#39;d take her in on Tuesday to sign back up to go to school, but that I couldn&#39;t promise she&#39;d get the teacher she had (a family friend and someone she loves) last year (he looped w/ his class).  Sure enough, I checked in w/ the teacher who also checked in w/ the principal and they aren&#39;t making any promises about placement.  The teacher she wants has the largest 4th grade class right now.  Then I realized that the other two options for teachers aren&#39;t great.  The first one has said negative things about gifted kids and the program my daughter attends one day a week, so I can&#39;t expect a lot of flexibility from her.  The other has a 3rd and 4th combined, and while I have experience w/ her as a teacher and think she&#39;s great, the class would be a bad fit for my oldest in the 4th grade class &quot;gifted&quot; daughter since it&#39;s already differentiated downward, not up.<br/>\n <br/>\nClare (my daughter) and I still haven&#39;t been able to stay calm during discussions on the topic.  However, I wrote her a letter about my feelings and how I&#39;m trying to let her make her own decisions.  I also made some lists of the things I remember she didn&#39;t like about school, the reasons I thought unschooling was a good idea for our family, and some of the things you can do if you unschool that you can&#39;t do at school.  I tried to be non-manipulative in these lists, just looking at facts.  Clare tends to take in information better if it&#39;s written.  We&#39;ve also taken a walk together, because she&#39;s better at expressing herself while she&#39;s in motion.  We&#39;ve agreed that we&#39;ll try and minimize discussion for a few days so she can reflect on her feelings, and I&#39;ve agreed to take her to school to see about enrolling on Tuesday (after the holiday Monday.)  This weekend is her father&#39;s birthday and her birthday so it will be fun and busy.  I&#39;m hoping that<br/>\n will help her relax and think things over instead of blindly clinging to her &quot;I want to go to school!&quot; statement.<br/>\n <br/>\nI&#39;ve realized this is hard for me because I had worked hard to get myself aligned w/ unschooling and leaving the system.  Obviously I have control issues (I grew up in a very controlling family) and some times it takes me a little time to change course from MY plan.  And I know it&#39;s about giving up control and letting the kids take responsibility for their education, but knowing and actually letting go is very different.  I also know that if she returns to school and can&#39;t have her favorite teacher it will ultimately be my fault for &quot;making her leave school.&quot;  Sigh.  <br/>\n <br/>\nI think leaving town for 3 days at the start of the year would have been so good for us, but unfortunately my husband was laid off in June and is now working 1/2 time, on unemployment 1/2 and job hunting.  He works in Early childhood education/parent education and is presently doing family advocate work (working w/ families and kids in bad situations - he is not enjoying it at all).  Money has always been tight because of his line of work, now it&#39;s beyond tight.  On top of that, my van is making bad noises and when it dies we&#39;ll have one car, in the mean time I dare not drive long distances.  My husband needs the other car for work starting at 6:30 a.m. and often not returning until dinner time. (and he&#39;s not in a good place himself, frustrated w/ life and work and Clare&#39;s behaviors.  That means I am pretty much on my own w/ parenting Clare right now.) Yesterday we did drive to the park.  Today we walked 20 minutes to the store for some<br/>\n craft supplies and bought ice cream before walking home.  Tomorrow I have to be gone 5 hours cleaning a house, hopefully the girls will decide to get along and have fun while I&#39;m gone!<br/>\n <br/>\n:)<br/>\nO.K. this is way too long!! sorry.<br/>\nThanks again for the input.  It helps me stay on track w/ the letting her make her own choice, even though I&#39;ll admit it&#39;s hard for me to stay positive and not snappish at times (we&#39;re dealing w/ our own bedtime issues as well - kids staying up till all hours w/ husband getting up at 5:30 a.m. - me not getting enough sleep.)<br/>\n <br/>\nIt&#39;s all a big transition right now, but in a few months I trust things will be slightly less stressful.<br/>\n <br/>\nJenna <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n&quot;If I had influence with the good fairy who is supposed to preside over the christening of all children, I would ask that her gift to each child in the world be a sense of wonder so indestructible that it would last throughout life.&quot; <br/>\n               - Rachel Carson <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":241207513,"authorName":"Jacquie Krauskopf","from":"Jacquie Krauskopf &lt;home_maker97@...&gt;","profile":"home_maker97","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] First day of unschooling","postDate":"1251985003","msgId":41230,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzMTA5OS44NTgzNy5xbUB3ZWIzOTUwNC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDk2MjAwMy45MzM5NS5xbUB3ZWI1MDQwNC5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDk2MjAwMy45MzM5NS5xbUB3ZWI1MDQwNC5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":41225,"nextInTopic":41233,"prevInTime":41229,"nextInTime":41231,"topicId":41214,"numMessagesInTopic":0,"msgSnippet":"My son is 9 now and we are trying unschooling for the first time. He is so happy at how we are getting along. I however, get nervous. I feel like i am on a","messageBody":"<div id=\"ygrps-yiv-867903674\">My son is 9 now and we are trying unschooling for the first time. He is so happy at how we are getting along. I however, get nervous. I feel like i am on a tightrope and someone greased it and removed the net below! I hope this works it is so much more relaxed to do then school at home. So far he has played Sims (first one) read the book Clemintine. Read the book Frannie K Stein. Looked at some pics and read some volcano books, played the chimes at the library chimes group, made corn bread, finished his study on sharks. Watched a show on Michael Jackson. SIGH.<br/>\n    <br/>\n<br/>\n   <br/>\n<br/>\n Jacquie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Gwen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:willow_selene@...\">willow_selene@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Wednesday, September 2, 2009 6:29:53 PM<br/>\nSubject: Re: [unschoolingbasics] First day of unschooling<br/>\n<br/>\n  <br/>\nMy oldest is eight this year and has never been to school.  We love the beginning of the school year because all of our favorite places are suddenly not crowded anymore.<br/>\n<br/>\nThe zoo, the childen&#39;s museum, parks, and even the mall are much emptier when school starts.<br/>\n<br/>\nI don&#39;t know where you live or what your kids&#39; interests are, but could you plan a week or two of adventure doing fun things?  Mini-golf, amusement parks, and pools will probably be open for a little while longer before closing down/reducing hours for the winter.  You can be a tourist in your own hometown.<br/>\n<br/>\nEven going to the movies in the middle of the day is fun because the theater can be totally yours.<br/>\n<br/>\nIs there somewhere semi-close that you go?  Somewhere within an hour or two of driving that is new and fun and different?  Could you stay there overnight and see the sights?  I know money is tight for lots of people right now, so financially that may be too much.<br/>\n<br/>\nI guess what I&#39;m trying to get it is that you need to be more interesting than school.  More fun.  More engaging.  But it all comes back to what your kids&#39; interests are.<br/>\n<br/>\nGwen<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Wed, 9/2/09, Jenna Robertson &lt;mamamole@yahoo. com&gt; wrote:<br/>\nHave any of you had to keep very busy at first to fill the void of school?  I hear about kids wanting to play video games or watch TV/movies, but do some kids need what seems to amount to distracting them from the lure of school?<br/>\n <br/>\n:)<br/>\nJenna<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n&quot;If I had influence with the good fairy who is supposed to preside over the christening of all children, I would ask that her gift to each child in the world be a sense of wonder so indestructible that it would last throughout life.&quot; <br/>\n               - Rachel Carson <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n------------ --------- --------- ------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] First day of unschooling","postDate":"1251979712","msgId":41225,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJGQUVCRTkxLTY4QkYtNDUwRC1CRjI3LTMwQUE1MjNBREJDQUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDU5NDkzNy41OTgyNS5xbUB3ZWI2NTcwMS5tYWlsLmFjNC55YWhvby5jb20+","referencesHeader":"PDU5NDkzNy41OTgyNS5xbUB3ZWI2NTcwMS5tYWlsLmFjNC55YWhvby5jb20+"},"prevInTopic":41224,"nextInTopic":41230,"prevInTime":41224,"nextInTime":41226,"topicId":41214,"numMessagesInTopic":0,"msgSnippet":"... Occasionally my daughter would balk at the hour drive to her art class and decide she wanted to stay home. Having spent the money, my initial reaction was","messageBody":"<div id=\"ygrps-yiv-1557881562\">On Sep 2, 2009, at 1:21 PM, Jenna Robertson wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But she&#39;s not willing to discuss things rationally at this point so  <br/>\n&gt; we can&#39;t get past the &quot;I want to go to school NOW!&quot; part.<br/>\n<br/>\n </span></blockquote>Occasionally my daughter would balk at the hour drive to her art  <br/>\nclass and decide she wanted to stay home. Having spent the money, my  <br/>\ninitial reaction was &quot;Of course you have to go.&quot; But I&#39;d catch myself  <br/>\nand reassure her that she didn&#39;t have to go. I can&#39;t remember a time  <br/>\nwhen she didn&#39;t decide to go.<br/>\n<br/>\nBut if she&#39;d decided to stay home, that would have been okay too.  <br/>\nWhat she wanted was the choice. It&#39;s lots easier to put up with the  <br/>\nbad parts of something if you know you&#39;re choosing to put up with it  <br/>\nto get to the good parts rather than when it&#39;s forced on you.<br/>\n<br/>\nLet her choose. Unschooling is a lot about kids trying things out and  <br/>\nassessing for themselves what they like and don&#39;t like. If you force  <br/>\nher to stay home, she&#39;ll focus on the negative parts and it will make  <br/>\nit a whole lot harder for her to accept unschooling. (And if you make  <br/>\nher stay home and she finally decides unschooling is okay, there  <br/>\nmight still be some residual resentment that it wasn&#39;t entirely her  <br/>\nchoice.)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] First day of unschooling","postDate":"1251979227","msgId":41224,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwNjBBN0I1LTU2QUMtNEQxRS1BMkMxLTgyMENBNjQ0Qjg5QUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEVFRkYwOEU3NkQ2QTRCMTI5QURBMkFCQzFFMkNGQzdEQHlvdXJxOTRianZ0bDByPg==","referencesHeader":"PDU5NDkzNy41OTgyNS5xbUB3ZWI2NTcwMS5tYWlsLmFjNC55YWhvby5jb20+IDxFRUZGMDhFNzZENkE0QjEyOUFEQTJBQkMxRTJDRkM3REB5b3VycTk0Ymp2dGwwcj4="},"prevInTopic":41221,"nextInTopic":41225,"prevInTime":41223,"nextInTime":41225,"topicId":41214,"numMessagesInTopic":0,"msgSnippet":"... This is important information when sharing about kids on an unschooling list! If what unschoolers are doing has no effect on kids, then we might as well","messageBody":"<div id=\"ygrps-yiv-151988356\">On Sep 2, 2009, at 7:22 PM, Paul & Camille wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She attended regular school for the record and maybe things would  <br/>\n&gt; have been alot different for her had she stayed home.<br/>\n<br/>\n </span></blockquote>This is important information when sharing about kids on an  <br/>\nunschooling list! If what unschoolers are doing has no effect on  <br/>\nkids, then we might as well send them to school and explore our own  <br/>\ninterests outside the family.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Letting her do as she wanted in her case didnt help<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>For at least 12 years she didn&#39;t get to do as she wanted so it&#39;s not  <br/>\nsurprising that a little taste of freedom isn&#39;t enough. New  <br/>\nunschoolers are advised that it takes at least one month for each  <br/>\nmonth in school to deschool. And those months need to be consecutive  <br/>\nso moms need to restart the deschooling clock if they slip back into  <br/>\nschoolish ways. (I&#39;m betting there parents here who are still  <br/>\nsuffering from the aftereffects of school because they never got to  <br/>\nspend a whole year just chilling. Some of the damage never really  <br/>\ngoes away.)<br/>\n<br/>\nWhen food or TV is controlled, it&#39;s not uncommon for kids to binge  <br/>\nwhen given freedom. (And why saying yes more rather than &quot;Have at  <br/>\nit!&quot; is more useful advice! ;-) Having hours not only controlled by  <br/>\nschool, but having society denigrate off hours spent exploring topics  <br/>\nthat aren&#39;t &quot;worthy&quot; of time, are all like prison bars. We accept all  <br/>\nthat control as common and the way life is, but once someone has  <br/>\nstepped far away from school, it&#39;s shocking how much it feels like  <br/>\nliving in a box where you can interact only with what is given to you  <br/>\nand are judged on your choices whenever you venture outside of the box.<br/>\n<br/>\nJust because school is common and pervasive doesn&#39;t mean it isn&#39;t  <br/>\ndamaging. It&#39;s probably a rare person who isn&#39;t changed from how they  <br/>\nwould have been if they&#39;d been unschooled.<br/>\n<br/>\nYou can&#39;t turn back the clock to change her past, but you can change  <br/>\nher right now life. If she&#39;s still living in the house, Guerilla  <br/>\nLearning might have some ways you can help her explore her interests  <br/>\nand find ways to chill. It could be she feels pressure to start being  <br/>\nan adult because of her age but never got the chance to be free to do  <br/>\n&quot;nothing&quot;. (Which for unschooled kids is always something even if it  <br/>\nlooks like nothing from the outside. Even for schooled kids nothing  <br/>\nis always something, but quite often is recovery from the pressure of  <br/>\nschool.) Can you take some time out to explore with her some  <br/>\ninterests that have *no* ulterior motive (like mind improvement,  <br/>\nbetter job skills) for being done? Things that may be totally outside  <br/>\nher usual interests. Or deeper involvement in some of her interests?<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: First day of unschooling","postDate":"1251937266","msgId":41221,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3bjI1aStkcWVwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU5NDkzNy41OTgyNS5xbUB3ZWI2NTcwMS5tYWlsLmFjNC55YWhvby5jb20+"},"prevInTopic":41217,"nextInTopic":41224,"prevInTime":41220,"nextInTime":41222,"topicId":41214,"numMessagesInTopic":0,"msgSnippet":"... ********************** Let her have her cake and eat it! Tell her she can go but doesn t have to go every day if she doesn t want to and can stop at any","messageBody":"<div id=\"ygrps-yiv-2015788424\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Jenna Robertson &lt;mamamole@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Right now she&#39;s demanding that she be able to go back to school.  She says, rightly, that we said she could choose what she does.  However, she&#39;s never know anything but school, change is hard and scary, she&#39;s feeling left out of &quot;normal life&quot; and I truly believe that unschooling will be great for her if she&#39;d give it a chance.<br/>\n </span></blockquote>**********************<br/>\n<br/>\nLet her have her cake and eat it! Tell her she can go but doesn&#39;t have to go every day if she doesn&#39;t want to and can stop at any time - she made need to transition a bit. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m taking them to a park we love to make s&#39;mores and play in the river today - feels like a total bribe or something now instead of the joyful celebration of our freedom I&#39;d planned.<br/>\n </span></blockquote>***********************<br/>\n<br/>\nIts only a &quot;bribe&quot; if you don&#39;t plan to do ever do things like that again. Think of it, instead, as a great start to a new life. You really can go to the park any day at all to play. That&#39;s part of unschooling. Doing fun things because you can, because there&#39;s no-one forcing you to sit at a desk all day. <br/>\n<br/>\nLet your dd go to school and plan more fun things. If she says &quot;but I want to come, too&quot; then say &quot;well, of course you can, going to school is your choice, remember?&quot;<br/>\n<br/>\nYou&#39;ll want to check whatever the relevant laws are, find out how many days she&#39;s &quot;allowed&quot; to miss, if they can be partial days, if you can enroll her as a homeschooler but still have her attend school some of the time. Find out what you need to do to let her have the time she needs to transition.<br/>\n<br/>\n---Meredith (Mo 8, Ray 15)</div>","specialLinks":[]},{"userId":362437716,"authorName":"Paul & Camille","from":"&quot;Paul & Camille&quot; &lt;morlingfamily@...&gt;","profile":"campaulmace","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] First day of unschooling","postDate":"1251933755","msgId":41217,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVFRkYwOEU3NkQ2QTRCMTI5QURBMkFCQzFFMkNGQzdEQHlvdXJxOTRianZ0bDByPg==","referencesHeader":"PDU5NDkzNy41OTgyNS5xbUB3ZWI2NTcwMS5tYWlsLmFjNC55YWhvby5jb20+"},"prevInTopic":41216,"nextInTopic":41221,"prevInTime":41216,"nextInTime":41218,"topicId":41214,"numMessagesInTopic":0,"msgSnippet":"Cant give you any help, but my eldest is exactly as you explain your middle child.  She is 20 now and still very similar with her needs - she lives in the","messageBody":"<div id=\"ygrps-yiv-551469042\">Cant give you any help, but my eldest is exactly as you explain your middle child.  She is 20 now and still very similar with her needs - she lives in the moment totally and what she wants NOW, is usually expressed due to the emotions that she is feeling NOW and she cannot see past them, even at 20.  I have long struggled with this and how best to help her.  Letting her do as she wanted in her case didnt help as she has jumped from this to that and now ends up not working half the time or seeing anything through due to the fact that she reacts to how she is feeling NOW - e.g work sux I dont want to be here anymore.  She attended regular school for the record and maybe things would have been alot different for her had she stayed home.  I think its who she is, but its not easy to watch as you say, the out of control emotions and for the most part not being able to see past them.  Hope you get some other advice from people that have a solution for you :)<br/>\n<br/>\nBlessings,  Camille<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    My almost 10 year old daughter has been in a total rage about not going back to school since yesterday afternoon.  She has had mixed feelings about unschooling, but she was also the one who complained the most about going to school, schoolwork, homework, and all the social crap.  She tends to be very passionate and expresses her emotions dramatically - has all her life.  <br/>\n   <br/>\n   <br/>\n  Right now she&#39;s demanding that she be able to go back to school.  She says, rightly, that we said she could choose what she does.  However, she&#39;s never know anything but school, change is hard and scary, she&#39;s feeling left out of &quot;normal life&quot; and I truly believe that unschooling will be great for her if she&#39;d give it a chance.<br/>\n   <br/>\n  We are trying Very hard to be patient.  But she&#39;s not willing to discuss things rationally at this point so we can&#39;t get past the &quot;I want to go to school NOW!&quot; part.  We&#39;ve been struggling as parents to be unconditional w/ her because she seems to want us to set limits and get angry.  Obviously she&#39;s most likely testing to see what we&#39;ll do, and honestly we feel like we fail at being patient and understanding way too often, which makes feel like perhaps this just isn&#39;t working for this child and us as parents.  It&#39;s working great w/ the oldest and o.k. w/ the youngest.<br/>\n   <br/>\n   <br/>\n  I also feel like the other two girls aren&#39;t getting to express or experience their own emotions related to not going back to school (not to mention mine!) because the middle one is expressing hers so much.  <br/>\n   <br/>\n  I appreciated Meredith&#39;s assurance that her stepson found he didn&#39;t miss school.  I&#39;m just wondering if we can give this a go long enough for my daughter to realize she enjoys it and doesn&#39;t miss school because she&#39;s so determined to go back to school w/out even seeing how it feels not to go to school.  On the other hand, she has had a few moments where she&#39;s more rational and says that she&#39;ll give it a try, but those moments pass quickly and she&#39;s back to yelling.  <br/>\n   <br/>\n  :)<br/>\n  Jenna<br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n  &quot;If I had influence with the good fairy who is supposed to preside over the christening of all children, I would ask that her gift to each child in the world be a sense of wonder so indestructible that it would last throughout life.&quot; <br/>\n                 - Rachel Carson <br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":12252351,"authorName":"Gwen","from":"Gwen &lt;willow_selene@...&gt;","profile":"willow_selene","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] First day of unschooling","postDate":"1251930593","msgId":41216,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2MjAwMy45MzM5NS5xbUB3ZWI1MDQwNC5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDU5NDkzNy41OTgyNS5xbUB3ZWI2NTcwMS5tYWlsLmFjNC55YWhvby5jb20+"},"prevInTopic":41214,"nextInTopic":41217,"prevInTime":41215,"nextInTime":41217,"topicId":41214,"numMessagesInTopic":0,"msgSnippet":"My oldest is eight this year and has never been to school.  We love the beginning of the school year because all of our favorite places are suddenly not","messageBody":"<div id=\"ygrps-yiv-1128032871\">My oldest is eight this year and has never been to school.  We love the beginning of the school year because all of our favorite places are suddenly not crowded anymore.<br/>\n<br/>\nThe zoo, the childen&#39;s museum, parks, and even the mall are much emptier when school starts.<br/>\n<br/>\nI don&#39;t know where you live or what your kids&#39; interests are, but could you plan a week or two of adventure doing fun things?  Mini-golf, amusement parks, and pools will probably be open for a little while longer before closing down/reducing hours for the winter.  You can be a tourist in your own hometown.<br/>\n<br/>\nEven going to the movies in the middle of the day is fun because the theater can be totally yours.<br/>\n<br/>\nIs there somewhere semi-close that you go?  Somewhere within an hour or two of driving that is new and fun and different?  Could you stay there overnight and see the sights?  I know money is tight for lots of people right now, so financially that may be too much.<br/>\n<br/>\nI guess what I&#39;m trying to get it is that you need to be more interesting than school.  More fun.  More engaging.  But it all comes back to what your kids&#39; interests are.<br/>\n<br/>\nGwen<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Wed, 9/2/09, Jenna Robertson &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamamole@...\">mamamole@...</a>&gt; wrote:<br/>\nHave any of you had to keep very busy at first to fill the void of school?  I hear about kids wanting to play video games or watch TV/movies, but do some kids need what seems to amount to distracting them from the lure of school?<br/>\n <br/>\n:)<br/>\nJenna<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n&quot;If I had influence with the good fairy who is supposed to preside over the christening of all children, I would ask that her gift to each child in the world be a sense of wonder so indestructible that it would last throughout life.&quot; <br/>\n               - Rachel Carson <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":136944076,"authorName":"Jenna Robertson","from":"Jenna Robertson &lt;mamamole@...&gt;","profile":"Mamamole","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"First day of unschooling","postDate":"1251912114","msgId":41214,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5NDkzNy41OTgyNS5xbUB3ZWI2NTcwMS5tYWlsLmFjNC55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":41216,"prevInTime":41213,"nextInTime":41215,"topicId":41214,"numMessagesInTopic":0,"msgSnippet":"I don t actually view this as our first day of unschooling, but it s the first day of school for our district.  My almost 10 year old daughter has been in a","messageBody":"<div id=\"ygrps-yiv-1205323320\">I don&#39;t actually view this as our first day of unschooling, but it&#39;s the first day of school for our district.  My almost 10 year old daughter has been in a total rage about not going back to school since yesterday afternoon.  She has had mixed feelings about unschooling, but she was also the one who complained the most about going to school, schoolwork, homework, and all the social crap.  She tends to be very passionate and expresses her emotions dramatically - has all her life.  <br/>\n <br/>\n <br/>\nRight now she&#39;s demanding that she be able to go back to school.  She says, rightly, that we said she could choose what she does.  However, she&#39;s never know anything but school, change is hard and scary, she&#39;s feeling left out of &quot;normal life&quot; and I truly believe that unschooling will be great for her if she&#39;d give it a chance.<br/>\n <br/>\nWe are trying Very hard to be patient.  But she&#39;s not willing to discuss things rationally at this point so we can&#39;t get past the &quot;I want to go to school NOW!&quot; part.  We&#39;ve been struggling as parents to be unconditional w/ her because she seems to want us to set limits and get angry.  Obviously she&#39;s most likely testing to see what we&#39;ll do, and honestly we feel like we fail at being patient and understanding way too often, which makes feel like perhaps this just isn&#39;t working for this child and us as parents.  It&#39;s working great w/ the oldest and o.k. w/ the youngest.<br/>\n <br/>\nI&#39;m taking them to a park we love to make s&#39;mores and play in the river today - feels like a total bribe or something now instead of the joyful celebration of our freedom I&#39;d planned. <br/>\n <br/>\nI also feel like the other two girls aren&#39;t getting to express or experience their own emotions related to not going back to school (not to mention mine!) because the middle one is expressing hers so much.  <br/>\n <br/>\nI appreciated Meredith&#39;s assurance that her stepson found he didn&#39;t miss school.  I&#39;m just wondering if we can give this a go long enough for my daughter to realize she enjoys it and doesn&#39;t miss school because she&#39;s so determined to go back to school w/out even seeing how it feels not to go to school.  On the other hand, she has had a few moments where she&#39;s more rational and says that she&#39;ll give it a try, but those moments pass quickly and she&#39;s back to yelling.  Yes, I want her to choose, but I feel like school is a conditioned response - brainwashing - something that is such a societal norm that it may be too hard for her to choose not to go even if that really is best for her at this point.<br/>\n <br/>\nHave any of you had to keep very busy at first to fill the void of school?  I hear about kids wanting to play video games or watch TV/movies, but do some kids need what seems to amount to distracting them from the lure of school?<br/>\n <br/>\n:)<br/>\nJenna<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n&quot;If I had influence with the good fairy who is supposed to preside over the christening of all children, I would ask that her gift to each child in the world be a sense of wonder so indestructible that it would last throughout life.&quot; <br/>\n               - Rachel Carson <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":41261,"nextTopicId":41276}}