{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":1224177,"authorName":"Saulithyia@aol.com","from":"Saulithyia@...","profile":"saulithyia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Need Some Input","postDate":"1128356909","msgId":6933,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU4LjFkMTgxNDgwLjMwNzJiNjJkQGFvbC5jb20+"},"prevInTopic":6932,"nextInTopic":0,"prevInTime":6932,"nextInTime":6934,"topicId":6930,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/3/2005 11:52:08 AM Eastern Daylight Time, jlh44music@yahoo.com writes: My dad  bought his first computer less than 10 years ago and he ll","messageBody":"<div id=\"ygrps-yiv-2085287898\">In a message dated 10/3/2005 11:52:08 AM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jlh44music@...\">jlh44music@...</a> writes:<br/>\n<br/>\nMy dad  bought his first computer less than 10 years ago and he&#39;ll be <br/>\n81 this  year!   He does woodworking too, but he&#39;s done it all his <br/>\nlife  (he was a draftman when he was in the workforce, mostly <br/>\ndesigning &quot;things&quot;  before the age of computers that do it now with <br/>\nsoftware), built his  house, built a boat, builds furniture, makes <br/>\nwooden bowls and other turned  wood items, but in actuality he <br/>\nprobably taught himself to do these things  because he was interested <br/>\nin doing them).   <br/>\n<br/>\n<br/>\nThat&#39;s exactly MY father! He&#39;ll be 64 in 2 days and is a also a  drafter. <br/>\nHe&#39;s itching to retire now because of the use of &quot;computers&quot;, which he  just <br/>\ndoesn&#39;t &quot;get&quot; lol... He&#39;s not even a telephone person. But, he has learned  enough <br/>\nof the computer to be able to play games and to surf the net for stuff  he&#39;s <br/>\ninterested in. He also is a woodworker, built their house (which is  <br/>\nunfinished... he ALSO has a habit of starting 101 projects and NOT finishing  them). He <br/>\nhas made furniture of excellent quality, as well as some toys for the  kids.<br/>\nHe has an Associate&#39;s Degree in Tool Design, but that&#39;s not what got him  his <br/>\nnice, cushy job. He taught himself how to use his CAD program that he was  <br/>\n&quot;forced&quot; to use. <br/>\n <br/>\nFunny enough, he&#39;s never given a thought about his feelings about us  <br/>\nhomeschooling. My mom is on board with us, as is my mother-in-law, so I  thankfully <br/>\nhave family support. They see the kids learning and growing, and  that&#39;s good <br/>\nenough for them. My son is learning to read right now, and watching  him do <br/>\nthis is fascinating. Well, this morning was funny... &quot;P-O-O-P spells  poop, <br/>\nright?&quot; @@ Yes, Dan... LOL  <br/>\n<br/>\nJenny<br/>\nHomeschooling in Greenfield<br/>\nDanny (12-1-99), Kelsey  (11-1-01) and Evelyn (5-19-04)<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\nEducation is not filling a pail but the lighting of a  fire.  ~William Butler <br/>\nYeats<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":213809267,"authorName":"jlh44music","from":"&quot;jlh44music&quot; &lt;jlh44music@...&gt;","profile":"jlh44music","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Need Some Input","postDate":"1128352866","msgId":6932,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRocmk5MitnZHZlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDUxMDAzMTE0NTM0LkpUSE8xMDIyMS5tdGExMy5hZGVscGhpYS5uZXRAZWJvbnk+"},"prevInTopic":6931,"nextInTopic":6933,"prevInTime":6931,"nextInTime":6933,"topicId":6930,"numMessagesInTopic":0,"msgSnippet":"... draw on his own experiences and use them as an example of how unschooling works. My dad bought his first computer less than 10 years ago and he ll be ","messageBody":"<div id=\"ygrps-yiv-2011124755\"><blockquote><span title=\"ireply\">&gt; One thing I did when I explained to my dad about unschooling was to <br/>\n </span></blockquote>draw on his own experiences and use them as an example of how <br/>\nunschooling works.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nMy dad bought his first computer less than 10 years ago and he&#39;ll be <br/>\n81 this year!   He does woodworking too, but he&#39;s done it all his <br/>\nlife (he was a draftman when he was in the workforce, mostly <br/>\ndesigning &quot;things&quot; before the age of computers that do it now with <br/>\nsoftware), built his house, built a boat, builds furniture, makes <br/>\nwooden bowls and other turned wood items, but in actuality he <br/>\nprobably taught himself to do these things because he was interested <br/>\nin doing them).    Just wanted to comment on the connection, I <br/>\nhaven&#39;t said anything to my dad about unschooling, he&#39;s not saying <br/>\nmuch about homeschooling except &#39;do you know what she needs to learn&#39; <br/>\nand I just reassure him I&#39;m well prepared and leave it at that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You won&#39;t be able to do this personally with an audience, but you <br/>\n </span></blockquote>could give examples, maybe.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nThat&#39;s a good idea.  When I read about it it shake my head and <br/>\ngo &quot;yes, yes! that makes so much sense!&quot; but find it difficult to <br/>\ntalk about it in a confident and experienced way because we&#39;re so new <br/>\nto it and are just beginning to live this way.   But I CAN talk about <br/>\nTHAT, because it is our reality.   I don&#39;t expect to sound like an <br/>\nexpert on unschooling, so I think if I focus on the fact that we are <br/>\njust beginning to embrace unschooling while homeschooling, maybe that <br/>\nwill be a better way to approach it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I pointed out in all the following examples how he was self <br/>\n </span></blockquote>motivated to learn about something and how he followed through and <br/>\nstudied something because he wanted to, because he was interested in <br/>\nit. Kids are no different.&gt;&gt;&gt;&gt;<br/>\n<br/>\nI like this and will work it in!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; like Ham Radio and GPSing etc. and he learned about them because he <br/>\n </span></blockquote>had an interest in them.  Some of the people who are best in their <br/>\nfield are people who didn&#39;t go to school for something, but who found <br/>\nsomething that interested them and they followed their passion.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nFunny, you could be describing my dh!   He&#39;s got his ham license, <br/>\nloves GPS and also has become a wiz about computers, because he was <br/>\ninterested in them (he&#39;s now working on his degree in IT, only <br/>\nbecause he wants to, but he is a &quot;success&quot; in his job without it).  I <br/>\nHAVE talked to him about these things when describing unschooling <br/>\n(he&#39;s totally supportive of homeschooling, he had problems fitting <br/>\ninto school and always felt &quot;stupid&quot;), he doesn&#39;t quite get it <br/>\n(unschooling, child led learning etc) but at least he &quot;gets&quot; when I <br/>\nrelate it personally to him in these areas.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; That said, I&#39;ve been unschooling my kids since they became school <br/>\n </span></blockquote>aged (6 years) and I still have a hard time explaining things to some <br/>\npeople.  (But you still need to make them memorize their times tables <br/>\ndon&#39;t you?)  It seems to be worse for me when the person I am <br/>\nexplaining to doesn&#39;t seem very open to it.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nYes, I get that too or &quot;but if she decides to go back to school, <br/>\nwon&#39;t she be behind&quot; or &quot;what about a high school diploma&quot; and I <br/>\nstart talking about not really needing one to get into college, <br/>\ntaking community college courses as a teen etc etc and I usually get <br/>\nblank looks (that&#39;s if they&#39;re genuinly interested, if they&#39;re NOT <br/>\nopen to it, as you put it, I get the look like I have 3 heads LOL!)<br/>\n<br/>\nThanks for your input Angela!    You&#39;ve given me some good points.<br/>\nJann</div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela","from":"&quot;Angela&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Need Some Input","postDate":"1128339945","msgId":6931,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMDAzMTE0NTM0LkpUSE8xMDIyMS5tdGExMy5hZGVscGhpYS5uZXRAZWJvbnk+","inReplyToHeader":"PGRocThpMCs5c2liQGVHcm91cHMuY29tPg=="},"prevInTopic":6930,"nextInTopic":6932,"prevInTime":6930,"nextInTime":6932,"topicId":6930,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-586853238\">&lt;&lt;I can certainly talk about our own <br/>\nexperience as a family who pulled a child from public school in middle<br/>\nschool, but was wondering if anyone had any thoughts on how I can &quot;gently&quot;<br/>\nintroduce unschooling, from the point of view of someone who &quot;gets it&quot; but<br/>\nis still new to the concept, so as to &quot;open the door&quot; and encourage those<br/>\nwho are considering homeschooling and may be where I was, less than 2 years<br/>\nago, being drawn to unschooling.&gt;&gt;&gt;<br/>\n<br/>\nOne thing I did when I explained to my dad about unschooling was to draw on<br/>\nhis own experiences and use them as an example of how unschooling works.<br/>\nYou won&#39;t be able to do this personally with an audience, but you could give<br/>\nexamples, maybe.  I pointed out in all the following examples how he was<br/>\nself motivated to learn about something and how he followed through and<br/>\nstudied something because he wanted to, because he was interested in it.<br/>\nKids are no different.<br/>\n<br/>\nFor instance, my dad is a self-taught computer guy. He learned all about<br/>\ncomputers from messing around with them.  He is also a wonderful woodworker.<br/>\nHe makes hardwood furniture of a high quality and sometimes sells pieces.<br/>\nHe taught himself that too.  Over the years he has had different interests,<br/>\nlike Ham Radio and GPSing etc. and he learned about them because he had an<br/>\ninterest in them.  Some of the people who are best in their field are people<br/>\nwho didn&#39;t go to school for something, but who found something that<br/>\ninterested them and they followed their passion.<br/>\n<br/>\nWe went to a fair in NY when we were visiting and the guy who was working in<br/>\none of the demonstration areas was so much fun to listen to and watch.  He<br/>\nwas using tool from the 1700 and 1800&#39;s to make furniture and he shared a<br/>\nvast amount of knowledge about them as he worked.  He also had a great sense<br/>\nof humor.  He didn&#39;t go to school to learn about all those tools and how<br/>\nthey were used.  He learned about them because it interested him and now he<br/>\nshares that knowledge with others who are interested.  (And people pay him<br/>\nto do it.)  <br/>\n<br/>\nThat said, I&#39;ve been unschooling my kids since they became school aged (6<br/>\nyears) and I still have a hard time explaining things to some people.  (But<br/>\nyou still need to make them memorize their times tables don&#39;t you?)  It<br/>\nseems to be worse for me when the person I am explaining to doesn&#39;t seem<br/>\nvery open to it.<br/>\n<br/>\nGood Luck!<br/>\n<br/>\n<br/>\n<br/>\nAngela<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a> <br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.344 / Virus Database: 267.11.9/116 - Release Date: 9/30/2005</div>","specialLinks":[]},{"userId":213809267,"authorName":"jlh44music","from":"&quot;jlh44music&quot; &lt;jlh44music@...&gt;","profile":"jlh44music","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Need Some Input","postDate":"1128310144","msgId":6930,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRocThpMCs5c2liQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":6931,"prevInTime":6929,"nextInTime":6931,"topicId":6930,"numMessagesInTopic":0,"msgSnippet":"I know a lot of people are off to L&L, and I ve got great inspirational several posts saved from a lot of the experienced unschoolers on this site, but I also","messageBody":"<div id=\"ygrps-yiv-191590858\">I know a lot of people are off to L&L, and I&#39;ve got great <br/>\ninspirational several posts saved from a lot of the experienced <br/>\nunschoolers on this site, but I also wanted to ask if anyone could <br/>\nhelp me with some words of wisdom.<br/>\n<br/>\nThis is our first year homeschooling (unschooling!) and I&#39;m still not <br/>\nin a place where I can &quot;spout off&quot; easily about unschooling.  The <br/>\nlocal homeschooling group I belong to is having a homeschooling info <br/>\nnight next week and I&#39;ve volunteered to be on the panel <br/>\nof &quot;homeschoolers&quot;.  I&#39;d like to share our story of how we came, <br/>\nfirst, to homeschooling and then discovered unschooling.   I want to <br/>\nkeep it short, and positive (not slam the public schools, you never <br/>\nknow who&#39;s in the audience).   I can certainly talk about our own <br/>\nexperience as a family who pulled a child from public school in <br/>\nmiddle school, but was wondering if anyone had any thoughts on how I <br/>\ncan &quot;gently&quot; introduce unschooling, from the point of view of someone <br/>\nwho &quot;gets it&quot; but is still new to the concept, so as to &quot;open the <br/>\ndoor&quot; and encourage those who are considering homeschooling and may <br/>\nbe where I was, less than 2 years ago, being drawn to unschooling.<br/>\n<br/>\nThanks for indulging me!<br/>\nJann</div>","specialLinks":[]}],"prevTopicId":6928,"nextTopicId":6947}}