{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":254628017,"authorName":"zanyzingzap","from":"&quot;zanyzingzap&quot; &lt;zanyzingzap@...&gt;","profile":"zanyzingzap","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Introduction, jumping right in","postDate":"1173801425","msgId":22176,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDExNzM3NjU2ODkuMTU3Ni44NDQ4OS5tNDdAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":22172,"nextInTopic":0,"prevInTime":22175,"nextInTime":22177,"topicId":22134,"numMessagesInTopic":0,"msgSnippet":"Hi Christy, My dh is actually out your way then, they are doing some training in your state before they head to the big sand box. :-) He said it has rained a","messageBody":"<div id=\"ygrps-yiv-654282790\">Hi Christy,<br/>\n<br/>\n <br/>\n<br/>\nMy dh is actually out your way then, they are doing some training in your<br/>\nstate before they head to the big sand box. :-) He said it has rained a lot.<br/>\nI guess that is the norm for WA though. I imagine one of the reasons it is<br/>\nhard to find like minded families in the AF (I know they exist!) is that if<br/>\nthey are anything like me, they tend to mainly stay under the radar. We just<br/>\ngo about our own business, participate in military life when we choose to<br/>\nbut mainly steer clear of the scrutiny and judgment. We did have one<br/>\ncommander who homeschooled in MS but they did it for different reasons, and<br/>\nhad a whole different philosophy about life and parenting in general that we<br/>\ndidn&#39;t mesh well with. The base commander here homeschools from what I<br/>\nunderstand. Which is great! They have a homeschool gym class at the youth<br/>\ncenter, but the main focus is always on competition rather than healthy<br/>\nhabits so we went a few times until ds decided he didn&#39;t want to go anymore.<br/>\nIt is really geared toward older kids anyway. We have a yahoo group for the<br/>\nbase, but something happened on the list just before I got here and I don&#39;t<br/>\nthink the list has recovered. It seems to be dominated by people in the<br/>\n&quot;school at home, spare the rod spoil the child&quot; mindset. That really isn&#39;t<br/>\nmy cup of tea so we let that pass by. I still hope another unschooler pops<br/>\nup. We had one friend around the corner in housing but they caved to the<br/>\npeer pressure to go to school and now the kids are in public school. :-( I<br/>\nhave had more luck with finding folks in the local area. We VERY recently<br/>\njust made friends with a family in the local town and it is GREAT! They know<br/>\nlots of other unschoolers too which is hopeful for me! <br/>\n<br/>\n <br/>\n<br/>\nAnyway, I hope you find some great connections too! Are you at McChord? I am<br/>\ntrying to remember which AFB is in WA. My dh is actually at another services<br/>\nbase. <br/>\n<br/>\n <br/>\n<br/>\nI hope you have a great day!<br/>\n<br/>\nLisa<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":254628017,"authorName":"zanyzingzap","from":"&quot;zanyzingzap&quot; &lt;zanyzingzap@...&gt;","profile":"zanyzingzap","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Introduction, jumping right in","postDate":"1173800662","msgId":22172,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDExNzM3NjU2ODkuMTU3Ni44NDQ4OS5tNDdAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":22162,"nextInTopic":22176,"prevInTime":22171,"nextInTime":22173,"topicId":22134,"numMessagesInTopic":0,"msgSnippet":"... environmental ones, like grass pollen, animal dander, stuff like that are a problem), but I know a lot of people who do have major food problems. Makes","messageBody":"<div id=\"ygrps-yiv-1554673604\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Interesting. I&#39;m fortunate to not have food allergies (though<br/>\n </span></blockquote>environmental ones, like grass pollen, animal dander, stuff like that<br/>\nare a problem), but I know a lot of people who do have major food<br/>\nproblems. Makes cooking for them challenging!<br/>\n<br/>\nThanks for the interesting info.<br/>\n<br/>\nLinda&lt;&lt;&lt;<br/>\n<br/>\n <br/>\n<br/>\nHi Linda, I have actually read in some places that environmental allergies<br/>\nare often the external symptoms of food intolerance triggers. I haven&#39;t been<br/>\nactively reading on it, but thought I might just pass that on.<br/>\n<br/>\n <br/>\n<br/>\nLisa<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":145246818,"authorName":"Christy Mahoney","from":"&quot;Christy Mahoney&quot; &lt;unschooling1@...&gt;","profile":"unschooling1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Introduction, jumping right in","postDate":"1173765677","msgId":22162,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGV0NWVuZCtzb3BqQGVHcm91cHMuY29tPg=="},"prevInTopic":22140,"nextInTopic":22172,"prevInTime":22161,"nextInTime":22163,"topicId":22134,"numMessagesInTopic":0,"msgSnippet":"Hi Lisa, and welcome. My dh is also in the AF, and we live in Washington (state).  He will soon be deployed again as well.  I know what you mean about being a","messageBody":"<div id=\"ygrps-yiv-1215575373\">Hi Lisa, and welcome. My dh is also in the AF, and we live in <br/>\nWashington (state).  He will soon be deployed again as well.  I know <br/>\nwhat you mean about being a minority - we have yet to find any other <br/>\nlike-minded families on the base here or on any base for that matter.<br/>\n<br/>\nI hope you enjoy this group.<br/>\n<br/>\n-Christy M.</div>","specialLinks":[]},{"userId":203677783,"authorName":"trektheory","from":"&quot;trektheory&quot; &lt;trektheory@...&gt;","profile":"trektheory","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Introduction, jumping right in","postDate":"1173740508","msgId":22140,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGV0NG00dCtnMGZvQGVHcm91cHMuY29tPg=="},"prevInTopic":22134,"nextInTopic":22162,"prevInTime":22139,"nextInTime":22141,"topicId":22134,"numMessagesInTopic":0,"msgSnippet":"... weather ... Oh, ick, fire ants!  We used to live in FL, and I learned to hate those nasty bugs.  We now live in ID, where it does get HOT in the summer,","messageBody":"<div id=\"ygrps-yiv-623887941\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;zanyzingzap&quot;<br/>\n&lt;zanyzingzap@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I was not happy in MS (no<br/>\n&gt; offense to anyone who lives there, I just couldn&#39;t handle the summer<br/>\n </span></blockquote>weather<br/>\n<blockquote><span title=\"ireply\"> &gt; or fire ants.)<br/>\n<br/>\n </span></blockquote>Oh, ick, fire ants!  We used to live in FL, and I learned to hate<br/>\nthose nasty bugs.  We now live in ID, where it does get HOT in the<br/>\nsummer, but no fire ants, and little humidity.  And I love autumn, so<br/>\nthis is a better place for me than FL.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt;  <br/>\n </span></blockquote>I grew up in Maine (greater Portland area) and dh<br/>\n<blockquote><span title=\"ireply\"> &gt; grew up mainly in upstate NY (near Plattsburgh) and we both love<br/>\n </span></blockquote>going home<br/>\n<blockquote><span title=\"ireply\"> &gt; to both places as often as possible. <br/>\n<br/>\n </span></blockquote>We used to live in upstate, too, Albany.  <br/>\n<br/>\n<br/>\n<br/>\nWhy? The main component is rice. Guess what, I<br/>\n<blockquote><span title=\"ireply\"> &gt; am really sensitive to rice.<br/>\n<br/>\n </span></blockquote>A friend told me that Asians are more prone to problems with rice. <br/>\nIronic, eh?  Perhaps any food we eat too much of?  <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I was talking with my friend who is a nutritionist and a while<br/>\n&gt; ago read something about some research that can suggest that some<br/>\n </span></blockquote>allergies<br/>\n<blockquote><span title=\"ireply\"> &gt; are the result of some type of emotional trauma that got connected<br/>\n </span></blockquote>with food<br/>\n<blockquote><span title=\"ireply\"> &gt; somehow. <br/>\n<br/>\n </span></blockquote>Interesting.  I&#39;m fortunate to not have food allergies (though<br/>\nenvironmental ones, like grass pollen, animal dander, stuff like that<br/>\nare a problem), but I know a lot of people who do have major food<br/>\nproblems.  Makes cooking for them challenging!<br/>\n<br/>\nThanks for the interesting info.<br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":254628017,"authorName":"zanyzingzap","from":"&quot;zanyzingzap&quot; &lt;zanyzingzap@...&gt;","profile":"zanyzingzap","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Introduction, jumping right in","postDate":"1173717140","msgId":22134,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDExNzM2ODgxMDkuNjU4LjczOTUwLm0xOUB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":22140,"prevInTime":22133,"nextInTime":22135,"topicId":22134,"numMessagesInTopic":0,"msgSnippet":"Hi folks. My name is Lisa. I live in NJ currently with my 8 yo ds and my dh of 11 years when he isn t deployed as he is now. We are an unschooling AF family.","messageBody":"<div id=\"ygrps-yiv-492854825\">Hi folks. My name is Lisa. I live in NJ currently with my 8 yo ds and my dh<br/>\nof 11 years when he isn&#39;t deployed as he is now. We are an unschooling AF<br/>\nfamily. Other than a short stint in a prestigious, allegedly &quot;child led<br/>\nWaldorf/Montessori inspired&quot; kindergarten program, ds has been homeschooled<br/>\nand more recently unschooled. Letting go of needing his education to go in a<br/>\nparticular way has been a challenge that pops up often for me and I do the<br/>\nbest I can with it. :-) I have struggles with some health issues that are<br/>\nthankfully improving and making it easier for us to get out and explore more<br/>\noften! Yay! We seem to be a minority among minorities in the military life<br/>\nsince we do not avoid school for religious reason, nor do we raise our son<br/>\nas if he is our own personal military troop. I know there are others around<br/>\nlike myself, finding them and making connections seems to be a challenge. We<br/>\nlived in MS for the greater part of 10 years, with some times in Maine<br/>\n(where I am from originally) when dh would deploy. I was not happy in MS (no<br/>\noffense to anyone who lives there, I just couldn&#39;t handle the summer weather<br/>\nor fire ants.) and was happy to find out we were moving to NJ, even though<br/>\ngrowing up I thought NJ was all Newark or Cherry Hill. I love that there is<br/>\na LOT of farmland and forested areas around here. I left Biloxi, MS six<br/>\nhours before Katrina hit and am so grateful we were already moving out as<br/>\nthe house we rented no longer exists. I have friends down there, who like so<br/>\nmany others, still have not recovered! <br/>\n<br/>\n <br/>\n<br/>\nI am a member of the Weston A. Price foundation and make most of our food<br/>\nfrom scratch, I go to Lancaster county, PA to buy all our milk, butter,<br/>\neggs, meat, beans, grains etc.I love being able to buy clean, raw milk from<br/>\nthe wonderful farmers I have met. My dh isn&#39;t totally on board with<br/>\nunschooling, but mainly just lets things progress on their own. Since he was<br/>\ndeployed for 7 months last year and will be deployed for 10 months this<br/>\nyear, that isn&#39;t an issue for the most part. (Please know I would rather<br/>\nhave him home though.) I grew up in Maine (greater Portland area) and dh<br/>\ngrew up mainly in upstate NY (near Plattsburgh) and we both love going home<br/>\nto both places as often as possible. <br/>\n<br/>\n <br/>\n<br/>\nI just joined the other day so forgive me if I am jumping in out of context<br/>\nwith what I have been reading so far.<br/>\n<br/>\n <br/>\n<br/>\nFor the folks struggling with custody issues, my heart goes out to you. I<br/>\nhave a SIL going through a similar situation, my older sister also struggled<br/>\nthrough something like that. They don&#39;t have the schooling issue to contend<br/>\nwith, but definitely have the abuse issues to be concerned with. I am so<br/>\nsorry you are have to deal with this. <br/>\n<br/>\n <br/>\n<br/>\nFood intolerances. if anyone is interested I have a friend who is a<br/>\ncertified nutritionist. If you contact me off list I can get you her contact<br/>\ninformation. She also is a Weston A. Price foundation member. If you want an<br/>\nidea of their deal, their site is www.westonaprice.org<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.westonaprice.org/\">http://www.westonaprice.org/</a>&gt; . I myself am getting ready to do some<br/>\nintolerance testing as well. I am happy to share some of what I have learned<br/>\n(granted it doesn&#39;t feel like much to me so far but I am seeing small<br/>\nimprovements as I keep with it!). I am not a doctor and I am not<br/>\nrecommending anyone do anything in particular, I am just sharing what I have<br/>\nlearned in case someone else can use the information for themselves. <br/>\n<br/>\n <br/>\n<br/>\nCorn syrup is a biggie as well as dyes. Also msg, and preservatives<br/>\n(hydrolyzed soy protein, autolyzed wheat protein, BHT, etc.) MSG is in SO<br/>\nmany things. It is scary. I react strongly to any MSG/glutamate other than<br/>\nwhat is naturally present in foods. Grains are trouble for me when they are<br/>\nnot soaked. Soy is a major problem for me. I only consume raw dairy<br/>\nproducts. Pasteurized/homogenized dairy is an issue for me. One thing I have<br/>\nfound about elimination diets is that it is really hard to know where to<br/>\nbegin. I was put on a hypoallergenic diet by an allergist and it didn&#39;t seem<br/>\nto create any improvements. Why? The main component is rice. Guess what, I<br/>\nam really sensitive to rice. It causes reactions on the tongue, ringing in<br/>\nthe ears, itchy throat and other weird places (inner ears etc.) and is<br/>\nsupposed to be one of the least likely allergens. So it didn&#39;t really help<br/>\nme out. I have a friend who has trouble with lettuce of all things. Another<br/>\nthing people don&#39;t think of being a potential problem. I also seem to react<br/>\nto other stuff and it is hard to get everything out of the system as once<br/>\nsince I do need to eat something.anyway, just wanted to put that in there in<br/>\ncase nothing obvious comes out for someone trying an elimination diet. If I<br/>\nget one allergen out of my diet while continuing to consume something else<br/>\nthat is a problem, I may not get a clear cut reaction when I reintroduce the<br/>\nfirst food. <br/>\n<br/>\n <br/>\n<br/>\nI try to remember to utilize EFT when I am dealing with life issues, even<br/>\nfood issues. I was talking with my friend who is a nutritionist and a while<br/>\nago read something about some research that can suggest that some allergies<br/>\nare the result of some type of emotional trauma that got connected with food<br/>\nsomehow. The easiest example I can think of is people who drink to excess<br/>\nwith a particular type of alcohol then can never be around it without<br/>\nfeeling sick again. For my friend there was a lot of stress in their family<br/>\nlife around dinner time, which more often than not had rice as a component.<br/>\nShe too is sensitive to rice. So she has been trying to resolve some of the<br/>\nemotional issues as well as the food intolerance issues (rotation diet). EFT<br/>\nis a type of energy healing utilizing tapping on certain pressure points.<br/>\nwww.emofree.com &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.emofree.com/\">http://www.emofree.com/</a>&gt;  explains it better than I can. I<br/>\nam still a newbie at that but have had some success when I remember to use<br/>\nit. :-)<br/>\n<br/>\n <br/>\n<br/>\nOk, sorry to be so long winded right off the bat. I am happy to join your<br/>\ngroup and I hope to be a positive contribution! <br/>\n<br/>\n <br/>\n<br/>\nLisa R.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":22157,"nextTopicId":22185}}