{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":193064123,"authorName":"Nance Confer","from":"&quot;Nance Confer&quot; &lt;marbleface@...&gt;","profile":"nanceconfer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Commitments and other things.","postDate":"1184771753","msgId":25019,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTcwMWM3Yzk0ZSRkNWM4ZmVlMCQ2NzAyYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PDExODQ3NjM3OTkuNzY2LjI0NDMxLm00MEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":25018,"nextInTime":25020,"topicId":25019,"numMessagesInTopic":0,"msgSnippet":"unschoolingbasicsRen: No. A young child does not have the developmental ability to understand long-term commitments. Period. Any adult that expects them to be","messageBody":"<div id=\"ygrps-yiv-1660255202\">unschoolingbasicsRen:<br/>\n<br/>\nNo.<br/>\n<br/>\nA young child does not have the developmental ability to understand<br/>\nlong-term commitments. Period. Any adult that expects them to be able<br/>\nto, is at fault for any default on agreement and really needs to learn<br/>\nmore about child development!<br/>\n<br/>\nMe:<br/>\n<br/>\nExactly!  The child in the original post is 7 years old. Too young to be making long-term commitments. Mom signing her up is not the same thing as her actually wanting to do something on the scheduled day. <br/>\n<br/>\nAnd children do not learn about making and keeping commitments from having activities forced on them or all at once from one incident. They learn through normal interactions -- you say you are going to go to a birthday party and you don&#39;t and your friend is mad at you, hmmm. . .. Mom says she is going to take you to the park and changes her mind and you are mad at her, hmmmm. . . you sign up for a 6-week summer camp and hate it on day 1 and quit and then you are bored for the summer, hmmmm. . . you sign up for music lessons and it is hard but you kind of like it and you take a few more and as you get better it&#39;s actually more fun, hmmmm.. . . etc. <br/>\n<br/>\nOur most recent experience is with 12-yo DD. She volunteers at an art camp for several weeks during the summer. This is one of the weeks. But she got up this morning and didn&#39;t want to go. She needed a break and took it. The summer camp has plenty of other volunteers and she knows that and she also knows she is in charge of deciding whether to go or not. This is the first day she&#39;s missed and she is already talking about what they will be doing at art camp tomorrow. <br/>\n<br/>\nDS has taken Tae Kwon Do since he was 6. He is now 14. It has always been a matter of choice -- I&#39;ll ask if he&#39;s going to TKD the next day or later that day so I can make plans but the choice is always his. And he has established his own routine and normally goes 2 or 3 days a week for 2-hour sessions. <br/>\n<br/>\nYes, we pay and we drive and we do the paperwork and we do the research to find the best whatever in the area. But the person actually doing it gets to decide. And by the time they get a bit older, they actually know how to decide.<br/>\n<br/>\n****************<br/>\nRob:<br/>\n<br/>\nThis whole RU thing is one big re-modeling of my concepts of parenting.<br/>\n<br/>\nMe:<br/>\n<br/>\nMaybe it would help to stop thinking in terms of &quot;this whole RU thing&quot; and think of your relationship with each individual child as being built on mutual admiration and respect. When treatment wouldn&#39;t be acceptable if it were aimed at me, it&#39;s not acceptable to impose it on my child. Just a thought. :)<br/>\n<br/>\n******************<br/>\nElenita:<br/>\n<br/>\nHe often does things that almost feel like he is<br/>\n<blockquote><span title=\"ireply\"> &gt; testing me: throwing all of my clean, folded laundry<br/>\n&gt; onto a pile on the floor was the one that got my goat<br/>\n&gt; today.<br/>\n<br/>\n </span></blockquote>Me:<br/>\n<br/>\nFirst, you have a 7-mo and a 3-yo nephew visiting and you have clean laundry? Let alone clean, folded laundry? :)<br/>\n<br/>\nSecond, why was the laundry within the 3-yo&#39;s reach? Your laundry. You want it folded. Put it where it will stay folded. <br/>\n<br/>\nNext, your sister should provide some toys, entertainment, materials for activities, etc. -- whatever she normally has at home. Are you supposed to just magically have this stuff in the house and know what the 3-yo enjoys? <br/>\n<br/>\nAnd last, you&#39;ll be fine. You&#39;re doing great. Less laundry, more goofing off. :)<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":24987,"nextTopicId":25021}}