{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":7644358,"authorName":"Kidgie@aol.com","from":"Kidgie@...","profile":"mama_de_julian_y_julia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"ok, update on my teens (LONG!!!)","postDate":"1185576874","msgId":25193,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM4ZS4xNDUyZmUxYS4zM2RiZDFhYUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":25192,"nextInTime":25194,"topicId":25193,"numMessagesInTopic":0,"msgSnippet":"I ve been wanting to discuss this...Quickly: We are unschooling  my 2 little ones, Julian age 4, almost 5 and Julia, freshly 2. My first 3 were  from a ","messageBody":"<div id=\"ygrps-yiv-1831899929\">I&#39;ve been wanting to discuss this...Quickly: We are unschooling  my 2 little <br/>\nones, Julian age 4, almost 5 and Julia, freshly 2. My first 3 were  from a <br/>\ndifferent relationship and a different era in my life and were, for the  most <br/>\npart, conventionally schooled. Laura is 19, James is 17 and Grace is 15. <br/>\n <br/>\nOK. I have wanted to unschool James and Grace. James has been doing  <br/>\nalternative high school, from a STUPID program at the local continuation high,  to a <br/>\nGREAT program online at Global Village High School for Peace and Freedom.  LOVE <br/>\nit there, but it was too funky for James, who feels safer within  convention, <br/>\nbut is not conventional. Grace will be a sophomore and is not doing  well in <br/>\nschool, falling behind in credits and what-not. I have offered her  <br/>\nalternatives, but she too is uninterested. I have tried to sort of deschool with  them, <br/>\nand to some extent, I see them beginning to understand the process of what  <br/>\nlearning is in actuality, not in a school-like-way, but they don&#39;t trust  <br/>\nthemselves or me or that idea...not really. James is coming along, lol...I see  him <br/>\nnow looking things up online that interest him, he has returned to self  <br/>\nteaching guitar and is going to an off-shoot of the burning man festival this  <br/>\nweekend :) I am attempting comfort with that, lol and he and I have had some  nice <br/>\ntalks about trust and using the end of the teen years to experiment in many  <br/>\nparts of life and all that good stuff. He has decided that if he did not pass  <br/>\nthe Ca High School Proficiency Exam, that he wants to go to the local Adult  <br/>\nSchool and get his GED because he isn&#39;t interested in college and doesn&#39;t know <br/>\n what he wants to do. He feels this will help him get a job..I am not so <br/>\nsure,  myself, and have told him I&#39;ll back him as best I can on anything he wants <br/>\nor  needs. Our issues are complicated by financial issues, because if he is <br/>\nnot in  high school at 18, no more child support. If we weren&#39;t pay-check to <br/>\npaycheck,  there would be less of a rush, but sadly, we are. We are really very <br/>\nfinancially  strapped, and once child support stops, we can&#39;t afford him <br/>\nanymore :( He knows  this, understands it and we all hate it. I&#39;m hoping he stays <br/>\n&quot;in school&quot; (my CA  &quot;private school&quot; I&#39;ve got set up is my ideal, so he can <br/>\nunschool his last year  for this kind of thing, in the safety net of being <br/>\nfinancially cared for for the  most part, you know?) He recently called me &quot;punk <br/>\nrock&quot; which is a high  compliment indeed (in regard to my alternative medicine <br/>\nchoices, homebirth, vax  stuff, all that - because I take the time to educate <br/>\nmyself and he calls that  punk rock - I loved it!) and has made other mention to <br/>\nme that he really sees me  as self educating and never really recognized that <br/>\nbefore. That feels so good,  you know?<br/>\n <br/>\nGrace is attempting conventional education again this fall - she was living  <br/>\nwith her father last year, and is no back and enjoying the trust we are  <br/>\nacquiring between us and is thinking...she was willing to go to the convention  <br/>\nwith me that is in Sacramento in August, but we didn&#39;t have the funds, but at  <br/>\nleast she was willing! And she said she&#39;d go to the beach meet up this week  <br/>\nwhich is with teens that are at least homeschooled (both she and James have that  <br/>\nhorrid idea that homeschoolers are losers...they&#39;ll learn, in time, I know) <br/>\nif  not unschooled, so that&#39;s something too. I wrote up a list of basic options <br/>\nfor  the teens years and told her she can change from one to the next as she <br/>\nsees  necessary and we&#39;d reevaluate as time passes. <br/>\n <br/>\nSo there&#39;s that. Sigh. Here&#39;s the hard one. <br/>\n <br/>\nLaura. She graduated from high school, the old independent study  program <br/>\nthey had here that I did - she got a 4.0, did well, did it a semester  early <br/>\nafter failing horribly (they failed HER *I* feel, but that&#39;s a different  post) in <br/>\na private school with her Dad. She came home, we got her going with the  <br/>\nalternative program, she did so well, and that seemed to be it. She began  <br/>\ncollege, didn&#39;t take to it as she thought she would and flunked all of he  classes. <br/>\nShe then moved out and was living with friends, paying a nominal rent  and <br/>\nworking. She then moved home, after telling me that she and her best friend,  her <br/>\nroommate, were fighting al the time. I didn&#39;t want her to come back - I knew  <br/>\nit was a bad idea, but I let her move back in. It was supposed to be a hand <br/>\nup,  to help her get ready to move, but then she got fired and the short time <br/>\nhere  turned into 13 months, that increased in misery as the weeks ticked by. <br/>\nShe lost  that job, after having had it for years, tried a few other positions, <br/>\nbut either  stopped showing up, or would quit. She went through jobs like me <br/>\nand a good bake  of chocolate chip cookies. She stopped helping financially <br/>\nhere due to the job  loss, and we supported her 100%. She wouldn&#39;t do a bit of <br/>\nany family chore or  anything like that w/o serious coercion or constant <br/>\nreminders. She was rude to  Julian, the 4 year old and super sweet to Julia. She left <br/>\na mess all over the  place, including food to old in her room and in the <br/>\nbathroom (which she shared  with others). She then was caught stealing from my mom <br/>\n- used her credit card to  run up nearly $600 in gas to se her boyfriend, got <br/>\ncaught at my mom&#39;s house 2  times for sure, possibly 3, stole the money out <br/>\nof Julian&#39;s piggy ban (nearly  $80) in slow increments, lied to us about so <br/>\nmany things, all the time, no one  knew what was the truth. I supported her as <br/>\nbest as I could, couldn&#39;t believe  that she was doing all of this...I know put <br/>\non blinders and tried to forget  about each thing as it happened, like trying <br/>\nto give her a clean slate each time  an event occurred, but the tension in the <br/>\nhousehold was awful. Then Grace moved  back, she stole money from <br/>\nGrace...there&#39;s more, but I&#39;m hoping I&#39;m painting a  clear picture here. anyway, after <br/>\nlots of discussions and warnings and what-not,  she said she was moving out by <br/>\nJuly 1. We stretched it to the 15th, since she  still had no job, hadn&#39;t really <br/>\ndone anything, and tensions were building. We  love her, but e can&#39;t trust <br/>\nher. Finally, after all this time, I...I kicked her  out. She knew it was coming. <br/>\nIt was out in the open that she was going to have  to leave (my former dh <br/>\nnever changed child support when Grace left, which was  how I was able to <br/>\ncontinue to support her living here) and she did nothing. We  tried. We tried to find <br/>\nher jobs, we hid our money and credit cards, we talked  about being rude to <br/>\nJulian and to all of us (&quot;When are you going shopping?  There&#39;s no food here,&quot; <br/>\nthat kind of thing and more) and we gave notice upon  notice....well, 4 weeks <br/>\nago today, I had it and that was it. She&#39;s now not  speaking to me, her <br/>\npaternal grandmother is now taking care of her...and it&#39;s  awful. I feel like I went <br/>\nagainst my heart, but I know I can&#39;t see ANYTHNG  clearly about this <br/>\nsituation. I tried, I do try! I love this girl with all my  heart...but I don&#39;t love <br/>\nher actions or what she has chosen. They have hurt  others and that&#39;s the issue <br/>\nI have. I don&#39;t know what to think, how to feel or  what to do. So I am <br/>\nwriting here because I have never heard such excellent  advice and discussions in <br/>\nmy life as the ones I&#39;ve gotten here. <br/>\n <br/>\nMy flow has been interrupted and I need to go...so sorry for the novel  here, <br/>\nand thank you if you got through this. It&#39;s been excruciating for me and  for <br/>\nher and for the rest of us living here. I admit, some tranquility has indeed  <br/>\nreturned since she&#39;s been gone, but the pain of not seeing her and the s<br/>\nituation  surrounding it is still just as bad. But at least I&#39;m not covered in <br/>\neczema  anymore and I can sleep again. <br/>\n <br/>\nI&#39;m almost in tears, so I&#39;m gonna go, take the little ones to my dad&#39;s to  <br/>\nswim and have a nice dinner he made for us, have a bit of wine and be done with  <br/>\nthe day. <br/>\n <br/>\nThanks again....<br/>\nKaren <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n************************************** Get a sneak peek of the all-new AOL at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://discover.aol.com/memed/aolcom30tour\">http://discover.aol.com/memed/aolcom30tour</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":25192,"nextTopicId":25195}}