{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":17,"messages":[{"userId":80776775,"authorName":"kel9769","from":"&quot;kel9769&quot; &lt;kel9769@...&gt;","profile":"kel9769","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Principles in your house ... (long)","postDate":"1196179276","msgId":28041,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZpaGYwYytoMGJzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDExOTU4NTMxODYuMTE0Mjc3NTVAZGsxMS5kbmdyLm9yZz4="},"prevInTopic":28040,"nextInTopic":0,"prevInTime":28040,"nextInTime":28042,"topicId":27946,"numMessagesInTopic":0,"msgSnippet":"... is ... Hi Adrean I have an idea that may be helpful.  I only have one child so I am dealing with different struggles but my daughter volunteers at a ","messageBody":"<div id=\"ygrps-yiv-2047168175\"><blockquote><span title=\"ireply\">&gt; I feel those emotions because we&#39;ve gone through this over and over <br/>\n&gt; again. &quot;Please don&#39;t hit your brother, it hurts.  When your brother <br/>\n </span></blockquote>is <br/>\n<blockquote><span title=\"ireply\"> &gt; done with the toy, you can have it.  What time will you be done with <br/>\n&gt; this toy?  Let him have the toy, it is his turn.  So what if your <br/>\n&gt; brother said no over something that doesn&#39;t make sense? Does he have <br/>\n&gt; control over that and does hitting him solve the problem?&quot;<br/>\n&gt; <br/>\n&gt; --Adrean<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Hi Adrean<br/>\nI have an idea that may be helpful.  I only have one child so I am <br/>\ndealing with different struggles but my daughter volunteers at a <br/>\ndemocratic free school for younger children and they have a good <br/>\npolicy for dealing with arguments.  Anyone can call a meeting any time <br/>\nthey feel something is unfair and they talk about it together until <br/>\nthey all agree to a solution.  They have worked out very specific <br/>\nguidleines for play fighting so they can tussle and no one gets hurt <br/>\n(very much anyway).  They also have worked out how to share by <br/>\nagreeing to a time limit on the prime toys.  I think the basic idea is <br/>\neveryone being in agreement with limitations becuase they value the <br/>\nbenifits.  If each boy knows he is really &quot;heard&quot; then over time he <br/>\nwill become more willing to see the others point of view and make <br/>\ncomprimises willingly.  It takes a lot of practice though. <br/>\n<br/>\n I am definitely still working on it with my daughter.  For every time <br/>\nI  deal with a situation thoughtfully and calmly there are probably <br/>\ntwo times that I said No or yelled without thinking it through <br/>\nfirst.   Keep up the good fight : )<br/>\nKelly</div>","specialLinks":[]},{"userId":280029197,"authorName":"gvrcdkv","from":"&quot;gvrcdkv&quot; &lt;gvrcdk2@...&gt;","profile":"gvrcdkv","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Principles ......sign language and voicing","postDate":"1196146425","msgId":28040,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZpZ2V0cCszMjF0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDExOTU4NDE4MDIuMzM0NDk2QzJAZGkxMS5kbmdyLm9yZz4="},"prevInTopic":28036,"nextInTopic":28041,"prevInTime":28039,"nextInTime":28041,"topicId":27946,"numMessagesInTopic":0,"msgSnippet":"Hi Adrean, I ve read this entire thread, and I have some comments (interspersed). ... what ... they ... talk ... their ... so my ... forgot, it s a ... I","messageBody":"<div id=\"ygrps-yiv-1202602009\">Hi Adrean, <br/>\n<br/>\nI&#39;ve read this entire thread, and I have some comments <br/>\n(interspersed). <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The problem isn&#39;t just the noise with the fighting - it&#39;s catching <br/>\n </span></blockquote>what <br/>\n<blockquote><span title=\"ireply\"> &gt; they&#39;re saying before the fights happen. It drives me crazy that <br/>\n </span></blockquote>they <br/>\n<blockquote><span title=\"ireply\"> &gt; have had a lack of respectful language models. People who can sign <br/>\n </span></blockquote>talk <br/>\n<blockquote><span title=\"ireply\"> &gt; verbally with each other in front of me and my children follow <br/>\n </span></blockquote>their <br/>\n<blockquote><span title=\"ireply\"> &gt; example.  I have asked them respectfully to sign without voicing <br/>\n </span></blockquote>so my <br/>\n<blockquote><span title=\"ireply\"> &gt; job would be easier, but they continue to ignore me. &quot;I <br/>\n </span></blockquote>forgot,&quot; &quot;it&#39;s a <br/>\n<blockquote><span title=\"ireply\"> &gt; habit,&quot; etc.<br/>\n<br/>\n </span></blockquote>I recognize the issue here.  You as a parent want to know what is <br/>\ngoing on between your children.  This is certainly valid.  I am just <br/>\nnot sure you can illegalize voicing in your home.  I mean this in <br/>\ntwo ways.  Firstly, I don&#39;t think this is possible.  In the history <br/>\nof deaf education there were many attempts to prevent deaf children <br/>\nfrom using sign language and in spite of all this, the children <br/>\nsomehow still acquired sign language (against all odds), and used it <br/>\nevery chance they got with each other, because it was their most <br/>\ncomfortable language in certain circumstances. In the same way, if <br/>\nyou try to ban English in your home, it will not work.  English is <br/>\ntoo powerful a communication tool for people who use it to just drop <br/>\nit to please someone else.  From another angle, I don&#39;t think it <br/>\nwould be fair to ask your children not to speak to each other at all <br/>\nin your presence.  I don&#39;t think this is an ethical thing to do.  <br/>\nThey are using the English, in spite of your requests, because it is <br/>\nthe most comfortable language for them in certain circumstances.  <br/>\nThink about how much of their lives happen in English.  You cannot <br/>\nchange this.  Are you prepared to illegalize television, books, and <br/>\naccess to all hearing people?  So much of what they know they <br/>\nlearned from sources other than you. These things came to them in <br/>\nEnglish, so it is hard for them to translate ALL of their <br/>\nexperiences into another language 24/7 for the benefit of someone <br/>\nelse. <br/>\n<br/>\nI don&#39;t mean to seem callous.  I understand your problem.  I sign <br/>\nfluently and my husband and daugher are deaf.  My husband is from a <br/>\nDeaf signing family.  I also have two hearing children.  We are all <br/>\nbilingual.  Sometimes we hearing members sign to each other for fun <br/>\nwhen my husband is not even there... sometimes, we speak to each <br/>\nother in his presence.  We are a bilingual family.  We code switch.  <br/>\nThis happens naturally depending on the situation.  My husband does <br/>\nnot try to regulate language, and for this reason, because they are <br/>\nnot forced to translate, I see my children sometimes translating <br/>\nvoluntarily for my husband because they love him so much, and <br/>\nunderstand his perspective, and want to include him. Other times, <br/>\nthey sign becuase they need his help with something.  Sometimes I <br/>\ntell my husband what they are saying to each other in English... <br/>\nSometimes I am too busy, and he has to try to figure it out for <br/>\nhimself, or ask, or let it go.  <br/>\n<br/>\nI belive humans instinctually use their communication skills to <br/>\naccomplish their own goals.  I don&#39;t think it would be right to use <br/>\none&#39;s power to limit someone else&#39;s language use for one&#39;s own <br/>\npurposes.  In your case, granted, your purpose is to be an on the <br/>\njob mom, and this is obviously an important goal.  However, I think <br/>\nthat you could accidentally push your children away from you and <br/>\nsign language if you push your children towards it so agressively.  <br/>\nIf you go by the idea of principles, then perhaps a nice principle <br/>\nwould be something like &quot;we try to understand each other better&quot; , <br/>\nor something like that, and work from there.  When I say work from <br/>\nthere, i don&#39;t mean that you require them to sign. I mean that you <br/>\ntry to show them that you are trying to understand them as best you <br/>\ncan using the tools available to you.  You have to model this, and <br/>\nbe patient with your children as they learn this new way.  <br/>\n<br/>\nYour problem is not unique to deafness.  This is a very common issue <br/>\nin the bilingual houses of immigrants whose children master English <br/>\nfaster than their parents.  Very often, then children speak to each <br/>\nother in English, and speak some combination of their two languages <br/>\nwith their parents.  Bilingual research and theory has shown that <br/>\nthere are periods of language mixing in children growing up <br/>\nbilingual, and that gradually, they learn which language matches <br/>\nwhich circumstance.  Children need time with this.  You <br/>\ncan&#39;t &quot;require&quot; language skills; they are developed over time, with <br/>\nmotivation.  <br/>\n<br/>\nI don&#39;t see them needing to sign to each other.  They have the right <br/>\nto communicate amongst themselves.  If they have a problem and need <br/>\nyou, or if you join the conversation, it may be that there is reason <br/>\nfor them to sign too, or instead (if they are able to do this).  As <br/>\nlong as they are signing, what is the problem if they voice too?.. <br/>\nif this makes the language more meaningful to them in some way.  I <br/>\nrealize that doing both at the same time creates linguistic <br/>\nproblems... but isn&#39;t the idea to communicate, and not to be <br/>\nperfect?  In some circumstances, such as Deaf schools, or Deaf <br/>\nservice agencies, the personnel are required to sign at all times.  <br/>\nI believe this is appropriate, because language use and modeling are <br/>\nmade part of the job description.  Those who don&#39;t or can&#39;t comply <br/>\nare sometimes fired.  But.. in a family, you can&#39;t fire your <br/>\nchildren.  You have to try to understand them, and as they are able, <br/>\nthey will begin to have the ability to understand your perspective <br/>\ntoo.  I believe that you have to let go of this form of control.  <br/>\nTheir language skills are their own, and if they speak English and <br/>\nyou do not, then this is an inconvenience that you as the adult have <br/>\nto work around in some way.  They cannot be held responsible for <br/>\nthis.  You want them to be all they can be.  Their experience, and <br/>\nneeds are not the same as yours.    <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Communicating with my own children is very impt to me, and I&#39;ve <br/>\n </span></blockquote>been <br/>\n<blockquote><span title=\"ireply\"> &gt; trying to work with them. I keep feeling like my efforts are <br/>\n </span></blockquote>undermined <br/>\n<blockquote><span title=\"ireply\"> &gt; - by the school system, by well-meaning relatives.<br/>\n&gt; <br/>\n&gt; On my part I need to try harder in making the boys feel welcome in <br/>\n&gt; sharing with me, so that they will want to be sure I&#39;m included, <br/>\n </span></blockquote>and <br/>\n<blockquote><span title=\"ireply\"> &gt; that they will maybe have more appreciation of ASL.<br/>\n<br/>\n<br/>\n </span></blockquote>Exactly.  I think you have hit the nail on the head here. If they <br/>\nfeel like they benefit from having you included in the <br/>\nconversations, then they will include you. Because you do not use <br/>\nEnglish in the way they do, you are not in a position to force your <br/>\nown participation.  In a way, this may be an advantage from an <br/>\nunschooling perspective. You will have to convince them of the value <br/>\nof having you involved. Really, we all have to do this, even when <br/>\nthere is only one language used in the family.  Otherwise, we may <br/>\ntalk to our children, but they wouldn&#39;t be listening, and they may <br/>\ntalk to us, but it may not be the truth.  Communication is built on <br/>\nrespect, and this respect has to be modeled by the parents.  I think <br/>\nthat you should put the issue of which language to use on hold, and <br/>\nwork on the content of the message.  If the content works for them, <br/>\nthen they will make sure that the message gets accross because they <br/>\nwill need you.  What would happen if you apologized for trying to <br/>\ncontrol their language use, and told them that you wish to find a <br/>\nway to help them in any way you can with whatever they need, and <br/>\nthat you are a little concerned about missing things, but that you <br/>\nwant them to know that you are available when they need you. Then <br/>\ntry to live with this for a while... I wonder if just this wouldn&#39;t <br/>\nchange things for the better.  You are their mom.  They definitely <br/>\nneed you.  They&#39;ll come.  <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I&#39;ve been reading the pointers you all have shared--appreciate <br/>\n </span></blockquote>those <br/>\n<blockquote><span title=\"ireply\"> &gt; very much!  Anyone have experience with having a second language <br/>\n </span></blockquote>at <br/>\n<blockquote><span title=\"ireply\"> &gt; home?<br/>\n<br/>\n&gt; --Adrean<br/>\n<br/>\n </span></blockquote>I have a couple more things to say, and sorry to be so long.  There <br/>\nare ways you can compensate for not hearing what&#39;s going on with the <br/>\nchildren.  In our house, we use vibrating sound detectors.  When my <br/>\nhusband is solely responsible for the children, he wears a vibrating <br/>\npager which is activated when the noise level goes up.  If you do <br/>\nmove, consider a place with an open floor plan( ie.. more space and <br/>\nless walls).   Make sure that the children can &quot;get&quot; you when they <br/>\nneed you.  Let them benefit from the technology too.  There are also <br/>\nvibrating pagers activated by handheld buttons.  We have this too <br/>\nand it worked very well when I was nursing the baby and needed to <br/>\ncall my husband from the other room for something. We set another <br/>\none up in the living room, so that they could call him by flashing a <br/>\nlight in the kitchen. <br/>\n<br/>\nSign language is a beautiful and complete language, but many deaf <br/>\npeople experience a language barrier when it comes to English and <br/>\nthe world of sound.  If you were deaf as a child, then it was the <br/>\nresponsibility of the adults in your life to ease this barrier for <br/>\nyou in some way, and take on the bulk of the responsibility for <br/>\ncommunication, while you were still learning.  Now you are the <br/>\nadult, and it is your responsibility to take on the communication <br/>\nissues faced by your family and come up with creative solutions.  <br/>\nYou cannot place this burden on the shoulders of your children.  If <br/>\nyou try to make it as easy as possible for your children to <br/>\ncommunicate with you, then they probably will pick of the rest of <br/>\nthe slack as best they can.  Maybe you can enlist the help of family <br/>\nmembers (relatives or friends) in some way.  Your children do not <br/>\nspeak English in the home due to the bad influence of your <br/>\nrelatives. They speak because they can hear... it comes very <br/>\nnaturally for them... just as signing comes naturally to many Deaf <br/>\npeople.  Good luck, and I wish the absolute best to you and your <br/>\nchildren in your unschooling journey.  <br/>\n<br/>\nRespectfully, <br/>\n<br/>\nCarolyn <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re:Principles in your house ...","postDate":"1196126797","msgId":28036,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOUZFQUJCMEFCQjk3Ni05MDQtMzZGMUB3ZWJtYWlsLW1lMTMuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1Mzk0RENGQEJPWC5DTkNTT0ZUV0FSRS5DT00+","referencesHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1Mzk0RENGQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":28014,"nextInTopic":28040,"prevInTime":28035,"nextInTime":28037,"topicId":27946,"numMessagesInTopic":0,"msgSnippet":"... From: Debra Rossing  It s interesting now, to hear his feedback when we ve spent time with extended family - one SIL and her 4","messageBody":"<div id=\"ygrps-yiv-1409088075\">-----Original Message-----<br/>\nFrom: Debra Rossing &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:debra.rossing@...\">debra.rossing@...</a>&gt;<br/>\n<br/>\n<br/>\nIt&#39;s interesting now, to hear his feedback when we&#39;ve spent time with<br/>\nextended family - one SIL and her 4 yr old in particular. DS sees how<br/>\nthe arbitrary rules and micromanagement end up in rebellion and stress<br/>\nand no one being happy (had a lovely - not- example of that this past<br/>\nweekend with everyone gathered holiday-wise). He sometimes just does not<br/>\nunderstand why people don&#39;t get the connection between arbitrary rules<br/>\nand over managing kids and the behaviors that they get.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nYeah---I&#39;m sure how many other families discuss &quot;Parenting Skills&quot; the <br/>\nway we do around here.  It&#39;s *often* a topic of conversation.<br/>\n<br/>\nI think that a child who would question other parents&#39; parenting <br/>\npractices with his own parents must be comfortable enough with his own <br/>\nparents. &lt;g&gt;<br/>\n<br/>\nWe have the Lovejoy Christmas next weekend (I&#39;ll be staying home, but <br/>\nBen&#39;ll take the boys there Whew! &lt;g&gt;).  As soon as they get home, I&#39;ll <br/>\nget the run-down about the &quot;questionable parenting abilities&quot; that they <br/>\nwitness while there.<br/>\n<br/>\nIt won&#39;t be anything new. Walking about in Wal-de-mart, the <br/>\nStore-Which-Should-Not-Be-Named, will get the same questions.<br/>\n<br/>\nThe best thing is that I hope the boys will have so much less baggage <br/>\nto unload before parenting their own babies. What a wonderful gift!<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nEmail and AIM finally together. You&#39;ve gotta check out free AOL Mail! - <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.aol.com\">http://mail.aol.com</a></div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:Principles in your house ...","postDate":"1196084105","msgId":28014,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1Mzk0RENGQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":27998,"nextInTopic":28036,"prevInTime":28013,"nextInTime":28015,"topicId":27946,"numMessagesInTopic":0,"msgSnippet":"Do no deliberate harm is a basic principle - that applies to self, others, animals, etc. Most other stuff comes out of that - respecting other people s","messageBody":"<div id=\"ygrps-yiv-428650626\">&quot;Do no deliberate harm&quot; is a basic principle - that applies to self,<br/>\nothers, animals, etc. Most other stuff comes out of that - respecting<br/>\nother people&#39;s person, space, property; being kind; staying safe;<br/>\nforgiving others when accidents happen; etc. And, it applies equally<br/>\nregardless of age - we learned early on that DS just won&#39;t tolerate<br/>\narbitrary double standards - adults can do this but kids can&#39;t just<br/>\nbecause the adults say so - but he quite understands (and has for a long<br/>\ntime, it&#39;s not just because he&#39;s now 9, this goes back to almost<br/>\ntoddlerhood) that there are some things that are not safe for him to do<br/>\nor, at least, not safe for him to do alone, unassisted. <br/>\n <br/>\nIt&#39;s interesting now, to hear his feedback when we&#39;ve spent time with<br/>\nextended family - one SIL and her 4 yr old in particular. DS sees how<br/>\nthe arbitrary rules and micromanagement end up in rebellion and stress<br/>\nand no one being happy (had a lovely - not- example of that this past<br/>\nweekend with everyone gathered holiday-wise). He sometimes just does not<br/>\nunderstand why people don&#39;t get the connection between arbitrary rules<br/>\nand over managing kids and the behaviors that they get.<br/>\n <br/>\nDeb <br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":313556993,"authorName":"Adrean Clark","from":"Adrean Clark &lt;adrean@...&gt;","profile":"fuzzyellowduck","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Principles in your house ... (long)","postDate":"1195853162","msgId":27998,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExOTU4NTMxODYuMTE0Mjc3NTVAZGsxMS5kbmdyLm9yZz4=","inReplyToHeader":"PDhDOUZDMjVDQjhGMDVDQy1BNTgtMzNERkBtYmxrLWQ0NC5zeXNvcHMuYW9sLmNvbT4=","referencesHeader":"PEMzNkE2Njg0LjczNDAlem9hY29ubmVyQGNvbWNhc3QubmV0PiA8OEM5RkI2RDIxMjg5RkMwLTM3OC1BOTY2QHdlYm1haWwtZGEwNC5zeXNvcHMuYW9sLmNvbT4gPDExOTU3NzEwNTguMjE4ODQwNUNAZmI3LmRuZ3Iub3JnPiA8OEM5RkI4N0MwMEE2MDRDLTM3OC1BQzc1QHdlYm1haWwtZGEwNC5zeXNvcHMuYW9sLmNvbT4gPDExOTU3ODI2MjUuMjc2REJDRURAYmMxMi5kbmdyLm9yZz4gPDExOTU3ODQ1NzYuMTQ3MTExNUBmZTExLmRuZ3Iub3JnPiA8MTE5NTc4NjIyMC4xMTA5QURGRUBnYjMyLmRuZ3Iub3JnPiA8OEM5RkMyNUNCOEYwNUNDLUE1OC0zM0RGQG1ibGstZDQ0LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":27994,"nextInTopic":28014,"prevInTime":27997,"nextInTime":27999,"topicId":27946,"numMessagesInTopic":0,"msgSnippet":"... I d be fine with them coming up to me for help but I feel like on this issue we have talked it into a morass, where no one seems to be listening to each","messageBody":"<div id=\"ygrps-yiv-132889235\"><blockquote><span title=\"ireply\">&gt; Irritated and frustrated that someone came to you for help?<br/>\n<br/>\n </span></blockquote>I&#39;d be fine with them coming up to me for help but I feel like on this <br/>\nissue we have talked it into a morass, where no one seems to be <br/>\nlistening to each other and people are still getting hit.<br/>\n<br/>\nI feel those emotions because we&#39;ve gone through this over and over <br/>\nagain. &quot;Please don&#39;t hit your brother, it hurts.  When your brother is <br/>\ndone with the toy, you can have it.  What time will you be done with <br/>\nthis toy?  Let him have the toy, it is his turn.  So what if your <br/>\nbrother said no over something that doesn&#39;t make sense? Does he have <br/>\ncontrol over that and does hitting him solve the problem?&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s a small house, right? How far can you actually BE from them?<br/>\n<br/>\n </span></blockquote>I used to physically separate them into time-outs but since I hurt my <br/>\nback and snapped my ACL I&#39;ve been unable to get into the thick of things <br/>\nwithout getting hurt myself.  I have to yell to stop things from a <br/>\ndistance and even then it doesn&#39;t work. So I feel powerless too. :( I&#39;m <br/>\nlaid up now, just finished with ACL reconstruction surgery.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So it *is* a fear.<br/>\n&gt; Whether he&#39;s lying or not?<br/>\n<br/>\n </span></blockquote>How could I have approached this situation better, then? There was blood <br/>\nall over his brother&#39;s face and we were heading towards a construction <br/>\nzone.  They were fighting because the twin had said no and pouted over <br/>\nsomething, both had been hitting on each other. There are real-world <br/>\nconsequences to beating up people - including lock-up.  My thinking was, <br/>\nremove the aggressor from the situation NOW.  Then clean up and talk <br/>\nabout it.  I am out of ideas if this only creates a revenge complex in <br/>\nthem :(<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Change the anger to curiosity.<br/>\n<br/>\n </span></blockquote>It is difficult because I feel stumped on this. I&#39;ve read the Siblings <br/>\nWithout Rivalry book, joined this list, consensual living, read all I <br/>\ncould and I&#39;m still not getting it right.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Why do they feel compettitive and jealous? What is causing that?<br/>\n<br/>\n </span></blockquote>The bad old days I think. :(  There were major power and control issues <br/>\ngoing on in our home until DH and I separated abt 2 years ago. Since <br/>\nthen he&#39;s gone to counseling but DS has grown up in that environment and <br/>\nI really want to change that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Yeah---but how is that helping them?<br/>\n<br/>\n </span></blockquote>I thought it&#39;s help him see the futility of that option. It&#39;s difficult <br/>\nif I&#39;m out of ideas myself too. Maybe it&#39;ll be different after each of <br/>\nthem has their own space?<br/>\n<br/>\nYou know it just occurred that maybe because DS has more options <br/>\ncompared to the twins (one said recently, &quot;I want to be homeschooled!&quot;) <br/>\nand because DS tries to control them, they feel powerless. So they hold <br/>\nonto &quot;insignificant&quot; things like toys or verbal comments because that&#39;s <br/>\nwhere they feel like they have control.  The twins are still in <br/>\npreschool and my mother was just telling me about how the teacher needs <br/>\nto keep order, etc.  DS also probably feels powerless himself from when <br/>\nhe was in school.<br/>\n<br/>\nI&#39;m not perfect myself either, and the kids copy my mistakes.  My <br/>\nthinking is away from the &quot;control kids&quot; model but when things get <br/>\nstressful I find my ideas and options narrowing down.<br/>\n<br/>\nLet&#39;s take one difficult situation for example -<br/>\n<br/>\nDS likes to sing in the van. I am unaware of this unless I see his mouth <br/>\nmoving and head bobbling.  Singing does not bother me.  Everything would <br/>\nbe fine and dandy if DS didn&#39;t insist he sings alone or has total <br/>\nsilence instead.  The end result is usually a lot of drama.  I don&#39;t <br/>\nhave a means for monitoring volume in the van.<br/>\n<br/>\nAny suggestions on how to defuse this?<br/>\n--Adrean</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Principles in your house ...","postDate":"1195849388","msgId":27994,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOUZDMjVDQjhGMDVDQy1BNTgtMzNERkBtYmxrLWQ0NC5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PDExOTU3ODYyMjAuMTEwOUFERkVAZ2IzMi5kbmdyLm9yZz4=","referencesHeader":"PEMzNkE2Njg0LjczNDAlem9hY29ubmVyQGNvbWNhc3QubmV0PiA8OEM5RkI2RDIxMjg5RkMwLTM3OC1BOTY2QHdlYm1haWwtZGEwNC5zeXNvcHMuYW9sLmNvbT4gPDExOTU3NzEwNTguMjE4ODQwNUNAZmI3LmRuZ3Iub3JnPiA8OEM5RkI4N0MwMEE2MDRDLTM3OC1BQzc1QHdlYm1haWwtZGEwNC5zeXNvcHMuYW9sLmNvbT4gPDExOTU3ODI2MjUuMjc2REJDRURAYmMxMi5kbmdyLm9yZz4gPDExOTU3ODQ1NzYuMTQ3MTExNUBmZTExLmRuZ3Iub3JnPiA8MTE5NTc4NjIyMC4xMTA5QURGRUBnYjMyLmRuZ3Iub3JnPg=="},"prevInTopic":27992,"nextInTopic":27998,"prevInTime":27993,"nextInTime":27995,"topicId":27946,"numMessagesInTopic":0,"msgSnippet":"... From: Adrean Clark  I have the same policy for them, #1 talk it out, #2 ask mom for help. As for leaving them alone, that annoys me to no","messageBody":"<div id=\"ygrps-yiv-1654090297\">-----Original Message-----<br/>\nFrom: Adrean Clark &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:adrean@...\">adrean@...</a>&gt;<br/>\n<br/>\nI have the same policy for them, #1 talk it out, #2 ask mom for help.<br/>\nAs for leaving them alone, that annoys me to no end because no parent<br/>\never is right there supervising their children eyeball to eyeball 24/7.<br/>\nThe moment I look away somebody comes up to me saying he hit me!  I am<br/>\nso irritated and frustrated with them about that.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nIrritated and frustrated that someone came to you for help?<br/>\n<br/>\nIt&#39;s a small house, right? How far can you actually BE from them?<br/>\n<br/>\n-=--=-=-=<br/>\n<br/>\nOne time the oldest punched one of his twin brothers in the nose so <br/>\nhard<br/>\nit bled. We were in the van driving back home from school and I <br/>\nnormally<br/>\nhave my rearview mirror planted square on them, but this time I<br/>\nconcentrated on traffic until I saw the tussle in the back. I<br/>\nimmediately pulled over and told DS to get out of the van. He asked if <br/>\nI<br/>\nwas going to leave him, I said no.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nWhy would he ask that? Is that a real fear? Has he been told that <br/>\nbefore? By anyone?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n He had to stay and wait while I<br/>\ncleaned up his brother. I told him that I can&#39;t allow him back in if<br/>\nhe&#39;s going to be a danger to his brother.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nSo it *is* a fear.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n I let him back in after he<br/>\napologized and after he answered affirmatively my question of whether<br/>\nhe&#39;s going to be safe with his brothers.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nWhether he&#39;s lying or not?<br/>\n<br/>\n-=-=-=-=--<br/>\n<br/>\nI still feel angry over this. I&#39;ve tried explaining things over and <br/>\nover<br/>\nand I did the same #1 #2 policy in my own accord. It&#39;s not working.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nChange the anger to curiosity.<br/>\n<br/>\nWHY is it nor working?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nI feel angry about oldest DS&#39;s tendency to take things away from his<br/>\ntwin brothers.  It&#39;s constant competition and jealousy and I do NOT <br/>\nwant<br/>\nthis for them. I want peace in my house. :(<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nI know it sounds silly, but it&#39;s that zen thang:<br/>\n<br/>\nBE the peace!<br/>\n<br/>\nWhy do they feel compettitive and jealous? What is causing that?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nOk venting over - I think the big issue here is that I&#39;m Deaf and they<br/>\ndo not sign when they&#39;re quarreling. So how can I intervene when I <br/>\ncan&#39;t<br/>\ncatch when things are escalating? (Why my children don&#39;t sign all the<br/>\ntime is a long story and something I wish did not happen.)<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nYeah---I keep forgetting you&#39;re deaf! &lt;G&gt;<br/>\n<br/>\nThey need to trust you&#39;re there to help them figure it out.<br/>\n<br/>\n-=-=-=-=-=-=-<br/>\n<br/>\n<br/>\n  Often oldest DS says one of his (4 yr old) brothers has said something <br/>\nthat he<br/>\ndisagreed with and I ask him if whacking him solved the problem.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nYeah---but how is that helping them?<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nEmail and AIM finally together. You&#39;ve gotta check out free AOL Mail! - <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.aol.com\">http://mail.aol.com</a></div>","specialLinks":[]},{"userId":313556993,"authorName":"Adrean Clark","from":"Adrean Clark &lt;adrean@...&gt;","profile":"fuzzyellowduck","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Principles in your house ...","postDate":"1195841797","msgId":27992,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExOTU4NDE4MDIuMzM0NDk2QzJAZGkxMS5kbmdyLm9yZz4=","inReplyToHeader":"PDY3YTlkNzUwMDcxMTIzMDkzNnlkYzk3ZjNkeWI4MzQyYTZiY2EyNmQxMTVAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PEMzNkE2Njg0LjczNDAlem9hY29ubmVyQGNvbWNhc3QubmV0PiA8NjdhOWQ3NTAwNzExMjMwOTM2eWRjOTdmM2R5YjgzNDJhNmJjYTI2ZDExNUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":27991,"nextInTopic":27994,"prevInTime":27991,"nextInTime":27993,"topicId":27946,"numMessagesInTopic":0,"msgSnippet":"I could do that. DS is getting some things like a guitar that will be his alone. Other things like Legos, etc., I think would be unfair to withhold from his","messageBody":"<div id=\"ygrps-yiv-1966285211\">I could do that. DS is getting some things like a guitar that will be <br/>\nhis alone. Other things like Legos, etc., I think would be unfair to <br/>\nwithhold from his brothers, esp because he has a 3 gallon+ box full of <br/>\nthem. I guess I would need to talk with him about it.<br/>\n<br/>\nMy parents bought a VTech for the twins (they said it was too good a <br/>\ndeal to pass up...) and I know DS will want to get his hands on it too. <br/>\nI am hoping my sister will loan us a Nintendo DS so he won&#39;t feel the <br/>\nneed to grab from them.<br/>\n<br/>\nI&#39;ll work on that space issue, have been thinking about segmentalizing <br/>\nmy office room so they all can have their own corners. What have you all <br/>\nused for room &quot;dividers&quot;? We are in an apartment so can&#39;t really use <br/>\nheavy duty stuff.<br/>\n<br/>\nI already created a lot of space by having us all sleep in one room <br/>\n(bunk beds, mattress on the floor, etc.) And the other rooms are the <br/>\nplayroom and my office. That &quot;office&quot; room can be split up in <br/>\nsubdivisons somehow. I like the way it is now, with our space defined <br/>\nmore by purpose instead of ownership. Lots of free floor room when we <br/>\nkeep it neat. :) Downside is the kids&#39; fighting, so I better work on <br/>\ncreating some containers and corners for them.<br/>\n<br/>\nThe problem isn&#39;t just the noise with the fighting - it&#39;s catching what <br/>\nthey&#39;re saying before the fights happen. It drives me crazy that they <br/>\nhave had a lack of respectful language models. People who can sign talk <br/>\nverbally with each other in front of me and my children follow their <br/>\nexample.  I have asked them respectfully to sign without voicing so my <br/>\njob would be easier, but they continue to ignore me. &quot;I forgot,&quot; &quot;it&#39;s a <br/>\nhabit,&quot; etc.<br/>\n<br/>\nCommunicating with my own children is very impt to me, and I&#39;ve been <br/>\ntrying to work with them. I keep feeling like my efforts are undermined <br/>\n- by the school system, by well-meaning relatives.<br/>\n<br/>\nOn my part I need to try harder in making the boys feel welcome in <br/>\nsharing with me, so that they will want to be sure I&#39;m included, and <br/>\nthat they will maybe have more appreciation of ASL.<br/>\n<br/>\nI&#39;ve been reading the pointers you all have shared--appreciate those <br/>\nvery much!  Anyone have experience with having a second language at <br/>\nhome?<br/>\n--Adrean</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"&quot;Karen Swanay&quot; &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Principles in your house ...","postDate":"1195839374","msgId":27991,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3YTlkNzUwMDcxMTIzMDkzNnlkYzk3ZjNkeWI4MzQyYTZiY2EyNmQxMTVAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PEY0MERBREVCLUNBNkEtNDI1QS1BOUE1LTFCQTkzNjUwNTlBRUB2ZXJpem9uLm5ldD4=","referencesHeader":"PEMzNkE2Njg0LjczNDAlem9hY29ubmVyQGNvbWNhc3QubmV0PgkgPDhDOUZCNkQyMTI4OUZDMC0zNzgtQTk2NkB3ZWJtYWlsLWRhMDQuc3lzb3BzLmFvbC5jb20+CSA8RjQwREFERUItQ0E2QS00MjVBLUE5QTUtMUJBOTM2NTA1OUFFQHZlcml6b24ubmV0Pg=="},"prevInTopic":27975,"nextInTopic":27992,"prevInTime":27990,"nextInTime":27992,"topicId":27946,"numMessagesInTopic":0,"msgSnippet":"On this topic, we are about to bring home a 3 yr old child from an ... Back to OP problem, can you corral the little ones?  Give the big one some safe and","messageBody":"<div id=\"ygrps-yiv-1447040207\">On this topic, we are about to bring home a 3 yr old child from an<br/>\n<blockquote><span title=\"ireply\"> &gt; orphanage in China.  She has lived there for her whole life.  She may have<br/>\n&gt; autism but we don&#39;t know.  We do know she does not speak and she doesn&#39;t<br/>\n&gt; understand any English.  (I shouldn&#39;t have to say that but many people think<br/>\n&gt; she knows English so I&#39;m offering it.)  I have two boys 11 and 9 yrs old and<br/>\n&gt; they know and already have a baby gate to put up in their door so that Xian<br/>\n&gt; Yi can&#39;t get in their room.  That&#39;s where all their stuff is.  We have<br/>\n&gt; already talked about what her level of control is going to be and how easily<br/>\n&gt; she will get frustrated.  If they leave their stuff in the rest of the house<br/>\n&gt; it&#39;s going to be broken or taken by their little sister maybe.  So they know<br/>\n&gt; if they want to keep it safe, it has to be kept where she can&#39;t get to it.<br/>\n&gt; They have been told this over and over.  We&#39;ve discussed this too.  And they<br/>\n&gt; were actually used to the idea from having a puppy around.  If they left<br/>\n&gt; their stuff around the puppy would chew it.  So they are pretty good about<br/>\n&gt; not leaving it about when there is &quot;danger&quot; around.  I think offering them<br/>\n&gt; sancutary from this little girl who may behave like a monkey on crack is the<br/>\n&gt; right way to go.  I am not going to make them share their stuff with her.<br/>\n&gt; It&#39;s theirs and afterall I don&#39;t want my stuff broken and I&#39;m not going to<br/>\n&gt; give my stuff to her, they shouldn&#39;t be forced to do the same.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Back to OP problem, can you corral the little ones?  Give the big one some<br/>\nsafe and sacred space where he doesn&#39;t feel as though he has to fight them<br/>\noff?  I&#39;m all for sharing, but both my kids, as my mother did with us, have<br/>\nthings they NEVER under any circumstances ever have to share with anyone.  I<br/>\nthink it&#39;s important to have those few things that they can know are<br/>\ntheirs.  Now, on good days, I often find them sharing those special things<br/>\nwillingly, but I don&#39;t &quot;make&quot; them share them.  And when we have company<br/>\nover, (since most other kids and parents don&#39;t understand why we do this) I<br/>\nhave them put those special things away and they like that.  It&#39;s not that I<br/>\nwouldn&#39;t go to bat and defend their right to withhold those items but they<br/>\nwould rather the kids coming in not even know they have said objects.  So I<br/>\noffer a space in my room where kids (visitors) are not allowed to go until<br/>\nthe kids leave and my boys can retrieve their stuff.<br/>\n<br/>\nPerhaps you can ask your oldest child which things are the items he doesn&#39;t<br/>\nwant to have to share with his brothers and then get him a baby gate for the<br/>\ndoor to his room.  Move all the other crap (and most kids have toys they<br/>\nhave outgrown interest in) to where the younger kids have access.  This may<br/>\nbe all you need to fix this issue.<br/>\n<br/>\nAs to the fighting and being deaf, I train service dogs, I have trained a<br/>\nhearing dog to alert a parent when their kids were beginning to fight. If<br/>\nyou have a dog you could do that.  Or you could get someone to do that for<br/>\nyou.  That&#39;s an easy fix.<br/>\n<br/>\nHTH,<br/>\nKaren<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>-- <br/>\n&quot;Family isn&#39;t about whose blood you have.  It&#39;s about who you care about.&quot;<br/>\n<br/>\nLOI 1/26/07<br/>\nPA 3/22/07<br/>\nDTC 8/10/07<br/>\nLOA 11/9/07<br/>\nTA ?<br/>\nDisclaimer: Any errors in spelling, tact, or fact are transmission errors.<br/>\n<br/>\n~*~ ~*~ ~*~ ~*~ ~*~ ~*~ ~*~<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Principles in your house ...","postDate":"1195815392","msgId":27975,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY0MERBREVCLUNBNkEtNDI1QS1BOUE1LTFCQTkzNjUwNTlBRUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDhDOUZCNkQyMTI4OUZDMC0zNzgtQTk2NkB3ZWJtYWlsLWRhMDQuc3lzb3BzLmFvbC5jb20+","referencesHeader":"PEMzNkE2Njg0LjczNDAlem9hY29ubmVyQGNvbWNhc3QubmV0PiA8OEM5RkI2RDIxMjg5RkMwLTM3OC1BOTY2QHdlYm1haWwtZGEwNC5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":27974,"nextInTopic":27991,"prevInTime":27974,"nextInTime":27976,"topicId":27946,"numMessagesInTopic":0,"msgSnippet":"... Good list! And, again, don t think of those as rules. You aren t going to *make* your kids be thoughtful. It isn t a standard that you ll make them live up","messageBody":"<div id=\"ygrps-yiv-584714147\"><blockquote><span title=\"ireply\">&gt; Kindness<br/>\n&gt; Generosity<br/>\n&gt; Patience<br/>\n&gt; Trust<br/>\n&gt; Respect for ourselves and others<br/>\n&gt; Gentleness with animals<br/>\n&gt; Thoughtfulness<br/>\n&gt; Safety<br/>\n&gt; Honesty<br/>\n&gt; Flexibility<br/>\n&gt; Courtesy<br/>\n&gt; Gratefulness<br/>\n&gt; Empathy<br/>\n<br/>\n </span></blockquote>Good list!<br/>\n<br/>\nAnd, again, don&#39;t think of those as rules. You aren&#39;t going to *make*  <br/>\nyour kids be thoughtful. It isn&#39;t a standard that you&#39;ll make them  <br/>\nlive up to.<br/>\n<br/>\nBe thoughtful toward them. You can also help them think up ways you  <br/>\ncan both do something thoughtful for someone else who has done nice  <br/>\nthings for you. (And if they don&#39;t want to, you do it because it&#39;s  <br/>\nimportant to you to be thoughtful. If you don&#39;t want to do it on your  <br/>\nown, you shouldn&#39;t be making them do it! Do it because you feel it&#39;s  <br/>\nthe right thing to do, not because it&#39;s a lesson you want to impose  <br/>\non your kids. *Live* your principles.)<br/>\n<br/>\nLive these. Use these in your interactions with them and others. Help  <br/>\nthem use them as tools to figure out problems. That&#39;s what they are:  <br/>\ntools to help us decide if something is in keeping with our philosophy.<br/>\n<br/>\nHere&#39;s something I wrote a bit ago:<br/>\n<br/>\nNo right or wrong way to unschool<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/unschooling/noonerightwaytounschool.html\">http://joyfullyrejoycing.com/unschooling/noonerightwaytounschool.html</a><br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Principles in your house ...","postDate":"1195814826","msgId":27974,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwRkU5MkQ0LTlEQTgtNEE4Ny04RDhELUQwQkY0Q0VDQjM2NEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDExOTU3ODYyMjAuMTEwOUFERkVAZ2IzMi5kbmdyLm9yZz4=","referencesHeader":"PEMzNkE2Njg0LjczNDAlem9hY29ubmVyQGNvbWNhc3QubmV0PiA8OEM5RkI2RDIxMjg5RkMwLTM3OC1BOTY2QHdlYm1haWwtZGEwNC5zeXNvcHMuYW9sLmNvbT4gPDExOTU3NzEwNTguMjE4ODQwNUNAZmI3LmRuZ3Iub3JnPiA8OEM5RkI4N0MwMEE2MDRDLTM3OC1BQzc1QHdlYm1haWwtZGEwNC5zeXNvcHMuYW9sLmNvbT4gPDExOTU3ODI2MjUuMjc2REJDRURAYmMxMi5kbmdyLm9yZz4gPDExOTU3ODQ1NzYuMTQ3MTExNUBmZTExLmRuZ3Iub3JnPiA8MTE5NTc4NjIyMC4xMTA5QURGRUBnYjMyLmRuZ3Iub3JnPg=="},"prevInTopic":27973,"nextInTopic":27975,"prevInTime":27973,"nextInTime":27975,"topicId":27946,"numMessagesInTopic":0,"msgSnippet":"... Oops, meant to respond to that. It s not true, though. Sometimes they aren t kind to each other. Sometimes I bet you aren t kind to them. (I know I m","messageBody":"<div id=\"ygrps-yiv-2115816772\">On Nov 22, 2007, at 9:49 PM, Adrean Clark wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  would try the &quot;we are<br/>\n&gt; kind to each other&quot; tack.<br/>\n<br/>\n </span></blockquote>Oops, meant to respond to that.<br/>\n<br/>\nIt&#39;s not true, though. Sometimes they aren&#39;t kind to each other.  <br/>\nSometimes I bet you aren&#39;t kind to them. (I know I&#39;m guilty!)<br/>\n<br/>\nThat&#39;s just imposing your principles on them. Use your principles to  <br/>\nhelp them solve their problems.<br/>\n<br/>\nTry &quot;I need everyone to feel safe in this house. How can we fix this  <br/>\nproblem?&quot;<br/>\n<br/>\nSometimes you&#39;ll need to pull one aside and let them tell you what  <br/>\nhappened. Really listen to them. Don&#39;t think in terms of &quot;Yeah, yeah,  <br/>\nBUT ..&quot;<br/>\n<br/>\nIf he&#39;s saying his brothers are pissing him off, then they&#39;re pissing  <br/>\nhim off. Don&#39;t dismiss it. Often what people want to hear is &quot;Yes, I  <br/>\nunderstand. That is frustrating.&quot; They *don&#39;t* want it followed by  <br/>\nBUT! You can, though, go on and talk about what he could have done  <br/>\ndifferently or could do next time.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Principles in your house ...","postDate":"1195814501","msgId":27973,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQxMjQ1QjExLUM3QzgtNEY1RC04QUE3LUM5MkE2RUE3NTQ5OUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDExOTU3ODYyMjAuMTEwOUFERkVAZ2IzMi5kbmdyLm9yZz4=","referencesHeader":"PEMzNkE2Njg0LjczNDAlem9hY29ubmVyQGNvbWNhc3QubmV0PiA8OEM5RkI2RDIxMjg5RkMwLTM3OC1BOTY2QHdlYm1haWwtZGEwNC5zeXNvcHMuYW9sLmNvbT4gPDExOTU3NzEwNTguMjE4ODQwNUNAZmI3LmRuZ3Iub3JnPiA8OEM5RkI4N0MwMEE2MDRDLTM3OC1BQzc1QHdlYm1haWwtZGEwNC5zeXNvcHMuYW9sLmNvbT4gPDExOTU3ODI2MjUuMjc2REJDRURAYmMxMi5kbmdyLm9yZz4gPDExOTU3ODQ1NzYuMTQ3MTExNUBmZTExLmRuZ3Iub3JnPiA8MTE5NTc4NjIyMC4xMTA5QURGRUBnYjMyLmRuZ3Iub3JnPg=="},"prevInTopic":27972,"nextInTopic":27974,"prevInTime":27972,"nextInTime":27974,"topicId":27946,"numMessagesInTopic":0,"msgSnippet":"... The point isn t to see being with them as the one and only solution but a way that will help eliminate a lot of it. ... Don t be irritated with them! See","messageBody":"<div id=\"ygrps-yiv-860038289\">On Nov 22, 2007, at 9:49 PM, Adrean Clark wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; As for leaving them alone, that annoys me to no end because no parent<br/>\n&gt; ever is right there supervising their children eyeball to eyeball  <br/>\n&gt; 24/7.<br/>\n<br/>\n </span></blockquote>The point isn&#39;t to see being with them as the one and only solution  <br/>\nbut a way that will help eliminate a lot of it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  The moment I look away somebody comes up to me saying he hit me!   <br/>\n&gt; I am<br/>\n&gt; so irritated and frustrated with them about that.<br/>\n<br/>\n </span></blockquote>Don&#39;t be irritated with them! See it as a cry for help. They don&#39;t  <br/>\nknow what to do or how to solve the problem.<br/>\n<br/>\nThey&#39;re in a mindset that says &quot;If I don&#39;t grab what I want then I&#39;m  <br/>\nnot going to be able to get it.&quot;<br/>\n<br/>\nYou need to help them out of that.<br/>\n<br/>\nYou&#39;re in a mindset that you need to stop the hitting. What will help  <br/>\nis looking past the hitting to what&#39;s causing the hitting. Obviously  <br/>\nstop the hitting but then focus on the problem. You&#39;re turning the  <br/>\nhitting into the problem and the original problem is probably getting  <br/>\nlost in the confusion. Focus on the original problem. Help them  <br/>\nfigure out how to fix that. Help them know that you want to help  <br/>\neveryone get what they need *and* feel safe.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think the big issue here is that I&#39;m Deaf and they<br/>\n&gt; do not sign when they&#39;re quarreling. So how can I intervene when I  <br/>\n&gt; can&#39;t<br/>\n&gt; catch when things are escalating?<br/>\n<br/>\n </span></blockquote>Can he sit up front with you? Don&#39;t impose it as a rule. Use it as a  <br/>\nway to help him not hurt them. Tell him you need help in figuring out  <br/>\nhow to keep everyone safe.<br/>\n<br/>\nSandra Dodd told her kids that if she hit someone that she&#39;d be  <br/>\narrested. It&#39;s not legally okay to hit. (That is *not* issued as a  <br/>\nthreat. It&#39;s just a fact.) Tell him you want to help him figure out  <br/>\nways to solve problems because hitting&#39;s not going to help him at all  <br/>\nwhen he&#39;s an adult.<br/>\n<br/>\nRather than focusing on changing them from kids who hit to kids who  <br/>\ndon&#39;t hit, help them find ways not to hit. When they hit it&#39;s a cry  <br/>\nfor help. They really don&#39;t know what else to do. Telling them not to  <br/>\nis obviously not working.<br/>\n<br/>\nFocus on what led up to the hitting. If it&#39;s toys they&#39;re fighting  <br/>\nover, help them figure out ahead of time ways to not fight over the  <br/>\ntoys. Involve them all in helping solve the problem and listen to  <br/>\ntheir ideas. If the ideas don&#39;t pan out, help them revise them and  <br/>\nthink up new ideas.<br/>\n<br/>\nThe transition period is rough. They&#39;re used to fighting to get their  <br/>\nneeds met. They&#39;re going to hear your attempts at helping them  <br/>\nproblem solve as just new ways to say &quot;Stop hitting and fix this  <br/>\nproblem now.&quot; It will take a while until they gain confidence that  <br/>\nyou really are committed to helping them get what they want.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Principles in your house ...","postDate":"1195813353","msgId":27972,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5QkMzMDNFLTlCMjgtNERCOS04MjQ1LTUyRUVBOTU0N0I1RUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDExOTU3NzEwNTguMjE4ODQwNUNAZmI3LmRuZ3Iub3JnPg==","referencesHeader":"PEMzNkE2Njg0LjczNDAlem9hY29ubmVyQGNvbWNhc3QubmV0PiA8OEM5RkI2RDIxMjg5RkMwLTM3OC1BOTY2QHdlYm1haWwtZGEwNC5zeXNvcHMuYW9sLmNvbT4gPDExOTU3NzEwNTguMjE4ODQwNUNAZmI3LmRuZ3Iub3JnPg=="},"prevInTopic":27968,"nextInTopic":27973,"prevInTime":27971,"nextInTime":27973,"topicId":27946,"numMessagesInTopic":0,"msgSnippet":"... Apparently they need more help. You re seeing the world through your eyes and wondering why they can t too. See the world through their eyes. Assume","messageBody":"<div id=\"ygrps-yiv-987703994\">On Nov 22, 2007, at 5:37 PM, Adrean Clark wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I still struggle with my boys punching each other :(  I say, &quot;don&#39;t  <br/>\n&gt; hit,<br/>\n&gt; use your words!&quot; and they still whack each other.<br/>\n<br/>\n </span></blockquote>Apparently they need more help. You&#39;re seeing the world through your  <br/>\neyes and wondering why they can&#39;t too. See the world through their eyes.<br/>\n<br/>\nAssume they&#39;re doing the best they can. The advice you&#39;re giving them  <br/>\nobviously is not working for them to solve the problem. If I&#39;d kept  <br/>\nasking my sister to give something to me when we were kids and she  <br/>\nwouldn&#39;t .. then what? If mom said only use words and didn&#39;t give me  <br/>\na tool to use after the words had failed it would be maddening. I&#39;d  <br/>\nwant to smack her! ;-) What other choice would I have when the only  <br/>\ntool she&#39;d given me had failed?<br/>\n<br/>\nSandra Dodd had 3 steps:<br/>\n<br/>\n1) talk it out<br/>\n2) get an adult to help<br/>\n3) then hit<br/>\n<br/>\nShe has a lot of good writing at:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/fighting\">http://sandradodd.com/peace/fighting</a><br/>\n<br/>\nAlso you need to be present more. Mindful parenting isn&#39;t a list of  <br/>\nrules to hand to kids and send them off with. Be their partner in  <br/>\nhelping them get what they want. Rather than seeing situations as  <br/>\nsomething to fix, figure out ways to *help* them get what they want.  <br/>\nIt&#39;s a subtle but important role shift.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My oldest also has a tendency to want whatever his brothers have. It<br/>\n&gt; annoys me very much because they are younger and have little in<br/>\n&gt; comparison to him yet he&#39;s grabbing their stuff.<br/>\n<br/>\n </span></blockquote>What you&#39;ve written dismisses his feelings. He has a need and he&#39;s  <br/>\ntrying to fulfill it and you&#39;re blowing off his need because they&#39;re  <br/>\nyounger and he&#39;s older. That&#39;s not only maddening but whittling away  <br/>\nat your relationship with him. He sees you putting them ahead of him.<br/>\n<br/>\nSeparate his need from his actions. Don&#39;t dismiss his need just  <br/>\nbecause he doesn&#39;t have the tools to meet it. *Help* him meet it.<br/>\n<br/>\nThat&#39;s doesn&#39;t mean everyone will get what they want immediately. But  <br/>\nhelp them build trust in you that you will work hard to help  <br/>\n*everyone* get what they want.<br/>\n<br/>\nThe reason kids keep fighting over something they want is because  <br/>\nthey&#39;ve learned from past behavior that&#39;s the only way to get it.  <br/>\nGive them the confidence that their needs are important to you and  <br/>\nyou will help them.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":313556993,"authorName":"Adrean Clark","from":"Adrean Clark &lt;adrean@...&gt;","profile":"fuzzyellowduck","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Principles in your house ...","postDate":"1195786167","msgId":27968,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExOTU3ODYyMjAuMTEwOUFERkVAZ2IzMi5kbmdyLm9yZz4=","inReplyToHeader":"PDhDOUZCODdDMDBBNjA0Qy0zNzgtQUM3NUB3ZWJtYWlsLWRhMDQuc3lzb3BzLmFvbC5jb20+","referencesHeader":"PEMzNkE2Njg0LjczNDAlem9hY29ubmVyQGNvbWNhc3QubmV0PiA8OEM5RkI2RDIxMjg5RkMwLTM3OC1BOTY2QHdlYm1haWwtZGEwNC5zeXNvcHMuYW9sLmNvbT4gPDExOTU3NzEwNTguMjE4ODQwNUNAZmI3LmRuZ3Iub3JnPiA8OEM5RkI4N0MwMEE2MDRDLTM3OC1BQzc1QHdlYm1haWwtZGEwNC5zeXNvcHMuYW9sLmNvbT4gPDExOTU3ODI2MjUuMjc2REJDRURAYmMxMi5kbmdyLm9yZz4gPDExOTU3ODQ1NzYuMTQ3MTExNUBmZTExLmRuZ3Iub3JnPg=="},"prevInTopic":27966,"nextInTopic":27972,"prevInTime":27967,"nextInTime":27969,"topicId":27946,"numMessagesInTopic":0,"msgSnippet":"I have the same policy for them, #1 talk it out, #2 ask mom for help. As for leaving them alone, that annoys me to no end because no parent ever is right there","messageBody":"<div id=\"ygrps-yiv-1713597315\">I have the same policy for them, #1 talk it out, #2 ask mom for help.  <br/>\nAs for leaving them alone, that annoys me to no end because no parent <br/>\never is right there supervising their children eyeball to eyeball 24/7. <br/>\nThe moment I look away somebody comes up to me saying he hit me!  I am <br/>\nso irritated and frustrated with them about that.<br/>\n<br/>\nOne time the oldest punched one of his twin brothers in the nose so hard <br/>\nit bled. We were in the van driving back home from school and I normally <br/>\nhave my rearview mirror planted square on them, but this time I <br/>\nconcentrated on traffic until I saw the tussle in the back. I <br/>\nimmediately pulled over and told DS to get out of the van. He asked if I <br/>\nwas going to leave him, I said no. He had to stay and wait while I <br/>\ncleaned up his brother. I told him that I can&#39;t allow him back in if <br/>\nhe&#39;s going to be a danger to his brother. I let him back in after he <br/>\napologized and after he answered affirmatively my question of whether <br/>\nhe&#39;s going to be safe with his brothers.<br/>\n<br/>\nI still feel angry over this. I&#39;ve tried explaining things over and over <br/>\nand I did the same #1 #2 policy in my own accord. It&#39;s not working.<br/>\n<br/>\nI feel angry about oldest DS&#39;s tendency to take things away from his <br/>\ntwin brothers.  It&#39;s constant competition and jealousy and I do NOT want <br/>\nthis for them. I want peace in my house. :(<br/>\n<br/>\nOk venting over - I think the big issue here is that I&#39;m Deaf and they <br/>\ndo not sign when they&#39;re quarreling. So how can I intervene when I can&#39;t <br/>\ncatch when things are escalating? (Why my children don&#39;t sign all the <br/>\ntime is a long story and something I wish did not happen.) Often oldest <br/>\nDS says one of his (4 yr old) brothers has said something that he <br/>\ndisagreed with and I ask him if whacking him solved the problem.<br/>\n<br/>\nI think the issue here is that he&#39;s outnumbered - the twins are close to <br/>\neach other and he&#39;s alone. We also have a lot of things shared in <br/>\ncommon. He&#39;s had &quot;his&quot; things before but as the twins grow into his <br/>\nstuff things get a little mixed up. He grabs their things as well.<br/>\n<br/>\nI&#39;m guessing a solution would be to establish separate toy bins for each <br/>\nboy and have their names on them, and separate items for each of them? <br/>\nThis way they can have true ownership and feel free to share...  And <br/>\ninstead of doing the steps which aren&#39;t working, I would try the &quot;we are <br/>\nkind to each other&quot; tack.  Any more suggestions?<br/>\n<br/>\n--Adrean</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Principles in your house ...","postDate":"1195781508","msgId":27966,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOUZCODdDMDBBNjA0Qy0zNzgtQUM3NUB3ZWJtYWlsLWRhMDQuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PDExOTU3NzEwNTguMjE4ODQwNUNAZmI3LmRuZ3Iub3JnPg==","referencesHeader":"PEMzNkE2Njg0LjczNDAlem9hY29ubmVyQGNvbWNhc3QubmV0PiA8OEM5RkI2RDIxMjg5RkMwLTM3OC1BOTY2QHdlYm1haWwtZGEwNC5zeXNvcHMuYW9sLmNvbT4gPDExOTU3NzEwNTguMjE4ODQwNUNAZmI3LmRuZ3Iub3JnPg=="},"prevInTopic":27960,"nextInTopic":27968,"prevInTime":27965,"nextInTime":27967,"topicId":27946,"numMessagesInTopic":0,"msgSnippet":"... From: Adrean Clark  I still struggle with my boys punching each other :(  I say, don t hit, use your words! and they still whack each","messageBody":"<div id=\"ygrps-yiv-1439517775\">-----Original Message-----<br/>\nFrom: Adrean Clark &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:adrean@...\">adrean@...</a>&gt;<br/>\n<br/>\nI still struggle with my boys punching each other :(  I say, &quot;don&#39;t <br/>\nhit,<br/>\nuse your words!&quot; and they still whack each other.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n&quot;We are kind and gentle with each other.&quot;<br/>\n<br/>\n&quot;It&#39;s my job to make sure *each and every ONE* of you feels safe in <br/>\nthis house.&quot;<br/>\n<br/>\nAnd you need to be close by. Why are they left alone long enough for <br/>\nthings to escalate to punching?<br/>\n<br/>\nSandra told her boys there are three steps:<br/>\n<br/>\n1) talk it out<br/>\n2) if that doesn&#39;t work, get an adult to help you work it out<br/>\n3) if that doesn&#39;t work, you can hit each other<br/>\n<br/>\nBUT! They have to go through steps one and two FIRST! &lt;G&gt;<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nMy oldest also has a tendency to want whatever his brothers have. It<br/>\nannoys me very much because they are younger and have little in<br/>\ncomparison to him yet he&#39;s grabbing their stuff.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nWas he made to share with his younger siblings? Is he allowed to have <br/>\nthings that are his and his alone?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nDS is still going through deschooling, so is it related to destressing <br/>\nfrom school?<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nMaybe---is this new behavior?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nOr is it he is jealous of them?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nDoes he have reason to be?<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nEmail and AIM finally together. You&#39;ve gotta check out free AOL Mail! - <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.aol.com\">http://mail.aol.com</a></div>","specialLinks":[]},{"userId":313556993,"authorName":"Adrean Clark","from":"Adrean Clark &lt;adrean@...&gt;","profile":"fuzzyellowduck","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Principles in your house ...","postDate":"1195771053","msgId":27960,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExOTU3NzEwNTguMjE4ODQwNUNAZmI3LmRuZ3Iub3JnPg==","inReplyToHeader":"PDhDOUZCNkQyMTI4OUZDMC0zNzgtQTk2NkB3ZWJtYWlsLWRhMDQuc3lzb3BzLmFvbC5jb20+","referencesHeader":"PEMzNkE2Njg0LjczNDAlem9hY29ubmVyQGNvbWNhc3QubmV0PiA8OEM5RkI2RDIxMjg5RkMwLTM3OC1BOTY2QHdlYm1haWwtZGEwNC5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":27959,"nextInTopic":27966,"prevInTime":27959,"nextInTime":27961,"topicId":27946,"numMessagesInTopic":0,"msgSnippet":"How do you implement those principles? I still struggle with my boys punching each other :(  I say, don t hit, use your words! and they still whack each","messageBody":"<div id=\"ygrps-yiv-2099184280\">How do you implement those principles?<br/>\n<br/>\nI still struggle with my boys punching each other :(  I say, &quot;don&#39;t hit, <br/>\nuse your words!&quot; and they still whack each other.<br/>\n<br/>\nMy oldest also has a tendency to want whatever his brothers have. It <br/>\nannoys me very much because they are younger and have little in <br/>\ncomparison to him yet he&#39;s grabbing their stuff.  DS is still going <br/>\nthrough deschooling, so is it related to destressing from school? Or is <br/>\nit he is jealous of them?<br/>\n<br/>\n--Adrean</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Principles in your house ...","postDate":"1195770074","msgId":27959,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOUZCNkQyMTI4OUZDMC0zNzgtQTk2NkB3ZWJtYWlsLWRhMDQuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PEMzNkE2Njg0LjczNDAlem9hY29ubmVyQGNvbWNhc3QubmV0Pg==","referencesHeader":"PEMzNkE2Njg0LjczNDAlem9hY29ubmVyQGNvbWNhc3QubmV0Pg=="},"prevInTopic":27946,"nextInTopic":27960,"prevInTime":27958,"nextInTime":27960,"topicId":27946,"numMessagesInTopic":0,"msgSnippet":"... From: Zoa Conner  I just read Danielle s article on principles vs. rule. Now I am wondering - from those of you who have made this","messageBody":"<div id=\"ygrps-yiv-1943746587\">-----Original Message-----<br/>\nFrom: Zoa Conner &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:zoaconner@...\">zoaconner@...</a>&gt;<br/>\n<br/>\nI just read Danielle&#39;s article on principles vs. rule. Now I am <br/>\nwondering -<br/>\nfrom those of you who have made this switch fully - which principles are<br/>\nrelevant for your households? Would anyone mind sharing?<br/>\n<br/>\n-=-=-=-=--=<br/>\n<br/>\nKindness<br/>\nGenerosity<br/>\nPatience<br/>\nTrust<br/>\nRespect for ourselves and others<br/>\nGentleness with animals<br/>\nThoughtfulness<br/>\nSafety<br/>\nHonesty<br/>\nFlexibility<br/>\nCourtesy<br/>\nGratefulness<br/>\nEmpathy<br/>\n<br/>\nThere may be some others, but these jumped out of my head immediately.<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nEmail and AIM finally together. You&#39;ve gotta check out free AOL Mail! - <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.aol.com\">http://mail.aol.com</a></div>","specialLinks":[]},{"userId":224031522,"authorName":"Zoa Conner","from":"Zoa Conner &lt;zoaconner@...&gt;","profile":"zoaconner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Principles in your house ...","postDate":"1195703380","msgId":27946,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMzNkE2Njg0LjczNDAlem9hY29ubmVyQGNvbWNhc3QubmV0Pg=="},"prevInTopic":0,"nextInTopic":27959,"prevInTime":27945,"nextInTime":27947,"topicId":27946,"numMessagesInTopic":0,"msgSnippet":"I just read Danielle s article on principles vs. rule. Now I am wondering - from those of you who have made this switch fully - which principles are relevant","messageBody":"<div id=\"ygrps-yiv-1004828582\">I just read Danielle&#39;s article on principles vs. rule. Now I am wondering -<br/>\nfrom those of you who have made this switch fully - which principles are<br/>\nrelevant for your households? Would anyone mind sharing?<br/>\n----------------<br/>\nZoa Conner, PhD<br/>\nPhysicist and Montessori Homeschooling Mother<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:zoaconner@...\">zoaconner@...</a></div>","specialLinks":[]}],"prevTopicId":28030,"nextTopicId":28037}}