{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":336663632,"authorName":"Darcel","from":"&quot;Darcel&quot; &lt;harmonpanther228@...&gt;","profile":"harmonpanther228","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Speech","postDate":"1249659269","msgId":40959,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg1aGhpNSt0Z3ZoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg1ZmU2ais0MDU3QGVHcm91cHMuY29tPg=="},"prevInTopic":40943,"nextInTopic":0,"prevInTime":40958,"nextInTime":40960,"topicId":40915,"numMessagesInTopic":0,"msgSnippet":"Thank you for all of your responses. My husband read with me yesterday. He says he didn t realize h ow often he was doing it. We don t want her to develop a","messageBody":"<div id=\"ygrps-yiv-253716559\">Thank you for all of your responses. My husband read with me yesterday. He says he didn&#39;t realize h ow often he was doing it. We don&#39;t want her to develop a complex.<br/>\n<br/>\nWhen we did the program last year, she loved it. I think that&#39;s what she misses. She thought that was school and she really enjoyed it.<br/>\nIt was really like preschool and she would have work with a speech therapist one on one once a week.<br/>\n<br/>\nI am so happy to see that it&#39;s perfectly normal. <br/>\nI&#39;ll share these emails with my husband later as well.<br/>\n<br/>\nDarcel</div>","specialLinks":[]},{"userId":140583341,"authorName":"srmccann2003","from":"&quot;srmccann2003&quot; &lt;smccann@...&gt;","profile":"srmccann2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Speech","postDate":"1249590291","msgId":40943,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg1ZmU2ais0MDU3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg1Y2YxaSttMWhuQGVHcm91cHMuY29tPg=="},"prevInTopic":40940,"nextInTopic":40959,"prevInTime":40942,"nextInTime":40944,"topicId":40915,"numMessagesInTopic":0,"msgSnippet":"Hi Darcel, My son had fewer than 10 words at the age of three.  Luckily I had started teaching him sign language at 10 months but he still would become VERY","messageBody":"<div id=\"ygrps-yiv-64073670\">Hi Darcel,<br/>\n<br/>\nMy son had fewer than 10 words at the age of three.  Luckily I had started teaching him sign language at 10 months but he still would become VERY frustrated when he would try to verbalize and we couldn&#39;t understand him.  It was his intense frustration that pushed me to go for testing.  He then went through intense speech therapy after being diagnosed with verbal apraxia.  We were told when he was three and a half to start saving for a communication device because his apraxia was severe and he might never learn to communicate verbally.  They just didn&#39;t realize how tenacious a child he was and they were wrong.  He worked hard with his therapists (some terrible that we had to get rid of and some wonderful) because HE wanted to go and he dropped it last year when he told me he didn&#39;t want to continue with it, that it wasn&#39;t helping any more, at the age of seven.  <br/>\n<br/>\nNow you know the back ground you can see where I&#39;m coming from.  I can assure you someone telling my husband that something wasn&#39;t &quot;normal&quot; with his son went over like a lead balloon.  He STILL to this day doesn&#39;t want to believe there is ANYTHING that isn&#39;t just like everyone else about his son.  Believe me we had all the conversations - the tears, the disbelief, the arguments on how to proceed.  The thing that worked for me the most was to model for my husband.  Model the positive language feed back as someone else here recommended.  From when he was younger - &quot;fishing me want go&quot;  You want to go fishing?  From recently - &quot;Fire, it must have started that way&quot;  Oh, the fire over by the river last month? You think that it started how?<br/>\n<br/>\nAnd the MOST IMPORTANT thing I can tell you is to seek acceptance.  When my husband and I were able to truly see that we would love our son NO MATTER if he could speak or not, that he would be WONDERFUL and have a FULL and SUCCESSFUL life no matter his speech we began to see it all very differently.  Now I know Nick&#39;s apraxia is part of who he is.  Is it hard?  Yes.  Does he still at eight years get frustrated with word retrieval issues?  Yes.  Is it making reading very difficult?  Yes.  BUT he is a wonderful, feisty, tenacious child that WILL be okay.  Just like your daughter will be.<br/>\n<br/>\nIf you want to talk don&#39;t hesitate to contact me.<br/>\nAll the best,<br/>\nSarah<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:smccann@...\">smccann@...</a><br/>\n<br/>\n         <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Darcel&quot; &lt;harmonpanther228@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Our oldest is 4.5 yrs old and we had her in speech classes last summer. We had her evaluated in winter of 2008 and she qualified for the services. She wasn&#39;t in the program a full year. It was 3 days a week for 3 hours a day.<br/>\n&gt; <br/>\n&gt; We were going to put her in the program here this past Spring and it would&#39;ve been 5 days a week for 3 hours a day.<br/>\n&gt; We opted out of that and are glad that we did. My husband is concerned with her speech again lately. He pointed out that she talks in statements and not sentences. She also says things backwards alot.<br/>\n&gt; <br/>\n&gt; I&#39;m not really sure what to do or say to calm his fears. He corrects her a lot.<br/>\n&gt; she&#39;ll say &quot;food makes me bigger&quot; he wants her to say &quot;food makes me grow&quot; to her bigger is growing.<br/>\n&gt; I don&#39;t know if we should really be concerned. How do we know if she really has a speech problem? I really don&#39;t want to get involved with the school district. It made me feel she was behind and like there was something wrong with her. I know every child developes at their own pace.I really don&#39;t want to go there unless we have to.<br/>\n&gt; <br/>\n&gt; She talks a lot, and I noticed her big break through happened when we decided to unschool.<br/>\n&gt; I also noticed when she gets flustered she has trouble getting her words out. We tall her to calm down and start over. Sometimes she starts over 3 times.<br/>\n&gt; What do we do if there is anything that needs to be done?<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Darcel<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Speech","postDate":"1249589091","msgId":40940,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg1ZmQxMytjb2xrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg1Y2YxaSttMWhuQGVHcm91cHMuY29tPg=="},"prevInTopic":40933,"nextInTopic":40943,"prevInTime":40939,"nextInTime":40941,"topicId":40915,"numMessagesInTopic":0,"msgSnippet":"... *********************** Neither of those seem abnormal for a 4.5yo. My almost-8yo is still more likely to use brief statements - or gestures - than","messageBody":"<div id=\"ygrps-yiv-201803924\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Darcel&quot; &lt;harmonpanther228@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; He pointed out that she talks in statements and not sentences. She also says things backwards alot.<br/>\n </span></blockquote>***********************<br/>\n<br/>\nNeither of those seem abnormal for a 4.5yo. My almost-8yo is still more likely to use brief statements - or gestures - than sentences, at least until she&#39;s &quot;warmed up&quot;. First thing in the morning, she&#39;s most likely to communicate in glares ;)<br/>\n<br/>\nKids don&#39;t need to be corrected to learn, and there&#39;s some evidence that correcting speach hinders more than helps. Kids can hear the difference between what they say and what others say and will self-correct slowly over time, as they are able. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; she&#39;ll say &quot;food makes me bigger&quot;<br/>\n<br/>\n </span></blockquote>Its a completely developmentally appropriate statement. Some kids will even go through a phase where they segregate words into categories - plants &quot;grow&quot; but people &quot;get bigger&quot; for instance. Development is strange and often seems uneven.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t know if we should really be concerned. How do we know if she really has a speech problem?<br/>\n<br/>\n </span></blockquote>Do some research on child development, but don&#39;t limit your research to speach. If you read enough on the subject, you&#39;ll come across stories of different ways kids learn and grow. I&#39;ve found most sources have some useful information, but need to be read with some skepticism - there&#39;s not a lot out there tailored to unschoolers ;) Also, try to broaden your social circle. Meet more kids so you can see more of a range of development.<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":1123183,"authorName":"Deborah","from":"&quot;Deborah&quot; &lt;DACunefare@...&gt;","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Speech","postDate":"1249579174","msgId":40933,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg1ZjNiNitnZjduQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg1Y2YxaSttMWhuQGVHcm91cHMuY29tPg=="},"prevInTopic":40925,"nextInTopic":40940,"prevInTime":40932,"nextInTime":40934,"topicId":40915,"numMessagesInTopic":0,"msgSnippet":"***I also noticed when she gets flustered she has trouble getting her words out. We tall her to calm down and start over. Sometimes she starts over 3 times.***","messageBody":"<div id=\"ygrps-yiv-2046259007\">***I also noticed when she gets flustered she has trouble getting her words out. We tall her to calm down and start over. Sometimes she starts over 3 times.***<br/>\n<br/>\nI sometimes have a great deal of trouble &quot;getting my words out.&quot; In my case, I&#39;m trying to come up with a particular word, or sometimes just trying to retrieve the thought I was working on, and it seems utterly lost for a few seconds till it suddenly pops onto my tongue. I really treasure my friends who calmly and patiently wait for me to get where I&#39;m going. What helps the most is when they don&#39;t say anything at all - not even by suggesting the word they think I might be struggling with. (If it&#39;s the right word it might speed things up a tiny bit but if it&#39;s the wrong one it&#39;s liable to totally rupture my train of thought.) <br/>\n<br/>\nI know it&#39;s disconcerting to my friends to have me stop dead right in the middle of a sentence and stare into the distance. I feel it&#39;s such a gift to me for them to care enough about what I have to say that they just smile at me and maybe nod and wait.<br/>\n<br/>\nYour daughter isn&#39;t a middle aged menopausal woman, though. :) She&#39;s right in the middle of learning how to communicate her thoughts and ideas to others in this huge wonderful language we share! It&#39;s absolutely developmentally NORMAL for a child her age to be having trouble and to get flustered about it. When my children were young and stuttered or faltered, I tried very hard to do as my friends do for me now - calmly, patiently wait without speaking myself. Perhaps a smile or a calming touch, depending on the child. <br/>\n<br/>\nIt&#39;s also worth considering that a child who wants to please a parent who is constantly correcting their speech is likely to have MORE problems with speaking, not fewer. A bit of worry that she might not say things correctly and daddy will correct her can only add to fluency problems. It doesn&#39;t have to be harsh correction for it to affect the child negatively. My daughters have both adored their father, and their desire to look good in his eyes meant that any criticism really hit them hard.<br/>\n<br/>\nDeborah in IL</div>","specialLinks":[]},{"userId":374252530,"authorName":"Bunny Shank","from":"Bunny Shank &lt;bunnyshank@...&gt;","profile":"bunnyshank@rocketmail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Speech","postDate":"1249537768","msgId":40925,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4MTEwMC41MTYzMi5xbUB3ZWIxMTIyMjMubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGg1Y2YxaSttMWhuQGVHcm91cHMuY29tPg==","referencesHeader":"PGg1Y2YxaSttMWhuQGVHcm91cHMuY29tPg=="},"prevInTopic":40921,"nextInTopic":40933,"prevInTime":40924,"nextInTime":40926,"topicId":40915,"numMessagesInTopic":0,"msgSnippet":"You know your gut. If you feel it was the right decision to not enroll in services then there really wouldn t be much benefit if she attended. Did they give","messageBody":"<div id=\"ygrps-yiv-1588980735\">You know your gut. If you feel it was the right decision to not enroll in services then there really wouldn&#39;t be much benefit if she attended. Did they give you any support for what you could do to support her speech and language goals?<br/>\n<br/>\nHow do you know if she really has a speech delay: well really that is a label that gets you services and it based on specific skills that are compared to a group of &quot;typical kids&quot; her age. <br/>\nReally the measure that is important is how well is her communication functioning in her environment. Now a naturalistic therapist would mostly listen to you and your husband and your daughter and help you focus on what you want to see happen, if any thing. Then they would help you all organize a least intrusive avenue towards those goals.<br/>\n<br/>\nThen there are particular ways to model advanced grammar to children while at the same time respecting where they are in their development without a need to point out that they are &quot;wrong&quot;. For instance: <br/>\nDd : Food makes me bigger.<br/>\nDh: That&#39;s right you are eating food and getting bigger. Food makes you grow. You are growing everyday!<br/>\n<br/>\nIt may not seem like she&#39;ll get it without the pinpoint correction, but really this is the natural way kids get language lessons.<br/>\n<br/>\nAlso, I have an important perspective for you to consider: During the 3-5 year old range kids will often have a hard time &quot;getting their words out&quot;. The main thing to avoid during this time is an increase in self consciousness about how they talk  in sacrificing what they are saying. We want to encourage them to say whatever, however, even if its repeats, prolongs, stammers, sounds different etc. I would not recommend instructing a child stop and repeat what they are saying. If they do it voluntarily that is a different matter, but really I think the &quot;active listening&quot; technique is the most beneficial. <br/>\n Always think, &quot;its my problem that I&#39;m not understanding her, but I will find a way.&quot;<br/>\nI think if there was anyway you could find a speech therapist who was more on the naturalistic methodolgy, it would be helpful to get his/her input in how you and your husband could use these techniques at home.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Darcel &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:harmonpanther228@...\">harmonpanther228@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Wednesday, August 5, 2009 10:20:50 AM<br/>\nSubject: [unschoolingbasics] Speech<br/>\n<br/>\n   <br/>\nOur oldest is 4.5 yrs old and we had her in speech classes last summer. We had her evaluated in winter of 2008 and she qualified for the services. She wasn&#39;t in the program a full year. It was 3 days a week for 3 hours a day.<br/>\n<br/>\nWe were going to put her in the program here this past Spring and it would&#39;ve been 5 days a week for 3 hours a day.<br/>\nWe opted out of that and are glad that we did. My husband is concerned with her speech again lately. He pointed out that she talks in statements and not sentences. She also says things backwards alot.<br/>\n<br/>\nI&#39;m not really sure what to do or say to calm his fears. He corrects her a lot.<br/>\nshe&#39;ll say &quot;food makes me bigger&quot; he wants her to say &quot;food makes me grow&quot; to her bigger is growing.<br/>\nI don&#39;t know if we should really be concerned. How do we know if she really has a speech problem? I really don&#39;t want to get involved with the school district. It made me feel she was behind and like there was something wrong with her. I know every child developes at their own pace.I really don&#39;t want to go there unless we have to.<br/>\n<br/>\nShe talks a lot, and I noticed her big break through happened when we decided to unschool.<br/>\nI also noticed when she gets flustered she has trouble getting her words out. We tall her to calm down and start over. Sometimes she starts over 3 times.<br/>\nWhat do we do if there is anything that needs to be done?<br/>\n<br/>\nDarcel<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Speech","postDate":"1249522757","msgId":40921,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkwODA1MTgzOWwzYmY5NmY1cjcxZjEwNTQ3MmRiMGI2YWVAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGg1Y2YxaSttMWhuQGVHcm91cHMuY29tPg==","referencesHeader":"PGg1Y2YxaSttMWhuQGVHcm91cHMuY29tPg=="},"prevInTopic":40915,"nextInTopic":40925,"prevInTime":40920,"nextInTime":40922,"topicId":40915,"numMessagesInTopic":0,"msgSnippet":"OP: Our oldest is 4.5 yrs old and we had her in speech classes last summer. We had her evaluated in winter of 2008 and she qualified for the services. She","messageBody":"<div id=\"ygrps-yiv-342837418\">OP: Our oldest is 4.5 yrs old and we had her in speech classes last summer.<br/>\nWe had her evaluated in winter of 2008 and she qualified for the services.<br/>\nShe wasn&#39;t in the program a full year. It was 3 days a week for 3 hours a<br/>\nday.<br/>\n<br/>\n*** what are speech classes? Why would you worry about a 3.5 y/o speech? Was<br/>\nthis severely atypical tot he point you couldn&#39;t understand her? Did she<br/>\nwant to go?<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=--=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=--=-=--=-=-=<br/>\n<br/>\nOP: We were going to put her in the program here this past Spring and it<br/>\nwould&#39;ve been 5 days a week for 3 hours a day.<br/>\nWe opted out of that and are glad that we did. My husband is concerned with<br/>\nher speech again lately. He pointed out that she talks in statements and not<br/>\nsentences. She also says things backwards alot.<br/>\n<br/>\n***I am unsure exactly what you mean. Can you give specific examples? That<br/>\nseems like a long time to focus on what is &quot;wrong&quot; with her speech. A 3-4<br/>\ny/o needs to be playing, exploring, adventuring, observing, cavorting, etc.<br/>\nAre you guys around many other small children?<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=--=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=--=-=--=-=-=<br/>\n<br/>\nOP: I&#39;m not really sure what to do or say to calm his fears. He corrects her<br/>\na lot.<br/>\n<br/>\n***He needs to stop. Does he want to build a strong relationship with her or<br/>\nput down a small childish speech pattern. She is a small child. This hurts<br/>\nher. They are his fears and he shouldn&#39;t take them out on a small child.<br/>\nWhat is his fear? Does he think that she will talk this way forever? Does he<br/>\ntalk the same way he did at 4? Does do anything the same way he did at 4?<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=--=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=--=-=--=-=-=<br/>\n<br/>\nOP: she&#39;ll say &quot;food makes me bigger&quot; he wants her to say &quot;food makes me<br/>\ngrow&quot; to her bigger is growing.<br/>\n<br/>\n***That&#39;s not weird at all. Food does make you bigger. It also makes you<br/>\ngrow. He is being very picky. I would be really pissed if my husband spoke<br/>\nthis way to me.<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=--=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=--=-=--=-=-=<br/>\n<br/>\nOP: I don&#39;t know if we should really be concerned. How do we know if she<br/>\nreally has a speech problem? I really don&#39;t want to get involved with the<br/>\nschool district. It made me feel she was behind and like there was something<br/>\nwrong with her. I know every child develops at their own pace.I really don&#39;t<br/>\nwant to go there unless we have to.<br/>\n<br/>\n<br/>\n***She is a small child. They sometimes talk funny. My ds6 said &quot;lego&quot; for<br/>\nyellow until recently (4-5ish). He still says, I goed. Instead of went. This<br/>\nis NOT a speech problem. I have faith in him that he wil eventually say<br/>\nwent. Have faith that she is exactly where she needs to be.<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=--=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=--=-=--=-=-=<br/>\nShe talks a lot, and I noticed her big break through happened when we<br/>\ndecided to unschool.<br/>\nI also noticed when she gets flustered she has trouble getting her words<br/>\nout. We tall her to calm down and start over. Sometimes she starts over 3<br/>\ntimes.<br/>\nWhat do we do if there is anything that needs to be done?<br/>\n<br/>\n***Do nothing. Let her be a small child. Help her to accept herself and love<br/>\nher where she is, right now. My ds use to stutter when he was having a<br/>\ngrowth spurt. My nephew does to (he is 3.5). I have known other kids to have<br/>\ntrouble being understood at young ages. I think it is a parents<br/>\nresponsibility to figure out what small children need and help them get it.<br/>\nCommunication can happen with more than words. What can you do to help her<br/>\nget her needs met?<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=--=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=--=-=--=-=-=<br/>\nFaith<br/>\n<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":336663632,"authorName":"Darcel","from":"&quot;Darcel&quot; &lt;harmonpanther228@...&gt;","profile":"harmonpanther228","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Speech","postDate":"1249492850","msgId":40915,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg1Y2YxaSttMWhuQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":40921,"prevInTime":40914,"nextInTime":40916,"topicId":40915,"numMessagesInTopic":0,"msgSnippet":"Our oldest is 4.5 yrs old and we had her in speech classes last summer. We had her evaluated in winter of 2008 and she qualified for the services. She wasn t","messageBody":"<div id=\"ygrps-yiv-2033373306\">Our oldest is 4.5 yrs old and we had her in speech classes last summer. We had her evaluated in winter of 2008 and she qualified for the services. She wasn&#39;t in the program a full year. It was 3 days a week for 3 hours a day.<br/>\n<br/>\nWe were going to put her in the program here this past Spring and it would&#39;ve been 5 days a week for 3 hours a day.<br/>\nWe opted out of that and are glad that we did. My husband is concerned with her speech again lately. He pointed out that she talks in statements and not sentences. She also says things backwards alot.<br/>\n<br/>\nI&#39;m not really sure what to do or say to calm his fears. He corrects her a lot.<br/>\nshe&#39;ll say &quot;food makes me bigger&quot; he wants her to say &quot;food makes me grow&quot; to her bigger is growing.<br/>\nI don&#39;t know if we should really be concerned. How do we know if she really has a speech problem? I really don&#39;t want to get involved with the school district. It made me feel she was behind and like there was something wrong with her. I know every child developes at their own pace.I really don&#39;t want to go there unless we have to.<br/>\n<br/>\nShe talks a lot, and I noticed her big break through happened when we decided to unschool.<br/>\nI also noticed when she gets flustered she has trouble getting her words out. We tall her to calm down and start over. Sometimes she starts over 3 times.<br/>\nWhat do we do if there is anything that needs to be done?<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nDarcel</div>","specialLinks":[]}],"prevTopicId":40875,"nextTopicId":40944}}