{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":326479635,"authorName":"Caroline Gallear","from":"Caroline Gallear &lt;carolinegallear@...&gt;","profile":"caroline.gallear","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Bedtime progress","postDate":"1273870916","msgId":44054,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluZzVleVBPSnlqaEFtcXhSZzJGV3VDSkZ0d1Z2OU9qMlpMNHV2TUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGhydmJuaytnZWZiQGVHcm91cHMuY29tPg==","referencesHeader":"PDcwODg1NC44OTEyOS5xbUB3ZWIxMTMyMTYubWFpbC5ncTEueWFob28uY29tPgkgPGhydmJuaytnZWZiQGVHcm91cHMuY29tPg=="},"prevInTopic":43873,"nextInTopic":0,"prevInTime":44053,"nextInTime":44055,"topicId":43844,"numMessagesInTopic":0,"msgSnippet":"Hi everyone, just wanted to update and thank you all, and say that my 3.5 year old has just asked to go to bed for the 3rd night running, 8.30 or 9pm, and only","messageBody":"<div id=\"ygrps-yiv-1299695884\">Hi everyone,<br/>\n<br/>\njust wanted to update and thank you all, and say that my 3.5 year old has<br/>\njust asked to go to bed for the 3rd night running, 8.30 or 9pm, and only<br/>\ntakes 15 mins (rather than 90 as before...) to fall asleep!  Could you all<br/>\nactually be right? ;)<br/>\n<br/>\nI still feel a slight change in my attitude when the clock strikes 7pm, we<br/>\nare still putting ds (2 years) to bed then as he seems ok with it, but it<br/>\ndoes rather signal Day Over, Evening Time!  Maybe eventually it&#39;ll all flow<br/>\na bit more, but this is working for us, and is vastly preferable to what we<br/>\nhad before.<br/>\n<br/>\nThanks for all your support, Love this list!<br/>\n<br/>\nCaroline,<br/>\ndd 3.5<br/>\nds 2<br/>\nHampshire, UK.<br/>\n<br/>\n*<br/>\n<blockquote><span title=\"ireply\"> &gt; *<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Bedtime progress","postDate":"1273180724","msgId":43873,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhydmJuaytnZWZiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDcwODg1NC44OTEyOS5xbUB3ZWIxMTMyMTYubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":43868,"nextInTopic":44054,"prevInTime":43872,"nextInTime":43874,"topicId":43844,"numMessagesInTopic":0,"msgSnippet":"... ************ When Ray was little he d fall asleep wherever he was, but didn t want to go to bed until one of his parents or step parents was going. ","messageBody":"<div id=\"ygrps-yiv-1172358838\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, The Coffee Goddess &lt;hoffmanwilson@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; For us, the ease of bedtime has always been in mom and dad going to bed WITH the little person.<br/>\n </span></blockquote>************<br/>\n<br/>\nWhen Ray was little he&#39;d fall asleep wherever he was, but didn&#39;t want to go to bed until one of his parents or step parents was going. <br/>\n<br/>\nSomewhere around age 4 Mo went through a stage of staying up past when I was starting to nod, so we created a collection of &quot;bedtime videos&quot; - things she enjoyed that were relatively soothing, lots of music in the soundtrack and not much dialog or effects. Then she could watch her movies in the same room with me while I dozed. <br/>\n<br/>\nAt 8, Mo still sometimes wants to go to bed with someone. This past week we&#39;ve been cabin-camping with a bunch of other unschoolers and every night she would seek me out when she was ready to go to bed so that I could at least lie down with her while she fell asleep.<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":362437716,"authorName":"Paul & Camille","from":"&quot;Paul & Camille&quot; &lt;morlingfamily@...&gt;","profile":"mumspreciousones","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Bedtime progress","postDate":"1273101290","msgId":43868,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PG9wLnZiODlpMHQwOXZxMHUzQHlvdXItcTk0Ymp2dGwwcj4="},"prevInTopic":43847,"nextInTopic":43873,"prevInTime":43867,"nextInTime":43869,"topicId":43844,"numMessagesInTopic":0,"msgSnippet":"We have a 6 y.o son and although we dont have a routine as such it seems to go something like this and works well for us. DS loves night time and he lets us","messageBody":"<div id=\"ygrps-yiv-2055924260\">We have a 6 y.o son and although we dont have a routine as such it seems  <br/>\nto go something like this and works well for us. DS loves night time and  <br/>\nhe lets us know &#39;what he wants to do etc....<br/>\n<br/>\nIts usually playtime with Dad after dinner, then a bath, sometimes a PSP  <br/>\ngame with Dad after that, but going to bed is always going to bed with me  <br/>\n(or Dad), watching a DVD on the computer in bed or me reading a book to  <br/>\nhim and having a snack usually - bit like the movies.  We do teeth  often  <br/>\nwe bring in a cup of water and a small bowl into the bedroom and he does  <br/>\nthem in bed if he cant be bothered getting up and then we snuggle,  <br/>\nsometimes play another quiet game in bed, talk and just spend some nice  <br/>\ntime together, sometimes we do some meditation from Moonbeam or  <br/>\nStarbright, which he enjoys.  When hes ready he usually snuggles upto me  <br/>\nwhile I read a book and falls asleep - often we both fall asleep :)  My  <br/>\nhusband often comes in, turns the side table lamp off and removes my  <br/>\nglasses and book as Ive gone to sleep too ;)<br/>\n<br/>\nOccasionally if there is something I want to do or watch with Dad our son  <br/>\nis happy to watch a movie in bed by himself and its not a problem.  I  <br/>\nsometimes get up after he&#39;s fallen asleep but he knows that I will be  <br/>\nthere right away if he needs me.  Bedtime has not been an issue for us at  <br/>\nall and I think perhaps beccause he gets all the time etc he needs every  <br/>\nnight.<br/>\n<br/>\nSorry I didnt read the original post - dont know where it went, but this  <br/>\nis what we do :)<br/>\n<br/>\nHTH<br/>\nCamille</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Bedtime progress","postDate":"1272966746","msgId":43847,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2NjBERkNDLTM3NDMtNDUzNy04Mjk2LTEyNkJFOUI2RjI0RUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PHQybGYwYzRkZDYxMDA1MDMxMDE2d2ExNTZhMDNkejhmYjBhNjA0NGJhYjY0ZGRAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PHQybGYwYzRkZDYxMDA1MDMxMDE2d2ExNTZhMDNkejhmYjBhNjA0NGJhYjY0ZGRAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":43846,"nextInTopic":43868,"prevInTime":43846,"nextInTime":43848,"topicId":43844,"numMessagesInTopic":0,"msgSnippet":"... A better objective is to help them ease into sleep. Set the stage. Make it possible for them to notice the cues they re tired. Remove the obstacles that","messageBody":"<div id=\"ygrps-yiv-427551233\">On May 3, 2010, at 1:16 PM, Caroline Gallear wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If the object of this is to listen when she says she&#39;s not tired  <br/>\n&gt; (even if we<br/>\n&gt; think she is), how do people manage when they need to go to bed  <br/>\n&gt; themselves?<br/>\n<br/>\n </span></blockquote>A better objective is to help them ease into sleep. Set the stage.  <br/>\nMake it possible for them to notice the cues they&#39;re tired. Remove the  <br/>\nobstacles that prevent them from falling asleep.<br/>\n<br/>\nSome kids get very active in the evening so for them a mini trampoline  <br/>\nor something active will help get the energy out. Start quieting the  <br/>\nhouse down. Have a routine. A bath. Talk about the fun things you did.  <br/>\nTalk about the fun things you&#39;ll do tomorrow. Make settling down an  <br/>\norganic part of the day.<br/>\n<br/>\nI think one of the big stumbling blocks is that most parents create a  <br/>\nroutine for the kids to fall asleep so it isn&#39;t part of the family&#39;s  <br/>\nday. It&#39;s a signal for the kids to separate from the family. That will  <br/>\nbe a bigger deal for social kids than for introverted kids.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Bedtime progress","postDate":"1272910973","msgId":43846,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRGMjBDMkI0MEIxQjRBRERCMjFDQjIxQUJDM0ZCQTQxQENvbm5pZVBDPg==","inReplyToHeader":"PHQybGYwYzRkZDYxMDA1MDMxMDE2d2ExNTZhMDNkejhmYjBhNjA0NGJhYjY0ZGRAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PHQybGYwYzRkZDYxMDA1MDMxMDE2d2ExNTZhMDNkejhmYjBhNjA0NGJhYjY0ZGRAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":43845,"nextInTopic":43847,"prevInTime":43845,"nextInTime":43847,"topicId":43844,"numMessagesInTopic":0,"msgSnippet":"... think she is), how do people manage when they need to go to bed themselves?","messageBody":"<div id=\"ygrps-yiv-1857791909\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;If the object of this is to listen when she says she&#39;s not tired (even if we<br/>\n </span></blockquote>think she is), how do people manage when they need to go to bed themselves?&lt;&lt;&lt;<br/>\n<br/>\nI try to find quiet things for them to do so that they can play quietly while the rest of us sleep. I see that your little ones are only 2 and 3.5, which are tricky ages because they are still babies yet are capable of doing a lot. One of the things that we have done is set up a TV and DVD player in our room so that the kids can quietly watch TV while my husband sleeps. We tried letting our kids stay up by themselves but they could not be quiet. I tried staying up with the girls so that my husband could sleep but that didn&#39;t work because we would be going to bed about the time that my husband was getting up to go to work. He would get home not long after we got up. He wanted dinner and the girls were wanting breakfast. I wasn&#39;t getting any housework done and we were all pretty miserable because we couldn&#39;t go anywhere or do anything. <br/>\n<br/>\nWe played around with different arrangements until we found something that worked. We are always open to re-evaluating our sleep situation since our kids always seem to be changing. Our current sleep arrangement is that we all sleep in the same room and we all go to bed at the same time. We don&#39;t all go to sleep but we do go to the bedroom and have quiet time so that everyone can drift off to sleep according their own needs. My 15 month and 3 year old won&#39;t go to sleep as long as their sisters are up and about playing. Our solution has been to watch a movie at bed time. My 8 year old and 5 year old have hand held games that they can turn the sound off and play quietly in bed so that my husband and the two little ones can sleep. There was a short period of time when my oldest chose to sleep in her own room with her little sisters. That was short lived but it worked at the time. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I seemed to just be insisting she go to bed at 11pm instead of insisting at 7.30pm. Is this any better, if we still end up telling her what to do?&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Is there a way to make bedtime more fun and appealing? At around 10, we shut off everything in the living room and move to the bedroom. We don&#39;t focus on it being bedtime as much as we focus on it being time to settle down and get quiet for the night. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;Also, do you wake your little children up in the morning or let them sleep as long as they want?&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>It really depends on the child. My 5 year old has a program that she has to watch in the mornings. If I don&#39;t wake her up, she gets really upset. I usually let my 15 month old and 2 year old sleep until they are ready to get up, which is usually around 10 or 11. I am never sure when my 8 year old wakes up or goes to sleep because she enjoys quiet time by herself after everyone else has gone to sleep. She also likes to lay in bed and ease into her day. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I&#39;m concerned that if they sleep in really late we will just be swapping a 7-7 sleep pattern for an 11-11 one and she may then want to stay up even later!&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>What would be so bad about swapping 7-7 for 11-11? Is there a way to split the difference to accommodate everyone&#39;s sleep patterns a little better? That is what we have done. We have found that everyone going to bed (not necessarily to sleep) at the same time has been a big help in getting everyone to settle down enough for those that want/need sleep.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;DH needs a normal sleep pattern to function for work, he&#39;s concerned we&#39;ll never be able to watch grown-up TV again, and he&#39;s a bit freaked out over the whole thing.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Kids are little for such a short period of time. I would focus on finding a way for your DH to get the sleep he needs to function for work. Watching grown up TV is something that we pretty much let go of for now. We usually sneak it in in the mornings or in the middle of the night if we really want it. We also have a TV in our room so that we can watch grown up TV while the kids play in other rooms. Our house is pretty child proofed so that my little ones can play in pretty much any room of the house they want. <br/>\n<br/>\nConnie<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":9543528,"authorName":"The Coffee Goddess","from":"The Coffee Goddess &lt;hoffmanwilson@...&gt;","profile":"hoffmanwilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Bedtime progress","postDate":"1272909683","msgId":43845,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwODg1NC44OTEyOS5xbUB3ZWIxMTMyMTYubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":43844,"nextInTopic":43846,"prevInTime":43844,"nextInTime":43846,"topicId":43844,"numMessagesInTopic":0,"msgSnippet":"We have a nearly two year old who has always asked to go to bed--Before she could talk she would make snoring noises and point to the bedroom.  But, we go to","messageBody":"<div id=\"ygrps-yiv-2011705823\">We have a nearly two year old who has always asked to go to bed--Before she could talk she would make snoring noises and point to the bedroom.  But, we go to bed, all of us, then.  We usually watch one or two kids shows on the dvr and then she nurses to sleep shortly after that.  Husband and I can then watch all the grown up shows we want on the dvr.  As far as mornings go, my husband gets up about 6:30 for work, and I lay in bed and finish up tv shows, internet, crochet, whatever, and the 2 yo wakes up sometime between 7 and 8:30.  We also have big kids, 12 and almost 18, and they keep pretty regular hours as well, 10 or 11 to bed and up between 8 and 9.  The kids and I leave the house for the day at 9:30.<br/>\n<br/>\nFor us, the ease of bedtime has always been in mom and dad going to bed WITH the little person.  When my 18 yo was this size, I was still hoping to get up and do something after she went to bed, occasionally, and it always ended poorly--she sensed my agrivation, she wanted to be up if I was up--not wanting to miss anything fun....So, I clued in early to just all stay up until I was ready to go to bed, or at least settle in and watch tv, and then knowing I was going to stay put for the night made everything more calm and relaxed in bed.<br/>\nDana</div>","specialLinks":[]},{"userId":326479635,"authorName":"Caroline Gallear","from":"Caroline Gallear &lt;carolinegallear@...&gt;","profile":"caroline.gallear","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Bedtime progress","postDate":"1272907000","msgId":43844,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHQybGYwYzRkZDYxMDA1MDMxMDE2d2ExNTZhMDNkejhmYjBhNjA0NGJhYjY0ZGRAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":0,"nextInTopic":43845,"prevInTime":43843,"nextInTime":43845,"topicId":43844,"numMessagesInTopic":0,"msgSnippet":"Thanks to everyone who replied to my last post about bedtime troubles... So, I think we have done the classic new to unschooling thing and said, ok, no more","messageBody":"<div id=\"ygrps-yiv-917770828\">Thanks to everyone who replied to my last post about bedtime troubles...<br/>\n<br/>\nSo, I think we have done the classic &#39;new to unschooling&#39; thing and said,<br/>\n&quot;ok, no more bedtime!&quot;, with results that we just can&#39;t handle long-term. We<br/>\nexplained to dd, 3 1/2, that we didn&#39;t like fighting and telling her what to<br/>\ndo at bedtime, so we were going to experiment with helping her sleep when<br/>\nshe felt ready.  The first night, by 10pm she was looking very tired and<br/>\nagreed to go up when we suggested it.  Last night, she was adament that she<br/>\nwouldn&#39;t go until her game was finished, fair enough, but by 11pm I was<br/>\ndropping and needed to sleep so we had to insist, ending in many tears.<br/>\n<br/>\nIf the object of this is to listen when she says she&#39;s not tired (even if we<br/>\nthink she is), how do people manage when they need to go to bed themselves?<br/>\n I seemed to just be insisting she go to bed at 11pm instead of insisting at<br/>\n7.30pm.  Is this any better, if we still end up telling her what to do?<br/>\n Also, do you wake your little children up in the morning or let them sleep<br/>\nas long as they want?  I&#39;m concerned that if they sleep in really late we<br/>\nwill just be swapping a 7-7 sleep pattern for an 11-11 one and she may then<br/>\nwant to stay up even later!  DH needs a normal sleep pattern to function for<br/>\nwork, he&#39;s concerned we&#39;ll never be able to watch grown-up TV again, and<br/>\nhe&#39;s a bit freaked out over the whole thing.<br/>\n<br/>\nI don&#39;t feel like I&#39;ve phrased my questions very well.  I think these are<br/>\njust teething troubles, it&#39;s a new idea for adults and kids alike, but I&#39;m<br/>\nnot quite sure where to go from here... and I&#39;m knackered!<br/>\n<br/>\nThanks again,<br/>\nCaroline.<br/>\ndd 3 1/2,<br/>\nds nearly 2,<br/>\nHampshire, UK.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":43995,"nextTopicId":43978}}