{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] how do I let go???","postDate":"1242161907","msgId":40043,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0NzQyOC44NzMyNy5xbUB3ZWI4MTUwOC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDMxMDI4MS40MzYwNy5xbUB3ZWIzNjkwNC5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDMxMDI4MS40MzYwNy5xbUB3ZWIzNjkwNC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":40042,"nextInTopic":0,"prevInTime":40042,"nextInTime":40044,"topicId":39988,"numMessagesInTopic":0,"msgSnippet":"Yes Xylitol will create an enviroment in the moth were the bacteria cannot reproduce or stay alive BUT it needs to be used about 5-7 times a day. Read more","messageBody":"<div id=\"ygrps-yiv-227442928\">Yes Xylitol will create an enviroment in the moth were the bacteria cannot reproduce or stay alive BUT it needs to be used about 5-7 times a day.<br/>\nRead more on xylitol.org<br/>\nI buy my online<br/>\neither at Epic.com or x-lear.com<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":9543528,"authorName":"The Coffee Goddess","from":"The Coffee Goddess &lt;hoffmanwilson@...&gt;","profile":"hoffmanwilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] how do I let go???","postDate":"1242158012","msgId":40042,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxMDI4MS40MzYwNy5xbUB3ZWIzNjkwNC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":40041,"nextInTopic":40043,"prevInTime":40041,"nextInTime":40043,"topicId":39988,"numMessagesInTopic":0,"msgSnippet":"... brush. There is no use making it a power struggle. Hard cheese is an option. Xylitol another. Search and keep trying new things. My dentist LOVES","messageBody":"<div id=\"ygrps-yiv-1785992957\"><blockquote><span title=\"ireply\">&gt;&gt;Also look into alternatives for days when he really just doesn&#39;t want to<br/>\n </span></blockquote>brush. There is no use making it a power struggle. Hard cheese is an option.<br/>\nXylitol another. Search and keep trying new things.&gt;&gt;<br/>\n<br/>\nMy dentist LOVES xylitol, and says that bacteria is acutally unable to grow in your mouth if you chew xylitol gum or use xylitol rinse.  I do not know if that is really the case but I do know that my dentist is madly in love with it.  It is also available in &quot;sugar&quot; packets in the sweetener isle...<br/>\n<br/>\nDana<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] how do I let go???","postDate":"1242154731","msgId":40041,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkwNTEyMTE1OGg0ZmEzZDljMng5NzFhN2FiNzYyODcxNTk0QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGd1MnFybyt0ZThmQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1MnFybyt0ZThmQGVHcm91cHMuY29tPg=="},"prevInTopic":40027,"nextInTopic":40042,"prevInTime":40040,"nextInTime":40042,"topicId":39988,"numMessagesInTopic":0,"msgSnippet":"OP: My son has a heart condition, that will eventually kill him if nothing else does. According to the doctors it will shorten his life and it already limits","messageBody":"<div id=\"ygrps-yiv-45676800\">OP: My son has a heart condition, that will eventually kill him if nothing<br/>\nelse does. According to the doctors it will shorten his life and it already<br/>\nlimits his ability to do some of the things he wants to do (he can&#39;t play<br/>\nfootball, they won&#39;t take him in the Air Force which is his current dream.)<br/>\n<br/>\n***I hear the fear for his death and of dying in general in here. I am<br/>\nhoping that you are here (this group) because you want to live full of joy<br/>\ninstead of fear. Dying isn&#39;t an if, its a when and NONE of us know when it<br/>\nwill be for our kids or ourselves.<br/>\n<br/>\nI don&#39;t know how old he is but if he is young then don&#39;t worry about the Air<br/>\nForce taking him or not. He will likely have other dreams by then. Fulfill<br/>\nthat dream as much as possible. Go to an air force base if you can or a<br/>\nmuseum or get books and videos out and really build the dream up with him.<br/>\nHelp with what he CAN do. Find a way to make anything and everything a<br/>\npossibility.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; OP: Healthy teeth are important, according to the doctors, because mouth<br/>\n&gt; bacteria in the blood stream can have a negative impact on the heart and<br/>\n&gt; cavities and dental work make it easier for the bacteria to get into the<br/>\n&gt; blood.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>***This is good information for him to know. Help making brushing and tooth<br/>\ncare fun and a part of a loving way for him to care for himself. My ds has<br/>\nlike 6 tooth brushes and several kinds of tooth paste and we try all kinds<br/>\nof things. Some he likes some he doesn&#39;t.<br/>\n<br/>\nAlso look into alternatives for days when he really just doesn&#39;t want to<br/>\nbrush. There is no use making it a power struggle. Hard cheese is an option.<br/>\nXylitol another. Search and keep trying new things.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; OP: He had cavities as a baby.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n&gt; ***My dd had a full mouth of rot in her baby teeth. She was completely<br/>\n&gt; breast fed and didn&#39;t know candy until she was quite old (the luxury of an<br/>\n&gt; oldest). Still she had 9 teeth removed and several capped. She is now 12 and<br/>\n&gt; has gorgeous straight cavity free teeth. She has gone through periods of<br/>\n&gt; less brushing and tooth care but her adult teeth are fine.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nOP: When I took him to the dentist recently the report was no cavities but<br/>\n<blockquote><span title=\"ireply\"> &gt; more plaque than his sister had.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>***Yep, everyone is different.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n&gt;<br/>\n&gt; OP: And, he&#39;s got a sweet tooth, eating ice cream every day and bananas all<br/>\n&gt; night long.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>***My ds is like that. He loves sweet things. He doens&#39;t always love to<br/>\nbrush. We help him make it as fun and painless as possible. My ds doesn&#39;t<br/>\nlike gum but maybe your would be into chewing the xylitol gum.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have sooooooooooo much fear around this, that I can hardly see straight<br/>\n&gt; when it comes to teeth brushing and I am driving him bananas. He is eight<br/>\n&gt; years old and he wants to brush or not brush his teeth in his own way. When<br/>\n&gt; I see him simply suck on the toothbrush covered with toothpaste once a day<br/>\n&gt; for less than a minute and with no circular movements on his teeth, FEAR<br/>\n&gt; comes boiling up.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>***Own it. It is your fear. You can&#39;t force him to do anything without<br/>\nhurting your relationship with him. When the fear comes up be with it<br/>\nquietly to yourself. Listen to what it is really telling you. If its helpful<br/>\ngreat if it sin&#39;t helpful let it go. Thank the fear for helping you get back<br/>\non track. Now breath. a few deep breathes. Then figure out how to talk to<br/>\nyour son without fear and control.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; OP: How in the world do I let go of this fear, obviously it is bigger than<br/>\n&gt; just teeth. It has to do with his heart and his life and my guilt and what<br/>\n&gt; ever else.<br/>\n&gt;<br/>\n&gt; ***Why guilt? Do you feel guilty that you aren&#39;t making him take care of<br/>\n&gt; his teeth? I think that mainstream parenting tells us that we are<br/>\n&gt; responsible to our childrens health at ALL COST. Even if you are damaging<br/>\n&gt; your relationship with your child. I don&#39;t buy that myth. My children are<br/>\n&gt; whole people not just teeth or hearts or what have you. They have feeling,<br/>\n&gt; thoughts, ideas and agendas. Their mental health and the integrity they that<br/>\n&gt; over thier body is just as important as their body parts. Maybe more.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Step back for a while. And say nothing about his teeth. Relax and figure out<br/>\na way to shift your perspective. Just hold your tongue, seriously. When you<br/>\nchange you will be shocked at how easy it is to work WITH your son to solve<br/>\nthis.<br/>\n<br/>\nFaith<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt;  _--<br/>\n&gt;<br/>\n </span></blockquote><a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":328087230,"authorName":"Melissa","from":"&quot;Melissa&quot; &lt;ckent001@...&gt;","profile":"ckent9511","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: how do I let go???","postDate":"1242062812","msgId":40027,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1OW40cyszNjJmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMzYzLjM4NzUxLnFtQHdlYjU2MTA0Lm1haWwucmUzLnlhaG9vLmNvbT4="},"prevInTopic":40013,"nextInTopic":40041,"prevInTime":40026,"nextInTime":40028,"topicId":39988,"numMessagesInTopic":0,"msgSnippet":"... I bought my kids this stuff by Listerine that you use before brushing that tints the crud on your teeth.  Then, you brush it off.  It shows you where to","messageBody":"<div id=\"ygrps-yiv-1952844409\"><blockquote><span title=\"ireply\">&gt; When I took him to the dentist recently the report was no cavities but more plaque than his sister had.  <br/>\n<br/>\n </span></blockquote>I bought my kids this stuff by Listerine that you use before brushing that tints the crud on your teeth.  Then, you brush it off.  It shows you where to spend more time brushing.  The goal is to get it all off.  My kids (7,6,and 4) LOVE to use it and it has encouraged them to brush better and more often.<br/>\nMelissa-Ocala</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: how do I let go???","postDate":"1241998979","msgId":40013,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1N29xMyttMXBzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd1MnFybyt0ZThmQGVHcm91cHMuY29tPg=="},"prevInTopic":39997,"nextInTopic":40027,"prevInTime":40012,"nextInTime":40014,"topicId":39988,"numMessagesInTopic":0,"msgSnippet":"... ************************ Letting go of fears and what-ifs about our children is probably the hardest task any parent faces. What has helped most for me is","messageBody":"<div id=\"ygrps-yiv-1726319838\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;sistergoddesselli&quot; &lt;elinorsparks@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; How in the world do I let go of this fear, obviously it is bigger than just teeth.  It has to do with his heart and his life and my guilt and what ever else.<br/>\n </span></blockquote>************************<br/>\n<br/>\nLetting go of fears and what-ifs about our children is probably the hardest task any parent faces. What has helped most for me is realizing that there are some things I Can&#39;t control. Ultimately, I can&#39;t control my children. I can coax, manipulate, threaten and even outright bully them, but past a certain point, they Will make decisions I don&#39;t like, don&#39;t agree with, maybe even scare the shit out of me. <br/>\n<br/>\nKnowing I can&#39;t control my kids, I look for what I *can* do - I can be their advocate, consultant, and friend. I can be the trustworthy source of help and information - trustworthy because they know I won&#39;t try to push past their boundaries with my own agenda. I&#39;ll bend over backwards to find alternatives. That status as a trustworthy source is priceless. It doesn&#39;t give me any more control, really, but it does mean my ideas and suggestions have more weight in my kids&#39; estimation. And it opens up new ideas and directions that meet all our needs better.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Healthy teeth are important, according to the doctors, because mouth bacteria in the blood stream can have a negative impact on the heart and cavities and dental work make it easier for the bacteria to get into the blood.<br/>\n </span></blockquote>*************************<br/>\n<br/>\nThis would be a good place for you to start researching alternatives - alternative oral hygiene (like rinses and tongue scrapers), foods and practices that affect the growth of specific bacteria in the mouth, alternative dental products and practices that are less invasive than traditional drilling and scraping. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My son has a heart condition, that will eventually kill him if nothing else does.<br/>\n<br/>\n </span></blockquote>And that&#39;s something you can&#39;t control, and leaves you feeling helpless. What can you do to feel less helpless? I don&#39;t mean what can you do to/with/for your child, but for Yourself. What makes you feel capable - powerful, even. That&#39;s someplace to put your energy. When you can feel more powerful in your own life, more capable and competent and vital and strong, you&#39;ll find you have less of an urge to control your child. Its not so much a matter of letting go, as finding some other, better way to meet your own very real (very normal and humanly valid) need for competence. <br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":299867162,"authorName":"Maria","from":"&quot;Maria&quot; &lt;maria.veltman@...&gt;","profile":"trinity3857","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: how do I let go???","postDate":"1241899177","msgId":39997,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1NG5iOStvMGxnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd1MnFybyt0ZThmQGVHcm91cHMuY29tPg=="},"prevInTopic":39996,"nextInTopic":40013,"prevInTime":39996,"nextInTime":39998,"topicId":39988,"numMessagesInTopic":0,"msgSnippet":"At risk of this sounding harsh and unfeeling, know that I do sympathize with your situation. How do you let go?  By accepting that he will die and that you","messageBody":"<div id=\"ygrps-yiv-1825617149\">At risk of this sounding harsh and unfeeling, know that I do sympathize with your situation.<br/>\n<br/>\nHow do you let go?  By accepting that he will die and that you only have this moment with him.  How do you want to spend this moment?  <br/>\n<br/>\nI have been coming to this realization myself, in learning to deal with my food issues.  Here&#39;s what I wrote my brother the other day:<br/>\n<br/>\n&quot;I&#39;ve been thinking about my food choices a lot lately.  I even discussed them online with a group of people whose thoughts I trust.  One pointed out that I start from a place of fear (fear of what &quot;unhealthy&quot; food might do), another suggested that it was almost as though I thought certain things were like a bogeyman hiding under the bed, ready to attack willy-nilly.  I thought about what they said carefully, and realized that it was true.  A lot of my food issues have to do with fear.  So here&#39;s what I realized in this process:<br/>\n<br/>\nAll this fear has to do with the fear of death and our lack of control over it (even as I write this, I feel the fear creeping around me, but I&#39;m trying to make it my friend, so...hello).  That it is certain that: we will die; we don&#39;t know when; we don&#39;t know how.  So with these certainties, it doesn&#39;t really matter what I eat, because death will come.  But then others might say, &quot;well, what about quality of life?  Don&#39;t you want your time on earth to be good (pain free - something that is also not within our control)?&quot;  To which I say, &quot;I can make a choice about that.  I can choose to be free of suffering and joyful even if I have cancer (or whatever ailment bogeyman is currently out to get us).  I can be happy and free of suffering even if I&#39;m 300 lbs, if I choose!&quot;  But, don&#39;t worry, I&#39;m not going to head to the fridge to binge on chocolate ice cream for the rest of my days...and here&#39;s why:  because I also realize that I could be suffering and that my eating is a mask for suffering that I&#39;m creating.  In other words, when I walk into the kitchen, I ask myself: why am I looking for food?  Am I hungry?  If the answer is yes, then I&#39;ll eat something that will take that feeling away.  If the answer is no, then I pursue the matter further: Am I bored?  Angry?  Lonely?  What is it about that, that I want to escape it by eating?  This is where the quality of life comes in...because if I am eating because I&#39;m bored, angry, or lonely, then even if I realized and came to grips with my death being certain and therefore what I eat doesn&#39;t matter, then I am suffering, and therefore, what I eat suddenly does matter.  I don&#39;t know if any of this makes sense, it was something that came to me over time (and with my allowing myself to eat whatever I want and asking myself why I was going into the kitchen).&quot;<br/>\n<br/>\nI&#39;ve been reading &quot;A New Earth&quot; by Echkart Tolle, reading a lot of posts on Sandra Dodd&#39;s and Joyce Fetteroll&#39;s sites, which has sort of catapulted me into learning to be present, to love what is, to accept my feelings and make friends with them and to look at things completely upside down and backwards (this I mean in a positive way!).  <br/>\n<br/>\nIt may also be hard to let go, if you&#39;re are thinking how hard it is and that you can&#39;t do it.  That&#39;s the trick, it&#39;s like Yoda says, &quot;Do or do not, there is no try.&quot;  I&#39;ve only just started to really understand what that means (and it&#39;s increased my appreciation for Star Wars!).  <br/>\n<br/>\nI hope this was helpful.<br/>\n<br/>\n~Maria<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;sistergoddesselli&quot; &lt;elinorsparks@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; My son has a heart condition, that will eventually kill him if nothing else does.  According to the doctors it will shorten his life and it already limits his ability to do some of the things he wants to do (he can&#39;t play football, they won&#39;t take him in the Air Force which is his current dream.)  <br/>\n&gt; <br/>\n&gt; Healthy teeth are important, according to the doctors, because mouth bacteria in the blood stream can have a negative impact on the heart and cavities and dental work make it easier for the bacteria to get into the blood.<br/>\n&gt; <br/>\n&gt; He had cavities as a baby. <br/>\n&gt; <br/>\n&gt; When I took him to the dentist recently the report was no cavities but more plaque than his sister had.  <br/>\n&gt; <br/>\n&gt; And, he&#39;s got a sweet tooth, eating ice cream every day and bananas all night long.<br/>\n&gt; <br/>\n&gt; I have sooooooooooo much fear around this, that I can hardly see straight when it comes to teeth brushing and I am driving him bananas.  He is eight years old and he wants to brush or not brush his teeth in his own way.  When I see him simply suck on the toothbrush covered with toothpaste once a day for less than a minute and with no circular movements on his teeth, FEAR comes boiling up.  <br/>\n&gt; <br/>\n&gt; How in the world do I let go of this fear, obviously it is bigger than just teeth.  It has to do with his heart and his life and my guilt and what ever else.<br/>\n&gt; <br/>\n&gt; Help!!!  I want to let go!!!!!!<br/>\n&gt; <br/>\n&gt; Love,<br/>\n&gt; <br/>\n&gt; Elli<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":348218801,"authorName":"Rachelle Marsden","from":"Rachelle Marsden &lt;overhereinheaven@...&gt;","profile":"musicgluttony","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] how do I let go???","postDate":"1241890908","msgId":39996,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJjY2YyYjM1MDkwNTA5MTA0MXQ0NGUzNGE3OXUzZjRkMzhiNzczZjc1MzNhQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGd1MnFybyt0ZThmQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1MnFybyt0ZThmQGVHcm91cHMuY29tPg=="},"prevInTopic":39992,"nextInTopic":39997,"prevInTime":39995,"nextInTime":39997,"topicId":39988,"numMessagesInTopic":0,"msgSnippet":"In the middle of the night last night I thought about something... perhaps you could make oral care more *fuN* - involve him in a way that he feels it s fun","messageBody":"<div id=\"ygrps-yiv-779873186\">In the middle of the night last night I thought about something... perhaps<br/>\nyou could make oral care more *fuN* - involve him in a way that he feels<br/>\nit&#39;s fun and empowering to do this... you could make your own toothpaste<br/>\ntogether - we make our own toothpaste with essential oils and clay.  It&#39;s<br/>\nactally a powder but then you add water to make it a paste each time you<br/>\nbrush.  This uniqueness and newness may bring a fresh feeling to the<br/>\n*routine* which may inspire him to brush more often as it seems like more of<br/>\na science project than just getting a job done...<br/>\nA tooth powder can be made from the following ingredients?<br/>\n<br/>\nClay - 4 teaspoons (green or white clay work well)<br/>\nSalt - 1 tsp<br/>\nPeppermint essential oil- 2 drops<br/>\nLemon essential oil - 2 drops<br/>\n<br/>\nMix these all together in the blender and keep it in a little box ( maybe<br/>\nyou could find or make a really cool looking box that he can colour and make<br/>\n*his own* design on and that type of thing?).  Dip the toothbrush in the<br/>\npowder and wet with a tiny bit of water before brushing teeth.<br/>\n<br/>\nAnother wonderful thing we use Myrrh - it&#39;s been used for treating the mouth<br/>\nfor ages... it&#39;s great for keeping gums healthy and treating unhealthy<br/>\ngums.  Make a mouthwash for him (another exciting science project!) by<br/>\nadding 2 drops of essential oil myrrh to 1 tablespoon of vodka and mixing<br/>\nwell.  For each &quot;wash&quot; - get a glass of water and only add 2 drops of he<br/>\nabove concoction.  Rinse the mouth.<br/>\n<br/>\nFinally, I&#39;ve been fascinated with how we care for our teeth for a while now<br/>\nand researched this a bit - it seems that the people with the healthiest<br/>\nmouths are those who do not use toothbrushes and toothpaste - they use<br/>\nsticks and salts.  Maybe your son would be interested in the natural<br/>\ntoothbrush &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.naturaltoothbrush.com/\">http://www.naturaltoothbrush.com/</a>&gt; which he could use to pick<br/>\naway at his teeth all day! :)<br/>\n<br/>\nHope this is more useful than my dazed rant last night - I&#39;m reading about<br/>\ndying and this rite of passage right now and a great book is &quot;Being with<br/>\nDying&quot; - very inspiring for all of us, as we all get to transition at some<br/>\npoint...  many blessings to you and your son - my heart is sent to you both.<br/>\n<br/>\n~R<br/>\n<br/>\n<br/>\nOn Fri, May 8, 2009 at 7:47 PM, sistergoddesselli<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elinorsparks@...\">elinorsparks@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; My son has a heart condition, that will eventually kill him if nothing else<br/>\n&gt; does. According to the doctors it will shorten his life and it already<br/>\n&gt; limits his ability to do some of the things he wants to do (he can&#39;t play<br/>\n&gt; football, they won&#39;t take him in the Air Force which is his current dream.)<br/>\n&gt;<br/>\n&gt; Healthy teeth are important, according to the doctors, because mouth<br/>\n&gt; bacteria in the blood stream can have a negative impact on the heart and<br/>\n&gt; cavities and dental work make it easier for the bacteria to get into the<br/>\n&gt; blood.<br/>\n&gt;<br/>\n&gt; He had cavities as a baby.<br/>\n&gt;<br/>\n&gt; When I took him to the dentist recently the report was no cavities but more<br/>\n&gt; plaque than his sister had.<br/>\n&gt;<br/>\n&gt; And, he&#39;s got a sweet tooth, eating ice cream every day and bananas all<br/>\n&gt; night long.<br/>\n&gt;<br/>\n&gt; I have sooooooooooo much fear around this, that I can hardly see straight<br/>\n&gt; when it comes to teeth brushing and I am driving him bananas. He is eight<br/>\n&gt; years old and he wants to brush or not brush his teeth in his own way. When<br/>\n&gt; I see him simply suck on the toothbrush covered with toothpaste once a day<br/>\n&gt; for less than a minute and with no circular movements on his teeth, FEAR<br/>\n&gt; comes boiling up.<br/>\n&gt;<br/>\n&gt; How in the world do I let go of this fear, obviously it is bigger than just<br/>\n&gt; teeth. It has to do with his heart and his life and my guilt and what ever<br/>\n&gt; else.<br/>\n&gt;<br/>\n&gt; Help!!! I want to let go!!!!!!<br/>\n&gt;<br/>\n&gt; Love,<br/>\n&gt;<br/>\n&gt; Elli<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] how do I let go???","postDate":"1241879674","msgId":39992,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk4NTA4MS4yNDA4NC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGJjY2YyYjM1MDkwNTA5MDAzNnQxNmZhYjhjMm8zYTYyNjg5YjkxYTA2MzJAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PGd1MnFybyt0ZThmQGVHcm91cHMuY29tPiA8YmNjZjJiMzUwOTA1MDkwMDM2dDE2ZmFiOGMybzNhNjI2ODliOTFhMDYzMkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":39991,"nextInTopic":39996,"prevInTime":39991,"nextInTime":39993,"topicId":39988,"numMessagesInTopic":0,"msgSnippet":"Have your heard of Xylitol to prevent cavities? SOunds like it could be great in your case. Go to xylitol.org to read more on it. your kid would get to","messageBody":"<div id=\"ygrps-yiv-628755144\">Have your heard of Xylitol to prevent cavities?<br/>\nSOunds like it could be great in your case.<br/>\nGo to xylitol.org to read more on it.<br/>\nyour kid would get to eat sweet mints and gum and help prevent cavities!<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"N CONFER","from":"N CONFER &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:how do I let go???","postDate":"1241875169","msgId":39990,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcxMzYxOS4xNzE2My5xbUB3ZWI4MzgxMi5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":39989,"nextInTopic":39991,"prevInTime":39989,"nextInTime":39991,"topicId":39988,"numMessagesInTopic":0,"msgSnippet":"My DS has a medical condition that requires daily medications. Nothing immediately life-threatening but long-term maintenance stuff. Now, he was older than","messageBody":"<div id=\"ygrps-yiv-1898427155\">My DS has a medical condition that requires daily medications. Nothing immediately life-threatening but long-term maintenance stuff.<br/>\n<br/>\nNow, he was older than your son when this was discovered -- 11 -- but he has always been completely in charge of remembering to take his meds. I will rarely ask if he took them because I didn&#39;t notice him doing it. But it has always been something that has been his responsibility.<br/>\n<br/>\nNot because I decided to make it his responsibility. But because he is aware of the serious reasons he needs the meds and aware of the consequences of not taking them. <br/>\n<br/>\nAnd, I think, because he has been raised to think of his body as his. Like his brain. He is happy to wolf down a Mom-made dinner :) but mostly feeds himself now -- he&#39;s 15, almost 16. He just asked Dad to take him for a haircut -- they both needed one and just left for that. He sleeps opposite the rest of us and yet has Tae Kwon Do and other activities that he wants to do so he gets himself and his sleep organized for those things. <br/>\n<br/>\nI don&#39;t know if this helps but I hope it is about providing the information to your son and explaining that you can&#39;t brush his teeth for him and this really does matter and working on a reminder method that is good for both of you with the idea that he will be more and more in charge of himself. <br/>\n<br/>\nNance</div>","specialLinks":[]},{"userId":184269211,"authorName":"rebecca de","from":"rebecca de &lt;rebeccadehate@...&gt;","profile":"rebeccadehate","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] how do I let go???","postDate":"1241875144","msgId":39989,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMzYzLjM4NzUxLnFtQHdlYjU2MTA0Lm1haWwucmUzLnlhaG9vLmNvbT4="},"prevInTopic":39988,"nextInTopic":39990,"prevInTime":39988,"nextInTime":39990,"topicId":39988,"numMessagesInTopic":0,"msgSnippet":"First of all blessings elli,     I can t even imagine - and I bet the rest of us would be just like you!!  the first thing that popped into my mind was","messageBody":"<div id=\"ygrps-yiv-1749593607\">First of all blessings elli,<br/>\n    I can&#39;t even imagine - and I bet the rest of us would be just like you!!  the first thing that popped into my mind was that before tooth brushes were invented their had to be a way that people kept teeth cleaned.  Once I heard apples were a natural teeth cleaner .. Does your son like to eat them whole.  Is there a mouth wash he could swish with to help with the plaque.   <br/>\n     I think that you recognize your fearing and wanting to release it is helpful and every time you find yourself becoming panicky you can recognize it before you go crazy on the kiddo (not that you do, I&#39;m thinking how I would be).  <br/>\n   Plus are you open to any natural practices.  Here is a website to a friend of mine in NC he is very knowledgeable <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hcmionline.com/about_dr_dehaan.htm\">http://www.hcmionline.com/about_dr_dehaan.htm</a>  ...  blessings Rebecca<br/>\nps.  try some candle magick where you light a candle signifying you and letting go???<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Fri, 5/8/09, sistergoddesselli &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elinorsparks@...\">elinorsparks@...</a>&gt; wrote:<br/>\nFrom: sistergoddesselli &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elinorsparks@...\">elinorsparks@...</a>&gt;<br/>\nSubject: [unschoolingbasics] how do I let go???<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Friday, May 8, 2009, 10:47 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n            <br/>\n            <br/>\n<br/>\n<br/>\n      <br/>\n      My son has a heart condition, that will eventually kill him if nothing else does.  According to the doctors it will shorten his life and it already limits his ability to do some of the things he wants to do (he can&#39;t play football, they won&#39;t take him in the Air Force which is his current dream.)  <br/>\n<br/>\n<br/>\n<br/>\nHealthy teeth are important, according to the doctors, because mouth bacteria in the blood stream can have a negative impact on the heart and cavities and dental work make it easier for the bacteria to get into the blood.<br/>\n<br/>\n<br/>\n<br/>\nHe had cavities as a baby. <br/>\n<br/>\n<br/>\n<br/>\nWhen I took him to the dentist recently the report was no cavities but more plaque than his sister had.  <br/>\n<br/>\n<br/>\n<br/>\nAnd, he&#39;s got a sweet tooth, eating ice cream every day and bananas all night long.<br/>\n<br/>\n<br/>\n<br/>\nI have sooooooooooo much fear around this, that I can hardly see straight when it comes to teeth brushing and I am driving him bananas.  He is eight years old and he wants to brush or not brush his teeth in his own way.  When I see him simply suck on the toothbrush covered with toothpaste once a day for less than a minute and with no circular movements on his teeth, FEAR comes boiling up.  <br/>\n<br/>\n<br/>\n<br/>\nHow in the world do I let go of this fear, obviously it is bigger than just teeth.  It has to do with his heart and his life and my guilt and what ever else.<br/>\n<br/>\n<br/>\n<br/>\nHelp!!!  I want to let go!!!!!!<br/>\n<br/>\n<br/>\n<br/>\nLove,<br/>\n<br/>\n<br/>\n<br/>\nElli </span></blockquote></div>","specialLinks":[]},{"userId":348218801,"authorName":"Rachelle Marsden","from":"Rachelle Marsden &lt;overhereinheaven@...&gt;","profile":"musicgluttony","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] how do I let go???","postDate":"1241854599","msgId":39991,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJjY2YyYjM1MDkwNTA5MDAzNnQxNmZhYjhjMm8zYTYyNjg5YjkxYTA2MzJAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGd1MnFybyt0ZThmQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1MnFybyt0ZThmQGVHcm91cHMuY29tPg=="},"prevInTopic":39990,"nextInTopic":39992,"prevInTime":39990,"nextInTime":39992,"topicId":39988,"numMessagesInTopic":0,"msgSnippet":"Worrying is like praying for something bad to happen. You re spreading your worry energy and negative vibration to your child when you make the choice to focus","messageBody":"<div id=\"ygrps-yiv-219377576\">Worrying is like praying for something bad to happen. You&#39;re spreading your<br/>\nworry energy and negative vibration to your child when you make the choice<br/>\nto focus your worries upon him.   What it truly boils down to is your fear<br/>\nof death, and the focus on that fear takes you away from living in the<br/>\nmoment and truly enjoying your son.<br/>\n<br/>\nWe are all going to face death - your son could die tomorrow from one of an<br/>\ninfinite number of things, and how would you feel about the way you spent<br/>\nyour last day together?  Was it spent nagging him about not eating ice cream<br/>\nor brushing properly, or was it spent basking in the joy of each other?<br/>\n<br/>\nIf you can align with love and your Ultimate Power, HE will bask in your<br/>\nhigh vibration and will naturally and automatically move into alignment with<br/>\nthis, which will result in him living in bliss, in the moment, happy, and<br/>\nhealthy, for who knows how long (doctors are wrong so often; conditions heal<br/>\nspontaneously more often than any of us realize... we are incredibly<br/>\npowerful machines.  Believe this).  And *how long* isn&#39;t the point.  It&#39;s<br/>\nthe knowing that we all are living in<br/>\n&quot;who-knows-when-we&#39;re-going-to-die&quot;-land and we&#39;d better get down to<br/>\nbusiness and start doing what truly aligns with us, and that entails<br/>\nfollowing our love.<br/>\n<br/>\nIn deciding this, your son will move to experience ultimate love and<br/>\nempowerment because you support him in all that he is, right NOW, with no<br/>\nexpectations, only love.  Bask in the delight of knowing that your son is<br/>\nchoosing to do everything to enjoy every moment of his life, right now,<br/>\nfully and completely supported.<br/>\n<br/>\nWith the highest blessings,<br/>\n~Rachelle<br/>\n<br/>\nPS&gt;  If you have troubles &quot;letting go&quot; regarding the junk food, I&#39;d<br/>\nrecommend starting by simply not buying it from the store/bringing it into<br/>\nyour home and see how that goes...<br/>\n<br/>\n<br/>\nOn Fri, May 8, 2009 at 7:47 PM, sistergoddesselli<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elinorsparks@...\">elinorsparks@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; My son has a heart condition, that will eventually kill him if nothing else<br/>\n&gt; does. According to the doctors it will shorten his life and it already<br/>\n&gt; limits his ability to do some of the things he wants to do (he can&#39;t play<br/>\n&gt; football, they won&#39;t take him in the Air Force which is his current dream.)<br/>\n&gt;<br/>\n&gt; Healthy teeth are important, according to the doctors, because mouth<br/>\n&gt; bacteria in the blood stream can have a negative impact on the heart and<br/>\n&gt; cavities and dental work make it easier for the bacteria to get into the<br/>\n&gt; blood.<br/>\n&gt;<br/>\n&gt; He had cavities as a baby.<br/>\n&gt;<br/>\n&gt; When I took him to the dentist recently the report was no cavities but more<br/>\n&gt; plaque than his sister had.<br/>\n&gt;<br/>\n&gt; And, he&#39;s got a sweet tooth, eating ice cream every day and bananas all<br/>\n&gt; night long.<br/>\n&gt;<br/>\n&gt; I have sooooooooooo much fear around this, that I can hardly see straight<br/>\n&gt; when it comes to teeth brushing and I am driving him bananas. He is eight<br/>\n&gt; years old and he wants to brush or not brush his teeth in his own way. When<br/>\n&gt; I see him simply suck on the toothbrush covered with toothpaste once a day<br/>\n&gt; for less than a minute and with no circular movements on his teeth, FEAR<br/>\n&gt; comes boiling up.<br/>\n&gt;<br/>\n&gt; How in the world do I let go of this fear, obviously it is bigger than just<br/>\n&gt; teeth. It has to do with his heart and his life and my guilt and what ever<br/>\n&gt; else.<br/>\n&gt;<br/>\n&gt; Help!!! I want to let go!!!!!!<br/>\n&gt;<br/>\n&gt; Love,<br/>\n&gt;<br/>\n&gt; Elli<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":237471585,"authorName":"sistergoddesselli","from":"&quot;sistergoddesselli&quot; &lt;elinorsparks@...&gt;","profile":"sistergoddesselli","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"how do I let go???","postDate":"1241837240","msgId":39988,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1MnFybyt0ZThmQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":39989,"prevInTime":39987,"nextInTime":39989,"topicId":39988,"numMessagesInTopic":0,"msgSnippet":"My son has a heart condition, that will eventually kill him if nothing else does.  According to the doctors it will shorten his life and it already limits his","messageBody":"<div id=\"ygrps-yiv-745394823\">My son has a heart condition, that will eventually kill him if nothing else does.  According to the doctors it will shorten his life and it already limits his ability to do some of the things he wants to do (he can&#39;t play football, they won&#39;t take him in the Air Force which is his current dream.)  <br/>\n<br/>\nHealthy teeth are important, according to the doctors, because mouth bacteria in the blood stream can have a negative impact on the heart and cavities and dental work make it easier for the bacteria to get into the blood.<br/>\n<br/>\nHe had cavities as a baby. <br/>\n<br/>\nWhen I took him to the dentist recently the report was no cavities but more plaque than his sister had.  <br/>\n<br/>\nAnd, he&#39;s got a sweet tooth, eating ice cream every day and bananas all night long.<br/>\n<br/>\nI have sooooooooooo much fear around this, that I can hardly see straight when it comes to teeth brushing and I am driving him bananas.  He is eight years old and he wants to brush or not brush his teeth in his own way.  When I see him simply suck on the toothbrush covered with toothpaste once a day for less than a minute and with no circular movements on his teeth, FEAR comes boiling up.  <br/>\n<br/>\nHow in the world do I let go of this fear, obviously it is bigger than just teeth.  It has to do with his heart and his life and my guilt and what ever else.<br/>\n<br/>\nHelp!!!  I want to let go!!!!!!<br/>\n<br/>\nLove,<br/>\n<br/>\nElli</div>","specialLinks":[]}],"prevTopicId":40025,"nextTopicId":39999}}