{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":163420782,"authorName":"Julie v.","from":"&quot;Julie v.&quot; &lt;jlvw@...&gt;","profile":"vegfam3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ruining/Wasting Things","postDate":"1184250172","msgId":24939,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3NWRmcysxMThhZUBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PGY3MzA4aCtmcWJhQGVHcm91cHMuY29tPg=="},"prevInTopic":24927,"nextInTopic":0,"prevInTime":24938,"nextInTime":24940,"topicId":24905,"numMessagesInTopic":0,"msgSnippet":"My mom said this same thing, after smoking for almost 40 years, when she quit she used to buy boxes of straws and have them handy for twisting and turning and","messageBody":"<div id=\"ygrps-yiv-1401098595\">My mom said this same thing, after smoking for almost 40 years, when she quit she used <br/>\nto buy boxes of straws and have them handy for twisting and turning and occasionally <br/>\nchewing on.  <br/>\n<br/>\nJulie<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;bobcatpris2000&quot; &lt;bobcatpris2000@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; Hi,<br/>\n&gt; <br/>\n&gt; This thread about ruining/wasting things seems to be partly about the <br/>\n&gt; sensory issue of something that focuses the hands and mind. It makes <br/>\n&gt; me think of a story of my mom&#39;s when the issue of cigarettes would <br/>\n&gt; come up years ago. She had a friend in college who suddenly started <br/>\n&gt; smoking a lot. My mom was dismayed. When she asked her why she was <br/>\n&gt; smoking, she said, &quot;It gives me something to do with my hands&quot;. It <br/>\n&gt; made me afraid to try smoking (not that that was my mom&#39;s intent in <br/>\n&gt; telling the story) because I LOVE to have my hands busy!<br/>\n&gt; <br/>\n&gt; Priscilla<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":221105640,"authorName":"bobcatpris2000","from":"&quot;bobcatpris2000&quot; &lt;bobcatpris2000@...&gt;","profile":"bobcatpris2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ruining/Wasting Things","postDate":"1184171089","msgId":24927,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3MzA4aCtmcWJhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY3MDJoZSs5c2w5QGVHcm91cHMuY29tPg=="},"prevInTopic":24924,"nextInTopic":24939,"prevInTime":24926,"nextInTime":24928,"topicId":24905,"numMessagesInTopic":0,"msgSnippet":"Hi, This thread about ruining/wasting things seems to be partly about the sensory issue of something that focuses the hands and mind. It makes me think of a","messageBody":"<div id=\"ygrps-yiv-87678162\">Hi,<br/>\n<br/>\nThis thread about ruining/wasting things seems to be partly about the <br/>\nsensory issue of something that focuses the hands and mind. It makes <br/>\nme think of a story of my mom&#39;s when the issue of cigarettes would <br/>\ncome up years ago. She had a friend in college who suddenly started <br/>\nsmoking a lot. My mom was dismayed. When she asked her why she was <br/>\nsmoking, she said, &quot;It gives me something to do with my hands&quot;. It <br/>\nmade me afraid to try smoking (not that that was my mom&#39;s intent in <br/>\ntelling the story) because I LOVE to have my hands busy!<br/>\n<br/>\nPriscilla</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ruining/Wasting Things","postDate":"1184166970","msgId":24924,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3MnM3cStwMTkyQGVHcm91cHMuY29tPg=="},"prevInTopic":24923,"nextInTopic":24927,"prevInTime":24923,"nextInTime":24925,"topicId":24905,"numMessagesInTopic":0,"msgSnippet":"... I ve found, as Rob mentioned, shopping at dollar stores to be helpful, here. I buy Morgan s spices, flour, etc there so she can experiment to her heart s","messageBody":"<div id=\"ygrps-yiv-664352767\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Emilie &lt;erugard@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; She also likes to <br/>\n&gt; do what we call &quot;mad scientist&quot; in the bathtub with bins of <br/>\n&gt; cornstarch and water,  food coloring in squeeze bottles, soap and <br/>\n&gt; other varying items.<br/>\n<br/>\n </span></blockquote>I&#39;ve found, as Rob mentioned, shopping at dollar stores to be <br/>\nhelpful, here. I buy &quot;Morgan&#39;s&quot; spices, flour, etc there so she can <br/>\nexperiment to her heart&#39;s content without me going into shock when <br/>\nshe uses a whole container of whatever. Its also nice to have a <br/>\nstockpile of itty-bitty containers to make some pre-mixes into. So <br/>\none day Mo and I can mix up various dry ingredients and colorings <br/>\nand put them in small containers to re-mix later. <br/>\n<br/>\nI do something similar with cleaning products - although that&#39;s as <br/>\nmuch for safety as economy. We have spray bottles of vinegar, plain <br/>\nwater and soapy water for her to use and experiment with, and a <br/>\nvariety of sponges and rags. <br/>\n<br/>\nI had to laugh about tape... we try to never be without tape around <br/>\nhere. Its probably the most heavily used &quot;supply&quot;. When we&#39;re <br/>\nfeeling flush we stock up and get a few different kinds - duct and <br/>\nelectrical and masking and whatever catches our eyes - but plain ol&#39; <br/>\nclear tape is as essential as toilet paper in our house ;)<br/>\n<br/>\n---Meredith (Mo 5.5, Ray 13)</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Ruining/Wasting Things","postDate":"1184160472","msgId":24923,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1MjYzOTRBQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":24920,"nextInTopic":24924,"prevInTime":24922,"nextInTime":24924,"topicId":24905,"numMessagesInTopic":0,"msgSnippet":"Just wanted to toss in 2 cents on the peeling/shredding thing: my hubby (well past childhood chronologically) peels anything peelable in range - soda bottle","messageBody":"<div id=\"ygrps-yiv-565122527\">Just wanted to toss in 2 cents on the peeling/shredding thing: my hubby<br/>\n(well past childhood chronologically) peels anything peelable in range -<br/>\nsoda bottle labels, cans, jars, anything. He has to keep his hands<br/>\noccupied so that his mind can function in an orderly manner. If he tries<br/>\nto keep his hands still, it takes too much energy and he loses his train<br/>\nof thought easily. If he has something at hand to peel, twist, curl,<br/>\nbend, tap, wiggle, fold, etc he&#39;s just fine. So, we have had small<br/>\ncontainers full of bent and twisted paper clips, folded paper shapes,<br/>\nand so on. Sometimes the &quot;puttering&quot; turns into something more - as when<br/>\nhe went from &quot;fiddling&quot; with craft sticks to using a drill to make holes<br/>\nin the ends then fishing line to attach them together to create geodesic<br/>\ntype balls (and he recently covered one with white duct tape - looks<br/>\npretty cool); or currently as he&#39;s spending a lot of time creating<br/>\nthings from duct tape (we&#39;ve all got new, customized, multi color game<br/>\ncases for our hand held gaming systems plus I&#39;ve got a nice &quot;grab&#39;n&#39;go&quot;<br/>\ntype wallet that holds the basics for quick trips when a purse isn&#39;t<br/>\nneeded).<br/>\n <br/>\nKnowing that DH needs to have his hands busy when he thinks has been<br/>\nhelpful in understanding that DS needs to move when he thinks and talks<br/>\n- he paces or bounces or whatever. One time, just to test my &quot;theory&quot;, I<br/>\ncasually moved into his path while he was talking about something. He<br/>\nlost his immediate sentence. I moved so he could continue on his circuit<br/>\nand he resumed his discussion, picking up where he left off. It was<br/>\ntempting to play with it a bit more but I didn&#39;t want to frustrate him<br/>\nso I didn&#39;t. I do, however, sometimes tell him that I&#39;m still listening<br/>\nbut I can&#39;t look at him because I&#39;m getting dizzy watching him go around<br/>\nand around the room. Or, I&#39;ll focus on an area that he passes through so<br/>\nI can look at him some of the time but not watch him roaming the whole<br/>\ntime. On occasion, when I&#39;ve really wanted to make eye contact while<br/>\ndiscussing something specific, I&#39;ll suggest he be a basketball - he<br/>\nstands in front of me and bounces up and down, tapping my outstretched<br/>\nhand with his head so it looks as if I was &#39;dribbling&#39; him. That way he<br/>\ncan move and I don&#39;t get so dizzy and I can look him in the face while<br/>\nwe talk.<br/>\n <br/>\nDeb <br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163420782,"authorName":"Julie v.","from":"&quot;Julie v.&quot; &lt;jlvw@...&gt;","profile":"vegfam3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ruining/Wasting Things","postDate":"1184088790","msgId":24920,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3MGZzbSszdnI5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY3MDJoZSs5c2w5QGVHcm91cHMuY29tPg=="},"prevInTopic":24917,"nextInTopic":24923,"prevInTime":24919,"nextInTime":24921,"topicId":24905,"numMessagesInTopic":0,"msgSnippet":"Thanks everyone for your thoughtful insights on this subject!  I knew there was a reason he was doing it, so that s why I never made a big deal, but had just","messageBody":"<div id=\"ygrps-yiv-1450953659\">Thanks everyone for your thoughtful insights on this subject!  I knew there was a reason <br/>\nhe was doing it, so that&#39;s why I never made a big deal, but had just found myself recently <br/>\nstarting to feel uptight about it, that&#39;s why I posted.<br/>\n<br/>\nHe&#39;s never been really into crafty things, but after reading the posts, I&#39;m probably not <br/>\nintroducing the right kind of crafts to him.  I never even knew that scratch boards or <br/>\nwaxed art paper even existed, will definately be on the lookout for those.<br/>\n<br/>\nRob<br/>\n<br/>\nI never thought of going to the dollar store, what a great idea!  I know that if I bought a <br/>\nhuge pack of t.p. both my boys would be occupied for some time.  Bandages too, my older <br/>\nson likes to put a fresh one on his hurts about every couple hours:)<br/>\n<br/>\nRobin,<br/>\n<br/>\nHe loves making balls out of the tape, especially with masking and duct tape.  I like how <br/>\nyou described about the proscribed ways things are to be used and the unconvential ways <br/>\nour children like to use them, I guess this is what unschooling is all about, if he was in <br/>\nschool and did something unconventional with a craft item, I&#39;m sure the teachers would let <br/>\nhim know it wasn&#39;t o.k.  I never want him to feel that because he&#39;s doing something <br/>\ndifferent than the way most people do it that it&#39;s wrong or somehow &quot;weird&quot;.  On a whole <br/>\nhe seems to do most things different and has helped me move away from my &quot;schooled&quot; <br/>\nmentality a bit, although I still need more nudging:)<br/>\n<br/>\nI also liked the suggestion of expanding on whatever it is he is fixated on by finding out <br/>\nmore information about it, he is very much into looking things up on the computer right <br/>\nnow and I think he would definitely be open to it.  <br/>\n<br/>\nRen,<br/>\n<br/>\nWe can afford it to a point, I mean we are definitely on a budget, but a few toilet paper <br/>\nrolls or the like doesn&#39;t pose a major problem.  I like the suggestion of using re-usable <br/>\nitems like paperclips, rubberbands, bandages, ect..I will see what of those items he might <br/>\nembrace.  Where can I find your article?<br/>\n<br/>\nMelissa,<br/>\n<br/>\nI liked your idea of putting the things into bags to be re-used, we actually have done that <br/>\nwith the papertowels, the other day he ripped them off the roll one by one and made a pile <br/>\non the floor so I just gathered them up and put them in a grocery bag and that&#39;s what <br/>\nwe&#39;ve been using this week.<br/>\n<br/>\nLisa,<br/>\n<br/>\nI didn&#39;t mention it because I forgot, but he loves to tear apart foam also and tore all of his <br/>\n&quot;rockets&quot; from his stomp rocket kit into tiny pieces on the floor.  A few months back he <br/>\npainted a bunch of styrafoam balls for a solar system model and just recently has started <br/>\nscraping all the paint off of them with his fingernails.  I noticed one day that it actually <br/>\ncalmed him down a bit when we had friends over and he was starting to get agressive, he <br/>\nspotted one of those balls and started going to town and after he had scraped all the paint <br/>\noff he had calmed himself down.  When I saw that I thought about going and buying more <br/>\nballs, and if he&#39;s up for it I&#39;m going to go this week.<br/>\n<br/>\nEmilie,<br/>\n<br/>\nI like your ideas of reusing the wax by melting it down, I think he would love it!  Also he <br/>\nhas recently been doing a little bit of experimenting with food coloring and different <br/>\nliquids so I came across this color mixer where you put water and then two different colors <br/>\nin the two different compartments and then when you go to pour it they both pour into a <br/>\ncentral container and mix.  He loved mixing it and pouring it into the bathtub, then finally <br/>\njust wanted the tablets to drop in the tub to dissolve.  I think I will suggest other items like <br/>\ncornstarch and bins and bottles, I know he will like it, he&#39;s always loved water play!<br/>\n<br/>\nAlso Emilie, I think that as long as your child is open to your suggestions that it&#39;s not like <br/>\nyour are making her fit your needs.  Like with the tape, if she&#39;s unrolling it and making a <br/>\nball, you suggesting &quot;hey, you know you could sculpt that into something?&quot;, I think just <br/>\nopens up her world.  Maybe she never thought that was an option.  As long as your not <br/>\ninsisting she do what you suggest I think it&#39;s definitely inline with unschooling.  I do that <br/>\nwith my son all the time and sometimes he&#39;s like &quot;wow, let&#39;s do it&quot; and other times he&#39;s like <br/>\n&quot;no, I want to do this with it&quot; and I shut up:)<br/>\n<br/>\nThanks again everyone for all the helpful insights!<br/>\n<br/>\nJulie<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://lerendzonderschool.blogspot.com/\">http://lerendzonderschool.blogspot.com/</a></div>","specialLinks":[]},{"userId":238795563,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;jlblock01@...&gt;","profile":"jlblock01","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ruining/Wasting Things","postDate":"1184075118","msgId":24917,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3MDJoZSs5c2w5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY2dGtwMyt2Z3F1QGVHcm91cHMuY29tPg=="},"prevInTopic":24913,"nextInTopic":24920,"prevInTime":24916,"nextInTime":24919,"topicId":24905,"numMessagesInTopic":0,"msgSnippet":"My two youngest kids love tape... for me it wasn t so much that they were wasting tape as it was that each time I needed some there wasn t any for me to use!","messageBody":"<div id=\"ygrps-yiv-29211200\">My two youngest kids love tape... for me it wasn&#39;t so much that they<br/>\nwere wasting tape as it was that each time I needed some there wasn&#39;t<br/>\nany for me to use!   At that point I bought several rolls from the<br/>\ncheapie bin at Target (.75 each or something) and wrote their names on<br/>\ntheir tape and wrote my name on a roll for me to use.   I made sure<br/>\nthat they knew that it wasn&#39;t so much that my tape was off limits but<br/>\nthat it made me frustrated when I needed some and it was all gone.  <br/>\nThey occasionally go through all of theirs and ask for mine and I<br/>\nusually let them have it .... basically if they ask and I give it then<br/>\nI KNOW it&#39;s gone so I can replace it when I go to the store.  I try to<br/>\nmake sure they have plenty of tape, yarn, white paper and so forth ...<br/>\nmy 12 yr old will go through white paper like crazy which again I<br/>\ndon&#39;t mind but get frustrated when I need some and it&#39;s all gone and I<br/>\ndidn&#39;t expect it to be.   My solution is again to buy less expensive<br/>\nwhite paper for her to draw on than I normally use in my printer and<br/>\nlet her know that is her paper ... I feel like this gives her freedom<br/>\nto do what she needs to do while being respectful of other people&#39;s<br/>\nbelongings.   <br/>\nI think most of the time when kids do things that seem destructive (as<br/>\nin the case of scraping off paint etc) it meets a sensory need.  My<br/>\nson will tear apart anything that is foam (nerf darts, balls etc)  and<br/>\nmy daughter shreds toilet paper (there is always a nest next to the<br/>\ntoilet!)  periodically I pick up the nest and toss it in the toilet to<br/>\nbe flushed at the next flush...we also found that the darts can<br/>\nsometimes be repaired with foam glue and sometimes they need to be<br/>\ntossed.   He also peels off labels from things ... mostly they don&#39;t<br/>\nmatter but now and then it does ...like the paper he recently peeled<br/>\noff of a really nice painting&#39;s backing from the framer&#39;s.   I had it<br/>\nrepaired and explained to him that if the paper was gone the painting<br/>\nmight fall out of the frame and be damaged.   He was fascinated by<br/>\nwatching the framer redo the paper and I think that he probably won&#39;t<br/>\ndo it again because he knows the purpose for the paper now (when it<br/>\nwas explained to him he said &quot;wow I didn&#39;t know it had a job&quot;  )   <br/>\nWhen my husband was little if anything was broken or damaged or he<br/>\nwasted anything he was shamed, punished and harangued about it for<br/>\nweeks or months (or years!) ...really honestly his dad recently<br/>\nbrought up an instance of him peeling wallpaper when he was 7!  He is<br/>\nbothered by the things that the kids do that he has been programmed to<br/>\nthink of as wasteful or destructive but he tries really hard because<br/>\nof his experiences not to say anything or show that he is bothered by<br/>\nit.</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ruining/Wasting Things","postDate":"1184030299","msgId":24913,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY2dW1vcitvZnZtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY2dGtwMyt2Z3F1QGVHcm91cHMuY29tPg=="},"prevInTopic":24911,"nextInTopic":24917,"prevInTime":24912,"nextInTime":24914,"topicId":24905,"numMessagesInTopic":0,"msgSnippet":"~~I guess these items are cheap and easily replaceable and I should just look at it as money not spend on manipulatives , but sometimes it s hard when I just","messageBody":"<div id=\"ygrps-yiv-527087104\">~~I guess these items are cheap and easily replaceable and I<br/>\nshould just look at it as money not spend on &quot;manipulatives&quot;, but<br/>\nsometimes it&#39;s hard when I just bought a 5-pack of tape at the store<br/>\nintending it to last for some time and it&#39;s out in a week.~~<br/>\n<br/>\nI wrote an article a while back, titled &quot;the economics of unschooling&quot;<br/>\nin which I explored the idea of wasting/waste. If you truly don&#39;t have<br/>\nthe money for it, then you don&#39;t. That&#39;s not arbitrary. <br/>\n<br/>\nBut, if you can afford to stock him with these items (maybe he could<br/>\nhave his own bin of stuff?) then go for it. Maybe there are items that<br/>\nhave similar effects without being disposable. Ace bandages can wrap<br/>\naround stuff and be re-used. STring can usually be wrapped back up.<br/>\nPaper clips, rubber bands etc...are easily re-usable.<br/>\n<br/>\nI think it&#39;s great to shift our perspective about these tools for our<br/>\nchildren and think about what we&#39;d be willing to spend if they wanted<br/>\na book or an &quot;educational&quot; item or movie. What they are interested in<br/>\nat the moment has far more value.<br/>\n<br/>\nThere are very real budget constraints and that is something everyone<br/>\nhas to figure out, children figure this part out pretty easily. But if<br/>\nthe tape is bringing up our own issues, it&#39;s great to examine whether<br/>\nit&#39;s a worthy thing or just old baggage (I can just hear my parents<br/>\ncarrying on about waste right now). :)<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"&quot;Melissa&quot; &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ruining/Wasting Things","postDate":"1184011545","msgId":24908,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY2dTRlcCsxMDY0c0BlR3JvdXBzLmNvbT4=","inReplyToHeader":"PGY2dGtwMyt2Z3F1QGVHcm91cHMuY29tPg=="},"prevInTopic":24907,"nextInTopic":24909,"prevInTime":24907,"nextInTime":24909,"topicId":24905,"numMessagesInTopic":0,"msgSnippet":"I think all of my kids spent about a year doing such things, with the oldest I made a bigger deal of it than I should have. With the little ones, we just put","messageBody":"<div id=\"ygrps-yiv-1821260792\">I think all of my kids spent about a year doing such things, with the oldest I made a bigger <br/>\ndeal of it than I should have. With the little ones, we just put it all into the ziplock boxes, <br/>\nsnack cups, etc and use them later (either for intended purposes or for some craft the girls <br/>\ncreated). I don&#39;t know about redirection, it just seemed better to let them work through <br/>\ntheir need, and clean it up later. I know that unwrapping duct tape for me is similar <br/>\nauditorily to watching a fire, it&#39;s hypnotic! <br/>\nOn picking paint, we have bare spots around our house. I&#39;m rather thankful for them, <br/>\nbecause one of our daughters loved to strip the hollow doors of the wood. So we have two <br/>\ndoors that are nonexistant beyond the 1x2 inch frames from about 24 inches down. Paint <br/>\nis so much easier to fix ;-)<br/>\nOne of our daughters loved to put stickers all over the door jam, and another daughter <br/>\nwould peel them off, dozens a day. Maybe he needs more craft time? Scratch art (the black <br/>\nboards that you scratch off and the colors are painted underneath? We used to make them <br/>\nby coloring and then covering it all with black crayon?)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Julie v.&quot; &lt;jlvw@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; My ds (age 5) loves to unroll things, tape, yarn, toilet paper, papertowels, dental floss, <br/>\n&gt; white out tape, ect...  I&#39;ve never said anything because he seems to enjoy what he is <br/>\ndoing, <br/>\n&lt;snip&gt;<br/>\n Does anybody have any ideas to re-direct him to that would <br/>\n&gt; fulfill this obvious need he has? </span></blockquote></div>","specialLinks":[]},{"userId":276731379,"authorName":"robin.bentley@comcast.net","from":"robin.bentley@...","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Ruining/Wasting Things","postDate":"1184011034","msgId":24909,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA3MDkyMDA3MTk1Ny41MDAyLjQ2OTI5MzFBMDAwQTQ4RkQwMDAwMTM4QTIyMDA3NjEzOTQ5NzBBMDQ5QjAyMEEwREQyMDIwNzBEMDE5REBjb21jYXN0Lm5ldD4="},"prevInTopic":24908,"nextInTopic":24911,"prevInTime":24908,"nextInTime":24910,"topicId":24905,"numMessagesInTopic":0,"msgSnippet":"My dd (12) is a tactile person.  She currently works in oil-based clay for hours and hours, picks flowers and berries and leaves for her dinosaurs or dragons","messageBody":"<div id=\"ygrps-yiv-1513688116\">My dd (12) is a tactile person.  She currently works in oil-based clay for hours and hours, picks flowers and berries and leaves for her dinosaurs or dragons to eat or to incorporate in her clay scenes, carves sidewalk chalk into shapes (and uses the powder to make &quot;stews&quot; and such) and used to delight in making &quot;toilet paper soup&quot; out of tp, water and shavings of soap.  She used to love to tape things together, to make balls out of tape, to string wool from one end of a desk to another, making spider webs and so on.  She always finds new ways to use things that we tend to have proscribed ways of using &lt;g&gt;.<br/>\nDoes anybody have any ideas to re-direct him to that <br/>\n<blockquote><span title=\"ireply\"> &gt; would <br/>\n&gt; fulfill this obvious need he has? I guess these items are cheap and easily <br/>\n&gt; replaceable and I <br/>\n&gt; should just look at it as money not spend on &quot;manipulatives&quot;, but sometimes it&#39;s <br/>\n&gt; hard <br/>\n&gt; when I just bought a 5-pack of tape at the store intending it to last for some <br/>\n&gt; time and it&#39;s <br/>\n&gt; out in a week. <br/>\n </span></blockquote>I look at a lot of these things as &quot;consumables&quot;, just like toilet paper, paper towel, laundry soap, etc.  They all have a conventional &quot;job&quot; to do, but I began to see when dd was younger that she was learning by using them in unconventional and often messy ways.  Sometimes, unfortunately, she learned that it got me uptight and judgmental.  I&#39;ve worked on that, for sure.  It was a matter of understanding her point of view and watching her happiness in her creativity.  For me, it was also unlearning what was considered creative or okay with materials.  The schooling runs deep &lt;g&gt;.<br/>\nAs Rob suggested, buy reasonably cheap (but not so cheap that it&#39;s useless) tape, dental floss (or some substitute), paper towel, toilet paper *just for him*.  Consider them art supplies!  Buy what you need for yourself.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; The other thing he likes to do is scrape things with his fingernails. While <br/>\n&gt; sitting on the <br/>\n&gt; toilet he has scraped all the paint off of the trim on the door, while playing <br/>\n&gt; on the <br/>\n&gt; computer he has scraped all the paint off the top of the desk that is right in <br/>\n&gt; front of the <br/>\n&gt; computer. If he finds a candle he will sit and scrape it into shavings on the <br/>\n&gt; floor. The <br/>\n&gt; other day he found a pack of pencils that we were going to make pinwheels out <br/>\n&gt; of, but he <br/>\n&gt; tore all the erasers off with his fingernails. <br/>\n </span></blockquote>Sounds like my dd, especially with regard to the shavings (see above sidewalk chalk and soap &lt;g&gt;).  I look at it as part of her need to reveal things, such as a sculptor does.  However, you may want to redirect some of that to things he can safely do.  Find him an old baking sheet to shave cheap candles onto (then maybe see what happens to the shavings if you put them in a warm oven together).  My dd likes to cover her hands with white glue, then peel it off (she came by this genetically, I guess, as I *loved* doing this when I was younger), so you could try that and get an industrial sized container of glue that you can &quot;decant&quot; if it works out.  Get him some of those waxed art papers that reveal colors when you scratch them off for use while he&#39;s on the toilet or at the computer.  <br/>\nThe process has ended up being a two-fold thing for me, as it often is with unschooling.  It required me to change my attitude about &quot;wastefulness&quot; and what was acceptably creative.  It was about finding ways to help my dd get what she wants (experience, feelings, seeing cause and effect, autonomy in creativity and perhaps other things I haven&#39;t thought of) that we can all live with in terms of cost, mess and space.<br/>\nFor her, she has watched me go from absolute horror and shaming to finding ways to happily facilitate her experiments and find creative solutions of my own (thanks to wise voices on these lists over the years).  She&#39;s seen me become a better mom, which is a good thing.  <br/>\nMy other suggestion is doing some, if not all, of this stuff with him.  When you do, you can talk using things for creativity vs. what they are conventionally used for.  That could lead you in interesting directions (looking things up on the internet or in books; making connections, for instance, about paper and pencils coming from the same raw material or discovering new things about wax) or it may just be about fun in the moment.<br/>\nIt&#39;s one thing I regret not doing more of when dd was younger, and though I will offer to join her now on occasion, my full participation is a work in progress.  At 12, dd wants more time to work on things herself, so I may have missed that opportunity, unfortunately.  So dive in with him and you may learn something new about yourself!<br/>\nRobin B.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Has anybody else&#39;s child done similar things? <br/>\n&gt; <br/>\n&gt; Any ideas? <br/>\n&gt; <br/>\n&gt; Thanks, <br/>\n&gt; <br/>\n&gt; Julie <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://lerendzonderschool.blogspot.com/\">http://lerendzonderschool.blogspot.com/</a> <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Yahoo! Groups Links <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":299902014,"authorName":"Emilie","from":"Emilie &lt;erugard@...&gt;","profile":"breathemama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Ruining/Wasting Things","postDate":"1184009867","msgId":24911,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGY2dGtwMyt2Z3F1QGVHcm91cHMuY29tPg==","referencesHeader":"PGY2dGtwMyt2Z3F1QGVHcm91cHMuY29tPg=="},"prevInTopic":24909,"nextInTopic":24913,"prevInTime":24910,"nextInTime":24912,"topicId":24905,"numMessagesInTopic":0,"msgSnippet":"My oldest daughter really likes to experiment and make bizarre messes like emptying out a whole container of baby powder behind the bed (6 months later an I m","messageBody":"<div id=\"ygrps-yiv-106502902\">My oldest daughter really likes to experiment and make bizarre messes <br/>\nlike emptying out a whole container of baby powder behind the bed (6 <br/>\nmonths later an I&#39;m still finding more of it :-) . Or smearing <br/>\nvaseline all over things. As well as unrolling scads of tape and toilet paper.<br/>\n<br/>\n  I don&#39;t know if this is unschooly enough, but my response has been <br/>\nto roll it back up again and have that be the special roll of floss, <br/>\nor paper for unrolling. Then I talk about how this way we can have <br/>\nfun and play with it but still make sure we don&#39;t use too many trees <br/>\nup . I would suggest the same thing with the scraping maybe he could <br/>\nhave a big candle for scraping in a bowl, then you could melt down <br/>\nthe wax together and make a new one just for scraping all over again <br/>\nand again. If you got him to help you repaint the areas where paint <br/>\nhas been removed maybe he would want to keep it nice and fresh <br/>\nlooking. Or maybe you could give him a board painted with nontoxic <br/>\npaint to scrape off so you know it doesn&#39;t contain lead. Even make <br/>\nlayers of different colors which can be scraped off one by one. You <br/>\ncan put the paint on together.<br/>\n<br/>\n      I have learned that my daughter needs lots of opportunities to <br/>\nmake mixtures of sensory items. Cooking and baking regularly with her <br/>\ngetting to put her hands in it seems to be satisfying for her and <br/>\nthen I find fewer weird messes around the house. This is a creative <br/>\nendeavor and nothing is wasted because we eat it. She also likes to <br/>\ndo what we call &quot;mad scientist&quot; in the bathtub with bins of <br/>\ncornstarch and water,  food coloring in squeeze bottles, soap and <br/>\nother varying items. Then I just hose it down at the end or we do it <br/>\ntogether. I guess this is is a little wasteful but is it worse than <br/>\nmaking playdough and then letting it dry out?<br/>\n<br/>\nDd also loves to unroll tape but encouraging her to make things with <br/>\nthe tape, even using lots and lots of tape seems to refocus her and <br/>\ngive her an extension to the enjoyable unrolling part. This has <br/>\nresulted in her using less tape over all, although we still use a lot <br/>\nand making really cool 3d shapes out of paper.<br/>\n<br/>\nIs this honoring her desires enough or am I trying too hard to make <br/>\nher play fit my needs? Maybe this is not being radical enough? I <br/>\ndon&#39;t know. Maybe someone else can speak on that?<br/>\n<br/>\nEmilie<br/>\n(Felicity 6, Cecilia 3, Charlotte, 1)<br/>\n<br/>\n11:38 AM 09/07/2007, you wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;My ds (age 5) loves to unroll things, tape, yarn, toilet paper, <br/>\n&gt;papertowels, dental floss,<br/>\n&gt;white out tape, ect... I&#39;ve never said anything because he seems to <br/>\n&gt;enjoy what he is doing,<br/>\n&gt;he&#39;s not doing it to be destructive, he just likes it for some <br/>\n&gt;reason. I guess my problem<br/>\n&gt;with it is the wastefullness of it. He has gone through 3 rolls of <br/>\n&gt;scotch tape, 2 dental floss<br/>\n&gt;containers and a roll of paper towels in one day! Obviously on <br/>\n&gt;occasion my dh or I have<br/>\n&gt;mentioned the word &quot;wasting&quot; because sometimes when he goes to do it <br/>\n&gt;he will say &quot;I&#39;m<br/>\n&gt;playing a wasting game&quot;:) Does anybody have any ideas to re-direct <br/>\n&gt;him to that would<br/>\n&gt;fulfill this obvious need he has? I guess these items are cheap and <br/>\n&gt;easily replaceable and I<br/>\n&gt;should just look at it as money not spend on &quot;manipulatives&quot;, but <br/>\n&gt;sometimes it&#39;s hard<br/>\n&gt;when I just bought a 5-pack of tape at the store intending it to <br/>\n&gt;last for some time and it&#39;s<br/>\n&gt;out in a week.<br/>\n&gt;<br/>\n&gt;The other thing he likes to do is scrape things with his <br/>\n&gt;fingernails. While sitting on the<br/>\n&gt;toilet he has scraped all the paint off of the trim on the door, <br/>\n&gt;while playing on the<br/>\n&gt;computer he has scraped all the paint off the top of the desk that <br/>\n&gt;is right in front of the<br/>\n&gt;computer. If he finds a candle he will sit and scrape it into <br/>\n&gt;shavings on the floor. The<br/>\n&gt;other day he found a pack of pencils that we were going to make <br/>\n&gt;pinwheels out of, but he<br/>\n&gt;tore all the erasers off with his fingernails.<br/>\n&gt;<br/>\n&gt;Has anybody else&#39;s child done similar things?<br/>\n&gt;<br/>\n&gt;Any ideas?<br/>\n&gt;<br/>\n&gt;Thanks,<br/>\n&gt;<br/>\n&gt;Julie<br/>\n&gt;&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://lerendzonderschool.blogspot.com/\">http://lerendzonderschool.blogspot.com/</a>&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://lerendzonderschool.blogspot.com/\">http://lerendzonderschool.blogspot.com/</a><br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":195592821,"authorName":"Robert Saxon","from":"&quot;Robert Saxon&quot; &lt;TheSaxons@...&gt;","profile":"rob_saxon_2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Ruining/Wasting Things","postDate":"1184007683","msgId":24907,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1MzUwYTJjMDcwNzA5MTIwMWphMWQ4NjA1b2QxZTdhMTgzNDI0YzQxZEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGY2dGtwMyt2Z3F1QGVHcm91cHMuY29tPg==","referencesHeader":"PGY2dGtwMyt2Z3F1QGVHcm91cHMuY29tPg=="},"prevInTopic":24905,"nextInTopic":24908,"prevInTime":24906,"nextInTime":24908,"topicId":24905,"numMessagesInTopic":0,"msgSnippet":"Julie, Regarding the unrolling of things, have you tried stopping by the bargain bin for those 24-pack rolls of toilet paper for $5 (or somesuch deal)? ","messageBody":"<div id=\"ygrps-yiv-2128675120\">Julie,<br/>\n<br/>\nRegarding the unrolling of things, have you tried stopping by the bargain<br/>\nbin for those 24-pack rolls of toilet paper for $5 (or somesuch deal)?<br/>\nWhatever it is, find it cheap for him.  We had similar issues with<br/>\nbandages.  They wanted a bandage for EVERYthing, so DW bought really<br/>\ninexpensive bandages for them to play with from the dollar store.<br/>\nMoney-wise, it was great.  Materials-wise, well, they were still &quot;wasting&quot;<br/>\nit.  It was still going in the landfill, but my pocketbook wasn&#39;t hurting<br/>\nfrom it.  And now they&#39;re pretty well off of it, though I don&#39;t remember how<br/>\nlong they were on that kick (sorry!).<br/>\n<br/>\nScraping things with fingernails?  Sorry, not sure what to do about that.<br/>\nYou could try getting things for him that are his, but it&#39;s something he can<br/>\ndo anywhere to anything.  That&#39;s a conundrum to me.<br/>\n<br/>\n--Rob<br/>\nDH to Seana for 10 years<br/>\n&quot;Daddy!&quot; to Genevieve (5) and Elissa (4)<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 7/9/07, Julie v. &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jlvw@...\">jlvw@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   My ds (age 5) loves to unroll things, tape, yarn, toilet paper,<br/>\n&gt; papertowels, dental floss,<br/>\n&gt; white out tape, ect... I&#39;ve never said anything because he seems to enjoy<br/>\n&gt; what he is doing,<br/>\n&gt; he&#39;s not doing it to be destructive, he just likes it for some reason. I<br/>\n&gt; guess my problem<br/>\n&gt; with it is the wastefullness of it. He has gone through 3 rolls of scotch<br/>\n&gt; tape, 2 dental floss<br/>\n&gt; containers and a roll of paper towels in one day! Obviously on occasion my<br/>\n&gt; dh or I have<br/>\n&gt; mentioned the word &quot;wasting&quot; because sometimes when he goes to do it he<br/>\n&gt; will say &quot;I&#39;m<br/>\n&gt; playing a wasting game&quot;:) Does anybody have any ideas to re-direct him to<br/>\n&gt; that would<br/>\n&gt; fulfill this obvious need he has? I guess these items are cheap and easily<br/>\n&gt; replaceable and I<br/>\n&gt; should just look at it as money not spend on &quot;manipulatives&quot;, but<br/>\n&gt; sometimes it&#39;s hard<br/>\n&gt; when I just bought a 5-pack of tape at the store intending it to last for<br/>\n&gt; some time and it&#39;s<br/>\n&gt; out in a week.<br/>\n&gt;<br/>\n&gt; The other thing he likes to do is scrape things with his fingernails.<br/>\n&gt; While sitting on the<br/>\n&gt; toilet he has scraped all the paint off of the trim on the door, while<br/>\n&gt; playing on the<br/>\n&gt; computer he has scraped all the paint off the top of the desk that is<br/>\n&gt; right in front of the<br/>\n&gt; computer. If he finds a candle he will sit and scrape it into shavings on<br/>\n&gt; the floor. The<br/>\n&gt; other day he found a pack of pencils that we were going to make pinwheels<br/>\n&gt; out of, but he<br/>\n&gt; tore all the erasers off with his fingernails.<br/>\n&gt;<br/>\n&gt; Has anybody else&#39;s child done similar things?<br/>\n&gt;<br/>\n&gt; Any ideas?<br/>\n&gt;<br/>\n&gt; Thanks,<br/>\n&gt;<br/>\n&gt; Julie<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://lerendzonderschool.blogspot.com/\">http://lerendzonderschool.blogspot.com/</a><br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":163420782,"authorName":"Julie v.","from":"&quot;Julie v.&quot; &lt;jlvw@...&gt;","profile":"vegfam3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Ruining/Wasting Things","postDate":"1183995491","msgId":24905,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY2dGtwMyt2Z3F1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":24907,"prevInTime":24903,"nextInTime":24906,"topicId":24905,"numMessagesInTopic":0,"msgSnippet":"My ds (age 5) loves to unroll things, tape, yarn, toilet paper, papertowels, dental floss, white out tape, ect...  I ve never said anything because he seems to","messageBody":"<div id=\"ygrps-yiv-1922999911\">My ds (age 5) loves to unroll things, tape, yarn, toilet paper, papertowels, dental floss, <br/>\nwhite out tape, ect...  I&#39;ve never said anything because he seems to enjoy what he is doing, <br/>\nhe&#39;s not doing it to be destructive, he just likes it for some reason.  I guess my problem <br/>\nwith it is the wastefullness of it.  He has gone through 3 rolls of scotch tape, 2 dental floss <br/>\ncontainers and a roll of paper towels in one day!  Obviously on occasion my dh or I have <br/>\nmentioned the word &quot;wasting&quot; because sometimes when he goes to do it he will say &quot;I&#39;m <br/>\nplaying a wasting game&quot;:)  Does anybody have any ideas to re-direct him to that would <br/>\nfulfill this obvious need he has?  I guess these items are cheap and easily replaceable and I <br/>\nshould just look at it as money not spend on &quot;manipulatives&quot;, but sometimes it&#39;s hard <br/>\nwhen I just bought a 5-pack of tape at the store intending it to last for some time and it&#39;s <br/>\nout in a week.<br/>\n<br/>\nThe other thing he likes to do is scrape things with his fingernails.  While sitting on the <br/>\ntoilet he has scraped all the paint off of the trim on the door, while playing on the <br/>\ncomputer he has scraped all the paint off the top of the desk that is right in front of the <br/>\ncomputer.  If he finds a candle he will sit and scrape it into shavings on the floor.  The <br/>\nother day he found a pack of pencils that we were going to make pinwheels out of, but he <br/>\ntore all the erasers off with his fingernails.<br/>\n<br/>\nHas anybody else&#39;s child done similar things?<br/>\n<br/>\nAny ideas?<br/>\n<br/>\nThanks,<br/>\n<br/>\nJulie  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://lerendzonderschool.blogspot.com/\">http://lerendzonderschool.blogspot.com/</a></div>","specialLinks":[]}],"prevTopicId":24934,"nextTopicId":24948}}