{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":367863967,"authorName":"VT","from":"&quot;VT&quot; &lt;valeriethorp@...&gt;","profile":"valeriethorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Addiction, was Re: internet","postDate":"1317163568","msgId":47357,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1dGpuZysyNGI2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNTMuMTI4Ljk1LjE0Ny4xNjIuMTMxNjczMTIzMC5zcXVpcnJlbEB3ZWJtYWlsLmRyaXp6bGUuY29tPg=="},"prevInTopic":47340,"nextInTopic":0,"prevInTime":47356,"nextInTime":47358,"topicId":47337,"numMessagesInTopic":0,"msgSnippet":"Thanks for sharing your experience in the post below.  I also have close ties to this subject, some similar to yours and some different. I wanted to say a few","messageBody":"<div id=\"ygrps-yiv-1168917936\">Thanks for sharing your experience in the post below.  I also have close ties to this subject, some similar to yours and some different.  <br/>\n<br/>\nI wanted to say a few things on this subject before I move away from it. <br/>\n1. I think all of us who have posted on it share a caring and passionate viewpoint on the topic, and come with helpful intent.  <br/>\n2. I did not intend to label people as addicts or diminish the issues surrounding addiction; the opposite is true.  I was saying that it is not simply environment that creates a dependency.  I believe it is more complicated than that and felt it was diminishing the struggle addicts and people who are physically dependent on a chemical substance face; as if to say, just find a happy place and your life will turn around, or to say it is their fault for turning to drugs because it is just environmental and should be easy to change.  That is what I was responding to and I likely misinterpreted.<br/>\n3. I was trying to highlight the deep struggle around dependency and the very real physical effects of it.  It may be a belief, but I find it hard to imagine anyone would deny that physical dependency can be scientifically demonstrated.<br/>\n4. Thanks to Sacha Davis for pointing out the importance of recognizing the difference between addiction and dependency.  I was thinking of the two as synonymous when I responded, which they are not.<br/>\n5. From this discussion, I have moved the very significant role that environment plays in addiction to the forefront of my thoughts, instead of focusing on physical dependency.  I appreciate what has been shared on this topic; especially highlighting the environment created by unschooling as opposed to the environment that many addicts come from.<br/>\n<br/>\n-Valerie<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Sacha Davis&quot; &lt;sacha@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; As an RN I work with the addicted population so this subject is very near<br/>\n&gt; and dear to my heart.  I do sincerly mean &#39;dear&#39; because despite the<br/>\n&gt; challenges, I have a passion for serving this population.  When I work<br/>\n&gt; with them I cannot wonder what has happened to them that has caused them<br/>\n&gt; to seek out the ultimate in numbing and disassociative experiences over<br/>\n&gt; and over and over again, at the expense of their health, of their sanity. <br/>\n&gt; I think this is what people think of when they speak of addiction.  Not<br/>\n&gt; the physical addiction but the behaviors that emerge around addiction.<br/>\n&gt; <br/>\n&gt; I think in any discussion around addiction it&#39;s important to flesh out<br/>\n&gt; that addiction is different than dependency.  Yes, not every person who<br/>\n&gt; uses drugs becomes an addict and there is no guarantee of addiction, but<br/>\n&gt; dependency on medications is a very real thing. <br/>\n<br/>\n&gt; Addiction is a very complex physiological and psychosocial problem. </span></blockquote></div>","specialLinks":[]},{"userId":146052230,"authorName":"Sacha Davis","from":"&quot;Sacha Davis&quot; &lt;sacha@...&gt;","profile":"sacha_pie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [unschoolingbasics] Addiction, was Re: internet","postDate":"1316731230","msgId":47340,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTMuMTI4Ljk1LjE0Ny4xNjIuMTMxNjczMTIzMC5zcXVpcnJlbEB3ZWJtYWlsLmRyaXp6bGUuY29tPg==","inReplyToHeader":"PDEzMTY3MjcyODkuNjY3MDcuWWFob29NYWlsUkNAd2ViODczMDgubWFpbC5pcmQueWFob28uY29tPg==","referencesHeader":"PDEzMTY3MjI5MDEuNzMyNi5ZYWhvb01haWxOZW9Ad2ViMTYxNTE4Lm1haWwuYmYxLnlhaG9vLmNvbT4gICAgPDEzMTY3MjcyODkuNjY3MDcuWWFob29NYWlsUkNAd2ViODczMDgubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":47339,"nextInTopic":47357,"prevInTime":47339,"nextInTime":47341,"topicId":47337,"numMessagesInTopic":0,"msgSnippet":"As an RN I work with the addicted population so this subject is very near and dear to my heart.  I do sincerly mean dear because despite the challenges, I","messageBody":"<div id=\"ygrps-yiv-1302433345\">As an RN I work with the addicted population so this subject is very near<br/>\nand dear to my heart.  I do sincerly mean &#39;dear&#39; because despite the<br/>\nchallenges, I have a passion for serving this population.  When I work<br/>\nwith them I cannot wonder what has happened to them that has caused them<br/>\nto seek out the ultimate in numbing and disassociative experiences over<br/>\nand over and over again, at the expense of their health, of their sanity. <br/>\nI think this is what people think of when they speak of addiction.  Not<br/>\nthe physical addiction but the behaviors that emerge around addiction.<br/>\n<br/>\nI think in any discussion around addiction it&#39;s important to flesh out<br/>\nthat addiction is different than dependency.  Yes, not every person who<br/>\nuses drugs becomes an addict and there is no guarantee of addiction, but<br/>\ndependency on medications is a very real thing. I personally am dependent<br/>\non Zoloft, if I don&#39;t dose for a couple days my anxiety goes sky-high,<br/>\nthen I have to dose it again.  IN order to get off the drug I will have to<br/>\ntaper - it&#39;s not safe for me to stop using it altogether.  But my behavior<br/>\naround using Zoloft is not addictive.  I have a prescription, I get it<br/>\nlegally, but I am still dependent on it.<br/>\n<br/>\nAddiction is a very complex physiological and psychosocial problem.  In<br/>\nsix years of caring for the IVDU population, I cannot think of a single<br/>\nperson who comes from an intact, attached, loving and stable family.  I<br/>\nhave had one person who came off herion without using methadone and it was<br/>\na feat of will and strength.  People who use, the long-term addicted, are<br/>\nwounded, walking around like raw nerves in our society.  They come from<br/>\nchaos, are not attached, have been hurt and abused.  They cannot cope,<br/>\nsuffer from mental illness, don&#39;t know how to function without the quick<br/>\nfix of illegal drugs.  It&#39;s not many of us don&#39;t do this same thing<br/>\nlegally - alcohol, porn, music, whatever your addiction of choice that<br/>\nfills those voids and reduces the pain.<br/>\n<br/>\nThe behavior around addiction does not stem from being dependent on a<br/>\ndrug, but not having access to a drug, needing money to get drugs, not<br/>\nhaving a safe way to use drugs, and the general moralistic attitude toward<br/>\ndrug use in this country (USA).  This leads to violence, prostitution,<br/>\ndestructive behavior.  If we practiced more harm reduction there would be<br/>\nless stigma around people who use, less violence, and more space for<br/>\npeople to find a way to get the support they need to stop using.<br/>\n<br/>\nI think Drugs are Evil isn&#39;t the right approach, I think Drugs Aren&#39;t<br/>\nAddictive is simplistic.  I think you can do studies and research, but<br/>\nthere are real people living as addicts and they can tell you why the<br/>\ncannot stop, or will not stop.  Having children have resulted in me seeing<br/>\nthe people I care for as children.  I now know at a cellular level that<br/>\nchildren are not born bad, they are innocent loving creatures who end up<br/>\nin terrible situations that ultimately destroy them.  THIS is the<br/>\nenvironment.  This is why parenting in a kind thoughtful way is so deeply<br/>\nimportant, and this is why I am so drawn to (radical) unschooling.  It is<br/>\nso full of love and joy.  It is the ultimate extension of attachment,<br/>\nputting the parent/child relationship above all other things.  Will this<br/>\nprevent drug use - most likely but there is no guarantee of anything in<br/>\nlife.<br/>\n<br/>\nIf anyone is interested in reading a good book about addiction, Gabor<br/>\nMate&#39;s In the Realm of Hungry Ghosts is amazing.  It changed me as a<br/>\nperson and helped me understand a very challenging population.  It makes a<br/>\ngood physiological case for addiction, but regardless, it also brings a<br/>\nstrong tone of compassion for people caught in the cycle of drug use.<br/>\n<br/>\nI write from my heart because this is a subject that I care deeply about. <br/>\nI can only relay my experience, and that can be summarized by saying this<br/>\nis no black and white subject.  It&#39;s complex, full of humanity and<br/>\ntragedy, terrifying, and humbling all in one.<br/>\n<br/>\nS.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; No drug has been demonstrated to be perfectly addictive. At least none<br/>\n&gt; that I&#39;ve<br/>\n&gt; ever read or heard about and I&#39;ve read a fair bit about drugs and<br/>\n&gt; addiction.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Rat Park triggered off a lot of further study for Bruce Alexander. The<br/>\n&gt; funding<br/>\n&gt; that he had gotten to do the rat park study dried up so he went and<br/>\n&gt; explored the<br/>\n&gt; already existing literature around addiction and he found lots of studies<br/>\n&gt; demonstrating that people went off drugs as soon as their environment<br/>\n&gt; changed.<br/>\n&gt; Soldiers who had become addicted to heroin in Vietnam came home and went<br/>\n&gt; cold<br/>\n&gt; turkey at some overwhelming amount statistically. In the UK morphine is a<br/>\n&gt; drug<br/>\n&gt; that has been used as a pain killer with a very low rate of people staying<br/>\n&gt; on<br/>\n&gt; the drug as soon as they can come off of it. You can read more of what<br/>\n&gt; he&#39;s<br/>\n&gt; written here:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.parl.gc.ca/Content/SEN/Committee/371/ille/presentation/alexender-e.htm.\">http://www.parl.gc.ca/Content/SEN/Committee/371/ille/presentation/alexender-e.htm.</a><br/>\n&gt;  He talks about cocaine as well as heroin.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;It has been thoroughly proven in scientific studies that neuron shape,<br/>\n&gt; size,<br/>\n&gt; structure and function are permanently altered by drug use.&quot;<br/>\n&gt;<br/>\n&gt; I change my neuron shape, size, structure and function pretty regularly, I<br/>\n&gt; imagine. Living changes it. I can remember sitting in a biology<br/>\n&gt; professor&#39;s<br/>\n&gt; office one day when a study on the brain difference between gay men and<br/>\n&gt; straight<br/>\n&gt; men had been published and having him rant for a bit about how of course<br/>\n&gt; there<br/>\n&gt; was a difference in brains, everything changes brains. Brains are<br/>\n&gt; adaptable<br/>\n&gt; organs. They have plasticity. <a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Neuroplasticity\">http://en.wikipedia.org/wiki/Neuroplasticity</a><br/>\n&gt; can<br/>\n&gt; go into it in greater depth if you are interested.<br/>\n&gt;<br/>\n&gt; Tonight I went to dance rehearsal and worked on a couple of dances I know<br/>\n&gt; not<br/>\n&gt; terribly well and learned a new one, as well as being shown how to<br/>\n&gt; pirouette. I<br/>\n&gt; will have created new neural pathways and made other ones a bit more firm<br/>\n&gt; in the<br/>\n&gt; process. I will have changed the shape, size, structure and function of<br/>\n&gt; certain<br/>\n&gt; neurons. I don&#39;t think that&#39;s necessarily a bad thing. Nor do I think that<br/>\n&gt; it<br/>\n&gt; demonstrates that I&#39;m addicted to Morris dancing.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;Environment does not cause addiction and drugs absolutely are<br/>\n&gt; addictive.&quot;<br/>\n&gt;<br/>\n&gt; Drugs are not absolutely addictive. Lots of people quit drugs pretty<br/>\n&gt; frequently.<br/>\n&gt; Lots of people try a drug and never do it again. I have coffee most<br/>\n&gt; mornings and<br/>\n&gt; wine most evenings. If my sources for both went away, or if I found that<br/>\n&gt; either<br/>\n&gt; thing was something I no longer wanted to do, I&#39;d suffer a bit of<br/>\n&gt; withdrawal and<br/>\n&gt; move on.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;Environment does not cause addiction and drugs absolutely are  addictive.<br/>\n&gt; What<br/>\n&gt; causes someone to initially turn to drugs may be  environment, which is<br/>\n&gt; what the<br/>\n&gt; Rat Park studies are concluding.&quot;<br/>\n&gt;<br/>\n&gt; Part of what the Rat Park studies demonstrated was that rats would quit<br/>\n&gt; doing<br/>\n&gt; drugs when they were in a good environment. They would go cold turkey and<br/>\n&gt; suffer<br/>\n&gt; the withdrawal when given a pleasant life and a choice between water and<br/>\n&gt; laced<br/>\n&gt; water. For whatever reason, in a good environment, rats would choose to<br/>\n&gt; live a<br/>\n&gt; life without opiates.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I can tell you that I was a smoker for 12 years and I quit one day 15<br/>\n&gt; years ago<br/>\n&gt; without ever returning. Well, that isn&#39;t true, I smoked a cigarette at a<br/>\n&gt; party<br/>\n&gt; once about 2 years after I quit. And I was worried that the one cigarette<br/>\n&gt; would<br/>\n&gt; take me quickly back down to my pack a day habit. But it didn&#39;t. My<br/>\n&gt; environment<br/>\n&gt; was too different, my desire was gone. The nicotine was out of my system.<br/>\n&gt; One<br/>\n&gt; cigarette wasn&#39;t enough, I needed to change the structure of my life to<br/>\n&gt; start<br/>\n&gt; smoking again. I still would. Even though the nicotine is just as<br/>\n&gt; addictive as<br/>\n&gt; it once was, my life is such that it doesn&#39;t support that addiction any<br/>\n&gt; more.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sciencedirect.com/science/article/pii/S0014488607000052\">http://www.sciencedirect.com/science/article/pii/S0014488607000052</a> is an<br/>\n&gt; interesting abstract about how an enriched environment changes the way the<br/>\n&gt; brain<br/>\n&gt; responds to morphine in mice. There are more studies than that one that<br/>\n&gt; support<br/>\n&gt; Dr. Alexander&#39;s findings. Here&#39;s another take:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sciencedirect.com/science/article/pii/S1740675709000243.\">http://www.sciencedirect.com/science/article/pii/S1740675709000243.</a> This<br/>\n&gt; one is<br/>\n&gt; pretty cool:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sciencedirect.com/science/article/pii/S0301008210001450.\">http://www.sciencedirect.com/science/article/pii/S0301008210001450.</a><br/>\n&gt; What may have been the truth of the drug-induced addiction model seems to<br/>\n&gt; be<br/>\n&gt; changing. At least in some circles.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I&#39;m not afraid that drugs will take Simon or Linnaea away from me. Not<br/>\n&gt; because I<br/>\n&gt; don&#39;t think that they will someday try them. I don&#39;t know. But because I<br/>\n&gt; think<br/>\n&gt; that they won&#39;t be better entertainment, engagement, more interesting<br/>\n&gt; thing to<br/>\n&gt; do than what they are already doing. I don&#39;t think they will add anything,<br/>\n&gt; or<br/>\n&gt; that they have anything so painful to take away.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Schuyler<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ________________________________<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":178804705,"authorName":"Daria S","from":"&quot;Daria S&quot; &lt;daria_simionescu@...&gt;","profile":"lilreddgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Addiction, was Re: internet","postDate":"1316728351","msgId":47339,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1Z2Ftdis0czZhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMTY3MjI5MDEuNzMyNi5ZYWhvb01haWxOZW9Ad2ViMTYxNTE4Lm1haWwuYmYxLnlhaG9vLmNvbT4="},"prevInTopic":47338,"nextInTopic":47340,"prevInTime":47338,"nextInTime":47340,"topicId":47337,"numMessagesInTopic":0,"msgSnippet":"I feel uncomfortable to post this way and yet I want to address this... Environment does not cause addiction and drugs absolutely are addictive.  - this is a","messageBody":"<div id=\"ygrps-yiv-1179957055\">I feel uncomfortable to post this way and yet I want to address this...<br/>\n<br/>\n&quot;Environment does not cause addiction and drugs absolutely are addictive.&quot;  - this is a belief, not necessarily a fact - this belief is repeated in different versions throughout the post, but remains nonetheless a belief (like the belief it is stated in opposition to)<br/>\n<br/>\n&quot;What causes someone to initially turn to drugs may be environment, which is what the Rat Park studies are concluding.&quot; - that was not the conclusion I saw in the linked article or that I drew from the description of the study.  It seemed that even rats who had been given the drug repeatedly were more likely to voluntarily wean themselves off of the drug when the environment was pleasant (however the study does not say what percentage of rats in either group did continue to use the drug, so a conclusion either way is unclear).<br/>\n<br/>\n&quot;It has been thoroughly proven in scientific studies that neuron shape, size, structure and function are permanently altered by drug use.&quot; - this does not translate into addiction.  Neurons are often altered for many reasons during an organism&#39;s lifetime, not only by repeated chemical exposure.  They are altered by thoughts, experiences, and pretty much life itself... <br/>\n<br/>\nin addition: &#39;permanently&#39; - debatable, some believe cells are renewed/replaced after a certain period of time - in that model to be altered permanently does not make sense<br/>\n<br/>\n&quot;please be careful...with inferences... to jump to such a conclusion&quot; - this leads me to think the post was made from a fear-based mindset rather than open mindedness <br/>\n<br/>\nI apologize for the debating nature of my post.  I don&#39;t want to alienate anyone, and I feel afraid I have anyway.  Just looking to inspire with new thoughts. <br/>\n<br/>\nPersonally I rejoice in the idea that addiction is not conditional on a substance... and it makes sense seeing how variably addiction manifests itself.<br/>\n<br/>\nVery interesting.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Valerie Thorp &lt;valeriethorp@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; &quot;... none of these things is addictive. Not even drugs. What causes <br/>\n&gt; addiction is the need to escape an environment that&#39;s painful in some <br/>\n&gt; way that they have no control over.<br/>\n&gt; <br/>\n&gt; Schuyler has posted the Rat Park studies that show that drugs aren&#39;t <br/>\n&gt; addictive. (The study is worth reading no matter what you fear is <br/>\n&gt; addictive.) The need for drugs is caused by stressful environments, <br/>\n&gt; not the drugs themselves.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.walrusma\">http://www.walrusma</a> gazine.com/ articles/ 2007.12-health- rat-trap/&quot;<br/>\n&gt; <br/>\n&gt; Environment does not cause addiction and drugs absolutely are addictive.  What causes someone to initially turn to drugs may be environment, which is what the Rat Park studies are concluding.  However, once using drugs, the drugs themselves cause addiction (morphine, an opiate, is the only drug Alexander, the Rat Park researcher, studied).  It has been thoroughly proven in scientific studies that neuron shape, size, structure and function are permanently altered by drug use.  I won&#39;t cite studies here because they are very easy to find with little research and they are abundant.  Environment certainly seems to play a role, however it does not &quot;cause&quot; addiction.  I appreciate and agree with your point about environment causing people to turn to addictive behaviors, but please be careful and specific with inferences from two small research projects conducted using only one drug to jump to such a conclusion as &quot;drugs aren&#39;t addictive&quot;.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"1"},"subject":"Re: [unschoolingbasics] Addiction, was Re: internet","postDate":"1316727289","msgId":47338,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTY3MjcyODkuNjY3MDcuWWFob29NYWlsUkNAd2ViODczMDgubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PDEzMTY3MjI5MDEuNzMyNi5ZYWhvb01haWxOZW9Ad2ViMTYxNTE4Lm1haWwuYmYxLnlhaG9vLmNvbT4=","referencesHeader":"PDEzMTY3MjI5MDEuNzMyNi5ZYWhvb01haWxOZW9Ad2ViMTYxNTE4Lm1haWwuYmYxLnlhaG9vLmNvbT4="},"prevInTopic":47337,"nextInTopic":47339,"prevInTime":47337,"nextInTime":47339,"topicId":47337,"numMessagesInTopic":0,"msgSnippet":"No drug has been demonstrated to be perfectly addictive. At least none that I ve ever read or heard about and I ve read a fair bit about drugs and addiction. ","messageBody":"<div id=\"ygrps-yiv-532991665\">No drug has been demonstrated to be perfectly addictive. At least none that I&#39;ve <br/>\never read or heard about and I&#39;ve read a fair bit about drugs and addiction. <br/>\n<br/>\n<br/>\nRat Park triggered off a lot of further study for Bruce Alexander. The funding <br/>\nthat he had gotten to do the rat park study dried up so he went and explored the <br/>\nalready existing literature around addiction and he found lots of studies <br/>\ndemonstrating that people went off drugs as soon as their environment changed. <br/>\nSoldiers who had become addicted to heroin in Vietnam came home and went cold <br/>\nturkey at some overwhelming amount statistically. In the UK morphine is a drug <br/>\nthat has been used as a pain killer with a very low rate of people staying on <br/>\nthe drug as soon as they can come off of it. You can read more of what he&#39;s <br/>\nwritten here: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.parl.gc.ca/Content/SEN/Committee/371/ille/presentation/alexender-e.htm.\">http://www.parl.gc.ca/Content/SEN/Committee/371/ille/presentation/alexender-e.htm.</a><br/>\n He talks about cocaine as well as heroin. <br/>\n<br/>\n<br/>\n&quot;It has been thoroughly proven in scientific studies that neuron shape,  size, <br/>\nstructure and function are permanently altered by drug use.&quot;<br/>\n<br/>\nI change my neuron shape, size, structure and function pretty regularly, I <br/>\nimagine. Living changes it. I can remember sitting in a biology professor&#39;s <br/>\noffice one day when a study on the brain difference between gay men and straight <br/>\nmen had been published and having him rant for a bit about how of course there <br/>\nwas a difference in brains, everything changes brains. Brains are adaptable <br/>\norgans. They have plasticity. <a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Neuroplasticity\">http://en.wikipedia.org/wiki/Neuroplasticity</a> can <br/>\ngo into it in greater depth if you are interested.<br/>\n<br/>\nTonight I went to dance rehearsal and worked on a couple of dances I know not <br/>\nterribly well and learned a new one, as well as being shown how to pirouette. I <br/>\nwill have created new neural pathways and made other ones a bit more firm in the <br/>\nprocess. I will have changed the shape, size, structure and function of certain <br/>\nneurons. I don&#39;t think that&#39;s necessarily a bad thing. Nor do I think that it <br/>\ndemonstrates that I&#39;m addicted to Morris dancing. <br/>\n<br/>\n<br/>\n&quot;Environment does not cause addiction and drugs absolutely are  addictive.&quot;  <br/>\n<br/>\nDrugs are not absolutely addictive. Lots of people quit drugs pretty frequently. <br/>\nLots of people try a drug and never do it again. I have coffee most mornings and <br/>\nwine most evenings. If my sources for both went away, or if I found that either <br/>\nthing was something I no longer wanted to do, I&#39;d suffer a bit of withdrawal and <br/>\nmove on. <br/>\n<br/>\n<br/>\n&quot;Environment does not cause addiction and drugs absolutely are  addictive. What <br/>\ncauses someone to initially turn to drugs may be  environment, which is what the <br/>\nRat Park studies are concluding.&quot;<br/>\n<br/>\nPart of what the Rat Park studies demonstrated was that rats would quit doing <br/>\ndrugs when they were in a good environment. They would go cold turkey and suffer <br/>\nthe withdrawal when given a pleasant life and a choice between water and laced <br/>\nwater. For whatever reason, in a good environment, rats would choose to live a <br/>\nlife without opiates. <br/>\n<br/>\n<br/>\nI can tell you that I was a smoker for 12 years and I quit one day 15 years ago <br/>\nwithout ever returning. Well, that isn&#39;t true, I smoked a cigarette at a party <br/>\nonce about 2 years after I quit. And I was worried that the one cigarette would <br/>\ntake me quickly back down to my pack a day habit. But it didn&#39;t. My environment <br/>\nwas too different, my desire was gone. The nicotine was out of my system. One <br/>\ncigarette wasn&#39;t enough, I needed to change the structure of my life to start <br/>\nsmoking again. I still would. Even though the nicotine is just as addictive as <br/>\nit once was, my life is such that it doesn&#39;t support that addiction any more. <br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sciencedirect.com/science/article/pii/S0014488607000052\">http://www.sciencedirect.com/science/article/pii/S0014488607000052</a> is an <br/>\ninteresting abstract about how an enriched environment changes the way the brain <br/>\nresponds to morphine in mice. There are more studies than that one that support <br/>\nDr. Alexander&#39;s findings. Here&#39;s another take: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sciencedirect.com/science/article/pii/S1740675709000243.\">http://www.sciencedirect.com/science/article/pii/S1740675709000243.</a> This one is <br/>\npretty cool: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sciencedirect.com/science/article/pii/S0301008210001450.\">http://www.sciencedirect.com/science/article/pii/S0301008210001450.</a> <br/>\nWhat may have been the truth of the drug-induced addiction model seems to be <br/>\nchanging. At least in some circles. <br/>\n<br/>\n<br/>\nI&#39;m not afraid that drugs will take Simon or Linnaea away from me. Not because I <br/>\ndon&#39;t think that they will someday try them. I don&#39;t know. But because I think <br/>\nthat they won&#39;t be better entertainment, engagement, more interesting thing to <br/>\ndo than what they are already doing. I don&#39;t think they will add anything, or <br/>\nthat they have anything so painful to take away. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":367863967,"authorName":"Valerie Thorp","from":"Valerie Thorp &lt;valeriethorp@...&gt;","profile":"valeriethorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Addiction, was Re: internet","postDate":"1316722901","msgId":47337,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTY3MjI5MDEuNzMyNi5ZYWhvb01haWxOZW9Ad2ViMTYxNTE4Lm1haWwuYmYxLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":47338,"prevInTime":47336,"nextInTime":47338,"topicId":47337,"numMessagesInTopic":0,"msgSnippet":"... none of these things is addictive. Not even drugs. What causes addiction is the need to escape an environment that s painful in some way that they have no","messageBody":"<div id=\"ygrps-yiv-1146150550\">&quot;... none of these things is addictive. Not even drugs. What causes <br/>\naddiction is the need to escape an environment that&#39;s painful in some <br/>\nway that they have no control over.<br/>\n<br/>\nSchuyler has posted the Rat Park studies that show that drugs aren&#39;t <br/>\naddictive. (The study is worth reading no matter what you fear is <br/>\naddictive.) The need for drugs is caused by stressful environments, <br/>\nnot the drugs themselves.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.walrusma\">http://www.walrusma</a> gazine.com/ articles/ 2007.12-health- rat-trap/&quot;<br/>\n<br/>\nEnvironment does not cause addiction and drugs absolutely are addictive.  What causes someone to initially turn to drugs may be environment, which is what the Rat Park studies are concluding.  However, once using drugs, the drugs themselves cause addiction (morphine, an opiate, is the only drug Alexander, the Rat Park researcher, studied).  It has been thoroughly proven in scientific studies that neuron shape, size, structure and function are permanently altered by drug use.  I won&#39;t cite studies here because they are very easy to find with little research and they are abundant.  Environment certainly seems to play a role, however it does not &quot;cause&quot; addiction.  I appreciate and agree with your point about environment causing people to turn to addictive behaviors, but please be careful and specific with inferences from two small research projects conducted using only one drug to jump to such a conclusion as &quot;drugs aren&#39;t addictive&quot;.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":47342,"nextTopicId":47310}}