{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":237471585,"authorName":"Elli","from":"&quot;Elli&quot; &lt;elinorsparks@...&gt;","profile":"sistergoddesselli","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New - Unschool, Eclectic, Traditional, ???","postDate":"1260050174","msgId":42350,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmZWt0dSs0YjQxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhmNHE3YitkYWMxQGVHcm91cHMuY29tPg=="},"prevInTopic":42323,"nextInTopic":0,"prevInTime":42349,"nextInTime":42351,"topicId":42300,"numMessagesInTopic":0,"msgSnippet":"Gayle - Welcome to the boards.  You are at the right place.  I usually find, as you may have, that simply writing my post/question helps me to discover my own","messageBody":"<div id=\"ygrps-yiv-246939554\">Gayle - <br/>\n<br/>\nWelcome to the boards.  You are at the right place.  I usually find, as you may have, that simply writing my post/question helps me to discover my own answer.  I think you figured it out in the first part of your post...<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I sat in today on my nephew&#39;s 1st grade class, and comparatively she is at a much higher grade level in math, science, history, and social studies, and about a bit low in grade level for reading.&lt;<br/>\n<br/>\n </span></blockquote>Your daughter is right on target, with learning, if target were such a thing.  She is above in some ways and below in others, just like any other kid.  The freedom you are giving her to find her own way is priceless.  I recommend staying that path and leaving the nagging thoughts about school on the side of the road!!<br/>\n<br/>\nGood luck.<br/>\n<br/>\nElli</div>","specialLinks":[]},{"userId":151505017,"authorName":"carenkh","from":"&quot;carenkh&quot; &lt;carenkh@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New - Unschool, Eclectic, Traditional, ???","postDate":"1259857828","msgId":42323,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmOHAzNCttc3B1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhmNnVtcitzdmJ0QGVHcm91cHMuY29tPg=="},"prevInTopic":42314,"nextInTopic":42350,"prevInTime":42322,"nextInTime":42324,"topicId":42300,"numMessagesInTopic":0,"msgSnippet":"Seth (almost 11) has been working on comic books of one kind or another for years. They started with all pictures, then he wanted the occasional word written","messageBody":"<div id=\"ygrps-yiv-563130616\">Seth (almost 11) has been working on comic books of one kind or another for years. They started with all pictures, then he wanted the occasional word written by me (or other people who write), then longer phrases written by me, then short exclamations and phrases written by him with the longer phrases still written by me, to now, everything written by him. At first, he was asking to spell almost every word, now it&#39;s just words he hasn&#39;t written before.<br/>\n<br/>\nIt&#39;s been fluid and unstressful. He learned because he was living it.<br/>\n<br/>\nIn the spelling, he&#39;s learning the &quot;rules&quot; of spelling without me pointing them out. He asked how to spell matter the other day, and I told him, and he said, &quot;I knew I didn&#39;t have it right! I put m-a-t-e-r.&quot; I told him that would be pronounced mater, and we both laughed. I didn&#39;t have to explain that double letters make the preceding vowel short - he gets it. He&#39;s living it. Another word he asked: meanwhile. He had written it without the ending &quot;e&quot;, and I pronounced it without the e - meanwhil. Again, he laughed. On a later day, he asked how to spell chocolate. When I told him, he said, &quot;Then wouldn&#39;t we say it choco-LATE?&quot; (with the long &quot;a&quot;) I doubt he knows the terms short and long vowel sounds, but if he comes across those terms, he&#39;ll know what they mean. He doesn&#39;t have to memorize grammar and spelling; he&#39;s living it.<br/>\n<br/>\nSome kids don&#39;t ask how to spell - they write using made-up spelling, and that works for them and how they learn, and they&#39;ll learn what they need that way.<br/>\n<br/>\nIf Seth asked me now to go back to writing for him, I would, without hesitation. I wouldn&#39;t say, &quot;Now, you know how to write...&quot; I&#39;d figure he had something more important to do with his focus at that moment, and writing was taking away from whatever that was. I am trusting all the time that they&#39;re learning what they need.<br/>\n<br/>\nIf it&#39;s truly &quot;basic&quot; and important to know to live in our world, they&#39;ll learn it by living in our world.<br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":187841659,"authorName":"Janet Gerla","from":"Janet Gerla &lt;janeteg@...&gt;","profile":"janeteg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] New - Unschool, Eclectic, Traditional,  ???","postDate":"1259812938","msgId":42312,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIwMzEwNjY5NTU1QHJydi5uZXQ+","inReplyToHeader":"PGNjNjEyMGExMDkxMjAyMTkyN3IxZDY1MTg3N3M0MGE5OWEzMmJhMGFlNjUxQG1haWwuZ21haWwuY28gbT4=","referencesHeader":"PGhmNHE3YitkYWMxQGVHcm91cHMuY29tPiA8Y2M2MTIwYTEwOTEyMDIxOTI3cjFkNjUxODc3czQwYTk5YTMyYmEwYWU2NTFAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":42311,"nextInTopic":42314,"prevInTime":42311,"nextInTime":42313,"topicId":42300,"numMessagesInTopic":0,"msgSnippet":"... We have 6 kids ages 28, 25, 22, 19, 16 and 12 and have always unschooled. Five have chosen to go on to college (we get free classes from age 16 - 18) and","messageBody":"<div id=\"ygrps-yiv-276378689\"><blockquote><span title=\"ireply\">&gt;On Tue, Dec 1, 2009 at 11:25 PM, harmonyglb <br/>\n&gt;&lt;&lt;mailto:harmonyglb%40yahoo.com&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:harmonyglb@...\">harmonyglb@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt; &gt; Did any of you start off as unschoolers and switch to a traditional<br/>\n&gt; &gt; approach, and if so, has it been successful in teaching your children what<br/>\n&gt; &gt; they need to know?<br/>\n<br/>\n </span></blockquote>We have 6 kids ages 28, 25, 22, 19, 16 and 12 and have always <br/>\nunschooled. Five have chosen to go on to college (we get free classes <br/>\nfrom age 16 - 18) and they have all adjusted just fine. I always <br/>\nstarted worrying when they signed up for English Comp, but they all <br/>\nsaid &quot;Oh, no one else knew any of that preliminary stuff so we went <br/>\nover that and it&#39;s easy.&quot; They have taken physics, algebra, calculus, <br/>\nbiology and many other strenuous courses. They have all done fine <br/>\neven with no &quot;homeschool math&quot; or anything &quot;preparatory&quot; for college. <br/>\nTHey learn what they need when they need it!<br/>\n<br/>\nJanet in MN</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] New - Unschool, Eclectic, Traditional, ???","postDate":"1259810853","msgId":42311,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkxMjAyMTkyN3IxZDY1MTg3N3M0MGE5OWEzMmJhMGFlNjUxQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhmNHE3YitkYWMxQGVHcm91cHMuY29tPg==","referencesHeader":"PGhmNHE3YitkYWMxQGVHcm91cHMuY29tPg=="},"prevInTopic":42310,"nextInTopic":42312,"prevInTime":42310,"nextInTime":42312,"topicId":42300,"numMessagesInTopic":0,"msgSnippet":"... ***As Meredith has stated, I have one child in school. We have always unschooled. Her school experience is nothing like a typical kids experience. She is","messageBody":"<div id=\"ygrps-yiv-1565097558\">On Tue, Dec 1, 2009 at 11:25 PM, harmonyglb &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:harmonyglb@...\">harmonyglb@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Did any of you start off as unschoolers and switch to a traditional<br/>\n&gt; approach, and if so, has it been successful in teaching your children what<br/>\n&gt; they need to know?<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>***As Meredith has stated, I have one child in school. We have always<br/>\nunschooled. Her school experience is nothing like a typical kids experience.<br/>\nShe is there because she wants to be. She wants the experience of school.<br/>\nShe knows that academics are just a construct created by that system in<br/>\norder to produce humans who have roughly the same skill set. So although it<br/>\nmay seem traditional that I have a child in school, it looks nothing like a<br/>\ntraditional school experience. I don&#39;t need for her to get good grades or to<br/>\nlearn anything in particular. I am happy to allow the situation to flow<br/>\norganically.<br/>\n<br/>\nI fully trust all my children to learn what they need to know. And what each<br/>\nhuman needs for a life that feels successful to them is different. My<br/>\ndaughter loves to write. She is a natural born story teller and really has a<br/>\nway with words. She gravitates towards those types of things. My son loves<br/>\npuzzles and problem solving and patterns and gravitates towards those<br/>\nthings. They have both picked up everything they need to know thus far in<br/>\ntheir lives. And I trust that they will continue to pick things up because<br/>\nits fun and helpful to learn new things. (The baby is learning too but I<br/>\nknow that most people don&#39;t feel like 2 years olds need a curriculum)<br/>\n<br/>\nI can&#39;t imagine switching to a more traditional approach. What would that<br/>\nmean? I treat my children with respect to who they are and what their<br/>\nindividual needs are. I talk to them and find solutions. I watch them grow<br/>\nand learn and light up the world. I don&#39;t see who sitting them down and<br/>\n&quot;doing school&quot; would benefit any of them. I specifically see it NOT working<br/>\nin the school setting. My daughter has noticed that LITTLE TO NO learning<br/>\nhappens in school. The teacher give them a packet of work and instructions.<br/>\nThey will sometimes lecture on things. She may or may not pick it up. She<br/>\nfeels like anything she learns she OWNS. No one taught her she learned it.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Or vice versa, has anyone here gone from traditional school to unschooling<br/>\n&gt; and found that to be more beneficial. How can I teach her to read and about<br/>\n&gt; phonics without some type of instruction?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>***How can she not learn to read? What could possibly stop her from desiring<br/>\nto understand the printed word that surrounds us? How can you teach her<br/>\nanything, she is the one that will learn when she is ready. Children are not<br/>\nempty pitchers. True they have less life experience but that doesn&#39;t mean<br/>\nthat we know what is best for them. They are the experts of themselves, we<br/>\ncan pay close attention and be really great at knowing them too. But we will<br/>\nnever feel their feelings or see the world through their eyes, etc. We will<br/>\nnever know the process of the world through her mind.<br/>\n<br/>\nWhy is it important that she know how to read right now? IS it important to<br/>\nher?<br/>\n<br/>\nMy son just turned 7 and is not reading more than a few things that serve<br/>\nhis life (play, stop, rewind, etc). He desires to read and will occasionally<br/>\nask me for help. I am there answering each question, big or small. I read<br/>\nhim everything he wants me too. I can see the little steps (not all but<br/>\nsome) that he is going through to build up to fluent reading. I know that he<br/>\nwill read when he is ready, when it makes sense to him. I trust the process<br/>\nthat is personal to him. He feels no shame in not reading. Because their is<br/>\nno shame in it. He still lives a full and active and interesting life<br/>\nwithout understand much printed words.<br/>\n -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nI can&#39;t see how she will figure out what a verb or a compound word is if I<br/>\n<blockquote><span title=\"ireply\"> &gt; don&#39;t teach it... there just doesn&#39;t seem to be that much opportunity in<br/>\n&gt; real life to teach some of these things.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>***There is a million opportunities if/when she is interested. Let it happen<br/>\non her time table. We discuss all matter of speech, language, grammar,<br/>\nlexology in our house. We PLAY with words, letters, sounds, etc. Its fun to<br/>\nus. We do it because it is fun not because I want my kids to learn a<br/>\nspecific skill set. Its great that they do, they love it. In the course of a<br/>\nnormal life we have touched on many levels of grammar and spelling and<br/>\n&quot;vocabulary&quot;. We have played with Latin, Greek and ancient English. We have<br/>\ndabbled in Celtic, Spanish, French, German, and Japanese. We have played<br/>\nwith various parts of speech and even diagrammed a sentence! These things<br/>\njust came up. They sparked someones interest and we just followed our bliss.<br/>\n<br/>\n<br/>\nAre you worried about the &quot;skill set&quot; or grammar or is your child interested<br/>\nin words and language? I have been meaning to write a nice blog about all<br/>\nthe lovely word games we play over here :-)<br/>\n<br/>\nAll these things are part of life, that&#39;s what makes them important.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nI found that keeping a blog (or any written record) or the cool things my<br/>\nkids do really helps me. It also helped my family see what my kids do and<br/>\nhow they are learning and growing and loving life.<br/>\n<br/>\nOne small example of learning from life: We watched the 13th Warrior. We<br/>\ndiscussed how the main character picked up a new language with no one even<br/>\nspeaking to him. We explored the original story of Beowulf in several forms,<br/>\nincluding the archaic English version. We listened to that online even<br/>\nthough we understood little. We looked up several actors and saw what other<br/>\nmovies they were in. We watched a few. We looked up some of the weaponry.<br/>\nWe wanted to know a bit more about the political climate of the time period,<br/>\nso we researched that. We compared the languages to modern languages. This<br/>\nhappened more than 3 years ago and my kids still reference things we learned<br/>\nthat day. Which is why i chose this example. This one movie has tied into so<br/>\nmany things that frequently come up in our life.<br/>\n<br/>\nEach thing that they pick up is a building block, we don&#39;t all need the same<br/>\nbuilding blocks. And we don&#39;t need them all at the same time as our age<br/>\npeers.<br/>\n<br/>\nFaith<br/>\n<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":84690835,"authorName":"harmonyglb","from":"&quot;harmonyglb&quot; &lt;harmonyglb@...&gt;","profile":"harmonyglb","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New - Unschool, Eclectic, Traditional, ???","postDate":"1259808295","msgId":42314,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmNzhuNytnaG1sQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhmNHE3YitkYWMxQGVHcm91cHMuY29tPg=="},"prevInTopic":42312,"nextInTopic":42323,"prevInTime":42313,"nextInTime":42315,"topicId":42300,"numMessagesInTopic":0,"msgSnippet":"Wow, these are all such great responses! Even though I felt like I was doing ok with Abby s schooling, that one visit to Logan s school left me with so many","messageBody":"<div id=\"ygrps-yiv-912086518\">Wow, these are all such great responses! Even though I felt like I was doing ok with Abby&#39;s schooling, that one visit to Logan&#39;s school left me with so many doubts. Thank you so much for helping me see that it is the fact that she is learning, not how many papers she is spitting back out, that is important (it was particularly interesting to hear from the former first grade teacher on the fact that worksheets really were something that the class was assigned so the teacher could actually teach a smaller group without distraction). I am feeling so much more confident after reading through all of the posts. <br/>\n<br/>\nThank you,<br/>\nGayle</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New - Unschool, Eclectic, Traditional, ???","postDate":"1259798438","msgId":42310,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmNnYzNityaDBvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhmNm50MSsydG8yQGVHcm91cHMuY29tPg=="},"prevInTopic":42309,"nextInTopic":42311,"prevInTime":42309,"nextInTime":42311,"topicId":42300,"numMessagesInTopic":0,"msgSnippet":"... *********************** Yeah, back when I was a kid it was called busy work ! That kind of work is probably the least part of learning, in any","messageBody":"<div id=\"ygrps-yiv-1456768426\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;missalexmissalex&quot; &lt;missalexmissalex@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Former 1st grade/elementary school teacher here. Written work/worksheets in classrooms are overwhelmingly for management purposes... Most importantly, it keeps kids busy while you help other kids/work with a small group/do assessments.<br/>\n </span></blockquote>***********************<br/>\n<br/>\nYeah, back when I was a kid it was called &quot;busy work&quot;! That kind of &quot;work&quot; is probably the least part of learning, in any environment. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New - Unschool, Eclectic, Traditional, ???","postDate":"1259798043","msgId":42309,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmNnVtcitzdmJ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhmNHE3YitkYWMxQGVHcm91cHMuY29tPg=="},"prevInTopic":42307,"nextInTopic":42310,"prevInTime":42308,"nextInTime":42310,"topicId":42300,"numMessagesInTopic":0,"msgSnippet":"... ***************** Faith has an unschooled dd who s attending school at her own request to study the culture there. She s 12 and enjoying it. It took a","messageBody":"<div id=\"ygrps-yiv-1974024261\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;harmonyglb&quot; &lt;harmonyglb@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Did any of you start off as unschoolers and switch to a traditional approach, and if so, has it been successful in teaching your children what they need to know?<br/>\n </span></blockquote>*****************<br/>\n<br/>\nFaith has an unschooled dd who&#39;s attending school at her own request to study the culture there. She&#39;s 12 and enjoying it. It took a couple weeks for her to catch up. Other kids have gone to high school and college - often need to take an extra class or two to catch up, but unlike kids who&#39;ve been through the system for years, there&#39;s no baggage attached to that. Taking a remedial class isn&#39;t a sign of failure, its an opportunity to kids who are confident in their ability to learn. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Or vice versa, has anyone here gone from traditional school to unschooling and found that to be more beneficial.<br/>\n </span></blockquote>**********************<br/>\n<br/>\nMy 16yo stepson has gone from homeschool to school to unschooling, and we&#39;ve found radical unschooling by far the most beneficial. He&#39;s much much happier, much less prone to self-disparaging ideas and self-distructive behavior. His self esteem was in tatters when we brought him home, and now he&#39;s a very confident young person.<br/>\n<br/>\nHe&#39;s also gone from the typical &quot;hating&quot; to learn to someone who sees learning as integral to everything he does. When he was in school, he scoffed at the idea of going to college - more school? Ugh. But now, its a possibility. Probably not when he&#39;s 18, but maybe later. Its on his radar now, whereas before it wasn&#39;t at all. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; How can I teach her to read and about phonics without some type of instruction?<br/>\n<br/>\n </span></blockquote>What&#39;s reading for? Think about that - really think about it. Why did human kind invent the written word? Those reasons are still good, still motivate human beings today. Your dd lives in a world where print is used for sooooo many things. She&#39;s motivated, but maybe not all the right parts of her brain are ready yet. Reading isn&#39;t just one skill, you see, but a bunch of skills used together - and different processing styles make use of different skill sets (some people are more visual and some more auditory, for instance). So depending on what skills are developing when, And what kind of processing works best for your dd, it may take her a bit longer to learn to read. <br/>\n<br/>\nHonestly, its easier to learn reading late than early! The only drawback to learning late may be emotional baggage, and that&#39;s something you can work on, by not giving your dd the idea that there&#39;s something &quot;wrong&quot; with her for not reading. She&#39;s just not ready. Lots of kids in school aren&#39;t ready, either, but in school that&#39;s called &quot;below grade level&quot; and &quot;struggles to read&quot; and &quot;reads with poor comprehension&quot;. Unschoolers generally see all of those as &quot;not ready to read independently&quot; and go on reading for their kids and providing other opportunities. Also, school generally doesn&#39;t require much in the way of real reading (certainly not at 6!). Instructions are given verbally as well as in print, or are so obvious they can be figured out in other ways. So its easy to see &quot;kids reading&quot; when they aren&#39;t. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I can&#39;t see how she will figure out what a verb or a compound word is if I don&#39;t teach it... there just doesn&#39;t seem to be that much opportunity in real life to teach some of these things. <br/>\n </span></blockquote>**********************<br/>\n<br/>\n&quot;Sidewalk&quot; is a compound word. Bet you&#39;ve used it. I&#39;m a full blown radical unschooler and I&#39;ve talked about compound words. I might have used that term, but I don&#39;t know. I know I&#39;ve said &quot;you&#39;re right, Morgan! sidewalk is made up of two words stuck together&quot;. Its a subject that comes up when she asks how to spell words, too, sometimes. How do you spell &quot;sometimes&quot; for instance?<br/>\n<br/>\nJoyce had great things to say in that post someone linked for you about parts of speech - well worth reading that. Mo&#39;s learned a lot about parts of speech by playing with words with her dad. He&#39;s a big punster and generally loves to goof around with words - good fun! There&#39;s a lot of learning in humor. To &quot;get&quot; a joke, you have to understand it to some extent. <br/>\n<br/>\nWhen you step away from lessons, its amazing how much learning really does go on in day to day life. Its not a stretch to get &quot;the basics&quot; because they really are all around us, basic information that kids Want to know. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":118247794,"authorName":"missalexmissalex","from":"&quot;missalexmissalex&quot; &lt;missalexmissalex@...&gt;","profile":"missalexmissalex","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New - Unschool, Eclectic, Traditional, ???","postDate":"1259791073","msgId":42307,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmNm50MSsydG8yQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhmNHE3YitkYWMxQGVHcm91cHMuY29tPg=="},"prevInTopic":42304,"nextInTopic":42309,"prevInTime":42306,"nextInTime":42308,"topicId":42300,"numMessagesInTopic":0,"msgSnippet":"... Former 1st grade/elementary school teacher here. Written work/worksheets in classrooms are overwhelmingly for management purposes. It gives you a pile of","messageBody":"<div id=\"ygrps-yiv-1338683813\"><blockquote><span title=\"ireply\">&gt; Although the material being learned in the classroom was similar to what we are working with and she has learned, here were 21 other little children who were certainly handing in and doing more work than she typically does. <br/>\n<br/>\n </span></blockquote>Former 1st grade/elementary school teacher here. Written work/worksheets in classrooms are overwhelmingly for management purposes. It gives you a pile of stuff to base grades on. You can go through a pile of worksheets later and make sure you didn&#39;t miss someone being totally not with the program. Most importantly, it keeps kids busy while you help other kids/work with a small group/do assessments. If you are with one kid, talking about stuff, not having someone breathing down your neck to prove you&#39;re pushing her along at the desired rate, you don&#39;t need that stuff. First grade is pretty much ALL stuff kids would pick up themselves at some point anyway. <br/>\n<br/>\nAlex<br/>\nKatya&#39;s mom</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] New - Unschool, Eclectic, Traditional, ???","postDate":"1259777447","msgId":42304,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2QTBBRkFFLTdDREUtNDJDMC1BOUM0LUI4OEQwNTg4MDZEOUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGhmNHE3YitkYWMxQGVHcm91cHMuY29tPg==","referencesHeader":"PGhmNHE3YitkYWMxQGVHcm91cHMuY29tPg=="},"prevInTopic":42303,"nextInTopic":42307,"prevInTime":42303,"nextInTime":42305,"topicId":42300,"numMessagesInTopic":0,"msgSnippet":"... I think the question you need to ask yourself is whether you want her to learn or whether you want her to perform so you can believe she s learning. Doing","messageBody":"<div id=\"ygrps-yiv-383350440\">On Dec 1, 2009, at 11:25 PM, harmonyglb wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; here were 21 other little children who were certainly handing in  <br/>\n&gt; and doing more work than she typically does<br/>\n<br/>\n </span></blockquote>I think the question you need to ask yourself is whether you want her  <br/>\nto learn or whether you want her to perform so you can believe she&#39;s  <br/>\nlearning.<br/>\n<br/>\nDoing worksheets only shows that kids have retained enough of a  <br/>\nprocess to spit it back onto a worksheet. It doesn&#39;t mean they  <br/>\nunderstand what they&#39;re doing. It doesn&#39;t mean they can use it out in  <br/>\nthe real world. It doesn&#39;t mean they&#39;ll even remember it next year.  <br/>\n(Some kids who can do worksheets *do* get the concepts, but the  <br/>\nworksheets did not give them the understanding and don&#39;t reveal what  <br/>\nwe think they reveal.)<br/>\n<br/>\nI got great grades in math throughout high school and college (where  <br/>\nI majored in electrical engineering). It wasn&#39;t until I had to apply  <br/>\nthe math to messy, real life problems (unlike the tidy textbook  <br/>\nproblems) that I realized I didn&#39;t conceptually understand what I was  <br/>\ndoing. (Fortunately by then I recognized I had a knack for  <br/>\nprogramming so all I had to do was get computers to crunch them ;-)<br/>\n<br/>\nGetting kids to recognize problems and apply a particular solution  <br/>\nand *hope* kids pick up a conceptual understanding by doing lots and  <br/>\nlots of problems is the best schools can do. It is *very* *very* hard  <br/>\nto pass on an understanding of concepts*. It&#39;s even harder to test to  <br/>\nsee if kids understand the concepts. And schools must teach in ways  <br/>\nthat can be tested because the administration, state and parents want  <br/>\nsome kind of proof that something&#39;s happening. So all schools can do  <br/>\nis get kids to memorize methods and spit them back on homework and  <br/>\ntests.<br/>\n<br/>\n(*We learn concepts not by memorizing someone else&#39;s understanding.  <br/>\nWe&#39;re naturally designed to draw a broad understanding from something  <br/>\nwe&#39;re working with. We&#39;re naturally designed to refine it and revamp  <br/>\nit from feedback we get from using our understanding. You didn&#39;t tell  <br/>\nyour daughter what a &quot;dog&quot; was once and that was it. She heard &quot;dog&quot;  <br/>\ndozens and dozens of times, may have mistaken a cat or a goat for a  <br/>\ndog as she was refining, but I bet her concept is flawless by this  <br/>\npoint. That&#39;s the exact same process she&#39;s used to refine her  <br/>\nunderstanding of language. It took her from pointing and crying to  <br/>\nbeing articulate within a few years. No one set a destination for  <br/>\nher. Though you may have explained a few things here and there, the  <br/>\nvast majority of what she knows she&#39;s pulled in, played around with  <br/>\nit, come up with theories of how it works, revised the theories until  <br/>\nshe&#39;s reached where she is today with language.)<br/>\n<br/>\nEclectic and school are similar. They both are channeling the child  <br/>\ntoward a particular destination, school more narrowly focused on  <br/>\ncollege, eclectic being a bit broader.<br/>\n<br/>\nUnschooling is completely different. There is no specific educational  <br/>\ngoal. The goal is to help the child grow and explore what interests  <br/>\nthem as we run interesting things through their lives and we *trust*  <br/>\nthat what they do is what they need for what they&#39;re doing. And what  <br/>\nthey&#39;re doing is also providing a foundation for what they will be  <br/>\ndoing.<br/>\n<br/>\nUnschooling isn&#39;t a good approach if someone is looking for academic  <br/>\n*results*. Unschooling gives little in the way of comforting  <br/>\nfeedback. The learning still happens! (Feedback isn&#39;t necessary for  <br/>\nlearning and often interferes.) In fact profound, real learning is  <br/>\nhappening. Unschooled kids aren&#39;t just memorizing things and  <br/>\nperforming for validation. Unschooled kids are truly learning because  <br/>\nlearning happens as a side effect of using. They can&#39;t fake an  <br/>\nunderstanding of percentage if they&#39;re using it to help them make  <br/>\ndecisions during a video game. They aren&#39;t dealing with answers that  <br/>\nwill get tossed in the trash whether they&#39;re right or wrong. It&#39;s  <br/>\nreal answers that will determine if they live or die or defeat the boss.<br/>\n<br/>\nOccasionally unschooled kids will give us unexpected feedback that  <br/>\nthey understand more than we realized, but if you&#39;re looking for  <br/>\nfeedback -- like worksheets and homework -- then it&#39;s not a good  <br/>\nchoice. While unschooling is a great way for kids to prepare  <br/>\nthemselves to do what they want to do, it&#39;s not a great way to  <br/>\nprepare them to stand before specific doorways their parents will  <br/>\nfeel comfortable with. While unschooling certainly doesn&#39;t stand in  <br/>\nthe way of college and any child who decides they want to go  <br/>\ncertainly can, it isn&#39;t a direct pathway that specifically prepares  <br/>\nthe child for college and that will bother some parents.<br/>\n<br/>\nMost people choose unschooling not for academic feedback. They choose  <br/>\nit because they want something else, something they come to see as  <br/>\nbetter: for instance, whole confident children who know they can do  <br/>\nwhatever they set about to do.<br/>\n<br/>\nThe archives here are good for stories of what unschoolers are  <br/>\nlooking for instead of academics. Sandra Dodd&#39;s website has a load of  <br/>\nstories too:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling\">http://sandradodd.com/unschooling</a><br/>\n<br/>\nHere are two pages that tackle the myth of schools being great places  <br/>\nto learn that might help you see it in a different way.<br/>\n<br/>\nProducts of Education<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/joyce/products\">http://sandradodd.com/joyce/products</a><br/>\n<br/>\nWhy You Can&#39;t Let Go<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/joyce/talk\">http://sandradodd.com/joyce/talk</a><br/>\n<br/>\nBut no one here can tell you what&#39;s &quot;best&quot; because best depends on  <br/>\nyour goals.<br/>\n<blockquote><span title=\"ireply\"> &gt; How can I teach her to read and about phonics without some type of  <br/>\n&gt; instruction? I can&#39;t see how she will figure out what a verb or a  <br/>\n&gt; compound word is if I don&#39;t teach it...<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Did something happen in the world this week that&#39;s got 3 people  <br/>\nsuddenly worried about verbs?? ;-)<br/>\n<br/>\nIf something isn&#39;t in the world being used, do people need it?<br/>\n<br/>\nBut you&#39;re confusing terminology with understanding the underlying  <br/>\nconcepts. I&#39;m betting she&#39;s used hundreds of compound words properly  <br/>\nbefore she&#39;d ever heard the word. I&#39;m betting the verbs she&#39;s used  <br/>\nnumber in the thousands. People can speak and write perfectly fine  <br/>\ngrammatically correct language without knowing the names for the  <br/>\nparts of speech they&#39;ve been using correctly since they were 3 or 4.  <br/>\nMaybe she&#39;ll need it for the SAT, but she can learn it in 15 minutes.  <br/>\nBy that point in her life, with over 15 years of putting all of it  <br/>\ninto practice, she&#39;ll get it easily because the names will attach to  <br/>\nconcepts she already understands.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":221315529,"authorName":"Ronnie","from":"&quot;Ronnie&quot; &lt;hmsdragonfly@...&gt;","profile":"hmsdragonfly","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New - Unschool, Eclectic, Traditional, ???","postDate":"1259776915","msgId":42303,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmNmEyaitwZWQ1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhmNHE3YitkYWMxQGVHcm91cHMuY29tPg=="},"prevInTopic":42302,"nextInTopic":42304,"prevInTime":42302,"nextInTime":42304,"topicId":42300,"numMessagesInTopic":0,"msgSnippet":"Hi Gayle, Every response you get here is certainly intended as a kind response! Some might challenge your thinking a little, but that is not the same as","messageBody":"<div id=\"ygrps-yiv-132398463\">Hi Gayle,<br/>\n<br/>\nEvery response you get here is certainly intended as a kind response! Some might challenge your thinking a little, but that is not the same as unkind.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am very torn between how to successfully school my 6yo daughter. &gt; We are fortunate to be able to &quot;roadschool&quot; her as we travel full-<br/>\n&gt; time...<br/>\n<br/>\n </span></blockquote>So cool! We have done some of this, too, and loved it. I miss it now that we are more or less stationary.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; and about a bit low in grade level for reading.<br/>\n<br/>\n </span></blockquote>Honestly, I doubt it. My daughters were in elementary school for a few years, and I saw a full range of reading skills in their classmates. A couple kids were reading chapter books at 6, and a couple kids were having trouble memorizing consonant sounds. The rest were reading a little. I&#39;m sure your daughter falls somewhere in that range! That puts her right at grade level.<br/>\n<br/>\nRemember that grade levels are based on averages. At such-and-such an age, most kids can do X. In school, there are always kids who can do more and there are always kids who can do less.<br/>\n<br/>\nThe difference for *your* kid is that she doesn&#39;t have anyone making her feel that she is behind. This is so precious! She is free to discover reading at her own pace, with joy, without anxiety. It would be very sad if you let fear drive you to change that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; ...and an occasional worksheet to check to make sure she actually <br/>\n&gt; does get the concepts...<br/>\n<br/>\n </span></blockquote>Here&#39;s a little challenge for you. What if she doesn&#39;t get the concepts yet? What choice do you make in that moment? You can choose worry and action and force her to work on whatever it is, or you can choose trust that she will get the concepts later, without stress, when her cognitive development and interest level come together at the right moment.<br/>\n<br/>\nReally. The concepts you are talking about for a 6yo are pretty basic, right? There is no way, at all, that she is going to reach adulthood without getting them, especially if there&#39;s nobody making her feel she is &quot;having trouble&quot; with them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Although I do believe that the best way to learn should be child <br/>\n&gt; directed and enjoyable and thus we follow somewhat of an <br/>\n&gt; unschooling approach, we are not radical unschoolers and we do have <br/>\n&gt; limits, rules, bedtimes, behavior expectations, etc. She also has <br/>\n&gt; seemed to learn quite well using this approach...<br/>\n<br/>\n </span></blockquote>Stop right there. Trust what you are seeing with your own eyes.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; however the visit to Logan&#39;s class has me questioning whether we <br/>\n&gt; are on the right path and if I am somehow shortchanging her.<br/>\n<br/>\n </span></blockquote>I can so relate to this fear! When I first started unschooling, I got online and said, &quot;What if we unschool and it ruins their lives?&quot; Someone very wisely responded with, &quot;What if you leave them in school and it ruins their lives?&quot;<br/>\n<br/>\nThere are no guarantees. Again, all you can do is make your choice in each moment. Choose joy. Choose trust. Choose the approach that makes your daughter smile. Happy kids learn. It&#39;s as natural and inevitable as the tide coming in.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Does anyone have any experiences on this board with using eclectic <br/>\n&gt; or unschool methods of teaching and any long term success stories?<br/>\n<br/>\n </span></blockquote>We all have success stories with unschooling or we wouldn&#39;t still be doing it! My daughters have been unschooled for 7 years. They are 17 and 15. They are bright, happy, active young women who are surrounded by friends of all ages and actually like to spend time with their parents. They are giving serious thought to what comes next. Both are planning to attend college and exploring the entrance requirements for the schools they are interested in.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Did any of you start off as unschoolers and switch to a traditional <br/>\n&gt; approach...<br/>\n<br/>\n </span></blockquote>No, because every time I went the other way, my relationship with my kids got better and they got happier. Significantly better and significantly happier.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How can I teach her to read and about phonics without some type of <br/>\n&gt; instruction? <br/>\n<br/>\n </span></blockquote>Enjoy reading. Read together. Laugh about books. Play with words. Reading comes naturally, just not always on a school schedule. Remember that many, many kids who get lots of reading instruction--with reading specialists even--don&#39;t learn to read until they are older.<br/>\n<br/>\nAnd keep in mind that phonics is not the be all and end all of reading. Some kids never learn phonics and yet read just fine. All readers learn enough phonics. <br/>\n<br/>\nI watched a lovely little exchange at an unschooler gathering yesterday. A 5yo was playing with refrigerator magnets and wanted to spell bear. The mom playing with her said, &quot;Bear starts with B,&quot; helped her locate the B, and then added casually, &quot;B makes a buh sound. Buh-bear.&quot; The little girl was delighted, and the game went on. Multiply that scene by hundreds of others over the next couple of years and you get a LOT of phonics exposure. It&#39;s more than enough.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I can&#39;t see how she will figure out what a verb or a compound word <br/>\n&gt; is if I don&#39;t teach it... <br/>\n<br/>\n </span></blockquote>Remember that you are talking about terminology. She uses verbs and compound words all the time! For the terminology, she&#39;ll pick them up out of the ether. And you can do Mad-Libs with her to help you stay calm while you wait for that to happen.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; there just doesn&#39;t seem to be that much opportunity in real life to <br/>\n&gt; teach some of these things. <br/>\n<br/>\n </span></blockquote>Boy, you said a mouthful! Begin to notice how many of the things that schools think are so terribly important never come up in real life! Why is that?<br/>\n<br/>\nIf and when she needs those pseudo-important things, she will learn them. One example: My daughters haven&#39;t had a math lesson since they left school. Last January, my younger daughter decided she wanted to try high school. They put her with her age-mates into a second semester Algebra class. She got an A. Why? Because she was there by choice, she felt free to ask questions (unlike most of her classmates!), and she believes in her own ability to learn.<br/>\n<br/>\nAfter that first report card, she was done with school again. She had seen what she wanted to see, reassured herself that she wasn&#39;t missing anything, and decided she preferred her unschooling life.<br/>\n<br/>\nIt&#39;s a *really* good life!<br/>\n<br/>\nRonnie<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sites.google.com/site/dragonflykaizen/\">http://sites.google.com/site/dragonflykaizen/</a></div>","specialLinks":[]},{"userId":151505017,"authorName":"carenkh","from":"&quot;carenkh&quot; &lt;carenkh@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New - Unschool, Eclectic, Traditional, ???","postDate":"1259773984","msgId":42302,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmNjc3MCttdm9zQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhmNHE3YitkYWMxQGVHcm91cHMuY29tPg=="},"prevInTopic":42300,"nextInTopic":42303,"prevInTime":42301,"nextInTime":42303,"topicId":42300,"numMessagesInTopic":0,"msgSnippet":"Hi, Gayle - There was just a discussion about parts of speech! I hope to write more later, but right now, here s a link to those posts: ","messageBody":"<div id=\"ygrps-yiv-423170040\">Hi, Gayle - There was just a discussion about parts of speech! I hope to write more later, but right now, here&#39;s a link to those posts:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/message/42248\">http://groups.yahoo.com/group/unschoolingbasics/message/42248</a><br/>\nThe responses are at the bottom of that page, and this:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/message/42217\">http://groups.yahoo.com/group/unschoolingbasics/message/42217</a><br/>\n<br/>\nI especially recommend Joyce&#39;s response to this post - again, you can see the responses at the bottom of that page.<br/>\n<br/>\nUnfortunately, the search function isn&#39;t working on a lot of yahoo groups, which, in my mind, negates one big reason for using yahoo - but you can *try* searching for specific topics, you might have some luck with it. It&#39;s mostly miss for me, in terms of hit-or-miss!<br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":84690835,"authorName":"harmonyglb","from":"&quot;harmonyglb&quot; &lt;harmonyglb@...&gt;","profile":"harmonyglb","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"New - Unschool, Eclectic, Traditional, ???","postDate":"1259727915","msgId":42300,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmNHE3YitkYWMxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":42302,"prevInTime":42299,"nextInTime":42301,"topicId":42300,"numMessagesInTopic":0,"msgSnippet":"I am very torn between how to successfully school my 6yo daughter. We are fortunate to be able to roadschool her as we travel full-time, but I worry that I","messageBody":"<div id=\"ygrps-yiv-1822561994\">I am very torn between how to successfully school my 6yo daughter. We are fortunate to be able to &quot;roadschool&quot; her as we travel full-time, but I worry that I should be doing more worksheet/workbook type activities. I sat in today on my nephew&#39;s 1st grade class, and comparatively she is at a much higher grade level in math, science, history, and social studies, and about a bit low in grade level for reading. Most of what she has learned so far has been the results of simply using life experiences to teach her, 100 easy lessons for<br/>\nphonics, educational games, writing postcards, keeping a blog, computer programs, and an occasional worksheet to check to make sure she actually does get the concepts. Although I do believe that the best way to learn should be child directed and enjoyable and thus we follow somewhat of an unschooling approach, we are not radical unschoolers and we do have limits, rules, bedtimes, behavior expectations, etc. She also has seemed to learn quite well using this<br/>\napproach, however the visit to Logan&#39;s class has me questioning whether we are on the right path and if I am somehow shortchanging her. Although the material being learned in the classroom was similar to what we are working with and she has learned, here were 21 other little children who were certainly handing in and doing more work than she typically does. Does anyone have any experiences on<br/>\nthis board with using eclectic or unschool methods of teaching and any long term success stories? Did any of you start off as unschoolers and switch to a traditional approach, and if so, has it been successful in teaching your children what they need to know? Or vice versa, has anyone here gone from traditional school to unschooling and found that to be more beneficial. How can I teach her to read and about phonics without some type of instruction? I can&#39;t see how she will figure out what a verb or a compound word is if I don&#39;t teach it... there just doesn&#39;t seem to be that much opportunity in real life to teach some of these things. <br/>\n<br/>\nThanks in advance for your KIND responses,<br/>\nLive Happy,<br/>\nGayle</div>","specialLinks":[]}],"prevTopicId":42336,"nextTopicId":42355}}