{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":126884268,"authorName":"HMSL2@aol.com","from":"HMSL2@...","profile":"dobsiedoe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Digest Number 961/shyness","postDate":"1149229582","msgId":13883,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM3Yi4zZWQ0ZWQ4LjMxYjEzNDBlQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":13882,"nextInTime":13884,"topicId":13883,"numMessagesInTopic":0,"msgSnippet":"Janice, Our children can be shy at times also. The oldest has been unschooling  since 99 and now feels his most comfortable around unschoolers (his comment","messageBody":"<div id=\"ygrps-yiv-507112818\">Janice,<br/>\n <br/>\nOur children can be shy at times also. The oldest has been unschooling  since <br/>\n99 and now feels his most comfortable around unschoolers (his comment from  <br/>\nyesterday) but does have several schooled friends. I don&#39;t think he was shy as <br/>\na  small child but school definitely sucked his confidence. It took a few <br/>\nyears for  him to feel he could be who he was but now he&#39;s in his own place. All <br/>\nfour  prefer being home.  I do also. <br/>\n <br/>\n I&#39;ve begun several emails but if I didn&#39;t post it I wanted to speak  about <br/>\nintroverted (shy) children at the conference but missed my opportunity. We  <br/>\nhave experienced this off and on over the last few years. My little guys have  <br/>\nbeen called whinny,clingy, brats and we&#39;ve even needed to back out of  events. I <br/>\ndo try not to say that Nicholas or Cameron or even Cassidy are  shy but far <br/>\nto often people get in their face and then are quick to say  they are whinny. <br/>\nIrks the heck out of me bc I have never stated a child is  anything but a child <br/>\ngrowing and learning. <br/>\n <br/>\nIn our case I suspect genetics but the right experiences are helping a lot.  <br/>\nWe have four children so when we go we go as a family and if we meet people  <br/>\ngreat but were not locked into having to interact. I&#39;ve heard parents say that  <br/>\nshy kids are that way bc they don&#39;t get out enough or they should attend <br/>\nweekly  play groups. IMO that&#39;s not the case or solution and the kids are then <br/>\neven more  aware and stressed over their shyness. <br/>\n <br/>\nI would say unschooling would be the greatest option for your family.  <br/>\nUnschooling is more than no curriculum. Well, we radically unschool so I&#39;ll stay  <br/>\nwith that.. As radical unschoolers we respect our children for who they are  <br/>\nrather then requiring them to fit into some mold of what they or homeschooling  <br/>\nlooks like. They may be shy or hyper or reactive but we don&#39;t hobble around on  <br/>\nthat label we work with what we have and make the best of every day and <br/>\nmoment. <br/>\n <br/>\nMy advice would be to trust your instincts. Don&#39;t feel committed to  <br/>\nanyone/anything but your children/family and work with what you have. It will  change, <br/>\nit will lesson as they get older. Being a parent of children who tend to  be <br/>\nshy I know it at times can be challenging. My daughter went in and out of  <br/>\nstages of that this weekend. Sunday (after we talked and played till 3am) she  <br/>\nwas not interested in anything or anyone. She needed sleep and I tried to work  <br/>\nthat into my want to hear the end of the conference. She may have even fed off <br/>\n of my own stress levels, I know she did the timing was right on.  They did  <br/>\nall want to go but one opted to go home with daddy after a day and the other  <br/>\nwent excited to see daddy. It was an hour drive to come back and we are tight <br/>\non  funds but he wasn&#39;t happy so we worked with what we had and home was it <br/>\nfor  them.. Unschoolers could understand why we spent 40 dollars to drive down <br/>\nand  back while we had a hotel room paid for. We could have left them at home <br/>\nknowing  that there may have been a want to go home but they wanted to attend <br/>\nand they  did. Their happy with the time they had and got the best of both <br/>\nworlds being  able to choose to go and stay and then go in the end.<br/>\n <br/>\nLaura<br/>\nUnschoolingMaine.com<br/>\n<br/>\n&lt;&lt;Subject: Intro and Peabody conference and questions  <br/>\n<br/>\n<br/>\nHi Everyone, <br/>\n<br/>\nMy name is Janice and I am the wife of Glen,  and the mother of 4 <br/>\nboys: Paul- 14.5, Shawn-12, Eric-9, Collin-8(in 2  wks), and Joshua-6<br/>\n(in 2 wks).<br/>\n<br/>\nWe recently attended the Peabody  Unschooling Conference to try to <br/>\nhelp us decide whether or not the  unschooling life was really what <br/>\nwe were after or not.  The  conference made reference to this web <br/>\ngroup, so here I am.  We have  been homeschooling for 5 years now and <br/>\nthis past year have tentatively  been trying out the unschooling <br/>\nlifestyle.  I have known about  unschooling since the start of our <br/>\nhomeschooling journey and have always  been intrigued by it, but was <br/>\nsomewhat hesitant to try it.  All of my  children are VERY <br/>\nintroverted.  They would prefer to never leave the  confines of our <br/>\nhome for any reason, and this makes me somewhat shy of  unschooling.  <br/>\nThey have NO friends whatsoever.  Even at the  conference, they spent <br/>\nas much time as they possibly could hiding in our  hotel room.<br/>\n<br/>\nCould someone please convince me that this will work for  our family?<br/>\n<br/>\nAlso, my husband is still on the fence about even  traditional <br/>\nhomeschooling methods and this makes him even more  nervous.  He has <br/>\nagreed to &quot;go with the flow&quot; for now, but both of us  need <br/>\nreassurance about this lifestyle.  Just for information  purposes, <br/>\none of the things that makes us the most hesitant is in regards  to <br/>\nreading - my 3 youngest still do not read AT ALL, and my 12 yr old  <br/>\ncan read (but probably not at what most would consider &quot;grade <br/>\nlevel&quot;)  but hates to read for any reason.<br/>\n<br/>\nAny insights would be  appreciated.<br/>\n<br/>\nJanice W.<br/>\nLeicester, MA<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":12958,"nextTopicId":13887}}