{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":89238718,"authorName":"amazzingpet@aol.com","from":"amazzingpet@...","profile":"amazzingpet","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:What to do about spiteful child who&#39;s not mine","postDate":"1188139073","msgId":25997,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNkMy4xOTVmNzVjMS4zNDAyZWE0MUBhb2wuY29tPg=="},"prevInTopic":25986,"nextInTopic":0,"prevInTime":25996,"nextInTime":25998,"topicId":25983,"numMessagesInTopic":0,"msgSnippet":"Wow!  That certainly sounds like a very, very challenging  situation.  I feel for you on so many different levels.  I think that  your behavior was human when","messageBody":"<div id=\"ygrps-yiv-890751069\">Wow!  That certainly sounds like a very, very challenging  situation.  I feel <br/>\nfor you on so many different levels.  I think that  your behavior was human <br/>\nwhen you lost it.  It can happen to the best  of us when we are stretched <br/>\nbeyond our limits.  Forgive yourself,  and apologize to the child is all that you <br/>\ncan really do.  Internalize  that feeling, in hopes that it can help you in the <br/>\nfuture.   But, realize that you are human; and we all make mistakes that are  <br/>\nregrettable.  ((((hugs)))))<br/>\n <br/>\nI am wondering if we had more information, if we might be able to be more  <br/>\nhelp to you.<br/>\n <br/>\nSpecifically, why is the child staying away from her mother/father for that  <br/>\nperiod of time?  <br/>\n <br/>\nIs there some other conflict going on in her life?  Divorce, parents  <br/>\nfighting, death of a person or animal, move, change in school, etc?<br/>\n <br/>\nIs she often going from house to house; or day care to day care; or school  <br/>\nto school?  ie is their a lot of change in who watches her?<br/>\n <br/>\n <br/>\nAlso, have you asked the mother how she would like you to handle the  <br/>\nsituations?  <br/>\n<br/>\n <br/>\nI will also add that you need to keep your own needs in mind.  No one  says <br/>\nthat you &quot;have&quot; to watch this child.  It sounds like you have your  hands full <br/>\nwith a 4 year old and a 10 month old.   <br/>\n <br/>\nI do think that this child needs connection, not isolation; though.   But, I <br/>\ndon&#39;t know that someone else watching this child will be capable of  meeting <br/>\nthat need in such a short period of time.  If you have read  &quot;Playful <br/>\nParenting&quot;, those skills may work the quickest for short fixes.....but,  it requires a <br/>\nlot of imagination and energy, which you certainly may not have  with how full <br/>\nyour plate is at this point. <br/>\n <br/>\nGood luck!<br/>\n <br/>\nWarmly,<br/>\nCynthia <br/>\n<br/>\n<br/>\n<br/>\n************************************** Get a sneak peek of the all-new AOL at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://discover.aol.com/memed/aolcom30tour\">http://discover.aol.com/memed/aolcom30tour</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":299902014,"authorName":"Emilie","from":"Emilie &lt;erugard@...&gt;","profile":"breathemama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] What to do about spiteful child who&#39;s  not mine","postDate":"1188099391","msgId":25986,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGZhcHNpYitoNGRtQGVHcm91cHMuY29tPg==","referencesHeader":"PGZhcHNpYitoNGRtQGVHcm91cHMuY29tPg=="},"prevInTopic":25985,"nextInTopic":25997,"prevInTime":25985,"nextInTime":25987,"topicId":25983,"numMessagesInTopic":0,"msgSnippet":"Hi, Here is my perspective. Maybe it will be of some help. I have a daughter who is almost four. She nurses still and has been attachment parented since birth.","messageBody":"<div id=\"ygrps-yiv-968087808\">Hi,<br/>\n      Here is my perspective. Maybe it will be of some help.<br/>\n      I have a daughter who is almost four. She nurses still and has <br/>\nbeen attachment parented since birth. She is very slow to warm up and <br/>\ncan only be left with my husband if I am not available.  I stay at <br/>\nhome with her and her two sisters so this isn&#39;t often a problem. She <br/>\nis a wonderful, strong, happy creative child. She gets very physical <br/>\nand very upset when things don&#39;t go her way when she is tired or <br/>\nhungry or overstimulated. Her behavior is a little different from <br/>\nwhat you are describing, but in many ways it is similar. My daughter <br/>\noften responds very powerfully to seemingly small things. Her <br/>\nsandwich being cut when she does not want it cut is truly devastating <br/>\nto her and she will not eat it.  She will almost always want what her <br/>\nolder sister has even if she really wanted something else a few <br/>\nminutes ago.  She really is not capable of being quiet when my baby <br/>\nis sleeping. She can do it for a few minutes but forgets and is loud, <br/>\nor gets upset about something and is really loud.<br/>\n      I think that many children around this age get very passionate <br/>\nabout tiny details. They are learning about their own preferences and <br/>\ntheir ability to control their own environment. Some children are <br/>\npretty flexible during this process, others are not. For my daughter <br/>\nit truly seems to her like the world will end if her preference is <br/>\nnot met. Her socks have to be just so on her feet or she screams and <br/>\nkicks. She has very strong reactions.<br/>\n      I feel that this behavior is pretty developmentally <br/>\nappropriate. Inconvenient, but appropriate. There are many children <br/>\nwith more easy going temperaments who will not react this way during <br/>\nthis developmental stage. But for many children, this is typical.  I <br/>\nam pretty picky about my socks too :-). When my wrist was broken and <br/>\nmy husband had to put them on for me they always felt wrong. I try to <br/>\nimagine what it feels like to be so small and have to rely on others <br/>\nfor these types of things.<br/>\nI also try to help her get her preference whenever I can. I try to <br/>\ngive her as much information beforehand so that she will not be <br/>\nsurprised. I will remind her more than once at a restaurant that her <br/>\nsister is having grilled cheese, and ask her if she still wants pasta <br/>\nbefore we order. Often she will switch her choice, often she will <br/>\nnot. This does reduce the number of occasions where she is <br/>\ndisappointed but doesn&#39;t eliminate them.  Sometimes her sister will <br/>\nshare with her if she becomes really upset about her choice. <br/>\nSometimes she won&#39;t. We try to help her get what she wants, but <br/>\nsometimes it is just not possible or at least not practical. Those <br/>\ntimes she has to live with not having her choice. If she feels like <br/>\nwe have genuinely tried, she tends to be less upset. If she feels <br/>\nlike we are trying to push the unwanted item on her, like a cut <br/>\nsandwich for example, she will become enraged. The more we push, the <br/>\nangrier and more out of control she becomes. Usually there is a <br/>\nsolution. A new sandwich sometimes. Or a yogurt she can get from the <br/>\nfridge herself, some almonds. We try to keep things which she will <br/>\neat readily around the house or packed to take with us. We try to <br/>\nmake her feel more in control when she starts acting like this, not <br/>\nless in control. This tends to diffuse things.<br/>\n           Transitions are hard for her too. I try to talk to her <br/>\nabout how she will feel when it is time to leave before we even <br/>\narrive. We count down the time for longer i.e., swimming is half <br/>\nover, is there anything that you want to do before we are done? we <br/>\nhave time for five more trips across the pool,  we say bye to the pool, etc.<br/>\n      My older daughter (now six) went through many of these same <br/>\nissues at 3 and 4 years. She now is pretty flexible about most things <br/>\nand has ceased to be a &#39;picky eater&#39; entirely. She has tremendous <br/>\nempathy for her younger sister when she acts this way. I guess she <br/>\nremembers what it felt like. When I get exasperated, my older <br/>\ndaughter reminds me of how important it is to her sister to have <br/>\nthings just so.<br/>\nThat said, my almost four year old is too little to go away from her <br/>\nfamily for &quot;several days&quot; (for that matter so is my 6 year old:-)) . <br/>\nHer behavior sounds to me like she really needs to connect. She needs <br/>\noutside help to calm down. She needs to feel that she is safe and <br/>\nthat life is predictable. To me, that is what a tantrum is. Overload <br/>\nand a cry for help. Maybe she just isn&#39;t ready for this type of <br/>\nextended visit. If she does have to be away from home, maybe she <br/>\nneeds fewer transitions and more support in decision making. For some <br/>\na sandwich is just a sandwich i.e, my husband, others special order <br/>\nevery aspect of their meal down to tiny details i.e., me. Temperament <br/>\naccounts for a lot.<br/>\n<br/>\nwarmly,<br/>\nEmilie<br/>\n<br/>\nAt 02:31 PM 25/08/2007, you wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;I can grasp all of the possible explanations for her behaviors, but<br/>\n&gt;I don&#39;t know how to HANDLE them. </span></blockquote></div>","specialLinks":[]},{"userId":146582081,"authorName":"castlecarver","from":"&quot;castlecarver&quot; &lt;artist@...&gt;","profile":"castlecarver","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What to do about spiteful child who&#39;s not mine","postDate":"1188088322","msgId":25985,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZhcWhtMis0aDJhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZhcHNpYitoNGRtQGVHcm91cHMuY29tPg=="},"prevInTopic":25983,"nextInTopic":25986,"prevInTime":25984,"nextInTime":25986,"topicId":25983,"numMessagesInTopic":0,"msgSnippet":"One of my earliest memories involves me having a tantrum and how my grandmother responded to it. I was about 4. My parents left me with my grandparents for","messageBody":"<div id=\"ygrps-yiv-86092915\">One of my earliest memories involves me having a tantrum and how my<br/>\ngrandmother responded to it. I was about 4. My parents left me with my<br/>\ngrandparents for several weeks. If I remember correctly my mother was<br/>\nill, my father was working and there was no one at home to watch me...<br/>\nbut I didn&#39;t want to be there. <br/>\n<br/>\nI began having tantrums at every meal just like you are describing.<br/>\nThen one day while I was acting out my grand mother took me kicking<br/>\nand screaming to the barn and deposited me in an empty stall with the<br/>\nwords &quot;You are acting like an animal. The animals live in the barn.<br/>\nWhen you decide you are no longer an animal you may come back to live<br/>\nwith the humans in the house.&quot; said in the kindest voice she could<br/>\nmuster. She didn&#39;t yell. She didn&#39;t hit me. She just closed the stall<br/>\ndoor and didn&#39;t lock it so I could get out when I wanted. Then she<br/>\nwalked back to the house. <br/>\n<br/>\nOnce she was inside the house, I continued my tantrum kicking the<br/>\nwalls and throwing hay around until I had exhausted myself and found<br/>\nthat the animals were giving me curious looks. <br/>\n<br/>\nI stayed in the barn until I got hungry. The tantrum happened over<br/>\nbreakfast and I went in around lunch time. (a long time for a young<br/>\nchild anyway) When I went back to the house my grandmother asked if I<br/>\nhad decided to be a human again. I don&#39;t remember what I told her. But<br/>\nI do remember that was the very last temper tantrum I ever had at<br/>\nanyone. It was exactly what I needed at the time... to be alone until<br/>\nI chose to be with people. The time limit was self imposed. <br/>\n<br/>\nBTW My granddad kept checking on me. He thought I couldn&#39;t see him<br/>\npeeking in the big door as he walked by. <br/>\n<br/>\nSo I guess time out does work. It did with me. <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Lisa O&quot; &lt;roozoomom@...&gt; wrote:<br/>\n&gt;<br/>\n&gt;  Looking for an objective point of view on this subject. It&#39;s long...<br/>\n&gt;  <br/>\n&gt;  I&#39;ve been perseverating about this issue for several weeks since my <br/>\n&gt; cousin&#39;s 4yo dtr stayed several days with us...and now I&#39;ve agreed <br/>\n&gt; to watch her for several days, yet again. I love my dear cousin, and <br/>\n&gt; care about her child, but I truly suffered through the days of <br/>\n&gt; watching her. My 4.10yo son and she play well together, that&#39;s not <br/>\n&gt; the issue, or it would be simple. It seems to be only adults she <br/>\n&gt; acts out toward.<br/>\n&gt;  <br/>\n&gt;  I can grasp all of the possible explanations for her behaviors, but <br/>\n&gt; I don&#39;t know how to HANDLE them.  <br/>\n&gt;  <br/>\n&gt;  Last visit she would demand something (say a corny dog from Sonic). <br/>\n&gt; In my good humor I would oblige and we&#39;d all go to Sonic. I get what <br/>\n&gt; she wants, only to have her throw it on the floor and demand my son <br/>\n&gt; give her his cheeseburger instead, because she changed her mind.  <br/>\n&gt; Something resembling this scenario happened at every meal. I am very <br/>\n&gt; accommodating, but I don&#39;t give-in to these types of tantrums. Offer <br/>\n&gt; simple solutions to diffuse the situation, yes, but go the extra <br/>\n&gt; mile to please her, no. <br/>\n&gt;  <br/>\n&gt;  I took the kids swimming. When it was time to go (both kids were in <br/>\n&gt; my arms), I announced they have 5 min, 2min, 1min left, so they&#39;d <br/>\n&gt; have time to wrap up playtime. When the moment to get out of the <br/>\n&gt; pool arrived I said so and began to exit the pool with both kids. <br/>\n&gt; She yelled &#39;no!&#39; in a very angry voice and splashed me in the face <br/>\n&gt; with water, using a fist that stayed in hitting position way too <br/>\n&gt; long for me. I discussed it with her afterward, but only got <br/>\n&gt; defiance in return, as she went to the chairs on the other side of <br/>\n&gt; the pool, and required I carry her out, because she wouldn&#39;t get up <br/>\n&gt; from the chair. No amount of gentle reasoning changed anything.<br/>\n&gt;  <br/>\n&gt;  At home, my 10mo was with my dh, and had just slept. For my having <br/>\n&gt; cut her requested sandwich in half, she ran to the guest bedroom and <br/>\n&gt; began a screaming fit. I at first voiced concern for her,not knowing <br/>\n&gt; why she was screaming. But when she turned and screamed in my face, <br/>\n&gt; I lost my patience. I was just about to carry her outside to finish <br/>\n&gt; her fit (sleeping baby), when I heard my baby wake up. I put her <br/>\n&gt; back on the bed and swatted her on the behind, which to this day I <br/>\n&gt; lament over.<br/>\n&gt;  <br/>\n&gt;  If I could ignore her behaviors, I would. But she esculates if I <br/>\n&gt; do. And there&#39;s no telling what lengths she&#39;ll go to. She gets <br/>\n&gt; aggressive, destructive, and loud. Talking to her in a gentle or <br/>\n&gt; assertive tone doesn&#39;t make a difference. She acts like I don&#39;t <br/>\n&gt; exist, and continues on with either the behavior I&#39;ve asked her to <br/>\n&gt; please stop, or the tantrum because I&#39;ve asked her to stop. <br/>\n&gt;  <br/>\n&gt;  The only solution I can think of is to keep us at home all the days <br/>\n&gt; she&#39;s here, and give her timeout on the couch if she begins a <br/>\n&gt; tantrum (I don&#39;t DO timeout...does it really work for kids like <br/>\n&gt; this?)<br/>\n&gt;  <br/>\n&gt;  If ANYONE HAS ANY SUGGESTIONS, I would so appreciate it. An <br/>\n&gt; objective point of view would benefit me greatly. Thanks, Lisa O<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":309000316,"authorName":"Lisa O","from":"&quot;Lisa O&quot; &lt;roozoomom@...&gt;","profile":"roozoomom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"What to do about spiteful child who&#39;s not mine","postDate":"1188066699","msgId":25983,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZhcHNpYitoNGRtQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":25985,"prevInTime":25982,"nextInTime":25984,"topicId":25983,"numMessagesInTopic":0,"msgSnippet":"Looking for an objective point of view on this subject. It s long... I ve been perseverating about this issue for several weeks since my cousin s 4yo dtr","messageBody":"<div id=\"ygrps-yiv-701998646\">Looking for an objective point of view on this subject. It&#39;s long...<br/>\n <br/>\n I&#39;ve been perseverating about this issue for several weeks since my <br/>\ncousin&#39;s 4yo dtr stayed several days with us...and now I&#39;ve agreed <br/>\nto watch her for several days, yet again. I love my dear cousin, and <br/>\ncare about her child, but I truly suffered through the days of <br/>\nwatching her. My 4.10yo son and she play well together, that&#39;s not <br/>\nthe issue, or it would be simple. It seems to be only adults she <br/>\nacts out toward.<br/>\n <br/>\n I can grasp all of the possible explanations for her behaviors, but <br/>\nI don&#39;t know how to HANDLE them.  <br/>\n <br/>\n Last visit she would demand something (say a corny dog from Sonic). <br/>\nIn my good humor I would oblige and we&#39;d all go to Sonic. I get what <br/>\nshe wants, only to have her throw it on the floor and demand my son <br/>\ngive her his cheeseburger instead, because she changed her mind.  <br/>\nSomething resembling this scenario happened at every meal. I am very <br/>\naccommodating, but I don&#39;t give-in to these types of tantrums. Offer <br/>\nsimple solutions to diffuse the situation, yes, but go the extra <br/>\nmile to please her, no. <br/>\n <br/>\n I took the kids swimming. When it was time to go (both kids were in <br/>\nmy arms), I announced they have 5 min, 2min, 1min left, so they&#39;d <br/>\nhave time to wrap up playtime. When the moment to get out of the <br/>\npool arrived I said so and began to exit the pool with both kids. <br/>\nShe yelled &#39;no!&#39; in a very angry voice and splashed me in the face <br/>\nwith water, using a fist that stayed in hitting position way too <br/>\nlong for me. I discussed it with her afterward, but only got <br/>\ndefiance in return, as she went to the chairs on the other side of <br/>\nthe pool, and required I carry her out, because she wouldn&#39;t get up <br/>\nfrom the chair. No amount of gentle reasoning changed anything.<br/>\n <br/>\n At home, my 10mo was with my dh, and had just slept. For my having <br/>\ncut her requested sandwich in half, she ran to the guest bedroom and <br/>\nbegan a screaming fit. I at first voiced concern for her,not knowing <br/>\nwhy she was screaming. But when she turned and screamed in my face, <br/>\nI lost my patience. I was just about to carry her outside to finish <br/>\nher fit (sleeping baby), when I heard my baby wake up. I put her <br/>\nback on the bed and swatted her on the behind, which to this day I <br/>\nlament over.<br/>\n <br/>\n If I could ignore her behaviors, I would. But she esculates if I <br/>\ndo. And there&#39;s no telling what lengths she&#39;ll go to. She gets <br/>\naggressive, destructive, and loud. Talking to her in a gentle or <br/>\nassertive tone doesn&#39;t make a difference. She acts like I don&#39;t <br/>\nexist, and continues on with either the behavior I&#39;ve asked her to <br/>\nplease stop, or the tantrum because I&#39;ve asked her to stop. <br/>\n <br/>\n The only solution I can think of is to keep us at home all the days <br/>\nshe&#39;s here, and give her timeout on the couch if she begins a <br/>\ntantrum (I don&#39;t DO timeout...does it really work for kids like <br/>\nthis?)<br/>\n <br/>\n If ANYONE HAS ANY SUGGESTIONS, I would so appreciate it. An <br/>\nobjective point of view would benefit me greatly. Thanks, Lisa O</div>","specialLinks":[]}],"prevTopicId":25970,"nextTopicId":25972}}