{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What to do when older sibling acts unsafely with younger sibling?","postDate":"1258673162","msgId":42114,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlNGs2YStsZXI4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhlM3Jlbyttb21uQGVHcm91cHMuY29tPg=="},"prevInTopic":42112,"nextInTopic":0,"prevInTime":42113,"nextInTime":42115,"topicId":42109,"numMessagesInTopic":0,"msgSnippet":"... ********************** It might end up being easier to rethink the whole play-pen option. Can you get some kind of sling and carry the baby? Put her in a","messageBody":"<div id=\"ygrps-yiv-1152150954\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;shirarocklin&quot; &lt;shirarocklin@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;There are times where I put the baby to play in a play-pen so I can go and do something.<br/>\n </span></blockquote>**********************<br/>\n<br/>\nIt might end up being easier to rethink the whole play-pen option. Can you get some kind of sling and carry the baby? Put her in a stroller or bouncy-chair wherever you are? <br/>\n<br/>\nIt may also be helpful to rethink what you want to do. How essential is it to do this right now? can it wait? Can you do it where the kids are? Invite the 3yo to participate? <br/>\n<br/>\nIt will help if you step away from the idea that its somehow possible to set the baby aside and go get some work done. That&#39;s not going to be the reality of your life for awhile! So its time to rethink your options - most likely, to include having at least one of your kids with you while you&#39;re doing anything. Bring one into the bathroom with you if need be (I&#39;m sure I didn&#39;t pee alone for years). <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;And she doesn&#39;t seem to be able to stop pushing him down when he pulls himself up on the sides of it.  I&#39;ve tried explaining that what she is doing can break the play-pen, and that she is hurting him, but she doesn&#39;t stop.<br/>\n </span></blockquote>***********************<br/>\n<br/>\nIs she pushing him down any other times? If so, it might help to show her how to support him, instead, if she&#39;s interested. But mostly I think you&#39;ll find that keeping one kid where you are, or staying where they are, mitigates a whole lot of these sorts of troubles. In fact, the more time you can spend right in the middle of the kid action (down on the floor and everything) the better, both in terms of interacting with the kids and helping see trouble coming sooner. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What to do when older sibling acts unsafely with younger sibling?","postDate":"1258672240","msgId":42112,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdDREQ3NDM5MjM4MDQzRDk5OERDNTlDRkYwN0IwMDZDQExZTEFMQVAyPg==","inReplyToHeader":"PGhlM3Jlbyttb21uQGVHcm91cHMuY29tPg==","referencesHeader":"PGhlM3Jlbyttb21uQGVHcm91cHMuY29tPg=="},"prevInTopic":42111,"nextInTopic":42114,"prevInTime":42111,"nextInTime":42113,"topicId":42109,"numMessagesInTopic":0,"msgSnippet":"i agree with get rid of the play pen.  or - conversely - if the baby is happy in there, use it to spend  time with the THREE year old!! but it sounds like an","messageBody":"<div id=\"ygrps-yiv-230854396\">i agree with get rid of the play pen.  or - conversely - if the baby is happy in there, use it to spend  time with the THREE year old!! but it sounds like an attractive nuisance to her right now...at best. and a way to get your attention when you are &quot;doing stuff&quot; as well.  so give your attention. :)<br/>\n<br/>\nlyla<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: shirarocklin <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Thursday, November 19, 2009 8:23 AM<br/>\n  Subject: [unschoolingbasics] What to do when older sibling acts unsafely with younger sibling?<br/>\n<br/>\n<br/>\n    <br/>\n  Hello,<br/>\n  I have a three year old, and a 9 month old. I am having some difficulty finding a way for my three year old daughter to stop acting unsafely with the baby. For the most part, my perspective is to just minimize the opportunities for unsafe interactions, since I don&#39;t really expect a three year old to be able to control their behaviour all the time. And she is actually usually very helpful, and safe. She feeds him, holds him, soothes him, etc. There are some situations, however, that I can&#39;t quite figure out what to do. There are times where I put the baby to play in a play-pen so I can go and do something. 3YO has variously tried: climbing in with him, pushing him down when he pulls up on the edge of it, leaning on the sides of it, etc. Its not built for her weight, and we can&#39;t afford to break it. And she doesn&#39;t seem to be able to stop pushing him down when he pulls himself up on the sides of it. I&#39;ve tried explaining that what she is doing can break the play-pen, and that she is hurting him, but she doesn&#39;t stop. I&#39;ve resorted to picking her up and away from the situation when it happens, telling her why what she is doing is not ok, but she just goes right back to it once I put her down. I don&#39;t want to continue in this direction and end up with time-outs or being in her room until she can act better. Can you suggest some alternatives?<br/>\n  Thanks,<br/>\n  Shira<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar@earthlink.net","from":"&lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] What to do when older sibling acts unsafely with younger sibling?","postDate":"1258671711","msgId":42111,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPR0VBQkRDQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGhlM3Jlbyttb21uQGVHcm91cHMuY29tPg=="},"prevInTopic":42109,"nextInTopic":42112,"prevInTime":42110,"nextInTime":42112,"topicId":42109,"numMessagesInTopic":0,"msgSnippet":"... go and do something.  ","messageBody":"<div id=\"ygrps-yiv-1352396067\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt; There are times where I put the baby to play in a play-pen so I can<br/>\n </span></blockquote>go and do something.  &lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nGet rid of the play pen. :-) What is it that you need to do that requires a<br/>\nplay pen? I have four children and have not used the play pen at all. If you<br/>\nare going to the bathroom, put the baby on the floor to play while you do<br/>\nyour business. If you are taking a shower, let the baby (and 3 year old)<br/>\nplay on the floor of the shower. If you are doing dishes, let the baby play<br/>\non the floor around your feet. I always keep my little ones in close<br/>\nproximity. That is the best way to keep them safe and keep the older ones<br/>\nfrom doing anything unsafe to the little ones. Have you tried wearing the<br/>\nbaby? I have worn all of my kids and that really helps to keep the little<br/>\nones safe. Once they want to cruise and start exploring, they get to. I have<br/>\na 10 month old and a 2.5 year old and I don&#39;t have too many problems because<br/>\nthe house is arranged so that my two youngest kids can safely explore the<br/>\nhouse at will. There is no need for a play pen because age appropriate toys<br/>\nare always available.<br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":251210887,"authorName":"shirarocklin","from":"&quot;shirarocklin&quot; &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"What to do when older sibling acts unsafely with younger sibling?","postDate":"1258647832","msgId":42109,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlM3Jlbyttb21uQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":42111,"prevInTime":42108,"nextInTime":42110,"topicId":42109,"numMessagesInTopic":0,"msgSnippet":"Hello, I have a three year old, and a 9 month old.  I am having some difficulty finding a way for my three year old daughter to stop acting unsafely with the","messageBody":"<div id=\"ygrps-yiv-22837023\">Hello,<br/>\nI have a three year old, and a 9 month old.  I am having some difficulty finding a way for my three year old daughter to stop acting unsafely with the baby.  For the most part, my perspective is to just minimize the opportunities for unsafe interactions, since I don&#39;t really expect a three year old to be able to control their behaviour all the time.  And she is actually usually very helpful, and safe.  She feeds him, holds him, soothes him, etc.  There are some situations, however, that I can&#39;t quite figure out what to do.  There are times where I put the baby to play in a play-pen so I can go and do something.  3YO has variously tried: climbing in with him, pushing him down when he pulls up on the edge of it, leaning on the sides of it, etc.  Its not built for her weight, and we can&#39;t afford to break it.  And she doesn&#39;t seem to be able to stop pushing him down when he pulls himself up on the sides of it.  I&#39;ve tried explaining that what she is doing can break the play-pen, and that she is hurting him, but she doesn&#39;t stop.  I&#39;ve resorted to picking her up and away from the situation when it happens, telling her why what she is doing is not ok, but she just goes right back to it once I put her down.  I don&#39;t want to continue in this direction and end up with time-outs or being in her room until she can act better.  Can you suggest some alternatives?<br/>\nThanks,<br/>\nShira</div>","specialLinks":[]}],"prevTopicId":42100,"nextTopicId":42108}}