{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Good days; a couple more questions!","postDate":"1333143927","msgId":48166,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsNTlobittMm1nQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpsNGo4MCtsY2U5QGVHcm91cHMuY29tPg=="},"prevInTopic":48159,"nextInTopic":0,"prevInTime":48165,"nextInTime":48167,"topicId":48159,"numMessagesInTopic":0,"msgSnippet":"... ************** Something I used to do when Mo was little was keep up an ongoing commentary of Yes when I needed a minute or two to get to what she wanted -","messageBody":"<div id=\"ygrps-yiv-483402681\">&quot;messy_boys&quot; &lt;messy_boys@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; 1- My 4 yo or 2 yo will ask for something, like a bowl of cereal.  I say yes, but for whatever reason I need them to wait just a moment.  Let&#39;s say I&#39;m in the bathroom...<br/>\n </span></blockquote>**************<br/>\n<br/>\nSomething I used to do when Mo was little was keep up an ongoing commentary of Yes when I needed a minute or two to get to what she wanted - a kind of stream of consciousness, play by play account of all the things I&#39;m doing to move closer to the actual moment of Yes. That seemed to let her know I wasn&#39;t going to forget or get distracted , and it filled up those agonizingly long minutes between &quot;I will&quot; and &quot;here it is&quot;. Remember, sixty whole seconds can feel eternal to a 4yo!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;or outside talking to a neighbor<br/>\n<br/>\n </span></blockquote>That&#39;s harder because you can&#39;t keep up the stream of consciousness thing. Maybe you can invite the other adult inside while you get the cereal, or say &quot;hold that thought&quot; run in and come back. It will certainly give you more time to talk than the increasing: &quot;mommy, mommy, Mommy, MOmmy, MoMMy, MOMMY!&quot; That&#39;s no fun for anyone!<br/>\n<br/>\nAlso, for things like food, it can help to make the kitchen as kid-friendly as possible. Have little, plastic bowls and plates low down. Decant favorite beverages into containers little hands can manage. Whenever possible, make up kid-sized portions of things they can grab without asking. They&#39;ll probably still ask! but it&#39;s nice to have one more tool in the bag, as it were, so you can say &quot;I&#39;m happy to get that for your, Or if you don&#39;t want to wait you can get it yourself.&quot; <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; 2- My 4 yo picks at my 2yo sometimes.  She screams and wails and he just keeps at it.<br/>\n </span></blockquote>***************<br/>\n<br/>\nIntervene sooner - get down on the floor with them and, if possible, get them doing something together. Some of what he&#39;s doing is probably to get attention from her - kids often want attention from siblings as well as parents, so look for ways to make that possible. Think about things they both like to do so you have some ideas for next time.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":237699340,"authorName":"messy_boys","from":"&quot;messy_boys&quot; &lt;messy_boys@...&gt;","profile":"messy_boys","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Good days; a couple more questions!","postDate":"1333121088","msgId":48159,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsNGo4MCtsY2U5QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":48166,"prevInTime":48158,"nextInTime":48160,"topicId":48159,"numMessagesInTopic":0,"msgSnippet":"This has been a very good week for the kids and I.  It s such a different mindset and changing the way you look at your kids and their behavior! I have not","messageBody":"<div id=\"ygrps-yiv-1891106130\">This has been a very good week for the kids and I.  It&#39;s such a different mindset and changing the way you look at your kids and their behavior!  <br/>\n<br/>\nI have not been insisting on &quot;chores&quot; and my oldest have actually been asking if I need help with anything!  My littler ones insist on helping, so I&#39;ve been giving them spray bottles of water and a towel.  That keeps them busy for hours!!!  They also really like the Swiffer duster.  At one point, they were outside cleaning their toys.<br/>\n<br/>\nAnother day, they decided they wanted to be me, so each of my four littles asked if they could wear one of my shirts.  Before I would have said NO but I asked myself why not?  So I gave each of them a shirt and soon they were running back and forth through the house, laughing and saying, &quot;I&#39;m your momma!&quot;  LOL...<br/>\n<br/>\nThe screaming has died down some as I have been taking your suggestions, paying more attention and anticipating needs.  I do have a couple of recurring situations I wanted to ask more advice on.<br/>\n<br/>\n1- My 4 yo or 2 yo will ask for something, like a bowl of cereal.  I say yes, but for whatever reason I need them to wait just a moment.  Let&#39;s say I&#39;m in the bathroom, or outside talking to a neighbor or something.  Well they continue to say &quot;I want cereal!&quot; over and over and over, getting louder each time until they are full on screaming.<br/>\n<br/>\n2- My 4 yo picks at my 2yo sometimes.  She screams and wails and he just keeps at it.  I have started moving him to another room and telling him to stop.  But he will find some subtle way to still get at her, either pointing at her, yelling, making faces or waving one of her toys around.<br/>\n<br/>\nAny ideas on good ways to handle these?<br/>\n<br/>\nThanks!!!<br/>\nKristie</div>","specialLinks":[]}],"prevTopicId":48109,"nextTopicId":389}}