{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"autonomy and competence","postDate":"1268416860","msgId":43326,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuZHZncys0b2o2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NkRFREREQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":43320,"nextInTopic":0,"prevInTime":43325,"nextInTime":43327,"topicId":43312,"numMessagesInTopic":0,"msgSnippet":"... This is going off on a tangent! It can be useful to know that autonomy often gets used to mean two things rolled together: autonomy itself, in the sense","messageBody":"<div id=\"ygrps-yiv-325939450\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Debra Rossing&quot; &lt;debra.rossing@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; At two, there&#39;s a kind of tension between a strong desire for autonomy<br/>\n&gt; and a realization that the world is WAY bigger than you are which is<br/>\n&gt; scary.<br/>\n<br/>\n </span></blockquote>This is going off on a tangent! It can be useful to know that &quot;autonomy&quot; often gets used to mean two things rolled together: autonomy itself, in the sense of independent action or decision making and another driving force known as competence. With young children, in particular, it can be hard to tell those things apart - the results of independent actions impact on one&#39;s sense of competence, after all - but it can still be helpful at times to think of them separately. It can give you more ideas, options to try. <br/>\n<br/>\nSo if a child is having trouble with decision making, it could help to look for ways for him to feel more capable in general. Especially a 2yo, who&#39;s going to tend to be More driven by competence than autonomy per se, since he&#39;s still working on mastering his own body. By around 3ish the drive tends to shift a little more in the direction of autonomy, of wanting independent choices, at least in the home.<br/>\n<br/>\nMorgan liked exploring competence from a pretty early age, but she also didn&#39;t want to make a whole lot of decisions. Figuring out How to do things was her focus - how to get her shirt On was a much bigger interest for her than picking one, for instance. Or deciding How to eat a potato was a bigger focus than deciding if it should be warm or cool or sweet or white. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"diana jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] two-year old has difficulty with choices","postDate":"1268341306","msgId":43320,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MTAwMzExMTMwMXZiOTUxZjcwbzMwYzEwZDk5MWNhZmRjYTZAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDgxYTZmNjVmMTAwMzEwMTExMnMzYWY5NTEyMHhjNDZmNTZkYzU1OThlMmFmQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDgxYTZmNjVmMTAwMzEwMTExMnMzYWY5NTEyMHhjNDZmNTZkYzU1OThlMmFmQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":43319,"nextInTopic":43326,"prevInTime":43319,"nextInTime":43321,"topicId":43312,"numMessagesInTopic":0,"msgSnippet":"-=-=-I worry we give him too much choice. What is the right balance? I know at his age there are a lot of frustrations, I want to minimize them for him yet","messageBody":"<div id=\"ygrps-yiv-609518235\">-=-=-I worry we give him too much choice. What is the right balance? I<br/>\nknow at his age there are a lot of frustrations, I want to minimize them for<br/>\nhim yet help him build decision-making skills.-=-=-<br/>\n<br/>\n<br/>\nI was just thinking of my own son&#39;s struggles (he is now 11.5) as a<br/>\ntoddler... many of which stemmed from the same kind of overwhelm with<br/>\nchoices.  *I* thought I was giving him *real* choices (all the toddler<br/>\ndevelopment propaganda said to!) of &quot;Red shirt or Blue shirt&quot; and &quot;Warmed or<br/>\nRegular&quot; but in hindsight and honestly, this technique set is FALSE and set<br/>\nus up for misery every.single.day.<br/>\n<br/>\nWould have been so much better to have continued on our path of trust -- his<br/>\ntrust in me that I know what is comfortable for him to wear and my trust in<br/>\nhis communication about his clothing -- and addressed REAL choices when they<br/>\nreally did come up (once a week &quot;chocolate or twist icecream?&quot;).  Offering<br/>\nclothes, &quot;here&#39;s your blue tee-shirt! All fresh and soft; I know how much<br/>\nyou love it!&quot; is much better with Hayden, even NOW, than &quot;Red or Blue?&quot; (and<br/>\nyes, my boy would also spend a lot of time pining for the unchosen shirt,<br/>\nsure it was the better choice than the one he made...)<br/>\n<br/>\nWith food, I&#39;ve come to realize that a genuine offer is a much easier<br/>\nspringboard for him than an open &quot;choose!&quot; situation.  i.e. &quot;Hey, I&#39;m<br/>\nthinking of making a turkey sandwich, can I make one for you, too?&quot; &quot;Mama&#39;s<br/>\nhaving a warm sweet potato, would you like some too?&quot; From there, he either<br/>\nhas a ready-made idea or a place to begin to make his own.... i.e. &quot;Ooooh,<br/>\ncan I have a PB&J instead?&quot; or &quot;Can I have my sweet potato cold instead?&quot;<br/>\n<br/>\n<br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.wordpress.com<br/>\nhannahsashes.blogspot.com<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":351836297,"authorName":"Amanda Mayan","from":"&quot;Amanda Mayan&quot; &lt;amanda@...&gt;","profile":"amandabpearl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:two-year old has difficulty with choices","postDate":"1268315459","msgId":43319,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNGUwMWNhYzEyMSRlMjdhZjE3MCRhNzcwZDQ1MCRAdXM+"},"prevInTopic":43317,"nextInTopic":43320,"prevInTime":43318,"nextInTime":43320,"topicId":43312,"numMessagesInTopic":0,"msgSnippet":"2 things come to mind..too much choice and different kinds of choices.or executing choice in a different way..2 is a difficult age.for them and for us. 2 is a","messageBody":"<div id=\"ygrps-yiv-705679171\">2 things come to mind..too much choice and different kinds of choices.or<br/>\nexecuting choice in a different way..2 is a difficult age.for them and for<br/>\nus. 2 is a difficult age..they want to do things for themselves.chaos<br/>\ngenerally results. The best is to find some coping mechanisms for the both<br/>\nof you. Some examples from my life.<br/>\n<br/>\nMaya LOVES chosing her own clothing, from a young age (like when she could<br/>\nresist letting me put something on her) I gave her choice.before, everything<br/>\nwas hung and I would lift her up to choose from her closet. As she was more<br/>\nmobile.I put her clothing in drawers she could reach.and she would pull them<br/>\nall out EACH MORNING when she got dressed.to prevent myself from becoming<br/>\nlike a cartoon character with my eyes exploding in rage each time I stopped<br/>\nfolding the clothing. She has a &quot;tops&quot; drawer and a &quot;bottoms&quot; drawer and she<br/>\ngoes in, tears it apart and I just shuffle stuff back if I need to.but she<br/>\ndoesn&#39;t even need my help to do it.<br/>\n<br/>\nOr maybe it&#39;s just overwhelming for him.you could lay out 2 options, and<br/>\nthen if he asks for something specific, get it for him, but at least the<br/>\nchoice is narrowed from the start.<br/>\n<br/>\nSometimes Maya can&#39;t decide what to wear.or she wants shorts and it&#39;s 50<br/>\nout.so we layer.the shorts she wants over or (my preference J) under jeans<br/>\nor long pants.maybe if he can&#39;t decide between shirts he wears both?<br/>\n<br/>\nAlso, maybe a small fridge with &quot;pre-loaded&quot; sippy cups.water, juice,<br/>\nwhatever.so that he can get them for himself.I found an office style fridge<br/>\neasily on freecycle. Also, Maya has a snack drawer that is low so that she<br/>\ncan get into it without my help (though sometimes she asks me to get her<br/>\nsomething anyway.which I happily do) some of the things in her drawer are<br/>\nnuts, M&Ms, rasins, pita chips, cereal, freeze dried apples ect.there is<br/>\nalso fruit on the counter that she can access on her own (but this does not<br/>\nmean that I do not offer her things throughout the day too.it just means she<br/>\ncan do things for herself if she wants)<br/>\n<br/>\nMaybe some of these suggestions will help with his choice challenges. Of<br/>\ncourse, when they have free access to clothes, snacks, ect..there will be<br/>\nmore mess for you to clean up.I remember Maya grabbing a box of fruit loops<br/>\n(which she asked for, tasted, and never touched again) that lived in her<br/>\ndrawer for a while.and dumping them on the floor.while saying, I&#39;m making a<br/>\nmess because I&#39;m mad at you.not my favorite moment ever, but definitely a<br/>\nsafe way for her to express anger and get it out (luckily that was a one<br/>\ntime thing).and then there is just the normal mess of a toddler.but when<br/>\ncleaning after her, I just think about how much better it might be in the<br/>\nlong run.also, whe helps me clean and is starting to not be so &quot;chaotic&quot;<br/>\nwhen getting things for herself!<br/>\n<br/>\n-amanda<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] two-year old has difficulty with choices","postDate":"1268314091","msgId":43316,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ2NjdCRERELUVFQzItNEQ5QS1BNDI3LUU2OUU3Nzg3RUY1MEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDgxYTZmNjVmMTAwMzEwMTExMnMzYWY5NTEyMHhjNDZmNTZkYzU1OThlMmFmQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDgxYTZmNjVmMTAwMzEwMTExMnMzYWY5NTEyMHhjNDZmNTZkYzU1OThlMmFmQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":43312,"nextInTopic":43317,"prevInTime":43315,"nextInTime":43317,"topicId":43312,"numMessagesInTopic":0,"msgSnippet":"... Is there a way that your husband could change that part of your personality to make that bit of life less frustrating for you? Or is his patient","messageBody":"<div id=\"ygrps-yiv-700116164\">On Mar 10, 2010, at 2:12 PM, Sasha ViaSasha wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I myself have difficulties myself making small<br/>\n&gt; decisions such as ordering off a menu or selecting a movie and  <br/>\n&gt; often make my<br/>\n&gt; husband choose.<br/>\n<br/>\n </span></blockquote>Is there a way that your husband could change that part of your  <br/>\npersonality to make that bit of life less frustrating for you?<br/>\n<br/>\nOr is his patient understanding and help what you need to handle the  <br/>\nmoment?<br/>\n<br/>\nIt sounds like your son has your personality quirk and it&#39;s not  <br/>\nmeshing well with some developmental stage that comes with hitting 2.  <br/>\nThere&#39;s probably some bit of how the world works that he had an  <br/>\n&quot;Aha!&quot; moment on. Like a &quot;Wait, when I choose this, I have to *not*  <br/>\nchoose that too?!? And I have to do that for every single choice?!?&quot;<br/>\n<br/>\nThe intensity is because he&#39;s 2 and hasn&#39;t found ways that work for  <br/>\nhim to deal with it. He won&#39;t be 2 forever. But it may take time for  <br/>\nhim to build up strategies.<br/>\n<br/>\nWhat will help him is what helps you when you&#39;re in that state.  <br/>\nUnderstanding, help to deal with the moment, not expecting him to be  <br/>\nother than who he is. Be calm and understanding with an attitude of  <br/>\nyou can get through this together.<br/>\n<br/>\nMaybe rather than trying to give him strategies or fix the problem,  <br/>\nsee yourselves as a team and what you can do together to get through  <br/>\nit. Though it will be mostly you coming up with ideas and doing at  <br/>\nthis point and for many years perhaps. He will watch and absorb what  <br/>\nyou do. You can&#39;t necessarily fix the problem but you can find ways  <br/>\nto get through it. The most important strategy is finding ways to  <br/>\navoid putting him in the position that causes meltdowns. You won&#39;t  <br/>\nprevent them all and that&#39;s not the point. You just want to cut down  <br/>\non them.<br/>\n<br/>\nBut rather than thinking in terms of &quot;I can&#39;t give him choices or  <br/>\nhe&#39;ll melt down,&quot; think in terms of adjusting the world as much as  <br/>\nyou can for him so that it&#39;s something (for the most part) he can  <br/>\nhandle right now. And when he can&#39;t, understanding is probably the  <br/>\nbest thing for him.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:two-year old has difficulty with choices","postDate":"1268314025","msgId":43317,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NkRFREREQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":43316,"nextInTopic":43319,"prevInTime":43316,"nextInTime":43318,"topicId":43312,"numMessagesInTopic":0,"msgSnippet":"At two, there s a kind of tension between a strong desire for autonomy and a realization that the world is WAY bigger than you are which is scary. Then, there","messageBody":"<div id=\"ygrps-yiv-42547745\">At two, there&#39;s a kind of tension between a strong desire for autonomy<br/>\nand a realization that the world is WAY bigger than you are which is<br/>\nscary. Then, there are some people who have to get the &quot;right&quot; choice,<br/>\neven when there&#39;s no right or wrong choice (a blue tshirt or a red<br/>\ntshirt, doesn&#39;t matter much in the overall scheme of things) for<br/>\nwhatever reason (a need to please, fear of disappointing, lots of other<br/>\npossibilities). When DS was younger, he&#39;d often have choosing troubles.<br/>\nMost often, we&#39;d just choose not to choose if at all possible. We also<br/>\ndeveloped sometimes elaborate schemes for &quot;random&quot; choice. For instance,<br/>\nfor the longest time I walked around with 3 of those frilly cocktail<br/>\ntoothpicks in my purse. One with blue frills, one with red, and one with<br/>\nyellow. If DS was having trouble choosing something, we&#39;d try to narrow<br/>\nthings down as best as we could then he&#39;d assign a choice/option to each<br/>\nof the toothpicks. I&#39;d hide the frilly ends in my hand and he&#39;d pick a<br/>\ntoothpick. Then he&#39;d consider if that option was what he wanted - he<br/>\nwasn&#39;t &quot;stuck&quot; with whatever he picked, but it helped him to focus his<br/>\nconsideration on one thing at a time. Sometimes, we&#39;d take advantage of<br/>\nthe fact that restaurants give kids crayons and paper kid menus - we&#39;d<br/>\nput Xs through things one at a time to narrow his choices visibly. It<br/>\nalso helped him sometimes to hear me verbalize my choosing process -<br/>\n&quot;hmm do I want chicken? No I&#39;ve had a lot of chicken lately. Pasta? Too<br/>\nbig. Ah ha! They have a fish that I like, I&#39;ll get that...&quot; Plus, I&#39;d<br/>\nrearrange things - like skip the rice pilaf for extra steamed broccoli<br/>\n(yeah I know I&#39;m mostly using restaurant examples but the process<br/>\napplied to a lot of other situations). Over time it helped him to see<br/>\nthat most things are not as black and white as he thought. If picking<br/>\nout a shirt to wear was difficult at this moment, no problem, stay in<br/>\npjs (or naked) for now, maybe wrap up in a blanket if it&#39;s chilly. I<br/>\nknow you&#39;re saying there&#39;s no rushing to get out the door or anything<br/>\n(which is good) but there may still be a feeling of &quot;have to choose NOW&quot;<br/>\nbecause this is when Mommy is asking. We rarely had a &quot;time to get<br/>\ndressed&quot; or &quot;time to eat&quot; type thing based on the clock when DS was<br/>\nyounger, that only added to his stress level (even if it was a situation<br/>\nof having a set appointment time for something, we&#39;d work with it so<br/>\nthat getting dressed could take an hour or two in little bits and pieces<br/>\nif he needed it that way). In the sweet potato example you gave, what I<br/>\nmight have done would be to say something to the effect of &quot;well, cold<br/>\nis right here now - you can try it that way. We can change it to warm if<br/>\nyou change your mind.&quot; Oh yeah that&#39;s a point I don&#39;t know if I made<br/>\nclear - that sense of A SINGLE RIGHT CHOICE, that once the choice is<br/>\nmade it&#39;s immutable. Very concrete, black and white, set in stone<br/>\nthinking - not uncommon in toddlers and young children. Time is a<br/>\ndefinite factor - developmentally things will change over time.<br/>\nSometimes what it took for DS to choose the red shirt or the blue shirt<br/>\nwas for me to not &quot;offer&quot; either but simply to provide whatever info was<br/>\npertinent (temperature, plans for the day, etc) and then just sit<br/>\nquietly or even leave the room &quot;I&#39;m going to go potty, I&#39;ll be right<br/>\nback&quot; type thing to allow him space to choose without other eyes on him.<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":416532181,"authorName":"Sasha ViaSasha","from":"Sasha ViaSasha &lt;sashaviasasha@...&gt;","profile":"sashaviasasha","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"two-year old has difficulty with choices","postDate":"1268248331","msgId":43312,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgxYTZmNjVmMTAwMzEwMTExMnMzYWY5NTEyMHhjNDZmNTZkYzU1OThlMmFmQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":43316,"prevInTime":43311,"nextInTime":43313,"topicId":43312,"numMessagesInTopic":0,"msgSnippet":"My two year old has recently began to have a lot of trouble with choices. Whether to wear one coat or another, watch one video or another, he genuinely become","messageBody":"<div id=\"ygrps-yiv-371733505\">My two year old has recently began to have a lot of trouble with choices.<br/>\nWhether to wear one coat or another, watch one video or another, he<br/>\ngenuinely become quite hysterical, picking one and then the other, and<br/>\nadamantly insisting on one shirt, but already, while we are still putting<br/>\nthe shirt on, completely losing it and demanding another shirt.  He is very<br/>\nfamiliar with his wardrobe and is not picking from what we show him, but<br/>\nnaming the shirts: &quot;truck shirt,&quot; or &quot;doggie shirt,&quot;.  Sometimes he insists<br/>\non wearing a shirt for several days,which is fine, but if something does<br/>\nneed cleaned it upsets him greatly.  It is not in an environment of rushing<br/>\nout the door where this is happening.  We do not necessarily restrict him to<br/>\none or two choices, but naturally I have to intervene and pick something for<br/>\nhim, and he usually calms down after I have done so, but sometimes he is<br/>\nhysterical for a while. With videos I have begun to hide them because he<br/>\nbecomes such a nervous wreck.  I can see the problem is that he wants to<br/>\nwatch all of the movies!  I myself have difficulties myself making small<br/>\ndecisions such as ordering off a menu or selecting a movie and often make my<br/>\nhusband choose.  With large, important issues I know my mind well.<br/>\n<br/>\nWe want our son to have true choices and I want to guide him but without<br/>\nintervention he just gets more and more distraught.  I think it is about<br/>\ncontrol.  I let him select food for himself, from a pool of available foods,<br/>\nbut there are times when he gets hysterical about the food I am eating, even<br/>\nto the point of trying to take it out of my mouth!  For example, if he can&#39;t<br/>\ndecide whether he wants his sweet potato heated, but I heat mine up and<br/>\noffer both choices, he can eat mommy&#39;s, which is hot, or the other, which is<br/>\ncold, but he is furious at my choice.  Sometimes this becomes so<br/>\noverwhelming for me that I put him in his crib for about 15 minutes and just<br/>\ntry to calm down.  At times it might seem that he is just being difficult<br/>\nbut I think he is overwhelmed by all of the options.  He&#39;ll ask me to bring<br/>\nhim water, but refuse it when I bring it, and then scream when I take it<br/>\naway.  I worry we give him too much choice.  What is the right balance? I<br/>\nknow at his age there are a lot of frustrations, I want to minimize them for<br/>\nhim yet help him build decision-making skills.<br/>\n<br/>\nSasha<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":43311,"nextTopicId":43336}}