{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Baths/showers","postDate":"1269278850","msgId":43465,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvODlhMiszcWEyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDQzk3NENERDMzNjg0RS0xRTRDLUVBNzlAd2VibWFpbC1kMDkwLnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":43449,"nextInTopic":0,"prevInTime":43464,"nextInTime":43466,"topicId":43449,"numMessagesInTopic":0,"msgSnippet":"... ************* Video games have been a great boon in terms of getting my 8yo in one place long enough to do something with her hair. Not that she s always","messageBody":"<div id=\"ygrps-yiv-909803470\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, AECANGORA@... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; As for the 7 yr. old.  I do have a spray bottle and use that to get at the sticky spots between baths some.  It&#39;s just a matter of getting her to stay in one place long enough.<br/>\n </span></blockquote>*************<br/>\n<br/>\nVideo games have been a great boon in terms of getting my 8yo in one place long enough to do something with her hair. Not that she&#39;s always still while playing a video game, but it gives her something to focus on while I deal with hair.<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":132876517,"authorName":"AECANGORA@aol.com","from":"AECANGORA@...","profile":"amy_aec","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"re: Baths/showers","postDate":"1269203593","msgId":43449,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQzk3NENERDMzNjg0RS0xRTRDLUVBNzlAd2VibWFpbC1kMDkwLnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":43465,"prevInTime":43448,"nextInTime":43450,"topicId":43449,"numMessagesInTopic":0,"msgSnippet":"Hi, Thanks Meredith for the tips.  I don t know a lot about dry shampooing.  I will check it out on the web.  Sounds like maybe a good option.  The 9 yr. old","messageBody":"<div id=\"ygrps-yiv-1920667101\">Hi,<br/>\n<br/>\nThanks Meredith for the tips.  I don&#39;t know a lot about dry shampooing.  I will check it out on the web.  Sounds like maybe a good option.  The 9 yr. old does have psoriasis at times, so, when she was younger, I actually tried to limit baths (except early summer mud season) to no more than 2 a week.  We also have those flush-able wipes, so that is an option for daily spot cleaning.  <br/>\n<br/>\nAs for the 7 yr. old.  I do have a spray bottle and use that to get at the sticky spots between baths some.  It&#39;s just a matter of getting her to stay in one place long enough.  I do have to work at consistency with the morning routine.  When we do stick to a routine, I try to make sure to give her a choice between me brushing it or her.   The bath resistance is really the bigger issue.  But, there again,  I probably need to use similar tactics as you suggested with the 9 yr. old. - explain why getting clean is important and then letting her choice when, even if it is in the middle of the day.  <br/>\n<br/>\n<br/>\nAmy<br/>\n<br/>\nBTW (I get my e-mails through digest, so my replies will be delayed!)<br/>\n<br/>\n      --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, AECANGORA@..<br/>\n. wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; DD1 is 9 and is in pre-puberty already, so her hair gets greasy after only 2 days.  She also gets a little fragrant by then.<br/>\n </span></blockquote>****************<br/>\n<br/>\nHave you talked with her about this and how kids at school could react? That&#39;s someplace to start, if you haven&#39;t. <br/>\n<br/>\nThis might sound strange, but it can also help not to start with a &quot;solution&quot; in mind. Kids, just like adults, tend to like to do their own thinking and problem solving, and can be more resistant when you present a problem and solution at the same time. Instead, start by laying out what you perceive to be the issue, and ask if she has some ideas for ways to deal with it. You could come up with a variety of options to help her brainstorm: you could have a bunch of different scented products, for instance, and she&#39;d shower once a week or whatever; she could put her hair in a particular style when it gets greasy, or look into different haircuts entirely; y&#39;all could explore &quot;dry&quot; bathing options like with cornstarch and baking powder, maybe mixed with herbs for girly scentedness; she can wash her pits and crotch every day, and be sure to change underwear and see it that helps the body odor issue. Do you see what I mean? There&#39;s not necessarily one solution, a nd your dd might have even more ideas of her own, once you open the door to discussion.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; DD2 is 7 and can actually go a week if things get too hectic, and we don&#39;t manage to get 2 in.  However, I think 2 a week is better, especially since somehow sticky things often manage to get in the hair that make the ends snarl.<br/>\n </span></blockquote>****************<br/>\n<br/>\nI have an 8yo girl who has some issues with tactile sensitivity *and* a very sensitive scalp. Through this past winter, I focused on helping her pick out clean clothes regularly and that helped a lot - I don&#39;t mean it got her in the tub, I mean most of the dirt and dead skin was on her clothes, so it was fine. Her hair we finally did in &quot;wraps&quot; since even dry washing it was kind of traumatic for her. For sticky things in hair, again you could look into dry washing with cornstarch and baking soda. You might also be able to &quot;spot clean&quot; sticky bits - I&#39;ve done that from time to time with Mo. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;The younger one doesn&#39;t even worry about brushing her hair unless I remind her or do it for her each morning, and, if I&#39;m not on top of things, we end up with a big knot after 3 days.<br/>\n </span></blockquote>**************<br/>\n<br/>\nIf she&#39;s okay with brushing but just needs a reminder - remind her! Put a big note up on the mirror, maybe, or work it into *your* morning routine, somehow - hand it to her when she&#39;s done with breakfast, for instance. If she doesn&#39;t mind you brushing it, that&#39;s something else that could be a regular routine, maybe even something you can do with both girls, a weekly &quot;hair salon&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; I guess the overall question is at what point do we let go and let personal grooming be their responsibility?<br/>\n </span></blockquote>**************<br/>\n<br/>\nIt can help to step away from the idea of &quot;responsibility&quot; and think about what you can do to help them feel good about life and their bodies. Regular battles about grooming won&#39;t do that. Helping them find options that let them feel good *and* feel like they&#39;re the ones making decisions about their own bodies is better in that way. With your 9yo, if she&#39;s feeling like its your way or nothing, she might not tell you about teasing at school - which doesn&#39;t help her! Look for ways to be her ally, someone she can confide in and trust to help her out. Then if, worst case, she does get teased, her ally and confident is there with a shoulder for her to cry on, and some willingness to help her be the author of her own solutions. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":43415,"nextTopicId":43464}}