{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Fw: Some guidance","postDate":"1333667335","msgId":48294,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsbDhtNys1Zmx0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMzM2MTIwMjguOTg0OC5ZYWhvb01haWxOZW9Ad2ViODczMDYubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":48292,"nextInTopic":0,"prevInTime":48293,"nextInTime":48295,"topicId":48284,"numMessagesInTopic":0,"msgSnippet":"... ***************** The World Book encyclopedia publishes a typical course of study for schools in the United Stats. It might help to glance at this and get","messageBody":"<div id=\"ygrps-yiv-488449121\"><blockquote><span title=\"ireply\">&gt; 4.) In regard to my husband. Recently he brought concerns to me askingif the kids will be on track in\tlearning properly. He said he wants to make sure they are growing and being educated at\ta good pace.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nThe World Book encyclopedia publishes a typical course of study for schools in the United Stats. It might help to glance at this and get a sense of how much your kids have already picked up. It can be surprising to realize how much of the material covered in schools is general knowledge, the kinds of things kids learn playing games, watching tv, looking things up on the internet, and talking to other people. <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.worldbook.com/typical-course-of-study\">http://www.worldbook.com/typical-course-of-study</a><br/>\n<br/>\nYou can also use it as an idea list for strewing! Doing some strewing may help with your feelings of stagnation. Here&#39;s a page of links to more pages with lots of ideas about what sorts of things you could strew, both in terms of &quot;stuff&quot; and experiences - most of it low cost, too:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strewing\">http://sandradodd.com/strewing</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 3.) I have concerns of my struggles with affection. ... Are there suggestions from others who might have also struggled with this? <br/>\n </span></blockquote>**************<br/>\n<br/>\nKeep reminding yourself! It&#39;s normal for adults to sort of continually &quot;deschool&quot; from childhood baggage as your kids get older and push old buttons you had forgotten were there. <br/>\n<br/>\nHere&#39;s a page on the 5 Love Languages which might be helpful in terms of thinking about the various ways you can express affection and the different ways your kids might perceive it: <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mesacc.edu/dept/d46/psy/dev/Spring99/schoolage/love.html\">http://www.mesacc.edu/dept/d46/psy/dev/Spring99/schoolage/love.html</a><br/>\n<br/>\nAs someone else mentioned, some people aren&#39;t as huggie as others - but if your kids aren&#39;t, either, it might actually be better for them if you&#39;re not trying to hug and instead looking for other ways to help them feel warm and fuzzy. It could be that livening up your lives a little will help in more than one way - in fact, I see all the things you listed as being connected.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 5.)  I worry about social experiences and my failing to offer them things that interest them....<br/>\n&gt; They seem so happy to just be at home playing with siblings.<br/>\n<br/>\n </span></blockquote>Happy is good! Mo is an introvert and when Ray is around a lot she gets most of her &quot;social&quot; needs filled just from him. There was a time when he was home most of the time when she really didn&#39;t want to go out at all - she had more than enough social interaction at home. It&#39;s Okay if your kids are getting what they need from each other! Really. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;they have not had the chance to make friends with other kids (the older two have expressed wishing to do that).  <br/>\n </span></blockquote>***************<br/>\n<br/>\nWhat sorts of things are they interested in? Maybe someone can toss out some ideas. <br/>\n<br/>\nBut something to consider is the gap between wish and fulfillment, especially where other people are concerned. &quot;Other kids&quot; may not be a good target group for them to make friends with, especially if those other kids are in school or homeschooling and have a different sort of relationship with their families as a result. That was something Ray ran into once he&#39;d been out of school for awhile. He wanted friends his own age, but couldn&#39;t really related to kids his own age - his life was too different. So he looked for friends a few years older, got involved in the sorts of things young adults do, and made friends that way. <br/>\n<br/>\nIn a similar vein, my daughter really wanted girl friends for a while, but of all the kids she has met, locally she only gets along with one girl. Actually, that&#39;s nearly true at the unschooling gatherings we go to, as well. She gets along with far fewer girls than boys. <br/>\n<br/>\nI wouldn&#39;t say that to your kids in a discouraging way, rather encourage them to connect with people who share their interests and let them know - gently - that it&#39;s okay if the only people they seem to connect with are much older or younger.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":163621138,"authorName":"odiniella","from":"&quot;odiniella&quot; &lt;hgaimari@...&gt;","profile":"odiniella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Fw: Some guidance","postDate":"1333649266","msgId":48292,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsa24xaStnNDhvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMzM2MTIwMjguOTg0OC5ZYWhvb01haWxOZW9Ad2ViODczMDYubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":48284,"nextInTopic":48294,"prevInTime":48291,"nextInTime":48293,"topicId":48284,"numMessagesInTopic":0,"msgSnippet":"Mind if I try my hand at this?  I do hope those with more experience and finesse will correct any thinking that doesn t reflect the ideal behind radical","messageBody":"<div id=\"ygrps-yiv-792446744\">Mind if I try my hand at this?  I do hope those with more experience and<br/>\nfinesse will correct any thinking that doesn&#39;t reflect the ideal behind<br/>\nradical unschooling. I&#39;ll leave my answers in blue.<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Schuyler &lt;s.waynforth@...&gt;<br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I was asked to post this to the group anonymously.<br/>\n&gt; Schuyler<br/>\n&gt; ------------------------------------------------------------------<br/>\n&gt;<br/>\n&gt; I am a Mom of 4, ages 2.5, 5, 8 and 10.<br/>\n&gt;<br/>\n&gt; 1.)  I have a 5 year old son who adores the Lego Star Wars games. We<br/>\n </span></blockquote>have them on Xbox 360, DS and Wii, he plays alone and with all of us in<br/>\nthe family. We have a few of the Star Wars DK Chapter books and some of<br/>\nthe larger chunky Lego DK picture books/lego character guides. We have<br/>\nlight sabers, laser guns and some of the lego sets and mini figures. I&#39;m<br/>\nhoping to be able to get him some of the larger action figures soon. I&#39;m<br/>\nlooking for suggestions of other things that have that Star Wars flair<br/>\nthat I may not know about which he might find enjoyable.<br/>\n<br/>\nMy kids found project ideas on youtube.  They took things like nerf guns<br/>\nand made them look steampunk.  I&#39;m willing to be there are youtube<br/>\nvideos your kids could watch that will give them some ideas of how to<br/>\nmake everything from costumes to artillery to &quot;machines&quot; out of things<br/>\nyou might have around the house or can find cheaply at walmart.  <br/>\nFreecycle is another source for odds and ends like toys, machines that<br/>\ncan be taken apart and even cardboard boxes (my kids had a TARDIS in the<br/>\nliving room for weeks following the procurement of a cardboard box that<br/>\nonce contained a refrigerator).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; 2.) How does Mom go about keeping things interesting? Being<br/>\n </span></blockquote>interesting and fun I mean? When you feel like you are in a rut and<br/>\nfeeling you are.... well... on the boring side? I seem to have lost my<br/>\ncreativity and my fun side after a crazy move we experienced and am<br/>\nhaving trouble getting back to &quot;fun&quot; Mom again. What types of fun things<br/>\ncan I do to liven things up again?<br/>\nI&#39;m a boring person, too, I&#39;m just sure of it.  However, my kids are<br/>\nexperts in their fields of interest.  Giving one room to be the expert<br/>\nmakes one feel important, valuable.  I think that&#39;s the goal of being<br/>\nfun with them, right?  Showing them you value their company?  I just<br/>\ndon&#39;t think you have to go about it through entertaining them but by<br/>\ngenuinely valuing them and that comes through by valuing what they<br/>\nvalue.  At this age it may look like being the expert in an imaginative<br/>\nfabrication that only makes sense to them, but the more you involve<br/>\nyourself with their interests, the more you learn, the more interesting<br/>\nit does become. And they see that.  I was surprised to see my kids take<br/>\nan interest in *my* interests after I had learned to genuinely<br/>\nappreciate theirs.  I haven&#39;t converted them to mine and they haven&#39;t<br/>\nconverted me to theirs and that has never been the goal, but they know<br/>\nmore about my interests and thus more about me, and I about them.  They<br/>\nfeel valued because they are valued.  They are the experts in whatever<br/>\nthing interests them, from guitar hero on wii to the neurology of<br/>\nepilepsy.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Also how do I set myself aside and be more present with them during<br/>\n </span></blockquote>the day and be less focused on doing my own thing? I try to do something<br/>\none on one with each child. It&#39;s much easier to do that with the littles<br/>\nthan with the older two. I do try to take one of the older girls out of<br/>\nthe house with me each time I go, sometimes we go to breakfast, get a<br/>\ntreat or have a coffee.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; And I think a second part to this would be unschooling on a budget. We<br/>\n </span></blockquote>have a family of six on one income and we are saving to buy a home so<br/>\ndoing things that are costly in our area are not doable right now. I<br/>\nguess I worry because I read about some unschoolers who are RVing around<br/>\nthe country or taking all these fantastic day trips and I feel badly<br/>\nthat we are not in a position to offer that kind of adventure to our<br/>\nchildren.<br/>\n<br/>\nFor a long while I put anything I was doing aside for the attention for<br/>\nwhatever child asked it.  I still do, but not as much simply because,<br/>\nwell, I&#39;m not sure why.  A couple reasons I guess.  Anyway, it<br/>\nestablished a nice piece of information for me - nothing I was doing was<br/>\nso important it had to be done that minute (for the most part).  After<br/>\nspending time with my kids, they happily spent time with me while I did<br/>\nthings that needed to get done (laundry, making dinner, etc) and even<br/>\nhelped.  If they were lost in their own projects, I could work quickly<br/>\nwithout distraction.  I found it unnecessary to allot certain times of<br/>\nthe day per child but attended to their needs as they presented<br/>\nthemselves and I interpret their wanting attention from me as a need for<br/>\nmany reasons.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; 3.) I have concerns of my struggles with affection. I don&#39;t have any<br/>\n </span></blockquote>trouble showing affection when my children are babies/toddlers. But I<br/>\nseem to struggle to show physical affection to my older children and<br/>\nhave to really mentally remind myself to give many hugs, or give this<br/>\nmany kisses. I know it&#39;s based on things from my own childhood and not<br/>\nwanting adults to come into my personal space because of things I<br/>\nexperienced. Are there suggestions from others who might have also<br/>\nstruggled with this?<br/>\n<br/>\nHa!  Some of us are just like that. I come from a family and community<br/>\nthat figures if you&#39;re standing on the same carpet you&#39;re close enough,<br/>\nthankyouverymuch.  I married an extremely affectionate man.  It still<br/>\ncatches me off guard sometimes and his relationship with the kids shines<br/>\nbecause of it.  For all the talk of teenagers being rebellious, I don&#39;t<br/>\nexperience that in my home and I think a part of that is they experience<br/>\nan affectionate father constantly.  I have to remember to be more<br/>\naffectionate as well, but things like holding hands or rubbing a<br/>\nshoulder works for me.  I can&#39;t do more than I can do and it&#39;s not a<br/>\nmatter of refusing, it&#39;s simply a matter of those ideas not coming to my<br/>\nbrain.  But...I do drop everything for my kids when they ask and I am<br/>\ntheir biggest supporter, and I think that shows affection in a way as<br/>\nwell.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; 4.) In regard to my husband. Recently he brought concerns to me<br/>\n </span></blockquote>askingif the kids will be on track in learning properly. He said he<br/>\nwants to make sure they are growing and being educated at a good pace.<br/>\nThat they are not confronted with something they have not heard of. And<br/>\nthat they are not playing games all day. He is not big on reading though<br/>\nwe have many books on hand about unschooling, so I&#39;ve strewn them about<br/>\nin case he opts to pick one up. But I would like to be able to help ease<br/>\nhis concerns but I&#39;m not sure how to do so. It&#39;s hard as he is the one<br/>\nworking all day so he&#39;s not seeing how things are on a daily basis. It&#39;s<br/>\nhard for him to see play as learning also.<br/>\n<br/>\nWhen I first looked into unschooling I kept coming across the phrase<br/>\n&quot;trust the child.&quot;  It didn&#39;t make sense to me and I wracked my brain<br/>\ntrying to figure it out.  Why would I trust my 12 yo when they don&#39;t<br/>\nknow what to do?  I have since come to the conclusion that children<br/>\nlearn through play.  That&#39;s 0ne thing that can be trusted.  It&#39;s a known<br/>\nfact and there are all kinds of researches to explain this in detail for<br/>\nthose who are curious for more.  Play teaches all kinds of things, from<br/>\nthose skills we traditionally think of as academic (math, language arts,<br/>\nscience, etc), but also social skills, something I think is underrated<br/>\nbecause it&#39;s not easily identified.  Social skills include the skills of<br/>\nsolving problems effectively and in a socially appropriate manner.<br/>\n<br/>\n   By effectively I mean, they solve the problem without creating new<br/>\nproblems for the individual or others.  Being &quot;selfish&quot; is a problem<br/>\nsolving technique that creates problems for others, that&#39;s why it&#39;s not<br/>\neffective, that&#39;s why we teach our children to resolve conflicts with<br/>\nmutual respect.  A community works better that way.   Social skills also<br/>\nincludes identifying the problem in the first place.  I think that&#39;s a<br/>\nbig reason people don&#39;t know how to resolve conflict - they don&#39;t<br/>\nidentify the root problem, but a surface problem, and they don&#39;t<br/>\nidentify a potential problem it could cause someone else.  Children<br/>\nplaying work this out naturally,  especially when a parent is nearby to<br/>\nhelp everyone take a deep breath and think about what&#39;s going wrong, how<br/>\ncan it go right.  A ten year old who can work out conflict with his<br/>\nbrother matures into a 20 year old who can work out conflict with a<br/>\ncoworker, one who can predict what is needed to solve a problem and take<br/>\ninitiative without creating more problems for others.<br/>\n<br/>\n  Information, like knowing what capitalism is or who Stalin was or<br/>\nwhat&#39;s the big deal about health care, comes with being exposed to<br/>\ninformation.  It&#39;s not hard to run off on tangents when discovering<br/>\nsomething new, these tangents run together until a tapestry of knowledge<br/>\nis seen to be woven in the child&#39;s mind.  Unschooling isn&#39;t about just<br/>\nletting the kids play but exposing them to as many rich experiences as<br/>\nyou can.   If you do this within the framework of their interests<br/>\n(science fiction), the information they will gain will be a wonderful<br/>\nfoundation for more information as they mature.<br/>\n<br/>\nAs kids mature, their play matures.  They won&#39;t be playing this way for<br/>\nlong.  They will be intrigued by something new, whether it builds on<br/>\nthis interest or is completely different.  By the time they&#39;re teens,<br/>\ntheir play will look more conducive to being self-sufficient, joyful<br/>\nadults.  That&#39;s the thing to trust - human development hard-wires us to<br/>\nseek autonomy as much as social connections.  Your kids will want to<br/>\nspread their wings and explore the wide world as they mature.  As kids<br/>\nwho have learned to identify potential problems and solutions that don&#39;t<br/>\ncreate new problem for themselves or others, they&#39;ll solve those<br/>\nproblems related to how to explore the wide world in a way that suits<br/>\ntheir own interests.    I think this is the reason unschoolers encourage<br/>\nothers to trust their kids&#39; choices.  These choices reflect a need<br/>\nunique to the child that fits in the process of maturity and budding<br/>\nautonomy and increasing social relations.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; 5.)  I worry about social experiences and my failing to offer them<br/>\n </span></blockquote>things that interest them.<br/>\n<blockquote><span title=\"ireply\"> &gt; Examples would be:<br/>\n&gt; 1. Going to the park days offered by a local homeschool group. These<br/>\n </span></blockquote>tend to be hit or miss and mostly younger kids. My 10 year old plays<br/>\nwell with the younger kids and loves her siblings but wishes some of the<br/>\nkids were closer to her age.<br/>\n<blockquote><span title=\"ireply\"> &gt; 2. Our attempts at 4-H. When we showed to the first class, the other<br/>\n </span></blockquote>members were older teens and adults and no one near my kids ages. This<br/>\nhappened with the garden club and with a small animal club as well. And<br/>\nthat turned them off to trying anything else.<br/>\n<blockquote><span title=\"ireply\"> &gt; 3. The kids group at our church. They attempted it once and they<br/>\n </span></blockquote>refused to be a part of silly songs and games (their wording). They told<br/>\nus that they preferred being with my husband and I in the family<br/>\nservices and hearing about the bible and hearing the band.<br/>\n<blockquote><span title=\"ireply\"> &gt; 4. Offers to take classes like pottery or other art related offering.<br/>\n </span></blockquote>They decline and prefer doing pottery and art at home.<br/>\n<blockquote><span title=\"ireply\"> &gt; They seem so happy to just be at home playing with siblings. But I<br/>\n </span></blockquote>worry about it just the same that I am failing them by not being able to<br/>\noffer them more to choose from and that they have not had the chance to<br/>\nmake friends with other kids (the older two have expressed wishing to do<br/>\nthat).<br/>\n<br/>\n<br/>\nOkay, I&#39;ll cry Uncle here.  I&#39;m finding the same challenges with my<br/>\nkids.  There are precious few homeschoolers and my kids connect with<br/>\neven fewer of them.  My daughter wants to go to public school next year<br/>\nbecause she&#39;s bored (she just revealed this to me).  I don&#39;t have a<br/>\nproblem with school and the one she wants to go to is a<br/>\nscience/technology project-based school so I would think it would be<br/>\ninteresting.  However, I think it will come as a challenge to her in<br/>\nways she will not be able to solve.  I hate to see her set herself up<br/>\nfor failure so I&#39;m scrambling to find things in our area that will give<br/>\nher a sense of productivity, but I think ultimately it comes to not<br/>\nhaving enough friends.  Oh, sorry to have dumped on your thread.  I just<br/>\nmean to say, I don&#39;t know and I will await idea with you.<br/>\n<br/>\nAll the best!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Fw: Some guidance","postDate":"1333612028","msgId":48284,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzM2MTIwMjguOTg0OC5ZYWhvb01haWxOZW9Ad2ViODczMDYubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PGpsaXAwdCszczFlQGVHcm91cHMuY29tPg==","referencesHeader":"PGpsaXAwdCszczFlQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":48292,"prevInTime":48283,"nextInTime":48285,"topicId":48284,"numMessagesInTopic":0,"msgSnippet":"I was asked to post this to the group anonymously.  Schuyler ... I am a Mom of 4, ages 2.5, 5, 8 and 10.  1.)  I have a 5 year old son who adores the Lego","messageBody":"<div id=\"ygrps-yiv-1297124289\">I was asked to post this to the group anonymously. <br/>\nSchuyler<br/>\n------------------------------------------------------------------<br/>\n<br/>\nI am a Mom of 4, ages 2.5, 5, 8 and 10. <br/>\n<br/>\n1.)  I have a 5 year old son who adores the Lego Star Wars games. We have them on Xbox 360, DS and Wii, he plays alone and with all of us in the family. We have a few of the Star Wars DK Chapter books and some of the larger chunky Lego DK picture books/lego character guides. We have light sabers, laser guns and some of the lego sets and mini figures. I&#39;m hoping to be able to get him some of the larger action figures soon. I&#39;m looking for suggestions of other things that have that Star Wars flair that I may not know about which he might find enjoyable.<br/>\n<br/>\n2.) How does Mom go about keeping things interesting? Being interesting and fun I mean? When you feel like you are in a rut and feeling you are.... well... on the boring side? I seem to have lost my creativity and my fun side after a crazy move we experienced and am having trouble getting back to &quot;fun&quot; Mom again. What types of fun things can I do to liven things up again? <br/>\n<br/>\nAlso how do I set myself aside and be more present with them during the day and be less focused on doing my own thing? I try to do something one on one with each child. It&#39;s much easier to do that with the littles than with the older two. I do try to take one of the older girls out of the house with me each time I go, sometimes we go to breakfast, get a treat or have a coffee. <br/>\n<br/>\nAnd I think a second part to this would be unschooling on a budget. We have a family of six on one income and we are saving to buy a home so doing things that are costly in our area are not doable right now. I guess I worry because I read about some unschoolers who are RVing around the country or taking all these fantastic day trips and I feel badly that we are not in a position to offer that kind of adventure to our children.  <br/>\n<br/>\n3.) I have concerns of my struggles with affection. I don&#39;t have any trouble showing affection when my children are babies/toddlers. But I seem to struggle to show physical affection to my older children and have to really mentally remind myself to give many hugs, or give this many kisses. I know it&#39;s based on things from my own childhood and not wanting adults to come into my personal space because of things I experienced. Are there suggestions from others who might have also struggled with this? <br/>\n<br/>\n4.) In regard to my husband. Recently he brought concerns to me askingif the kids will be on track in\tlearning properly. He said he wants to make sure they are growing and being educated at\ta good pace. That they are not confronted with something they have\tnot heard of. And that they are not playing games\tall day. He is not big on reading though we have many books on hand about unschooling, so I&#39;ve strewn them about in case he opts to pick one up. But I would like to be able to help ease his concerns but I&#39;m not sure how to do so. It&#39;s hard as he is the one working all day so he&#39;s not seeing how things are on a daily basis. It&#39;s hard for him to see play as learning also. <br/>\n<br/>\n5.)  I worry about social experiences and my failing to offer them things that interest them. <br/>\nExamples would be: <br/>\n1. Going to the park days offered by a local homeschool group. These tend to be hit or miss and mostly younger kids. My 10 year old plays well with the younger kids and loves her siblings but wishes some of the kids were closer to her age. <br/>\n2. Our attempts at 4-H. When we showed to the first class, the other members were older teens and adults and no one near my kids ages. This happened with the garden club and with a small animal club as well. And that turned them off to trying anything else. <br/>\n3. The kids group at our church. They attempted it once and they refused to be a part of silly songs and games (their wording). They told us that they preferred being with my husband and I in the family services and hearing about the bible and hearing the band. <br/>\n4. Offers to take classes like pottery or other art related offering. They decline and prefer doing pottery and art at home. <br/>\nThey seem so happy to just be at home playing with siblings. But I worry about it just the same that I am failing them by not being able to offer them more to choose from and that they have not had the chance to make friends with other kids (the older two have expressed wishing to do that).  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":48235,"nextTopicId":48248}}