{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":288405080,"authorName":"diana jenner","from":"&quot;diana jenner&quot; &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: need some fresh ideas or maybe even guidance","postDate":"1182549142","msgId":24645,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDcwNjIyMTQ1MnQ2NmMyNzdjNXVjMTcxNjAxMTQxMmE0ODVkQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDM3Njk0Ny4zOTk4Ni5xbUB3ZWIyNzMwMy5tYWlsLnVrbC55YWhvby5jb20+","referencesHeader":"PDM3Njk0Ny4zOTk4Ni5xbUB3ZWIyNzMwMy5tYWlsLnVrbC55YWhvby5jb20+"},"prevInTopic":24644,"nextInTopic":0,"prevInTime":24644,"nextInTime":24646,"topicId":24615,"numMessagesInTopic":0,"msgSnippet":"A little perspective shift for ya. You *do* have enough, really! I dub thee: Abundant Mommy  :) Sometimes it just helps to remind yourself that it s not about","messageBody":"<div id=\"ygrps-yiv-256775092\">A little perspective shift for ya. You *do* have enough, really! I dub thee:<br/>\nAbundant Mommy  :)<br/>\nSometimes it just helps to remind yourself that it&#39;s not about 100%, 100% of<br/>\nthe time; for me it&#39;s about giving whatever I&#39;ve got 35% or 89% or 64%-- I<br/>\ngive what I got and there&#39;s *always* PLENTY MORE WHERE THAT CAME FROM.<br/>\nAbundant Patience<br/>\nAbundant Love<br/>\nAbundant Joy<br/>\n:::du, da, du::: Abundant Mommy<br/>\n<br/>\n(This specific perspective change comes to me via Ren & one of her wonderful<br/>\ntalks at Live and Learn!! Thanks chickie :)<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 6/22/07, sharon currie &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lyeping2607@...\">lyeping2607@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   Hi Geneva,<br/>\n&gt;<br/>\n&gt; I do agree with everyone. Lack of rest is your number one enemy, exhaution<br/>\n&gt; can be a very difficult thing to overcome, on your own. It seems everybody<br/>\n&gt; is wanting a piece of you but you&#39;re too tired to &#39;give&#39; any. Your kids is<br/>\n&gt; probably picking up your tension and is responding to it big time. The best<br/>\n&gt; way for all concern is to be doing something happy and fun. They need some<br/>\n&gt; attention and fun to distract them and you need time and space to yourself ,<br/>\n&gt; to de-stress, sleep and re-energize. If your husband has holidays to take<br/>\n&gt; from work, this is the time for him to consider taking a day or 2 off. I too<br/>\n&gt; goes thru lousy days whereby the day seems too long and too up hill to even<br/>\n&gt; contemplate and I only have one kid, and you have 3! My husband will take<br/>\n&gt; Thursday and Friday, leading into the weekend, to help give me a chance to<br/>\n&gt; rest. So maybe your husband can do the same, take the kids off your hands<br/>\n&gt; for a few day. The house can be a mess(not important), meals can be had<br/>\n&gt; outside(i<br/>\n&gt; don&#39;t think anybody will be malnorished surviving on sandwiches for the<br/>\n&gt; next few day with daddy, maybe daddy can get them to even make thier own<br/>\n&gt; sandwich) In fact you shouldn&#39;t really worry what they eat the next few<br/>\n&gt; days, as it&#39;s daddy&#39;s job to ensure they are fed, and water, and washed, and<br/>\n&gt; so tired that they will gladly go to bed! I would suggest daddy take them<br/>\n&gt; all (except baby as daddy hasn&#39;t got milky breast LOL!) to parks, from<br/>\n&gt; morning till evening considering it&#39;s summer time now, everyday, for the<br/>\n&gt; next few days! Maybe dad can be adventurous and take them to different park<br/>\n&gt; evryday.<br/>\n&gt;<br/>\n&gt; Hope you&#39;ll be yourself again, revived enough climb a mountain with your<br/>\n&gt; kid<br/>\n&gt;<br/>\n<br/>\n<br/>\n-- <br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":274933479,"authorName":"sharon currie","from":"sharon currie &lt;lyeping2607@...&gt;","profile":"lyeping2607","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: need some fresh ideas or maybe even guidance","postDate":"1182546119","msgId":24644,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM3Njk0Ny4zOTk4Ni5xbUB3ZWIyNzMwMy5tYWlsLnVrbC55YWhvby5jb20+"},"prevInTopic":24621,"nextInTopic":24645,"prevInTime":24643,"nextInTime":24645,"topicId":24615,"numMessagesInTopic":0,"msgSnippet":"Hi Geneva, I do agree with everyone. Lack of rest is your number one enemy, exhaution can be a very difficult thing to overcome, on your own. It seems","messageBody":"<div id=\"ygrps-yiv-438368833\">Hi Geneva,<br/>\n   <br/>\n  I do agree with everyone. Lack of rest is your number one enemy, exhaution can be a very difficult thing to overcome, on your own. It seems everybody is wanting a piece of you but you&#39;re too tired to &#39;give&#39; any. Your kids is probably picking up your tension and is responding to it big time. The best way for all concern is to be doing something happy and fun. They need some attention and fun to distract them and you need time and space to yourself , to de-stress, sleep and re-energize. If your husband has holidays to take from work, this is the time for him to consider taking a day or 2 off.  I too goes thru lousy days whereby the day seems too long and too up hill to even contemplate and I only have one kid, and you have 3! My husband will take Thursday and Friday, leading into the weekend, to help give me a chance to rest. So maybe your husband can do the same, take the kids off your hands for a few day. The house can be a mess(not important),  meals can be had outside(i<br/>\n don&#39;t think anybody will be malnorished surviving on sandwiches for the next few day with daddy, maybe daddy can get them to even make thier own sandwich) In fact you shouldn&#39;t really worry what they eat the next few days, as it&#39;s daddy&#39;s job to ensure they are fed, and water, and washed, and so tired that they will gladly go to bed! I would suggest daddy take them all (except baby as daddy hasn&#39;t got milky breast LOL!) to parks, from morning till evening considering it&#39;s summer time now, everyday, for the next few days! Maybe dad can be adventurous and take them to different park evryday. <br/>\n   <br/>\n  Hope you&#39;ll be yourself again, revived enough climb a mountain with your kids. <br/>\n   <br/>\n  All the best.<br/>\n   <br/>\n  With best wishes,<br/>\n  SharonC<br/>\n   <br/>\n    <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\n Yahoo! Mail is the world&#39;s favourite email. Don&#39;t settle for less, sign up for your freeaccount today.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":156418579,"authorName":"dana_burdick","from":"&quot;dana_burdick&quot; &lt;DanaBurdick@...&gt;","profile":"dana_burdick","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: need some fresh ideas or maybe even guidance","postDate":"1182485847","msgId":24621,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1ZmlnbitnMmg4QGVHcm91cHMuY29tPg=="},"prevInTopic":24617,"nextInTopic":24644,"prevInTime":24620,"nextInTime":24622,"topicId":24615,"numMessagesInTopic":0,"msgSnippet":"Hi there, ... the ... to ... screaming, ... was ... insight. Things sound rough and I second the sleep deprivation issue.  It can be SO big and should not be","messageBody":"<div id=\"ygrps-yiv-260540849\">Hi there,<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I will checkback here later and any questions I can answer to make <br/>\n </span></blockquote>the<br/>\n<blockquote><span title=\"ireply\"> &gt;picture clearer, lmk and any advice, ideas or insight you would like <br/>\n </span></blockquote>to<br/>\n<blockquote><span title=\"ireply\"> &gt;share will be welcome and appreciated.<br/>\n<br/>\n&gt;I feel a lot like my own mother lately and she was a huge mess of <br/>\n </span></blockquote>screaming,<br/>\n<blockquote><span title=\"ireply\"> &gt;empty threats, low self opinion and detached parenting.not the way I <br/>\n </span></blockquote>was<br/>\n<blockquote><span title=\"ireply\"> &gt;planning to go. Thanks in advance for reading this far and for any <br/>\n </span></blockquote>insight.<br/>\n<br/>\n<br/>\nThings sound rough and I second the sleep deprivation issue.  It can <br/>\nbe SO big and should not be overlooked as the larger chunk of your <br/>\nfrustration.<br/>\n<br/>\nPerhaps after you get some sleep you could consider the following.  <br/>\nThere are a few things that popped out at me as I read your post: <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;We do have some rules<br/>\n&gt;here but they are very basic, I do not consider myself a controlling<br/>\n&gt;parent.dh isn&#39;t either.<br/>\n<br/>\n </span></blockquote>How do you police these rules?  How do you watch your children to <br/>\nmake sure they are following these rules?  How do you insure that the <br/>\nrules are handled consistently between your husband and you?  How do <br/>\nyou handle situations when a rule has been broken?  Do you have a <br/>\nform of punishment?  How do you make sure that the rules apply <br/>\nequally among your children?  <br/>\n<br/>\nAs first glance a few rules sound innocent enough, but rules quickly <br/>\nbecome a complicated business especially as the kids get older.  This <br/>\ncombined with your comment about your husband being the &quot;fun&quot; parent <br/>\nsounds like you may feel like someone has to be the bad guy or at <br/>\nleast, the serious parent.<br/>\n<br/>\nThis is probably not your immediate concern, but it might be a bigger <br/>\naggravator than it appears to you right now.  I&#39;m sure you are all <br/>\nversed on thinking in terms of principles and not rules, but you <br/>\nmight reconsider your decision to keep rules.<br/>\n<br/>\n <br/>\nI don&#39;t know the exact dynamic between you and your children when <br/>\nthey fight, but you might find as you reach more toward fulfilling <br/>\nneeds instead of finding fault, that your children will fight less.  <br/>\nIt&#39;s all in how you view your children&#39;s disagreements.  If you have <br/>\nmodeled that there is someone at fault in an argument, your children <br/>\nmay try to resolve a disagreement by finding the `good guy&#39;.  Since <br/>\neveryone wants to be a good guy, fighting will result.   In the case <br/>\nof one child hitting another, if you ask who hit first, you further <br/>\ninstill the need in the children to come up on top.  Your child might <br/>\nthink, &quot;Let&#39;s see, I hit first, so I&#39;m the bad guy here.  But, wait a <br/>\nminute.  I want to be the good guy, so I need to defend myself.&quot;  <br/>\nYour other child who did not hit first thinks, &quot;Yea!  I&#39;m the good <br/>\nguy this time.&quot;  He then proceeds to say, &quot;He did it, he did it <br/>\nfirst!&quot;  None of this is very satisfying for anybody and in an effort <br/>\nto settle it, your left feeling like a bad guy yourself.  Yucky!<br/>\n<br/>\n<br/>\nAs I&#39;m sure you know in these situations, you have to look at change <br/>\nin yourself before you can see change in others.  The cool thing is, <br/>\nyou _do_ have the power to control what you do next.  And, it doesn&#39;t <br/>\neven require doing anything or making someone else do anything.  All <br/>\nyou have to do is change your thoughts.  I suggest you stop right now <br/>\nand see yourself as the good guy.  Your not the good guy some of the <br/>\ntime, but ALL of the time.  For that matter, your children are good <br/>\nguys ALL of the time too.   With no bad guys around, there are no <br/>\nucky-blucky feelings and all that is left are needs.<br/>\n<br/>\n<br/>\nAnd this is sort of a tricky one; think of being totally and utterly <br/>\nselfish when things are at their worst.  I don&#39;t mean like taking a <br/>\nbubble bath, but think selfishly in the moment.  When your daughter <br/>\ncalls you stupid and spits on you, I imagine that it is very <br/>\npainful.  As you mentioned, you think about how she needs you and how <br/>\nshe needs more positive attention from you.  At first glance it <br/>\nappears that your concern is all about her, but with closer <br/>\nexamination it is clear that it is all about you (isn&#39;t it always <br/>\nabout us &lt;bwg&gt;).  &quot;_I_ don&#39;t have attention to spare,&quot; you said. &quot;_I_ <br/>\ncan&#39;t do more.&quot;  You are already thinking selfishly, but it is in a <br/>\nstressful and negative way.  Go ahead let it be about you, but <br/>\ninstead, try to turn it around.  &quot;I am a `good guy&#39; and I am the best <br/>\nperson for this child.  My daughter is a `good guy&#39; too and she is <br/>\nresourceful even if I am not there every single moment.&quot;  In this <br/>\nway, your daughter will feel your positive attention, even if it is <br/>\nnot direct time spent with her. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I feel stressed, frazzled, worn out and like I have nothing to<br/>\n&gt;offer these kids.<br/>\n<br/>\n </span></blockquote>Is this true from your children&#39;s point of view?  If someone asked <br/>\nyour children&#39;s opinion, would they say the same thing, &quot;Oh yeah, my <br/>\ndaddy, he&#39;s the fun guy around here.  My mom, well, she doesn&#39;t have <br/>\nanything to offer.&quot;  I suggest trying to see yourself through your <br/>\nchildren&#39;s eyes.  You might find someone who is extraordinarily <br/>\ncaring and sensitive.  You might find a real person with real <br/>\nfeelings.   You might find someone who you want to reach out to and <br/>\nhelp.  There is nothing more empowering than allowing a child to help <br/>\nyou.  I don&#39;t mean help as in asking your four year old to do the <br/>\ndishes.  I mean more of an openness to accepting their love for you, <br/>\nespecially when you are needing moral support. They are amazing <br/>\nlittle beings that can give you strength even as you are helping them.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;This week I have<br/>\n&gt;hired a mommys helper to help with the mess left from the party and <br/>\n </span></blockquote>I have<br/>\n<blockquote><span title=\"ireply\"> &gt;also taken time to myself to get a haircut, shop and nurture my own <br/>\n </span></blockquote>spirit<br/>\n<blockquote><span title=\"ireply\"> &gt;so that I can be 100% for them.<br/>\n<br/>\n </span></blockquote>This sounds great; obviously you are making use of the resources you <br/>\nknow you need.  The 100% is a red flag though.  Who said we ever had <br/>\nto be 100% for anybody.  Perhaps you could find that at the Perfect <br/>\nMommy Store &lt;bwg&gt;.  You are human and your children love you at 100% <br/>\nand 50% and 3%.  &lt;IMO&gt; If you need to be 100%, be 100% for yourself.  <br/>\nAll the rest will follow - really.<br/>\n<br/>\n-Dana</div>","specialLinks":[]},{"userId":142317298,"authorName":"tracyliebmann","from":"&quot;tracyliebmann&quot; &lt;tracyliebmann@...&gt;","profile":"tracyliebmann","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: need some fresh ideas or maybe even guidance","postDate":"1182456325","msgId":24617,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1ZWxtNStoOThpQGVHcm91cHMuY29tPg=="},"prevInTopic":24616,"nextInTopic":24621,"prevInTime":24616,"nextInTime":24618,"topicId":24615,"numMessagesInTopic":0,"msgSnippet":"Hi~ Sounds like a rough spot, we all go through them! I have found sleep deprivation to be a serious matter...it makes me really grumpy and I ll cry at the","messageBody":"<div id=\"ygrps-yiv-966110155\">Hi~<br/>\n<br/>\nSounds like a rough spot, we all go through them! I have found sleep <br/>\ndeprivation to be a serious matter...it makes me really grumpy and <br/>\nI&#39;ll cry at the drop off a hat! I think it&#39;s fine to cry infront of <br/>\nmy kids, I just try to own it, let them know I&#39;m tired or sad or even <br/>\nat the end of my rope. I own it, it&#39;s not their fault. I have some <br/>\nideas...don&#39;t know how fresh they are &lt;g&gt;<br/>\n-go to bed with the kids<br/>\n-don&#39;t worry about the &quot;mommy work&quot; for a few days...rest, play and <br/>\nenjoy each other<br/>\n-turn the phone off<br/>\n-don&#39;t make a big deal out of the P...just clean it up<br/>\n-rent movies, pop pop corn, build a fort, crawl in, watch and munch<br/>\n-the above can reconnect you all and let you rest :-)<br/>\n-go outside/to park (when u get your energy back) sunshine and <br/>\nexercise always seems to help<br/>\n-ask for help<br/>\n-I guess what I&#39;m saying is establish an at home with 3 kids under <br/>\nthe age of 6 &lt;BGW&gt; Rest & Relaxation plan...LOL<br/>\n-get creative find a way to relax within the chaos ;-)Sounds very ZEN!<br/>\n<br/>\nTake care, you&#39;re not alone and it will pass!<br/>\nPeace~Love~Free~<br/>\nTracy<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Geneva&quot; &lt;gozas@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hey folks,<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; I&#39;m Geneva, in Dallas.  Mom to Echo (6.5), Kobe (4) and Ocean <br/>\n(10mos).  We<br/>\n&gt; have unschooled for over 3 yrs.leaning towards radical and often <br/>\nusing the<br/>\n&gt; &quot;why not&quot; approach that Rob mentioned here earlier.  We do have <br/>\nsome rules<br/>\n&gt; here but they are very basic, I do not consider myself a controlling<br/>\n&gt; parent.dh isn&#39;t either.  I should also add to this intro that dh <br/>\nworks long<br/>\n&gt; hours most of the time.he is seen as the fun parent since he is <br/>\noften only<br/>\n&gt; here to have dinner, play rowdy and tuck into bed.  Most of the <br/>\ntime it is<br/>\n&gt; just me and the kids - if that helps me paint a picture of what&#39;s <br/>\ngoing on<br/>\n&gt; here.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; My trouble and the reason I am posting, is I feel myself falling <br/>\ninto a<br/>\n&gt; depression this week.after 2 very challenging weeks.  I feel spent, <br/>\nworn out<br/>\n&gt; and like I am out of ideas.  Normally I would visit a group, pick <br/>\nup a<br/>\n&gt; trusted book or check mothering.com or sandradodd for inspiration <br/>\nbut I<br/>\n&gt; haven&#39;t had time lately and I can see that my kids need more of my <br/>\nattention<br/>\n&gt; that I have to offer already so using the internet is something I <br/>\nam trying<br/>\n&gt; to fit in right now.and I am here.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; The baby is teething, not a problem other than she is very fussy, <br/>\nnurses<br/>\n&gt; like a newborn and I am a little sleep deprived.  Okay wait - as I <br/>\ntype, I<br/>\n&gt; see that it may be a problem after all.  She has needed more of my <br/>\nattention<br/>\n&gt; lately and I guess that is feeding some of the trouble in the <br/>\nhousehold.  We<br/>\n&gt; have several slings and I am experienced with several different <br/>\ncarries but<br/>\n&gt; she is a big fat baby and particular about how she is slung.wrapped <br/>\nup on my<br/>\n&gt; back has never been okay with her.  Wanted to throw that out there <br/>\nbecause I<br/>\n&gt; have a feeling some of you more experienced moms may first suggest <br/>\nthat,<br/>\n&gt; lol.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; The bigger kids have been fighting more often over the past few <br/>\nweeks.  It<br/>\n&gt; starts over something trivial but then when the 4 yo persists, the <br/>\n6 yo<br/>\n&gt; screams (often into her face) and the 4 yo strikes with her hands <br/>\nor feet.<br/>\n&gt; Then both kids are crying and upset.  My patience ran out I guess <br/>\nabout a<br/>\n&gt; week ago.  I feel stressed, frazzled, worn out and like I have <br/>\nnothing to<br/>\n&gt; offer these kids.  I know this will pass but I am out of ideas.  <br/>\nMore than<br/>\n&gt; once this week I have cried out of frustration and my kids have <br/>\nseen it more<br/>\n&gt; than once which I am sure feeds the issues that we already have.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Then there&#39;s the 4yo.  She is obviously going thru some changes <br/>\nthat may be<br/>\n&gt; age appropriate but I think the bulk of her issues (can explain <br/>\nmore later)<br/>\n&gt; have to do with her needing more attention than she is getting - or <br/>\nperhaps<br/>\n&gt; just more positive attention.  Sounds easy enough to fix but im <br/>\nhaving<br/>\n&gt; trouble seeing &quot;how&quot; to go about it.  She has done things this week <br/>\nlike<br/>\n&gt; call me stupid, spit at me, spit in the floor, bnreak a pricy <br/>\ncamera that I<br/>\n&gt; asked her to only use with my help, and the real doozy - yesterday <br/>\nshe took<br/>\n&gt; a P in the floor!!  This happened late AM after a wonderful morning <br/>\nof no<br/>\n&gt; fighting and no trouble between any of us.  She got under the crib <br/>\nto P in<br/>\n&gt; the floor.  This was not an accident or a symptom of a UTI - just <br/>\nsomething<br/>\n&gt; she did.  I found out later that her brother was in the room with <br/>\nher when<br/>\n&gt; she did it.<br/>\n&gt; <br/>\n&gt; Where was i?  I was downstairs nursing baby to sleep so that we <br/>\ncould go and<br/>\n&gt; play in the water hose.  This normally takes about 5 min. I would <br/>\ndefinetly<br/>\n&gt; say that the P in the floor was something she was doing for <br/>\nattention which<br/>\n&gt; frustrates me further because I really don&#39;t have any to spare.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; I should also add that both of my bigger kids have mentioned this <br/>\nweek that<br/>\n&gt; they wish the other was never born (insert my tears here) so I see <br/>\nthat a<br/>\n&gt; lot of this (the rivalry) is fixable, I just am having a hard time <br/>\nwith<br/>\n&gt; where to start and what to do next.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; I think a lot of it is a cry for attention as mentioned earlier.  <br/>\nLast week<br/>\n&gt; was a whirlwind of errands and shopping to plan for a bday party <br/>\nfor the 4<br/>\n&gt; yo that was held over the weekend.  I could see additudes and <br/>\ntemperaments<br/>\n&gt; going down hill but couldn&#39;t really help it at the time.  This week <br/>\nI have<br/>\n&gt; hired a mommys helper to help with the mess left from the party and <br/>\nI have<br/>\n&gt; also taken time to myself to get a haircut, shop and nurture my own <br/>\nspirit<br/>\n&gt; so that I can be 100% for them.  As of Thursday afternoon - these <br/>\nthings<br/>\n&gt; have made no difference and I am having feelings of sending my kids <br/>\nto  full<br/>\n&gt; time daycare.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; That however would never happen but I am feeling well, like I said, <br/>\nout of<br/>\n&gt; ideas.  <br/>\n&gt; <br/>\n&gt; I have lurked on this list for a long long time but I recently <br/>\nstarted<br/>\n&gt; reading more of the digests because I feel that it may be time to <br/>\ngo back to<br/>\n&gt; basics so to speak.  This week, my life feels like chaos, <br/>\nunschooling gone<br/>\n&gt; bad and just a big mess of shouting, crying and hurt feelings.  <br/>\nSomething is<br/>\n&gt; not right with us and it seems to get more complicated with each <br/>\npassing<br/>\n&gt; day.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Atm- the kids are playing quietly in front of the tv.  I have <br/>\ndeclared it<br/>\n&gt; &quot;quiet time&quot; since the baby is sleeping and needs her rest.<br/>\n&gt; <br/>\n&gt; I will checkback here later and any questions I can answer to make <br/>\nthe<br/>\n&gt; picture clearer, lmk and any advice, ideas or insight you would <br/>\nlike to<br/>\n&gt; share will be welcome and appreciated.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; I feel a lot like my own mother lately and she was a huge mess of <br/>\nscreaming,<br/>\n&gt; empty threats, low self opinion and detached parenting.not the way <br/>\nI was<br/>\n&gt; planning to go.  Thanks in advance for reading this far and for any <br/>\ninsight.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; geneva<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":295439124,"authorName":"Julie","from":"&quot;Julie&quot; &lt;wisdom1133@...&gt;","profile":"hammy454","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: need some fresh ideas or maybe even guidance","postDate":"1182454475","msgId":24616,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1ZWpzYitrazZtQGVHcm91cHMuY29tPg=="},"prevInTopic":24615,"nextInTopic":24617,"prevInTime":24615,"nextInTime":24617,"topicId":24615,"numMessagesInTopic":0,"msgSnippet":"... (10mos).  We ... using the ... into a ... spent, worn out ... Best thing at this point is to eat good food (not processed but close to real food) and then","messageBody":"<div id=\"ygrps-yiv-1560148315\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Geneva&quot; &lt;gozas@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m Geneva, in Dallas.  Mom to Echo (6.5), Kobe (4) and Ocean <br/>\n </span></blockquote>(10mos).  We<br/>\n<blockquote><span title=\"ireply\"> &gt; have unschooled for over 3 yrs.leaning towards radical and often <br/>\n </span></blockquote>using the<br/>\n<blockquote><span title=\"ireply\"> &gt; My trouble and the reason I am posting, is I feel myself falling <br/>\n </span></blockquote>into a<br/>\n<blockquote><span title=\"ireply\"> &gt; depression this week.after 2 very challenging weeks.  I feel <br/>\n </span></blockquote>spent, worn out<br/>\n<blockquote><span title=\"ireply\"> &gt; and like I am out of ideas.  <br/>\n<br/>\n<br/>\n </span></blockquote>Best thing at this point is to eat good food (not processed but <br/>\nclose to real food) and then do something you normally do not do. <br/>\nTake a day off and go to a park where the kids can run free or to a <br/>\nfriends house that the kids love to be at. Get a baby sitter for the <br/>\nsmallest and go have some BIG kids fun with the others. Make water <br/>\nballoons and throw them (my kids latest obsession). <br/>\n<br/>\nI notice that when I eat quick easy food I am irritable and tired <br/>\nand take it out on the kids and then I realize whoa I need FOOD. <br/>\nAlso sometimes we need change even just for a day to start fresh- <br/>\nfind something you have not done in awhile and do that. <br/>\n<br/>\nAsk the kids what they would like to do for a day of fun-</div>","specialLinks":[]},{"userId":206058243,"authorName":"Geneva","from":"&quot;Geneva&quot; &lt;gozas@...&gt;","profile":"nevagoza","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"need some fresh ideas or maybe even guidance","postDate":"1182449501","msgId":24615,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDExODI0MTA3NzAuMTIzMy45MDE0NC5tNDBAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":24616,"prevInTime":24614,"nextInTime":24616,"topicId":24615,"numMessagesInTopic":0,"msgSnippet":"Hey folks, I m Geneva, in Dallas.  Mom to Echo (6.5), Kobe (4) and Ocean (10mos).  We have unschooled for over 3 yrs.leaning towards radical and often using","messageBody":"<div id=\"ygrps-yiv-1797641980\">Hey folks,<br/>\n<br/>\n <br/>\n<br/>\nI&#39;m Geneva, in Dallas.  Mom to Echo (6.5), Kobe (4) and Ocean (10mos).  We<br/>\nhave unschooled for over 3 yrs.leaning towards radical and often using the<br/>\n&quot;why not&quot; approach that Rob mentioned here earlier.  We do have some rules<br/>\nhere but they are very basic, I do not consider myself a controlling<br/>\nparent.dh isn&#39;t either.  I should also add to this intro that dh works long<br/>\nhours most of the time.he is seen as the fun parent since he is often only<br/>\nhere to have dinner, play rowdy and tuck into bed.  Most of the time it is<br/>\njust me and the kids - if that helps me paint a picture of what&#39;s going on<br/>\nhere.<br/>\n<br/>\n <br/>\n<br/>\nMy trouble and the reason I am posting, is I feel myself falling into a<br/>\ndepression this week.after 2 very challenging weeks.  I feel spent, worn out<br/>\nand like I am out of ideas.  Normally I would visit a group, pick up a<br/>\ntrusted book or check mothering.com or sandradodd for inspiration but I<br/>\nhaven&#39;t had time lately and I can see that my kids need more of my attention<br/>\nthat I have to offer already so using the internet is something I am trying<br/>\nto fit in right now.and I am here.<br/>\n<br/>\n <br/>\n<br/>\nThe baby is teething, not a problem other than she is very fussy, nurses<br/>\nlike a newborn and I am a little sleep deprived.  Okay wait - as I type, I<br/>\nsee that it may be a problem after all.  She has needed more of my attention<br/>\nlately and I guess that is feeding some of the trouble in the household.  We<br/>\nhave several slings and I am experienced with several different carries but<br/>\nshe is a big fat baby and particular about how she is slung.wrapped up on my<br/>\nback has never been okay with her.  Wanted to throw that out there because I<br/>\nhave a feeling some of you more experienced moms may first suggest that,<br/>\nlol.<br/>\n<br/>\n <br/>\n<br/>\nThe bigger kids have been fighting more often over the past few weeks.  It<br/>\nstarts over something trivial but then when the 4 yo persists, the 6 yo<br/>\nscreams (often into her face) and the 4 yo strikes with her hands or feet.<br/>\nThen both kids are crying and upset.  My patience ran out I guess about a<br/>\nweek ago.  I feel stressed, frazzled, worn out and like I have nothing to<br/>\noffer these kids.  I know this will pass but I am out of ideas.  More than<br/>\nonce this week I have cried out of frustration and my kids have seen it more<br/>\nthan once which I am sure feeds the issues that we already have.<br/>\n<br/>\n <br/>\n<br/>\nThen there&#39;s the 4yo.  She is obviously going thru some changes that may be<br/>\nage appropriate but I think the bulk of her issues (can explain more later)<br/>\nhave to do with her needing more attention than she is getting - or perhaps<br/>\njust more positive attention.  Sounds easy enough to fix but im having<br/>\ntrouble seeing &quot;how&quot; to go about it.  She has done things this week like<br/>\ncall me stupid, spit at me, spit in the floor, bnreak a pricy camera that I<br/>\nasked her to only use with my help, and the real doozy - yesterday she took<br/>\na P in the floor!!  This happened late AM after a wonderful morning of no<br/>\nfighting and no trouble between any of us.  She got under the crib to P in<br/>\nthe floor.  This was not an accident or a symptom of a UTI - just something<br/>\nshe did.  I found out later that her brother was in the room with her when<br/>\nshe did it.<br/>\n<br/>\nWhere was i?  I was downstairs nursing baby to sleep so that we could go and<br/>\nplay in the water hose.  This normally takes about 5 min. I would definetly<br/>\nsay that the P in the floor was something she was doing for attention which<br/>\nfrustrates me further because I really don&#39;t have any to spare.<br/>\n<br/>\n <br/>\n<br/>\nI should also add that both of my bigger kids have mentioned this week that<br/>\nthey wish the other was never born (insert my tears here) so I see that a<br/>\nlot of this (the rivalry) is fixable, I just am having a hard time with<br/>\nwhere to start and what to do next.<br/>\n<br/>\n <br/>\n<br/>\nI think a lot of it is a cry for attention as mentioned earlier.  Last week<br/>\nwas a whirlwind of errands and shopping to plan for a bday party for the 4<br/>\nyo that was held over the weekend.  I could see additudes and temperaments<br/>\ngoing down hill but couldn&#39;t really help it at the time.  This week I have<br/>\nhired a mommys helper to help with the mess left from the party and I have<br/>\nalso taken time to myself to get a haircut, shop and nurture my own spirit<br/>\nso that I can be 100% for them.  As of Thursday afternoon - these things<br/>\nhave made no difference and I am having feelings of sending my kids to  full<br/>\ntime daycare.<br/>\n<br/>\n <br/>\n<br/>\nThat however would never happen but I am feeling well, like I said, out of<br/>\nideas.  <br/>\n<br/>\nI have lurked on this list for a long long time but I recently started<br/>\nreading more of the digests because I feel that it may be time to go back to<br/>\nbasics so to speak.  This week, my life feels like chaos, unschooling gone<br/>\nbad and just a big mess of shouting, crying and hurt feelings.  Something is<br/>\nnot right with us and it seems to get more complicated with each passing<br/>\nday.<br/>\n<br/>\n <br/>\n<br/>\nAtm- the kids are playing quietly in front of the tv.  I have declared it<br/>\n&quot;quiet time&quot; since the baby is sleeping and needs her rest.<br/>\n<br/>\nI will checkback here later and any questions I can answer to make the<br/>\npicture clearer, lmk and any advice, ideas or insight you would like to<br/>\nshare will be welcome and appreciated.<br/>\n<br/>\n <br/>\n<br/>\nI feel a lot like my own mother lately and she was a huge mess of screaming,<br/>\nempty threats, low self opinion and detached parenting.not the way I was<br/>\nplanning to go.  Thanks in advance for reading this far and for any insight.<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\ngeneva<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":24633,"nextTopicId":24632}}