{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":229237531,"authorName":"Danielle Conger","from":"Danielle Conger &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] win win solutions-Danielle","postDate":"1184368277","msgId":24963,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2OTgwNjk1LjUwOTAwQGdtYWlsLmNvbT4=","inReplyToHeader":"PEJGOEY2MjcxLUM0M0YtNEJFRi1BQTAwLURCREQ0MThEOTNDNUBlYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PEJGOEY2MjcxLUM0M0YtNEJFRi1BQTAwLURCREQ0MThEOTNDNUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":24962,"nextInTime":24964,"topicId":24959,"numMessagesInTopic":0,"msgSnippet":"... Well, what I would say is that you re laying the ground work. Every time you engage in the process, regardless of the outcome, you are helping them learn","messageBody":"<div id=\"ygrps-yiv-678589014\">Kendrah Nilsestuen wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Thank you for your thoughts and example Danielle. I&#39;m wondering your<br/>\n&gt; thoughts on how to create a win/win for a younger age group. If I<br/>\n&gt; had the ability to talk things through with each child it would make<br/>\n&gt; it a lot easier. My daughter is 4 and I can talk things through with<br/>\n&gt; her. My son however is 15 months.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Well, what I would say is that you&#39;re laying the ground work. Every time <br/>\nyou engage in the process, regardless of the outcome, you are helping <br/>\nthem learn problem solving skills. Each time you engage in the process, <br/>\nyou&#39;re helping them to hear and consider others&#39; needs and you&#39;re <br/>\nsending the message that their needs are important enough to be heard <br/>\nand considered and met as well. Each time you engage in the process with <br/>\na successful win/ win outcome, your kids learn to trust in the process <br/>\nand that their needs will be met.<br/>\n<br/>\nAs with most things, I&#39;d say that it&#39;s process and not product that <br/>\nmatters--something I was trying to convey in my first post. It&#39;s hard, <br/>\nthough, when you&#39;re first starting out and setting a goal, not to be <br/>\nproduct oriented. And certainly, I remember well being at that stage <br/>\nwith very young children and not seeing how it could be possible in <br/>\npractice to find common preference with young people who seemed to have <br/>\nsuch an entirely different rationalizing perspective than I had. Not <br/>\nthat they weren&#39;t rational beings--they were! Their reason was just <br/>\noften quite different from my own.<br/>\n<br/>\nI went and dug this out for you over at the TCS (Taking Children <br/>\nSeriously) website. It&#39;s a post of mine from back in 2004 when my kids <br/>\nwere younger than they are now, and I was without the benefit of <br/>\nhindsight and experience that I now enjoy:<br/>\n<br/>\n<br/>\n      ***Multiple children<br/>\n      &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.takingchildrenseriously.com/practical_tcs_0#comment-408\">http://www.takingchildrenseriously.com/practical_tcs_0#comment-408</a>&gt;<br/>\n<br/>\nI&#39;ve been reading as much about TCS as I can and trying diligently to <br/>\nimplement it in my own family.<br/>\n<br/>\nBut...<br/>\n<br/>\nSo many of the scenarios and solutions presented within TCS seem to <br/>\ndepend on only * one child *. Negotiating common preferences and having <br/>\neveryone follow through with the common preference seems to become <br/>\nexponentially more difficult with each additional child. TCS parenting <br/>\nof * multiple very young children * often seems like an ideal rather <br/>\nthan a practical reality.<br/>\n<br/>\nI would like to hear about how other TCS parents would negotiate common <br/>\npreferences with multiple children, particularly those under the age of <br/>\nsix.<br/>\n<br/>\nSuppose, for instance, that a family with several young children manage <br/>\nto find a common preference only to have one member change his mind <br/>\nmidway through the solution. Does this, then, throw us all back into the <br/>\nnegotiation stage?<br/>\n<br/>\nHow does it not undermine the whole process when there is no guarantee <br/>\nof follow-through?<br/>\n<br/>\nAt what point can the parent gently remind the child that he had agreed <br/>\nto spending a certain amount of time doing something for another child <br/>\nin order to ensure that those other children would do something for him <br/>\nimmediately after, especially when participation in an organized group <br/>\nevent makes the order/ timing non-negotiable?<br/>\n<br/>\nAnd what if that gentle reminder does not make a difference? Does <br/>\neveryone pack up and go home without having fulfilled anyone&#39;s <br/>\npreference, which seems so punitive to all members?<br/>\n<br/>\nSometimes, TCS parenting seems so unattainable when one cannot double or <br/>\ntriple oneself (or hire someone to serve that function) and fulfill <br/>\neveryone&#39;s needs at the same time.**********<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; We have a toy golf set (plastic) complete with clubs and balls and a<br/>\n&gt; little caddy. My son loves the golf set. He likes to pretend to play<br/>\n&gt; golf by swinging the club to hit the ball.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I have several thoughts, but of course it&#39;s always easier to solve <br/>\nsomeone else&#39;s problems than one&#39;s own. *g*<br/>\n<br/>\nMy first suggestion in moving towards win/ win problem solving would be <br/>\nto take a back seat in the fixing department. As parents, we so often <br/>\nwant to jump in and *fix* our kids problems--it seems like our job and <br/>\nit feels better when everyone&#39;s happy. But, with problem-solving, there <br/>\nare a lot of important steps in between the problem and the fix, and <br/>\nit&#39;s important not to leave kids out of those steps. Interestingly, I&#39;ve <br/>\nfound *facilitating* problem-solving to be far more empowering for the <br/>\nkids than swooping in and fixing things from the standpoint of parental <br/>\nauthority and power.<br/>\n<br/>\nSo, what I&#39;m reading in your example--and all I have to go on is what <br/>\nyou&#39;ve written--is that you&#39;ve come up with solutions in the moment and <br/>\nare having trouble implementing those solutions in a way that everyone&#39;s <br/>\nhappy. This is where I&#39;d suggest that instead of coming up with <br/>\nsolutions, you try observing what you see, really neutrally, and asking <br/>\nif they have any ideas: &quot;Ooh, you&#39;re having so much fun Damien, but I <br/>\nsee *Jenny (don&#39;t know you&#39;re dd&#39;s name) is afraid she might be hit. Can <br/>\nwe find a way for Damien to play golf and for Jenny to feel safe at the <br/>\nsame time?&quot;<br/>\n<br/>\nThat&#39;s what I mean when I talk about the process--setting up the problem <br/>\nand asking for a solution that meets everyone&#39;s needs. My job as a <br/>\nparent--as a mediator and facilitator--is often to try to articulate <br/>\neach person&#39;s point of view in a way that everyone can understand, <br/>\nadding &quot;translating&quot; to my job list. That draws on my own skills of <br/>\nmindful and compassionate observation, and I&#39;ve had to cultivate over <br/>\nthe years my ability to see and understand multiple perspectives at the <br/>\nsame time without overlaying my own judgment and personal baggage--a <br/>\ntremendous personal growing experience that certainly doesn&#39;t happen <br/>\novernight. It takes work!<br/>\n<br/>\nMy journey and my sources have been long and varied, and I&#39;ve cobbled <br/>\ntogether tools from many different sources. The observation thing came <br/>\nfrom Faber and Mazlish. Lots of the problem solving stuff came from my <br/>\nreading in TCS. Some of the mediating techniques I&#39;ve drawn from my <br/>\nreading in Buddhism, and others I&#39;ve taken from NVC (Non-Violent <br/>\nCommunication). As much as any of those, if not more so, reading and <br/>\nposting on the unschooling lists and hanging &quot;virtually&quot; with other <br/>\nmindful, unschooling parents helps me remain open, respectful, <br/>\ncompassionate, and mindful.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>-- <br/>\n~~Danielle<br/>\nEmily (9), Julia (8), Sam (7)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.organiclearning.blogspot.com\">http://www.organiclearning.blogspot.com</a><br/>\n<br/>\n~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*<br/>\n<br/>\nConnections: ezine of unschooling and mindful parenting<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://connections.organiclearning.org\">http://connections.organiclearning.org</a></div>","specialLinks":[]}],"prevTopicId":24955,"nextTopicId":24952}}