{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":187549037,"authorName":"Christe Bruderlin","from":"Christe Bruderlin &lt;techwritercsbn@...&gt;","profile":"techwritercsbn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: To lurk, share, question","postDate":"1152206698","msgId":15407,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNzA2MTcyNDU4LjU5NTgyLnFtYWlsQHdlYjMyNjA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDExNTIxODk5MjUuNDAxLjEyNTAwLm0yMEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":15400,"nextInTopic":0,"prevInTime":15406,"nextInTime":15408,"topicId":15387,"numMessagesInTopic":0,"msgSnippet":"Yep, thanks!  This morning she came up and said, Can we do a reading lesson? and I said, Yes, but lets play with this sticker chart and all the stickers,","messageBody":"<div id=\"ygrps-yiv-2037203554\">Yep, thanks!  This morning she came up and said, &quot;Can we do a reading lesson?&quot; and I said, &quot;Yes, but lets play with this sticker chart and all the stickers, too,&quot; and she stuck them all over the chart...almost like she had no idea what it was originally for.  LOL<br/>\n <br/>\nI now never bring up the lessons (the book seems quite boring) unless it is in a list of activities when she asks for something to do, but DD3 requests them herself a few times a week.  Sometimes she wants to do 1/3 of a lesson, and sometimes 2.5 lessons (both against the &quot;rules&quot; of the book, but who cares?).  But that sticker chart was the rule-follower in me.  The book said spend 15 minutes a day every day and I figured I would motivate her if there were days she didn&#39;t want to.  Now I realize how silly that is.  Really silly!  <br/>\n <br/>\nWe also read books all day long (in the car, during bathtime, etc.), in addition to our &quot;official&quot; storytime when we all climb in bed together and read.  DS1 loves books, too -- but mostly for teething ha ha ha.  DD3 also likes workbooks.  I bought these earlier on, and my mom buys a few.  Now they just sit in a pile in her arts & crafts area and she wants to do them all the time (at this age they are pretty fun...we have a cutting one, a taping one, a tracing one and a maze one in addition to some that involve letters and numbers).  I think it is the virgo in her (and me, as I was drawn to these things, too, as a child).  DD1 is more into taking things apart, lacing wood beeds, throwing everything (DUCK!) and pusing &quot;beep beeps&quot; (his word for anything with wheels or the rocking horse, teeter totter, etc.).  <br/>\n <br/>\nIt is really tricky to become less schooly!  I have to deschool for 23 months (aaahh!) and I&#39;m only a few months into it.  (luckily DD3 only had to deschool for a few weeks and DS1 doesn&#39;t have to deschool at all!).  DH is still in the academic environment (and will be for another 3 years), so I&#39;m not sure how he will deschool at this point (and he will have 27 months to deschool!) -- but he is open to the concepts, is totally for homeschooling, and isn&#39;t worried about a curriculum (big progress!).  <br/>\n <br/>\nI think we will face the challenges that seem fairly typical...TV controls (still an issue for me), video game controls (though not an issue yet), and food controls (though I think we have that one pretty close to figured out, at least for now).<br/>\n <br/>\nChriste<br/>\n-------------------------------------<br/>\n&lt;&lt;Can you say, &quot;You know what? If you&#39;re a little tired of doing all <br/>\nthese lessons, you can just have all the stickers - you don&#39;t have to <br/>\ndo the lessons to get them.&quot;<br/>\n&quot;It would be more fun to read real books instead of doing these <br/>\nlessons, don&#39;t you think? Let&#39;s just play with the stickers and read <br/>\nbooks.&quot;<br/>\n<br/>\n-pam&gt;&gt;<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"To lurk, share, question","postDate":"1152197600","msgId":15400,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU4ajg1MCtjcDJpQGVHcm91cHMuY29tPg=="},"prevInTopic":15392,"nextInTopic":15407,"prevInTime":15399,"nextInTime":15401,"topicId":15387,"numMessagesInTopic":0,"msgSnippet":"~(Oh, and I almost left the list....trying to figure out if it was elite or too harsh or whatever at times. I also admit to some fear of posting. But I m","messageBody":"<div id=\"ygrps-yiv-673914082\">~(Oh, and I almost left the list....trying to figure out if it was<br/>\n&quot;elite&quot; or too &quot;harsh&quot; or whatever at times. I also admit to some fear<br/>\nof posting. But I&#39;m really glad I just listened and absorbed for a<br/>\nwhile and tried some things out. Its really been positive for our<br/>\nfamily!)~<br/>\n<br/>\nI&#39;m glad you hung in there!:)<br/>\nMost of us find these ideas fairly difficult to grasp at first, but<br/>\nthe more you travel it, the more you can see how beautifully it really<br/>\nworks!<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] To lurk, share, question","postDate":"1152145307","msgId":15392,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENENzE1RTRELTI2RjctNDJFNy1CMERELTZBNTY2QzM1MEJCN0BlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDYwNzA1MjExNDExLjg0NDIxLnFtYWlsQHdlYjMyNjEyLm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDIwMDYwNzA1MjExNDExLjg0NDIxLnFtYWlsQHdlYjMyNjEyLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":15387,"nextInTopic":15400,"prevInTime":15391,"nextInTime":15393,"topicId":15387,"numMessagesInTopic":0,"msgSnippet":"... Can you say, You know what? If you re a little tired of doing all these lessons, you can just have all the stickers - you don t have to do the lessons to","messageBody":"<div id=\"ygrps-yiv-161126652\">On Jul 5, 2006, at 2:14 PM, Christe Bruderlin wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;  The problem is, I set it up with a &quot;reward&quot; chart, which was  <br/>\n&gt; silly, because I do not at all care if she reads at this age.  I  <br/>\n&gt; just thought it would be fun.  Now I&#39;m trying to phase it out, but  <br/>\n&gt; she is hooked on the stickers (oops!) and we are only about 1/3 of  <br/>\n&gt; the way through it.  Any ideas on how to UNDO a reward system  <br/>\n&gt; midway through a project?  I guess I could just stop, but I&#39;d like  <br/>\n&gt; to think of another creative thing to do in its place, since she  <br/>\n&gt; likes that sticker chart!<br/>\n<br/>\n </span></blockquote>Can you say, &quot;You know what? If you&#39;re a little tired of doing all  <br/>\nthese lessons, you can just have all the stickers - you don&#39;t have to  <br/>\ndo the lessons to get them.&quot;<br/>\n&quot;It would be more fun to read real books instead of doing these  <br/>\nlessons, don&#39;t you think? Let&#39;s just play with the stickers and read  <br/>\nbooks.&quot;<br/>\n<br/>\n-pam<br/>\n<br/>\nUnschooling shirts, cups, bumper stickers, bags...<br/>\nLive Love Learn<br/>\nUNSCHOOL!<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cafepress.com/livelovelearn\">http://www.cafepress.com/livelovelearn</a>&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":187549037,"authorName":"Christe Bruderlin","from":"Christe Bruderlin &lt;techwritercsbn@...&gt;","profile":"techwritercsbn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"To lurk, share, question","postDate":"1152134051","msgId":15387,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNzA1MjExNDExLjg0NDIxLnFtYWlsQHdlYjMyNjEyLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDExNTIxMjU5NzAuMTI2Ny4xNTAxLm0zMUB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":15392,"prevInTime":15386,"nextInTime":15388,"topicId":15387,"numMessagesInTopic":0,"msgSnippet":"Hi, I m mostly a lurker :) (thought I ve posted a few times), but wanted to share my journey so far, which will probably lead to a few questions. First, I ve","messageBody":"<div id=\"ygrps-yiv-1341380645\">Hi,<br/>\n <br/>\nI&#39;m mostly a lurker :) (thought I&#39;ve posted a few times), but wanted to share my journey so far, which will probably lead to a few questions.<br/>\n <br/>\nFirst, I&#39;ve had some fun moments.  My children are very young, attachment parented and I&#39;m learning not to just trust them, but to trust *myself*.  Now that I know they give signals when they are tired, hungry, etc., I have to work to trust myself to read them.  Some are really obvious, like &quot;Mommy, I don&#39;t want to eat! or &quot;I&#39;m not cold!&quot;  Why I didn&#39;t just say okay before is beyond me (LIGHTBULB!).<br/>\n <br/>\nSome fun examples.  <br/>\n <br/>\n1)  Yesterday at a 4th of July party, as evening came, everyone got chilly and put on sweaters.  Everyone FORCED their children to put on sweaters (though the children were literally running and climbing and were probably perfectly warm).  They kept asking us if we had a sweater for our 3yo or wanted to borrow one.  So each time, I&#39;d ask patiently, &quot;Hunny, do you want a sweater&quot; and she&#39;d say &quot;No Mommy, I&#39;m not cold.&quot;  Then, when the show started and she sat for 10 minutes, she requested her sweater.  So logical and to think I would have said, &quot;Its time to put your sweater on&quot; before.  Lame.  <br/>\n<br/>\n2)  I took away forced naps (which were generally a hideous experience) a few months ago.  When we got in the car yesterday, my little one (16mos) instantly conked out.  My 3yo said, &quot;Mommy, Logan fell asleep!&quot; (like it was a bad thing).  I responded, &quot;<br/>\nWell, that&#39;s okay.  He&#39;s resting his body and when we get to the party he&#39;ll have lots of energy to play all day.&quot;  She responded (GASP!), &quot;Oh, I should rest my body so I have lots of energy to play, too.&quot;  Then she shut her eyes and went to sleep.  OMG never in my LIFE did I think this would EVER happen.  And I had all those silly battles.  <br/>\n <br/>\n3)  I eat very strictly (mostly vegan, &quot;Eat To Live&quot; by Fuhrman, etc.), but do not police what the kids eat outside the home (parties/restaurants).  I have told my older one why we (my husband and I) don&#39;t eat animals, and she has chosen to do the same so far, but she also has the choice to do as she pleases.  I&#39;ve been inspired by this list to come up with lots of unlimited snacks e.g. for summer, I keep endless popsicles on hand that are just blended fruit.  My 3yo is always in shock when I answer yes to questions like, &quot;Mommy, can I have 3 popsicles for breakfast?&quot;  And at parties, she still asks what she can have (carryover from my more restrictive behavior)...but the funny thing is, I always say &quot;yes&quot; and she still has about what she had before (requests a &quot;big&quot; piece of cake and then eats about 1/3-1/2 due to her size, etc.).  I&#39;m making simple oatmeal bars and lots of other snacks that are easy so that everything in the house is a &quot;yes&quot; food.  She has not thus far<br/>\n requested that we keep a candy bowl or anything like that, so I&#39;ll cross that bridge when I come to it.  I&#39;d love to hear from others who eat like I do and what they&#39;ve come up with to keep freedom, but also focus on healthy eating.<br/>\n <br/>\n4)  She asked to be taught to read, so I&#39;m using that book someone mentioned on here &quot;Teach your child to read in 100 easy lessons.&quot;  The problem is, I set it up with a &quot;reward&quot; chart, which was silly, because I do not at all care if she reads at this age.  I just thought it would be fun.  Now I&#39;m trying to phase it out, but she is hooked on the stickers (oops!) and we are only about 1/3 of the way through it.  Any ideas on how to UNDO a reward system midway through a project?  I guess I could just stop, but I&#39;d like to think of another creative thing to do in its place, since she likes that sticker chart!  <br/>\n <br/>\n5)  I&#39;m working on giving up bedtime, but I&#39;m struggling because my children both get more and more physical as they get more and more tired -- both like to pinch my upper arms...ugh!..and are really physically hard on each other (pinching, hitting, biting, hair pulling, throwing) when they don&#39;t get enough rest.  My 16mo is very easy...when he gets tired, I nurse him, say night night, and he fusses a little and goes to sleep (usually with me) and in the daytime, when he gets tired, I take him for a quick stroll and say &quot;night night&quot; and he goes to sleep.  He requires less sleep than my 3yo.  However, if my 3yo stays up as long as she wants, my 16mo always wakes her in the morning at about 5am, and then I have the fistfights because my 3yo is still tired (also, my 16mo naps at about 10 am and is cheery again, but my 3yo usually doesn&#39;t nap).  I&#39;m not sure what to do about that yet.  I still do the bedtime routines at 7ish, but do not force sleep.  Due to our tight quarters<br/>\n and hardwood floors, there isn&#39;t really anyway to prevent my 16mo from waking my 3yo in the morning at this point (have tried separate rooms, sound machine, music, etc.).  My 3yo is also very conscious of when I get up.<br/>\n <br/>\nLastly (for now), I&#39;m noticing a HUGE difference between my 3yo and her schooled friends already (and so are some of their parents!).  Every day, it is reaffirming my (almost there!) decision to keep them out of school.<br/>\n <br/>\nThanks for listening and any ideas you might have.<br/>\n <br/>\n(Oh, and I almost left the list....trying to figure out if it was &quot;elite&quot; or too &quot;harsh&quot; or whatever at times.  I also admit to some fear of posting.  But I&#39;m really glad I just listened and absorbed for a while and tried some things out.  Its really been positive for our family!)<br/>\n <br/>\n <br/>\nChriste<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":15292,"nextTopicId":15415}}