{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":124256069,"authorName":"Bun","from":"&quot;Bun&quot; &lt;alohabun@...&gt;","profile":"alohabun","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: idea of the &#39;commons&#39;  was: For those who have been unschooling formany years...","postDate":"1261522540","msgId":42536,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhncmlwYyt0ZnFzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhnb245MyttdXVwQGVHcm91cHMuY29tPg=="},"prevInTopic":42528,"nextInTopic":0,"prevInTime":42535,"nextInTime":42537,"topicId":42494,"numMessagesInTopic":0,"msgSnippet":"Meredith...this is so well said!  Worth writing again... We get to be the ones to model delayed gratification and generosity, rather than asking it of our","messageBody":"<div id=\"ygrps-yiv-1884920511\">Meredith...this is so well said!  Worth writing again...<br/>\n<br/>\n&quot;We get to be the ones to model delayed gratification and generosity, rather than &quot;asking&quot; it of our kids.&quot;<br/>\n<br/>\nThank you!!<br/>\n<br/>\nLaurie :)</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: idea of the &#39;commons&#39;  was: For those who have been unschooling formany year","postDate":"1261503340","msgId":42528,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhncjAxYytqYW5pQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhncWZtNitpYWJmQGVHcm91cHMuY29tPg=="},"prevInTopic":42518,"nextInTopic":42536,"prevInTime":42527,"nextInTime":42529,"topicId":42494,"numMessagesInTopic":0,"msgSnippet":"... ********************* This is such a nuancy topic, one that s really hard to talk about in the abstract because there s a really wide range of","messageBody":"<div id=\"ygrps-yiv-850984212\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;marbleface@...&quot; &lt;marbleface@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Just speak like a normal person instead of playing some stiff parent -- traditional or unschooling or whatever -- role and it will go a long way toward being a happy unschooling family. <br/>\n </span></blockquote>*********************<br/>\n<br/>\nThis is such a nuancy topic, one that&#39;s really hard to talk about in the abstract because there&#39;s a really wide range of communication styles that people bring to unschooling. I had to unlearn a lot of my own &quot;adult&quot; communication in order to come to a place where I was communicating effectively without, quite frankly, being a bitch. I came in to parenting (step parenting, first) with a very, er, &quot;feminist&quot; attitude that &quot;its better to be a bitch than a doormat&quot;. I was determined not to be a doormat to Ray so I was &quot;real&quot; with him. But I wasn&#39;t kind. <br/>\n<br/>\nIt took me time to figure out how to be kind without feeling like I had to turn into a doormat for that to happen. It was a process where I learned to stretch my needs and boundaries without giving them up entirely. For me, it was a slow movement toward having more and more kindness in my life. Kindness toward myself as much as anyone else.<br/>\n<br/>\nOther people come to unschooling having learned to set aside their own needs too much, too often. Those people are going to have a different learning process from mine! A process that&#39;s as much about learning to honor their own needs and boundaries as their childrens.<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: idea of the &#39;commons&#39;  was: For those who have been unschooling formany year","postDate":"1261486598","msgId":42518,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhncWZtNitpYWJmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk4MjU3My44OTg4MC5xbUB3ZWI2MzcwOC5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":42509,"nextInTopic":42528,"prevInTime":42517,"nextInTime":42519,"topicId":42494,"numMessagesInTopic":0,"msgSnippet":"This is just being real, letting your kid know how we feel about our partners, their parents. ******** Well put! And how will the kids know if we don t say","messageBody":"<div id=\"ygrps-yiv-1879161382\">This is just being real, letting your kid know how we feel about our partners, their parents.<br/>\n<br/>\n********<br/>\n<br/>\nWell put!<br/>\n<br/>\nAnd how will the kids know if we don&#39;t say something? <br/>\n<br/>\nJust speak like a normal person instead of playing some stiff parent -- traditional or unschooling or whatever -- role and it will go a long way toward being a happy unschooling family. <br/>\n<br/>\nNance</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: idea of the &#39;commons&#39;  was: For those who have been unschooling formany years...","postDate":"1261428835","msgId":42509,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhnb245MyttdXVwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk4MjU3My44OTg4MC5xbUB3ZWI2MzcwOC5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":42501,"nextInTopic":42518,"prevInTime":42508,"nextInTime":42510,"topicId":42494,"numMessagesInTopic":0,"msgSnippet":"... ******************** Now and then you mean? Sure. There are times when my needs are bigger - not get to be bigger they are! and I articulate that. The","messageBody":"<div id=\"ygrps-yiv-1217990871\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Michele Spout &lt;michelespout@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; If kids are our &quot;partners&quot;, why is it different to ask for help from your husband than your kids? I&#39;m sure more than once we said &quot;honey, would you go change her diaper? Or, she is crying can you go see what&#39;s going on, I have food on the stove right now.Â  And we were not really asking, we were pretty much saying &quot;go do it&quot;. <br/>\n </span></blockquote>********************<br/>\n<br/>\nNow and then you mean? Sure. There are times when my needs are bigger - not &quot;get to be bigger&quot; they are! and I articulate that. The trouble is that most parents are used to the idea that its okay to run right over the needs of kids under the guise of teaching them lessons in responsibility. Kids don&#39;t Need those kinds of lessons, though. They need to see what kindness and generosity look and feel like on a regular basis.<br/>\n<br/>\nAt the same time, kids don&#39;t have the same skills adults have, and part of being someone&#39;s partner involves understanding the skills that person has and doesn&#39;t and working with that understanding. There are things George, my adult partner, just doesn&#39;t do very well, and I don&#39;t ask him to do those. That&#39;s true of my kids, as well. One of the key skills that kids are learning as they grow is how to handle transitions, for instance, and that&#39;s a Biggie when it comes to asking kids for help. You aren&#39;t just asking &quot;one little thing&quot; you&#39;re asking them to do one of the hardest things of all - make a transition from one thing to another. Possibly more than one. Its no longer a little thing at that point, its a massive imposition. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Shira is talking about 12 and 14 years old kids, of course we are not talking about 2 or 3 years old<br/>\n </span></blockquote>********************<br/>\n<br/>\n14 yos can have pretty big needs! Its not the easiest age to be, not like 34. Being 34 was easy. Having a 3yo (which I did when I was 34) not so much, but actually being 34 was a cakewalk compared to being 14. My needs were so much smaller I could actually ignore some of them for short periods to help my 3yo. I wouldn&#39;t have been able to do that at 14 without losing it very quickly.  <br/>\n<br/>\nThere&#39;s going to be a big difference, too, between what a 14yo who has just left school can handle, emotionally, than what a 14yo who has been radically unschooling for three or more years can handle. Kids who are still deschooling need a lot more time and care than you&#39;d expect for their age. They&#39;re hurt, and need time and gentleness in order to heal. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; I&#39;ve read posts from moms who are not having time with their husbands because kids are always around (I think the boy was 9). Some of the responses were, &quot;Can you watch TV with your husband in the morning?&quot; Instead of saying, talk to your kid, COMMUNICATE to him &quot;I really miss Daddy, can you find something you enjoy doing in your room so I can have this moment with him?&quot;<br/>\n </span></blockquote>*****************<br/>\n<br/>\nThere&#39;s certainly a time and place for that - but not all the time, and especially not when a child is expressing a lot of neediness. Then its cruel! Some kids are needier than others and longer than others. That&#39;s okay. Its okay to have big needs! And its okay to see our kids&#39; big needs as valid in and of themselves, not something they should be trained to set aside. More than okay, its a key to helping our kids learn to manage their own big needs on their own. They won&#39;t learn that as well without help. <br/>\n<br/>\nIts also good to ask, in the case with the 9yo, if that kid is deschooling. School leaves kids with a huge amount of emotional neediness that takes months to years to fill up. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Again, if we can&#39;t be open and ask ( I am saying open I&#39;m not saying demanding) for what we need from the people who love us then I don&#39;t think our kids are going to learn to be open with us and feel safe to speak their hearts either.<br/>\n </span></blockquote>************************<br/>\n<br/>\nThat&#39;s an important point! It is important for parents to articulate our own needs and boundaries and see that Our needs really are bigger sometimes. But only sometimes. We&#39;re the adults, after all, the ones with the skills and experience. We get to be the ones to model delayed gratification and generosity, rather than &quot;asking&quot; it of our kids.<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":209361242,"authorName":"JJ","from":"&quot;JJ&quot; &lt;jrossedd@...&gt;","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: idea of the &#39;commons&#39;  was: For those who have been unschooling formany years...","postDate":"1261404583","msgId":42499,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhnbnZqNytubjlxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEQxQjJGNTZEODc0MzQ4NTFCQUVDMEFBOTU3NjM1QTEzQENvbm5pZVBDPg=="},"prevInTopic":42498,"nextInTopic":42501,"prevInTime":42498,"nextInTime":42500,"topicId":42494,"numMessagesInTopic":0,"msgSnippet":"Ah, the old lady s immoral tyranny of needing her tea and toast just so!  (Screwtape Letters, CS Lewis) All she wants is a cup of tea properly made, or an","messageBody":"<div id=\"ygrps-yiv-308123685\">Ah, the old lady&#39;s immoral tyranny of &quot;needing&quot; her tea and toast just so!  (Screwtape Letters, CS Lewis)<br/>\n<br/>\n&quot;All she wants is a cup of tea properly made, or an egg properly boiled, or a slice of bread properly toasted. But she never finds any servant or any friend who can do these simple things &quot;properly&quot;because her &quot;properly&quot; conceals an insatiable demand for the exact, and almost impossible . . .&quot;<br/>\n<br/>\nJJ<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;otherstar&quot; &lt;otherstar@...&gt; wrote:<br/>\n&gt;<br/>\nMy mother in law had a thing about making your bed. I would attempt to make the bed by pulling up the covers. It was a real burden for me to make the bed because 1. I didn&#39;t see the point and 2. I had to do it while holding the baby. Every time I made the bed (or did something else that fulfilled her &quot;needs&quot;), it created resentment. Rather than creating the resentment, she could have just let me shut the door or made the bed herself. I realize that I should have probably seen making the bed as a gift to her because it was her house and one of her needs was to have every bed in the house made at all times. The reason that I had a problem as seeing it as a gift was because she was an adult and her needs trumped everyone else&#39;s. There was a lot of little stuff that were needs for her. </span></blockquote></div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: idea of the &#39;commons&#39;  was: For those who have been unschooling formany years...","postDate":"1261361081","msgId":42498,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQxQjJGNTZEODc0MzQ4NTFCQUVDMEFBOTU3NjM1QTEzQENvbm5pZVBDPg==","inReplyToHeader":"PDRCMkUyQTI1LjQwNzA1MDFAeWFob28uY2E+","referencesHeader":"PDRCMkUyQTI1LjQwNzA1MDFAeWFob28uY2E+"},"prevInTopic":42497,"nextInTopic":42499,"prevInTime":42497,"nextInTime":42499,"topicId":42494,"numMessagesInTopic":0,"msgSnippet":"From: Shira Rocklin ... spouses, with other fairly mature people in our lives, there is a degree of expectation, a sense of the commons, respecting other s","messageBody":"<div id=\"ygrps-yiv-2030223962\">From: Shira Rocklin <br/>\n<br/>\n  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;But, when you have teenagers, 12+, lets say. With roommates, with <br/>\n </span></blockquote>spouses, with other fairly mature people in our lives, there is a degree <br/>\nof expectation, a sense of the &#39;commons,&#39; respecting other&#39;s &#39;needs&#39; <br/>\n(whether they are chosen needs for cleanliness or not), etc. People <br/>\nlive together and there are parts of that which involve compromise and <br/>\nworking together and taking into account other&#39;s needs. I&#39;m not saying <br/>\n&#39;have to&#39;s&#39;. &lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nI am trying to figure out exactly how to phrase this because it isn&#39;t exactly clear in my own head. Part of it stems from my interaction with adults that are constantly focusing on their needs and anything the kids do is seen as interfering with their needs. A lot of those expectations stem from what we want rather than what the other person is actually able/willing to do. I have seen a lot of fairly mature people that have totally different needs than I do. For example, I lived with my mother in law for a while. She is a mature person but her needs trumped everyone else&#39;s and she could not or would not compromise. She could not stop being critical of me, my husband, and my children. My children (all fairly young) were better at recognizing my needs than a supposedly mature adult was. I learned that I had to give up my needs in order to live a happy life. I don&#39;t place a high priority on making my bed or a host of other stuff that I consider incidental. My mother in law had a thing about making your bed. I would attempt to make the bed by pulling up the covers. It was a real burden for me to make the bed because 1. I didn&#39;t see the point and 2. I had to do it while holding the baby. Every time I made the bed (or did something else that fulfilled her &quot;needs&quot;), it created resentment. Rather than creating the resentment, she could have just let me shut the door or made the bed herself. I realize that I should have probably seen making the bed as a gift to her because it was her house and one of her needs was to have every bed in the house made at all times. The reason that I had a problem as seeing it as a gift was because she was an adult and her needs trumped everyone else&#39;s. There was a lot of little stuff that were needs for her. Living in that sort of environment as an adult really gave me a new perspective on kids and how they feel when adults try to force their perspective on them. I still don&#39;t understand why making the bed was such a big deal. I still don&#39;t understand why she needed to comment on every little thing that I did. I still don&#39;t understand why I had to separate my underwear from my pants when I got undressed and turn them all right side out. I still don&#39;t understand why she had to comment on my efforts to do laundry for my own family. I could go on about the things that I didn&#39;t understand. My whole point is that what may seem like perfectly reasonable needs to you may be completely bizarre to other people, especially kids that don&#39;t see the value in it. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;Of needing an area to be &#39;safe.&#39;, say for younger <br/>\n </span></blockquote>siblings/babies to play in. There is a point of mess/dirt at which one <br/>\nmother, one person, may not be able to keep up, and its no longer her <br/>\nchosen need to be clean, but rather a true &#39;need&#39; to be able to prepare <br/>\nfood in a somewhat decent space (say 3 inches of counter, one clean <br/>\ndish, a knife, lol). &lt;&lt;&lt;&lt;<br/>\n<br/>\nIt is funny that you bring this up. I have 4 children. My oldest is 8 and my youngest is 11 months. My older children are all very good at watching out for the little ones. They will pick stuff up to keep things safe for the littlest one or they will tell me about potential dangers so that I can address them. Yes, there are times that the littlest ones get hurt but even a clean house won&#39;t prevent that. I have a tendency to let things go until such a time that I need it to be clean. There are times that the kids feel the need for the house to be clean so they will take some of their own initiative. My husband insists on having a path through the living room so that he can safely make it from the back door to the bedroom when he gets home from work. We don&#39;t clean per se but we do kick toys to the side or toss them in the toy box. I actually think the bigger kid messes are easier to deal with than the little kid messes. My teenage nieces and nephews usually play with electronics rather than with toys that have a bunch of pieces. <br/>\n<br/>\nSome people stay on top of cleaning by doing a little bit all of the time. Other people like me, just let things go and do big cleaning jobs all at once. I have noticed that kids of all ages will work to keep something clean if it is already clean. We have a lot of trash cans around the house so we can throw things away without having to get up and walk into another room. When I am having low periods and need to be recharged, I will buy paper plates and paper cups so we can just throw things away and I won&#39;t have to mess with dirty dishes and will have a counter that is not cluttered with dirty dishes. We will have cleaning days where we all pitch in and do some cleaning. A lot of times we turn it into a game. Even my teenage nieces and nephews will come over and help clean or do whatever I need done. <br/>\n<br/>\nThere are times that I get to the end of my rope and get mad. My kids know that I will take care of them and do stuff for them. But, they also know that I have my limits and that I am not perfect. Yes, I get mad at times but we all work together at being authentic in our relationships with each other. The more I work on being helpful and forgiving towards them, the more they work on being helpful and forgiving towards me. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;It is a gift to clean for our children. I do see that... and daily <br/>\n </span></blockquote>enact it. But, if and when I have 2 or more teenagers, at some point, I <br/>\ncan imagine feeling like its truly unfair to have to clean up after 4 or <br/>\nmore &#39;adult&#39; sized people who make &#39;adult&#39; kinds of messes (cooking, <br/>\nprojects, laundry, etc). Or I can imagine feeling totally overwhelmed <br/>\nor unable to cope, and if I can&#39;t afford &#39;help&#39; then that would be a <br/>\nreal problem.&lt;&lt;&lt;&lt;&lt;&lt; <br/>\n<br/>\nI have 4 children. My 2 year old is in the process of learning to potty in the potty chair and pees/poops all over the house and changes her clothes 5-10 times a day. I have to have a large bag of clothes when I go places to address her constant clothes changing. My 3 oldest girls take several baths a day and it seems like we are always washing towels. Our laundry baskets are always full of dirty clothes even when we are theoretically caught up. My 11 month old likes to pour stuff out so I am constantly cleaning up messes. I am always changing diapers and it seems like they are always leaving dishes and food crumbs all over the house. I cannot imagine that an adult is more messy than little kids. Adults don&#39;t pour food out just to see what it looks and feels like. Adults don&#39;t poop in their pants and paint walls with their poop. Nor do they pee the bed unless there is a major health problem. Adults can strap themselves into the car. You don&#39;t have to hold an adults hand to walk across the parking lot. Adults/teens have a much larger vocabulary and can express their needs more clearly. Whenever I am having a bad day or am unable to cope, I go somewhere or I find someone to talk to. I also remind myself that I am the one that chose to have these children. Children are not given the choice of whether or not to be born. They are not allowed to choose their family. We choose to have our children and the responsibility that goes along with that. So, when I get mad and want to &quot;blame&quot; somebody for something, I remind myself that ultimately, they are my responsibility. Every one of my 4 children are beautiful and unique people that have a host of positive characteristics as well as some negative ones. I try really hard to focus on the positive characteristics because I know how it feels when people choose to only focus on the negative. Luckily, one of the great things about my kids is that they have a huge capacity for forgiveness. I have to ask for their forgiveness quite often. <br/>\n<br/>\nI think part of the problem is that most people have negative attitudes towards teens. Instead of dreading the teen years, I look forward to them. I spend my energies imagining positive activities. I find that when I think about the negative things, I get bogged down and it becomes a self fulfilling prophecy. Think about all of the positive stuff that will come from having teens. I have cleaned up after kids of all ages and adult/teen messes aren&#39;t that much different than little kid messes. <br/>\n<br/>\nConnie <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":309655762,"authorName":"Michele Spout","from":"Michele Spout &lt;michelespout@...&gt;","profile":"michelespout","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: idea of the &#39;commons&#39;  was: For those who have been unschooling formany years...","postDate":"1261350900","msgId":42501,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk4MjU3My44OTg4MC5xbUB3ZWI2MzcwOC5tYWlsLnJlMS55YWhvby5jb20+","inReplyToHeader":"PDRCMkUyQTI1LjQwNzA1MDFAeWFob28uY2E+"},"prevInTopic":42499,"nextInTopic":42509,"prevInTime":42500,"nextInTime":42502,"topicId":42494,"numMessagesInTopic":0,"msgSnippet":"Hi Shira! I m pretty new at unschooling my kids ( 4 and 2) but I ve been raised with a radical approach. I guess this is the reason why I pretty much only","messageBody":"<div id=\"ygrps-yiv-1936551984\">Hi Shira!<br/>\nI&#39;m pretty new at unschooling my kids ( 4 and 2) but I&#39;ve been raised with a radical approach. I guess this is the reason why I pretty much only listen to myself when I have to make decisions. I do my research (from other people, books) but I choose what feels TRUE TO MY HEART.<br/>\nI am very independent! These are some of the attributes we want our children to have when we take a radical approach to raising them. At least this is what I understand when I read the other posts.<br/>\nOne thing that keeps coming to my mind when I read some of the posts is that some moms feel they can&#39;t really ask for what they want or need to their kids ( this is MY opinion, please know I am aware that it may not be true. Also don&#39;t take it personally because I join 3 unschooling Yahoo groups). <br/>\nThe way I see it is if we cannot be open with the ones we love and say &quot;dirty dishes bother me&quot;, can somehow find a middle ground so we can ALL FEEL GOOD about coming to cook or to the kitchen or whatever, you get the point. It seems that most people respond to this with &quot; kids don&#39;t have to&quot;.<br/>\nIf kids are our &quot;partners&quot;, why is it different to ask for help from your husband than your kids? I&#39;m sure more than once we said &quot;honey, would you go change her diaper? Or, she is crying can you go see what&#39;s going on, I have food on the stove right now.  And we were not really asking, we were pretty much saying &quot;go do it&quot;. What&#39;s wrong with asking our kids in the same way? ( Shira is talking about 12 and 14 years old kids, of course we are not talking about 2 or 3 years old)<br/>\nI&#39;ve read posts from moms who are not having time with their husbands because kids are always around (I think the boy was 9). Some of the responses were, &quot;Can you watch TV with your husband in the morning?&quot; Instead of saying, talk to your kid, COMMUNICATE to him &quot;I really miss Daddy, can you find something you enjoy doing in your room so I can have this moment with him?&quot; This is just being real, letting your kid know how we feel about our partners, their parents.<br/>\nAgain, if we can&#39;t be open and ask ( I am saying open I&#39;m not saying demanding) for what we need from the people who love us then I don&#39;t think our kids are going to learn to be open with us and feel safe to speak their hearts either.<br/>\nJust a thought, I&#39;m just trying to help Shira with her feelings.</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: idea of the &#39;commons&#39;  was: For those who have been unschooling formany years...","postDate":"1261337157","msgId":42497,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhnbHRvNSs5b3JhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCMkUyQTI1LjQwNzA1MDFAeWFob28uY2E+"},"prevInTopic":42495,"nextInTopic":42498,"prevInTime":42496,"nextInTime":42498,"topicId":42494,"numMessagesInTopic":0,"msgSnippet":"... In my home, the adult messes may be regular, ever day things, but its the kid sized messes that take over the house. There are aspects of our","messageBody":"<div id=\"ygrps-yiv-501012671\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Shira Rocklin &lt;shirarocklin@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; But, if and when I have 2 or more teenagers, at some point, I <br/>\n&gt; can imagine feeling like its truly unfair to have to clean up after 4 or <br/>\n&gt; more &#39;adult&#39; sized people who make &#39;adult&#39; kinds of messes (cooking, <br/>\n&gt; projects, laundry, etc). <br/>\n<br/>\n </span></blockquote>In my home, the &quot;adult&quot; messes may be regular, ever day things, but its the &quot;kid sized&quot; messes that take over the house. There are aspects of our housekeeping that could be streamlined if we weren&#39;t also looking for ways to accomodate Mo&#39;s needs. For instance, we have an extra set of dishes, essentially, just for Mo, that we keep on low shelves, and she rarely does dishes. As she gets older, and taller, and better able to meet her own needs, we&#39;ll cut out some of those dishes, I suspect. They won&#39;t be helpful anymore. That&#39;s just one example. Having seen Ray go from the fully resistent schooled teen he was when he came from living with his bio mom, to the helpful guy he is now, I&#39;m not worried that Mo will remain oblivious to mess. She&#39;s not entirely oblivious now! <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;People <br/>\n&gt; live together and there are parts of that which involve compromise and <br/>\n&gt; working together and taking into account other&#39;s needs.<br/>\n<br/>\n </span></blockquote>This is part of what I mean about trusting in the human heart. When kids have their emotional needs met regularly, they grow into the ability to accomodate others&#39; needs, too. They don&#39;t have to be &quot;made&quot; to compromise or work together, part of feeling loved and valued includes wanting to extend that feeling to others. How can I help?<br/>\n<br/>\nIn my part of TN, we haven&#39;t had snow, we&#39;ve had pouring rain. So its been mud mud mud, and in my tiny house, that quickly becomes a horrendous mess on the floor. It took mentioning the mud - just mentioning it - for Ray to volunteer to start removing his boots when he comes in. It took exactly the same for George to start. In both cases I didn&#39;t offer a solution, I stated the problem, and the guys decided what would work for them to help resolve the matter.<br/>\n<br/>\nIn other situations I might suggest some possible solutions, if Ray or George couldn&#39;t come up with anything, but in my family that works best if I think of what I&#39;m doing as getting the thinking process rolling. If I&#39;m already invested in my own special solution, I&#39;m likely to get resistance from *both* my guys. Better for me to step back and say &quot;well, I thought about this, but I dunno... what do you think?&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I can imagine feeling totally overwhelmed <br/>\n&gt; or unable to cope, and if I can&#39;t afford &#39;help&#39; then that would be a <br/>\n&gt; real problem. <br/>\n<br/>\n </span></blockquote>It might soothe your fears to read around the lists and see who, exactly is writing in feeling overwhelmed with housework. Parents new to unschooling with older kids can get overwhelmed if they drop all limits, rules and expectations at once (which is why we don&#39;t recommend that!) but the rest of the overwhelmed moms have little kids, often a baby or a pair of toddlers.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And a final thought, on another tangent but suddenly popped in my <br/>\n&gt; head... radical unschooling actually sounds just like anarchy.  Is it <br/>\n&gt; fundamentally the same? <br/>\n<br/>\n </span></blockquote>Depends on what you mean by anarchy ;) There are anarchist communities that are structured (as it were) around a pack model - the strongest (male) rules by right of force. There&#39;s one in my neighborhood, in fact. <br/>\n<br/>\nOtoh, there are other anarchist communities that operate on many of the same principles as radical unschooling (except where children are concerned). It was living in one of these where I learned to value people for the contributions they give the community Other than finances or labor - people who are valued for being charming, good company, good conversationalists, fascinating characters, even if they may also have high needs or outright disabilities that prevent them from &quot;contributing&quot; in the usual sense. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: idea of the &#39;commons&#39;  was: For those who have been unschooling formany years...","postDate":"1261320328","msgId":42495,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg5MDQ0Ny40MzY3LnFtQHdlYjg2MjAxLm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDRCMkUyQTI1LjQwNzA1MDFAeWFob28uY2E+","referencesHeader":"PDRCMkUyQTI1LjQwNzA1MDFAeWFob28uY2E+"},"prevInTopic":42494,"nextInTopic":42497,"prevInTime":42494,"nextInTime":42496,"topicId":42494,"numMessagesInTopic":0,"msgSnippet":"This is all theoretical for you, right? I would quit worrying about it. Work on making each moment good and slowly move forward through time. Don t anticipate","messageBody":"<div id=\"ygrps-yiv-1738664605\">This is all theoretical for you, right? I would quit worrying about it. Work on making each moment good and slowly move forward through time. Don&#39;t anticipate problems. Learn to solve problems as they arise and then move on. The more skilled you become at that, the less likely you will be frustrated in however many years. <br/>\n<br/>\nSchuyler<br/>\n<br/>\nOh, and about anarchy, in it&#39;s most idealized state, maybe there are moments of unschooling and anarchy running parallel. I don&#39;t think I would define what we do as anarchic. There are ties that bind and obligations that arise and authority based on trust and experience that grows that don&#39;t exist in the images of anarchy that I have. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Shira Rocklin &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:shirarocklin@...\">shirarocklin@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Sunday, 20 December, 2009 13:44:05<br/>\nSubject: [unschoolingbasics] Re: idea of the &#39;commons&#39;  was: For those who have been unschooling formany years...<br/>\n<br/>\nBut, when you have teenagers, 12+, lets say.  With roommates, with <br/>\nspouses, with other fairly mature people in our lives, there is a degree <br/>\nof expectation, a sense of the &#39;commons,&#39; respecting other&#39;s &#39;needs&#39; <br/>\n(whether they are chosen needs for cleanliness or not), etc.  People <br/>\nlive together and there are parts of that which involve compromise and <br/>\nworking together and taking into account other&#39;s needs.  I&#39;m not saying <br/>\n&#39;have to&#39;s&#39;.  I&#39;m not saying &#39;children have to take their parents <br/>\n&#39;&#39;need&#39;&#39; for cleanliness as valuable&#39;.  Well, I wish they would, but I <br/>\ncan&#39;t say they &#39;have to&#39;.  But, still... there is that idea of the <br/>\ncommons.  Of needing an area to be &#39;safe.&#39;, say for younger <br/>\nsiblings/babies to play in.  There is a point of mess/dirt at which one <br/>\nmother, one person, may not be able to keep up, and its no longer her <br/>\nchosen need to be clean, but rather a true &#39;need&#39; to be able to prepare <br/>\nfood in a somewhat decent space (say 3 inches of counter, one clean <br/>\ndish, a knife, lol).  I&#39;m trying not to paint extremes here, since that <br/>\nnever seems to work in radical unschooling discussions, but I am trying <br/>\nto hash out some conflicting feelings I&#39;m having. <br/>\n<br/>\nIt is a gift to clean for our children.  I do see that... and daily <br/>\nenact it.  But, if and when I have 2 or more teenagers, at some point, I <br/>\ncan imagine feeling like its truly unfair to have to clean up after 4 or <br/>\nmore &#39;adult&#39; sized people who make &#39;adult&#39; kinds of messes (cooking, <br/>\nprojects, laundry, etc).   Or I can imagine feeling totally overwhelmed <br/>\nor unable to cope, and if I can&#39;t afford &#39;help&#39; then that would be a <br/>\nreal problem. <br/>\n<br/>\nAnd a final thought, on another tangent but suddenly popped in my <br/>\nhead... radical unschooling actually sounds just like anarchy.  Is it <br/>\nfundamentally the same? <br/>\n-<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":251210887,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: idea of the &#39;commons&#39;  was: For those who have been unschooling formany years...","postDate":"1261316645","msgId":42494,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCMkUyQTI1LjQwNzA1MDFAeWFob28uY2E+"},"prevInTopic":0,"nextInTopic":42495,"prevInTime":42493,"nextInTime":42495,"topicId":42494,"numMessagesInTopic":0,"msgSnippet":"Hi everyone, I ve found it interesting to read along.  Thanks for everyone s responses.  Its good to know that somewhere around age 10-12 or so kids start to","messageBody":"<div id=\"ygrps-yiv-122161853\">Hi everyone,<br/>\n<br/>\nI&#39;ve found it interesting to read along.  Thanks for everyone&#39;s <br/>\nresponses.  Its good to know that somewhere around age 10-12 or so kids <br/>\nstart to be a bit interested in being helpful, generally.  I have some <br/>\nother thought/questions that have come up through reading everyone <br/>\nresponses.<br/>\n<br/>\nPutting aside expectations, consequences, emotional bribery and such.  <br/>\nAssuming that kids are something MORE than just roommates, but assuming <br/>\nthey are not &#39;children&#39; (in the conventional sense) but rather &#39;people&#39; <br/>\n(as in thinking, feeling, rational at their level, beings who deserve <br/>\nrespect and love just like adults deserve). <br/>\n<br/>\nSo, I think that everyone is saying that just like a child at 3 who can <br/>\nspeak can &#39;seem&#39; advanced enough to &#39;reason&#39; like an adult, may not be <br/>\nready to clean up toys or potty train, etc.  Or a child at 6-7 looks <br/>\n&#39;ready&#39; to read, or old enough to tie shoelaces, does not mean that they <br/>\nare actually developmentally ready.  And when they are developmentally <br/>\nready, they jump right in, without our prompting, to things that are <br/>\nimportant to their lives, because that is what children do... they have <br/>\nan urge to strive to learn the skills it takes to be adults, in whatever <br/>\norder they want to. <br/>\n<br/>\nBut, when you have teenagers, 12+, lets say.  With roommates, with <br/>\nspouses, with other fairly mature people in our lives, there is a degree <br/>\nof expectation, a sense of the &#39;commons,&#39; respecting other&#39;s &#39;needs&#39; <br/>\n(whether they are chosen needs for cleanliness or not), etc.  People <br/>\nlive together and there are parts of that which involve compromise and <br/>\nworking together and taking into account other&#39;s needs.  I&#39;m not saying <br/>\n&#39;have to&#39;s&#39;.  I&#39;m not saying &#39;children have to take their parents <br/>\n&#39;&#39;need&#39;&#39; for cleanliness as valuable&#39;.  Well, I wish they would, but I <br/>\ncan&#39;t say they &#39;have to&#39;.  But, still... there is that idea of the <br/>\ncommons.  Of needing an area to be &#39;safe.&#39;, say for younger <br/>\nsiblings/babies to play in.  There is a point of mess/dirt at which one <br/>\nmother, one person, may not be able to keep up, and its no longer her <br/>\nchosen need to be clean, but rather a true &#39;need&#39; to be able to prepare <br/>\nfood in a somewhat decent space (say 3 inches of counter, one clean <br/>\ndish, a knife, lol).  I&#39;m trying not to paint extremes here, since that <br/>\nnever seems to work in radical unschooling discussions, but I am trying <br/>\nto hash out some conflicting feelings I&#39;m having. <br/>\n<br/>\nIt is a gift to clean for our children.  I do see that... and daily <br/>\nenact it.  But, if and when I have 2 or more teenagers, at some point, I <br/>\ncan imagine feeling like its truly unfair to have to clean up after 4 or <br/>\nmore &#39;adult&#39; sized people who make &#39;adult&#39; kinds of messes (cooking, <br/>\nprojects, laundry, etc).   Or I can imagine feeling totally overwhelmed <br/>\nor unable to cope, and if I can&#39;t afford &#39;help&#39; then that would be a <br/>\nreal problem. <br/>\n<br/>\nAnd a final thought, on another tangent but suddenly popped in my <br/>\nhead... radical unschooling actually sounds just like anarchy.  Is it <br/>\nfundamentally the same? <br/>\n<br/>\nThanks again,<br/>\nShira</div>","specialLinks":[]}],"prevTopicId":42526,"nextTopicId":42508}}