{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":16,"messages":[{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Physical kid?","postDate":"1243874129","msgId":40367,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgwMTAwaCtqNjAwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlGMUQzQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":40361,"nextInTopic":0,"prevInTime":40366,"nextInTime":40368,"topicId":40329,"numMessagesInTopic":0,"msgSnippet":"~~I m lucky enough to have a hubby who loves to grind his own grain and make dough products from scratch (even bagels!)~~ I m totally jealous! I ve had my eye","messageBody":"<div id=\"ygrps-yiv-104616416\">~~I&#39;m lucky enough to have a hubby who loves to grind his<br/>\nown grain and make dough products from scratch (even bagels!)~~<br/>\n<br/>\n<br/>\nI&#39;m totally jealous! I&#39;ve had my eye on the Nutri-mill grinder for several years. I love making bread and grinding our own grains is the next step.:)<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Physical kid?","postDate":"1243865473","msgId":40361,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlGMUQ1QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":40360,"nextInTopic":40367,"prevInTime":40360,"nextInTime":40362,"topicId":40329,"numMessagesInTopic":0,"msgSnippet":"... don t include yelling At his siblings - can he go yell at you, instead? LOL that too - we d encourage DS to yell as loud as he could - not AT anyone just","messageBody":"<div id=\"ygrps-yiv-1984346736\"><blockquote><span title=\"ireply\">&gt; If yelling helps your guy, look for ways he can yell for release that\r<br/>\n </span></blockquote>don&#39;t include yelling At his siblings - can he go yell at you, instead?\r<br/>\n\r<br/>\nLOL that too - we&#39;d encourage DS to yell as loud as he could - not AT\r<br/>\nanyone just flat out yell. When you really YELL it requires a lot of\r<br/>\nmuscle exertion, plus you have to breath really deeply so it&#39;s a great\r<br/>\nway to get the energy of the moment out. It releases enough of the\r<br/>\noverflow from the emotional bucket that it allows &quot;rational thought and\r<br/>\nexpression&quot; to return.\r<br/>\n\r<br/>\nA helpful resource when DS was younger was Raising your spirited child.\r<br/>\nIt helped me to get my arms around some of the things that I just\r<br/>\ncouldn&#39;t quite put my finger on and develop tools to help with them. One\r<br/>\nidea (which I&#39;ve borrowed and paraphrased) is that everyone has a bucket\r<br/>\nthat holds their emotional level. For most people, there&#39;s an overflow\r<br/>\nhole like on the tub so that it doesn&#39;t overflow often, it just trickles\r<br/>\nout the outlet before it gets over the top. For DS (and other people),\r<br/>\nthat overflow outlet tends to clog and his bucket fills and spills over,\r<br/>\nall over everything. So, if that bucket is near full, ANYTHING (good or\r<br/>\nbad) can tip the balance and send a cascade over everything. That&#39;s why\r<br/>\nsometimes it may seem that things spin out of control after a\r<br/>\n&quot;wonderful&quot; day. &quot;Wonderful&quot; is still putting water into that bucket.\r<br/>\nFinding ways to help &#39;bail&#39; that bucket before it overflows and/or clear\r<br/>\nthe clog so it just trickles out instead of gushing is helpful. I&#39;ve\r<br/>\nalso thought of his need for physical expression as similar to the way a\r<br/>\npregnant woman needs to pee - it&#39;s URGENT (lol) and OFTEN.\r<br/>\n\r<br/>\nDeb R\r<br/>\n\r<br/>\n\r<br/>\n**********************************************************************\r<br/>\nThis email and any files transmitted with it are confidential and\r<br/>\nintended solely for the use of the individual or entity to whom they\r<br/>\nare addressed. If you have received this email in error please notify\r<br/>\nthe system manager.\r<br/>\n\r<br/>\nThis footnote also confirms that this email message has been swept by\r<br/>\nMIMEsweeper for the presence of computer viruses.\r<br/>\n\r<br/>\nwww.mastercam.com\r<br/>\n**********************************************************************\r<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Physical kid?","postDate":"1243864959","msgId":40360,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlGMUQ0QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":40359,"nextInTopic":40361,"prevInTime":40359,"nextInTime":40361,"topicId":40329,"numMessagesInTopic":0,"msgSnippet":"... Gold Mine of fun things to do with an active kid that are easy on the parent - I wish I had her as a resource when Ray was little. LOL thanks - we STILL do","messageBody":"<div id=\"ygrps-yiv-1301270799\"><blockquote><span title=\"ireply\">&gt; Any old posts by Deb Rossing (soggyboysmom) you can find, btw, are a\r<br/>\n </span></blockquote>Gold Mine of fun things to do with an active kid that are easy on the\r<br/>\nparent - I wish I had her as a resource when Ray was little.\r<br/>\n\r<br/>\nLOL thanks - we STILL do lots of physical stuff and DS is turning 11\r<br/>\ntomorrow. I&#39;m pretty amazed that I can STILL take a full on run across\r<br/>\nthe room hit from him without crashing into little pieces (I&#39;m &quot;pulling\r<br/>\n45&quot; NOT &quot;pushing 50&quot; lol). It&#39;s also helpful that now he is able to\r<br/>\nrecognize those needs and both express them when he needs help and help\r<br/>\nhimself address them. For instance, sometimes, he&#39;ll say &quot;I think I need\r<br/>\nto get on the stationary bike for a while&quot; - and he&#39;ll peddle for 20 or\r<br/>\n30 minutes and feel more settled (indoor exercise equipment is great for\r<br/>\nNew England winter nights). For a time, we had both a blow up punching\r<br/>\nbag thing (like those old bop clowns that are weighted to always be\r<br/>\nupright) and an actual kid-model &quot;peanut bag&quot; that needed boxing gloves\r<br/>\n(it hurt otherwise, I tried it!) for him to punch on. A favorite thing\r<br/>\nback a few years (when we still bought gallons of cow&#39;s milk) was to\r<br/>\ncarry the milk up from the car to the kitchen - by the time he was 6 or\r<br/>\n7 he could carry two full gallons up a flight of stairs; yes, he needs\r<br/>\nmuscle exertion. Lifting, carrying, pushing, pulling (anyone for a good\r<br/>\nold fashioned tug of war? Lol), are all good big muscle activities.\r<br/>\n\r<br/>\nAn old favorite (if you can&#39;t find old posts) is for me to sit on the\r<br/>\nend of the bed or edge of the couch and he&#39;d run at me and try to knock\r<br/>\nme backward. I&#39;d resist the first few times and just catch-and-release.\r<br/>\nThen, after a few goes, I&#39;d go over backward taking him with me in a big\r<br/>\nhug. Now his favorite thing is sparring with me - he&#39;ll try to tap my\r<br/>\nhead or shoulder and I block (wax on, wax off lol) - we&#39;ll dance around\r<br/>\nthe living room like that while I pretend to not pay attention and he\r<br/>\ntries to slip by my defenses. Oh, lengths of cheap PVC tucked into cut\r<br/>\ndown to size pool noodles then taped with duct tape to hold the noodle\r<br/>\nin place make great cheap soft boppers to have light saber battles with.\r<br/>\n\r<br/>\nOh, that reminds me - IME folks who are very physical in these ways also\r<br/>\nNEED lots of physical affection - hugs, foot rubs, back rubs, etc. We\r<br/>\neven use &quot;squeeze hugs&quot; as a way for him to get out energy when there&#39;s\r<br/>\nnot a lot of leeway for anything else - he squeezes the stuffing out of\r<br/>\nme and I squeeze him tight as well to put controlled pressure along the\r<br/>\nlarge muscles of his back. Sometimes two or three good squeeze hugs\r<br/>\ndisarm an accelerating potentially difficult situation. And, not only\r<br/>\nare they good muscle exertions but they provide the positive physical\r<br/>\ncontact that he needs - just as people need nutrients from food, he\r<br/>\nneeds hugs and physical contact as nutrients as well. We&#39;ve developed a\r<br/>\nfamily habit over time of &quot;family hugs&quot; (big ole group hugs, sometimes\r<br/>\nwe even invite the dog up into a hug lol) and we also hug each other\r<br/>\nseveral times per day - for instance, if I can see that DS is starting\r<br/>\nto have a rough time, I&#39;ll request a hug because my &#39;hug meter&#39; is low\r<br/>\nand his looks low too. Building in nutritional hugging along with\r<br/>\nfood/protein nutrition seems necessary for him (and DH as well) to stay\r<br/>\nhealthy.\r<br/>\n\r<br/>\nDeb R\r<br/>\n\r<br/>\n\r<br/>\n**********************************************************************\r<br/>\nThis email and any files transmitted with it are confidential and\r<br/>\nintended solely for the use of the individual or entity to whom they\r<br/>\nare addressed. If you have received this email in error please notify\r<br/>\nthe system manager.\r<br/>\n\r<br/>\nThis footnote also confirms that this email message has been swept by\r<br/>\nMIMEsweeper for the presence of computer viruses.\r<br/>\n\r<br/>\nwww.mastercam.com\r<br/>\n**********************************************************************\r<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Physical kid?","postDate":"1243863941","msgId":40359,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlGMUQzQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":40358,"nextInTopic":40360,"prevInTime":40358,"nextInTime":40360,"topicId":40329,"numMessagesInTopic":0,"msgSnippet":"... there s not much complex carb there at all. Yup, that s why we make all our own pasta and bread products from grain we grind ourselves, wheat, rye, corn","messageBody":"<div id=\"ygrps-yiv-369135106\"><blockquote><span title=\"ireply\">&gt; Unless it&#39;s in its whole state (like rice and whole grain pasta)\r<br/>\n </span></blockquote>there&#39;s not much complex carb there at all. \r<br/>\n\r<br/>\n\r<br/>\nYup, that&#39;s why we make all our own pasta and bread products from grain\r<br/>\nwe grind ourselves, wheat, rye, corn (Popcorn makes the BEST\r<br/>\ncornbread!), buckwheat, etc. For health reasons, complex carbs are it -\r<br/>\nstripped out simple carbs are a significant health impact for me. So, I\r<br/>\ndon&#39;t go there. I&#39;m lucky enough to have a hubby who loves to grind his\r<br/>\nown grain and make dough products from scratch (even bagels!)\r<br/>\n\r<br/>\nDeb R\r<br/>\n\r<br/>\n\r<br/>\n**********************************************************************\r<br/>\nThis email and any files transmitted with it are confidential and\r<br/>\nintended solely for the use of the individual or entity to whom they\r<br/>\nare addressed. If you have received this email in error please notify\r<br/>\nthe system manager.\r<br/>\n\r<br/>\nThis footnote also confirms that this email message has been swept by\r<br/>\nMIMEsweeper for the presence of computer viruses.\r<br/>\n\r<br/>\nwww.mastercam.com\r<br/>\n**********************************************************************\r<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Physical kid?","postDate":"1243863565","msgId":40358,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlGMUQyQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":40351,"nextInTopic":40359,"prevInTime":40357,"nextInTime":40359,"topicId":40329,"numMessagesInTopic":0,"msgSnippet":"... Breads, potatoes, rice, pastas are all starches FWIW when DS was younger, he d get the same as you describe - over the top, physical, not seeming to hear","messageBody":"<div id=\"ygrps-yiv-1057498659\"><blockquote><span title=\"ireply\">&gt;&gt; Does Azel seem to have strong cravings for starches?\r<br/>\n\r<br/>\n&gt;Not sure what foods to think of when referring to starches?\r<br/>\n\r<br/>\n </span></blockquote>Breads, potatoes, rice, pastas are all starches\r<br/>\n\r<br/>\nFWIW when DS was younger, he&#39;d get the same as you describe - over the\r<br/>\ntop, physical, not seeming to hear anything we said, etc. to where we&#39;d\r<br/>\nwant (and sometimes need for everyone&#39;s safety) to physically remove him\r<br/>\nfrom a situation. And he&#39;d resist and fight and still not be able to\r<br/>\n&#39;hear&#39; us - until he&#39;d bump his head or stub a toe or whatever. And then\r<br/>\nwe&#39;d help him through the ouch of the moment - it was kind of like in\r<br/>\nthe movies when someone gets hysterical and someone else slaps them to\r<br/>\nbring them out of that state. What we found, over time (sadly more time\r<br/>\nthan I&#39;d like), was that he NEEDS two things regularly - protein and\r<br/>\nmuscle exertion. We started a habit, when things were starting to move\r<br/>\nin that direction but BEFORE they got over the top, of bringing food\r<br/>\nand/or asking him whether he&#39;d like strawberry or grape jam on his PBJ\r<br/>\n(or whether he&#39;d like 8 or 10 crackers with his cheese slices or\r<br/>\nwhatever). He&#39;s learned since then to look for proteins when he starts\r<br/>\nto feel a certain way in his own head (he told us one time way back when\r<br/>\nthat he wanted to stop what he was doing but his brain wouldn&#39;t let\r<br/>\nhim).  Along with that, we&#39;ve found ways for him to use muscles even in\r<br/>\nclose quarters, non-running type situations - we fell back to the old\r<br/>\nconcept of isometric exercises and such. So, if we&#39;re standing in line\r<br/>\nfor something, he might try to push me backward palm to palm. Or, I&#39;ll\r<br/>\npretend to bounce him like a basketball with my hand patting the top of\r<br/>\nhis head as he bounces up and down in place. We&#39;ve also done things like\r<br/>\nI&#39;d put my two hands together palms out, thumbs tucked behind and\r<br/>\noverlapped to create a wall; then he&#39;d punch at my hands to &#39;break&#39; the\r<br/>\nwall; I&#39;d let it give slowly, bit by bit for a few hits until his hand\r<br/>\npunched through and I&#39;d kiss his knuckles and rebuild the wall. As he\r<br/>\ngot a little bigger, I&#39;d call out lefts and rights to make it more\r<br/>\nintriguing. I&#39;ve gotten odd looks from folks on occasion when he has\r<br/>\nsmashed into me full on while I&#39;m chatting - they think he&#39;s being mean\r<br/>\nor trying to hurt me. I know that he&#39;s burning energy and I&#39;m prepared\r<br/>\nfor it (they can&#39;t figure out how I can carry on a pleasant conversation\r<br/>\nwhile being smashed by a kid who is now in the 80-something pound range\r<br/>\nand is only about half a foot shorter than I am - it&#39;s all in the\r<br/>\nbalance). Those are just a few options but we&#39;ve come up with lots of\r<br/>\nways for him to burn energy and use his muscles over the years,\r<br/>\ndepending on where we are and what is appropriate for that venue/space\r<br/>\n(at home we&#39;ll often do pseudo martial arts type sparring, trying to tap\r<br/>\neach other on the shoulder - he&#39;s amazed that ole mom is pretty quick\r<br/>\nfor a mom lol).\r<br/>\n\r<br/>\nDeb R\r<br/>\n\r<br/>\n\r<br/>\n**********************************************************************\r<br/>\nThis email and any files transmitted with it are confidential and\r<br/>\nintended solely for the use of the individual or entity to whom they\r<br/>\nare addressed. If you have received this email in error please notify\r<br/>\nthe system manager.\r<br/>\n\r<br/>\nThis footnote also confirms that this email message has been swept by\r<br/>\nMIMEsweeper for the presence of computer viruses.\r<br/>\n\r<br/>\nwww.mastercam.com\r<br/>\n**********************************************************************\r<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Physical kid?","postDate":"1243811872","msgId":40351,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd2djM3MCtlNm5pQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGQwZGQzNGUzMDkwNTMwMDUzNHgxNmYyZmE5Y3k1MDRiMzIzZGE4MmMwNmU1QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":40348,"nextInTopic":40358,"prevInTime":40350,"nextInTime":40352,"topicId":40329,"numMessagesInTopic":0,"msgSnippet":"Adrean, it sounds like your guy has some pretty big needs. That can be hard with just one kid, I know! but with several, I m sure its extra-challenging. One of","messageBody":"<div id=\"ygrps-yiv-1750842842\">Adrean, it sounds like your guy has some pretty big needs. That can be hard with just one kid, I know! but with several, I&#39;m sure its extra-challenging. <br/>\n<br/>\nOne of the things that helped a whole lot with Ray was to really accept that his needs were bigger and more than everyone elses. It sounds unfair - why should one kid &quot;get&quot; more than the others, but ultimately, it ends up being even more unfair to strive for &quot;balance&quot; and have the higher-need child always melting down bc his needs aren&#39;t being met.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I&#39;m a little stumped on this one.  My youngest twin Azel is 5.  He has<br/>\n&gt; a tendency to not listen to reasoning in the moment and that makes it<br/>\n&gt; difficult for the rest of us.  I&#39;m not sure how to resolve situations<br/>\n&gt; without it getting physical <br/>\n </span></blockquote>********************************<br/>\n<br/>\nGetting physical is actually important! but don&#39;t think so much in terms of &quot;physically&quot; removing or stopping him, think &quot;what physical activity can Engage him right now?&quot; That&#39;s the hard part, because it will likely mean someone... some parent, for example, will have to take the lead and get up and find some fun, physical thing to do with him. Forget reasoning! If he has an unmet need, he&#39;s Unable to listen to reasoning.<br/>\n<br/>\nAny old posts by Deb Rossing (soggyboysmom) you can find, btw, are a Gold Mine of fun things to do with an active kid that are easy on the parent - I wish I had her as a resource when Ray was little.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Azel can be very loving and thoughtful in his own way. He loves to<br/>\n&gt; cuddle and will curl up with me. When he loves he LOVES and when he is<br/>\n&gt; angry he is ANGRY.  Very intense - it&#39;s frustrating because<br/>\n&gt; communication is important to me and emotions prevent that.<br/>\n<br/>\n </span></blockquote>Ahhhhh! Consider those emotions as a form of communication in and of themselves. He&#39;s trying his heart out to communicate! For him, the emotions Have to be communicated first because they are just Soooooo Biiiiiig! So its important to help him find tools to express those emotions, and move past them - and for now, those tools aren&#39;t words. He&#39;s physical, so help him find better physical ways to express himself. Hitting people isn&#39;t a good way to self-express - are there things he Can hit? For Ray, any kind of arm-swinging was helpful, so throwing was good, as was whacking weeds or swinging a rope or stick around in the air. If yelling helps your guy, look for ways he can yell for release that don&#39;t include yelling At his siblings - can he go yell at you, instead? Primal yells, animal sounds, maybe? Ray used to roar like a lion.<br/>\n<br/>\nI<br/>\n<blockquote><span title=\"ireply\"> &gt; feel like I need to physically restrain him from yelling and hitting<br/>\n&gt; his brothers and he does not listen to reasoning as well as they do.<br/>\n&gt; I&#39;d love to catch him before the situation escalates but they are<br/>\n&gt; verbally chattering and I don&#39;t see the signs of anger until it&#39;s too<br/>\n&gt; late. Remember I am deaf.<br/>\n </span></blockquote>****************************<br/>\n<br/>\nTalk with him about these things Outside of any stressful situation, and make some plans with him. Make a clear plan of action for the next time certain kinds of situations come up, and see how it goes. Afterwards, talk with him about it - did that work? What can we change for next time?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;he does not listen to reasoning as well as they do.<br/>\n<br/>\n </span></blockquote>He&#39;s a different person with different needs. That&#39;s challenging - I learned a whole bunch of parenting skills with Ray that are utterly useless with Mo! Know that its okay to use different strategies with different kids - better than okay, its More respectful of all your children.<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":328141476,"authorName":"Adrean Clark","from":"Adrean Clark &lt;adreanaline@...&gt;","profile":"fuzzyellowduck","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Physical kid?","postDate":"1243786793","msgId":40348,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQwZGQzNGUzMDkwNTMxMDkxOXgzOTY5Y2JhNGo5NmUwNTlkN2EyYjJkNzZiQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDk3OUUxMTJGLUUzRjYtNEU2Ni05ODQyLTM1MENDOEFDQkExMUB2ZXJpem9uLm5ldD4=","referencesHeader":"PGd2dTA5ZCtha2tsQGVHcm91cHMuY29tPgkgPDk3OUUxMTJGLUUzRjYtNEU2Ni05ODQyLTM1MENDOEFDQkExMUB2ZXJpem9uLm5ldD4="},"prevInTopic":40347,"nextInTopic":40351,"prevInTime":40347,"nextInTime":40349,"topicId":40329,"numMessagesInTopic":0,"msgSnippet":"Thanks for the list -- Yes he does eat a lot of those.  I ve been lousy with coordinating our food because the kids don t like what I and my husband eat.  I","messageBody":"<div id=\"ygrps-yiv-1147823694\">Thanks for the list -- Yes he does eat a lot of those.  I&#39;ve been<br/>\nlousy with coordinating our food because the kids don&#39;t like what I<br/>\nand my husband eat.  I have been offering them what we eat and it<br/>\nseems their tastebuds can&#39;t stand veggies right now.  My food is more<br/>\nstrict because of the Body Ecology Diet now, but DH has said he&#39;ll eat<br/>\nwhat I eat.<br/>\n<br/>\nI looked at the tests and while they look great, they are expensive. I<br/>\nam going to try and see if we can get the pediatrician to test all of<br/>\nthe boys, so insurance can cover it.<br/>\n<br/>\nThere&#39;s been discussions about special diets already on this list and<br/>\nwe&#39;ve had success in eliminating dairy with the twins.  I will read<br/>\nthose again. Gluten is going to be a challenge.  I need to find easier<br/>\nways to make more delicious foods to offer them :/<br/>\n<br/>\nAdrean<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 5/31/09, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt; On May 31, 2009, at 9:21 AM, Ren Allen wrote:<br/>\n&gt;<br/>\n&gt;&gt; Several of the above are also simple carbs because they&#39;ve been<br/>\n&gt;&gt; stripped of their fiber and all other nutritious parts. Unless it&#39;s<br/>\n&gt;&gt; in it&#39;s whole state (like rice and whole grain pasta) there&#39;s not<br/>\n&gt;&gt; much complex carb there at all.<br/>\n&gt;<br/>\n&gt; I believe complex refers to its chemical structure, not to its<br/>\n&gt; nutrition. My daughter is hovering and wants the computer ;-) so<br/>\n&gt; here&#39;s the first one that made sense:<br/>\n&gt;<br/>\n&gt;&gt; Complex carbohydrates, or polysaccharides, are composed of simple<br/>\n&gt;&gt; sugar units in long chains called polymers. Three polysaccharides<br/>\n&gt;&gt; are of particular importance in human nutrition: starch, glycogen,<br/>\n&gt;&gt; and dietary fiber.<br/>\n&gt;<br/>\n&gt; Joyce<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n-- <br/>\nSent from Gmail for mobile | mobile.google.com </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Physical kid?","postDate":"1243779344","msgId":40347,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk3OUUxMTJGLUUzRjYtNEU2Ni05ODQyLTM1MENDOEFDQkExMUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGd2dTA5ZCtha2tsQGVHcm91cHMuY29tPg==","referencesHeader":"PGd2dTA5ZCtha2tsQGVHcm91cHMuY29tPg=="},"prevInTopic":40346,"nextInTopic":40348,"prevInTime":40346,"nextInTime":40348,"topicId":40329,"numMessagesInTopic":0,"msgSnippet":"... I believe complex refers to its chemical structure, not to its nutrition. My daughter is hovering and wants the computer ;-) so ... Joyce [Non-text","messageBody":"<div id=\"ygrps-yiv-98787499\">On May 31, 2009, at 9:21 AM, Ren Allen wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Several of the above are also simple carbs because they&#39;ve been  <br/>\n&gt; stripped of their fiber and all other nutritious parts. Unless it&#39;s  <br/>\n&gt; in it&#39;s whole state (like rice and whole grain pasta) there&#39;s not  <br/>\n&gt; much complex carb there at all.<br/>\n<br/>\n </span></blockquote>I believe complex refers to its chemical structure, not to its  <br/>\nnutrition. My daughter is hovering and wants the computer ;-) so  <br/>\nhere&#39;s the first one that made sense:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Complex carbohydrates, or polysaccharides, are composed of simple  <br/>\n&gt; sugar units in long chains called polymers. Three polysaccharides  <br/>\n&gt; are of particular importance in human nutrition: starch, glycogen,  <br/>\n&gt; and dietary fiber.<br/>\n<br/>\n </span></blockquote>Joyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Physical kid?","postDate":"1243776109","msgId":40346,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd2dTA5ZCtha2tsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENGQzE0RTA1LURERTktNDNDMC05QzlDLUZCRTY5RDlBQjMxMUB2ZXJpem9uLm5ldD4="},"prevInTopic":40345,"nextInTopic":40347,"prevInTime":40345,"nextInTime":40347,"topicId":40329,"numMessagesInTopic":0,"msgSnippet":"... Several of the above are also simple carbs because they ve been stripped of their fiber and all other nutritious parts. Unless it s in it s whole state","messageBody":"<div id=\"ygrps-yiv-416041593\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; On May 31, 2009, at 12:35 AM, Adrean Clark wrote:<br/>\n&gt; <br/>\n&gt; &gt; Not sure what foods to think of when referring to starches?<br/>\n&gt; <br/>\n&gt; Bread<br/>\n&gt; Pasta<br/>\n&gt; Cereal<br/>\n&gt; Noodles (basically anything wheat based)<br/>\n&gt; Rice<br/>\n&gt; Corn<br/>\n&gt; Potatoes<br/>\n&gt; <br/>\n&gt; Also known as complex carbohydrates. (Simple carbohydrates are sugars.)<br/>\n&gt; <br/>\n&gt; Joyce<br/>\n<br/>\n<br/>\n </span></blockquote>Several of the above are also simple carbs because they&#39;ve been stripped of their fiber and all other nutritious parts. Unless it&#39;s in it&#39;s whole state (like rice and whole grain pasta) there&#39;s not much complex carb there at all. <br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Physical kid?","postDate":"1243772653","msgId":40345,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENGQzE0RTA1LURERTktNDNDMC05QzlDLUZCRTY5RDlBQjMxMUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGQwZGQzNGUzMDkwNTMwMjEzNWc4MTBlMjM2cDg5ODMzNjA3ZDNmNTI0OTlAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PDEyMTc3Mi4zNjMyLnFtQHdlYjQ1NzAxLm1haWwuc3AxLnlhaG9vLmNvbT4gPGQwZGQzNGUzMDkwNTMwMjAwM243MjJkYjM4NXEzNTRlOTAxYTNjYTA3YzhlQG1haWwuZ21haWwuY29tPiA8NjNlY2E3NmMwOTA1MzAyMDExbDdmZDI4ZDA3eGZkNTcxODg4MjM5OWJlNzVAbWFpbC5nbWFpbC5jb20+IDxkMGRkMzRlMzA5MDUzMDIxMzVnODEwZTIzNnA4OTgzMzYwN2QzZjUyNDk5QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":40344,"nextInTopic":40346,"prevInTime":40344,"nextInTime":40346,"topicId":40329,"numMessagesInTopic":0,"msgSnippet":"... Bread Pasta Cereal Noodles (basically anything wheat based) Rice Corn Potatoes Also known as complex carbohydrates. (Simple carbohydrates are sugars.) ","messageBody":"<div id=\"ygrps-yiv-371646815\">On May 31, 2009, at 12:35 AM, Adrean Clark wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Not sure what foods to think of when referring to starches?<br/>\n<br/>\n </span></blockquote>Bread<br/>\nPasta<br/>\nCereal<br/>\nNoodles (basically anything wheat based)<br/>\nRice<br/>\nCorn<br/>\nPotatoes<br/>\n<br/>\nAlso known as complex carbohydrates. (Simple carbohydrates are sugars.)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":328141476,"authorName":"Adrean Clark","from":"Adrean Clark &lt;adreanaline@...&gt;","profile":"fuzzyellowduck","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Physical kid?","postDate":"1243744512","msgId":40344,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQwZGQzNGUzMDkwNTMwMjEzNWc4MTBlMjM2cDg5ODMzNjA3ZDNmNTI0OTlAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDYzZWNhNzZjMDkwNTMwMjAxMWw3ZmQyOGQwN3hmZDU3MTg4ODIzOTliZTc1QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDEyMTc3Mi4zNjMyLnFtQHdlYjQ1NzAxLm1haWwuc3AxLnlhaG9vLmNvbT4JIDxkMGRkMzRlMzA5MDUzMDIwMDNuNzIyZGIzODVxMzU0ZTkwMWEzY2EwN2M4ZUBtYWlsLmdtYWlsLmNvbT4JIDw2M2VjYTc2YzA5MDUzMDIwMTFsN2ZkMjhkMDd4ZmQ1NzE4ODgyMzk5YmU3NUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":40343,"nextInTopic":40345,"prevInTime":40343,"nextInTime":40345,"topicId":40329,"numMessagesInTopic":0,"msgSnippet":"... Not sure what foods to think of when referring to starches? Adrean","messageBody":"<div id=\"ygrps-yiv-1177564868\"><blockquote><span title=\"ireply\">&gt; Does Azel seem to have strong cravings for starches?<br/>\n<br/>\n </span></blockquote>Not sure what foods to think of when referring to starches?<br/>\n<br/>\n<br/>\nAdrean</div>","specialLinks":[]},{"userId":321209154,"authorName":"Melissa Lake","from":"Melissa Lake &lt;melis108@...&gt;","profile":"melis108","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Physical kid?","postDate":"1243739460","msgId":40343,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzZWNhNzZjMDkwNTMwMjAxMWw3ZmQyOGQwN3hmZDU3MTg4ODIzOTliZTc1QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGQwZGQzNGUzMDkwNTMwMjAwM243MjJkYjM4NXEzNTRlOTAxYTNjYTA3YzhlQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDEyMTc3Mi4zNjMyLnFtQHdlYjQ1NzAxLm1haWwuc3AxLnlhaG9vLmNvbT4JIDxkMGRkMzRlMzA5MDUzMDIwMDNuNzIyZGIzODVxMzU0ZTkwMWEzY2EwN2M4ZUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":40342,"nextInTopic":40344,"prevInTime":40342,"nextInTime":40344,"topicId":40329,"numMessagesInTopic":0,"msgSnippet":"First I had him tested through enterolab.com (a stool test) and that just tested for gluten and casein.  Enterolab also did some DNA testing on him. Then, we","messageBody":"<div id=\"ygrps-yiv-978078067\">First I had him tested through enterolab.com (a stool test) and that just<br/>\ntested for gluten and casein.  Enterolab also did some DNA testing on him.<br/>\n Then, we took him to our Naturopath and she did a blood test that tested<br/>\nfor 85 different foods.<br/>\nIf he is allergic to dairy, I&#39;d really suggest looking into the gluten<br/>\nthing.  My son is more sensitive to gluten than casein, but they are very<br/>\nsimilar proteins and that is why sensitivities to them sometimes go hand in<br/>\nhand.<br/>\n<br/>\nDoes Azel seem to have strong cravings for starches?<br/>\n<blockquote><span title=\"qreply\"> On Sat, May 30, 2009 at 8:03 PM, Adrean Clark &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:adreanaline@...\">adreanaline@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Azel is allergic to dairy. He usually doesn&#39;t eat it as I am allergic<br/>\n&gt; to it too and we have many options available instead of dairy. I<br/>\n&gt; think diet modification is good, definitely need to work on making<br/>\n&gt; GFCF monkey platters available. Thinking back, it seems like his<br/>\n&gt; behavior worsens when he&#39;s hungry or tired. So I need to work on<br/>\n&gt; those platters and feed him every 2-3 hours.<br/>\n&gt;<br/>\n&gt; What test did your son have for the allergies? We found out about the<br/>\n&gt; dairy from reflex testing (probably wrong name for it).<br/>\n&gt;<br/>\n&gt; Adrean<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n&quot;It&#39;s not that the world is a good classroom; it&#39;s that classrooms are poor<br/>\nworlds.&quot;  Grace Llewellyn<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":328141476,"authorName":"Adrean Clark","from":"Adrean Clark &lt;adreanaline@...&gt;","profile":"fuzzyellowduck","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Physical kid?","postDate":"1243739022","msgId":40342,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQwZGQzNGUzMDkwNTMwMjAwM243MjJkYjM4NXEzNTRlOTAxYTNjYTA3YzhlQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDEyMTc3Mi4zNjMyLnFtQHdlYjQ1NzAxLm1haWwuc3AxLnlhaG9vLmNvbT4=","referencesHeader":"PDEyMTc3Mi4zNjMyLnFtQHdlYjQ1NzAxLm1haWwuc3AxLnlhaG9vLmNvbT4="},"prevInTopic":40339,"nextInTopic":40343,"prevInTime":40341,"nextInTime":40343,"topicId":40329,"numMessagesInTopic":0,"msgSnippet":"Azel is allergic to dairy.  He usually doesn t eat it as I am allergic to it too and we have many options available instead of dairy.  I think diet","messageBody":"<div id=\"ygrps-yiv-1400858855\">Azel is allergic to dairy.  He usually doesn&#39;t eat it as I am allergic<br/>\nto it too and we have many options available instead of dairy.  I<br/>\nthink diet modification is good, definitely need to work on making<br/>\nGFCF monkey platters available.  Thinking back, it seems like his<br/>\nbehavior worsens when he&#39;s hungry or tired.  So I need to work on<br/>\nthose platters and feed him every 2-3 hours.<br/>\n<br/>\nWhat test did your son have for the allergies? We found out about the<br/>\ndairy from reflex testing (probably wrong name for it).<br/>\n<br/>\nAdrean</div>","specialLinks":[]},{"userId":341403472,"authorName":"Mary Hatfield","from":"Mary Hatfield &lt;mhmarah@...&gt;","profile":"mhmarah","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Physical kid?","postDate":"1243719328","msgId":40339,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyMTc3Mi4zNjMyLnFtQHdlYjQ1NzAxLm1haWwuc3AxLnlhaG9vLmNvbT4="},"prevInTopic":40335,"nextInTopic":40342,"prevInTime":40338,"nextInTime":40340,"topicId":40329,"numMessagesInTopic":0,"msgSnippet":"Hi Adrean, I have to agree with Melissa s suggestion.  Ever since starting  my son on a gluten free/dairy free diet we have seen remarkable positive changes","messageBody":"<div id=\"ygrps-yiv-1115429079\">Hi Adrean,<br/>\n<br/>\nI have to agree with Melissa&#39;s suggestion.  Ever since starting  my son on a gluten free/dairy free diet we have seen remarkable positive changes in his behavior.  I can tell when he has had even the smallest amount of gluten or dairy because it makes him very anxious and almost hyper.  He also complains of his stomach hurting, so he has taken a very active role in avoiding these foods.  I am very concerned about food dyes as well.  I have heard many other moms swear that their child&#39;s behavior would change after eating food with dyes.  I had no idea that diet could so dramatically affect children.<br/>\n<br/>\nMary <br/>\n<br/>\n<br/>\n<br/>\n\t <br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t<br/>\n<br/>\n<br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":321209154,"authorName":"Melissa Lake","from":"Melissa Lake &lt;melis108@...&gt;","profile":"melis108","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Physical kid?","postDate":"1243699133","msgId":40335,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzZWNhNzZjMDkwNTMwMDg1OHY0Mzk3YTc3NW83Y2JjMjZhYTlhMjdkZmUyQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGQwZGQzNGUzMDkwNTMwMDUzNHgxNmYyZmE5Y3k1MDRiMzIzZGE4MmMwNmU1QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGQwZGQzNGUzMDkwNTMwMDUzNHgxNmYyZmE5Y3k1MDRiMzIzZGE4MmMwNmU1QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":40329,"nextInTopic":40339,"prevInTime":40334,"nextInTime":40336,"topicId":40329,"numMessagesInTopic":0,"msgSnippet":"Hi Adrean, Wow, Azel sounds a whole lot like my 11 year old.  We had allergy testing done on our son and he is highly sensitive to gluten, casein and eggs.  I ","messageBody":"<div id=\"ygrps-yiv-33471162\">Hi Adrean,<br/>\n<br/>\nWow, Azel sounds a whole lot like my 11 year old.  We had allergy testing<br/>\ndone on our son and he is highly sensitive to gluten, casein and eggs.  I<br/>\nhave suspicions that he is also sensitive to artificial colors.  Anyway,<br/>\ntaking him off of these foods has made a HUGE difference in his emotions and<br/>\nbehavior.  He would go from 1 to 10 on in a flash and he just couldn&#39;t seem<br/>\nto settle himself down.  What really got us pushing hard for answers was<br/>\nwhen he started having anxiety.  That is all gone now.<br/>\n<br/>\nJust a thought.  If you want more info, I&#39;d be happy to talk more in detail<br/>\nabout how we stumbled upon Nathan&#39;s food intolerances.  Nathan is still an<br/>\nintense kid and I&#39;m so glad for that...I mean he has the sweetest heart and<br/>\nstill comes up to me and hugs me saying, &quot;I love you, Mommy!&quot;  The other<br/>\nday, he was yelling at his older brother and I asked him to please not yell<br/>\nand he replied, &quot;I&#39;m not yelling!  I&#39;m just raising my voice for<br/>\nemphasis!!&quot;  :)<br/>\n<br/>\nHugs,<br/>\nMelissa<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, May 30, 2009 at 5:34 AM, Adrean Clark &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:adreanaline@...\">adreanaline@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I&#39;m a little stumped on this one. My youngest twin Azel is 5. He has<br/>\n&gt; a tendency to not listen to reasoning in the moment and that makes it<br/>\n&gt; difficult for the rest of us. I&#39;m not sure how to resolve situations<br/>\n&gt; without it getting physical -- whether me removing him from it by<br/>\n&gt; picking him up and preventing him from coming in or him from<br/>\n&gt; confronting his brothers.<br/>\n&gt;<br/>\n&gt; For example last night, it was late and I was laying down in the same<br/>\n&gt; room with them as they were watching a movie. Azel was flopping around<br/>\n&gt; on the floor giggling with his twin Armand. I knew they were tired so<br/>\n&gt; I asked Armand to lay down with me quietly and pointed out their<br/>\n&gt; laughing would bother others. I also told Azel the same thing. Their<br/>\n&gt; older brother Jael (9) was on the laptop. Jael was getting<br/>\n&gt; increasingly annoyed at them and I told him that he has the choice of<br/>\n&gt; leaving the room and if he stayed he can&#39;t complain about them making<br/>\n&gt; noise because he chose to stay.<br/>\n&gt;<br/>\n&gt; Azel continued to move and burrow under the blankets on the floor and<br/>\n&gt; started telling Armand to stop giggling. It was not helping and he was<br/>\n&gt; ignoring my attempts to talk with him, so I picked him up and moved<br/>\n&gt; him out of the room. I tried to explain to him that his actions were<br/>\n&gt; disturbing the rest of us (he was the only one moving around and<br/>\n&gt; talking by that time) but he refused to look at me and continued to<br/>\n&gt; try and get back in the room. I tried to explain to him that he was<br/>\n&gt; welcome to come back in if he would be quiet with us but he continued<br/>\n&gt; to physically try to get back in. I had to push him back gently to<br/>\n&gt; stop him and get him to look at me.<br/>\n&gt;<br/>\n&gt; He lost his balance and bumped his head on the door frame. It hurt and<br/>\n&gt; he started crying. Finally he looked at me and we could talk. I said<br/>\n&gt; I&#39;m sorry for the bump and told him he was welcome to come back in and<br/>\n&gt; stay with us but he needed to be quiet, it is time to rest.<br/>\n&gt;<br/>\n&gt; Azel tends to do things like this -- he is very intense at times. I<br/>\n&gt; feel like I need to physically restrain him from yelling and hitting<br/>\n&gt; his brothers and he does not listen to reasoning as well as they do.<br/>\n&gt; I&#39;d love to catch him before the situation escalates but they are<br/>\n&gt; verbally chattering and I don&#39;t see the signs of anger until it&#39;s too<br/>\n&gt; late. Remember I am deaf.<br/>\n&gt;<br/>\n&gt; Another example -- earlier we went to the bus stop to drop off John.<br/>\n&gt; Azel has his own Nintendo DS and was playing Jael&#39;s game on it. Jael<br/>\n&gt; wanted his game back. I explained to Azel that the game is Jael&#39;s and<br/>\n&gt; he needs to be fair in sharing and taking turns because its his DS and<br/>\n&gt; Jael&#39;s game. I asked him to finish what he was doing and then let Jael<br/>\n&gt; have his turn. Azel continued to play without regarding Jael so I<br/>\n&gt; warned him that if he continued to ignore Jael I would step in. So I<br/>\n&gt; watched him finish the minigame on the DS and then at a reasonable<br/>\n&gt; pause (Jael pushed pause and I told him that&#39;s not nice, to let Azel<br/>\n&gt; do it himself.). Well he continued to refuse and I took out the<br/>\n&gt; cartridge and gave it back to Jael and turned back on the DS so Azel<br/>\n&gt; could play in Pictochat.<br/>\n&gt;<br/>\n&gt; Azel said &quot;I don&#39;t like drawing!&quot; And held up his arm to throw the DS<br/>\n&gt; on the asphalt. I yelled no! But it ended up on the asphalt with a<br/>\n&gt; cracked case as Azel sulked. I was very angry and picked it up,<br/>\n&gt; saying &quot;Since you threw it away, it&#39;s mine now.&quot;. Azel said &quot;No!&quot;.<br/>\n&gt;<br/>\n&gt; John said the DS was really Azel&#39;s and that I had given it to him.<br/>\n&gt; Better to say that I won&#39;t follow through with my plan of buying him a<br/>\n&gt; new one because he didn&#39;t take care of the one he has (the top screen<br/>\n&gt; has a defect and it can only play GBA games, hence my hope of getting<br/>\n&gt; him a new DS) I said to Azel &quot;I&#39;m sorry for taking it, it really is<br/>\n&gt; yours. But because you didn&#39;t take care of it, I&#39;m not comfortable<br/>\n&gt; buying a new one for you.&quot; Azel got upset and started crying that he<br/>\n&gt; wants a new one. I said look at the case, you cracked it by throwing<br/>\n&gt; it. No.<br/>\n&gt;<br/>\n&gt; Azel can be very very intense with his emotions. He&#39;s physically<br/>\n&gt; bigger than his twin and built like a tank with a solid chest. Armand,<br/>\n&gt; I can reason with and can explain concepts -- he seems to understand<br/>\n&gt; waiting patiently for something to happen. Azel demands it now! And<br/>\n&gt; has explosions where he won&#39;t listen to anyone at all until it&#39;s over.<br/>\n&gt; He doesn&#39;t seem to emotionally understand why things can&#39;t happen<br/>\n&gt; right now. I don&#39;t like restraining him from situations and from<br/>\n&gt; hurting people because it might end in him getting hurt himself and<br/>\n&gt; that does not help him understand any better.<br/>\n&gt;<br/>\n&gt; Azel can be very loving and thoughtful in his own way. He loves to<br/>\n&gt; cuddle and will curl up with me. When he loves he LOVES and when he is<br/>\n&gt; angry he is ANGRY. Very intense - it&#39;s frustrating because<br/>\n&gt; communication is important to me and emotions prevent that.<br/>\n&gt;<br/>\n&gt; What are some ways to help him deal with his emotions and help him<br/>\n&gt; understand? What can I do better?<br/>\n&gt;<br/>\n&gt; Adrean<br/>\n&gt;<br/>\n&gt; --<br/>\n&gt; Sent from Gmail for mobile | mobile.google.com<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n&quot;It&#39;s not that the world is a good classroom; it&#39;s that classrooms are poor<br/>\nworlds.&quot;  Grace Llewellyn<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":328141476,"authorName":"Adrean Clark","from":"Adrean Clark &lt;adreanaline@...&gt;","profile":"fuzzyellowduck","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Physical kid?","postDate":"1243686855","msgId":40329,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQwZGQzNGUzMDkwNTMwMDUzNHgxNmYyZmE5Y3k1MDRiMzIzZGE4MmMwNmU1QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":40335,"prevInTime":40328,"nextInTime":40330,"topicId":40329,"numMessagesInTopic":0,"msgSnippet":"I m a little stumped on this one.  My youngest twin Azel is 5.  He has a tendency to not listen to reasoning in the moment and that makes it difficult for the","messageBody":"<div id=\"ygrps-yiv-1054476228\">I&#39;m a little stumped on this one.  My youngest twin Azel is 5.  He has<br/>\na tendency to not listen to reasoning in the moment and that makes it<br/>\ndifficult for the rest of us.  I&#39;m not sure how to resolve situations<br/>\nwithout it getting physical -- whether me removing him from it by<br/>\npicking him up and preventing him from coming in or him from<br/>\nconfronting his brothers.<br/>\n<br/>\nFor example last night, it was late and I was laying down in the same<br/>\nroom with them as they were watching a movie. Azel was flopping around<br/>\non the floor giggling with his twin Armand. I knew they were tired so<br/>\nI asked Armand to lay down with me quietly and pointed out their<br/>\nlaughing would bother others.  I also told Azel the same thing. Their<br/>\nolder brother Jael (9) was on the laptop.  Jael was getting<br/>\nincreasingly annoyed at them and I told him that he has the choice of<br/>\nleaving the room and if he stayed he can&#39;t complain about them making<br/>\nnoise because he chose to stay.<br/>\n<br/>\nAzel continued to move and burrow under the blankets on the floor and<br/>\nstarted telling Armand to stop giggling. It was not helping and he was<br/>\nignoring my attempts to talk with him, so I picked him up and moved<br/>\nhim out of the room. I tried to explain to him that his actions were<br/>\ndisturbing the rest of us (he was the only one moving around and<br/>\ntalking by that time) but he refused to look at me and continued to<br/>\ntry and get back in the room. I tried to explain to him that he was<br/>\nwelcome to come back in if he would be quiet with us but he continued<br/>\nto physically try to get back in. I had to push him back gently to<br/>\nstop him and get him to look at me.<br/>\n<br/>\nHe lost his balance and bumped his head on the door frame. It hurt and<br/>\nhe started crying. Finally he looked at me and we could talk. I said<br/>\nI&#39;m sorry for the bump and told him he was welcome to come back in and<br/>\nstay with us but he needed to be quiet, it is time to rest.<br/>\n<br/>\nAzel tends to do things like this -- he is very intense at times. I<br/>\nfeel like I need to physically restrain him from yelling and hitting<br/>\nhis brothers and he does not listen to reasoning as well as they do.<br/>\nI&#39;d love to catch him before the situation escalates but they are<br/>\nverbally chattering and I don&#39;t see the signs of anger until it&#39;s too<br/>\nlate. Remember I am deaf.<br/>\n<br/>\nAnother example -- earlier we went to the bus stop to drop off John.<br/>\nAzel has his own Nintendo DS and was playing Jael&#39;s game on it. Jael<br/>\nwanted his game back. I explained to Azel that the game is Jael&#39;s and<br/>\nhe needs to be fair in sharing and taking turns because its his DS and<br/>\nJael&#39;s game. I asked him to finish what he was doing and then let Jael<br/>\nhave his turn.  Azel continued to play without regarding Jael so I<br/>\nwarned him that if he continued to ignore Jael I would step in.  So I<br/>\nwatched him finish the minigame on the DS and then at a reasonable<br/>\npause (Jael pushed pause and I told him that&#39;s not nice, to let Azel<br/>\ndo it himself.). Well he continued to refuse and I took out the<br/>\ncartridge and gave it back to Jael and turned back on the DS so Azel<br/>\ncould play in Pictochat.<br/>\n<br/>\nAzel said &quot;I don&#39;t like drawing!&quot; And held up his arm to throw the DS<br/>\non the asphalt. I yelled no! But it ended up on the asphalt with a<br/>\ncracked case as Azel sulked.  I was very angry and picked it up,<br/>\nsaying &quot;Since you threw it away, it&#39;s mine now.&quot;. Azel said &quot;No!&quot;.<br/>\n<br/>\nJohn said the DS was really Azel&#39;s and that I had given it to him.<br/>\nBetter to say that I won&#39;t follow through with my plan of buying him a<br/>\nnew one because he didn&#39;t take care of the one he has (the top screen<br/>\nhas a defect and it can only play GBA games, hence my hope of getting<br/>\nhim a new DS) I said to Azel &quot;I&#39;m sorry for taking it, it really is<br/>\nyours. But because you didn&#39;t take care of it, I&#39;m not comfortable<br/>\nbuying a new one for you.&quot; Azel got upset and started crying that he<br/>\nwants a new one. I said look at the case, you cracked it by throwing<br/>\nit. No.<br/>\n<br/>\nAzel can be very very intense with his emotions. He&#39;s physically<br/>\nbigger than his twin and built like a tank with a solid chest. Armand,<br/>\nI can reason with and can explain concepts -- he seems to understand<br/>\nwaiting patiently for something to happen.  Azel demands it now! And<br/>\nhas explosions where he won&#39;t listen to anyone at all until it&#39;s over.<br/>\nHe doesn&#39;t seem to emotionally understand why things can&#39;t happen<br/>\nright now. I don&#39;t like restraining him from situations and from<br/>\nhurting people because it might end in him getting hurt himself and<br/>\nthat does not help him understand any better.<br/>\n<br/>\nAzel can be very loving and thoughtful in his own way. He loves to<br/>\ncuddle and will curl up with me. When he loves he LOVES and when he is<br/>\nangry he is ANGRY.  Very intense - it&#39;s frustrating because<br/>\ncommunication is important to me and emotions prevent that.<br/>\n<br/>\nWhat are some ways to help him deal with his emotions and help him<br/>\nunderstand? What can I do better?<br/>\n<br/>\nAdrean<br/>\n<br/>\n-- <br/>\nSent from Gmail for mobile | mobile.google.com</div>","specialLinks":[]}],"prevTopicId":40356,"nextTopicId":40293}}