{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":12116257,"authorName":"michele-nappi@webtv.net","from":"michele-nappi@...","profile":"whitelight_2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Digest Number 112","postDate":"1090085733","msgId":2192,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM1MzUtNDBGOTYzNjUtNDk1QHN0b3JlZnVsbC0zMTU0LmJheS53ZWJ0di5uZXQ+","inReplyToHeader":"dW5zY2hvb2xpbmdiYXNpY3NAeWFob29ncm91cHMuY29tJ3MgbWVzc2FnZSBvZiAxNyBKdWwgMjAwNAkwMjo0NjoyNCAtMDAwMA=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":2191,"nextInTime":2193,"topicId":2192,"numMessagesInTopic":0,"msgSnippet":"I believe in unschooling. That doesn t mean I have rerouted all my old thoughts or erased all the old tapes running in my head:) I have always done the best","messageBody":"<div id=\"ygrps-yiv-1060386028\">I believe in unschooling. That doesn&#39;t mean I have rerouted all my &quot;old&quot;<br/>\nthoughts or erased all the old tapes running in my head:) I have always<br/>\ndone the best I could to unschool myself. Whether or not I believed<br/>\nmyself was the clincher. I wasn&#39;t sure if I should believe what I was<br/>\ntaught by family, school, society, etc. or my own thoughts. Luckily I am<br/>\nfairly stubborn. I gave birth to six children and opened my heart to<br/>\nanother who is our fosterson soon to be adopted. Of coarse there has<br/>\nbeen the usual situations and some really difficult ones. I still<br/>\nremember the ache in my heart when each of my kids went to kindergarten.<br/>\nI am glad I finally believed in myself enought to unschool. I am having<br/>\na hard time though with my own thought patterns regarding my fosterson<br/>\nwho is 8. He is 3-4 emotionally, according to his therapist who deals<br/>\nspecifically with kids with reactive attachment disorder (like Helen<br/>\nKeller had). He also had defiant disorder, eating disorder,<br/>\npost-traumatic stress disorder reactions, etc. - a bunch of labels. I<br/>\nfeel constantly irritated by him. He wakes me up every morning by asking<br/>\nme if he can get dressed, where is the food, walking on his tip toes,<br/>\nfalling over things, screeching, etc. Every morning for the last year or<br/>\nmore I have repeated myself about &quot;yes, get dressed&quot; and he asks again<br/>\nthe next day. I think he wants my attention and he has learned that this<br/>\nis how it is done. He has had 13 placements including a state-run<br/>\ninstitution where he lived for one year. He is on Concerta which helps<br/>\ncalm him down. Without it he seems &quot;drunk.&quot; Speaking of cleaning his<br/>\nroom, we do that together. He choosed to keep his room very cluttered<br/>\nlike he keeps his desk at school. Maybe I am too old and &quot;stuck&quot; in my<br/>\nways. He is intelligent and very creative. He likes to dress up as a<br/>\ngirl, including tieing a shirt on his head to look like hair, makeup,<br/>\nhighheels, and a dress. Some people have had difficulty with this and<br/>\nmost don&#39;t, including me. I believe in his right to be who he is. I know<br/>\nI feel a great responsibility towards him and the state. That gets in my<br/>\nway. Some where in my thought patterns I end up feeling very frustrated<br/>\nwith the whole business. I have people telling me to &quot;make him behave&quot;<br/>\nwhen he won&#39;t go to his room, when he throws a fit, etc. I don&#39;t have a<br/>\nmagic wand. He is very manipulative, has a great need to control people<br/>\nincluding teachers, therapists, etc. I would think that he would be<br/>\ntired of all the adults controling him. There are at least a dozen<br/>\nadults who work with him. Either way, I feel overwhelmed so I can<br/>\nimagine how he feels. This summer he has had camp which he has loved. So<br/>\nfar he has had 4 weeks and we may get another two. Other than that he<br/>\nhas 3 different people from the same agency who are called &quot;skills<br/>\nworkers&quot; that pick him up 3 days a week and do &quot;skills&quot; with<br/>\nhim/socializing him. His therapist said the main concern is to bond with<br/>\nhim and have everyone on his team knowing to refer back to &quot;mom&quot; to<br/>\nassist him in bonding. He goes to public school and is high-maintenance<br/>\nthere. He constanty demands attention so he has a tutor to help direct<br/>\nhim. The teacher he has this year was one of my kids teachers. She was<br/>\none of the main reasons I decided to unschool at home. Perhaps after we<br/>\nadopt him I will unschool him although right now I feel overwhelmed<br/>\nenough. Maybe we could do with less &quot;help&quot; by then and it will feel<br/>\nbetter. Michele  <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":2115,"nextTopicId":2187}}