{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":195752956,"authorName":"Jennifer Johnson","from":"&quot;Jennifer Johnson&quot; &lt;pnkn314@...&gt;","profile":"keekaimama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Great Big Happy Life - A Sneak Peek!","postDate":"1271078999","msgId":43646,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBmYTMwMWNhZGE0NCQ0MDQ3NWI1MCRjMGQ2MTFmMCRAbmV0Pg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":43645,"nextInTime":43647,"topicId":43646,"numMessagesInTopic":0,"msgSnippet":"Are you considering coming to the Great Big Happy Life conference this year? June 7-10th in the beautiful mountains of New Jersey? As we near our registration","messageBody":"<div id=\"ygrps-yiv-1973851852\">Are you considering coming to the Great Big Happy Life conference this year?<br/>\nJune 7-10th in the beautiful mountains of New Jersey?<br/>\n<br/>\nAs we near our registration deadline of May 1st, we wanted to give folks<br/>\nmore of a sneak peek into the Great Big Happy Life experience in the hopes<br/>\nthat you will come and be a part of this unique combination<br/>\nconference-retreat. <br/>\n<br/>\nRegistration for the Great Big Happy Life Unschoolers<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.greatbighappylife.com/\">http://www.greatbighappylife.com/</a>&gt;  Conference Retreat will close May 1st<br/>\nand we still have a few rooms left as well as some tent spaces.  Our main<br/>\nfocus is creating an environment in which parents can really focus on being<br/>\nwith their kids- while getting recharged by sharing space and experiences<br/>\nalongside other unschooling families who have chosen this life with their<br/>\nchildren. You won&#39;t have to think about meals since we are a catered event<br/>\nwith seasonal natural fresh foods, you won&#39;t have to think about going<br/>\nanywhere- we are like a little self contained unschooling village. With your<br/>\nkids you can just enjoy the spaciousness, calm and quiet of the beautiful<br/>\n250 acre campus,  or if you prefer, find a tribe and absorb the joyful<br/>\nnoises of kids doing their thing.  We plan to have massage by the minute-<br/>\nand there will be a morning Qigong experience each day. <br/>\n<br/>\nWe have added Sandra Dodd to the menu of wonderfulness that we plan to offer<br/>\nthis year. In addition to hosting a lunch group amusingly called &quot;How to<br/>\nScrew Up Unschooling&quot;, Sandra will be giving a talk called Connections-<br/>\nabout the unfoldment of learning for all of us and how if happens. Erika<br/>\nDavis-Pitre will also be talking about Unschooling Diversity and Unschooling<br/>\nTeens. <br/>\n<br/>\nWe have also contracted with Wildman Steve Brill<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.wildmanstevebrill.com/\">http://www.wildmanstevebrill.com/</a>&gt; , a naturalist and forager to come and<br/>\nwork with our group, giving us a tour of the wild around the camp. This is<br/>\ngreat fun for everyone and you actually learn which plants are edible, what<br/>\nnot to touch and how to identify things in the wild. <br/>\n<br/>\nWe are working to entice a NJ author of books about ghosts and hauntings<br/>\ncoming to give us a glimpse into the spine-tingling fun world of ghost<br/>\nhunting, and he may even join us for our campfire for a round of spookiness.<br/>\n<br/>\nThere will be a share our wares table for kids and grownups to sell their<br/>\ncreations- and raffles and passion baskets to discover and win!<br/>\n<br/>\nThere will be an 8-minute Dating for families event- a HUGE hit last year as<br/>\nit allows everyone to meet and say hi and learn about one another in a<br/>\ntotally silly and pressure free way- many friendships were forged last year<br/>\nas a result of 8 minute dating- and it is great for those of us who are a<br/>\nbit on the shy side!<br/>\n<br/>\nFunshops are being added all the time- most recently a gnome home funshop,<br/>\nsmashing t-shirts, knot tying, fishing fest and a music jam. We also hope to<br/>\nget our cookie diva to return for some cookie decorating fun- and we will be<br/>\noffering waterfront activities at the lake. <br/>\n<br/>\nWe will have a room set up just for gamers, a movie night, talent show,<br/>\nsuperhero breakfast (you have to come to find out about that one) and lots<br/>\nof sunshine and wide open spaces of time. <br/>\n<br/>\nThe conference runs from dinner Monday thru breakfast Thursday- and our<br/>\nprices are family friendlier than last year as we found a beautiful new home<br/>\nfor our gathering that allows families both the privacy of their own rooms<br/>\nwith the experience of living in a community. <br/>\n<br/>\nSay YES to the Great Big Happy Life! Whether this is your first conference<br/>\nor your tenth, we need your energy and we welcome you and your family! <br/>\n<br/>\nWith Love, <br/>\n<br/>\n <br/>\n<br/>\nJennifer and Chris <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Pnkn314@...\">Pnkn314@...</a><br/>\n<br/>\n <br/>\n<br/>\nwww.greatbighappylife.com<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":43594,"nextTopicId":43644}}