{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":13,"messages":[{"userId":386666394,"authorName":"Doug & Melissa Edwards","from":"Doug & Melissa Edwards &lt;boisei@...&gt;","profile":"melgqd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Asking kids to do stuff","postDate":"1300649834","msgId":46376,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEyQ0QwRTRBLUVDRDUtNEZCNS05QjEyLUUyMjcxOTEzODNEMkBzYW4ucnIuY29tPg=="},"prevInTopic":46375,"nextInTopic":0,"prevInTime":46375,"nextInTime":46377,"topicId":46364,"numMessagesInTopic":0,"msgSnippet":"Thanks everyone for your responses.  I think I ll try to take a minimal approach (I m often an over-explainer...). Melissa","messageBody":"<div id=\"ygrps-yiv-2109010213\">Thanks everyone for your responses.  I think I&#39;ll try to take a minimal approach (I&#39;m often an over-explainer...).  <br/>\nMelissa</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Asking kids to do stuff","postDate":"1300490363","msgId":46375,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGltMHA5cit2NWJrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEYwRDI5MzFELTUxQUQtNDgwMS1CNUFDLTRCMTY4NDRDNzcxQ0BzYW4ucnIuY29tPg=="},"prevInTopic":46374,"nextInTopic":46376,"prevInTime":46374,"nextInTime":46376,"topicId":46364,"numMessagesInTopic":0,"msgSnippet":"If you know he needs to know, then talk to him. I think it s going to depend on each child, their personalities and their past experiences. Nance I also have a","messageBody":"<div id=\"ygrps-yiv-2104115406\">If you know he needs to know, then talk to him. I think it&#39;s going to depend on each child, their personalities and their past experiences. <br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\nI also have a question for the group. How much do you talk about what you are<br/>\ndoing with the kids? Do you discuss the purpose and methods of unschooling or<br/>\njust guide and let it happen? I feel that my older son needs to know something<br/>\nabout the process to alleviate some of his uneasiness about this change.<br/>\nThanks,<br/>\nMelissa</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Asking kids to do stuff","postDate":"1300483698","msgId":46374,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGltMGlwaStvcDcxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEYwRDI5MzFELTUxQUQtNDgwMS1CNUFDLTRCMTY4NDRDNzcxQ0BzYW4ucnIuY29tPg=="},"prevInTopic":46373,"nextInTopic":46375,"prevInTime":46373,"nextInTime":46375,"topicId":46364,"numMessagesInTopic":0,"msgSnippet":"I don t talk about purpose or methods at all with my 9yo, who has been unschooled from the start. To her, its just her life. We ll sometimes talk about the","messageBody":"<div id=\"ygrps-yiv-1816616777\">I don&#39;t talk about purpose or methods at all with my 9yo, who has been unschooled from the start. To her, its just her life. We&#39;ll sometimes talk about the fact that other people do things differently, but that&#39;s all. <br/>\n<br/>\nMy 17yo stepson has been through homeschool and school as well as spending some time living with his bio mom before joining our unschooling home. Homeschooling had been such a miserable experience that I wanted to reassure him we wouldn&#39;t be doing that again! Rather than talking about unschooling, though, I talked about deschooling - about needing time to rest after school and home-school and get back to being who he was rather than who he&#39;d been educated to be. The idea actually made him nervous - like he was afraid he&#39;d pick the wrong &quot;him&quot; to be, if you see what I mean, so I reassured him he didn&#39;t need to Do anything in that sense, just take a good long break from anything that looked or felt like school. <br/>\n<br/>\nI didn&#39;t ever say &quot;no rules&quot; or anything like that. Instead I said &quot;yes&quot; a whole lot - and heard a lot of &quot;Really? Wow, cool... really really? Wow!&quot; for awhile. It was sweet and sad at the same time. I also offered a lot of things we&#39;d said no to in the past and things that were flat out &quot;bad and wrong&quot; at his step mom&#39;s house (I mean things like jello not bank robbery ;))<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;One of the things I hope that my 9yo gains from the experience of unschooling is an ability to make mistakes.  Mistakes are much to be avoided at this time.  I feel like his whole life could be different if he weren&#39;t so afraid of taking risks.  <br/>\n </span></blockquote>********************<br/>\n<br/>\nI have a couple thoughts about that - not disagreeing but some other factors to think about. Some people take risks more cautiously than others in a general sense, not necessarily because of school - although school can make that worse, for sure! <br/>\n<br/>\nSome people are very very uncomfortable having another person watch them learn - that&#39;s true of unschoolers, too, so its not something that comes from school. Its closer to an introvert-extravert kind of thing where some people do better with an audience as it were, while others freeze up and have a hard time learning if they think they&#39;re being observed. <br/>\n<br/>\nSome people also take Different risks, or see risk taking differently. I tend to think I&#39;m very hestant and not a risk taker - until someone flat out says &quot;Oh I could never do that&quot; about something I do regularly: my artwork, the way I dress, even unschooling! I think of myself as a chicken and my brother the brave one, since he loves to ski and race bicycles (and now amature car racing... good grief!) while he considers me brave for moving to the wilds of Tennessee and living a kind of weird, fringe lifestyle. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":419245530,"authorName":"adellegill@verizon.net","from":"&quot;adellegill@...&quot; &lt;adellegill@...&gt;","profile":"adellegill@verizon.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Asking kids to do stuff","postDate":"1300391898","msgId":46373,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlsdHA0cStubTdvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEYwRDI5MzFELTUxQUQtNDgwMS1CNUFDLTRCMTY4NDRDNzcxQ0BzYW4ucnIuY29tPg=="},"prevInTopic":46372,"nextInTopic":46374,"prevInTime":46372,"nextInTime":46374,"topicId":46364,"numMessagesInTopic":0,"msgSnippet":"... I wouldn t go into every single detail all at once. Things could explode. The first time we tried to get into unschooling we told the kids we were going to","messageBody":"<div id=\"ygrps-yiv-1570400384\"><blockquote><span title=\"ireply\">&gt; I also have a question for the group.  How much do you talk about what you are doing with the kids?  Do you discuss the purpose and methods of unschooling or just guide and let it happen?<br/>\n<br/>\n  <br/>\n </span></blockquote>   I wouldn&#39;t go into every single detail all at once. Things could explode. The first time we tried to get into unschooling we told the kids we were going to stop the curriculum and do whatever they wanted. Bad idea. This caused them to push every limit they could find. Pushing us back to the need to control and into more strict schooling then before. So by the time November came back around my husband and I discussed unschooling again. We decided to tell the kids we were taking a break from school and enjoy the holidays. Plus that helped me focus on other things rather then what the kids should or shouldn&#39;t be doing. I told myself it was summer break during winter. Even though we were year round schooling. So the holidays passed and the middle of January came. My husband told me he thought the kids were reading better and communicating better. We were aleady working on less parental control. We were slowly introducing things one at a time. We had already given up bedtimes when we started homeschooling. We already gave up everyday bathing. We introduced you can make whatever you want for breakfast.(unless you want me to make it)Then 2 weeks later have whatever you want for lunch. etc. That made it alot easier to ignore the kids pushing the limits to see if I was really serious. Because your letting go of control while they are gaining control and that can be hard. <br/>\n  My oldest is 14. I did tell her that we were not going to do curriculum anymore and would like her to start thinking about what things she would like to do. She did a lot of reading. <br/>\n  I addressed the younger kids concerns as they came. My 9 year old came to me one day and said she wasn&#39;t learning anything. I just thought about what she was doing and broke it down into subjects for her. She had read Benjamin Franklin and Clara Barton. I told her that was History. She was watching a lot cooking shows and getting library books about Paula Deen and making meals for us. I told her that was reading and math. She still didnt feel completely at ease so I told her she could make a chart that had Reading Math Science etc. then write down everyday what she did in each subject. That lasted about 2 days then she realized how silly that was and she really was learning. <br/>\n   That is what I told the 2 younger girls 6&8. When they said we dont do school anymore. I asked them what do you do in school? They said learn. So I asked them what they learned that day. That started a What did you learn today? discussion at dinner everynight for awhile. If they couldn&#39;t think of something they learned, we asked them well what did you do today? And when they told us, we talked about how what they did was learning. Ex. 5 year old said playdoh. I asked her what she made she said a house. I said well have you ever built a house before, she said no. So I said well you learned how to build a playdoh house. Cartoons were discussed and they learned that manners were important. Or how much the grocercies cost that day.  <br/>\n  I did leave them their math workbooks to work in if they chose to. They did on and off for a little while. I think all of those things helped them let go.</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Asking kids to do stuff","postDate":"1300383244","msgId":46372,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlsdGdtYyt1cmVyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlsc3B1ais4bDI2QGVHcm91cHMuY29tPg=="},"prevInTopic":46371,"nextInTopic":46373,"prevInTime":46371,"nextInTime":46373,"topicId":46364,"numMessagesInTopic":0,"msgSnippet":"... *************** I ve offered to plant things for Mo in the past - whatever she likes. I set aside one small bed for her and also give her the option of","messageBody":"<div id=\"ygrps-yiv-2075741359\">&quot;adellegill@...&quot; &lt;adellegill@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;   I do vegetable gardening as my hobby. The kids helped dig up the area last year.That was fun for them. Other than that they have no interest in gardening. I told them this year all we had to do was plant and that we did the hard part digging up last year. Nope! Go figure!<br/>\n </span></blockquote>***************<br/>\n<br/>\nI&#39;ve offered to plant things for Mo in the past - whatever she likes. I set aside one small bed for her and also give her the option of helping me choose plants for the general garden. I grow more perennials than veggies, so I ask her opinions when I&#39;m picking out new flowers or foliage. <br/>\n<br/>\nShe&#39;s never (so far) been interested in planting or weeding, but loves to water things. She has diligently watered my houseplants all winter, and has watered all my starts this year. I&#39;ve also picked up some new perennials a bit early (spreading out the expense) and she has been putting them out in the sun every day and reminding me to bring them in at night. If you&#39;re open to your kids helping a *little* in ways that are easy for them - and think of &quot;reminding&quot; as a kind of help! - you may find your kids love to help you garden. It just may not look like what you expect. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I said you can make it however you want, just have to use your imagination and whatever stuff you have to build it with. You could even use cardboard. (hint hint because we dont have any wood or metal) They said that would be fun and we continued to watch the show. But I was unsure if I should bring it up again later or leave it alone. <br/>\n </span></blockquote>***************<br/>\n<br/>\nThose sorts of things I&#39;ll make a mental note and bring up the subject when I&#39;m planning on running some errands. In our house, lately, it was materials for puppets and a puppet-theater. I didn&#39;t know if it was a passing fancy or not, so next time I was going out I asked &quot;should we pick up supplies for puppet stuff?&quot; That time she shrugged, not really interested, but a few days later I came across a folding cardboard display thingy and noted that it was perfect for puppets - it just needed a hole cut and a bit of paint. She was thrilled and we stocked up on paint while we were there. <br/>\n<br/>\nIdeas do come and go and kind of swirl around, so don&#39;t take &quot;no&quot; as a forever rejection. A lot of times kids need to *see* the actual materials to understand your idea, too. They don&#39;t have the context adults do so sometimes grow-up suggestions sound pretty silly. A cardboard chariot? You&#39;d fall right through the bottom, mom!<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":386666394,"authorName":"Doug & Melissa Edwards","from":"Doug & Melissa Edwards &lt;boisei@...&gt;","profile":"melgqd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Asking kids to do stuff","postDate":"1300379787","msgId":46371,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYwRDI5MzFELTUxQUQtNDgwMS1CNUFDLTRCMTY4NDRDNzcxQ0BzYW4ucnIuY29tPg=="},"prevInTopic":46370,"nextInTopic":46372,"prevInTime":46370,"nextInTime":46372,"topicId":46364,"numMessagesInTopic":0,"msgSnippet":"I love this post.  My name is Melissa and this is my kids (9 and 5 yo boys) last week of school before we begin deschooling.  One of the things I hope that my","messageBody":"<div id=\"ygrps-yiv-270133692\">I love this post.  My name is Melissa and this is my kids (9 and 5 yo boys) last week of school before we begin deschooling.  One of the things I hope that my 9yo gains from the experience of unschooling is an ability to make mistakes.  Mistakes are much to be avoided at this time.  I feel like his whole life could be different if he weren&#39;t so afraid of taking risks.  <br/>\n<br/>\nI also have a question for the group.  How much do you talk about what you are doing with the kids?  Do you discuss the purpose and methods of unschooling or just guide and let it happen? I feel that my older son needs to know something about the process to alleviate some of his uneasiness about this change.<br/>\nThanks,<br/>\nMelissa</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Asking kids to do stuff","postDate":"1300374627","msgId":46370,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDREIyQ0M5NTBDMTQ4Mi1FQzgtNDA1MUB3ZWJtYWlsLWQwMDQuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PGlsc3JlaCs4cHIzQGVHcm91cHMuY29tPg==","referencesHeader":"PGlsc3JlaCs4cHIzQGVHcm91cHMuY29tPg=="},"prevInTopic":46369,"nextInTopic":46371,"prevInTime":46369,"nextInTime":46371,"topicId":46364,"numMessagesInTopic":0,"msgSnippet":"... From: marbleface  Subject: [unschoolingbasics] Re: Asking kids to do stuff Go plant something and then take care of it and serve","messageBody":"<div id=\"ygrps-yiv-193846416\">-----Original Message-----<br/>\nFrom: marbleface &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marbleface@...\">marbleface@...</a>&gt;<br/>\nSubject: [unschoolingbasics] Re: Asking kids to do stuff<br/>\n<br/>\n<br/>\nGo plant something and then take care of it and serve it up for snacks and be <br/>\nhappy with that. (Have to look up whether I should trim impaciens or just <br/>\nreplace them. . .) If you want to think of it as in some way helping your <br/>\nchildren, you are showing them how people can enjoy their lives when we have all <br/>\nthat luxurious time that isn&#39;t spent at school! :)<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<br/>\n<br/>\nIt&#39;s not only showing them how people can enjoy their lives, but it can also help show failure and how to deal with/recover from/move on from failure.<br/>\n<br/>\n<br/>\nChildren in school rarely see failure---except in themselves and classmates. <br/>\n<br/>\n<br/>\nThe adults in their lives excel: Parents work away from home and are encouraged not to bring work home (in the negative sense). The stay-at-home parent (if there is one) cleans the house and fixes meals in solitude. The teachers and coaches are working at things they *know*---whether math or science or language or violin or basketball: they&#39;re doing things they KNOW. The average adult in a school kid&#39;s life does what s/he&#39;s good at. Failure doesn&#39;t happen.<br/>\n<br/>\n<br/>\nA great benefit of being with our children day in and day out is that WE can try new things. We can experiment. And when humans try new things, they fail. Not all the time. But often at the beginning! Even a soccer coach was a beginner one time and missed goals. The home economics teacher&#39;s first souffle didn&#39;t rise. The gardener&#39;s impatiens died in the sun. The English teacher missed a possessive before the gerund.<br/>\n<br/>\n<br/>\nMy kids saw my garden falter and wither. But each year, I&#39;ve gotten better. They&#39;ve seen culinary disasters and last minute calls to Domino&#39;s. They&#39;ve seen art project screw up and then become *different* art projects. They&#39;ve watched me sob when I feel I cannot do anything right. They&#39;ve also seen me scream with delight when I figure something out. <br/>\n<br/>\n<br/>\nMistakes are part of learning. A BIG part. We learn from our mistakes, and it&#39;s good for children to see the adults in their lives make mistakes---and fail. AND work hard to figure it out OR understand it&#39;s time to quit and try something completely different.<br/>\n<br/>\n<br/>\nSo...enjoy your time. Make the most of it. Let them see you make mistakes. Let them see you deal with that.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Asking kids to do stuff","postDate":"1300361489","msgId":46369,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlsc3JlaCs4cHIzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlsc3B1ais4bDI2QGVHcm91cHMuY29tPg=="},"prevInTopic":46368,"nextInTopic":46370,"prevInTime":46368,"nextInTime":46370,"topicId":46364,"numMessagesInTopic":0,"msgSnippet":"I watch a lot of things on TV but don t want to go out and build anything. I might mention wanting a jet pack (still bitter I don t have one!) but don t really","messageBody":"<div id=\"ygrps-yiv-1178604361\">I watch a lot of things on TV but don&#39;t want to go out and build anything. I might mention wanting a jet pack (still bitter I don&#39;t have one!) but don&#39;t really want to make one. <br/>\n<br/>\nPut aside hoping a project will come from something on TV. It may. But sitting there wanting to have a product to show for your time is not the point. <br/>\n<br/>\nIt&#39;s hard to learn to just live and let go of schoolish ideas about what children should be doing or want to do. <br/>\n<br/>\nGo plant something and then take care of it and serve it up for snacks and be happy with that. (Have to look up whether I should trim impaciens or just replace them. . .) If you want to think of it as in some way helping your children, you are showing them how people can enjoy their lives when we have all that luxurious time that isn&#39;t spent at school! :)<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;adellegill@...&quot; &lt;adellegill@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Thanks! All of these ideas are very helpful. I almost bought the book Playful Parenting the other day, but was searching for another title so I put it back. I will definately go back and get that one. Especially now that I have seen recommended in several places. <br/>\n&gt;   I do vegetable gardening as my hobby. The kids helped dig up the area last year.That was fun for them. Other than that they have no interest in gardening. I told them this year all we had to do was plant and that we did the hard part digging up last year. Nope! Go figure! ha ha At least I know where to find them if i want to expand.<br/>\n&gt;    I wasn&#39;t sure if I should be doing more with them at the moment. I think I will continue to give them their space, but also not be afraid to ask a little more too. <br/>\n&gt;    I remembered something. It seems like we&#39;ve seen 3 or 4 shows lately about greek mythology. So while they were watching tv the other day the show was having a chariot race. I made the suggestion. Hey you guys could build your own chariot. That would be fun! They seemed excited about the idea and one said yeah we could build it out of scrap wood, the other said no we can&#39;t it has to be metal. I said you can make it however you want, just have to use your imagination and whatever stuff you have to build it with. You could even use cardboard. (hint hint because we dont have any wood or metal) They said that would be fun and we continued to watch the show. But I was unsure if I should bring it up again later or leave it alone. I thought just throwing the idea out there was probably good enough and that I should wait for them to approach me later if they wanted help with something. <br/>\n&gt;  Thanks for your thoughts!  Adelle<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":419245530,"authorName":"adellegill@verizon.net","from":"&quot;adellegill@...&quot; &lt;adellegill@...&gt;","profile":"adellegill@verizon.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Asking kids to do stuff","postDate":"1300359955","msgId":46368,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlsc3B1ais4bDI2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlscWhlOCtna3QxQGVHcm91cHMuY29tPg=="},"prevInTopic":46367,"nextInTopic":46369,"prevInTime":46367,"nextInTime":46369,"topicId":46364,"numMessagesInTopic":0,"msgSnippet":"Thanks! All of these ideas are very helpful. I almost bought the book Playful Parenting the other day, but was searching for another title so I put it back. I","messageBody":"<div id=\"ygrps-yiv-112072152\">Thanks! All of these ideas are very helpful. I almost bought the book Playful Parenting the other day, but was searching for another title so I put it back. I will definately go back and get that one. Especially now that I have seen recommended in several places. <br/>\n  I do vegetable gardening as my hobby. The kids helped dig up the area last year.That was fun for them. Other than that they have no interest in gardening. I told them this year all we had to do was plant and that we did the hard part digging up last year. Nope! Go figure! ha ha At least I know where to find them if i want to expand.<br/>\n   I wasn&#39;t sure if I should be doing more with them at the moment. I think I will continue to give them their space, but also not be afraid to ask a little more too. <br/>\n   I remembered something. It seems like we&#39;ve seen 3 or 4 shows lately about greek mythology. So while they were watching tv the other day the show was having a chariot race. I made the suggestion. Hey you guys could build your own chariot. That would be fun! They seemed excited about the idea and one said yeah we could build it out of scrap wood, the other said no we can&#39;t it has to be metal. I said you can make it however you want, just have to use your imagination and whatever stuff you have to build it with. You could even use cardboard. (hint hint because we dont have any wood or metal) They said that would be fun and we continued to watch the show. But I was unsure if I should bring it up again later or leave it alone. I thought just throwing the idea out there was probably good enough and that I should wait for them to approach me later if they wanted help with something. <br/>\n Thanks for your thoughts!  Adelle</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Asking kids to do stuff","postDate":"1300312919","msgId":46367,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlscmMwbitjZHE2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlscWhlOCtna3QxQGVHcm91cHMuY29tPg=="},"prevInTopic":46366,"nextInTopic":46368,"prevInTime":46366,"nextInTime":46368,"topicId":46364,"numMessagesInTopic":0,"msgSnippet":"What a lovely question! I am so impressed with the thoughtful way you are approaching all of these changes and ideas. How about doing something you want to do","messageBody":"<div id=\"ygrps-yiv-869191085\">What a lovely question! I am so impressed with the thoughtful way you are approaching all of these changes and ideas.<br/>\n<br/>\nHow about doing something you want to do and just doing it and, if anyone shows interest, offer to let them join in or just talk to them about it? Not a contrived activity like a craft you think they might like but something you really want to do. With a note that if there is something they&#39;d like to do with you instead, you are available. <br/>\n<br/>\nWatching the TV with them, especially if it&#39;s not anything you want to watch, sounds boring to me. But we have TVs on all over the place at various times and still have other things going on. Each doing our own thing but together. Clear as mud? :)<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;adellegill@...&quot; &lt;adellegill@...&gt; wrote:<br/>\n&gt;<br/>\n&gt;  BACKGROUND-Hi am fairly new to unschooling. We have been homeschooling for about a year and a half. We have been very relaxed in our approach. Sort of a Charlotte Mason style, but more relaxed. We started unschooling in the beginning of November. Slowly introducing the parenting aspect of life as well. My girls are 14,9,8,6. They have no chores, are free to come in the kitchen anytime they want. I had free range of tv but limited channels until about 3 weeks ago. I put all the tv channels back on for them. I have been avoiding the answer no. I do have one rule that is known. They have to ask to go outside and they have to be with someone. I usually always say yes unless we are going out to eat and thats not a problem with them. <br/>\n&gt;     Sorry trying to give some background on us. So anyhow I am loving the way things are going. Except I am starting to get really bored and want to engage with the kids more. I have just been staying out of their way to give them that time they need to relax and not feel pressured. I really dont want to sit and watch cartoons with them so I offer to turn the tv on downstairs and I usually read or play on the computer and this way we are still having conversation with each other. I also dont sit outside everytime they are out. I do go out with them about 4 nights a week we all do football catch or we just sit and watch them play. So I think we are doing pretty good with engaging ourselves in those actvities. <br/>\n&gt;    My QUESTION is Is it ok to ask them to do things? Such as hey do you want to read one of your library books together? You can read to me or Ill read to you. or we read together. Do you want to help me cook dinner? Do you want to do a craft? Reason I&#39;m asking is that it seems like my kids will always say yes even if they don&#39;t really want to. I don&#39;t want them to feel pressured and I don&#39;t want to throw them off track from their own things. While we were &quot;doing school&quot; like I said it was relaxed. I read a lot of stories to them and they loved that. So sitting and watching tv with them I have ideas of things we could do together, but I have been afraid to ask because I feel like they will always say yes. Im not sure if I&#39;m explaining myself very well. Whats wrong with them saying yes. Well I don&#39;t want them to do something just because i ask. I want them to do it because they really want to. Ex. My 9 year old loves coming to read books to me. She asks me all the time if I want to listen to her read. My 6 year old on the other hand will never ask me. But if I ask her she says yes. So i read to her and I get this feeling she is bored. She fidgets and yawns and doesn&#39;t look at the book like she is intersted. It could just be her way of listening to the story, but I&#39;m not sure. I will stop after a page and ask her if she wants me to continue and she says yes. <br/>\n&gt;   Any feedback would be great. Am I on the right path? Thanks so much!<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Asking kids to do stuff","postDate":"1300296786","msgId":46366,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlscXM4aStzb2hiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlscWhlOCtna3QxQGVHcm91cHMuY29tPg=="},"prevInTopic":46365,"nextInTopic":46367,"prevInTime":46365,"nextInTime":46367,"topicId":46364,"numMessagesInTopic":0,"msgSnippet":"adellegill@...  wrote: So sitting and watching tv with them I have ideas of things we could do together ************** Sitting and watching","messageBody":"<div id=\"ygrps-yiv-30932940\">&quot;adellegill@...&quot; &lt;adellegill@...&gt; wrote:<br/>\nSo sitting and watching tv with them I have ideas of things we could do together<br/>\n**************<br/>\n<br/>\nSitting and watching together is still &quot;doing something together&quot; - that&#39;s worth reminding yourself when you&#39;re chafing, thinking of other things to do. You Are together, doing something that&#39;s no less meaningful or connecting than reading together. <br/>\n<br/>\nIf you&#39;re finding yourself antsy, you can bring a project along or set up the tv in such a way that its easy to do other things besides;<br/>\nI do a lot of &quot;crafty&quot; stuff in the same room as the tv, and my dd does almost all her creation with the tv going. But if the kids have a bunch of new channels to explore they may be really focused on what they&#39;re watching right now. They&#39;re exploring a new world and its more exciting to them than other stuff. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Reason I&#39;m asking is that it seems like my kids will always say yes even if they don&#39;t really want to.<br/>\n </span></blockquote>**************<br/>\n<br/>\nThat&#39;s a good reason to avoid asking for awhile - not forever, but for awhile. When my stepson first moved back in with me after a few years with his bio mom and school, he would always say yes, too, but over time that built up resentment. It helped to stop asking him to do other things for awhile, so he had a chance to learn about self motivation. A lot of &quot;asking&quot; can get in the way of that!<br/>\n<br/>\nAt the same time, strew things you think they&#39;d enjoy and see what they pick up. The may not be interested right away - but that also sets you up with a store of things to pull out of a cupboard when there&#39;s &quot;nothing on tv&quot; and its a dull day. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;My 6 year old on the other hand will never ask me. But if I ask her she says yes. So i read to her and I get this feeling she is bored. She fidgets and yawns and doesn&#39;t look at the book like she is intersted. It could just be her way of listening to the story, but I&#39;m not sure. I will stop after a page and ask her if she wants me to continue and she says yes. <br/>\n </span></blockquote>****************<br/>\n<br/>\nMy 9yo rarely likes to sit and be read to - if she wants me to read to her, she&#39;d rather have a project going at the same time. That makes sense to me, because I&#39;m much the same way but it through me for a loop the first time she wanted to build a computer program while I read to her. I kept stopping and asking &quot;do you want me to keep going?&quot; <br/>\n<br/>\nSo maybe offer to read while she does something else - color or build with legos or play outside. It&#39;s a startling concept if you&#39;re used to &quot;sitting and reading&quot;! But that way, too, you&#39;re not pulling her away from what she wants to do, you&#39;re combining two things she enjoys - three if you count your company ;)<br/>\n<br/>\nSimilarly, if you want some company in the kitchen, offer to make something fun with them rather than just &quot;dinner&quot;. Let the activity be about connecting and engagement rather than building some kind of skill. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I am starting to get really bored and want to engage with the kids more.<br/>\n </span></blockquote>*************<br/>\n<br/>\nHave you read Playful Parenting? Maybe you could learn to be more playful and engage that way, or liven up other parts of your life in a playful way so that you&#39;re more appealing a companion. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":377201113,"authorName":"mitrisue","from":"&quot;mitrisue&quot; &lt;julesmiel@...&gt;","profile":"mitrisue","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Asking kids to do stuff","postDate":"1300292603","msgId":46365,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlscW81citwMmJ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlscWhlOCtna3QxQGVHcm91cHMuY29tPg=="},"prevInTopic":46364,"nextInTopic":46366,"prevInTime":46364,"nextInTime":46366,"topicId":46364,"numMessagesInTopic":0,"msgSnippet":"... I ask my kids to do things, and I ve learned a lot from the process of weighing my motivations, noting their reactions when I ask, and noticing my feelings","messageBody":"<div id=\"ygrps-yiv-1540305595\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;adellegill@...&quot; &lt;adellegill@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; My QUESTION is Is it ok to ask them to do things? <br/>\n<br/>\n </span></blockquote>I ask my kids to do things, and I&#39;ve learned a lot from the process of weighing my motivations, noting their reactions when I ask, and noticing my feelings and reactions to their responses.<br/>\n<br/>\nOne thing I&#39;ve learned about my asking is that sometimes it comes from anxiety, anxiety that maybe I&#39;m not doing enough or they&#39;re not enough in some way.  So I learn a lot from the experience of asking at the &quot;wrong&quot; times and the &quot;right&quot; times. <br/>\n<br/>\nAs I pay attention to this, my question-asking instincts get better, and I&#39;m less intrusive.<br/>\n<br/>\nJulie</div>","specialLinks":[]},{"userId":419245530,"authorName":"adellegill@verizon.net","from":"&quot;adellegill@...&quot; &lt;adellegill@...&gt;","profile":"adellegill@verizon.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Asking kids to do stuff","postDate":"1300285704","msgId":46364,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlscWhlOCtna3QxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":46365,"prevInTime":46363,"nextInTime":46365,"topicId":46364,"numMessagesInTopic":0,"msgSnippet":"BACKGROUND-Hi am fairly new to unschooling. We have been homeschooling for about a year and a half. We have been very relaxed in our approach. Sort of a","messageBody":"<div id=\"ygrps-yiv-606544061\">BACKGROUND-Hi am fairly new to unschooling. We have been homeschooling for about a year and a half. We have been very relaxed in our approach. Sort of a Charlotte Mason style, but more relaxed. We started unschooling in the beginning of November. Slowly introducing the parenting aspect of life as well. My girls are 14,9,8,6. They have no chores, are free to come in the kitchen anytime they want. I had free range of tv but limited channels until about 3 weeks ago. I put all the tv channels back on for them. I have been avoiding the answer no. I do have one rule that is known. They have to ask to go outside and they have to be with someone. I usually always say yes unless we are going out to eat and thats not a problem with them. <br/>\n    Sorry trying to give some background on us. So anyhow I am loving the way things are going. Except I am starting to get really bored and want to engage with the kids more. I have just been staying out of their way to give them that time they need to relax and not feel pressured. I really dont want to sit and watch cartoons with them so I offer to turn the tv on downstairs and I usually read or play on the computer and this way we are still having conversation with each other. I also dont sit outside everytime they are out. I do go out with them about 4 nights a week we all do football catch or we just sit and watch them play. So I think we are doing pretty good with engaging ourselves in those actvities. <br/>\n   My QUESTION is Is it ok to ask them to do things? Such as hey do you want to read one of your library books together? You can read to me or Ill read to you. or we read together. Do you want to help me cook dinner? Do you want to do a craft? Reason I&#39;m asking is that it seems like my kids will always say yes even if they don&#39;t really want to. I don&#39;t want them to feel pressured and I don&#39;t want to throw them off track from their own things. While we were &quot;doing school&quot; like I said it was relaxed. I read a lot of stories to them and they loved that. So sitting and watching tv with them I have ideas of things we could do together, but I have been afraid to ask because I feel like they will always say yes. Im not sure if I&#39;m explaining myself very well. Whats wrong with them saying yes. Well I don&#39;t want them to do something just because i ask. I want them to do it because they really want to. Ex. My 9 year old loves coming to read books to me. She asks me all the time if I want to listen to her read. My 6 year old on the other hand will never ask me. But if I ask her she says yes. So i read to her and I get this feeling she is bored. She fidgets and yawns and doesn&#39;t look at the book like she is intersted. It could just be her way of listening to the story, but I&#39;m not sure. I will stop after a page and ask her if she wants me to continue and she says yes. <br/>\n  Any feedback would be great. Am I on the right path? Thanks so much!</div>","specialLinks":[]}],"prevTopicId":46335,"nextTopicId":46377}}