{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: individualism vs. community","postDate":"1288549280","msgId":45226,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2NzM2MkEwMjk5QjRENTlBOThFQTZCNjY3NjdBOEM2QENvbm5pZVBDPg==","inReplyToHeader":"PGlhazZ0OSsycjRsQGVHcm91cHMuY29tPg==","referencesHeader":"PGlhazZ0OSsycjRsQGVHcm91cHMuY29tPg=="},"prevInTopic":45225,"nextInTopic":0,"prevInTime":45225,"nextInTime":45227,"topicId":45220,"numMessagesInTopic":0,"msgSnippet":"From: amy_aec Sent: Sunday, October 31, 2010 11:52 AM To: unschoolingbasics@yahoogroups.com Subject: [unschoolingbasics] Re: individualism vs. community ... ","messageBody":"<div id=\"ygrps-yiv-1572874930\">From: amy_aec <br/>\nSent: Sunday, October 31, 2010 11:52 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSubject: [unschoolingbasics] Re: individualism vs. community<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; But, they frequently get their feelings hurt by the smaller groups of kids, who for whatever reason, don&#39;t want to include them. (My kids aren&#39;t perfect angels, and aren&#39;t always inclusive themselves.) In general, I&#39;d say all the kids are there, because they want to be, but I can&#39;t speak for every family in the group.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>How old are the kids in question? What do you mean when you say that the smaller groups don&#39;t want to include them? Are the other kids mean about it or do they just not invite your kids to participate? Do your kids make any effort to join the smaller groups? I know that my oldest daughter will sometimes get upset because groups don&#39;t include her. I have watched her interactions and I notice that she does nothing to actively try to participate. She will stand around and act shy and hope somebody invites her to join them. If they don&#39;t, then she gets her feelings hurt.  I talk to my daughter about her options when she feels like she is not being included. Whether or not the kids are perfect angels is irrelevant.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Just trying to figure this out in my own mind, where individual wants/needs end, and group needs begin. But, as you say, a gathering isn&#39;t a group, and therefore, doesn&#39;t really have a common goal, other than socializing.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I am confused by this statement. If this is a homeschool co-op that does not require kids to participate in the activity, then what is the goal of the group? Does the group have any sort of requirements or guidelines at all? Most homeschool groups have some kind of guidelines. There is one group in my area that is pretty much just a social group that meets at the park on Fridays. They post guidelines about what is expected. If somebody feels that those guidelines aren&#39;t being followed, then somebody speaks up and it is addressed. From your post, it is hard to tell whether or not you are describing kids being selective about who they hang out with or if there is something more serious going on. <br/>\n<br/>\nConnie<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: individualism vs. community","postDate":"1288547098","msgId":45225,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhazl1cStvMjRqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlhazZ0OSsycjRsQGVHcm91cHMuY29tPg=="},"prevInTopic":45224,"nextInTopic":45226,"prevInTime":45224,"nextInTime":45226,"topicId":45220,"numMessagesInTopic":0,"msgSnippet":"Ah, I had read it the other way -- that your kids were the ones in the smaller groups. So your question is how to get other kids to invite your children into","messageBody":"<div id=\"ygrps-yiv-1663611415\">Ah, I had read it the other way -- that your kids were the ones in the smaller groups. <br/>\n<br/>\nSo your question is how to get other kids to invite your children into their smaller groups?<br/>\n<br/>\nOr ???<br/>\n<br/>\nI think this is going to happen whenever people get together and it&#39;s part of learning how group activities function. We can&#39;t force others to include us in their inner circles. And vice versa.<br/>\n<br/>\nBut we also don&#39;t have to sit there feeling hurt and excluded. We can participate and build our own friendships.<br/>\n<br/>\nAnd we can stop judging whether any of this makes any of these people &quot;perfect angels.&quot; It doesn&#39;t.<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; BTW, my kids aren&#39;t forced to go.  They want to go.  But, they frequently get their feelings hurt by the smaller groups of kids, who for whatever reason, don&#39;t want to include them.  (My kids aren&#39;t perfect angels, and aren&#39;t always inclusive themselves.)  In general, I&#39;d say all the kids are there, because they want to be, but I can&#39;t speak for every family in the group.  <br/>\n&gt; <br/>\n&gt; Just trying to figure this out in my own mind, where individual wants/needs end, and group needs begin.  But, as you say, a gathering isn&#39;t a group, and therefore, doesn&#39;t really have a common goal, other than socializing.  <br/>\n&gt; <br/>\n&gt; Amy C. <br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":132876517,"authorName":"amy_aec","from":"&quot;amy_aec&quot; &lt;AECANGORA@...&gt;","profile":"amy_aec","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: individualism vs. community","postDate":"1288543977","msgId":45224,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhazZ0OSsycjRsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGk9NE10YitxdVZWRVBRME1FNVdaMmIwVXRneFZka2NVX1dLa185d0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":45223,"nextInTopic":45225,"prevInTime":45223,"nextInTime":45225,"topicId":45220,"numMessagesInTopic":0,"msgSnippet":"Thank you all for responding. I realized I was being vague.  My concerns are in reference to a homeschooling group that we attend where we like everyone very","messageBody":"<div id=\"ygrps-yiv-972778940\">Thank you all for responding.  <br/>\n<br/>\nI realized I was being vague.  My concerns are in reference to a homeschooling group that we attend where we like everyone very much, but I&#39;m not sure it&#39;s a good fit for us.  <br/>\n<br/>\nSome of your comments have helped clarify things for me.  I think what is catching me up is the definition of a group.  It&#39;s called a homeschooling co-op.  We do have a planned activity, but it is optional for the kids, so it really is more of a gathering/play group.  Previously, we belonged to a group that was more structured and where we did more community building activities.  So, that is where my hang up is.  <br/>\n<br/>\nBTW, my kids aren&#39;t forced to go.  They want to go.  But, they frequently get their feelings hurt by the smaller groups of kids, who for whatever reason, don&#39;t want to include them.  (My kids aren&#39;t perfect angels, and aren&#39;t always inclusive themselves.)  In general, I&#39;d say all the kids are there, because they want to be, but I can&#39;t speak for every family in the group.  <br/>\n<br/>\nJust trying to figure this out in my own mind, where individual wants/needs end, and group needs begin.  But, as you say, a gathering isn&#39;t a group, and therefore, doesn&#39;t really have a common goal, other than socializing.  <br/>\n<br/>\nAmy C. <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Karen Swanay &lt;luvbullbreeds@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; On Sun, Oct 31, 2010 at 7:40 AM, &lt;AECANGORA@...&gt; wrote:<br/>\n&gt; <br/>\n&gt; &gt;   Hi,<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; I&#39;ve been reading posts on this group since late winter and have posted a<br/>\n&gt; &gt; few times. I agree with a number of radical unschooling principles and am<br/>\n&gt; &gt; trying to apply time with my family. However, I am struggling with how these<br/>\n&gt; &gt; principles apply to groups.<br/>\n&gt; &gt;<br/>\n&gt; **Are you talking about your family as the group? How old are the members?<br/>\n&gt; How many are there?  What&#39;s the stated purpose of the group?<br/>\n&gt; <br/>\n&gt; &gt;<br/>\n&gt; &gt; There are times, when one is part of a group, that the individual has to<br/>\n&gt; &gt; put aside their own needs/wants for the good of the group. In otherwords,<br/>\n&gt; &gt; how does a group build community without asking anything of its members? At<br/>\n&gt; &gt; what point does the individual&#39;s needs end and the groups needs take over?<br/>\n&gt; &gt; Or do we only participate in groups as long as our own needs/wants are being<br/>\n&gt; &gt; met and just jump ship when the group isn&#39;t meeting our needs? Is it OK to<br/>\n&gt; &gt; segregate into smaller groups within the larger group, when our needs/wants<br/>\n&gt; &gt; aren&#39;t being met by the larger group, therefore excluding others in the<br/>\n&gt; &gt; process?<br/>\n&gt; &gt;<br/>\n&gt; **I think being clear about what a group is might be helpful.  A group may<br/>\n&gt; be defined as a collection of individuals who are trying to satisfy some<br/>\n&gt; personal need through their joint association.  According to this<br/>\n&gt; definition, the individuals are not a group unless they are motivated by<br/>\n&gt; some personal reason to be part of a group.  Individuals belong to the group<br/>\n&gt; in order to obtain rewards or to satisfy personal needs.  Also individuals<br/>\n&gt; are not a group unless they are affecting and being affected by each other<br/>\n&gt; and therefore, the primary defining characteristic of a group is<br/>\n&gt; interpersonal influence.  (So a &quot;group&quot; of people standing in line at the<br/>\n&gt; bank doesn&#39;t represent a group...it&#39;s a gathering of people because there is<br/>\n&gt; no primary interdependence.)   Similarly, I think of &quot;play dates&quot; where the<br/>\n&gt; mothers set kids up to play together, but the primary group are the mothers<br/>\n&gt; who want to socialize.  The kids may or may not be a part of the group, or<br/>\n&gt; rather, see themselves as part of a group because they are not getting their<br/>\n&gt; needs met by the group.  If this is so, then it&#39;s not hard to see how<br/>\n&gt; certain children might want to split off from the &quot;gathering&quot; of kids and<br/>\n&gt; form actual groups (which can be as small as two kids) where their needs are<br/>\n&gt; being met.  So if you could give a specific example I think it would be<br/>\n&gt; helpful for the list to be able to respond.  Your post is too vague to take<br/>\n&gt; much of a stab at...at least as I read it, it&#39;s an exercise in group theory.<br/>\n&gt; <br/>\n&gt; &gt;<br/>\n&gt; &gt; Just looking for some philosophical perspective on this. I agree with the<br/>\n&gt; &gt; principles of respecting and trusting our children when it comes to learning<br/>\n&gt; &gt; and even with making personal choices, such as which activities to<br/>\n&gt; &gt; participate in. But, once they are part of a group, shouldn&#39;t they be<br/>\n&gt; &gt; encouraged to participate in that group fully and in a way that is<br/>\n&gt; &gt; respectful of all members of the group? If they want to just have time alone<br/>\n&gt; &gt; with their friends and not participate in group activities or not include<br/>\n&gt; &gt; all members in their play, etc., then shouldn&#39;t they do that outside of the<br/>\n&gt; &gt; group at another time? Just trying to put it all together and wondering how<br/>\n&gt; &gt; radical unschooling principles apply to group situations.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Amy C.<br/>\n&gt; &gt;<br/>\n&gt; ** Two aspects of group interaction are especially important to<br/>\n&gt; understanding how a group is structured: differentiated roles and<br/>\n&gt; integrating norms.  Within any group, no matter which organization, society,<br/>\n&gt; or culture it belongs to, the group&#39;s roles and norms structure the<br/>\n&gt; interaction among group members.  Roles differentiate the responsibilities<br/>\n&gt; of group members, whereas norms integrate members&#39; efforts into a unified<br/>\n&gt; whole.  Formally a role may be defined as a set of expectations governing<br/>\n&gt; the appropriate behavior of an occupant of a position toward occupants of<br/>\n&gt; other related positions.  Once a role is assumed, however, the member is<br/>\n&gt; expected (by other group members) to behave in certain ways.  Members who<br/>\n&gt; conform to their role requirements are rewarded, whereas those who deviate<br/>\n&gt; are punished.  So again, without the specific example it&#39;s hard to know how<br/>\n&gt; to answer this.  If you are talking about a play group which is really about<br/>\n&gt; the parents, then the kids won&#39;t feel that they are a group and there would<br/>\n&gt; be nothing wrong (either from an RU perspective or a conventional parenting<br/>\n&gt; perspective) for a couple of kids to split off from the herd of kids to<br/>\n&gt; actually form a real group that has meaning for those kids.  If you are<br/>\n&gt; talking about a softball team though, well then the team will expect their<br/>\n&gt; pitcher to actually take the mound and pitch...not peel off the third<br/>\n&gt; baseman and the shortstop to go somewhere else and toss the softball<br/>\n&gt; around.  And further, I think it depends on the ages of the kids involved.<br/>\n&gt; Teens who are living an RU life seem to be much more respectful about<br/>\n&gt; &quot;sucking it up&quot; and doing things they might not want to do because they have<br/>\n&gt; been honored and supported in their own lives and so that&#39;s how they<br/>\n&gt; typically deal with others.  If you are talking about 3 yr olds...RU or<br/>\n&gt; not...a 3 yr old is a pretty selfish being.  (And that&#39;s not a negative<br/>\n&gt; though the word has bad connotations.)  3 yr olds are supposed to be<br/>\n&gt; egocentric.  They aren&#39;t going to &quot;get&quot; that they have an obligation to the<br/>\n&gt; other 3 yr olds to play soccer or whatever.  They are going to be all about<br/>\n&gt; getting their needs met.  But that would be normal child development and I<br/>\n&gt; don&#39;t know that RU principles have anything to do with it at that<br/>\n&gt; age....unless you are asking if you should force the issue, and in that<br/>\n&gt; case, I&#39;d say no.<br/>\n&gt; <br/>\n&gt; ** One final thing about groups...there MUST be trust among members for it<br/>\n&gt; to be a true group.  There has to be this idea of &quot;sinking or swimming&quot;<br/>\n&gt; together...without that it&#39;s not a group.  It&#39;s a gathering.  If you are<br/>\n&gt; trying to ask something about a group your kid is in, ask yourself if your<br/>\n&gt; kid feels that sense of duty to purpose of the group.  Does your kid trust<br/>\n&gt; the others?  If there is no trust or interdependence in that gathering of<br/>\n&gt; individuals then it&#39;s not a real group and so there can&#39;t be an expectation<br/>\n&gt; for it to behave like a group.  Context is important here.  Without knowing<br/>\n&gt; the context...like I said...it&#39;s all theory.<br/>\n&gt; <br/>\n&gt; Karen<br/>\n&gt; From House, MD discussing parents of a child with Autism --<br/>\n&gt; Dr Allison Cameron:Is it so wrong for them to want to have a normal child?<br/>\n&gt; It&#39;s normal to want to be normal.<br/>\n&gt; House: Spoken like a true circle queen. See, skinny socially privileged<br/>\n&gt; white people get to draw this neat little circle, and everyone inside the<br/>\n&gt; circle is normal, anyone outside the circle should be beaten, broken and<br/>\n&gt; reset so they can be brought into the circle. Failing that, they should be<br/>\n&gt; institutionalized or worse, pitied.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"Karen Swanay &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] individualism vs. community","postDate":"1288540123","msgId":45223,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9NE10YitxdVZWRVBRME1FNVdaMmIwVXRneFZka2NVX1dLa185d0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDhDRDQ3MEZFQTc1QzIxMC0xQkE4LUVCOTVAd2VibWFpbC1kMDc2LnN5c29wcy5hb2wuY29tPg==","referencesHeader":"PDhDRDQ3MEZFQTc1QzIxMC0xQkE4LUVCOTVAd2VibWFpbC1kMDc2LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":45222,"nextInTopic":45224,"prevInTime":45222,"nextInTime":45224,"topicId":45220,"numMessagesInTopic":0,"msgSnippet":"... **Are you talking about your family as the group? How old are the members? How many are there?  What s the stated purpose of the group? ... **I think being","messageBody":"<div id=\"ygrps-yiv-1219645072\">On Sun, Oct 31, 2010 at 7:40 AM, &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AECANGORA@...\">AECANGORA@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   Hi,<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I&#39;ve been reading posts on this group since late winter and have posted a<br/>\n&gt; few times. I agree with a number of radical unschooling principles and am<br/>\n&gt; trying to apply time with my family. However, I am struggling with how these<br/>\n&gt; principles apply to groups.<br/>\n&gt;<br/>\n </span></blockquote>**Are you talking about your family as the group? How old are the members?<br/>\nHow many are there?  What&#39;s the stated purpose of the group?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; There are times, when one is part of a group, that the individual has to<br/>\n&gt; put aside their own needs/wants for the good of the group. In otherwords,<br/>\n&gt; how does a group build community without asking anything of its members? At<br/>\n&gt; what point does the individual&#39;s needs end and the groups needs take over?<br/>\n&gt; Or do we only participate in groups as long as our own needs/wants are being<br/>\n&gt; met and just jump ship when the group isn&#39;t meeting our needs? Is it OK to<br/>\n&gt; segregate into smaller groups within the larger group, when our needs/wants<br/>\n&gt; aren&#39;t being met by the larger group, therefore excluding others in the<br/>\n&gt; process?<br/>\n&gt;<br/>\n </span></blockquote>**I think being clear about what a group is might be helpful.  A group may<br/>\nbe defined as a collection of individuals who are trying to satisfy some<br/>\npersonal need through their joint association.  According to this<br/>\ndefinition, the individuals are not a group unless they are motivated by<br/>\nsome personal reason to be part of a group.  Individuals belong to the group<br/>\nin order to obtain rewards or to satisfy personal needs.  Also individuals<br/>\nare not a group unless they are affecting and being affected by each other<br/>\nand therefore, the primary defining characteristic of a group is<br/>\ninterpersonal influence.  (So a &quot;group&quot; of people standing in line at the<br/>\nbank doesn&#39;t represent a group...it&#39;s a gathering of people because there is<br/>\nno primary interdependence.)   Similarly, I think of &quot;play dates&quot; where the<br/>\nmothers set kids up to play together, but the primary group are the mothers<br/>\nwho want to socialize.  The kids may or may not be a part of the group, or<br/>\nrather, see themselves as part of a group because they are not getting their<br/>\nneeds met by the group.  If this is so, then it&#39;s not hard to see how<br/>\ncertain children might want to split off from the &quot;gathering&quot; of kids and<br/>\nform actual groups (which can be as small as two kids) where their needs are<br/>\nbeing met.  So if you could give a specific example I think it would be<br/>\nhelpful for the list to be able to respond.  Your post is too vague to take<br/>\nmuch of a stab at...at least as I read it, it&#39;s an exercise in group theory.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Just looking for some philosophical perspective on this. I agree with the<br/>\n&gt; principles of respecting and trusting our children when it comes to learning<br/>\n&gt; and even with making personal choices, such as which activities to<br/>\n&gt; participate in. But, once they are part of a group, shouldn&#39;t they be<br/>\n&gt; encouraged to participate in that group fully and in a way that is<br/>\n&gt; respectful of all members of the group? If they want to just have time alone<br/>\n&gt; with their friends and not participate in group activities or not include<br/>\n&gt; all members in their play, etc., then shouldn&#39;t they do that outside of the<br/>\n&gt; group at another time? Just trying to put it all together and wondering how<br/>\n&gt; radical unschooling principles apply to group situations.<br/>\n&gt;<br/>\n&gt; Amy C.<br/>\n&gt;<br/>\n </span></blockquote>** Two aspects of group interaction are especially important to<br/>\nunderstanding how a group is structured: differentiated roles and<br/>\nintegrating norms.  Within any group, no matter which organization, society,<br/>\nor culture it belongs to, the group&#39;s roles and norms structure the<br/>\ninteraction among group members.  Roles differentiate the responsibilities<br/>\nof group members, whereas norms integrate members&#39; efforts into a unified<br/>\nwhole.  Formally a role may be defined as a set of expectations governing<br/>\nthe appropriate behavior of an occupant of a position toward occupants of<br/>\nother related positions.  Once a role is assumed, however, the member is<br/>\nexpected (by other group members) to behave in certain ways.  Members who<br/>\nconform to their role requirements are rewarded, whereas those who deviate<br/>\nare punished.  So again, without the specific example it&#39;s hard to know how<br/>\nto answer this.  If you are talking about a play group which is really about<br/>\nthe parents, then the kids won&#39;t feel that they are a group and there would<br/>\nbe nothing wrong (either from an RU perspective or a conventional parenting<br/>\nperspective) for a couple of kids to split off from the herd of kids to<br/>\nactually form a real group that has meaning for those kids.  If you are<br/>\ntalking about a softball team though, well then the team will expect their<br/>\npitcher to actually take the mound and pitch...not peel off the third<br/>\nbaseman and the shortstop to go somewhere else and toss the softball<br/>\naround.  And further, I think it depends on the ages of the kids involved.<br/>\nTeens who are living an RU life seem to be much more respectful about<br/>\n&quot;sucking it up&quot; and doing things they might not want to do because they have<br/>\nbeen honored and supported in their own lives and so that&#39;s how they<br/>\ntypically deal with others.  If you are talking about 3 yr olds...RU or<br/>\nnot...a 3 yr old is a pretty selfish being.  (And that&#39;s not a negative<br/>\nthough the word has bad connotations.)  3 yr olds are supposed to be<br/>\negocentric.  They aren&#39;t going to &quot;get&quot; that they have an obligation to the<br/>\nother 3 yr olds to play soccer or whatever.  They are going to be all about<br/>\ngetting their needs met.  But that would be normal child development and I<br/>\ndon&#39;t know that RU principles have anything to do with it at that<br/>\nage....unless you are asking if you should force the issue, and in that<br/>\ncase, I&#39;d say no.<br/>\n<br/>\n** One final thing about groups...there MUST be trust among members for it<br/>\nto be a true group.  There has to be this idea of &quot;sinking or swimming&quot;<br/>\ntogether...without that it&#39;s not a group.  It&#39;s a gathering.  If you are<br/>\ntrying to ask something about a group your kid is in, ask yourself if your<br/>\nkid feels that sense of duty to purpose of the group.  Does your kid trust<br/>\nthe others?  If there is no trust or interdependence in that gathering of<br/>\nindividuals then it&#39;s not a real group and so there can&#39;t be an expectation<br/>\nfor it to behave like a group.  Context is important here.  Without knowing<br/>\nthe context...like I said...it&#39;s all theory.<br/>\n<br/>\nKaren<br/>\nFrom House, MD discussing parents of a child with Autism --<br/>\nDr Allison Cameron:Is it so wrong for them to want to have a normal child?<br/>\nIt&#39;s normal to want to be normal.<br/>\nHouse: Spoken like a true circle queen. See, skinny socially privileged<br/>\nwhite people get to draw this neat little circle, and everyone inside the<br/>\ncircle is normal, anyone outside the circle should be beaten, broken and<br/>\nreset so they can be brought into the circle. Failing that, they should be<br/>\ninstitutionalized or worse, pitied.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] individualism vs. community","postDate":"1288537433","msgId":45222,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhBQUY1ODJEQjdGMzQwQzQ5NTU5QzNBN0UyMUVGRDlDQENvbm5pZVBDPg==","inReplyToHeader":"PDhDRDQ3MEZFQTc1QzIxMC0xQkE4LUVCOTVAd2VibWFpbC1kMDc2LnN5c29wcy5hb2wuY29tPg==","referencesHeader":"PDhDRDQ3MEZFQTc1QzIxMC0xQkE4LUVCOTVAd2VibWFpbC1kMDc2LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":45221,"nextInTopic":45223,"prevInTime":45221,"nextInTime":45223,"topicId":45220,"numMessagesInTopic":0,"msgSnippet":"From: AECANGORA@aol.com Sent: Sunday, October 31, 2010 7:40 AM To: unschoolingbasics@yahoogroups.com Subject: [unschoolingbasics] individualism vs. community ","messageBody":"<div id=\"ygrps-yiv-1692421328\">From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AECANGORA@...\">AECANGORA@...</a> <br/>\nSent: Sunday, October 31, 2010 7:40 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSubject: [unschoolingbasics] individualism vs. community<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;There are times, when one is part of a group, that the individual has to put aside their own needs/wants for the good of the group. In otherwords, how does a group build community without asking anything of its members? At what point does the individual&#39;s needs end and the groups needs take over? Or do we only participate in groups as long as our own needs/wants are being met and just jump ship when the group isn&#39;t meeting our needs?&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>From my perspective, I see group membership as something that is voluntary. If a group is meeting the needs of the participants, the then participants will stay and do what is asked. If a group isn&#39;t meeting those needs, then why can&#39;t a person just leave the group? What is the purpose of staying in a group that isn&#39;t meeting your needs? As an adult, I can see where it would be a good idea to honor commitments if you are in a group and have made some kind of agreement or promise to the group. For children, I feel like if a group is meeting the child&#39;s needs, then the child will want to continue to go to that group and do what is asked. I think it is perfectly acceptable for groups to ask for help or participation from the members. If the members want to be there and like what is going on, they will be more than willing to do what is asked. I think the discussion of groups can be a slippery slope. I think it is essential for a person to be able to know when to walk away from a group. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Is it OK to segregate into smaller groups within the larger group, when our needs/wants aren&#39;t being met by the larger group, therefore excluding others in the process?&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>It is really going to depend on the type of group and the overall purpose of the group. I can see where segregating into smaller groups within the larger group would be very helpful. Isn&#39;t that what a committee is? Committees exclude others all of the time so that they can put more focus on one particular activity or topic. What do you mean by excluding? Are you talking about the process of ignoring or snubbing other members or are you talking about not actively engaging the other members? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt; But, once they are part of a group, shouldn&#39;t they be encouraged to participate in that group fully and in a way that is respectful of all members of the group? &lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Most groups have rules or expectations of its members. A person should be aware of those expectations before joining a group. If a child isn&#39;t old enough to understand or meet those expectations, I don&#39;t see how encouraging them to participate would be helpful to the individual or the group. I have joined groups where I thought the expectations were one thing but once I got actively involved, I found out that they were actually something very different than what I originally thought. Sometimes, the most respectful thing to do is to walk away from a group. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;If they want to just have time alone with their friends and not participate in group activities or not include all members in their play, etc., then shouldn&#39;t they do that outside of the group at another time? Just trying to put it all together and wondering how radical unschooling principles apply to group situations.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>All of this is going to depend on the dynamics of the specific group. Some groups have very rigid rules and expectations and some groups do not. I don&#39;t think there is one right answer here because groups can be formed with very strict rules or with very loose rules. What is the purpose of the group? What are the individuals expectations of the group? What are the groups expectations of the individual? From my understanding, a kid should be allowed to choose whether or not to participate in groups. If a child wants to participate, then they should follow the rules that are set out by the group with the caveat that there is always the option of leaving the group.<br/>\n<br/>\nConnie<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: individualism vs. community","postDate":"1288535513","msgId":45221,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhanVrcCtrdGFsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDRDQ3MEZFQTc1QzIxMC0xQkE4LUVCOTVAd2VibWFpbC1kMDc2LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":45220,"nextInTopic":45222,"prevInTime":45220,"nextInTime":45222,"topicId":45220,"numMessagesInTopic":0,"msgSnippet":"Why is this your problem? Your children have chosen to participate in X group activity and now you see that they chat with friends within the group or do","messageBody":"<div id=\"ygrps-yiv-1767453219\">Why is this your problem? Your children have chosen to participate in X group activity and now you see that they chat with friends within the group or do something else that doesn&#39;t jibe with how you think the group should be functioning. Either they will continue to enjoy participating or they won&#39;t. Either the group tolerates some amount of whatever behavior it is that you don&#39;t approve of or it doesn&#39;t. If it doesn&#39;t, they will be told. And they will sort it out, either continuing or not. <br/>\n<br/>\nMaybe they will learn not to do something. Maybe they will just enjoy the ebb and flow of a group that is not all that danged serious. Either way, they will have the experience. Not you. And that is respectful to them and maybe, just maybe, trusting them to know how to behave and interact will translate to them not being that annoying kid who talks during the instruction part of the activity. <br/>\n<br/>\nMaybe they need a small heads up that while doing X activity it is normally polite to be quiet and listen and let others listen during a particular time. Maybe they need to be told that the activity leader will ask all of you to leave if they are too disruptive, if that&#39;s the case -- where the line is. And that they can see their friends at another time if this activity isn&#39;t really all it&#39;s cracked up to be. <br/>\n<br/>\nBut then they need to do it themselves. <br/>\n<br/>\nAll of this assumes they are mature enough to understand. That you are not putting them in a situation they are not capable of participating in -- something designed for older kids, for instance.<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\n-<br/>\n<blockquote><span title=\"qreply\"> &gt; Just looking for some philosophical perspective on this.  I agree with the principles of respecting and trusting our children when it comes to learning and even with making personal choices, such as which activities to participate in.  But, once they are part of a group, shouldn&#39;t they be encouraged to participate in that group fully and in a way that is respectful of all members of the group?  If they want to just have time alone with their friends and not participate in group activities or not include all members in their play, etc., then shouldn&#39;t they do that outside of the group at another time?  Just trying to put it all together and wondering how radical unschooling principles apply to group situations.  <br/>\n&gt; <br/>\n&gt; Amy C. <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":132876517,"authorName":"AECANGORA@aol.com","from":"AECANGORA@...","profile":"amy_aec","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"individualism vs. community","postDate":"1288528821","msgId":45220,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRDQ3MEZFQTc1QzIxMC0xQkE4LUVCOTVAd2VibWFpbC1kMDc2LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":45221,"prevInTime":45219,"nextInTime":45221,"topicId":45220,"numMessagesInTopic":0,"msgSnippet":"Hi, I ve been reading posts on this group since late winter and have posted a few times.  I agree with a number of radical unschooling principles and am trying","messageBody":"<div id=\"ygrps-yiv-828248829\">Hi,  <br/>\n<br/>\nI&#39;ve been reading posts on this group since late winter and have posted a few times.  I agree with a number of radical unschooling principles and am trying to apply time with my family.  However, I am struggling with how these principles apply to groups.  <br/>\n<br/>\nThere are times, when one is part of a group, that the individual has to put aside their own needs/wants for the good of the group.  In otherwords, how does a group build community without asking anything of its members?  At what point does the individual&#39;s needs end and the groups needs take over?  Or do we only participate in groups as long as our own needs/wants are being met and just jump ship when the group isn&#39;t meeting our needs?  Is it OK to segregate into smaller groups within the larger group, when our needs/wants aren&#39;t being met by the larger group, therefore excluding others in the process?  <br/>\n<br/>\nJust looking for some philosophical perspective on this.  I agree with the principles of respecting and trusting our children when it comes to learning and even with making personal choices, such as which activities to participate in.  But, once they are part of a group, shouldn&#39;t they be encouraged to participate in that group fully and in a way that is respectful of all members of the group?  If they want to just have time alone with their friends and not participate in group activities or not include all members in their play, etc., then shouldn&#39;t they do that outside of the group at another time?  Just trying to put it all together and wondering how radical unschooling principles apply to group situations.  <br/>\n<br/>\nAmy C. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":45219,"nextTopicId":45227}}