{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":254952563,"authorName":"Aidan Sutherland","from":"Aidan Sutherland &lt;aidansutherland@...&gt;","profile":"aidansutherland","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Finding my place in their relationship","postDate":"1235230782","msgId":38415,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM3MDE0Ljk1MTk1LnFtQHdlYjM0MjAzLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":38409,"nextInTopic":0,"prevInTime":38414,"nextInTime":38416,"topicId":38401,"numMessagesInTopic":0,"msgSnippet":"I wanted to comment on the step parenting aspect of this situation, because I think it may also play a part. My situation is similar to yours- my ex and I","messageBody":"<div id=\"ygrps-yiv-682625779\">I wanted to comment on the step parenting aspect of this situation, because I think it may also play a part. My situation is similar to yours- my ex and I married when my dd, now 10, was 2. We went on to have three more kids. I see a difference in how he parents his biological kids compared to his adopted daughter. It seems like the main difference is that he missed that all important newborn bonding stage with her. It left him parenting more from the head, less from the heart. Also, he didn&#39;t have any kids of his own, so marrying me gave him his first opportunity to even think about parenthood- when her life was already two years started. It&#39;s hard to catch up. <br/>\n<br/>\nHe has also had a problem with teasing when he feels stressed or angry. I have come to this issue with a protective attitude, because my dd is the child, the one who doesn&#39;t quite get what&#39;s happening, but knows it feels awful. That&#39;s the thing that is so duhumanizing about teasing- it looks like it&#39;s meant to be in fun, and my ex will say he&#39;s trying to have fun with her. But this nasty anger is lurking under the surface. I have always felt that it was important to step in and clear the air, to state for everyone that he&#39;s angry/tired/stressed and that what he&#39;s doing is not fun. I think it&#39;s important for my dd to have an adult advocate for her in that way.<br/>\n<br/>\nOver time it has helped a lot. He used to do it all the time. My dd, also, has learned to come out with a very strong- NO! Which is obviously a useful skill.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re:Finding my place in their relationship","postDate":"1235169226","msgId":38409,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5OUYyRkNBLjQwMDA2MDVAbWFjLmNvbT4=","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlFQkM3QEJPWC5DTkNTT0ZUV0FSRS5DT00+","referencesHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlFQkM3QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":38408,"nextInTopic":38415,"prevInTime":38408,"nextInTime":38410,"topicId":38401,"numMessagesInTopic":0,"msgSnippet":"... This was really important to me to get across to my husband, too. I have girls and it was very effective to say to him, Do you want our girls to think it","messageBody":"<div id=\"ygrps-yiv-1337269467\">On 2/20/2009 5:40 AM, Debra Rossing wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; As far as the hair ruffling/teasing thing, we have made it clear from<br/>\n&gt; the get go that Stop means Stop whether it&#39;s child-child, adult-adult,<br/>\n&gt; or adult-child.<br/>\n<br/>\n </span></blockquote>This was really important to me to get across to my husband, too. I have <br/>\ngirls and it was very effective to say to him, &quot;Do you want our girls to <br/>\nthink it is okay for someone to keep doing something to them when <br/>\nthey&#39;ve said stop?&quot; He visibly paled. That was the end of him ever <br/>\ncontinuing to tease or roughhouse or anything else when any of them said <br/>\nstop.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"diana jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Finding my place in their relationship","postDate":"1235150113","msgId":38408,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDkwMjIwMDkxNW8zOGI4OTMwNXhkOTlmYmE4MzA4NGQ1NDg4QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdubGJ2ZSsxMHV0MEBlR3JvdXBzLmNvbT4=","referencesHeader":"PGdubGJ2ZSsxMHV0MEBlR3JvdXBzLmNvbT4="},"prevInTopic":38406,"nextInTopic":38409,"prevInTime":38407,"nextInTime":38409,"topicId":38401,"numMessagesInTopic":0,"msgSnippet":"... My kids were little, little, little, when I empowered them to tell ANYONE (including/especially my parents) - NO MEANS NO or STOP MEANS STOP -- mostly","messageBody":"<div id=\"ygrps-yiv-301869729\">On Thu, Feb 19, 2009 at 8:35 PM, Tara &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:organicsis@...\">organicsis@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   We were walking up to a local restaurant for an early dinner. DH was<br/>\n&gt; teasing Zeb, ruffling his hair, etc. Zeb got frustrated when he<br/>\n&gt; wouldn&#39;t stop and lashed out at him, hitting his arm away. From my<br/>\n&gt; POV, I can totally relate to how Zeb was feeling - tired, cranky,<br/>\n&gt; hungry, not wanting to be pestered. But DH got so mad! This kind of<br/>\n&gt; thing happens alot. DH thinks he&#39;s being loving by teasing<br/>\n&gt; excessively and DS gets angry and the two of them start fighting.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>My kids were little, little, little, when I empowered them to tell ANYONE<br/>\n(including/especially my parents) - &quot;NO MEANS NO&quot; or &quot;STOP MEANS STOP&quot; --<br/>\nmostly because as a child I was held down and tickled until I peed my pants,<br/>\nwith a whole circle of adults watching the adults who did it. Regularly. My<br/>\n&quot;no&quot; was useless.<br/>\n*I* would say to DH, outside of earshot of DS, &quot;And when Zeb&#39;s on a date and<br/>\nhe&#39;s tickling his girl, thinking it&#39;s all fine and good, and she says no,<br/>\nbut he keeps doing it *out of love* ... doesn&#39;t this sound like it&#39;s heading<br/>\ntowards serious danger?&quot; Our bodies belong to us. Ask him how it felt when<br/>\nadults touched him unwantedly when he was a kid. I didn&#39;t like it. And it<br/>\nsure made me angry. Wish I&#39;d been safe enough to actually say something -<br/>\nthere is a sign your son expects dh to listen to him and respect his body.<br/>\nAnd I always side with the human who has a right to not be touched.  Even in<br/>\nlove.<br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.blogspot.com<br/>\nhannahsashes.blogspot.com<br/>\ndianas365.blogspot.com<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":122460111,"authorName":"Tammy Curry","from":"Tammy Curry &lt;mamabeart00@...&gt;","profile":"mamabeart00","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Finding my place in their relationship","postDate":"1235140227","msgId":38405,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI2NjMxNi43OTYyMC5xbUB3ZWI0NTMwMy5tYWlsLnNwMS55YWhvby5jb20+","referencesHeader":"PGdubG00ditrZGNhQGVHcm91cHMuY29tPg=="},"prevInTopic":38403,"nextInTopic":38406,"prevInTime":38404,"nextInTime":38406,"topicId":38401,"numMessagesInTopic":0,"msgSnippet":"Tiff, Thank you for sharing those. If you do not mind I think I am going to use them to make up a basic family bill of rights for my family. My husband and I","messageBody":"<div id=\"ygrps-yiv-657724584\">Tiff,<br/>\n<br/>\nThank you for sharing those. If you do not mind I think I am going to use them to make up a basic family bill of rights for my family. My husband and I both need help moving further into unschooling. It has been very hard to let go of some of our pre-conceived notions on parenting. But we really need to. We have been reading a number of books from our public library and slowly incorporating things into our lives. I think your list might help us quite bit. We both come from rather strict backgrounds but want more for our children. Admittedly life has been rough for us all for a while and there is security in the status quo, at least for us. However, we have been talking at length about trying to ensure that our children feel secure and loved. <br/>\n<br/>\n <br/>\nTammy Curry, Director of Chaos<br/>\nhttp://tammycurry.blogspot.com/<br/>\nhttp://crazy-homeschool-adventures.blogspot.com/<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: tbearup &lt;tiffbear@...&gt;<br/>\nTo: unschoolingbasics@yahoogroups.com<br/>\nSent: Friday, February 20, 2009 2:29:35 AM<br/>\nSubject: [unschoolingbasics] Re: Finding my place in their relationship<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Dad. But DH comes from a much different background than I do. Seen <br/>\n&gt; and not heard, abusive &quot;discipline&quot; , ridicule, etc. He sometimes has <br/>\n&gt; a very difficult time not falling back on the things he&#39;s learned as <br/>\n&gt; a kid.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Hi Tara!<br/>\n<br/>\nI have some of the same issues with my DH, who came from a similar background.  He <br/>\ncame from the anti-unschooling extreme, to say the least.  :(  To him, he had thing beat <br/>\ninto him (literally) that came from a dominating, aggressive, and controlling father. <br/>\n<br/>\nWhen I started unschooling things really rubbed him the wrong way because what we <br/>\nwelcomed into our house (freedom to speak freely, respect for the other person, trust in <br/>\nour kids, relaxation of a rigorous schedule, etc) was everything he was NOT given and <br/>\nactually felt was &#39;wrong&#39; in comparison to what he was taught. <br/>\n<br/>\nI gently introduced a list of &#39;basic rights for everyone in our family&#39; list.  I realized that <br/>\nhubby really needed to be rehabilitated and shown a gentler way, because it just wasn&#39;t <br/>\nnatural to him.  the one thing I had going for me is that he knew how unhappy he was as a <br/>\nkid growing up, and the last thing he wanted was to make his own child feel that way.  It <br/>\ncan be very delicate and sensitive to bring that up, but getting him to make a connection <br/>\nto how he felt as a kid and how he may be making Z. feel may change his heart a little. <br/>\n<br/>\nThe following are some basic rights to which all parties to a relationship are entitled.<br/>\nThe right to good will from the other.<br/>\nThe right to emotional support.<br/>\nThe right to be heard by the other and to be responded to with courtesy.<br/>\nThe right to have your own view, even if your partner has a different view.<br/>\nThe right to have your feelings and experience acknowledged as real.<br/>\nThe right to receive a sincere apology for any jokes you may find offensive.<br/>\nThe right to clear and informative answers to questions that concern what is legitimately <br/>\nyour business.<br/>\nThe right to live free from accusation and blame.<br/>\nThe right to live free from criticism, judgement, put-downs or ridicule.<br/>\nThe right to have your work and your interests spoken of with respect.<br/>\nThe right to encouragement.<br/>\nThe right to live free from emotional and physical threat.<br/>\nThe right to live free from angry outburst and rage.<br/>\nThe right to be called by no name that devalues you.<br/>\nThe right to be respectfully asked rather than ordered.<br/>\nThe basic rights can be found here:<br/>\n<br/>\nhttp://thelaughingb logster.blogspot .com/2004/ 09/basic- rights-in- relationships-<br/>\nevna.html<br/>\n<br/>\nI empathize with the &#39;teasing going too far&#39; situation, as my hubby is an aggressive type <br/>\nteaser, meaning, he doesn&#39;t know when to stop if the other person is getting <br/>\nannoyed/upset.  This also stems from his upbringing.  I just refer to the basic rights and <br/>\ntell him clearly that I (my kids) are not enjoying it.  Before, he would say something like, <br/>\n&quot;You have no sense of humor&quot; or &quot;why are you so uptight&quot;.  Now, since he&#39;s agreed to have <br/>\nthe basic rights be a part of our &#39;family rules&#39;, he apologizes if he crosses the line.<br/>\n<br/>\nHTH in some way!<br/>\n<br/>\nTiff<br/>\nwww.childplay. wordpress. com<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":356810011,"authorName":"raisingexplorers","from":"&quot;raisingexplorers&quot; &lt;raisingexplorers@...&gt;","profile":"raisingexplorers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Finding my place in their relationship","postDate":"1235138349","msgId":38406,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdubWN2ZCt0NGxlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdubG00ditrZGNhQGVHcm91cHMuY29tPg=="},"prevInTopic":38405,"nextInTopic":38408,"prevInTime":38405,"nextInTime":38407,"topicId":38401,"numMessagesInTopic":0,"msgSnippet":"I love the basic rights list. What a grand idea. Something that helped our family was the fact that my husband had taken anger management before we married..","messageBody":"<div id=\"ygrps-yiv-1958768650\">I love the basic rights list. What a grand idea. <br/>\n<br/>\nSomething that helped our family was the fact that my husband had<br/>\ntaken anger management before we married.. Hubby has children from a<br/>\nprevious relationship and I can see how his previous behavior hurt<br/>\nthat family. With the anger management course under his belt, he&#39;s a<br/>\nmuch more stable person and able to react with consideration and<br/>\ncompassion. He&#39;s learned to respect the boundaries of others, the kids<br/>\nincluded and his anger management techniques really benefit all of us<br/>\nas we find inspiration in the way he handles situations. In the past,<br/>\nhe&#39;s credited that course with giving him a lot of tools and better<br/>\nenabling him to stay centered and focused. <br/>\n<br/>\nHe has little interest in the internet, so reading blogs and lists<br/>\nlike these are pretty out of the question. But, I do print out the<br/>\ndaily groove from enjoyparenting.com because I enjoy the reminders,<br/>\nand thought he would also. I leave them on the counter so he can read<br/>\nthe quick little notes when he gets his coffee in the morning. He<br/>\nenjoys them, and asked me to continue doing that for him. It&#39;s simple,<br/>\nfast and offers a wide variety of food for thought as he goes about<br/>\nhis work day. <br/>\n<br/>\nMy husband&#39;s quick jealousy streak at the very beginning of our<br/>\nunschool journey faded rather rapidly.. I took notice of his feelings<br/>\nand quickly embraced him as an integral part of this. I thought that<br/>\nhe didn&#39;t quite feel included, kind of left out and that left him<br/>\nwishing his childhood had been different.. so he could have<br/>\nexperienced what this is like. But, he can experience it now. So, I<br/>\nset out to find ways to get the boys together more with him.. in<br/>\nenvironments where they could all learn new things, together. Then I<br/>\nexplained... that&#39;s what we do. That&#39;s unschool. You&#39;re doing it.<br/>\nYou&#39;re part of it.. and I let him know that he&#39;s an integral force in<br/>\nmaking all of it possible. While he&#39;s at work, he&#39;s a part of it.<br/>\nWhile he&#39;s mowing the grass, while he&#39;s working on his car, all of the<br/>\ntime.. he&#39;s part of it.. and I think that helped tremendously. Just<br/>\nfor him to realize and have me vocally acknowledge that he&#39;s so<br/>\nimportant and that he&#39;s always involved and he doesn&#39;t have to look<br/>\nback and wish, because he&#39;s doing it right now. It sounds simple, but<br/>\nsometimes people need to hear it to bring them back to the present. I<br/>\nthink.</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:Finding my place in their relationship","postDate":"1235137221","msgId":38403,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlFQkM3QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":38402,"nextInTopic":38405,"prevInTime":38402,"nextInTime":38404,"topicId":38401,"numMessagesInTopic":0,"msgSnippet":"DH made the same confession many years ago - DS was maybe 5 at the time (he s 10 now). We had a long, long, late night talk brought about by some event or","messageBody":"<div id=\"ygrps-yiv-534788799\">DH made the same &#39;confession&#39; many years ago - DS was maybe 5 at the<br/>\ntime (he&#39;s 10 now). We had a long, long, late night talk brought about<br/>\nby some event or situation. He finally said that he was &quot;jealous&quot; of how<br/>\ngood DS had it and that he felt guilty for being jealous. He needed<br/>\n&quot;permission&quot; or something to allow himself to heal his own younger self<br/>\n- to go out and get a $5 gadget that looked cool just because he wanted<br/>\nit (and the funds were available), rather than having to &#39;earn&#39; it<br/>\nsomehow. I tried to encourage him to think about &quot;How would you have<br/>\nfelt if someone did this for you when you were a kid?&quot; and then go ahead<br/>\nand allow yourself to do/have/be that. Rather than being<br/>\ntorn/grumpy/jealous/guilty over the differences, he started healing all<br/>\nthose &quot;I wish I had been able to...when I was a kid&quot; things instead of<br/>\nexpecting/demanding that DS somehow show gratitude for the freedoms he<br/>\nhad (which he&#39;s never known any different, we started walking in this<br/>\nlifestyle before DS was 3, he doesn&#39;t know anything different but living<br/>\nlife free though he can see it and recognize it in other families we<br/>\nknow). It can be REALLY hard to admit that what he went through was not<br/>\nsomehow a &#39;good thing&#39;, that it hurt him, because it is generally one of<br/>\nthose &quot;I survived it and it made me stronger&quot; or &quot;Everyone does that&quot; or<br/>\nwhatever. But to ADMIT to one&#39;s self that No, when my dad/mom did that<br/>\nit really hurt me and I felt &lt;whatever - hurt, belittled, angry, scared,<br/>\netc&gt;&quot; Then move on to &quot;Do you want your child, this child you obviously<br/>\nlove, to feel that way?&quot; Odds are the answer is no but coming to a place<br/>\nwhere you can realize that it does NOT have to be that way can be hard,<br/>\nseeing that there is another way to raise children and live as a family<br/>\nand all calls into question everything you thought you knew.<br/>\n<br/>\nAs far as the hair ruffling/teasing thing, we have made it clear from<br/>\nthe get go that Stop means Stop whether it&#39;s child-child, adult-adult,<br/>\nor adult-child. Doesn&#39;t matter whether it&#39;s tickling or silly joking (I<br/>\nhave a tendency toward silly puns that sometimes irritates DS) or<br/>\nsinging along to the CD on the car stereo, Stop means Stop. AFTER the<br/>\nbehavior has stopped, then there can be discussion of how to meet needs<br/>\n(DH&#39;s desire to sing along with a favorite song; DS&#39; need for less sound<br/>\n- he prefers totally instrumental music to vocals in general; my need to<br/>\nNOT be stuck in the car between two grumpy people for 2 hours, etc).<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":215721717,"authorName":"tbearup","from":"&quot;tbearup&quot; &lt;tiffbear@...&gt;","profile":"tbearup","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Finding my place in their relationship","postDate":"1235114975","msgId":38402,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdubG00ditrZGNhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdubGJ2ZSsxMHV0MEBlR3JvdXBzLmNvbT4="},"prevInTopic":38401,"nextInTopic":38403,"prevInTime":38401,"nextInTime":38403,"topicId":38401,"numMessagesInTopic":0,"msgSnippet":"... Hi Tara! I have some of the same issues with my DH, who came from a similar background.  He came from the anti-unschooling extreme, to say the least.  :(","messageBody":"<div id=\"ygrps-yiv-488303134\"><blockquote><span title=\"ireply\">&gt; Dad. But DH comes from a much different background than I do. Seen <br/>\n&gt; and not heard, abusive &quot;discipline&quot;, ridicule, etc. He sometimes has <br/>\n&gt; a very difficult time not falling back on the things he&#39;s learned as <br/>\n&gt; a kid.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Hi Tara!<br/>\n<br/>\nI have some of the same issues with my DH, who came from a similar background.  He <br/>\ncame from the anti-unschooling extreme, to say the least.  :(  To him, he had thing beat <br/>\ninto him (literally) that came from a dominating, aggressive, and controlling father.  <br/>\n<br/>\nWhen I started unschooling things really rubbed him the wrong way because what we <br/>\nwelcomed into our house (freedom to speak freely, respect for the other person, trust in <br/>\nour kids, relaxation of a rigorous schedule, etc) was everything he was NOT given and <br/>\nactually felt was &#39;wrong&#39; in comparison to what he was taught.  <br/>\n<br/>\nI gently introduced a list of &#39;basic rights for everyone in our family&#39; list.  I realized that <br/>\nhubby really needed to be rehabilitated and shown a gentler way, because it just wasn&#39;t <br/>\nnatural to him.  the one thing I had going for me is that he knew how unhappy he was as a <br/>\nkid growing up, and the last thing he wanted was to make his own child feel that way.  It <br/>\ncan be very delicate and sensitive to bring that up, but getting him to make a connection <br/>\nto how he felt as a kid and how he may be making Z. feel may change his heart a little.  <br/>\n<br/>\nThe following are some basic rights to which all parties to a relationship are entitled.<br/>\nThe right to good will from the other.<br/>\nThe right to emotional support.<br/>\nThe right to be heard by the other and to be responded to with courtesy.<br/>\nThe right to have your own view, even if your partner has a different view.<br/>\nThe right to have your feelings and experience acknowledged as real.<br/>\nThe right to receive a sincere apology for any jokes you may find offensive.<br/>\nThe right to clear and informative answers to questions that concern what is legitimately <br/>\nyour business.<br/>\nThe right to live free from accusation and blame.<br/>\nThe right to live free from criticism, judgement, put-downs or ridicule.<br/>\nThe right to have your work and your interests spoken of with respect.<br/>\nThe right to encouragement.<br/>\nThe right to live free from emotional and physical threat.<br/>\nThe right to live free from angry outburst and rage.<br/>\nThe right to be called by no name that devalues you.<br/>\nThe right to be respectfully asked rather than ordered.<br/>\nThe basic rights can be found here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://thelaughingblogster.blogspot.com/2004/09/basic-rights-in-relationships-\">http://thelaughingblogster.blogspot.com/2004/09/basic-rights-in-relationships-</a><br/>\nevna.html<br/>\n<br/>\nI empathize with the &#39;teasing going too far&#39; situation, as my hubby is an aggressive type <br/>\nteaser, meaning, he doesn&#39;t know when to stop if the other person is getting <br/>\nannoyed/upset.  This also stems from his upbringing.  I just refer to the basic rights and <br/>\ntell him clearly that I (my kids) are not enjoying it.  Before, he would say something like, <br/>\n&quot;You have no sense of humor&quot; or &quot;why are you so uptight&quot;.  Now, since he&#39;s agreed to have <br/>\nthe basic rights be a part of our &#39;family rules&#39;, he apologizes if he crosses the line.<br/>\n<br/>\nHTH in some way!<br/>\n<br/>\nTiff<br/>\nwww.childplay.wordpress.com</div>","specialLinks":[]},{"userId":232521827,"authorName":"Tara","from":"&quot;Tara&quot; &lt;organicsis@...&gt;","profile":"organicsis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Finding my place in their relationship","postDate":"1235104558","msgId":38401,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdubGJ2ZSsxMHV0MEBlR3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":38402,"prevInTime":38400,"nextInTime":38402,"topicId":38401,"numMessagesInTopic":0,"msgSnippet":"Hi all, my name is Tara, mama to Zeb (9 y.o.) and wife to Justin. We ve been unschooling for a little over two years and for the most part are doing wonderful.","messageBody":"<div id=\"ygrps-yiv-1329347122\">Hi all, my name is Tara, mama to Zeb (9 y.o.) and wife to Justin. <br/>\nWe&#39;ve been unschooling for a little over two years and for the most <br/>\npart are doing wonderful. Our challenge seems to mostly be between DH <br/>\nand DS.<br/>\n<br/>\nMy husband is not my son&#39;s bio-dad. We were married when he was <br/>\nthree. However, he has raised him as his son and Zeb thinks of him as <br/>\nDad. But DH comes from a much different background than I do. Seen <br/>\nand not heard, abusive &quot;discipline&quot;, ridicule, etc. He sometimes has <br/>\na very difficult time not falling back on the things he&#39;s learned as <br/>\na kid.<br/>\n<br/>\nI know part of his problem comes from a place of jealousy. He&#39;s <br/>\nstated in many different ways &quot;how good Zeb has it&quot; or how he would <br/>\nnever have gotten away with something or how he wishes he could stay <br/>\nat home and play all day. :( DH is working very hard right now. Today <br/>\nwas his first day off in nearly a month; he&#39;s been working 12 hour <br/>\ndays and is very tired and can get cranky. Of course these reactions <br/>\naren&#39;t isolated to the times DH is on overtime, but it certainly <br/>\nmakes it worse.<br/>\n<br/>\nToday we were very excited he had a day off. DS had a golf lesson so <br/>\nwe went early so they could hit some balls for awhile together. DH <br/>\nenjoyed watching Zeb&#39;s golf class for the first time and was so <br/>\nimpressed. Then it was rock climbing with some un- and homeschoolers. <br/>\nOur first mistake was deciding we were still full from a late <br/>\nbreakfast and opting to skip lunch. I should have known after 3 hours <br/>\nof rock climbing we&#39;d be famished and tired, which only exaggerated <br/>\nthings. Here&#39;s what happened:<br/>\n<br/>\nWe were walking up to a local restaurant for an early dinner. DH was <br/>\nteasing Zeb, ruffling his hair, etc. Zeb got frustrated when he <br/>\nwouldn&#39;t stop and lashed out at him, hitting his arm away. From my <br/>\nPOV, I can totally relate to how Zeb was feeling - tired, cranky, <br/>\nhungry, not wanting to be pestered. But DH got so mad! This kind of <br/>\nthing happens alot. DH thinks he&#39;s being loving by teasing <br/>\nexcessively and DS gets angry and the two of them start fighting.<br/>\n<br/>\nAnd here I am in the middle. I can empathize with both of them - DH <br/>\ntrying his best, Zeb needing affection in other ways; DH deserving <br/>\nnot to be hit out of anger, Zeb deserving to have his feelings <br/>\nrespected. I would love DH to see that he is the adult and lend some <br/>\nempathy and leeway (sp?) to Zeb but he feels I should back him up at <br/>\nall costs. I&#39;m not comfortable backing him up when it really feels <br/>\nlike ganging up on the littlest member of the family. <br/>\n<br/>\nDH sat angrily thru dinner while me and Zeb let it go and tried to <br/>\nenjoy ourselves. After dinner DH left quickly while we went to the <br/>\nbathroom. I talked to Zeb a little about DH&#39;s POV and used our own <br/>\ntiffs as an example - how sometimes when we are having a bad day and <br/>\nget in a disagreement, if one of us is quick to make amends even <br/>\nthough still angry, we can both come to a place of forgiveness with <br/>\neach other and ourselves. I asked him if he thought that would help <br/>\nnow. He thought about it for awhile and as we started to drive away, <br/>\ntried to smooth things over with DH. DH ignored him. &gt;:(<br/>\n<br/>\nWhat can I do? I know I can&#39;t force DH to come to my understanding - <br/>\nhe doesn&#39;t have the benefit of time (or energy) to read blogs or <br/>\nbooks or forums. And I don&#39;t feel right  doing nothing when he upsets <br/>\nZeb to the point of tears. I would love to find a way to support <br/>\ntheir relationship without feeling as if I have to referee. I&#39;m just <br/>\nnot sure the best route to take here but I&#39;m sure there must be a <br/>\nbetter way than being frustrated or justifying behaviors all the time.<br/>\n<br/>\n~Tara</div>","specialLinks":[]}],"prevTopicId":38414,"nextTopicId":38338}}