{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":77228268,"authorName":"Marla","from":"&quot;Marla&quot; &lt;marla@...&gt;","profile":"hilltowner4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Scott Noelle&#39;s post on being nice","postDate":"1267059143","msgId":43248,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhtNGhrNytrcm1yQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU2MkE1NDQxLTdCNDEtNEUxNS1CNzZDLUQ4ODZFMzBGMzdBOEB2ZXJpem9uLm5ldD4="},"prevInTopic":43240,"nextInTopic":0,"prevInTime":43247,"nextInTime":43249,"topicId":43228,"numMessagesInTopic":0,"msgSnippet":"Thanks, Joyce!!!  I knew someone here would be able to interpret it in a way I could understand and use. Thanks!!!!!! Marla","messageBody":"<div id=\"ygrps-yiv-393145569\">Thanks, Joyce!!!  I knew someone here would be able to interpret it in a way I could understand and use.<br/>\n<br/>\nThanks!!!!!!<br/>\n<br/>\nMarla</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Scott Noelle&#39;s post on being nice","postDate":"1266968508","msgId":43240,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhtMXAzcysxMGFlZ0BlR3JvdXBzLmNvbT4=","inReplyToHeader":"PDMxMDAxNC44NDkxNC5xbUB3ZWI1OTgwOC5tYWlsLmFjNC55YWhvby5jb20+"},"prevInTopic":43236,"nextInTopic":43248,"prevInTime":43239,"nextInTime":43241,"topicId":43228,"numMessagesInTopic":0,"msgSnippet":"... ******************** The trouble comes when it turns into some kind of rule in your head - Be Kind. That s something that can be a big issue for moms, in","messageBody":"<div id=\"ygrps-yiv-1925348007\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Dana Stewart &lt;dana.stewart@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I think that it all depends on your definition of &quot;nice&quot;. If by nice you mean sweet in a fake (even manipulative) way, then, yes, we should all scrap it in favor of authenticity! But if by nice you mean kind and considerate, then I fully maintain that you can at least most of the time be that and still be authentic.<br/>\n </span></blockquote>********************<br/>\n<br/>\nThe trouble comes when it turns into some kind of rule in your head - Be Kind. That&#39;s something that can be a big issue for moms, in particular - some moms get wrapped up in an idea of who they are as women and mothers that&#39;s tied to this Rule of Nice, as Scott calls it, and will push themselves beyond their own limits and boundaries for the sake of more kindness. <br/>\n<br/>\nIts an issue that comes up a lot in unschooling discussions, actually, although this is the first time the idea of a Rule of Nice has been articulated in those terms (that I know of). Suggestions to new unschoolers include such advice as &quot;say yes more&quot; and &quot;its okay to be kind to your kids&quot; and because so many unschoolers are trying to be better parents that sometimes leads to parents allowing their own personal boundaries to be squashed - not all parents, but like I said, its an issue that comes up frequently: &quot;don&#39;t I get to have boundaries?&quot; <br/>\n<br/>\nTo some extent, that sort of pendulum-swing is part of how some people learn about unschooling. The vast majority of us grow up used to rules, so it makes sense to think about unschooling as a new set of rules to apply at first. That&#39;s a challenging hurdle to overcome (was for me, although I didn&#39;t have a Rule of Nice, mine was &quot;Better a Bitch than a Doormat&quot; - I Get to be nice, now, and I like that). <br/>\n<br/>\nAt the same time - given what I said about my own internal rule - there are personality issues that play into this topic. I suspect that people who are naturally inclined to please others can have a Rule of Nice and it feels perfectly &quot;authentic&quot; until they run out of energy! <br/>\n<br/>\n(I&#39;d be willing to be a lot of the Big Voices on unschooling lists aren&#39;t natural pleasers - any takers?)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m wondering if there&#39;s anyone here with training in/knowledge of nonviolent communication methods <br/>\n </span></blockquote>*****************<br/>\n<br/>\nSpeaking of good ideas that can turn into rules in people&#39;s heads! I&#39;ve mostly seen NVC in real life used as a (sometimes vicious) tool for manipulation. I like a whooooole lot of the ideas and principles, though - I think they&#39;re a fantastic set of tools for the understanding side of communication, which is arguably the important side ;)<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Scott Noelle&#39;s post on being nice","postDate":"1266930851","msgId":43231,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMTAwMjIzMDUxNGs2MTM0MmI5ZHk3MDA1NjI3NzFmMjA2ZmU3QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDU2MkE1NDQxLTdCNDEtNEUxNS1CNzZDLUQ4ODZFMzBGMzdBOEB2ZXJpem9uLm5ldD4=","referencesHeader":"PGhsdm1sNSs3cm00QGVHcm91cHMuY29tPgkgPDU2MkE1NDQxLTdCNDEtNEUxNS1CNzZDLUQ4ODZFMzBGMzdBOEB2ZXJpem9uLm5ldD4="},"prevInTopic":43230,"nextInTopic":43236,"prevInTime":43230,"nextInTime":43232,"topicId":43228,"numMessagesInTopic":0,"msgSnippet":"Wow, Joyce that was beautiful. I ve been flipping this same kind of thoughts around in my head with no coherency. This post has really giving me a huge amount","messageBody":"<div id=\"ygrps-yiv-1452961161\">Wow, Joyce that was beautiful. I&#39;ve been flipping this same kind of thoughts<br/>\naround in my head with no coherency. This post has really giving me a huge<br/>\namount to think about. The whole post was wonderful and this passage<br/>\nespecially spoke to me.<br/>\n<br/>\nThanks<br/>\nFaith<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, Feb 23, 2010 at 8:07 AM, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; A mother who blows up at her kids may feel authentically angry with<br/>\n&gt; them. Maybe her parents yelled at her. Maybe she&#39;s hugely stressed<br/>\n&gt; for the last few months and at the end of her rope. But acting on or<br/>\n&gt; releasing the anger at the kids won&#39;t help. It&#39;s going to do more<br/>\n&gt; damage. Stuffing the anger down won&#39;t help either! Better -- and<br/>\n&gt; much more difficult but far more worthwhile in the long run -- is to<br/>\n&gt; work on the other factors that cause her to feel like blowing up at<br/>\n&gt; the kids. Kids need a mom&#39;s support and help, not be the release<br/>\n&gt; valve for her &quot;authentic&quot; feelings created by her past.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Scott Noelle&#39;s post on being nice","postDate":"1266930449","msgId":43230,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU2MkE1NDQxLTdCNDEtNEUxNS1CNzZDLUQ4ODZFMzBGMzdBOEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGhsdm1sNSs3cm00QGVHcm91cHMuY29tPg==","referencesHeader":"PGhsdm1sNSs3cm00QGVHcm91cHMuY29tPg=="},"prevInTopic":43228,"nextInTopic":43231,"prevInTime":43229,"nextInTime":43231,"topicId":43228,"numMessagesInTopic":0,"msgSnippet":"... I agree with the idea behind what he s saying but I think his explanation that involves the words authentic and nice can get people s thoughts twisted","messageBody":"<div id=\"ygrps-yiv-507227244\">On Feb 22, 2010, at 11:47 PM, Marla wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Children are naturally authentic, which means they<br/>\n&gt; often aren&#39;t &quot;nice.&quot; You&#39;re supposed to pressure them<br/>\n&gt; to obey the Rule of Nice, but wouldn&#39;t it be nicer to<br/>\n&gt; let them inspire *you* to be more authentic?&quot;<br/>\n<br/>\n </span></blockquote>I agree with the idea behind what he&#39;s saying but I think his  <br/>\nexplanation that involves the words &quot;authentic&quot; and &quot;nice&quot; can get  <br/>\npeople&#39;s thoughts twisted up.<br/>\n<br/>\nFirst, he defines &quot;nice&quot; to mean &quot;Only say and do things that please  <br/>\nothers.&quot; People often do use nice to mean that, but they *also* hold  <br/>\nseveral other definitions of nice. And they&#39;re not always clear -- to  <br/>\nthemselves or others -- which definition they&#39;re using. In fact  <br/>\npeople don&#39;t even realize they have multiple definitions that vary  <br/>\nwith context. If asked, they&#39;d be able to define what they mean by  <br/>\nnice in a particular context but unconsciously it&#39;s assume there&#39;s an  <br/>\nagreed on understanding of what the word &quot;nice&quot; means in the context  <br/>\nit&#39;s being used in.<br/>\n<br/>\n(And they do that because that&#39;s how their moms used the word &quot;nice.&quot;  <br/>\nMoms say &quot;Be nice&quot; and kids have to figure out what nice means in  <br/>\nthat context. Does it mean don&#39;t punch your sister? Don&#39;t use an  <br/>\noutside voice? Don&#39;t run? Don&#39;t touch?)<br/>\n<br/>\n(Good and bad are also words with a mish mosh of meanings. They&#39;re  <br/>\nall bad ;-) for clarity.)<br/>\n<br/>\nAnd that variable definition problem happened to you with this post  <br/>\nof his. Probably happened to most people who read it. When you said  <br/>\n&quot;really got me to thinking about asking/coercing our children to be  <br/>\nnice&quot; I&#39;m betting you didn&#39;t mean you want to ask and coerce your  <br/>\nchildren to &quot;only say and do things that please others.&quot; You meant  <br/>\nthat vague changeable definition of nice.<br/>\n<br/>\nI&#39;d absolutely agree kids shouldn&#39;t be made (or asked) to &quot;only say  <br/>\nand do things that please others.&quot;<br/>\n<br/>\nBut should kids be made or asked to be &quot;nice&quot; as in polite, kind,  <br/>\nthoughtful, respectful, helpful? (Those are the words I used around  <br/>\nKathryn. I think they&#39;re much clearer.) A better approach than making  <br/>\nor asking kids, is for the parents to *be* polite, kind, thoughtful,  <br/>\nrespectful, helpful *to the kids* and others. Use and live by the  <br/>\nprinciples. In general kids need to feel the value of those  <br/>\nprinciples before they feel a reason to put in the effort to offer  <br/>\nthem to others. They need to feel those practiced on them. They need  <br/>\nto see them offered to others. They also need to see how you choose  <br/>\nless direct paths to a goal (your own or while helping the kids get  <br/>\nwhat they want) in order to be respectful (and so on) of others.<br/>\n<br/>\nIf you are polite, kind, thoughtful, respectful, helpful to the kids,  <br/>\nthey will, when they&#39;re developmentally able, be polite, kind,  <br/>\nthoughtful, respectful, helpful. And if they aren&#39;t, it&#39;s not because  <br/>\nthey&#39;re being deliberately mean. It&#39;s because they still need help  <br/>\nfinding the more complex routes to a goal that takes in those other  <br/>\nfactors.<br/>\n<br/>\nAs for authentic ... I&#39;m really disliking that word the more I hear  <br/>\nit used ;-) People are taking it to mean acting on or letting people  <br/>\nknow their feelings.  It&#39;s the opposite of keeping your feelings to  <br/>\nyourself and only saying and doing things that please others.  <br/>\n*Neither* of those is good. The first is totally selfish and the  <br/>\nother totally selfless. There are better options, options based on  <br/>\nmeeting your own needs without stomping all over others.<br/>\n<br/>\nLIttle children do have authentic feelings. Their reactions are based  <br/>\non recent events. If they punch Sarah it&#39;s because Sarah just grabbed  <br/>\nthe toy from them or they needed to eat an hour ago, not because  <br/>\nSarah wouldn&#39;t let them have a toy last month.<br/>\n<br/>\nBut as they get older, the more hurt they build up that&#39;s ignored or  <br/>\nthe parents are oblivious to, the more their past influences their  <br/>\ncurrent feelings and, consequently, behavior.<br/>\n<br/>\nA mother who blows up at her kids may feel authentically angry with  <br/>\nthem. Maybe her parents yelled at her. Maybe she&#39;s hugely stressed  <br/>\nfor the last few months and at the end of her rope. But acting on or  <br/>\nreleasing the anger at the kids won&#39;t help. It&#39;s going to do more  <br/>\ndamage. Stuffing the anger down won&#39;t help either! Better -- and   <br/>\nmuch more difficult but far more worthwhile in the long run -- is to  <br/>\nwork on the other factors that cause her to feel like blowing up at  <br/>\nthe kids. Kids need a mom&#39;s support and help, not be the release  <br/>\nvalve for her &quot;authentic&quot; feelings created by her past.<br/>\n<br/>\nI think for most adults it&#39;s really hard to have &quot;authentic&quot; -- eg,  <br/>\nchildlike, not based on past experience -- feelings. In some ways  <br/>\nthat&#39;s good! Our need to grab something we like from someone else  <br/>\nreally doesn&#39;t need supported ;-) And feeling love for someone  <br/>\ndoesn&#39;t necessarily give us the skills to show it in a way that our  <br/>\nloved one understands. But someone who grew up rigidly controlled and  <br/>\nwhen he&#39;s on his own feels like a wild animal released from a cage,  <br/>\nno matter how &quot;authentic&quot; those feelings are, acting on those  <br/>\nfeelings is harming himself.<br/>\n<br/>\nIf someone&#39;s goal is to be &quot;authentic&quot; they&#39;re likely to damage  <br/>\nrelationships. They might feel more powerful and less damaged from  <br/>\ntheir past, but they&#39;re going to trample on relationships.<br/>\n<br/>\nIf someone&#39;s goal is relationships, they will need to work on  <br/>\n&quot;authentic&quot; feelings that damage relationships when released so they  <br/>\ndon&#39;t derail themselves from the path to their goal.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":400494348,"authorName":"Dana Stewart","from":"Dana Stewart &lt;dana.stewart@...&gt;","profile":"dana.stewart@rocketmail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Scott Noelle&#39;s post on being nice","postDate":"1266905573","msgId":43236,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxMDAxNC44NDkxNC5xbUB3ZWI1OTgwOC5tYWlsLmFjNC55YWhvby5jb20+","inReplyToHeader":"PGhsdm1sNSs3cm00QGVHcm91cHMuY29tPg==","referencesHeader":"PGhsdm1sNSs3cm00QGVHcm91cHMuY29tPg=="},"prevInTopic":43231,"nextInTopic":43240,"prevInTime":43235,"nextInTime":43237,"topicId":43228,"numMessagesInTopic":0,"msgSnippet":"I m new on the list, and I know you re supposed to lurk awhile before posting... But I found this so thought-provoking that I just couldn t keep it in :-) I","messageBody":"<div id=\"ygrps-yiv-1065912245\">I&#39;m new on the list, and I know you&#39;re supposed to lurk awhile before posting... But I found this so thought-provoking that I just couldn&#39;t keep it in :-)<br/>\n<br/>\nI think that it all depends on your definition of &quot;nice&quot;. If by nice you mean sweet in a fake (even manipulative) way, then, yes, we should all scrap it in favor of authenticity! But if by nice you mean kind and considerate, then I fully maintain that you can at least most of the time be that and still be authentic. I have found in my life very few situations where, if you try, you can&#39;t be both authentic and considerate/kind. Sometimes it takes a bit of forethought, and maybe some would say that forethought=inauthenticity, but I disagree. To me, kindness is about finding and connecting with the humanity in another person, even if that other person is not acting in a particularly humane way in that moment. I really have found that most people, if you reach out to them with kindness and humanity and respect, even if you&#39;re telling them something that is very difficult for them to hear (e.g. giving a fundamentally harsh criticism), will respond on a<br/>\n similar frequency. This is not about saying/doing only things that please the other person, but rather about finding a way to communicate something difficult in a way that does not denigrate them. I really do believe that can be done in an authentic way. <br/>\n<br/>\nBut maybe I&#39;m completely missing your point about what &quot;niceness&quot; is! <br/>\n<br/>\nI&#39;m wondering if there&#39;s anyone here with training in/knowledge of nonviolent communication methods and any opinions about this??<br/>\n<br/>\nDana in NYS<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://supermom-procrastinationcentral.blogspot.com\">http://supermom-procrastinationcentral.blogspot.com</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Marla &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marla@...\">marla@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Mon, February 22, 2010 11:47:33 PM<br/>\nSubject: [unschoolingbasics] Scott Noelle&#39;s post on being nice<br/>\n<br/>\n  <br/>\nScott Noelle&#39;s recent post below really got me to thinking about asking/coercing our children to be nice. I was wondering what others thought about it.<br/>\n<br/>\nHere&#39;s his post: <br/>\n<br/>\n&quot;Most of us have been thoroughly trained to be &quot;nice.&quot;<br/>\nThe 2-part Rule of Nice goes like this...<br/>\n<br/>\nPart 1: Only say and do things that please others.<br/>\n<br/>\nPart 2: If you feel like saying or doing something<br/>\nthat might possibly displease someone, see Part 1.<br/>\n<br/>\nSo, to obey the Rule of Nice at all times, you have to<br/>\nget pretty good at *not* being authentic. But being<br/>\ninauthentic is not very nice, so the only way to win<br/>\nthis game is not to play it!<br/>\n<br/>\nChildren are naturally authentic, which means they<br/>\noften aren&#39;t &quot;nice.&quot; You&#39;re supposed to pressure them<br/>\nto obey the Rule of Nice, but wouldn&#39;t it be nicer to<br/>\nlet them inspire *you* to be more authentic?&quot;<br/>\n<br/>\nThanks!<br/>\n<br/>\nMarla<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":77228268,"authorName":"Marla","from":"&quot;Marla&quot; &lt;marla@...&gt;","profile":"hilltowner4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Scott Noelle&#39;s post on being nice","postDate":"1266900453","msgId":43228,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhsdm1sNSs3cm00QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":43230,"prevInTime":43227,"nextInTime":43229,"topicId":43228,"numMessagesInTopic":0,"msgSnippet":"Scott Noelle s recent post below really got me to thinking about asking/coercing our children to be nice.  I was wondering what others thought about it. Here s","messageBody":"<div id=\"ygrps-yiv-1792743175\">Scott Noelle&#39;s recent post below really got me to thinking about asking/coercing our children to be nice.  I was wondering what others thought about it.<br/>\n<br/>\n<br/>\nHere&#39;s his post: <br/>\n<br/>\n&quot;Most of us have been thoroughly trained to be &quot;nice.&quot;<br/>\nThe 2-part Rule of Nice goes like this...<br/>\n<br/>\n     Part 1: Only say and do things that please others.<br/>\n<br/>\n     Part 2: If you feel like saying or doing something<br/>\n     that might possibly displease someone, see Part 1.<br/>\n<br/>\nSo, to obey the Rule of Nice at all times, you have to<br/>\nget pretty good at *not* being authentic. But being<br/>\ninauthentic is not very nice, so the only way to win<br/>\nthis game is not to play it!<br/>\n<br/>\nChildren are naturally authentic, which means they<br/>\noften aren&#39;t &quot;nice.&quot; You&#39;re supposed to pressure them<br/>\nto obey the Rule of Nice, but wouldn&#39;t it be nicer to<br/>\nlet them inspire *you* to be more authentic?&quot;<br/>\n<br/>\n<br/>\nThanks!<br/>\n<br/>\nMarla</div>","specialLinks":[]}],"prevTopicId":43235,"nextTopicId":43215}}