{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":196677035,"authorName":"Tina Tarbutton","from":"Tina Tarbutton &lt;tina.tarbutton@...&gt;","profile":"dravensmomhome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Helping a child through disapointment","postDate":"1297833458","msgId":46146,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluR0dwaWRKRGlIPWs1N0txYW81YU1pMzNqNlgwYkhzOVJERVpCZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGlqZDFmZCtwM3ZsQGVHcm91cHMuY29tPg==","referencesHeader":"PDE1MDQ5MC41NTUzNy5xbUB3ZWIxMTMyMTAubWFpbC5ncTEueWFob28uY29tPgk8aWpkMWZkK3AzdmxAZUdyb3Vwcy5jb20+"},"prevInTopic":46144,"nextInTopic":0,"prevInTime":46145,"nextInTime":46147,"topicId":46131,"numMessagesInTopic":0,"msgSnippet":"I really appreciate all of the responses.  It has helped my partner and I see this a lot more clearly, and not from the emotional place we were coming from","messageBody":"<div id=\"ygrps-yiv-1487738021\">I really appreciate all of the responses.  It has helped my partner and I<br/>\nsee this a lot more clearly, and not from the emotional place we were coming<br/>\nfrom before.<br/>\n<br/>\nWe see where we have been making a lot of mistakes in the past, and we&#39;ve<br/>\nalready started trying things differently.<br/>\n<br/>\nWe went shopping today and made sure to pick up plenty of snacks that can be<br/>\nkept in the car.  We&#39;ve always kept a case of water in the trunk, and a few<br/>\nother odds and ends food wise, but now we&#39;re going to have a backpack full<br/>\nof lots of different stuff (beef jerky, dried fruit, different types of<br/>\nchips).  Having an abundance of food on hand at all times (which we&#39;ve<br/>\nalways done at home) may help a lot with outings.<br/>\n<br/>\nWe&#39;re also going to plan outings more loosely, with plenty of down time in<br/>\nbetween things.  More time means more flexibility, which means even if we&#39;re<br/>\nin an unknown area we can drive around to find a BK, or wait in traffic to<br/>\nget back to one we missed (while snacking on the food stored in the car).<br/>\n<br/>\nWe&#39;re also making more of an effort to try to meet his requests, even if we<br/>\ndon&#39;t think it&#39;s possible.  Sunday we went to the beach after church, and as<br/>\nit was starting to get dark and therefore cooler, Draven started digging a<br/>\nhole.  He said he wanted it big enough he could sit in, and he wanted a<br/>\ntrench so the water would come up into the hole.  He asked for our help<br/>\nafter he had started the hole.  We were pretty sure he was too far away from<br/>\nthe water for the water to reach him, and we had no digging tools, and it<br/>\nwas getting cold and dark.  We let him know it may not work, however we got<br/>\ndown in the sand and helped him dig.  When he realized how fast it was<br/>\ngetting dark he decided on a smaller hole, and then we helped him dig a<br/>\ntrench, which didn&#39;t work.  He was okay with it not working, we tried.  We<br/>\ntold him we&#39;d come back within a few days and we&#39;d bring a shovel.  Today my<br/>\npartner took him to the beach and buried him up to his chest.  He was VERY<br/>\nhappy with that.<br/>\n<br/>\nAfter that he wanted her to go swimming with him.  Now, don&#39;t get me wrong,<br/>\nwe are in Florida, and I&#39;m sure it&#39;s WAY warmer here than in a lot of places<br/>\nright now, however it&#39;s still pretty cold, especially in the water.  He<br/>\ndidn&#39;t have a problem with the cold water, but Parker was freezing just<br/>\nbeing out there in shorts.  She was not okay with getting in the water, but<br/>\nshe stayed close to the water while he played in it.  He was disappointed by<br/>\nthat, but it was easier for her to look at it as a bad spot in an otherwise<br/>\ngood outing.<br/>\n<br/>\nI think that mindset within itself will help.  Draven is very emotional, he<br/>\nis not going to be happy 100% of the time, no matter how well we plan.<br/>\n Seeing that we can have a great day overall, even with him<br/>\ngetting disappointed, is much better than seeing his disappointment as<br/>\nsomething that ruins the day.  We will do everything we can to minimize<br/>\ndisappointment, but we aren&#39;t perfect.<br/>\n<br/>\nOne of our big issues was figuring out how to get him past the<br/>\ndisappointment once it happened.  Hearing others say that just waiting it<br/>\nout and being supportive is better than trying to change his mood helps a<br/>\nlot.  Also hearing other perspectives of how he gets into that state in the<br/>\nfirst place (not just being upset over missing BK, but also over all of the<br/>\nmental thought that went into going to BK for example).  I think keeping in<br/>\nmind that he has to process his emotions in his own way, on his own time<br/>\nschedule will help us support him through those difficult times.<br/>\n<br/>\nAll 3 of us are very emotional.  All 3 of us have been labeled by<br/>\nthe psychiatric community and my partner and I are on medications to help us<br/>\ncope with our bipolar, etc.  One of our major goals with Draven was to help<br/>\nhim learn coping skills to deal with ups and downs in emotion (which are a<br/>\npart of his emotional wiring, even without labels), I think we were coming<br/>\nfrom a place of fear when we saw his strong reaction to disappointment,<br/>\nbecause we felt on some level that if he&#39;s not learning these coping skills,<br/>\nhe&#39;ll end up on medication.  We, of course, never said that to him, but it&#39;s<br/>\nalways in the back of our minds.  We&#39;ve realized that we can&#39;t teach him<br/>\ncoping skills, we just have to model them, and support him through his<br/>\njourney of learning them in his own way.  We also know from personal<br/>\nexperience that learning coping skills doesn&#39;t mean one will never need<br/>\nmedication, or therapy, or whatever.  We try very hard not to parent out of<br/>\nfear, and I think this was one area that we unintentionally let our fear get<br/>\nin the way.<br/>\n<br/>\nLetting go of the fear, letting him process in his own time, and minimizing<br/>\nthings that set him up for disappointment are the things we&#39;ll be working<br/>\nharder on from now on.<br/>\n<br/>\nThanks a ton for the input, it&#39;s much appreciated!<br/>\n<br/>\nTina (and Parker and Draven)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":124256069,"authorName":"Bun","from":"&quot;Bun&quot; &lt;alohabun@...&gt;","profile":"alohabun","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Helping a child through disapointment","postDate":"1297746221","msgId":46144,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqZDFmZCtwM3ZsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE1MDQ5MC41NTUzNy5xbUB3ZWIxMTMyMTAubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":46143,"nextInTopic":46146,"prevInTime":46143,"nextInTime":46145,"topicId":46131,"numMessagesInTopic":0,"msgSnippet":"I m not sure how far away the museum is from you, but could you have said you d go to the planetarium show next month? Because you knew it meant alot to him,","messageBody":"<div id=\"ygrps-yiv-1184397607\">I&#39;m not sure how far away the museum is from you, but could you have said you&#39;d go to the planetarium show next month?<br/>\n<br/>\nBecause you knew it meant alot to him, could you have stopped at BK on the way home or on the way back to the museum (if he was still hungry or even wanted to get one thing)? <br/>\n<br/>\nIf you are able to go to the planetarium show next month, can you go to the mall for a train ride too?  (And add in the suggestions about food and downtime, etc.  Keep it short and sweet maybe.)  <br/>\n<br/>\nLaurie</div>","specialLinks":[]},{"userId":419245530,"authorName":"adellegill@verizon.net","from":"&quot;adellegill@...&quot; &lt;adellegill@...&gt;","profile":"adellegill@verizon.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Helping a child through disapointment","postDate":"1297710980","msgId":46143,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqYnYyNCszN3NtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGk9T09Gb1p2Ym9Ld3l6djNIWUcyTy1OZjJqc3FNWUgzVGNnQXhST0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":46142,"nextInTopic":46144,"prevInTime":46142,"nextInTime":46144,"topicId":46131,"numMessagesInTopic":0,"msgSnippet":"Hi I am new, so I don t want to give parental advice as much as personal experience. I related to your son in this situation. I get very disappointed when","messageBody":"<div id=\"ygrps-yiv-1157401280\">Hi I am new, so I don&#39;t want to give parental advice as much as personal experience. I related to your son in this situation. I get very disappointed when something doesn&#39;t go as &quot;planned&quot;. I also get very aggrevated and become an emotional grump. I used to like having my weekend or our vacations planned out. But they were so stressful. You end up rushing through something to get to the next thing on the list or get disappointed, becuase you couldn&#39;t do something that was not on the list that you didn&#39;t see while making the plans. We now go on unplanned vacations. No booking hotels and no iteneraries. Things go a lot smoother and we have a lot more fun.<br/>\n<br/>\n  For planning weekend fun. We don&#39;t schedule more then 1-2 things. We always allow for the unexpected. So instead of planning a full day we only plan 1/3-1/2 a day. That gives us a full day to account for traffic jams, or missed time slots, or time to rethink, because we couldnt do something. We try to plan only 1 or 2 activities. An activity may even include lunch.<br/>\n<br/>\n  Either way when we plan a whole bunch and I get disappointed I am just like your son. I don&#39;t care that chick-fil-a is there, because i was looking forward to Bk. I need cool down periods to relax my mind and get back on track. Once an event is placed in my head. I think about it. I analyze it. I try to figure out how it should go. I get really built up about it. And when it doesnt happen all that planning I just did in my head was for nothing. So not only can I not eat at Bk, but the fact that I thought about what they have there to eat and I started thinking about what the fries smell like and what they feel and taste like and get emotionally wrapped around the food. NOW i have to think of something else to eat. It can happen with food or events. It doesnt matter. It will ruin everything else that comes along until I mentally get back to where I was before the disappointment.<br/>\n<br/>\n  For me getting back on the right track requires less stimulation from others. Don&#39;t suggest other places to eat or I will hate them more. So for the BK situation if hes like me don&#39;t offer more. Just give him time to relax and regroup. Just say to your son. &quot;Let us know when you decide what you want and we will go get it.&quot; keep it simple. That statement says I care and when your ready. He can look around the food court and decide. But he probably doesnt need more stimulation. It&#39;s not just about deciding what else to eat its getting over that disappointment too.<br/>\n<br/>\n   So the less I have planned in my days the less disappointments I have. I still need a hug or an its ok i care from my husband kind of response. But not immediately. I always need a few minutes. If he waits till after we are starting to move forward rather then while I&#39;m regrouping then the i care is more comforting to me. Hope this helps some.</div>","specialLinks":[]},{"userId":9543528,"authorName":"The Coffee Goddess","from":"The Coffee Goddess &lt;hoffmanwilson@...&gt;","profile":"hoffmanwilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Helping a child through disapointment","postDate":"1297625941","msgId":46142,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1MDQ5MC41NTUzNy5xbUB3ZWIxMTMyMTAubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGlqOHM2dSttcml1QGVHcm91cHMuY29tPg==","referencesHeader":"PGlqOHM2dSttcml1QGVHcm91cHMuY29tPg=="},"prevInTopic":46141,"nextInTopic":46143,"prevInTime":46141,"nextInTime":46143,"topicId":46131,"numMessagesInTopic":0,"msgSnippet":"I know that for me and mine, Let s just go to the mall and mill about and see what s appealing doesn t work, food-wise.  I want to have decided ahead of ","messageBody":"<div id=\"ygrps-yiv-1836407837\">I know that for me and mine, &quot;Let&#39;s just go to the mall and mill about and see <br/>\nwhat&#39;s appealing&quot; doesn&#39;t work, food-wise.  I want to have decided ahead of <br/>\ntime, gotten my mouth and stomach ready, so to speak ;)  My husband can just <br/>\nstick any old thing in his mouth, but my son and I are very selective and have <br/>\nto be in the mood for something.  So, quite frankly, if I were in the mood for <br/>\nBK and that was what I had really decided on, I would be pissed if my family <br/>\nwouldn&#39;t get it for me even though we drove by it.  I understand his <br/>\nfrustration....Seeing mom drive around the block, even though it was hard, or <br/>\npark and walk across the street, even though it was inconvenient, would look to <br/>\nme like she cared.  My husband often goes out of his way to please me, <br/>\nfood-wise, and it feels so incredibly loving :)<br/>\n<br/>\nDana<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Helping a child through disapointment","postDate":"1297624131","msgId":46141,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqOWE4MytvM25kQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGk9T09Gb1p2Ym9Ld3l6djNIWUcyTy1OZjJqc3FNWUgzVGNnQXhST0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":46137,"nextInTopic":46142,"prevInTime":46140,"nextInTime":46142,"topicId":46131,"numMessagesInTopic":0,"msgSnippet":"... I m pulling this little bit out, right from the end, because its important. You can frame what happened as a day of hassle and disappointment, or you can","messageBody":"<div id=\"ygrps-yiv-1578649332\">Tina Tarbutton &lt;tina.tarbutton@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; We ended up having a<br/>\n&gt; great time at the lazer light shows.<br/>\n<br/>\n </span></blockquote>I&#39;m pulling this little bit out, right from the end, because its important. You can frame what happened as a day of hassle and disappointment, or you can frame it as a mostly successful day with a rough patch. Some days you&#39;ll breeze through the rough patches and some days those will be longer - it sounds like your son is a pretty emotional person! So he&#39;s going to react to thing emotionally and That&#39;s Okay. I don&#39;t mean its fun, I mean its how he reacts and works things through. You can&#39;t do it for him, you can&#39;t necessarily jolly him out of his feelings in the moment or give him another perspective. He needs time to move on. <br/>\n<br/>\nThe bigger problem, as I see it, is this:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I<br/>\n&gt; felt like I had to make him happier to avoid my partner getting more<br/>\n&gt; upset.  I felt like I was failing to help either one of them stay in a<br/>\n&gt; good mood. <br/>\n<br/>\n </span></blockquote>It&#39;s not you son&#39;s job to be in a good mood for y&#39;all, nor is it your job to make the people around you happy. You can work to set things up to maximize the potential for happiness, but you can&#39;t actually change the way someone else feels. <br/>\n<br/>\nSometimes, in a noisy, crowded place, if too many things go wrong in Mo&#39;s plans she&#39;ll freeze up - literally freeze in place, not move, not speak, not make eye contact. I&#39;ve found I can talk to her a *little* in tiny bits of input, but only tiny bits and its imporant to be very very patient all the while until she can move on. But I learned that by getting it wrong over and over - offering too much, wanting her to move on long before she was ready. Because its a little awkward to have a kid standing like a statue while I sit on the floor and wait... and wait :P<br/>\n<br/>\nMaking back up plans ahead of time helps enormously - that&#39;s something that might help your son - but the worst scenarios are times like you described, where a dozen unforseen challenges pop up one after the other. What helps me most in those times is to take some deep breaths and remind myself to back off and focus my own attention on &quot;being present&quot; - being calm and in the moment without trying to push the moment forward and without trying to change Mo. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  At that point my partner got very frustrated because it seems<br/>\n&gt; that any day we plan a day full of cool stuff, something upsets him<br/>\n&gt; and &quot;it&#39;s never good enough&quot;. <br/>\n<br/>\n </span></blockquote>It might be helpful to talk with your partner before the next outting and remind her that there will probably be some glitch in the day and adding adult frustration to the mix isn&#39;t going to help anything. Brainstorm some ideas between the two of you for how to remind each other - and support each other - to be calm and present when you hit a rough patch. <br/>\n<br/>\nSometimes just acknowledging that the day doesn&#39;t Have To go one hundred percent smoothly can help reduce stress all around. As I said at the start - if you had to summerize the day overall, it sounds like a great day! With one rough patch. Score!<br/>\n<br/>\nHere&#39;s an old description of a day by Danielle Conger entitled &quot;one of those magical days&quot; - and yet there are three rough patches involving her son Sam in it, see if you can spot them! It&#39;s a particularly good example of how what you focus on (in the moment and later) can change your whole perception of a day - actually she once wrote on another list that it easily could have been seen as an example of a bad day, with two meltdowns and almost a third.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/day/danielle\">http://sandradodd.com/day/danielle</a><br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Helping a child through disapointment","postDate":"1297617790","msgId":46137,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcyNjc2MS4yMjEzLnFtQHdlYjgxNTAyLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PEFBTkxrVGk9T09Gb1p2Ym9Ld3l6djNIWUcyTy1OZjJqc3FNWUgzVGNnQXhST0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGk9T09Gb1p2Ym9Ld3l6djNIWUcyTy1OZjJqc3FNWUgzVGNnQXhST0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":46136,"nextInTopic":46141,"prevInTime":46136,"nextInTime":46138,"topicId":46131,"numMessagesInTopic":0,"msgSnippet":"Too long of a day, too hungry, lots of things going wrong and I am sure he was also tired. No wonder he was frustrated. He is 10, if adults sometimes cannot","messageBody":"<div id=\"ygrps-yiv-1016487853\">Too long of a day, too hungry, lots of things going wrong and I am sure he was <br/>\nalso tired. No wonder he was frustrated. <br/>\n<br/>\nHe is 10, if adults sometimes cannot handle days like that   you have to <br/>\nunderstand how hard is for a person <br/>\n<br/>\nwho has a lot leess experience.Maybe a shorter day, less plans  and more flow or <br/>\nmore plans that will work out ( plan every detail- aske before going and map <br/>\nburger King)<br/>\n.<br/>\nIt really depends on what owuld be easier for Draven. I know my son gets upset <br/>\nif too many things planned go wrong or are changed.<br/>\nWith my daughter is easier.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":151505017,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;carenkh@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Helping a child through disapointment","postDate":"1297609758","msgId":46136,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqOHM2dSttcml1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGk9T09Gb1p2Ym9Ld3l6djNIWUcyTy1OZjJqc3FNWUgzVGNnQXhST0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":46132,"nextInTopic":46137,"prevInTime":46135,"nextInTime":46137,"topicId":46131,"numMessagesInTopic":0,"msgSnippet":"I don t have much to add to what Schuyler said, except to say that most malls and large stores are way too overstimulating for me! I don t know if it s the","messageBody":"<div id=\"ygrps-yiv-1863801793\">I don&#39;t have much to add to what Schuyler said, except to say that most malls and large stores are way too overstimulating for me! I don&#39;t know if it&#39;s the lighting, or so much sensory input... I do not think of a mall as a fun place to go. At all. If either of my kids did, we&#39;d find a way to work it out, but neither of them like malls either. It took me a little while to figure this out about myself, but now that I know, if we need to go for some reason (though we haven&#39;t needed to in a very, very long time! Thanks goodness), we plan on only doing what we need, then skedaddling.<br/>\n<br/>\nLarge stores like WalMart or Target are the same way - after a short time, I&#39;m left feeling like, &quot;I need to get OUT of here!&quot;  It might be your son is affected the same way, or you or your partner are, and you just weren&#39;t in touch with that - something to keep in mind, and bring your awareness to.<br/>\n<br/>\npeace,<br/>\nCaren</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Helping a child through disapointment","postDate":"1297597472","msgId":46132,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0MDk5MC41ODA2OS5xbUB3ZWI4NjIwMy5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PEFBTkxrVGk9T09Gb1p2Ym9Ld3l6djNIWUcyTy1OZjJqc3FNWUgzVGNnQXhST0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGk9T09Gb1p2Ym9Ld3l6djNIWUcyTy1OZjJqc3FNWUgzVGNnQXhST0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":46131,"nextInTopic":46136,"prevInTime":46131,"nextInTime":46133,"topicId":46131,"numMessagesInTopic":0,"msgSnippet":"It was a big, big, big day. Without enough food. Without enough slow time. Without enough moments arranged just for him. Was there a restaurant at the museum?","messageBody":"<div id=\"ygrps-yiv-181255530\">It was a big, big, big day. Without enough food. Without enough slow time. <br/>\nWithout enough moments arranged just for him. <br/>\n<br/>\n<br/>\nWas there a restaurant at the museum? Could you put a picnic together for in the <br/>\ncar or nearby park of things that everybody likes, carry snacks with you in a <br/>\nbackpack for times when hunger is going to be an issue? Food is a big deal. <br/>\nGetting hungry for anyone can get things to spiral down. Food on a day when you <br/>\nare exerting a huge amount of energy is a really, really big deal. <br/>\n<br/>\n<br/>\nIt also sounds like you are making assumptions about Draven&#39;s ability to deal <br/>\nwith a big day out. If the laser show is once a month, could you have not gone <br/>\nthis month but gone next month? Could you have had zone out time somewhere <br/>\nnearer to the museum instead of going to the mall? Could you have broken up the <br/>\nday with less full on activities? Could you have planned the day in advance in <br/>\nmore detail, with more awareness of what Draven needs? Google map can give you <br/>\nreally good details about what is available in an area. Maybe you could have <br/>\nspent time scanning the map for things to eat and places to go that wouldn&#39;t <br/>\nhave sent you driving to the mall. Although you did write that it is normally <br/>\nonly 10 minutes away. <br/>\n<br/>\n<br/>\nSpontaneous fun isn&#39;t always that easy to access. Much better if you know that <br/>\nthere is fun to be had somewhere and go with those ideas in your head, although <br/>\nnot necessarily in Draven&#39;s head. If you knew about the train, you could have <br/>\nmade that a mall priority. If you knew about Draven&#39;s Burger King preference, <br/>\nyou could have looked it up on the map in advance. Maybe you could have pulled <br/>\noff and parked on your side of the road and walked back? Or driven around the <br/>\nblock, on your side, and come at the intersection not via the big traffic jam? <br/>\n<br/>\n<br/>\nSome of it may be that he&#39;s not feeling a priority on a big day out. Lots of the <br/>\nthings that didn&#39;t happen seemed to not happen because they weren&#39;t prioritised. <br/>\nIt&#39;s good to check, to say things like &quot;if you want to do the train, lets head <br/>\nin that direction so we don&#39;t miss it&quot; or double check about things like the <br/>\nPlanetarium show. And when a miss occurs, apologise. <br/>\n<br/>\n<br/>\nIt also sounds like you are feeling torn between your partner and Draven. Like <br/>\nyou don&#39;t quite want to ask her to accommodate him when you can feel she&#39;s <br/>\ngrowing frustrated with accommodating him already. It would probably help if you <br/>\ndealt with that in your own head and with your partner. Talk about whether she <br/>\ncan extend her patience on days like this one so that they will go more easily <br/>\nfor Draven. And if she can&#39;t, don&#39;t schedule such full out days for all of you <br/>\ntogether for a while. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":196677035,"authorName":"Tina Tarbutton","from":"Tina Tarbutton &lt;tina.tarbutton@...&gt;","profile":"dravensmomhome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Helping a child through disapointment","postDate":"1297578416","msgId":46131,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9T09Gb1p2Ym9Ld3l6djNIWUcyTy1OZjJqc3FNWUgzVGNnQXhST0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":46132,"prevInTime":46130,"nextInTime":46132,"topicId":46131,"numMessagesInTopic":0,"msgSnippet":"Now that I m done writing I realize this is a VERY long post, so thank you to anyone who reads it and takes the time to respond. We had a very full day today,","messageBody":"<div id=\"ygrps-yiv-800822330\">Now that I&#39;m done writing I realize this is a VERY long post, so thank<br/>\nyou to anyone who reads it and takes the time to respond.<br/>\n<br/>\nWe had a very full day today, and a reoccurring problem showed up, one<br/>\nthat has been happening for years, but that I never figured out how to<br/>\nhandle, and now that I&#39;m trying to parent more peacefully I&#39;m even<br/>\nless sure how to handle it.<br/>\n<br/>\nWe spent the morning at the museum of arts and sciences.  We have a<br/>\nfamily member visiting from out of state and today was her last day<br/>\nhere.  Draven did incredible with walking around looking at all of the<br/>\nart with all of us and honestly seemed to enjoy that part of the<br/>\nmuseum for the first time ever (he&#39;s 10).  We took turns lingering<br/>\nwith him when he wanted to study something more, and the rest of the<br/>\ngroup was ready to move on.  We also knew that he and my partner and I<br/>\nwould be staying at the museum longer, so for a few exhibits we told<br/>\nhim we&#39;d come back once the extended family went home.  He was fine<br/>\nwith that.  When it was time for the show in the planetarium the rest<br/>\nof the family decided to head out, and we went to the show.<br/>\n<br/>\nAfter the show we went to the children&#39;s area, he had said he wasn&#39;t<br/>\ninterested in seeing the 3:00 show at the planetarium (it was a<br/>\nshorter show meant for younger kids), so we played on the kids side<br/>\nstraight through that show.  We all started getting hungry so we<br/>\ndecided to head out, hitting the exhibits he wanted to further study<br/>\non the way out.  First little hiccup was when he asked when the next<br/>\nplanetarium show was . . . well, we had already missed it, so that<br/>\nmade him a little disappointed, but nothing major, he moved on pretty<br/>\nquickly that time.<br/>\n<br/>\nWe left the museum and headed towards the mall while discussing what<br/>\nwe wanted for &quot;linner&quot; (lunch/dinner).  He said he&#39;d love burger king,<br/>\nbut anything would be fine.  I said I&#39;d stop at a BK if I saw one on<br/>\nthe way (none of us are very familiar with that area).  Once we got<br/>\ncloser to the mall we realized it was a race day (we were in Daytona)<br/>\nso traffic was HORRIBLE.  We saw a BK, after we had passed the<br/>\nintersection for it and traffic was completely stopped in the other<br/>\ndirection, so turning around would have taken a REALLY long time.  I<br/>\nasked him if he was okay with finding something at the mall, he<br/>\nsounded disappointed, but said he understood and it would be fine.  I<br/>\napologized for not seeing it earlier.<br/>\n<br/>\nWe had planned on going to the lazer light shows back at the museum at<br/>\n7pm, so we only had about 2 hours to get food, eat, and start on our<br/>\nway back, but we also didn&#39;t want to spend loads of time sitting in<br/>\nthe car with nothing to do, which is why we planned on the mall,<br/>\nnormally a 10 minute drive.<br/>\n<br/>\nOnce we got to the mall there was some confusion with parking stuff<br/>\n(they were using most of the mall parking lot for race parking,<br/>\ntraffic was totally messed up).  By then my partner and I were both<br/>\nfrustrated, and everyone was REALLY hungry and therefore grumpy.  We<br/>\ndid have a few snacks in the car which were eaten, but we needed real<br/>\nfood.  We ended up finding a pretty good parking spot right outside of<br/>\nthe food court and we headed in.<br/>\n<br/>\nOnce we got in there we asked Draven what he wanted to eat, so he<br/>\ncould pick first.  &quot;I know what I want, but it&#39;s not here.&quot;  Okay,<br/>\nlets see what we can find here.  I pointed out the chick fil-a which<br/>\nis another one of his favorite restaurants and offered to go there<br/>\nfirst and he said he didn&#39;t want it.  We decided that while he thought<br/>\nabout it my partner and I would get our food.  We pointed out the<br/>\nother choices to him and offered to let him sample something if he<br/>\nwanted to.  We ended up ordering our food, and he still didn&#39;t want to<br/>\nget something.  He was very grumpy by that point, and snappy.  My<br/>\npartner and I were both getting a little frustrated but tried to<br/>\nignore it, understanding he was disappointed.  After we started eating<br/>\nI reminded him that when he doesn&#39;t eat he gets a little grumpy and we<br/>\nstill had a full day.  At that point he did decide to get chicken and<br/>\nI took him over there.  He cheered up on the way over when he saw a<br/>\ntrain going through the mall.  I told him we&#39;d see if we could find<br/>\nout more about it and check into it.<br/>\n<br/>\nWe ate, and everything was good.  We started walking through the mall<br/>\nand as the train passed again I asked the driver where we could get<br/>\non, it was all the way at the other end of the mall.  He had some<br/>\nplaces he wanted to look in, so we kept walking in that direction,<br/>\nstopping for a moment here or there to look in various stores.<br/>\n<br/>\nWhen we got to the center of the mall my partner needed to use the<br/>\nrestroom, so we sat in the little court yard area while she went.  He<br/>\nsaw a massage booth where they had the aqua jet massages.  We both<br/>\nthought they looked neat, however I didn&#39;t have money on me so we had<br/>\nto wait for my partner to come back out.  Right as she was coming out<br/>\nthe person at the booth put up the &quot;at lunch&quot; sign and walked off.  He<br/>\ngot VERY frustrated at that point, walked off ahead of us, very<br/>\nsnappy, just generally pissed.  We pointed out stores he had wanted to<br/>\nvisit, no interest, lots of &quot;whatevers&quot; and just generally crappy<br/>\nmood.  At that point my partner got very frustrated because it seems<br/>\nthat any day we plan a day full of cool stuff, something upsets him<br/>\nand &quot;it&#39;s never good enough&quot;.  She at that point said why don&#39;t we<br/>\njust skip everything else and go straight home.  We had already bought<br/>\nthe tickets to the lazer show though, and I knew if we could make it<br/>\nthere, we&#39;d enjoy it.  It&#39;s only a once a month thing.<br/>\n<br/>\nMy partner went into a store, and I tried to talk to Draven.  He<br/>\nsnapped at me really badly and I honestly almost lost my temper, I<br/>\nfelt like I had to make him happier to avoid my partner getting more<br/>\nupset.  I felt like I was failing to help either one of them stay in a<br/>\ngood mood.  I was watching our previously fun day turn out VERY badly<br/>\nand I didn&#39;t know how to react.  I decided to let my partner know we&#39;d<br/>\nmeet her at the end of the mall where the train was.<br/>\n<br/>\nAs we got near the &quot;train station&quot; the train was just pulling out.<br/>\nThe driver yelled out &quot;sorry this is the last train, and it&#39;s full.&quot;<br/>\nOf course, by that point he was PISSED!  Nothing was going right for<br/>\nhim.  I completely understood him being upset, however he basically<br/>\nmarched through the mall, too fast for our comfort (I don&#39;t like<br/>\nlosing sight of him in a place that big).  Once we caught up and asked<br/>\nhim to stay closer everyone was in such a bad mood no one talked as we<br/>\nwere driving back to the museum.<br/>\n<br/>\nWe still had a little extra time, and we got out of the bad traffic<br/>\narea when I saw a park my partner had mentioned earlier.  I asked him<br/>\nif he wanted to go (his response was &quot;whatever&quot;) so I pulled in to the<br/>\npark and let him go play while my partner and I talked.  I told her I<br/>\nunderstood his frustration, and her frustration with his frustration,<br/>\nand that I really didn&#39;t know the answer but that I would post here<br/>\nand get advice.<br/>\n<br/>\nAfter he ran around at the park he was in a better mood.  Parker and I<br/>\nwere both a little calmer because of us talking.  We ended up having a<br/>\ngreat time at the lazer light shows.<br/>\n<br/>\nThis is a typical pattern for us.  If we have something fun planned,<br/>\nand especially when we have multiple fun things planned, something<br/>\ntends to go wrong that disappoints Draven.  It doesn&#39;t matter how much<br/>\nfun we&#39;ve had all day, one little thing that isn&#39;t perfect seems to<br/>\nmake him forget how much fun we&#39;ve had the whole day.  He doesn&#39;t just<br/>\nget frustrated for a few minutes either, he gets frustrated until<br/>\nsomething distracts him, but offering distractions doesn&#39;t work either<br/>\nbecause he&#39;s not interested in any of it.  When he&#39;s frustrated all of<br/>\nhis communication skills go out the window.  He&#39;s normally not<br/>\nintentionally mean (sarcastic yes, but not intentionally hurtful) once<br/>\nhe&#39;s frustrated he&#39;ll say very hurtful things and flat out say that we<br/>\nnever do anything fun for him.<br/>\n<br/>\nWhile I realize that today was a really long day for us and that was<br/>\npart of the problem, this also happens on short trips.<br/>\n<br/>\nAny advice would be greatly appreciated!<br/>\n<br/>\nTina</div>","specialLinks":[]}],"prevTopicId":46109,"nextTopicId":46145}}