{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":183015595,"authorName":"Tyra-Goddess-Body-Mind-Spirit.com","from":"Tyra-Goddess-Body-Mind-Spirit.com &lt;motherspirit@...&gt;","profile":"breastisbesttn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Sharing about Silas","postDate":"1187150457","msgId":25785,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{},"prevInTopic":0,"nextInTopic":0,"prevInTime":25784,"nextInTime":25786,"topicId":25785,"numMessagesInTopic":0,"msgSnippet":"Silas Today, I experienced something that I have never experienced before. The funeral of a child. My friend, Amanda, and her husband, Adam, had the last rites","messageBody":"<div id=\"ygrps-yiv-820275915\">Silas <br/>\nToday, I experienced something that I have never experienced before. The funeral of a child. My friend, Amanda, and her husband, Adam, had the last rites conducted for their son, Silas, who drowned in a swimming pool at the sweet tender age of 3 yrs.<br/>\n<br/>\nWhen I first found out, so many emotions went through me. I was in shock! &quot;How could this happen?&quot; I was deeply saddened, &quot;Poor Amanda, Adam and their families.&quot; I also felt something that was very familiar that I first experienced when my mother was dying and subsequently died.<br/>\n<br/>\nIt is a feeling of true liberation. It is a place within myself that is so filled up in the moment that I have no time, not one second for bullcrap or for sweating the small stuff. In this space, truly, I reside in the present and I have a deep understanding for the sacredness of life.<br/>\n<br/>\nThis is one of the places that I went to when I first heard the news of dear, sweet little Silas. It is as if I can clearly see a foreground and background. The stuff that does not matter, especially my idle chatter about how much my children do things to annoy me, moves to the background. And the stuff that really matters, such as loving my children and husband just as they are, move to the foreground to the point where that is all that I see.<br/>\n<br/>\nSince it has been ten years since my mother made her transition, I have somewhat forgotten the sacredness of every moment of everyday. I remember how keenly aware I was back then and how I infused everything in my life with this truth. I have struggled with remembering it but Silas has helped me this day.<br/>\n<br/>\nIn all things I like to turn my lemons into lemonade. I would prefer for this sweet child to be here living and breathing with his parents. There are moments when it is so surreal to me that I have to ask myself if I dreamt this up.<br/>\n<br/>\nBut since I can&#39;t do anything to change what has happened, what I desire to do is to honor Silas&#39; life with making changes in my life for the better. I KNOW that my friend, Amanda, would take the &quot;worst&quot; of Silas back if that is all she could get. And here I am with two HEALTHY boys and a GREAT husband and I am walking around with a stinkin&#39; attitude!?<br/>\n<br/>\nSo I give thanks to and for Silas for helping me to step back into the appreciation I have for my family.<br/>\n<br/>\nI also honor and give thanks to Silas for helping me to remember the sanctity in everyday. I have a fresh new perspective that I have on appreciating all that life has to offer and seizing the day. I give thanks that I can see how choosing to do something that I think that I &quot;should&quot; do AND from which I derive no joy is such a waste of time.....how not being true to myself is almost a sure way to death.<br/>\n<br/>\nSo this is my &quot;farewell&quot; message to Silas. I know that you are right at home where you are, Silas, because you were such an angel here in the physical realm. Truly, I will miss you though I know that you are still alive and well in spirit. I invite your sweet spirit to join us at Unity on Sundays because without you the church will be so different. I pray that you will continue to visit your parents so that they can still experience the joy of you in their life though you are in a different form, now.<br/>\n<br/>\nSilas, thank you so much for the wonderful gifts that you gave  and are giving to the world in the time that you spent here with us. Please enjoy your new existence and know that we will do all that we can to take care of your parents.<br/>\n<br/>\nI love you little one and look forward to you seeing you again one day.<br/>\n<br/>\nOne Love<br/>\n<br/>\nTyra</div>","specialLinks":[]}],"prevTopicId":25773,"nextTopicId":25776}}