{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":213809267,"authorName":"jlh44music","from":"&quot;jlh44music&quot; &lt;jlh44music@...&gt;","profile":"jlh44music","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: philosophical tenet","postDate":"1171039840","msgId":21324,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVxaThwMCthYW5yQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwNmIwMWM3NGMzNSQ4MjQwZjAyMCQ0MDAxYThjMEBEYXZpZD4="},"prevInTopic":21313,"nextInTopic":0,"prevInTime":21323,"nextInTime":21325,"topicId":21313,"numMessagesInTopic":0,"msgSnippet":"... thing to do. If I chose to look at Simon s or Linnaea s requests for things as a tally card, instead of individual requests, I could get quite","messageBody":"<div id=\"ygrps-yiv-1770441242\">&quot;Schuyler&quot; &lt;s.waynforth@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I think falling into the habit of moaning about a life is an easy <br/>\n </span></blockquote>thing to do. If I chose to look at Simon&#39;s or Linnaea&#39;s requests for <br/>\nthings as a tally card, instead of individual requests, I could get <br/>\nquite bitchy........ I expect this list, I want this list to tell <br/>\nme to change my perspective. To tell me to be with Simon and Linnaea <br/>\nwhile they do what they are doing and see if that is all they are <br/>\ndoing. I don&#39;t want any arena of my life to help me piss and moan <br/>\nabout my life. I want to be able to see the good moments in a day, <br/>\nand not wallow in the bad. I want to go from strength to strength and <br/>\nnot relish my weak moments for their storytelling potential. Not to <br/>\nsay that is what is happening, but I know I have done that, &gt;<br/>\n<br/>\nI&#39;ve done this too.  It&#39;s so easy to complain and wish things were <br/>\nbetter, instead of living more in the moment.  For me, until I <br/>\nstopped working 2 years ago, it was even harder when I was rushing <br/>\naround.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; I can&#39;t make anyone else&#39;s past better. But maybe by offering them <br/>\n </span></blockquote>tools to make this moment a better moment I can help them to see a <br/>\nway forward. And I think dwelling on the bad things, the ones we&#39;ve <br/>\ndone, or the ones done to us, can blind us to the ways to make this <br/>\nmoment a good moment.&gt;<br/>\n<br/>\nWe all have something in our past that we wish had never happened, or <br/>\nthat we wish we could change, but we can&#39;t.  It&#39;s hard to move on <br/>\nand &quot;get over it&quot; and this has been a long struggle for me, but I can <br/>\nhonestly say it was a battle I&#39;m glad I persisted at, for I&#39;m in a <br/>\nmuch better place now than I was even 2 years ago when I pulled my dd <br/>\nout of school.   And she has come so far.  At first I had my doubts <br/>\nabout unschooling, but the battle was mine and I let her &quot;be&quot;, let <br/>\nher heal.  I&#39;ve been thinking about that a lot this week, she has <br/>\nbeen talking a lot about herself, what&#39;s important to her, how she <br/>\nfeels about many things that I think more &quot;traditional&quot; parents would <br/>\nnever hear from their teens.  I respect her as a person, and she <br/>\nknows that I WANT to hear what she has to say, even when I&#39;m really <br/>\ntired and ready to drop, I see that the effort I&#39;ve made to be really <br/>\npresent for her when she&#39;s &quot;on a roll&quot; which is often late at night <br/>\nwhen I&#39;m SO ready to sleep, has paid off big time.  <br/>\n<br/>\nJann<br/>\n(I loved your description of Linnaea in your Warts and All post on <br/>\nyour blog, made me think of the time someone said my dd (Danielle 14) <br/>\nwas an old soul.)</div>","specialLinks":[]},{"userId":280852700,"authorName":"Schuyler","from":"&quot;Schuyler&quot; &lt;s.waynforth@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"philosophical tenet","postDate":"1171017109","msgId":21313,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNmIwMWM3NGMzNSQ4MjQwZjAyMCQ0MDAxYThjMEBEYXZpZD4=","referencesHeader":"PDAwMTUwMWM3NGI0NiQ2NzU0MjQ3MCQzNTAwYThjMEBLaW1iYWxsRmFtaWx5Pg=="},"prevInTopic":0,"nextInTopic":21324,"prevInTime":21312,"nextInTime":21314,"topicId":21313,"numMessagesInTopic":0,"msgSnippet":"... Reading through Deb s response to this I realized I wanted to address this. I can clearly remember hanging out with my friends and bitching about men, all","messageBody":"<div id=\"ygrps-yiv-1797878867\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;&gt;&gt;&gt;Yeah, I&#39;d use a different name.&lt;g&gt; I encourage you to start a list for<br/>\n&gt; single struggling moms, yes. But I caution that sometimes, as comforting<br/>\n&gt; as a support list might be, it has the potential to become one more excuse<br/>\n&gt; for not making real changes in ourselves and in our lives that will move <br/>\n&gt; us<br/>\n&gt; in a positive direction. There&#39;s danger in commiseration in that it often<br/>\n&gt; closes the door on progress toward something better. Sometimes, as much as<br/>\n&gt; we want to hear someone confirm that life sucks, it&#39;s better for our kids <br/>\n&gt; to<br/>\n&gt; have someone say to us, &quot;GET UP and DO something about it.&quot;&gt;&gt;&gt;<br/>\n&gt;<br/>\n&gt; I really really want to know where this philosphical tenet comes from.<br/>\n<br/>\n </span></blockquote>Reading through Deb&#39;s response to this I realized I wanted to address this.<br/>\n<br/>\nI can clearly remember hanging out with my friends and bitching about men, <br/>\nall men in general and the ones we were dating in specific. And it was huge <br/>\nthese bitch fests, with everything up for conversational grabs. And it meant <br/>\nthat we were looking for details to bitch about, to be funny about, to win <br/>\nat the most dysfunctional relationship. I made a concerted effort at some <br/>\npoint early on with David to not bitch about him. Not because he was any <br/>\nmore or less bitchable about, but because the bitching and whining didn&#39;t <br/>\nhelp me to look at our relationship as a good and positive thing. I don&#39;t <br/>\nknow if that made the difference in my marriage to David, but it certainly <br/>\nhelped. When I think about, for example, laundry as a never ending burden, <br/>\nit becomes insurmountable. But, if instead, I put the laundry in the wash <br/>\nand then hang it out to dry while watching the cat bound around down the <br/>\ngarden hoping this time the pigeon won&#39;t fly away and bring in the clothes <br/>\nto hang and fold while watching a cool show in the living room, it is just a <br/>\npart of life.<br/>\n<br/>\nI think falling into the habit of moaning about a life is an easy thing to <br/>\ndo. If I chose to look at Simon&#39;s or Linnaea&#39;s requests for things as a <br/>\ntally card, instead of individual requests, I could get quite bitchy. If I <br/>\ncame to this list, or any of the other lists that I&#39;m on, and started <br/>\nwhining about how Simon stays in his sleeping bag all day and he always <br/>\nwatches television and how Linnaea is always playing on the computer and <br/>\nthey never do anything--none of which is true, but I could argue from that <br/>\nperspective--it would be a disservice to me and to them if I were told that <br/>\nyes, children can be like that. I expect this list, I want this list to tell <br/>\nme to change my perspective. To tell me to be with Simon and Linnaea while <br/>\nthey do what they are doing and see if that is all they are doing. I don&#39;t <br/>\nwant any arena of my life to help me piss and moan about my life. I want to <br/>\nbe able to see the good moments in a day, and not wallow in the bad. I want <br/>\nto go from strength to strength and not relish my weak moments for their <br/>\nstorytelling potential. Not to say that is what is happening, but I know I <br/>\nhave done that, and when I go to homeschooling groups and listen to moms <br/>\nbelittle their children for a laugh it seems a poor trade.<br/>\n<br/>\nI can&#39;t make anyone else&#39;s past better. But maybe by offering them tools to <br/>\nmake this moment a better moment I can help them to see a way forward. And I <br/>\nthink dwelling on the bad things, the ones we&#39;ve done, or the ones done to <br/>\nus, can blind us to the ways to make this moment a good moment.<br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com</div>","specialLinks":[]}],"prevTopicId":21323,"nextTopicId":21031}}