{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":200155843,"authorName":"Rodney and Rebecca Atherton","from":"&quot;Rodney and Rebecca Atherton&quot; &lt;rebeccawow@...&gt;","profile":"wow_academy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Letting Go","postDate":"1113238610","msgId":5386,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGQzYnFicytjMGNrQGVHcm91cHMuY29tPg=="},"prevInTopic":5381,"nextInTopic":0,"prevInTime":5385,"nextInTime":5387,"topicId":5380,"numMessagesInTopic":0,"msgSnippet":"... just hard to let go of these kind of ingrained thoughts. I know what you are saying.  It is hard to let go of how we were conditioned?  It might take time","messageBody":"<div id=\"ygrps-yiv-1631076424\"><blockquote><span title=\"ireply\">&gt;Don&#39;t know what exactly my question is or if I even have a question, its<br/>\n </span></blockquote>just hard to &gt;let go of these kind of ingrained thoughts.<br/>\n<br/>\n <br/>\n<br/>\nI know what you are saying.  It is hard to let go of how we were<br/>\nconditioned?  It might take time to unlearn or relearn that we CAN learn on<br/>\nour own.  It&#39;s a process and may take time.  It was 13 years of programming.<br/>\nIt seems like when my brain takes one step forward in the process (towards<br/>\nliving an Unschooling lifestyle) my fears kick in and take me two steps<br/>\nback.  It&#39;s hard for me to let go and trust that my children will learn what<br/>\nthey need to learn and that they will learn it in their own time.  I don&#39;t<br/>\nhave this trust because I was never trusted to learn on my own?  I feel<br/>\nschizophrenic sometimes.  <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.geocities.com/rebeccawow.geo\">http://www.geocities.com/rebeccawow.geo</a>&gt; Rebecca<br/>\n<br/>\nToo often we give children answers to remember rather than problems to<br/>\nsolve. -Roger Lewin<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":212934673,"authorName":"scrapgal","from":"&quot;scrapgal&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Letting Go","postDate":"1113169936","msgId":5381,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQzYzc2ZytjZzhjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGQzYnFicytjMGNrQGVHcm91cHMuY29tPg=="},"prevInTopic":5380,"nextInTopic":5386,"prevInTime":5380,"nextInTime":5382,"topicId":5380,"numMessagesInTopic":0,"msgSnippet":"... here ... That s because we live in a school-driven society.  Our society needs school in order to contribute to the economic status of our society.","messageBody":"<div id=\"ygrps-yiv-1434819972\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;luv_my_three_kids&quot; <br/>\n&lt;elaina.morrison@g...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Even though I have come to the conclusion that we mostly unschool <br/>\n </span></blockquote>here <br/>\n<blockquote><span title=\"ireply\"> &gt; it is still hard for me to let go of the &quot;school&quot; idea.<br/>\n<br/>\n </span></blockquote>That&#39;s because we live in a school-driven society.  Our <br/>\nsociety &quot;needs&quot; school in order to contribute to the economic status <br/>\nof our society.  That&#39;s the mindset that we are put in.  Without <br/>\nschools our society would fail because this is the only way in which <br/>\npeople can learn.  How else are we going to teach the masses if not <br/>\nin schools?  Certainly they can&#39;t learn this stuff on their own!  (I <br/>\nhope you are reading this dripping with sarcasm!) <br/>\n<br/>\nHow did most of us &quot;learn math?&quot;  It was at school.  So we don&#39;t <br/>\nknow any other way of learning math.  Or science.  Or literature.  <br/>\nOr economics.  Or history.  Or ART for that matter!  Very few of us <br/>\nwere given the freedom to learn these things for ourselves. To <br/>\nexplore them on our own and figure it all out on an &quot;as needed <br/>\nbasis.&quot;  I liken it much to the fact that we don&#39;t live in a <br/>\nbreastfeeding society.  If we did live in a breastfeeding society, <br/>\nbreastfeeding would be the norm and bottle feeding would be what <br/>\nwomyn did if they really truly couldn&#39;t breastfeed.  Mothers <br/>\nwouldn&#39;t quit after 3 or 4 days because they were familiar with the <br/>\ncycle of breastfeeding and that breastfeeding would get easier and <br/>\nsmoother after the first couple of days or weeks.  And they would <br/>\nhave support from their mothers, sisters, aunties, grandmothers, <br/>\ngirlfriends as well as the men in their lives because it was what <br/>\nwas *normal*<br/>\n<br/>\nWhat we are trying to accomplish with unschooling is &quot;not normal&quot;  <br/>\nAbnormal if you wish to think of if that way.  Think what we would <br/>\nhave if we were truly an unschooling society (in that wonderful <br/>\nutopia that we dream of LOL!)  Children would have all the creative <br/>\nplay and materials for creating art.  Shopping malls (if they even <br/>\nexist in our version of utopia) would be built around large green <br/>\nspaces where children could run and play and curl up under (or in) <br/>\ntrees while waiting for their mothers to try on another pair of <br/>\nshoes (if we are even wearing shoes in our utopia LOL!)  Instead of <br/>\nconversations at dinner like &quot;So what did you learn today at school, <br/>\nJunior&quot; the parents and children alike would be sharing the joy of <br/>\ntheir day.  And our society, somehow, would still thrive.  Video <br/>\ngames wouldn&#39;t be evil and television wouldn&#39;t be vile.  And there <br/>\nmight even be something worth watching on television!  :-D<br/>\n<br/>\nWe wouldn&#39;t question whether our children were &quot;learning&quot; because we <br/>\nwould see them excel and create and thrive beyond just thriving!   <br/>\nThey would be living life to the fullest and they would feel <br/>\nrespected and honored by not only their parents but by society as a <br/>\nwhole.  Unfortunately, we don&#39;t live in an unschooling society.  We <br/>\nlive in a society that is geared to train our children to be ready <br/>\nfor school as soon as they are walking (if not sooner).  Kids forget <br/>\nhow to be kids.  <br/>\n<br/>\nIt might help to know that kids don&#39;t need to sit and &quot;do math&quot; to <br/>\nlearn math.  They will learn math as they have a need for it and <br/>\nmany kids figure it out on their own.  I&#39;m astounded sometimes when <br/>\nmy kids ramble off something mathematical and I have to sit and <br/>\nfigure out if they are right or not (99,9% of the time they are).  <br/>\nAnd I didn&#39;t teach it to them.  Not really.  I mean we counted <br/>\ntogether and learned numbers and quantities, but I did very little <br/>\narithmetic with them.  They just figured it out because they had a <br/>\nneed to know a number and how to get that number.<br/>\n<br/>\nMichelle</div>","specialLinks":[]},{"userId":209727179,"authorName":"luv_my_three_kids","from":"&quot;luv_my_three_kids&quot; &lt;elaina.morrison@...&gt;","profile":"luv_my_three_kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Letting Go","postDate":"1113156796","msgId":5380,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQzYnFicytjMGNrQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":5381,"prevInTime":5379,"nextInTime":5381,"topicId":5380,"numMessagesInTopic":0,"msgSnippet":"Even though I have come to the conclusion that we mostly unschool here it is still hard for me to let go of the school idea. Especially since DH thinks they","messageBody":"<div id=\"ygrps-yiv-511530184\">Even though I have come to the conclusion that we mostly unschool here <br/>\nit is still hard for me to let go of the &quot;school&quot; idea. Especially <br/>\nsince DH thinks they need to sit down for hours a day and do school <br/>\nwork. I understand the fact that children learn on their own and its a <br/>\nnatural process. I was looking through thier &quot;school&quot; books(we are <br/>\nusing a charter right now) trying to think of what to do for tomorrows <br/>\nlessons. Everything looked so pointless, I kept thinking why do they <br/>\nneed to sit down with this book and &quot;learn&quot; this, they can learn that <br/>\non their own. The only book I could possibly think of using is their <br/>\nmath book. Knowing all this and believing in  unschooling doesn&#39;t help <br/>\nme get over the idea that they need to sit and do lessons. Don&#39;t know <br/>\nwhat exactly my question is or if I even have a question, its just <br/>\nhard to let go of these kind of ingrained thoughts.</div>","specialLinks":[]}],"prevTopicId":5384,"nextTopicId":5385}}