{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":150527288,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"problems with unschooling lists","postDate":"1085884032","msgId":84,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5YmdxMCtiNWY0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":83,"nextInTime":85,"topicId":84,"numMessagesInTopic":0,"msgSnippet":"The trouble at 101, that spawned this list, also spawned some serious discussion among people not here, about why unschooling lists seem to get contentious at","messageBody":"<div id=\"ygrps-yiv-285059340\">The trouble at 101, that spawned this list, also spawned some <br/>\nserious discussion among people not here, about why unschooling <br/>\nlists seem to get contentious at times.  Sandra posted this at <br/>\nunschoolingdiscussion, and I thought it was SO good and SO relevant <br/>\nthat I brought it here for you all to read. I hope you don&#39;t mind.<br/>\n<br/>\nRen<br/>\n<br/>\nSandra:<br/>\nI&#39;m going to bounce this into another topic area.<br/>\n<br/>\nLately there has been discussion about why unschooling lists are <br/>\ncontentious. <br/>\n I&#39;m not sure they&#39;re more contentious than other lists on earth, <br/>\nbut if they <br/>\nare, why would that be?<br/>\n<br/>\nUnschooling isn&#39;t just another way to homeschool.  And people are <br/>\naccustomed to going to a book or magazine or website and getting the <br/>\nsimple five or ten facts they wanted, and then going and doing their <br/>\nproject.  When to divide bulbs and what fertilizer they need.  How <br/>\nto clean a fireplace or who to call and how often.   What to <br/>\nsubstitute for buttermilk in a recipe.   Where to get <br/>\npool chemicals, if you live in the boonies and want to mail order.<br/>\n<br/>\nSo people look into homeschooling and they see that what happens is <br/>\na family <br/>\nbuys a curriculum.  Oh!  Here are some people who don&#39;t.  Okay, <br/>\ninstead of the <br/>\n<br/>\ncurriculum, what do I use?  And hurry, I don&#39;t have much time to <br/>\nread online. <br/>\n And could you e-mail it to me, because I might not find my way back <br/>\nto this <br/>\nforum.<br/>\n<br/>\nI think there are other factors too, more subtle.  Language works <br/>\nwith labels.  Words are labels.  People like to know who they are by <br/>\nwhat they&#39;re called, <br/>\nbut they claim not to like it.  &quot;I don&#39;t like to be labelled&quot; is a <br/>\nform of &quot;I&#39;m an individualistic person too cool to be pegged, and I <br/>\nlike to intimidate <br/>\nother people to try make them think I can control how they may refer <br/>\nto me.&quot;  <br/>\nThat&#39;s a lot of labelling right there.<br/>\n<br/>\nChristians are Christians the moment they&#39;re baptised or confirmed <br/>\nor the moment they&#39;re born again.  No other approval.  &quot;You&#39;re in.&quot;<br/>\nJews are Jewish when they&#39;re born to a Jewish mom.  They&#39;re in.<br/>\n<br/>\nPeople who enroll in a school are students there.  There are <br/>\nMontessori <br/>\nstudents, and Waldorf students, and honor students, and pre-med <br/>\nstudents (I love that one especially:  &quot;I&#39;m pre-med&quot;) and law <br/>\nstudents...<br/>\n<br/>\nBut with unschooling it doesn&#39;t quite work that way. <br/>\n<br/>\nUnschooling is more like riding a bike.<br/>\n<br/>\nOwning a bike doesn&#39;t make you a bicyclist, nor even a bike rider.<br/>\nWalking the bike around certainly shows you&#39;re not a rider.  <br/>\nTalking about riding it doesn&#39;t make you a bike rider.<br/>\nSigning up for a course in bike riding (is there even such a <br/>\nthing??) would <br/>\nnot make you a bike rider, nor would a certificate saying you had <br/>\ncompleted a <br/>\ncourse in bike riding change a damned thing if you couldn&#39;t get on <br/>\nthe bike and go.<br/>\n<br/>\nSo with unschooling,  you can &quot;not buy the curriculum.&quot;   You can <br/>\nnot send your kids to school.   But when will you be an unschooler?  <br/>\n<br/>\nIs a caterpillar a pre-butterfly?<br/>\nYou have to change inside.  Nobody can tell the caterpillar he&#39;s <br/>\ngoing to be a butterfly.  He might easily be bird food, or road kill <br/>\nfrom a passing <br/>\nbicyclist.<br/>\n<br/>\nThe way to be an unschooler is to change the way you see and think, <br/>\nso that you can change the way you act and react..<br/>\n<br/>\nNobody can act like a bicyclist (maybe on an off-the-ground bike <br/>\nwith a bluescreen for a movie, but that&#39;s not riding a real bike for <br/>\nreal).  You either are doing it or you&#39;re not.<br/>\n<br/>\nPeople can&#39;t act like unschoolers and fool unschoolers into thinking <br/>\nthey&#39;re really riding it.   They have to become unschoolers inside <br/>\nthemselves to the point that they&#39;re not always asking &quot;Is this book <br/>\nokay?  Is this idea okay?  <br/>\nIs this game educational in any way, and how?&quot;  <br/>\n<br/>\nIt&#39;s okay to ask at first, but I think some people think they can <br/>\nask for twelve or thirteen years, instead of really becoming <br/>\nunschoolers at the depth where it is part of their thinking and <br/>\nbeing.<br/>\n<br/>\nAnd those who thinking asking forever is the same as being get angry <br/>\nwhen those same people they were asking for help or approval <br/>\nsay &quot;You&#39;re not thinking it yet.  You&#39;re not keeping your balance <br/>\nyet.  Just go fast enough to feel how you need to balance.  Ride it!&quot;<br/>\n<br/>\nIf I asked &quot;Which pedal should I start with?&quot; after two years of <br/>\nriding a bike, my friends and relatives might think I was really not <br/>\ntoo bright at all.  <br/>\n<br/>\n&quot;How far should I lean when I turn?&quot;  Exactly far enough.  It works <br/>\nby itself, when you do it.  When you become an unschooler, you will <br/>\nknow kids are learning because you see their eyes,  you hear their <br/>\nbreathing, you see their posture and you&#39;re there with them.<br/>\n<br/>\nAnd so some people, when they read things like that, think &quot;AH!  So <br/>\nnobody can tell me if I&#39;m unschooling or not!  Whatever I say is <br/>\nunschooling is, because kids learn all the time.&quot;<br/>\n<br/>\nYeah.  But if the other bicyclists see you back at the starting <br/>\npoint messing awkwardly with your handlebars and not really going <br/>\nanywhere, what you say you are or can do just won&#39;t impress them.<br/>\n<br/>\nOther people buy their unschooling.  We&#39;re making our own out of our <br/>\nlives and families and homes.   We transform our lives into <br/>\nunschooling lives, and it&#39;s just not the same as showing your <br/>\nCalvert receipt and saying &quot;We use Calvert; the box should arrive <br/>\nnext week.&quot;<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":80,"nextTopicId":64}}