{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":357764703,"authorName":"happy2be4family","from":"&quot;happy2be4family&quot; &lt;happy2be4family@...&gt;","profile":"happy2be4family","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"We are new to group and want to introduce ourselves","postDate":"1220066679","msgId":35624,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc5YWVobitta3Q5QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":35623,"nextInTime":35625,"topicId":35624,"numMessagesInTopic":0,"msgSnippet":"Hi we have been a homeschooling/unschooling family for 12 years now. As my daughter is turning 12 and I believe that learning begins at birth, and we all","messageBody":"<div id=\"ygrps-yiv-1183185743\">Hi we have been a homeschooling/unschooling family for 12 years now. <br/>\nAs my daughter is turning 12 and I believe that learning begins at <br/>\nbirth, and we all really are our kids first teachers. I had decided <br/>\nwhen my daughter was 2 to homeschool. At this time I knew very little <br/>\nabout it and had never even heard the term unschooling. It wasn&#39;t <br/>\nuntil she was 5 and my family (and every one else that should not <br/>\nhave mattered)became concerned she wasn&#39;t in school that I began to <br/>\ntry to have some kind of school house in my house. After days and <br/>\nweeks of fighting and tears at trying to make her &quot;sit and do her <br/>\nwork&quot; I knew this wasn&#39;t for me. She had learned so much more before <br/>\nI started to try to please, and to prove to everyone else in our <br/>\nlives that she didn&#39;t &quot;have&quot; to be enrolled in public school. Around <br/>\nthis time I found my first article on &quot;unschooling&quot;. I read articles <br/>\nand stories for 3 days straight. I thought gosh this is what I was <br/>\ndoing BEFORE I officially started &quot;homeschooling&quot;. So we settled into <br/>\na comfortable schooling routine that wasn&#39;t nearly as strict. The <br/>\nonly thing is the pressures from the family, and people we never met <br/>\nnever went away. My children are quized on a regular basis to see how <br/>\nmuch they &quot;know&quot;. I managed well with these things until I became ill <br/>\n4 years ago. We were away from home more during the &quot;school hours&quot; <br/>\nand some places we were going to a lot, like doctors offices <br/>\nwere &quot;concerned&quot; why my kids weren&#39;t in school. I would explain that <br/>\nthey were homeschooled but this just made them more intense on how I <br/>\nwas schooling them being so sick. Well this escalated into a really <br/>\nbad situation (I won&#39;t go into details) that drove me to fight my <br/>\nkids once again to try and please other people. I had struggled for <br/>\nabout 2 years before giving in and trying it other peoples way. In <br/>\nthat time my children learned a lot of compassion for sick people. <br/>\nThey learned a lot about medications and side effects. about <br/>\nillnesses and names of illnesses. They learned how to care for a <br/>\nperson that is sick, and they learned what to do in a medical <br/>\nemergency. They were able to relay to paramedics my allergies, and <br/>\nany medications I was on. I had to stop that when my daughters doctor <br/>\ntold me she didn&#39;t want her to know what kind of medication I am on <br/>\nit makes her feel responsible for me. (I&#39;m sorry am I only supposed <br/>\nsay the name of my medication after I lock her in her room (no I <br/>\ndon&#39;t do that)? She is smart and picks up on things) So back to <br/>\nforcing this time 2 children to sit and try to learn. Well I have <br/>\ndone it for 2 years now, and it is not making any of us happy. So I <br/>\nhave found some unschooling groups on here, and have been getting <br/>\nreinspired. I thank you all for sharing your ideas and inspiration <br/>\nwith each other as I am remembering the joys I had before I was <br/>\npushed back into a different lifestyle again. I hope to find friends <br/>\nand share inspiration with all of you. If anyone has any ideas on how <br/>\nto handle these situations with people threatening me and even some <br/>\ntaking action because my children are not hid from the world during <br/>\nschool hours I would really appreciate the advice.<br/>\n<br/>\n<br/>\nThanks,<br/>\nand happy f-unschooling to all of you.</div>","specialLinks":[]}],"prevTopicId":35380,"nextTopicId":35637}}