{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":14,"messages":[{"userId":321882775,"authorName":"Meliss","from":"Meliss &lt;miceszb6@...&gt;","profile":"miceszb6","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Frustrated Boys and moving","postDate":"1211245999","msgId":33023,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1OTE1OS45NjQyNS5xbUB3ZWIzNzYwMS5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGcwb2JiOStzbTN1QGVHcm91cHMuY29tPg=="},"prevInTopic":32989,"nextInTopic":0,"prevInTime":33022,"nextInTime":33024,"topicId":32828,"numMessagesInTopic":0,"msgSnippet":"Thanks so much Lisa! It helps me greatly to hear about similar experiences. Take Care! Meliss [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-735352021\">Thanks so much Lisa! It helps me greatly to hear about similar experiences. Take Care!<br/>\n   <br/>\n  Meliss<br/>\n<br/>\n       <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":307896383,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;lrowx001@...&gt;","profile":"lrowx001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Frustrated Boys and moving","postDate":"1211084969","msgId":32989,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwb2JiOStzbTN1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGcwZjRhcCszMm02QGVHcm91cHMuY29tPg=="},"prevInTopic":32880,"nextInTopic":33023,"prevInTime":32988,"nextInTime":32990,"topicId":32828,"numMessagesInTopic":0,"msgSnippet":"... Also, our almost 8 yo has been consistently asking to go back to school!! He misses recess and seeing kids everyday. AND we re moving from Northern Cal to","messageBody":"<div id=\"ygrps-yiv-600443264\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Melissa Bell&quot; <br/>\n&lt;miceszb6@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; My boys, almost 9 and almost 8 are having frustration issues. <br/>\n<br/>\n </span></blockquote> Also, our almost 8 yo has been consistently asking to go back to <br/>\nschool!! He misses recess and seeing kids everyday. <br/>\n<br/>\nAND we&#39;re moving from Northern Cal to Southern Cal in a couple of <br/>\nweeks <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is there anything I can/should say or do to make this moving and <br/>\n </span></blockquote>slow period easier on them? &gt; Meliss<br/>\n<br/>\nMelissa,<br/>\n<br/>\nWe are very new to unschooling. We left PS last June, tried <br/>\nhomeschooling in September, and started deschooling in October when <br/>\nwe moved from VA to NC. We are adopting an RU lifestyle - though we <br/>\nhave a lot to unlearn in our parenting. Our boys are 7 and 6. <br/>\n<br/>\nSince we moved recently, I can share some experiences with that. We <br/>\nfirst moved to a furnished rental house in NC while our house was <br/>\nbeing remodeled across the street. Finally, in April, we moved into <br/>\nour house and were reunited with our own furniture/household goods. <br/>\n<br/>\nChildren have a lot to think about with a move. Just watching the <br/>\npacking, seeing familiar items &quot;disappear&quot;, and having boxes around <br/>\ncan be unsettling. This change can create stress for them and <br/>\ncontribute to their intensity and frustration. They may not be able <br/>\nto verbalize their concerns.<br/>\n<br/>\nWe did a couple of things to help the boys. We talked a lot about the <br/>\nnew house, their new room, and the different set-up (separate bunk <br/>\nbeds with desks underneath). As Kelley mentioned in an earlier post, <br/>\nwe let them play with moving boxes on both ends - packing and <br/>\nunpacking. We worked on their room first, making it as orderly and <br/>\ncomfy as possible so they could have a haven away from the disorder <br/>\nof the rest of the house. We tried to find and unpack their toys <br/>\nquickly, and we got the TV and computer working right away. I try to <br/>\nstay alert to their efforts to get my attention when I get obsessed <br/>\nwith organizing. (This is a smaller house, so organizing continues to <br/>\nvex me six weeks after the movers came.)<br/>\n<br/>\nEven with our efforts to ease the transition, the move was very <br/>\nstressful for our younger son. He decided that he wants to wear pull-<br/>\nups again fulltime (although he still uses the toilet for BM). He has <br/>\nbouts of intense frustration and anger, especially if he doesn&#39;t get <br/>\nenough sleep. (When his brother wakes him by being noisy.) This anger <br/>\nsometimes manifests as screaming at parents, hitting the furniture, <br/>\nor being aggressive towards his brother and the cats. He occasionally <br/>\ntalks about missing the white house (VA) and the brown house (rental <br/>\nacross the street). I reassure him that it&#39;s OK to miss them. He also <br/>\ntalks about missing his old school and says that we can &quot;have school&quot; <br/>\nagain. I ask what he misses about the old house (yard and woods) or <br/>\nhis school (friends and housekeeping center) so that we can try to <br/>\nmeet those needs in other ways. <br/>\n<br/>\nI expect this transition may take quite some time for our younger <br/>\nson. We are trying to acknowledge his discomfort of leaving the only <br/>\nhome he knew and moving to a new place. Above all else, we are trying <br/>\nto meet his most basic needs for food, security, and cuddling before <br/>\nthey become acute. I suspect our shift to an RU lifestyle is a mixed <br/>\nblessing at this time in his life.<br/>\n<br/>\nIt&#39;s late and I&#39;m rambling. Good luck with your move! I hope your <br/>\nfamily adjusts well. (Our older son just flowed right along with the <br/>\nmoves.) As Kelley pointed out earlier, the post-move time may be more <br/>\ndifficult while the children adjust to new surroundings. My closing <br/>\nadvice is to communicate as openly as you can about their fears and <br/>\ntheir excitement (and yours).<br/>\n<br/>\nCheers, Lisa</div>","specialLinks":[]},{"userId":321882775,"authorName":"Meliss","from":"Meliss &lt;miceszb6@...&gt;","profile":"miceszb6","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Frustrated Boys","postDate":"1210893836","msgId":32880,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk0OTE1Ny4yMDkwNS5xbUB3ZWIzNzYwNC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDcyODY4OC4zODA1OC5xbUB3ZWI4NjIwNi5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":32876,"nextInTopic":32989,"prevInTime":32879,"nextInTime":32881,"topicId":32828,"numMessagesInTopic":0,"msgSnippet":"... From: Melissa Bell  To: unschoolingbasics@ yahoogroups. com Sent: Wednesday, 14 May, 2008 5:34:33 PM Subject: [unschoolingbasics]","messageBody":"<div id=\"ygrps-yiv-1700319941\">----- Original Message ----<br/>\nFrom: Melissa Bell &lt;miceszb6@yahoo. com&gt;<br/>\nTo: unschoolingbasics@ yahoogroups. com<br/>\nSent: Wednesday, 14 May, 2008 5:34:33 PM<br/>\nSubject: [unschoolingbasics] Frustrated Boys<br/>\n<br/>\n <br/>\nScreaming, crying, and fighting are &quot;normal&quot; occurences throughout <br/>\nthe day, everyday. I haven&#39;t figured out how to turn myself off to <br/>\nthis and it&#39;s driving me nuts. <br/>\n------------ ---<br/>\nDon&#39;t turn yourself off to it. Figure out what is going on, get in there, play the game, see the frustration, find ways to help with being frustrated. Make sure that it is all about the game and not about being hungry or thirsty. Turning yourself off isn&#39;t going to help them to figure out how to negotiate through the situation. <br/>\n------------ --<br/>\n  Very true! And my behavior has not been something I feel is right. After thinking about this more constructively I realized that I don&#39;t play the video games as much because I do know the frustration they can sometimes bring on in me. I do sometimes get in there and play Mario Kart or Wii games and usually stop when it&#39;s not fun anymore. I guess I was just hoping the boys would know when they&#39;re at a limit and take a break. I think I expect too much sometimes.<br/>\n<br/>\nYesterday morning (early) the boys <br/>\nwere up and their sisters and dad were still sleeping. They yelled <br/>\nand fought for 40 min straight before I ended up wordlessly [I didn&#39;t <br/>\nwant to say anything crazy, I&#39;m not a good morning person and waking <br/>\nup to screaming over whose turn it is makes me angry!!] unplugging <br/>\nthe game system and putting it in my room. I talked with them about <br/>\nit later on when I was calmer. <br/>\n------------ -<br/>\n<br/>\nThe right to sleep is more pivotal than the right to be loud and play a game. I would probably have given a warning far early than 40 minutes after the fact. And I would say if you can&#39;t get up and play quietly than you need to find something that you can do quietly and if you can&#39;t do that you need to stay in your room. When Simon or Linnaea have sleepovers the guideline is that once someone has gone to bed the noise needs to move to a minimum. When it gets too loud I will come and tell them to find something quieter to do. If it gets loud again, I usual come down and tell them to go to bed, they are welcome to continue to chat and giggle and watch movies quietly in bed, but if it impinges on someone else&#39;s sleep, than that, too, needs to stop. <br/>\n<br/>\n------------ ----<br/>\n   <br/>\n  I didn&#39;t add enough info here when I wrote this! I had warned them twice by coming out of my room and asking them to quiet down and did say that if they couldn&#39;t find it in themselves to quiet down they&#39;d have to stop playing and watch a cartoon or the like. This is probably one reason I got upset. I was tired and cranky (no excuse to be mean though) and I just wanted them to stop. So my reaction was overboard.<br/>\n<br/>\n<br/>\nWhat can I do or say to help them through their issues? How do I help <br/>\nthem to communicate? I can&#39;t just leave them alone, I&#39;ve tried and <br/>\nthis has been going on for months. <br/>\n------------ -<br/>\nI&#39;ve found that it helps if I am there. Simon doesn&#39;t like to playgames with Linnaea, although he will often give it a go, she can get angry if he wins. It helps a lot for me to be in the room when they are playing together. And if I&#39;m not in the room, I try and be aware and listening to the interaction.  <br/>\n   <br/>\n  I&#39;m defenitely always listening! I even hear them when they&#39;re outside and I&#39;m not. This is almost always a positive thing, I love to hear some of the cute and funny things thay say when talking with each other and being imaginative! In my original post I make myself sound detached and aloof but fortunately I&#39;m not like that at all! I really listen and am involved and in the same room 98% of the time. I think I meant to say that I&#39;ve been at a loss for words recently with them. I&#39;m not sure how to get my point across or feel like they&#39;re hearing me. I know this is a constant learning process and part of growing communication skills, I guess I was just looking for tips.<br/>\n   <br/>\n   Again, feeding them and giving them drinks, offering things that I can do with them, having fun things to do while one is waiting for the other, on-line games, books, card games, races around the garden, baking cookies, making mentos and diet coke showers, anything that might engage them and not make them feel on the losing end of waiting for a turn. <br/>\n   <br/>\n  Very good ideas I can utilize! I&#39;ve really been wanting to try the mentos and soda thing!<br/>\n  <br/>\nIt sounds like, from the rest of your post, that you are overwhelmed by all of the things coming up and are not actively engaging enough with your them.<br/>\n   <br/>\n  This is true! And today was much different! We got out some boxes and built a fort and colored on it, we played with our huge parachute (in fact this doubled as a fantastic roof for the fort) and tons of inflatable toys for it, the kids had friends over and we all played games like Bingo and Dominoes and everyone won prizes ( I have a fun box with toys and gadgets) We&#39;ve gotten out on the trampoline and played with water balloons and today has been really fun! I think I was overwhelmed and just needed to get over it and just play. I do feel good about posting about this because I&#39;ve heard some really great feedback and ideas and having implemented some today just proves that I needed a time out to check my attitude. I&#39;ve been being very negative and easily irritated recently. <br/>\n   <br/>\n  Is there anyway you can get people to come and help? Do you have family or friends around who can come and pack or bounce on a trampoline or whatever? <br/>\n   <br/>\n  No not really. I&#39;ve asked but no such luck. My hubby is really great about it though, he&#39;s just been out of town working.<br/>\n   <br/>\n  Can you figure out ways to make the next few weeks less about packing and more about them? I know it is hard, we just moved. But it makes a big difference if I could spend a couple of hours solidly engaged with Simon and Linnaea and then to packing. And I don&#39;t think they are going to naturally find ways to entertain themselves that aren&#39;t things that piss you off, like screaming at the television when a game isn&#39;t going their way. <br/>\n<br/>\nSchuyler<br/>\nwww.waynforth. blogspot. com<br/>\n   <br/>\n  I agree. And less packing, more play and fun is now my goal! I just got over one of the biggest packing seessions anyway and won&#39;t be so busy with that now. So I know it will work out. Plus, I&#39;m feeling more positive and hopeful after today!<br/>\n   <br/>\n  Thanks, Schuyler!<br/>\n   <br/>\n  Meliss <br/>\n<br/>\n       <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Frustrated Boys","postDate":"1210884072","msgId":32876,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcyODY4OC4zODA1OC5xbUB3ZWI4NjIwNi5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":32875,"nextInTopic":32880,"prevInTime":32875,"nextInTime":32877,"topicId":32828,"numMessagesInTopic":0,"msgSnippet":"... From: Melissa Bell  To: unschoolingbasics@yahoogroups.com Sent: Wednesday, 14 May, 2008 5:34:33 PM Subject: [unschoolingbasics]","messageBody":"<div id=\"ygrps-yiv-1820884790\">----- Original Message ----<br/>\nFrom: Melissa Bell &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:miceszb6@...\">miceszb6@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Wednesday, 14 May, 2008 5:34:33 PM<br/>\nSubject: [unschoolingbasics] Frustrated Boys<br/>\n<br/>\nHi,<br/>\nThis is going to be long but I need some advice.<br/>\n<br/>\nMy boys, almost 9 and almost 8 are having frustration issues. They <br/>\nlove video games but their behavior is worse when they play them. <br/>\nScreaming, crying, and fighting are &quot;normal&quot; occurences throughout <br/>\nthe day, everyday. I haven&#39;t figured out how to turn myself off to <br/>\nthis and it&#39;s driving me nuts. <br/>\n---------------<br/>\nDon&#39;t turn yourself off to it. Figure out what is going on, get in there, play the game, see the frustration, find ways to help with being frustrated. Make sure that it is all about the game and not about being hungry or thirsty. Turning yourself off isn&#39;t going to help them to figure out how to negotiate through the situation. <br/>\n--------------<br/>\n<br/>\nYesterday morning (early) the boys <br/>\nwere up and their sisters and dad were still sleeping. They yelled <br/>\nand fought for 40 min straight before I ended up wordlessly [I didn&#39;t <br/>\nwant to say anything crazy, I&#39;m not a good morning person and waking <br/>\nup to screaming over whose turn it is makes me angry!!] unplugging <br/>\nthe game system and putting it in my room. I talked with them about <br/>\nit later on when I was calmer. <br/>\n-------------<br/>\n<br/>\nThe right to sleep is more pivotal than the right to be loud and play a game. I would probably have given a warning far early than 40 minutes after the fact. And I would say if you can&#39;t get up and play quietly than you need to find something that you can do quietly and if you can&#39;t do that you  need to stay in your room. When Simon or Linnaea have sleepovers the guideline is that once someone has gone to bed the noise needs to move to a minimum. When it gets too loud I will come and tell them to find something quieter to do. If it gets loud again, I usual come down and tell them to go to bed, they are welcome to continue to chat and giggle and watch movies quietly in bed, but if it impinges on someone else&#39;s sleep, than that, too, needs to stop. <br/>\n<br/>\n----------------<br/>\nI don&#39;t feel that the video games are <br/>\nthe problem. Their behavior is defenitely worse when they play them <br/>\nthough. <br/>\n---------------<br/>\n<br/>\nVideo games can be pretty intense. Very focused and very frustrating. They are also really appealling and engaging and all of those things may make them more likely to be at the center of conflict.  <br/>\n----------------<br/>\n<br/>\nWhat can I do or say to help them through their issues? How do I help <br/>\nthem to communicate? I can&#39;t just leave them alone, I&#39;ve tried and <br/>\nthis has been going on for months. <br/>\n-------------<br/>\nI&#39;ve found that it helps if I am there. Simon doesn&#39;t like to playgames with Linnaea, although he will often give it a go, she can getangry if he wins. It helps a lot for me to be in the room when they areplaying together. And if I&#39;m not in the room, I try and be aware andlistening to the interaction. Not the words so much as the intonations.Listening for frustration and anger and tension building. Again, feeding them and giving them drinks, offering things that I can do with them, having fun things to do while one is waiting for the other, on-line games, books, card games, races around the garden, baking cookies, making mentos and diet coke showers, anything that might engage them and not make them feel on the losing end of waiting for a turn. <br/>\n<br/>\n<br/>\nI pulled them out of ps towards <br/>\nthe end of 07&#39; (actually June but then they started a charter in Sep <br/>\nand did that for two months which made the situation worse) so do you <br/>\nthink they&#39;re still deschooling? Also, our almost 8 yo has been <br/>\nconsistently asking to go back to school!! He misses recess and <br/>\nseeing kids everyday. When we&#39;re at home he doesn&#39;t like to relax and <br/>\nget imaginative. He&#39;s &quot;bored&quot; and asks for friends to come over <br/>\nEVERYDAY. <br/>\n-------------------<br/>\n<br/>\nI don&#39;t know if it is deschooling or not. Linnaea, who has never been to school, can and does express boredom and does want to have friends over often. I do my best to offer engaging things to do and to get people to come over as frequently as I can. I figure those things have nothing to do with school and everything to do with her. She can relax and enjoy and engage, but sometimes those things don&#39;t appeal. We have the limitation of one car and not having a lot of easily accessible people around. So, I do what I can and often that is hanging out with her and doing what she wants to do. <br/>\n<br/>\nIt sounds like, from the rest of your post, that you are overwhelmed by all of the things coming up and are not actively engaging enough with your them. Is there anyway you can get people to come and help? Do you have family or friends around who can come and pack or bounce on a trampoline or whatever? Can you figure out ways to make the next few weeks less about packing and more about them? I know it is hard, we just moved. But it makes a big difference if I could spend a couple of hours solidly engaged with Simon and Linnaea and then to packing. And I don&#39;t think they are going to naturally find ways to entertain themselves that aren&#39;t things that piss you off, like screaming at the television when a game isn&#39;t going their way. <br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":321882775,"authorName":"Meliss","from":"Meliss &lt;miceszb6@...&gt;","profile":"miceszb6","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Frustrated Boys","postDate":"1210876037","msgId":32875,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0ODQ0NC45OTgwNy5xbUB3ZWIzNzYwNC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDAwMTYwMWM4YjZhYSQ3ODY5NmRkMCQ2NzAyYThjMEB5b3VydzA0Z3R4bGQ2Nz4="},"prevInTopic":32874,"nextInTopic":32876,"prevInTime":32874,"nextInTime":32876,"topicId":32828,"numMessagesInTopic":0,"msgSnippet":"Frustrated Boys Posted by: Melissa Bell miceszb6@yahoo. com miceszb6 Wed May 14, 2008 9:55 am (PDT) Hi, This is going to be long but I need some advice. My","messageBody":"<div id=\"ygrps-yiv-1240810498\">Frustrated Boys <br/>\nPosted by: &quot;Melissa Bell&quot; miceszb6@yahoo. com miceszb6 <br/>\nWed May 14, 2008 9:55 am (PDT) <br/>\nHi,<br/>\nThis is going to be long but I need some advice.<br/>\n<br/>\nMy boys, almost 9 and almost 8 are having frustration issues. They <br/>\nlove video games but their behavior is worse when they play them. <br/>\nScreaming, crying, and fighting are &quot;normal&quot; occurences throughout <br/>\nthe day, everyday. I haven&#39;t figured out how to turn myself off to <br/>\nthis and it&#39;s driving me nuts. Yesterday morning (early) the boys <br/>\nwere up and their sisters and dad were still sleeping. They yelled <br/>\nand fought for 40 min straight. <br/>\n<br/>\n**Is this what the yelling is about all the time? Whose turn it is? Around here, DS plays and yells but he&#39;s yelling at the other players -- who are, apparently, all idiots! :)<br/>\n   <br/>\n  No it&#39;s not just whose turn it is. The yelling also includes calling other players idiots! LOL :) And also being disappointed about losing or not earning points when they&#39;re playing hard. Regular challenging stuff I guess. I think what got to me most was that they were fighting early in the morning when Dad was sleeping in and he never gets to do that. And then the fact that they do this yelling fighting stuff often I let get to me and I got all huffy. <br/>\n<br/>\n**Can you work on the sharing with them, if that&#39;s the issue?<br/>\n   <br/>\n  We defenitely need to work on sharing! <br/>\n   <br/>\n  If the yelling is part of the enjoyment of the game, do they not respond to a reminder that others are sleeping or want some quiet? <br/>\n   <br/>\n  They do respond sometimes but that morning was especially harsh. They continued being loud after I asked them to try to keep it down due to people sleeping. But even still it does happen frequently and I don&#39;t like how I react. <br/>\n   <br/>\n  Do they need a second game setup? Maybe after the move?<br/>\n   <br/>\n  Yeah, probably so. If we could make it a point to get another TV or two, this would be something worth trying out. Especially now that our 4 yo dd is getting interested in playing. My dh wants to get everyone their own computer/laptop eventually and have us all hooked up WiFi. We&#39;ll see how that pans out! My hubby is a gamer and loves the idea of the kids having their own set-ups. Sounds fun, to me.<br/>\n   <br/>\n  <br/>\n<br/>\nunplugging <br/>\nthe game system and putting it in my room. I talked with them about <br/>\nit later on when I was calmer. I don&#39;t feel that the video games are <br/>\nthe problem. Their behavior is defenitely worse when they play them <br/>\nthough. <br/>\n<br/>\n**What did you talk about with them? What did they say?<br/>\n   <br/>\n  We talked about what respect means to them. One said if he was respected it would mean he wouldn&#39;t feel hurt or sad because someone is mean and bullying instead of respectful, he wouldn&#39;t be interrupted when talking, his brother would take turns with him, he would have his own space and be free to feel like his own person. Our other son seemed to be listening and was mostly quiet. I said that it&#39;s also respectful to make it easier for people to sleep in the morning by not yelling and working on sharing the games and taking turns without conflict. I also told them it was disrespectful of me to take their system away like I did and I apologized and they had a chance to see that people make mistakes and that we can work together to help us feel respected and connected. I felt like I made headway but we&#39;ve had similar conversations before and sometimes it just all seems to go out the window, so when I posted originally I was really feeling negative. Bad time to post probably! <br/>\n<br/>\nWhat can I do or say to help them through their issues? How do I help <br/>\nthem to communicate? I can&#39;t just leave them alone, I&#39;ve tried and <br/>\nthis has been going on for months.<br/>\n   <br/>\n  I think when Kelly responded she helped to address this part. I&#39;m too permissive and not as respectful as I should be. I haven&#39;t really been trying in the right ways! <br/>\n   <br/>\n  I pulled them out of ps towards <br/>\nthe end of 07&#39; (actually June but then they started a charter in Sep <br/>\nand did that for two months which made the situation worse) so do you <br/>\nthink they&#39;re still deschooling? Also, our almost 8 yo has been <br/>\nconsistently asking to go back to school!! He misses recess and <br/>\nseeing kids everyday. <br/>\n   <br/>\n  I realized, from what Joyce said, that he&#39;s just very social and he should be provided social outlets as much as everyday, all the time, if that&#39;s what he needs to grow and come into his own. He needs this kind of stimulation which he&#39;s not getting right now and is why he&#39;s feeling lack of and missing recess from the school days. <br/>\n   <br/>\n  They do have a couple friends but don&#39;t play everyday. <br/>\nTheir friends also go to school and so we have to work around this. <br/>\nAnd then to add more salt to the wound, I&#39;ve recently lost my vehicle <br/>\nso we&#39;re more homebound AND we&#39;re moving from Northern Cal to <br/>\nSouthern Cal in a couple of weeks so the kids haven&#39;t had any extra <br/>\nactivities outside the home. I know it&#39;s critical to get <br/>\nhomeschoolers/ unschoolers out into the world and meet people, see <br/>\nthings, take trips, etc. But what do we do when there&#39;s down time?!! <br/>\n<br/>\n**I wouldn&#39;t agonize about this now. You are about to move so anyone you would meet now would soon be out of reach.<br/>\n   <br/>\n  That&#39;s been my way of thinking about it but I think that makes me feel guilty, like I&#39;m depriving them. <br/>\n   <br/>\n  Having no car stinks -- you can all feel bad about that together. What else can you do? Some of us are sometimes between cars and that&#39;s just the reality. But you could get online now and find out about unschoolers in the Southern Cal area -- I don&#39;t know if it&#39;s near you and I know Cal if spread out but Pam Sorooshian&#39;s unschoolers&#39; group is somewhere in Cal -- maybe they could help you find one or two unschoolers who will be near you when you move. <br/>\n   <br/>\n  This is actually a big positive for the moving situation. I&#39;ve found a list to be on for our area and have been talking with homeschoolers already and getting ready to meet them. There are not so much unschoolers so we might have to travel a bit for that but I feel that the kids will have good chances to have buddies and form relationships that they&#39;re lacking in now. Plus, my niece and nephew live there and the kids are really excited about playing with them.<br/>\n<br/>\nI&#39;m running out of ideas, especially while packing up their toys and <br/>\ngames and such. <br/>\n<br/>\n**Is there something else you could be packing and leave these things available for as long as possible and get the kids to help with the sorting and packing of their stuff? Maybe, maybe not. Just a thought.<br/>\n   <br/>\n  Defenitely! I&#39;ve now left out toys,art supplies, and games. These will be packed the very last day!<br/>\n<br/>\nI don&#39;t know what to do to let them know how to have <br/>\nmore fun. I keep thinking if they get bored enough they&#39;ll eventually <br/>\nfind things to do and that their mentality has to do with being <br/>\nschooled their whole life (mine too) and they&#39;re still not used to <br/>\nnot having someone tell them what to do when. What do you think?<br/>\n<br/>\n<br/>\n**I think moving is boring. I think every day isn&#39;t a trip to the circus and they are young and are entitled to feel bored during a boring time. But they are not entitled to make everyone around them miserable. And I think they are old enough to understand that and try to be a little more considerate about their yelling during gaming. And can help to brainstorm meeting up with new peope after the move. And can help with the move. Then, maybe, it won&#39;t all be so horribly boring. :)<br/>\n<br/>\nNance<br/>\n   <br/>\n  Thank you very much, Nance! I do feel better now. Just talking things through helps me to get ideas and I feel like I&#39;ve gained some new perspective which will help out. <br/>\n   <br/>\n  Meliss <br/>\n<br/>\n       <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":321882775,"authorName":"Meliss","from":"Meliss &lt;miceszb6@...&gt;","profile":"miceszb6","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re:Frustrated Boys","postDate":"1210871087","msgId":32874,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3OTkwMi4yOTI4LnFtQHdlYjM3NjA1Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDAwMzEwMWM4YjY5OSRmNzkxZDQwMCQ0NDAxYThjMEByb251MmZpczR0OHNrOD4="},"prevInTopic":32873,"nextInTopic":32875,"prevInTime":32873,"nextInTime":32875,"topicId":32828,"numMessagesInTopic":0,"msgSnippet":"WOW!!! Thanks so much for your response, Kelley!!! I m feeling like crying right now because I realized I m much too rigid!! You have some GREAT ideas and I","messageBody":"<div id=\"ygrps-yiv-962386288\">WOW!!! Thanks so much for your response, Kelley!!! I&#39;m feeling like crying right now because I realized I&#39;m much too rigid!! You have some GREAT ideas and I will definitely be putting some to use! <br/>\n   <br/>\n  I feel more confident today than ever before about starting over and gaining new perspective! I&#39;m very grateful for all of your opinions, you guys! Thanks so much!<br/>\n   <br/>\n  Meliss <br/>\n<br/>\n       <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":321882775,"authorName":"Meliss","from":"Meliss &lt;miceszb6@...&gt;","profile":"miceszb6","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Frustrated Boys","postDate":"1210870087","msgId":32873,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDE5Ny44ODg3NS5xbUB3ZWIzNzYwNS5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGcwaGVjNytpYmIwQGVHcm91cHMuY29tPg=="},"prevInTopic":32872,"nextInTopic":32874,"prevInTime":32872,"nextInTime":32874,"topicId":32828,"numMessagesInTopic":0,"msgSnippet":"Based on the experience I have just had, you could try separarating the two boys with things that they both find fun,like sending one to a friend s house while","messageBody":"<div id=\"ygrps-yiv-549868355\">Based on the experience I have just had, you could try separarating <br/>\nthe two boys with things that they both find fun,like sending one to <br/>\na friend&#39;s house while the other gets time with you.They may be <br/>\ninclined to fight less and since they are more connected with you <br/>\nthey might respect your words more.<br/>\n   <br/>\n  Very good idea! I have been thinking that they could benefit from being separated and having individual mom time. They&#39;ve been doing this with dad and I do see a difference. <br/>\n<br/>\nI am also finding out that there is a big difference between being <br/>\nrespectful to a childs needs and being totally permissive.( that&#39;s <br/>\nme,too permissive) It is hard for me, and I&#39;m sure others because we <br/>\nwere raised in a way of rules,limits and punishments. It&#39;s hard to <br/>\nsee it any other way except complete limitless freedom and non-<br/>\ncoercion. There is a way to be respectful but not let kids trample on <br/>\nothers rights too. I&#39;m learning that now!<br/>\n-Kelly<br/>\n   <br/>\n  Thanks, Kelly. I fall into the more permissive category, I think. I definitely want to learn how to get rid of my rules, limits, and punishments mentality I was raised with and start being more respectful to the kids needs and individual personalities.<br/>\n   <br/>\n  Meliss<br/>\n  <br/>\n<br/>\n<br/>\n       <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"Nance Confer","from":"&quot;Nance Confer&quot; &lt;marbleface@...&gt;","profile":"nanceconfer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Frustrated Boys","postDate":"1210869664","msgId":32864,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTYwMWM4YjZhYSQ3ODY5NmRkMCQ2NzAyYThjMEB5b3VydzA0Z3R4bGQ2Nz4="},"prevInTopic":32860,"nextInTopic":32871,"prevInTime":32863,"nextInTime":32865,"topicId":32828,"numMessagesInTopic":0,"msgSnippet":"Frustrated Boys Posted by: Melissa Bell miceszb6@yahoo.com   miceszb6 Wed May 14, 2008 9:55 am (PDT) Hi, This is going to be long but I need some advice. My","messageBody":"<div id=\"ygrps-yiv-63892997\">Frustrated Boys <br/>\nPosted by: &quot;Melissa Bell&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:miceszb6@...\">miceszb6@...</a>   miceszb6 <br/>\nWed May 14, 2008 9:55 am (PDT) <br/>\nHi,<br/>\nThis is going to be long but I need some advice.<br/>\n<br/>\nMy boys, almost 9 and almost 8 are having frustration issues. They <br/>\nlove video games but their behavior is worse when they play them. <br/>\nScreaming, crying, and fighting are &quot;normal&quot; occurences throughout <br/>\nthe day, everyday. I haven&#39;t figured out how to turn myself off to <br/>\nthis and it&#39;s driving me nuts. Yesterday morning (early) the boys <br/>\nwere up and their sisters and dad were still sleeping. They yelled <br/>\nand fought for 40 min straight before I ended up wordlessly [I didn&#39;t <br/>\nwant to say anything crazy, I&#39;m not a good morning person and waking <br/>\nup to screaming over whose turn it is makes me angry!!] <br/>\n<br/>\n<br/>\n**Is this what the yelling is about all the time? Whose turn it is? Around here, DS plays and yells but he&#39;s yelling at the other players -- who are, apparently, all idiots! :)<br/>\n<br/>\n**Can you work on the sharing with them, if that&#39;s the issue? If the yelling is part of the enjoyment of the game, do they not respond to a reminder that others are sleeping or want some quiet? Do they need a second game setup? Maybe after the move?<br/>\n<br/>\n<br/>\n<br/>\nunplugging <br/>\nthe game system and putting it in my room. I talked with them about <br/>\nit later on when I was calmer. I don&#39;t feel that the video games are <br/>\nthe problem. Their behavior is defenitely worse when they play them <br/>\nthough. <br/>\n<br/>\n**What did you talk about with them? What did they say?<br/>\n<br/>\n<br/>\nWhat can I do or say to help them through their issues? How do I help <br/>\nthem to communicate? I can&#39;t just leave them alone, I&#39;ve tried and <br/>\nthis has been going on for months. I pulled them out of ps towards <br/>\nthe end of 07&#39; (actually June but then they started a charter in Sep <br/>\nand did that for two months which made the situation worse) so do you <br/>\nthink they&#39;re still deschooling? Also, our almost 8 yo has been <br/>\nconsistently asking to go back to school!! He misses recess and <br/>\nseeing kids everyday. When we&#39;re at home he doesn&#39;t like to relax and <br/>\nget imaginative. He&#39;s &quot;bored&quot; and asks for friends to come over <br/>\nEVERYDAY. They do have a couple friends but don&#39;t play everyday. <br/>\nTheir friends also go to school and so we have to work around this. <br/>\nAnd then to add more salt to the wound, I&#39;ve recently lost my vehicle <br/>\nso we&#39;re more homebound AND we&#39;re moving from Northern Cal to <br/>\nSouthern Cal in a couple of weeks so the kids haven&#39;t had any extra <br/>\nactivities outside the home. I know it&#39;s critical to get <br/>\nhomeschoolers/unschoolers out into the world and meet people, see <br/>\nthings, take trips, etc. But what do we do when there&#39;s down time?!! <br/>\n<br/>\n**I wouldn&#39;t agonize about this now. You are about to move so anyone you would meet now would soon be out of reach. Having no car stinks -- you can all feel bad about that together. What else can you do? Some of us are sometimes between cars and that&#39;s just the reality. But you could get online now and find out about unschoolers in the Southern Cal area -- I don&#39;t know if it&#39;s near you and I know Cal if spread out but Pam Sorooshian&#39;s unschoolers&#39; group is somewhere in Cal -- maybe they could help you find one or two unschoolers who will be near you when you move. <br/>\n<br/>\n<br/>\nIs there anything I can/should say or do to make this moving and slow <br/>\nperiod easier on them? Cause right now I&#39;m just sorting and packing <br/>\nand cleaning and our 4 kids (8,7,4,2) are pretty much on their own. <br/>\nPlaying games,jumping on the trampoline, watching videos and TV, <br/>\ndrawing/coloring, stuff like this. But none are reading yet so no <br/>\ngetting lost in a book (I like to do this). The oldest knows how to <br/>\nread but chooses not to get into books on his own.<br/>\n<br/>\nI&#39;m running out of ideas, especially while packing up their toys and <br/>\ngames and such. <br/>\n<br/>\n<br/>\n**Is there something else you could be packing and leave these things available for as long as possible and get the kids to help with the sorting and packing of their stuff? Maybe, maybe not. Just a thought.<br/>\n<br/>\n<br/>\nI don&#39;t know what to do to let them know how to have <br/>\nmore fun. I keep thinking if they get bored enough they&#39;ll eventually <br/>\nfind things to do and that their mentality has to do with being <br/>\nschooled their whole life (mine too) and they&#39;re still not used to <br/>\nnot having someone tell them what to do when. What do you think?<br/>\n<br/>\nMeliss <br/>\n<br/>\n**I think moving is boring. I think every day isn&#39;t a trip to the circus and they are young and are entitled to feel bored during a boring time. But they are not entitled to make everyone around them miserable. And I think they are old enough to understand that and try to be a little more considerate about their yelling during gaming. And can help to brainstorm meeting up with new peope after the move. And can help with the move. Then, maybe, it won&#39;t all be so horribly boring. :)<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":321882775,"authorName":"Meliss","from":"Meliss &lt;miceszb6@...&gt;","profile":"miceszb6","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Frustrated Boys","postDate":"1210869509","msgId":32872,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1NzkwOS4xNjk1OC5xbUB3ZWIzNzYwNC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDhDMDRBMzhGLTA4REMtNENCMy1BRTRFLUJBNjlFRjk0QTM5MEB2ZXJpem9uLm5ldD4="},"prevInTopic":32871,"nextInTopic":32873,"prevInTime":32871,"nextInTime":32873,"topicId":32828,"numMessagesInTopic":0,"msgSnippet":"... I think it will help if you change your point of view from controlling their behavior to helping them. Defenitely! I want to help them work through any","messageBody":"<div id=\"ygrps-yiv-863329871\">On May 14, 2008, at 12:34 PM, Melissa Bell wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Yesterday morning (early) the boys<br/>\n&gt; were up and their sisters and dad were still sleeping. They yelled<br/>\n&gt; and fought for 40 min straight before I ended up wordlessly ... <br/>\n&gt; unplugging<br/>\n&gt; the game system and putting it in my room.<br/>\n<br/>\n </span></blockquote>I think it will help if you change your point of view from <br/>\ncontrolling their behavior to helping them.<br/>\n   <br/>\n  Defenitely! I want to help them work through any issues, not control them! I did make a mistake, I feel, by taking the system away because I didn&#39;t think it through I and let them irritate me. I just am not sure how to change so I don&#39;t react so fast in a negative way and how to change what I say or do to help them out. I understand that my point of view should change.<br/>\n<br/>\nThey don&#39;t get greater privileges just because their kids. Their dad <br/>\ndoesn&#39;t have a right to blast the ball game while they&#39;re trying to <br/>\nsleep. Being up means being respectful of those who are still asleep.<br/>\n   <br/>\n  I agree. This was the exact base of the conversation that I had with them after I overreacted. I apologized and pointed out that my behavior was disrespectful to them and we talked about the meaning of respect and us working on respecting other family members&#39; sleeping time.<br/>\n<br/>\nPart of it *is* probably deschooling if they feel they can run <br/>\nroughshod over other&#39;s feeling to get what they want. That comes from <br/>\nexperiencing *their* feelings getting run roughshod over so other <br/>\npeople can get what they want. (One biggie was obviously being sent <br/>\nto school when they didn&#39;t want to go.)<br/>\n<br/>\nBut even that doesn&#39;t give them greater privileges. It might help you <br/>\nshift your point of view to help you find solutions, though.<br/>\n   <br/>\n  If I shift my point of view do the solutions just start presenting themselves? Am I at a loss as what to do correctly because I have this certain kind of view? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He&#39;s &quot;bored&quot; and asks for friends to come over<br/>\n&gt; EVERYDAY.<br/>\n<br/>\n </span></blockquote>I wouldn&#39;t put bored in quotes nor capitalize everyday. Those are <br/>\nreal needs. He&#39;s obviously a very social person and he needs more <br/>\nthan he&#39;s getting and needs more than you think he does. If he needed <br/>\nto read everyday would you qualify them?<br/>\n   <br/>\n  This comment made me realize that his social needs are the same as needing or wanting to read or playing video games. He needs this something to engage his mind and personality. I want to give this to him! I capitalized &quot;everyday&quot; because it&#39;s just not going to work out for us to have him be able to play with friends this often. Unfortunately, he only has a couple friends right now and they are in school. So everyday doesn&#39;t work out for them. I&#39;ve tried meeting homeschoolers in my area and as we were just starting out I lost my vehicle so transporting the kids became harder. Our neighborhood doesn&#39;t have younger kids around so that&#39;s been a bit difficult. I mentioned our move because we&#39;re leaving for a completely different part of the state in 2 weeks and I just feel like we&#39;re really in a lull social wise and recreational wise for our whole family. I really want them to have lots of friends and take karate and go to the parks and pools and just have free and fun time<br/>\n and for them to be getting their needs met! I feel that once we move we&#39;ll have access to these things more than we do now.   <br/>\n<br/>\nYou need to find ways for him to interact more with other kids or <br/>\nyou&#39;ll be keeping him home against his will and that&#39;s just as bad as <br/>\nsending him to school against his will.<br/>\n   <br/>\n  I agree!<br/>\n<br/>\nI don&#39;t have any suggestions for the move -- I know, not helpful but <br/>\nI trust others will be! -- but the kids are reacting completely <br/>\nnormally to not getting their needs met. They *aren&#39;t* trying to make <br/>\nyou&#39;re life more miserable! (Though I know it can feel like that!) <br/>\n   <br/>\n  I guess it seems that way from my post but I never feel that they&#39;re trying to make my life miserable! Their behavior irritates me sometimes just as I&#39;m sure mine irritates them, I have my bad moments, but I am trying to work on me. I&#39;m not deliberately trying to keep them from having their needs met but I do want advice.<br/>\n<br/>\n  The more you can shift from them irritating you deliberately to using <br/>\nwhat tools they have to get their needs met, the easier it will be to <br/>\ndig deeper and find patience for them.<br/>\n   <br/>\n  Thank you for your opinions, Joyce<br/>\n   <br/>\n  Meliss<br/>\n  <br/>\n<br/>\n<br/>\n       <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":326163661,"authorName":"Mamachaos","from":"&quot;Mamachaos&quot; &lt;mamachaos@...&gt;","profile":"ron_monach","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:Frustrated Boys","postDate":"1210862576","msgId":32860,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzEwMWM4YjY5OSRmNzkxZDQwMCQ0NDAxYThjMEByb251MmZpczR0OHNrOD4="},"prevInTopic":32847,"nextInTopic":32864,"prevInTime":32859,"nextInTime":32861,"topicId":32828,"numMessagesInTopic":0,"msgSnippet":"As far as moving........we are seasoned pros.  Not that I am happy about that, but we have packed and unpacked maybe 12 times since my 1st son was born 13","messageBody":"<div id=\"ygrps-yiv-1632777119\">As far as moving........we are seasoned pros.  Not that I am happy about that, but we have packed and unpacked maybe 12 times since my 1st son was born 13 years ago.  Always for necessity or a really good reason.....but they are still moves and upsetting for the kids.<br/>\n<br/>\nHonor that your kids are feeling unsettled.  Remember that they are not packing, they probably aren&#39;t the ones who decided 100% to make the move etc.  They are feeling out of control, and don&#39;t know how to verbalize these feelings much less redirect their behavior so that it smooths them out.  They are relying on almost instinctual patterns, behaviors etc because they feel safe and at home with them. <br/>\n<br/>\nThis is not bad.  It is though, something you need to focus on, as you already know!  First thing......your kids are great ages for packing!  Have them &quot;design&quot; each box with markers for you, maybe even setting them up in some order that makes a story of somekind, like a comic strip.......let them figure that out.  I would just start by giving each kiddo their own box to marker on--maybe they recreate their video game characters, maybe they play big tic-tac-toe, whatever makes them happy!  If there are big boxes you can find at stores to bring home, let them tape them up and create a jail or a spaceship, or a store they can drag to the curb and sell unwanted matchbox cars from for 5 cents.  Let them help you wrap things in paper........reminding them that it will be like a treasure hunt when you get to your new house, and tell them it will be interesting to see if any of you will be able to remember what IS in there.<br/>\n<br/>\nInvite friends over everyday.  It will entertain them, allow you to do what you need to do, and kids love a mess!  They will be in hog heaven with toys and paper strewn all about!  The friends are really important even though they will essentially be losing them, their need to be attached to them at this point is big, (from our experience).  In fact, all of this is from our experience--I have 3 boys now and have moved at about every varied ages there are.  And it has always been hard, and especially when I am stressed anyway!  It is harder to be creative, patient and all things &quot;mom&quot; when you are peaking out yourself with stress and perhaps worry and anxiety into the mix about moving.  I don&#39;t know the situation, but if there is a worry or a big unknown about moving, the kids pick up on this as well, which adds to their need to be GIVEN more........more time with you, more patience, more friends, more attention, more hugs.<br/>\n<br/>\nDo you have a friend that might come and pack or play with the kids to break things up a little bit for you and them?  How about a relative?  An older kid on the block you could pay to watch them bounce and could get little snacks for them for a few hours?  Can you run the hose and let them really get crazy outside for awhile?  Anything that really gets some of their energy moving?  Could you get some rolls of paper and let them make their idea of a map of your upcoming trip?  A map of the neighborhood you live in to take with them?  something like this......creativity but with freedom and purpose sometimes helps us with these huge transitions.  And if they are feeling stressed, sad, anxious....these things might help. <br/>\n<br/>\nAs to the rest of your questions, you have already gotten great advice........ditto here.  Hang in there.  Try to balance a bit, because at the other end of the move--which actually might be the harder end for the kids, you still have a lot of work to do.....UNpacking, organizing, cleaning, etc!  And that turns into a few MONTHS of this stuff for the kids.  That is the hardest part.  Take 1 full day during the week to leave and walk somewhere.  A treaure hunt for momentos from your neighborhood.  Flowers they can press, rocks, acorns, take a camara and have them take pictures of various houses where you knew people, and then you all can make an album of &quot;_________town, CA&quot;   Being w/out your car is awful, but maybe there are a few things you can find to do locally.  <br/>\n<br/>\nGood luck, my heart goes out to you---feels all to familiar!!  <br/>\nKelley<br/>\nI <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandandstardust.blogspot.com/\">http://sandandstardust.blogspot.com/</a><br/>\n<br/>\n&quot;Childhood is a journey, not a race.&quot;<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":326163661,"authorName":"Mamachaos","from":"&quot;Mamachaos&quot; &lt;mamachaos@...&gt;","profile":"ron_monach","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:Frustrated Boys","postDate":"1210862576","msgId":32871,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWM4YjY5ZCRhOThiMmI5MCQ0NDAxYThjMEByb251MmZpczR0OHNrOD4="},"prevInTopic":32864,"nextInTopic":32872,"prevInTime":32870,"nextInTime":32872,"topicId":32828,"numMessagesInTopic":0,"msgSnippet":"As far as moving........we are seasoned pros.  Not that I am happy about that, but we have packed and unpacked maybe 12 times since my 1st son was born 13","messageBody":"<div id=\"ygrps-yiv-1277768304\">As far as moving........we are seasoned pros.  Not that I am happy about that, but we have packed and unpacked maybe 12 times since my 1st son was born 13 years ago.  Always for necessity or a really good reason.....but they are still moves and upsetting for the kids.<br/>\n<br/>\nHonor that your kids are feeling unsettled.  Remember that they are not packing, they probably aren&#39;t the ones who decided 100% to make the move etc.  They are feeling out of control, and don&#39;t know how to verbalize these feelings much less redirect their behavior so that it smooths them out.  They are relying on almost instinctual patterns, behaviors etc because they feel safe and at home with them. <br/>\n<br/>\nThis is not bad.  It is though, something you need to focus on, as you already know!  First thing......your kids are great ages for packing!  Have them &quot;design&quot; each box with markers for you, maybe even setting them up in some order that makes a story of somekind, like a comic strip.......let them figure that out.  I would just start by giving each kiddo their own box to marker on--maybe they recreate their video game characters, maybe they play big tic-tac-toe, whatever makes them happy!  If there are big boxes you can find at stores to bring home, let them tape them up and create a jail or a spaceship, or a store they can drag to the curb and sell unwanted matchbox cars from for 5 cents.  Let them help you wrap things in paper........reminding them that it will be like a treasure hunt when you get to your new house, and tell them it will be interesting to see if any of you will be able to remember what IS in there.<br/>\n<br/>\nInvite friends over everyday.  It will entertain them, allow you to do what you need to do, and kids love a mess!  They will be in hog heaven with toys and paper strewn all about!  The friends are really important even though they will essentially be losing them, their need to be attached to them at this point is big, (from our experience).  In fact, all of this is from our experience--I have 3 boys now and have moved at about every varied ages there are.  And it has always been hard, and especially when I am stressed anyway!  It is harder to be creative, patient and all things &quot;mom&quot; when you are peaking out yourself with stress and perhaps worry and anxiety into the mix about moving.  I don&#39;t know the situation, but if there is a worry or a big unknown about moving, the kids pick up on this as well, which adds to their need to be GIVEN more........more time with you, more patience, more friends, more attention, more hugs.<br/>\n<br/>\nDo you have a friend that might come and pack or play with the kids to break things up a little bit for you and them?  How about a relative?  An older kid on the block you could pay to watch them bounce and could get little snacks for them for a few hours?  Can you run the hose and let them really get crazy outside for awhile?  Anything that really gets some of their energy moving?  Could you get some rolls of paper and let them make their idea of a map of your upcoming trip?  A map of the neighborhood you live in to take with them?  something like this......creativity but with freedom and purpose sometimes helps us with these huge transitions.  And if they are feeling stressed, sad, anxious....these things might help. <br/>\n<br/>\nAs to the rest of your questions, you have already gotten great advice........ditto here.  Hang in there.  Try to balance a bit, because at the other end of the move--which actually might be the harder end for the kids, you still have a lot of work to do.....UNpacking, organizing, cleaning, etc!  And that turns into a few MONTHS of this stuff for the kids.  That is the hardest part.  Take 1 full day during the week to leave and walk somewhere.  A treaure hunt for momentos from your neighborhood.  Flowers they can press, rocks, acorns, take a camara and have them take pictures of various houses where you knew people, and then you all can make an album of &quot;_________town, CA&quot;   Being w/out your car is awful, but maybe there are a few things you can find to do locally.  <br/>\n<br/>\nGood luck, my heart goes out to you---feels all to familiar!!  <br/>\nKelley<br/>\nI <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandandstardust.blogspot.com/\">http://sandandstardust.blogspot.com/</a><br/>\n<br/>\n&quot;Childhood is a journey, not a race.&quot;<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":241586873,"authorName":"barefootmamax4","from":"&quot;barefootmamax4&quot; &lt;barefootmamax4@...&gt;","profile":"barefootmamax4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Frustrated Boys","postDate":"1210858695","msgId":32847,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwaGVjNytpYmIwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGcwZjRhcCszMm02QGVHcm91cHMuY29tPg=="},"prevInTopic":32843,"nextInTopic":32860,"prevInTime":32846,"nextInTime":32848,"topicId":32828,"numMessagesInTopic":0,"msgSnippet":"... When I see my kids getting frustrated with a game I ask then if they are still having a good time. This works for 2 of my kids. They both get the cue and","messageBody":"<div id=\"ygrps-yiv-1964352857\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Melissa Bell&quot; <br/>\n&lt;miceszb6@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt; <br/>\n&gt; My boys, almost 9 and almost 8 are having frustration issues. They <br/>\n&gt; love video games but their behavior is worse when they play them. <br/>\n&gt; Screaming, crying, and fighting are &quot;normal&quot; occurences throughout <br/>\n&gt; the day, everyday. <br/>\n<br/>\n </span></blockquote>When I see my kids getting frustrated with a game I ask then if they <br/>\nare still having a good time. This works for 2 of my kids. They both <br/>\nget the cue and realize that they are not having a good time. Someone <br/>\non this list suggested to me a while back to say something along <br/>\nthose lines when 11yr old DS was playing even when he was tired at <br/>\nnight. I have one kid that this does not work with. Despite being <br/>\nobviously frutrated and not enjoying himself he will not let it go. I <br/>\nhave no advice for that, because we are still working on it. I have <br/>\nhad a lot of conflict with this one kid,as he has a really intense <br/>\nnature. What has helped alot is reading &quot;The Explosive <br/>\nChild&quot;,discussing actual situations on this list and a few others. <br/>\nSeeing him as frustrated  and needing love ,not hostile and agressive <br/>\nhelps alot. I have been working hard for a month or so to reallly get <br/>\nhim to talk to me without much luck,but yesterday I saw a more happy <br/>\nand peaceful kid emerge. <br/>\n<br/>\nI have been working on a lot of one on one time with him while the <br/>\nother kids are at playdates or classes. I make it HIS day and really, <br/>\nreally connect with him. Yesterday we went shopping and bought a <br/>\ncivil war replica gun he has been saving for. (He loves history.) We <br/>\nplayed guns in the park, and talked about what video games he has the <br/>\nbest skills at playing. Last night he was such a happy kid! I saw him <br/>\nhandle things that ordinarily would have sent him off into a rage . <br/>\nHe was empathetic to his siblings and helped THEM solve conflicts! <br/>\n<br/>\nBased on the experience I have just had,  you could try separarating <br/>\nthe two boys with things that they both find fun,like sending one to <br/>\na friend&#39;s house while the other gets time with you.They may be <br/>\ninclined to fight less and since they are more connected with you <br/>\nthey might respect your words more.<br/>\n<br/>\nI am also finding out that there is a big difference between being <br/>\nrespectful to a childs needs and being totally permissive.(that&#39;s <br/>\nme,too permissive)  It is hard for me, and I&#39;m sure others because we <br/>\nwere raised in a way of rules,limits and punishments. It&#39;s hard to <br/>\nsee it any other way except complete limitless freedom and non-<br/>\ncoercion. There is a way to be respectful but not let kids trample on <br/>\nothers rights too. I&#39;m learning that now!<br/>\n-Kelly</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Frustrated Boys","postDate":"1210848234","msgId":32843,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDMDRBMzhGLTA4REMtNENCMy1BRTRFLUJBNjlFRjk0QTM5MEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGcwZjRhcCszMm02QGVHcm91cHMuY29tPg==","referencesHeader":"PGcwZjRhcCszMm02QGVHcm91cHMuY29tPg=="},"prevInTopic":32828,"nextInTopic":32847,"prevInTime":32842,"nextInTime":32844,"topicId":32828,"numMessagesInTopic":0,"msgSnippet":"... I think it will help if you change your point of view from controlling their behavior to helping them. They don t get greater privileges just because their","messageBody":"<div id=\"ygrps-yiv-864271410\">On May 14, 2008, at 12:34 PM, Melissa Bell wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Yesterday morning (early) the boys<br/>\n&gt; were up and their sisters and dad were still sleeping. They yelled<br/>\n&gt; and fought for 40 min straight before I ended up wordlessly ...  <br/>\n&gt; unplugging<br/>\n&gt; the game system and putting it in my room.<br/>\n<br/>\n </span></blockquote>I think it will help if you change your point of view from  <br/>\ncontrolling their behavior to helping them.<br/>\n<br/>\nThey don&#39;t get greater privileges just because their kids. Their dad  <br/>\ndoesn&#39;t have a right to blast the ball game while they&#39;re trying to  <br/>\nsleep. Being up means being respectful of those who are still asleep.<br/>\n<br/>\nBe on their team. Let them know that you want to help *everyone* get  <br/>\ntheir needs met. They *do* understand the concept of playing within  <br/>\nlimitations. ;-) That&#39;s what games are based around! Work *with* them.<br/>\n<br/>\n&quot;You need to be quiet&quot; means something totally different to a child  <br/>\nwho feels respected than to a child who grows up with rules. To the  <br/>\nrespected child it means they&#39;re hurting others and they don&#39;t want  <br/>\nto do that. To a rule based child it means they&#39;re going to be  <br/>\npunished. Since the rule based child is already fighting hard to get  <br/>\nwhat they want, often battling others in the family, hurting someone  <br/>\ncan often come to mean little.<br/>\n<br/>\nPart of it *is* probably deschooling if they feel they can run  <br/>\nroughshod over other&#39;s feeling to get what they want. That comes from  <br/>\nexperiencing *their* feelings getting run roughshod over so other  <br/>\npeople can get what they want. (One biggie was obviously being sent  <br/>\nto school when they didn&#39;t want to go.)<br/>\n<br/>\nBut even that doesn&#39;t give them greater privileges. It might help you  <br/>\nshift your point of view to help you find solutions, though.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He&#39;s &quot;bored&quot; and asks for friends to come over<br/>\n&gt; EVERYDAY.<br/>\n<br/>\n </span></blockquote>I wouldn&#39;t put bored in quotes nor capitalize everyday. Those are  <br/>\nreal needs. He&#39;s obviously a very social person and he needs more  <br/>\nthan he&#39;s getting and needs more than you think he does. If he needed  <br/>\nto read everyday would you qualify them?<br/>\n<br/>\nYou need to find ways for him to interact more with other kids or  <br/>\nyou&#39;ll be keeping him home against his will and that&#39;s just as bad as  <br/>\nsending him to school against his will.<br/>\n<br/>\nI don&#39;t have any suggestions for the move -- I know, not helpful but  <br/>\nI trust others will be! -- but the kids are reacting completely  <br/>\nnormally to not getting their needs met. They *aren&#39;t* trying to make  <br/>\nyou&#39;re life more miserable! (Though I know it can feel like that!)  <br/>\nThe more you can shift from them irritating you deliberately to using  <br/>\nwhat tools they have to get their needs met, the easier it will be to  <br/>\ndig deeper and find patience for them.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":321882775,"authorName":"Melissa Bell","from":"&quot;Melissa Bell&quot; &lt;miceszb6@...&gt;","profile":"miceszb6","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Frustrated Boys","postDate":"1210782873","msgId":32828,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwZjRhcCszMm02QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":32843,"prevInTime":32827,"nextInTime":32829,"topicId":32828,"numMessagesInTopic":0,"msgSnippet":"Hi, This is going to be long but I need some advice. My boys, almost 9 and almost 8 are having frustration issues. They love video games but their behavior is","messageBody":"<div id=\"ygrps-yiv-1057872314\">Hi,<br/>\nThis is going to be long but I need some advice.<br/>\n<br/>\nMy boys, almost 9 and almost 8 are having frustration issues. They <br/>\nlove video games but their behavior is worse when they play them. <br/>\nScreaming, crying, and fighting are &quot;normal&quot; occurences throughout <br/>\nthe day, everyday. I haven&#39;t figured out how to turn myself off to <br/>\nthis and it&#39;s driving me nuts. Yesterday morning (early) the boys <br/>\nwere up and their sisters and dad were still sleeping. They yelled <br/>\nand fought for 40 min straight before I ended up wordlessly [I didn&#39;t <br/>\nwant to say anything crazy, I&#39;m not a good morning person and waking <br/>\nup to screaming over whose turn it is makes me angry!!] unplugging <br/>\nthe game system and putting it in my room. I talked with them about <br/>\nit later on when I was calmer. I don&#39;t feel that the video games are <br/>\nthe problem. Their behavior is defenitely worse when they play them <br/>\nthough. <br/>\n<br/>\nWhat can I do or say to help them through their issues? How do I help <br/>\nthem to communicate? I can&#39;t just leave them alone, I&#39;ve tried and <br/>\nthis has been going on for months. I pulled them out of ps towards <br/>\nthe end of 07&#39; (actually June but then they started a charter in Sep <br/>\nand did that for two months which made the situation worse) so do you <br/>\nthink they&#39;re still deschooling? Also, our almost 8 yo has been <br/>\nconsistently asking to go back to school!! He misses recess and <br/>\nseeing kids everyday. When we&#39;re at home he doesn&#39;t like to relax and <br/>\nget imaginative. He&#39;s &quot;bored&quot; and asks for friends to come over <br/>\nEVERYDAY. They do have a couple friends but don&#39;t play everyday. <br/>\nTheir friends also go to school and so we have to work around this. <br/>\nAnd then to add more salt to the wound, I&#39;ve recently lost my vehicle <br/>\nso we&#39;re more homebound AND we&#39;re moving from Northern Cal to <br/>\nSouthern Cal in a couple of weeks so the kids haven&#39;t had any extra <br/>\nactivities outside the home. I know it&#39;s critical to get <br/>\nhomeschoolers/unschoolers out into the world and meet people, see <br/>\nthings, take trips, etc. But what do we do when there&#39;s down time?!! <br/>\nIs there anything I can/should say or do to make this moving and slow <br/>\nperiod easier on them? Cause right now I&#39;m just sorting and packing <br/>\nand cleaning and our 4 kids (8,7,4,2) are pretty much on their own. <br/>\nPlaying games,jumping on the trampoline, watching videos and TV, <br/>\ndrawing/coloring, stuff like this. But none are reading yet so no <br/>\ngetting lost in a book (I like to do this). The oldest knows how to <br/>\nread but chooses not to get into books on his own.<br/>\n<br/>\nI&#39;m running out of ideas, especially while packing up their toys and <br/>\ngames and such. I don&#39;t know what to do to let them know how to have <br/>\nmore fun. I keep thinking if they get bored enough they&#39;ll eventually <br/>\nfind things to do and that their mentality has to do with being <br/>\nschooled their whole life (mine too) and they&#39;re still not used to <br/>\nnot having someone tell them what to do when. What do you think?<br/>\n<br/>\nMeliss</div>","specialLinks":[]}],"prevTopicId":32962,"nextTopicId":33015}}