{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] more about control...","postDate":"1137848380","msgId":9438,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZFMUE5ODNELTlDM0UtNDIzMi1BOURDLTJDRTAyNTRCODA3QkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAxMjAyMDA2MjIyOC4xNTg4OC40M0QxNjNGMzAwMDg3QTE0MDAwMDNFMTAyMjAwNzUwNzQ0MEUwMzAzMDEwMzAyMEE5NkBjb21jYXN0Lm5ldD4=","referencesHeader":"PDAxMjAyMDA2MjIyOC4xNTg4OC40M0QxNjNGMzAwMDg3QTE0MDAwMDNFMTAyMjAwNzUwNzQ0MEUwMzAzMDEwMzAyMEE5NkBjb21jYXN0Lm5ldD4="},"prevInTopic":9397,"nextInTopic":0,"prevInTime":9437,"nextInTime":9439,"topicId":9356,"numMessagesInTopic":0,"msgSnippet":"... And by noticing you may want to focus on what he s done for you rather than letting him know you noticed he s helping. The first will let him know he s","messageBody":"<div id=\"ygrps-yiv-587856520\">On Jan 20, 2006, at 5:28 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:zenmomma@...\">zenmomma@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; just notice when he offers to help bring in the groceries, or watch  <br/>\n&gt; the little one while you shower, or clear off the table before dinner.<br/>\n<br/>\n </span></blockquote>And by noticing you may want to focus on what he&#39;s done for you  <br/>\nrather than letting him know you noticed he&#39;s helping. The first will  <br/>\nlet him know he&#39;s valued. The second sends a message that he&#39;s  <br/>\nfinally doing what you&#39;d like him to do -- and the result is he may  <br/>\nback off.<br/>\n<br/>\nSay &quot;Thank you. That helped me out a lot,&quot; rather than &quot;I noticed  <br/>\nthat you did such and such. Thank you.&quot;<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jan 20, 2006, at 1:21 PM, Christy Putnam wrote:<br/>\n&gt; how do I let go and<br/>\n&gt; trust while there are still &#39;things&#39; Seth is responsible for doing  <br/>\n&gt; each<br/>\n&gt; day/week?<br/>\n<br/>\nI read through the whole list of expectations and frankly it made me  <br/>\nexhausted! Both for him and for you. For him not because the list is  <br/>\nso difficult but because it&#39;s someone else&#39;s expectations of what he  <br/>\nshould be doing with his time. For you because you need to keep on  <br/>\ntop of him to make sure he does it. I know if I&#39;ve delegated parts of  <br/>\nsome task to my daughter to do sometime during the day, ideally I  <br/>\nwant to hand it over so I can mentally check it off my list. In  <br/>\nreality it expands so that the item pops up every half hour or so as  <br/>\nI check to see if I can get it off my list or not.<br/>\n<br/>\nI&#39;d say do it yourself. Invite him along. Ask if he&#39;d like to keep  <br/>\nyou company so you can talk about stuff while you do something. But  <br/>\nhonestly I wouldn&#39;t expect him to jump up and start pitching in. He  <br/>\nneeds to time to be free of being told what to do before he can feel  <br/>\nfree to lend a hand because he wants to. Right now if he hears an  <br/>\nhonest question like &quot;Would you mind doing x?&quot; where his answer of no  <br/>\nis as acceptable as yes, he&#39;s not going to hear it as a question but  <br/>\nas a supposedly polite way of saying: &quot;Do x.&quot;<br/>\n<br/>\nThere&#39;s lots of collected questions and answers about chores at my  <br/>\nwebsite: <a rel=\"nofollow\" target=\"_blank\" href=\"http://home.earthlink.net/~fetteroll/rejoycing/\">http://home.earthlink.net/~fetteroll/rejoycing/</a><br/>\n<br/>\n&gt; My questions regarding this age and<br/>\n&gt; starting the &#39;let go and trust&#39; thing is how do you establish  <br/>\n&gt; respect for<br/>\n&gt; others when the world centers around them?  How do you &quot;teach&quot; that  <br/>\n&gt; they<br/>\n&gt; will not always get what they want when they want it (toys, etc)  <br/>\n&gt; and that it<br/>\n&gt; is okay?  How do you get anything done (run errands, etc) when they  <br/>\n&gt; can only<br/>\n&gt; sleep in their beds, on you, etc?<br/>\n<br/>\nI think I would stop focusing on why you think he&#39;s so demanding. It  <br/>\ncould very well be it&#39;s an inherent part of his personality and he  <br/>\nwould have been that way even if he&#39;d breastfed.<br/>\n<br/>\nSo instead of focusing on changing him, focus on helping him. (That  <br/>\nmay not make sense now, but it will later.) He needs to know your his  <br/>\npartner in his dealing with the world. Calmly accept that he may feel  <br/>\nneeds stronger than other kids and help him be happy. (He won&#39;t be  <br/>\nhappy always. But  helping figure out pathways to help himself get to  <br/>\nhappiness. Again, that probably won&#39;t make sense yet!)<br/>\n<br/>\nHe&#39;s too young for you to expect him to see the needs of others as  <br/>\nmore important than his. He will learn because he&#39;ll mature and his  <br/>\nneeds will change and because all of life won&#39;t respond to him  <br/>\nimmediately.<br/>\n<br/>\nTo get there, when you can&#39;t respond immediately -- like if you&#39;re  <br/>\ngoing to the bathroom! -- be honest that you can&#39;t get there right  <br/>\naway but then *do* respond as soon as you can. Help him build a sense  <br/>\nof trust that his needs are at the top of your priority list and that  <br/>\nyou will help him as soon as humanly possible.<br/>\n<br/>\nI know I sometimes get into a mode where it seems like it&#39;s my job to  <br/>\ndo everything and why can&#39;t my daughter understand that she shouldn&#39;t  <br/>\nbe dumping another thing on top of a burden that&#39;s already too  large  <br/>\nand I get frustrated with her. Don&#39;t do that ;-) Accept that  <br/>\nsometimes things pile up and all we can do is tackle things as best  <br/>\nwe can. Be honest that you&#39;ll be there when you can *and then be  <br/>\nthere when you can*.<br/>\n<br/>\nJoyce<br/>\nAnswers to common unschooling questions:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://home.earthlink.net/~fetteroll/rejoycing/\">http://home.earthlink.net/~fetteroll/rejoycing/</a><br/>\nBlog of writing prompts for speculative fiction writers:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://dragonwritingprompts.blogsome.com/\">http://dragonwritingprompts.blogsome.com/</a><br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":218449772,"authorName":"zenmomma@comcast.net","from":"zenmomma@...","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] more about control...","postDate":"1137796083","msgId":9397,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMjAyMDA2MjIyOC4xNTg4OC40M0QxNjNGMzAwMDg3QTE0MDAwMDNFMTAyMjAwNzUwNzQ0MEUwMzAzMDEwMzAyMEE5NkBjb21jYXN0Lm5ldD4="},"prevInTopic":9385,"nextInTopic":9438,"prevInTime":9396,"nextInTime":9398,"topicId":9356,"numMessagesInTopic":0,"msgSnippet":"... years of parenting. You ve got to let that go. Dwelling in past hurts won t help you move forward NOW. Start right now to make better choices each and","messageBody":"<div id=\"ygrps-yiv-1192435770\"><blockquote><span title=\"ireply\">&gt;&gt;I have to admit that I have never regretted more in my life than the last 11<br/>\n </span></blockquote>years of parenting.&gt;&gt;<br/>\n<br/>\nYou&#39;ve got to let that go. Dwelling in past hurts won&#39;t help you move forward NOW. Start right now to make better choices each and every day when it comes to parenting. Don&#39;t have regrets, make it better. Be the mom your kids deserve. Have the family you&#39;ve always wanted. :o)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;As I asked, how do I re-do 11 years and start over?&gt;&gt;<br/>\n<br/>\n </span></blockquote>Slowly, one choice at a time. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;So are we supposed to just let him go and not require that he continue on with his regular responsibilities and us do them instead? &gt;&gt;<br/>\n<br/>\n </span></blockquote>I would start by not sweating the &quot;chores&quot; so much. Maybe do them together or pitch in when he&#39;s really not feeling like helping out. Say yes more often and nag less. See if he&#39;ll help you do other stuff instead. Not as a chore, but just notice when he offers to help bring in the groceries, or watch the little one while you shower, or clear off the table before dinner. Whatever it is. Take notice  of his participation in family rituals. Give him some space and see if you can build a relationship that&#39;s not built on you nagging and reminding him of what he should be doing. Notice what he is doing and build on that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;If so how do we get him to bathe<br/>\n </span></blockquote>and brush his teeth each day (a struggle at *all* times)...or do we just<br/>\ndeal with the stink of him not bathing and cost of dental work?&gt;&gt;<br/>\n<br/>\nI know it seems logical that if a kid doesn&#39;t bathe they&#39;ll stink and if they don&#39;t brush twice a day they&#39;ll get many cavities. But is this really the truth? My kids are both in the hormonal changes of puberty and missing showers or baths still does not  result in them stinking. it has more to do with their hair getting oily and messy than anything else. Both have the choice to shower or not. Both have gone through non-showering times, but on the whole each prefers to be clean and presentable.<br/>\n<br/>\nAnd of course there are lots of ways to invite a child to shower or brush teeth without forcing it. Fun toothpaste, a new electric toothbrush, foaming bath gel, etc. have all worked around here. And my kids have had 4 cavities total between the two of them. It didn&#39;t seem to be connected to their teeth brushing habits at all either. Each of the  just seemed to get a cavity or 2 as puberty started.<br/>\n<br/>\n<br/>\n--<br/>\n~Mary, unschooling mom to Conor (16) and Casey (11)<br/>\n<br/>\n&quot;Just today I&#39;m going to be utterly present for my children, I&#39;m going to be in their world (not just doing my own thing while they do theirs), I&#39;m going to really hear them, I&#39;m going to prepare myself to be present starting right now.&quot;<br/>\n                            ~Ren Allen<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] more about control...","postDate":"1137791498","msgId":9385,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDN0VDMUQzQzdFMzlCMC04RTgtMjlCNzlARldNLU0xNS5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PDAwNmIwMWM2MWRlZSQ0ZmJkODQ0MCQ2NDAxYThjMEB0aWJlcml1bT4=","referencesHeader":"PDAwNmIwMWM2MWRlZSQ0ZmJkODQ0MCQ2NDAxYThjMEB0aWJlcml1bT4="},"prevInTopic":9356,"nextInTopic":9397,"prevInTime":9384,"nextInTime":9386,"topicId":9356,"numMessagesInTopic":0,"msgSnippet":"... From: Christy Putnam personal_balance@cox.net I know the saying goes, we do the best we have with what we ve got and now that we know better we can do","messageBody":"<div id=\"ygrps-yiv-422160661\">-----Original Message-----<br/>\nFrom: Christy Putnam <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:personal_balance@...\">personal_balance@...</a><br/>\n <br/>\n  I know the saying goes, we do the best we have with what we&#39;ve got and now that we know better we can do better but still, how does one un-do 11 years and start over?  <br/>\n-=-=-=-<br/>\n <br/>\nApologize. Mean it. Promise to do better. DO it.<br/>\n <br/>\nI&#39;ll get back to the rest later. I&#39;m slammed.<br/>\n <br/>\n <br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223344266,"authorName":"Christy Putnam","from":"&quot;Christy Putnam&quot; &lt;personal_balance@...&gt;","profile":"personal_balance","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"more about control...","postDate":"1137781280","msgId":9356,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNmIwMWM2MWRlZSQ0ZmJkODQ0MCQ2NDAxYThjMEB0aWJlcml1bT4="},"prevInTopic":0,"nextInTopic":9385,"prevInTime":9355,"nextInTime":9357,"topicId":9356,"numMessagesInTopic":0,"msgSnippet":"I have really been learning a lot by reading everyone s posts and I even have saved some sites on my favorites to return to and order books as money allows (I","messageBody":"<div id=\"ygrps-yiv-525057821\">I have really been learning a lot by reading everyone&#39;s posts and I even<br/>\nhave saved some sites on my favorites to return to and order books as money<br/>\nallows (I looked them up at library and they don&#39;t have them...).  Thank you<br/>\nso much for being open to my ignorance :)  <br/>\n <br/>\nI have to admit that I have never regretted more in my life than the last 11<br/>\nyears of parenting.  Don&#39;t get me wrong, I don&#39;t regret being a parent at<br/>\nall, just the way I have parented.  I am sure some of you kwim.  I know the<br/>\nsaying goes, we do the best we have with what we&#39;ve got and now that we know<br/>\nbetter we can do better but still, how does one un-do 11 years and start<br/>\nover?  I am not as self-less as some of the people I have seen post about<br/>\nhow they do sleep patterns or even adjust their days.  I am a person that<br/>\nhas to have some kind of order to the day, some kind of rhythm.  I have so<br/>\nmany things that need to get completed (or started) each day and of course I<br/>\nneed my sleep that to be random and uberflexible would be<br/>\ncounterproductive...add to that the many other dynamics of our household (I<br/>\nstarted to list but it seems too long).  <br/>\n <br/>\nBasically, my goal is to have a balance of everyone&#39;s (including parents)<br/>\nneeds/wants being met while guiding my children into respectful, responsible<br/>\nadults one day.  I know some of it is a matter of letting go and trusting<br/>\nwhich is something my dh and I have issues with that we are working on but<br/>\nit is hard to reprogram 30+ years of &#39;habit&#39;  <br/>\n <br/>\nRegarding my oldest:<br/>\nAs I asked, how do I re-do 11 years and start over?  how do I let go and<br/>\ntrust while there are still &#39;things&#39; Seth is responsible for doing each<br/>\nday/week?  to be more specific on some &quot;things&quot;: Twice a day he is supposed<br/>\nto feed the animals (1 dog and 1 cat) and give them fresh water.  Twice a<br/>\nday he is supposed to brush his teeth.  Once a day he is supposed to take a<br/>\nshower and clean himself. Since we are living with my FIL space is limited<br/>\nand we have to put our &#39;office&#39; in Seth&#39;s room and since it is so very<br/>\nsmall, the mess spills over into the office area and really gets to me so he<br/>\nis supposed to tidy his room each day. Twice a week he is supposed to gather<br/>\nthe trash and take it out to the curb for pick-up.  So are we supposed to<br/>\njust let him go and not require that he continue on with his regular<br/>\nresponsibilities and us do them instead?  If so how do we get him to bathe<br/>\nand brush his teeth each day (a struggle at *all* times)...or do we just<br/>\ndeal with the stink of him not bathing and cost of dental work?  I do not<br/>\nthink it too much to ask for him to go to bed at a reasonable time so that<br/>\nwe as parents have some down time before going to bed ourselves...to me that<br/>\nis part of the balance I am striving for.  So...how do I start, right now,<br/>\nimplementing this new way of life?  Do we sit down and talk about it?  Do we<br/>\njust stop asking him to do things or reminding him to do the task and if he<br/>\ndoesn&#39;t do it, us just do it?  Do we just allow him to sit around and eat<br/>\nall day even though we aren&#39;t the ones who buy a majority of the food?<br/>\n <br/>\nRegarding my youngest:<br/>\nPoor Aden (1) had a pretty rough start and nothing went as I planned except<br/>\nhaving an amazing homebirth and being able to stay home with him.  I wasn&#39;t<br/>\nable to breastfeed and while trying to get that started and/or figure out<br/>\nwhy I couldn&#39;t we were spending so much time trying things that we didn&#39;t<br/>\nget a chance to learn his cues of sleepy, hungry, etc.  So since I had to go<br/>\nto bottle feeding anyway, we started feeding by the clock (he had to gain<br/>\nweight fast) instead of on demand like I wanted.  Long story short, the<br/>\nreason his sleeping has been an issue is that because he was hungry all the<br/>\ntime (and I didn&#39;t know it or we were trying different attachment<br/>\ntechniques) he cried all the time and didn&#39;t sleep very well.  With sign<br/>\nlanguage and kinda knowing how long it has been since he last ate, I am<br/>\nlearning when he wants to sleep.  My questions regarding this age and<br/>\nstarting the &#39;let go and trust&#39; thing is how do you establish respect for<br/>\nothers when the world centers around them?  How do you &quot;teach&quot; that they<br/>\nwill not always get what they want when they want it (toys, etc) and that it<br/>\nis okay?  How do you get anything done (run errands, etc) when they can only<br/>\nsleep in their beds, on you, etc?<br/>\n <br/>\nOkay I think I have taken enough time right now.  I look forward to your<br/>\nwords of wisdom :)<br/>\n <br/>\nIn Gratitude,<br/>\n <br/>\n <br/>\nChristy Putnam<br/>\n &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://blog.myspace.com/personal_balance\">http://blog.myspace.com/personal_balance</a>&gt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://blog.myspace.com/personal_balance\">http://blog.myspace.com/personal_balance</a><br/>\n<br/>\n<br/>\nIndependent Executive<br/>\nDiscover a way to increase<br/>\nyour health and/or income! &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://practicalsolution.info/\">http://practicalsolution.info/</a>&gt; <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://practicalsolution.info\">http://practicalsolution.info</a> <br/>\n<br/>\n <br/>\n<br/>\n&quot;Go confidently in the direction of your dreams.<br/>\nLive the life you have always imagined.&quot;<br/>\n- Henry David Thoreau<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":9432,"nextTopicId":9323}}