{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":205483142,"authorName":"Melissa","from":"Melissa &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: OT-having more kids","postDate":"1150985679","msgId":14862,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU0MTE5MTk1LTY2MTYtNDQ4Qi1BNzBDLUE0Mjk0NzE5RTQyMkBjb3gubmV0Pg==","inReplyToHeader":"PDAwMGEwMWM2OTU4OCQzNDQ4NmI1MCQ2YjAwYThjMEBNWUxBUFRPUD4=","referencesHeader":"PDAwMGEwMWM2OTU4OCQzNDQ4NmI1MCQ2YjAwYThjMEBNWUxBUFRPUD4="},"prevInTopic":14860,"nextInTopic":0,"prevInTime":14861,"nextInTime":14863,"topicId":14760,"numMessagesInTopic":0,"msgSnippet":"Yay! I like to read this one! I knew we should have moved to Australia! Seriously, I remember having just one, and it was very intensive, one- on-one all the","messageBody":"<div id=\"ygrps-yiv-2142233599\">Yay! I like to read this one! I knew we should have moved to Australia!<br/>\nSeriously, I remember having just one, and it was very intensive, one- <br/>\non-one all the time. When we had Breanna, it was also nice because it  <br/>\ngave my son a logical reason why mommy needed to not play right now,  <br/>\nand as she got older, she was a fun persona to be with. We never had  <br/>\nany of the anger and resentment that TV producers seem to stereotype,  <br/>\nin fact, we haven&#39;t seen that with any of our children.<br/>\n<br/>\nMelissa<br/>\nMom to Josh (11), Breanna (8), Emily (7), Rachel (6), Sam (4), Dan  <br/>\n(2), and Avari Rose<br/>\n<br/>\nshare our lives at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://360.yahoo.com/multimomma\">http://360.yahoo.com/multimomma</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jun 21, 2006, at 6:12 PM, Kerryn L Gutmanis wrote:<br/>\n&gt;<br/>\n&gt; A larger family is a great experience for parents and for children.  <br/>\n&gt; And in the context of unschooling, life becomes a smorgasbord of  <br/>\n&gt; options, different opinions, likes and dislikes, this list goes on.  <br/>\n&gt; I love it!<br/>\n&gt;<br/>\n&gt; Kerryn<br/>\n&gt; Australia<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":272280959,"authorName":"Kerryn L Gutmanis","from":"&quot;Kerryn L Gutmanis&quot; &lt;kezgutmanis@...&gt;","profile":"kgutty67","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: OT-having more kids","postDate":"1150931564","msgId":14860,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGEwMWM2OTU4OCQzNDQ4NmI1MCQ2YjAwYThjMEBNWUxBUFRPUD4="},"prevInTopic":14782,"nextInTopic":14862,"prevInTime":14859,"nextInTime":14861,"topicId":14760,"numMessagesInTopic":0,"msgSnippet":"Hi I d like to give a different slant on this topic.  We are a family of eight children, mum and dad.  (Dad is o/s at the moment until next Feb)  We ve always","messageBody":"<div id=\"ygrps-yiv-62456832\">Hi<br/>\n<br/>\nI&#39;d like to give a different slant on this topic.  We are a family of eight children, mum and dad.  (Dad is o/s at the moment until next Feb)  We&#39;ve always &#39;homeschooled&#39;, and been on the unschooling journey for the last 18 months.  I hope that I get the opportunity to have more children, and when I see my &#39;clock&#39; ticking I wonder if that will happen.<br/>\n<br/>\nI couldn&#39;t imagine &#39;doing&#39; this without any of my precious children.  The variety and diversity the children bring to the family is wonderful.  We don&#39;t satisfy everyone&#39;s immediate desires all the time, but whatever we do, everyone enjoys it for what it is.  Because I am alone much of the time (because of my dh&#39;s job), the children come with me pretty much everywhere.  My oldest is 14 and she participates in swordsmanship classes. We all go along to the park and watch a DVD, or play at the park, or walk down and get pizza while we are waiting.  <br/>\n<br/>\nYesterday we had to drive 350 kms to the city so my 13 yo can have her orthodontic appliance repaired.  Everyone was quite excited about staying at a friend&#39;s house, doing some organised events, and getting the chance to hit some big shops.  (Our friend has 8 children also) Yet another adventure.<br/>\n<br/>\nSo, I suppose I would encourage anyone who is considering building their family.  There are skills that the children have learnt simply by being in a larger family.  My older girls love babying the younger ones.  And all the children in our family have wholeheartedly welcomed each new addition to the family.  I still get to have some quiet time, often with the older ones sitting with me doing their own thing.  I don&#39;t look for &#39;away from the children&#39; time though.  I get to do stacks of sewing, walking, cooking, reading, and computer stuff.  We&#39;re all busy doing and being on our own, and with each other.<br/>\n<br/>\nMy dh and I have never planned when to bring a child into this world, whenever we find out we are expecting we are just so thankful and excited.  No, I don&#39;t have great pregnancies, no, my births are not anything extraordinary, and, in fact, I have borne 2 other children who died in infancy.  We haven&#39;t had many children because it&#39;s easy, or because we are super parents; we have chosen to allow children to join our family and share life as it happens.  <br/>\n<br/>\nA larger family is a great experience for parents and for children.  And in the context of unschooling, life becomes a smorgasbord of options, different opinions, likes and dislikes, this list goes on.  I love it!<br/>\n<br/>\nKerryn<br/>\nAustralia<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":196381819,"authorName":"ANGELA BERRY","from":"ANGELA BERRY &lt;berryajj@...&gt;","profile":"jennafirst2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: OT-having more kids","postDate":"1150732184","msgId":14782,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNjE5MTU0OTQ0LjcxNDY0LnFtYWlsQHdlYjgwMjA3Lm1haWwueWFob28uY29tPg=="},"prevInTopic":14769,"nextInTopic":14860,"prevInTime":14781,"nextInTime":14783,"topicId":14760,"numMessagesInTopic":0,"msgSnippet":"Hi Laura & Everyone, I TOTALLY agree with you on your discussion about having more kids.  My girls are 6 & 3.  We love the spacing and when I do get preggo for","messageBody":"<div id=\"ygrps-yiv-1157691935\">Hi Laura & Everyone,<br/>\n   <br/>\n  I TOTALLY agree with you on your discussion about having more kids.  My girls are 6 & 3.  We love the spacing and when I do get preggo for #3 mine will be 7 & 4.  I agree with Ren on the spacing for the same reason of having to be &quot;with&quot; the baby.  Now that I have been trying for 6months (with one m/c in March) sometimes I change my mind about NOT having more kids, but I know I will regret it the rest of my life.  Plus I have ran into so many older people that stop me in the stores to say how cute/beautiful my girls are and in their eyes you can tell they regret where ever they stopped at, then the next sentence is them saying &quot;have more they grow so fast&quot;. <br/>\n   <br/>\n  Your right, I think it will be a challenge to try and juggle all kids for happiness.  BUT running a house with all different kids is a TEAM effort. (IMO)  It is sooo amazing how the kids get excited about having another and they say they can&#39;t wait until we have another baby.  So I think it is so worth the &quot;fall back pattern&quot; for a few years plus just think how much help the boys can be in different ways.  Your stay home son might help out talking to the baby as you may get chores done.  Your go, go, go son can help out in the car.  I do think kids love to feel important and love to help.  I wanted more kids because when they get like above the ages like 8 & 10 its so different and less demanding of the &quot;chore&quot; thing and by then we are all going to work together even more at those ages.  My girls are friends and I try to always encourage them to work things out between them with respecting the other person which will help as we add to the family.  I also think a even<br/>\n number helps everyone to have a &quot;buddy&quot; system.  Nice topic you put out there!  My dh and I talk about the same exact things you thought u are over analyzing!  ;o)  Your not!   <br/>\n   <br/>\n  smiles~Angela<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":212934673,"authorName":"Michelle/Melbrigða","from":"&quot;=?ISO-8859-1?Q?Michelle/Melbrig=F0a?=&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] OT-having more kids","postDate":"1150720320","msgId":14769,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA2MTkwNTMycDNjOGRmYzBkdWVjNDk3OGJlOGRlZGRhMTFAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGU3NGQzbSs4Mm5mQGVHcm91cHMuY29tPg==","referencesHeader":"PGU3NGQzbSs4Mm5mQGVHcm91cHMuY29tPg=="},"prevInTopic":14763,"nextInTopic":14782,"prevInTime":14768,"nextInTime":14770,"topicId":14760,"numMessagesInTopic":0,"msgSnippet":"My children are all three years apart.  I loved that spacing when they were younger as the first child was much more independent when the second child came","messageBody":"<div id=\"ygrps-yiv-103241898\">My children are all three years apart.  I loved that spacing when they<br/>\nwere younger as the first child was much more independent when the<br/>\nsecond child came along and the first child and second child were much<br/>\nmore independent when the third child came along.  I didn&#39;t have two<br/>\n&quot;babies&quot; who needed my constant attention.  We had always talked about<br/>\nhaving four children as well, but after my pregnancy with Keon we<br/>\ndecided three was a good number :)  I do miss a lot of things about<br/>\nhaving a newborn in the house.  I miss night time nursing (yeah, I&#39;m<br/>\nweird that way) and wearing a baby and watching them begin to explore<br/>\ntheir world and smile and giggle and discover their chubbie little<br/>\ntoes.  However, I don&#39;t miss the diapers and the questioning of the<br/>\nway I parent a newborn and the trying to meet everyone&#39;s needs<br/>\n(including my own) and having that fail as I just *can&#39;t* meet<br/>\neveryone&#39;s needs (including my own.)<br/>\n<br/>\nI am loving the independence that older children gives me.  Their<br/>\nindependence and mine.  I love that I can let them go to the local<br/>\nneighborhood park (with cell phone in hand) and have a few moments of<br/>\nquiet or that I can leave 2 of them at home while I run a third to an<br/>\nactivity that the others aren&#39;t interested in rather than have to<br/>\nsomehow compromise or &quot;make it up to&quot; the child who isn&#39;t happy about<br/>\nhaving to go to something they have no interest in.  I like that I can<br/>\ntruly pop into the grocery store for a gallon of milk without having<br/>\nto load the entire car, three kids, a diaper bag, sling and oh wait,<br/>\nthere&#39;s something I&#39;m forgetting, oh yeah my purse (which I remember<br/>\nhalf way to the store).  I can just state as I head out the door, &quot;I&#39;m<br/>\ngoing to Winn Dixie for a gallon of milk, I&#39;ll be back in a half.<br/>\nDoes anyone need anything?&quot;  I love the activities that they are able<br/>\nto engage in now and love watching them engage in those activities.<br/>\n<br/>\nAnd I love watching their sleeping faces and seeing somewhere in their<br/>\nslumber the baby face that once was nestled at my breast.  Sometimes<br/>\nit takes really intense observations to see it, but it does occur.  I<br/>\nlike where I am now in my parenting and I think that is the big<br/>\nquestion you have to ask.<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nMichelle<br/>\naka Melbrigða<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://eventualknitting.blogspot.com\">http://eventualknitting.blogspot.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MedHS@yahoogroups.com\">MedHS@yahoogroups.com</a> - Homeschooling for the Medieval Recreationist</div>","specialLinks":[]},{"userId":265202862,"authorName":"Tina Layne","from":"Tina Layne &lt;tinalayne@...&gt;","profile":"tinalayne","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] OT-having more kids","postDate":"1150677517","msgId":14763,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNjE5MDAzODM3LjIzODkyLnFtYWlsQHdlYjM3MjAxLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGU3NGQzbSs4Mm5mQGVHcm91cHMuY29tPg=="},"prevInTopic":14761,"nextInTopic":14769,"prevInTime":14762,"nextInTime":14764,"topicId":14760,"numMessagesInTopic":0,"msgSnippet":"My girls are 22 months apart, by choice.  I only have one brother, and he is 13 years older than me and didn t want that for my family.  I ve never really been","messageBody":"<div id=\"ygrps-yiv-893137024\">My girls are 22 months apart, by choice.  I only have one brother, and he is 13 years older than me and didn&#39;t want that for my family.  I&#39;ve never really been as close to him as I think I would have been if we hadn&#39;t been so far apart in age.  <br/>\n   <br/>\n  With my girls, I dealt with many of the same issues you mention with having kids close together.  However, it has been wonderful having them so close and being able to share so much even now, and maybe even moreso.  They are now 15 and 13.<br/>\n   <br/>\n  We did have one more chid- he&#39;s 8 right now.  The girls were 7 and 5 when he was born.  We didn&#39;t choose such a long time between their ages, and I wasn&#39;t sure I only wanted 3, but I had medical issues that kept me from having him sooner, and also has kept us from being able to have anymore after him.  But, it has worked out in the end.  <br/>\n   <br/>\n  The difference in having only him as a baby to get ready, pack for, etc on outings as oppsoed to doing that for both the girls as babies and toddlers was drastically different, and easier.  Plus, the girls loved helping me get things ready, picking his clothes, choosing his blanket and binky, etc.  <br/>\n   <br/>\n  The spontaneity (&quot;hey! let&#39;s go to the mall&quot; and then just piling into the car instead of packing for every eventuality) was back within a very few short years- when he was 3 and potty trained.  That time went really fast!  Now that they are all much older, they are still close enough to hang out together instead of being so far apart in age that none of them have anything in common.  The oldest and he share a love of video games and play regularly.  The middle and he share a love of art and she shows him different things she has learned at her art classes when they work together on projects. They all enjoy the same music and movies and spend tons of time doing those activities together.<br/>\n   <br/>\n  I think if I&#39;d waited any longer than I did to have my son a lot of that would have been lost with him and the oldest, and he&#39;d have missed out on a lot of cool stuff with her, and she&#39;d have missed out on a great relationship with her little brother. As I said, I couldn&#39;t have more after he was born so the option of being able to give him a playmate near his age wasn&#39;t possible.  However, with the girls having such different tastes in everything, I figured he would find at least one thing that he has in common with each of them and they connect with each other on that level, and he has- like the video games or the art as I mentioned. And when one of them tries something new, at least one of the other is interested in learning about it, trying it out, or whatever.  <br/>\n   <br/>\n  I&#39;ve never felt that I have been unfair to him by being unable to produce another playmate for him, and I have never felt that we were unfair to his sisters to bring him into the world.  No matter how many children we would have had, we&#39;d love them all the same and would spend the same time with all them.  We do everything together as a group- I don&#39;t take one child at a time for a &quot;special outing&quot; or for &quot;boy&#39;s day out&quot; or &quot;girl&#39;s day out&quot;. <br/>\n   <br/>\n  For me time, Dh and I take one Friday a month for &quot;us time&quot; and go out to dinner, and I spend my evenings curled up with a good book &quot;ignoring&quot; what goes on around me in the room unless someone calls my name.  Sometimes if it&#39;s rowdier than I am up for I&#39;ll take the book to my room for quiet time.  I&#39;ve done this forever- before kids, when they were babies, toddlers, now that there are two teens and an 8 yr old, and I&#39;ll do it when they&#39;re all in college and dh and I are retired.  =)<br/>\n   <br/>\n  Tina<br/>\n  Hawaii<br/>\n<br/>\n<br/>\nLayne Family Blog:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://threekeys.blogspot.com/\">http://threekeys.blogspot.com/</a><br/>\n<br/>\n __________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"OT-having more kids","postDate":"1150671595","msgId":14761,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU3NGx0Yis5MDk0QGVHcm91cHMuY29tPg=="},"prevInTopic":14760,"nextInTopic":14763,"prevInTime":14760,"nextInTime":14762,"topicId":14760,"numMessagesInTopic":0,"msgSnippet":"I am also finding it nice to move out of the little kid stage. Now that we are at a point in their lives where we can go do activities outside the home, will","messageBody":"<div id=\"ygrps-yiv-812224268\">&quot;I am also finding it nice to move out of the little kid stage.<br/>\nNow that we are at a point in their lives where we can go do<br/>\nactivities outside the home, will having more kids hinder that?&quot;<br/>\n<br/>\nYES! Anytime you add a baby to the home, it&#39;s going to affect everyone<br/>\nand everything. You have to be willing to do that I believe.<br/>\n<br/>\nI&#39;m at a stage where I&#39;m REALLY enjoying being in the next phase of<br/>\nparenting. No babies, no toddlers and I&#39;m enjoying this newfound<br/>\nindependence. But, I enjoy having four children also!!:)<br/>\n<br/>\nMine are almost 4 years apart (3years 9months between each) and I<br/>\nreally enjoyed that spacing. I got to focus on each baby/toddler more<br/>\nthan if they were close together. <br/>\n<br/>\nAs far as meeting everyone&#39;s needs all the time...NO WAY. I talked<br/>\nabout that in my &quot;unschooling a tribe&quot; speech from last year&#39;s conference.<br/>\nI think that&#39;s why I have trouble with the idea of &quot;consensual<br/>\nparenting&quot; even though I agree with the basic philosophies. I don&#39;t<br/>\nbelieve you can meet everyone&#39;s needs ALL the time with a big family.<br/>\nEven with two children it gets tricky. I don&#39;t necessarily think it&#39;s<br/>\na big deal to negotiate and find a middle ground though. It&#39;s proven<br/>\nto be a useful tool in my children&#39;s lives and has made for a<br/>\nwell-balanced family.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":35146880,"authorName":"Laura Reinbach","from":"&quot;Laura Reinbach&quot; &lt;laura@...&gt;","profile":"lreinbach","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"OT-having more kids","postDate":"1150662582","msgId":14760,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU3NGQzbSs4Mm5mQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":14761,"prevInTime":14759,"nextInTime":14761,"topicId":14760,"numMessagesInTopic":0,"msgSnippet":"Hi, I hope my question isn t too off topic for this list.... dh and I have 2 boys, ages 3 and 5, and we are deciding whether to have more kids or not.  Before","messageBody":"<div id=\"ygrps-yiv-1582199974\">Hi,<br/>\nI hope my question isn&#39;t too off topic for this list.... dh and I have<br/>\n2 boys, ages 3 and 5, and we are deciding whether to have more kids or<br/>\nnot.  Before we had kids we talked about wanting 4 kids.  I have<br/>\npersonally found having 2 boys fairly close in age(21 months apart) a<br/>\nbit challenging at times.  I had a hard time with lack of sleep and<br/>\nnot having any time to myself and I didn&#39;t have much of a support<br/>\nsystem(other than dh). We are at a point now where we can go places,<br/>\nwhereas before it was hard for me to bring both of them out by myself,<br/>\nso we stayed home mostly.  I still love the idea of having a big<br/>\nfamily and still have the urge to have another baby, but(there&#39;s that<br/>\nbad but again) I feel like having more children is almost unfair to my<br/>\nboys. I am also finding it nice to move out of the little kid stage. <br/>\nNow that we are at a point in their lives where we can go do<br/>\nactivities outside the home, will having more kids hinder that?  Also,<br/>\nmy boys have completely different interests and personalities.  my<br/>\noldest likes to stay home(like mom) and my youngest likes to go, go, go.  <br/>\nAnother question is in regards to age spacing.  If we have another<br/>\nbaby, he/she will be, at the very least, 4 years younger than my<br/>\nyoungest.  Will that child feel left out by the age difference and<br/>\nwould it be better to have a 4th so the last two would be close in<br/>\nage.  I feel like I am totally over-analyzing this, but I just can&#39;t<br/>\nmake up my mind.  <br/>\nThose of you who have large families, how do you handle all the kids,<br/>\nget time for yourself, satisfy everyone&#39;s needs?  <br/>\nAny advice will be greatly appreciated.<br/>\nThanks,<br/>\nLaura<br/>\nmom to Ethan,5, and Luke, 3</div>","specialLinks":[]}],"prevTopicId":14861,"nextTopicId":14863}}