{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":23,"messages":[{"userId":337983339,"authorName":"hanna","from":"&quot;hanna&quot; &lt;the_hanna@...&gt;","profile":"hanna_moors","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Only read if you have spare time/ not urgent","postDate":"1307813583","msgId":46855,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGl0MDhzZithaWpsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQzOUJDQ0I2LUU3NUEtNEU5Mi04RDc2LTYxNUNDRTc3QkFFMEBkcml6emxlLmNvbT4="},"prevInTopic":46852,"nextInTopic":0,"prevInTime":46854,"nextInTime":46856,"topicId":46806,"numMessagesInTopic":0,"msgSnippet":"and if they do make that decision, I ll know it s because they really want to.  How awesome is that!!!!! That is indeed awsome, Sacha. Honesty is so","messageBody":"<div id=\"ygrps-yiv-1986282076\">&quot;and if they do make that decision, I&#39;ll know it&#39;s because they really want to.  How awesome is that!!!!!&quot;<br/>\n<br/>\nThat is indeed awsome, Sacha.<br/>\nHonesty is so undervalued, yet so crucial.<br/>\nThanks, for the reminder.<br/>\nHanna</div>","specialLinks":[]},{"userId":146052230,"authorName":"Sacha Davis","from":"Sacha Davis &lt;sacha@...&gt;","profile":"sacha_pie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Only read if you have spare time/ not urgent","postDate":"1307742356","msgId":46852,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzOUJDQ0I2LUU3NUEtNEU5Mi04RDc2LTYxNUNDRTc3QkFFMEBkcml6emxlLmNvbT4=","inReplyToHeader":"PGlzdGozYys2dGtzQGVHcm91cHMuY29tPg==","referencesHeader":"PGlzdGozYys2dGtzQGVHcm91cHMuY29tPg=="},"prevInTopic":46851,"nextInTopic":46855,"prevInTime":46851,"nextInTime":46853,"topicId":46806,"numMessagesInTopic":0,"msgSnippet":"Letting go of MY version of my kids future has been a big part of the process for me.  It s not easy and it s scary, but I feel to do this I have to say to","messageBody":"<div id=\"ygrps-yiv-2040638995\">Letting go of MY version of my kids future has been a big part of the process for me.  It&#39;s not easy and it&#39;s scary, but I feel to do this I have to say to myself, &quot;it&#39;s okay if my kid doesn&#39;t go to college,&quot; &quot;it&#39;s okay if my kid reads when he&#39;s twelve,&quot; and so on.  The more I work through this in my mind the more it feels okay, because I have a strong conviction, a gut feeling, that this is truly the best for my children.  Now sometimes when I think it through I think  of the bright side, &quot;if s/he doesn&#39;t go to college, at least s/he won&#39;t be saddle with all this debt,&quot; and if they do make that decision, I&#39;ll know it&#39;s because they really want to.  How awesome is that!!!!!<br/>\n<br/>\nS.<br/>\n<br/>\n<br/>\n<br/>\n__________________________________<br/>\nSacha (40), mommy to Finn (4) & Zivia (0) and wife to Megan (38)<br/>\n<br/>\nLivin&#39; la vida loca in Georgetown, Seattle<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jun 10, 2011, at 10:09 AM, Michele wrote:<br/>\n<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Thank you all for the help. Joyce, the self confidence part Really helped. <br/>\n&gt; <br/>\n&gt; I was getting a bit scared- thinking about the kids&#39; future and trying to make sure I do everything I can to make sure they will be happy, successful, fulfilled, on and on as adults. And of course college is in that worry loop.<br/>\n&gt; <br/>\n&gt; If college comes across as an expectation it would be easy for them to think we are disappointed in them if they don&#39;t choose to go. <br/>\n&gt; <br/>\n&gt; Anyway, again I thank all of you for the responses. Much clearer in MY head now. <br/>\n&gt; <br/>\n&gt; Michele<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":252534693,"authorName":"racheltomassone","from":"&quot;racheltomassone&quot; &lt;nrgt@...&gt;","profile":"racheltomassone","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Only read if you have spare time/ not urgent","postDate":"1307729171","msgId":46851,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzdG1laitidWF0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlzbWIybCs1Zjd2QGVHcm91cHMuY29tPg=="},"prevInTopic":46849,"nextInTopic":46852,"prevInTime":46850,"nextInTime":46852,"topicId":46806,"numMessagesInTopic":0,"msgSnippet":"I would reccomend reading the book  Secrets of a Buccaneer Scholar By: James Marcus Bach. I heard him speak at an unschoolers conference in Ohio a few weeks","messageBody":"<div id=\"ygrps-yiv-619734260\">I would reccomend reading the book  Secrets of a Buccaneer Scholar By: James Marcus Bach. I heard him speak at an unschoolers conference in Ohio a few weeks ago! He is amazing and his book may answer some questions for you...or just add some insight. He also has a website that is great!! He did not go to college!  Hope this helps, Rachel<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Michele&quot; &lt;michelewith3@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; You all are such a wealth of inspiration and so thought provoking.  I have this letter (below) and was wondering if anyone wants to help me pick it apart. It is from my husband. He and I go back and forth about college. I am not against college at all and I have forwarded him many of the articles that were previously discussed here about zero free tuition and options.....  I don&#39;t know, I just want college to be an option, not a &#39;if you want a good job&#39; type of thing.  He went to college for his field and is Very successful and Loves what he does.  So he is pretty firm about it. <br/>\n&gt; I will be fine if no one writes, Honest! :-)  But if anyone wants to throw in a comment or two I would be pretty grateful. <br/>\n&gt; <br/>\n&gt; this is the letter************************************************************************<br/>\n&gt; <br/>\n&gt; College grads in general make a lot more money than non college grads.  No question.<br/>\n&gt;                 Why is that?  Because the people going to college (in general) have a goal / a motivation of having a good job   or better than average job to make better than average money.  In general .. people that don&#39;t want to go to college are less motivated about having a good job that pays well.  Being less motivated equals less money.  IN GENERAL<br/>\n&gt;  <br/>\n&gt; College grads have more opportunities available to them.  No question. <br/>\n&gt;  <br/>\n&gt; College grads have more doors put in front of them to be opened.  College students will hear of jobs that they have never heard before = more &quot;doors&quot; = more opportunities.<br/>\n&gt;  <br/>\n&gt; College grads have shown that they can complete projects and classes to a successful graduation.  Completing assignments and a diploma is important for many business owners. <br/>\n&gt;  <br/>\n&gt; The statistics about College Grads vs. Non College Grads is looking at the General Population.  No question that most people that don&#39;t go to college make much much less money.   No question.  I would even say that the 40% of college dropouts do better than the population that didn&#39;t even try to go to college.  AGAIN .. for the only reason of motivation.  They are slightly more motivated than the others to earn more money.   IN GENERAL.<br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt; The question is  can someone become successful or have a decent career without a college education  absolutely.   They need to be jazzed about something, motivated and want to continually learn and improve.   College isn&#39;t the ONLY way  but no one should fool themselves into dismissing college altogether.<br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt; For people that just want to earn 50,000 or less per year  they have to think about how they can afford a family, vacations, healthcare, retirement, cloths, food, cars etc.   Just doing what you want to do, following your passion DOES NOT automatically mean happiness. <br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt; ****************<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":416363734,"authorName":"Michele","from":"&quot;Michele&quot; &lt;michelewith3@...&gt;","profile":"jacobsen.michele","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Only read if you have spare time/ not urgent","postDate":"1307725740","msgId":46849,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzdGozYys2dGtzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEZCMDhFRTAyLTNGRDMtNEJFNy1CNzQwLThGOEQ5NkM1MzkxNEB2ZXJpem9uLm5ldD4="},"prevInTopic":46836,"nextInTopic":46851,"prevInTime":46848,"nextInTime":46850,"topicId":46806,"numMessagesInTopic":0,"msgSnippet":"Thank you all for the help. Joyce, the self confidence part Really helped. I was getting a bit scared- thinking about the kids future and trying to make sure","messageBody":"<div id=\"ygrps-yiv-381079637\">Thank you all for the help. Joyce, the self confidence part Really helped. <br/>\n<br/>\nI was getting a bit scared- thinking about the kids&#39; future and trying to make sure I do everything I can to make sure they will be  happy, successful, fulfilled, on and on as adults. And of course college is in that worry loop.<br/>\n<br/>\nIf college comes across as an expectation it would be easy for them to think we are disappointed in them if they don&#39;t choose to go. <br/>\n<br/>\nAnyway, again I thank all of you for the responses. Much clearer in MY head now. <br/>\n<br/>\nMichele</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Only read if you have spare time/ not urgent","postDate":"1307634682","msgId":46836,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZCMDhFRTAyLTNGRDMtNEJFNy1CNzQwLThGOEQ5NkM1MzkxNEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEJBTkxrVGlrQXdvWDJYRjJnY0JhYWtSWTY3TC10UEotNHZ3QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGlzbWIybCs1Zjd2QGVHcm91cHMuY29tPiA8aXNvYjU0K25xN2RAZUdyb3Vwcy5jb20+IDxCQU5Ma1Rpa0F3b1gyWEYyZ2NCYWFrUlk2N0wtdFBKLTR2d0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":46834,"nextInTopic":46849,"prevInTime":46835,"nextInTime":46837,"topicId":46806,"numMessagesInTopic":0,"msgSnippet":"The problem with statistics is they don t give a clue as to the choices and pressures that caused people to fall into the categories they do. Statistically","messageBody":"<div id=\"ygrps-yiv-1235420635\">The problem with statistics is they don&#39;t give a clue as to the  <br/>\nchoices and pressures that caused people to fall into the categories  <br/>\nthey do.<br/>\n<br/>\nStatistically speaking, blacks in America are more violent and more  <br/>\nprone to criminal behavior. *Does* that mean blacks are genetically  <br/>\nmore violent and criminal?? Or are there more important factors those  <br/>\nstatistics are masking? (Wikipedia has an interesting article on the  <br/>\nmisuse of statistics.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Misuse_of_statistics)\">http://en.wikipedia.org/wiki/Misuse_of_statistics)</a><br/>\n<br/>\nWhat *other* factors besides a college degree might account for people  <br/>\nwith college degrees earning more?<br/>\n<br/>\nOne big factor is that people who have been ground down by the school  <br/>\nsystem don&#39;t choose to go onto college. They come out of public school  <br/>\nbelieving they&#39;re failures. Or that school is stupid.<br/>\n<br/>\nIt&#39;s far more likely that someone who believes they don&#39;t have what it  <br/>\ntakes to succeed in college will not aim their career sites very high  <br/>\nand won&#39;t be making much money. They&#39;re far more likely to believe  <br/>\nthey&#39;re not cut out for anything other than the lowest paying jobs.<br/>\n<br/>\nIt&#39;s not the college degree that counts as much as the self  <br/>\nconfidence. Self-confidence, the drive to pursue what you love,  <br/>\naccounts for most of the people who have made a lot of money even  <br/>\nwithout college degrees. People in college aren&#39;t self-confident  <br/>\nbecause they&#39;re in college. They&#39;re in college because they have (a  <br/>\ncertain degree of) self confidence. Without self confidence, people  <br/>\ndon&#39;t get very far. And school is really good at killing self  <br/>\nconfidence.<br/>\n<br/>\nUnfortunately what the college degree = more earning potential has  <br/>\ncome to mean is that college is like a magic formula. People believe  <br/>\ncollege will give kids what they need to succeed, when really what  <br/>\nkids need to succeed is what gets them into college. But people are  <br/>\nbelieving that kids should just do the magic ritual of 4 years of  <br/>\nlearning and they&#39;ll get more money. But that is becoming less and  <br/>\nless true. College is becoming expected but not everyone learns best  <br/>\nthat way. There are loads of kids in college who are occupying seats  <br/>\nto get the piece of paper to get more money. (My husband teaches lots  <br/>\nof them ;-) Kids are coming out with degrees but no desire to continue  <br/>\nwhat they&#39;ve been studying. Because it hasn&#39;t been about learning.  <br/>\nIt&#39;s been about the magic piece of paper.<br/>\n<br/>\nYes, some corporations definitely do weed out applicants by degrees,  <br/>\nmaking it nearly impossible to get certain jobs with those  <br/>\ncorporations if you don&#39;t have a college degree. Not necessarily  <br/>\nbecause jobs require it but as a way to eliminate applicants they  <br/>\nshouldn&#39;t waste their time on. While some doors will be closed, that  <br/>\ndoesn&#39;t affect the 10&#39;s of thousands of other similar doors that are  <br/>\nopen. Smaller companies are much more willing to look at abilities.  <br/>\nAnd of course there&#39;s always working for yourself! (Worked for Bill  <br/>\nGates ;-)<br/>\n<br/>\nI would bet most of the higher paying jobs do require a college degree  <br/>\nor experience. That&#39;s because those jobs require a certain level of  <br/>\ntechnical knowledge (or the ability to acquire it) which a degree  <br/>\n(supposedly) indicates someone has. But is it the degree or the desire  <br/>\nto acquire the technical knowledge that gets them the job?<br/>\n<br/>\nI used to say &quot;I have a degree in engineering&quot; as a way to explain why  <br/>\nI approach problems so logically. But that&#39;s not true. I have a degree  <br/>\nin electrical engineering *because* I approach problems logically. I  <br/>\nwas born an engineer! ;-) I was born with the desire to pursue how and  <br/>\nwhy things work. I absorbed that kind of knowledge all through my  <br/>\nchildhood. While my degree allowed me to get the job I had, it was the  <br/>\n*desire* to pursue engineering that made me want to go onto college,  <br/>\nmade me want that type of job.<br/>\n<br/>\nOne of the big disadvantages of school is that if kids don&#39;t go right  <br/>\nonto college after high school, it&#39;s less likely they will later. Not  <br/>\nbecause there&#39;s a narrow window of needing to enter college between 17  <br/>\nand 18 for it to work! It&#39;s because kids are *so* burned out by 12+  <br/>\nyears of school that they need *years* before that fades enough for  <br/>\ncollege to seem less like more torture.<br/>\n<br/>\nI suspect your husband is seeing college looming in 4 years and your  <br/>\nson needs to start preparing now. But unschooled kids have a *huge*  <br/>\nadvantage there. They don&#39;t need to go to college at 17. They can  <br/>\nwait. They can continue their pursuing interests with jobs :-)  <br/>\nFortunately it&#39;s no longer looked down on or seen as disloyalty to  <br/>\nchange jobs. And those who have worked, been out in the world finding  <br/>\nwhat they love to do, look *way* more attractive to colleges than kids  <br/>\nwho come only with same old same old transcript with a bunch of letter  <br/>\ngrades. Colleges love older students. Older students are there because  <br/>\nthey *want* to be not because it&#39;s more hoops they&#39;re supposed to jump  <br/>\nthrough to get a job.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":108731863,"authorName":"ncg30","from":"&quot;ncg30&quot; &lt;ncg30@...&gt;","profile":"ncg30","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Only read if you have spare time/ not urgent","postDate":"1307625913","msgId":46834,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzcWhqcCtnN25nQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4MDRERjYwQFVOSUJMQUIuQ05DU09GVFdBUkUuY29tPg=="},"prevInTopic":46831,"nextInTopic":46836,"prevInTime":46833,"nextInTime":46835,"topicId":46806,"numMessagesInTopic":0,"msgSnippet":"Yes, I got a bachelor s degree too back in 1991 - in accounting and finance.  I did work in an accounting firm and a credit department briefly making up to","messageBody":"<div id=\"ygrps-yiv-1106739116\">Yes, I got a bachelor&#39;s degree too back in 1991 - in accounting and finance.  I did work in an accounting firm and a credit department briefly making up to $35,000 and then decided to be a stay at home mom.  I never really liked accounting/finance but had to pick a major ultimately - I changed my major 3 times in college.  <br/>\n<br/>\nI honestly don&#39;t see how at 18 years old you can really know exactly what you want to do for the rest of your life - considering you may work until you are 70 or maybe older. I:m sure there are some lucky<br/>\nones that will know what they want to do at 18 but not many.  Or maybe<br/>\nthey think they know what they want to do (or what their parents are<br/>\npushing them to do) but it turns out they really don&#39;t like it after all. You have time to think about it and figure it out and who says you can&#39;t go to college when you are a little older and maybe really know what it is you want to pursue after getting some life experience or having a job in which you discover something you love or something you really want to pursue.<br/>\n<br/>\nDid I have fun at college - yes, alot!  But I came from a fairly<br/>\n strict upbringing so college was my time to just go and have fun and party.  Somehow I still got decent grades too.  But my husband never went to college and makes a lot more than I ever did after college and probably more than I would if I went back to work now full time.  Just my two cents :)<br/>\n<br/>\nNoelle<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Debra Rossing &lt;debra.rossing@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Just watching the latest episode of Master Chef - one of the people quit her job in a large law firm (she&#39;s a lawyer) because it was sucking her dry when her real passion is food. I knew a kid in high school who went to a prestigious college, got an engineering degree, had a bit of a breakdown and last I heard was a chef. Heck, my college degree is basically obsolete at this point (a business/information systems degree from 1983 - the IBM PC was just breaking into society and today&#39;s cell phones have more power than NASA had back then). The key thing from all my schooling (K-college) that has stood me in good stead is learning how to learn, how to find the answers, not in having memorized a bunch of data. Fortunately, back then in the &#39;stone age&#39;, my school teachers encouraged that process of seeking answers and finding resources, not just totally rote learning to pass standardized tests (which there was a lot less of).<br/>\n&gt; <br/>\n&gt; Deb R<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; **********************************************************************<br/>\n&gt; This email and any files transmitted with it are confidential and<br/>\n&gt; intended solely for the use of the individual or entity to whom they<br/>\n&gt; are addressed. If you have received this email in error please notify<br/>\n&gt; the system manager.<br/>\n&gt; <br/>\n&gt; This footnote also confirms that this email message has been swept by<br/>\n&gt; MIMEsweeper for the presence of computer viruses.<br/>\n&gt; <br/>\n&gt; www.mastercam.com<br/>\n&gt; **********************************************************************<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Only read if you have spare time/ not urgent","postDate":"1307622624","msgId":46831,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4MDRERjYwQFVOSUJMQUIuQ05DU09GVFdBUkUuY29tPg=="},"prevInTopic":46826,"nextInTopic":46834,"prevInTime":46830,"nextInTime":46832,"topicId":46806,"numMessagesInTopic":0,"msgSnippet":"Just watching the latest episode of Master Chef - one of the people quit her job in a large law firm (she s a lawyer) because it was sucking her dry when her","messageBody":"<div id=\"ygrps-yiv-264680292\">Just watching the latest episode of Master Chef - one of the people quit her job in a large law firm (she&#39;s a lawyer) because it was sucking her dry when her real passion is food. I knew a kid in high school who went to a prestigious college, got an engineering degree, had a bit of a breakdown and last I heard was a chef. Heck, my college degree is basically obsolete at this point (a business/information systems degree from 1983 - the IBM PC was just breaking into society and today&#39;s cell phones have more power than NASA had back then). The key thing from all my schooling (K-college) that has stood me in good stead is learning how to learn, how to find the answers, not in having memorized a bunch of data. Fortunately, back then in the &#39;stone age&#39;, my school teachers encouraged that process of seeking answers and finding resources, not just totally rote learning to pass standardized tests (which there was a lot less of).<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"Karen Swanay &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Only read if you have spare time/ not urgent","postDate":"1307565934","msgId":46826,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBTkxrVGlrQXdvWDJYRjJnY0JhYWtSWTY3TC10UEotNHZ3QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGlzb2I1NCtucTdkQGVHcm91cHMuY29tPg==","referencesHeader":"PGlzbWIybCs1Zjd2QGVHcm91cHMuY29tPiA8aXNvYjU0K25xN2RAZUdyb3Vwcy5jb20+"},"prevInTopic":46824,"nextInTopic":46831,"prevInTime":46825,"nextInTime":46827,"topicId":46806,"numMessagesInTopic":0,"msgSnippet":"And I think it s important to remember the following which I offer in a caring way (please read it with that tone of voice =D ) ... I have a friend with a","messageBody":"<div id=\"ygrps-yiv-1745277621\">And I think it&#39;s important to remember the following which I offer in a<br/>\ncaring way (please read it with that tone of voice =D )<br/>\n<br/>\n--- College is NO guarantee of a job<br/>\n I have a friend with a Master&#39;s in a STUPID field [clarification coming for<br/>\nthat qualifier] and 60K dollars in SCHOOL DEBT!  Not a job in sight for her.<br/>\nI have never pressed her for information about the size of the debt relative<br/>\nto her degree, and I know at least part of it is interest but her degree is<br/>\nin Recreational Mgmt.  Really?  There are MANY schools which offer degrees<br/>\nin fields where there is no reality of reaping the benefits of the cost of<br/>\nthe education.  This would be one of them.  When I was in college the first<br/>\ntime my degree was going to be MA in English Lit, concentration British Lit<br/>\nbefore 1800.  I had NO idea what I would do with that degree and I suppose I<br/>\nnever thought about it.  I&#39;m just an Anglophile and it was what pleased me<br/>\nat the time.  WTH was I thinking??!!  You can&#39;t actually get a job with that<br/>\ndegree.<br/>\n<br/>\n---You can&#39;t make your kids care about it if they don&#39;t...I went at 19yrs<br/>\nold and dropped out.<br/>\nI&#39;m 40 now and working on my Master&#39;s in a field I actually want to work<br/>\nin...not the one I *thought* was for me when I was 20.  Additionally, this<br/>\ntime around I&#39;m a 4.0 student...my GPA the first go around was dismal.  (And<br/>\nto tie it in to the first point above, the Masters I will get will allow me<br/>\nto work for piss poor pay...but I will be getting my PhD and we&#39;ll get out<br/>\nof this terrible place and into a bigger and better market.)<br/>\n<br/>\n--- A lot of being &quot;successful&quot; now is about who you know...20 yr olds don&#39;t<br/>\ngenerally know how to network etc and school doesn&#39;t teach that.  And when<br/>\npeople are young they tend to be dismissed by older people.<br/>\n<br/>\n--- Pushing your kids to acquire debt of this size is irresponsible.<br/>\nYes.  I said it.  If your kid doesn&#39;t want to BE a dentist...but you push<br/>\nhim into school and he goes with whatever tickles his fancy at the time, and<br/>\nhe incurs all that debt only to realize when he matures that he would rather<br/>\ngrow hydroponic vegetables for a living you&#39;ve just set his ability to be<br/>\ndebt-free back 15 years or more.  I don&#39;t believe any parent should push<br/>\ntheir kid to incur debt of any kind for any reason.  It&#39;s at the very least<br/>\nethically wrong.<br/>\n<br/>\n--- Your kids might be the apple of YOUR eye but they might not be all that<br/>\nsmart.<br/>\nThat&#39;s just a general point which I think it&#39;s important to remember when<br/>\nhanding out &quot;parental advice&quot;...we all know adults who are &quot;stupid&quot; or<br/>\n&quot;ugly&quot; or whatever but you never hear parents say their kids are anything<br/>\nbut THE MOST...(insert attribute here)...EVER!!  *We had friends who had a<br/>\ndaughter who was pudgy to put it kindly...but you could tell looking at her<br/>\nat age 13 that she was going to grow up to be shorter than average and<br/>\nlikely remain either pudgy or just not be pencil thin.  She was also very<br/>\nunattractive measured by convention.  SMART as could be and very athletic.<br/>\nBut her mother was always putting her in beauty pageants etc which she<br/>\nalways lost and her mother kept talking about her being a model.  I believe<br/>\nthere were issues there for the mother but she wasn&#39;t manic about it.  She<br/>\ngenuinely believed her kid was drop dead gorgeous.  Which I suppose is good<br/>\nbut did all kinds of damage to the child.*  Harping about college when your<br/>\nkids are young may seem like it&#39;s instilling the idea for success but it<br/>\nmight just set them up to feel like they failed you when they don&#39;t find it<br/>\na good fit for whatever reason.<br/>\n<br/>\nThis is really about assumptions, acculturation, and fear.  It&#39;s also about<br/>\na lack of mindfulness (which is almost always unintentional) about what you<br/>\nsay and what others hear.  To illustrate this point most clearly, if you say<br/>\nto a child while they are young &quot;When you grow up and get married...&quot; what<br/>\nthey hear if they don&#39;t find that a &quot;fit&quot; for them is &quot;My expectation for<br/>\nyou is heterosexual monogamy.&quot;  Well what if they are gay?  The message is<br/>\nso damaging to a person!  &quot;Who you are will never be OK to me.  Be what I<br/>\nexpect or risk my rejection.&quot;  It&#39;s pressure they do not need to bear.  The<br/>\npressure to &quot;be&quot; and fit into the cultural ideal is damaging to all of us<br/>\nbecause there isn&#39;t one of us who actual does fit it in all ways.<br/>\n<br/>\nIDK how old your kids are but it might just be time to have a quiet<br/>\ndiscussion with your husband and come at it from the idea of pressure and<br/>\ndebt etc...not a dismissal of his point of view as wrong and yours as right<br/>\nbut more of a &quot;How do we as parents want to best nurture and care for our<br/>\nchildrens&#39; spirits and mental health?&quot;  And be prepared to listen to him<br/>\nspeak and hear what he says in a mindful way.  What he is saying to you is<br/>\nreflecting his hopes, dreams and fears not only for your children but likely<br/>\nfor himself.<br/>\n<br/>\nKaren<br/>\n<br/>\nThat the very delusion which drove me to a death-loving desperation should<br/>\nso suddenly vanish would seem to indicate that many a suicide might be averted<br/>\n<br/>\nif the person contemplating it could find the proper assistance when<br/>\nsuch a crisis<br/>\nimpends. ~ A Mind That Found Itself by Clifford Whittingham Beers<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":416363734,"authorName":"Michele","from":"&quot;Michele&quot; &lt;michelewith3@...&gt;","profile":"jacobsen.michele","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Only read if you have spare time/ not urgent","postDate":"1307553942","msgId":46824,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzb2JhbStlbG82QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk1MTk0MS45Mzg3NS5xbUB3ZWIxMjA1MDQubWFpbC5uZTEueWFob28uY29tPg=="},"prevInTopic":46823,"nextInTopic":46826,"prevInTime":46823,"nextInTime":46825,"topicId":46806,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-500762690\">&lt;&lt;&lt;&lt;&lt;  let them know all the options available to them and assist them in which ever way they choose.<br/>\n<br/>\nYes. It seems that college bound is such a given with DH that sometimes I want to point out that it is not the only way. But yes, it will be their choice and hopefully he will come to respect that too. <br/>\n<br/>\n<br/>\n<br/>\nI really liked reading all the stories and examples. Thanks everyone. Funny, I never went to college but was making 6 figures when we married. I should be a good example, right?  ;-) <br/>\n<br/>\nMichele</div>","specialLinks":[]},{"userId":268202999,"authorName":"Betty","from":"&quot;Betty&quot; &lt;bettyjeanmarino@...&gt;","profile":"bettyjeanmarino","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Only read if you have spare time/ not urgent","postDate":"1307553764","msgId":46823,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzb2I1NCtucTdkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlzbWIybCs1Zjd2QGVHcm91cHMuY29tPg=="},"prevInTopic":46822,"nextInTopic":46824,"prevInTime":46822,"nextInTime":46824,"topicId":46806,"numMessagesInTopic":0,"msgSnippet":"I find the you earn more money over a lifetime argument to be invalid for many people. If we are talking about the gap between a retail manager and a vice","messageBody":"<div id=\"ygrps-yiv-352565968\">I find the &quot;you earn more money over a lifetime&quot; argument to be invalid for many people. If we are talking about the gap between a retail manager and a vice principal, a RN, or a lawyer, it is valid. If we are talking about the difference between a public school teacher and someone who has spent 30 years working a union job for the phone company, the phone job wins. <br/>\nI think people use this statistic incorrectly because it doesn&#39;t account for the debt that has to be paid back from getting that education. If a person leaves school with $40,000 in debt from earning their bachelor&#39;s degree, how much is the bill after interest over many years of paying? How about a doctorate degree? My husband had to take remedial classes when he went back to college and took extra time. He had already gone to college before and graduated (vocational). This year he will hit his aggregate for undergraduate work: $57,500. The year after he is going into his master&#39;s program so we will incur another $20,000 in debt. For us, this won&#39;t actually kill us because our house is almost paid off! Our cars are already paid off and we don&#39;t carry credit card debt. Other folks don&#39;t seem to live this way though. (statistically, not just my opinion!) They have car payments, mortgage payments, etc. <br/>\nJust something to ponder!</div>","specialLinks":[]},{"userId":416363734,"authorName":"Michele","from":"&quot;Michele&quot; &lt;michelewith3@...&gt;","profile":"jacobsen.michele","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Only read if you have spare time/ not urgent","postDate":"1307553346","msgId":46822,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzb2FvMisyZDM4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlzbm5xZytoYXB0QGVHcm91cHMuY29tPg=="},"prevInTopic":46821,"nextInTopic":46823,"prevInTime":46821,"nextInTime":46823,"topicId":46806,"numMessagesInTopic":0,"msgSnippet":"... Perhaps that is what I really need to point out. That we are not disagreeing as much as looking at it from different angles. Thank you for that. ... Ahhhh!","messageBody":"<div id=\"ygrps-yiv-1563335338\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;marbleface@...&quot; &lt;marbleface@...&gt; wrote:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It doesn&#39;t sound like you and your DH are disagreeing so much as &gt;emphasizing different aspects of the same answer. Both of you seem to &gt;start out with not dismissing college but you emphasize that not going &gt;to college may be the choice and he emphasizes going to college. <br/>\n<br/>\n </span></blockquote>Perhaps that is what I really need to point out. That we are not disagreeing as much as looking at it from different angles. Thank you for that.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; And he argues like a man. Statements as fact. You take a &quot;let&#39;s look &gt;at all the possibilities and discuss it&quot; approach. <br/>\n<br/>\n </span></blockquote>Ahhhh! and part of my unschooling is to let that be OK. still learning over here....<br/>\n<br/>\nThanks to all, <br/>\nMichele</div>","specialLinks":[]},{"userId":416363734,"authorName":"Michele","from":"&quot;Michele&quot; &lt;michelewith3@...&gt;","profile":"jacobsen.michele","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Only read if you have spare time/ not urgent","postDate":"1307552453","msgId":46819,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzbzlzNStiY2hlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk1NjU2NS44MDc5Ni5xbUB3ZWI4NzMxNi5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":46818,"nextInTopic":46820,"prevInTime":46818,"nextInTime":46820,"topicId":46806,"numMessagesInTopic":0,"msgSnippet":"... The kids are 10, 12,13. He says things like, if you want a good job you have to go to college then in confidence they say to me they are scared to grow","messageBody":"<div id=\"ygrps-yiv-1693084113\">&lt;&lt;&lt;&lt;&lt;How old are your children? I would worry about it less. I would &gt;&gt;let your <br/>\n<blockquote><span title=\"ireply\"> &gt; husband&#39;s awareness of the world grow, or not, as his children grow. I wouldn&#39;t <br/>\n&gt; pick apart his e-mail. I wouldn&#39;t harass him to share your opinion. <br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>The kids are 10, 12,13. He says things like, &#39;if you want a good job you have to go to college&#39; then in confidence they say to me they are scared to grow up because they have to go to college or &#39;flip burgers&#39;. 2 of them are dyslexic and they had a horrible time in school and have only been out for 2 years. This happened a few months back, and the letter yesterday.... I am seeing now why I was so annoyed by his comments. But I definitely stop harassing him. i was planning on picking apart his email and I think I wont. So you saved me from myself LOL<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt; There is a thing I&#39;ve really enjoyed recently. It&#39;s the Edge.org World Question for 2011<br/>\n<br/>\n </span></blockquote>I will check this out. This sounds really interesting! <br/>\n<br/>\nThanks everyone for sharing with me, <br/>\nMichele</div>","specialLinks":[]},{"userId":452754049,"authorName":"melissa maranda","from":"melissa maranda &lt;love.gratitude@...&gt;","profile":"marandamelissa","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: Only read if you have spare time/ not urgent","postDate":"1307549861","msgId":46821,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENPTDEyMS1XNTgxN0Q1ODdEOTVENEJDNjgxODEwM0Y0NjIwQHBoeC5nYmw+","inReplyToHeader":"PENPTDEyMS1XNjVGQjM1RjIwREEyNjBDMUVDNzYzRjQ2MjBAcGh4LmdibD4=","referencesHeader":"PDI5OTM3NC4yNTc1Ni5xbUB3ZWI0NDgwNi5tYWlsLnNwMS55YWhvby5jb20+LDxpc25tNm0rdTdjdEBlR3JvdXBzLmNvbT4sPENPTDEyMS1XNjVGQjM1RjIwREEyNjBDMUVDNzYzRjQ2MjBAcGh4LmdibD4="},"prevInTopic":46820,"nextInTopic":46822,"prevInTime":46820,"nextInTime":46822,"topicId":46806,"numMessagesInTopic":0,"msgSnippet":"oops, not sure why my daughters facebook page is highlighted at the bottom of my signature on my previous post, it s supposed to be my Life Coaching page. ","messageBody":"<div id=\"ygrps-yiv-826629131\">oops, not sure why my daughters facebook page is highlighted at the bottom of my signature on my previous post, it&#39;s supposed to be my Life Coaching page.<br/>\n~melissa<br/>\n<br/>\nMelissa Maranda, MA<br/>\nMarriage & Family Therapist<br/>\nSubstance Abuse Specialist<br/>\nLife Coach<br/>\nBasic NLP Certified<br/>\nUnschooling Mama<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:love.gratitude@...\">love.gratitude@...</a><br/>\nDate: Wed, 8 Jun 2011 11:03:53 -0500<br/>\nSubject: RE: [unschoolingbasics] Re: Only read if you have spare time/ not urgent<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI concur! I have Master&#39;s Degree and oodles of certifications, etc. I was bogged down for years with student loans and have never made more than $35,000 here in Iowa. On the other hand, the money is not the priority for me. I have everything I need and want for the most part. I also have many friends who do not have college degrees and make quite a bit more than I do including my ex husband who is a truck driver. I guess it&#39;s all relative.<br/>\n<br/>\nMelissa Maranda, MA<br/>\nMarriage & Family Therapist<br/>\nSubstance Abuse Specialist<br/>\nLife Coach<br/>\nBasic NLP Certified<br/>\nUnschooling Mama<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.facebook.com/home.php#!\">http://www.facebook.com/home.php#!</a>/pages/Melissa-Maranda-Coaching/167302313334605<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bkind28@...\">bkind28@...</a><br/>\nDate: Wed, 8 Jun 2011 11:25:10 +0000<br/>\nSubject: [unschoolingbasics] Re: Only read if you have spare time/ not urgent<br/>\n<br/>\nDeb made a great point! I know many teachers who decided teaching wasn&#39;t for them. I also know cosmetologists who don&#39;t do it because of the hours. I like my job but it doesn&#39;t pay well. I don&#39;t have a degree but the 3 people who sit with me all do. Guess what? They make the same bad pay but have loans. ;)<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n \t\t \t   \t\t  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":76589361,"authorName":"Angela","from":"&quot;Angela&quot; &lt;argwolff@...&gt;","profile":"argwolff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Only read if you have spare time/ not urgent","postDate":"1307549189","msgId":46820,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzbzZtNStiZXNpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlzbWIybCs1Zjd2QGVHcm91cHMuY29tPg=="},"prevInTopic":46819,"nextInTopic":46821,"prevInTime":46819,"nextInTime":46821,"topicId":46806,"numMessagesInTopic":0,"msgSnippet":"Is your oldest the 13YO that just won the science competition? And you guys are pretty new to home/unschooling, right? I agree with those that say don t make","messageBody":"<div id=\"ygrps-yiv-1086057327\">Is your oldest the 13YO that just won the science competition? And you guys are pretty new to home/unschooling, right?<br/>\n<br/>\nI agree with those that say don&#39;t make an issue out of this now. If you had a kid that was trying to opt out of college for the coming year, or even looking at college in the next year or two, then yes, you might need to figure things out sooner rather than later. But if I&#39;m understanding the ages of your kids, you have time on this one.<br/>\n<br/>\nI can imagine for a parent who is both relatively new to the ideas of unschooling and who sees a direct, successful path for himself from college to success and happiness in a career, it&#39;s not only hard to imagine your kids taking a different path, but it&#39;s scary. <br/>\n<br/>\nWhen we first started home/unschooling, my husband clearly understood and agreed that traditional school was the wrong place for our oldest, but was very resistant to the idea of homeschooling our middle child rather than sending her to kindergarten. They are very different kids and he wanted her to have the experience and the chance to figure out for herself whether she liked school or not. The problem was we were a whole year away from what would be the start of school. Our going round and round on it wasn&#39;t helping anyone.<br/>\n<br/>\nI finally took a step back and said, &quot;Let&#39;s make a list of our goals for her, and then figure out the best way to meet them NOW. And then we can worry about kindergarten when the time comes.&quot;<br/>\n<br/>\nWhen we made the list with the idea of it being really focusing on what we thought she needed, the pressure of &quot;school&quot; or &quot;not school&quot; was lifted from us both, and we actually started focusing on the child in front of us and what she needed RIGHT THEN instead of on what either of us considered &quot;ideal&quot; a year in the offing.<br/>\n<br/>\nAnd to add to what everyone else has said re degrees: I have a degree in a specific field from one of the few accredited degree programs in the country, and exactly two-years into working in the field I decided I really didn&#39;t like what is _actually_ entailed in the job or in being &quot;successful&quot; at it, as opposed to the course work I really enjoyed, and then parlayed that experience into a much lower paying occupation. I paid off my last school loans two weeks before my first child was born (and that was with putting my entire salary to it for a solid year) and now am home full-time with the kids.<br/>\n<br/>\nNow on direct trajectory, there to hear, I never would have met my husband had it not been for the career choice that necessitated a move to NY, but the little I got out of that degree was certainly not worth the money I spent for it.<br/>\n<br/>\nAnd my husband has an MBA. A few years ago when he was looking for jobs, everything he was looking at said MBA required. Now some of those same jobs say &quot;BA or equivalent experience required.&quot; Things have changed drastically in that regard, even in the last few years.<br/>\n<br/>\nGood luck,<br/>\nAngela in NJ</div>","specialLinks":[]},{"userId":452754049,"authorName":"melissa maranda","from":"melissa maranda &lt;love.gratitude@...&gt;","profile":"marandamelissa","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Re: Only read if you have spare time/ not urgent","postDate":"1307549033","msgId":46815,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENPTDEyMS1XNjVGQjM1RjIwREEyNjBDMUVDNzYzRjQ2MjBAcGh4LmdibD4=","inReplyToHeader":"PGlzbm02bSt1N2N0QGVHcm91cHMuY29tPg==","referencesHeader":"PDI5OTM3NC4yNTc1Ni5xbUB3ZWI0NDgwNi5tYWlsLnNwMS55YWhvby5jb20+LDxpc25tNm0rdTdjdEBlR3JvdXBzLmNvbT4="},"prevInTopic":46814,"nextInTopic":46818,"prevInTime":46814,"nextInTime":46816,"topicId":46806,"numMessagesInTopic":0,"msgSnippet":"I concur!  I have Master s Degree and oodles of certifications, etc.  I was bogged down for years with student loans and have never made more than $35,000 here","messageBody":"<div id=\"ygrps-yiv-1111695280\">I concur!  I have Master&#39;s Degree and oodles of certifications, etc.  I was bogged down for years with student loans and have never made more than $35,000 here in Iowa.  On the other hand, the money is not the priority for me.  I have everything I need and want for the most part.  I also have many friends who do not have college degrees and make quite a bit more than I do including my ex husband who is a truck driver.  I guess it&#39;s all relative.<br/>\n<br/>\nMelissa Maranda, MA<br/>\nMarriage & Family Therapist<br/>\nSubstance Abuse Specialist<br/>\nLife Coach<br/>\nBasic NLP Certified<br/>\nUnschooling Mama<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.facebook.com/home.php#!\">http://www.facebook.com/home.php#!</a>/pages/Melissa-Maranda-Coaching/167302313334605<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bkind28@...\">bkind28@...</a><br/>\nDate: Wed, 8 Jun 2011 11:25:10 +0000<br/>\nSubject: [unschoolingbasics] Re: Only read if you have spare time/ not urgent<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\nDeb made a great point! I know many teachers who decided teaching wasn&#39;t for them. I also know cosmetologists who don&#39;t do it because of the hours. I like my job but it doesn&#39;t pay well. I don&#39;t have a degree but the 3 people who sit with me all do. Guess what? They make the same bad pay but have loans. ;)<br/>\n<br/>\n<br/>\n<br/>\n \t\t \t   \t\t  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":336359968,"authorName":"Jennifer Hollems","from":"Jennifer Hollems &lt;hollems@...&gt;","profile":"hollems@att.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Only read if you have spare time/ not urgent","postDate":"1307544336","msgId":46818,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwNDIxMC43NzQyLnFtQHdlYjE4MDAwNC5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PDk1MTk0MS45Mzg3NS5xbUB3ZWIxMjA1MDQubWFpbC5uZTEueWFob28uY29tPg==","referencesHeader":"PDk1MTk0MS45Mzg3NS5xbUB3ZWIxMjA1MDQubWFpbC5uZTEueWFob28uY29tPg=="},"prevInTopic":46815,"nextInTopic":46819,"prevInTime":46817,"nextInTime":46819,"topicId":46806,"numMessagesInTopic":0,"msgSnippet":"I LOVED college, did well, and went on to graduate school. And, I think college was great for me - it helped me think outside the box, exposed me to people I ","messageBody":"<div id=\"ygrps-yiv-707646329\">I LOVED college, did well, and went on to graduate school. And, I think college<br/>\nwas great for me - it helped me think outside the box, exposed me to people I<br/>\nwouldn&#39;t have otherwise met, and opened up opportunities to me (graduate school<br/>\nat least). But, there are a couple of downsides to college, too.  Mostly:<br/>\n <br/>\n- You may graduate with thousands of dollars in debt that limit your ability to<br/>\nlive freely in the future.<br/>\n- You may increase the difficulty in finding a job in certain areas (People<br/>\ndon&#39;t want to hire college graduates for jobs that don&#39;t require it because they<br/>\n&quot;will leave once they find a better job&quot; - I&#39;ve heard it many times, and many of<br/>\nmy unemployed friends are struggling with this right now).<br/>\n- If you aren&#39;t ready for college, you might do poorly, limiting your options<br/>\nfor college in the future.<br/>\n<br/>\n <br/>\nIf people decide to become chefs, furniture makers, antique collectors, classic<br/>\ncar restorers (some of our favorite TV right now. . .), artists, explorers, etc.<br/>\nthey would probably be better off doing it without the thousands of dollars of<br/>\ncollege debt.<br/>\n<br/>\n <br/>\nJust my opinion, though.  We&#39;ve done a lot of talking and exploring options (in<br/>\nour minds) over the years to come to the conclusion that college is ONE option<br/>\namong many. <br/>\n<br/>\n<br/>\nJennifer<br/>\n </div>","specialLinks":[]},{"userId":274177100,"authorName":"Vickisue Gray","from":"Vickisue Gray &lt;vickisue_gray@...&gt;","profile":"vickisue_gray","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Only read if you have spare time/ not urgent","postDate":"1307541803","msgId":46814,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk1MTk0MS45Mzg3NS5xbUB3ZWIxMjA1MDQubWFpbC5uZTEueWFob28uY29tPg=="},"prevInTopic":46811,"nextInTopic":46815,"prevInTime":46813,"nextInTime":46815,"topicId":46806,"numMessagesInTopic":0,"msgSnippet":"=)   I dropped out of a lousy high school, took my GED, and went on to have a wonderful life.  I, too, thought having a GED was a negative, and oh way back","messageBody":"<div id=\"ygrps-yiv-481058720\">=)<br/>\n <br/>\nI dropped out of a lousy high school, took my GED, and went on to have a wonderful life.  I, too, thought having a GED was a negative, and oh way back then, many jobs looked at me is if &#39;I was less then&#39; because of the GED.  Then I landed a job as a Police/Fire/Rescue Dispatcher.  Being a government agency, they couldn&#39;t hold the GED High School Diploma as less then a regular high school diploma.  It didn&#39;t take long for them to see me as a very smart young lady and it was pointed out that the city I was working for, would pay for me to go to college.  Since an AA degree would jump up my pay, and college would be paid for, I went back to school while working the midnight shift, and earned my degree. <br/>\n <br/>\nAfter a long career in Law Enforcement, moving into Records then Liasion for the city, I moved on to other things.  Mainly, I was afforded a few years as a stay at home mom with my youngest child. (I&#39;d say one of the best jobs ever!)  Times got hard after the stock market crash in the late 90&#39;s so it was time to go back to work.  I landed a job working for the Federal government.  My &#39;degree&#39; never came into play.  What did was A) Not having a criminal background  and B) passing the test.   I had no knowledge of the job I was seeking prior to seeking it.  I had to learn, which I did, passing the test with high scores on the first round. <br/>\n <br/>\nYears later, I&#39;m now the supervisor, in a professional position, making a decent income.  Sure, many times people with degrees apply to my office and when there&#39;s an opening, we hire.  The degree (if it&#39;s in our field of work) just means they already &#39;should&#39; know what we do.  It&#39;s been found, the higher the degree, the more trouble they are. (Four years = good ~ master = pain in the ass)  Anyway, the last few hired only had GED&#39;s but they worked their butts off to pass the required tests and they continue to learn everything they can making them wonderful employees.  Some of my employees had military backgrounds, some college, some just GED&#39;s.  What I love about this place is, the older fellows genuinely like the younger folk and have shared their wealth of knowledge with them so my &#39;newbies&#39; become seasoned fast.  Everyone here is really happy and the team spirit makes coming to work a positive.  Pay has nothing to do with education.  <br/>\n <br/>\nBesides all the above, whether you and or your spouse WANTS your kids to go to college, only your kids can make that decision for themselves.  Students who go &#39;because they are forced&#39; just waste the tuition.  Students who go because they WANT to be there do well, and there&#39;s really not much you can say either way.   All you can do is allow your kids to enjoy learning and let them know all the options available to them and assist them in which ever way they choose.<br/>\n <br/>\nHaving a dad, with a career he enjoys, that required a degree, is really enough for them to grasp this concept.  In reading what was required to get hired at Blizzard, I found it interesting that some jobs require a degree and others just require talent.  If you can do that which they are looking for, they don&#39;t really care where nor how you learned it.  My oldest is working a professional job while she goes to college to earn her degree in another field.  She currently earns around $28 per hour.  Once her degree is achieved, she will be lucky to see that as starting pay in her chosen next direction.  Also, her hobby is designing costumes for comic cons another field that really only requires talent.  Her skills are impressive so she has that as an optional career.<br/>\n <br/>\nMy other daughter, earned her AA as a high schooler.  She was tired of school so after graduating, she landed herself a job on a production line earning around $9. an hour plus loads of overtime.  It didn&#39;t take much of that for her to decide she&#39;d rather be back in college.  She hasn&#39;t decided on what she wants to study yet, but she&#39;s decided to aim towards some form of college required career.  Time will tell.  =)<br/>\n <br/>\nHope this helps you some.<br/>\nGood luck!<br/>\n <br/>\nVicki<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Only read if you have spare time/ not urgent","postDate":"1307533968","msgId":46811,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzbm5xZytoYXB0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlzbWIybCs1Zjd2QGVHcm91cHMuY29tPg=="},"prevInTopic":46810,"nextInTopic":46814,"prevInTime":46810,"nextInTime":46812,"topicId":46806,"numMessagesInTopic":0,"msgSnippet":"So, per you DH, college is a measure of how much a person wants to make money? Maybe so. But if the young person does not start off motivated in that","messageBody":"<div id=\"ygrps-yiv-914650647\">So, per you DH, college is a measure of how much a person wants to make money? Maybe so. But if the young person does not start off motivated in that direction, is college worth it? In terms of time spent and debt. Is a young person better off working for a while until they get motivated to earn more? Or until they figure out where they want to head? <br/>\n<br/>\nOTOH, if the young person doesn&#39;t object, doesn&#39;t have a job or a clue, maybe college is as good a place to be as any other. Is that his point? That if the young person is not already motivated to make more then $50,000 a year, college will give them that motivation? <br/>\n<br/>\nIt doesn&#39;t sound like you and your DH are disagreeing so much as emphasizing different aspects of the same answer. Both of you seem to start out with not dismissing college but you emphasize that not going to college may be the choice and he emphasizes going to college. <br/>\n<br/>\nAnd he argues like a man. Statements as fact. You take a &quot;let&#39;s look at all the possibilities and discuss it&quot; approach. <br/>\n<br/>\nGood luck with all that. :)<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Michele&quot; &lt;michelewith3@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; You all are such a wealth of inspiration and so thought provoking.  I have this letter (below) and was wondering if anyone wants to help me pick it apart. It is from my husband. He and I go back and forth about college. I am not against college at all and I have forwarded him many of the articles that were previously discussed here about zero free tuition and options.....  I don&#39;t know, I just want college to be an option, not a &#39;if you want a good job&#39; type of thing.  He went to college for his field and is Very successful and Loves what he does.  So he is pretty firm about it. <br/>\n&gt; I will be fine if no one writes, Honest! :-)  But if anyone wants to throw in a comment or two I would be pretty grateful. <br/>\n&gt; <br/>\n&gt; this is the letter************************************************************************<br/>\n&gt; <br/>\n&gt; College grads in general make a lot more money than non college grads.  No question.<br/>\n&gt;                 Why is that?  Because the people going to college (in general) have a goal / a motivation of having a good job   or better than average job to make better than average money.  In general .. people that don&#39;t want to go to college are less motivated about having a good job that pays well.  Being less motivated equals less money.  IN GENERAL<br/>\n&gt;  <br/>\n&gt; College grads have more opportunities available to them.  No question. <br/>\n&gt;  <br/>\n&gt; College grads have more doors put in front of them to be opened.  College students will hear of jobs that they have never heard before = more &quot;doors&quot; = more opportunities.<br/>\n&gt;  <br/>\n&gt; College grads have shown that they can complete projects and classes to a successful graduation.  Completing assignments and a diploma is important for many business owners. <br/>\n&gt;  <br/>\n&gt; The statistics about College Grads vs. Non College Grads is looking at the General Population.  No question that most people that don&#39;t go to college make much much less money.   No question.  I would even say that the 40% of college dropouts do better than the population that didn&#39;t even try to go to college.  AGAIN .. for the only reason of motivation.  They are slightly more motivated than the others to earn more money.   IN GENERAL.<br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt; The question is  can someone become successful or have a decent career without a college education  absolutely.   They need to be jazzed about something, motivated and want to continually learn and improve.   College isn&#39;t the ONLY way  but no one should fool themselves into dismissing college altogether.<br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt; For people that just want to earn 50,000 or less per year  they have to think about how they can afford a family, vacations, healthcare, retirement, cloths, food, cars etc.   Just doing what you want to do, following your passion DOES NOT automatically mean happiness. <br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt; ****************<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":179855323,"authorName":"bkind28","from":"&quot;bkind28&quot; &lt;bkind28@...&gt;","profile":"bkind28","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Only read if you have spare time/ not urgent","postDate":"1307532310","msgId":46810,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzbm02bSt1N2N0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI5OTM3NC4yNTc1Ni5xbUB3ZWI0NDgwNi5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":46809,"nextInTopic":46811,"prevInTime":46809,"nextInTime":46811,"topicId":46806,"numMessagesInTopic":0,"msgSnippet":"Deb made a great point! I know many teachers who decided teaching wasn t for them. I also know cosmetologists who don t do it because of the hours. I like my","messageBody":"<div id=\"ygrps-yiv-1830512131\">Deb made a great point! I know many teachers who decided teaching wasn&#39;t for them. I also know cosmetologists who don&#39;t do it because of the hours. I like my job but it doesn&#39;t pay well. I don&#39;t have a degree but the 3 people who sit with me all do. Guess what? They make the same bad pay but have loans. ;)</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Only read if you have spare time/ not urgent","postDate":"1307526117","msgId":46809,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk1NjU2NS44MDc5Ni5xbUB3ZWI4NzMxNi5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGlzbWIybCs1Zjd2QGVHcm91cHMuY29tPg==","referencesHeader":"PGlzbWIybCs1Zjd2QGVHcm91cHMuY29tPg=="},"prevInTopic":46808,"nextInTopic":46810,"prevInTime":46808,"nextInTime":46810,"topicId":46806,"numMessagesInTopic":0,"msgSnippet":"How old are your children? I would worry about it less. I would let your husband s awareness of the world grow, or not, as his children grow. I wouldn t pick","messageBody":"<div id=\"ygrps-yiv-534180982\">How old are your children? I would worry about it less. I would let your <br/>\nhusband&#39;s awareness of the world grow, or not, as his children grow. I wouldn&#39;t <br/>\npick apart his e-mail. I wouldn&#39;t harass him to share your opinion. <br/>\n<br/>\n<br/>\nIf I were having a conversation with someone about the reason why college <br/>\nstudents do well I wouldn&#39;t lean on motivation as the cause. I would assume it <br/>\nhad something to do with streaming. Blake Boles is quoted as saying &quot;Degrees <br/>\nrepresent competency. Competency represents itself.&quot; A motivated individual <br/>\nprobably needs college less than an unmotivated person in the hunt for a <br/>\nmeaningful or high paying job. <br/>\n<br/>\n<br/>\nThere is a thing I&#39;ve really enjoyed recently. It&#39;s the Edge.org World Question <br/>\nfor 2011. In it is a response by Daniel Kahneman whose idea is Focussing <br/>\nIllusion. <a rel=\"nofollow\" target=\"_blank\" href=\"http://edge.org/q2011/q11_17.html#kahneman\">http://edge.org/q2011/q11_17.html#kahneman</a> for the whole thing, but <br/>\nhis intro paragraph is this: <br/>\n<br/>\nEducation is an important determinant of income — one of the most  important — <br/>\nbut it is less important than most people think.  If  everyone had the same <br/>\neducation, the inequality of income would be  reduced by less than 10%.   When <br/>\nyou focus on education you neglect the  myriad other factors that determine <br/>\nincome.  The differences of income  among people who have the same education are <br/>\nhuge.<br/>\n-----<br/>\nClearly there are more reasons than college for people&#39;s income. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":330983344,"authorName":"Debora Solarski","from":"Debora Solarski &lt;debora4avon@...&gt;","profile":"debora4avon","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Only read if you have spare time/ not urgent","postDate":"1307497407","msgId":46808,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5OTM3NC4yNTc1Ni5xbUB3ZWI0NDgwNi5tYWlsLnNwMS55YWhvby5jb20+","inReplyToHeader":"PDlkN2MwY2E1LTQwMjctNDkyYS1iNjM1LWMwZjQyODk5MDc1YUBibHVyPg==","referencesHeader":"PGlzbWIybCs1Zjd2QGVHcm91cHMuY29tPiA8OWQ3YzBjYTUtNDAyNy00OTJhLWI2MzUtYzBmNDI4OTkwNzVhQGJsdXI+"},"prevInTopic":46807,"nextInTopic":46809,"prevInTime":46807,"nextInTime":46809,"topicId":46806,"numMessagesInTopic":0,"msgSnippet":"My husband is a college and university grad and makes less than $40 000 per year, he has made more but was miserable.  I work only part time (teaching at a","messageBody":"<div id=\"ygrps-yiv-1059855138\">My husband is a college and university grad and makes less than $40 000 per year, he has made more but was miserable.  I work only part time (teaching at a college).  <br/>\n <br/>\nMy husband I both agree that going to post secondary only proves that you have the ability to learn - it doesn&#39;t mean you will actually enjoy doing it or even be any good at it.  Example- someone may have the brains and ability to get through medical school but have the bedside manner of a stone.  Or they may decide that they do not like it. (actual knowledge of person who went through med school and specialty and left it all behind  to work in landscaping).<br/>\n <br/>\nDeb <br/>\n<br/>\nYou all are such a wealth of inspiration and so thought provoking. I have this letter (below) and was wondering if anyone wants to help me pick it apart. It is from my husband. He and I go back and forth about college. I am not against college at all and I have forwarded him many of the articles that were previously discussed here about zero free tuition and options..... I don&#39;t know, I just want college to be an option, not a &#39;if you want a good job&#39; type of thing. He went to college for his field and is Very successful and Loves what he does. So he is pretty firm about it. <br/>\nI will be fine if no one writes, Honest! :-) But if anyone wants to throw in a comment or two I would be pretty grateful. <br/>\n<br/>\nthis is the letter************************************************************************<br/>\n<br/>\nCollege grads in general make a lot more money than non college grads.  No question.<br/>\n                Why is that?  Because the people going to college (in general) have a goal / a motivation of having a good job   or better than average job to make better than average money.  In general .. people that don&#39;t want to go to college are less motivated about having a good job that pays well.  Being less motivated equals less money.  IN GENERAL<br/>\n <br/>\nCollege grads have more opportunities available to them.  No question. <br/>\n <br/>\nCollege grads have more doors put in front of them to be opened.  College students will hear of<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":179855323,"authorName":"bkind28@yahoo.com","from":"&quot;bkind28@...&quot; &lt;bkind28@...&gt;","profile":"bkind28","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Only read if you have spare time/ not urgent","postDate":"1307494298","msgId":46807,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlkN2MwY2E1LTQwMjctNDkyYS1iNjM1LWMwZjQyODk5MDc1YUBibHVyPg==","inReplyToHeader":"PGlzbWIybCs1Zjd2QGVHcm91cHMuY29tPg==","referencesHeader":"PGlzbWIybCs1Zjd2QGVHcm91cHMuY29tPg=="},"prevInTopic":46806,"nextInTopic":46808,"prevInTime":46806,"nextInTime":46808,"topicId":46806,"numMessagesInTopic":0,"msgSnippet":"My BF dropped out of HS to join the Navy. He got his GED but didn t complete college. He built up a business with his father and makes 6 figures a year. ","messageBody":"<div id=\"ygrps-yiv-508757869\">My BF dropped out of HS to join the Navy. He got his GED but didn&#39;t complete college. He built up a business with his father and makes 6 figures a year. <br/>\nConnected by DROID on Verizon Wireless<br/>\n<br/>\n-----Original message-----<br/>\nFrom: Michele &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:michelewith3@...\">michelewith3@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Wed, Jun 8, 2011 00:40:57 GMT+00:00<br/>\nSubject: [unschoolingbasics] Only read if you have spare time/ not urgent<br/>\n<br/>\nYou all are such a wealth of inspiration and so thought provoking.  I have this letter (below) and was wondering if anyone wants to help me pick it apart. It is from my husband. He and I go back and forth about college. I am not against college at all and I have forwarded him many of the articles that were previously discussed here about zero free tuition and options.....  I don&#39;t know, I just want college to be an option, not a &#39;if you want a good job&#39; type of thing.  He went to college for his field and is Very successful and Loves what he does.  So he is pretty firm about it. <br/>\nI will be fine if no one writes, Honest! :-)  But if anyone wants to throw in a comment or two I would be pretty grateful. <br/>\n<br/>\nthis is the letter************************************************************************<br/>\n<br/>\nCollege grads in general make a lot more money than non college grads.  No question.<br/>\n                Why is that?  Because the people going to college (in general) have a goal / a motivation of having a good job   or better than average job to make better than average money.  In general .. people that don&#39;t want to go to college are less motivated about having a good job that pays well.  Being less motivated equals less money.  IN GENERAL<br/>\n <br/>\nCollege grads have more opportunities available to them.  No question. <br/>\n <br/>\nCollege grads have more doors put in front of them to be opened.  College students will hear of<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":416363734,"authorName":"Michele","from":"&quot;Michele&quot; &lt;michelewith3@...&gt;","profile":"jacobsen.michele","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Only read if you have spare time/ not urgent","postDate":"1307488149","msgId":46806,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzbWIybCs1Zjd2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":46807,"prevInTime":46805,"nextInTime":46807,"topicId":46806,"numMessagesInTopic":0,"msgSnippet":"You all are such a wealth of inspiration and so thought provoking.  I have this letter (below) and was wondering if anyone wants to help me pick it apart. It","messageBody":"<div id=\"ygrps-yiv-503305912\">You all are such a wealth of inspiration and so thought provoking.  I have this letter (below) and was wondering if anyone wants to help me pick it apart. It is from my husband. He and I go back and forth about college. I am not against college at all and I have forwarded him many of the articles that were previously discussed here about zero free tuition and options.....  I don&#39;t know, I just want college to be an option, not a &#39;if you want a good job&#39; type of thing.  He went to college for his field and is Very successful and Loves what he does.  So he is pretty firm about it. <br/>\nI will be fine if no one writes, Honest! :-)  But if anyone wants to throw in a comment or two I would be pretty grateful. <br/>\n<br/>\nthis is the letter************************************************************************<br/>\n<br/>\nCollege grads in general make a lot more money than non college grads.  No question.<br/>\n                Why is that?  Because the people going to college (in general) have a goal / a motivation of having a good job   or better than average job to make better than average money.  In general .. people that don&#39;t want to go to college are less motivated about having a good job that pays well.  Being less motivated equals less money.  IN GENERAL<br/>\n <br/>\nCollege grads have more opportunities available to them.  No question. <br/>\n <br/>\nCollege grads have more doors put in front of them to be opened.  College students will hear of jobs that they have never heard before = more &quot;doors&quot; = more opportunities.<br/>\n <br/>\nCollege grads have shown that they can complete projects and classes to a successful graduation.  Completing assignments and a diploma is important for many business owners. <br/>\n <br/>\nThe statistics about College Grads vs. Non College Grads is looking at the General Population.  No question that most people that don&#39;t go to college make much much less money.   No question.  I would even say that the 40% of college dropouts do better than the population that didn&#39;t even try to go to college.  AGAIN .. for the only reason of motivation.  They are slightly more motivated than the others to earn more money.   IN GENERAL.<br/>\n <br/>\n <br/>\nThe question is  can someone become successful or have a decent career without a college education  absolutely.   They need to be jazzed about something, motivated and want to continually learn and improve.   College isn&#39;t the ONLY way  but no one should fool themselves into dismissing college altogether.<br/>\n <br/>\n <br/>\nFor people that just want to earn 50,000 or less per year  they have to think about how they can afford a family, vacations, healthcare, retirement, cloths, food, cars etc.   Just doing what you want to do, following your passion DOES NOT automatically mean happiness. <br/>\n <br/>\n <br/>\n****************</div>","specialLinks":[]}],"prevTopicId":46812,"nextTopicId":46856}}