{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":279433414,"authorName":"lelania1","from":"&quot;lelania1&quot; &lt;ckmidwife@...&gt;","profile":"lelania1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: speech delay - problem or &#39;in-his-own-time&#39;? Need help","postDate":"1171733908","msgId":21497,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVyN2VpaytsNWo0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVyN2E1aCs2Y3I3QGVHcm91cHMuY29tPg=="},"prevInTopic":21494,"nextInTopic":0,"prevInTime":21496,"nextInTime":21498,"topicId":21437,"numMessagesInTopic":0,"msgSnippet":"I wanted to chime in with another validation of this experience. Neither of my brothers spoke a word until they were three, and one is headed to college next","messageBody":"<div id=\"ygrps-yiv-739316594\">I wanted to chime in with another validation of this experience. <br/>\nNeither of my brothers spoke a word until they were three, and one is <br/>\nheaded to college next year, the other is 14 and perfectly fine with <br/>\nspeech now, though he had really difficult speech until he was 6 or <br/>\nso. My first son also wasn&#39;t very verbal until around three, and has <br/>\na very large vocabularly and &quot;good speech&quot; whatever that means at age <br/>\n4. He had a stutter for a long while that is 98% gone, he had several <br/>\nclassic developmental mispronunciations that were pathologized by <br/>\nwell meaning speech people at parent events we went to, and 98% of <br/>\nthose are gone. My ped in NY wanted us to have all kinds of evals <br/>\ndone, but it never happened.<br/>\nMY ped here in PA could care less, and thinks people make a huge deal <br/>\nout of speech issues. He has been in practice for 30 years and can&#39;t <br/>\nunderstand why people react like they do. My second child just had <br/>\nhis two year check up, doesn&#39;t say any words really, and it wasn&#39;t <br/>\nperceived as a problem. This doesn&#39;t tell you anything about your <br/>\nspecific child I realize, but it might help put speech theories into <br/>\nperspective.<br/>\nIn the last ten years, I have seen a huge increase in referrals for <br/>\nkids to various therapists. While its great for kids with problems, I <br/>\nfeel like 1 out of 3 kids we know is getting some kind of <br/>\nintervention for a &quot;problem&quot; my own kid or one of my brothers has <br/>\nhad, and as far as I can tell they are all progressing roughly the <br/>\nsame with or without intervention. So I have gotten really skeptical <br/>\nabout this stuff.<br/>\ncarrie<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Hi Mara!  My 23mo old doesn&#39;t speak much either.  And the words she<br/>\n&gt; does use are quite hard to understand - more so than the others were<br/>\n&gt; at this age.  Like your son, she understands *everything* said to </span></blockquote></div>","specialLinks":[]},{"userId":291183126,"authorName":"Laurie","from":"&quot;Laurie&quot; &lt;unschoolingblogger@...&gt;","profile":"bieberl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: speech delay - problem or &#39;in-his-own-time&#39;? Need help","postDate":"1171729393","msgId":21494,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVyN2E1aCs2Y3I3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVyNXFqMCtpZHEzQGVHcm91cHMuY29tPg=="},"prevInTopic":21479,"nextInTopic":21497,"prevInTime":21493,"nextInTime":21495,"topicId":21437,"numMessagesInTopic":0,"msgSnippet":"Hi Mara!  My 23mo old doesn t speak much either.  And the words she does use are quite hard to understand - more so than the others were at this age.  Like","messageBody":"<div id=\"ygrps-yiv-674063561\">Hi Mara!  My 23mo old doesn&#39;t speak much either.  And the words she<br/>\ndoes use are quite hard to understand - more so than the others were<br/>\nat this age.  Like your son, she understands *everything* said to her<br/>\nso I&#39;m not concerned with her mental status.  If I really work with<br/>\nher to get her to say a word correctly, she can do that as well.  And<br/>\nI have tested her with whispers many times (and of course the<br/>\npediatrician&#39;s tests) to make sure it&#39;s not a hearing issue and she<br/>\ncan hear just great.  She also uses some signs.  I personally think my<br/>\nDD is just going at her own pace.  She does other things that are<br/>\n&#39;advanced&#39; (though I hate that word) for her age.  Such as, if I tell<br/>\nher to put something down, she has to go put it back right where she<br/>\nfound it.  It&#39;s almost eerie as my other kids haven&#39;t done that at<br/>\nthat age at all.  lol  So my theory is that she&#39;s just focusing on<br/>\nother things right now and she&#39;ll focus on speech when she gets to it.<br/>\n<br/>\nI recently heard a speech from a dentist that said sippy cups are<br/>\nbasically evil when it comes to speech (his wife is a speech<br/>\ntherapist) and he suggested getting them on straw cups and regular<br/>\ncups as soon as possible because they&#39;ve seen them have effects on<br/>\nteeth and speech in some kids.  Also to not let them wander around<br/>\nwith sippies all day - drinks in the kitchen or wherever you deem<br/>\nappropriate.  He said the sucking on the no-spill sippies forces<br/>\neverything in the jaw forward and they should get off of them asap for<br/>\ndental reasons.  Just something I thought I&#39;d pass along...take it or<br/>\nleave it.<br/>\n<br/>\nAlso, my brother didn&#39;t speak a word of English until he was 3 years<br/>\nold (except yes meant &#39;no&#39; and no meant &#39;yes&#39;, which drove my<br/>\ngrandfather crazy.  LOL).  He had his own language - our mother even<br/>\nhad a list of 30-40 words (and their counterparts) written down at one<br/>\npoint.  Narnu was &#39;horse&#39;, etc.  Oddly (lol), the day I came home from<br/>\nthe hospital, he started speaking english like everyone else.  lol  He<br/>\nis now a very accomplished speaker and writer and does movie reviews<br/>\nand works for CalTech.  My mother would interpret for him all the time<br/>\nwhen he had his own language.  He&#39;s always been very creative and is<br/>\ntalented in drawing, sculpting, computer graphics and writing.  Most<br/>\nof the time now, his writing is waaaaaay over my head.  lol<br/>\n<br/>\nIf you decide to do the speech program your dr is recommending...and<br/>\nit is involved with the school system, be sure to check it out<br/>\nthoroughly.  Some districts have full-time enrollment requirements<br/>\nassociated with speech class.  You might look around for someone in<br/>\nyour social groups who has worked with speech issues before.  Another<br/>\nmom in my MOPS group is an ex-speech therapist and has given out lots<br/>\nof advice and help.  So it might be good to look around if you&#39;re<br/>\nthinking of doing some kind of program.<br/>\n<br/>\nPerhaps it&#39;s just your DSs creativity showing early or with you and DH<br/>\nspeaking two different languages, he feels he wants HIS own language<br/>\ntoo.  ;) <br/>\n<br/>\nHope that helps!<br/>\nLaurie <br/>\n<br/>\n-- In<br/>\n<blockquote><span title=\"qreply\"> &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Mara &lt;mamadeluz@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; I have a<br/>\n&gt; &gt; now 29 mo. old son who is not saying much at this<br/>\n&gt; &gt; time. He does try and he does make up his own words<br/>\n&gt; &gt; for things. He is quick with signs and will also make<br/>\n&gt; &gt; up his own signs once I have run out. <br/>\n&gt; &gt; Mara<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":212831948,"authorName":"halfshadow1","from":"&quot;halfshadow1&quot; &lt;halfshadow1@...&gt;","profile":"halfshadow1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: speech delay - problem or &#39;in-his-own-time&#39;? Need help","postDate":"1171680672","msgId":21479,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVyNXFqMCtpZHEzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDcwMjE2MTczMzE0LjY3MzE5LnFtYWlsQHdlYjUzMjExLm1haWwueWFob28uY29tPg=="},"prevInTopic":21472,"nextInTopic":21494,"prevInTime":21478,"nextInTime":21480,"topicId":21437,"numMessagesInTopic":0,"msgSnippet":"-Hi, My son was speech delayed also. I was concerned and brought him to speech therapy however what she did wasn t anything i couldn t do with him. I read that","messageBody":"<div id=\"ygrps-yiv-397049820\">-Hi, My son was speech delayed also. I was concerned and brought him<br/>\nto speech therapy however what she did wasn&#39;t anything i couldn&#39;t do<br/>\nwith him. I read that speech delayed children start talking when they<br/>\nare 5 or 6 like everyone else. It didn&#39;t help me not to worry but like<br/>\neverything else it worked out on it&#39;s own..kwim? We used signs. For a<br/>\nlong time he would just make sounds, i&#39;m sure you know,lol. I wouldn&#39;t<br/>\nworry if i were you. My son talks all the time now :)-- In<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Mara &lt;mamadeluz@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Hi everyone,<br/>\n&gt;  I have an issue that has kept me wondering for some<br/>\n&gt; time, but I am not sure what to do about it. I have a<br/>\n&gt; now 29 mo. old son who is not saying much at this<br/>\n&gt; time. He does try and he does make up his own words<br/>\n&gt; for things. He is quick with signs and will also make<br/>\n&gt; up his own signs once I have run out. <br/>\n&gt; his doctor said that I should go and ask for early<br/>\n&gt; intervention and some program called &#39;ladders&#39;. Now I<br/>\n&gt; am wodering what they are and what  they could<br/>\n&gt; possibly do to help him that I am not already doing.<br/>\n&gt; We are a bilingual household (I speak German to him,<br/>\n&gt; my husband English). He has a few words in German, a<br/>\n&gt; few in English. Being unschoolers we spend the days<br/>\n&gt; together: reading books, playing, talking etc, etc.<br/>\n&gt; Others have remarked how he does not seem like a<br/>\n&gt; little kid, he likes to play with the big boys in our<br/>\n&gt; homeschooling group, dressing up as a knight and<br/>\n&gt; putting on swordfights, he  can follow and join in a<br/>\n&gt; simple boardgame, he can but together and play with te<br/>\n&gt; little lego pieces, he loves any kind of movement and<br/>\n&gt; is not developmentally behind on those levels. I know<br/>\n&gt; he understands everything and he can make himself<br/>\n&gt; understood to me and his brother and father. He hakes<br/>\n&gt; up words or signs for  things he does not know how to<br/>\n&gt; say (example: Ah! = Knight, UUah = Dragon, Blob =<br/>\n&gt; Water, a million variations on the word and<br/>\n&gt; pronunciation of the word baby, which could mean<br/>\n&gt; anything from I want to do this by myself, to I want<br/>\n&gt; to walk, to can I have this etc.). <br/>\n&gt; When he watches Dora he will shout out backpack<br/>\n&gt; (babab) or map etc.<br/>\n&gt; Recently he is trying to form more words, for schlafen<br/>\n&gt; he will just say ffff. <br/>\n&gt; Overall he is a very happy, curious, loving, open<br/>\n&gt; child who can follow long movies with rapt attention<br/>\n&gt; and his own comments. He just is not a &#39;talker&#39;. I see<br/>\n&gt; that he has some trouble acctually forming the words,<br/>\n&gt; but if you were to lets say sit down and try to have<br/>\n&gt; him repeat certain sound or words and correct him he<br/>\n&gt; does not like that. I do not want to make him feel<br/>\n&gt; that he is deficient in any way - is that not what<br/>\n&gt; those people would do? Look at him to see what was<br/>\n&gt; wrong with him? Or could they really offer something<br/>\n&gt; that I could not give him?<br/>\n&gt; Anyone advice is appreciated.<br/>\n&gt; Love to you all,<br/>\n&gt; Mara<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>____________________________________________________________________________________<br/>\n<blockquote><span title=\"qreply\"> &gt; We won&#39;t tell. Get more on shows you hate to love <br/>\n&gt; (and love to hate): Yahoo! TV&#39;s Guilty Pleasures list.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://tv.yahoo.com/collections/265\">http://tv.yahoo.com/collections/265</a><br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":284798598,"authorName":"Alice Roddy","from":"Alice Roddy &lt;amar0514412000@...&gt;","profile":"amar0514412000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: speech delay - problem or &#39;in-his-own-time&#39;? Need help","postDate":"1171668506","msgId":21472,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgyNTU0Ni44NDk0OS5xbUB3ZWI1ODUxMC5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":21463,"nextInTopic":21479,"prevInTime":21470,"nextInTime":21473,"topicId":21437,"numMessagesInTopic":0,"msgSnippet":"Mara, there is a book entitled ‘Late Talking Children’ by Thomas Sowell which may help you sort out your concerns. I’ve copied a review of it below. Hope","messageBody":"<div id=\"ygrps-yiv-1106741513\">Mara, there is a book entitled Late Talking Children by Thomas Sowell which may<br/>\nhelp you sort out your concerns. Ive copied a review of it below. Hope this helps.<br/>\n <br/>\n<br/>\n<br/>\n<br/>\nFrom Kirkus Reviews<br/>\n A father&#39;s first-person account of his<br/>\nyoung son&#39;s difficulties in learning to talk, his surprising disoveries<br/>\nabout other late talkers, and some intriguing speculation about the<br/>\ncauses of this problem. Although clearly a bright boy who understood<br/>\nwhen spoken to and who displayed unusual analytical abilities (as a<br/>\ntoddler, he managed to outwit a child-proof lock), Sowell&#39;s son John<br/>\ndid not speak until he was almost four years old. When Sowell, a Hoover<br/>\nInstitute senior fellow (Migrations and Culture, 1996, etc.), wrote<br/>\nabout his son in his syndicated newspaper column, dozens of parents of<br/>\nlate-talking children wrote to him. A support group of 55 families<br/>\nrepresenting 57 children eventually formed. Sowell follows the story of<br/>\nhis son John--now a successful computer scientist-- with numerous<br/>\nanecdotal accounts from these families&#39; letters. Seeing a pattern in<br/>\ntheir stories, Sowell sent out questionnaires in 1994 and 1996, and the<br/>\nresults of the longer 1996 survey are summarized here. He discovered<br/>\nthat most of the late talkers were boys, with especially good memories<br/>\nand puzzle-solving skills, that most were slow in their social<br/>\ndevelopment and late in toilet training, and that many had close<br/>\nrelatives who played musical instruments or were in analytical<br/>\nprofessions. Sowell, who is more anecdotal than scientific in his<br/>\napproach, is quick to acknowledge that his is a biased sample of late<br/>\ntalkers, but he asserts that both professionals and parents should be<br/>\naware of this pattern of mental abilities and family backgrounds. It<br/>\nmay be, he speculates, that some bright children are late in talking<br/>\nprecisely because the demands of their analytical abilities, localized<br/>\nin the left half of the brain, are being met at the expense of the<br/>\nspeech function. Children like his son, he warns, are frequently<br/>\nmisdiagnosed as retarded or autistic and thus risk being placed in<br/>\nspecial- education classes, from which release may be difficult. Hardly<br/>\ndefinitive, but should ease the minds of worried parents. -- Copyright ©1997, Kirkus Associates, LP. All rights reserved.<br/>\n  --This text refers to an out of print or unavailable edition of this title. <br/>\n <br/>\nAlice<br/>\nBreastfeeding is the biological norm for infants. It is a relationship that provides food, connection, protection from illness to the baby and stress reducing hormones to the mother.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\n8:00? 8:25? 8:40? Find a flick in no time <br/>\nwith the Yahoo! Search movie showtime shortcut.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tools.search.yahoo.com/shortcuts/#news\">http://tools.search.yahoo.com/shortcuts/#news</a></div>","specialLinks":[]},{"userId":96057767,"authorName":"Katharine Wise","from":"Katharine Wise &lt;katharinewise@...&gt;","profile":"katharinewise","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] speech delay - problem or &#39;in-his-own-time&#39;? Need help","postDate":"1171654785","msgId":21463,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0MTQyNC44NTQ5My5xbUB3ZWI2MDMyNC5tYWlsLnlhaG9vLmNvbT4="},"prevInTopic":21460,"nextInTopic":21472,"prevInTime":21462,"nextInTime":21464,"topicId":21437,"numMessagesInTopic":0,"msgSnippet":"I ve known bilingual children who were precocious talkers, but I think it s supposed to be more common for them to take longer initially to sort it all out. ","messageBody":"<div id=\"ygrps-yiv-66032080\">I&#39;ve known bilingual children who were precocious talkers, but I think it&#39;s supposed to be more common for them to take longer initially to sort it all out.<br/>\n<br/>\nYou could always meet with and talk to the speech therapist or whomever your doctor recommends by yourself (without ds) and find out what they&#39;d do and what they&#39;d recommend.  Then at least you&#39;d have that information to use in making a decision as to what you want to do with your son (nothing different, therapy, or modify some of your own interactions).  <br/>\n<br/>\nMy oldest had some speech delays.  When he was about 8, I guess, we did have him evaluated.  Our insurance would pay for the testing, but not therapy!  At that point he was old enough for me to explain to him, &quot;There are some sounds that are hard for you to say, but it also makes it hard for other people to understand you sometimes,&quot; and then he was willing for me to help him practice those sounds (mostly /th/) when they came up in normal conversation.  Didn&#39;t take long for him to get it.  According to the testing he also had some language delays, but I don&#39;t think those effect his everyday communication.  Besides, I had some issues with their validity.  For example, they asked him what &quot;to obey&quot; meant.  When they told me this, my first thought was, &quot;Well, we never use that word (unless it comes up in a book or something) so I don&#39;t think that&#39;s a good example for our family.&quot;  Then they told me his response:  to do what someone tells you to.  So then I was left wondering<br/>\n what on earth was wrong with that anyway?  I never asked.  (Too overwhelmed.)<br/>\n<br/>\nKatharine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\nDon&#39;t pick lemons.<br/>\nSee all the new 2007 cars at Yahoo! Autos.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://autos.yahoo.com/new_cars.html\">http://autos.yahoo.com/new_cars.html</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8667530,"authorName":"Manisha Kher","from":"Manisha Kher &lt;m_kher@...&gt;","profile":"m_kher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] speech delay - problem or &#39;in-his-own-time&#39;? Need help","postDate":"1171653477","msgId":21460,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgxOTg0NC43MzQ1NC5xbUB3ZWI1NDQwNi5tYWlsLnlhaG9vLmNvbT4=","inReplyToHeader":"PDIwMDcwMjE2MTczMzE0LjY3MzE5LnFtYWlsQHdlYjUzMjExLm1haWwueWFob28uY29tPg=="},"prevInTopic":21452,"nextInTopic":21463,"prevInTime":21459,"nextInTime":21461,"topicId":21437,"numMessagesInTopic":0,"msgSnippet":"... I ... I think he just needs time. 29 months is really young and many kids, especially boys are not talking at that age. If you re concerned get his hearing","messageBody":"<div id=\"ygrps-yiv-1198391098\">--- Mara &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamadeluz@...\">mamadeluz@...</a>&gt; wrote:<br/>\n<br/>\n I<br/>\n<blockquote><span title=\"ireply\"> &gt; see<br/>\n&gt; that he has some trouble acctually forming the<br/>\n&gt; words,<br/>\n&gt; but if you were to lets say sit down and try to have<br/>\n&gt; him repeat certain sound or words and correct him he<br/>\n&gt; does not like that. I do not want to make him feel<br/>\n&gt; that he is deficient in any way - is that not what<br/>\n&gt; those people would do? Look at him to see what was<br/>\n&gt; wrong with him? Or could they really offer something<br/>\n&gt; that I could not give him?<br/>\n </span></blockquote>I think he just needs time. 29 months is really young<br/>\nand many kids, especially boys are not talking at that<br/>\nage. If you&#39;re concerned get his hearing tested. But<br/>\nit sounds like he has no problem understanding<br/>\nlanguage.<br/>\n<br/>\nMy son was a late talker. He was in early intervention<br/>\nbecause he was developmentally behind in many ways.<br/>\nEarly intervention ends when the kid turns 3. The EI<br/>\nfolks wanted us to put him in the school system for<br/>\nspeech therapy. I was more worried about the messages<br/>\nhe might get about being &quot;not good enough&quot;. We decided<br/>\nto give it time and his speech caught up by and by.<br/>\n<br/>\nManisha<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\nDo you Yahoo!?<br/>\nEveryone is raving about the all-new Yahoo! Mail beta.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://new.mail.yahoo.com\">http://new.mail.yahoo.com</a></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] speech delay - problem or &#39;in-his-own-time&#39;? Need help","postDate":"1171648575","msgId":21452,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOTIwMEFFMkZCRDg0QS0xRjg0LTExMTJAV0VCTUFJTC1SQTE2LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PDIwMDcwMjE2MTczMzE0LjY3MzE5LnFtYWlsQHdlYjUzMjExLm1haWwueWFob28uY29tPg=="},"prevInTopic":21450,"nextInTopic":21460,"prevInTime":21451,"nextInTime":21453,"topicId":21437,"numMessagesInTopic":0,"msgSnippet":"... From: mamadeluz@yahoo.com Hi everyone, I have an issue that has kept me wondering for some time, but I am not sure what to do about it. I have a now 29 mo.","messageBody":"<div id=\"ygrps-yiv-1595678349\">-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamadeluz@...\">mamadeluz@...</a><br/>\n   Hi everyone,<br/>\n I have an issue that has kept me wondering for some<br/>\ntime, but I am not sure what to do about it. I have a<br/>\nnow 29 mo. old son who is not saying much at this<br/>\ntime. He does try and he does make up his own words<br/>\nfor things. He is quick with signs and will also make<br/>\nup his own signs once I have run out.<br/>\nhis doctor said that I should go and ask for early<br/>\nintervention and some program called &#39;ladders&#39;. Now I<br/>\nam wodering what they are and what  they could<br/>\npossibly do to help him that I am not already doing.<br/>\nWe are a bilingual household (I speak German to him,<br/>\nmy husband English). He has a few words in German, a<br/>\nfew in English. Being unschoolers we spend the days<br/>\ntogether: reading books, playing, talking etc, etc.<br/>\nOthers have remarked how he does not seem like a<br/>\nlittle kid, he likes to play with the big boys in our<br/>\nhomeschooling group, dressing up as a knight and<br/>\nputting on swordfights, he  can follow and join in a<br/>\nsimple boardgame, he can but together and play with te<br/>\nlittle lego pieces, he loves any kind of movement and<br/>\nis not developmentally behind on those levels. I know<br/>\nhe understands everything and he can make himself<br/>\nunderstood to me and his brother and father. He hakes<br/>\nup words or signs for  things he does not know how to<br/>\nsay (example: Ah! = Knight, UUah = Dragon, Blob =<br/>\nWater, a million variations on the word and<br/>\npronunciation of the word baby, which could mean<br/>\nanything from I want to do this by myself, to I want<br/>\nto walk, to can I have this etc.).<br/>\nWhen he watches Dora he will shout out backpack<br/>\n(babab) or map etc.<br/>\nRecently he is trying to form more words, for schlafen<br/>\nhe will just say ffff.<br/>\nOverall he is a very happy, curious, loving, open<br/>\nchild who can follow long movies with rapt attention<br/>\nand his own comments. He just is not a &#39;talker&#39;. I see<br/>\nthat he has some trouble acctually forming the words,<br/>\nbut if you were to lets say sit down and try to have<br/>\nhim repeat certain sound or words and correct him he<br/>\ndoes not like that. I do not want to make him feel<br/>\nthat he is deficient in any way - is that not what<br/>\nthose people would do? Look at him to see what was<br/>\nwrong with him? Or could they really offer something<br/>\nthat I could not give him?<br/>\nAnyone advice is appreciated.<br/>\nLove to you all,<br/>\nMara<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nWe lived in Germany when Cameron was born. He was a late talker too. <br/>\nOur home was bilingual as well. When Ben was home, we spoke English. <br/>\nWhen Cameron and I were alone, it was mostly German---and of course all <br/>\nthe neighbors and shopkeepers spoke German to him.<br/>\n<br/>\nHe understood *everything* but didn&#39;t speak. He&#39;d smile. And nod. &lt;g&gt;<br/>\n<br/>\nThen the words he DID choose to say first were the same in both <br/>\nlanguages: ball, auto, hand, glass, shoe. &lt;g&gt;<br/>\n<br/>\nSo I think it was just a LOT to digest. He found it easiest to work <br/>\nwith what he KNEW. He&#39;s always been like that though---he&#39;d concentrate <br/>\nfor a really long time on something---and it would seem (to me) as if <br/>\nhe&#39;d never get it. Then ploetzlich &lt;g&gt; he&#39;d HAVE it. And WELL.<br/>\n<br/>\nAs long as you know that his hearing is OK, I&#39;d just keep doing what <br/>\nyou&#39;re doing. Maybe examine the words he DOES say well---are they the <br/>\nsame in both languages?<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nCheck out the new AOL.  Most comprehensive set of free safety and <br/>\nsecurity tools, free access to millions of high-quality videos from <br/>\nacross the web, free AOL Mail and more.</div>","specialLinks":[]},{"userId":133390932,"authorName":"Mara","from":"Mara &lt;mamadeluz@...&gt;","profile":"mamadeluz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[unschoolingbasics] speech delay - problem or &#39;in-his-own-time&#39;? Need help","postDate":"1171647194","msgId":21450,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwMjE2MTczMzE0LjY3MzE5LnFtYWlsQHdlYjUzMjExLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDQ1RDQ4NDBGLjgwNzA0MDdAY29tY2FzdC5uZXQ+"},"prevInTopic":21438,"nextInTopic":21452,"prevInTime":21449,"nextInTime":21451,"topicId":21437,"numMessagesInTopic":0,"msgSnippet":"Hi everyone, I have an issue that has kept me wondering for some time, but I am not sure what to do about it. I have a now 29 mo. old son who is not saying","messageBody":"<div id=\"ygrps-yiv-1486737732\">Hi everyone,<br/>\n I have an issue that has kept me wondering for some<br/>\ntime, but I am not sure what to do about it. I have a<br/>\nnow 29 mo. old son who is not saying much at this<br/>\ntime. He does try and he does make up his own words<br/>\nfor things. He is quick with signs and will also make<br/>\nup his own signs once I have run out. <br/>\nhis doctor said that I should go and ask for early<br/>\nintervention and some program called &#39;ladders&#39;. Now I<br/>\nam wodering what they are and what  they could<br/>\npossibly do to help him that I am not already doing.<br/>\nWe are a bilingual household (I speak German to him,<br/>\nmy husband English). He has a few words in German, a<br/>\nfew in English. Being unschoolers we spend the days<br/>\ntogether: reading books, playing, talking etc, etc.<br/>\nOthers have remarked how he does not seem like a<br/>\nlittle kid, he likes to play with the big boys in our<br/>\nhomeschooling group, dressing up as a knight and<br/>\nputting on swordfights, he  can follow and join in a<br/>\nsimple boardgame, he can but together and play with te<br/>\nlittle lego pieces, he loves any kind of movement and<br/>\nis not developmentally behind on those levels. I know<br/>\nhe understands everything and he can make himself<br/>\nunderstood to me and his brother and father. He hakes<br/>\nup words or signs for  things he does not know how to<br/>\nsay (example: Ah! = Knight, UUah = Dragon, Blob =<br/>\nWater, a million variations on the word and<br/>\npronunciation of the word baby, which could mean<br/>\nanything from I want to do this by myself, to I want<br/>\nto walk, to can I have this etc.). <br/>\nWhen he watches Dora he will shout out backpack<br/>\n(babab) or map etc.<br/>\nRecently he is trying to form more words, for schlafen<br/>\nhe will just say ffff. <br/>\nOverall he is a very happy, curious, loving, open<br/>\nchild who can follow long movies with rapt attention<br/>\nand his own comments. He just is not a &#39;talker&#39;. I see<br/>\nthat he has some trouble acctually forming the words,<br/>\nbut if you were to lets say sit down and try to have<br/>\nhim repeat certain sound or words and correct him he<br/>\ndoes not like that. I do not want to make him feel<br/>\nthat he is deficient in any way - is that not what<br/>\nthose people would do? Look at him to see what was<br/>\nwrong with him? Or could they really offer something<br/>\nthat I could not give him?<br/>\nAnyone advice is appreciated.<br/>\nLove to you all,<br/>\nMara<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\nWe won&#39;t tell. Get more on shows you hate to love <br/>\n(and love to hate): Yahoo! TV&#39;s Guilty Pleasures list.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tv.yahoo.com/collections/265\">http://tv.yahoo.com/collections/265</a></div>","specialLinks":[]},{"userId":125711294,"authorName":"Amy Mason","from":"Amy Mason &lt;doodlemakers@...&gt;","profile":"doodlemakers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] New magazine","postDate":"1171555343","msgId":21438,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1RDQ4NDBGLjgwNzA0MDdAY29tY2FzdC5uZXQ+","inReplyToHeader":"PGVyMW5qMCt1MjZxQGVHcm91cHMuY29tPg==","referencesHeader":"PGVyMW5qMCt1MjZxQGVHcm91cHMuY29tPg=="},"prevInTopic":21437,"nextInTopic":21450,"prevInTime":21437,"nextInTime":21439,"topicId":21437,"numMessagesInTopic":0,"msgSnippet":"How timely...I ve been tossing and turning over whether or not to subscribe to a magazine, and if so, which one.  I love the looks of the unschooling one Live","messageBody":"<div id=\"ygrps-yiv-172528770\">How timely...I&#39;ve been tossing and turning over whether or not to <br/>\nsubscribe to a magazine, and if so, which one.  I love the looks of the <br/>\nunschooling one &quot;Live Free Learn Free&quot;, I also love &quot;Mother Earth News&quot;, <br/>\n&quot;Green Guide&quot; and &quot;Natural Home&quot;, &quot;Mothering&quot;...how to decide?  This <br/>\nKite one looks wonderful because it combines everything I love....more <br/>\ndecisions to be made...ugh!<br/>\nThanks for sharing<br/>\nAmy</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"New magazine","postDate":"1171546528","msgId":21437,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVyMW5qMCt1MjZxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":21438,"prevInTime":21436,"nextInTime":21438,"topicId":21437,"numMessagesInTopic":0,"msgSnippet":"Hey all you writers...this might be of interest to you. I got this email yesterday and thought some of you might want to know about it: name = Kite Magazine ","messageBody":"<div id=\"ygrps-yiv-55917231\">Hey all you writers...this might be of interest to you. I got this<br/>\nemail yesterday and thought some of you might want to know about it:<br/>\n<br/>\nname = Kite Magazine<br/>\nemail = <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hello@...\">hello@...</a><br/>\ncomments = Hi, I&#39;m Kay, the editor of Kite magazine.  Kite is a new<br/>\npublication <br/>\ndesigned to inspire people to live healthy, free, creative, meaningful<br/>\nlives.  <br/>\nKite is seeking contributors with a story to tell...people who are<br/>\nliving their <br/>\npassion and would like to encourage others to trust in and follow<br/>\ntheir own <br/>\npaths.<br/>\n<br/>\nSome of the topics Kite will be exploring include non-toxic living, whole <br/>\nfoods/vegan nutrition, self-healing, attachment parenting,<br/>\nunschooling, home <br/>\nbirthing and unassisted birthing, adoption, creative arts, manifestation, <br/>\nmind/soul/body connection, etc. <br/>\n<br/>\nIf you would be interested in contributing (or know anyone else who<br/>\nwould!) we&#39;d <br/>\nlove to hear from you!  All submissions are welcome...articles and<br/>\nessays, <br/>\nstories, art, recipes, craft tutorials, etc.  For further information<br/>\non the <br/>\nmagazine and submission details, please visit Kite online at: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://ReadKite.com\">http://ReadKite.com</a><br/>\n<br/>\nThank you...have a beautiful day!  <br/>\n<br/>\nKay Earnshaw, Editor<br/>\nKite Magazine<br/>\nWebsite: ReadKite.com<br/>\nEmail: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hello@...\">hello@...</a></div>","specialLinks":[]}],"prevTopicId":21490,"nextTopicId":21484}}