{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":140,"messages":[{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Reading","postDate":"1207744267","msgId":31688,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ0aWN1Yit0Z2N0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDliY2E5ZTMwODA0MDgyMDU3djE1NTBiMzkxdjJlZTdkZjhiYzZhYzdhYzhAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":31686,"nextInTopic":31689,"prevInTime":31687,"nextInTime":31689,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"~~That s just false. In order to become a proficient reader, one needs to know all of the things I mentioned.~~ Bullshit. Jared knew entire words and read just","messageBody":"<div id=\"ygrps-yiv-58707417\">~~That&#39;s just false. In order to become a proficient reader, one needs<br/>\nto know all of the things I mentioned.~~<br/>\n<br/>\nBullshit.<br/>\nJared knew entire words and read just fine and still didn&#39;t know the<br/>\nindividual letter sounds. <br/>\n<br/>\nKeep holding onto that if it makes you feel better. But it&#39;s really<br/>\njust a bunch of schoolish crap that is unecessary and isn&#39;t helping<br/>\nanyone understand unschooling.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":333194003,"authorName":"Kim Musolff","from":"&quot;Kim Musolff&quot; &lt;kmoose75@...&gt;","profile":"little_minds_preschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Reading","postDate":"1207714518","msgId":31686,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDliY2E5ZTMwODA0MDgyMTE1djNlMDEwNGQ1bTQwYmUyOGI0YjAxNDRkNmJAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGZ0aDFzcitrZ2cyQGVHcm91cHMuY29tPg==","referencesHeader":"PDliY2E5ZTMwODA0MDgwOTUzajYzMTExZjA5eDZiODQwN2U5MTYxMDU5ZGVAbWFpbC5nbWFpbC5jb20+CSA8ZnRoMXNyK2tnZzJAZUdyb3Vwcy5jb20+"},"prevInTopic":31685,"nextInTopic":31688,"prevInTime":31685,"nextInTime":31687,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"Schools are not bad. They have good intentions. ... It s funny that you d write this today. A therapist told me today that most kids feel good about themselves","messageBody":"<div id=\"ygrps-yiv-760825794\">Schools are not bad. They have good intentions.<br/>\n<blockquote><span title=\"ireply\"> &gt; Kim<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>It&#39;s funny that you&#39;d write this today. A therapist told me today that<br/>\nmost kids feel good about themselves until they go to first grade.<br/>\n<br/>\nI&#39;d believe that!  So many kids at school have low self esteem.  I didn&#39;t<br/>\nmean that school are not bad for our children (that&#39;s why I pulled my kids<br/>\nout!).  I meant that schools are not intentionally trying to mess these<br/>\nchildren up.<br/>\n<br/>\nKim<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":333194003,"authorName":"Kim Musolff","from":"&quot;Kim Musolff&quot; &lt;kmoose75@...&gt;","profile":"little_minds_preschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Reading","postDate":"1207713421","msgId":31685,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDliY2E5ZTMwODA0MDgyMDU3djE1NTBiMzkxdjJlZTdkZjhiYzZhYzdhYzhAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGZ0Z3IyYStxaG01QGVHcm91cHMuY29tPg==","referencesHeader":"PDAwYjUwMWM4OTliNiRjYmU2MTQxMCQ1MGZlYThjMEB1bHJpa2VhZjEyZmFmYT4JIDxmdGdyMmErcWhtNUBlR3JvdXBzLmNvbT4="},"prevInTopic":31684,"nextInTopic":31686,"prevInTime":31684,"nextInTime":31686,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"Even IF these processes needed to be in place before one can read, one would most certainly not need the above names for them NOR the awareness that they","messageBody":"<div id=\"ygrps-yiv-943737900\">Even IF these &quot;processes&quot; needed to be in place before one can read,<br/>\none would most certainly not need the above names for them NOR the<br/>\nawareness that they knew it.<br/>\nI really wasn&#39;t saying that we needed the names for the process.  I was<br/>\nsimply debating the fact that reading (like unschooling or talking or<br/>\nlearning anything, really) has a process.  Everything we learn has a<br/>\nprocess.<br/>\n<br/>\nBut I don&#39;t believe the above need to exist in the learner in order to<br/>\nread. My Jared NEVER learned any kind of phonics.<br/>\nThat&#39;s just false.  In order to become a proficient reader, one needs to<br/>\nknow all of the things I mentioned.  I wasn&#39;t saying that we need to &quot;teach&quot;<br/>\nthese things, or that we even need to know these things.  Just that they<br/>\nexist as part of the process of reading.  If your son reads, then he knows<br/>\nphonics.  He doesn&#39;t have to be &quot;taught&quot; phonics or even verbalize phonics<br/>\nrules.  But he does know phonics if he reads.  (and if he doesn&#39;t now, he<br/>\nwill know it at some point.)  English is an alphabetic language, not a<br/>\nsymbolic one.  In order to read new words, we must know how to sound them<br/>\nout.  We do this even as adults.  (Try reading the ingredients on the back<br/>\nof your shampoo bottle!)<br/>\n<br/>\nThey don&#39;t need to know anything about what you printed. They need to<br/>\nbe trusted. Reading isn&#39;t really this big magical thing people make it<br/>\nout to be. Your child learned to speak an entire language without<br/>\nknowing &quot;processes&quot;, why wouldn&#39;t they learn other things the same way?<br/>\nI explained above why I believe that they do need to know what I printed in<br/>\norder to read.  However, I agree with you about the rest.  Just because<br/>\nthere is a process, doesn&#39;t mean that we need to know it.  My son will tell<br/>\nyou that he learned to read on his own, because I didn&#39;t push or name this<br/>\nprocess.  (Though I can&#39;t help knowing what I already know.)  I really do<br/>\nbelieve that if you trust children to learn on their own, they will learn.<br/>\nJust like when they learned to talk.  There is so much pressure on schools<br/>\nto &quot;teach&quot; reading, that I think that pressure is put on parents as well.<br/>\nNo one pressures us to &quot;teach&quot; our children to talk, so we don&#39;t push it.<br/>\nBut when people think of learning to read, they get nervous if their child<br/>\ndoesn&#39;t know how to do it yet.<br/>\n<br/>\nHelping people understand what learning looks like in unschooling<br/>\nhomes is more helpful than posting all about what kids &quot;need&quot; to<br/>\nunderstand in order to learn certain things.<br/>\nMy point wasn&#39;t what children &quot;need&quot; to know, it was that there is a process<br/>\nto reading.  Isn&#39;t that helpful to know that reading is a process?  Children<br/>\ndon&#39;t just read or not read.  It is a process.  Just like I don&#39;t fully<br/>\ngrasp unschooling all the way.  I&#39;m in the middle of the process of learning<br/>\nhow to implement unschooling into my life.  When I first understood that it<br/>\nis a PROCESS (unschooling), I felt so much better about not knowing<br/>\neverything there is to know about unschooling.  I realized that it will come<br/>\neventually, in its own natural path.<br/>\n<br/>\nI figured it would be helpful if people, who are worried about their<br/>\nchildren&#39;s reading journey, understood that reading is a process.  Maybe<br/>\ntheir child is in the middle of that process right now, and if they<br/>\nrecognize that, they can relax a little.  (I understand the point of<br/>\nunschooling is to NOT worry about what your child is learning in the first<br/>\nplace, but in reality, we do worry when our child isn&#39;t reading--especially<br/>\nthose of us just beginning this journey.)<br/>\n<br/>\nI totally disagree with the concept that school isn&#39;t all bad and they<br/>\nsimply fail to meet individual needs. I think teaching is harmful in<br/>\ngeneral because it places the power outside the individual. What it<br/>\nreally teaches them is that they NEED to be taught in order to learn!<br/>\nIt&#39;s harmful and demoralizing and schools are feeding that harm every day.<br/>\nI agree.  That&#39;s why I don&#39;t send my children to school.  But many people<br/>\ndo--some of them feel like they have no choice but to send their children to<br/>\nschool.  And I really don&#39;t believe that teachers and school authorities are<br/>\nbad in nature.  If someone gave me a classroom full of kids and told me to<br/>\nteach them to read, I would probably end up doing what they do in schools.<br/>\nIt&#39;s not ideal, or even the best senerio.  But if these kids have to go to<br/>\nschool, that&#39;s how they&#39;ll have to learn.  Some do learn.  And some don&#39;t.<br/>\nThe teachers there are doing the best that they can, with what they know.<br/>\n<br/>\nUnschoolers are living as if school and it&#39;s &quot;processes&quot; didn&#39;t exist.<br/>\nBut schools (and their processes) DO exist.  Many people on this list are<br/>\nhere because they love the idea of unschooling, but are very aware that they<br/>\nare going against mainstream society&#39;s beliefs about education.  They<br/>\nbelieve that unschooling is the right thing to do, but have questions<br/>\nregarding what they&#39;ve been &quot;taught&quot; about education and learning, etc.  I<br/>\nthink it is very important to have discussions about unschooling vs. school<br/>\nand the difference in their philosophies about learning.  I assumed that<br/>\nthis list was the forum to do that.  If not, I sincerely apologize and I<br/>\nwill find a more appropriate place to do that.<br/>\n<br/>\nI wasn&#39;t trying to start a fight here, I am trying to understand unschooling<br/>\nin a way that is meaningful to me (and hopefully others out there).   Being<br/>\na former teacher, education and learning is what I know (or thought I<br/>\nknew!).  That is the place I am coming from as I start my journey to<br/>\nunschool.  WHile I generally agree with the unschooling philosophy, there<br/>\nare obviously some points that go against what I believe to be true.  I<br/>\nfully understand that when I post some of the things that I&#39;ve posted here,<br/>\nI will get an opposing viewpoint.  That&#39;s why I do it.  I need to hear that<br/>\nviewpoint, so that I can choose for myself if I want to keep or change my<br/>\nviewpoint.<br/>\n<br/>\nSorry if I offended...<br/>\n<br/>\nKim<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":220015843,"authorName":"Kristie Cochran","from":"Kristie Cochran &lt;kristiecochran@...&gt;","profile":"kristiecochran","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Reading","postDate":"1207706318","msgId":31682,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3RkMyMkNFLjUwNzA5MDBAY294Lm5ldD4="},"prevInTopic":31680,"nextInTopic":31684,"prevInTime":31681,"nextInTime":31683,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"Jodi, I haven t read the responses to this question yet, but just wanted to share that I m not really sure how my 6yo learned to read.  I sort of found out he","messageBody":"<div id=\"ygrps-yiv-1909909024\">Jodi,<br/>\n<br/>\nI haven&#39;t read the responses to this question yet, but just wanted to <br/>\nshare that I&#39;m not really sure how my 6yo learned to read.  I sort of <br/>\nfound out he could read by accident.  I will tell you that he asked a <br/>\nlot of questions, &quot;What does this say?!!&quot; and I would answer him and <br/>\nread what he wanted me to read (mostly stuff on his video games).  I was <br/>\nreally frustrated with him one day because he got a new game and I <br/>\ndownloaded a walkthru for him and he kept asking me every 2 minutes, <br/>\n&quot;What do I do next?&quot;   And finally I said, exasperatedly, &quot;What does <br/>\nthis say??!!!&quot; and he read the sentence to me. I couldn&#39;t believe it!  I <br/>\nwas in total shock and awe.  Video game walkthrus are written by <br/>\nteenagers and older kids/people, so this wasn&#39;t like he was reading an <br/>\n&quot;early reader&quot; book.  These were big and hard words.  He still amazes me <br/>\nby what he can read.<br/>\n<br/>\nSo, hope this gives you a little insight into &quot;how&quot; unschoolers learn to <br/>\nread.  We basically just read to our kids and answer their questions.  I <br/>\ndon&#39;t make my kid sound out words, he doesn&#39;t really know how to do that.<br/>\n<br/>\nKristie<br/>\n<br/>\n<br/>\n<br/>\nAll this is really just blah blah blah to me. I&#39;m reading loads of <br/>\ninformation about the flawed way schools &quot;teach&quot; kids to read here. I&#39;m <br/>\n*so* much more interested in hearing how unschoolers &quot;learn&quot; to read.<br/>\n<br/>\nJodi</div>","specialLinks":[]},{"userId":326163661,"authorName":"Mamachaos","from":"&quot;Mamachaos&quot; &lt;mamachaos@...&gt;","profile":"ron_monach","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Reading","postDate":"1207703403","msgId":31684,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNGYwMWM4OTlkZSQ3NTQ1ZmU5MCQ0NDAxYThjMEByb251MmZpczR0OHNrOD4="},"prevInTopic":31682,"nextInTopic":31685,"prevInTime":31683,"nextInTime":31685,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"All this is really just blah blah blah to me. I m reading loads of information about the flawed way schools teach kids to read here. I m *so* much more","messageBody":"<div id=\"ygrps-yiv-1787796933\">All this is really just blah blah blah to me. I&#39;m reading loads of information about the flawed way schools &quot;teach&quot; kids to read here. I&#39;m *so* much more interested in hearing how unschoolers &quot;learn&quot; to read.<br/>\n<br/>\n<br/>\n<br/>\nJodi~<br/>\n<br/>\nI have had a year of unschooling my 5, 8 and 13 year old.  I was home-schooling before that.  I did introduce the alphabet to my 8 year old last year.  I did it &quot;the waldorf way&quot;, which is drawing pictures and telling a story for each letter.  Like a long wonderful story about a Mountain, and all the marvelous magicians that gathered there each Hallow&#39;s Eve.  I drew the picture so that the mountain looked like an M--sort of.  I left it at that.  I did not bring awareness to my hidden M, but just drew the picture while I told the stories with lots of M words mixed in (15 minutes or so).  The next day, I finally drew attention to the M, and he loved every letter like this.  After the letters were introduced, he wanted to &quot;learn to read&quot;.  So, I bought &quot;Teach Your Child to Read in 100 Easy Lessons.&quot;  He chose it.  He loved it and did 88 lessons this year and then declared &quot;I do not EVER want to do another lesson.  I do not need nor want you to &quot;teach&quot; me anything more.  I do not EVER want to do anything that is like School again, and I know how to read.&quot;  WOW.  I had thought he had enjoyed himself, as he was happy during and after these 15 minute &quot;lessons&quot;.<br/>\n<br/>\nSo, guess what?  I have not done another thing.  That was 3 months ago, and he reads everything he sees....he tries.  The book gave him the basic sounds, not really phonics, but more base sounds and allowed a lot of reading to occur with the new found sounds.  The stories were funny, not dumb.  Anyway, I watch closed caption TV at night when I go to bed, and since we all share the same bedroom for sleeping (this is an ebb and flow in itself!), he reads as much as he can from that, and only gets a few words before they disappear and are replaced with others.  He seems to be doing very well!  He is motivated to read those words, as he loves TV at night---like I might be watching Numbers, or the News (edited to not have the gore--I change the channel) and he loves to feel more grown up and read all about it.<br/>\n<br/>\nHe reads and spells so he can search for Star Wars toys on the Internet and I read to him, he listens to Stories on CD a lot as well.  He has no interest in sitting down &quot;to read&quot; nor writing anything at all.  I cringe, I am not used to letting things BE.  I am trying to allow, to adjust, to BE myself so that they can BE themselves.  I do see though, that he is persisting ALL ON HIS OWN.  Just like when he learned to talk.  It is really exactly the SAME process.  And the 5 year old is following behind.  Asking all the time...&quot;how do you spell GIVE BACK?&quot; for instance.  I tell him, I sound out the letters a bit......some he guesses, we refer to all letters at pictures, like A is teepee, E is a diving board for all 3 brothers, M, mountain, N-nightcrawler, B-big belly B, D-Door etc.  It makes it fun, not schoolish work.<br/>\n<br/>\n<br/>\nKelley<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandandstardust.blogspot.com/\">http://sandandstardust.blogspot.com/</a><br/>\n<br/>\n<br/>\n&quot;Childhood is a journey, not a race.&quot;<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":332901363,"authorName":"keetry","from":"&quot;keetry&quot; &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Reading","postDate":"1207700187","msgId":31680,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ0aDFzcitrZ2cyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDliY2E5ZTMwODA0MDgwOTUzajYzMTExZjA5eDZiODQwN2U5MTYxMDU5ZGVAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":31679,"nextInTopic":31682,"prevInTime":31679,"nextInTime":31681,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"... It s funny that you d write this today. A therapist told me today that most kids feel good about themselves until they go to first grade. That s a pretty","messageBody":"<div id=\"ygrps-yiv-2057121368\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Kim Musolff&quot; &lt;kmoose75@...&gt; <br/>\nwrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Schools are not bad.  They have good intentions.  <br/>\n&gt; Kim<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>It&#39;s funny that you&#39;d write this today. A therapist told me today that <br/>\nmost kids feel good about themselves until they go to first grade. <br/>\nThat&#39;s a pretty sad statement about school. I wonder if it occurs to <br/>\nanyone in school that it might be school that&#39;s making kids feel bad <br/>\nabout themselves.<br/>\n<br/>\nAlysia</div>","specialLinks":[]},{"userId":332901363,"authorName":"keetry","from":"&quot;keetry&quot; &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Reading","postDate":"1207697832","msgId":31679,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ0Z3ZqOCtmODBmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDQTY3ODVFNjZERjAwQi1BQTQtRUU2QEZXTS1EMjEuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":31677,"nextInTopic":31680,"prevInTime":31678,"nextInTime":31680,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"... I ve had a couple of people tell me they ve read that you don t even necessarily have to read with or in front of your children. All you have to do is have","messageBody":"<div id=\"ygrps-yiv-1587642103\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, kbcdlovejo@... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I <br/>\n&gt; can tell you the secret to reading though. SHSHSHSHSHSHHHHH....<br/>\n&gt; <br/>\n&gt; It&#39;s having lots of printed materials around. <br/>\n&gt; ~Kelly<br/>\n&gt; <br/>\n&gt; Kelly Lovejoy<br/>\n&gt; Conference Coordinator<br/>\n&gt; Live and Learn Unschooling Conference<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I&#39;ve had a couple of people tell me they&#39;ve read that you don&#39;t even <br/>\nnecessarily have to read with or in front of your children. All you <br/>\nhave to do is have printed materials around and they will be <br/>\ninterested and learn to read. Anyone else know anything about that?<br/>\n<br/>\nAlysia</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Reading","postDate":"1207693194","msgId":31676,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ0Z3IyYStxaG01QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwYjUwMWM4OTliNiRjYmU2MTQxMCQ1MGZlYThjMEB1bHJpa2VhZjEyZmFmYT4="},"prevInTopic":31675,"nextInTopic":31677,"prevInTime":31675,"nextInTime":31677,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"~~But there IS a process.  Before children can learn to read, they need to understand print knowledge (directionality, word-picture match, one-to-one","messageBody":"<div id=\"ygrps-yiv-627375217\">~~But there IS a process.  Before children can learn to read, they<br/>\nneed to understand print knowledge (directionality, word-picture<br/>\nmatch, one-to-one correspondance, etc.), phonics, decoding strategies,<br/>\nand comprehension.~~<br/>\n<br/>\nYou&#39;re really convinced of this, I can see.<br/>\nI&#39;m not.<br/>\n<br/>\nEven IF these &quot;processes&quot; needed to be in place before one can read,<br/>\none would most certainly not need the above names for them NOR the<br/>\nawareness that they knew it.<br/>\n<br/>\nBut I don&#39;t believe the above need to exist in the learner in order to<br/>\nread. My Jared NEVER learned any kind of phonics. In fact, the few<br/>\ntimes he asked about letter sounds it just confused the heck out of<br/>\nhim. Learning whole words seems to be the way he learned best (no big<br/>\nsurprise since he memorized hundreds of symbols in pokemon and other<br/>\ngames).<br/>\n<br/>\nThey don&#39;t need to know anything about what you printed. They need to<br/>\nbe trusted. Reading isn&#39;t really this big magical thing people make it<br/>\nout to be. Your child learned to speak an entire language without<br/>\nknowing &quot;processes&quot;, why wouldn&#39;t they learn other things the same way?<br/>\n<br/>\nHelping people understand what learning looks like in unschooling<br/>\nhomes is more helpful than posting all about what kids &quot;need&quot; to<br/>\nunderstand in order to learn certain things.<br/>\n<br/>\nI totally disagree with the concept that school isn&#39;t all bad and they<br/>\nsimply fail to meet individual needs. I think teaching is harmful in<br/>\ngeneral because it places the power outside the individual. What it<br/>\nreally teaches them is that they NEED to be taught in order to learn!<br/>\nIt&#39;s harmful and demoralizing and schools are feeding that harm every day.<br/>\n<br/>\nUnschoolers are living as if school and it&#39;s &quot;processes&quot; didn&#39;t exist.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":46477013,"authorName":"Ulrike Haupt","from":"&quot;Ulrike Haupt&quot; &lt;rica@...&gt;","profile":"ulrikehaupt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Reading","postDate":"1207691979","msgId":31677,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZGEwMWM4OTljMyRkODI3NWQzMCQ1MGZlYThjMEB1bHJpa2VhZjEyZmFmYT4=","referencesHeader":"PGZ0Z3IyYStxaG01QGVHcm91cHMuY29tPg=="},"prevInTopic":31676,"nextInTopic":31679,"prevInTime":31676,"nextInTime":31678,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"Dear Ren Thank you for bringing it all into perspective again. You wrote: They don t need to know anything about what you printed. They need to be trusted.","messageBody":"<div id=\"ygrps-yiv-1066103691\">Dear Ren<br/>\n<br/>\nThank you for bringing it all into perspective again.<br/>\n<br/>\nYou wrote:<br/>\n<br/>\n&quot;They don&#39;t need to know anything about what you printed. They need to<br/>\nbe trusted. Reading isn&#39;t really this big magical thing people make it<br/>\nout to be. Your child learned to speak an entire language without<br/>\nknowing &quot;processes&quot;, why wouldn&#39;t they learn other things the same way?<br/>\n<br/>\nHelping people understand what learning looks like in unschooling<br/>\nhomes is more helpful than posting all about what kids &quot;need&quot; to<br/>\nunderstand in order to learn certain things.&quot;<br/>\n<br/>\nand<br/>\n<br/>\n&quot;I think teaching is harmful in<br/>\ngeneral because it places the power outside the individual. What it<br/>\nreally teaches them is that they NEED to be taught in order to learn!<br/>\nIt&#39;s harmful and demoralizing and schools are feeding that harm every day.<br/>\n<br/>\nUnschoolers are living as if school and it&#39;s &quot;processes&quot; didn&#39;t exist.&quot;<br/>\n<br/>\nIsn&#39;t it that every single one of our children is a &#39;special needs&#39; learner <br/>\nand it is up to us parents to provide the best environment for each child to <br/>\nlearn according to their individual needs at the time when they &#39;need&#39; it. <br/>\nThat is how I understand unschooling in my own home. Just this evening Alex <br/>\nhad the &#39;need&#39; to learn about astrology in order to understand something <br/>\nabout himself and his friends better. He was reading a German and an English <br/>\nbook at the same time. My &#39;teaching&#39; part was to provide quick translations <br/>\nbetween the two languages of  sun signs and planet names when asked. He <br/>\ncould have looked these up in the dictionary, of course. :)  In the <br/>\n&#39;schooling&#39; mindset I would have told him to get the dictionary. In the <br/>\nunschooling mindset of course I provided the answers in the same way as I <br/>\nwould provide it to any other person asking the question. And if he would <br/>\nhave asked me to read it to him I might have done that, too.<br/>\nI have a mother who gives information unasked. It is extremely irritating. <br/>\n:) And I catch myself so often when I want to do the same thing. Sometimes I <br/>\ncan keep my blabbermouth shut. &lt;grin&gt; Sometimes I don&#39;t and the backlash is <br/>\npainful.<br/>\n<br/>\nI can&#39;t remember where I read it but there was a reference to the need for <br/>\nfood and the need for sleep and the need for skill or knowledge. Eat when <br/>\nyou are hungry, sleep when you are tired and learn when you want to know. <br/>\nUnschooling allows us (and our children) to follow our natural needs or <br/>\nurges in these and all other areas.<br/>\n<br/>\nBlissings<br/>\nUlrike</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Reading","postDate":"1207689094","msgId":31672,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1Mzk1NUE2QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":31671,"nextInTopic":31673,"prevInTime":31671,"nextInTime":31673,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"... information about the flawed way schools teach kids to read here. I m *so* much more interested in hearing how unschoolers learn to read By reading and","messageBody":"<div id=\"ygrps-yiv-1461259255\"><blockquote><span title=\"ireply\">&gt;All this is really just blah blah blah to me. I&#39;m reading loads of<br/>\n </span></blockquote>information about the flawed way schools &quot;teach&quot; kids to read here. I&#39;m<br/>\n*so* much more interested in hearing how unschoolers &quot;learn&quot; to read<br/>\nBy reading and being read to and being surrounded by the printed word<br/>\n(it&#39;s nearly impossible to avoid words in our society these days even if<br/>\nALL you ever do is watch TV). How do -you- learn something new? For<br/>\ninstance, if you see a friend making an awesome pan of lasagna right<br/>\ndown to making the whole wheat noodles, and you think &quot;gee I&#39;d like to<br/>\nbe able to do that&quot; What do you do? Do you go find a lasagna making<br/>\nclass and make sure you&#39;re between the ages of 20-22 (the proper<br/>\nlearning to make lasagna age)? Probably not. You might pull out a<br/>\ncookbook and by trial and error (hopefully some of it edible) come up<br/>\nwith your own process and off you go. You might ask your friend to show<br/>\nit to you, explain it to you, hang out next to you while you try your<br/>\nfirst go at it. Odds are neither the cookbook nor your friend will quiz<br/>\nyou about proper technique, protein ratios, etc. Rather, your friend<br/>\nmight notice that the dough looks a little dry from her experience and<br/>\nsuggest adding a little more water to the dough before rolling it out.<br/>\nSame thing with unschooled kids learning to read - they may ask<br/>\nquestions, they may work it on their own, probably a bit of both, and<br/>\nour job is to be alongside as much or as little as they choose to assist<br/>\nin whatever way they choose. I could tell you about when DS learned to<br/>\nread but it&#39;d just be my perspective on what was happening, it wouldn&#39;t<br/>\nactually be 100% accurate as to what was going on inside him - just as I<br/>\ncould tell you what he had for dinner last night but I couldn&#39;t 100%<br/>\naccurately tell you how it digested once he ate it.<br/>\n<br/>\nSo, how did DS learn (he was right around 5 when he reached a level of<br/>\ncomfort and fluency that would be called &#39;reading&#39;, he&#39;s almost 10 now)?<br/>\nWe had magnets and books and closed captioning and road signs and<br/>\ngrocery lists and all that various stuff that most families with kids<br/>\nhave around. We&#39;d read to him as he chose (and sometimes he was busy<br/>\nplaying with something while we read, he was not required to sit still<br/>\nand look at the pages). We read on our own (both DH and I are<br/>\nbibliophiles bigtime). I near about sprained my tongue pronouncing<br/>\n&quot;mrwtqzgjkln&quot; when he assembled fridge magnet letters and said &quot;Mommy,<br/>\nwhat does that say?&quot; - we also had a discussion about how some vowels<br/>\n(aeiou) are helpful for Mommy to not sprain her tongue because the<br/>\nEnglish language needs vowels (of course, then I had &quot;uioeoia&quot; to try to<br/>\nwrap my poor tongue around lol). Over time, he learned to recognize some<br/>\nwords and figure out others based on their similarity to other words he<br/>\nalready knew. That was pretty much it. I knew for certain he was<br/>\n&quot;reading&quot; when he popped his head in one day when DH and I were in<br/>\nanother room and said &quot;there&#39;s a severe thunderstorm watch until 10 pm&quot;<br/>\n- he had read the scroll feed across the bottom of the TV screen. That&#39;s<br/>\nthe best I can do to &#39;explain&#39; how he learned to read - he learned to<br/>\nread by reading.<br/>\n<br/>\nDeb <br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":46477013,"authorName":"Ulrike Haupt","from":"&quot;Ulrike Haupt&quot; &lt;rica@...&gt;","profile":"ulrikehaupt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Reading","postDate":"1207686639","msgId":31674,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYmUwMWM4OTliNyQ2OTYyZDlkMCQ1MGZlYThjMEB1bHJpa2VhZjEyZmFmYT4=","referencesHeader":"PDk2OTg2OS43OTg4Ny5xbUB3ZWI1NDEwOS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":31673,"nextInTopic":31675,"prevInTime":31673,"nextInTime":31675,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"Oh dears I remember another story about learning to read. One of my nephews learned to read by getting the names of street signs. And his first book was an","messageBody":"<div id=\"ygrps-yiv-1712147284\">Oh dears<br/>\nI remember another story about learning to read.<br/>\n<br/>\nOne of my nephews learned to read by &#39;getting&#39; the names of street signs. And his first &#39;book&#39; was an encyclopedia, which he read from a to z. Well, he won most of the local weekly radio competions at an early age.<br/>\n<br/>\nHow is that for a way to &#39;learn to read?&#39;<br/>\n<br/>\nBlissings<br/>\nUlrike<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":340685235,"authorName":"Deborah OLeary","from":"Deborah OLeary &lt;olearydeborah@...&gt;","profile":"olearydeborah","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Reading","postDate":"1207686476","msgId":31675,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5OTY1NS4xMzIyMi5xbUB3ZWI0NjIxMS5tYWlsLnNwMS55YWhvby5jb20+","inReplyToHeader":"PDk2OTg2OS43OTg4Ny5xbUB3ZWI1NDEwOS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":31674,"nextInTopic":31676,"prevInTime":31674,"nextInTime":31676,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"Jodi, My experience is similar to yours.  I am new to this unschooling experience, so I hope you all won t mind my two cents worth.  My two oldest, now 26 and","messageBody":"<div id=\"ygrps-yiv-418343896\">Jodi,<br/>\n<br/>\nMy experience is similar to yours.  I am new to this unschooling experience, so I hope you all won&#39;t mind my two cents worth.  My two oldest, now 26 and 22, entered school reading and writing their letters and numbers.  They did not attend pre-school.  I just gave them the tools (crayons, pencils and books) and they were able to learn.  We just read a lot.   <br/>\n<br/>\nDeb<br/>\n<br/>\nJodi Bezzola &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jodibezzola@...\">jodibezzola@...</a>&gt; wrote:                             I&#39;m not sure why you&#39;re asking me, but I actually can&#39;t remember!  Funny when I started to think about it.  It occurred to me somewhere along the way in this thread about reading that I just started reading (before school) and loved it, and still love it.  I don&#39;t remember anyone interfering much.  I remember my mom had some montessori stuff, sandpaper letters to trace, etc., but I don&#39;t remember anyone trying to &#39;teach&#39; me.  I do however remember being massively bored in elementary school once they started &#39;teaching&#39; reading!  The beginning of my days acting out in school out of pure and utter boredom.<br/>\n    <br/>\n   Jodi<br/>\n <br/>\n Ulrike Haupt &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rica@...\">rica@...</a>&gt; wrote:<br/>\n           <br/>\n <br/>\n All this is really just blah blah blah to me. I&#39;m reading loads of <br/>\n information about the flawed way schools &quot;teach&quot; kids to read here. I&#39;m *so* <br/>\n much more interested in hearing how unschoolers &quot;learn&quot; to read.<br/>\n <br/>\n Jodi<br/>\n <br/>\n Hi Jodi<br/>\n <br/>\n Can you remember HOW you learned to read?<br/>\n <br/>\n Blissings<br/>\n Ulrike <br/>\n <br/>\n ---------------------------------<br/>\n You rock. That&#39;s why Blockbuster&#39;s offering you one month of Blockbuster Total Access, No Cost.<br/>\n <br/>\n [Non-text portions of this message have been removed]<br/>\n <br/>\n <br/>\n     <br/>\n                                       <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nYou rock. That&#39;s why Blockbuster&#39;s offering you one month of Blockbuster Total Access, No Cost.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":46477013,"authorName":"Ulrike Haupt","from":"&quot;Ulrike Haupt&quot; &lt;rica@...&gt;","profile":"ulrikehaupt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Reading","postDate":"1207686371","msgId":31673,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYjUwMWM4OTliNiRjYmU2MTQxMCQ1MGZlYThjMEB1bHJpa2VhZjEyZmFmYT4=","referencesHeader":"PDk2OTg2OS43OTg4Ny5xbUB3ZWI1NDEwOS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":31672,"nextInTopic":31674,"prevInTime":31672,"nextInTime":31674,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"Dears, may I add another view. Rickie, the boyfriend of my youngest daughter is colour blind. When he was in grade one the teacher told the children to paint","messageBody":"<div id=\"ygrps-yiv-698140235\">Dears,<br/>\nmay I add another view. Rickie, the boyfriend of my youngest daughter is colour blind. When he was in grade one the teacher told the children to paint pictures using certain colours. Green for the leaves and brown for the trunk of trees and that kind of things. Ricki deciphered the information (name of colour) on the crayons in order to &#39;get the right colour&#39; that the teacher wanted to be put on the paper. HOW he actually learned the letters/words that he has not told us yet. &lt;grin&gt;<br/>\nHe told the teacher about the colour blindness when he was in grade 5 and she never got it.<br/>\n<br/>\nAs I am sitting here I&#39;ve asked my husband (over 50) and my youngest son (15) how each learned to read. Both said that they started by getting to know the letters of the alphabeth. Then came the combination to get syllabes and then whole words and their meaning. Reading silently, reading out loud and writing on computer or handwriting were different roads to travel.<br/>\n<br/>\nWhom do we trust about this most? Our own references or &#39;educators&#39;?<br/>\n<br/>\nI think this was one hell of an interesting thread so far.<br/>\n<br/>\nBlissings<br/>\nUlrike<br/>\nfrom Namibia - somewhere in Africa<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Jodi Bezzola <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Tuesday, April 08, 2008 10:04 PM<br/>\n  Subject: Re: [unschoolingbasics] Reading<br/>\n<br/>\n<br/>\n  I&#39;m not sure why you&#39;re asking me, but I actually can&#39;t remember! Funny when I started to think about it. It occurred to me somewhere along the way in this thread about reading that I just started reading (before school) and loved it, and still love it. I don&#39;t remember anyone interfering much. I remember my mom had some montessori stuff, sandpaper letters to trace, etc., but I don&#39;t remember anyone trying to &#39;teach&#39; me. I do however remember being massively bored in elementary school once they started &#39;teaching&#39; reading! The beginning of my days acting out in school out of pure and utter boredom.<br/>\n<br/>\n  Jodi<br/>\n<br/>\n  Ulrike Haupt &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rica@...\">rica@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\n  All this is really just blah blah blah to me. I&#39;m reading loads of <br/>\n  information about the flawed way schools &quot;teach&quot; kids to read here. I&#39;m *so* <br/>\n  much more interested in hearing how unschoolers &quot;learn&quot; to read.<br/>\n<br/>\n  Jodi<br/>\n<br/>\n  Hi Jodi<br/>\n<br/>\n  Can you remember HOW you learned to read?<br/>\n<br/>\n  Blissings<br/>\n  Ulrike <br/>\n<br/>\n  ---------------------------------<br/>\n  You rock. That&#39;s why Blockbuster&#39;s offering you one month of Blockbuster Total Access, No Cost.<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n  __________ NOD32 3011 (20080408) Information __________<br/>\n<br/>\n  This message was checked by NOD32 antivirus system.<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.eset.com\">http://www.eset.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":215778715,"authorName":"Jodi Bezzola","from":"Jodi Bezzola &lt;jodibezzola@...&gt;","profile":"jodibezzola","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Reading","postDate":"1207685087","msgId":31671,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2OTg2OS43OTg4Ny5xbUB3ZWI1NDEwOS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDAwODQwMWM4OTlhYSQxMTkwMmFkMCQ1MGZlYThjMEB1bHJpa2VhZjEyZmFmYT4="},"prevInTopic":31670,"nextInTopic":31672,"prevInTime":31670,"nextInTime":31672,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"I m not sure why you re asking me, but I actually can t remember!  Funny when I started to think about it.  It occurred to me somewhere along the way in this","messageBody":"<div id=\"ygrps-yiv-325619825\">I&#39;m not sure why you&#39;re asking me, but I actually can&#39;t remember!  Funny when I started to think about it.  It occurred to me somewhere along the way in this thread about reading that I just started reading (before school) and loved it, and still love it.  I don&#39;t remember anyone interfering much.  I remember my mom had some montessori stuff, sandpaper letters to trace, etc., but I don&#39;t remember anyone trying to &#39;teach&#39; me.  I do however remember being massively bored in elementary school once they started &#39;teaching&#39; reading!  The beginning of my days acting out in school out of pure and utter boredom.<br/>\n   <br/>\n  Jodi<br/>\n<br/>\nUlrike Haupt &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rica@...\">rica@...</a>&gt; wrote:<br/>\n          <br/>\n<br/>\nAll this is really just blah blah blah to me. I&#39;m reading loads of <br/>\ninformation about the flawed way schools &quot;teach&quot; kids to read here. I&#39;m *so* <br/>\nmuch more interested in hearing how unschoolers &quot;learn&quot; to read.<br/>\n<br/>\nJodi<br/>\n<br/>\nHi Jodi<br/>\n<br/>\nCan you remember HOW you learned to read?<br/>\n<br/>\nBlissings<br/>\nUlrike <br/>\n<br/>\n<br/>\n<br/>\n                           <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nYou rock. That&#39;s why Blockbuster&#39;s offering you one month of Blockbuster Total Access, No Cost.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":46477013,"authorName":"Ulrike Haupt","from":"&quot;Ulrike Haupt&quot; &lt;rica@...&gt;","profile":"ulrikehaupt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Reading","postDate":"1207680908","msgId":31670,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwODQwMWM4OTlhYSQxMTkwMmFkMCQ1MGZlYThjMEB1bHJpa2VhZjEyZmFmYT4=","referencesHeader":"PDk1NDYwMy42MDE5Ni5xbUB3ZWI1NDEwNi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":31669,"nextInTopic":31671,"prevInTime":31669,"nextInTime":31671,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"All this is really just blah blah blah to me. I m reading loads of information about the flawed way schools teach kids to read here. I m *so* much more","messageBody":"<div id=\"ygrps-yiv-1133957427\">All this is really just blah blah blah to me. I&#39;m reading loads of <br/>\ninformation about the flawed way schools &quot;teach&quot; kids to read here. I&#39;m *so* <br/>\nmuch more interested in hearing how unschoolers &quot;learn&quot; to read.<br/>\n<br/>\nJodi<br/>\n<br/>\nHi Jodi<br/>\n<br/>\nCan you remember HOW you learned to read?<br/>\n<br/>\nBlissings<br/>\nUlrike</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Reading","postDate":"1207680633","msgId":31669,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFENUM5NTg5LUNEOTEtNEJENy1COTFFLTQ0MDVDODNEQjdCMEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDliY2E5ZTMwODA0MDgwOTUzajYzMTExZjA5eDZiODQwN2U5MTYxMDU5ZGVAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PDhDQTY3ODVFNjZERjAwQi1BQTQtRUU2QEZXTS1EMjEuc3lzb3BzLmFvbC5jb20+IDw5YmNhOWUzMDgwNDA4MDk1M2o2MzExMWYwOXg2Yjg0MDdlOTE2MTA1OWRlQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":31667,"nextInTopic":31670,"prevInTime":31668,"nextInTime":31670,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"... And there is some process for learning to speak. (Many processes. Different processes for different kids.) BUT WE DON T NEED TO KNOW WHAT THEY ARE. All we","messageBody":"<div id=\"ygrps-yiv-460769710\">On Apr 8, 2008, at 12:53 PM, Kim Musolff wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But there IS a process.  Before children can learn to read, they  <br/>\n&gt; need to<br/>\n&gt; understand print knowledge (directionality, word-picture match, one- <br/>\n&gt; to-one<br/>\n&gt; correspondance, etc.), phonics, decoding strategies, and  <br/>\n&gt; comprehension.<br/>\n<br/>\n </span></blockquote>And there is some process for learning to speak. (Many processes.  <br/>\nDifferent processes for different kids.)<br/>\n<br/>\nBUT WE DON&#39;T NEED TO KNOW WHAT THEY ARE.<br/>\n<br/>\nAll we need is our natural instincts to help them reach what they&#39;re  <br/>\nreaching for.<br/>\n<br/>\nSame with reading. All you&#39;ve listed are bits and pieces that are  <br/>\nnatural to reading. We don&#39;t need to break the process down for us or  <br/>\nfor the kids in order to help them. As with all natural learning,  <br/>\nkids absorb what they need from the chaos in the moment and figure it  <br/>\nout. Sometimes they&#39;ll ask questions to clarify some part. That&#39;s  <br/>\npart of the process.<br/>\n<br/>\nIn fact it&#39;s rewarding to pull order from chaos. It&#39;s way more  <br/>\nempowering *and* interesting than some person trying to hand out the  <br/>\ninformation in the order the person thinks it needs learned in.<br/>\n<br/>\nReal learning is stumbling across an intriguing a puzzle you want to  <br/>\nsolve with the whole world as a resource to get help from.<br/>\n<br/>\nSchool &quot;learning&quot; is someone telling you which puzzle is important  <br/>\nthen handing you the answer and telling you to memorize it.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":215778715,"authorName":"Jodi Bezzola","from":"Jodi Bezzola &lt;jodibezzola@...&gt;","profile":"jodibezzola","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Reading","postDate":"1207677769","msgId":31667,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk1NDYwMy42MDE5Ni5xbUB3ZWI1NDEwNi5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDliY2E5ZTMwODA0MDgwOTUzajYzMTExZjA5eDZiODQwN2U5MTYxMDU5ZGVAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":31666,"nextInTopic":31669,"prevInTime":31666,"nextInTime":31668,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"All this is really just blah blah blah to me.  I m reading loads of information about the flawed way schools teach kids to read here.  I m *so* much more","messageBody":"<div id=\"ygrps-yiv-2094002921\">All this is really just blah blah blah to me.  I&#39;m reading loads of information about the flawed way schools &quot;teach&quot; kids to read here.  I&#39;m *so* much more interested in hearing how unschoolers &quot;learn&quot; to read.<br/>\n   <br/>\n  Jodi<br/>\n<br/>\nKim Musolff &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kmoose75@...\">kmoose75@...</a>&gt; wrote:<br/>\n          If there *were* a process---ANY kind of process---any kind of one thing<br/>\nthat follows another that works for everyone---or even HALF of<br/>\neveryone, don&#39;t you think the schools and all those &quot;educators&quot; out<br/>\nthere would have FOUND that process and figured it out and labeled it<br/>\nand marketed it and used it in each and every classroom----and that<br/>\nevery single schooled child could read?<br/>\nLearning how to read is a process, just like learning unschooling is a<br/>\nprocess. Each child will go about it in his own way and come to understand<br/>\nit in his own way, just like each of us will come to understand unschooling<br/>\non our own terms.<br/>\n<br/>\nBut there IS a process. Before children can learn to read, they need to<br/>\nunderstand print knowledge (directionality, word-picture match, one-to-one<br/>\ncorrespondance, etc.), phonics, decoding strategies, and comprehension.<br/>\nSchools just teach these things, because they have to teach a bunch of kids<br/>\nin an environment that is not real life. Many schools think they have the<br/>\nprocess nailed (children should learn phonics first or children should learn<br/>\nwhole word recognitions first, etc.). But the problem is that, while that<br/>\nmay work for some children, it also doesn&#39;t work for a lot of children.<br/>\nThose children are made to feel that they have some kind of a problem. So<br/>\nwhile there are certain things that children need to know before they can<br/>\nread, no child learns these things the same way. Some children will pick up<br/>\nsome or all of these things simply by observation and independent thinking.<br/>\nSome by asking a lot of questions. Some need to have them specifically<br/>\npointed out to them. Schools cannot possibly handle this kind of<br/>\nindividualized teaching, especially if they are required to be held<br/>\naccountable for their students&#39; learning.<br/>\n<br/>\nAnother thing: Because schools are set up so that they must teach certain<br/>\nthings by certain times, teachers tend to approach reading as &quot;if I teach<br/>\nthem these specific things, the result will be that they know how to read.&quot;<br/>\nSo teachers test and assess, and are looking for that end result. The<br/>\nproblem is that really, there is no end result. Because reading is a<br/>\nprocess, children will always be in the middle of that process. Even adults<br/>\nare in the middle of that process! There is no &quot;perfect reader,&quot; because<br/>\nthat is not what reading is about. But if you are a school, set up to teach<br/>\ncertain things and you must assess children to see if they know that certain<br/>\nthing, how can you possibly approach reading in this way? How can you<br/>\npossibly support each child exactly where they need to be supported? It<br/>\ndoesn&#39;t work.<br/>\n<br/>\nSchools are not bad. They have good intentions. They just can&#39;t<br/>\nlogistically support children in the ways that they need to, in order for<br/>\nthem to learn. Since they have to approach reading in a way to reach all<br/>\nchildren, and they also have to &quot;prove&quot; that the children have been taught,<br/>\nthey will never be able to teach reading with any kind of success.<br/>\n<br/>\nKim<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n                           <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nYou rock. That&#39;s why Blockbuster&#39;s offering you one month of Blockbuster Total Access, No Cost.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":333194003,"authorName":"Kim Musolff","from":"&quot;Kim Musolff&quot; &lt;kmoose75@...&gt;","profile":"little_minds_preschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Reading","postDate":"1207673625","msgId":31666,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDliY2E5ZTMwODA0MDgwOTUzajYzMTExZjA5eDZiODQwN2U5MTYxMDU5ZGVAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDhDQTY3ODVFNjZERjAwQi1BQTQtRUU2QEZXTS1EMjEuc3lzb3BzLmFvbC5jb20+","referencesHeader":"PDhDQTY3ODVFNjZERjAwQi1BQTQtRUU2QEZXTS1EMjEuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":31659,"nextInTopic":31667,"prevInTime":31665,"nextInTime":31667,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"If there *were* a process---ANY kind of process---any kind of one thing that follows another that works for everyone---or even HALF of everyone, don t you","messageBody":"<div id=\"ygrps-yiv-1267649961\">If there *were* a process---ANY kind of process---any kind of one thing<br/>\nthat follows another that works for everyone---or even HALF of<br/>\neveryone, don&#39;t you think the schools and all those &quot;educators&quot; out<br/>\nthere would have FOUND that process and figured it out and labeled it<br/>\nand marketed it and used it in each and every classroom----and that<br/>\nevery single schooled child could read?<br/>\nLearning how to read is a process, just like learning unschooling is a<br/>\nprocess.  Each child will go about it in his own way and come to understand<br/>\nit in his own way, just like each of us will come to understand unschooling<br/>\non our own terms.<br/>\n<br/>\nBut there IS a process.  Before children can learn to read, they need to<br/>\nunderstand print knowledge (directionality, word-picture match, one-to-one<br/>\ncorrespondance, etc.), phonics, decoding strategies, and comprehension.<br/>\nSchools just teach these things, because they have to teach a bunch of kids<br/>\nin an environment that is not real life.  Many schools think they have the<br/>\nprocess nailed (children should learn phonics first or children should learn<br/>\nwhole word recognitions first, etc.).  But the problem is that, while that<br/>\nmay work for some children, it also doesn&#39;t work for a lot of children.<br/>\nThose children are made to feel that they have some kind of a problem.  So<br/>\nwhile there are certain things that children need to know before they can<br/>\nread, no child learns these things the same way.  Some children will pick up<br/>\nsome or all of these things simply by observation and independent thinking.<br/>\nSome by asking a lot of questions.  Some need to have them specifically<br/>\npointed out to them.  Schools cannot possibly handle this kind of<br/>\nindividualized teaching, especially if they are required to be held<br/>\naccountable for their students&#39; learning.<br/>\n<br/>\nAnother thing:  Because schools are set up so that they must teach certain<br/>\nthings by certain times, teachers tend to approach reading as &quot;if I teach<br/>\nthem these specific things, the result will be that they know how to read.&quot;<br/>\nSo teachers test and assess, and are looking for that end result.  The<br/>\nproblem is that really, there is no end result.  Because reading is a<br/>\nprocess, children will always be in the middle of that process.  Even adults<br/>\nare in the middle of that process!  There is no &quot;perfect reader,&quot; because<br/>\nthat is not what reading is about.  But if you are a school, set up to teach<br/>\ncertain things and you must assess children to see if they know that certain<br/>\nthing, how can you possibly approach reading in this way?  How can you<br/>\npossibly support each child exactly where they need to be supported?  It<br/>\ndoesn&#39;t work.<br/>\n<br/>\nSchools are not bad.  They have good intentions.  They just can&#39;t<br/>\nlogistically support children in the ways that they need to, in order for<br/>\nthem to learn.  Since they have to approach reading in a way to reach all<br/>\nchildren, and they also have to &quot;prove&quot; that the children have been taught,<br/>\nthey will never be able to teach reading with any kind of success.<br/>\n<br/>\nKim<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Reading","postDate":"1207655439","msgId":31659,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQTY3ODVFNjZERjAwQi1BQTQtRUU2QEZXTS1EMjEuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":26230,"nextInTopic":31666,"prevInTime":31658,"nextInTime":31660,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"There is no process.  Learning happens inside the head of each individual learner.   You might think about why you re so stuck on the idea there has to be a","messageBody":"<div id=\"ygrps-yiv-549414280\">There is no process.  Learning happens inside the head of each <br/>\nindividual<br/>\nlearner.   You might think about why you&#39;re so stuck on the idea there <br/>\nhas to be<br/>\na process.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nIf there *were* a process---ANY kind of process---any kind of one thing <br/>\nthat follows another that works for everyone---or even HALF of <br/>\neveryone, don&#39;t you think the schools and all those &quot;educators&quot; out <br/>\nthere would have FOUND that process and figured it out and labeled it <br/>\nand marketed it and used it in each and every classroom----and that <br/>\nevery single schooled child could read?<br/>\n<br/>\nThey *think* they have. They&#39;re wrong. Whole word doesn&#39;t work for some <br/>\npeople. Phonics doesn&#39;t work for some people. Hooked on phonics and BOB <br/>\nbooks and that Davis method and Orton-Gillingham---if any of them <br/>\nactually worked, if any of them were actually THE process, there would <br/>\nbe no non-readers in schools. There would be no struggles in schools.<br/>\n<br/>\nIf &quot;they&quot; are right, and there is some &quot;process,&quot; why do we unschooling <br/>\nparents have kids that can read without any adherence to a process? How <br/>\ncan our &quot;success&quot; in NOT teaching reading be explained?<br/>\n<br/>\nEach person has a different way to &quot;process&quot; the written word. *Your* <br/>\nchild has his own &quot;process.&quot; And it&#39;s not anything you can predict. I <br/>\ncan tell you the secret to reading though. SHSHSHSHSHSHHHHH....<br/>\n<br/>\nIt&#39;s having lots of printed materials around. It&#39;s YOU, reading---both <br/>\naloud and to yourself. It&#39;s writing down his stories before he&#39;s able <br/>\nto. It&#39;s telling him what something says over and over and over. It&#39;s <br/>\nspelling things for him again and again and again. It&#39;s playing word <br/>\ngames and rhyming and talking about stupid spellings and why they are <br/>\nspelled so strangely.<br/>\n<br/>\nAnd the BIG secret? PATIENCE. A child who is surrounded by the written <br/>\nword and who sees his loved ones reading and enjoying printed materials <br/>\nwill *naturally* read when he&#39;s physically and mentally ready. It may <br/>\nbe at four. It may be at 14. But it doesn&#39;t matter *when* a person <br/>\nlearns to read. He&#39;ll do it when he&#39;s ready IF he&#39;s supported and <br/>\nallowed to proceed at his own pace.<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a></div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Reading","postDate":"1189878296","msgId":26230,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVDMTgzMDQ2LTZGMDItNDQ5OC05QTkwLTk5QzlGREQ2NDQyRkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGQzZi4xMmI2MzFhZi4zNDFkMzg5ZUBhb2wuY29tPg==","referencesHeader":"PGQzZi4xMmI2MzFhZi4zNDFkMzg5ZUBhb2wuY29tPg=="},"prevInTopic":26202,"nextInTopic":31659,"prevInTime":26229,"nextInTime":26231,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"... Kids do not learn to read completely by themselves - not at all. They don t need to be taught, though. Kids learn to read when surrounded by a print-rich","messageBody":"<div id=\"ygrps-yiv-198681029\"><blockquote><span title=\"ireply\">&gt; &gt; I apologize if this question has been asked already. How do<br/>\n&gt; children actually learn to read<br/>\n&gt; &gt; completely by themselves.&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n </span></blockquote>Kids do not learn to read completely by themselves - not at all.<br/>\n<br/>\nThey don&#39;t need to be taught, though.<br/>\n<br/>\n<br/>\nKids learn to read when surrounded by a print-rich environment,  <br/>\npeople who read to them a lot, and people who read for themselves for  <br/>\nreal reasons. Kids need people who are sensitive to them and gently  <br/>\nsupport their emerging interest in language, when it appears, by  <br/>\ngiving them just enough information and often by playing little fun  <br/>\nword or sound games.<br/>\n<br/>\nSometimes kids learn to read at a very young age and sometimes they  <br/>\nlearn when they are much older - that depends mostly their own brain  <br/>\ndevelopment patterns. Teaching doesn&#39;t really hurry it along -  <br/>\nschools generally try to get all kids reading by 9 years old - they  <br/>\ndon&#39;t succeed, but they do a lot of damage in the process of trying  <br/>\n-- they create lots of learning disabilities and tremendous amounts  <br/>\nof antipathy toward reading. And, what most kids learn is that  <br/>\nlearning is difficult and that becomes a self-fulfilling prophecy for  <br/>\nmany of them.<br/>\n<br/>\nA few years ago, I wrote something about how my three kids learned to  <br/>\nread - it has a lot of very specific ideas for how to support  <br/>\nlearning to read in ways other than teaching reading lessons. It is  <br/>\nhere: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/pam/reading\">http://sandradodd.com/pam/reading</a>&gt;, if you want to take a look.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78134331,"authorName":"Genant2@aol.com","from":"Genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Reading","postDate":"1189863070","msgId":26202,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQzZi4xMmI2MzFhZi4zNDFkMzg5ZUBhb2wuY29tPg=="},"prevInTopic":8665,"nextInTopic":26230,"prevInTime":26201,"nextInTime":26203,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/15/2007 9:05:33 A.M. Eastern Daylight Time, ... children actually  learn to read ... I can share how my boys learned to read.  My oldest","messageBody":"<div id=\"ygrps-yiv-1081230720\">In a message dated 9/15/2007 9:05:33 A.M. Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I  apologize if this question has been asked already. How do<br/>\n </span></blockquote>children actually  learn to read <br/>\n<blockquote><span title=\"ireply\"> &gt; completely by  themselves.&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\n </span></blockquote>I can share how my boys learned to read.  My oldest has always had an  <br/>\ninterest in reading for as long as I can remember.  Seems he was just &quot;born  that <br/>\nway&quot;  LOL.  We have always read as a family, still do.  I  don&#39;t think you ever <br/>\n&quot;outgrow&quot; the joy of being read to.  So we have always  had lots of books <br/>\naround and have always been a reading family.  My oldest  however has loved those <br/>\ngaming magazines since he was like 3.  I remember  him following me around all <br/>\nday wanting me to read the magazines to him, and I  would, over and over and <br/>\nover and over.  He LOVED them.  And I don&#39;t  think I was quite fast enough for <br/>\nhim.  He just had to be able to read them  for himself.  Skip parts he didn&#39;t <br/>\nwant to read, back up and read  paragraphs again etc.  He would ask me how to <br/>\nspell words, he would copy  words on paper, he would ask me to read words for <br/>\nhim, he learned how to sound  out more difficult words.  And he learned to <br/>\nread by the age of about  4.  He knew he just HAD TO READ FOR HIMSELF.  <br/>\n <br/>\nMy youngest was different.  He also loved being read to and lived in  the <br/>\nvery same environment.  But was very content for me to read to  him.  He did not <br/>\nhave that same &quot;NEED&quot; to read everything himself.   Several years ago he went <br/>\nthrough a period of wanting me to spell words for him  and he would write them <br/>\ndown on paper.  But then that stopped.  He  called himself a nonreader for a <br/>\nwhile.  Although we have a great circle of  unschooling friends we hang around <br/>\nso for him there was no &quot;negative&quot; attachment  to that (I think in society as <br/>\na whole the majority would look at being a  nonreader at 9 as a negative <br/>\nthing).  Our circle of friends were/are so  diverse in the age they started <br/>\nreading that it wasn&#39;t any deal at all, big or  small.  LOL.  But inside his head he <br/>\nwas absorbing things, it wasn&#39;t  as &quot;out there&quot; as my older son.  Then one <br/>\nday this past year (he is 10 now)  he just started reading these difficult <br/>\nwords.  It seems to me that he went  from reading &quot;no&quot;, &quot;mom&quot;, &quot;dad&quot; to reading <br/>\nEVERYTHING, in a day.  Although  I am sure there was a process going on inside <br/>\nhim, it just wasn&#39;t out there for  me to see like with my older son.  So now in <br/>\nwhat seems like a year he can  read generally anything.  It is so amazing.  <br/>\n <br/>\nSo I have one that started reading around 4 and one that started around  10.  <br/>\nVery different processes for each of them.  Both in their own  time, but <br/>\nneither in a vacuum.  I just trusted that it would happen.<br/>\n <br/>\n<br/>\n <br/>\nPam  G<br/>\n<br/>\nVisit my blog:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://gentlegull.blogspot.com/\">http://gentlegull.blogspot.com/</a><br/>\n<br/>\n<br/>\n<br/>\n************************************** See what&#39;s new at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com\">http://www.aol.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":248175779,"authorName":"nrskay","from":"&quot;nrskay&quot; &lt;k_bird@...&gt;","profile":"nrskay","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Reading","postDate":"1136082807","msgId":8665,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRwN2YxbitsdHI2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRwNnNwMSs0amt2QGVHcm91cHMuY29tPg=="},"prevInTopic":8660,"nextInTopic":26202,"prevInTime":8664,"nextInTime":8666,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"Thank you Ren - you re absolutely right.  I can t put my expectations on Elizabeth.  If and when she picks up a book it will be her decision and I need to stop","messageBody":"<div id=\"ygrps-yiv-1291062603\">Thank you Ren - you&#39;re absolutely right.  I can&#39;t put my expectations <br/>\non Elizabeth.  If and when she picks up a book it will be her decision <br/>\nand I need to stop worrying about it.  <br/>\n<br/>\nI need to focus on what she is learning and how I can facilitate her <br/>\ninterests.  Just now she got an avtar for the game &quot;typing terror&quot; on <br/>\nneopets.  I&#39;m so excited for her.  I don&#39;t even have that avtar <br/>\nyet.... she types better than I do.  <br/>\n<br/>\nYou know Pam we&#39;ve been talking about going to the library and picking <br/>\nup a book on tape - need to stop talking about it and do it.  <br/>\n<br/>\nThanks guys for always pulling me back into what is best for my dd.  <br/>\nLove the insight from all who contribute here.  <br/>\n<br/>\nKay</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Reading","postDate":"1136064097","msgId":8660,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRwNnNwMSs0amt2QGVHcm91cHMuY29tPg=="},"prevInTopic":8490,"nextInTopic":8665,"prevInTime":8659,"nextInTime":8661,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"The descriptions had some big, complex words that she learned to read, spell, and understand from PS2. Trevor and Jared learned most of their","messageBody":"<div id=\"ygrps-yiv-1962305285\">&quot;The descriptions had some big, complex words<br/>\nthat she learned to read, spell, and understand from PS2.&quot;<br/>\n<br/>\nTrevor and Jared learned most of their spelling/reading and language<br/>\nskills from playing Dungeons and Dragons, Yu-gi-oh, Pokemon and loads<br/>\nand loads of N64, PS2, Xbox and gamecube play. Yes, they&#39;ve got almost<br/>\nevery game system imaginable, and they&#39;ve learned a ton from all of it!<br/>\n<br/>\nI remember how much Trevor hated anything word related for a while<br/>\n(thanks to your truly being pushy) and after we went to unschooling,<br/>\nhe pretty much avoided writing of any kind.<br/>\nAfter a few years, and several new interests later, he started using<br/>\nwriting only for real purposes (gee, ya think?) rather than for<br/>\npleasure.  One day though, he brought me this one page, handwritten<br/>\nsheet, describing a scenario that was amazingly well written, well<br/>\nthought out and spelled perfectly!<br/>\nI thought he&#39;d copied it from a D&D book.<br/>\nNope.  <br/>\nHe&#39;d made it up to enhance one of his characters...it was a history of<br/>\nthe character, where he was from and explanations of his past, written<br/>\nin a story format.<br/>\nVery cool.  I really didn&#39;t get to see much of the evolvement of his<br/>\nspelling and writing skills. It just seemed to happen overnight.<br/>\n<br/>\nHe types about 35-30 wpm, without ever having a single typing lesson.<br/>\n His fingers are never in the position I learned in school, but it<br/>\nworks just fine.<br/>\n<br/>\nHe games with players all over the world on World of Warcraft and<br/>\nHalo2 (xbox live) and Kalonline. They write back and forth, form<br/>\nguilds, duel each other and constantly, constantly learn.<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":115295995,"authorName":"Christine Hall","from":"Christine Hall &lt;crissyhall@...&gt;","profile":"crissyhall","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Reading","postDate":"1135268630","msgId":8490,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMjIyMTYyMzUwLjM3NTEzLnFtYWlsQHdlYjU0NzA3Lm1haWwueWFob28uY29tPg=="},"prevInTopic":6354,"nextInTopic":8660,"prevInTime":8489,"nextInTime":8491,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"I just had to chime in on reading.  I m still a newbie with unschooling, so this is my experience before we found unschooling.  I love reading and I couldn t","messageBody":"<div id=\"ygrps-yiv-10140288\">I just had to chime in on reading.  I&#39;m still a<br/>\n&quot;newbie&quot; with unschooling, so this is my experience<br/>\nbefore we found unschooling.  I love reading and I<br/>\ncouldn&#39;t wait to pass that love on to my children. <br/>\nThere was some annoying parents that tried to push<br/>\ntheir kids to read at age 3 and I said to myself that<br/>\nI didn&#39;t care how old they were when they learned to<br/>\nread, as long as they loved to read.  Then school<br/>\nhappened!  When my oldest wasn&#39;t picking up on how to<br/>\nread by 1st grade, I panicked.  She was tested, and<br/>\ntested, and tested and found out that she was<br/>\ndyslexic.  She got so much help and still was<br/>\n&quot;behind&quot;.  And now she hated reading, and didn&#39;t see<br/>\nherself as a reader.  :(  The best &quot;help&quot; I have given<br/>\nher was to back off.  No more phonics, sounding out,<br/>\ncorrections and testing!!!  And guess what...she now<br/>\nloves reading again!  That&#39;s what I most wanted and<br/>\njust lost sight of.  And I realized that not everyone<br/>\nis going to love reading like I do and that&#39;s OK!   My<br/>\ndh doesn&#39;t read for enjoyment.  But he&#39;s an extremely<br/>\nintelligent man &lt;proud wife ;) &gt; and reads for<br/>\ninformation all the time. He reads high tech,<br/>\ncomplicated, scientific stuff, so he&#39;s probably more<br/>\nof a &quot;reader&quot; than I am,  it&#39;s just a different kind<br/>\nof reading.  And  I&#39;ve noticed my son isn&#39;t into<br/>\nstories but loves looking at his reptile or Bioncle<br/>\nbooks, so I&#39;m not going to be disappointed if he&#39;s<br/>\njust like his dad ;) <br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":213809267,"authorName":"jlh44music","from":"&quot;jlh44music&quot; &lt;jlh44music@...&gt;","profile":"jlh44music","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Reading","postDate":"1124931991","msgId":6354,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRlajVpbis2OGlyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMGUwMWM1YThmYyQwNjg0Zjk1MCQxZWI1NjQ1M0BwY2FiYTFkMzU1NTE5Zj4="},"prevInTopic":6350,"nextInTopic":8490,"prevInTime":6353,"nextInTime":6355,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"... to look at with her and take it from there. See if there are any computer games involving reading she likes e.t.c or get her books from the library about","messageBody":"<div id=\"ygrps-yiv-487828649\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;coolcrew&quot; &lt;grayfamily9@g...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Well don&#39; t start a reading programme. Just look at books she wants <br/>\n </span></blockquote>to look at with her and take it from there. See if there are any <br/>\ncomputer games involving reading she likes e.t.c or get her books from <br/>\nthe library about things she is interested in. Don&#39; t worry about her <br/>\nsounding out either  - lots of children never do. I didn&#39;t but I can <br/>\nread lol. My children never either but so can they. Phonics are very <br/>\noverrated.&gt;&gt;<br/>\n<br/>\nI agree that phonics are very overrated.  Learning words phonetically <br/>\nisn&#39;t the only way to recognize words.  Phonics doesn&#39;t work AT ALL for <br/>\nmy visual/spatial thinker.   She has to SEE the word (feel it, touch <br/>\nit, write it in sand etc etc), then stores it as a picture in her <br/>\nmind.  Once it&#39;s there, it&#39;s PERMANENT.  She often asks me how to spell <br/>\na word and I&#39;ve always told her.  I never said &quot;go look it up&quot; or &quot;try <br/>\nto figure it out&quot; because that would only frustrate her.  She has a <br/>\nwonderful vocabulary because I&#39;ve always conversed with her about <br/>\nthings in a way that is natural for me.   I read to her a lot (and she <br/>\nhates reading for pleasure, but still enjoys if I read to her <br/>\nsometimes, she&#39;ll be 13 next month). I know she CAN read, she just <br/>\ndoesn&#39;t enjoy it for pleasure like I do (I know, I&#39;ve said this <br/>\nbefore!). <br/>\n<br/>\nMake sure she has lots of books, read to her, with her, have her read <br/>\nto you, you don&#39;t need to &quot;go to school&quot; to learn to read, if she wants <br/>\nto read, she will.<br/>\nJann</div>","specialLinks":[]},{"userId":35875473,"authorName":"Heather","from":"&quot;Heather&quot; &lt;heather@...&gt;","profile":"heather_200115","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Reading","postDate":"1124926833","msgId":6350,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzMGQwNTdhLjY2OGRmMDdjLjI4MDQuMzBiNUBteC5nbWFpbC5jb20+","inReplyToHeader":"PDIxMy43OTcyMDVkLjMwM2U0YWNlQGFvbC5jb20+"},"prevInTopic":6349,"nextInTopic":6354,"prevInTime":6349,"nextInTime":6351,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"My daughter, Sierra, is 6, almost 7 and has also been asking to go to school like all her friends.  When I pointed out that most of her friends werent","messageBody":"<div id=\"ygrps-yiv-356704104\">My daughter, Sierra, is 6, almost 7 and has also been asking to go to school<br/>\nlike all her friends.  When I pointed out that most of her friends werent<br/>\nin school, she named the few who were.  Turns out she wanted to ride the bus<br/>\nand to learn to read.  Her brother who is 9  has pretty much picked up<br/>\nreading on his own and has never been interested in attending school.<br/>\nSierra got to ride the bus to a YMCA day camp this summer, so I think that<br/>\nis out of her system for now.  Some of my friends recommended  Reading<br/>\nReflex: the foolproof phono-graphix method for teaching your child to read<br/>\nby Carmen McGuinness and Geoffrey McGuinness.  I got it from the library and<br/>\nphotocopied some pages & we did a few of the lessons.  We maybe sat down 3-4<br/>\ntimes to do school.  She LOVED it.  She made a list of all the words she<br/>\nlearned & showed everyone.  And has not asked about it since.<br/>\n<br/>\n <br/>\n<br/>\nHeather <br/>\n<br/>\nIn Tucson AZ<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n&lt;&lt;Ok im jumpin in and asking questions...  We have been homeschooling since<br/>\ndec <br/>\nof last yr. Put that handy unschooling label on us just about a mnth ago.  <br/>\nWhen we came home from school my daughter who was in 1st grade so hated<br/>\nschool <br/>\nthat she vomited 21 days out of the 30 we kept track of.  So since they came<br/>\n<br/>\nhome even the mention of school would send her in a panic.  Anyhow just<br/>\nrecently <br/>\nlike Mon she stated she thought she was ready to go back to school  lol I <br/>\ntold her she never had to go back that this hasnt been about school.  She<br/>\nsaid <br/>\nyes mom but I REALLY REALLY REALLY want to learn to read.  So there is my <br/>\nquestion  whats the best &quot;unschooling&quot; way to help her learn to read?  She<br/>\nwill be <br/>\n8 in sept  sounds some things out but struggles...  she has complete motor <br/>\napraxia and memory things and sometimes sounding out is hard!!!!  Thanks for<br/>\nall <br/>\nthe imput!&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\n  _____  <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":194903596,"authorName":"coolcrew","from":"&quot;coolcrew&quot; &lt;grayfamily9@...&gt;","profile":"ladybird579","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Reading","postDate":"1124922884","msgId":6349,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGUwMWM1YThmYyQwNjg0Zjk1MCQxZWI1NjQ1M0BwY2FiYTFkMzU1NTE5Zj4=","referencesHeader":"PDIxMy43OTcyMDVkLjMwM2U0YWNlQGFvbC5jb20+"},"prevInTopic":6348,"nextInTopic":6350,"prevInTime":6348,"nextInTime":6350,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"Well don t start a reading programme. Just look at books she wants to look at with her and take it from there. See if there are any computer games involving","messageBody":"<div id=\"ygrps-yiv-651297401\">Well don&#39; t start a reading programme. Just look at books she wants to look at with her and take it from there. See if there are any computer games involving reading she likes e.t.c or get her books from the library about things she is interested in. Don&#39; t worry about her sounding out either  - lots of children never do. I didn&#39;t but I can read lol. My children never either but so can they. Phonics are very overrated.<br/>\nRuth<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":92643757,"authorName":"Leslie530@aol.com","from":"Leslie530@...","profile":"lescather","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Reading","postDate":"1124922257","msgId":6348,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlNS40MzJjMzZlOC4zMDNlNGQ5MUBhb2wuY29tPg=="},"prevInTopic":6347,"nextInTopic":6349,"prevInTime":6347,"nextInTime":6349,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/24/2005 6:15:00 P.M. Eastern Daylight Time, Homeschlfor2@aol.com writes: So there  is my question  whats the best unschooling way to","messageBody":"<div id=\"ygrps-yiv-1722435526\">In a message dated 8/24/2005 6:15:00 P.M. Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Homeschlfor2@...\">Homeschlfor2@...</a> writes:<br/>\n<br/>\nSo there  is my <br/>\nquestion  whats the best &quot;unschooling&quot; way to help her learn to  read? <br/>\n<br/>\n<br/>\n************<br/>\n <br/>\nHave you asked her what that means to her?  She may have a completely  <br/>\ndifferent idea than you of how to go about that.<br/>\n <br/>\nStay casual about it!<br/>\n <br/>\nSometimes an offer to buy one of those cheapo walmart books and sit with  her <br/>\nfor a couple of &quot;lessons&quot; addresses her immediate need.  Chances are  they <br/>\nwill bore the stew out of her and she&#39;ll move on to more exciting  things.  Or <br/>\nbuy a new CD-Rom.<br/>\n <br/>\nMany people have recommended the book Games for Reading.<br/>\n <br/>\nLeslie in SC<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":233219230,"authorName":"Homeschlfor2@aol.com","from":"Homeschlfor2@...","profile":"chrissysspoiled","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"[unschoolingbasics] Reading","postDate":"1124921550","msgId":6347,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIxMy43OTcyMDVkLjMwM2U0YWNlQGFvbC5jb20+"},"prevInTopic":2296,"nextInTopic":6348,"prevInTime":6346,"nextInTime":6348,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"Ok im jumpin in and asking questions...  We have been homeschooling since dec of last yr. Put that handy unschooling label on us just about a mnth ago. When we","messageBody":"<div id=\"ygrps-yiv-1310122878\">Ok im jumpin in and asking questions...  We have been homeschooling since dec <br/>\nof last yr. Put that handy unschooling label on us just about a mnth ago.  <br/>\nWhen we came home from school my daughter who was in 1st grade so hated school <br/>\nthat she vomited 21 days out of the 30 we kept track of.  So since they came <br/>\nhome even the mention of school would send her in a panic.  Anyhow just recently <br/>\n like Mon she stated she thought she was ready to go back to school  lol I <br/>\ntold her she never had to go back that this hasnt been about school.  She said <br/>\nyes mom but I REALLY REALLY REALLY want to learn to read.  So there is my <br/>\nquestion  whats the best &quot;unschooling&quot; way to help her learn to read?  She will be <br/>\n8 in sept  sounds some things out but struggles...  she has complete motor <br/>\napraxia and memory things and sometimes sounding out is hard!!!!  Thanks for all <br/>\nthe imput!<br/>\n<br/>\nChrissy<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":170364620,"authorName":"we3deeves@aol.com","from":"we3deeves@...","profile":"emmasmama99","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Reading","postDate":"1090547451","msgId":2296,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDViLjU0MmQ3ZmFjLjJlMzFjOGZiQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":6347,"prevInTime":2295,"nextInTime":2297,"topicId":2296,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/22/2004 3:53:36 AM Central Standard Time, unschoolingbasics@yahoogroups.com writes: I have been coming across the idea that children ","messageBody":"<div id=\"ygrps-yiv-1675210545\">In a message dated 7/22/2004 3:53:36 AM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> writes:<br/>\nI have been coming across the idea that children <br/>\nshould be exposed to the printed word as much as possible (Holt), and <br/>\nthe best way to foster reading is to READ TO THEM (Unschooling <br/>\nHandbook).  So this is the &#39;unschooling route&#39; I decided to take as <br/>\nwe begin the journey, by going to the library, modeling a love of <br/>\nbooks and taking time during the day to read together.  <br/>\nOh, I whole-heartedly agree with you on this.  I think the reason Emma (5) is <br/>\nlearning how to read on her own is because she&#39;s developed a natural love of <br/>\nbooks...by being read to whenever she wants (and that&#39;s a lot)! :)  We are <br/>\nregulars at our local library, with Em bringing home about 20-30 books each week! <br/>\n She&#39;s extremely excited about being able to finally get her OWN library card <br/>\nthis year!  ~~ Denise<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":47758,"nextTopicId":47762}}