{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":139963192,"authorName":"cindylevesque","from":"&quot;cindylevesque&quot; &lt;Garcinethlog@...&gt;","profile":"cindylevesque","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"apology was parenting question","postDate":"1124489396","msgId":6133,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRlNWxiaytraXUyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":6132,"nextInTime":6134,"topicId":6133,"numMessagesInTopic":0,"msgSnippet":"Just wanted to apologize to Deb and others.  I was getting frustrated because I couldn t seem to get across what the lady actually said to me and what was","messageBody":"<div id=\"ygrps-yiv-1898920703\">Just wanted to apologize to Deb and others.  I was getting frustrated <br/>\nbecause I couldn&#39;t seem to get across what the lady actually said to <br/>\nme and what was being interpreted here.<br/>\n<br/>\nYour responses did really help my son and myself. Maybe this lady was <br/>\njust trying to defend her beliefs that spankings are acceptable and <br/>\nwhen I asked her if she literally uses a rod or stick to strike her <br/>\nchildren, she replied that she beats them with a stick if the crime <br/>\nthey commit warrants it.  Maybe she was just spouting off to try to <br/>\ndefend her position and wasn&#39;t going to back down. I don&#39;t know any <br/>\nmore than what she said to me--I have never seen her beat her <br/>\nchildren. I am super sensitive to child abuse because of my past, so <br/>\nI&#39;m sure this is why this issue has been so cloudy for me. <br/>\n<br/>\nWe have decided that we will get together with the family on various <br/>\noutings and see what we shall see. Ethan and I have decided that <br/>\nafter a period of time if there doesn&#39;t appear to be any abuse that <br/>\nEthan will go over to this child&#39;s house without us, but with the <br/>\nprecautions that some of you mentioned (hopefully a cell phone or at <br/>\nleast some way to get in touch and a plan if something goes awry).  <br/>\nHowever, if either one of us sees abuse I will immediately get in <br/>\ntouch with the proper authorities and try to get help for this <br/>\nfamily.  We sincerely hope that the former not the latter will be the <br/>\ncase.<br/>\n<br/>\nAlso, FYI, I have never told Ethan he couldn&#39;t go to this child&#39;s <br/>\nhouse. The child&#39;s family has been gone on vacation and just returned <br/>\nso we were trying to figure out what to do in advance because he had <br/>\nreceived an invitation for next week. We discussed it and why I was <br/>\nfeeling concerned.  He, also, had concerns about going over and we <br/>\nhad really great discussions on parenting and whether children should <br/>\nhave the same rights as adults.  Ethan and I always have discussed <br/>\neverything and some times don&#39;t see eye to eye but figure out a <br/>\nsolution.  This time we reached out to others because we both were <br/>\nvery confused on a good solution to this.  Thanks for all of your <br/>\ninput and helping us come to a workable solution.<br/>\n<br/>\nCindy</div>","specialLinks":[]}],"prevTopicId":6112,"nextTopicId":6138}}