{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":19,"messages":[{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Intro & Meals/Eating","postDate":"1289652657","msgId":45309,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlibTFqaCtoYTJxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEQwMTAzQTUxLUI0OTYtNDU0MS04Mzk3LUVDN0EyMkNDREIxREB2ZXJpem9uLm5ldD4="},"prevInTopic":45298,"nextInTopic":0,"prevInTime":45308,"nextInTime":45310,"topicId":45136,"numMessagesInTopic":0,"msgSnippet":"I m glad you included this part, Joyce. Unschooling is not a way to have Mom jumping. It is a way to live well together, helping each other and doing what you","messageBody":"<div id=\"ygrps-yiv-1298593616\">I&#39;m glad you included this part, Joyce. Unschooling is not a way to have Mom jumping. It is a way to live well together, helping each other and doing what you can realistically do. <br/>\n<br/>\nNow when 15-year-old DD wants to go to the football game at the last minute (last night&#39;s event) and knows I have a very full plate, she brainstorms with me to figure out how to make it happen, how to juggle, who to ask what about timing and rides, etc. She knows it may not happen but that, together, we will try to meet everyone&#39;s needs.<br/>\n<br/>\nWhen 17-year-old DS is on his way to bed but sees I am trying to load the dishwasher, he lingers with the 4-year-old and everyone gets what they want done. Instead of my morning starting off hectic, with chores either undone or done in between playing with the &quot;baby,&quot; everything just flows smoothly. Not from being assigned or even asked, just from being part of a household where everyone is paying attention, in a nice way.<br/>\n<br/>\nNance<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; When kids are positive about their position on your priority list,  <br/>\n&gt; when your actions are proving it, then &quot;Let me finish this,&quot; when it&#39;s  <br/>\n&gt; not something that can be dropped will sound to them a whole lot  <br/>\n&gt; different. It will just be reality.<br/>\n&gt; <br/>\n&gt; Joyce<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] RE: Intro & Meals/Eating","postDate":"1289557998","msgId":45298,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQwMTAzQTUxLUI0OTYtNDU0MS04Mzk3LUVDN0EyMkNDREIxREB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEI3RjNBRDk3LUMwMEItNEIyQy04NzlFLTQwODU0MUJFMTE1M0BzYmNnbG9iYWwubmV0Pg==","referencesHeader":"PDAwMjYwMWNiODBlNSQ1ZTc2N2EwMCQxYjYzNmUwMCRAanVnZ2xlMTIuY29tPiA8NzQ0MkQxNzAtNjNDMS00QzBGLTg4QUItRDdBMzQzNUI5NjVFQHZlcml6b24ubmV0PiA8QjdGM0FEOTctQzAwQi00QjJDLTg3OUUtNDA4NTQxQkUxMTUzQHNiY2dsb2JhbC5uZXQ+"},"prevInTopic":45291,"nextInTopic":45309,"prevInTime":45297,"nextInTime":45299,"topicId":45136,"numMessagesInTopic":0,"msgSnippet":"... What that action says to your kids is they rank in priority right above nothing. Is that what you want to say to them? Often our actions say things we","messageBody":"<div id=\"ygrps-yiv-989027793\">On Nov 11, 2010, at 12:02 PM, Toby Rosenberg wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If I were sitting around doing nothing, of course I would help them  <br/>\n&gt; out.<br/>\n<br/>\n </span></blockquote>What that action says to your kids is they rank in priority right  <br/>\nabove nothing.<br/>\n<br/>\nIs that what you want to say to them?<br/>\n<br/>\nOften our actions say things we don&#39;t intend to say. But other people  <br/>\ndon&#39;t react to our intentions. They react to how our actions make them  <br/>\nfeel. Our intentions mean nothing if the actions say something  <br/>\ndifferent.<br/>\n<br/>\nIf your kids are asking for something they&#39;re saying it&#39;s important  <br/>\nenough to ask for help. It may not be about the thing. What they may  <br/>\nbe asking for is a connection with you. They&#39;re saying they feel cut  <br/>\noff, that there&#39;s a whole lot of important things you&#39;re putting  <br/>\nbetween you and them and they want to reconnect. By saying no they&#39;re  <br/>\nhearing, &quot;No, you&#39;re not important enough.&quot;<br/>\n<br/>\nWhen kids are positive about their position on your priority list,  <br/>\nwhen your actions are proving it, then &quot;Let me finish this,&quot; when it&#39;s  <br/>\nnot something that can be dropped will sound to them a whole lot  <br/>\ndifferent. It will just be reality.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] RE: Intro & Meals/Eating","postDate":"1289510692","msgId":45291,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMzMyMTZBREYwNTQ2MkU5NEM3QzFEQzg5QzEyNDc2QENvbm5pZVBDPg==","inReplyToHeader":"PEI3RjNBRDk3LUMwMEItNEIyQy04NzlFLTQwODU0MUJFMTE1M0BzYmNnbG9iYWwubmV0Pg==","referencesHeader":"PDAwMjYwMWNiODBlNSQ1ZTc2N2EwMCQxYjYzNmUwMCRAanVnZ2xlMTIuY29tPiA8NzQ0MkQxNzAtNjNDMS00QzBGLTg4QUItRDdBMzQzNUI5NjVFQHZlcml6b24ubmV0PiA8QjdGM0FEOTctQzAwQi00QjJDLTg3OUUtNDA4NTQxQkUxMTUzQHNiY2dsb2JhbC5uZXQ+"},"prevInTopic":45289,"nextInTopic":45298,"prevInTime":45290,"nextInTime":45292,"topicId":45136,"numMessagesInTopic":0,"msgSnippet":"From: Toby Rosenberg Sent: Thursday, November 11, 2010 11:02 AM To: unschoolingbasics@yahoogroups.com Subject: Re: [unschoolingbasics] RE: Intro & Meals/Eating","messageBody":"<div id=\"ygrps-yiv-73494329\">From: Toby Rosenberg <br/>\nSent: Thursday, November 11, 2010 11:02 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSubject: Re: [unschoolingbasics] RE: Intro & Meals/Eating<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;What about if I don&#39;t want to do something for my kids because I don&#39;t feel like it or more likely I am too busy.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I always try to reframe everything and think of how it would make me feel if my husband or children had that attitude. For example, how would I feel if my husband or children didn&#39;t want to do stuff for me because they don&#39;t feel like it or are too busy? If it was once in a while, it might be understandable. If my husband (or children) were always telling me that they didn&#39;t want to help me, I might feel rejected. I might wonder what I was doing wrong. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;For example, I&#39;m cleaning up in the house and my chid is hungry. All of my kids (12, 9, 3) except my 3 year old is capable of making themselves a sandwich.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Why can&#39;t you ask them to wait a few minutes while you finish up what you are doing? Even if they are capable of making a sandwich, that doesn&#39;t mean that they actually want a sandwich. Sometimes my kids will want stuff to eat that is more complicated than making a sandwich. If they want something more complicated, I might ask them if they can help me finish up what I am doing or even take over. There are a lot more choices than telling them no or dropping everything and doing it right that second. A lot of times, my 9 year old doesn&#39;t realize that I am busy because she is distracted doing her own thing. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;I don&#39;t want to always do things for them because I am not getting my needs filled like having a clean space. If I were sitting around doing nothing, of course I would help them out.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>How often do moms or dads actually get to sit around and do nothing? I always feel like I am busy doing something. If I were to reserve my help for times when I am not busy, then I would never help my kids. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;When anyone other than my children asks me for a favor I&#39;m willing, but if they keep asking for one thing after another, I would and have said no.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Why are you helpful for anyone other than your children? Your children aren&#39;t everyone else. You chose to have them. What if the favor is giving them a hug or a kiss? Would you feel the same way if they continually asked for a hug or a kiss? Each thing that I do for my children is like giving them a hug or a kiss. It is a way of saying &quot;I love you.&quot; <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;Aren&#39;t I just being real by telling my kids I don&#39;t want to do something for them when I am busy? At the same time if I see that they are not physically and mentally able to do something, I am always available for help.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>There is a huge difference between not wanting to do something and not being able to do something. If my kids ask for something while I am elbow deep in dishwater, it is not a matter of not wanting to help. It is a matter of not being able to help until I get my hands out of the water and dry my hands. A lot of times, my kids will ask for stuff while they are in a different room and can&#39;t actually see what I am doing. If I explain what I am doing, they will usually wait for me to get to a stopping point. My younger kids may not understand but my older ones do. Think about how many times you ask your kids to do stuff while they are busy. Do you extend them the courtesy of letting them get to a stopping point or do you insist that they do what you want them to do? <br/>\n<br/>\nConnie<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Intro & Meals/Eating","postDate":"1289501430","msgId":45289,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGliaGR0bStrbHB1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEI3RjNBRDk3LUMwMEItNEIyQy04NzlFLTQwODU0MUJFMTE1M0BzYmNnbG9iYWwubmV0Pg=="},"prevInTopic":45288,"nextInTopic":45291,"prevInTime":45288,"nextInTime":45290,"topicId":45136,"numMessagesInTopic":0,"msgSnippet":"... *************** It can help to look for ways to move away from the idea that your needs are in competition with your kids needs and desires. As a parent,","messageBody":"<div id=\"ygrps-yiv-1630239443\">Toby Rosenberg &lt;philipntoby@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t want to always do things for them because I am not getting my needs filled like having a clean space. <br/>\n </span></blockquote>***************<br/>\n<br/>\nIt can help to look for ways to move away from the idea that your needs are in competition with your kids&#39; needs and desires. As a parent, a certain amount of pleasure and satisfaction comes from being with and doing for my kids. That&#39;s a win-win, if I choose to see it as such: I &quot;get&quot; to take care of the people I love. <br/>\n<br/>\nIf you are having a hard time meeting your needs, its worth re-evaluating those needs. I don&#39;t mean &quot;say no to yourself&quot; I mean think about what you really do need so you can meet your needs better, and have more energy for other things. If a clean space meets a need for you, how *much* of a clean space do you need? Can you clean one room, or one part of a room and feel satisfied? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;If I were sitting around doing nothing, of course I would help them out.<br/>\n </span></blockquote>**************<br/>\n<br/>\nBut at the same time, if you&#39;re clinging to &quot;my needs&quot; too tightly, it can be easy to keep busy as a way of being able to say &quot;No&quot;. I&#39;m not saying you do that, but its something to look for if you tend to see your needs as being in competition with your kids. If you can keep &quot;working&quot; you can keep &quot;winning&quot;. <br/>\n<br/>\nIf I&#39;m up and around its easier for me to do one more thing - easier than if I&#39;m resting, since I&#39;m more likely to cling to my &quot;down time&quot;. So if I&#39;m feeling cranky and resentful, I&#39;m more likely to &quot;go there&quot; with the flip side of the above statement - I&#39;d be happy to do it if I were up. Woops. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Aren&#39;t I just being real by telling my kids I don&#39;t want to do something for them when I am busy? <br/>\n </span></blockquote>***************<br/>\n<br/>\nIf its a massive hassle to do one more thing right now, say so. But if its a pattern of not having time and energy to help the people you love, its worth looking for a way to change that pattern. Offer food before you start cleaning, maybe, and clean your way over to where the empty plates will be in ten minutes. Or invite your kids to help you, if they&#39;re not obviously in the middle of something else. <br/>\n<br/>\n&quot;Being real&quot; can be a good thing if it fosters connection - some adults will keep their &quot;real&quot; selves from their kids, put on a happy face too much, not express their own boundaries enough, or not let people know when they&#39;re overwhelmed until they crack. So being real or authentic in the sense of honoring and communicating your own humanity is a good thing. But at the same time, &quot;being real&quot; sometimes gets used to mean dumping the worst of our human nature on our loved ones: &quot;get your own f&#39;ing sandwich, I&#39;m busy.&quot; <br/>\n<br/>\nA lot of this depends on personal baggage. I was raised that &quot;its better to be a bitch than a doormat&quot; so I have had to work on finding the parts of me that are truly kind - kind to me And to other people, rather than stomping on everyone&#39;s emotions (including my own) because I didn&#39;t want to be walked on. Other women are raised with expectations that its better to be a martyr than a meanie (to flip my mother&#39;s saying around the other way), and will overlook their own needs too often in order to be &quot;nice&quot;. Neither of those extremes are particularly good for building partnerships. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] RE: Intro & Meals/Eating","postDate":"1289500323","msgId":45288,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxMzM4Ny44Nzk0MC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PEI3RjNBRDk3LUMwMEItNEIyQy04NzlFLTQwODU0MUJFMTE1M0BzYmNnbG9iYWwubmV0Pg==","referencesHeader":"PDAwMjYwMWNiODBlNSQ1ZTc2N2EwMCQxYjYzNmUwMCRAanVnZ2xlMTIuY29tPiA8NzQ0MkQxNzAtNjNDMS00QzBGLTg4QUItRDdBMzQzNUI5NjVFQHZlcml6b24ubmV0PiA8QjdGM0FEOTctQzAwQi00QjJDLTg3OUUtNDA4NTQxQkUxMTUzQHNiY2dsb2JhbC5uZXQ+"},"prevInTopic":45287,"nextInTopic":45289,"prevInTime":45287,"nextInTime":45289,"topicId":45136,"numMessagesInTopic":0,"msgSnippet":"    ","messageBody":"<div id=\"ygrps-yiv-1177415404\"> <br/>\n  <br/>\n&lt;&lt;&lt;&lt;,,&quot;What about if I don&#39;t want to do something for my kids because I don&#39;t <br/>\nfeel like it or more likely I am too busy. For example, I&#39;m cleaning up in the <br/>\nhouse and my chid is hungry. All of my kids (12, 9, 3) except my 3 year old is <br/>\ncapable of making themselves a sandwich. I don&#39;t want to always do things for <br/>\nthem because I am not getting my needs filled like having a clean space. If I <br/>\nwere sitting around doing nothing, of course I would help them out. When anyone <br/>\nother than my children asks me for a favor I&#39;m willing, but if they keep asking <br/>\nfor one thing after another, I would and have said no. Aren&#39;t I just being real <br/>\nby telling my kids I don&#39;t want to do something for them when I am busy? At the <br/>\nsame time if I see that they are not physically and mentally able to do <br/>\nsomething, I am always available for help.&quot;&gt;&gt;&gt;&gt;&gt;<br/>\n <br/>\n <br/>\nSometimes I am super busy and my husband asks me for a favor and I gladly d it <br/>\nfor him. Sometimes I am the one who asks for a favor from my super busy husband, <br/>\nand when I say busy I meant he works everyday 365 from 4:30 AM until 9:00PM and <br/>\nsometimes more,  and he stops what he is doing ( unless he literally cannot) and <br/>\ndoe it for me.<br/>\nIts so sweet!&#39;<br/>\nI do it for my kids as well and they do it for me. There has been time when my <br/>\nson was doing something or in the middle of something that he paused it to do <br/>\nsomething for me, specially when his little sister was younger. <br/>\n<br/>\nI try not to ask for favors when they are busy but sometimes I do and I have to <br/>\nsay that they almost always  help me out because  do the same for them.<br/>\nAnother thing I remember when I was your children&#39;s age and could make my own <br/>\nfood, sandwiches and all , was that  food made by my mom tasted better than made <br/>\nby me.<br/>\nI loved when my mom made me a grilled cheese. I still do and my 70 year old <br/>\nmother still makes for me!!!!!!!!<br/>\nIf you do not want to take the time to give your kids the gift of a snack or <br/>\nsaml meal when they are hungry then don&#39;t.<br/>\nBut you will be missing out on so much. That I can assure you.<br/>\nIf you do it with love and as a gift to your children you will see how much more <br/>\nimportant it is to give those small gives of love than to  stay on task cleaning <br/>\nthe house.<br/>\nAlex Polikowksy<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":294879737,"authorName":"Toby Rosenberg","from":"Toby Rosenberg &lt;philipntoby@...&gt;","profile":"philipntoby@sbcglobal.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] RE: Intro & Meals/Eating","postDate":"1289494972","msgId":45287,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI3RjNBRDk3LUMwMEItNEIyQy04NzlFLTQwODU0MUJFMTE1M0BzYmNnbG9iYWwubmV0Pg==","inReplyToHeader":"PDc0NDJEMTcwLTYzQzEtNEMwRi04OEFCLUQ3QTM0MzVCOTY1RUB2ZXJpem9uLm5ldD4=","referencesHeader":"PDAwMjYwMWNiODBlNSQ1ZTc2N2EwMCQxYjYzNmUwMCRAanVnZ2xlMTIuY29tPiA8NzQ0MkQxNzAtNjNDMS00QzBGLTg4QUItRDdBMzQzNUI5NjVFQHZlcml6b24ubmV0Pg=="},"prevInTopic":45286,"nextInTopic":45288,"prevInTime":45286,"nextInTime":45288,"topicId":45136,"numMessagesInTopic":0,"msgSnippet":"What about if I don t want to do something for my kids because I don t feel like it or more likely I am too busy. For example, I m cleaning up in the house and","messageBody":"<div id=\"ygrps-yiv-1836383614\">What about if I don&#39;t want to do something for my kids because I don&#39;t feel like it or more likely I am too busy. For example, I&#39;m cleaning up in the house and my chid is hungry. All of my kids (12, 9, 3) except my 3 year old is capable of making themselves a sandwich. I don&#39;t want to always do things for them because I am not getting my needs filled like having a clean space. If I were sitting around doing nothing, of course I would help them out. When anyone other than my children asks me for a favor I&#39;m willing, but if they keep asking for one thing after another, I would and have said no.  Aren&#39;t I just being real by telling my kids I don&#39;t want to do something for them when I am busy? At the same time if I see that they are not physically and mentally able to do something, I am always available for help.<br/>\n<br/>\nToby</div>","specialLinks":[]},{"userId":194427255,"authorName":"Julie","from":"&quot;Julie&quot; &lt;jmarkoski@...&gt;","profile":"jmarkoski","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Intro & Meals/Eating","postDate":"1289492176","msgId":45286,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGliaDRzZytyNWx1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMjYwMWNiODBlNSQ1ZTc2N2EwMCQxYjYzNmUwMCRAanVnZ2xlMTIuY29tPg=="},"prevInTopic":45285,"nextInTopic":45287,"prevInTime":45285,"nextInTime":45287,"topicId":45136,"numMessagesInTopic":0,"msgSnippet":"I offer my kids stuff all the time and I just don t recognize the mindset that it could teach them to be waited on . I offer them food, attention, access to a","messageBody":"<div id=\"ygrps-yiv-361245137\">I offer my kids stuff all the time and I just don&#39;t recognize the mindset that it could &quot;teach them to be waited on&quot;. I offer them food, attention, access to a new thing or experience, etc because I love them and care about their happiness. Unschooling is very hard if you&#39;re worried about future results. You really have to live in the now and meet today&#39;s needs rather than worry about tomorrow&#39;s possibilities.<br/>\n<br/>\nJulie M<br/>\njames 2005<br/>\ntyler 2007<br/>\naudrey 2009<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Scott & Marygrace Sorensen&quot; &lt;sorensen@...&gt; wrote:<br/>\n&gt;<br/>\n<br/>\n&gt; I just have one concern now.  I feel like I&#39;m teaching him that he will get<br/>\n&gt; waited on.  I don&#39;t want him to embody that idea.  Though I&#39;m hoping it will<br/>\n&gt; translate out in him being a more helpful person in the long run.  He&#39;s<br/>\n&gt; always the first in a group to check on someone who falls or gets hurt,<br/>\n&gt; however, he&#39;s always the last when it comes to volunteering to help out with<br/>\n&gt; chores.  <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; I know it will be alright, but just one of those back of the mind concerns I<br/>\n&gt; have that occasionally makes it&#39;s screaming way to the forefront of my mind!<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Thank for all the great reading.  This is a terrific resource.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Marygrace<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] RE: Intro & Meals/Eating","postDate":"1289422808","msgId":45285,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2QzhDQTVFOTk5NjRFODhBQ0ZDM0FBNkI4NUExQUUzQENvbm5pZVBDPg==","inReplyToHeader":"PDc0NDJEMTcwLTYzQzEtNEMwRi04OEFCLUQ3QTM0MzVCOTY1RUB2ZXJpem9uLm5ldD4=","referencesHeader":"PDAwMjYwMWNiODBlNSQ1ZTc2N2EwMCQxYjYzNmUwMCRAanVnZ2xlMTIuY29tPiA8NzQ0MkQxNzAtNjNDMS00QzBGLTg4QUItRDdBMzQzNUI5NjVFQHZlcml6b24ubmV0Pg=="},"prevInTopic":45280,"nextInTopic":45286,"prevInTime":45284,"nextInTime":45286,"topicId":45136,"numMessagesInTopic":0,"msgSnippet":"From: Joyce Fetteroll Sent: Wednesday, November 10, 2010 11:13 AM To: unschoolingbasics@yahoogroups.com Subject: Re: [unschoolingbasics] RE: Intro &","messageBody":"<div id=\"ygrps-yiv-285987881\">From: Joyce Fetteroll <br/>\nSent: Wednesday, November 10, 2010 11:13 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSubject: Re: [unschoolingbasics] RE: Intro & Meals/Eating<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Nov 10, 2010, at 9:41 AM, Scott & Marygrace Sorensen wrote:<br/>\n<br/>\n&gt; I just have one concern now. I feel like I&#39;m teaching him that he <br/>\n&gt; will get<br/>\n&gt; waited on. I don&#39;t want him to embody that idea.<br/>\n<br/>\nYou fed him when he was an infant right? Fed him as a toddler? Changed <br/>\nhis diaper for him? Wiped his butt when he could go on his own? Pushed <br/>\nhim in a stroller or carried him around? And read to him?<br/>\n*************************<br/>\n<br/>\nA thought that I had as I read this exchange was to think about the times that you have asked your kids to do stuff for you. If my daughter is in the kitchen and is coming right by me, I will ask her if she can bring me my water. How many times in a day do you ask your children to do stuff? How would you feel if your children said that they were afraid to do stuff for you because they felt like they were teaching you that you will get waited on? <br/>\n<br/>\nConnie<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] RE: Intro & Meals/Eating","postDate":"1289409216","msgId":45280,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0NDJEMTcwLTYzQzEtNEMwRi04OEFCLUQ3QTM0MzVCOTY1RUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDAwMjYwMWNiODBlNSQ1ZTc2N2EwMCQxYjYzNmUwMCRAanVnZ2xlMTIuY29tPg==","referencesHeader":"PDAwMjYwMWNiODBlNSQ1ZTc2N2EwMCQxYjYzNmUwMCRAanVnZ2xlMTIuY29tPg=="},"prevInTopic":45279,"nextInTopic":45285,"prevInTime":45279,"nextInTime":45281,"topicId":45136,"numMessagesInTopic":0,"msgSnippet":"... You fed him when he was an infant right? Fed him as a toddler? Changed his diaper for him? Wiped his butt when he could go on his own? Pushed him in a","messageBody":"<div id=\"ygrps-yiv-296225569\">On Nov 10, 2010, at 9:41 AM, Scott & Marygrace Sorensen wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I just have one concern now. I feel like I&#39;m teaching him that he  <br/>\n&gt; will get<br/>\n&gt; waited on. I don&#39;t want him to embody that idea.<br/>\n<br/>\n </span></blockquote>You fed him when he was an infant right? Fed him as a toddler? Changed  <br/>\nhis diaper for him? Wiped his butt when he could go on his own? Pushed  <br/>\nhim in a stroller or carried him around? And read to him?<br/>\n<br/>\nI wiped my daughter&#39;s butt for quite a few years after she could do it  <br/>\nherself. I read to her even after she could read herself. (In fact I  <br/>\nstill do and she&#39;s 19.) I cook for her even though she&#39;s capable of  <br/>\ncooking some simple meals herself.<br/>\n<br/>\nWhy do kids out grow that good deal? They could choose to just lie  <br/>\nthere and have everything done for them. No choices to make. No effort  <br/>\nto put out.<br/>\n<br/>\nAnd yet they don&#39;t. Why?<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163414916,"authorName":"Scott & Marygrace Sorensen","from":"&quot;Scott & Marygrace Sorensen&quot; &lt;sorensen@...&gt;","profile":"unity_yfm_specialist","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: Intro & Meals/Eating","postDate":"1289400092","msgId":45279,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjYwMWNiODBlNSQ1ZTc2N2EwMCQxYjYzNmUwMCRAanVnZ2xlMTIuY29tPg==","inReplyToHeader":"","referencesHeader":""},"prevInTopic":45201,"nextInTopic":45280,"prevInTime":45278,"nextInTime":45280,"topicId":45136,"numMessagesInTopic":0,"msgSnippet":"Anyhow, my question is about eating and mealtimes.  My son is just not eating, he s so interested and focused in what he s doing at the moment.  I figure he","messageBody":"<div id=\"ygrps-yiv-1744927655\">&quot;Anyhow, my question is about eating and mealtimes.  My son is just not<br/>\neating, he&#39;s so interested and focused in what he&#39;s doing at the moment.  I<br/>\nfigure he won&#39;t starve, he eventually does let me know he&#39;s hungry usually,<br/>\nbut it can be 3pm before he&#39;s listened to his body and asked for anything to<br/>\neat or drink.  I just concerned, especially since he&#39;s so slender for his<br/>\nheight and age (~65% for height; ~20% for weight) that he&#39;s not getting the<br/>\nproper nutrition or hydration.&quot;  <br/>\n<br/>\n <br/>\n<br/>\nThank you for all the great tips.  I&#39;ve been taking food to him and the<br/>\nmonkey platter has worked great, he&#39;s still not trying new things or things<br/>\nhe hasn&#39;t liked previously, but that doesn&#39;t bother me.<br/>\n<br/>\n <br/>\n<br/>\nI just have one concern now.  I feel like I&#39;m teaching him that he will get<br/>\nwaited on.  I don&#39;t want him to embody that idea.  Though I&#39;m hoping it will<br/>\ntranslate out in him being a more helpful person in the long run.  He&#39;s<br/>\nalways the first in a group to check on someone who falls or gets hurt,<br/>\nhowever, he&#39;s always the last when it comes to volunteering to help out with<br/>\nchores.  <br/>\n<br/>\n <br/>\n<br/>\nI know it will be alright, but just one of those back of the mind concerns I<br/>\nhave that occasionally makes it&#39;s screaming way to the forefront of my mind!<br/>\n<br/>\n <br/>\n<br/>\nThank for all the great reading.  This is a terrific resource.<br/>\n<br/>\n <br/>\n<br/>\nMarygrace<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:food presentation WAS Meals/eating","postDate":"1288451673","msgId":45201,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhaGNvcCs1ZHNoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc5M0EyRDM1LTUyMzgtNDM2Qy1BQjdCLUVDQUIwMTkyNzA0MEB0aGVwYWNrd29vZHMubmV0Pg=="},"prevInTopic":45191,"nextInTopic":45279,"prevInTime":45200,"nextInTime":45202,"topicId":45136,"numMessagesInTopic":0,"msgSnippet":"... ***************** For paper and cellophane, I would hunt through stores for discounted wrapping paper, actually. Look in party sections or floral sections","messageBody":"<div id=\"ygrps-yiv-793905798\">Tamara Account &lt;tamara@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I love the sound of those cellophane and origami wraps. any tips on whereto find tutorials?<br/>\n </span></blockquote>*****************<br/>\n<br/>\nFor paper and cellophane, I would hunt through stores for discounted wrapping paper, actually. Look in party sections or floral sections for different colors of cellophane. Last year, in the &quot;after xmas&quot; sales I stocked up on wrapping paper (we still use it for all kinds of crafts) and found some fun xmas foils and plastic wraps that I&#39;ve used to pack lunches in when all the plastic containers are dirty :P<br/>\n<br/>\nHere&#39;s a good site for free origami patterns:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.origami-fun.com/\">http://www.origami-fun.com/</a><br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":382314233,"authorName":"Tamara Account","from":"Tamara Account &lt;tamara@...&gt;","profile":"bajantomorrow","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:food presentation WAS Meals/eating","postDate":"1288425596","msgId":45191,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5M0EyRDM1LTUyMzgtNDM2Qy1BQjdCLUVDQUIwMTkyNzA0MEB0aGVwYWNrd29vZHMubmV0Pg=="},"prevInTopic":45175,"nextInTopic":45201,"prevInTime":45190,"nextInTime":45192,"topicId":45136,"numMessagesInTopic":0,"msgSnippet":"I love the sound of those cellophane and origami wraps. any tips on whereto find tutorials? We use stickers and seek out interesting commercial packaging to","messageBody":"<div id=\"ygrps-yiv-777677110\">I love the sound of those cellophane and origami wraps. any tips on whereto find tutorials?<br/>\n<br/>\nWe use stickers and seek out interesting commercial packaging to make our homemade snacks appealing.</div>","specialLinks":[]},{"userId":163414916,"authorName":"Scott & Marygrace Sorensen","from":"&quot;Scott & Marygrace Sorensen&quot; &lt;sorensen@...&gt;","profile":"unity_yfm_specialist","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Intro & Meals/Eating","postDate":"1288366592","msgId":45175,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxOTYwMWNiNzc3ZiQxMGQzMGQ1MCQzMjc5MjdmMCRAanVnZ2xlMTIuY29tPg==","inReplyToHeader":"PDE0MjcuMTI4Ljk1LjIzOC40OC4xMjg4MzE1Nzk1LnNxdWlycmVsQHdlYm1haWwuZHJpenpsZS5jb20+","referencesHeader":"IDwwMDNjMDFjYjc2YzQkMWYzOTU2MzAkNWRhYzAyOTAkQGp1Z2dsZTEyLmNvbT4gPDE0MjcuMTI4Ljk1LjIzOC40OC4xMjg4MzE1Nzk1LnNxdWlycmVsQHdlYm1haWwuZHJpenpsZS5jb20+"},"prevInTopic":45174,"nextInTopic":45191,"prevInTime":45174,"nextInTime":45176,"topicId":45136,"numMessagesInTopic":0,"msgSnippet":"He does like to cook, but getting him interested takes some doing, it means time away from another activity he d choose first.  I ll suggest some things. ","messageBody":"<div id=\"ygrps-yiv-1418975808\">He does like to cook, but getting him interested takes some doing, it means<br/>\ntime away from another activity he&#39;d choose first.  I&#39;ll suggest some<br/>\nthings.<br/>\n<br/>\n <br/>\n<br/>\nThanks.<br/>\n<br/>\n <br/>\n<br/>\nMarygrace</div>","specialLinks":[]},{"userId":163414916,"authorName":"Scott & Marygrace Sorensen","from":"&quot;Scott & Marygrace Sorensen&quot; &lt;sorensen@...&gt;","profile":"unity_yfm_specialist","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: Intro & Meals/Eating","postDate":"1288366515","msgId":45174,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxOTAwMWNiNzc3ZSRlMjhjMjBkMCRhN2E0NjI3MCRAanVnZ2xlMTIuY29tPg==","inReplyToHeader":"PGlhZDNsNitoNmJqQGVHcm91cHMuY29tPg==","referencesHeader":"PDAwM2MwMWNiNzZjNCQxZjM5NTYzMCQ1ZGFjMDI5MCRAanVnZ2xlMTIuY29tPiA8aWFkM2w2K2g2YmpAZUdyb3Vwcy5jb20+"},"prevInTopic":45172,"nextInTopic":45175,"prevInTime":45173,"nextInTime":45175,"topicId":45136,"numMessagesInTopic":0,"msgSnippet":"Thanks for the tip.  I used to do this when he was younger.  I ve never heard of monkey platters, but had made them anyway. Great ideas. Thank you. Marygrace","messageBody":"<div id=\"ygrps-yiv-928535019\">Thanks for the tip.  I used to do this when he was younger.  I&#39;ve never<br/>\nheard of monkey platters, but had made them anyway.<br/>\n<br/>\n <br/>\n<br/>\nGreat ideas.<br/>\n<br/>\n <br/>\n<br/>\nThank you.<br/>\n<br/>\n <br/>\n<br/>\nMarygrace</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"food presentation WAS Meals/eating","postDate":"1288362335","msgId":45172,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhZWxnditnbWRoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE0MjcuMTI4Ljk1LjIzOC40OC4xMjg4MzE1Nzk1LnNxdWlycmVsQHdlYm1haWwuZHJpenpsZS5jb20+"},"prevInTopic":45158,"nextInTopic":45174,"prevInTime":45171,"nextInTime":45173,"topicId":45136,"numMessagesInTopic":0,"msgSnippet":"When Mo was younger and so busy as to forget to eat, I d dress up foods with fancy tooth-picks or serve it on a colorful plate, even use plastic toys as","messageBody":"<div id=\"ygrps-yiv-1548033315\">When Mo was younger and so busy as to forget to eat, I&#39;d &quot;dress up&quot; foods with fancy tooth-picks or serve it on a colorful plate, even use plastic toys as plates and cups. That would help her notice the food. Eating got to be part of playing, not something she had to stop playing to do.<br/>\n<br/>\nMaking food attractive is also a good strategy if you want to &quot;level the playing field&quot; between home-made and commercial foods. Attractiveness and convenience are two big big factors in making commercial foods more desirable - I know there&#39;s a lot of fuss about ingredients like sugar or artificial flavors tricking kids into liking certain foods more, but I&#39;ve consistently seen that &quot;effect&quot; diminishes significantly when you make sure home-made foods are just as convenient and attractive as store bought. That can be a bit more work: when Mo was little, she especially liked individually wrapped items - all the fun of a birthday party and you get to eat the &quot;gift&quot; too! So I would wrap up home-made foods in pretty papers and cellophane, or make little origami boxes so that she wouldn&#39;t be choosing between fun commercial foods and hum-drum home-made. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Intro & Meals/Eating","postDate":"1288346955","msgId":45158,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU1NDBFRTZFLTdCREUtNEY2NC04MzY3LTY4MjQyRjUzQjRCQkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDAwM2MwMWNiNzZjNCQxZjM5NTYzMCQ1ZGFjMDI5MCRAanVnZ2xlMTIuY29tPg==","referencesHeader":"PDAwM2MwMWNiNzZjNCQxZjM5NTYzMCQ1ZGFjMDI5MCRAanVnZ2xlMTIuY29tPg=="},"prevInTopic":45154,"nextInTopic":45172,"prevInTime":45157,"nextInTime":45159,"topicId":45136,"numMessagesInTopic":0,"msgSnippet":"... Bring food and drink to him!  Make it easy to grab. Change it up until you find the kinds of things it s easy for him to take a moment to eat. If he were","messageBody":"<div id=\"ygrps-yiv-1369887686\">On Oct 28, 2010, at 1:18 PM, Scott & Marygrace Sorensen wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  My son is just not<br/>\n&gt; eating, he&#39;s so interested and focused in what he&#39;s doing at the  <br/>\n&gt; moment. I<br/>\n&gt; figure he won&#39;t starve, he eventually does let me know he&#39;s hungry  <br/>\n&gt; usually,<br/>\n&gt; but it can be 3pm before he&#39;s listened to his body and asked for  <br/>\n&gt; anything to<br/>\n&gt; eat or drink<br/>\n<br/>\n </span></blockquote>Bring food and drink to him!  Make it easy to grab. Change it up until  <br/>\nyou find the kinds of things it&#39;s easy for him to take a moment to eat.<br/>\n<br/>\nIf he were an amazing artist creating beautiful sculptures the world  <br/>\nloved who couldn&#39;t break his brain&#39;s attention long enough to notice  <br/>\nhis body had needs of its own, wouldn&#39;t it feel like a gift to him to  <br/>\nbring food to him and take care of the things he was too consumed to  <br/>\nnotice?<br/>\n<br/>\nSee that same passion for accomplishment in your son and give him the  <br/>\ngift of helping him do that :-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":146052230,"authorName":"Sacha Davis","from":"&quot;Sacha Davis&quot; &lt;sacha@...&gt;","profile":"sacha_pie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Intro & Meals/Eating","postDate":"1288315795","msgId":45154,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0MjcuMTI4Ljk1LjIzOC40OC4xMjg4MzE1Nzk1LnNxdWlycmVsQHdlYm1haWwuZHJpenpsZS5jb20+","inReplyToHeader":"PDAwM2MwMWNiNzZjNCQxZjM5NTYzMCQ1ZGFjMDI5MCRAanVnZ2xlMTIuY29tPg==","referencesHeader":"IDwwMDNjMDFjYjc2YzQkMWYzOTU2MzAkNWRhYzAyOTAkQGp1Z2dsZTEyLmNvbT4="},"prevInTopic":45152,"nextInTopic":45158,"prevInTime":45153,"nextInTime":45155,"topicId":45136,"numMessagesInTopic":0,"msgSnippet":"Marygrace - my son is quite a bit younger, 3.5 y/o, but we have the same issue of him not eating and he s actually lost a pound in the last couple months.","messageBody":"<div id=\"ygrps-yiv-1093197118\">Marygrace - my son is quite a bit younger, 3.5 y/o, but we have the same<br/>\nissue of him not eating and he&#39;s actually lost a pound in the last couple<br/>\nmonths.  Being a skinny kiddo to start it&#39;s hard not to worry and I&#39;ve had<br/>\nto do a lot of letting go but I do my best and trust that he&#39;ll get what<br/>\nhe needs because he knows what he needs instinctively.  And I make him<br/>\nsome high protein tasty cottage cheese pancakes for breakfast to get a<br/>\nlittle extra into him.<br/>\n<br/>\nHave you considered involving your son in the kitchen?  Coming up with<br/>\nmeals, researching different cuisines, learning different things to cook,<br/>\nmight inspire him to ingest some of those creations as well.<br/>\n<br/>\nBest of luck!!!<br/>\n<br/>\nSacha<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Hi,<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; We&#39;ve just started homeschooling/unschooling this fall and just found this<br/>\n&gt; group.  We have one son, 10 years old, who has mostly been in private<br/>\n&gt; schools except for seven awful months of public school in 1st grade.  His<br/>\n&gt; school experience in private, after we rescued him from public school, was<br/>\n&gt; wonderful.  It only took me 3 days to get my joyful, happy child back in<br/>\n&gt; private school, however, the economy finally made that route no longer<br/>\n&gt; possible this fall.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Son is fine.  Happy with directing his learning.  In the two months since<br/>\n&gt; we&#39;ve started unschooling, though I suppose we really started the day<br/>\n&gt; fourth<br/>\n&gt; grade let out, we&#39;ve been through arches, columns, roadrunners, Greek<br/>\n&gt; mythology, craters, meteors, monkey&#39;s flexibility, the origins of<br/>\n&gt; Halloween,<br/>\n&gt; farming, castles, fall foliage and why it happens, more physics stuff than<br/>\n&gt; I<br/>\n&gt; can recount and on and on.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Though, I am constantly going back and forth between controlling and<br/>\n&gt; being.<br/>\n&gt; It&#39;s a struggle for me to just let it be.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Anyhow, my question is about eating and mealtimes.  My son is just not<br/>\n&gt; eating, he&#39;s so interested and focused in what he&#39;s doing at the moment.<br/>\n&gt; I<br/>\n&gt; figure he won&#39;t starve, he eventually does let me know he&#39;s hungry<br/>\n&gt; usually,<br/>\n&gt; but it can be 3pm before he&#39;s listened to his body and asked for anything<br/>\n&gt; to<br/>\n&gt; eat or drink.  I just concerned, especially since he&#39;s so slender for his<br/>\n&gt; height and age (~65% for height; ~20% for weight) that he&#39;s not getting<br/>\n&gt; the<br/>\n&gt; proper nutrition or hydration.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Also, we&#39;ve always tried to sit down as a family to eat dinner and now he<br/>\n&gt; sometimes ds doesn&#39;t want to come to the table.  It&#39;s my husband&#39;s time to<br/>\n&gt; check in to see what we&#39;ve done for the day, so it&#39;s important to DH.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Let it go?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Marygrace<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Intro & Meals/Eating","postDate":"1288311270","msgId":45152,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhZDNsNitoNmJqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwM2MwMWNiNzZjNCQxZjM5NTYzMCQ1ZGFjMDI5MCRAanVnZ2xlMTIuY29tPg=="},"prevInTopic":45136,"nextInTopic":45154,"prevInTime":45151,"nextInTime":45153,"topicId":45136,"numMessagesInTopic":0,"msgSnippet":"... Bring food and drinks to where he is - we have some little plastic garden tables that work well for snacks anytime. Make it Easy for him to eat and drink.","messageBody":"<div id=\"ygrps-yiv-1856547948\">&quot;Scott & Marygrace Sorensen&quot; &lt;sorensen@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Anyhow, my question is about eating and mealtimes.  My son is just not<br/>\n&gt; eating, he&#39;s so interested and focused in what he&#39;s doing at the moment.<br/>\n<br/>\n </span></blockquote>Bring food and drinks to where he is - we have some little plastic garden tables that work well for snacks anytime. Make it Easy for him to eat and drink. If he&#39;s not a big eater give him small portions or plates of mixed foods. Have you heard of monkey plates? There are some fun ideas here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/eating/monkeyplatter\">http://sandradodd.com/eating/monkeyplatter</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also, we&#39;ve always tried to sit down as a family to eat dinner and now he<br/>\n&gt; sometimes ds doesn&#39;t want to come to the table.  It&#39;s my husband&#39;s time to<br/>\n&gt; check in to see what we&#39;ve done for the day, so it&#39;s important to DH.<br/>\n<br/>\n </span></blockquote>Would your dh be willing to &quot;check in&quot; with his son separately - make dinner time special for the two of you. Once your son has had some time to deschool, he might join in just because it looks so nice and cozy. <br/>\n<br/>\nIf dinner is a really big deal for you dh, let your son know enough in advance of dinner that he can wrap up what he&#39;s doing. Also, don&#39;t require him to sit through a whole meal. Let him tell his dad what he&#39;s been doing and then go if he wants. Since he&#39;ll have had other things to eat during the day, dinner doesn&#39;t have to be about food, it can be about socializing and connecting with loved ones. <br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;&gt;Happy with directing his learning.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&gt; Hi,<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; We&#39;ve just started homeschooling/unschooling this fall and just found this<br/>\n&gt; group.  We have one son, 10 years old, who has mostly been in private<br/>\n&gt; schools except for seven awful months of public school in 1st grade.  His<br/>\n&gt; school experience in private, after we rescued him from public school, was<br/>\n&gt; wonderful.  It only took me 3 days to get my joyful, happy child back in<br/>\n&gt; private school, however, the economy finally made that route no longer<br/>\n&gt; possible this fall.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Son is fine.  Happy with directing his learning.  In the two months since<br/>\n&gt; we&#39;ve started unschooling, though I suppose we really started the day fourth<br/>\n&gt; grade let out, we&#39;ve been through arches, columns, roadrunners, Greek<br/>\n&gt; mythology, craters, meteors, monkey&#39;s flexibility, the origins of Halloween,<br/>\n&gt; farming, castles, fall foliage and why it happens, more physics stuff than I<br/>\n&gt; can recount and on and on.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Though, I am constantly going back and forth between controlling and being.<br/>\n&gt; It&#39;s a struggle for me to just let it be.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Anyhow, my question is about eating and mealtimes.  My son is just not<br/>\n&gt; eating, he&#39;s so interested and focused in what he&#39;s doing at the moment.  I<br/>\n&gt; figure he won&#39;t starve, he eventually does let me know he&#39;s hungry usually,<br/>\n&gt; but it can be 3pm before he&#39;s listened to his body and asked for anything to<br/>\n&gt; eat or drink.  I just concerned, especially since he&#39;s so slender for his<br/>\n&gt; height and age (~65% for height; ~20% for weight) that he&#39;s not getting the<br/>\n&gt; proper nutrition or hydration.  <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Also, we&#39;ve always tried to sit down as a family to eat dinner and now he<br/>\n&gt; sometimes ds doesn&#39;t want to come to the table.  It&#39;s my husband&#39;s time to<br/>\n&gt; check in to see what we&#39;ve done for the day, so it&#39;s important to DH.  <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Let it go? <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Marygrace<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":163414916,"authorName":"Scott & Marygrace Sorensen","from":"&quot;Scott & Marygrace Sorensen&quot; &lt;sorensen@...&gt;","profile":"unity_yfm_specialist","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Intro & Meals/Eating","postDate":"1288286301","msgId":45136,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2MwMWNiNzZjNCQxZjM5NTYzMCQ1ZGFjMDI5MCRAanVnZ2xlMTIuY29tPg=="},"prevInTopic":0,"nextInTopic":45152,"prevInTime":45135,"nextInTime":45137,"topicId":45136,"numMessagesInTopic":0,"msgSnippet":"Hi, We ve just started homeschooling/unschooling this fall and just found this group.  We have one son, 10 years old, who has mostly been in private schools","messageBody":"<div id=\"ygrps-yiv-1195392789\">Hi,<br/>\n<br/>\n <br/>\n<br/>\nWe&#39;ve just started homeschooling/unschooling this fall and just found this<br/>\ngroup.  We have one son, 10 years old, who has mostly been in private<br/>\nschools except for seven awful months of public school in 1st grade.  His<br/>\nschool experience in private, after we rescued him from public school, was<br/>\nwonderful.  It only took me 3 days to get my joyful, happy child back in<br/>\nprivate school, however, the economy finally made that route no longer<br/>\npossible this fall.<br/>\n<br/>\n <br/>\n<br/>\nSon is fine.  Happy with directing his learning.  In the two months since<br/>\nwe&#39;ve started unschooling, though I suppose we really started the day fourth<br/>\ngrade let out, we&#39;ve been through arches, columns, roadrunners, Greek<br/>\nmythology, craters, meteors, monkey&#39;s flexibility, the origins of Halloween,<br/>\nfarming, castles, fall foliage and why it happens, more physics stuff than I<br/>\ncan recount and on and on.<br/>\n<br/>\n <br/>\n<br/>\nThough, I am constantly going back and forth between controlling and being.<br/>\nIt&#39;s a struggle for me to just let it be.<br/>\n<br/>\n <br/>\n<br/>\nAnyhow, my question is about eating and mealtimes.  My son is just not<br/>\neating, he&#39;s so interested and focused in what he&#39;s doing at the moment.  I<br/>\nfigure he won&#39;t starve, he eventually does let me know he&#39;s hungry usually,<br/>\nbut it can be 3pm before he&#39;s listened to his body and asked for anything to<br/>\neat or drink.  I just concerned, especially since he&#39;s so slender for his<br/>\nheight and age (~65% for height; ~20% for weight) that he&#39;s not getting the<br/>\nproper nutrition or hydration.  <br/>\n<br/>\n <br/>\n<br/>\nAlso, we&#39;ve always tried to sit down as a family to eat dinner and now he<br/>\nsometimes ds doesn&#39;t want to come to the table.  It&#39;s my husband&#39;s time to<br/>\ncheck in to see what we&#39;ve done for the day, so it&#39;s important to DH.  <br/>\n<br/>\n <br/>\n<br/>\nLet it go? <br/>\n<br/>\n <br/>\n<br/>\nMarygrace<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":45274,"nextTopicId":45297}}