{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"I live therefore I learn---article by Pam Sorooshian","postDate":"1113747883","msgId":5405,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDNzExNzA1NTM1REIwRi1CNTQtM0REQkJAbWJsay1yMTkuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":5404,"nextInTime":5406,"topicId":5405,"numMessagesInTopic":0,"msgSnippet":"This is an article by Pam Sorooshian, a speaker at this year s Live and Learn Unschooling Conference. I LIVE THEREFORE I LEARN: Living an Unschooling Life ","messageBody":"<div id=\"ygrps-yiv-1179683845\">This is an article by Pam Sorooshian, a speaker at this year&#39;s Live and <br/>\nLearn Unschooling Conference.<br/>\n<br/>\nI LIVE THEREFORE I LEARN: Living an Unschooling Life<br/>\n<br/>\nUnschooling is both easy and difficult to describe. The easy answer is<br/>\nthat unschooling means &quot;not schooling,&quot; but it is a lot harder to<br/>\nexplain what we do instead of schooling.<br/>\n<br/>\nUnschooling means not depending on the usual school methods. It means<br/>\nno lesson plans, no curriculum, no assignments, no quizzes or tests, no<br/>\nrequired memorizing, and no grades. It means that the parent does not<br/>\nbecome the child&#39;s schoolteacher—it means not creating a miniature<br/>\nclassroom in the home.<br/>\n<br/>\nInstead, unschoolers focus on living a rich and stimulating life<br/>\ntogether. Seriously, that&#39;s it. We do not &quot;school,&quot; but, instead, we<br/>\nconcentrate on living a life filled with opportunities and<br/>\npossibilities and experiences. Human children are born learners.<br/>\nLiterally. What unschoolers aim for is keeping that love of learning<br/>\nand intense curiosity alive as the children grow up.<br/>\n<br/>\nHow do we do this? In practice, it is going to look very different for<br/>\neach unschooling family. &quot;We follow our interests,&quot; is the unschoolers’<br/>\nanthem. And, each family&#39;s interests will lead to all kinds of<br/>\nlearning—history, math, writing, music, reading, science, and all the<br/>\nother real-life subject matter that is valuable and interesting. But we<br/>\nwon&#39;t think of them as “subjects.” We&#39;ll just think of them as<br/>\ninteresting and fun and fascinating and something we want to pursue<br/>\nfurther or not. One thing will lead to another and life goes on and<br/>\nkids learn and parents learn and life is full of opportunity everywhere<br/>\nwe look.<br/>\n<br/>\nIt is natural for people to learn—each in their own way. It is natural<br/>\nfor children to want to understand the world around them. They also<br/>\nwant to join the adult world and become competent and capable adults<br/>\nthemselves. They&#39;ll strive for this in their own natural ways.<br/>\nUnschooling parents work on creating a home environment that supports<br/>\ntheir children&#39;s natural desire to learn and grow.<br/>\n<br/>\nEach child is unique and experiences the world in a different way than<br/>\nany other person and expresses themselves in ways that are different<br/>\nfrom every other person. There is no curriculum in the world that is<br/>\ndesigned specifically and dynamically for any particular child, but an<br/>\nunschooling lifestyle can, in effect, provide a 100 percent<br/>\nindividualized learning experience. Unschoolers aren&#39;t likely to learn<br/>\nexactly what the professional educators and textbook publishers think<br/>\nthey should—so, in that sense, they will have gaps in their learning.<br/>\nBut they&#39;ll learn so much more, too, that is not included in those<br/>\nlists of &quot;learning standards.&quot; What is important for one person to<br/>\nlearn is not necessarily important for another and we don&#39;t really have<br/>\nany way of predicting what will be important to know in the future. We<br/>\nDO know that learning that is forced or pressured is not lasting and<br/>\nthat most of what kids are &quot;taught&quot; is not truly &quot;learned&quot; in any kind<br/>\nof lasting way unless it is something in which they are interested.<br/>\n<br/>\nUnschoolers also have in mind a lifelong timeline for learning. We<br/>\ndon&#39;t worry about whether a child is &quot;at grade level&quot; because we know<br/>\nthat children are learning &quot;something&quot; all the time and that they will<br/>\neventually learn whatever they need to know for whatever reasons they<br/>\nhave. We don&#39;t worry that they&#39;ll miss something important because, if<br/>\nit is important, they&#39;ll realize that and find a way to learn it.<br/>\n<br/>\nA true unschooling slogan is, &quot;Life is learning, learning is life.&quot;<br/>\nUnschoolers simply do not think there are times for learning and times<br/>\nfor not learning. They don&#39;t divide life into school time or lesson<br/>\ntime versus play time or recreation time. There is no such thing as<br/>\n&quot;extracurricular&quot; to an unschooler—all of life, every minute of every<br/>\nday, counts as learning time and there is no separate time set aside<br/>\nfor education.<br/>\n<br/>\nIs unschooling right for everyone? My answer is, &quot;It depends.&quot; I think<br/>\nALL children can learn and grow and thrive as unschoolers. But, I also<br/>\nthink it takes an intensity and focus on living life with a great deal<br/>\nof gusto on the part of unschooling parents. Unschooling parents work<br/>\nhard. For example, they must develop a very high level of sensitivity<br/>\nto their children to know what to offer, when to support, when to back<br/>\noff, how busy they want to be, how much solitude they need, when to<br/>\nnudge them a bit with encouragement, when to get more involved, and so<br/>\non. AND parents need to be able to always have their kids and their<br/>\ninterests in the back of their minds, thinking always about what would<br/>\ninterest them; bringing the world to them and bringing them to the<br/>\nworld in ways that &quot;click&quot; for that particular child. And it takes a<br/>\ngreat deal of trust that the child will learn without external<br/>\npressure.<br/>\n<br/>\nWe could do the curriculum—I could put together a few hours per day of<br/>\n&quot;school work,&quot; insisting that my children do it. But I&#39;ve read<br/>\neverything I could get my hands on about learning and I&#39;ve had 30 years<br/>\nof teaching experience and I know, deep down inside, that any coercion<br/>\nin learning creates either open resistance, passivity, or apathy, and I<br/>\ndon&#39;t want to create any of those in my children. Learning feels<br/>\ngood—it might be hard, but it is also pleasurable. Coercion feels bad<br/>\nand trying to learn under coercion is not pleasurable, even when we<br/>\nmake the best of it. Children who have only experienced the pleasure of<br/>\nunforced learning show the effect in their incredible creativity,<br/>\nconfidence, intensity, focus, persistence, self-knowledge, and strong<br/>\nsense of personal responsibility.<br/>\n<br/>\nNot all parents WANT their children to grow up strong-willed and truly<br/>\nindependent-minded. And, it is fair warning to say: &quot;Be careful what<br/>\nyou wish for.&quot; If what we mostly want is for our children to respect us<br/>\nand to adopt our beliefs and goals, unschooling may not be for us. Many<br/>\nparents have a general definition of &quot;success&quot; in their own heads, and<br/>\nwhat they want is for their children to achieve their version of<br/>\nsuccess. Many want their children to offer living proof that they were<br/>\ngood parents—they may even be especially interested in outcomes that<br/>\nwill impress friends, relatives, and acquaintances. Again, unschooling<br/>\nis probably not a good fit under those circumstances.<br/>\n<br/>\nUnschoolers do have goals, though, that impact our day-to-day<br/>\ninteractions with our kids. We want our children to discover<br/>\ntheirlife&#39;s passions and to jump into them with both feet, with<br/>\nconfidence and trust in life and themselves. We want our children to<br/>\nknow, deep inside themselves, that they are strong and capable and can<br/>\nmake their own individual choices. We want them to be willing to buck<br/>\nthe mainstream culture AND buck the counterculture and think for<br/>\nthemselves and do what they think is right and good and worthy and<br/>\nvaluable.<br/>\n<br/>\nI think, most of all, we want them to love being alive—now and in their<br/>\nfuture.<br/>\n<br/>\n ~Pam Sorooshian   April 2005<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\nOctober 6-9, 2005<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a></div>","specialLinks":[]}],"prevTopicId":5401,"nextTopicId":5406}}