{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":274176358,"authorName":"One of the Wechts","from":"&quot;One of the Wechts&quot; &lt;erw@...&gt;","profile":"usoah1841","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] TV and focus","postDate":"1192116483","msgId":27020,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjEwMWM4MGMxYiQ1MWExZmQwMCQ2MTFiOWIwNEBNVVNJQ1JPT00+","referencesHeader":"PDAwNDcwMWM4MGMxOCQwOTg4ODczMCRiZjQyOWIwNEBNVVNJQ1JPT00+"},"prevInTopic":27018,"nextInTopic":0,"prevInTime":27019,"nextInTime":27021,"topicId":27018,"numMessagesInTopic":0,"msgSnippet":"oops wrong list ; ) Beth","messageBody":"<div id=\"ygrps-yiv-108363450\">oops wrong list ; )<br/>\nBeth</div>","specialLinks":[]},{"userId":274176358,"authorName":"One of the Wechts","from":"&quot;One of the Wechts&quot; &lt;erw@...&gt;","profile":"usoah1841","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"TV and focus","postDate":"1192115073","msgId":27018,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDcwMWM4MGMxOCQwOTg4ODczMCRiZjQyOWIwNEBNVVNJQ1JPT00+"},"prevInTopic":0,"nextInTopic":27020,"prevInTime":27017,"nextInTime":27019,"topicId":27018,"numMessagesInTopic":0,"msgSnippet":"This was written 3/06 and posted to Unschooling discussion list. I thought I might share some unschooling TV thoughts again while we are revisiting the evils","messageBody":"<div id=\"ygrps-yiv-987113961\">This was written 3/06 and posted to Unschooling discussion list.<br/>\nI thought I might share some unschooling TV thoughts again while we are revisiting the &quot;evils&quot; of TV....<br/>\n<br/>\nThe inspiration for this email was...<br/>\n Nurturing Your Child&#39;s Ability to Focus by Naomi Aldort - Families may be teaching children to have a short attention span  by example and by their choice of  toys and activities<br/>\n<br/>\nForgive me as I am summarizing from my memory.<br/>\nThe assumption was that watching fast changing screens alter the developing mind and creates an unnatural need for more and more fast changing scenes and therefore to a lack of focus.<br/>\nI know I have read this theory in other places as well.<br/>\n<br/>\n**********************************************************************************<br/>\n<br/>\nOk.  This is really bugging me.  It is from the article in the latest Life Learning Magazine.<br/>\n&quot;Nurturing Your Child&#39;s Ability to Focus&quot; by Naomi Aldort.<br/>\n<br/>\nTV is listed as one of the &quot;common robbers of children&#39;s innate ability to focus...&quot;  <br/>\n<br/>\nI must present 3 cases to the contrary...<br/>\n<br/>\nMy 17 yos watched a lot of TV/videos as a child. He probably had some restrictions, by default, because he was in school till he was 12.  I actually have a video of him playing with toys, and the TV is on in the &quot;background. &quot; So much for the &quot;passive state&quot;.  This child could focus on anything for hours, like trains, cars, dinosaurs, puzzles, drawing etc.  He still can as a teen.  Sometimes he is playing PC games (which I suspect would not count because of those fast moving pictures).    Sometimes he is creating maps or characters or a storyline or histories for his D & D world. Other times he is painting Warhammer. Sometimes, he has been know to read a series of books for days! <br/>\n<br/>\nMy 13yos is growing up with no limits on TV/screen time.  When he was little, he watched his share of Thomas the Tank Engine and Disney videos.  We even had cable then, with cartoon network and all the regular stuff including PBS.  Now as a teen, he focuses in front of a computer screen for hours, editing his movies. (Maybe that does not count either.)  But, making these claymation movies take hours and hours of intense detailed work with clay and light and sets and sound... When he is not engrossed in movie making, he may be found with his brother painting Warhammer, or on his own learning a new song on the piano. (The most recent one is Hungarian Rhapsody.)  Finally, at the end of the day, he is often found listening to French language tapes.<br/>\n<br/>\nI must admit that my 10yod is the toughest case.  She definitely watches more TV than anyone now.  She even watches and plays Gameboy at the same time.  Lack of focus or just multi-talented?  She focuses on a book tape and colors at the same time.  Lack of focus or multi-tasking?  Those maybe &quot;suspect&quot;, but she can also focus on elaborate beanie baby games for hours.  Other times, she can be found focusing intently on the tasks of drawing creatures and designing dungeons for her next turn as a DM.  And one of her nighttime favorites is pouring over an I Spy book for what seems like hours (cause those things give me a head ache).<br/>\n<br/>\nNo matter how flashy or how quickly the picture changes in a TV show, if it is boring, my kids turn it off or tune it out. They always have.<br/>\n<br/>\nLack of focus equals lack of interest at my house. Period.  Not TV trauma!<br/>\n<br/>\nBeth in MD<br/>\n( Getting ready to watch a fast-paced rapidly-changing movie my son and his friend made. So there ! )<br/>\n<br/>\n************************************************************************************<br/>\n<br/>\nI should also add for good measure another little data blip. This is for those of you familiar with the *watching 2-D things/reading books too young/dark/close etc causes poor vision* arguments.<br/>\nThe only child in our house who needs glasses, had the least screen time of all 3. <br/>\n<br/>\nI have sooo much more to debunk regarding food, sleep, college etc<br/>\nI feel like starting my own version of Mythbusters!<br/>\n<br/>\nBeth in MD<br/>\nMom to 12yod/15yos/19yos<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":26848,"nextTopicId":27022}}