{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":22,"messages":[{"userId":195592821,"authorName":"Robert Saxon","from":"&quot;Robert Saxon&quot; &lt;TheSaxons@...&gt;","profile":"rob_saxon_2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] sleep schedules","postDate":"1206657731","msgId":31338,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1MzUwYTJjMDgwMzI3MTU0Mm0zYTkwNmViZWdkMTcxMTAxMmQwYzM4MmRhQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDliY2E5ZTMwODAzMjcxMTIzeDRhODc0MjM1bDZmNjUzMDFiYjY0NDJlNjRAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PDE2NTAwNi4zNzkwNC5xbUB3ZWI1NDEwNS5tYWlsLnJlMi55YWhvby5jb20+CSA8OWJjYTllMzA4MDMyNzExMjN4NGE4NzQyMzVsNmY2NTMwMWJiNjQ0MmU2NEBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":31335,"nextInTopic":0,"prevInTime":31337,"nextInTime":31339,"topicId":31293,"numMessagesInTopic":0,"msgSnippet":"Short and sweet.  Ask for these studies (previously suggested).  We all know that it is common knowledge to put kids to bed early.  But raising kids takes","messageBody":"<div id=\"ygrps-yiv-1788207089\">Short and sweet.  Ask for these studies (previously suggested).  We all know<br/>\nthat it is &quot;common knowledge&quot; to put kids to bed early.  But raising kids<br/>\ntakes uncommon courage to rise above the sheeple and get at the truth of<br/>\nthings.   Science by committee is superstition and rumor.<br/>\n<br/>\nAsk them respectfully if there is something else that is bothering them.<br/>\nAre the kids loud?  Do they begin acting disrespectfully when they are<br/>\ntired?  The whole &quot;kids should go to bed early&quot; could be a cover for<br/>\nsomething else.  Perhaps they are upset that they were made to go to bed<br/>\nearly as kids and resent that you are letting yours stay up.  Who knows?<br/>\nBut there may be more going on beneath the surface than just &quot;familial<br/>\nconcern.&quot;<br/>\n<br/>\nJust my 2 cents&#39; worth.<br/>\n<br/>\n--Rob Saxon<br/>\n&quot;Daddy!&quot; to Elissa (almost 5!) and Genevieve (6)<br/>\nDH to Seana for 11 years<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":333194003,"authorName":"Kim Musolff","from":"&quot;Kim Musolff&quot; &lt;kmoose75@...&gt;","profile":"little_minds_preschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [unschoolingbasics] sleep schedules","postDate":"1206642194","msgId":31335,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDliY2E5ZTMwODAzMjcxMTIzeDRhODc0MjM1bDZmNjUzMDFiYjY0NDJlNjRAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDE2NTAwNi4zNzkwNC5xbUB3ZWI1NDEwNS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDE2NTAwNi4zNzkwNC5xbUB3ZWI1NDEwNS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":31330,"nextInTopic":31338,"prevInTime":31334,"nextInTime":31336,"topicId":31293,"numMessagesInTopic":0,"msgSnippet":"I found that as long as a rhythm was established, the hours didn t matter so much. Only when my shift work switched to weirdness, did it effect me negatively.","messageBody":"<div id=\"ygrps-yiv-1412961107\">I found that as long as a rhythm was established, the hours didn&#39;t matter so<br/>\nmuch. Only when my shift work switched to weirdness, did it effect me<br/>\nnegatively. (Shifts being 2 midnights then 2 afternoons with an eight hour<br/>\nbreak then an 8-4 dayshift.) The body has no set sleep time and THAT really<br/>\nmesses you up.<br/>\n<br/>\n<br/>\nI find this to be very true!  It seems like when I (or my children) have a<br/>\nregular sleep pattern we are fine!  But when we have to get up early<br/>\nsometimes and are allowed to sleep in sometimes--that is what messes us up!<br/>\nWhen we had my son in kindergarten, it was only 2 days a week. On those<br/>\ndays, we all had to get up early and on all the other days we were allowed<br/>\nto keep our natural sleep schedules (stay up late/sleep in late).  This<br/>\nreally screwed us up!<br/>\nKim<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":227598072,"authorName":"Queana","from":"Queana &lt;queana@...&gt;","profile":"queanabruedal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What should I have done?","postDate":"1206632210","msgId":31330,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM0MTEwRDIyLjcyOUUlcXVlYW5hQGdtYWlsLmNvbT4=","inReplyToHeader":"PDZENEE2NTVDLTUyOEYtNEMyNy1BMzBDLThFQzE0RjIwMTYyREBtYWMuY29tPg=="},"prevInTopic":31328,"nextInTopic":31335,"prevInTime":31329,"nextInTime":31331,"topicId":31293,"numMessagesInTopic":0,"msgSnippet":"... Thanks for this.  And even though I know it s about the principle and not the specific person, I feel like mentioning that I am at every scout activity and","messageBody":"<div id=\"ygrps-yiv-2113764526\">On 3/26/08 11:28 PM, &quot;Pamela Sorooshian&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt;&gt;&gt;&gt; He mentioned a couple times over the next couple hours that he<br/>\n&gt;&gt;&gt;&gt; didnt want to go, and I still said, basically, tough, that he was<br/>\n&gt;&gt;&gt;&gt; in charge<br/>\n&gt;&gt;&gt;&gt; so he couldnt ditch, that it affects the group too much when<br/>\n&gt;&gt;&gt;&gt; someone is<br/>\n&gt;&gt;&gt;&gt; missing, blah blah blah.<br/>\n&gt; <br/>\n&gt; Oh my gosh - the poor kid. You have no real idea why he was so adamant<br/>\n&gt; and so emotional about it?<br/>\n&gt; <br/>\n&gt; ASSUME he has good reasons.<br/>\n&gt; <br/>\n&gt; Holy cow - maybe the scout master is molesting him or some kid is<br/>\n&gt; bullying him or something awful like that. I mean - probably it isn&#39;t<br/>\n&gt; one of those things, but WHATEVER it is, it is truly a dangerous thing<br/>\n&gt; to force a kid to go to an activity that they are emotional about not<br/>\n&gt; wanting to go to.<br/>\n&gt; <br/>\n&gt; Even if the only reason is that he doesn&#39;t feel like it - then that<br/>\n&gt; activity is obviously not feeling valuable to him. Help him. Maybe the<br/>\n&gt; time he&#39;s spending on that could be spent on something more valuable<br/>\n&gt; to him. Help him decide if it is worth it to even stay involved at all.<br/>\n&gt; <br/>\n&gt; Try to think from his point of view and remember that he has good<br/>\n&gt; reasons!<br/>\n&gt; <br/>\n&gt; Be on his team - you aren&#39;t his adversary. Help him get what he wants.<br/>\n&gt; <br/>\n&gt; -pam<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Thanks for this.  And even though I know it&#39;s about the principle and not<br/>\nthe specific person, I feel like mentioning that I am at every scout<br/>\nactivity and meeting, so there is definitely not something terrible going on<br/>\nwith the leader or other adults.  He is the one kid there that all the boys<br/>\nlike (the other 4 fight amongst themselves a bit).  I will talk to him more<br/>\nabout it today and ask him what was going on.  It may have just been that he<br/>\nwas away from his computer all day and he wanted to be on it.<br/>\n<br/>\nTo continue the story, yesterday once again the 8 y.o was at science camp,<br/>\nwhich he loves, and the 13 y.o. and I hung out at Grandpas house, because it<br/>\nis halfway to the science camp from our house.  My 17 y.o., whom I haven&#39;t<br/>\nmentioned yet because he&#39;s in school (by choice), stays at grandpas for a<br/>\nfew days during his Spring Break, so he was already there.  When it was time<br/>\nto pick up 8 y.o., he of course wanted to go hang out at grandpas too, since<br/>\neveryone else was while he was in camp, so we went back to grandpas.<br/>\n<br/>\nWe hung out there for a couple more hours, and then I really needed to get<br/>\nhome because there were some work things I just could not do at grandpas (I<br/>\nwork from home).  So we left.  8 y.o. was upset about leaving, but when we<br/>\nwere still actually there he asked if he could stay there and I could come<br/>\nback and pick him up before taekwondo.  I said no, I had work to do, and had<br/>\ndriven too much today already (grandpa lives about 20 minutes away).  I told<br/>\nhim he could spend the night at grandpas tomorrow and that seemed to work<br/>\nfor him.  So we left.<br/>\n<br/>\nWhen we got home he mentioned a few times that he wanted to go to grandpas.<br/>\n13 y.o. started mentioning that his ankle hurt, and I started thinking again<br/>\nabout taekwondo and whether they really want to be in it or not.  I told 8<br/>\ny.o. He could call his dad and see if he would take him back to grandpas<br/>\nwhen he got home from work.  It&#39;s my husband&#39;s dad, and he usually doesn&#39;t<br/>\nneed a reason to go over there, particularly at dinner time (dh is the one<br/>\nthat cooks dinner around here).  Grandpa said it was ok, dad said he would<br/>\ntake him in about a half hour.  He started asking 13 y.o. If he wanted to go<br/>\nback to grandpas, and said, &quot;you won&#39;t have to go to taekwondo&quot;.<br/>\n<br/>\nI asked them at that point (in a light voice, not negatively), &quot;Why do you<br/>\nguys stay in taekwondo if you never want to go?&quot;  13 y.o. said he doesn&#39;t<br/>\nlike going when his back hurts (his back has been hurting, but his teacher<br/>\ndoesn&#39;t have him do anything strenuous when his back hurts).  8 y.o. said he<br/>\nwould go probably every other time if he had a choice.  So I said, ok, you<br/>\nguys never *have* to go to taekwondo.  It&#39;s up to you.  They seemed<br/>\nsurprised.  Neither went last night of course (8 y.o. Went to grandpas, 13<br/>\ny.o. chose to stay home with his computer (and me, though I was working)<br/>\nwhich is much faster than grandpas).<br/>\n<br/>\n8 y.o. made an interesting comment then.  He said that he doesn&#39;t like not<br/>\ndoing the things he should, like schoolwork and taekwondo.  He said that was<br/>\nweird for him, and he didn&#39;t like it.  So... Obviously it may take awhile<br/>\nfor them to see that it&#39;s not like they are skipping out on things they<br/>\n*should* be doing.<br/>\n<br/>\nAnyway, thanks to everyone for your responses.  We&#39;ll see what happens with<br/>\ntaekwondo I guess.<br/>\n<br/>\nSarah</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa Gray","from":"Melissa Gray &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: What should I have done?","postDate":"1206631191","msgId":31328,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2NkMwMDAwLUQ5RjYtNDY2RS04MkYyLUMwMTNBQTNCREM2NEBjb3gubmV0Pg==","inReplyToHeader":"PDY3YTlkNzUwMDgwMzI3MDYxNGtiZDE1Y2VlbmI4NjU1NzQ3OTMzMmU2MGNAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PEM0MEZFNEJELjcxOEMlcXVlYW5hQGdtYWlsLmNvbT4gPGZzZzVvZStiYzEzQGVHcm91cHMuY29tPiA8NjdhOWQ3NTAwODAzMjcwNjE0a2JkMTVjZWVuYjg2NTU3NDc5MzMyZTYwY0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":31326,"nextInTopic":31330,"prevInTime":31327,"nextInTime":31329,"topicId":31293,"numMessagesInTopic":0,"msgSnippet":"As a leader in boy scouts, I think I might have a different perspective of the boys planning all of the meetings.  I assume that at thirteen, your son is","messageBody":"<div id=\"ygrps-yiv-1971711221\">As a leader in boy scouts, I think I might have a different  <br/>\nperspective of the boys planning &#39;all&#39; of the meetings.  I assume  <br/>\nthat at thirteen, your son is second class? My son is thirteen and  <br/>\njust passed review to first class, so it depends I guess.<br/>\n<br/>\nOnce they are in boy scouts, as opposed to cub scouts, it is expected  <br/>\nthat the boys take on the responsibility of  the meetings. Having  <br/>\nsaid that, it is the role of the leaders to guide and mentor them,  <br/>\nand it should be explained to the boys that they need to ask for help  <br/>\nif they need it. All expectations should be developmentally  <br/>\nappropriate, and younger boy scouts (ages 11 to 13) might need more  <br/>\nhelp than older scouts (14 to 17), but all ages are in patrols  <br/>\ntogether, and it&#39;s possible that the delineation isn&#39;t occurring as  <br/>\nit should between those age groups. And it should have been explained  <br/>\nto parents that they are advocates for the boys.<br/>\n<br/>\nThe meetings aren&#39;t supposed to be perfect, but it&#39;s the trying  <br/>\nthat&#39;s important, as a learning exercise. There is no &#39;inept&#39;, they  <br/>\nare just boys who are learning and sharing who they are and what&#39;s  <br/>\nimportant to them.  That&#39;s part of scouting. In fact, the boys have  <br/>\nrequirements of learning subjects and &#39;teaching&#39; each other to  <br/>\nadvance in the ranks. The older boys are supposed to help the younger  <br/>\nones as well, so I agree that it sounds like the leadership in this  <br/>\nparticular patrol isn&#39;t taking into account different maturity  <br/>\nlevels, and that the brotherhood isn&#39;t necessarily working.<br/>\n<br/>\nNow is ONE boy in charge of the entire meeting? You might talk to the  <br/>\nleader, because in each of our troop patrols, the patrol leader runs  <br/>\nthe meeting, the assistant patrol leader makes announcements, and the  <br/>\nboys take turns running the requirements or explaining what they&#39;ve  <br/>\nlearned. I would just say that I was concerned because it seems like  <br/>\na lot for one boy to handle, and ask about sharing responsibilities.  <br/>\nI think you understand how to handle it differently. If my son isn&#39;t  <br/>\nwanting to go, I&#39;d assume he was overwhelmed and ask if he wanted  <br/>\nhelp to get ready. A few hours is all it takes to flip through the  <br/>\nhandbook, figure out what he needs to advance, and print something  <br/>\nfrom the web to share with the group. And encourage him to talk to  <br/>\nthe leader about how he&#39;s feeling. Ask if he wants you there as well.<br/>\nMelissa<br/>\nMom to Joshua, Breanna, Emily, Rachel, Samuel, Daniel and Avari<br/>\nWife to Zane<br/>\n<br/>\nblog me at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives.blogspot.com/\">http://startlinglives.blogspot.com/</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mar 27, 2008, at 8:14 AM, Karen Swanay wrote:<br/>\n<br/>\n&gt; This is what I was thinking. I&#39;m involved with a lot of different<br/>\n&gt; groups and let&#39;s face it, no matter how much certain people would like<br/>\n&gt; to be able to be a planner, or a leader, they are just terrible at it.<br/>\n&gt; They either lack the ability or the confidence. Perhaps your son is<br/>\n&gt; a follower and not a leader? The kids all planning seems WAY too<br/>\n&gt; mature for their age group. I wouldn&#39;t be involved in this scout<br/>\n&gt; troop. As it so happens I am a planner and a leader, so I wouldn&#39;t<br/>\n&gt; tolerate having to put up with something an inept person planned<br/>\n&gt; especially if that kind of thing kept rolling around. If I&#39;m paying<br/>\n&gt; to learn something, I want to learn it from someone WHO ALREADY KNOWS<br/>\n&gt; IT! Not be taught by someone who is learning at the same time. Maybe<br/>\n&gt; that was too much pressure for your boy? Maybe he doesn&#39;t like the<br/>\n&gt; way the troop is organized.<br/>\n&gt;<br/>\n&gt; .<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"&quot;Karen Swanay&quot; &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: What should I have done?","postDate":"1206623651","msgId":31322,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3YTlkNzUwMDgwMzI3MDYxNGtiZDE1Y2VlbmI4NjU1NzQ3OTMzMmU2MGNAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGZzZzVvZStiYzEzQGVHcm91cHMuY29tPg==","referencesHeader":"PEM0MEZFNEJELjcxOEMlcXVlYW5hQGdtYWlsLmNvbT4gPGZzZzVvZStiYzEzQGVHcm91cHMuY29tPg=="},"prevInTopic":31320,"nextInTopic":31326,"prevInTime":31321,"nextInTime":31323,"topicId":31293,"numMessagesInTopic":0,"msgSnippet":"This is what I was thinking.  I m involved with a lot of different groups and let s face it, no matter how much certain people would like to be able to be a","messageBody":"<div id=\"ygrps-yiv-533135488\">This is what I was thinking.  I&#39;m involved with a lot of different<br/>\ngroups and let&#39;s face it, no matter how much certain people would like<br/>\nto be able to be a planner, or a leader, they are just terrible at it.<br/>\n They either lack the ability or the confidence.  Perhaps your son is<br/>\na follower and not a leader?  The kids all planning seems WAY too<br/>\nmature for their age group.  I wouldn&#39;t be involved in this scout<br/>\ntroop.  As it so happens I am a planner and a leader, so I wouldn&#39;t<br/>\ntolerate having to put up with something an inept person planned<br/>\nespecially if that kind of thing kept rolling around.  If I&#39;m paying<br/>\nto learn something, I want to learn it from someone WHO ALREADY KNOWS<br/>\nIT!  Not be taught by someone who is learning at the same time.  Maybe<br/>\nthat was too much pressure for your boy?  Maybe he doesn&#39;t like the<br/>\nway the troop is organized.<br/>\n<br/>\nBut I wouldn&#39;t have lied for him.  (Actually, I&#39;d have long before<br/>\nthis bitched at whichever adult was shirking their responsibility and<br/>\nmaking the kids do this stuff.)  Saying he felt &quot;unwell&quot; says to<br/>\neveryone &quot;physically ill&quot; and so you in essence lied.  And you trapped<br/>\nhim in that lie now too.  My kids (11 and 9) will sometimes do this<br/>\nkind of thing, actually both things.  The 11 yr old will abruptly<br/>\ndecide he&#39;s not doing something.  And the 9 yr old is a master at not<br/>\ntalking when he&#39;s emotionally conflicted.  In both cases, I deal with<br/>\nthe kids as they have told me was the way they want it handled.  (We<br/>\ntalked about both of these behaviors during a happy and emotionally<br/>\nnormal time.)  Your boy is 13.  Perhaps you should ask him how he<br/>\nwants you to handle things like this when they come up.<br/>\n<br/>\nAlso, one more thing...do not forget your son is likely marinating in<br/>\nhis own hormones.  Just because he doesn&#39;t bleed once a month doesn&#39;t<br/>\nmean that it&#39;s any less a confusing and upsetting time for him.  I<br/>\nfind these years are harder than the baby years.  Just something to<br/>\nthink about.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Mar 27, 2008 at 7:59 AM, keetry &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:keetry@...\">keetry@...</a>&gt; wrote:<br/>\n<br/>\n&gt; Do you think it really was that he just wasn&#39;t in the mood? Could he<br/>\n&gt; have been intimidated by the idea of having to plan something for the<br/>\n&gt; group? I would be so nervous about having to do something like that<br/>\n&gt; that I would not want to go, either.<br/>\n&gt;<br/>\n&gt; Alysia<br/>\n-- <br/>\nKaren<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://temptabo.blogspot.com/\">http://temptabo.blogspot.com/</a> </span></blockquote></div>","specialLinks":[]},{"userId":332901363,"authorName":"keetry","from":"&quot;keetry&quot; &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What should I have done?","postDate":"1206622798","msgId":31320,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZzZzVvZStiYzEzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEM0MEZFNEJELjcxOEMlcXVlYW5hQGdtYWlsLmNvbT4="},"prevInTopic":31317,"nextInTopic":31322,"prevInTime":31319,"nextInTime":31321,"topicId":31293,"numMessagesInTopic":0,"msgSnippet":"... want to ... Do you think it really was that he just wasn t in the mood? Could he have been intimidated by the idea of having to plan something for the ","messageBody":"<div id=\"ygrps-yiv-1154999532\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Queana &lt;queana@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;I should have<br/>\n&gt; listened to him from the get go; it¹s not like he frequently doesn¹t <br/>\n </span></blockquote>want to<br/>\n<blockquote><span title=\"ireply\"> &gt; go.  He just wasn¹t in the mood I guess.  <br/>\n&gt; Sarah<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Do you think it really was that he just wasn&#39;t in the mood? Could he <br/>\nhave been intimidated by the idea of having to plan something for the <br/>\ngroup? I would be so nervous about having to do something like that <br/>\nthat I would not want to go, either.<br/>\n<br/>\nAlysia</div>","specialLinks":[]},{"userId":296692554,"authorName":"j md","from":"j md &lt;lunawillowmoon@...&gt;","profile":"lunawillowmoon","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] sleep schedules","postDate":"1206614648","msgId":31326,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU1OTIxMS42MTUxOC5xbUB3ZWI2MjEwOS5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":31322,"nextInTopic":31328,"prevInTime":31325,"nextInTime":31327,"topicId":31293,"numMessagesInTopic":0,"msgSnippet":"Hi Mirika, Being new to the group I was not sure wether or not to respond to what you have written.We are only just looking into unschooling our children.Its","messageBody":"<div id=\"ygrps-yiv-1990529014\">Hi Mirika,<br/>\nBeing new to the group I was not sure wether or not to respond to what you have written.We are only just looking into unschooling our children.Its something i wish we had done all their lives but we listened to too many people in our lives over the years.Hopefully its a case of never too late to start:)My own sleep story might be of some comfort.When my now 8 yr old was little she stopped sleeping after being one of the best sleepers around.She was about 2 1/2 then and everyone we knew put their say in.Eventually we took her to the doctor who put her on sleeping tablets and later diagnoised her ADHD.(we now have her off the ritalin but are working on the sleep tablet).My second daughter never had a problem sleeping.Our 3rd was the same as the first.....so what did we do when she decided that she would sleep when she wanted...usually 2 am without a nap in the day?We just let her.....no forceing, if she didnt want to sleep that was just fine...she would<br/>\n when she was ready....the result....she now at 3 1/2 goes to bed at about 10 pm and will put herself to sleep if tired during the day.I wish we had had the convictions then that we have now.But you learn as you go!I dont know about what the studies say and i dont think i will read them...children will sleep when they are tired and i think its more harmful to make them go to sleep when they are not ready then it is to let them sleep when they are ready....even if that means its a different time each night!<br/>\nLuna<br/>\n<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: Barbara Perez &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barbara.perez@...\">barbara.perez@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Thursday, 27 March, 2008 3:22:48 AM<br/>\nSubject: Re: [unschoolingbasics] sleep schedules<br/>\n<br/>\nIF you have the right relationship with them, I&#39;d simply say: &quot;Yes, I<br/>\nremember you mentioning that before. You know, there are &#39;studies&#39; to<br/>\nsupport just about every parenting practice under the sun, depends who you<br/>\nask. Can we agree to disagree?&quot; I think this would work with *my* family,<br/>\nespecially if you say it with a smile and matter-of-factly implying that<br/>\ntheir opinion is valid to THEM but that you have the final decision on your<br/>\nchildren (without putting this in so many words as to not affect their<br/>\nsensitibilities, lol).<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Mar 26, 2008 at 9:01 AM, Mirika Sumers &lt;mirika@bellsouth. net&gt; wrote:<br/>\n<br/>\n&gt; My husband, DS4, and DD3 and I live with other family members. Every<br/>\n&gt; time our kids decide to stay up late these family members feel the need<br/>\n&gt; to tell us about studies that show children do better on a schedule<br/>\n&gt; especially if they go to bed by a certain time. They tell us that<br/>\n&gt; studies have shown children who stay up late have emotional and<br/>\n&gt; developmental problems down the line. We&#39;re trying to be respectful<br/>\n&gt; parents but we&#39;re not sure what to say to this. Does anyone have any<br/>\n&gt; ideas? I can&#39;t find anything on it but I don&#39;t get how it matters if<br/>\n&gt; the kids are getting enough sleep which they do since they sleep in the<br/>\n&gt; following mornings.<br/>\n&gt;<br/>\n&gt; Thanks,<br/>\n&gt; Mirika<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n      Get the name you always wanted with the new y7mail email address.<br/>\nwww.yahoo7.com.au/y7mail<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What should I have done?","postDate":"1206607441","msgId":31317,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDREOUMzMjVGLTg0QTEtNEEyRS1CQjcyLTM0MzVDNUQ2ODVEOEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEM0MTAxRDI1LjcxRTklcXVlYW5hQGdtYWlsLmNvbT4=","referencesHeader":"PEM0MTAxRDI1LjcxRTklcXVlYW5hQGdtYWlsLmNvbT4="},"prevInTopic":31316,"nextInTopic":31320,"prevInTime":31316,"nextInTime":31318,"topicId":31293,"numMessagesInTopic":0,"msgSnippet":"... Have you asked him -- during a quiet time when he s not emotional -- what he d like you to do when he s emotional? Does he want you to keep asking? Let him","messageBody":"<div id=\"ygrps-yiv-1089740937\">On Mar 26, 2008, at 6:32 PM, Queana wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He&#39;ll just clam up and not<br/>\n&gt; speak.  I can ask yes or no questions that he&#39;ll respond to by  <br/>\n&gt; nodding or<br/>\n&gt; shaking his head, but sometimes I run out of questions before I  <br/>\n&gt; figure it<br/>\n&gt; out.<br/>\n<br/>\n </span></blockquote>Have you asked him -- during a quiet time when he&#39;s not emotional --  <br/>\nwhat he&#39;d like you to do when he&#39;s emotional?<br/>\n<br/>\nDoes he want you to keep asking?<br/>\n<br/>\nLet him know that you want to help but if your way of helping isn&#39;t  <br/>\nwhat he wants then you&#39;ll back off and let him handle it. (Or  <br/>\nwhatever he suggests.) Bring it up again after you&#39;ve been doing  <br/>\nsomething different for a while to check how it&#39;s working and see if  <br/>\nhe has any new ideas.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Are you saying that not calling for him would have<br/>\n&gt; humiliated him?<br/>\n<br/>\n </span></blockquote>Not calling. Or making him call.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What should I have done?","postDate":"1206599338","msgId":31316,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZENEE2NTVDLTUyOEYtNEMyNy1BMzBDLThFQzE0RjIwMTYyREBtYWMuY29tPg==","inReplyToHeader":"PEM0MTAxRDI1LjcxRTklcXVlYW5hQGdtYWlsLmNvbT4=","referencesHeader":"PEM0MTAxRDI1LjcxRTklcXVlYW5hQGdtYWlsLmNvbT4="},"prevInTopic":31309,"nextInTopic":31317,"prevInTime":31315,"nextInTime":31317,"topicId":31293,"numMessagesInTopic":0,"msgSnippet":"... Oh my gosh - the poor kid. You have no real idea why he was so adamant and so emotional about it? ASSUME he has good reasons. Holy cow - maybe the scout","messageBody":"<div id=\"ygrps-yiv-124416393\"><blockquote><span title=\"ireply\">&gt; &gt;&gt; He mentioned a couple times over the next couple hours that he<br/>\n&gt; &gt;&gt; didn�t want to go, and I still said, basically, tough, that he was<br/>\n&gt; &gt;&gt; in charge<br/>\n&gt; &gt;&gt; so he couldn�t ditch, that it affects the group too much when<br/>\n&gt; &gt;&gt; someone is<br/>\n&gt; &gt;&gt; missing, blah blah blah.<br/>\n<br/>\n </span></blockquote>Oh my gosh - the poor kid. You have no real idea why he was so adamant  <br/>\nand so emotional about it?<br/>\n<br/>\nASSUME he has good reasons.<br/>\n<br/>\nHoly cow - maybe the scout master is molesting him or some kid is  <br/>\nbullying him or something awful like that. I mean - probably it isn&#39;t  <br/>\none of those things, but WHATEVER it is, it is truly a dangerous thing  <br/>\nto force a kid to go to an activity that they are emotional about not  <br/>\nwanting to go to.<br/>\n<br/>\nEven if the only reason is that he doesn&#39;t feel like it - then that  <br/>\nactivity is obviously not feeling valuable to him. Help him. Maybe the  <br/>\ntime he&#39;s spending on that could be spent on something more valuable  <br/>\nto him. Help him decide if it is worth it to even stay involved at all.<br/>\n<br/>\nTry to think from his point of view and remember that he has good  <br/>\nreasons!<br/>\n<br/>\nBe on his team - you aren&#39;t his adversary. Help him get what he wants.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":227598072,"authorName":"Queana","from":"Queana &lt;queana@...&gt;","profile":"queanabruedal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: What should I have done?","postDate":"1206570884","msgId":31309,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM0MTAxRDk0LjcxRUQlcXVlYW5hQGdtYWlsLmNvbT4=","inReplyToHeader":"PGZzZTZtcitoMHQxQGVHcm91cHMuY29tPg=="},"prevInTopic":31308,"nextInTopic":31316,"prevInTime":31308,"nextInTime":31310,"topicId":31293,"numMessagesInTopic":0,"msgSnippet":"Thanks, Wilda!  I know that I am relatively very respectful.  However, I have a ways to go yet! Sarah ... [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1986168710\">Thanks, Wilda!  I know that I am relatively very respectful.  However, I<br/>\nhave a ways to go yet!<br/>\n<br/>\nSarah<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 3/26/08 12:03 PM, &quot;freasabird2003&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:freasabird2003@...\">freasabird2003@...</a>&gt; wrote:<br/>\n<br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Hi Sarah,<br/>\n&gt; <br/>\n&gt; To me, you really do sound like a very respectful parent and I am not<br/>\n&gt; sure that I would have done anything differently....other than perhaps<br/>\n&gt; insisting that he make the phone call himself. But it sounds like you<br/>\n&gt; did that too, and only made the phone call when it was obvious that he<br/>\n&gt; wasn&#39;t. I suppose if this happens again, you could hold out and let him<br/>\n&gt; make the call or not; eventually he will learn that he is the<br/>\n&gt; responsible party for his actions. I have a 19 year old son who is<br/>\n&gt; STILL figuring this out. :(<br/>\n&gt; <br/>\n&gt; ~Wilda in Savannah, Tennessee<br/>\n&gt; (who is an oldtimer at parenting, but less than a decade of unschooling)<br/>\n&gt; <br/>\n&gt;&gt; &gt; <br/>\n&gt;&gt; &gt; Although I¹ve always considered myself a very respectful parent<br/>\n&gt; compared to<br/>\n&gt;&gt; &gt; just about everyone I know, there are (obviously) areas that I need<br/>\n&gt; to work<br/>\n&gt;&gt; &gt; on.  Advice from oldtimers would be great :)<br/>\n&gt;&gt; &gt; <br/>\n&gt;&gt; &gt; Sarah<br/>\n&gt;&gt; &gt; <br/>\n&gt;&gt; &gt; <br/>\n&gt;&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt;&gt; &gt;<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt;     <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":227598072,"authorName":"Queana","from":"Queana &lt;queana@...&gt;","profile":"queanabruedal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What should I have done?","postDate":"1206570773","msgId":31308,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM0MTAxRDI1LjcxRTklcXVlYW5hQGdtYWlsLmNvbT4=","inReplyToHeader":"PDBDRDc5NDA5LUI4QjQtNDBBRC1CN0JFLUY3ODhENkJCNDk2NkB2ZXJpem9uLm5ldD4="},"prevInTopic":31307,"nextInTopic":31309,"prevInTime":31307,"nextInTime":31309,"topicId":31293,"numMessagesInTopic":0,"msgSnippet":"... Yes, I definitely should have done this.  Although I did try to help with the planning several times, it wasn t with the option of not going at all. I","messageBody":"<div id=\"ygrps-yiv-2076077554\">On 3/26/08 2:34 PM, &quot;Joyce Fetteroll&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; On Mar 26, 2008, at 2:32 PM, Queana wrote:<br/>\n&gt; <br/>\n&gt;&gt;  I reminded him at some<br/>\n&gt;&gt; point that he had scouts that night and needed to plan and he said<br/>\n&gt;&gt; he didn‚t<br/>\n&gt;&gt; want to go.  I said, basically, tough.<br/>\n&gt; <br/>\n&gt; At this point you turned him into the problem.<br/>\n&gt; <br/>\n&gt; To stay focused on the problem of the group needing a plan, you could<br/>\n&gt; say &quot;Others will be disappointed if they show up and there&#39;s no one<br/>\n&gt; there with a plan of things to do. Chaos will ensue. There will be<br/>\n&gt; blood. It won&#39;t be pretty. What can we do?&quot;<br/>\n&gt; <br/>\n&gt; Ask it honestly, knowing he has the option of backing out since he<br/>\n&gt; gave plenty of hours of warning. I assume he&#39;s planned before without<br/>\n&gt; problems? Perhaps there was a problem the last meeting that he&#39;s<br/>\n&gt; feeling embarrassed about.<br/>\n&gt; <br/>\n&gt; You could do the plan yourself and take over for him. Ask him what it<br/>\n&gt; was he was thinking of doing. If he knew he didn&#39;t have to do it, saw<br/>\n&gt; that you were willing to pitch in for him, I bet it&#39;s likely he would<br/>\n&gt; have taken over.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Yes, I definitely should have done this.  Although I did try to help with<br/>\nthe planning several times, it wasn&#39;t with the option of not going at all.<br/>\nI didn&#39;t begin second guessing my initial &#39;tough&#39; reaction until about 10<br/>\nminutes before the meeting when he started crying.  He has planned and run<br/>\nmeetings before, so I don&#39;t think that was the issue.  Like I replied to<br/>\nanother post, it can be hard (sometimes impossible) to get information out<br/>\nof him about things he is emotional about.  He&#39;ll just clam up and not<br/>\nspeak.  I can ask yes or no questions that he&#39;ll respond to by nodding or<br/>\nshaking his head, but sometimes I run out of questions before I figure it<br/>\nout.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; He mentioned a couple times over the next couple hours that he<br/>\n&gt;&gt; didn‚t want to go, and I still said, basically, tough, that he was<br/>\n&gt;&gt; in charge<br/>\n&gt;&gt; so he couldn‚t ditch, that it affects the group too much when<br/>\n&gt;&gt; someone is<br/>\n&gt;&gt; missing, blah blah blah.<br/>\n&gt; <br/>\n&gt; And yet that&#39;s ultimately what happened and I bet the world didn&#39;t<br/>\n&gt; end, even though *you* left the leaders in the lurch with only a few<br/>\n&gt; minutes warning. He had given hours of warning.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Nope, the world didn&#39;t end.  In fact, the meeting didn&#39;t even end up<br/>\nhappening.  So it ended up being a non-issue.  The beforemath, however, was<br/>\nstill an issue.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; But once it got to the point it<br/>\n&gt;&gt; got to, was it stupid for me to call the leader and let him know he<br/>\n&gt;&gt; wasn‚t<br/>\n&gt;&gt; coming?  Should I have left that responsibility to him?  Should I<br/>\n&gt;&gt; have just<br/>\n&gt;&gt; let him flake and not told anyone?<br/>\n&gt; <br/>\n&gt; What would be gained? Do you think pressure and humiliation is a good<br/>\n&gt; teacher? If so, schools would work wonders wouldn&#39;t they?<br/>\n&gt; <br/>\n&gt; If you found yourself trapped in a humiliating situation and you knew<br/>\n&gt; someone could help you but refused to, would it make you stronger?<br/>\n&gt; Would you feel empowered ever after to handle the situation on your<br/>\n&gt; own? Or might you think &quot;She abandoned me when I needed her.&quot;<br/>\n&gt; <br/>\n&gt; Often the lessons we think we&#39;re teaching aren&#39;t the lessons being<br/>\n&gt; learned.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Where did the humiliation come from?  I don&#39;t think there was any<br/>\nhumiliation.  I never yelled at him or insulted him, or told anybody he was<br/>\nrefusing to do the meeting or threatened to punish him or anything that<br/>\nwould cause humiliation.  Are you saying that not calling for him would have<br/>\nhumiliated him?  Sorry, just confused.  If that is what you are saying, yes<br/>\nI agree; that is why I called and said he was not feeling well (which, when<br/>\nsomeone is laying on the floor crying seems to be true).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I guess I‚m afraid if I don‚t make them go they‚ll get used to not<br/>\n&gt;&gt; having to<br/>\n&gt;&gt; go and just quit going.<br/>\n&gt; <br/>\n&gt; By making them do something they aren&#39;t wildly enthusiastic about<br/>\n&gt; you&#39;re preventing them from doing something that they might find even<br/>\n&gt; better.<br/>\n&gt; <br/>\n&gt; In the process they&#39;re getting a bad feeling about Tae Kwon Do. If<br/>\n&gt; they leave with a good feeling about it, the might take it up again<br/>\n&gt; when they&#39;re older. But less likely if they remember participation<br/>\n&gt; laced with coercion.<br/>\n&gt; <br/>\n&gt; Talk to them about it. Be honest. Tell them you need to pay for<br/>\n&gt; lessons even if they don&#39;t show up. (I am assuming, otherwise I&#39;m not<br/>\n&gt; seeing the objection.) And it&#39;s money you could better spend<br/>\n&gt; elsewhere on something they enjoy more. Don&#39;t lace this with guilt.<br/>\n&gt; It&#39;s information to help them make a decision. Then let them decide.<br/>\n&gt; It might take a week or so, but trust them.<br/>\n&gt; <br/>\n&gt; Joyce<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Yes, I guess I need to lay off and *see* if they are wildly enthusiastic<br/>\nabout it still or not.  As swissarmywife (sorry, missed the first name lol)<br/>\npointed out, they may not realize that they really can quit if they want to.<br/>\nShould I actually tell them &quot;if you quit tae kwon do, I won&#39;t make you sign<br/>\nup for another physical activity,&quot; since that is something that I have said<br/>\nin the past?  <br/>\n<br/>\nIt really isn&#39;t about the money.  The classes are fairly inexpensive being<br/>\nthrough the parks and rec and we really tend to have money for the things<br/>\nthey want to do and get.  For me its more about the physical exercise than<br/>\nanything else.  My 13 y.o. bio father (whom he&#39;s never met) apparently has a<br/>\nweight problem when he&#39;s not on drugs, and he (the 13 y.o.) is a bit pudgy<br/>\naround the middle.  I am afraid that he would gain weight if he quit, and I<br/>\nknow overweight teenagers are generally not happy, and generally become<br/>\noverweight adults.  He is generally not physically active, but really jumped<br/>\ninto tae kwon do with gusto, and has been really proud of his progress; he<br/>\nis the senior belt in the whole class.<br/>\n<br/>\n*However*, I think the real issue is that it&#39;s an easy way to make sure they<br/>\nare exercising without having to get creative.  We like to go to the Y all<br/>\ntogether, where they can swim, play basketball or racquetball, and use the<br/>\nskatepark if they want to; but I don&#39;t always get us there when I should.<br/>\nWe like to play tennis at the park together too.  I would have to be more<br/>\nconscious about getting these things in and not rely on the routine I guess.<br/>\n<br/>\nThanks for taking the time to answer :)<br/>\n<br/>\nSarah</div>","specialLinks":[]},{"userId":274177100,"authorName":"Vickisue Gray","from":"Vickisue Gray &lt;vickisue_gray@...&gt;","profile":"viickisan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] sleep schedules","postDate":"1206569597","msgId":31307,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2NTAwNi4zNzkwNC5xbUB3ZWI1NDEwNS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":31306,"nextInTopic":31308,"prevInTime":31306,"nextInTime":31308,"topicId":31293,"numMessagesInTopic":0,"msgSnippet":"... You raise a very good point!  I have worked crazy hours most of my life starting with my parents roller skating rink and it closing at 2am on the weekends","messageBody":"<div id=\"ygrps-yiv-2093593553\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Ask them about jet lag and airline employees who change time zones regularly so don&#39;t go to bed by the clock. Ask them about people who work night shifts. Have them produce the studies. I&#39;d like to read them, and rip them to shreds. <br/>\n<br/>\n </span></blockquote>You raise a very good point!  I have worked crazy hours most of my life starting with my parents&#39; roller skating rink and it closing at 2am on the weekends and us not getting home till 4am.  Then I worked 911, which required staying up all night.  I found that as long as a rhythm was established, the hours didn&#39;t matter so much.  Only when my shift work switched to weirdness, did it effect me negatively. (Shifts being 2 midnights then 2 afternoons with an eight hour break then an 8-4 dayshift.)  The body has no set sleep time and THAT really messes you up.<br/>\n<br/>\nIf children are left to sleep, they will get what they require.  <br/>\n<br/>\nVicki<br/>\n<br/>\n<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n      ____________________________________________________________________________________<br/>\nBe a better friend, newshound, and <br/>\nknow-it-all with Yahoo! Mobile.  Try it now.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ\">http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":227598072,"authorName":"Queana","from":"Queana &lt;queana@...&gt;","profile":"queanabruedal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: What should I have done?","postDate":"1206569360","msgId":31306,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM0MTAxN0EwLjcxREUlcXVlYW5hQGdtYWlsLmNvbT4=","inReplyToHeader":"PGZzZTliaCtsMTg5QGVHcm91cHMuY29tPg=="},"prevInTopic":31304,"nextInTopic":31307,"prevInTime":31305,"nextInTime":31307,"topicId":31293,"numMessagesInTopic":0,"msgSnippet":"... [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-860108793\">On 3/26/08 12:49 PM, &quot;swissarmy_wife&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heatherbean@...\">heatherbean@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n&gt; &lt;mailto:unschoolingbasics%40yahoogroups.com&gt; , Queana &lt;queana@...&gt; wrote:<br/>\n&gt; <br/>\n&gt;&gt; &gt; Finally I ended up calling the leader, said he wasn¹t feeling well and<br/>\n&gt;&gt; &gt; wouldn¹t make it, and that was that.  The rest of the evening was fine.<br/>\n&gt; <br/>\n&gt; I&#39;m not sure if this was the right answer, but I would have planned<br/>\n&gt; the meeting for him (if that was the problem) rather than lie for him.<br/>\n&gt;  That&#39;s definitely not a good thing.<br/>\n&gt; <br/>\n&gt; Yes, I did offer to do that, and even considered going and doing it for him.<br/>\n&gt; I did not want to embarrass him by telling people he just didn¹t want to come<br/>\n&gt; or whatever, and I specifically told him that I *wouldn¹t* lie for him.<br/>\n&gt; Saying that he did not feel well was not a lie; he didn¹t feel well.  Whether<br/>\n&gt; it was emotional or physical doesn¹t change the unwellness.  I¹m not sure if<br/>\n&gt; he thinks I lied.<br/>\n&gt;&gt; <br/>\n&gt;&gt;&gt; &gt; Obviously I screwed up in various ways throughout the day.  I should<br/>\n&gt;&gt; have<br/>\n&gt;&gt;&gt; &gt; listened to him from the get go; it¹s not like he frequently doesn¹t<br/>\n&gt;&gt; want to<br/>\n&gt;&gt;&gt; &gt; go.  He just wasn¹t in the mood I guess.  But once it got to the<br/>\n&gt;&gt; point it<br/>\n&gt;&gt;&gt; &gt; got to, was it stupid for me to call the leader and let him know he<br/>\n&gt;&gt; wasn¹t<br/>\n&gt;&gt;&gt; &gt; coming?  Should I have left that responsibility to him?  Should I<br/>\n&gt;&gt; have just<br/>\n&gt;&gt;&gt; &gt; let him flake and not told anyone?<br/>\n&gt;&gt; <br/>\n&gt;&gt; I&#39;m wondering if you could have tried to find out why he didn&#39;t want<br/>\n&gt;&gt; to go, and helped from there.<br/>\n&gt;&gt; <br/>\n&gt; I wish I could!  He clams up and doesn¹t answer questions, just cries.  When I<br/>\n&gt; asked him about it later, he still didn¹t answer.  I think he just wasn¹t in<br/>\n&gt; the mood.  He has led meetings in the past without any issue.<br/>\n&gt;&gt; <br/>\n&gt;&gt; <br/>\n&gt;&gt;&gt; &gt; On a similar note, the younger two kids (13 and 8) are in taekwondo<br/>\n&gt;&gt; three<br/>\n&gt;&gt;&gt; &gt; nights a week, and have been for about 5 years.  It¹s a big<br/>\n&gt;&gt; commitment and<br/>\n&gt;&gt;&gt; &gt; sometimes one or both of them doesn¹t want to go.<br/>\n&gt;&gt; I pretty much make them<br/>\n&gt;&gt;&gt; &gt; go anyway, sometimes unhappily.  Once they get going, they are fine.<br/>\n&gt;&gt; <br/>\n&gt;&gt; The ends, do not justify the means.  :-)<br/>\n&gt;&gt; <br/>\n&gt; I know!<br/>\n&gt;&gt; <br/>\n&gt;&gt; That<br/>\n&gt;&gt;&gt; &gt; is often the only exercise they get.  Some weeks that¹s about the<br/>\n&gt;&gt; only time<br/>\n&gt;&gt;&gt; &gt; they get out of the house other than scouts.<br/>\n&gt;&gt; <br/>\n&gt;&gt; Take them out of the house more often?  Find more fun things to do.<br/>\n&gt;&gt; <br/>\n&gt; Ya... That probably sounded worse than it needed to.  I would definitely say<br/>\n&gt; that¹s not true of most weeks, just some weeks.  The exercise part is pretty<br/>\n&gt; much usually true.<br/>\n&gt;&gt; <br/>\n&gt;&gt; If they miss a class or two,<br/>\n&gt;&gt;&gt; &gt; or if the class is cancelled due to a holiday or something, it is really<br/>\n&gt;&gt;&gt; &gt; hard for them to get back into it.  I can relate to what they are<br/>\n&gt;&gt; feeling;<br/>\n&gt;&gt;&gt; &gt; sometimes I do not want to go to the gym.  Sometimes I go anyway,<br/>\n&gt;&gt; sometimes<br/>\n&gt;&gt;&gt; &gt; not.  Do I appreciate it when someone (my husband, for example)<br/>\n&gt;&gt; pressures or<br/>\n&gt;&gt;&gt; &gt; cajoles me to go?  Yes.  But I do still have a choice.  They really<br/>\n&gt;&gt; don¹t.<br/>\n&gt;&gt;&gt; &gt; They have a choice to quit taekwondo, of course.<br/>\n&gt;&gt; <br/>\n&gt;&gt; They do?  It doesn&#39;t sound that way.  If your forcing them to go, they<br/>\n&gt;&gt; may feel they are being pressured to not quit either.  Maybe they fear<br/>\n&gt;&gt; your disappointment.  But if you didn&#39;t have those expectations then<br/>\n&gt;&gt; you couldn&#39;t be disappointed.<br/>\n&gt;&gt; <br/>\n&gt; Well... This made me reflect.  I do ask them (not in a negative manner)<br/>\n&gt; whether they want to quit, and I have told them that they can quit.  It is a<br/>\n&gt; month to month class, and doesn¹t cost that much (it¹s through our local parks<br/>\n&gt; and rec) so I wouldn¹t even care if they quit in the middle.  The 8 y.o.<br/>\n&gt; actually did quit for a year or so a few years back, and then rejoined later.<br/>\n&gt; However, I believe what I have told them in the past (distant past so i¹m not<br/>\n&gt; positive lol) is that if they quit they¹d have to find some other physical<br/>\n&gt; activity to do.  It could be that they do feel trapped into tae kwon do<br/>\n&gt; because they don¹t want to find another activity.<br/>\n&gt;&gt; <br/>\n&gt;&gt; But if they don&#39;t want to<br/>\n&gt;&gt;&gt; &gt; quit, they have to go unless they&#39;re sick or something important<br/>\n&gt;&gt; comes up.<br/>\n&gt;&gt;&gt; &gt; I guess I¹m afraid if I don¹t make them go they¹ll get used to not<br/>\n&gt;&gt; having to<br/>\n&gt;&gt;&gt; &gt; go and just quit going.<br/>\n&gt;&gt; <br/>\n&gt;&gt; My son took Karate for 2 or 3 years.  We put ourselves in the same<br/>\n&gt;&gt; predicament.  We made him go, even unhappily.  After we began<br/>\n&gt;&gt; unschooling, and our relationship became trusting, he told me he<br/>\n&gt;&gt; wanted to quit.  And he did.  No big deal.  After awhile, his little<br/>\n&gt;&gt; energetic body was dying for something to do so he tried hockey,<br/>\n&gt;&gt; baseball, and soccer.  Now he&#39;s really into wrestling and even joined<br/>\n&gt;&gt; the local youth theater.  It changed him a lot to be in control of his<br/>\n&gt;&gt; own activities.  I just had to find them and open them up for him.<br/>\n&gt;&gt;  <br/>\n&gt; They definitely have control of their activities in a general sense as far as<br/>\n&gt; picking them and quitting them, but participating in between the joining and<br/>\n&gt; the quitting hasn¹t been optional.<br/>\n&gt; <br/>\n&gt; Thanks for your input!!<br/>\n&gt; <br/>\n&gt; Sarah<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What should I have done?","postDate":"1206567253","msgId":31304,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBDRDc5NDA5LUI4QjQtNDBBRC1CN0JFLUY3ODhENkJCNDk2NkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEM0MEZFNEJELjcxOEMlcXVlYW5hQGdtYWlsLmNvbT4=","referencesHeader":"PEM0MEZFNEJELjcxOEMlcXVlYW5hQGdtYWlsLmNvbT4="},"prevInTopic":31303,"nextInTopic":31306,"prevInTime":31303,"nextInTime":31305,"topicId":31293,"numMessagesInTopic":0,"msgSnippet":"... At this point you turned him into the problem. To stay focused on the problem of the group needing a plan, you could say Others will be disappointed if","messageBody":"<div id=\"ygrps-yiv-232731996\">On Mar 26, 2008, at 2:32 PM, Queana wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I reminded him at some<br/>\n&gt; point that he had scouts that night and needed to plan and he said  <br/>\n&gt; he didn�t<br/>\n&gt; want to go.  I said, basically, tough.<br/>\n<br/>\n </span></blockquote>At this point you turned him into the problem.<br/>\n<br/>\nTo stay focused on the problem of the group needing a plan, you could  <br/>\nsay &quot;Others will be disappointed if they show up and there&#39;s no one  <br/>\nthere with a plan of things to do. Chaos will ensue. There will be  <br/>\nblood. It won&#39;t be pretty. What can we do?&quot;<br/>\n<br/>\nAsk it honestly, knowing he has the option of backing out since he  <br/>\ngave plenty of hours of warning. I assume he&#39;s planned before without  <br/>\nproblems? Perhaps there was a problem the last meeting that he&#39;s  <br/>\nfeeling embarrassed about.<br/>\n<br/>\nYou could do the plan yourself and take over for him. Ask him what it  <br/>\nwas he was thinking of doing. If he knew he didn&#39;t have to do it, saw  <br/>\nthat you were willing to pitch in for him, I bet it&#39;s likely he would  <br/>\nhave taken over.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He mentioned a couple times over the next couple hours that he<br/>\n&gt; didn�t want to go, and I still said, basically, tough, that he was  <br/>\n&gt; in charge<br/>\n&gt; so he couldn�t ditch, that it affects the group too much when  <br/>\n&gt; someone is<br/>\n&gt; missing, blah blah blah.<br/>\n<br/>\n </span></blockquote>And yet that&#39;s ultimately what happened and I bet the world didn&#39;t  <br/>\nend, even though *you* left the leaders in the lurch with only a few  <br/>\nminutes warning. He had given hours of warning.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But once it got to the point it<br/>\n&gt; got to, was it stupid for me to call the leader and let him know he  <br/>\n&gt; wasn�t<br/>\n&gt; coming?  Should I have left that responsibility to him?  Should I  <br/>\n&gt; have just<br/>\n&gt; let him flake and not told anyone?<br/>\n<br/>\n </span></blockquote>What would be gained? Do you think pressure and humiliation is a good  <br/>\nteacher? If so, schools would work wonders wouldn&#39;t they?<br/>\n<br/>\nIf you found yourself trapped in a humiliating situation and you knew  <br/>\nsomeone could help you but refused to, would it make you stronger?  <br/>\nWould you feel empowered ever after to handle the situation on your  <br/>\nown? Or might you think &quot;She abandoned me when I needed her.&quot;<br/>\n<br/>\nOften the lessons we think we&#39;re teaching aren&#39;t the lessons being  <br/>\nlearned.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I guess I�m afraid if I don�t make them go they�ll get used to not  <br/>\n&gt; having to<br/>\n&gt; go and just quit going.<br/>\n<br/>\n </span></blockquote>By making them do something they aren&#39;t wildly enthusiastic about  <br/>\nyou&#39;re preventing them from doing something that they might find even  <br/>\nbetter.<br/>\n<br/>\nIn the process they&#39;re getting a bad feeling about Tae Kwon Do. If  <br/>\nthey leave with a good feeling about it, the might take it up again  <br/>\nwhen they&#39;re older. But less likely if they remember participation  <br/>\nlaced with coercion.<br/>\n<br/>\nTalk to them about it. Be honest. Tell them you need to pay for  <br/>\nlessons even if they don&#39;t show up. (I am assuming, otherwise I&#39;m not  <br/>\nseeing the objection.) And it&#39;s money you could better spend  <br/>\nelsewhere on something they enjoy more. Don&#39;t lace this with guilt.  <br/>\nIt&#39;s information to help them make a decision. Then let them decide.  <br/>\nIt might take a week or so, but trust them.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: What should I have done?","postDate":"1206560945","msgId":31302,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZzZTliaCtsMTg5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEM0MEZFNEJELjcxOEMlcXVlYW5hQGdtYWlsLmNvbT4="},"prevInTopic":31301,"nextInTopic":31303,"prevInTime":31301,"nextInTime":31303,"topicId":31293,"numMessagesInTopic":0,"msgSnippet":"... I m not sure if this was the right answer, but I would have planned the meeting for him (if that was the problem) rather than lie for him. That s","messageBody":"<div id=\"ygrps-yiv-839958067\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Queana &lt;queana@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Finally I ended up calling the leader, said he wasn¹t feeling well and<br/>\n&gt; wouldn¹t make it, and that was that.  The rest of the evening was fine.<br/>\n<br/>\n </span></blockquote>I&#39;m not sure if this was the right answer, but I would have planned<br/>\nthe meeting for him (if that was the problem) rather than lie for him.<br/>\n That&#39;s definitely not a good thing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Obviously I screwed up in various ways throughout the day.  I should<br/>\n </span></blockquote>have<br/>\n<blockquote><span title=\"ireply\"> &gt; listened to him from the get go; it¹s not like he frequently doesn¹t<br/>\n </span></blockquote>want to<br/>\n<blockquote><span title=\"ireply\"> &gt; go.  He just wasn¹t in the mood I guess.  But once it got to the<br/>\n </span></blockquote>point it<br/>\n<blockquote><span title=\"ireply\"> &gt; got to, was it stupid for me to call the leader and let him know he<br/>\n </span></blockquote>wasn¹t<br/>\n<blockquote><span title=\"ireply\"> &gt; coming?  Should I have left that responsibility to him?  Should I<br/>\n </span></blockquote>have just<br/>\n<blockquote><span title=\"ireply\"> &gt; let him flake and not told anyone?<br/>\n<br/>\n </span></blockquote>I&#39;m wondering if you could have tried to find out why he didn&#39;t want<br/>\nto go, and helped from there.<br/>\n<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; On a similar note, the younger two kids (13 and 8) are in taekwondo<br/>\n </span></blockquote>three<br/>\n<blockquote><span title=\"ireply\"> &gt; nights a week, and have been for about 5 years.  It¹s a big<br/>\n </span></blockquote>commitment and<br/>\n<blockquote><span title=\"ireply\"> &gt; sometimes one or both of them doesn¹t want to go.<br/>\n </span></blockquote>I pretty much make them<br/>\n<blockquote><span title=\"ireply\"> &gt; go anyway, sometimes unhappily.  Once they get going, they are fine.<br/>\n<br/>\n </span></blockquote>The ends, do not justify the means.  :-)<br/>\n<br/>\n  That<br/>\n<blockquote><span title=\"ireply\"> &gt; is often the only exercise they get.  Some weeks that¹s about the<br/>\n </span></blockquote>only time<br/>\n<blockquote><span title=\"ireply\"> &gt; they get out of the house other than scouts.  <br/>\n<br/>\n </span></blockquote>Take them out of the house more often?  Find more fun things to do.<br/>\n<br/>\nIf they miss a class or two,<br/>\n<blockquote><span title=\"ireply\"> &gt; or if the class is cancelled due to a holiday or something, it is really<br/>\n&gt; hard for them to get back into it.  I can relate to what they are<br/>\n </span></blockquote>feeling;<br/>\n<blockquote><span title=\"ireply\"> &gt; sometimes I do not want to go to the gym.  Sometimes I go anyway,<br/>\n </span></blockquote>sometimes<br/>\n<blockquote><span title=\"ireply\"> &gt; not.  Do I appreciate it when someone (my husband, for example)<br/>\n </span></blockquote>pressures or<br/>\n<blockquote><span title=\"ireply\"> &gt; cajoles me to go?  Yes.  But I do still have a choice.  They really<br/>\n </span></blockquote>don¹t.<br/>\n<blockquote><span title=\"ireply\"> &gt; They have a choice to quit taekwondo, of course.  <br/>\n<br/>\n </span></blockquote>They do?  It doesn&#39;t sound that way.  If your forcing them to go, they<br/>\nmay feel they are being pressured to not quit either.  Maybe they fear<br/>\nyour disappointment.  But if you didn&#39;t have those expectations then<br/>\nyou couldn&#39;t be disappointed.  <br/>\n<br/>\nBut if they don&#39;t want to<br/>\n<blockquote><span title=\"ireply\"> &gt; quit, they have to go unless they&#39;re sick or something important<br/>\n </span></blockquote>comes up.<br/>\n<blockquote><span title=\"ireply\"> &gt; I guess I¹m afraid if I don¹t make them go they¹ll get used to not<br/>\n </span></blockquote>having to<br/>\n<blockquote><span title=\"ireply\"> &gt; go and just quit going.<br/>\n<br/>\n<br/>\n </span></blockquote>My son took Karate for 2 or 3 years.  We put ourselves in the same<br/>\npredicament.  We made him go, even unhappily.  After we began<br/>\nunschooling, and our relationship became trusting, he told me he<br/>\nwanted to quit.  And he did.  No big deal.  After awhile, his little<br/>\nenergetic body was dying for something to do so he tried hockey,<br/>\nbaseball, and soccer.  Now he&#39;s really into wrestling and even joined<br/>\nthe local youth theater.  It changed him a lot to be in control of his<br/>\nown activities.  I just had to find them and open them up for him.</div>","specialLinks":[]},{"userId":189179665,"authorName":"freasabird2003","from":"&quot;freasabird2003&quot; &lt;freasabird2003@...&gt;","profile":"freasabird2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What should I have done?","postDate":"1206558235","msgId":31303,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZzZTZtcitoMHQxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEM0MEZFNEJELjcxOEMlcXVlYW5hQGdtYWlsLmNvbT4="},"prevInTopic":31302,"nextInTopic":31304,"prevInTime":31302,"nextInTime":31304,"topicId":31293,"numMessagesInTopic":0,"msgSnippet":"Hi Sarah, To me, you really do sound like a very respectful parent and I am not sure that I would have done anything differently....other than perhaps ","messageBody":"<div id=\"ygrps-yiv-1368377595\">Hi Sarah,<br/>\n<br/>\nTo me, you really do sound like a very respectful parent and I am not <br/>\nsure that I would have done anything differently....other than perhaps <br/>\ninsisting that he make the phone call himself. But it sounds like you <br/>\ndid that too, and only made the phone call when it was obvious that he <br/>\nwasn&#39;t. I suppose if this happens again, you could hold out and let him <br/>\nmake the call or not; eventually he will learn that he is the <br/>\nresponsible party for his actions. I have a 19 year old son who is <br/>\nSTILL figuring this out. :( <br/>\n<br/>\n~Wilda in Savannah, Tennessee<br/>\n(who is an oldtimer at parenting, but less than a decade of unschooling)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Although I¹ve always considered myself a very respectful parent <br/>\n </span></blockquote>compared to<br/>\n<blockquote><span title=\"ireply\"> &gt; just about everyone I know, there are (obviously) areas that I need <br/>\n </span></blockquote>to work<br/>\n<blockquote><span title=\"qreply\"> &gt; on.  Advice from oldtimers would be great :)<br/>\n&gt; <br/>\n&gt; Sarah<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"ENSEMBLE S-WAYNFORTH","from":"ENSEMBLE S-WAYNFORTH &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] sleep schedules","postDate":"1206556606","msgId":31300,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3MjU5Ni4zNDYwLnFtQHdlYjg2MjEwLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":31299,"nextInTopic":31301,"prevInTime":31299,"nextInTime":31301,"topicId":31293,"numMessagesInTopic":0,"msgSnippet":"On the radio tonight (BBC Radio 4) was a discussion about sleep in children. In Europe there are hugely varying cultural practices. In the UK a 7 year old goes","messageBody":"<div id=\"ygrps-yiv-2021099321\">On the radio tonight (BBC Radio 4) was a discussion about sleep in children. In Europe there are hugely varying cultural practices. In the UK a 7 year old goes to bed, on average, at 7:30; in France 9 pm is more normal. There isn&#39;t genetic variation, it is just cultural. <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bbc.co.uk/radio4/science/am_i_normal.shtml\">http://www.bbc.co.uk/radio4/science/am_i_normal.shtml</a> is a link to the program. It&#39;s the 4th one. The interesting comment that I caught (and I only glimpsingly listened to the show while making dinner) was that there is no hard and fast description of a child insomniac, rather it is based on parental perspective. Anyhow, it isn&#39;t when a child goes to bed, it is how much they sleep. <br/>\n<br/>\nI was a late to bed, late to rise person. I can remember, vividly, lying in bed for hours waiting for sleep to come. It didn&#39;t come. 8 or 9 or 10 just weren&#39;t hours when I was ready to stop. Nor was 6 or 7 or 8 or 9 hours when I was ready to wake up. <br/>\n<br/>\nAsk them about jet lag and airline employees who change time zones regularly so don&#39;t go to bed by the clock.  Ask them about people who work night shifts. Have them produce the studies. I&#39;d like to read them, and rip them to shreds. <br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mar 26, 2008, at 11:01 AM, Mirika Sumers wrote:<br/>\n<br/>\n&gt; My husband, DS4, and DD3 and I live with other family members. Every<br/>\n&gt; time our kids decide to stay up late these family members feel the  <br/>\n&gt; need<br/>\n&gt; to tell us about studies that show children do better on a schedule<br/>\n&gt; especially if they go to bed by a certain time. They tell us that<br/>\n&gt; studies have shown children who stay up late have emotional and<br/>\n&gt; developmental problems down the line. We&#39;re trying to be respectful<br/>\n&gt; parents but we&#39;re not sure what to say to this. Does anyone have any<br/>\n&gt; ideas? I can&#39;t find anything on it but I don&#39;t get how it matters if<br/>\n&gt; the kids are getting enough sleep which they do since they sleep in  <br/>\n&gt; the<br/>\n&gt; following mornings.<br/>\n&gt;<br/>\n&gt; Thanks,<br/>\n&gt; Mirika<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":227598072,"authorName":"Queana","from":"Queana &lt;queana@...&gt;","profile":"queanabruedal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"What should I have done?","postDate":"1206556333","msgId":31301,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM0MEZFNEJELjcxOEMlcXVlYW5hQGdtYWlsLmNvbT4=","inReplyToHeader":"PGZzZHMwOCtkajJlQGVHcm91cHMuY29tPg=="},"prevInTopic":31300,"nextInTopic":31302,"prevInTime":31300,"nextInTime":31302,"topicId":31293,"numMessagesInTopic":0,"msgSnippet":"So my 13 y.o. Is in Boy Scouts.  He is in a small troop with only 5 active boys.  He was supposed to be planning last night¹s meeting.  They take turns ","messageBody":"<div id=\"ygrps-yiv-401802913\">So my 13 y.o. Is in Boy Scouts.  He is in a small troop with only 5 active<br/>\nboys.  He was supposed to be planning last night¹s meeting.  They take turns<br/>\nplanning, although we parents usually decide whose turn it is.  Yesterday we<br/>\nwere away from home most of the day, just him and I book shopping (which he<br/>\nloves) and eating lunch at California Pizza Kitchen (which he also loves)<br/>\nwhile his little brother was in a science camp.  I reminded him at some<br/>\npoint that he had scouts that night and needed to plan and he said he didn¹t<br/>\nwant to go.  I said, basically, tough.<br/>\n<br/>\nBy the time we got home he still had 2+ hours to figure something out.  He<br/>\nlooked online, and I tried to offer several suggestions of ideas they could<br/>\ndo that night but he was quite non-receptive to my suggestions so I quit<br/>\nsuggesting.  He mentioned a couple times over the next couple hours that he<br/>\ndidn¹t want to go, and I still said, basically, tough, that he was in charge<br/>\nso he couldn¹t ditch, that it affects the group too much when someone is<br/>\nmissing, blah blah blah.<br/>\n<br/>\nAs it approached time to go, he lay down on the floor and said he didn¹t<br/>\nwant to go.  Then I told him he needed to call his leader and let him know<br/>\nhe wasn¹t coming, because I didn¹t want to.  He started crying.  For about<br/>\n10 minutes I tried to coax, bribe, and cajole him into either going (I had<br/>\nideas of things to do there), or calling to say he wasn¹t going.  In the<br/>\npast I have just said, get in the car, we¹re going; he would have ended up<br/>\ngoing and having fun, but I want to allow him more control in his life.<br/>\n<br/>\nFinally I ended up calling the leader, said he wasn¹t feeling well and<br/>\nwouldn¹t make it, and that was that.  The rest of the evening was fine.<br/>\nObviously I screwed up in various ways throughout the day.  I should have<br/>\nlistened to him from the get go; it¹s not like he frequently doesn¹t want to<br/>\ngo.  He just wasn¹t in the mood I guess.  But once it got to the point it<br/>\ngot to, was it stupid for me to call the leader and let him know he wasn¹t<br/>\ncoming?  Should I have left that responsibility to him?  Should I have just<br/>\nlet him flake and not told anyone?<br/>\n<br/>\nOn a similar note, the younger two kids (13 and 8) are in taekwondo three<br/>\nnights a week, and have been for about 5 years.  It¹s a big commitment and<br/>\nsometimes one or both of them doesn¹t want to go.  I pretty much make them<br/>\ngo anyway, sometimes unhappily.  Once they get going, they are fine.  That<br/>\nis often the only exercise they get.  Some weeks that¹s about the only time<br/>\nthey get out of the house other than scouts.  If they miss a class or two,<br/>\nor if the class is cancelled due to a holiday or something, it is really<br/>\nhard for them to get back into it.  I can relate to what they are feeling;<br/>\nsometimes I do not want to go to the gym.  Sometimes I go anyway, sometimes<br/>\nnot.  Do I appreciate it when someone (my husband, for example) pressures or<br/>\ncajoles me to go?  Yes.  But I do still have a choice.  They really don¹t.<br/>\nThey have a choice to quit taekwondo, of course.  But if they don¹t want to<br/>\nquit, they have to go unless they¹re sick or something important comes up.<br/>\nI guess I¹m afraid if I don¹t make them go they¹ll get used to not having to<br/>\ngo and just quit going.<br/>\n<br/>\nAlthough I¹ve always considered myself a very respectful parent compared to<br/>\njust about everyone I know, there are (obviously) areas that I need to work<br/>\non.  Advice from oldtimers would be great :)<br/>\n<br/>\nSarah<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":274177100,"authorName":"Vickisue Gray","from":"Vickisue Gray &lt;vickisue_gray@...&gt;","profile":"viickisan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] sleep schedules","postDate":"1206553458","msgId":31299,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0Mzg2LjMzOTI3LnFtQHdlYjU0MTEyLm1haWwucmUyLnlhaG9vLmNvbT4="},"prevInTopic":31296,"nextInTopic":31300,"prevInTime":31298,"nextInTime":31300,"topicId":31293,"numMessagesInTopic":0,"msgSnippet":"Gee.  My son was born at noon  which became his best time for being up and went to bed at 2am per his natural schedule.  When we attempted to put him in school","messageBody":"<div id=\"ygrps-yiv-880846161\">Gee.  My son was born at noon  which became his best time for being up and went to bed at 2am<br/>\nper his natural schedule.  When we attempted to put him in school at age five, he became ill every<br/>\nmorning, tossing his stomach content on the 15 mile drive.  (We did put him to bed earlier, but he never<br/>\nadjusted.)  Now that we unschool, he&#39;s had no problem getting his sleep.  At age ten, his rhythm is to get<br/>\nup around 10am and go to bed around midnight.  Mostly because he has adapted to my work schedule otherwise, he&#39;d still be up at noon and to sleep at 2am. <br/>\n<br/>\nI still believe that a child is born with their own personal clock.  My first born was born at 7am and went to sleep that first day at 10pm.  She even slept through the night!  Eighteen years later, that&#39;s still her best rhythm. (Yes, they did nap during the day.  I&#39;m talking main sleeping periods.)<br/>\n<br/>\nVicki<br/>\n<br/>\n<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n      ____________________________________________________________________________________<br/>\nLooking for last minute shopping deals?  <br/>\nFind them fast with Yahoo! Search.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://tools.search.yahoo.com/newsearch/category.php?category=shopping\">http://tools.search.yahoo.com/newsearch/category.php?category=shopping</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa Gray","from":"Melissa Gray &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] sleep schedules","postDate":"1206551096","msgId":31295,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDQTg5NEI1LTczNDUtNEZDNS05MzVDLUZGQ0ExNTlFOTczMUBjb3gubmV0Pg==","inReplyToHeader":"PGZzZHMwOCtkajJlQGVHcm91cHMuY29tPg==","referencesHeader":"PGZzZHMwOCtkajJlQGVHcm91cHMuY29tPg=="},"prevInTopic":31293,"nextInTopic":31296,"prevInTime":31294,"nextInTime":31296,"topicId":31293,"numMessagesInTopic":0,"msgSnippet":"Ask them if they have studies on children who are unschooled. I m sure kids who are dragged out of bed at 6am to get ready for school, spend all day expending","messageBody":"<div id=\"ygrps-yiv-1048574713\">Ask them if they have studies on children who are unschooled. I&#39;m  <br/>\nsure kids who are dragged out of bed at 6am to get ready for school,  <br/>\nspend all day expending energy just to survive public school, and  <br/>\nthen come home to do homework, will suffer if they stay up too late.  <br/>\nHowever, when children can build their own routines they will get the  <br/>\nsleep they need, when they need it.<br/>\nMelissa<br/>\nMom to Joshua, Breanna, Emily, Rachel, Samuel, Daniel and Avari<br/>\nWife to Zane<br/>\n<br/>\nblog me at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives.blogspot.com/\">http://startlinglives.blogspot.com/</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mar 26, 2008, at 11:01 AM, Mirika Sumers wrote:<br/>\n<br/>\n&gt; My husband, DS4, and DD3 and I live with other family members. Every<br/>\n&gt; time our kids decide to stay up late these family members feel the  <br/>\n&gt; need<br/>\n&gt; to tell us about studies that show children do better on a schedule<br/>\n&gt; especially if they go to bed by a certain time. They tell us that<br/>\n&gt; studies have shown children who stay up late have emotional and<br/>\n&gt; developmental problems down the line. We&#39;re trying to be respectful<br/>\n&gt; parents but we&#39;re not sure what to say to this. Does anyone have any<br/>\n&gt; ideas? I can&#39;t find anything on it but I don&#39;t get how it matters if<br/>\n&gt; the kids are getting enough sleep which they do since they sleep in  <br/>\n&gt; the<br/>\n&gt; following mornings.<br/>\n&gt;<br/>\n&gt; Thanks,<br/>\n&gt; Mirika<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":192176730,"authorName":"Barbara Perez","from":"&quot;Barbara Perez&quot; &lt;barbara.perez@...&gt;","profile":"barbaraperez228","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] sleep schedules","postDate":"1206550368","msgId":31296,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwZjQ4NzU2MDgwMzI2MDk1Mnk2MTI5NDg5ZHdkMGQ5MjQ1NDg3NjIzZjU0QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGZzZHMwOCtkajJlQGVHcm91cHMuY29tPg==","referencesHeader":"PGZzZHMwOCtkajJlQGVHcm91cHMuY29tPg=="},"prevInTopic":31295,"nextInTopic":31299,"prevInTime":31295,"nextInTime":31297,"topicId":31293,"numMessagesInTopic":0,"msgSnippet":"IF you have the right relationship with them, I d simply say: Yes, I remember you mentioning that before. You know, there are studies to support just about","messageBody":"<div id=\"ygrps-yiv-1845259807\">IF you have the right relationship with them, I&#39;d simply say: &quot;Yes, I<br/>\nremember you mentioning that before. You know, there are &#39;studies&#39; to<br/>\nsupport just about every parenting practice under the sun, depends who you<br/>\nask. Can we agree to disagree?&quot; I think this would work with *my* family,<br/>\nespecially if you say it with a smile and matter-of-factly implying that<br/>\ntheir opinion is valid to THEM but that you have the final decision on your<br/>\nchildren (without putting this in so many words as to not affect their<br/>\nsensitibilities, lol).<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Mar 26, 2008 at 9:01 AM, Mirika Sumers &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mirika@...\">mirika@...</a>&gt; wrote:<br/>\n<br/>\n&gt;   My husband, DS4, and DD3 and I live with other family members. Every<br/>\n&gt; time our kids decide to stay up late these family members feel the need<br/>\n&gt; to tell us about studies that show children do better on a schedule<br/>\n&gt; especially if they go to bed by a certain time. They tell us that<br/>\n&gt; studies have shown children who stay up late have emotional and<br/>\n&gt; developmental problems down the line. We&#39;re trying to be respectful<br/>\n&gt; parents but we&#39;re not sure what to say to this. Does anyone have any<br/>\n&gt; ideas? I can&#39;t find anything on it but I don&#39;t get how it matters if<br/>\n&gt; the kids are getting enough sleep which they do since they sleep in the<br/>\n&gt; following mornings.<br/>\n&gt;<br/>\n&gt; Thanks,<br/>\n&gt; Mirika<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":3139311,"authorName":"Mirika Sumers","from":"&quot;Mirika Sumers&quot; &lt;mirika@...&gt;","profile":"mirikak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"sleep schedules","postDate":"1206547272","msgId":31293,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZzZHMwOCtkajJlQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":31295,"prevInTime":31292,"nextInTime":31294,"topicId":31293,"numMessagesInTopic":0,"msgSnippet":"My husband, DS4, and DD3 and I live with other family members.  Every time our kids decide to stay up late these family members feel the need to tell us about","messageBody":"<div id=\"ygrps-yiv-278734724\">My husband, DS4, and DD3 and I live with other family members.  Every <br/>\ntime our kids decide to stay up late these family members feel the need <br/>\nto tell us about studies that show children do better on a schedule <br/>\nespecially if they go to bed by a certain time.  They tell us that <br/>\nstudies have shown children who stay up late have emotional and <br/>\ndevelopmental problems down the line.  We&#39;re trying to be respectful <br/>\nparents but we&#39;re not sure what to say to this.  Does anyone have any <br/>\nideas? I can&#39;t find anything on it but I don&#39;t get how it matters if <br/>\nthe kids are getting enough sleep which they do since they sleep in the <br/>\nfollowing mornings. <br/>\n<br/>\nThanks,<br/>\nMirika</div>","specialLinks":[]}],"prevTopicId":31333,"nextTopicId":31323}}