{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":15,"messages":[{"userId":421402535,"authorName":"jodieandjemimah","from":"&quot;jodieandjemimah&quot; &lt;vagabond2go@...&gt;","profile":"jodieandjemimah","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Napping - Baby and Toddler","postDate":"1261824971","msgId":42574,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoNHE0Yit0N2hjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhndG5lbCtjbm00QGVHcm91cHMuY29tPg=="},"prevInTopic":42569,"nextInTopic":0,"prevInTime":42573,"nextInTime":42575,"topicId":42549,"numMessagesInTopic":0,"msgSnippet":"Hi, I have a very similar problem with a 5 month old baby and a full on 3 year old.  One solution I have found is going for a drive with the two of them - both","messageBody":"<div id=\"ygrps-yiv-80437037\">Hi, I have a very similar problem with a 5 month old baby and a full on 3 year old.  One solution I have found is going for a drive with the two of them - both fall asleep or at least generally a quiet enough for the other to fall asleep.  But you said you didn&#39;t drive i think is that right?  Another thing I do is put the baby in a carrier and go for a long walk with the two of them.  I use a baby bjorn at the moment and will graduate to a ergo when she gets heavier.  These are both upright kind of carriers as neither of my kids went for sling kind of things.  Hope this helps.</div>","specialLinks":[]},{"userId":251210887,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Napping - Baby and Toddler","postDate":"1261663749","msgId":42569,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCMzM3NjA1LjcwMjA5MDJAeWFob28uY2E+"},"prevInTopic":42568,"nextInTopic":42574,"prevInTime":42568,"nextInTime":42570,"topicId":42549,"numMessagesInTopic":0,"msgSnippet":"*Charlotte said, Give the elder little one more options to be happy while you nurse the little one. Playdough, building blocks, coloring books, cutting pieces","messageBody":"<div id=\"ygrps-yiv-974264942\">*Charlotte said, &quot;Give the elder little one more options to be happy <br/>\nwhile you nurse the little one. Playdough, building blocks, coloring <br/>\nbooks, cutting pieces of paper, duplo, let her put &#39;her baby&#39; doll to <br/>\nsleep as well. - in other words, always change what she does while you <br/>\nare busy elsewhere to keep her from getting bored and lonely on her own.*<br/>\n<br/>\nOk, this is a good idea.  I think my problem has been offering these <br/>\nthings, and she is on a &#39;no&#39; kick.  She won&#39;t choose things, tell me <br/>\nwhat she wants.  But maybe I should just set them out and start with her <br/>\nand then go off to nurse.  I will try something.<br/>\n<br/>\n*It may help a whole lot to try to step away from this guilt. He&#39;s <br/>\ngetting to sleep eventually, so he is getting that need met. Its not <br/>\nideal, but its less ideal for him to be tired *and* your other child <br/>\nfrantic.*<br/>\n<br/>\nI guess.  But it certainly feels like I&#39;m being torn apart choosing <br/>\nbetween the best interests of my kids. <br/>\n<br/>\n*Here&#39;s a suggestion that might sound off the deep end, but it can be <br/>\neasier to adjust babies, sometimes, if that&#39;s the mellower child. Will <br/>\nhe go to sleep by himself with a bottle or pacifier? I know it sounds <br/>\nwhacked, but if it gets him to sleep without the 3yo having to lose her <br/>\nmom for awhile, it may be the kinder solution all &#39;round.*<br/>\n<br/>\nHe never attached to sucking on pacifiers or bottles (I tried though), <br/>\nand won&#39;t go to sleep that way.  What I really feel bad about is that he <br/>\nloves to sleep.  He WANTS to nap.  It helps him to nap.  And he sleeps <br/>\nbetter at night when he naps.  So its a lot more pleasant for me if he <br/>\nnaps too.  He is so easy to put down, majority of the time.  I don&#39;t <br/>\nhave to spend 45 minutes nursing, like I did with the older one when she <br/>\nwas a baby. <br/>\n<br/>\n*How old is the baby? I only ask because I don&#39;t think it will hurt to <br/>\nstay home. Babies grow up so fast that several months of staying home <br/>\nisn&#39;t going to be a big deal in the grand scheme of things. Babies go <br/>\nthrough periods where they need to sleep more. For my kids, that is <br/>\nusually accompanied by lots of extra nursing. When my babies are in <br/>\nthose periods, we stay home a lot and keep things pretty low key. Being <br/>\noverly exhausted can make it really hard to get good sleep. My youngest <br/>\nis my first kid that doesn&#39;t like to go to sleep in the sling. In order <br/>\nfor her to sleep, we have to be at home and I have to be cuddling and <br/>\nnursing. I have had to get really creative with her because she has 3 <br/>\nbig sisters. It is hard to give a lot of concrete ideas because what <br/>\nworks one day may not work the next. Some days, she will fall asleep on <br/>\nmy lap in the recliner. Some days, she HAS to be in bed.*<br/>\n<br/>\nThe baby is 10 months old, and he&#39;s been this way since he was born <br/>\nbasically.  It was very surprising, after a first baby who never wanted <br/>\nto sleep and still resists sleep.   I can&#39;t see him changing any time <br/>\nsoon, and I worry about him becoming a less easy sleeper if he doesn&#39;t <br/>\nget to sleep when he wants to.   This isn&#39;t just a &#39;period&#39; of <br/>\ndevelopment... its his nature.  I don&#39;t think we could have stayed home <br/>\nfor 10 months.  I&#39;m sure he&#39;ll go down to one nap eventually, but I have <br/>\nno idea when.  He&#39;s not showing signs of needing that yet.   I think his <br/>\nnight time sleeping has gotten more choppy because of missing naps, but <br/>\nit could be attributed to his not nursing much during the day when <br/>\npeople are around and making up for that at night.<br/>\n<br/>\n*You mention that he sleeps from 10-12 and then from 2-4. Do you set <br/>\nthese times or are these the times that your little one naturally wants <br/>\nto sleep?*<br/>\n<br/>\nThese just seem to be the times hes tired.  Its loose.  But its amazing <br/>\nhow consistent his internal clock is.  Even if he wakes up early in the <br/>\nmorning, he generally still wants a nap at the same time.</div>","specialLinks":[]},{"userId":251210887,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Napping - Baby and Toddler","postDate":"1261658061","msgId":42568,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCMzM1RkNELjEwNzA3MDhAeWFob28uY2E+"},"prevInTopic":42567,"nextInTopic":42569,"prevInTime":42567,"nextInTime":42569,"topicId":42549,"numMessagesInTopic":0,"msgSnippet":"*Its been a while since mine were babies. The only thing I can think of atm is would a noise machine help cancell out the noise from your 3 year old? *Shurgs*","messageBody":"<div id=\"ygrps-yiv-926615504\">*Its been a while since mine were babies. The only thing I can think of <br/>\natm is would a noise machine help cancell out the noise from your 3 year <br/>\nold? *Shurgs* they help me sleep.<br/>\n<br/>\nNicole*<br/>\n<br/>\nI forgot to mention that we use a noise machine.  It doesn&#39;t help much <br/>\nwhen the 3YO comes  to my bedroom door and screams and bangs, or just <br/>\nwalks into the room and climbs into bed with us.</div>","specialLinks":[]},{"userId":251210887,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Napping - Baby and Toddler","postDate":"1261657937","msgId":42567,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCMzM1RjUxLjcwODA3MDlAeWFob28uY2E+"},"prevInTopic":42566,"nextInTopic":42568,"prevInTime":42566,"nextInTime":42568,"topicId":42549,"numMessagesInTopic":0,"msgSnippet":"*Whay about nursing him to sleep on the couch in the living room while your 3 year old plays nearby? You could relocate him afterward... or, my son used to","messageBody":"<div id=\"ygrps-yiv-760801616\">*Whay about nursing him to sleep on the couch in the living room while <br/>\nyour 3 year old plays nearby? You could relocate him afterward...<br/>\nor, my son used to sleep in a front carry wrap because he could nuse on <br/>\nand off ...hed sleep for 3 hours sometimes, even out and about, that <br/>\nway. I used thr baby bundler, which is similar to the didymos and the, <br/>\netc...a two shoulder and hips and back cross wrap. Very cozy!*<br/>\n<br/>\nHe doesn&#39;t usually fall asleep when I nurse when others are around.  He <br/>\nwon&#39;t usually nurse much at all in front of others.  Sometimes he&#39;s <br/>\nfallen asleep when he&#39;s missed his naps and is already exhausted by <br/>\nnursing on the couch, but not reliably at all.  He doesn&#39;t do the on and <br/>\noff doze thing in carriers (my daughter used to do that so I know what <br/>\nyou mean), and my body can&#39;t handle having him on me for so long these <br/>\ndays.</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Napping - Baby and Toddler","postDate":"1261628586","msgId":42566,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxNTFCMDFDRkNCQjRGRjVCMDAwMzM1MkFEM0RFNUNGQENvbm5pZVBDPg==","inReplyToHeader":"PGhndWhtbisyb2g2QGVHcm91cHMuY29tPg==","referencesHeader":"PGhndWhtbisyb2g2QGVHcm91cHMuY29tPg=="},"prevInTopic":42563,"nextInTopic":42567,"prevInTime":42565,"nextInTime":42567,"topicId":42549,"numMessagesInTopic":0,"msgSnippet":"... I promise. It will get better. My 8 year old and 5 year old are proof of that. ... We have been there done that. In my experience, a fan or humidifier","messageBody":"<div id=\"ygrps-yiv-1078343690\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;Yeah, I shouldn&#39;t expect it&#39;s going to get worse--it has been getting worse, but maybe it&#39;ll get better.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I promise. It will get better. My 8 year old and 5 year old are proof of that. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt; My 4 year old (boy) is a pretty mellow kid, so he&#39;s usually willing to let me nurse the baby down with minimum or quiet interruptions. My 2 year old, of course, is not able to let me do that. Also, he&#39;s very physical (throwing, head butting, crawling over me, etc). This causes issues if I am trying to nurse the baby down. Also, the baby is sleeping more lightly adn becoming more distractible while nursing (even with a fan or humidifier running), so it&#39;s really not possible to put her to sleep with him there.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>We have been there done that. In my experience, a fan or humidifier isn&#39;t loud enough to mask the noise and craziness of the others. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt; We&#39;ve tried to have all 5 of us in bed, but my normally relaxed and pro-unschooling husband insists he can not put up with the &quot;non-sense and chaos&quot; of us all in bed together.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>We have had those nights where somebody has gotten bonked because of the chaos. When we quit trying to fight the chaos and started embracing it, the kids settled down quite a bit. There are still times when the big kids come in and try to jump on the bed or do other crazy stuff. There have also been nights where my husband has gotten mad and gone to go sleep in the recliner because he has reached his limit.<br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":194427255,"authorName":"Julie","from":"&quot;Julie&quot; &lt;jmarkoski@...&gt;","profile":"jmarkoski","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Napping - Baby and Toddler","postDate":"1261619735","msgId":42563,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhndWhtbisyb2g2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU3MzhBQkRBNzQ2MDQzRkQ4RkJFNUI5OTg5MjlFMjk2QENvbm5pZVBDPg=="},"prevInTopic":42561,"nextInTopic":42566,"prevInTime":42562,"nextInTime":42564,"topicId":42549,"numMessagesInTopic":0,"msgSnippet":"Yeah, I shouldn t expect it s going to get worse--it has been getting worse, but maybe it ll get better. My 4 year old (boy) is a pretty mellow kid, so he s","messageBody":"<div id=\"ygrps-yiv-615880982\">Yeah, I shouldn&#39;t expect it&#39;s going to get worse--it has been getting worse, but maybe it&#39;ll get better. My 4 year old (boy) is a pretty mellow kid, so he&#39;s usually willing to let me nurse the baby down with minimum or quiet interruptions.  My 2 year old, of course, is not able to let me do that.  Also, he&#39;s very physical (throwing, head butting, crawling over me, etc).  This causes issues if I am trying to nurse the baby down.  Also, the baby is sleeping more lightly adn becoming more distractible while nursing (even with a fan or humidifier running), so it&#39;s really not possible to put her to sleep with him there.<br/>\n<br/>\nWe have a king+twin too, but there&#39;s no way in the world I can conceive of sleeping with all 3 with me right now.  The 2 and 4 year old jockey for position (can&#39;t both be next to me because the baby is on one side) and they fight when next to each other.  Also, the 2 year old&#39;s physicality becomes pretty dangerous becomes he&#39;ll dive head first into any of us, including the baby (and man does he have a big head!).  Our current sleeping arrangements are workign pretty well right now because he&#39;s daddy-centric at this time and they gets lots of bonding and cuddling time at night. We&#39;ve tried to have all 5 of us in bed, but my normally relaxed and pro-unschooling husband insists he can not put up with the &quot;non-sense and chaos&quot; of us all in bed together.<br/>\n<br/>\nThanks for your comments.<br/>\nJulie M<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;otherstar&quot; &lt;otherstar@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; &gt;&gt;&gt;&gt;&gt;I&#39;m having the same issue emerging with my 5 month old and a 2.5 year old and a 4.25 year old. The baby has stopped easily napping (nurse, then put in swing) and won&#39;t fall asleep except nursing now, and then I can&#39;t move her or remove myself without her waking up. I can&#39;t &quot;wear&quot; her because she hates it can certainly won&#39;t fall sleep that way. She&#39;s not sleeping much during the day--just catnaps. My 2.5 year old naps most days, so when the baby&#39;s need to nap coincides with that time, things work better because my 4 year old usually cooperates. When it doesn&#39;t coincide, it&#39;s chaos. I sense that this problem is going to be getting worse and have no plan for what to do.&lt;&lt;&lt;&lt;<br/>\n&gt; <br/>\n&gt; Don&#39;t assume that it is going to get worse. There will be good days and there will be bad days. I have to be creative. One of the things that we do is focus on overnight sleep and put less of an emphasis on naps. I would recommend planning on being flexible and trying not to get tied down to schedules. When my oldest 2 girls were little, we had a normal schedule. We have thrown that out the window because we have let our kids&#39; sleep patterns work themselves out naturally rather than trying to force the issue.   <br/>\n&gt; <br/>\n&gt; &gt;&gt;&gt;&gt;Night time is working because the 4 year old and baby sleep with me and the 2 year old sleeps with Dad in another room. I dread his first over night business trip under this arrangement!&lt;&lt;&lt;&lt;<br/>\n&gt; <br/>\n&gt; Why can&#39;t all of the kids sleep with you in the same room? We had a queen bed and a twin bed in our room for the longest time. After baby #4, we decided that we needed to upgrade to a king. Now, we have a king & twin in our room so all 6 of us can sleep in the same room.<br/>\n&gt; <br/>\n&gt; Connie<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Napping - Baby and Toddler","postDate":"1261613113","msgId":42561,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3MzhBQkRBNzQ2MDQzRkQ4RkJFNUI5OTg5MjlFMjk2QENvbm5pZVBDPg==","inReplyToHeader":"PGhndG9rMSttOHJyQGVHcm91cHMuY29tPg==","referencesHeader":"PGhndG9rMSttOHJyQGVHcm91cHMuY29tPg=="},"prevInTopic":42560,"nextInTopic":42563,"prevInTime":42560,"nextInTime":42562,"topicId":42549,"numMessagesInTopic":0,"msgSnippet":"... Don t assume that it is going to get worse. There will be good days and there will be bad days. I have to be creative. One of the things that we do is","messageBody":"<div id=\"ygrps-yiv-1546634105\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;I&#39;m having the same issue emerging with my 5 month old and a 2.5 year old and a 4.25 year old. The baby has stopped easily napping (nurse, then put in swing) and won&#39;t fall asleep except nursing now, and then I can&#39;t move her or remove myself without her waking up. I can&#39;t &quot;wear&quot; her because she hates it can certainly won&#39;t fall sleep that way. She&#39;s not sleeping much during the day--just catnaps. My 2.5 year old naps most days, so when the baby&#39;s need to nap coincides with that time, things work better because my 4 year old usually cooperates. When it doesn&#39;t coincide, it&#39;s chaos. I sense that this problem is going to be getting worse and have no plan for what to do.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Don&#39;t assume that it is going to get worse. There will be good days and there will be bad days. I have to be creative. One of the things that we do is focus on overnight sleep and put less of an emphasis on naps. I would recommend planning on being flexible and trying not to get tied down to schedules. When my oldest 2 girls were little, we had a normal schedule. We have thrown that out the window because we have let our kids&#39; sleep patterns work themselves out naturally rather than trying to force the issue.   <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;Night time is working because the 4 year old and baby sleep with me and the 2 year old sleeps with Dad in another room. I dread his first over night business trip under this arrangement!&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Why can&#39;t all of the kids sleep with you in the same room? We had a queen bed and a twin bed in our room for the longest time. After baby #4, we decided that we needed to upgrade to a king. Now, we have a king & twin in our room so all 6 of us can sleep in the same room.<br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Napping - Baby and Toddler","postDate":"1261610845","msgId":42560,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhndTkwdCt0dGt1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhndG9rMSttOHJyQGVHcm91cHMuY29tPg=="},"prevInTopic":42559,"nextInTopic":42561,"prevInTime":42559,"nextInTime":42561,"topicId":42549,"numMessagesInTopic":0,"msgSnippet":"... ****************** It may not get worse, may very well get better. Kids need less sleep as they get older, so the baby is going to nap less as well as the","messageBody":"<div id=\"ygrps-yiv-348403853\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Julie&quot; &lt;jmarkoski@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I sense that this problem is going to be getting worse and have no plan for what to do.<br/>\n </span></blockquote>******************<br/>\n<br/>\nIt may not get worse, may very well get better. Kids need less sleep as they get older, so the baby is going to nap less as well as the 2yo. That&#39;s going to create a different set of circumstances, though, and its not really possible to anticipate all that much since you don&#39;t know what or when or how.  <br/>\n<br/>\nParenting, especially with young children, is all about changing circumstances. The great system you have this week will fall apart the next because someone moves in or out of a developmental stage. That&#39;s life with young children! It can help a whoooooole lot to cultivate an attitude of interest and curiosity in these stages and changes, rather than doom and gloom. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;She&#39;s not sleeping much during the day--just catnaps.  My 2.5 year old naps most days, so when the baby&#39;s need to nap coincides with that time, things work better because my 4 year old usually cooperates. When it doesn&#39;t coincide, it&#39;s chaos.<br/>\n </span></blockquote>**********************<br/>\n<br/>\nWhat do you mean by &quot;chaos&quot; and what do you mean by &quot;cooperates&quot;? Maybe someone will have specific ideas. There have been some great ideas already in response to the other post and maybe some will help you, too. If you&#39;re trying to get a 4yo to be quiet for a length of time, that&#39;s going to be challenging! Its not an age that lends itself well to quiet, that&#39;s for sure. Will she watch tv or movies? That might buy you a little quiet, especially if you&#39;re in the same room. <br/>\n<br/>\nHere&#39;s something else - are there times when you&#39;re &quot;trying to get something done&quot; that could be cut down or waaaay back so that you can be more present with the kids? That might seem unrelated, but if the 4yo, in particular, is needing more attention, than running over the needs of the baby is a logical way (from her perspective) to get it. So finding ways to meet more of the kids&#39; needs over the whole day can be a proactive solution to the napping issue. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Napping - Baby and Toddler","postDate":"1261610652","msgId":42559,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENCMDBENjU2NkJGQzRCNjVBNUQ4QUJFRDA0QTNEMDYwQENvbm5pZVBDPg==","inReplyToHeader":"PGhndG5lbCtjbm00QGVHcm91cHMuY29tPg==","referencesHeader":"PGhndG5lbCtjbm00QGVHcm91cHMuY29tPg=="},"prevInTopic":42558,"nextInTopic":42560,"prevInTime":42558,"nextInTime":42560,"topicId":42549,"numMessagesInTopic":0,"msgSnippet":"... My 2.5 year old (and my older kids when they were that age) never wanted to be left alone. We always work(ed) nap times by setting up a DVD in the same","messageBody":"<div id=\"ygrps-yiv-572996675\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;But Temima, 3YO, doesn&#39;t want me to leave her. We were going good for a little while setting her up on the sofa with some snacks and a book on CD to read. &lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>My 2.5 year old (and my older kids when they were that age) never wanted to be left alone. We always work(ed) nap times by setting up a DVD in the same room where I was getting the baby to sleep. It created noise so that the baby wouldn&#39;t be disturbed if the older one decided to be loud or needed to ask me a question. Even now, my 5 year old always seems to have to ask me something while I am putting the baby down for a nap. Having a movie/TV on keeps their talking and sudden loud noises from waking up the baby. I liked stuff like Blues Clues and Dora that asked the kids questions and got them involved. I can nurse the baby to sleep and still talk to the older ones about what is going on with the movie. The other advantage is that I get to rest and lay with the baby for a large portion of the nap because none of my kids like to sleep alone even if it is just for a nap. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;Recently, just out of desperation, when she hasn&#39;t been willing to do the books on CD/Snack routine, or sometimes when I&#39;ve left her like that for a bit, she&#39;s been coming into the room and climbing up on bed. A few times its worked out ok, with her being pretty quite and still (meaning, whispering to me and climbing over me, but at least not speaking or touching her brother). &lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>That is why we have a TV & DVD player in our room. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;But then there are the times where she is just adamant that she is going to be noisy, not lie next to me, move around a lot, deliberatly stick her feet or other body parts on the baby, basically deliberately messing with him falling asleep. She can&#39;t really &#39;see&#39; that if she would let me put him to sleep in peace, it would go quicker and then I could spend time alone with her. She doesn&#39;t get that. &lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>That is pretty normal. My 5 year will still come in and ask me for things while getting the baby down for a nap. My 2.5 year old does it too but it is a lot easier to understand from her. My 5 year old has big needs and it is really hard for her to wait for me to meet her needs. Perhaps you could find a way to have the baby nap while still being in the same room with the 3 year old. We do the TV/DVD thing. I also have a recliner that is great for nursing/rocking the baby to sleep while her big sisters play in the same room. I have also nursed the baby to sleep in my lap while on the computer. The main thing is that I do not try to call attention to the fact that I am trying to get the baby to sleep. The more I focus on the notion that everyone needs to be quiet or leave me alone, the more they want my attention and the more they try to interfere. If I just let it happen naturally without trying to deliberately stage anything, it works so much better. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;Also, the baby doesn&#39;t sleep in a carrier on my back, or in strollers, unless utterly exhausted (hours after a missed nap). I don&#39;t know what else to do. I want to be understanding of her need to be with me. But its not fair for the baby to always be missing his naps. He already misses many of them because I take us out to activities. He ends up sleeping when he&#39;s exhausted in the stroller or sling those times, and I feel guilty for it. But I know that we can&#39;t stay home every day so that he can sleep from 10-12 and 2-4. We don&#39;t have a car, so even simple trips will interfere with those times. I feel like when we ARE home, its so cruel to make him stay up, cranky, unhappy, not getting something so important for his development, when he really could.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>How old is the baby? I only ask because I don&#39;t think it will hurt to stay home. Babies grow up so fast that several months of staying home isn&#39;t going to be a big deal in the grand scheme of things. Babies go through periods where they need to sleep more. For my kids, that is usually accompanied by lots of extra nursing. When my babies are in those periods, we stay home a lot and keep things pretty low key. Being overly exhausted can make it really hard to get good sleep. My youngest is my first kid that doesn&#39;t like to go to sleep in the sling. In order for her to sleep, we have to be at home and I have to be cuddling and nursing. I have had to get really creative with her because she has 3 big sisters. It is hard to give a lot of concrete ideas because what works one day may not work the next. Some days, she will fall asleep on my lap in the recliner. Some days, she HAS to be in bed. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;What do I do? Let the baby suffer?&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>The best answer is to get creative and don&#39;t tie yourself to any one solution. You mention that he sleeps from 10-12 and then from 2-4. Do you set these times or are these the times that your little one naturally wants to sleep? My littlest is down to one nap because it is very difficult for her settle down and nap, especially with 3 big sisters. However, we have figured out that she will sleep at least 12+ hours at night so she can have fewer naps during the day. That usually means that I have to stay in bed and cuddle with them to keep them both asleep. It works out though because they both get the extra sleep they need and the naps aren&#39;t as important. We never wake up the little ones in the morning unless we have something really important to do. There are times that if they start to wake up, I will crawl in bed with them and get them back to sleep so they can sleep later. <br/>\n<br/>\nConnie (mom of 4)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\n<br/>\nNo virus found in this incoming message.<br/>\nChecked by AVG - www.avg.com <br/>\nVersion: 9.0.722 / Virus Database: 270.14.117/2583 - Release Date: 12/23/09 02:28:00<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Napping - Baby and Toddler","postDate":"1261609995","msgId":42558,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhndTg2Yitub2ZkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhndG5lbCtjbm00QGVHcm91cHMuY29tPg=="},"prevInTopic":42556,"nextInTopic":42559,"prevInTime":42557,"nextInTime":42559,"topicId":42549,"numMessagesInTopic":0,"msgSnippet":"... ************************** Having been an authoritarian parent, I can say that it wouldn t necessarily help if you were or had been. High energy kids,","messageBody":"<div id=\"ygrps-yiv-1419969398\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;shirarocklin&quot; &lt;shirarocklin@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;And since I haven&#39;t been authoritarian with her, even if I give it a try &quot;Go be in your room right now!&quot; or &quot;Stand outside the door and wait&quot; or &quot;Go be in the living room and do something there&quot; she doesn&#39;t even listen to that.<br/>\n </span></blockquote>**************************<br/>\n<br/>\nHaving been an authoritarian parent, I can say that it wouldn&#39;t necessarily help if you were or had been. High energy kids, spirited kids, kids with bigger needs, will blow right over authoritarian parents, too. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have a baby who really loves to nap.  He takes naps consistently, twice a day, when he&#39;s &#39;allowed.&#39;  He really needs the sleep.  <br/>\n&gt; <br/>\n&gt; But Temima, 3YO, doesn&#39;t want me to leave her.<br/>\n<br/>\n </span></blockquote>Part of the problem seems to be that you have a routine that &quot;requires&quot; your dd to be solitary so that the baby can get to sleep. One set of needs is set in opposition to another - he needs sleep, she needs her mom. You were lucky it worked as long as it did! But now you need a different solution, or set of solutions, and the only way you&#39;re going to know what&#39;s going to work, even some of the time, is by experimenting.<br/>\n<br/>\nOther people had great ideas - try them and try combining them, too. It may be that your dd would have an easier time being quiet if you&#39;re in the room *and* she has something new and fun on a regular basis. A white noise machine (or fountain or soft music) could be a big help, too. Keep in mind that the same solution might not work every day - you may end up with a mix of things that work most of the time, somehow. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;He ends up sleeping when he&#39;s exhausted in the stroller or sling those times, and I feel guilty for it.<br/>\n </span></blockquote>****************<br/>\n<br/>\nIt may help a whole lot to try to step away from this guilt. He&#39;s getting to sleep eventually, so he is getting that need met. Its not ideal, but its less ideal for him to be tired *and* your other child frantic. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;He takes naps consistently,<br/>\n<br/>\n </span></blockquote>Here&#39;s a suggestion that might sound off the deep end, but it can be easier to adjust babies, sometimes, if that&#39;s the mellower child. Will he go to sleep by himself with a bottle or pacifier? I know it sounds whacked, but if it gets him to sleep without the 3yo having to lose her mom for awhile, it may be the kinder solution all &#39;round. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":46477013,"authorName":"Ulrike Haupt","from":"&quot;Ulrike Haupt&quot; &lt;rica@...&gt;","profile":"ulrikehaupt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Napping - Baby and Toddler","postDate":"1261595224","msgId":42556,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNTAwMWNhODQwNSQ1NGYxM2ZjMCRkMWEzZmVhOUB1bHJpa2VjNjUwZmMxYj4=","referencesHeader":"PGhndG5lbCtjbm00QGVHcm91cHMuY29tPg=="},"prevInTopic":42554,"nextInTopic":42558,"prevInTime":42555,"nextInTime":42557,"topicId":42549,"numMessagesInTopic":0,"msgSnippet":"Hi, as I was reading your plea for help I asked my youngst daughter who went through a similar issue recently for advice. (elder daughter at 6 and younger at","messageBody":"<div id=\"ygrps-yiv-1093012229\">Hi,<br/>\nas I was reading your plea for help I asked my youngst daughter who went through a similar issue recently for advice. (elder daughter at 6 and younger at nearly 3)<br/>\n<br/>\nCharlotte said, &quot;Give the elder little one more options to be happy while you nurse the little one. Playdough, building blocks, coloring books, cutting pieces of paper, duplo, let her put &#39;her baby&#39; doll to sleep as well. - in other words, always change what she does while you are busy elsewhere to keep her from getting bored and lonely on her own.<br/>\n<br/>\nBlissings<br/>\nUlrike<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193844353,"authorName":"Nicole Willoughby","from":"Nicole Willoughby &lt;cncnawilloughby@...&gt;","profile":"cncnawilloughby","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Napping - Baby and Toddler","postDate":"1261595064","msgId":42554,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2NTA5Mi4zMTQ0NS5xbUB3ZWIzNzQwNC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGhndG9rMSttOHJyQGVHcm91cHMuY29tPg=="},"prevInTopic":42553,"nextInTopic":42556,"prevInTime":42553,"nextInTime":42555,"topicId":42549,"numMessagesInTopic":0,"msgSnippet":"Its been a while since mine were babies. The only thing I can think of atm is would a noise machine help cancell out the noise from your 3 year old? *Shurgs*","messageBody":"<div id=\"ygrps-yiv-989076639\">Its been a while since mine were babies. The only thing I can think of atm is would a noise machine help cancell out the noise from your 3 year old? *Shurgs* they help me sleep. <br/>\n<br/>\nNicole <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Wed, 12/23/09, Julie &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jmarkoski@...\">jmarkoski@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Julie &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jmarkoski@...\">jmarkoski@...</a>&gt;<br/>\nSubject: [unschoolingbasics] Re: Napping - Baby and Toddler<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Wednesday, December 23, 2009, 12:47 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      I&#39;m having the same issue emerging with my 5 month old and a 2.5 year old and a 4.25 year old.  The baby has stopped easily napping (nurse, then put in swing) and won&#39;t fall asleep except nursing now, and then I can&#39;t move her or remove myself without her waking up.  I can&#39;t &quot;wear&quot; her because she hates it can certainly won&#39;t fall sleep that way. She&#39;s not sleeping much during the day--just catnaps.  My 2.5 year old naps most days, so when the baby&#39;s need to nap coincides with that time, things work better because my 4 year old usually cooperates. When it doesn&#39;t coincide, it&#39;s chaos.  I sense that this problem is going to be getting worse and have no plan for what to do.<br/>\n<br/>\n<br/>\n<br/>\nNight time is working because the 4 year old and baby sleep with me and the 2 year old sleeps with Dad in another room.  I dread his first over night business trip under this arrangement!<br/>\n<br/>\n<br/>\n<br/>\nThese issues are so tricky!  I hope people have good ideas!<br/>\n<br/>\nJulie M<br/>\n<br/>\njames 2005<br/>\n<br/>\ntyler 2007<br/>\n<br/>\naudrey 2009<br/>\n<br/>\n<br/>\n<br/>\n--- In unschoolingbasics@ yahoogroups. com, &quot;shirarocklin&quot; &lt;shirarocklin@ ...&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n<br/>\n&gt; I don&#39;t know what to do.<br/>\n<br/>\n&gt; <br/>\n<br/>\n&gt; I have a baby who really loves to nap.  He takes naps consistently, twice a day, when he&#39;s &#39;allowed.&#39;  He really needs the sleep.  <br/>\n<br/>\n&gt; <br/>\n<br/>\n&gt; But Temima, 3YO, doesn&#39;t want me to leave her.  We were going good for a little while setting her up on the sofa with some snacks and a book on CD to read.  <br/>\n<br/>\n&gt; <br/>\n<br/>\n&gt; But if the baby didn&#39;t go down that first time (I nurse him in bed to sleep), good luck trying that routine 2 or 3 more times to get him to sleep.  She won&#39;t go for it more than once per nap time.<br/>\n<br/>\n&gt; <br/>\n<br/>\n&gt; Recently, just out of desperation, when she hasn&#39;t been willing to do the books on CD/Snack routine, or sometimes when I&#39;ve left her like that for a bit, she&#39;s been coming into the room and climbing up on bed.  A few times its worked out ok, with her being pretty quite and still (meaning, whispering to me and climbing over me, but at least not speaking or touching her brother).  <br/>\n<br/>\n&gt; <br/>\n<br/>\n&gt; But then there are the times where she is just adamant that she is going to be noisy, not lie next to me, move around a lot, deliberatly stick her feet or other body parts on the baby, basically deliberately messing with him falling asleep.  She can&#39;t really &#39;see&#39; that if she would let me put him to sleep in peace, it would go quicker and then I could spend time alone with her.  She doesn&#39;t get that.  <br/>\n<br/>\n&gt; <br/>\n<br/>\n&gt; Also, the baby doesn&#39;t sleep in a carrier on my back, or in strollers, unless utterly exhausted (hours after a missed nap).  I don&#39;t know what else to do.  I want to be understanding of her need to be with me.  But its not fair for the baby to always be missing his naps.  He already misses many of them because I take us out to activities.  He ends up sleeping when he&#39;s exhausted in the stroller or sling those times, and I feel guilty for it.  But I know that we can&#39;t stay home every day so that he can sleep from 10-12 and 2-4.  We don&#39;t have a car, so even simple trips will interfere with those times.  I feel like when we ARE home, its so cruel to make him stay up, cranky, unhappy, not getting something so important for his development, when he really could.<br/>\n<br/>\n&gt; <br/>\n<br/>\n&gt; Now, even asking her to leave.  Or asking her to rest in her bed, or read a book by herself, or ANYTHING, she WILL NOT do.  Its a bit NO for her.  And since I haven&#39;t been authoritarian with her, even if I give it a try &quot;Go be in your room right now!&quot; or &quot;Stand outside the door and wait&quot; or &quot;Go be in the living room and do something there&quot; she doesn&#39;t even listen to that.  <br/>\n<br/>\n&gt; <br/>\n<br/>\n&gt; What do I do?  Let the baby suffer?<br/>\n<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":185586397,"authorName":"lylaw@comcast.net","from":"&lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Napping - Baby and Toddler","postDate":"1261594980","msgId":42553,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{},"prevInTopic":42551,"nextInTopic":42554,"prevInTime":42552,"nextInTime":42554,"topicId":42549,"numMessagesInTopic":0,"msgSnippet":"Whay about nursing him to sleep  on the  couch in the living room while your 3 year old plays nearby?  You could relocate him afterward...or, my son used to","messageBody":"<div id=\"ygrps-yiv-1370770130\">Whay about nursing him to sleep  on the  couch in the living room while your 3 year old plays nearby?  You could relocate him afterward...or, my son used to sleep in a front carry wrap because he could nuse on and off ...hed sleep for 3 hours sometimes, even out and about, that way.  I used thr baby bundler, which is similar to the  didymos and the, etc...a two shoulder and hips and back cross wrap.  Very cozy!<br/>\n<br/>\n-----Original Message-----<br/>\n<br/>\nFrom:  &quot;shirarocklin&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:shirarocklin@...\">shirarocklin@...</a>&gt;<br/>\nSubj:  [unschoolingbasics] Napping - Baby and Toddler<br/>\nDate:  Wed Dec 23, 2009 10:27 am<br/>\nSize:  13K<br/>\nTo:  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n<br/>\n                         I don&#39;t know what to do.<br/>\n <br/>\n I have a baby who really loves to nap.  He takes naps consistently, twice a day, when he&#39;s &#39;allowed.&#39;  He really needs the sleep.  <br/>\n <br/>\n But Temima, 3YO, doesn&#39;t want me to leave her.  We were going good for a little while setting her up on the sofa with some snacks and a book on CD to read.  <br/>\n <br/>\n But if the baby didn&#39;t go down that first time (I nurse him in bed to sleep), good luck trying that routine 2 or 3 more times to get him to sleep.  She won&#39;t go for it more than once per nap time.<br/>\n <br/>\n Recently, just out of desperation, when she hasn&#39;t been willing to do the books on CD/Snack routine, or sometimes when I&#39;ve left her like that for a bit, she&#39;s been coming into the room and climbing up on bed.  A few times its worked out ok, with her being pretty quite and still (meaning, whispering to me and climbing over me, but at least not speaking or touching her brother).  <br/>\n <br/>\n But then there are the times where she is just adamant that she is going to be noisy, not lie next to me, move around a lot, deliberatly stick her feet or other body parts on the baby, basically deliberately messing with him falling asleep.  She can&#39;t really &#39;see&#39; that if she would let me put him to sleep in peace, it would go quicker and then I could spend time alone with her.  She doesn&#39;t get that.  <br/>\n <br/>\n Also, the baby doesn&#39;t sleep in a carrier on my back, or in strollers, unless utterly exhausted (hours after a missed nap).  I don&#39;t know what else to do.  I want to be understanding of her need to be with me.  But its not fair for the baby to always be missing his naps.  He already misses many of them because I take us out to activities.  He ends up sleeping when he&#39;s exhausted in the stroller or sling those times, and I feel guilty for it.  But I know that we can&#39;t stay home every day so that he can sleep from 10-12 and 2-4.  We don&#39;t have a car, so even simple trips will interfere with those times.  I feel like when we ARE home, its so cruel to make him stay up, cranky, unhappy, not getting something so important for his development, when he really could.<br/>\n <br/>\n Now, even asking her to leave.  Or asking her to rest in her bed, or read a book by herself, or ANYTHING, she WILL NOT do.  Its a bit NO for her.  And since I haven&#39;t been authoritarian with her, even if I give it a try &quot;Go be in your room right now!&quot; or &quot;Stand outside the door and wait&quot; or &quot;Go be in the living room and do something there&quot; she doesn&#39;t even listen to that.  <br/>\n <br/>\n What do I do?  Let the baby suffer?</div>","specialLinks":[]},{"userId":194427255,"authorName":"Julie","from":"&quot;Julie&quot; &lt;jmarkoski@...&gt;","profile":"jmarkoski","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Napping - Baby and Toddler","postDate":"1261594049","msgId":42551,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhndG9rMSttOHJyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhndG5lbCtjbm00QGVHcm91cHMuY29tPg=="},"prevInTopic":42549,"nextInTopic":42553,"prevInTime":42550,"nextInTime":42552,"topicId":42549,"numMessagesInTopic":0,"msgSnippet":"I m having the same issue emerging with my 5 month old and a 2.5 year old and a 4.25 year old.  The baby has stopped easily napping (nurse, then put in swing)","messageBody":"<div id=\"ygrps-yiv-793180944\">I&#39;m having the same issue emerging with my 5 month old and a 2.5 year old and a 4.25 year old.  The baby has stopped easily napping (nurse, then put in swing) and won&#39;t fall asleep except nursing now, and then I can&#39;t move her or remove myself without her waking up.  I can&#39;t &quot;wear&quot; her because she hates it can certainly won&#39;t fall sleep that way. She&#39;s not sleeping much during the day--just catnaps.  My 2.5 year old naps most days, so when the baby&#39;s need to nap coincides with that time, things work better because my 4 year old usually cooperates. When it doesn&#39;t coincide, it&#39;s chaos.  I sense that this problem is going to be getting worse and have no plan for what to do.<br/>\n<br/>\nNight time is working because the 4 year old and baby sleep with me and the 2 year old sleeps with Dad in another room.  I dread his first over night business trip under this arrangement!<br/>\n<br/>\nThese issues are so tricky!  I hope people have good ideas!<br/>\nJulie M<br/>\njames 2005<br/>\ntyler 2007<br/>\naudrey 2009<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;shirarocklin&quot; &lt;shirarocklin@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I don&#39;t know what to do.<br/>\n&gt; <br/>\n&gt; I have a baby who really loves to nap.  He takes naps consistently, twice a day, when he&#39;s &#39;allowed.&#39;  He really needs the sleep.  <br/>\n&gt; <br/>\n&gt; But Temima, 3YO, doesn&#39;t want me to leave her.  We were going good for a little while setting her up on the sofa with some snacks and a book on CD to read.  <br/>\n&gt; <br/>\n&gt; But if the baby didn&#39;t go down that first time (I nurse him in bed to sleep), good luck trying that routine 2 or 3 more times to get him to sleep.  She won&#39;t go for it more than once per nap time.<br/>\n&gt; <br/>\n&gt; Recently, just out of desperation, when she hasn&#39;t been willing to do the books on CD/Snack routine, or sometimes when I&#39;ve left her like that for a bit, she&#39;s been coming into the room and climbing up on bed.  A few times its worked out ok, with her being pretty quite and still (meaning, whispering to me and climbing over me, but at least not speaking or touching her brother).  <br/>\n&gt; <br/>\n&gt; But then there are the times where she is just adamant that she is going to be noisy, not lie next to me, move around a lot, deliberatly stick her feet or other body parts on the baby, basically deliberately messing with him falling asleep.  She can&#39;t really &#39;see&#39; that if she would let me put him to sleep in peace, it would go quicker and then I could spend time alone with her.  She doesn&#39;t get that.  <br/>\n&gt; <br/>\n&gt; Also, the baby doesn&#39;t sleep in a carrier on my back, or in strollers, unless utterly exhausted (hours after a missed nap).  I don&#39;t know what else to do.  I want to be understanding of her need to be with me.  But its not fair for the baby to always be missing his naps.  He already misses many of them because I take us out to activities.  He ends up sleeping when he&#39;s exhausted in the stroller or sling those times, and I feel guilty for it.  But I know that we can&#39;t stay home every day so that he can sleep from 10-12 and 2-4.  We don&#39;t have a car, so even simple trips will interfere with those times.  I feel like when we ARE home, its so cruel to make him stay up, cranky, unhappy, not getting something so important for his development, when he really could.<br/>\n&gt; <br/>\n&gt; Now, even asking her to leave.  Or asking her to rest in her bed, or read a book by herself, or ANYTHING, she WILL NOT do.  Its a bit NO for her.  And since I haven&#39;t been authoritarian with her, even if I give it a try &quot;Go be in your room right now!&quot; or &quot;Stand outside the door and wait&quot; or &quot;Go be in the living room and do something there&quot; she doesn&#39;t even listen to that.  <br/>\n&gt; <br/>\n&gt; What do I do?  Let the baby suffer?<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":251210887,"authorName":"shirarocklin","from":"&quot;shirarocklin&quot; &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Napping - Baby and Toddler","postDate":"1261592853","msgId":42549,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhndG5lbCtjbm00QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":42551,"prevInTime":42548,"nextInTime":42550,"topicId":42549,"numMessagesInTopic":0,"msgSnippet":"I don t know what to do. I have a baby who really loves to nap.  He takes naps consistently, twice a day, when he s allowed.  He really needs the sleep. But","messageBody":"<div id=\"ygrps-yiv-955648245\">I don&#39;t know what to do.<br/>\n<br/>\nI have a baby who really loves to nap.  He takes naps consistently, twice a day, when he&#39;s &#39;allowed.&#39;  He really needs the sleep.  <br/>\n<br/>\nBut Temima, 3YO, doesn&#39;t want me to leave her.  We were going good for a little while setting her up on the sofa with some snacks and a book on CD to read.  <br/>\n<br/>\nBut if the baby didn&#39;t go down that first time (I nurse him in bed to sleep), good luck trying that routine 2 or 3 more times to get him to sleep.  She won&#39;t go for it more than once per nap time.<br/>\n<br/>\nRecently, just out of desperation, when she hasn&#39;t been willing to do the books on CD/Snack routine, or sometimes when I&#39;ve left her like that for a bit, she&#39;s been coming into the room and climbing up on bed.  A few times its worked out ok, with her being pretty quite and still (meaning, whispering to me and climbing over me, but at least not speaking or touching her brother).  <br/>\n<br/>\nBut then there are the times where she is just adamant that she is going to be noisy, not lie next to me, move around a lot, deliberatly stick her feet or other body parts on the baby, basically deliberately messing with him falling asleep.  She can&#39;t really &#39;see&#39; that if she would let me put him to sleep in peace, it would go quicker and then I could spend time alone with her.  She doesn&#39;t get that.  <br/>\n<br/>\nAlso, the baby doesn&#39;t sleep in a carrier on my back, or in strollers, unless utterly exhausted (hours after a missed nap).  I don&#39;t know what else to do.  I want to be understanding of her need to be with me.  But its not fair for the baby to always be missing his naps.  He already misses many of them because I take us out to activities.  He ends up sleeping when he&#39;s exhausted in the stroller or sling those times, and I feel guilty for it.  But I know that we can&#39;t stay home every day so that he can sleep from 10-12 and 2-4.  We don&#39;t have a car, so even simple trips will interfere with those times.  I feel like when we ARE home, its so cruel to make him stay up, cranky, unhappy, not getting something so important for his development, when he really could.<br/>\n<br/>\nNow, even asking her to leave.  Or asking her to rest in her bed, or read a book by herself, or ANYTHING, she WILL NOT do.  Its a bit NO for her.  And since I haven&#39;t been authoritarian with her, even if I give it a try &quot;Go be in your room right now!&quot; or &quot;Stand outside the door and wait&quot; or &quot;Go be in the living room and do something there&quot; she doesn&#39;t even listen to that.  <br/>\n<br/>\nWhat do I do?  Let the baby suffer?</div>","specialLinks":[]}],"prevTopicId":42525,"nextTopicId":42571}}