{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":76589361,"authorName":"argwolff","from":"&quot;argwolff&quot; &lt;argwolff@...&gt;","profile":"argwolff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help, unschooler and cracking down of the government.  Many worries....","postDate":"1266850200","msgId":43238,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhsdTVpbys0ZWlsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhsYmtibStrMWxtQGVHcm91cHMuY29tPg=="},"prevInTopic":43175,"nextInTopic":0,"prevInTime":43237,"nextInTime":43239,"topicId":43175,"numMessagesInTopic":0,"msgSnippet":"I m kind of surprised no one has responded to this. Maybe it just got lost in a busy flurry of responses to other subjects? I can not speak at all to how to","messageBody":"<div id=\"ygrps-yiv-1711766984\">I&#39;m kind of surprised no one has responded to this. Maybe it just got lost in a busy flurry of responses to other subjects?<br/>\n<br/>\nI can not speak at all to how to meet state requirements because we are 1) pretty new to homeschooling/unschooling, 2)in NJ where there are zero requirements, and 3) my kids are too young to need to worry about transcripts, etc. I roughly keep track of what we are doing with blog posts and my calendar.<br/>\n<br/>\nI do know that there are resources out there that give suggestions for how to turn your unschooling activities into &quot;educationese&quot; -- and hopefully someone can point you in the right direction -- but it seems to me the bigger issue is that you are concerned that your kids would not &quot;test well&quot;, specifically in math, and that you are worried about what that would mean for your family if it becomes required in your area.<br/>\n<br/>\nyou said:<br/>\n<br/>\n&lt;&lt;but have been very bad at expanding on things that have come up for example buying place value blocks or cusinaire rods as I am so unsure if it would then be  &quot;unschooling&quot; or not...so we have basically stagnated in math&gt;&gt;<br/>\n<br/>\nThere are certainly ways of exposing kids to math without using cuisinaire rods or place value blocks, but using them does not nec. go against unschooling. Insisting that your daughter sit down and do math drills goes against unschooling, but simply introducing a tool that may help her understand a concept does not.<br/>\n<br/>\nI&#39;m sure you&#39;ve seen both of these sites, but both have sections on unschooling math:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling.html\">http://sandradodd.com/unschooling.html</a><br/>\n<br/>\nAnd you can Google &quot;unschooling math&quot; (or any other subject for that matter) and come up with a list of links that may give you some good ideas for activities your daughter will enjoy and which will introduce her to, and help her understand, math concepts without seeming schoolish. (You say she is &quot;math resistant&quot; -- I&#39;m curious what that means).<br/>\n<br/>\nBest of luck,<br/>\nAngela Wolff , NJ<br/>\n(Joseph, 7 1/2; Hannah, 5; Miriam, 2)</div>","specialLinks":[]},{"userId":224117939,"authorName":"crazycanuckgurl","from":"&quot;crazycanuckgurl&quot; &lt;jamesandtina942@...&gt;","profile":"crazycanuckgurl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Help, unschooler and cracking down of the government.  Many worries....","postDate":"1266242742","msgId":43175,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhsYmtibStrMWxtQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":43238,"prevInTime":43174,"nextInTime":43176,"topicId":43175,"numMessagesInTopic":0,"msgSnippet":"I live where there is a pretty lax homeschooling law.  We notify in the fall, and fill out a one page report 2x a year. Much concern has been raised since this","messageBody":"<div id=\"ygrps-yiv-1537749175\">I live where there is a pretty lax homeschooling law.  We notify in the fall, and fill out a one page report 2x a year.  <br/>\n<br/>\nMuch concern has been raised since this fall as there is a new goverment liason, and the issue of home visits has been raised.  Apparently, no one is sure if we have to legally allow it if no formal written complaint has been raised because there really is alot of ambiguity in the wording of our laws.  Various people have been contacted and basically bullied into a visit, even told they can have a lawyer. On our local e mail list today it is reported someone was told they are getting a follow up visit in April and may have to send their kids to school or &quot;other alternatives&quot;.   The law is ambiguous at best here, and apparently the gov&#39;t has a lot of leeway in determining we have been providing an equivalent education.  I have always thought that they provide lip service to unschooling (even calling it child led curriculum and providing examples with the report forms mailed out on how to complete the form in this manner).  Something tells me they won&#39;t be so kind in real life.  Some of our local moms have met with one of the new liasons, and she provided a nicer picture face to face, than what other moms were reporting in her visit, but now I am not so sure with this latest round of frantic posts to the list about home visits.<br/>\n<br/>\nI am very concerned and nervous.  I am an unschooler.  I have very very little written evidence of my children&#39;s learning (at least like workbooks and such or &quot;projects&quot; the schools would look for). For example, I have had IMMENSE difficulty in &quot;unschooling math&quot; over the years, and don&#39;t know how to approach that (we talk about numerical concepts and I point it out, we play games not always outright math ones, but have been very bad at expanding on things that have come up for example buying place value blocks or cusinaire rods as I am so unsure if it would then be  &quot;unschooling&quot; or not...so we have basically stagnated in math)so I now have a 10 yr old dd who is very math resistant, would not be able to add and subtract on paper let alone know her times tables and would still have to add on fingers and has pretty much never seen a math workbook....how the hell is that going to look to the government???  Yes she reads well and writes and all that, but the math thing is what scares the heck out of me with a home visit.  Other than the Family Math book on my shelf, and a few games, there is no evidence of the &quot;public school equivalent&quot; they are looking for.  Other families that have had visits have had the officer ask kids&#39; questions and be &quot;quizzed&quot;, and I think that won&#39;t look very well here.<br/>\n<br/>\nThere is alot floating around the list about what our rights are, etc.  and it mostly seems the unschoolers (and there are very few of us) are the scared ones!<br/>\n<br/>\nFor those of you in heavily regulated states...what is your advice?  I could help dd fill out some worksheets I suppose, but she would not have any understanding of what she is doing.<br/>\n<br/>\nTina here in Manitoba Canada</div>","specialLinks":[]}],"prevTopicId":43237,"nextTopicId":43235}}