{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":100027905,"authorName":"TreeGoddess","from":"TreeGoddess &lt;treegoddess@...&gt;","profile":"odrade7","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Dreams","postDate":"1097069861","msgId":3415,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU1MjRBRUU1LTE3OUMtMTFEOS05MzNFLTAwMDM5M0E1REE2NkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDIwMDQxMDA1LjIwMjUyMS40NzQ5LjI0NzU5OEB3ZWJtYWlsMDIubnljLnVudGQuY29tPg==","referencesHeader":"PDIwMDQxMDA1LjIwMjUyMS40NzQ5LjI0NzU5OEB3ZWJtYWlsMDIubnljLnVudGQuY29tPg=="},"prevInTopic":3410,"nextInTopic":0,"prevInTime":3414,"nextInTime":3416,"topicId":3405,"numMessagesInTopic":0,"msgSnippet":"... Ooh, draft horses are sooo comfy to ride!  They re like big soft chairs.  LOL  My friend had a Percheron named Caesar and he was really neat to ride. ","messageBody":"<div id=\"ygrps-yiv-1562847725\">On Oct 5, 2004, at 11:25 PM, Ren wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; [I wanted to throw an idea your way. My SIL was always broke but has<br/>\n&gt; managed to own horses. A couple of ways: she got a rescue horse once..a<br/>\n&gt; draft horse, if you can believe it. ]<br/>\n<br/>\n </span></blockquote>Ooh, draft horses are sooo comfy to ride!  They&#39;re like big soft <br/>\nchairs.  LOL  My friend had a Percheron named Caesar and he was really <br/>\nneat to ride.<br/>\n<br/>\n-Tracy-</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren","from":"&quot;Ren&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Dreams","postDate":"1097033106","msgId":3410,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQxMDA1LjIwMjUyMS40NzQ5LjI0NzU5OEB3ZWJtYWlsMDIubnljLnVudGQuY29tPg=="},"prevInTopic":3405,"nextInTopic":3415,"prevInTime":3409,"nextInTime":3411,"topicId":3405,"numMessagesInTopic":0,"msgSnippet":" I am waiting for a phone call so we can go see it.  I am so excited.  This may not be THE pony and it may take some time to find just the right horse or","messageBody":"<div id=\"ygrps-yiv-558001659\">&quot; I am waiting for a phone call so we can go see it.  I am so<br/>\nexcited.  This may not be THE pony and it may take some time to find just<br/>\nthe right horse or pony, but our dreams are on their way to becoming a<br/>\nreality.&#39;<br/>\n<br/>\nThat&#39;s very exciting!!Congratulations.<br/>\nI wanted to throw an idea your way. My SIL was always broke but has managed to own horses. A couple of ways: she got a rescue horse once..a draft horse, if you can believe it. Befriending those that do rescue can really work in your favor. Maybe contact a horse rescue agency and ask about adoption.<br/>\nAnother thing she did many times is a lease. Her deal was usually with folks that owned a horse, but for one reason or another, didn&#39;t have time to ride. She would exercise, feed, train the horse in exchange for use. They usually let her treat it as her own, even entering them in shows under her name. The deal would vary from owner to owner, but it&#39;s a good way to get your feet wet, without much overhead and the ability to walk away if the horse doesn&#39;t fit your family.<br/>\n<br/>\nGet to know your horse people in the area, 4-H would be a good starting point. I&#39;ve seen a lot of things go wrong when people didn&#39;t know how to feed and care for their animals. Did a rescue with SIL once and it wasn&#39;t critical, but very sad. Mostly just ignorance that put the horse in such bad shape.<br/>\n<br/>\nRen<br/>\n<br/>\n<br/>\nLearn about unschooling at:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a></div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela S","from":"&quot;Angela S&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Dreams","postDate":"1096993385","msgId":3405,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQxMDA1MTYyMzAwLkJMSFExNTExOC5tdGExMy5hZGVscGhpYS5uZXRAbGVpZ2g+"},"prevInTopic":0,"nextInTopic":3410,"prevInTime":3404,"nextInTime":3406,"topicId":3405,"numMessagesInTopic":0,"msgSnippet":"I was recently reading on one of the unschooling lists I am on about a family s dream.  (Sorry if this is a cross post for some of you but I am so excited I","messageBody":"<div id=\"ygrps-yiv-1587468603\">I was recently reading on one of the unschooling lists I am on about a<br/>\nfamily&#39;s dream.  (Sorry if this is a cross post for some of you but I am so<br/>\nexcited I want to tell everyone!) The family didn&#39;t have a lot of money but<br/>\nsomehow, they found a way to help their children follow their dream of<br/>\nhaving horses.  It was very inspiring.<br/>\n<br/>\n <br/>\n<br/>\nSometimes I read accounts like that and think, yeah but, we couldn&#39;t do<br/>\nthat.  We can&#39;t afford it and I really don&#39;t know horses well enough.  Well,<br/>\nI got to thinking about the road blocks and realized that it really is all a<br/>\nmatter of prioritizing and having faith. (Barbara Sher gets a little credit<br/>\nhere too.  I heard her speak at the Live and Learn Unschooling Conference.)<br/>\nWhat are my priorities and can we find a way to make our girl&#39;s dreams come<br/>\ntrue?    <br/>\n<br/>\n <br/>\n<br/>\nMy girls have the same dream, to own a horse or pony. They will only be<br/>\nlittle once and wouldn&#39;t it be awesome if we could attain their dream of<br/>\nowning a horse while they are still at home?  (They  are 8 and 9.75)<br/>\nThey&#39;ve talked about it since they started riding two years ago.<br/>\nIncessantly.  I talked with a neighbor the other day who has a horse and she<br/>\nsaid she wanted one all her life and didn&#39;t get one until she was 60.  Would<br/>\nmy kids be 60 before they got their first horse?  Or could we find a way to<br/>\nhave one much sooner than that?<br/>\n<br/>\n <br/>\n<br/>\nOne part of the road block in horse ownership is my fear of all that can go<br/>\nwrong with horses.   But boarding a horse somewhere at a barn where I trust<br/>\nthe owner&#39;s judgment takes care of part of that fear and I can get over the<br/>\nrest.  Another part of the road block, I thought, would be my dh.  He grew<br/>\nup on a farm with lots of mandatory chores and he sees animals pretty much<br/>\nas only a chore. It is sad, but he gets very little pleasure from any<br/>\nanimals.  He also doesn&#39;t want us to be tied down so that we can&#39;t vacation<br/>\nwhen we want to.  He does, however, realize just how much joy the girls get<br/>\nfrom horses.   I have been saying for the last year though, that if we ever<br/>\ngot a horse, I would board it somewhere so we could still vacation easily<br/>\nand ride all winter in an indoor ring. But boarding is expensive.  Another<br/>\nroad block.  <br/>\n<br/>\n <br/>\n<br/>\nAnyway, this fall I got to thinking that we should sell our half of a small<br/>\ncamp we own because we don&#39;t use it and it&#39;s always costing us money in<br/>\nrepairs and taxes.  Dh&#39;s sister&#39;s family owns the other half so we would<br/>\nneed to either sell it to them or to another of dh&#39;s sibling.  Dh didn&#39;t<br/>\nthink anyone would want to buy us out, but we asked anyway.  His brother is<br/>\ninterested.  :0)    It won&#39;t give us a windfall, by any means, but it will<br/>\nhelp us to pay off some loans and we would have a smaller monthly overhead.<br/>\nI was just going to enjoy having fewer bills, but well, after reading about<br/>\nthat family, I got to thinking that if we paid off a loan or two with the<br/>\nmoney, we would be able to afford board for a horse.  I spoke to the barn<br/>\nowner and asked her if we shoveled stalls regularly, would she reduce the<br/>\nboard.  She agreed and we almost have the details worked out.  She will give<br/>\nus a really good deal if we shovel stalls regularly. <br/>\n<br/>\n <br/>\n<br/>\nAnyway, we don&#39;t have the actual cash yet but we are excited.  It just so<br/>\nhappens that we heard about a pony that is for sale that sounds like it just<br/>\nmight fit the bill.  Of course, until we see it and ride it, we won&#39;t know<br/>\nfor sure.  I am waiting for a phone call so we can go see it.  I am so<br/>\nexcited.  This may not be THE pony and it may take some time to find just<br/>\nthe right horse or pony, but our dreams are on their way to becoming a<br/>\nreality.<br/>\n<br/>\n <br/>\n<br/>\nIsn&#39;t that exciting?<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\nAngela ~ Maine<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a><br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":3414,"nextTopicId":3416}}