{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: husband opposed to unschooling or homeschooling","postDate":"1306007112","msgId":46742,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlyOTRvOCtmc2o4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlyOHI4dCs5bW5lQGVHcm91cHMuY29tPg=="},"prevInTopic":46741,"nextInTopic":0,"prevInTime":46741,"nextInTime":46743,"topicId":46714,"numMessagesInTopic":0,"msgSnippet":"These are good points to consider, for sure. How one addresses this issue with a partner depends a lot on the relationship and the partner s past, too.","messageBody":"<div id=\"ygrps-yiv-1379914136\">These are good points to consider, for sure. How one addresses this issue with a partner depends a lot on the relationship and the partner&#39;s past, too. Dismissing a husband&#39;s concerns can lead to him being more resistant of unschooling and gentle parenting, rather than less. Dads often need reassurance that their kids are going to be okay, even though you want to do something that&#39;s waaaay out in left field. <br/>\n<br/>\nThere&#39;s a nice essay about bringing a dad into unschooling (written by a dad) here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://theparentingpit.com/unschooling/unauthorised-dad-handbook/\">http://theparentingpit.com/unschooling/unauthorised-dad-handbook/</a><br/>\n<br/>\nand a page of assorted articles by unschooling dads here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/dads\">http://sandradodd.com/dads</a><br/>\n<br/>\nIf you want to steer a dad in a particular direction (if he likes to read, for instance - many dads don&#39;t like to read about education or parenting) a good website is Joyce Fetteroll&#39;s:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n<br/>\nAnd if you&#39;re guy likes conspiracy theories and grand ideas about What&#39;s Wrong With the world (in this case, education) anything by John Gatto will likely appeal, although its all summed up nicely in this essay, &quot;The Seven Lesson Schoolteacher&quot;:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.informationliberation.com/?id=11375\">http://www.informationliberation.com/?id=11375</a><br/>\n<br/>\nI want to comment on a couple points in amy&#39;s reply:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; #3)Homeschoolers can absolutely play team sports.<br/>\n<br/>\n </span></blockquote>Maybe. It depends. You&#39;ll need to look into the actual local opportunities and it will depend both on the schools and the sports - and gender. In my area, homeschooled boys go to high-school if they want to play team sports, but girls have more options because of the attention paid to male vs female sports. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Ask your husband where he does more of his socializing: at work during the week or at home/when he&#39;s off work.  School is work.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nNot a great comparison, especially for men. Plenty of men socialize more at work than home - and that&#39;s part of the problem with dads accepting unschooling. Most of the social feedback they&#39;ll get about education and relationships with kids will be from coworkers. And at work, they&#39;ll get banal questions like &quot;so what are your kids doing these days?&quot; which may leave them floundering. <br/>\n<br/>\nIt&#39;s a good help for dads to give them answers they can use in the workplace, and one really great way to do that is by keeping a blog or making regular status updates on facebook. Help dad feel connected to the family *and* give him ways to answer those awkward questions. What are my kids doing? Well, actually I just saw on FB that they&#39;re building the Eifel Tower out of pillows in my living room and setting up a French restaurant. What about yours?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; #6)And what reason, exactly, would he give for it ever possibly being a bad thing to spend MORE time with a child?<br/>\n </span></blockquote>*******************<br/>\n<br/>\nThe reason to someone working out of the home is that all his coworkers will tell him that its unhealthy for his wife and son to be &quot;alone together&quot; all day long. Any women in the workplace will likely be vociferous on that front - he should do his wife and kid a favor and insist on school. The idea that parents and children should be separated early is normal and ubiquitous. It doesn&#39;t matter that its wrong ;) &quot;everyone knows&quot; its not good for women to waste away to brainlessness spending day in and out with (gasp) no-one but their own children (eye roll).<br/>\n<br/>\nSo giving dads plenty of happy stories of bright, busy days will go a long way to counteract those messages. Maybe his wife and kids are different, or maybe his co-workers are plain wrong - but if he doesn&#39;t Believe that on a gut level from the evidence of his eyes and ears, he&#39;s going to start countering any complaints from mom with &quot;see, This is why we need to put the kids in school.&quot; <br/>\n<br/>\nSome relationships are set up so that mom can say &quot;look, do you Trust Me?&quot; and have that as the trump card. But not every relationship works like that. Some moms have to really prove that they&#39;re capable of keeping it together and not ruining their children for dads to be okay with unschooling. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I would also remind him homeschooling is not a dead end result - plenty of people homeschool and then place back in public school, or vice versa.  changes can be made at any time <br/>\n </span></blockquote>*******************<br/>\n<br/>\nThat&#39;s really important. The &quot;lets try this for now&quot; reasoning can get you past doubt, give you a chance to show dad that unschooling isn&#39;t some crazy cult, but a great way to live with kids. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":418344390,"authorName":"littleangelfire81","from":"&quot;littleangelfire81&quot; &lt;angel365247@...&gt;","profile":"littleangelfire81","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: husband opposed to unschooling or homeschooling","postDate":"1305997405","msgId":46741,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlyOHI4dCs5bW5lQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlyNHFycitydWV0QGVHcm91cHMuY29tPg=="},"prevInTopic":46737,"nextInTopic":46742,"prevInTime":46740,"nextInTime":46742,"topicId":46714,"numMessagesInTopic":0,"msgSnippet":"Well, I would gather some info and calmly respond to each point he makes, b/c not a one of them holds water. #1) just because something is fine for one","messageBody":"<div id=\"ygrps-yiv-1741037270\">Well, I would gather some info and calmly respond to each point he makes, b/c not a one of them holds water.<br/>\n<br/>\n#1) just because something is fine for one generation doesn&#39;t mean it&#39;s forever fine forever after.  That can easily be turned back on him, as compulsory schooling is a modern thing - Benjamin Franklin and most our other &#39;great thinkers&#39; had little to no schooling, and that was the norm then and yet our literacy rate was higher.  Our literacy rate has steadily gone down via evidence from military capability exams.  Go here to read this book online or buy it or get it from a library: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.johntaylorgatto.com/chapters/index.htm\">http://www.johntaylorgatto.com/chapters/index.htm</a> It further explains how expecting 13 years of education is a very new thing.  So how come what was fine for his great grandparents isn&#39;t fine for his child, then?  If he&#39;s going to use that line of argument.  Also, when we know better we do better.  car seats weren&#39;t used in the 70s and many people survived that, and yet we use them now b/c we KNOW cars are the #1 killer of kids.<br/>\n<br/>\n#2)You can have good memories anywhere - an institutional schooling building is not required.  I have some good memories of school, too, but I promise you the bad memories far outweigh the good.<br/>\n<br/>\n#3)Homeschoolers can absolutely play team sports. Either by participating in homeschool specific leagues, or in some states/areas, by participating with the public school or lots of private schools will allow homeschooler participation.  There are opportunities out there.<br/>\n<br/>\n#4)College? School as it is certainly does not prepare the child for college- quite the opposite.  It prepares the child to be subservient, to do what he&#39;s told.  And in college there&#39;s usually a lot of &#39;you figure it out&#39; where in high school, they don&#39;t want the students taking any liberties, they are to be obedient or be in trouble.  This is evidenced by the fact that even our Air Force is now specifically, purposefully seeking homeschool graduates, &quot;While evaluating approximately 25 to 35 homeschooled students in the Air Force, Capt. Couch noticed that these students, as a trend, scored higher on the Armed Services Vocational Aptitude Battery (ASVAB) then most other applicants.&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hslda.org/hs/state/ok/200705170.asp\">http://www.hslda.org/hs/state/ok/200705170.asp</a> &quot;Over 74% of home educated adults 18-24 have have taken college-level courses compared to 46% of the general population.&quot;  71% of homeschooled people are active in community service versus 37% of the general US population.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hslda.org/research/ray2003/Beyond.asp\">http://www.hslda.org/research/ray2003/Beyond.asp</a>  This is likely because the homeschooling parent and child have a lot more time and opportunity to participate in the community during the typical school years and it creates a habit.<br/>\n<br/>\n#5)Be with friends and socialize.  Really ask your husband to think back.  How much socializing was actually allowed at school, really?  I know the thing I heard most often throughout my schooling was &quot;School is not for socializing!&quot; and then I&#39;d get in trouble for talking.  School is NOT for socializing.  Only recess and perhaps lunch are, and with only 20-30 minutes for each, that doesn&#39;t bode well for creating lasting relationships.  Contrast that to the homeschooler who, depending upon parent choices, can have true social opportunities every single day, if desired, b/c there&#39;s not the rigid 8-3 in a school building.  Academic work is finished much faster and there&#39;s a whole day to spend doing other things (which also, by the way, teach) and going on outings with other homescoolers.  The homeschooler also learns to &#39;be social&#39; with kids of all ages, rather than being artificially segregated by age/grade.  Ask your husband where he does more of his socializing: at work during the week or at home/when he&#39;s off work.  School is work.<br/>\n<br/>\n#6)And what reason, exactly, would he give for it ever possibly being a bad thing to spend MORE time with a child?  A child who will grow up and go his own way.  Who one day will not be right next to you to nurture and grow a relationship with.  How often has he ever heard a parent say, &quot;I wish I hadn&#39;t spent so much time with my child.&quot; No, what you always hear is the parent lamenting how they should&#39;ve spent more time with the child. Homeschooling allows for that. But also, just b/c he&#39;s home-schooled doesn&#39;t mean he stay at home all the time any more than being a stay at home mom means that you&#39;re always home, does it?  It&#39;s a misnomer.  Have think of it, rather, as non-institutional schooling. And when a child is allowed more freedom than being in a school where his every move is dictated provides, he actually develops much more independence.  Which means he won&#39;t be at your side every minute.  He will be off digging a whole in the backyard looking for worms. lol Or as my son did the other day, creating an elaborate bucket and pulley system to send things upstairs and downstairs without actually climbing the stairs.  It&#39;s not literally sitting on the couch staring at each other all day long. lol<br/>\n<br/>\nMe believing as I do, that school is truly a harmful place, I WOULD push this discussion, in a respectful way, of course, b/c I believe it&#39;s that important.  I would arm yourself with books, studies (HSLDA Is very useful for studies - last one in 2009, I believe, that showed how much better in general homeschoolers do on testing and community involvement and other stereotypical signs of &#39;success&#39; in this country).  I&#39;m not a testing fan, but it&#39;s a good place to start with many people.  Oh oh! Absolutely get John Taylor Gatto&#39;s book above, and even better, get his book &quot;Dumbing us Down&quot;.  It was eye opening for me, and I was already a homeschooler.  Imagine, an award winning school teacher. winning those awards for breaking the rules all the teachers are supposed to follow.  that&#39;s how he got results, got great results, from his students.<br/>\n<br/>\nall right.  I think I&#39;m done. lol How you approach this disagreement will depend upon how important it is to you.  I would also remind him homeschooling is not a dead end result - plenty of people homeschool and then place back in public school, or vice versa.  changes can be made at any time down the road if the both of you feel it is not working.  Trust me - the public school won&#39;t turn you away nor the money they get for having your child in attendance.<br/>\n<br/>\nAmy</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: husband opposed to unschooling or homeschooling","postDate":"1305985577","msgId":46737,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlyOGZuOStodHJqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlyNHFycitydWV0QGVHcm91cHMuY29tPg=="},"prevInTopic":46716,"nextInTopic":46741,"prevInTime":46736,"nextInTime":46738,"topicId":46714,"numMessagesInTopic":0,"msgSnippet":"Your son may well be happy as a clam in school. Being unhappy at 3 or 4 doesn t mean he won t have a good time at 6. And an unhappy DH will not make for a good","messageBody":"<div id=\"ygrps-yiv-1269010613\">Your son may well be happy as a clam in school. Being unhappy at 3 or 4 doesn&#39;t mean he won&#39;t have a good time at 6. And an unhappy DH will not make for a good homeschooling experience. We have a mixture of choices going on in our home now -- unschooling teen, charter high schooling and public school pre-K -- all except for the unschooling were somebody else&#39;s choice. But if you can be positive about both the home part of the day and the school part, if that&#39;s where things go, it can work. <br/>\n<br/>\nIn the meantime, enjoy your days with your son. A year or two of happy unschooling is something to treasure. <br/>\n<br/>\nAnd who knows? You may try school and, even with the best of intentions about making it work, find that it doesn&#39;t stack up to being at home. <br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;renae3698&quot; &lt;renae3698@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi All,<br/>\n&gt; I&#39;ve been lurking here for around 3 mos. or so, and have talked to my husband about many of the things I&#39;ve learned about unschooling.  We took our 4 1/2 yr. old son, D, out of preschool at his request back in Jan.  He had been there for 1 1/2 years.  D has been happy staying at home with me.  I would like to continue this.  My hubby says he is OK with D staying home next year, as it would be his pre K year since he misses the cut off for Kindergarten, but he does not want to do it long term.  He wants him to go to school, either public or private.  He feels that school was fine for he and I, that he has some good memories of school, he wants our son to be able to play team sports if he chooses, be prepared for college, be with friends every day and socialize, that it would not be good for any two people (D and I) to spend that much time together, etc.  I have tried to respond to these concerns with some of the insight I&#39;ve gleaned from this list.  Any other advice would be greatly appreciated.  thanks!<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] husband opposed to unschooling or homeschooling","postDate":"1305884546","msgId":46716,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5ODI2LjQ5MDg0LnFtQHdlYjg3MzAzLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":46714,"nextInTopic":46737,"prevInTime":46715,"nextInTime":46717,"topicId":46714,"numMessagesInTopic":0,"msgSnippet":"You ve got a year. Enjoy that year. Make it good and fabulous and exciting and engaging. Set up a blog with lots of pictures. Help your husband to feel part of","messageBody":"<div id=\"ygrps-yiv-2079236411\">You&#39;ve got a year. Enjoy that year. Make it good and fabulous and exciting and <br/>\nengaging. Set up a blog with lots of pictures. Help your husband to feel part of <br/>\nthe process, to see what is going on. Don&#39;t worry too much about it now. Just <br/>\nhave a fabulous year. See if you can find a community of people where you live <br/>\nto become involved with, potential friends for your son, events to go and do and <br/>\ntake lots of pictures to share with your husband.  <br/>\n<br/>\n<br/>\nAnd you can seed little ideas around. Not in a spying, manipulative, going to <br/>\nchange his mind way. But in a way to help him maybe understand what you are <br/>\nhoping for his and your son. Get Sandra Dodd&#39;s books and put them in the <br/>\nbathroom, and Rue Kream&#39;s. Print out articles from joyfullyrejoycing.com and <br/>\nleave them where he may find them, or suggest them to him. But in gentle <br/>\nmoments, not necessarily with the goal of changing his mind, but to help him to <br/>\nmaybe understand more of why the idea appeals to you. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: renae3698 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:renae3698@...\">renae3698@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Friday, 20 May, 2011 5:31:55<br/>\nSubject: [unschoolingbasics] husband opposed to unschooling or homeschooling<br/>\n<br/>\nHi All,<br/>\nI&#39;ve been lurking here for around 3 mos. or so, and have talked to my husband <br/>\nabout many of the things I&#39;ve learned about unschooling.  We took our 4 1/2 yr. <br/>\nold son, D, out of preschool at his request back in Jan.  He had been there for <br/>\n1 1/2 years.  D has been happy staying at home with me.  I would like to <br/>\ncontinue this.  My hubby says he is OK with D staying home next year, as it <br/>\nwould be his pre K year since he misses the cut off for Kindergarten, but he <br/>\ndoes not want to do it long term.  He wants him to go to school, either public <br/>\nor private.  He feels that school was fine for he and I, that he has some good <br/>\nmemories of school, he wants our son to be able to play team sports if he <br/>\nchooses, be prepared for college, be with friends every day and socialize, that <br/>\nit would not be good for any two people (D and I) to spend that much time <br/>\ntogether, etc.  I have tried to respond to these concerns with some of the <br/>\ninsight I&#39;ve gleaned from this list.  Any other advice would be greatly <br/>\nappreciated.  thanks!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":354026485,"authorName":"renae3698","from":"&quot;renae3698&quot; &lt;renae3698@...&gt;","profile":"renae3698","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"husband opposed to unschooling or homeschooling","postDate":"1305865915","msgId":46714,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlyNHFycitydWV0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":46716,"prevInTime":46713,"nextInTime":46715,"topicId":46714,"numMessagesInTopic":0,"msgSnippet":"Hi All, I ve been lurking here for around 3 mos. or so, and have talked to my husband about many of the things I ve learned about unschooling.  We took our 4","messageBody":"<div id=\"ygrps-yiv-464489363\">Hi All,<br/>\nI&#39;ve been lurking here for around 3 mos. or so, and have talked to my husband about many of the things I&#39;ve learned about unschooling.  We took our 4 1/2 yr. old son, D, out of preschool at his request back in Jan.  He had been there for 1 1/2 years.  D has been happy staying at home with me.  I would like to continue this.  My hubby says he is OK with D staying home next year, as it would be his pre K year since he misses the cut off for Kindergarten, but he does not want to do it long term.  He wants him to go to school, either public or private.  He feels that school was fine for he and I, that he has some good memories of school, he wants our son to be able to play team sports if he chooses, be prepared for college, be with friends every day and socialize, that it would not be good for any two people (D and I) to spend that much time together, etc.  I have tried to respond to these concerns with some of the insight I&#39;ve gleaned from this list.  Any other advice would be greatly appreciated.  thanks!</div>","specialLinks":[]}],"prevTopicId":46734,"nextTopicId":46711}}