{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":223344266,"authorName":"Christy Putnam","from":"&quot;Christy Putnam&quot; &lt;personal_balance@...&gt;","profile":"personal_balance","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Article about Personal and Professional Development","postDate":"1140541315","msgId":10077,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDEwMWM2MzcwOCQ4NTM1ODBlMCQ2NDAxYThjMEB0aWJlcml1bT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":10076,"nextInTime":10078,"topicId":10077,"numMessagesInTopic":0,"msgSnippet":"I came across this article and as I read it, I was thinking this is what unschooling is like.  I am going to send it to my dh.  Then I thought, well if this","messageBody":"<div id=\"ygrps-yiv-2109213174\">I came across this article and as I read it, I was thinking this is what<br/>\nunschooling is like.  I am going to send it to my dh.  Then I thought, well<br/>\nif this will help my dh understand a bit better, maybe it will help other<br/>\npeople.  I have added my comments in [brackets] to show how I relate this to<br/>\nunschooling ... pretty much I just kept relating what our kids do is the<br/>\nsame as what adults do.  So I share it with you.  let me know your comments.<br/>\n <br/>\n<br/>\n----------------------------------------------------<br/>\n<br/>\n*** Article: Personal and Professional Development -- What&#39;s the Difference?<br/>\n- By Kevin Eikenberry ***<br/>\n<br/>\n----------------------------------------------------<br/>\n<br/>\nWhen people ask me about my business, I tell them I&#39;m in the learning<br/>\nbusiness -- that we help organizations, teams and individuals reach their<br/>\npotential through learning. This is a fine statement and it does describe<br/>\nthe breadth of what we do, but it often leads to the follow-up question<br/>\nlike... &quot;Do you do personal development stuff or just business skills<br/>\ntraining?&quot;<br/>\n<br/>\nMy answer is yes. Because I don&#39;t believe there is a significant difference<br/>\nbetween personal development and professional development. Why do I say<br/>\nthat?<br/>\n<br/>\nThe Reasons Why:<br/>\n<br/>\nSince my opinion might differ from yours, or perhaps you&#39;ve never thought<br/>\nabout this, it makes sense to explain myself. There are at least five major<br/>\nreasons why I think personal [or parenting] and professional development are<br/>\nthe same thing. Learning is Learning. We were granted an amazing potential<br/>\nfor learning at birth. Most of us haven&#39;t used very much of that potential.<br/>\nIt&#39;s like we are mowing our lawn with a jet engine. Sure the jet engine has<br/>\nenough horsepower to turn the blade, but it has virtually unlimited<br/>\npotential that isn&#39;t being used. When we are learning we are increasing our<br/>\ncapacity to learn more because we are flexing and exercising our &quot;learning<br/>\nmuscles.&quot; In other words, whenever we are learning we are increasing our<br/>\ncapacity to learn even more.<br/>\n<br/>\nAll Experience Counts. <br/>\n<br/>\nOne of the powerful ways that we learn is by connecting new learning to what<br/>\nwe already know. As we continue to build our knowledge and experiences, it<br/>\nallows us to make new connections faster. In other words, the more we learn,<br/>\nthe more successful we will be at learning new things, and in most<br/>\nsituations more quickly with deeper understanding.<br/>\n<br/>\nWe&#39;re a Whole Package. <br/>\n<br/>\nIt isn&#39;t like we go to work and don&#39;t use anything we know from our personal<br/>\nlife to be more effective professionally. And while we may not need to know<br/>\nhow to repair rotating drum equipment at home--those skills might help you<br/>\ndiagnose the problem with your washing machine. And even though you don&#39;t<br/>\nhave to back up the system database at home, you might be able to deal with<br/>\nyour home PC better because of what you learned at work. And while you hope<br/>\nyou&#39;ll never need to follow the new Customer Service procedure at home, that<br/>\nprocedure might teach you something when following a process, or be more<br/>\nunderstanding when you are the customer [or child].<br/>\n<br/>\nThe bottom line is that we are complete humans [children are human too], and<br/>\nas such we take our entire work knowledge home and bring all of our personal<br/>\nknowledge and experience to work. So any form of growth or development will<br/>\nbenefit you both personally and professionally.<br/>\n<br/>\nThe Most Important Skills are Always the Most Important. <br/>\n<br/>\nWhere does being a better listener help you--at home or at work? Both, of<br/>\ncourse. When you learn how to coach more effectively at work, does it make<br/>\nyou a better parent? It sure can! We could make a long list of these<br/>\nvaluable skills, from communication to dealing with conflict, to learning<br/>\nhow to learn, to giving better feedback to being more creative... you get<br/>\nthe idea (and have probably thought of five other examples yourself by now).<br/>\nThere are many skills that we might learn as &quot;self improvement&quot; that will<br/>\nhelp us at work, and vice versa. So why label it one or the other?<br/>\n<br/>\nSerendipity Rules. <br/>\n<br/>\nBecause our learning grows based on connections, you never know when<br/>\nsomething you learned on the Discovery Channel might give you an &#39;a-ha&#39; at<br/>\nwork, or that the insight shared by the seminar leader at work helps you<br/>\nsolve a vexing problem at home. Again, all development, all learning, all<br/>\ngrowth helps us in all parts of our lives. But wait. Does all of this mean<br/>\nthat as I become a better knitter or bowler, I&#39;ll be more productive and<br/>\nsuccessful at work? Yes, for the reasons I described above (and some others<br/>\ntoo).<br/>\n<br/>\nThat doesn&#39;t mean that your organization should send everyone to knitting<br/>\nclass or bowling lessons, but it does mean that there is substantial merit<br/>\nin supporting any form of learning regardless of the content. In the end, my<br/>\ngoal is to help you view all skills more broadly in their<br/>\napplication--instead of classifying some things as &quot;personal development&quot;<br/>\n[important/relevant] and therefore they don&#39;t matter at work [or at all].<br/>\n<br/>\nLearning is learning. Personal development is professional development. When<br/>\nyou stop worrying about the distinctions, but rather think about the<br/>\napplications, you serve yourself and others [your children] much better.<br/>\n<br/>\nAbout the Author:<br/>\n<br/>\nKevin Eikenberry is a leadership expert and the Chief Potential Officer of<br/>\nThe Kevin Eikenberry Group -  &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://kevineikenberry.com/\">http://kevineikenberry.com/</a>&gt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://KevinEikenberry.com\">http://KevinEikenberry.com</a> - a learning consulting company. To receive a<br/>\nfree Special Report on leadership that includes resources, ideas, and advice<br/>\ngo to  &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.kevineikenberry.com/leadership.asp\">http://www.kevineikenberry.com/leadership.asp</a>&gt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.kevineikenberry.com/leadership.asp\">http://www.kevineikenberry.com/leadership.asp</a> or call us at (317) 387-1424<br/>\nor 888.LEARNER.<br/>\n<br/>\nIn Gratitude,<br/>\n<br/>\nChristy Putnam<br/>\nUnschooling Mom to Aden (1) and Seth (11)<br/>\nLoving wife of Chet (ann. 7/4/04)<br/>\n<br/>\n &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://blog.myspace.com/personal_balance\">http://blog.myspace.com/personal_balance</a>&gt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://blog.myspace.com/personal_balance\">http://blog.myspace.com/personal_balance</a><br/>\n<br/>\n&quot;Go confidently in the direction of your<br/>\ndreams. Live the life you have always<br/>\nimagined.&quot; - Henry David Thoreau<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":9970,"nextTopicId":5332}}