{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":140885507,"authorName":"Kathleen Gehrke","from":"&quot;Kathleen Gehrke&quot; &lt;gehrkes@...&gt;","profile":"gehrkes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: teen issue","postDate":"1182950669","msgId":24722,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1dG9lZCtpZTQ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA2MjUyMDA3MTcyOC4yNDgxOS40NjdGRkI0RjAwMDQwMjczMDAwMDYwRjMyMjAwNzYxMDY0OUIwRTA1MDE5RDA3MEVAY29tY2FzdC5uZXQ+"},"prevInTopic":24716,"nextInTopic":0,"prevInTime":24721,"nextInTime":24723,"topicId":24693,"numMessagesInTopic":0,"msgSnippet":"... lakes. I have said yes to my daughter and her best friend (who is schooled and whose divorced parents dont trust her) going up there alone to hang out as","messageBody":"<div id=\"ygrps-yiv-668057715\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, airokat@... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; We have a nice vacation cabin up near Tahoe, near a couple of <br/>\n </span></blockquote>lakes. I have said yes to my daughter and her best friend (who is <br/>\nschooled and whose divorced parents dont trust her) going up there <br/>\nalone to hang out as long as they leave the place clean and dont get <br/>\ninto any kind of trouble or invite lots of people I do not know <br/>\nover.  I have known her best friend since she was a little girl. <br/>\n<blockquote><span title=\"ireply\"> &gt; Recently, she went to visit a friend who moved away, and now wants <br/>\n </span></blockquote>to invite this girl, another girl I dont know but have heard about <br/>\nand this girls boyfriend, up to the cabin for a few days to one <br/>\nweek. I dont really trust the former friend, because I know her and <br/>\nshe has a history of  getting into trouble, getting out of hand <br/>\nrowdy, and lying about things. These kids are all in school and from <br/>\nwhat I hear, are involved in alot of partying. I am reticent to have <br/>\nminors I am legally liable for up in my cabin, because if anything <br/>\nhappens I am legally responsible. I do not know two of these kids at <br/>\nall, and I cannot accompany them up there because I have to work. My <br/>\ndaughter says I do not trust her judgment and we got in a huge fight <br/>\nover it last night. I told her I have no problem with her and Carley <br/>\ngoing up, but these other kids are a wild card to me, and I dont <br/>\nwant things to get out of hand. My husband says NO WAY are we <br/>\nallowing our place to be used as a party hangout for teena<br/>\n<blockquote><span title=\"ireply\"> &gt; geres we suspect are involved in drugs and alcohol, based on what <br/>\n </span></blockquote>we have heard from other sources. <br/>\n<br/>\nWhat can you work out that would work for both of you? Can you go to <br/>\nthe cabin and stay also? Maybe stating to your dd that staying with <br/>\nher one girlfriend would be great, as you already agreed, but if <br/>\nthere are going to be kids you do not know there you would feel <br/>\nbetter just being in the building. You do not need to be part of <br/>\ntheir  weekend just hanging out having your own weekend. <br/>\n<br/>\nThose who are looking for a free party would be far more hesitant to <br/>\ncome if they know you&#39;ll be home. <br/>\n<br/>\nAlso letting dd know it is not lack of trust in her, but caution <br/>\nover these unknown kids. Talk to her about the power struggle <br/>\nbetween most schooled kids and their parents. The need to rebel <br/>\nagainst that authority and even though these are not the issues she <br/>\nfaces this rebellion often leads to very risky behavior for kids.<br/>\n<br/>\nIf you share your concerns your daughter may come up with an even <br/>\nbetter plan that would make all of you comfortable.<br/>\n<br/>\n<br/>\n<br/>\nI agree with Cameron that honoring our own selves is a great way to <br/>\nshow respect. You are not trying to thwart your daughter, but <br/>\nsupport her in the best way possible.<br/>\n<br/>\n<br/>\n<br/>\nKathleen</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: teen issue","postDate":"1182875121","msgId":24716,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1cmVsaCtlZ2JnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA2MjUyMDA3MTcyOC4yNDgxOS40NjdGRkI0RjAwMDQwMjczMDAwMDYwRjMyMjAwNzYxMDY0OUIwRTA1MDE5RDA3MEVAY29tY2FzdC5uZXQ+"},"prevInTopic":24700,"nextInTopic":24722,"prevInTime":24715,"nextInTime":24717,"topicId":24693,"numMessagesInTopic":0,"msgSnippet":"... dd, I wonder how to balance trying to maintain a united front with my husband, who has different perspectives than I have, and give my daughter what she","messageBody":"<div id=\"ygrps-yiv-1327755249\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, airokat@... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I initially said No also, but after this big blowout I had with my <br/>\n </span></blockquote>dd, I wonder how to balance trying to maintain a united front with <br/>\nmy husband, who has different perspectives than I have, and give my <br/>\ndaughter what she wants. I really am opposed to having these kids up <br/>\nthere, so how do I deal with my feelings as well?<br/>\n*********************<br/>\n<br/>\nI think its important to separate your own feelings from the &quot;united <br/>\nfront&quot; thing. That&#39;s a concept that comes out of rule-based <br/>\nparenting and doesn&#39;t necessarily help when looking for options and <br/>\nsolutions.<br/>\n<br/>\nThat being said, unschooling isn&#39;t about giving kids whatever they <br/>\nwant whenever they want, either. It is about communication and <br/>\ncreative problem-solving, though, so its important that you try to <br/>\nwork toward a mutually satisfactory solution with your dd *and* dh. <br/>\n<br/>\n***************<br/>\n<blockquote><span title=\"ireply\"> &gt; We have a nice vacation cabin up near Tahoe, near a couple of <br/>\n </span></blockquote>lakes. I have said yes to my daughter and her best friend (who is <br/>\nschooled and whose divorced parents dont trust her) going up there <br/>\nalone to hang out as long as they leave the place clean and dont get <br/>\ninto any kind of trouble or invite lots of people I do not know <br/>\nover.  I have known her best friend since she was a little girl. <br/>\n*****************<br/>\n<br/>\nSomething that&#39;s not clear to me, reading this - have they actually <br/>\ngone and done this, yet, or have you said &quot;yes&quot; but now the <br/>\nsituation has changed? If they&#39;ve been doing this, how has it been <br/>\nworking out?<br/>\n<br/>\n*****************<br/>\nI do not know two of these kids at all, and I cannot accompany them <br/>\nup there because I have to work. <br/>\n******************<br/>\n<br/>\nMore clarification... you can&#39;t *ever* go because you have to work? <br/>\nOr are we talking about a specific trip? If its the former, I&#39;d look <br/>\ninto doing some schedule rearranging so that you can go with her now <br/>\nand again. If we&#39;re talking about one specific trip, I&#39;d say its <br/>\nimportant to emphasize that, while you are happy to facilitate a <br/>\nparty or event, its just not possible *now* due to work. Can they <br/>\nall come hang out at your house and have a movie-marathon or <br/>\nsomething, instead?<br/>\n<br/>\nAnother thought is - what kind of experience does your dd have with <br/>\nhigh-school parties? Does she have enough to know what kinds of <br/>\nbehavior to expect and be able to troubleshoot and deal with <br/>\npotential consequences? When my brother was 17 my parents went out <br/>\nof town for a long weekend with the understanding that he&#39;d be <br/>\nthrowing a party. They opted for &quot;don&#39;t ask, don&#39;t tell&quot; but they <br/>\nalso trusted my bro&#39; to be on top of things. He was. But he&#39;d been <br/>\nto plenty of rowdy parties by then and knew what to expect. He <br/>\ndidn&#39;t have an attitude of &quot;it will be fine, no one will drink&quot; but <br/>\nof &quot;I&#39;ll make sure no-one drives drunk, clean up the mess and pay <br/>\nfor any damages.&quot; Since they didn&#39;t ask, he didn&#39;t actually say that <br/>\nto *them* but it was an implied part of the deal. He was to be <br/>\nResponsible. <br/>\n<br/>\nSo maybe talk to your dd from that perspective - its not reasonable <br/>\nto expect a group of teens to go to a summer cabin and not bring <br/>\nbooze. What kinds of plans does she have for managing that <br/>\nsituation? After all, as the hostess, she&#39;d be the one responsible <br/>\nfor *all* of them. Is that a responsibility she *wants*?<br/>\n<br/>\n---Meredith (Mo 5.5, Ray 13)</div>","specialLinks":[]},{"userId":314581412,"authorName":"infreondscipe","from":"&quot;infreondscipe&quot; &lt;infreondscipe@...&gt;","profile":"infreondscipe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: teen issue","postDate":"1182812123","msgId":24700,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1cGg0cit2cmdAZUdyb3Vwcy5jb20+","inReplyToHeader":"PGMyMy4xYjRhYTQ4NS4zM2IxNzg3M0Bhb2wuY29tPg=="},"prevInTopic":24698,"nextInTopic":24716,"prevInTime":24699,"nextInTime":24701,"topicId":24693,"numMessagesInTopic":0,"msgSnippet":"We have a nice vacation cabin up near Tahoe, near a couple of lakes Well let me first say I just really hope all okay up there with the Eldorado fires. and","messageBody":"<div id=\"ygrps-yiv-1791160735\">&quot;We have a nice vacation cabin up near Tahoe, near a couple of lakes&quot;<br/>\n<br/>\nWell let me first say I just really hope all okay up there with the <br/>\nEldorado fires.<br/>\n<br/>\n&quot;and now wants to invite this girl, another girl I don&#39;t know&quot;<br/>\n<br/>\nI know it&#39;s disappointing for your dd, perhaps explain the truth of <br/>\nis that you DO trust her judgment? The &quot;no&quot; is a consequence of her <br/>\nchoices in invitees is all. Maybe she can make a different choice <br/>\nthat would be agreeable to all of you.<br/>\n<br/>\nJust a personal anecdote - My dh is from Tahoe and I&#39;m from No. Nv.  <br/>\nMy family had a cabin/home at Donner all the time I was growing up.  <br/>\nI was allowed to summer from about 15 on provided I had a driving age <br/>\nfriend to summer with me.  Once I was 16 I could live there anytime.  <br/>\nMy folks would often come up on weekends and when they were there I <br/>\ncould have any friends I wanted up.  It was just the best time in my <br/>\nyoung life. I regret that I do not have such a thing to share with my <br/>\nteenage son so if there is any way to honor your dh and work out a <br/>\ncompromise I think it would be such a special time for your dd.<br/>\n<br/>\nVery best of luck to you,<br/>\nChris</div>","specialLinks":[]},{"userId":58132404,"authorName":"MarSi77@aol.com","from":"MarSi77@...","profile":"m6hschch","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: teen issue","postDate":"1182801523","msgId":24698,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMyMy4xYjRhYTQ4NS4zM2IxNzg3M0Bhb2wuY29tPg=="},"prevInTopic":24697,"nextInTopic":24700,"prevInTime":24697,"nextInTime":24699,"topicId":24693,"numMessagesInTopic":0,"msgSnippet":"I ve had first hand experience over the years with my kids just wanting to have a few kids for a *gathering* ....but then word gets around ( especially if no","messageBody":"<div id=\"ygrps-yiv-1052597473\">I&#39;ve had first hand experience over the years with my kids just wanting to <br/>\nhave a few kids for a *gathering* ....but then word gets around ( especially if <br/>\nno adult will be present) and it turns into something the child never even <br/>\n*wanted* in the first place....and something potentially *unsafe*.<br/>\n <br/>\nIn my opinion, saying yes to your daughter about most things in life is <br/>\nfine...but *safety* has to be considered also.<br/>\n <br/>\n~marcia in MA<br/>\n <br/>\n <br/>\nIn a message dated 6/25/2007 2:02:18 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:airokat@...\">airokat@...</a> writes:<br/>\n<br/>\n <br/>\n <br/>\n <br/>\nI am not sure how to deal with this current situation. My daughter is almost <br/>\n15 and has been unschooling for one year. Her Dad is onboard with the <br/>\nunschooling, (in terms of her not being in school or following a formal curriculum) <br/>\nbut not really the unschooling parenting aspects of it, and with not saying no <br/>\nto anything. I have been practicing mindful parenting with her myself, <br/>\n(constantly working on it, and this list has helped me) and my relationship with her <br/>\nhas improved, but he is not onboard with that, (he thinks I am too permissive <br/>\nwith her) and with this current situation, he is a definate NO all around. <br/>\n<br/>\nWe have a nice vacation cabin up near Tahoe, near a couple of lakes. I have <br/>\nsaid yes to my daughter and her best friend (who is schooled and whose divorced <br/>\nparents dont trust her) going up there alone to hang out as long as they <br/>\nleave the place clean and dont get into any kind of trouble or invite lots of <br/>\npeople I do not know over. I have known her best friend since she was a little <br/>\ngirl. <br/>\nRecently, she went to visit a friend who moved away, and now wants to invite <br/>\nthis girl, another girl I dont know but have heard about and this girls <br/>\nboyfriend, up to the cabin for a few days to one week. I dont really trust the <br/>\nformer friend, because I know her and she has a history of getting into trouble, <br/>\ngetting out of hand rowdy, and lying about things. These kids are all in school <br/>\nand from what I hear, are involved in alot of partying. I am reticent to have <br/>\nminors I am legally liable for up in my cabin, because if anything happens I <br/>\nam legally responsible. I do not know two of these kids at all, and I cannot <br/>\naccompany them up there because I have to work. My daughter says I do not trust <br/>\nher judgment and we got in a huge fight over it last night. I told her I have <br/>\nno problem with her and Carley going up, but these other kids are a wild card <br/>\nto me, and I dont want things to get out of hand. My husband says NO WAY are <br/>\nwe allowing our place to be used as a party hangout for teena<br/>\ngeres we suspect are involved in drugs and alcohol, based on what we have <br/>\nheard from other sources. We built this cabin mainly for investment purposes, and <br/>\nhave every motiviation to keep it in top condition, as we plan to sell it <br/>\nsoon. I initially said No also, but after this big blowout I had with my dd, I <br/>\nwonder how to balance trying to maintain a united front with my husband, who has <br/>\ndifferent perspectives than I have, and give my daughter what she wants. I <br/>\nreally am opposed to having these kids up there, so how do I deal with my <br/>\nfeelings as well? Incidentally, my daughter knows one of these girls pretty well <br/>\n(the former friend) but the other girl she knows only peripherally, and she just <br/>\nmet the boyfriend. <br/>\nAny input appreciated. I may not be able to respond, (time constraints) but I <br/>\nwill read every response.<br/>\nKathryn<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n************************************** See what&#39;s free at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com\">http://www.aol.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":299286442,"authorName":"Cameron Parham","from":"Cameron Parham &lt;acsp2205@...&gt;","profile":"acsp2205","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] teen issue","postDate":"1182799902","msgId":24697,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5OTgzNi40NTYzLnFtQHdlYjU5MjAzLm1haWwucmUxLnlhaG9vLmNvbT4="},"prevInTopic":24693,"nextInTopic":24698,"prevInTime":24696,"nextInTime":24698,"topicId":24693,"numMessagesInTopic":0,"msgSnippet":"My daughter says I do not trust her judgement   One of the things about this is...Do you have a right to your own feelings, and to take care of your own","messageBody":"<div id=\"ygrps-yiv-468893093\">&quot;My daughter says I do not trust her judgement&quot;   One of the things about this is...Do you have a right to your own feelings, and to take care of your own things?  Does your dd have to share every one of her possessions, no matter whether she trusts the person who would use it or not?  Do you have the right to model taking care of your own posessions, especially one that is very expensive and that you plan to sell?  I have only been unschooling sinve March of this year and I realize that I have a lot to learn.  But surely we as parents should still model honoring our own feelings and values, too.  Still I know how bad I feel when my 13 yo ds says that I am showing a lack of trust in him!  I wish that they could understand that we trust in their hearts and good intentions but also know that they are inexperienced.      <br/>\nCameron<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":153118561,"authorName":"airokat@comcast.net","from":"airokat@...","profile":"dawakat2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"teen issue","postDate":"1182792527","msgId":24693,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2MjUyMDA3MTcyOC4yNDgxOS40NjdGRkI0RjAwMDQwMjczMDAwMDYwRjMyMjAwNzYxMDY0OUIwRTA1MDE5RDA3MEVAY29tY2FzdC5uZXQ+"},"prevInTopic":0,"nextInTopic":24697,"prevInTime":24692,"nextInTime":24694,"topicId":24693,"numMessagesInTopic":0,"msgSnippet":"I am not sure how to deal with this current situation. My daughter is almost 15 and has been unschooling for one year. Her Dad is onboard with the unschooling,","messageBody":"<div id=\"ygrps-yiv-1780623825\">I am not sure how to deal with this current situation. My daughter is almost 15 and has been unschooling for one year. Her Dad is onboard with the unschooling, (in terms of her not being in school or following a formal curriculum) but not really the unschooling parenting aspects of it, and with not saying no to anything. I have been practicing mindful parenting with her myself, (constantly working on it, and this list has helped me) and my relationship with her has improved, but he is not onboard with that, (he thinks I am too permissive with her) and with this current situation, he is a definate NO all around. <br/>\n<br/>\nWe have a nice vacation cabin up near Tahoe, near a couple of lakes. I have said yes to my daughter and her best friend (who is schooled and whose divorced parents dont trust her) going up there alone to hang out as long as they leave the place clean and dont get into any kind of trouble or invite lots of people I do not know over.  I have known her best friend since she was a little girl. <br/>\nRecently, she went to visit a friend who moved away, and now wants to invite this girl, another girl I dont know but have heard about and this girls boyfriend, up to the cabin for a few days to one week. I dont really trust the former friend, because I know her and she has a history of  getting into trouble, getting out of hand rowdy, and lying about things. These kids are all in school and from what I hear, are involved in alot of partying. I am reticent to have minors I am legally liable for up in my cabin, because if anything happens I am legally responsible. I do not know two of these kids at all, and I cannot accompany them up there because I have to work. My daughter says I do not trust her judgment and we got in a huge fight over it last night. I told her I have no problem with her and Carley going up, but these other kids are a wild card to me, and I dont want things to get out of hand. My husband says NO WAY are we allowing our place to be used as a party hangout for teena<br/>\ngeres we suspect are involved in drugs and alcohol, based on what we have heard from other sources. We built this cabin mainly for investment purposes, and have every motiviation to keep it in top condition, as we plan to sell it soon. I initially said No also, but after this big blowout I had with my dd, I wonder how to balance trying to maintain a united front with my husband, who has different perspectives than I have, and give my daughter what she wants. I really am opposed to having these kids up there, so how do I deal with my feelings as well?  Incidentally, my daughter knows one of these girls pretty well (the former friend) but the other girl she knows only peripherally, and she just met the boyfriend. <br/>\nAny input appreciated. I may not be able to respond, (time constraints) but I will read every response.<br/>\nKathryn</div>","specialLinks":[]}],"prevTopicId":24628,"nextTopicId":24725}}