{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":121012450,"authorName":"Myra","from":"&quot;Myra&quot; &lt;johntesson@...&gt;","profile":"johntesson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Nudity/washing hands","postDate":"1184524008","msgId":24982,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3ZG90OCtodjFwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ5MTYwNC40NTE4Ni5xbUB3ZWI1ODgwMi5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":24976,"nextInTopic":0,"prevInTime":24981,"nextInTime":24983,"topicId":24918,"numMessagesInTopic":0,"msgSnippet":"Hi - When my boys were younger, I d buy a bunch of really oversized t-shirts for them to wear.  I mean, they d hang down to their knees!  I d get all sorts of","messageBody":"<div id=\"ygrps-yiv-448499485\">Hi -<br/>\nWhen my boys were younger, I&#39;d buy a bunch of really oversized t-shirts <br/>\nfor them to wear.  I mean, they&#39;d hang down to their knees!  I&#39;d get <br/>\nall sorts of colors and cute pictures on the front esp. at tourist-y <br/>\nspots when we were on vacation.  I&#39;d have them wear those to bed and <br/>\nwhen they got up in the morning if they didn&#39;t want to get dressed then <br/>\nthey were ready to go with the big shirts on!  I didn&#39;t care what was <br/>\non underneath as far as underwear went because no one could see if it <br/>\nwas a diaper or pull-up or underwear or nothing! <br/>\n<br/>\nAnd as far as germs go.....I&#39;m pretty lenient except when we&#39;re around <br/>\nother kids or out in public.  I guess I figure our germs were okay, but <br/>\nothers could get us sick!  I always have on hand some nice smelling <br/>\nhand santitizer gel for those times.  (Here in the U.S. - Body and Bath <br/>\nat the malls have all worts of scents and colors that my kids love - <br/>\nworth the extra bit of cost as they like using them - no fussing!)<br/>\n<br/>\nMyra</div>","specialLinks":[]},{"userId":309000316,"authorName":"oum rayan","from":"oum rayan &lt;roozoomom@...&gt;","profile":"roozoomom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Nudity/washing hands","postDate":"1184385825","msgId":24976,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5MTYwNC40NTE4Ni5xbUB3ZWI1ODgwMi5tYWlsLnJlMS55YWhvby5jb20+","inReplyToHeader":"PEEzOEM5RjkyLTcxRDUtNDhGQi05MjE3LTU0RkQ0NjYzRUNBRUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":24926,"nextInTopic":24982,"prevInTime":24975,"nextInTime":24977,"topicId":24918,"numMessagesInTopic":0,"msgSnippet":"Hi Kendrah, My 4yo recently asked why he has to wear clothes before going in the front yard, and I was uncomfortable having to explain why...the best I could","messageBody":"<div id=\"ygrps-yiv-582161354\">Hi Kendrah,<br/>\n   My 4yo recently asked why he has to wear clothes before going in the front yard, and I was uncomfortable having to explain why...the best I could do is say, &quot;because people don&#39;t like to see other people naked!&quot; BAH! I botched it, I know, but I, too, don&#39;t want to make him feel that something&#39;s wrong with HIS body. I&#39;ll be glad to hear other&#39;s perspectives on this subject, too.<br/>\n  As for handwashing, I&#39;m a handwashing fool. I do insist that my son wash his hands before meal prep, but I&#39;ve let go of the chasing him with hand sanitizing gel everytime he picks his nose! I&#39;ve gotten to where I base my handwashing requests on his activity. Playing with/feeding the dog=handwashing. Toileting=handwashing. Playing with his baby brother=pre-handwashing (because he always wants to put his finger in his mouth!) <br/>\n  Otherwise, I let it go, and figure a little bit of bacteria is what keeps his immune system in-check.<br/>\n  <br/>\n<br/>\nKendrah Nilsestuen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:carebear-79@...\">carebear-79@...</a>&gt; wrote:<br/>\n          Hi all,<br/>\n<br/>\nI have two questions here that I&#39;m looking for advice and perspective <br/>\non.<br/>\n<br/>\nNudity- How do you guys explain having to wear clothes in public <br/>\n(like at the a store) to your kiddos? I don&#39;t want her (haven&#39;t had <br/>\nto worry about it with my son yet) to be ashamed of her naked body, <br/>\nand by telling her to wear clothes I feel like I&#39;m saying something <br/>\nis wrong with you, so cover it up. I usually have said something like <br/>\n&quot;For some reason some people aren&#39;t comfortable seeing other people <br/>\nnaked, so stores have rules that we have to wear clothes to shop <br/>\nthere.&quot; Or something like this. Also, what about in your own yard? At <br/>\nhome inside she can be as nude as she wants but if she&#39;s goes in the <br/>\nfront yard I have her put on undies at least. This weekend she went <br/>\nout into the back naked. I was okay with that but then neighbors on <br/>\nboth sides came out and I was uncomfortable with her being naked with <br/>\nthem outside. I&#39;m not sure if it was because other&#39;s could see her <br/>\nnaked. I know if I saw a kid running around naked in their backyard <br/>\nI&#39;d think it was cute. I certainly wouldn&#39;t have judgement, and even <br/>\nif I did (which I wouldn&#39;t) it wouldn&#39;t matter because it is their <br/>\nbackyard! I don&#39;t have fear that everyone who looks at my daughter is <br/>\nsome sort of creep. Maybe it is just a societal thing imbedded in to <br/>\nme since childhood, who knows. So how do you guys handle it? How do <br/>\nyou explain having to wear clothes in public, without sending the <br/>\nmessage that a naked body is wrong? How about in the yard of your own <br/>\nhome? Clothes or no clothes?<br/>\n<br/>\nWashing hands- My daughter hates to wash her hands, no doubt because <br/>\nI&#39;ve asked her to do it so much. I wash my hands frequently, but I <br/>\nknow I likely didn&#39;t as a child. Here&#39;s my thing, I can&#39;t make her <br/>\nwash her hands. They are her hands and if she doesn&#39;t want to that is <br/>\nher right. However, If she wants to help me cook I tell her I need <br/>\nher to wash her hands in order to. Sometimes she will, most often she <br/>\ndoesn&#39;t. Does that seem reasonable? It is your freedom to touch and <br/>\neat your food without washing your hands, but if you want to help <br/>\ncook food for the rest of the family, or share my food they need to <br/>\nbe washed. As a four year old her hands go many places. She wipes <br/>\nherself (pee, not poop), dirt, things at the park, the store, any <br/>\nplace on her body she has decided to explore. It just doesn&#39;t seem <br/>\nunreasonable to me to request that hands be washed. I have a really <br/>\nhard time with the not washing hands thing. I think I may be slightly <br/>\nobsessive about washing my own. Yesterday she wanted to eat some <br/>\ncereal dry right out of the box and I told her she could if she <br/>\nwashed her hands, but if not I&#39;d put it in a bowl for her. My thing <br/>\nis I don&#39;t want to make her feel dirty or unwanted because she <br/>\ndoesn&#39;t have clean hands. It seems reasonable to request that hands <br/>\nbe washed but I want to convey it to her in a way that doesn&#39;t make <br/>\nher feel bad. I nicely as I can say &quot;I&#39;d love to have your help <br/>\ncooking, lets go wash our hands and get started.&quot; If she turns me <br/>\ndown I say that it is important we wash our hands before dealing with <br/>\nfood for the family. I also know that someday she&#39;ll be able to reach <br/>\nthe cereal box on her own and whether she has washed her hands or not <br/>\nshe will eat it out of there. Any thoughts? Thanks in advance.<br/>\n<br/>\nKendrah-mama to Payge 4 y/o, Damien 15 months<br/>\n(who rarely eats out because the whole time she&#39;s thinking about how <br/>\nthe person that made the food may not of washed their hands)<br/>\n<br/>\n<br/>\n         <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nBoardwalk for $500? In 2007? Ha! <br/>\nPlay Monopoly Here and Now (it&#39;s updated for today&#39;s economy) at Yahoo! Games.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Nudity/washing hands","postDate":"1184170966","msgId":24926,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3MzA0bStrZG9tQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEEzOEM5RjkyLTcxRDUtNDhGQi05MjE3LTU0RkQ0NjYzRUNBRUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":24921,"nextInTopic":24976,"prevInTime":24925,"nextInTime":24927,"topicId":24918,"numMessagesInTopic":0,"msgSnippet":"... What about giving her some other hygeine options, like wipes or a hand sanitizer? ... own ... I ve said its a rule, actually. One that I don t always","messageBody":"<div id=\"ygrps-yiv-1315359764\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Kendrah Nilsestuen <br/>\n&lt;carebear-79@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Washing hands- My daughter hates to wash her hands<br/>\n<br/>\n </span></blockquote>What about giving her some other hygeine options, like wipes or a <br/>\nhand sanitizer? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How do  <br/>\n&gt; you explain having to wear clothes in public, without sending the  <br/>\n&gt; message that a naked body is wrong? How about in the yard of your <br/>\n </span></blockquote>own  <br/>\n<blockquote><span title=\"ireply\"> &gt; home? Clothes or no clothes?<br/>\n<br/>\n </span></blockquote>I&#39;ve said its a rule, actually. One that I don&#39;t always *agree* <br/>\nwith, but a rule none-the-less, like wearing shoes in a store and <br/>\nnot yodelling in libraries. <br/>\n<br/>\nI live in the woods, so my yard isn&#39;t an issue. We did have a <br/>\nproblem in town this spring, though. We were at a friend&#39;s house <br/>\nwhere Mo is used to being able to run through the sprinkler naked <br/>\nwith the other little kids. They have a largish back yard that&#39;s on <br/>\na corner, but with a line of trees mostly blocking the view from the <br/>\nroad. We had some weird weather this spring, so it got good and warm <br/>\nbut most of the trees had no leaves, yet. When the girls ran outside <br/>\nin the buff to play in the sprinkler a passing motorist called in a <br/>\ncomplaint on a cell-phone and the police showed up! One of them was <br/>\nquite firm about the matter and said the girls needed to have <br/>\nclothes on since people could see them. The other fellow rolled his <br/>\neyes and said *his* kids did it all the time, but they had to <br/>\nrespond to the complaint. I haven&#39;t checked the local laws, but I <br/>\nhave told Mo that she needs to have panties at the least on when she <br/>\nplays &quot;in town&quot; - although I do think its a pretty silly rule, <br/>\npersonally, and tell her that. <br/>\n<br/>\n---Meredith (Mo 5.5, Ray 13)</div>","specialLinks":[]},{"userId":299286442,"authorName":"Cameron Parham","from":"Cameron Parham &lt;acsp2205@...&gt;","profile":"acsp2205","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Nudity/washing hands","postDate":"1184101736","msgId":24921,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk5NzE1MS4xNzkxNC5xbUB3ZWI1OTIwNi5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":24919,"nextInTopic":24926,"prevInTime":24920,"nextInTime":24922,"topicId":24918,"numMessagesInTopic":0,"msgSnippet":"** Nudity- How do you guys explain having to wear clothes in public ** Just to reply with what I have said to my kids:   Every culture or group of people has","messageBody":"<div id=\"ygrps-yiv-6757690\">** Nudity- How do you guys explain having to wear clothes in public **<br/>\nJust to reply with what I have said to my kids:   &quot;Every culture or group of people has certain ways that they do things.  Right now where we live we have to wear clothes when we are around other people or are where we can be seen by other people.    Also without them we would often be cold. (We live in MT).  There are countries where it is so warm they don&#39;t bother with clothes, and they don&#39;t get upset when people are naked.&quot;   My kids were OK with this at age 4, although the issue has been revisitd as they get older.  We do live in a neighborhood with known sex offenders, so I would rather not have anyone seeng their cute little selves, but we didn&#39;t have to discuss this until they were a bit older.  This certainly came up for us, bc we spent 1993-2001 living with our nearest neighbors 5 miles away, and total freedom to run around &#39;nakies&#39; as they used to call it with delight in the freedom.  Once we drove into town to go to the library when the older ds was 5, my dd was<br/>\n 3, and I had a small baby.  We pulled up to the glass-fronted one-story library and the 3 and 5 year-olds got out to play in the &#39;town grass&#39;, much softer than the country grass.  I turned to get the baby out of his carseat, turned back with him in my arms, and the 5 yo ds was standing with his pants down, peeing happily right at the glass front of the library (which was well attended that day). Ha, ha, ha,...I just shrugged, smiled, and waved!,_Cameron<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Deb","from":"&quot;Deb&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Nudity/washing hands","postDate":"1184083891","msgId":24919,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3MGIzaittMXByQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEEzOEM5RjkyLTcxRDUtNDhGQi05MjE3LTU0RkQ0NjYzRUNBRUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":0,"nextInTopic":24921,"prevInTime":24917,"nextInTime":24920,"topicId":24918,"numMessagesInTopic":0,"msgSnippet":"Nudity - we simply have always told DS that he needs to have his private parts covered when non-family can see because they are HIS private parts, not anyone","messageBody":"<div id=\"ygrps-yiv-1607939563\">Nudity - we simply have always told DS that he needs to have <br/>\nhis &quot;private parts&quot; covered when non-family can see because they are <br/>\nHIS private parts, not anyone else&#39;s business. Not only does that <br/>\nkeep within &quot;societal expectations&quot; but it&#39;s an ounce of prevention <br/>\nin the direction of child predators - his parts are his parts and no <br/>\none outside the family should be seeing them. He&#39;s just turned 9 and <br/>\nno signs of ashamed-ness, he simply covers up when guests are over <br/>\nor when we&#39;re going out; a biggie for all of us is remembering to <br/>\nshut the bathroom door when we have guests. When it&#39;s just us, <br/>\nthat&#39;s often a &#39;gathering&#39; spot for chatting - it got quite crowded <br/>\nat times when all 3 of us humans plus both dogs (a lab mix and a <br/>\nGerman Shepherd) were in there! Some factors that &quot;nudged&quot; him a bit <br/>\nwithout us mentioning anything much: he hates having the dog sniff <br/>\nhis naked butt; he doesn&#39;t like the feel of dirt, grass, etc on <br/>\nhis &quot;parts&quot;. We&#39;ve also always talked about signs in establishments <br/>\nthat say &quot;No shirt, No shoes, No service&quot; and wondered what they&#39;d <br/>\ndo if someone walked in with a shirt and shoes but a naked butt. <br/>\n<br/>\nAs far as hand washing, we just explained and modelled from the time <br/>\nDS was little that playing in dirt and such may have germs and we <br/>\ndon&#39;t want that in our food that we eat. We always wash hands before <br/>\nany kind of food prep that includes our hands (reaching into <br/>\npackages, touching things we&#39;re cutting up, etc) but we don&#39;t harp <br/>\non it or worry all that much about situations where hands don&#39;t <br/>\ntouch food (pouring a bowl of cereal and eating it with a spoon for <br/>\ninstance). Over time, it&#39;s just become habit for DS to say &quot;Wait a <br/>\nminute, I&#39;m going to go wash my hands, they&#39;re kind of grubby from <br/>\nplaying&quot;, just as there&#39;s a corollary habit of stopping for a <br/>\nbathroom break before sitting down to meals (that&#39;s a habit from <br/>\nwhen he was much littler and just learning the potty connection).<br/>\n<br/>\nSo, in both cases, we don&#39;t make an issue of it, just simple <br/>\nreminders &quot;N is coming over to play, let&#39;s find some shorts for your <br/>\nparts&quot; (his choice on what kind of coverage - sometimes it&#39;s just a <br/>\nswimsuit other times it&#39;s full &#39;gear&#39; from underwear out) or &quot;Time <br/>\nto shred cheese for the burritos, let&#39;s wash hands first&quot; and <br/>\nmodelling. Sometimes the reminders are just modelling - &quot;Okay, I&#39;ll <br/>\nbe right there to scoop out the trail mix, just let me wash my hands <br/>\nfirst&quot; not even directed at his actions at all.<br/>\n<br/>\n--Deb</div>","specialLinks":[]}],"prevTopicId":24974,"nextTopicId":24928}}