{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":63209806,"authorName":"lpodietz","from":"&quot;lpodietz&quot; &lt;lpodietz@...&gt;","profile":"lpodietz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: thoughts and struggles about unschooling - asking for pearls of","postDate":"1160224287","msgId":17946,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVnODZtdis0ZzlyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDYxMDA3LjA0Mzk0NC4xNTQ0OS45MDc3MTlAd2VibWFpbDMzLmxheC51bnRkLmNvbT4="},"prevInTopic":17943,"nextInTopic":0,"prevInTime":17945,"nextInTime":17947,"topicId":17943,"numMessagesInTopic":0,"msgSnippet":"Hi Linda, In some ways I am in a similar situation. I am the main bread winner and I work mostly at home. I also have been torn and conflicted about","messageBody":"<div id=\"ygrps-yiv-1045534026\">&quot;Hi Linda, In some ways I am in a similar situation. I am the main <br/>\nbread winner and I work mostly at home. I also have been torn and <br/>\nconflicted about unschooling in the past. This was even though my <br/>\n12yo son clearly led us in the direction of unschooling after <br/>\nleaving public school in the middle of fifth grade. In some ways we <br/>\nhave it easier than other unschooling parents. I I didn&#39;t have to <br/>\nface the issue of whether or not my son would learn basic skills.&quot;<br/>\n<br/>\nYes, this is true for Aaron too--he had a Montessouri and then <br/>\nQuaker private school education for I guess... 9 years... basic <br/>\nskills are definitely covered.<br/>\n<br/>\n<br/>\n&quot;It must be hard for you because your daughter has found success in <br/>\nschool.&quot;<br/>\n<br/>\nNot at all---they are differenct people.  I try not to view Aaron <br/>\nas &quot;unsuccessful&quot;... although there is probably a subliminal message <br/>\nthere of disappointment coming from me... but the disappointment is <br/>\nnot that he is out of school---I admire his independence, creativity <br/>\nand his ability to see through the absurdity of school (even a fancy <br/>\nprivate school), and not needing to please, as you said about your <br/>\nson too.  (I too, have that needing to please others trait--big <br/>\ntime)  The disappointment comes from my expectations of what <br/>\nunschooling would look like, and it doesn&#39;t look like my picture... <br/>\nI have to keep reminding myself that he is still deschooling, as <br/>\nthey say, and that in time, without my constant nagging, his <br/>\ninterests will emerge on their own.<br/>\n<br/>\n<br/>\n&quot;This means that the time I make for him may include playing a <br/>\ncomputer game with him, listening to his music or watching an anime <br/>\nepisode. Our relationship is getting much closer now that he <br/>\nrealizes I am not going to nag him.&quot;<br/>\n<br/>\nYes, I&#39;m finding this too... <br/>\n<br/>\n<br/>\n&quot;Also, you are new to this. You may find that over time you will <br/>\nrearrange your family life as a part of where your son&#39;s journey <br/>\ntakes you all. It is hard to feel responsible for everything as you <br/>\nmust do.  I wanted my husband to cut back on his work. He did and is <br/>\nhome most of the time now. This was well worth any financial <br/>\nsacrifice.&quot;<br/>\n<br/>\nWe have considred this... my husband staying home... not quite there <br/>\nyet.  But, we are pieceing together an arrangement that works for us-<br/>\n--Aaron has a wonderful tutor for Latin and Science (a teacher from <br/>\nhis ex-school who he adores), we&#39;re looking for an equally wonderful <br/>\nmath tutor... he&#39;s a pretty serious musician (upright bass and <br/>\npiano) and does a bit of composing... lately he&#39;s been drawing a <br/>\nbit... thinking about Akido or fencing... likes to discuss politics, <br/>\nis very philosophical so we have some great discussions... I guess <br/>\nhe&#39;s doing OK, it&#39;s ME that just needs to relax and let it all <br/>\nunfold.<br/>\n<br/>\nThanks Andrea for sharing your experiences, I appreciate it.<br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":26151591,"authorName":"pinkydog@juno.com","from":"&quot;pinkydog@...&quot; &lt;pinkydog@...&gt;","profile":"anisadancer1218","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: thoughts and struggles about unschooling - asking for pearls of","postDate":"1160221129","msgId":17943,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYxMDA3LjA0Mzk0NC4xNTQ0OS45MDc3MTlAd2VibWFpbDMzLmxheC51bnRkLmNvbT4="},"prevInTopic":0,"nextInTopic":17946,"prevInTime":17942,"nextInTime":17944,"topicId":17943,"numMessagesInTopic":0,"msgSnippet":"Hi Linda, In some ways I am in a similar situation. I am the main bread winner and I work mostly at home. I also have been torn and conflicted about","messageBody":"<div id=\"ygrps-yiv-1301671138\">Hi Linda, In some ways I am in a similar situation. I am the main bread winner and I work mostly at home. I also have been torn and conflicted about unschooling in the past. This was even though my 12yo son clearly led us in the direction of unschooling after leaving public school in the middle of fifth grade. In some ways we have it easier than other unschooling parents. I I didn&#39;t have to face the issue of whether or not my son would learn basic skills. He had his own aptitude for reading and came out of school with strong language and writing skills. His knowledge in math, however, is very basic. I don&#39;t think he remembers any of the more complicated stuff that he was taught in school. Mostly, I do believe that if he ever needs math, he will be able to learn it and that he certainly knows enough to survive in the world. <br/>\nMy son also is pretty much on the computer all day. He engages in a variety of activities. Some of them are things that I can assess as &quot;worthy&quot; by my schoolish standards. For example, he writes fan fiction, makes animation, researches and finds anything he wants on the computer and learns Japanese pop songs. Some of his interests have taken me longer to view with an equally appreciative spirit such as his downloading and watching entire anime series at a time. <br/>\nIt must be hard for you because your daughter has found success in school. It was hard for me because I felt largely successful in school. In fact I have very fond memories of the public school I attended through seventh grade. This is in contrast to the private high school I attended. By that time I was depressed about family problems and felt totally unnoticed among my equally capable peers. Looking back more deeply after my son&#39;s utter rejection of school, I could see that my enjoyment of school was based on aspects of my personality that really aren&#39;t so healthy for me. I am the kind of person who likes to please and who will modify what I can do based on what other people will allow. I still struggle with times what I feel I have displeased people. My son, however, to his credit, and probably due to some good instincts of me and my husband, is fiercely independent and will do almost nothing that he really doesn&#39;t want to do. That serves as a constant lesson and inspiration for me.<br/>\nI also can be very controlling and critical but I have found liberation in letting go of my many expectations that things have to be a certain way. They don&#39;t. Instead, now if I want to be involved with my son, I try to be involved in a related way, one that he might choose. (What a change that would have made for me had my parents been willing to relate to me on my terms). This means that the time I make for him may include playing a computer game with him, listening to his music or watching an anime episode. Our relationship is getting much closer now that he realizes I am not going to nag him.<br/>\nAlso, you are new to this. You may find that over time you will rearrange your family life as a part of where your son&#39;s journey takes you all. It is hard to feel responsible for everything as you must do.  I wanted my husband to cut back on his work. He did and is home most of the time now. This was well worth any financial sacrifice.<br/>\nBest, Andrea<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":17919,"nextTopicId":17912}}