{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":295439124,"authorName":"wisdomalways5","from":"&quot;wisdomalways5&quot; &lt;wisdom1133@...&gt;","profile":"wisdomalways5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Teasing","postDate":"1185384587","msgId":25158,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY4ODFhYis1ODQ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ2QTY5ODFELjUwNzAxMDNAdHdjbnkucnIuY29tPg=="},"prevInTopic":25157,"nextInTopic":0,"prevInTime":25157,"nextInTime":25159,"topicId":25122,"numMessagesInTopic":0,"msgSnippet":"... concern ... who has ... time ... him ... and they ... about it- Talking to the supervisor is a little like tattling and they are more likely to make it","messageBody":"<div id=\"ygrps-yiv-1685202382\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, hbmccarty &lt;hbmccarty@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; As a follow up to the speech disfluency email, I have a related <br/>\n </span></blockquote>concern <br/>\n<blockquote><span title=\"ireply\"> &gt; that I was interested in getting some input on. My son, age 14, <br/>\n </span></blockquote>who has <br/>\n<blockquote><span title=\"ireply\"> &gt; had the sudden re-occurrence of stuttering, has been for the first <br/>\n </span></blockquote>time <br/>\n<blockquote><span title=\"ireply\"> &gt; in his life teased about it- kids at his summer job are imitating <br/>\n </span></blockquote>him <br/>\n<blockquote><span title=\"ireply\"> &gt; and calling attention to his stutter. He has asked them to stop <br/>\n </span></blockquote>and they <br/>\n<blockquote><span title=\"ireply\"> &gt; have not. He is considering saying something to the supervisor <br/>\n </span></blockquote>about it- <br/>\n<br/>\nTalking to the supervisor is a little like tattling and they are <br/>\nmore likely to make it worse for your son.It may help you be able to <br/>\ndeal with it if you imagine what and adult should do in this <br/>\nsituation. I would have your son if he is capable of it talk to the <br/>\nsupervisor not trying to get them to stop but expalining that it is <br/>\nreally difficult to work by them and if he could be moved to a <br/>\ndifferent dept. Also I would ask him if he would like to quit and <br/>\neither you or he lets the supervisor know why he is quiting.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; So this is the toughening up that kids are supposed to receive <br/>\n </span></blockquote>when they <br/>\n<blockquote><span title=\"ireply\"> &gt; go to school? These are all schooled kids he is working with. I <br/>\n </span></blockquote>feel so <br/>\n<blockquote><span title=\"ireply\"> &gt; sad that kids endure this day after day.<br/>\n<br/>\n </span></blockquote>This is not toughing up it is being a bully and abusive regardless <br/>\nof if it occurs to kids or adults.<br/>\n<br/>\n<br/>\nJulieH</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New and questions about handling lessons","postDate":"1185375911","msgId":25157,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY4N29yNys1ZnF1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ2QTczQTMzLjkwMzAzMDZAdHdjbnkucnIuY29tPg=="},"prevInTopic":25156,"nextInTopic":25158,"prevInTime":25156,"nextInTime":25158,"topicId":25122,"numMessagesInTopic":0,"msgSnippet":"... This is an important point, that skills can actutally improve by not- practicing. I ve seen it with skills besides music, too - yoga and reading and","messageBody":"<div id=\"ygrps-yiv-253814902\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, hbmccarty &lt;hbmccarty@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Since &quot;improvement&quot; comes both during breaks from playing and with <br/>\n&gt; playing, and the patterns of amounts of playing ebb and flow, it has <br/>\n&gt; worked best for us not to request that they practice.<br/>\n<br/>\n </span></blockquote>This is an important point, that skills can actutally improve by not-<br/>\npracticing. I&#39;ve seen it with skills besides music, too - yoga and <br/>\nreading and knitting and parenting ;) There&#39;s an ebb and flow to all <br/>\nkinds of learning.<br/>\n<br/>\n---Meredith (Mo 5.5, Ray 13)</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Teasing","postDate":"1185372989","msgId":25156,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczNjEyOS4yNDI0My5xbUB3ZWI1MzgwMy5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDQ2QTY5ODFELjUwNzAxMDNAdHdjbnkucnIuY29tPg=="},"prevInTopic":25155,"nextInTopic":25157,"prevInTime":25155,"nextInTime":25157,"topicId":25122,"numMessagesInTopic":0,"msgSnippet":"Unless the supervisor is a skilled communicator, I fear that his intervention is likely to worsen the situation. Fortunately this is only a six week position","messageBody":"<div id=\"ygrps-yiv-1292100238\">Unless the supervisor is a skilled communicator, I fear that his intervention is likely to worsen the situation. Fortunately this is only a six week position and he is <br/>\nhalf way through, so finishing it gracefully is not seeming impossible, <br/>\nthough I would support him in whatever he feels he needs to do.<br/>\n<br/>\n  ****<br/>\n  I&#39;m sorry he&#39;s having to deal with this.  Sure, it&#39;s only 6 weeks, but that&#39;s still 6 weeks too long to be mistreated by anyone.  <br/>\n   <br/>\n  ****<br/>\n  So this is the toughening up that kids are supposed to receive when they go to school? These are all schooled kids he is working with. I feel so sad that kids endure this day after day.<br/>\n<br/>\n  ******<br/>\n  yep -- mainstream folks call it &quot;kids can be so cruel&quot;  and say it&#39;s just something kids should ignore or to get over it.  Really, it&#39;s the way any inmate group will behave, and kids in school are nothing more than inmates with very poor supervision and no real power, except to hurt each other.  <br/>\n   <br/>\n  *****<br/>\nAny suggestions on effective things one could say or do in this kind of situation? <br/>\n   <br/>\n  *****<br/>\n   <br/>\n  Given his age, I wouldn&#39;t recommend getting involved yourself unless he asks you to.  He could try talking to the supervisor if he feels comfortable doing so, and if he&#39;s willing to risk that talking to the boss might only anger the other kids, leading to more abuse. It&#39;s hard to say what will really happen.  How much authority does the supervisor have to stop the teasing?  Is there a process in place with the museum&#39;s management to deal with such situations?  Are these kids he&#39;ll run into again and have to deal with to pursue his own dreams?  What would he consider progress, and how much genuine progress can be realistically expected given the real limits of how difficult it is to control employees/interns? <br/>\n   <br/>\n  At a minimum, if he just chooses to tough it out now and not say anything to his boss, I&#39;d encourage him to write up a letter about the teasing he encountered and submitting that to whatever powers that be at the museum.  It may not help him in this situation, but could prevent others from being teased the same way, if the museum realizes there&#39;s a problem in the program and the way the students involved conduct themselves.<br/>\n   <br/>\n  Sylvia<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nReady for the edge of your seat? Check out tonight&#39;s top picks on Yahoo! TV. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":220041937,"authorName":"hbmccarty","from":"hbmccarty &lt;hbmccarty@...&gt;","profile":"heather13068","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] New and questions about handling lessons","postDate":"1185364531","msgId":25155,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2QTczQTMzLjkwMzAzMDZAdHdjbnkucnIuY29tPg==","inReplyToHeader":"PEMyQ0E5QUVDLjNBOUIlem9hY29ubmVyQGNvbWNhc3QubmV0Pg==","referencesHeader":"PEMyQ0E5QUVDLjNBOUIlem9hY29ubmVyQGNvbWNhc3QubmV0Pg=="},"prevInTopic":25154,"nextInTopic":25156,"prevInTime":25154,"nextInTime":25156,"topicId":25122,"numMessagesInTopic":0,"msgSnippet":"My kids both take music lessons(ages 10 and 14). They did both start playing an instrument without lessons and then both requested lessons. May son started at","messageBody":"<div id=\"ygrps-yiv-1671839851\">My kids both take music lessons(ages 10 and 14). They did both start <br/>\nplaying an instrument without lessons and then both requested lessons.  <br/>\nMay son started at 11, and my daughter started a couple of months ago. <br/>\nSince &quot;improvement&quot; comes both during breaks from playing and with <br/>\nplaying, and the patterns of amounts of playing ebb and flow, it has <br/>\nworked best for us not to request that they practice. Sometimes they <br/>\nrequest that I remind them to practice.  Mostly they just pick up the <br/>\ninstrument and play- sometimes for 5 minutes, sometimes all day. There <br/>\nwas an article in Life Learning Magazine that discussed this topic, and <br/>\nsuggested that parents not refer to the playing as practice- as the <br/>\nplaying that is done as &quot;practice&quot; is done for enjoyment, and not in <br/>\npreparation for something else.<br/>\n<br/>\nDana&#39;s point about helping the child is a good one. I help my children <br/>\nfrequently as they request, often by listening, sometimes suggesting <br/>\nsomething if they are open to a suggestion - such as using a metronome, <br/>\nor finding a recording of the piece, maybe reminding them of something a <br/>\nteacher has suggested. This is only is they are open to it and have <br/>\ninvited participation. It may be talking to a teacher about an issue, <br/>\nattending a lesson with them, getting the instrument repaired, or <br/>\nimproved,  offering opportunities to play in groups. When my son(14) has <br/>\nmade a commitment to playing with a group, he will want help organizing <br/>\nhis day so that there is enough time to prepare for that. He will leave <br/>\na note asking me to wake him up in enough time before work so he can <br/>\nplay scales. If it is getting late in the day and we are all planning to <br/>\ngo to bed soon(our house is small), I will ask him if he wants to play <br/>\nbefore the time at which we request that things quiet down so that Dad <br/>\ncan get enough sleep before going to work(he is a carpenter and needs <br/>\nespecially to be alert). He usually does want to play, and the reminder <br/>\nis only to help him avoid the frustration of wanting to play and not <br/>\nhaving enough time to do it.<br/>\n<br/>\nI do help my son quite a bit with planning his time, when he requests, <br/>\nor I offer when he seems to be getting frustrated- we sit down together <br/>\nand make a schedule. I guess I could just let him experience the <br/>\nconsequences of his own forgetfulness, but this seems a little cruel. He <br/>\ntends to take on quite a bit at times, with rehearsals, work etc.<br/>\n<br/>\n<br/>\nHeather<br/>\n<br/>\n<br/>\n<br/>\n Zoa Conner wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; I am new here and have a question. How do you all handle lessons/classes<br/>\n&gt; which require practice or work at home? My ds8 takes Suzuki violin <br/>\n&gt; lessons,<br/>\n&gt; and always grouses about practicing at home. He often will not practice at<br/>\n&gt; all, especially if we have out of the house activities that day. He knows<br/>\n&gt; that when practices, his lesson go more to his liking, he progresses <br/>\n&gt; faster,<br/>\n&gt; and is happier. But that is not enough to get him to actually <br/>\n&gt; practice. Any<br/>\n&gt; comments/ideas on good ways to deal with or ignore this situation?<br/>\n&gt;<br/>\n&gt; Thanks,<br/>\n&gt; Zoa<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":220041937,"authorName":"hbmccarty","from":"hbmccarty &lt;hbmccarty@...&gt;","profile":"heather13068","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Teasing","postDate":"1185323037","msgId":25153,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2QTY5ODFELjUwNzAxMDNAdHdjbnkucnIuY29tPg==","inReplyToHeader":"PGY4NHI5Nytwb3FjQGVHcm91cHMuY29tPg==","referencesHeader":"PGY4NHI5Nytwb3FjQGVHcm91cHMuY29tPg=="},"prevInTopic":25138,"nextInTopic":25154,"prevInTime":25152,"nextInTime":25154,"topicId":25122,"numMessagesInTopic":0,"msgSnippet":"As a follow up to the speech disfluency email, I have a related concern that I was interested in getting some input on. My son, age 14, who has had the sudden","messageBody":"<div id=\"ygrps-yiv-1608940272\">As a follow up to the speech disfluency email, I have a related concern <br/>\nthat I was interested in getting some input on. My son, age 14, who has <br/>\nhad the sudden re-occurrence of stuttering, has been for the first time <br/>\nin his life teased about it- kids at his summer job are imitating him <br/>\nand calling attention to his stutter. He has asked them to stop and they <br/>\nhave not. He is considering saying something to the supervisor about it- <br/>\nthis is happening when he is not is the room. One kid took his name tag <br/>\nand threw it down a hole in an exhibit(he works at a science center), <br/>\nanother threw things at his face repeatedly. Unless the supervisor is a <br/>\nskilled communicator, I fear that his intervention is likely to worsen <br/>\nthe situation. Fortunately this is only a six week position and he is <br/>\nhalf way through, so finishing it gracefully is not seeming impossible, <br/>\nthough I would support him in whatever he feels he needs to do.<br/>\n<br/>\nSo this is the toughening up that kids are supposed to receive when they <br/>\ngo to school? These are all schooled kids he is working with. I feel so <br/>\nsad that kids endure this day after day.<br/>\n<br/>\nAny suggestions on effective things one could say or do in this kind of <br/>\nsituation? He did experience something similar at an afterschool program <br/>\nbut there we were able to quickly find a substitute of a similar <br/>\nactivity with only homeschooled kids. He was much younger then and I <br/>\nspoke directly with the leader of that program, who listened and <br/>\nadmitted that they needed to supervise the kids more closely. I am <br/>\npretty sure at the age he is now that having me get involved directly is <br/>\nNOT what he wants- though certainly I am here to listen, support, and <br/>\nmake suggestions.<br/>\n<br/>\nHeather</div>","specialLinks":[]},{"userId":234999820,"authorName":"T&R JAM....","from":"&quot;T&R JAM....&quot; &lt;tikj007@...&gt;","profile":"tikj007","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New and questions about handling lessons","postDate":"1185294572","msgId":25154,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY4NTlkYytpaDc2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY4NTI3ZCs1M2ptQGVHcm91cHMuY29tPg=="},"prevInTopic":25153,"nextInTopic":25155,"prevInTime":25153,"nextInTime":25155,"topicId":25122,"numMessagesInTopic":0,"msgSnippet":"I am new to unschooling but have been doing the suzuki violin and cello with both of my girls since they were about 5.  my oldest started because she wanted to","messageBody":"<div id=\"ygrps-yiv-1591430452\">I am new to unschooling but have been doing the suzuki violin and <br/>\ncello with both of my girls since they were about 5.  my oldest <br/>\nstarted because she wanted to and wouldn&#39;t stop bugging us.  To be <br/>\nhonest my youngest I think started becasue big sister was fun to <br/>\nwatch and because mom and dad helped her, so there for,she also <br/>\nstarted for attention purposes.  But having been through the &#39;I don&#39;t <br/>\nwant to practice,&#39; to &#39;I love to practice and play in front of <br/>\npeople,&#39; a little advice I would give is to relax. Do group lessons <br/>\n(my girls both love these more than lesson day).  And go to suzuki <br/>\ncamp.  At camp they meet other kids and play all these silly games <br/>\nthat you can go home and do. When my girls come home from suzuki camp <br/>\nthey are so excited to play and often go for an hour or more playing <br/>\nand listening to their peices even just making up some music on their <br/>\nown.  Find a teacher that is fun and plays games with them.  This is <br/>\nas important as posture a teacher that is not fun will kill any <br/>\ninterest in any thing (just like school).  Attend the lessons every <br/>\nweek.  There are books that are for suzuki teachers that have games <br/>\nand such for each song they play.  Try to find one.  And don&#39;t be <br/>\ndisapointed if they don&#39;t want to play and want to quit.  Maybe they <br/>\njust wanted to see if they could do it and now that he proved he <br/>\ncould he wants to try something else.  The only way to see if you <br/>\nlike something is to try it, give it a good shot and sometimes you <br/>\nlike it sometimes you don&#39;t.  Just make sure that he know no matter <br/>\nwhat you love him and support his decision.  <br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;dana_burdick&quot; <br/>\n&lt;DanaBurdick@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I was about 8 when I became really frustrated with piano.  My <br/>\n </span></blockquote>mother <br/>\n<blockquote><span title=\"ireply\"> &gt; did not push me to practice in any way, but did not help either.  <br/>\n </span></blockquote>One <br/>\n<blockquote><span title=\"ireply\"> &gt; day I sat at the piano crying in frustration because there was <br/>\n&gt; something I did not understand.  My mother said to me, &quot;I have a <br/>\n&gt; suggestion. Quit.&quot;  So I did.  I didn&#39;t pick up the piano again <br/>\n </span></blockquote>until <br/>\n<blockquote><span title=\"ireply\"> &gt; I was twelve.<br/>\n&gt; <br/>\n&gt; I&#39;m glad that my mom was not a pusher (oh, that didn&#39;t come out <br/>\n </span></blockquote>right <br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;bwg&gt;), but at the same time I wish she would have taken more <br/>\n&gt; interest in _helping_ me through that frustrating time when I was <br/>\n&gt; eight.<br/>\n&gt; <br/>\n&gt; Instead of thinking that your son should be practicing more, think <br/>\n </span></blockquote>of <br/>\n<blockquote><span title=\"ireply\"> &gt; how you can help him.  The big question though is what does help <br/>\n </span></blockquote>look <br/>\n<blockquote><span title=\"ireply\"> &gt; like.  For me, it would been extremely helpful if my mom was just <br/>\n&gt; present in the room with me.  Not sitting on the piano bench or <br/>\n&gt; asking me a bunch of questions, but just being there.  The other <br/>\n&gt; thing that would have helped is if she became familiar herself with <br/>\n&gt; the instrument and kept a dialogue with the teacher.  My mom just <br/>\n&gt; sent me down the street to the teacher&#39;s house and never spoke to <br/>\n&gt; her.  As it turns out, when I quit it was over a simple <br/>\n&gt; misunderstanding about finger placement.  It would have been such a <br/>\n&gt; simple thing to clear up the confusion I had.<br/>\n&gt; <br/>\n&gt; In your son&#39;s case, help may look like doing nothing.  It could <br/>\n </span></blockquote>look <br/>\n<blockquote><span title=\"ireply\"> &gt; like getting some piano CDs and listening to them for your <br/>\n&gt; enjoyment.  It most certainly will include knowing what the teacher <br/>\n&gt; is doing in his lessons.  You don&#39;t have to have a discussion every <br/>\n&gt; week with your son (that could just be annoying for him), but if <br/>\n </span></blockquote>you <br/>\n<blockquote><span title=\"ireply\"> &gt; are familiar with the nuances of the teacher&#39;s interaction with <br/>\n </span></blockquote>your <br/>\n<blockquote><span title=\"ireply\"> &gt; son, it may give you a better idea of what help looks like.<br/>\n&gt; <br/>\n&gt; I will say, if my mom even once, had asked me if I had practiced <br/>\n </span></blockquote>that <br/>\n<blockquote><span title=\"ireply\"> &gt; day, there is a big chance that I would have never returned to the <br/>\n&gt; piano at twelve.  IMO, it is actually better that he never ever <br/>\n&gt; practices than asking him to practice.  To this day, I totally own <br/>\n&gt; the work I have done in piano.  I never credit my mother for making <br/>\n&gt; me practice.  I credit only myself and my love for the instrument.  <br/>\n </span></blockquote>I <br/>\n<blockquote><span title=\"qreply\"> &gt; still play and still practice and still dream of playing even <br/>\n&gt; better.  It&#39;s a life long passion for sure.<br/>\n&gt; <br/>\n&gt; -Dana<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":156418579,"authorName":"dana_burdick","from":"&quot;dana_burdick&quot; &lt;DanaBurdick@...&gt;","profile":"dana_burdick","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New and questions about handling lessons","postDate":"1185287213","msgId":25138,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY4NTI3ZCs1M2ptQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEMyQ0E5QUVDLjNBOUIlem9hY29ubmVyQGNvbWNhc3QubmV0Pg=="},"prevInTopic":25135,"nextInTopic":25153,"prevInTime":25137,"nextInTime":25139,"topicId":25122,"numMessagesInTopic":0,"msgSnippet":"I was about 8 when I became really frustrated with piano.  My mother did not push me to practice in any way, but did not help either.  One day I sat at the","messageBody":"<div id=\"ygrps-yiv-570896788\">I was about 8 when I became really frustrated with piano.  My mother <br/>\ndid not push me to practice in any way, but did not help either.  One <br/>\nday I sat at the piano crying in frustration because there was <br/>\nsomething I did not understand.  My mother said to me, &quot;I have a <br/>\nsuggestion. Quit.&quot;  So I did.  I didn&#39;t pick up the piano again until <br/>\nI was twelve.<br/>\n<br/>\nI&#39;m glad that my mom was not a pusher (oh, that didn&#39;t come out right <br/>\n&lt;bwg&gt;), but at the same time I wish she would have taken more <br/>\ninterest in _helping_ me through that frustrating time when I was <br/>\neight.<br/>\n<br/>\nInstead of thinking that your son should be practicing more, think of <br/>\nhow you can help him.  The big question though is what does help look <br/>\nlike.  For me, it would been extremely helpful if my mom was just <br/>\npresent in the room with me.  Not sitting on the piano bench or <br/>\nasking me a bunch of questions, but just being there.  The other <br/>\nthing that would have helped is if she became familiar herself with <br/>\nthe instrument and kept a dialogue with the teacher.  My mom just <br/>\nsent me down the street to the teacher&#39;s house and never spoke to <br/>\nher.  As it turns out, when I quit it was over a simple <br/>\nmisunderstanding about finger placement.  It would have been such a <br/>\nsimple thing to clear up the confusion I had.<br/>\n<br/>\nIn your son&#39;s case, help may look like doing nothing.  It could look <br/>\nlike getting some piano CDs and listening to them for your <br/>\nenjoyment.  It most certainly will include knowing what the teacher <br/>\nis doing in his lessons.  You don&#39;t have to have a discussion every <br/>\nweek with your son (that could just be annoying for him), but if you <br/>\nare familiar with the nuances of the teacher&#39;s interaction with your <br/>\nson, it may give you a better idea of what help looks like.<br/>\n<br/>\nI will say, if my mom even once, had asked me if I had practiced that <br/>\nday, there is a big chance that I would have never returned to the <br/>\npiano at twelve.  IMO, it is actually better that he never ever <br/>\npractices than asking him to practice.  To this day, I totally own <br/>\nthe work I have done in piano.  I never credit my mother for making <br/>\nme practice.  I credit only myself and my love for the instrument.  I <br/>\nstill play and still practice and still dream of playing even <br/>\nbetter.  It&#39;s a life long passion for sure.<br/>\n<br/>\n-Dana</div>","specialLinks":[]},{"userId":209800111,"authorName":"decjec","from":"&quot;decjec&quot; &lt;decjec@...&gt;","profile":"decjec","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New and questions about handling lessons","postDate":"1185280103","msgId":25135,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY4NHI5Nytwb3FjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEMyQ0E5QUVDLjNBOUIlem9hY29ubmVyQGNvbWNhc3QubmV0Pg=="},"prevInTopic":25124,"nextInTopic":25138,"prevInTime":25134,"nextInTime":25137,"topicId":25122,"numMessagesInTopic":0,"msgSnippet":"-- Hi, Not that I have an answer for you but have you read John Holt s Learning All the Time? He has a very good chapter about Suzuki Violin. My daughter takes","messageBody":"<div id=\"ygrps-yiv-714835303\">--<br/>\nHi,<br/>\nNot that I have an answer for you but have you read John Holt&#39;s<br/>\nLearning All the Time? He has a very good chapter about Suzuki Violin.<br/>\nMy daughter takes piano and she practices when she wants to. I<br/>\nsometimes ask her if she would like to practice and she says yes or<br/>\nno. If it is to be &quot;her&quot; lessons then she is going to get out of if<br/>\nwhat she needs and wants, not what I need or want. If you would like<br/>\nyour child to have a love of music than it has to come from their<br/>\ndesire (not what John Holt says just my opinion.)<br/>\nDanette<br/>\n<br/>\n<br/>\n- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Zoa Conner &lt;zoaconner@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I am new here and have a question. How do you all handle lessons/classes<br/>\n&gt; which require practice or work at home? My ds8 takes Suzuki violin<br/>\n </span></blockquote>lessons,<br/>\n<blockquote><span title=\"ireply\"> &gt; and always grouses about practicing at home. He often will not<br/>\n </span></blockquote>practice at<br/>\n<blockquote><span title=\"ireply\"> &gt; all, especially if we have out of the house activities that day. He<br/>\n </span></blockquote>knows<br/>\n<blockquote><span title=\"ireply\"> &gt; that when practices, his lesson go more to his liking, he progresses<br/>\n </span></blockquote>faster,<br/>\n<blockquote><span title=\"ireply\"> &gt; and is happier. But that is not enough to get him to actually<br/>\n </span></blockquote>practice. Any<br/>\n<blockquote><span title=\"qreply\"> &gt; comments/ideas on good ways to deal with or ignore this situation?<br/>\n&gt; <br/>\n&gt; Thanks,<br/>\n&gt; Zoa<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New and questions about handling lessons","postDate":"1185234247","msgId":25124,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY4M2VnNytpY2tiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEMyQ0E5QUVDLjNBOUIlem9hY29ubmVyQGNvbWNhc3QubmV0Pg=="},"prevInTopic":25122,"nextInTopic":25135,"prevInTime":25123,"nextInTime":25125,"topicId":25122,"numMessagesInTopic":0,"msgSnippet":"~~But that is not enough to get him to actually practice. Any comments/ideas on good ways to deal with or ignore this situation?~~ I think you have to ask","messageBody":"<div id=\"ygrps-yiv-970659348\">~~But that is not enough to get him to actually practice. Any<br/>\ncomments/ideas on good ways to deal with or ignore this situation?~~<br/>\n<br/>\nI think you have to ask yourself the purpose behind the Suzuki<br/>\nlessons. If he&#39;s truly learning for the sheer joy of the instrument,<br/>\nhe really doesn&#39;t need any lessons yet at all. If he truly wants the<br/>\nlessons, let him take from it exactly what he chooses. Being pushed to<br/>\npractice kills all joy of playing...trust me (as a child that was<br/>\nprodded too much and learned to resent lessons and playing of any kind).<br/>\n<br/>\nI really am not a big fan of Suzuki unless a child is driven and wants<br/>\nit. Suzuki&#39;s goal seems to be turning out virtuosos. My goal as a<br/>\nparent is to help my children pursue things for the sheer joy of the<br/>\nactivity.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":224031522,"authorName":"Zoa Conner","from":"Zoa Conner &lt;zoaconner@...&gt;","profile":"zoaconner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"New and questions about handling lessons","postDate":"1185227436","msgId":25122,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMyQ0E5QUVDLjNBOUIlem9hY29ubmVyQGNvbWNhc3QubmV0Pg=="},"prevInTopic":0,"nextInTopic":25124,"prevInTime":25121,"nextInTime":25123,"topicId":25122,"numMessagesInTopic":0,"msgSnippet":"I am new here and have a question. How do you all handle lessons/classes which require practice or work at home? My ds8 takes Suzuki violin lessons, and always","messageBody":"<div id=\"ygrps-yiv-1387638055\">I am new here and have a question. How do you all handle lessons/classes<br/>\nwhich require practice or work at home? My ds8 takes Suzuki violin lessons,<br/>\nand always grouses about practicing at home. He often will not practice at<br/>\nall, especially if we have out of the house activities that day. He knows<br/>\nthat when practices, his lesson go more to his liking, he progresses faster,<br/>\nand is happier. But that is not enough to get him to actually practice. Any<br/>\ncomments/ideas on good ways to deal with or ignore this situation?<br/>\n<br/>\nThanks,<br/>\nZoa</div>","specialLinks":[]}],"prevTopicId":25128,"nextTopicId":25120}}