{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":14,"messages":[{"userId":132876517,"authorName":"AECANGORA@aol.com","from":"AECANGORA@...","profile":"amy_aec","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Concert and 11 y/o","postDate":"1271423190","msgId":43688,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQ0FCN0NDM0IzOTQ5Ny1DNDgtMTJBQzJAd2VibWFpbC1tMDM4LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":43683,"nextInTopic":0,"prevInTime":43687,"nextInTime":43689,"topicId":43648,"numMessagesInTopic":0,"msgSnippet":"Hi John, Sorry for the delayed response.  I get the groups e-mails through daily digest and I also only get on-line about every other day or so. Actually I","messageBody":"<div id=\"ygrps-yiv-108630822\">Hi John,<br/>\n<br/>\nSorry for the delayed response.  I get the groups e-mails through daily digest and I also only get on-line about every other day or so.<br/>\n<br/>\nActually I think those who responded to your concerns answered better than I could have.  i am fairly new to radical unschooling, and as I stated, my initial response would have been similar to yours.  I would most definitely share your concerns.  Until recently I controlled the TV in our house with how much and what.  I have loosened up a lot, although not totally.  I still have a block on PG and higher, but will unblock somethings when asked.  (My girls are 9 and 7.)<br/>\n<br/>\nSo, I am just reasoning through the issues of media and less controls myself.  After reading folks initial responses to your concerns about the concert it got me thinking and that&#39;s when the whole Shakespere, censorship, and classics thing came to me.  Another example that I thought of recently comes actually from public school.  I am certified to teach Biology/general science.  When doing some substitute teaching I substitute in an high school English class that was reading Of Mice and Men.  There is some pretty colorful language in that, and the class was doing the go around the room and read out loud thing.  I remember at the time being unsure about reading it out loud (the teacher left no instructions about whether to skip those words or not.)  But, the point is, we tell kids all the time not to use those words, and in school they can get sent to the principals office for using them.  But, then when learning about a classic piece of English literature it&#39;s all of a sudden OK.  How confusing is that?!<br/>\n<br/>\nI also know that I suffer from the &quot;good girl syndrome.&quot;  I tend to classify certain behaviors as good or bad.  I learned early on that it was better to be a &quot;good girl&quot; if you want adult approval - be quiet and nice, and don&#39;t make waves.  When, as an adult I did try to exert myself and then found out that people didn&#39;t like it, I had to struggle between being true to myself or backing down to get their approval again.  Also, there is tons of guilt tied to being a &quot;good girl,&quot; because when you feel like you have slipped up, you beat yourself up internally.  (There is guilt about feeling angry, eating the wrong foods, offending someone, not doing enough house work, etc, etc.)<br/>\n<br/>\nAs a &quot;good girl,&quot;  I also judged people on their behavior and just assumed, because they swore, drank a little, smoked, etc. they were bad people.  Now iIm learning that everyone is just doing the best with what they have and that a few behaviors don&#39;t determine who they are on the inside.  Most people are decent even if their choices don&#39;t look the same as mine.  I&#39;m learning to cut people a little slack.  I&#39;ve been working on this for the last 20 yrs. now and am just starting to feel like I have a handle on it and my own internal guilt thing.<br/>\n<br/>\nAnyway, I&#39;ve gotten way of topic.  I think, as others have said, it&#39;s not a matter of &quot;yes&quot; or &quot;no&quot;, but of being open and respectful without judging.  I notice that I make a lot of value statements with my girls without being open to really hearing their needs and wants.  This cuts communications off.  Not something I really want to do and the eve of puberty!  <br/>\n<br/>\nAmy C.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n               Re: Concert and 11 y/o          <br/>\n    <br/>\nPosted by:      &quot;JOHN&quot;            <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ygroups@...\">ygroups@...</a>                                       jmhnet1                   <br/>\n    <br/>\n      Wed Apr 14, 2010 2:51 am        (PDT)    <br/>\n                      <br/>\n<br/>\n      <br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, AECANGORA@..<br/>\n. wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Weren&#39;t Shakespeare productions considered to be crude and unseemly when first preformed in England? And, now they are considered to be the height of culture and to be classics that must be studied in school and dissected to be understood.  Operas can be quite risque.   And, many &quot;classic&quot; books have been banned from libraries in the past. <br/>\n&gt; <br/>\n&gt; Amy C.<br/>\n<br/>\n </span></blockquote>Amy,<br/>\nI&#39;m not sure I agree with your point but I do agree that throughout history, different social mores dictated varying levels of what was considered &quot;proper.&quot; I don&#39;t think that matters though. For now, in this place and time, it just seems to be too much to present certain contemporary content to an 11 y/o. My question is, where do you draw the &quot;line?&quot;<br/>\nI think in terms of extremes so that I can realize that there is a middle somewhere: I don&#39;t think any of us would want our young child to see a truly traumatizing or explicit film, such as the first half hour of Saving Private Ryan, or Eyes Wide Shut, or name your own line. On the other hand, my daughter is beyond Barney and Blues Clues.<br/>\nSo where is the happy medium? <br/>\nShe is just getting into music and that&#39;s great! I love music, and I like some of the Black Eyed Peas. But is it appropriate for her to go from liking a couple of their &quot;clean&quot; songs to a full-blown concert experience? I guess if she didn&#39;t like it, she could leave (but my wife mentioned the tix were like $350 each, so it would be an expensive lesson... but I digress -- and no it isn&#39;t about the money, though I did cringe a little [ok, a lot] when I heard the price, which was AFTER I had my initial issues with this).<br/>\nAll I&#39;m looking for is the happy medium. The happy, blissful, utopian center, where all is well and good. I posit that each of us, as parents, have our own extreme points. The extreme where we would politely say to our child, &quot;you can watch The Sixth Sense, but you might end up scared to death to sleep any more.&quot; Or, &quot;you can watch Barney, but you may lose the lunch you just ate.&quot; <br/>\nWhere is it?<br/>\n<br/>\n-john<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":302010303,"authorName":"sharon","from":"&quot;sharon&quot; &lt;1drflmthr@...&gt;","profile":"sharonjemerson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Concert and 11 y/o","postDate":"1271377910","msgId":43683,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxOGI1bStpcWVlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhxNG1laytlZzNwQGVHcm91cHMuY29tPg=="},"prevInTopic":43679,"nextInTopic":43688,"prevInTime":43682,"nextInTime":43684,"topicId":43648,"numMessagesInTopic":0,"msgSnippet":"Thank you everyone for your feedback and responses to my husband and I. Hubby does tend to think and talk in extremes. This past weekend we all went for a hike","messageBody":"<div id=\"ygrps-yiv-1724203832\">Thank you everyone for your feedback and responses to my husband and I. Hubby does tend to think and talk in extremes. <br/>\nThis past weekend we all went for a hike in Saratoga State Park. There is an indoor/outdoor theater there. We walked all around the ampitheater and I showed our dtr where I sat in second row for a Journey concert years ago. We talked about the whole concert experience, how old I was when I went to my first concert (14), who it was (Foreigner), and why Papa (hubby) thinks the B.E.P. are &quot;inappropriate.&quot; <br/>\nI think I mentioned that we&#39;ve seen the Black Eyed Peas in concert on Oprah and an awards show. DD has also been fascinated with Michael Jackson since his death. We went to and own the &quot;This Is It&quot; movie (about MJ preparing for his concert). I think she has a good sense of what a concert experience might be like. <br/>\nHubby failed to mention that she wants to pay for her own ticket. He also mentioned the &quot;extreme&quot; amount of how much a ticket could cost. There are tickets that cost less.<br/>\nAnyhow, I am grateful that he is writing out his feelings, fears, concerns and getting feedback from someone other than me.<br/>\nBest,<br/>\nSharon<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n<br/>\n&gt; I wouldn&#39;t throw one of my kids into any situation that was radically different from anything he or she had done before without some kind of preparation. For something like a concert, I&#39;d make sure to have plenty of samples of the group&#39;s music, maybe some live recordings, so that she could get a taste of what to expect in that regard. I&#39;d also do some research into the venue itself, find out what kind of ticketing there is (general admission or specific seats) and come up with plans for her getting lost in the press of bodies - not in a fear-mongering way, but to give her (and whoever goes with her) a greater sense of confidence in the experience. Also see if you can find videos of any concert footage to find out what kind of &quot;scene&quot; to expect - do they tend to have a space for dancing? Do they do any stage diving? Those sorts of situations present different possibilities, different risks, and its good to know all that beforehand. <br/>\n&gt; <br/>\n&gt; ---Meredith (Mo 8, Ray 16)<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":124256069,"authorName":"Bun","from":"&quot;Bun&quot; &lt;alohabun@...&gt;","profile":"alohabun","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Concert and 11 y/o","postDate":"1271353424","msgId":43679,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxN2o4Zytnbm1pQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhxM2JhaitzbmdzQGVHcm91cHMuY29tPg=="},"prevInTopic":43677,"nextInTopic":43683,"prevInTime":43678,"nextInTime":43680,"topicId":43648,"numMessagesInTopic":0,"msgSnippet":"... In our area, the The Merry Wives Of Windsor is playing at our local theater and had a warning statement on it about adult content.  Two young people I know","messageBody":"<div id=\"ygrps-yiv-544407116\"><blockquote><span title=\"ireply\">&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, AECANGORA@ wrote:<br/>\n&gt; &gt;Weren&#39;t Shakespeare productions considered to be crude and unseemly when first preformed in England? And, now they are considered to be the height of culture and to be classics that must be studied in school and dissected to be understood.  <br/>\n<br/>\n </span></blockquote>In our area, the The Merry Wives Of Windsor is playing at our local theater and had a warning statement on it about adult content.  Two young people I know went to see the production because their friends were in it.  One went with their parent and the other alone.  One felt a little embarassed at the bawdiness, but still loved the show and found it extremely funny.  The other thought the upturned red horn in the man&#39;s pants was a dragon&#39;s tail.  So, yes, there still can be content that some parents would feel uncomfortable about &quot;letting&quot; their kids be exposed to.  But like Amy said, because it is Shakespeare, it is considered &quot;classical&quot; and &quot;educational.&quot; A concert is only for entertainment and so people think much more about their concern of exposure to what is considered adult content.  The strange thing is that Shakespeare&#39;s plays were made for entertainment purposes too.  Laurie <br/>\n<br/>\n<br/>\nHere&#39;s the description of the play: <br/>\n---<br/>\nJealousy, disguises, dunkings, fairies, drag <br/>\na sitcom or Shakepeare ? <br/>\nThe carousing Falstaff is in need of cash to support his self-indulgent habits. Knowing that upper middle class women control the finances and are generally eager for connections to the royal court, he comes to Windsor to woo the Merry Wives (Mistress Page and Ford.) <br/>\nFalstaff sends identical love letters to both Mistress Ford and Mistress Page. Each wife of Windsor, upon receiving her letter, immediately seeks out the other to express her outrage. They discover Falstaff&#39;s trick and decide to get revenge. The clever Merry Wives dupe Falstaff not once, but three times, each time with a more humiliating outcome!<br/>\n<br/>\nDue to the &quot;Bawdy&quot; nature of this show, it is recommended for mature audiences. <br/>\n---</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Concert and 11 y/o","postDate":"1271265997","msgId":43677,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxNHRzZCsxMGExbkBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PGhxM2JhaitzbmdzQGVHcm91cHMuY29tPg=="},"prevInTopic":43676,"nextInTopic":43679,"prevInTime":43676,"nextInTime":43678,"topicId":43648,"numMessagesInTopic":0,"msgSnippet":"... ************* The summer I was 11, a group of school mates and I read Valley of the Horses together, as a sort of secret summer reading project . Have you","messageBody":"<div id=\"ygrps-yiv-1850001221\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;JOHN&quot; &lt;ygroups@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;For now, in this place and time, it just seems to be too much to present certain contemporary content to an 11 y/o. <br/>\n </span></blockquote>*************<br/>\n<br/>\nThe summer I was 11, a group of school mates and I read Valley of the Horses together, as a sort of secret &quot;summer reading project&quot;. Have you read it? More different sexual positions than I knew existed at 11. We read and read and giggled and were merrily scandalized together. Its hard to watch kids grow up. I have a 16yo boy at home, and there are days when I still want to say &quot;no, you&#39;re much too young for this&quot;. It doesn&#39;t help him grow up confident in himself as a person to do that, and it doesn&#39;t set me up as a trustworthy source of information, either. <br/>\n<br/>\nI don&#39;t know how mature your 11yo is, obviously, but that&#39;s less important than how mature she&#39;s already decided she is. You can&#39;t convince her she&#39;s younger than that - no matter how mistaken you believe her to be. You can only convince her to shut you out of her process. Don&#39;t tell dad... you know what He&#39;ll say.<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Concert and 11 y/o","postDate":"1271258388","msgId":43676,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxNG1laytlZzNwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhxM2JhaitzbmdzQGVHcm91cHMuY29tPg=="},"prevInTopic":43675,"nextInTopic":43677,"prevInTime":43675,"nextInTime":43677,"topicId":43648,"numMessagesInTopic":0,"msgSnippet":"... ************* I wouldn t throw one of my kids into any situation that was radically different from anything he or she had done before without some kind of","messageBody":"<div id=\"ygrps-yiv-1028394593\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;JOHN&quot; &lt;ygroups@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; She is just getting into music and that&#39;s great! I love music, and I like some of the Black Eyed Peas. But is it appropriate for her to go from liking a couple of their &quot;clean&quot; songs to a full-blown concert experience?<br/>\n </span></blockquote>*************<br/>\n<br/>\nI wouldn&#39;t throw one of my kids into any situation that was radically different from anything he or she had done before without some kind of preparation. For something like a concert, I&#39;d make sure to have plenty of samples of the group&#39;s music, maybe some live recordings, so that she could get a taste of what to expect in that regard. I&#39;d also do some research into the venue itself, find out what kind of ticketing there is (general admission or specific seats) and come up with plans for her getting lost in the press of bodies - not in a fear-mongering way, but to give her (and whoever goes with her) a greater sense of confidence in the experience. Also see if you can find videos of any concert footage to find out what kind of &quot;scene&quot; to expect - do they tend to have a space for dancing? Do they do any stage diving? Those sorts of situations present different possibilities, different risks, and its good to know all that beforehand. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Concert and 11 y/o","postDate":"1271258001","msgId":43675,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxNG0yaCtubTNyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdDQkMzNTFBLTYwMzAtNDYxNS05QTk0LUM3MDJBNjQ3REFCN0B2ZXJpem9uLm5ldD4="},"prevInTopic":43674,"nextInTopic":43676,"prevInTime":43674,"nextInTime":43676,"topicId":43648,"numMessagesInTopic":0,"msgSnippet":"... NPR had a story awhile back about a theater company putting on Shakespear plays  in what was thought to be a closer replica of period language based on","messageBody":"<div id=\"ygrps-yiv-1181083246\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I suspect the fact at 4 she was used to living  <br/>\n&gt; in the world of conversation where she wasn&#39;t getting every word but  <br/>\n&gt; picking up the gist from a few words she got and tone and context. So  <br/>\n&gt; Shakespeare wasn&#39;t that much different. It&#39;s only later when people  <br/>\n&gt; get used to understanding 90% of what they hear that they freak out  <br/>\n&gt; when they can&#39;t ;-)<br/>\n<br/>\n </span></blockquote>NPR had a story awhile back about a theater company putting on Shakespear plays  in what was thought to be a closer replica of period language based on clues in the text (yada yada yada - the point is it wasn&#39;t the &quot;usual&quot; faux English accent). There was a lot of concern about people having an even harder time understanding, especially as they were doing a lot of productions for inner city schools. What they found was the accent itself made the content more understandable to the audience - people were actually Better able to follow the story, and even get jokes that are usually missed by contemporary audiences. Without the expectation of understanding every word, they understood more. Kind of neat.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":151979431,"authorName":"Rebecca M.","from":"&quot;Rebecca M.&quot; &lt;ackirebecci@...&gt;","profile":"ackirebecci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Concert and 11 y/o","postDate":"1271255126","msgId":43673,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxNGo4bSs1ODQ1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhxM2JhaitzbmdzQGVHcm91cHMuY29tPg=="},"prevInTopic":43672,"nextInTopic":43674,"prevInTime":43672,"nextInTime":43674,"topicId":43648,"numMessagesInTopic":0,"msgSnippet":"... I think both of those things are the same extreme. It s the extreme of allowing your child informed choice . You are sharing with your child what they may","messageBody":"<div id=\"ygrps-yiv-2028599782\">&quot;JOHN&quot; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; All I&#39;m looking for is the happy medium. The happy, blissful, utopian center, where all is well and good. I posit that each of us, as parents, have our own extreme points. The extreme where we would politely say to our child, &quot;you can watch The Sixth Sense, but you might end up scared to death to sleep any more.&quot; Or, &quot;you can watch Barney, but you may lose the lunch you just ate.&quot; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I think both of those things are the same extreme. It&#39;s the extreme of allowing your child &quot;informed choice&quot;. You are sharing with your child what they may experience and allowing them to choose that experience versus make a authoritative decision on her behalf. (Although that language is pretty loaded with emotional negatives... I&#39;d stick with the cold, hard facts, if it were me.)<br/>\n<br/>\nSeeing The Black Eyed Peas in concert is a pretty special opportunity.<br/>\n<br/>\n11-year-olds have long memories.<br/>\n<br/>\nPerhaps it comes down to relationship. Would you rather she remembered the concert and the good time she had with her mom? Or would you rather her remember her resentment over not being allowed to go? Or that she was treated with trust and was allowed to make a decision to attend or not based on a open conversation with her parents?<br/>\n<br/>\nI think that&#39;s how I&#39;d look at it rather than a place of fear about what she might be exposed to while at the concert.<br/>\n<br/>\nCheers,<br/>\nRebecca</div>","specialLinks":[]},{"userId":132876517,"authorName":"AECANGORA@aol.com","from":"AECANGORA@...","profile":"amy_aec","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Concert and 11 y/o","postDate":"1271254929","msgId":43672,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQ0E5RjUwMEU0NEU2QS1BMUMtQUY2MEB3ZWJtYWlsLWQwMDYuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":43669,"nextInTopic":43673,"prevInTime":43671,"nextInTime":43673,"topicId":43648,"numMessagesInTopic":0,"msgSnippet":"You re welcome! :-) Amy C. Re: Concert and 11 y/o Posted by:      sharon            1drflmthr@gmail.com                                       sharonjemerson ","messageBody":"<div id=\"ygrps-yiv-823049089\">You&#39;re welcome! :-)<br/>\n<br/>\nAmy C.<br/>\n<br/>\n<br/>\n <br/>\n               Re: Concert and 11 y/o          <br/>\n    <br/>\nPosted by:      &quot;sharon&quot;            <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:1drflmthr@...\">1drflmthr@...</a>                                       sharonjemerson                   <br/>\n    <br/>\n      Tue Apr 13, 2010 10:26 am        (PDT)    <br/>\n                      <br/>\n<br/>\n      I like this Amy. Thanks. <br/>\nSharon<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Concert and 11 y/o","postDate":"1271252468","msgId":43674,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEyODc2OTEzLUZBODktNEZENy1BN0QyLUQyOTNBMTM0NDMzQUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGhxM2JhaitzbmdzQGVHcm91cHMuY29tPg==","referencesHeader":"PGhxM2JhaitzbmdzQGVHcm91cHMuY29tPg=="},"prevInTopic":43673,"nextInTopic":43675,"prevInTime":43673,"nextInTime":43675,"topicId":43648,"numMessagesInTopic":0,"msgSnippet":"... Anywhere you want. You re the parent. But lines are paid for by withdrawals from the relationship account. And they re fairly expensive. Every line you","messageBody":"<div id=\"ygrps-yiv-1902716404\">On Apr 13, 2010, at 11:03 PM, JOHN wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My question is, where do you draw the &quot;line?&quot;<br/>\n<br/>\n<br/>\n </span></blockquote>Anywhere you want. You&#39;re the parent.<br/>\n<br/>\nBut lines are paid for by withdrawals from the relationship account.  <br/>\nAnd they&#39;re fairly expensive. Every line you draw says &quot;I&#39;m not your  <br/>\npartner. My purpose is to make sure you don&#39;t step outside the  <br/>\nboundary lines I&#39;ve drawn.&quot;<br/>\n<br/>\nThe alternative isn&#39;t to tell the child &quot;Do whatever you want,&quot; in  <br/>\nfear of unintentionally making withdrawals. That&#39;s unparenting.  <br/>\nMindful parenting is about being more connected to your child, not  <br/>\nless. It&#39;s more connected even than conventional parenting where rules  <br/>\nand lines are substitutes for being with them.<br/>\n<br/>\nIf you were exploring at your leisure (specifically not choosing a  <br/>\nguided tour) a new and confusing but intriguing area -- Outer  <br/>\nMongolia, Japanese comics, model planes, whatever you want to fill the  <br/>\nblank in with -- which expert would you choose to ask questions and  <br/>\nadvice from: One who told you what he thought was right to explore and  <br/>\nforbid you from exploring certain areas because he thought you weren&#39;t  <br/>\nready? Or one who learned your interests and used that to point you  <br/>\ntoward what felt meshed well, pointed out areas he thought might be  <br/>\nproblematic and why (but leaving the decision up to you), helped you  <br/>\nwhen you asked, stayed out of your way when you wanted him to, watched  <br/>\nover you just enough to keep you from stepping off cliffs?<br/>\n<br/>\nYou *want* your daughter to see your line as a &quot;That&#39;s a cliff. You  <br/>\ndon&#39;t want to step there,&quot; and her to say &quot;Oh, yeah, you&#39;re right!&quot;  <br/>\nBut she won&#39;t and can&#39;t. She&#39;ll see an arbitrary line you&#39;ve drawn on  <br/>\nthe flat ground and something she wants beyond it. You&#39;re standing  <br/>\nguarding the line while she&#39;s wondering how she can get to what she  <br/>\nwants on her own.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t think any of us would want our young child to see a truly  <br/>\n&gt; traumatizing or explicit film<br/>\n<br/>\n </span></blockquote>Does your daughter want to watch explicit movies?<br/>\n<br/>\nStrawkids don&#39;t generate good discussions because strawkids don&#39;t have  <br/>\nreasons behind their actions. While it&#39;s reasonable to picture a child  <br/>\nbeing traumatized by Private Ryan, real kids have real likes and  <br/>\ndislikes and choose based on those. A child doesn&#39;t go directly from  <br/>\nBarney to Private Ryan (unless they&#39;ve been controlled and  <br/>\nartificially held at the Barney level). They will show an interest  <br/>\nthat points in that direction.<br/>\n<br/>\nThere are parents here who have kids very into horror and they&#39;ve had  <br/>\nto find ways to deal with their own feelings. If you search on  <br/>\n&quot;horror&quot; in the archives, that should pull up some threads. (Unless  <br/>\nthe Yahoo search still isn&#39;t working.) There are lots of strategies to  <br/>\nhelp kids explore what intrigues them that might frighten them. If  <br/>\nyou&#39;re your daughter&#39;s partner you can be with her and help her. If  <br/>\nyou&#39;re her adversary, she&#39;ll find a way to go it alone without someone  <br/>\nwith greater experience who can help her get past the sticky parts.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So where is the happy medium?<br/>\n<br/>\n </span></blockquote>Her own interests.<br/>\n<br/>\nIf you get to a point in a book that&#39;s getting you upset in a not good  <br/>\nway, do you keep going?<br/>\n<br/>\nWhat if your wife drew a line for you? Not just gave you information  <br/>\nfor you to decide, but drew a line and forbid you to watch TV shows  <br/>\nand read books based on her judgement for you? What if her line didn&#39;t  <br/>\nmatch up with yours and there were shows and books beyond her line  <br/>\nthat sounded interesting and she said no? (It needs to be a line you  <br/>\ndon&#39;t agree with but, for whatever reason, makes sense to her.)  Would  <br/>\nher line stop your interest in the shows and books? How would your  <br/>\noutlook towards her change? Would you feel closer to her? More  <br/>\ntrusting of her love for you? Or would it feel like she was on a power  <br/>\ntrip?<br/>\n<br/>\nAs much as parents want control to feel like love, it just can&#39;t. It  <br/>\nfeels like &quot;My need to mold you in the image I want for you is more  <br/>\nimportant than who you are.&quot; (Their likes *are* part of who they are.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But is it appropriate for her to go from liking a couple of their  <br/>\n&gt; &quot;clean&quot; songs to a full-blown concert experience?<br/>\n<br/>\n </span></blockquote>It won&#39;t help your relationship with her to think in terms of what  <br/>\nothers deem &quot;appropriate&quot; for your unique daughter. Look at her and  <br/>\nher needs and wants, likes and dislikes, not at society&#39;s judgement of  <br/>\nwhat she should need and want. Trust her to know what she likes. Help  <br/>\nher explore it. Be her partner not her adversary.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I guess if she didn&#39;t like it, she could leave (but my wife  <br/>\n&gt; mentioned the tix were like $350 each, so it would be an expensive  <br/>\n&gt; lesson... but I digress -- and no it isn&#39;t about the money<br/>\n<br/>\n </span></blockquote>At $350 for a concert it should be about the money! ;-) There are  <br/>\n*much* cheaper ways for her to explore their music to see if she likes  <br/>\nit than a $350 concert. **<br/>\n<br/>\nBut your wife said they&#39;d watched videos on YouTube so I think you&#39;re  <br/>\nprojecting *way* too much. (I checked on iTunes and only 5 of their  <br/>\nsongs needed &quot;clean&quot; versions.)<br/>\n<br/>\n(** To explore that idea a bit more: *If* there were a reasonable  <br/>\npossibility a child might decide they didn&#39;t like something expensive  <br/>\n-- a class, a camp, a video game -- a conventional parent would just  <br/>\nsay no perhaps with the added explanation that it costs too much. That  <br/>\nputs the child and parent in an adversarial relationship. For the  <br/>\nchild to get what she wants, she needs to fight back and try to win.  <br/>\nBesides the adversarial relationship, the big problem is the child  <br/>\nclutches tight to her initial offer. It&#39;s hers and she&#39;s determined to  <br/>\nwin and won&#39;t compromise. (That&#39;s the way of war. If you give up what  <br/>\nyou want you&#39;ve lost.) Often, because kids have been trained to fight  <br/>\nfor what they want, they will cling to what they want even in the face  <br/>\nof more reasonable options.<br/>\n<br/>\nFor a mindful parent, one who has won the trust of the child that  <br/>\nparent is on her side and wants her to explore what intrigues her, the  <br/>\nparent would share their concerns and work with the child to ease  <br/>\nthem. It might be a cheaper class to try it out. It might be renting  <br/>\nor borrowing the video game. It might be exploring the music on CD and  <br/>\nvideo.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The happy, blissful, utopian center, where all is well and good.<br/>\n<br/>\n </span></blockquote>You may find it for yourself but it won&#39;t feel blissful or utopian to  <br/>\nthe one you&#39;re imposing it on.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I posit that each of us, as parents, have our own extreme points.  <br/>\n&gt; The extreme where we would politely say to our child, &quot;you can watch  <br/>\n&gt; The Sixth Sense, but you might end up scared to death to sleep any  <br/>\n&gt; more.&quot; Or, &quot;you can watch Barney, but you may lose the lunch you  <br/>\n&gt; just ate.&quot;<br/>\n<br/>\n </span></blockquote>There aren&#39;t only two choices: &quot;No,&quot; or dire warnings! ;-)<br/>\n<br/>\nThe problem with this current issue is that you don&#39;t have concrete  <br/>\nfears. She&#39;s not going to a party where there might be drinking. She&#39;s  <br/>\nnot headed off to the mall to meet someone from the internet. She&#39;s  <br/>\ngoing to a concert (with her mom I assume).<br/>\n<br/>\nYou have imagined fears about what could happen but no foundation for  <br/>\nthem. What in your daughter&#39;s personality do you base your fear that  <br/>\nshe might be traumatized by more adult material? If she&#39;s shown  <br/>\nsensitivities in the past, listen to the music with her! Put it on in  <br/>\nthe car while you go somewhere. Don&#39;t use it as an excuse to share  <br/>\nyour more enlightened opinion on her with the intention to implant it  <br/>\ninto her like armor. She&#39;ll shut down and not share with you. Have a  <br/>\nconversation about the music as you might a friend. If she hasn&#39;t  <br/>\nshown sensitivities, listen to the music anyway ;-) Do it with her. It  <br/>\nwill be a way to connect through an interest.<br/>\n<br/>\nIt&#39;s very likely she wont&#39; absorb the adult content, at least not in  <br/>\nthe way an adult would. (She doesn&#39;t have the context for it.) She may  <br/>\npick up bits and pieces but it&#39;s healthier for your relationship --  <br/>\nunless she&#39;s shown sensitivity in the past -- to assume the music is  <br/>\nlike a window into another world for her. (A very dim window right now  <br/>\nsince she&#39;s only 11.)<br/>\n<br/>\nUnless you&#39;re making her home life unpleasant -- say with arbitrary  <br/>\nlines ;-) or lectures on how bad the subject matter is that a group  <br/>\nsings about -- that other life won&#39;t hold a draw for her. Intrigued  <br/>\ndoesn&#39;t mean want!  It&#39;s fascinating to dig into why people hold  <br/>\ndifferent values but that doesn&#39;t mean the values are attractive! It&#39;s  <br/>\nfun to explore worlds where the rules are different, to see what life  <br/>\nmight be like, but that&#39;s not the same as wanting to live there.<br/>\n<br/>\nBut as for your fear she&#39;ll be traumatized, unless she&#39;s shown a high  <br/>\nsensitivity to how people treat each other in the past, I don&#39;t think  <br/>\nyou have a foundation to build the fear on.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":264461697,"authorName":"JOHN","from":"&quot;JOHN&quot; &lt;ygroups@...&gt;","profile":"jmhnet1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Concert and 11 y/o","postDate":"1271214227","msgId":43669,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxM2JhaitzbmdzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDQ0E4NzE1OThDNjMxMS0xRDEwLTE1Q0NFQHdlYm1haWwtbTAzOC5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":43667,"nextInTopic":43672,"prevInTime":43668,"nextInTime":43670,"topicId":43648,"numMessagesInTopic":0,"msgSnippet":"... Amy, I m not sure I agree with your point but I do agree that throughout history, different social mores dictated varying levels of what was considered","messageBody":"<div id=\"ygrps-yiv-1326199547\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, AECANGORA@... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Weren&#39;t Shakespeare productions considered to be crude and unseemly when first preformed in England? And, now they are considered to be the height of culture and to be classics that must be studied in school and dissected to be understood.  Operas can be quite risque.   And, many &quot;classic&quot; books have been banned from libraries in the past. <br/>\n&gt; <br/>\n&gt; Amy C.<br/>\n<br/>\n </span></blockquote>Amy,<br/>\nI&#39;m not sure I agree with your point but I do agree that throughout history, different social mores dictated varying levels of what was considered &quot;proper.&quot; I don&#39;t think that matters though. For now, in this place and time, it just seems to be too much to present certain contemporary content to an 11 y/o. My question is, where do you draw the &quot;line?&quot;<br/>\nI think in terms of extremes so that I can realize that there is a middle somewhere: I don&#39;t think any of us would want our young child to see a truly traumatizing or explicit film, such as the first half hour of Saving Private Ryan, or Eyes Wide Shut, or name your own line. On the other hand, my daughter is beyond Barney and Blues Clues.<br/>\nSo where is the happy medium? <br/>\nShe is just getting into music and that&#39;s great! I love music, and I like some of the Black Eyed Peas. But is it appropriate for her to go from liking a couple of their &quot;clean&quot; songs to a full-blown concert experience? I guess if she didn&#39;t like it, she could leave (but my wife mentioned the tix were like $350 each, so it would be an expensive lesson... but I digress -- and no it isn&#39;t about the money, though I did cringe a little [ok, a lot] when I heard the price, which was AFTER I had my initial issues with this).<br/>\nAll I&#39;m looking for is the happy medium. The happy, blissful, utopian center, where all is well and good. I posit that each of us, as parents, have our own extreme points. The extreme where we would politely say to our child, &quot;you can watch The Sixth Sense, but you might end up scared to death to sleep any more.&quot; Or, &quot;you can watch Barney, but you may lose the lunch you just ate.&quot; <br/>\nWhere is it?<br/>\n<br/>\n-john</div>","specialLinks":[]},{"userId":302010303,"authorName":"sharon","from":"&quot;sharon&quot; &lt;1drflmthr@...&gt;","profile":"sharonjemerson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Concert and 11 y/o","postDate":"1271179517","msgId":43667,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxMjlkdCtvaWZ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDQ0E4NzE1OThDNjMxMS0xRDEwLTE1Q0NFQHdlYm1haWwtbTAzOC5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":43665,"nextInTopic":43669,"prevInTime":43666,"nextInTime":43668,"topicId":43648,"numMessagesInTopic":0,"msgSnippet":"I like this Amy. Thanks. Sharon","messageBody":"<div id=\"ygrps-yiv-1004172211\">I like this Amy. Thanks. <br/>\nSharon<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, AECANGORA@... wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;  OK,  I&#39;m way behind the times.  We were away part of last week and I&#39;m just catching up.  <br/>\n&gt; <br/>\n&gt; While reading the posts a thought crossed my mind.  Weren&#39;t Shakespeare productions considered to be crude and unseemly when first preformed in England? And, now they are considered to be the height of culture and to be classics that must be studied in school and dissected to be understood.  Operas can be quite risque.   And, many &quot;classic&quot; books have been banned from libraries in the past. <br/>\n&gt; <br/>\n&gt; Amy C.<br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re:  Concert and 11 y/o","postDate":"1271165453","msgId":43665,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdDQkMzNTFBLTYwMzAtNDYxNS05QTk0LUM3MDJBNjQ3REFCN0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDhDQ0E4NzE1OThDNjMxMS0xRDEwLTE1Q0NFQHdlYm1haWwtbTAzOC5zeXNvcHMuYW9sLmNvbT4=","referencesHeader":"PDhDQ0E4NzE1OThDNjMxMS0xRDEwLTE1Q0NFQHdlYm1haWwtbTAzOC5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":43649,"nextInTopic":43667,"prevInTime":43664,"nextInTime":43666,"topicId":43648,"numMessagesInTopic":0,"msgSnippet":"... They were meant to appeal to a broad audience, both high and low. They have references that would have been understandable to the educated as well as bawdy","messageBody":"<div id=\"ygrps-yiv-10984411\">On Apr 12, 2010, at 12:07 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AECANGORA@...\">AECANGORA@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Weren&#39;t Shakespeare productions considered to be crude and unseemly  <br/>\n&gt; when first preformed in England?<br/>\n<br/>\n </span></blockquote>They were meant to appeal to a broad audience, both high and low. They  <br/>\nhave references that would have been understandable to the educated as  <br/>\nwell as bawdy humor that everyone would have understood. (My total  <br/>\nguess is that would have been standard practice for the plays put on  <br/>\nfor the general public, not something unique to Shakespeare.)<br/>\n<br/>\nThe language and centuries-old references have made the plays more  <br/>\nobscure so even the bawdy humor needs explanation to fully get.  But  <br/>\nthey&#39;re not as obscure as schools lead people to believe. I took  <br/>\nKathryn to see A Midsummer&#39;s Night Dream when she was 4 and she was  <br/>\nperfectly content to sit through the whole thing and said she had no  <br/>\nproblem following the story. (We had read a couple of picture book  <br/>\nversions before hand.) I suspect the fact at 4 she was used to living  <br/>\nin the world of conversation where she wasn&#39;t getting every word but  <br/>\npicking up the gist from a few words she got and tone and context. So  <br/>\nShakespeare wasn&#39;t that much different. It&#39;s only later when people  <br/>\nget used to understanding 90% of what they hear that they freak out  <br/>\nwhen they can&#39;t ;-) They tools of drawing meaning from everything else  <br/>\nthat&#39;s going on get rusty.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":400494348,"authorName":"dana.stewart@rocketmail.com","from":"dana.stewart@...","profile":"dana.stewart@rocketmail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re:  Concert and 11 y/o","postDate":"1271089056","msgId":43649,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1ODYzNzM3OS0xMjcxMDg5MDE2LWNhcmRodV9kZWNvbWJvYnVsYXRvcl9ibGFja2JlcnJ5LnJpbS5uZXQtNTg3MTc5MDAyLUBiZGE0NTEuYmlzeC5wcm9kLm9uLmJsYWNrYmVycnk+","inReplyToHeader":"PDhDQ0E4NzE1OThDNjMxMS0xRDEwLTE1Q0NFQHdlYm1haWwtbTAzOC5zeXNvcHMuYW9sLmNvbT4=","referencesHeader":"PDhDQ0E4NzE1OThDNjMxMS0xRDEwLTE1Q0NFQHdlYm1haWwtbTAzOC5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":43648,"nextInTopic":43665,"prevInTime":43648,"nextInTime":43650,"topicId":43648,"numMessagesInTopic":0,"msgSnippet":"What a great point, Amy! You are absolutely right!!!! So funny to ponder. Dana in NYS","messageBody":"<div id=\"ygrps-yiv-1230418224\">What a great point, Amy! You are absolutely right!!!! So funny to ponder.<br/>\n<br/>\nDana in NYS</div>","specialLinks":[]},{"userId":132876517,"authorName":"AECANGORA@aol.com","from":"AECANGORA@...","profile":"amy_aec","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:  Concert and 11 y/o","postDate":"1271088433","msgId":43648,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQ0E4NzE1OThDNjMxMS0xRDEwLTE1Q0NFQHdlYm1haWwtbTAzOC5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":43649,"prevInTime":43647,"nextInTime":43649,"topicId":43648,"numMessagesInTopic":0,"msgSnippet":"OK,  I m way behind the times.  We were away part of last week and I m just catching up. While reading the posts a thought crossed my mind.  Weren t","messageBody":"<div id=\"ygrps-yiv-761165728\">OK,  I&#39;m way behind the times.  We were away part of last week and I&#39;m just catching up.  <br/>\n<br/>\nWhile reading the posts a thought crossed my mind.  Weren&#39;t Shakespeare productions considered to be crude and unseemly when first preformed in England? And, now they are considered to be the height of culture and to be classics that must be studied in school and dissected to be understood.  Operas can be quite risque.   And, many &quot;classic&quot; books have been banned from libraries in the past. <br/>\n<br/>\nAmy C.<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":43637,"nextTopicId":43691}}