{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":244360311,"authorName":"Deb","from":"&quot;Deb&quot; &lt;soggyboysmom@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I&#39;m Cari--and I&#39;m and info addict","postDate":"1136817278","msgId":8896,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRwdHM5dStnNzFsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRwc21vMStrY25xQGVHcm91cHMuY29tPg=="},"prevInTopic":8893,"nextInTopic":0,"prevInTime":8895,"nextInTime":8897,"topicId":8892,"numMessagesInTopic":0,"msgSnippet":"If having lots of books to read and crafty stuff available to create with is what they like, go for it - max out your library card (BTW our library allows an","messageBody":"<div id=\"ygrps-yiv-1520899486\">If having lots of books to read and crafty stuff available to create <br/>\nwith is what they like, go for it - max out your library card (BTW <br/>\nour library allows an &#39;associate&#39; card for 5 and 6 yr olds so each <br/>\ngirl could have her own card as well as you having one and make sure <br/>\nDH has one so you can get huge stacks of books!) We have a low <br/>\ncabinet that holds all craft type supplies readily accessible for DS <br/>\n(and me and DH too). One thing we like is to buy big rolls of brown <br/>\npaper and cover the kitchen table. We can do all sorts of &#39;projects&#39; <br/>\nwithout worrying about messes because it just rolls up and goes in <br/>\nthe trash. And we can use it to draw on as well - or rough out <br/>\ngrocery lists or explain the concept of place in numbers (ones, <br/>\ntens, hundreds, etc) or invent monsters or whatever.<br/>\n<br/>\nDS is 7 1/2 and his day is roughly:<br/>\nget up somewhere between 7 and 9 am. Watch TV a bit as he wakes up <br/>\nusually (often The Weather Channel). Play computer games or video <br/>\ngames with DH (the at home parent, I WOH fulltime). Eat somewhere in <br/>\nthere. Play more games of various sorts, build things with various <br/>\nmaterials (legos, knex, etc), watch TV, etc. Eat again eventually. <br/>\nPlay more - which may or may not include going outside to play, <br/>\ngoing to a friend&#39;s house (Friday afternoons are a standing playdate <br/>\nwith some homeschooling friends), running an errand or two, etc. <br/>\nDinner occurs when I get home from work. More TV, games, etc occurs <br/>\nin the evening, with the quieter, more sedentary types occurring <br/>\ncloser to when I head to bed (since I am the only one with a wake up <br/>\ntime, I&#39;m the only one with anything approaching a &#39;bedtime&#39;), might <br/>\ninclude a bath for one or several of us - I *love* hot bubble baths <br/>\n(with a big thick novel) and my guys got me a lovely bathtub pillow <br/>\nand some bubble bath and bath salts for Christmas so I&#39;ve been <br/>\nhaving LOTS of bubble baths lately. DS may choose a bath time as <br/>\nwell some evenings. Right now my boys are into &quot;BrikWars&quot; which is a <br/>\nminiatures game with Lego bricks and Lego mini figures. It has a <br/>\nwhole set of rules and strategies and all. And you use Lego bricks <br/>\nto make the buildings, redesign the buildings, etc. Last night, DH <br/>\nmade an armored personnel carrier to use in the game. Pretty cool! <br/>\nThat has been occupying a lot of their time lately. We&#39;ve also had <br/>\nlots of piratey stuff going on (probably influenced somewhat by <br/>\nSpongebob). Cooking and housework happen in there as well. It looks <br/>\na lot like life in general - the way life looked at your house most <br/>\nlikely before your girls got to &#39;school age&#39;.<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":95897089,"authorName":"simplemom3","from":"&quot;simplemom3&quot; &lt;sja3k@...&gt;","profile":"simplemom3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I&#39;m Cari--and I&#39;m and info addict","postDate":"1136809192","msgId":8893,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRwdGtkOCs1cGtvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRwc21vMStrY25xQGVHcm91cHMuY29tPg=="},"prevInTopic":8892,"nextInTopic":8896,"prevInTime":8892,"nextInTime":8894,"topicId":8892,"numMessagesInTopic":0,"msgSnippet":"... Then do just that.....help her get the books for reading, paper for writing, and supplies (paint? clay? beads?) she needs for whatever she wants to","messageBody":"<div id=\"ygrps-yiv-1647806080\"><blockquote><span title=\"ireply\">&gt; she loves reading, writing, and creating. <br/>\n<br/>\n </span></blockquote>Then do just that.....help her get the books for reading, paper for <br/>\nwriting, and supplies (paint? clay? beads?) she needs for whatever <br/>\nshe wants to &quot;create.&quot;  Let her go to it...just be around to help if <br/>\nshe asks for it.<br/>\n<br/>\n<br/>\nI want them to be looking for interesting <br/>\n<blockquote><span title=\"ireply\"> &gt; things to learn/discuss, especially my six year old. My almost five <br/>\n&gt; year old happily does whatever sis is doing most of the time...am I <br/>\n&gt; freaking out about nothing? <br/>\n<br/>\n </span></blockquote>Well -- in a nutshell, yes (am I freaking out over nothing?) :-)  <br/>\nYour girls (both of them) are still SO young...they could <br/>\nliterally &#39;just play&#39; all day and it would be perfectly normal and <br/>\nnatural.  If you take them places with you (shopping, appointments, <br/>\noccasional museum, park, &quot;fun&quot; place) -- that&#39;s all they &quot;need.&quot;   <br/>\nQuite honestly, I think 5 and 6 are too young to be looking <br/>\nfor &quot;interesting&quot; things to learn and discuss (no disrespect intended <br/>\nto you with that comment).  We, as parents, have all those schooly <br/>\nvoices inside of us (and outside of us!)telling us what our kids need <br/>\nto LEARN.<br/>\n<br/>\nThe most difficult concept for me to &quot;get&quot; about unschooling is that <br/>\nI had to let go of the idea that the kids had to be learning or doing <br/>\nsomething &quot;productive.&quot;  You have to understand that, especially with <br/>\nkids so young, PLAY is the most important thing...and play is <br/>\nlearning.  <br/>\n<br/>\nWelcome here...you will find much wisdom from these wonderful women.  <br/>\nAlso, go to the files and links section and read the articles/info <br/>\nregarding the philosophy of unschooling.  Search the net on <br/>\nunschooling...there&#39;s a ton o stuff out there.   <br/>\n<br/>\nSharon</div>","specialLinks":[]},{"userId":237503734,"authorName":"mamacari78","from":"&quot;mamacari78&quot; &lt;mamacari78@...&gt;","profile":"mamacari78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"I&#39;m Cari--and I&#39;m and info addict","postDate":"1136778817","msgId":8892,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRwc21vMStrY25xQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":8893,"prevInTime":8891,"nextInTime":8893,"topicId":8892,"numMessagesInTopic":0,"msgSnippet":"Hello all. I m Cari, mother of 2 little girls, Leanah(6) and Navah(4). This is our first official year of hsing, but as far as I m concerned we have been hsing","messageBody":"<div id=\"ygrps-yiv-403523819\">Hello all.<br/>\n<br/>\nI&#39;m Cari, mother of 2 little girls, Leanah(6) and Navah(4). This is <br/>\nour first official year of hsing, but as far as I&#39;m concerned we <br/>\nhave been hsing since they came out of the womb!<br/>\nI am curious to hear about how you other mom&#39;s go about your days. I <br/>\nwant to hear about how you &quot;schedule&quot; your day as unschooling moms. <br/>\nSince this is our first year, we started off with a plan that was <br/>\nobliterated in about three weeks. I tried doing the Charlotte Mason <br/>\ntype of thing, which I really like. After reading Moore&#39;s books I <br/>\nrealized Leanah is too young for all that sit-down work, even though <br/>\nshe loves reading, writing, and creating. I tried 5 in a Row, which <br/>\nalso exhausted me. The girls love 5 in a Row, but it takes so much <br/>\nout of me to &quot;put out&quot; like that each day. What I dislike most about <br/>\nit is that I feel like my girls are looking to me to entertain them <br/>\nwith school, ya know? I want them to be looking for interesting <br/>\nthings to learn/discuss, especially my six year old. My almost five <br/>\nyear old happily does whatever sis is doing most of the time...am I <br/>\nfreaking out about nothing? HELLLPPP!<br/>\nCari</div>","specialLinks":[]}],"prevTopicId":8879,"nextTopicId":8902}}