{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":220041937,"authorName":"Heather","from":"Heather &lt;hbmccarty@...&gt;","profile":"heathermccarty1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: September thoughts","postDate":"1252326504","msgId":41275,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBQTRGQzY4LjkwNzAzMDBAdHdjbnkucnIuY29tPg==","inReplyToHeader":"PGg3dXJjaSs4cGQ3QGVHcm91cHMuY29tPg==","referencesHeader":"PGg3dXJjaSs4cGQ3QGVHcm91cHMuY29tPg=="},"prevInTopic":41269,"nextInTopic":0,"prevInTime":41274,"nextInTime":41276,"topicId":41261,"numMessagesInTopic":0,"msgSnippet":"... Exactly! We put a lot of energy into figuring out a lifestyle for our kids that does meet their needs. My son first expressed interest in school at age 11,","messageBody":"<div id=\"ygrps-yiv-1077213187\">plaidpanties666 wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;  <br/>\n&gt;<br/>\n&gt; Its possible that she could be more interested in unschooling if it <br/>\n&gt; were a different lifestyle - one that fit her better. To some extent, <br/>\n&gt; that&#39;s what kids who are wanting school are saying: this lifestyle <br/>\n&gt; isn&#39;t meeting my needs.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Exactly! We put a lot of energy into figuring out a lifestyle for our <br/>\nkids that does meet their needs. My son first expressed interest in <br/>\nschool at age 11, and by really intensively finding opportunities <br/>\noutside the house he has stayed happy at home(or in the community, <br/>\nreally) until now. Things like getting VERY involved in a homeschool <br/>\nlearning center, finding all kinds of other ways to have contact with <br/>\npeople around his interests at different times- music lessons, game club <br/>\nat the university, sports, bands(lot of those), apprenticeships, jobs, <br/>\netc. He is finally going to school at age 16. A new charter school is <br/>\nopening this year that seems really interesting and several friends are <br/>\ngoing too. The teachers there have their work cut out for them to make <br/>\nthat environment more interesting than homeschooling for those kids. We <br/>\nare really curious to see if they can do it- despite having to meet <br/>\nstate requirements.<br/>\n<br/>\nI am still figuring out what will meet my daughter&#39;s needs. She also <br/>\nbecame interested in school at the same exact age, 11. Her cousins both <br/>\nattended middle school that year and she felt really left out. She <br/>\nvisited the only school option last fall and decided she is not <br/>\ninterested in that. It has been so far harder to find ways to meet her <br/>\nneeds - she is a totally different person. Less outgoing, and pretty <br/>\nreluctant to try new things and meet new people, but really not happy to <br/>\nbe at home. We go out together a lot, shopping, biking, etc. and do our <br/>\nbest to make a lot of plans with people(though as that requires their <br/>\nagreement- it isn&#39;t always successful- especially with school at home <br/>\nfamilies). She does have a few outside activities she likes to attend - <br/>\nbecause she knows people who are going. It isn&#39;t always enough, though. <br/>\nI work from home part time, and that keeps us home a lot.<br/>\n<br/>\nWe have even considered moving into the college town we live near- so it <br/>\nis easier for our kids to have access to other people and stuff to do <br/>\nevery day that way. So far that doesn&#39;t seem financially viable, as we <br/>\nneed room for  our businesses, too, but we keep looking.<br/>\n<br/>\nKeeping an open mind and being willing to stretch - time, money, <br/>\nlifestyle - to meet their needs is what has been needed to keep my kids <br/>\nhome.  It has been challenging for me - I found the earlier days, when <br/>\nthey were happy to hang with me at home more, to be more suited to my <br/>\nown preferences! But it is all very enjoyable - just a big stretch. And <br/>\nwhen they get older and I can stay home all I want - I am going to miss <br/>\nthem like crazy. It is really worth it just to enjoy their company.<br/>\n<br/>\nHeather (in NY)</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: September thoughts","postDate":"1252192466","msgId":41269,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3dXJjaSs4cGQ3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRBQTJCNjM5LjkwODAyMDFAQ29tY2FzdC5uZXQ+"},"prevInTopic":41268,"nextInTopic":41275,"prevInTime":41268,"nextInTime":41270,"topicId":41261,"numMessagesInTopic":0,"msgSnippet":"... Well, yes! Unschooling isn t something you do to kids, so trying to get a kid who is focused on school to unschool can create a lot of resentment -","messageBody":"<div id=\"ygrps-yiv-406117350\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Lori Dair &lt;loridair@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I am <br/>\n&gt; reluctantly coming to grips with the fact that my 12-year old doesn&#39;t <br/>\n&gt; really love it the way I do.  Ironically, my 7-year-old -- who really <br/>\n&gt; has a feel for unschooling and wants to do it -- is in school because my <br/>\n&gt; husband does not want me to take her out of school right now.  Maybe I&#39;m <br/>\n&gt; trying to &quot;unschool&quot; the wrong kid! <br/>\n<br/>\n </span></blockquote>Well, yes! Unschooling isn&#39;t something you do &quot;to&quot; kids, so trying to &quot;get&quot; a kid who is focused on school to unschool can create a lot of resentment - which undermines unschooling big time. Its far far better to empower kids as much as you possibly can, to make their own decisions, including decisions you don&#39;t like very much. That&#39;s challenging, but its really one of the core concepts of unschooling, empowering kids to be in charge of their own decision making. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am really am drawn to the whole lifestyle.<br/>\n<br/>\n </span></blockquote>We sometimes talk about unschooling as a lifestyle, but its not A lifestyle - its pretty individual. That&#39;s something I notice every time Ray goes to spend a few days with his bio mom. Ray&#39;s lifestyle is very different from Mo&#39;s. His needs and interests are different. Some of that is the age difference. At almost 16, Ray wants to be out and about a whole lot. This weekend he&#39;s working. He&#39;s taking three classes during the week. He goes to regular social and music events. He&#39;s busy! So we don&#39;t have the long slow, cozy days with him that we can with Mo, who&#39;s an introvert, and eight years his junior. Our lifestyle as a family is different than it would be without Ray. <br/>\n<br/>\nThat&#39;s something to think about wrt to your dd. Its possible that she could be more interested in unschooling if it were a different lifestyle - one that fit her better. To some extent, that&#39;s what kids who are wanting school are saying: this lifestyle isn&#39;t meeting my needs. Many unschoolers can find a better fit by altering the way they unschool. Not the principles, but the day to day flow. Get out more, take some classes, join some clubs, whatever. Sometimes that&#39;s not the easiest thing in the world, depending on what a kid wants to do, and what resources are locally available. <br/>\n<br/>\n---Meredith (Mo 8, Ray 15)</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: September thoughts","postDate":"1252191089","msgId":41268,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3dXExaCt1dmE4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRBQTJCNjM5LjkwODAyMDFAQ29tY2FzdC5uZXQ+"},"prevInTopic":41267,"nextInTopic":41269,"prevInTime":41267,"nextInTime":41269,"topicId":41261,"numMessagesInTopic":0,"msgSnippet":"There s a new support group over at the Radical Unschoolers Network for families where one or more kids are choosing to go to school: ","messageBody":"<div id=\"ygrps-yiv-2098601428\">There&#39;s a new support group over at the Radical Unschoolers Network for families where one or more kids are choosing to go to school:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://familyrun.ning.com/group/choosingschool\">http://familyrun.ning.com/group/choosingschool</a><br/>\n<br/>\nOne of the comments that has been made there is that girls around 12ish often see school as the only available place to spend a lot of time with other girls their age - its a developmental thing, to some extent. That might be reassuring to know!<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":152681232,"authorName":"Lori Dair","from":"Lori Dair &lt;loridair@...&gt;","profile":"loridair","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] September thoughts","postDate":"1252177465","msgId":41267,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBQTJCNjM5LjkwODAyMDFAQ29tY2FzdC5uZXQ+","inReplyToHeader":"PGg3dHY5OStpczAzQGVHcm91cHMuY29tPg==","referencesHeader":"PGg3dHY5OStpczAzQGVHcm91cHMuY29tPg=="},"prevInTopic":41261,"nextInTopic":41268,"prevInTime":41266,"nextInTime":41268,"topicId":41261,"numMessagesInTopic":0,"msgSnippet":"sistergoddesselli wrote: Sophia hates homeschooling!! And, we are sending her back to school - her choice. She has been craving her friends and wanting a","messageBody":"<div id=\"ygrps-yiv-989924519\">sistergoddesselli wrote:<br/>\n Sophia hates homeschooling!! And, we are sending her back to school - <br/>\nher choice. She has been craving her friends and wanting a locker and <br/>\nthe whole middle school experience. I think all of those shows about <br/>\nmiddle school on TV have really captivated her attention and interest.<br/>\n<br/>\n==&gt; Thanks for sharing your story.  I laughed at the part about the <br/>\nlocker.  My 12-year-old (who is in her 2nd year of unschooling) admitted <br/>\nto me yesterday that sometimes she wishes she were in school, so she <br/>\ncould have a locker.<br/>\n<br/>\nI know that I am enjoying unschooling so much more than she is, and that <br/>\nshe would prefer more structure.  We spent the entire year last year <br/>\n&quot;deschooling&quot; and I immersed myself in unschooling lists, and books, and <br/>\ngroups, and I am really am drawn to the whole lifestyle.  But I am <br/>\nreluctantly coming to grips with the fact that my 12-year old doesn&#39;t <br/>\nreally love it the way I do.  Ironically, my 7-year-old -- who really <br/>\nhas a feel for unschooling and wants to do it -- is in school because my <br/>\nhusband does not want me to take her out of school right now.  Maybe I&#39;m <br/>\ntrying to &quot;unschool&quot; the wrong kid!  In truth, I want them both home so <br/>\nwe can fully explore the unschooled life.<br/>\n<br/>\nI really hate having to still live in the schooling world, while I am so <br/>\nexcited about the freedom and joy of unschooling. <br/>\n<br/>\n--Lori<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":237471585,"authorName":"sistergoddesselli","from":"&quot;sistergoddesselli&quot; &lt;elinorsparks@...&gt;","profile":"sistergoddesselli","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"September thoughts","postDate":"1252163689","msgId":41261,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg3dHY5OStpczAzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":41267,"prevInTime":41260,"nextInTime":41262,"topicId":41261,"numMessagesInTopic":0,"msgSnippet":"Hello everyone - We started unschooling in January - two kids, Peter age 8 and Sophia age 11. Peter loves it!!  He has gotten the hang of following his bliss","messageBody":"<div id=\"ygrps-yiv-1445934872\">Hello everyone - <br/>\n<br/>\nWe started unschooling in January - two kids, Peter age 8 and Sophia age 11.<br/>\n<br/>\nPeter loves it!!  He has gotten the hang of following his bliss and it has been lovely to watch him heal and grow.  This is a kid who has had 5 open heart surgeries and numerous other medical procedures and then went to public school up through the middle of second grade - always getting into trouble for fighting and fidgeting. He never felt like he was learning anything, even in kindergarten, where they were teaching him about nursery rhymes, &quot;of all things&quot;, when his passion was animals, especially carnivores, and his favorite pass time at that point was to have mom or dad or grandpa write out long lists of all of the animals from his one of his books.  Anyway, he is having a great time now that we are unschooling and he is in charge of his learning.  <br/>\n<br/>\nIt took a while to de-school all of us, but it is fun to sit with him as he plays computer games or watches TV.  Sometimes just fun to chill, sometimes fun to answer questions about word definitions.  &quot;Mom, what does envy mean?&quot; he asks while watching some silly cartoon show.  Fun to watch him get along better with his sister and feel better about himself.  Fun to answer his question about whether he is learning anything.  &quot;Peter, you asked me what Timbuktu was.  We looked it up.  What did you learn?  Do you think any other 2nd grader you know knows all of that??  See, you are learning what you need to learn!!&quot;<br/>\n<br/>\nSophia hates homeschooling!!  And, we are sending her back to school - her choice.  She has been craving her friends and wanting a locker and the whole middle school experience.  I think all of those shows about middle school on TV have really captivated her attention and interest.  <br/>\n<br/>\nI&#39;ve had to move through feelings of shame - that homeschooling is not what she is choosing right now, that we missed the chance to get her into the &quot;Good&quot; public middle schools in our city because I took her out of school when some bullying got really mean last year, that she will be going to one of the okay but not fabulous school and that her friends will all be attending the gifted program housed within that school but she&#39;ll be in other classes, not because she is not gifted but because I was late in enrolling her and we missed the opportunity.  Ohhh, can you feel my shame!?!?!  <br/>\n<br/>\nBut, through all of this I am feeling good about letting her chose her path and supporting her in it.  We are going to get some cute clothes and school supplies and go to the doctors for her check-up.  She&#39;ll be going to school a day late so we can get all of this done.  And, the rest is up to her.  If she wants out, we&#39;ll remove her again.  If she sleeps in, I&#39;ll let her.  If she wants a better school, we may move.  If she wants private school, well, we&#39;ll have to work on that one, finances is not one of our strong points right now.<br/>\n<br/>\nAnd, I am realizing that I have LOTS of CHARGE around school.  And, I am healing, I hope.  I am putting two and two together and realizing that I simply HATE school!!!  I&#39;ve always gotten depressed at the end of the summer - my husband whole heartily agrees with this observation.  And, when I went in to register Sophia, I felt nauseous and emotional and sad.  And I&#39;ve never liked being in their elementary school building (even though it is one of the best in our city) and always felt disconnected from the other moms.  Walking around the middle school I felt like crying.  And, I really had to work to hold by my tears.<br/>\n<br/>\nI learned last year that when I was a month old, my mom had to go to work (teaching school) because my parents had been unable to sell their first house before they bought their second house and they had two mortgages.  Mom worked from the end of August, I am guessing, up through January of my first year.  Newborn me went to my aunt&#39;s house.  She had three kids, including her youngest who was 10 months old and had suffered brain damage because my aunt had had German measles during her pregnancy.  I am sure my aunty was loving and kind.  Her house has always felt like a second home to me.  But, I am also sure her plate was full and her feelings towards me complicated by my cousin&#39;s illness.  <br/>\n<br/>\nThinking about my autumn blues, I can imagine that it all started with this experience in my early life.  And, then, add to that the anxiety of going to school each year at this same time.  The blues plus anxiety - not a good combination!!  I hated that stupid &quot;Bunny Bus&quot; - that&#39;s what they called my kindergarten bus.  I hated being in a class room with Gordy Gonzales who crumbled up his cookies and stuck them in my milk.  I hated that both of my best friends/next-door-neighbors went to morning kindergarten while I was stuck in afternoon kindergarten.  I hated it all!!!!!!!  I think that once I realized I was stuck I went numb.  Numb to the whole experience.  <br/>\n<br/>\nOh, I was a good student.  All &quot;A&quot;s, wanting to go to a good college.  I had good friends in school.  Then, a serious depression hit me in my last year of high school, when my family moved to another state and allowed me to stay in Baltimore to finish high school with my friends.  I&#39;ve always felt that loosing my family that year was worse than loosing my friends would have been.  It took a long time to surface from that depression, but I have.  <br/>\n<br/>\nAnd, now, mostly, I get this autumnal blues and another blues in February.  I am aware of it, and that&#39;s good.  I am connecting it with an episode in my life, good too.  And, I am going to a counselor who specializes in trauma and attachment (Beyond Consequenses style.)  Oh, and best of all, I am unschooling my kids (even supporting Sophia in her choice to school is unschooly - she can do what she wants, not what I want her to do, and if school is what she wants, I&#39;ll support her).  Anyway, all of this is healing me. And, when mother heals, daughter can too.  <br/>\n<br/>\nWriting this down and sharing it with y&#39;all, is healing.  Thanks for reading it.  Thanks for listening.<br/>\n<br/>\nLove,<br/>\n<br/>\nElli</div>","specialLinks":[]}],"prevTopicId":41260,"nextTopicId":41214}}