{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":213809267,"authorName":"jlh44music","from":"&quot;jlh44music&quot; &lt;jlh44music@...&gt;","profile":"jlh44music","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Under Deadman&#39;s Skin","postDate":"1153930634","msgId":16005,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVhODRpYStnMDNxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU4b3ByMStqZGhkQGVHcm91cHMuY29tPg=="},"prevInTopic":15462,"nextInTopic":0,"prevInTime":16004,"nextInTime":16006,"topicId":15462,"numMessagesInTopic":0,"msgSnippet":"... She examins the First graders in her class. But she does it while trying hard to control her judgement and see where it leads her. I read this book too,","messageBody":"<div id=\"ygrps-yiv-647124783\">&quot;sandshuse&quot; &lt;sandshuse@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Under Deadman&#39;s Skin by Jane Katch, was a very interesting read. <br/>\n </span></blockquote>She examins the First graders in her class. But she does it while <br/>\ntrying hard to control her judgement and see where it leads her.&gt;&gt;<br/>\n<br/>\nI read this book too, interesting.   One thing she wrote that stood <br/>\nout for me was (talking about an older child who will be going into <br/>\nmiddle school the next year, and who she had been talking with to <br/>\nget a &quot;more experienced&quot; opinion) &quot;For a kid who often feels <br/>\npowerless in relation to adults and to other kids, the video games <br/>\nare a safe way he can feel stroing and in control.  After a bad day <br/>\nat school, he can go to this room and peacefully kill off the <br/>\nenemies, making stady progress toward an attainable goal.  With a  <br/>\nvideo game, anyone can be a dominant puppy.  It&#39;s a satisfaction in <br/>\nhis life that he can count on.  Why should he give it up?  Yet he is <br/>\nafraid of his own anger and depression, and he knows that in another <br/>\nyear he will face big changes, he&#39;ll have to leave the protection of <br/>\nhis small school where he feels relatively safe and go to a middle <br/>\nschool that is an unknown, if things got really bad, he wonders, <br/>\ncould he lose control?&quot; and &quot;If his parents forbade his games, would <br/>\nhe become more obsessed with his obsession?&quot;   then &quot;I am impressed <br/>\nwith how frequently Jason tells me his father&#39;s opinion.  These <br/>\nconversations and the relationship that surrounds them are deeply <br/>\nmeaningful to him.  Could it be true that limiting the excessive <br/>\nviolence and continuing this dialogue is a better middle ground than <br/>\ntrying to eliminate the games altogether? (helping the children to <br/>\nmake their own rules and to see the effects)&quot;<br/>\n<br/>\nHow fortunate we are to have our kids home, in an environment where <br/>\nanything is open to discussion and exploration, and where they don&#39;t <br/>\nfeel powerless in relation to adults and other kids.<br/>\nJann</div>","specialLinks":[]},{"userId":174410770,"authorName":"sandshuse","from":"&quot;sandshuse&quot; &lt;sandshuse@...&gt;","profile":"sandshuse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Under Deadman&#39;s Skin","postDate":"1152379553","msgId":15462,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU4b3ByMStqZGhkQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":16005,"prevInTime":15461,"nextInTime":15463,"topicId":15462,"numMessagesInTopic":0,"msgSnippet":"Under Deadman s Skin by Jane Katch, was a very interesting read. She examins the First graders in her class. But she does it while trying hard to control her","messageBody":"<div id=\"ygrps-yiv-1928695359\">Under Deadman&#39;s Skin by Jane Katch, was a very interesting read. She<br/>\nexamins the First graders in her class. But she does it while trying<br/>\nhard to control her judgement and see where it leads her. I&#39;m not<br/>\nclear why this book called to me, but it was one of those books. I<br/>\nfigured this might help some people who are still on the fence about<br/>\ncertain controls, mainly tv and video games. <br/>\n&quot;Parents who wish to deny that their child has murderous wishes and<br/>\nwants to tear things and even people into pieces believe that their<br/>\nchild must be prevented from engaging in such thoughts (as if this<br/>\nwere possible). By denying access to stories which implicitly tell the<br/>\nchild that others have the same fantasies, he is left to feel that he<br/>\nis the only one who imageines such things. This makes his fantasies<br/>\nreally scary. On the other hand, learning that others have the same or<br/>\nsimilar fantasies makes us feel that we are a part of humanity, and<br/>\nallays our fears that haaving such destructive ideas has put us beyond<br/>\nthe common pale.&quot;<br/>\nThis really spoke to me. I get a lot of crap because my four year<br/>\nwatches South Park, The Simpsons, and all kinds of other things many<br/>\nmain stream people think are wrong. I feel for them, I see their<br/>\npoints. Although they don&#39;t even listen to mine. Parker has learned so<br/>\nmuch in watching those shows. And he understands that it&#39;s tv, and not<br/>\nreal life. <br/>\nI think what she was saying, is that see any fantasies played out,<br/>\nmakes us all realize that we are normal or the same as everyone else.<br/>\n(okay maybe everyone else, because I have five heads. lmao)<br/>\nThanks for bearing with me. <br/>\nDanie</div>","specialLinks":[]}],"prevTopicId":16004,"nextTopicId":15989}}