{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":404848910,"authorName":"Sarah Shackleton","from":"Sarah Shackleton &lt;shackleton@...&gt;","profile":"shackleton@rocketmail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re; Unacceptable behavior","postDate":"1279155715","msgId":44531,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgxNjQyMi41OTEzNi5xbUB3ZWI2NTMwNC5tYWlsLmFjMi55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":44530,"nextInTime":44532,"topicId":44531,"numMessagesInTopic":0,"msgSnippet":"I just joined this group a week ago to find a community for unschooling as I plan to unschool my son, who s just turned three.  I had a couple of thoughts ","messageBody":"<div id=\"ygrps-yiv-268019440\">I just joined this group a week ago to find a community for unschooling as I <br/>\nplan to unschool my son, who&#39;s just turned three.  I had a couple of thoughts <br/>\nabout this situation so thought I&#39;d share them.  I have to say that I&#39;ve not <br/>\nfollowed all of the posts due to time restrictions so apologies if anyone <br/>\nalready said the same thing.  It sounds of course like things have improved but <br/>\nI&#39;ve been thinking about you  and your family a lot so thought that although it <br/>\nseems like it&#39;s getting better, I&#39;d still pass on my thoughts...<br/>\n1.  My husband is always saying how benificial martial arts are for boys and I <br/>\nwondered if it would be worth asking your son if something like that interested <br/>\nhim.  My husband says that it gives them a place to express aggression in a <br/>\ncontrolled environment and learn how to deal with anger in a safe and <br/>\nnon-personal way.  <br/>\n<br/>\n2.  Could your son take B vitamins?  I am not a nutritional and so do not know <br/>\nif children can even take Bs, but they are stress vitamins and really help with <br/>\nany stressful situations and nerves and anxiety.  <br/>\n<br/>\n3.  My husband and I are working with the most incredible man - Bill Stierle - <br/>\nand I wondered if he might be a good person for you and your son to talk to.  He <br/>\nteaches parenting as well as being a mediator -- and his philosophy would not go <br/>\nagainst the way it sounds like you are raising your children.  He talks about <br/>\nhow different people think in different ways and he shows you how to communicate <br/>\nmore effectively with someone who thinks differently to you (ie your son).  For <br/>\nexample if you are an emotional person and your son is analytical you each need <br/>\ndifferent ways of communication.  He also works with &#39;needs based communication&#39; <br/>\nand non-violent  communication.  Obviously I am paraphrasing and it&#39;s relatively <br/>\nnew to me.  What I do know is how absolutely amazing he is with children and <br/>\nworking out their needs.  To see him with children is just an eyeopener.  And he <br/>\nis not a therapist so it would not be therapy as such, just a way to more <br/>\nefficiently communicate and to find out the core of your son&#39;s troubles and <br/>\nneed.  <br/>\n<br/>\nThanks for the group, I&#39;m looking forward to the adventure of unschoolling.  <br/>\nBest wishes, Sarah <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":44521,"nextTopicId":44538}}