{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":196677035,"authorName":"Tina Tarbutton","from":"Tina Tarbutton &lt;tina.tarbutton@...&gt;","profile":"dravensmomhome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Lots of little Ah-ha moments!","postDate":"1271152698","msgId":43663,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PG0ydjRhMmIyODQyMTAwNDEzMDI1OHo5ZWQ3OWUzZHNjMTM4YjBlMjUxYjNkOTRAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGhwdnJjaStuOTU0QGVHcm91cHMuY29tPg==","referencesHeader":"PGwyejRhMmIyODQyMTAwNDEyMDU0MXg2NzczOTFmYnU1MGNlMjM2NjBlMWUzY2IyQG1haWwuZ21haWwuY29tPgkgPGhwdnJjaStuOTU0QGVHcm91cHMuY29tPg=="},"prevInTopic":43652,"nextInTopic":0,"prevInTime":43662,"nextInTime":43664,"topicId":43644,"numMessagesInTopic":0,"msgSnippet":"I don t mind being quoted at all.  I hope it can help someone else. Tina On Mon, Apr 12, 2010 at 3:13 PM, plaidpanties666 ... [Non-text portions of this","messageBody":"<div id=\"ygrps-yiv-1839054996\">I don&#39;t mind being quoted at all.  I hope it can help someone else.<br/>\n<br/>\nTina<br/>\n<br/>\nOn Mon, Apr 12, 2010 at 3:13 PM, plaidpanties666<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Tina, that&#39;s gorgeous! Thanks for taking the time to update us all. Do you<br/>\n&gt; mind being quoted elsewhere? Its such a wonderful story.<br/>\n&gt; Meredith<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Lots of little Ah-ha moments!","postDate":"1271099602","msgId":43652,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhwdnJjaStuOTU0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGwyejRhMmIyODQyMTAwNDEyMDU0MXg2NzczOTFmYnU1MGNlMjM2NjBlMWUzY2IyQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":43644,"nextInTopic":43663,"prevInTime":43651,"nextInTime":43653,"topicId":43644,"numMessagesInTopic":0,"msgSnippet":"Tina, that s gorgeous! Thanks for taking the time to update us all. Do you mind being quoted elsewhere? Its such a wonderful story. Meredith","messageBody":"<div id=\"ygrps-yiv-1849567619\">Tina, that&#39;s gorgeous! Thanks for taking the time to update us all. Do you mind being quoted elsewhere? Its such a wonderful story.<br/>\nMeredith</div>","specialLinks":[]},{"userId":196677035,"authorName":"Tina Tarbutton","from":"Tina Tarbutton &lt;tina.tarbutton@...&gt;","profile":"dravensmomhome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Lots of little Ah-ha moments!","postDate":"1271076087","msgId":43644,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGwyejRhMmIyODQyMTAwNDEyMDU0MXg2NzczOTFmYnU1MGNlMjM2NjBlMWUzY2IyQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":43652,"prevInTime":43643,"nextInTime":43645,"topicId":43644,"numMessagesInTopic":0,"msgSnippet":"The last few days have been filled with wonderful little moments. I realized, when Draven offered to pump the gas for me, that he does quite a lot of helpful","messageBody":"<div id=\"ygrps-yiv-624310412\">The last few days have been filled with wonderful little moments.<br/>\n<br/>\nI realized, when Draven offered to pump the gas for me, that he does quite a<br/>\nlot of helpful things without being asked . . . all of those things I&#39;ve<br/>\nnever forced him to do.  He offers to cook meals when my sleep schedule is<br/>\nall wacky from overnight shifts, he offers to swipe the debit card, he<br/>\noffers to pay for and pump the gas.  He used to offer to clean quite often,<br/>\nuntil I started making it his &quot;job&quot;.<br/>\n<br/>\nI mentioned before that we have an 18 y/o staying with us.  She is wonderful<br/>\nabout jumping in to help when we&#39;re doing something, but hasn&#39;t taken<br/>\nthe initiative to start any cleaning on her own.  At her moms house it<br/>\nsounds like she was the unpaid maid, so while on one hand I completely<br/>\nunderstand her lack of interest in washing dishes, but on the other hand I<br/>\nwas very frustrated that neither she or Draven had been doing much around<br/>\nthe house while Parker and I were working.  Yesterday early morning when I<br/>\ngot home from work I did a ton of dishes, washed them all and stacked them<br/>\nto dry on towels covering most of our counter space and the top of the<br/>\nstove.  I started to leave a list for them to take care of during the day<br/>\n(taking the trash out, putting away the dishes) while I was sleeping, but<br/>\nthen decided I was setting myself up to be even more frustrated if the<br/>\ndidn&#39;t see or didn&#39;t do what was on the list, so in place of a list I wrote<br/>\n&quot;I love our little family&quot;.   Last night before I went to work Parker<br/>\nstarted gathering the trash and asked if anyone would be willing to help,<br/>\nboth Dollie and Draven cheerfully said they would, and the three of them got<br/>\nall of the trash out and down to the curb.  An hour or so later I was on the<br/>\nphone with Parker and she said she heard them putting the dishes away while<br/>\nlaughing and joking, she hadn&#39;t asked them to.  This morning I came home to<br/>\nsee all of last nights dishes had been washed and set out to dry.<br/>\n No disappointment, no frustration, no bickering, just a family making sure<br/>\neverything gets done.<br/>\n<br/>\nWhen I got home this morning on my desk was my son&#39;s DSI, with a post it<br/>\nnote asking me to listen to some of the sound files and signed I &lt;heart&gt;<br/>\nyou.  Spread out over 4 sound files was a wonderful little song he sang<br/>\nabout our family (including his father).  I liked finding that so much more<br/>\nthen I would have liked finding a list of things to do.  I&#39;m glad I left a<br/>\nloving note instead of a list before I went to bed.<br/>\n<br/>\nA few days ago Parker and I were cuddling with Draven and it turned into us<br/>\ntickling him, he started fighting back violently, which was normally the<br/>\ntime that I&#39;d stop tickling, even though for awhile now we&#39;ve had stop as<br/>\nour boundary word when he really does want something to stop.  This time<br/>\ninstead of assuming we needed to stop because it was getting violent, I<br/>\nasked him if he wanted to stop, he didn&#39;t, so I asked Parker if she was okay<br/>\nwith him fighting back like that (she was at his feet and he was kicking<br/>\nquite hard), we were all fine with it.  So, we continued tickling and he<br/>\ncontinued &quot;trying&quot; to kick and punch at us over it, and we held his feet and<br/>\nblocked his punches the whole while laughing and giggling and barely being<br/>\nable to catch our breath.  He occasionally said stop so he could catch his<br/>\nbreath, and eventually started adding rules (you can tickle me here, but not<br/>\nhere) and even later explained that he couldn&#39;t really control his kicking<br/>\nwhen we tickled in certain spots and he didn&#39;t want to hurt one of us.  It<br/>\nsounds pretty violent when I type it out, but it wasn&#39;t a negative thing at<br/>\nall.  After we finished he went back to playing one of his games and I<br/>\nnoticed he got a lot less frustrated when he had a hard time.  Ah-ha!  He<br/>\nneeded the rough play to get some frustration out.  Over the last few days<br/>\nhe&#39;s been less frustrated in general.  You know, he didn&#39;t have frustration<br/>\nand anger problems when he was younger and we used to mock fight on a fairly<br/>\nregular basis . . . wish I would have put those two together a lot earlier.<br/>\n<br/>\nI&#39;m also noticing my view of things changing.  Not just at home, but at work<br/>\nas well.  I&#39;m doing a much better job of accepting EVERYONE for who they<br/>\nare, and not expecting them to be who I want them to be.  I&#39;m appreciating<br/>\nthe job my coworkers do instead of getting frustrated that they didn&#39;t do<br/>\nwhat I expected or wanted them to do.<br/>\n<br/>\nParker is getting a lot more on board with this too.  A few days ago Draven<br/>\nasked if he could play Grand Theft Auto, something I&#39;ve NEVER let him play<br/>\nbefore, and it&#39;s only in the house because Parker used to play it.  I had<br/>\nalready said yes to Devil May cry, and stopped restricting how long he could<br/>\nplay Halo . . . but Grand Theft Auto . . . I completely freaked (internally,<br/>\nexternally my response was &quot;let me think about it, and I think I need to<br/>\ntalk to Parker about it too&quot;.  So I called her, and I asked her, and she<br/>\nsaid we should say yes, and that if I thought I could do it without<br/>\nfreaking, I should probably sit with him and see what he likes about the<br/>\ngame and what he does with it.  It is a pretty violent game, but I think he<br/>\nhad more fun playing with the cheats (invisible cars and flying cars seem to<br/>\nbe a favorite) then he had beating people up.  I think it&#39;ll be okay.<br/>\n<br/>\nIt&#39;s been a good week!  We&#39;ve had a few bad moments, but lots of good ones,<br/>\nand we&#39;re all getting better at this whole concept, day by day.<br/>\n<br/>\nTina<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":43646,"nextTopicId":43670}}