{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":240807615,"authorName":"PAULA PARMENTER","from":"&quot;PAULA PARMENTER&quot; &lt;bead@...&gt;","profile":"paulaparmenter","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:Our Unschooling story","postDate":"1137945984","msgId":9522,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMTIyMTYwNjI0LjFENTMzMUNFMzA0QHdzMS02LnVzNC5vdXRibGF6ZS5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":9521,"nextInTime":9523,"topicId":9522,"numMessagesInTopic":0,"msgSnippet":"I cannot even begin to express my relief at discovering that there was such a thing as unschooling ! When my daughter was an infant we practiced attachment","messageBody":"<div id=\"ygrps-yiv-157973793\">I cannot even begin to express my relief at discovering that there was such a thing as &quot;unschooling&quot;! When my daughter was an infant we practiced &quot;attachment&quot; parenting. As she grew we really enjoyed her. We allowed her to make her own choices (from hair style, to food, to what she wore each day). We have always treated her with lots of respect and have given her lots of freedom. My father was an abused child, so we decided never to spank our child.  She really never seems to need much &quot;punishment&quot; - we never &quot;punish&quot; her for mistakes and there is never much direct disobedience (that we do &quot;punish&quot; for). She is such a mature, bright, stubborn, creative child/almost  teenager.<br/>\n<br/>\nWhen she was little, my husband was the school nurse for Vista (CA)School District&#39;s Fifth Grade Camp for eight years. He was shocked by how little these children seemed to know, some could not even tell him where their parents worked or knew the own phone numbers! One of the Naturalists was deeply involved in home schooling and was an outspoken advocate for alternatives to sending his kids to school, but he was not an &quot;unschooler&quot;. We listened to him and when we tried to get my daughter into kindergarten a little early (she was ready, she already knew almost everything they would teach in in kindergarten academically), the superintendent of her school district told us that there was a certain cutoff date, her birthday was after that cut off, she would not let her start early and &quot;if we did not like that decision, we could always home school her&quot;. Some of the best advice we have ever received. She has never been to public/private school. My husband has always supported that decision. My mother-in-law and the rest of his family will never approve and/or understand it, but they don&#39;t have to, this is our child.<br/>\n<br/>\nWe had a lot of trouble at first because Azure is very strong willed and absolutely hates to be &quot;pushed&quot;. She was so behind in her reading and spelling at one time that I was beginning to panic. I tried everything that I could think of without much success. Finally I just quit. I decided to leave it up to her and was I shocked to find that within two months she was reading at or above what I considered &quot;grade level&quot;! We then decided to let her lead the way on the other subjects as well and it is working. This way of learning was so unusual to me that I was wondering if we were the only ones home schooling this way, and why was it working so well for our daughter? Thanks to the unschooling lists and Sandra Dodd, now I know that we are not alone and have the answer to my question. <br/>\n<br/>\nWe love unschooling and our child is so busy with living her life that I know she would never have been happy in a school setting, even home schooling was too structured. She volunteers for the Phoenix Zoo, HALO (a cat & dog rescue group), AZ Cats (a Trap/Neuter/Return program for feral cats)- she just received their Junior Volunteer of the Year award, and at the local library - she did their teen volunteer program last summer and is on the teen council. She is a corporal in the Young Marines program and has 17 ribbons (including Life Saving in the 3rd Degree for saving a cat&#39;s life at a AZ Cats clinic). One of the ribbons is for Community Service, she has it and three stars which equals 200 hours of community service (impossible to achieve if you are stuck in school all day). She regularly writes articles for the Esprit YM magazine. She loves the internet and esp. Marapets. She loves Japanese Anime, esp. FMA. We also have a lot of pets (a &quot;family zoo&quot;) that she helps care for. She does not watch much T.V. but does watch DVDs a lot. At 12, she already has a good idea of what she wants as a career when she is older. I still don&#39;t know what I want to do when I &quot;grow up&quot;. Her latest adventure is to try to get into Arizona Animal Welfare League&#39;s Teen Tracks program (for teens interested in animal related careers). As she would say &quot;UNSCHOOLING ROCKS!!!&quot;<br/>\n<br/>\n<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; Subject: Re: Your Unschooling Story please...<br/>\n&gt; <br/>\n&gt;   -----Original Message-----<br/>\n&gt; Which parent chose to unschool in your home, was it a mutual decision before<br/>\n&gt; having kids, was it something you stumbled upon while researching<br/>\n&gt; homeschooling and it just resonated with one of you, if it was not a mutual<br/>\n&gt; decision, how did you explain it to your SO or convince them, basically what<br/>\n&gt; is your story of how unschooling became a part of your life?<br/>\n<br/>\n<br/>\n </span></blockquote>-- <br/>\n___________________________________________________<br/>\nPlay 100s of games for FREE! <a rel=\"nofollow\" target=\"_blank\" href=\"http://games.mail.com/\">http://games.mail.com/</a></div>","specialLinks":[]}],"prevTopicId":9514,"nextTopicId":9506}}