{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: My youngest","postDate":"1288504567","msgId":45218,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdDMzM3QzQ1NzlGRjRGMUU5RkVDMzIxQjYwQjg0MThCQENvbm5pZVBDPg==","inReplyToHeader":"PGlhaGNnZCthbTJlQGVHcm91cHMuY29tPg==","referencesHeader":"PGlhaGNnZCthbTJlQGVHcm91cHMuY29tPg=="},"prevInTopic":45200,"nextInTopic":0,"prevInTime":45217,"nextInTime":45219,"topicId":45190,"numMessagesInTopic":0,"msgSnippet":"... You could also try a backpack that would allow him to ride on your back for short periods. When we go out, I will sometimes have the stroller and the","messageBody":"<div id=\"ygrps-yiv-1742379504\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;I know that doesn&#39;t sound like the greatest of options, but punishing him won&#39;t help (tried it!), explaining won&#39;t help, restraints will get you a lot of big, dramatic, public battles, and depending on things like hand-holding or a stroller will fake you out at the worst possible moment and he&#39;ll be off before you know. Certainly if you&#39;re going to try a long trip it may be a good idea to Bring something like a stroller, to hold coats and lunches if nothing else, but don&#39;t depend on it to keep a busy, active little one contained.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>You could also try a backpack that would allow him to ride on your back for short periods. When we go out, I will sometimes have the stroller and the sling/carrier so that my little ones can alternate between riding on me, riding in the stroller, and walking. We have found it best to make our outings short and we try to avoid anything that has any kind of time limit or requires strict cooperation. I very seldom take the kids out by myself because it is impossible for me to keep up with the two younger ones. If one of my younger ones is trying to bolt, one of the adults will take that one to the car or will follow them. If we go shopping, the other adult will take the kids and avoid waiting in lines with the two little ones (21 months and 3.5). <br/>\n<br/>\nConnie<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: My youngest","postDate":"1288451405","msgId":45200,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhaGNnZCthbTJlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlhZzlkNCt0NWNoQGVHcm91cHMuY29tPg=="},"prevInTopic":45190,"nextInTopic":45218,"prevInTime":45199,"nextInTime":45201,"topicId":45190,"numMessagesInTopic":0,"msgSnippet":"... **************** Any time you go out with him, have one adult whose solemn duty it is to focus on his needs and keep him safe. That may mean big group","messageBody":"<div id=\"ygrps-yiv-260678014\">&quot;vwmomof3&quot; &lt;vwmomof3@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; He&#39;s like this when it&#39;s just us (my husband and I, and his sister who is almost 5 and his brother who is 7).  And when we are in a group.  Usually 10 kids with, 2 others his age.    <br/>\n </span></blockquote>****************<br/>\n<br/>\nAny time you go out with him, have one adult whose solemn duty it is to focus on his needs and keep him safe. That may mean big group events don&#39;t work with him along for now. It may mean that family outtings get cut back for awhile if adults don&#39;t have the energy to keep tabs on the little guy. Its just &quot;for now&quot; - he Will outgrow this! <br/>\n<br/>\nI&#39;ve been there! Ray had a knack for getting into things - he was the kid who would pull a can out from the bottom of a stacked display and bring the whole thing down, or climb up the shelves (or on other people&#39;s cars), or pull over a rack of clothes out of sheer high spiritedness. Trying to contain or control him left me and his dad (and everyone else) pulling out our hair - like your guy, sometimes he&#39;d be just fine, but then Whoosh! and it would be too late. Having one person focused on engaging with him, talking with him, being his buddy, set things up so that person could notice when Ray would get interested in something and could then help him explore in ways that didn&#39;t get him hurt or thrown out of shops. <br/>\n<br/>\nBut that did mean cutting back outtings to those times when I or George had the energy to deal or we could find some other adult/teen who knew Ray&#39;s capabilities and would appreciate the need for vigilance. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; And he&#39;d walk for a minute then just flop to the ground throwing a fit.  So I&#39;d pick him up and continue.  I tried talking to him and tried a variety of things and he would just continue on no matter what.  Then out of the blue he was back to normal and walked the rest of the way. <br/>\n </span></blockquote>********************<br/>\n<br/>\nSounds like he needed a break and once he&#39;d rested a bit he was better able to focus. That sort of thing is inconvenient when out with a group or on a timetable (like needing to catch a bus/train/ferry)! So its important to take all that into account when planning a trip. Plan shorter days so You still have energy to carry him, or smaller groups so y&#39;all can stop more easily, or earlier in the day so missing the bus/train/ferry means there&#39;s another to catch later - or maybe the little guy doesn&#39;t need to go on this trip. He&#39;s only 3, there will be other museum visits. <br/>\n<br/>\nI know that doesn&#39;t sound like the greatest of options, but punishing him won&#39;t help (tried it!), explaining won&#39;t help, restraints will get you a lot of big, dramatic, public battles, and depending on things like hand-holding or a stroller will fake you out at the worst possible moment and he&#39;ll be off before you know. Certainly if you&#39;re going to try a long trip it may be a good idea to Bring something like a stroller, to hold coats and lunches if nothing else, but don&#39;t depend on it to keep a busy, active little one contained. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":402695638,"authorName":"vwmomof3","from":"&quot;vwmomof3&quot; &lt;vwmomof3@...&gt;","profile":"vwmomof3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"My youngest","postDate":"1288415460","msgId":45190,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhZzlkNCt0NWNoQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":45200,"prevInTime":45189,"nextInTime":45191,"topicId":45190,"numMessagesInTopic":0,"msgSnippet":"My youngest son is 3 years old, he will be 4 in Feb. and he is very independent, he has a wild streak, and he is a wander-er.  He loves getting into things and","messageBody":"<div id=\"ygrps-yiv-1059221782\">My youngest son is 3 years old, he will be 4 in Feb. and he is very independent, he has a wild streak, and he is a wander-er.  He loves getting into things and doing things himself and everything.  At home this is fine, but my problem is when we are out intown.  The last time we went to the city with a whole group we had all the little ones holding a jump rope, since we didn&#39;t have enough hands to go around and they loved it (kind of like follow the leader in a way)! I took up the tail end of the rope and there were a few times that we had to quickly cross the streets because we were the last in the group and my son happened to be on the end of the rope.  So I&#39;d tell them we&#39;d have to go quickly and I&#39;d take his and the other child&#39;s hand and we&#39;d hurry up across the road (since the red hand was flashing).  The second time I did this he had a melt down.  <br/>\n<br/>\nI understood he didn&#39;t want to hold my hand so I tried to get him to get up off the ground and just take the rope so we could continue on.  But then he didn&#39;t want to hold the rope either, so asked him if he could just hold my hand (we were in Seattle coming back from the children&#39;s museum and the sidewalks were busy and the vehicle traffic was heavy).  And he&#39;d walk for a minute then just flop to the ground throwing a fit.  So I&#39;d pick him up and continue.  I tried talking to him and tried a variety of things and he would just continue on no matter what.  Then out of the blue he was back to normal and walked the rest of the way. <br/>\n<br/>\nAnd we didn&#39;t have a problem again until we were leaving the ferry and everyone took hands and he wanted to walk alone.  Yet it&#39;s always so busy getting off the ferry and he&#39;s so quick on his own that if I don&#39;t take his hand and he won&#39;t hold anyone elses hand he&#39;d be off weaving in and out of feet and legs and gone in a flash.  <br/>\n<br/>\nHow would you handle him.  This is only one event, he is like this so often and I just don&#39;t know what to do.  He&#39;s like this when it&#39;s just us (my husband and I, and his sister who is almost 5 and his brother who is 7).  And when we are in a group.  Usually 10 kids with, 2 others his age.    <br/>\n<br/>\nIt would be one thing if he listened when I&#39;d call out to wait up or stop (like at a road crossing) but it&#39;s like he just ignores anything said at all in addition to everything else. <br/>\n<br/>\nSo I&#39;m courious what your suggestions would be because I&#39;m at a loss. <br/>\n<br/>\n~Megan</div>","specialLinks":[]}],"prevTopicId":45184,"nextTopicId":45219}}