{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:While we are asking questions..","postDate":"1193235486","msgId":27285,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1Mzk0QzJFQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":27272,"nextInTopic":0,"prevInTime":27284,"nextInTime":27286,"topicId":27254,"numMessagesInTopic":0,"msgSnippet":"He already DOES have that option except on the rare (maybe 2 or 3 times per year on average) times that DH and I both have something scheduled on the same day.","messageBody":"<div id=\"ygrps-yiv-2137999036\">He already DOES have that option except on the rare (maybe 2 or 3 times<br/>\nper year on average) times that DH and I both have something scheduled<br/>\non the same day. It&#39;s not like DH and I are fulltime preachers or<br/>\nchoirmasters or whatever where BOTH of us &quot;have to&quot; be there EVERY week.<br/>\nMost of the time, though, DS likes getting to see some favorite people<br/>\n(not just the other kids) so it&#39;s an okay trade off for him (that&#39;s his<br/>\nopinion not mine) - DS and I get some extra one on one time (and<br/>\nsometimes our discussions veer rather widely from the ostensible topic<br/>\nof discussion lol), he sits and plays on his DS for an hour give or<br/>\ntake, then he runs and plays and chats. Then we go out to lunch. He has<br/>\nalso taken on a couple responsibilities for his own self - not stuff<br/>\nanyone has requested of him, but off he goes to do it and he even<br/>\nmentioned something about it when we were on vacation, wondering if it<br/>\nwas going to get done and who would take care of it.<br/>\n <br/>\nAnd, NO we haven&#39;t chosen this OVER him - this is something we&#39;ve<br/>\ndiscussed over many many weeks (going back two or three YEARS and<br/>\nrevisiting it regularly) because being there regularly (which is not<br/>\nnecessarily every week) is important to me and to DH (for our own Selves<br/>\n- remember all those posts about how *everyone* in the family&#39;s needs<br/>\nneed to be considered, not just mom, or dad, or kids?). <br/>\n <br/>\nDeb<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":299286442,"authorName":"Cameron Parham","from":"Cameron Parham &lt;acsp2205@...&gt;","profile":"acsp2205","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re:While we are asking questions..","postDate":"1193169954","msgId":27272,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzNTc4OS43MDc2My5xbUB3ZWI1OTIxNC5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":27264,"nextInTopic":27285,"prevInTime":27271,"nextInTime":27273,"topicId":27254,"numMessagesInTopic":0,"msgSnippet":"It sounds to me like you ve chosen church responsibilities over your son; he has to leave the comfort of his home and bring along headphones just to be with","messageBody":"<div id=\"ygrps-yiv-757187614\">It sounds to me <br/>\nlike you&#39;ve chosen church responsibilities over your son; he has to <br/>\nleave the comfort of his home and bring along headphones just to be <br/>\nwith the people he loves most. <br/>\n<br/>\nActually I did give up going to church after trying many, but finding my kids didn&#39;t want to go to any of them.  So in this case I made a different choice. However, we all seek  balance in our lives and seek to model that as adults we scan still pursue our interests, including but not limited to our kids. I am certain that this list encourages that balance...and of course how to find it is worked out differently in each family and in the different seasons of our lives.  If  this child who attends church with his headphones on enjoys many activities of his personal choosing and with the cooperation of his family, then to cooperate with them and attend church seems...at least not so bad as &quot;choosing church responsibilities over your son&quot; implies. This may be very important to these parents.  They may find it a serious hardship to give it up.  There may be consequences to this family if the parents are made to feel guilty for pursuing this interest. This<br/>\n list often advises that we seek not to place different family members&#39; needs and wants in an adversarial postion. That we seek the &quot;both&quot; rather that the &quot;either/or&quot; way.  Of  course there isn&#39;t enough of the story for me to have an opinion about what this family should do.  I am not trying to hold that opinion. I am interested in the issue of how we model a full, creative life and balance that with our kids&#39; full lives.  It isn&#39;t easy for me...I suspect I am overly prone to neglect myself!  For example, I get so much good from this list and a couple of others, but I hardly ever get the time to read them.  And just last night I chose to watch movies with my night-owl 13yods until 2:30 am, then get up at 5:00am and work all day (job). My choice, my pleasure, also my exhaustion with less energy for the kids who will be picked up from our homeschooling sittera nad need my attention (And I&#39;v missed them!)  If  I wonder if my kids are creatively exploring<br/>\n their potentials I&#39;ll be asked if I am exploring my own and modeling that.  A good and fair question., both. (I am not the actual one who asked it).  It is a balance that can elude my grasp....thanks, hope that this makes sense.  Maybe I am asking if people here can see a different way for this family than placing these needs in competition?<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"&quot;Sylvia Toyama&quot; &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:While we are asking questions..","postDate":"1193149983","msgId":27264,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmbDBtditjZDk5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1Mzk0QzBEQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":27263,"nextInTopic":27272,"prevInTime":27263,"nextInTime":27265,"topicId":27254,"numMessagesInTopic":0,"msgSnippet":"We also have an agreement that IF DH and I have no responsibilities that day at church, one or both of us can stay home with him on occasion. If it seems like","messageBody":"<div id=\"ygrps-yiv-306110000\">We also have an agreement that IF DH and I have no responsibilities <br/>\nthat day at church, one or both of us can stay home with him on <br/>\noccasion. If it seems like he&#39;s wanting to stay home more than usual, <br/>\nthat&#39;s time to sit down and discuss what&#39;s happening and what we can <br/>\ndo about the situation.<br/>\n<br/>\n*****<br/>\nWould you be willing to resign from your church responsibilities so <br/>\nthat your son could have the choice of staying home from church every <br/>\nweek?  <br/>\n<br/>\nIt&#39;s nice that you allow him to bring his headphones and don&#39;t <br/>\nrequire him to participate in the service.  It seems to me that he&#39;s <br/>\nmaking a bigger concession to someone else&#39;s desires. It sounds to me <br/>\nlike you&#39;ve chosen church responsibilities over your son; he has to <br/>\nleave the comfort of his home and bring along headphones just to be <br/>\nwith the people he loves most.   <br/>\n<br/>\nSylvia</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:While we are asking questions..","postDate":"1193147009","msgId":27263,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1Mzk0QzBEQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":27255,"nextInTopic":27264,"prevInTime":27262,"nextInTime":27264,"topicId":27254,"numMessagesInTopic":0,"msgSnippet":"We don t make DS go to Bible class exactly - he can t stay home (he s 9 and not comfortable being home alone for any length of time) but he has options","messageBody":"<div id=\"ygrps-yiv-123512260\">We don&#39;t make DS go to Bible class exactly - he can&#39;t stay home (he&#39;s 9<br/>\nand not comfortable being home alone for any length of time) but he has<br/>\noptions available to him. Currently, we have a one on one Bible study<br/>\ntime during the usual Bible class time. We also have an agreement that<br/>\nIF DH and I have no responsibilities that day at church, one or both of<br/>\nus can stay home with him on occasion. If it seems like he&#39;s wanting to<br/>\nstay home more than usual, that&#39;s time to sit down and discuss what&#39;s<br/>\nhappening and what we can do about the situation. As far as the worship<br/>\ntime, we just bring a tote with a water bottle, snack (quiet snacks, NOT<br/>\nPringles lol), paper and writing implements, and his Nintendo DS, games,<br/>\ncharger, and headphones (and we sit in the back near an outlet just in<br/>\ncase). Yeah, we&#39;ve gotten odd looks from time to time when DS is sitting<br/>\nthere with his headphones on but (so far) no one has dared challenge us<br/>\non it, regardless of their own opinions. Fine with me. <br/>\n <br/>\nWe&#39;re rarely involved in &#39;group&#39; activities like scouts because DS<br/>\nchooses not to. If we see something (scouts, soccer camp, martial arts,<br/>\netc) that might be of interest, we bring it up and discuss it and see if<br/>\nhe&#39;d like to sample it. He liked the beginner&#39;s soccer camp (short, lots<br/>\nof fun games) but not the more advanced, so that stopped. He&#39;s never<br/>\nbeen interested in scouting - I guess it seems to school like for him.<br/>\nHe knows a couple of kids who are involved in martial arts and organized<br/>\nbaseball leagues and doesn&#39;t want to get involved in either - too much<br/>\ntime commitment for his taste (not to mention that most team sports type<br/>\nthings involved lots of standing around for a few minutes of activity -<br/>\nhe&#39;d rather be in control of the activity level, so golf has been a<br/>\nhit).<br/>\n <br/>\nDeb <br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] While we are asking questions..","postDate":"1193100672","msgId":27255,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMwQzdFOTA0LTY5NzMtNDNEMy04REZBLUM5N0VBQjA2Qzg1NUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwMWEwMWM4MTUwOSRjOTE0NTEyMCQ2NTAxYThjMEBMSUJSQVJZPg==","referencesHeader":"PDAwMWEwMWM4MTUwOSRjOTE0NTEyMCQ2NTAxYThjMEBMSUJSQVJZPg=="},"prevInTopic":27254,"nextInTopic":27263,"prevInTime":27254,"nextInTime":27256,"topicId":27254,"numMessagesInTopic":0,"msgSnippet":"If I had it to do over  -- I d try to have fewer activities that involve regular, scheduled commitments. It is easy to get involved in lots of activities","messageBody":"<div id=\"ygrps-yiv-1872659230\">If I had it to do over &lt;G&gt; -- I&#39;d try to have fewer activities that  <br/>\ninvolve regular, scheduled commitments.<br/>\n<br/>\nIt is easy to get involved in lots of activities that each,  <br/>\nindividually, are great, but, put together, add up to a little too much.<br/>\n<br/>\nThere is a LOT to be said for the joys of flexible time.<br/>\n<br/>\nWhat I&#39;d recommend is noticing that the kids are saying, &quot;No, I don&#39;t  <br/>\nfee like going.&quot; If that happens very occasionally, then I would just  <br/>\ngo along with it for then. If it is happening fairly often, though,  <br/>\nI&#39;d consider it a sign that they need help reducing the amount of  <br/>\nscheduled stuff.<br/>\n<br/>\nI&#39;m not saying you tell them, &quot;If you don&#39;t go, then you have to drop  <br/>\nout.&quot; That&#39;s punishment and makes them feel they failed by not  <br/>\nwanting to go. But, if they are resisting going to activities, then  <br/>\nthat&#39;s your cue that they need help in cutting back.<br/>\n<br/>\nMaybe find good transition times, if possible, to say, &quot;Seems like it  <br/>\nwould be nice to have more free time to spend playing games and going  <br/>\nplaces we want to go. What if we don&#39;t sign up for Scouts after  <br/>\nChristmas?&quot;  And, &quot;I know you&#39;ll miss some aspects of Scouts, but  <br/>\nwe&#39;ll use that time to play a lot more games and to go more often to  <br/>\nplaces we like to go as a family.&quot;<br/>\n<br/>\nThe reality of limited time isn&#39;t as obvious to young people as it is  <br/>\nto us. They don&#39;t always understand that signing up for more  <br/>\nactivities means giving up time available for the unscheduled stuff.  <br/>\nThey need our help in learning to find a balance.<br/>\n<br/>\nAnd, as far as Sunday School, it has always seemed to me that making  <br/>\nkids go to religious activities must increase the probability that  <br/>\nthey&#39;ll reject the teachings, later, since it will be associated with  <br/>\ncoercion which often leads to resistance or apathy.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Oct 22, 2007, at 5:15 PM, Julie Hiniker wrote:<br/>\n<br/>\n&gt; I am finding that a by product of relaxing our homeschooling and  <br/>\n&gt; not requiring anything is my own desire to not be on the go all the  <br/>\n&gt; time. We are involved in many things..scouts.. Tae Kwon do.. etc. I  <br/>\n&gt; would love to stay home for the next year but the children say they  <br/>\n&gt; just want to keep going. Then tonight, the two boys who had scouts  <br/>\n&gt; both decided they didn&#39;t want to go. I so wanted to relax that I  <br/>\n&gt; said ok. I am just not sure how I feel about not being there full  <br/>\n&gt; time. Several also chose to stay home from Sunday school and since  <br/>\n&gt; they are older and I have been hearing recently that they aren&#39;t  <br/>\n&gt; even having any biblical discussions in class I let them. Help?  <br/>\n&gt; Opinions? Advice? Thanks<br/>\n&gt; Julie in mn<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":285017070,"authorName":"Julie Hiniker","from":"&quot;Julie Hiniker&quot; &lt;momx12@...&gt;","profile":"juliehiniker","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"While we are asking questions..","postDate":"1193098515","msgId":27254,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWEwMWM4MTUwOSRjOTE0NTEyMCQ2NTAxYThjMEBMSUJSQVJZPg=="},"prevInTopic":0,"nextInTopic":27255,"prevInTime":27253,"nextInTime":27255,"topicId":27254,"numMessagesInTopic":0,"msgSnippet":"I am finding that a by product of relaxing our homeschooling and not requiring anything is my own desire to not be on the go all the time. We are involved in","messageBody":"<div id=\"ygrps-yiv-250217502\">I am finding that a by product of relaxing our homeschooling and not requiring anything is my own desire to not be on the go all the time. We are involved in many things..scouts.. Tae Kwon do.. etc. I would love to stay home for the next year but the children say they just want to keep going. Then tonight, the two boys who had scouts both decided they didn&#39;t want to go. I so wanted to relax that I said ok. I am just not sure how I feel about not being there full time. Several also chose to stay home from Sunday school and since they are older and I have been hearing recently that they aren&#39;t even having any biblical discussions in class I let them. Help? Opinions? Advice? Thanks<br/>\nJulie in mn<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":27251,"nextTopicId":27282}}