{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Tormenting 5 y/o","postDate":"1271520301","msgId":43695,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2OTAyREI3RTU4RDRBOTNBM0QzQTJDMTMxMENCODVCQENvbm5pZVBDPg==","inReplyToHeader":"PGhxYmpyZCtscXRnQGVHcm91cHMuY29tPg==","referencesHeader":"PGhxYmpyZCtscXRnQGVHcm91cHMuY29tPg=="},"prevInTopic":43694,"nextInTopic":0,"prevInTime":43694,"nextInTime":43696,"topicId":43692,"numMessagesInTopic":0,"msgSnippet":"... I see a couple of things here. As the mom of 4, I see the younger ones torment the older ones to get their attention. My 5 year old looks up to her 8 year","messageBody":"<div id=\"ygrps-yiv-851054834\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;Hoping for some practical ideas and ways of communicating to my 5y/o son who spends a Lot of his time tormenting and teasing his 8 y/o sister.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I see a couple of things here. As the mom of 4, I see the younger ones torment the older ones to get their attention. My 5 year old looks up to her 8 year old sister and often times wants her attention when we are at home. However, my 8 year old doesn&#39;t want to be bothered with her little sister. I could keep my 5 year old busy and engage her all day long but that didn&#39;t help because what she really wanted was her big sister&#39;s attention. So, I talked to my 8 year old about ways that she could play with her little sister. I tried to find some common ground for things that they could do together on occasion. My 8 year old loves her Nintendo DS so we got her sister one so they could play it together. The swimming pool has also been a great source to bring them together. <br/>\n<br/>\nMy 8 year old and I sat down and had a talk about how much her sister loves her and wants her attention. We commiserated about how frustrating it can be when a little one wants our attention when we are busy. Now, when my 5 year old starts tormenting her big sister, we try to find something that we can all do together, whether it is a board game or something outside. The main thing is that it gets the 8 year old and 5 year old interacting in a way that is acceptable to both of them. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;How would others communicate in a similar situation?&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>In the moment, I try to make sure that my 5 year old stops even if that means that I have to physically remover her from the situation. I find ways to protect both children. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;It&#39;s not fair on dd; her level of frustration is rising as her level of patience is slipping. I&#39;m assuming I&#39;ll get a lot of advise along the lines of Doing More with him while at home.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Actually, you can spend all the time in the world with him but that is not going to help if what he really wants is his big sister&#39;s attention. Find activities that they can do together where they can talk, play, and be physical together. When his big sister gives him enough attention, he will go away on his own. There have been times when my 5 year old will start bugging her big sister and I will remind her that she is doing it because she loves her. The key is to find ways of getting them together without forcing either one to have to put up with something for the sake of the other. It can sometimes be very difficult to find a balance where everybody is getting what they need. <br/>\n<br/>\nConnie<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Pat&#39;s Sensory Activities for Little People","postDate":"1271520102","msgId":43694,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxY20xNitlcWZuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhxYmpyZCtscXRnQGVHcm91cHMuY29tPg=="},"prevInTopic":43693,"nextInTopic":43695,"prevInTime":43693,"nextInTime":43695,"topicId":43692,"numMessagesInTopic":0,"msgSnippet":"Here it is! ************* Choo-choo train is when he lies on the bed and I row his feet like a bicycle and we chuga-chuga-choo-choo (he does the train","messageBody":"<div id=\"ygrps-yiv-1374735411\">Here it is!<br/>\n*************<br/>\n<br/>\n&quot;Choo-choo train&quot; is when he lies on the bed and I &quot;row&quot; his feet like<br/>\na bicycle and we chuga-chuga-choo-choo (he does the train whistle<br/>\nsound) and we repeat that over and over for about 5 minutes. The<br/>\nengagement, physical motion and my participatory resistance/driving of<br/>\nhis legs back and forth provides a lot of sensory input in a<br/>\nnon-impact way.<br/>\n<br/>\nAnother is &quot;pillow mash&quot;-again he lies on the bed and I place a pillow<br/>\non top of his chest and firmly &quot;aggitate&quot; the pillow in a jiggling<br/>\nmotion and say &quot;pillow mash, pillow mash&quot;, repeatedly. This provides<br/>\ninput to his chest.<br/>\n<br/>\nAnd another one is &quot;salt shaker&quot;, again he lies on the bed, and I hold<br/>\nboth legs up and &quot;shake salt&quot; out of him. He is sorta upside down<br/>\n(legs up in the air, body on the bed), which gives input of vibrating<br/>\nhis head and back on the firm mattress.<br/>\n<br/>\nAnother is &quot;burrito&quot;-where he is wrapped tightly in a blanket and<br/>\nrolled side to side repeatedly.<br/>\n<br/>\nAnother is &quot;sack of potatoes&quot; when he climbs in a pillow case and I<br/>\nlift him up and down from the floor.<br/>\n<br/>\nWe also do &quot;row-row-row-your boat&quot; where we both lie on the trampoline<br/>\nwith full body contact and roll across the surface back and forth,<br/>\nsinging row-row-row-your boat. The total body compression is very<br/>\ncalming for him.<br/>\n<br/>\nWe have his bed mattress and box springs on the floor. So, he&#39;ll go up<br/>\nto his room and bounce and jump for sensory input too.<br/>\n<br/>\nOh, also he loves to stand in place and jump up to reach my hands<br/>\nabove his head. This is helpful when waiting in line, where he is<br/>\nrestless, but needs contained activity. It creates jumping, reaching<br/>\nand a goal/game aspect.<br/>\n<br/>\nAnother is where I hold my hands together palm to palm and move them<br/>\nup and down and he tries to clap them with his hands. Again, this is<br/>\ngreat for when out and about and he has too much energy for the space<br/>\nlimitations. A variant of this is where he tries to &quot;give five&quot; while<br/>\nI pull my hands back quickly. These can be used to constructively<br/>\nengage other people in the &quot;game&quot; also, which might free you up for<br/>\nshort periods.<br/>\n<br/>\nHe also loves to play in the sink with LOTS of soap, that seems to be<br/>\nvery soothing to him (but messy). Some kids really seek multiple baths<br/>\na day and having that planned before and/or mid-visit may allow a<br/>\nconnecting time with you; and a recentering activity, enough to make<br/>\nit a longer night.<br/>\n<br/>\nSo, if we are going to have a lot of sensory stimuli like a cacophony<br/>\nof sounds from a crowded party, we proactively do these games for 15<br/>\nminutes several times throughout the day. It helps if we are very<br/>\ncareful to avoid dairy, HFCS and artificial colors which decrease his<br/>\nability to hear and consider other&#39;s needs. We try to plan activities<br/>\nfor earlier in the day, plan some outside play time, especially<br/>\nswinging. Big tight, long hugs help in the midst of chaos to recenter.<br/>\nWe also freely use Rescue Remedy (and/or Cherry Plum) Bach flower<br/>\nremedies before (and during) high stress situations.<br/>\n<br/>\nDs has no obligation to visit with company; and he freely removes<br/>\nhimself to go watch tv in his room. It helps if ds doesn&#39;t need to<br/>\nmeet and greet everyone, especially when they all want to be hugging<br/>\nhim and expecting him to chat. He&#39;d rather warm up to people like a<br/>\ncat...on his own terms. So, it helps if ds is quietly engaged with a<br/>\nfamiliar video when we have company arrive and then he can come down<br/>\nwhen he is ready and everyone is sitting and he is out of arm&#39;s reach.<br/>\nThen he is apt to go sit with someone and visit. He is an introvert.<br/>\n<br/>\nI ran across this other comprehensive list of ideas for sensory<br/>\nactivities: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.coping.org/intervention/sensory/sensintegact.htm\">http://www.coping.org/intervention/sensory/sensintegact.htm</a><br/>\n<br/>\nIt probably helps to practice some of these games so that they are<br/>\nfun, known and can be anticipated. Perhaps, make a list, or place a<br/>\nname of each game on a piece of paper and have her choose one from a<br/>\njar to play with you or others.<br/>\n<br/>\nmore sensory/physical activities<br/>\n<br/>\nOh, and here are more. <br/>\n<br/>\n<br/>\nSensory Activities<br/>\nHere is a another list of various sensory activities that child(ren)<br/>\nmay enjoy and benefit from. I am copying this from<br/>\nShineWithUnschooling. I find that proactively offering and engaging<br/>\nour son with some of these sensory inputs really helps when we<br/>\nhave/had a busy day. If we have too much unfamiliar stimuli, he needs<br/>\na break to recenter with some of these soothing activities. Or<br/>\nelse......meltdown!<br/>\n<br/>\n==========<br/>\nCALMING ACTIVITIES:<br/>\nExperiences that may help to relax the nervous system<br/>\n<br/>\n* Stretches<br/>\n* Deep pressure massage<br/>\n* Slow rocking or swinging<br/>\n* Fidget toys<br/>\n* Progressive muscle relaxation<br/>\n* Quite music with a steady beat<br/>\n* Bear hugs<br/>\n* Reduced noise and light levels<br/>\n* Lavender, vanilla or other soothing smells<br/>\n* Snuggling in a sleeping bag, large pillows or bean bag chair<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>ORGANIZING ACTIVITIES:<br/>\nExperiences that can help an individual become focused and attentive<br/>\n<br/>\n*Sucking or chewing on hard candy or gum<br/>\n* Adding rhythm to the activity<br/>\n* Vibration-toy massager, vibrating pillow, wiggle pen<br/>\n* &#39;Heavy work&#39; tasks to include hanging, pushing, pulling or carrying<br/>\nheavy objects<br/>\n<br/>\nSimilarly:<br/>\n<br/>\nTo organize<br/>\n*Swinging on a swing or climbing<br/>\n* Rhythmical sustained movement: marching, washing a table, or bouncing<br/>\n* Rocking in a rocking chair<br/>\n* &quot;Squeezie&quot; toys (koosh balls, balloons or rubber gloves filled with<br/>\nflour or cream, soft balls, gak, silly putty)<br/>\n* Hanging by the arms on the monkey bars (20-30 seconds)<br/>\n* Pushing/carrying heavy objects<br/>\n* Carrying back packs weighted with books or bags of dried beans (this<br/>\nshould only be worn for 15-20 minutes with an hour or two between)<br/>\n*A reading corner with a bean bag chair makes a wonderful place for<br/>\nescape when there is too much stimulation. Some children may like the<br/>\nbean bag on top of them.<br/>\n* Play dough<br/>\n* Tactile Bins (cornmeal, oatmeal, water, sand, rice, beans)<br/>\n** A bin full of bird seed (brought outside) is merrily cleaned up by<br/>\nthe birdies -- no mess! :&#39;)<br/>\n* Kitchen time (mixing, tasting, smelling, washing up)<br/>\n* Finger painting<br/>\n<br/>\n<br/>\nSome children also need extra sensory input in their mouths and hands<br/>\nin order to organize their behavior:<br/>\n<br/>\n* Drinking from a water bottle<br/>\n* Chewing (you can use a straw, rubber tubing or coffee stir stick)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>* Being brushed with a corn de-silking brush (in one direction<br/>\napproximately 10 times with pressure brush their arms, back (but not<br/>\nover the spine), legs (on the top, outer parts and underneath, avoid<br/>\nthe inner thigh area), top of the feet and the hands)<br/>\n* Sucking on hard candy, frozen fruit bar, or spoonful of peanut<br/>\nbutter or marshmallow fluff<br/>\n* Licorice tug-of-war, blow pin wheels or various types of blow toys,<br/>\nbubbles and whistles<br/>\n* Pushing against walls with the hands, shoulders, back, buttocks and head<br/>\n* Cuddling or back rubbing<br/>\n* Taking a bath<br/>\n* Being rolled tightly like a hot dog in a blanket<br/>\n* Being squished under a therapy ball, mat or couch cushion<br/>\n* Tug-of-war<br/>\n* Wheelbarrow walking, jumping games like hop scotch<br/>\n* Crashing games-run and dive into boxes, bean bags and couch cushions<br/>\n* Pulling a wagon, carrying a heavy book bag, digging in the yard or<br/>\ncarrying groceries<br/>\n* Sports such as wrestling and football<br/>\n* Deep pressure (giving a massage) and joint compressions (holding<br/>\nabove one joint and under one joint then doing a quick 10 repetitions<br/>\nof compressions, pushing and pulling)<br/>\n* A mini trampoline<br/>\n* A sockem bopper or whatever they call those weighted kid-sized<br/>\nthings that spring back up after you knock them down<br/>\n<br/>\nOh, and going outside to blow bubbles is my cure-all. I always have<br/>\nbubbles in the car for &quot;emergencies&quot; too.<br/>\n<br/>\n<br/>\nPat</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Tormenting 5 y/o","postDate":"1271516586","msgId":43693,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxY2lqYStiY2ltQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhxYmpyZCtscXRnQGVHcm91cHMuY29tPg=="},"prevInTopic":43692,"nextInTopic":43694,"prevInTime":43692,"nextInTime":43694,"topicId":43692,"numMessagesInTopic":0,"msgSnippet":"... ***************** Think about it from his perspective - he s fired up with energy, he needs something to Do with that energy. Telling him to stop what he s","messageBody":"<div id=\"ygrps-yiv-647923579\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Kathryn&quot; &lt;kathryndubay@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;For example, today dd was sitting watching TV, and he starts with the teasing.  Getting all silly, in her face.  She tells him to stop.  He keeps going.  I say &quot;Jude, she asked you to stop mate.  She&#39;s not enjoying it.&quot;  He keeps going.  I&#39;m right there and he keeps going.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nThink about it from his perspective - he&#39;s fired up with energy, he needs something to Do with that energy. Telling him to stop what he&#39;s doing without offering something else isn&#39;t very useful to him because it doesn&#39;t help him meet his need - it gets in the way of meeting his need. Its up to you to help him find better tools.<br/>\n<br/>\nI know you&#39;re probably tired! But breaking up a fight isn&#39;t really restful, is it?<br/>\n<br/>\nIf tv is often a conflict area, make sure there are active (relatively quiet) things to do near the tv. A sit-n-spin is handy, and something to bounce on (mini trampoline, ratty old chair, small mattress). If he likes a lot of touch, you can wrap him up in a blanket and roll him back and forth on the floor with your hands or rub his back while he watches tv. Have you read The Out of Sync Child? Lots of good sensory activities in there for kids. Actually, there&#39;s a good post on another list about this - let me see if I can find it and I&#39;ll repost it here (the heading will be Pat&#39;s List of Sensory Activities for Little People).<br/>\n<br/>\nI&#39;m hoping Deb Rossing will chime in, but if she doesn&#39;t pop up do a search for her posts, too - she always has Fantastic ideas for active kids!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;He may just be sitting at her door, banging on it.  I&#39;m there, &quot;give her a break, Jude.  She&#39;s not in the mood.&quot;  And he giggles, seemingly ignoring me, and continues on.  Again, I physically have to remove him.  How would others communicate in a similar situation? <br/>\n </span></blockquote>*******************<br/>\n<br/>\nEngage him. That&#39;s what he&#39;s craving - more engagement. You&#39;re Already engaging him, ultimately, in a negative sense, so in a way you aren&#39;t going to have to do More so much as engage him sooner and differently. Have you read Playful Parenting? It may be he needs you to be more fun. <br/>\n<br/>\nI&#39;ll find that list of activities and post it today!<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":141243160,"authorName":"Kathryn","from":"&quot;Kathryn&quot; &lt;kathryndubay@...&gt;","profile":"observeandlearn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Tormenting 5 y/o","postDate":"1271485101","msgId":43692,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxYmpyZCtscXRnQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":43693,"prevInTime":43691,"nextInTime":43693,"topicId":43692,"numMessagesInTopic":0,"msgSnippet":"Hoping for some practical ideas and ways of communicating to my 5y/o son who spends a Lot of his time tormenting and teasing his 8 y/o sister.  He has always","messageBody":"<div id=\"ygrps-yiv-1319556685\">Hoping for some practical ideas and ways of communicating to my 5y/o son who spends a Lot of his time tormenting and teasing his 8 y/o sister.  He has always been the most spirited of the three, and I really do feel that he has a pretty rich life full of experiences and activites that support his needs; but we all need down time.  He clearly doesn&#39;t need as much as the rest of his family!  In recent weeks he loves bike riding as he only recently came off his training wheels.  We have a BMX track out the back (local Reserve) that he is free to utilise, and in recent days we have done a lot or trekking from one skate/bike park to the next in the area.  He loves it!  We all go along for the trip, dogs included, and everyone is happy.  However, as soon as we are home/familiar settings, the tormenting starts.  For example, today dd was sitting watching TV, and he starts with the teasing.  Getting all silly, in her face.  She tells him to stop.  He keeps going.  I say &quot;Jude, she asked you to stop mate.  She&#39;s not enjoying it.&quot;  He keeps going.  I&#39;m right there and he keeps going.  She loses her temper and starts to get aggressive.  I physically remove him, explaining that if he can&#39;t stop, she&#39;ll lose it and may hurt him.  He then loses it with me for getting involved.  I put him down and the cycle continues.  Sometimes she will retreat angrily to her room and he follows her to continue the torment.  He may just be sitting at her door, banging on it.  I&#39;m there, &quot;give her a break, Jude.  She&#39;s not in the mood.&quot;  And he giggles, seemingly ignoring me, and continues on.  Again, I physically have to remove him.  How would others communicate in a similar situation?  It&#39;s not fair on dd; her level of frustration is rising as her level of patience is slipping.  I&#39;m assuming I&#39;ll get a lot of advise along the lines of Doing More with him while at home.  We do -- I spend A LOT of time pushing him on the hammock.  It&#39;s about the only thing he asks of me.  It&#39;s awesome connection time for us, and break time from his siblings.  Still doesn&#39;t seem to be enough.  Advise please!<br/>\n<br/>\nKathrynD<br/>\n<br/>\nx</div>","specialLinks":[]}],"prevTopicId":43691,"nextTopicId":43684}}