{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":14,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Another struggle","postDate":"1271777344","msgId":43725,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxa2g4MCtuMWNoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI5NDAzMS44OTM4OC5xbUB3ZWI1NDYwMi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":43724,"nextInTopic":0,"prevInTime":43724,"nextInTime":43726,"topicId":43700,"numMessagesInTopic":0,"msgSnippet":"It takes a while for the excitement of no more school to wane and the day to day business of living with other people to start to set in, I think. I know it","messageBody":"<div id=\"ygrps-yiv-1591174039\">It takes a while for the excitement of &quot;no more school&quot; to wane and the day to day business of living with other people to start to set in, I think. I know it did with Ray - at first he was nearly giddy, and it was a good long time before he and Mo started having the usual sort of sibling quarrels. <br/>\n<br/>\nFiguring out how to get along with people is a big big part of life - and hence unschooling. Living with people can be challenging! Their needs aren&#39;t your needs, but there they are, sharing your space, making noise when you want quiet, using the last black crayon, whatever. It can be better to see bickering in terms of that learning process. Its not that they were doing &quot;well&quot; before and less so, now, they&#39;ve started to settle into the business of living life. <br/>\n<br/>\nBeing with them is important, helping them negotiate and figure things out, but its just as important to express some trust in the that they can figure things out, too. I don&#39;t mean &quot;leave them to figure it out&quot; per se. Kids aren&#39;t always sensitive to each others needs, but unmet needs can be part of what&#39;s generating conflict! So the more you can do to see the unmet needs and work on resolving those, the more energy your kids have to deal with the sorts of conflict that come from other sources - like differences of opinion - without being led by the hand, as it were.<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":151979431,"authorName":"Rebecca M.","from":"&quot;Rebecca M.&quot; &lt;ackirebecci@...&gt;","profile":"ackirebecci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Another struggle","postDate":"1271774886","msgId":43724,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxa2VyNittYWtvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhxaTE5citqYm9hQGVHcm91cHMuY29tPg=="},"prevInTopic":43721,"nextInTopic":43725,"prevInTime":43723,"nextInTime":43725,"topicId":43700,"numMessagesInTopic":0,"msgSnippet":"... If the friend is coming over to visit your daughter, then bringing her school work is unnecessary and seems almost like a deliberate taunt. I never took","messageBody":"<div id=\"ygrps-yiv-434492612\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;sarahrandom78&quot; &lt;bdb1978@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;** Thank you for your advice. I think it came off like I was saying she&#39;s not good at math. What happened is her friend came over while her mom went somewhere. She (the friend) brought her math worksheets to finish for the afternoon (I don&#39;t like that she brings her school work because it always turns into &quot;You mean you don&#39;t know how to add fractions??&quot; Or &quot;You don&#39;t know how to do square root??&quot;)** &gt;<br/>\n<br/>\n </span></blockquote>If the friend is coming over to visit your daughter, then bringing her school work is unnecessary and seems almost like a deliberate taunt. I never took homework to my friends&#39; houses when I was a kid. (Of course, I spent a lot of time avoiding doing my homework ever.) <br/>\n<br/>\nIf the child is choosing to bring her school work, then it may be she&#39;s not really that good of a friend (and it might be nice for your daughter to meet some other unschooled kids so she has people to relate to) and maybe shouldn&#39;t come over unless she leaves the school work at home to do later. And it might be a good opportunity to check in with your daughter about  what she&#39;d like to do during these visits from her friend. You may want to take the girls to a movie or swimming or something outside of the house until this blip is over. Staying home, making cookies and then watching a movie, is also an option. You can facilitate some fun times until this friendship is also &quot;deschooled&quot;. <br/>\n<br/>\nIf you are doing the mom a favour by &quot;watching&quot; her daughter, you can state your preference that she comes prepared to hang out and visit. No school work. You don&#39;t have to make it about your daughter. You can just say that the girls seem to have a better time together when they are free to visit.<br/>\n<br/>\nYou can help your daughter through this by protecting her from this sort of unfair situation, especially during this fragile time of transition. I don&#39;t think there&#39;s anything wrong with that.<br/>\n<br/>\nThere could be more going on here than meets the eye (maybe the other child is trying to bolster her self-concept by feeling superior to your daughter - not really the foundation for a good friendship) and I think that you can take the oomph out of it by sorting out some soft guidelines for these &quot;visits&quot; with the other family.<br/>\n<br/>\n- Rebecca</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Another struggle","postDate":"1271758731","msgId":43721,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxanYyYitlOWJ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhxaTQ2NSszZDhuQGVHcm91cHMuY29tPg=="},"prevInTopic":43712,"nextInTopic":43724,"prevInTime":43720,"nextInTime":43722,"topicId":43700,"numMessagesInTopic":0,"msgSnippet":"Happier is better. :) And math, if that s something she is interested in, can be part of the happiness. Pam Sorooshian has an excellent site on unschooling and","messageBody":"<div id=\"ygrps-yiv-1305217173\">Happier is better. :)<br/>\n<br/>\nAnd math, if that&#39;s something she is interested in, can be part of the happiness. <br/>\n<br/>\nPam Sorooshian has an excellent site on unschooling and math. There are some fun books -- like The Number Devil -- that your DD might like, More like reading a story that happens to be about numbers instead of doing a worksheet.<br/>\n<br/>\nThere&#39;s no need avoid info about a specific topic along the way to letting go of schoolish thinking about the subject. <br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;m starting to wonder if unschooling is just not right for her personality type. Has that ever happened<br/>\n </span></blockquote>**********<br/>\n<br/>\nIf you think she&#39;d be Happier doing what you did before, or in a charter school or whatever, do that. But it seems to me you&#39;ve said she&#39;s happier, now, so focus on that. Happier is better!<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":191799655,"authorName":"b prince","from":"b prince &lt;flyingtwinsmom@...&gt;","profile":"flyingtwinsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Another struggle","postDate":"1271722179","msgId":43712,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5NDAzMS44OTM4OC5xbUB3ZWI1NDYwMi5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDY1OTI0NS43NzI2MS5xbUB3ZWI2NTcwMS5tYWlsLmFjNC55YWhvby5jb20+","referencesHeader":"PDY1OTI0NS43NzI2MS5xbUB3ZWI2NTcwMS5tYWlsLmFjNC55YWhvby5jb20+"},"prevInTopic":43710,"nextInTopic":43721,"prevInTime":43711,"nextInTime":43713,"topicId":43700,"numMessagesInTopic":0,"msgSnippet":"**We had a couple months w/ more conflict between my younger two and everyone generally feeling out of sorts.  I think there comes a time in deschooling for","messageBody":"<div id=\"ygrps-yiv-567111696\">**We had a couple months w/ more conflict between my younger two and <br/>\neveryone generally feeling out of sorts.  I think there comes a time in <br/>\ndeschooling for some kids when they want more stimulation but aren&#39;t <br/>\nreally sure what they want or how to get it.  And as a parent I&#39;m still <br/>\ndeschooling and trying to remain open even when what my kids want/need <br/>\nis outside of my comfort zone or our financial reality of the moment.  <br/>\nWhen those two combine there&#39;s bound to be some disequilibrium. **<br/>\n<br/>\nDo many of you find this type of situation common after you have been deschooling for some time? My girls really did well at first, but over the last 2 weeks, there has been a lot more bickering and general unrest. It&#39;s making me question myself about unschooling and whether or not we can do it. They&#39;ve seemed to veg out spending almost all of their time in front of the TV watching Disney or Nick. I wondered if it wasn&#39;t because of allergies and not feeling well, but after reading this post, I wonder more if it&#39;s just not that it&#39;s a typical deschooling thing.<br/>\nBonni<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136944076,"authorName":"Jenna Robertson","from":"Jenna Robertson &lt;mamamole@...&gt;","profile":"Mamamole","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Another struggle","postDate":"1271711301","msgId":43710,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1OTI0NS43NzI2MS5xbUB3ZWI2NTcwMS5tYWlsLmFjNC55YWhvby5jb20+","inReplyToHeader":"PGhxaWRhZStpcTFuQGVHcm91cHMuY29tPg=="},"prevInTopic":43709,"nextInTopic":43712,"prevInTime":43709,"nextInTime":43711,"topicId":43700,"numMessagesInTopic":0,"msgSnippet":"We considered our start of unschooling as *After* summer vacation ended and the other kids returned to school.  There really isn t anything different if","messageBody":"<div id=\"ygrps-yiv-1553081729\">We considered our start of unschooling as *After* summer vacation ended and the other kids returned to school.  There really isn&#39;t anything different if everyone else is out of school, too.  Then &quot;everyone&quot; returns to school and your kid(s) is(are) at home.  At that point one of my girls really struggled w/ the idea of unschooling and actually went back to school for 2 weeks (staying home more days that she attended because she knew it was up to her and I knew she was trying to figure out what it was like to attend school and not attend school.)  We then had a bit of a honeymoon period where the girls were happy to watch Netflix or play on the computer.  After the holidays things got a bit less romantic.<br/>\n<br/>\nWe had a couple months w/ more conflict between my younger two and everyone generally feeling out of sorts.  I think there comes a time in deschooling for some kids when they want more stimulation but aren&#39;t really sure what they want or how to get it.  And as a parent I&#39;m still deschooling and trying to remain open even when what my kids want/need is outside of my comfort zone or our financial reality of the moment.  When those two combine there&#39;s bound to be some disequilibrium.  <br/>\n<br/>\nI find that many times deschooling is described as kids zoning out in front of the TV or playing video games non-stop, or reading books all day.  I think that is often the first part of deschooling,  but I&#39;m curious if others have experienced a transition from deschooling to unschooling or some period of time where everyone was a bit out of sorts.  <br/>\n<br/>\nMy younger two have no desire to have input from their parents on what to do, even when they say they are bored or ask for ideas.  They cut me off or walk away if they feel I&#39;m trying to &quot;teach&quot; them something (as in sharing what I know, or giving an example from my life or sharing what I&#39;m learning from a book or website.)  In a light hearted moment I said to my middle child &quot;If you don&#39;t let me talk, how can I share with you my Wealth of Knowledge.&quot;  She looked at me and smiled, &quot;I have my own wealth of knowledge.&quot;  And she does :) and it&#39;s cool that at the age of 10 she knows that, and it would help if I&#39;d remember it more often!<br/>\n<br/>\nIn response to our collective need to move into a more fun and engaging life of unschooling, while we still aren&#39;t sure what that looks like for various family members, my husband has changed his work schedule so Mondays are now a family fun day.  We are trying to do something new or different on Mondays, or something we&#39;ve enjoyed in the past and haven&#39;t done in ages.  It seems to be helping our feelings of connectedness.  <br/>\n<br/>\nJenna    <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":414490706,"authorName":"sarahrandom78","from":"&quot;sarahrandom78&quot; &lt;bdb1978@...&gt;","profile":"sarahrandom78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Another struggle","postDate":"1271707790","msgId":43709,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxaWRhZStpcTFuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhxaTQ2NSszZDhuQGVHcm91cHMuY29tPg=="},"prevInTopic":43708,"nextInTopic":43710,"prevInTime":43708,"nextInTime":43710,"topicId":43700,"numMessagesInTopic":0,"msgSnippet":"THANK YOU, THANK YOU, THANK YOU!!! I hadn t talked to her about deschooling. I guess I just figured that since we were at the end of the school year and summer","messageBody":"<div id=\"ygrps-yiv-153532234\">THANK YOU, THANK YOU, THANK YOU!!! I hadn&#39;t talked to her about deschooling. I guess I just figured that since we were at the end of the school year and summer vacation was ahead things would be fine. And really I have to add that things seemed to be going much smoother until her friend started homeschooling. Since then it seems we now have someone who is questioning our way of doing things whereas before it was only from time to time from well meaning family members. I think a BIG part of the problem is that I&#39;m not real schedule oriented, so that is something I need to fix. I will do what you said and help her get on a regular schedule so she can feel a little more relaxed from knowing what to expect out of each day.  We just had a ton of family visiting us (3 solid months of constant visitors) and I think all of the &quot;Well what do you do for lessons?&quot;, &quot;Doesn&#39;t she DO anything?&quot; and &quot;What will she do when she grows up?&quot; statements that I&#39;m sure she overheard probably contributed to this worry. I hadn&#39;t thought about it before, because it just seemed to happen when her friend started homeschooling,(they occurred at the same time) but now that I&#39;m looking back it from another perspective, it did start around the same time that my grandma (a retired English teacher) was here visiting. I try to explain to people that I&#39;m not trying to raise my child to get in to college, but rather to follow a path to a happy and fulfilled life. I&#39;m sure you&#39;ve all experienced this &quot;What will they do for a job?&quot; question. Man, I wish people would just mind their own business sometimes. I&#39;m sure that family is just concerned because this isn&#39;t a mainstream thing to do in our culture, but then they turn around and go on and on about how smart my kids are. They just can&#39;t get over how articulate they all are especially for their ages. So obviously I&#39;m doing something right. Right? LOL! Thanks again for all the advice. <br/>\nSarah<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;sarahrandom78&quot; &lt;bdb1978@&gt; wrote:<br/>\n&gt; &gt;&gt; We did talk about why we would unschool this year.<br/>\n&gt; <br/>\n&gt; I just had a big &quot;well duh&quot; which is that she&#39;s deschooling still. Maybe you thought she&#39;d be done by now, but it can take a year or more - and if she&#39;s getting schooly messages from a good friend, that&#39;s going to slow her down a bit. Y&#39;all talked about unschooling - did you talk about deschooling too? Did you take some &quot;vacation time&quot; and do some fun, low-key things? Have some movie marathons? Go shopping for days? Deschooling is a transitional time, and it doesn&#39;t really look like unschooling. Transitions can be hard, even good transitions. Your dds whole world changed, and her mind is still catching up to that. <br/>\n&gt; <br/>\n&gt; &gt;&gt;She is a child that thrives on schedules.<br/>\n&gt; <br/>\n&gt; Then help her to have a good solid routine each day! Have meals or snacks ready for her at certain times, check in with her regularly, plan trips and activities around a daily routine. Unschooling doesn&#39;t mean living with no schedule! My dd has a very predictable day for the most part - consistent enough that its not a challenge to plan our outtings around it. <br/>\n&gt; <br/>\n&gt; &gt; Thank you for your advice. I think it came off like I was saying she&#39;s not good at math. <br/>\n&gt; ************<br/>\n&gt; <br/>\n&gt; You gave the impression you&#39;re telling *her* &quot;its okay not to be good at math&quot; - the sort of platitude that&#39;s meant to be helpful but can engrave common misconceptions even deeper. <br/>\n&gt; <br/>\n&gt; From your latest post it sounds like you&#39;ve been saying a lot with the intention of reassuring her or trying to fix things, and that&#39;s not *bad* but at the same time its sort of missing the boat - she&#39;s still deschooling, and that&#39;s a big big part of what&#39;s going on. Its natural to feel lost at sea for awhile. <br/>\n&gt; <br/>\n&gt; Be sure you&#39;re offering fun things to do regularly - not things for Her to do, but things for you to do together. For sure commiserate when she says she&#39;s floundering, but don&#39;t worry about fixing that - that sounds weird doesn&#39;t it? but a transition isn&#39;t something you need to fix, its something to move *through*. And you can&#39;t necessarily hurry things along, either (although you can slow them down).<br/>\n&gt; <br/>\n&gt; &gt;&gt;I&#39;m starting to wonder if unschooling is just not right for her personality type. Has that ever happened<br/>\n&gt; **********<br/>\n&gt; <br/>\n&gt; If you think she&#39;d be Happier doing what you did before, or in a charter school or whatever, do that. But it seems to me you&#39;ve said she&#39;s happier, now, so focus on that. Happier is better! <br/>\n&gt; <br/>\n&gt; ---Meredith (Mo 8, Ray 16)<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":346211282,"authorName":"Stephanie Lavan","from":"Stephanie Lavan &lt;stephanielavan@...&gt;","profile":"astrangefamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Another struggle","postDate":"1271699698","msgId":43708,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PG8ybDZkYWU4M2ExMDA0MTkxMDU0aTczZTAyZTIyaWEzMjhkMzc4NGQxMWE4ZWFAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGhxaTQ2NSszZDhuQGVHcm91cHMuY29tPg==","referencesHeader":"PGhxaTE5citqYm9hQGVHcm91cHMuY29tPiA8aHFpNDY1KzNkOG5AZUdyb3Vwcy5jb20+"},"prevInTopic":43707,"nextInTopic":43709,"prevInTime":43707,"nextInTime":43709,"topicId":43700,"numMessagesInTopic":0,"msgSnippet":"--Meredith (Mo 8, Ray 16) said: If you think she d be Happier doing what you did before, or in a charter school or whatever, do that. But it seems to me you ve","messageBody":"<div id=\"ygrps-yiv-1163766236\">--Meredith (Mo 8, Ray 16) said:<br/>\nIf you think she&#39;d be Happier doing what you did before, or in a charter<br/>\nschool or whatever, do that. But it seems to me you&#39;ve said she&#39;s happier,<br/>\nnow, so focus on that. Happier is better!<br/>\n<br/>\nThank you Meredith.  I am a lurker, but I really needed to hear that.  My<br/>\nhusband and I pulled our oldest, whom is 9, out of a small charter school to<br/>\nhomeschool mainly because she was so stressed.  She still complains of not<br/>\ndoing &quot;schoolish&quot; things, she is so much happier and is thoroughly enjoying<br/>\nlife!  When I begin to doubt myself I will have to keep what you said in my<br/>\nmind.<br/>\n<br/>\nStephanie L.<br/>\n<br/>\nOn Mon, Apr 19, 2010 at 12:33 PM, plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a><br/>\n<blockquote><span title=\"ireply\"> &gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&lt;unschoolingbasics%40yahoogroups.com&gt;,<br/>\n&gt; &quot;sarahrandom78&quot; &lt;bdb1978@...&gt; wrote:<br/>\n&gt; &gt;&gt; We did talk about why we would unschool this year.<br/>\n&gt;<br/>\n&gt; I just had a big &quot;well duh&quot; which is that she&#39;s deschooling still. Maybe<br/>\n&gt; you thought she&#39;d be done by now, but it can take a year or more - and if<br/>\n&gt; she&#39;s getting schooly messages from a good friend, that&#39;s going to slow her<br/>\n&gt; down a bit. Y&#39;all talked about unschooling - did you talk about deschooling<br/>\n&gt; too? Did you take some &quot;vacation time&quot; and do some fun, low-key things? Have<br/>\n&gt; some movie marathons? Go shopping for days? Deschooling is a transitional<br/>\n&gt; time, and it doesn&#39;t really look like unschooling. Transitions can be hard,<br/>\n&gt; even good transitions. Your dds whole world changed, and her mind is still<br/>\n&gt; catching up to that.<br/>\n&gt;<br/>\n&gt; &gt;&gt;She is a child that thrives on schedules.<br/>\n&gt;<br/>\n&gt; Then help her to have a good solid routine each day! Have meals or snacks<br/>\n&gt; ready for her at certain times, check in with her regularly, plan trips and<br/>\n&gt; activities around a daily routine. Unschooling doesn&#39;t mean living with no<br/>\n&gt; schedule! My dd has a very predictable day for the most part - consistent<br/>\n&gt; enough that its not a challenge to plan our outtings around it.<br/>\n&gt;<br/>\n&gt; &gt; Thank you for your advice. I think it came off like I was saying she&#39;s<br/>\n&gt; not good at math.<br/>\n&gt; ************<br/>\n&gt;<br/>\n&gt; You gave the impression you&#39;re telling *her* &quot;its okay not to be good at<br/>\n&gt; math&quot; - the sort of platitude that&#39;s meant to be helpful but can engrave<br/>\n&gt; common misconceptions even deeper.<br/>\n&gt;<br/>\n&gt; From your latest post it sounds like you&#39;ve been saying a lot with the<br/>\n&gt; intention of reassuring her or trying to fix things, and that&#39;s not *bad*<br/>\n&gt; but at the same time its sort of missing the boat - she&#39;s still deschooling,<br/>\n&gt; and that&#39;s a big big part of what&#39;s going on. Its natural to feel lost at<br/>\n&gt; sea for awhile.<br/>\n&gt;<br/>\n&gt; Be sure you&#39;re offering fun things to do regularly - not things for Her to<br/>\n&gt; do, but things for you to do together. For sure commiserate when she says<br/>\n&gt; she&#39;s floundering, but don&#39;t worry about fixing that - that sounds weird<br/>\n&gt; doesn&#39;t it? but a transition isn&#39;t something you need to fix, its something<br/>\n&gt; to move *through*. And you can&#39;t necessarily hurry things along, either<br/>\n&gt; (although you can slow them down).<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt;&gt;I&#39;m starting to wonder if unschooling is just not right for her<br/>\n&gt; personality type. Has that ever happened<br/>\n&gt; **********<br/>\n&gt;<br/>\n&gt; If you think she&#39;d be Happier doing what you did before, or in a charter<br/>\n&gt; school or whatever, do that. But it seems to me you&#39;ve said she&#39;s happier,<br/>\n&gt; now, so focus on that. Happier is better!<br/>\n&gt;<br/>\n&gt; ---Meredith (Mo 8, Ray 16)<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>-- <br/>\nStephanie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Another struggle","postDate":"1271698437","msgId":43707,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxaTQ2NSszZDhuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhxaTE5citqYm9hQGVHcm91cHMuY29tPg=="},"prevInTopic":43706,"nextInTopic":43708,"prevInTime":43706,"nextInTime":43708,"topicId":43700,"numMessagesInTopic":0,"msgSnippet":"... I just had a big well duh which is that she s deschooling still. Maybe you thought she d be done by now, but it can take a year or more - and if she s","messageBody":"<div id=\"ygrps-yiv-307171679\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;sarahrandom78&quot; &lt;bdb1978@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; We did talk about why we would unschool this year.<br/>\n<br/>\n </span></blockquote>I just had a big &quot;well duh&quot; which is that she&#39;s deschooling still. Maybe you thought she&#39;d be done by now, but it can take a year or more - and if she&#39;s getting schooly messages from a good friend, that&#39;s going to slow her down a bit. Y&#39;all talked about unschooling - did you talk about deschooling too? Did you take some &quot;vacation time&quot; and do some fun, low-key things? Have some movie marathons? Go shopping for days? Deschooling is a transitional time, and it doesn&#39;t really look like unschooling. Transitions can be hard, even good transitions. Your dds whole world changed, and her mind is still catching up to that. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;She is a child that thrives on schedules.<br/>\n<br/>\n </span></blockquote>Then help her to have a good solid routine each day! Have meals or snacks ready for her at certain times, check in with her regularly, plan trips and activities around a daily routine. Unschooling doesn&#39;t mean living with no schedule! My dd has a very predictable day for the most part - consistent enough that its not a challenge to plan our outtings around it. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Thank you for your advice. I think it came off like I was saying she&#39;s not good at math. <br/>\n </span></blockquote>************<br/>\n<br/>\nYou gave the impression you&#39;re telling *her* &quot;its okay not to be good at math&quot; - the sort of platitude that&#39;s meant to be helpful but can engrave common misconceptions even deeper. <br/>\n<br/>\nFrom your latest post it sounds like you&#39;ve been saying a lot with the intention of reassuring her or trying to fix things, and that&#39;s not *bad* but at the same time its sort of missing the boat - she&#39;s still deschooling, and that&#39;s a big big part of what&#39;s going on. Its natural to feel lost at sea for awhile. <br/>\n<br/>\nBe sure you&#39;re offering fun things to do regularly - not things for Her to do, but things for you to do together. For sure commiserate when she says she&#39;s floundering, but don&#39;t worry about fixing that - that sounds weird doesn&#39;t it? but a transition isn&#39;t something you need to fix, its something to move *through*. And you can&#39;t necessarily hurry things along, either (although you can slow them down).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I&#39;m starting to wonder if unschooling is just not right for her personality type. Has that ever happened<br/>\n </span></blockquote>**********<br/>\n<br/>\nIf you think she&#39;d be Happier doing what you did before, or in a charter school or whatever, do that. But it seems to me you&#39;ve said she&#39;s happier, now, so focus on that. Happier is better! <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":414490706,"authorName":"sarahrandom78","from":"&quot;sarahrandom78&quot; &lt;bdb1978@...&gt;","profile":"sarahrandom78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Another struggle","postDate":"1271695483","msgId":43706,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxaTE5citqYm9hQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhxZmtsbytwc2twQGVHcm91cHMuY29tPg=="},"prevInTopic":43704,"nextInTopic":43707,"prevInTime":43705,"nextInTime":43707,"topicId":43700,"numMessagesInTopic":0,"msgSnippet":"Thank you for your advice. I think it came off like I was saying she s not good at math. What happened is her friend came over while her mom went somewhere.","messageBody":"<div id=\"ygrps-yiv-1133078959\">Thank you for your advice. I think it came off like I was saying she&#39;s not good at math. What happened is her friend came over while her mom went somewhere. She (the friend) brought her math worksheets to finish for the afternoon (I don&#39;t like that she brings her school work because it always turns into &quot;You mean you don&#39;t know how to add fractions??&quot; Or &quot;You don&#39;t know how to do square root??&quot;) This is where I say &quot;Hannah is learning different things than you are&quot; My daughter is friends with this girl and it&#39;s not necessarily said in a mean spirit, but after she leaves, Hannah talks about how stupid she feels when she can&#39;t do the math problems her friend does. I&#39;ve tried a few approaches. I&#39;ve asked her if there&#39;s anything she&#39;d like to learn specifically that I could help her with. I&#39;ve showed her that she really does understand numbers when they are practically applied, such as in cooking. I taught her binary numbers, and showed her how it&#39;s almost like a secret code (she liked that because not everyone knows the binary number system) This is also when I&#39;ve pointed out that she loves to read and that since it&#39;s more of an interest to her than numbers are, that&#39;s why she doesn&#39;t know how to do the same stuff as her friend. I&#39;ve asked her if she has any ideas about what would make her feel better. All to no avail. When she says &quot;I feel stupid when I can&#39;t do the math problems my friend does&quot; I actually have said &quot;You feel stupid when you can&#39;t do the math problems your friend does?&quot;  She just looked at me like I&#39;m crazy and said &quot;Yeah?&quot; So I&#39;m like &quot;OK, do you want advice or do you just want me to listen?&quot; She says &quot;I don&#39;t know&quot; When she says &quot;I don&#39;t feel like I&#39;m doing anything with my life&quot; I have said things like &quot;Do you feel like you need to be right now?&quot; &quot;What do you want to be doing with your life?&quot; &quot;Is there something I can do to help you change that?&quot; I feel like she is asking me for something but maybe she just doesn&#39;t know how to articulate it. I wish she didn&#39;t compare herself to her friend. I don&#39;t try to look at things in terms of school subjects, except where I have to for record keeping, but because she went to school until second grade she still does. She will say &quot;I just did science!&quot; when she has learned something about animals. I don&#39;t know if she will ever get out of that frame of mind.<br/>\n<br/>\nHer dad and I both talk about things we&#39;ve learned, almost daily. He is not completely sold on the idea of unschooling, but he sees the change in her personality, from timid and lacking confidence, to being able to talk to anyone with no problems. His job requires him to be learning all the time to keep up with new technology, so he&#39;s always talking about the new thing that he taught himself. I&#39;ve always been terrible with numbers, but I&#39;ve decided this year to find a way to understand them. I&quot;m pretty excited about it, and I&#39;ve shared that with my daughter. I&#39;ve showed her that since I have a hard time with numbers that I carry a calculator with me so I can figure things like tax out or discounts.<br/>\n<br/>\nWe did talk about why we would unschool this year. She hated doing school work, and I was unhappy with the endless repetition. I explained that this year we could go in a different direction. That we wouldn&#39;t be doing school work, instead we could do what we wanted. She is a child that thrives on schedules. For instance, she was recently on an antibiotic, and she divided up the day and wrote it down so she would remember to take it at 3 evenly spaced intervals. I did not tell her to do that, she just did it. She likes her space organized and she&#39;s constantly reorganizing and moving things around so that they work better. I think part of the problem is that she doesn&#39;t have any sense of accomplishment at the end of the day. ( I struggle with the same thing since I became a stay at home mom) Last year when I got extremely laid back with the school work a day looked like this : Write a book review (all she had to do was answer a few very easy questions about the books she read and tell whether she would recommend it to a friend) Look up some information on games to play with your cat. Write out multiplication facts through ten. That would be all, and it wasn&#39;t EVERY day. It might take her 30-40 minutes, then she was free to do whatever she wanted the rest of the day. I&#39;m starting to wonder if unschooling is just not right for her personality type. Has that ever happened, LOL!?<br/>\n<br/>\nI&#39;ve tried showing her my journal so that she can &quot;see&quot; the things she does in school terms. Reorganizing your room---spatial relations, Making a chart to take your medicine---Time management skills, Division, Graphing. Making up stories----writing and illustration. Anyway, maybe it will just take some more time. Thank God my two younger children will never have gone to school! Hopefully they won&#39;t have these same things to deal with.</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void Taintor","from":"Faith Void Taintor &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Another struggle","postDate":"1271620236","msgId":43704,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYwNTZFMUMyLUIwMEYtNDRCOS1BMjY5LTZGMTU5NTY0NzU2MkBnbWFpbC5jb20+","inReplyToHeader":"PGhxZjllbyt1ZDh0QGVHcm91cHMuY29tPg==","referencesHeader":"PGhxZjllbyt1ZDh0QGVHcm91cHMuY29tPg=="},"prevInTopic":43703,"nextInTopic":43706,"prevInTime":43703,"nextInTime":43705,"topicId":43700,"numMessagesInTopic":0,"msgSnippet":"I would invest in taking your child to an unschooling conference. Seeing and interacting with other people roughly her age peers can make a huge difference. It","messageBody":"<div id=\"ygrps-yiv-2089803230\">I would invest in taking your child to an unschooling conference.  <br/>\nSeeing and interacting with other people roughly her age peers can  <br/>\nmake a huge difference. It can seem like a large sum of money, but  <br/>\nworth every cent!<br/>\n<br/>\nFaith<br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Another struggle","postDate":"1271617016","msgId":43703,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxZmtsbytwc2twQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhxZjllbyt1ZDh0QGVHcm91cHMuY29tPg=="},"prevInTopic":43702,"nextInTopic":43704,"prevInTime":43702,"nextInTime":43704,"topicId":43700,"numMessagesInTopic":0,"msgSnippet":"Keep in mind all the normal things parents tell kids about school and education - maybe things you used to say in answer to questions like why do I Have to","messageBody":"<div id=\"ygrps-yiv-1817371530\">Keep in mind all the &quot;normal&quot; things parents tell kids about school and education - maybe things you used to say in answer to questions like &quot;why do I Have to go to school?&quot; and maybe things that teachers have said and, most especially, things her friends&#39; parents have said and they&#39;ve repeated to her. There&#39;s a ton of messages along the lines of &quot;you go to school to learn, do you want to be a dummy?&quot; that are passed around schools and busses and friendships every day. <br/>\n<br/>\nSo yes, to some extent what she is needing is reassurance, but not necessarily in the form of &quot;of course you&#39;re learning&quot;. Its worth asking her if that helps her feel better or not. Its also worth trying some other strategies, like acknowledging her feelings *without* reassuring her specifically. It may be that, as much as anything else, she wants you to know what she feels. So &quot;hear&quot; her as plainly as you can. One strategy is to &quot;mirror&quot; her words back without adding to them: &quot;you&#39;re afraid you&#39;re not doing anything&quot; and see where things go from there. They don&#39;t &quot;need&quot; to go anywhere - it may be enough for her to know you&#39;re listening. <br/>\n<br/>\nAnother option is to talk about your own fears and insecurities, but its really important to do that without &quot;dumping&quot; on her. She&#39;s not an adult! The idea isn&#39;t to let her in for more than she can handle. but to let her know that its Okay to have worries and fears and to share some of the strategies You have for dealing with those - from simple things like deep breaths to more complex things like journalling or making plans to change something in your life. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; We talked at length about how we would do things differently this year.<br/>\n<br/>\n </span></blockquote>Did you talk about Why? Have you offered her any resources on how people learn? That&#39;s something to ask her about - would she like to read about learning and education? Something like &quot;The Book of Learning and Forgetting&quot; might be an interesting place to start - and if you haven&#39;t read it, you could read it together (or in parallel) and talk about it the way you would with an adult friend. <br/>\n<br/>\nDo you talk about things you are learning? That&#39;s something to think about. I talk about things I&#39;m learning pretty frequently with my kids, and adult friends, too for that matter. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;When she mentions not being as smart as her friend, I point out that she is simply more interested in reading, while her friend seems to lean more towards math concepts.<br/>\n </span></blockquote>************<br/>\n<br/>\n(wince) It might be better to stop at &quot;you&#39;re learning different things&quot; or &quot;you enjoy different things&quot;. Dividing the world up into language and math is pretty artificial. That might be a hard idea to step away from after doing school for so long, but understanding plot and character development involves an undertanding of sequencing, progression, patterns, probability, and logic - all &quot;math&quot; skills. A novel or film grows from one of a very few algorithms! <br/>\n<br/>\nThere&#39;s also a subtle little message about &quot;not as smart&quot; being sent, when you say &quot;you&#39;re good at language not math&quot;. Math smart is all-the-way-smart by school standards. Language is, not to put to fine a point on it, &quot;girl smart&quot; - less smart. Those sorts of messages hang around under our skin a loooooot longer than we realize. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":414490706,"authorName":"sarahrandom78","from":"&quot;sarahrandom78&quot; &lt;bdb1978@...&gt;","profile":"sarahrandom78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Another struggle","postDate":"1271605528","msgId":43702,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxZjllbyt1ZDh0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDlFMTQyRUU4NTQwQjQ4NEY4OUIyMzlDQTFDQjU5RjQ0QExZTEFMQVAyPg=="},"prevInTopic":43701,"nextInTopic":43703,"prevInTime":43701,"nextInTime":43703,"topicId":43700,"numMessagesInTopic":0,"msgSnippet":"We talked at length about how we would do things differently this year. Last year we had to have approximately 5 worksheets from each subject to turn in for","messageBody":"<div id=\"ygrps-yiv-1640469748\">We talked at length about how we would do things differently this year. Last year we had to have approximately 5 worksheets from each subject to turn in for each 8 week marking period, and we did just that. I wasn&#39;t sure about going it alone it terms of keeping all my records so as to comply with the state education requirements so we finished out the year with that program. She was very resistant to doing the schoolwork and I didn&#39;t blame her, it was boring and most of it seemed completely pointless. I explained my reservations about homeschooling on my own, but said I would look into it and how to meet the legal requirements. I did, and showed her how I could keep track of the things she did, and put them into a journal for my record keeping needs. Things seemed fine, she is really interested in making her own video&#39;s. Making up stories and filming them with her Breyer horses, is one of her favorite things to do. I showed her how I broke that down into educationese and put it in my journal. She doesn&#39;t have to have any part in the record keeping, as I don&#39;t want to burden her with that, nor has she asked to do it. She is extremely gifted in reading, she devoured a 6 book boxed set of the Warriors series in under a week, I literally had to take food up to her because she didn&#39;t even want to come down and eat. She also finished the whole Twilight Saga. When she says things about not learning anything, I point out that she is learning things. When she mentions not being as smart as her friend, I point out that she is simply more interested in reading, while her friend seems to lean more towards math concepts. I ask her if she would like to have more structured lessons, she says no. This is when I usually ask, OK is there something you&#39;d like to be doing that would help you not feel like you&#39;re doing nothing with your life. She just shrugs and says no. Maybe she is just looking for that reassurance from me. Maybe it isn&#39;t that she needs something added, maybe she just needs me to remind her again that she is indeed doing something with her life and that she isn&#39;t dumb. If anybody else has any advice I&#39;m more than happy to hear it. Thank you again :)<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; my son has a tendency toward worry and anxiety too, and he said things like that (mostly in the past).  he is 11.5 now - if you were doing some form of school/school at home before this year, she most likely is still associating learning with schooly work - have you talked to her about your change of mindset that led you to unschooling? <br/>\n&gt; <br/>\n&gt; lyla<br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Another struggle","postDate":"1271547316","msgId":43701,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlFMTQyRUU4NTQwQjQ4NEY4OUIyMzlDQTFDQjU5RjQ0QExZTEFMQVAyPg==","inReplyToHeader":"PGhxZGQzOSsxMGh2ZkBlR3JvdXBzLmNvbT4=","referencesHeader":"PGhxZGQzOSsxMGh2ZkBlR3JvdXBzLmNvbT4="},"prevInTopic":43700,"nextInTopic":43702,"prevInTime":43700,"nextInTime":43702,"topicId":43700,"numMessagesInTopic":0,"msgSnippet":"my son has a tendency toward worry and anxiety too, and he said things like that (mostly in the past).  he is 11.5 now - if you were doing some form of","messageBody":"<div id=\"ygrps-yiv-852077150\">my son has a tendency toward worry and anxiety too, and he said things like that (mostly in the past).  he is 11.5 now - if you were doing some form of school/school at home before this year, she most likely is still associating learning with schooly work - have you talked to her about your change of mindset that led you to unschooling? <br/>\n<br/>\nlyla<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: sarahrandom78 <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Saturday, April 17, 2010 3:35 PM<br/>\n  Subject: [unschoolingbasics] Another struggle<br/>\n<br/>\n<br/>\n    <br/>\n  I need advice. I read this list all the time, haven&#39;t posted anything before. My daughter is almost 11, and we started homeschooling when she was going into 3rd grade. She would now be in 5th grade. 3rd and 4th grade we did under an umbrella program with the public school system. 3rd grade was pretty strict in regards to academics, 4th grade was a little more laid back but we still had to have stuff to turn in. This year I decided to unschool. The problem I&#39;m having is that, while my daughter seems generally happy to not have to do any school work, she says she doesn&#39;t feel like she&#39;s doing anything with her life. My neighbor just began homeschooling her daughter through a charter school program, and I think my daughter is feeling like because she doesn&#39;t know the answers to her friends homework questions, she must be dumb. I&#39;ve tried to explain that they are just learning different things but my daughter still acts upset. I&#39;ve offered to enroll her in the charter school next year (we will be gone to another state for the rest of this school year) but she doesn&#39;t want to do that. I&#39;m not sure what I need to be doing differently, I don&#39;t want my daughter to feel like a failure, or to feel like her life has no direction. She seems young to be worrying about such things, but she&#39;s always been a worrier, so I don&#39;t know if this is a common thing or if it&#39;s just her. Has anyone else had this problem and how did you deal with it?<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":414490706,"authorName":"sarahrandom78","from":"&quot;sarahrandom78&quot; &lt;bdb1978@...&gt;","profile":"sarahrandom78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Another struggle","postDate":"1271543721","msgId":43700,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxZGQzOSsxMGh2ZkBlR3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":43701,"prevInTime":43699,"nextInTime":43701,"topicId":43700,"numMessagesInTopic":0,"msgSnippet":"I need advice. I read this list all the time, haven t posted anything before. My daughter is almost 11, and we started homeschooling when she was going into","messageBody":"<div id=\"ygrps-yiv-1985652419\">I need advice. I read this list all the time, haven&#39;t posted anything before. My daughter is almost 11, and we started homeschooling when she was going into 3rd grade. She would now be in 5th grade. 3rd and 4th grade we did under an umbrella program with the public school system. 3rd grade was pretty strict in regards to academics, 4th grade was a little more laid back but we still had to have stuff to turn in. This year I decided to unschool. The problem I&#39;m having is that, while my daughter seems generally happy to not have to do any school work, she says she doesn&#39;t feel like she&#39;s doing anything with her life. My neighbor just began homeschooling her daughter through a charter school program, and I think my daughter is feeling like because she doesn&#39;t know the answers to her friends homework questions, she must be dumb. I&#39;ve tried to explain that they are just learning different things but my daughter still acts upset. I&#39;ve offered to enroll her in the charter school next year (we will be gone to another state for the rest of this school year) but she doesn&#39;t want to do that. I&#39;m not sure what I need to be doing differently, I don&#39;t want my daughter to feel like a failure, or to feel like her life has no direction. She seems young to be worrying about such things, but she&#39;s always been a worrier, so I don&#39;t know if this is a common thing or if it&#39;s just her. Has anyone else had this problem and how did you deal with it?</div>","specialLinks":[]}],"prevTopicId":27064,"nextTopicId":43727}}