{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":240358028,"authorName":"kristi_beguin","from":"&quot;kristi_beguin&quot; &lt;foehn_jye@...&gt;","profile":"kristi_beguin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"&quot;What I deserve,&quot; Expectations, Reactions: WAS: living/learning zone?","postDate":"1284653429","msgId":44808,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk2dGZobCt1MHQ4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk2cmpoOCt1MjFlQGVHcm91cHMuY29tPg=="},"prevInTopic":44805,"nextInTopic":0,"prevInTime":44807,"nextInTime":44809,"topicId":44782,"numMessagesInTopic":0,"msgSnippet":"M  wrote: but I do deserve to have my pretty things out right? **************** plaidpanties666@...wrote: I don t find it helpful to think in","messageBody":"<div id=\"ygrps-yiv-202293431\">&quot;M&quot; &lt;mharbajan@&gt; wrote:<br/>\n but I do deserve to have my pretty things out right? <br/>\n****************<br/>\n<br/>\nplaidpanties666@...wrote:<br/>\nI don&#39;t find it helpful to think in terms of &quot;what I deserve&quot; - or anyone - it sets me up to be self righteous when what I want to be is kind and thoughtful. <br/>\n****************<br/>\n<br/>\nThese recent threads have been really helpful for me. I especially appreciate the clarity with which several people have been describing their challenges. <br/>\n<br/>\nThings have been flowing along smoothly lately, with a few bumps in the road, but mostly nice and flowing and respectful and joyful...and then I encountered a perfect example of what Meredith describes this past weekend, because of the thought of &quot;What I deserve.&quot; I felt righteous and petulant because of my dashed expectations for &quot;what I deserved.&quot;<br/>\n<br/>\nMy husband and I are both martial artists, and we had an big annual event for our Tae Kwon Do school over the weekend. I&#39;d been looking forward to the afternoon workout for months. I had been giddy with excitement all week. My daughters attended the morning event, which was supposed to be 1.5 hours, but ended up being nearly 4. We took a break for lunch and on the way back to the gym, my nearly 5-year old DD started really crying hard, wailing--just really hearfelt crying--and said she didn&#39;t want me to workout but wanted me to sit with her and watch.<br/>\n<br/>\nIt took all I had to not drive them back home and leave them with their Dad, who was happy to forfeit his workout so that I could go. But the girls would have none of that. They wanted me to sit in the stands with them. I was dressed out, ready to work out, and I started crying. I deserved to workout, I told myself. I told them. I do so much for you all the time, please let me do this.  I sounded like a tantruming toddler, but I wasn&#39;t yelling. I was just bummed out completely. My expectations were thoroughly dashed.<br/>\n<br/>\nMy DH started to get upset, but I managed to help him move away from being upset, and just be happy to go work out. Once they calmed down, we all went into the gym, and I sat on the stands while they played in the hall.  :/ <br/>\n<br/>\nSO many thoughts rolled through my brain during the meltdown moment, and in the 2 hours following. I tried to process through them all...but when another mama came up to me and said, you know, they&#39;re just this little for such a short time, being a Mommy is so much more important than this one workout, I finally felt at peace. Of course it is.  And I handled myself in the moment pretty good considering how I might have reacted several months ago.<br/>\n<br/>\nSo often I wish that these sorts of situations weren&#39;t so hard for me to navigate, but I am ever hopeful that I will become more skilled at it as we progress along this path of life. These recent threads are adding to the skill set.</div>","specialLinks":[]},{"userId":239276017,"authorName":"M","from":"&quot;M&quot; &lt;mharbajan@...&gt;","profile":"mharbajan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: living/learning zone?","postDate":"1284650377","msgId":44805,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk2dGNpOStqZDI0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk2cmpoOCt1MjFlQGVHcm91cHMuY29tPg=="},"prevInTopic":44788,"nextInTopic":44808,"prevInTime":44804,"nextInTime":44806,"topicId":44782,"numMessagesInTopic":0,"msgSnippet":"Thanks Meredith. Yes seeing my table looking pretty actually calms me down :) I have not seen Sandra s Museum House page. I ll check it out right now. Thanks","messageBody":"<div id=\"ygrps-yiv-1444440314\">Thanks Meredith. Yes seeing my table looking pretty actually calms me down :)<br/>\nI have not seen Sandra&#39;s &quot;Museum House&quot; page. I&#39;ll check it out right now. Thanks again.<br/>\nMarissa</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: living/learning zone?","postDate":"1284591976","msgId":44788,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk2cmpoOCt1MjFlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk2cjRtMSt1ZXZrQGVHcm91cHMuY29tPg=="},"prevInTopic":44787,"nextInTopic":44805,"prevInTime":44787,"nextInTime":44789,"topicId":44782,"numMessagesInTopic":0,"msgSnippet":"... **************** I don t find it helpful to think in terms of what I deserve - or anyone - it sets me up to be self righteous when what I want to be is","messageBody":"<div id=\"ygrps-yiv-943230336\">&quot;M&quot; &lt;mharbajan@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;At the moment my dining table is set to entertain a party of six. No, we are not expecting company. I just feel like it&#39;s the only way to keep the clutter that seems to follow our kids off of our formal table, and I love the look of it. I do feel a bit guilty because I feel like I am restricting the kids access to the living/dining room, but I do deserve to have my pretty things out right? <br/>\n </span></blockquote>****************<br/>\n<br/>\nI don&#39;t find it helpful to think in terms of &quot;what I deserve&quot; - or anyone - it sets me up to be self righteous when what I want to be is kind and thoughtful. If having one room set aside for your pretty things helps you feel good about yourself, helps you be kinder and find more ways to say yes in the rest of your life, then maybe its a fantastic tool! I packed my china away years ago because it was too stressful for me to try to keep the kids away from it - I&#39;d rather never see it again than yell at someone over a broken dish. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I seem to need some form of organization in my home. Have you had this issue come up? How have you dealt with it?<br/>\n </span></blockquote>***************<br/>\n<br/>\nI have a small house, so it has been easier on all of us to make the whole place kid-friendly. There are lower shelves loaded with things younger kids want, and upper shelves loaded with things my tall young man might want (he&#39;s over six feet tall!). When Mo was younger, games with lots of little pieces I kept picked up and put away but most things were readily accessible. Have you read Sandra&#39;s &quot;Museum House&quot; page? Mine looks more like an old fashioned rummage sale, but its the same general idea:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/museum\">http://sandradodd.com/museum</a><br/>\n<br/>\n---Meredith (Mo 9, Ray 16)</div>","specialLinks":[]},{"userId":239276017,"authorName":"M","from":"&quot;M&quot; &lt;mharbajan@...&gt;","profile":"mharbajan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: living/learning zone?","postDate":"1284588517","msgId":44787,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk2cmc1NSs2NzcwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdENkJFM0Y3LUI0MTMtNDYxOC05MjFGLTFBMTY1OTYxOTNCNEB2ZXJpem9uLm5ldD4="},"prevInTopic":44784,"nextInTopic":44788,"prevInTime":44786,"nextInTime":44788,"topicId":44782,"numMessagesInTopic":0,"msgSnippet":"Wow! Thank you. The table isn t a point of contention with the kids. It s just my own misunderstanding of the unschooling lifestyle that leads to feelinng","messageBody":"<div id=\"ygrps-yiv-303325998\">Wow! Thank you. The table isn&#39;t a point of contention with the kids. It&#39;s just my own misunderstanding of the unschooling lifestyle that leads to feelinng guilty about things that aren&#39;t even an issue. The kids aren&#39;t trying to touch anything on the table. They don&#39;t even care to go near it unless they need something from the china cabinet.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Most of us grew up with parents who were promised it would be &quot;their  <br/>\n&gt; turn&quot; when they were adults. That&#39;s when they could have life their way.<br/>\n&gt; <br/>\n&gt; Turns out it was a lie. And yet many parents try to make that lie at  <br/>\n&gt; least a small reality by drawing a line to protect a bit of themselves  <br/>\n&gt; from encroachment by kids (or spouses). If that line involves  <br/>\n&gt; inconveniencing people, they&#39;re likely to resent it and likely to only  <br/>\n&gt; honor the line (need) grudgingly. And the parents will pass on the  <br/>\n&gt; &quot;It&#39;ll be your turn when you&#39;re adults&quot; lie as a legacy to their  <br/>\n&gt; children.<br/>\n<br/>\n&gt; The more effort we put in to keep our needs from negatively impacting  <br/>\n&gt; others, the more people will want to help -- when they&#39;re  <br/>\n&gt; developmentally able -- get something that&#39;s important to us.<br/>\n&gt; <br/>\n&gt; The less we look at balance and fair and rights and what we deserve  <br/>\n&gt; and the more we look toward joy, peace, support, respect, the more  <br/>\n&gt; support and joy and respect and peace we&#39;ll get back. (When kids are  <br/>\n&gt; developmentally able!) If you carve from the family what&#39;s right and  <br/>\n&gt; fair for you to have, what you deserve, taking or inconveniencing or  <br/>\n&gt; denying them something they&#39;d like in the process, that&#39;s the  <br/>\n&gt; atmosphere you&#39;ll create, where each person is looking at their own  <br/>\n&gt; rights and what they deserve, weighing the fairness of what someone  <br/>\n&gt; else gets against what they get.<br/>\n<br/>\n<br/>\n </span></blockquote>Thanks for this. It really helped me to refocus on my goal of respecting the kids.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It wasn&#39;t &quot;fair&quot; for her to stand in the rain for something that  <br/>\n&gt; wasn&#39;t at the top of her list but it was joyfully given and loving and  <br/>\n&gt; kind of her.<br/>\n<br/>\n </span></blockquote>I really hope to see that kind of thoughtful and loving consideration from my kids one day. I have a long way to go, but I will get there. Thanks Joyce.<br/>\nMarissa</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] living/learning zone?","postDate":"1284581752","msgId":44784,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdENkJFM0Y3LUI0MTMtNDYxOC05MjFGLTFBMTY1OTYxOTNCNEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGk2cjRtMSt1ZXZrQGVHcm91cHMuY29tPg==","referencesHeader":"PGk2cjRtMSt1ZXZrQGVHcm91cHMuY29tPg=="},"prevInTopic":44782,"nextInTopic":44787,"prevInTime":44783,"nextInTime":44785,"topicId":44782,"numMessagesInTopic":0,"msgSnippet":"... There seem to be several issues tangled up together. If what Mom wants creates tension in the atmosphere and chips at her relationship with her kids, then","messageBody":"<div id=\"ygrps-yiv-1339714542\">On Sep 15, 2010, at 2:52 PM, M wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I just feel like it&#39;s the only way to keep the clutter that seems to  <br/>\n&gt; follow our kids off of our formal table, and I love the look of it.  <br/>\n&gt; I do feel a bit guilty because I feel like I am restricting the kids  <br/>\n&gt; access to the living/dining room, but I do deserve to have my pretty  <br/>\n&gt; things out right?<br/>\n&gt; I have resolved to use the pantry cart in the kitchen to house art  <br/>\n&gt; supplies so the kids can use the kitchen table as their main  <br/>\n&gt; activity zone.<br/>\n<br/>\n </span></blockquote>There seem to be several issues tangled up together.<br/>\n<br/>\nIf what Mom wants creates tension in the atmosphere and chips at her  <br/>\nrelationship with her kids, then it&#39;s a good thing to rethink. (Not  <br/>\nsaying it is, just that that&#39;s a good yardstick as a test to see if a  <br/>\nview is off from where you&#39;d like to be with unschooling.)<br/>\n<br/>\nThe goal isn&#39;t to give kids access to all parts of the house. The goal  <br/>\nisn&#39;t to apply unschooling rules like never saying no or giving them  <br/>\nfull freedom to roam the house. It&#39;s about embracing the principles to  <br/>\nhelp you make choices that move closer to radical unschooling: joyful  <br/>\nlearning, respect for others, growing relationships.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I just feel like it&#39;s the only way to keep the clutter that seems to  <br/>\n&gt; follow our kids off of our formal table<br/>\n<br/>\n<br/>\n </span></blockquote>The more options you come up with the better, otherwise one option can  <br/>\nfeel like a master, dictating your other choices to make sure it stays  <br/>\nin place.<br/>\n<br/>\nIf the kids don&#39;t need the formal dining table, if they have other,  <br/>\nbetter options, there isn&#39;t a reason to turn it into a play area.<br/>\n<br/>\nIf the formal china becomes a draw and you find yourself saying no a  <br/>\nlot, or causing the kids to sneak in to get access, then the solution  <br/>\nis impacting the joy in the house and should be rethought.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but I do deserve to have my pretty things out right?<br/>\n<br/>\n<br/>\n </span></blockquote>Most of us grew up with parents who were promised it would be &quot;their  <br/>\nturn&quot; when they were adults. That&#39;s when they could have life their way.<br/>\n<br/>\nTurns out it was a lie. And yet many parents try to make that lie at  <br/>\nleast a small reality by drawing a line to protect a bit of themselves  <br/>\nfrom encroachment by kids (or spouses). If that line involves  <br/>\ninconveniencing people, they&#39;re likely to resent it and likely to only  <br/>\nhonor the line (need) grudgingly. And the parents will pass on the  <br/>\n&quot;It&#39;ll be your turn when you&#39;re adults&quot; lie as a legacy to their  <br/>\nchildren.<br/>\n<br/>\nThe more effort we put in to keep our needs from negatively impacting  <br/>\nothers, the more people will want to help -- when they&#39;re  <br/>\ndevelopmentally able -- get something that&#39;s important to us.<br/>\n<br/>\nThe less we look at balance and fair and rights and what we deserve  <br/>\nand the more we look toward joy, peace, support, respect, the more  <br/>\nsupport and joy and respect and peace we&#39;ll get back. (When kids are  <br/>\ndevelopmentally able!) If you carve from the family what&#39;s right and  <br/>\nfair for you to have, what you deserve, taking or inconveniencing or  <br/>\ndenying them something they&#39;d like in the process, that&#39;s the  <br/>\natmosphere you&#39;ll create, where each person is looking at their own  <br/>\nrights and what they deserve, weighing the fairness of what someone  <br/>\nelse gets against what they get.<br/>\n<br/>\nWhen I was in England last month with my husband and daughter I really  <br/>\nwanted to go to the recreation of Shakespeare&#39;s Globe Theater. The  <br/>\ngallery and stage are covered, but the cheap &quot;seats&quot; (standing room in  <br/>\nfront of the stage) are uncovered and it was raining. My daughter Kat  <br/>\n(19) didn&#39;t just grudgingly put up with standing in the rain for 15  <br/>\nminutes of the play she did it joyfully, feeding off my delight  <br/>\nbecause that&#39;s what she&#39;s experienced from me and her dad. She went  <br/>\n(damp) through the museum and sat down to draw to wait for me to go  <br/>\nslower, telling me to take my time. (And I thanked her sincerely as I  <br/>\ndo whenever she&#39;s giving me the gift of her time to help me out :-)<br/>\n<br/>\nIt wasn&#39;t &quot;fair&quot; for her to stand in the rain for something that  <br/>\nwasn&#39;t at the top of her list but it was joyfully given and loving and  <br/>\nkind of her.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":239276017,"authorName":"M","from":"&quot;M&quot; &lt;mharbajan@...&gt;","profile":"mharbajan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"living/learning zone?","postDate":"1284576769","msgId":44782,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk2cjRtMSt1ZXZrQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":44784,"prevInTime":44781,"nextInTime":44783,"topicId":44782,"numMessagesInTopic":0,"msgSnippet":"Hi Everyone, I was wondering what your main living/learning areas look like. This may seem like a silly thing to ask but I have a good reason. I love fine","messageBody":"<div id=\"ygrps-yiv-1167414843\">Hi Everyone, <br/>\nI was wondering what your main living/learning areas look like. This may seem like a silly thing to ask but I have a good reason. I love fine china. At the moment my dining table is set to entertain a party of six. No, we are not expecting company. I just feel like it&#39;s the only way to keep the clutter that seems to follow our kids off of our formal table, and I love the look of it. I do feel a bit guilty because I feel like I am restricting the kids access to the living/dining room, but I do deserve to have my pretty things out right? <br/>\nI have resolved to use the pantry cart in the kitchen to house art supplies so the kids can use the kitchen table as their main activity zone. No one wants to use the basement because it&#39;s not really done to our comfort level. Besides, who want to hide underground all day?? :)<br/>\nI seem to need some form of organization in my home. Have you had this issue come up? How have you dealt with it?<br/>\nThanks,<br/>\nMarissa</div>","specialLinks":[]}],"prevTopicId":44757,"nextTopicId":44806}}