{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":21,"messages":[{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Re: making home more fun/ kids in school","postDate":"1259422222","msgId":42236,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkxMTI4MDczMHA0MWZkNjJiMHJjYzY1MmM5OGNkNjYwODIyQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDg2MjUyNS40NDQ3OS5xbUB3ZWIxODAzMTUubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PGhlZWtjZSs4Yjc1QGVHcm91cHMuY29tPgkgPDg2MjUyNS40NDQ3OS5xbUB3ZWIxODAzMTUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":42173,"nextInTopic":0,"prevInTime":42235,"nextInTime":42237,"topicId":42120,"numMessagesInTopic":0,"msgSnippet":"I have a child who has chosen school. I do whatever she needs me to support her. I helped her develop a routine that she enjoyed and helped her get to bed at a","messageBody":"<div id=\"ygrps-yiv-2143755632\">I have a child who has chosen school. I do whatever she needs me to support<br/>\nher. I helped her develop a routine that she enjoyed and helped her get to<br/>\nbed at a reasonable time. She is old enough that she didn&#39;t need me to wake<br/>\nup with her after the first couple of mornings. But I would have had she<br/>\nneeded me too. I sit with her in the evening and listen to her day. Listen,<br/>\nreally listen. I help her with her homework. I have even done her homework<br/>\nfor her once. There was this huge packet of busy work that she already<br/>\nunderstood and just loathed. She was lamenting and I offered to help. She<br/>\nworked on some stuff that interested her. Her step dad and I went to her<br/>\nschool for parent visit day and hung out with her in her classes. If I<br/>\nresented her choice then I wouldn&#39;t be able to do these things with love in<br/>\nmy heart.<br/>\n<br/>\nI would err on the side off doing more for them. I would look at my own<br/>\nbaggage before I started to give them some. Why are you feeling resentful?<br/>\nHow is resentment helping you or your children?<br/>\nThere is a really sweet book on parenting I like, it is very healing. Naomi<br/>\nAldort, Raising Our Children, Raising Ourselves. Its not specifically about<br/>\nunschooling but it is a very nice guide to gently parenting and UNparenting<br/>\nyourself.<br/>\n<br/>\nMy goal as a parent is to create a life worth living. For me and my children<br/>\nand my husband. I don&#39;t want to be spiteful to my kids! Best wishes on<br/>\nhealing yourself.<br/>\n<br/>\nfaith<br/>\n<br/>\n<br/>\nOn Tue, Nov 24, 2009 at 1:38 PM, Toby Rosenberg<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:philipntoby@...\">philipntoby@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Thank you You are right about my dh Now he is planning to put my other son<br/>\n&gt; in school too. I am very sad. I am trying to figure out how to support my<br/>\n&gt; children.<br/>\n&gt; I&#39;m having a hard time dealing with it because they say they want to go,<br/>\n&gt; but they don&#39;t want to do the things they need to do to get there (go to bed<br/>\n&gt; early and get themselves ready in the morning) I have a lot of resentment<br/>\n&gt; towards my dh because he wants them in school but he doesnt&#39; want to be<br/>\n&gt; consistent about their bedtimes and then I&#39;m the one dealing with cranky<br/>\n&gt; children in the morning.<br/>\n&gt;<br/>\n&gt; I guess I&#39;ve started a new thread with this last paragraph. I guess my<br/>\n&gt; question here is how to be a good unschooling parent to your children when<br/>\n&gt; their father has chosen school for them? How do I balance being supportive<br/>\n&gt; without doing everything for them? For example, if I was a parent that<br/>\n&gt; wanted my children in school, I would dress them in the morning when they<br/>\n&gt; are too tired to get ready. I feel too resentful doing that under these<br/>\n&gt; circumstances.<br/>\n&gt;<br/>\n&gt; Thanks<br/>\n&gt;<br/>\n&gt; Toby<br/>\n&gt;<br/>\n&gt;<br/>\n </span></blockquote>-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: making home more fun","postDate":"1259108063","msgId":42169,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU0QkQ1MENCRjI1NTREQjRCNzFEMjBCQThGODNDNTk2QGJpZ3N1cnByaXNlPg=="},"prevInTopic":42167,"nextInTopic":42173,"prevInTime":42168,"nextInTime":42170,"topicId":42120,"numMessagesInTopic":0,"msgSnippet":"***Yes, bringing him food does help. However, it s only helpful to me if I bring veggies that are not going to make a huge mess. Otherwise, I end up with","messageBody":"<div id=\"ygrps-yiv-2074309249\">***Yes, bringing him food does help. However, it&#39;s only helpful to me if I bring<br/>\nveggies that are not going to make a huge mess. Otherwise, I end up with crumbs<br/>\nground into our carpet. ***<br/>\n<br/>\nGo get one of those cheap thirty-nine dollar 5x8 rugs from K-mart and put it under his chair. <br/>\nOr put down an old sheet and shake the crumbs out outside. <br/>\nOr make a canvas floorcloth to put over the carpet, crumbs sweep right up. <br/>\nOr put down a paint drop cloth and throw the thing away when he&#39;s done. <br/>\nOr tear the carpet out and put some vinyl down so you can sweep.<br/>\nOr move the game station to a room without carpet. <br/>\n<br/>\nCarpet should not be more important than your kid.  I know it&#39;s not and you know it&#39;s not so that shouldn&#39;t be an excuse anymore for not taking him food you know he&#39;ll eat.  <br/>\n<br/>\n***He completely ignored me. ***<br/>\n<br/>\nHe&#39;s not making a judgment about the value of what you have to say, he&#39;s busy.  He&#39;s engrossed.  Any person deeply engrossed in work or play can miss information coming from the outside.  Lot&#39;s of times a very busy person thinks he&#39;ll respond in a second when he&#39;s finished a particular task but then some other task comes up and the seconds turn into minutes. <br/>\nIf you could change the way you see him - see him as a person who&#39;s really involved in something interesting and not as a person who&#39;s ignoring you, it will help.  Don&#39;t take it personally. <br/>\n<br/>\n***After ignoring me again, I turned off the TV.*** <br/>\n<br/>\nNone of us are at our best when we&#39;re sick.  But if it&#39;s something you&#39;ve done before consider whether you would have done that to an adult?  If you put your relationship with your son above video games, carpet and food you&#39;ll find more ways to approach some problems and you&#39;ll find that some things aren&#39;t problems at all.  <br/>\n<br/>\n***If I had left the matter<br/>\nalone, he might have gotten hungry in an hour or so. At that point, he would<br/>\nhave come looking to me for food and I would have felt resentful.***<br/>\n<br/>\nThere were more choices than turning off the TV or feeling resentful.  <br/>\nYou might have taken the food to the kids.  You might have left it in the microwave with a note to reheat if they found their way to the kitchen.  You might have left other easy food available for them or you might have decided to feed him if he turned up looking for food.    Food is about nourishment.  It&#39;s not about the lunch hour.  You might have called a friend over to hang out with the kids while you got some rest.  You might have chosen not to be resentful (not always easy when we&#39;re sick, I know,  but always worth the effort)   At the risk of stating what is very obvious - we control our emotions, they don&#39;t control us.  We have a choice about how we feel and how we act on our feelings.   <br/>\n<br/>\n***I don&#39;t want to prepare numerous meals around everyone&#39;s different schedules. ***<br/>\n<br/>\nSomething I started doing at about the time Dylan was staying up later at night than I wanted to stay up was getting a few different foods ready so that he could grab something easily if he was hungry.  <br/>\nI might have made salad and put it in single serving containers that he could just grab and go back to whatever he was doing.   Or put some food in a microwavable container so he could heat it up.  Or leave the microwave popcorn on the counter.  Or make a few sandwiches and leave them in the fridge with notes on them.   I&#39;d wash and cut up fruit and vegetables and put them in bowls so he could just snag a bowl and eat.    I still do that.  David (dh) is getting home about six hours after Dylan and I eat and sometimes after I&#39;ve gone to bed.  I leave a plate of food in the fridge with a note on it about microwave or oven temps, or set the oven to preheat just before dh gets home so he can just slide the food right in.   And Dylan stays up very late and gets hungry in the early morning hours so I make sure there&#39;s food ready for him to grab or reheat without much effort.   <br/>\n <br/>\n***I think I spend too much of my day catering to their food whims.***<br/>\n<br/>\nDid you write that you started your own catering business?   Are you willing to cater to the food whims of strangers but feel your children are asking too much of you? <br/>\nIt really seems like you have some issues with unmet needs of your own.  You can blow your kids childhood trying to help yourself feel better - and you never will if your self soothing comes at the expense of your kids- or you can address it now and decide to be the kind and generous parent you should have had and that your kids deserve.   <br/>\n<br/>\n*** Is it fair that I should do something for them that I don&#39;t necessarily want to do and they have no interest in helping?***<br/>\n<br/>\nYou&#39;re their mom.  They&#39;re your children.  You should want to do for them and if you don&#39;t and can&#39;t find a way to want to, then unschooling really won&#39;t work for you.    Are you chronically ill?  If so, would it be possible to get some help, maybe through your church if you have one and can&#39;t afford a mother&#39;s helper.<br/>\n<br/>\nBeing a mom is not about what&#39;s fair.  You can choose to be resentful or you can choose anything else.  You can choose to leave your family tomorrow.   You made a choice to have kids and to keep them and now you can make a choice about the kind of mom you&#39;re going to be.  A resentful mom who is more interested in herself than in her kids isn&#39;t the best choice.  If you&#39;re sick it&#39;s really easy to focus on yourself and feel needy and if that&#39;s the case get some help around the house and find someone who&#39;s willing to come play with the kids.   If your feelings are rooted in the way you were parented and how your needs as a child were neglected (if they were)  then you can address that so that you don&#39;t put those same feelings of neediness and resentment into your own children.   <br/>\n<br/>\nUnfair is a child who had no choice about being born, no choice about what kind of parents he got, no right to pick different parents if the parents he has are not emotionally ready to be really good parents.   Adults have all the choices in the parent child relationship.  <br/>\n<br/>\nDoing things for your kids can fill you up emotionally and can help heal your own emotional hurts in some ways, but if your emotional maturity is stuck somewhere in childhood your needs are going to get in the way of meeting your kids needs.  That might be more than this list can help with but there might be something useful here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/attitude\">http://sandradodd.com/attitude</a> , <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/beginning\">http://sandradodd.com/beginning</a> , <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/change/\">http://sandradodd.com/change/</a> , <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/choice\">http://sandradodd.com/choice</a> , <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/mama\">http://sandradodd.com/peace/mama</a> <br/>\n<br/>\nSandra Dodd once wrote about a concept called re-parenting that she had heard about through Adult Children of Alcoholics.  In one version adults address unmet childhood needs by parenting a teddy bear in the loving, sweet way wish their parents would have treated them .  Sandra and others have written often about parents with unmet needs helping to heal themselves through gentle, respectful parenting - same concept, be the parent you wish you would have had.  <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: making home more fun/ kids in school","postDate":"1259107381","msgId":42167,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlaHM3bCtiZW8xQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg2MjUyNS40NDQ3OS5xbUB3ZWIxODAzMTUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":42162,"nextInTopic":42169,"prevInTime":42166,"nextInTime":42168,"topicId":42120,"numMessagesInTopic":0,"msgSnippet":"... ******************* Step away from the word unschooling. Work on being a supportive, caring parent, period. ... Why does there need to be balance? Do","messageBody":"<div id=\"ygrps-yiv-1187200614\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Toby Rosenberg &lt;philipntoby@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I guess my question here is how to be a good unschooling parent to your children when their father has chosen school for them?<br/>\n </span></blockquote>*******************<br/>\n<br/>\nStep away from the word unschooling. Work on being a supportive, caring parent, period. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;How do I balance being supportive without doing everything for them?<br/>\n<br/>\n </span></blockquote>Why does there need to be balance? Do everything they want as much as you possibly can! But do everything they want joyfully, as a gift to them, not grudgingly or they&#39;ll want more and more - because the action is merely a vehicle for the underlying love and attention! When you bring a sandwich grudgingly you make that need bigger, and create a situation where they never seem to get &quot;enough&quot;.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;For example, if I was a parent that wanted my children in school, I would dress them in the morning when they are too tired to get ready. I feel too resentful doing that under these circumstances. <br/>\n </span></blockquote>***********************<br/>\n<br/>\nWhy can&#39;t you dress them lovingly anyway? Because you resent their father? That&#39;s cruel. Don&#39;t drag your kids into that. <br/>\n<br/>\nThis is going back to what I said in another post about being stuck. Regardless of how much control you have over your kids&#39; lives, you at the very least can control how you interact with them. You don&#39;t Have to let your disappointment over not having the life you imagined get in the way of that. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":334729351,"authorName":"theburkemommy","from":"&quot;theburkemommy&quot; &lt;theburkemommy@...&gt;","profile":"theburkemommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: making home more fun/ kids in school","postDate":"1259106279","msgId":42173,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlaHI1Nys4dWdoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg2MjUyNS40NDQ3OS5xbUB3ZWIxODAzMTUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":42169,"nextInTopic":42236,"prevInTime":42172,"nextInTime":42174,"topicId":42120,"numMessagesInTopic":0,"msgSnippet":"It s not the kids fault that their dad has chosen school for them.  If you d do something to help them get ready for school if school was your idea, then I","messageBody":"<div id=\"ygrps-yiv-330935354\">It&#39;s not the kids&#39; fault that their dad has chosen school for them.  If you&#39;d do something to help them get ready for school if school was your idea, then I would suggest doing those same things for them now.  I can totally understand being resentful, but it&#39;s not loving and supportive to not help them.  <br/>\n<br/>\nCan you help them come up with a bedtime routine, so they can get to bed at a decent time each night?  You could make each evening into a really sweet time with them.  If they&#39;re not wanting to go to bed early enough to be well rested, just try to make the house a calm place to be each evening.  Turn the lights lower, turn volume lower, light some lavender candles around the house, etc. <br/>\n<br/>\nIf they still stay up so late that they have a hard time getting ready in the morning...then help them get dressed, etc.  You can pack their backpacks and lunches the night before.  You can help them pick out their clothes before they go to bed.  You could have quick and easy breakfast options available.  You could take them to school in the morning, so they don&#39;t have to be ready early enough to catch the bus.<br/>\n<br/>\nYou can still make home a great place to be!  Hopefully your dh will change his mind over time.  <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Toby Rosenberg &lt;philipntoby@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Thank you You are right about my dh Now he is planning to put my other son in school too. I am very sad. I am trying to figure out how to support my children. <br/>\n&gt; I&#39;m having a hard time dealing with it because they say they want to go, but they don&#39;t want to do the things they need to do to get there (go to bed early and get themselves ready in the morning) I have a lot of resentment towards my dh because he wants them in school but he doesnt&#39; want to be consistent about their bedtimes and then I&#39;m the one dealing with cranky children in the morning. <br/>\n&gt; Â <br/>\n&gt; I guess I&#39;ve started a new thread with this last paragraph. I guess my question here is how to be a good unschooling parent to your children when their father has chosen school for them? How do I balance being supportive without doing everything for them? For example, if I was a parent that wanted my children in school, I would dress them in the morning when they are too tired to get ready. I feel too resentful doing that under these circumstances. <br/>\n&gt; Â <br/>\n&gt; Thanks<br/>\n&gt; Â <br/>\n&gt; Toby </span></blockquote></div>","specialLinks":[]},{"userId":294879737,"authorName":"Toby Rosenberg","from":"Toby Rosenberg &lt;philipntoby@...&gt;","profile":"philipntoby@sbcglobal.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: making home more fun/ kids in school","postDate":"1259087881","msgId":42162,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2MjUyNS40NDQ3OS5xbUB3ZWIxODAzMTUubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGhlZWtjZSs4Yjc1QGVHcm91cHMuY29tPg=="},"prevInTopic":42160,"nextInTopic":42167,"prevInTime":42161,"nextInTime":42163,"topicId":42120,"numMessagesInTopic":0,"msgSnippet":"Thank you You are right about my dh Now he is planning to put my other son in school too. I am very sad. I am trying to figure out how to support my children. ","messageBody":"<div id=\"ygrps-yiv-1647018738\">Thank you You are right about my dh Now he is planning to put my other son in school too. I am very sad. I am trying to figure out how to support my children. <br/>\nI&#39;m having a hard time dealing with it because they say they want to go, but they don&#39;t want to do the things they need to do to get there (go to bed early and get themselves ready in the morning) I have a lot of resentment towards my dh because he wants them in school but he doesnt&#39; want to be consistent about their bedtimes and then I&#39;m the one dealing with cranky children in the morning. <br/>\n <br/>\nI guess I&#39;ve started a new thread with this last paragraph. I guess my question here is how to be a good unschooling parent to your children when their father has chosen school for them? How do I balance being supportive without doing everything for them? For example, if I was a parent that wanted my children in school, I would dress them in the morning when they are too tired to get ready. I feel too resentful doing that under these circumstances. <br/>\n <br/>\nThanks<br/>\n <br/>\nToby<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Mon, 11/23/09, plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:meredith@...\">meredith@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:meredith@...\">meredith@...</a>&gt;<br/>\nSubject: [unschoolingbasics] Re: making home more fun<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Monday, November 23, 2009, 1:30 PM<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n--- In unschoolingbasics@ yahoogroups. com, Toby Rosenberg &lt;philipntoby@ ....&gt; wrote:<br/>\n&gt;<br/>\n&gt; Thank you for your comments. The &quot;issues&quot; I have are definitely more mine than my kids. One thought I have is that I I feel like I I&#39;ve failed because 2 of my children have chosen to go to school.<br/>\n************ *****<br/>\n<br/>\nBut your dh is part of that issue, right? He&#39;s putting pressure on the kids to &quot;want&quot; school - the pressure of his approval. Not saying that to get you mad at your dh, but its not a cut and dried situation.<br/>\n<br/>\n&gt;&gt;I think, oh, other people are having way more fun so that&#39;s what I must be doing wrong.<br/>\n************ ******<br/>\n<br/>\nMaking home more &quot;fun&quot; than school is like saying to make it more fun than a trip to the dentist! Its more a matter of being engaged with kids, in ways and to the extent that they want, of providing opportunities rather than pushing them. <br/>\n<br/>\nWinter holidays are coming up, so look for ways to make home cozy and attractive to all your kids. Maybe not with the intent of &quot;winning them over&quot; since there are other forces at work than their own desires but in terms of making home a place where everyone can relax and enjoy themselves. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":192011307,"authorName":"Rebecca Sanjabi","from":"Rebecca Sanjabi &lt;thystle@...&gt;","profile":"rtsanjabi","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: making home more fun","postDate":"1259086090","msgId":42160,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFFMTE2NjZBLTY5NzMtNDk5Mi1CMkU4LTExNUE0QkY1NjI2MUBnbWFpbC5jb20+","inReplyToHeader":"PDdCNzczM0UwLUFGRUYtNEQ4Qy1CQTBGLTMyMDVBRDBFMzg2NUB2ZXJpem9uLm5ldD4=","referencesHeader":"PDk1NTE1MS4zNzk4NC5xbUB3ZWIxODAzMTMubWFpbC5ncTEueWFob28uY29tPiA8aGVla2NlKzhiNzVAZUdyb3Vwcy5jb20+IDxjYzYxMjBhMTA5MTEyMzEzMzl0NGU4M2RhM2NvY2M3NWU2ZmE5NDE0NDEyYUBtYWlsLmdtYWlsLmNvbT4gPDdCNzczM0UwLUFGRUYtNEQ4Qy1CQTBGLTMyMDVBRDBFMzg2NUB2ZXJpem9uLm5ldD4="},"prevInTopic":42158,"nextInTopic":42162,"prevInTime":42159,"nextInTime":42161,"topicId":42120,"numMessagesInTopic":0,"msgSnippet":"... Yes! Yes! Yes! Thank you, thank you, thank you! (You being Joyce and everyone else who so patiently keep posting) Also something I am considering as","messageBody":"<div id=\"ygrps-yiv-526120067\">On Nov 24, 2009, at 2:00 AM, Joyce Fetteroll wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; So as National Novel Writing Month draws to a close and people are<br/>\n&gt; feverishly trying to get out 50,000 words before midnight November<br/>\n&gt; 30th it&#39;s an appropriate time to send out kudos to all the people who<br/>\n&gt; do take a huge chunk of time from their lives to share their<br/>\n&gt; unschooling thoughts and help people all year long :-)<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Yes! Yes! Yes! Thank you, thank you, thank you! (You being Joyce and  <br/>\neveryone else who so patiently keep posting) Also something I am  <br/>\nconsidering as Thanksgiving nears.<br/>\n<br/>\nWith much gratitude,<br/>\n<br/>\nRebecca<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":359907606,"authorName":"AllisonR","from":"&quot;AllisonR&quot; &lt;earlyhiker@...&gt;","profile":"earlyhiker","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: making home more fun","postDate":"1259076105","msgId":42158,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlZ3RtOSs5OTFyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdCNzczM0UwLUFGRUYtNEQ4Qy1CQTBGLTMyMDVBRDBFMzg2NUB2ZXJpem9uLm5ldD4="},"prevInTopic":42155,"nextInTopic":42160,"prevInTime":42157,"nextInTime":42159,"topicId":42120,"numMessagesInTopic":0,"msgSnippet":"Joyce, you are like a big on-line shoulder...or hug!  What a lovely perspective.  I always enjoy your comments. Danke, Allison","messageBody":"<div id=\"ygrps-yiv-1674640106\">Joyce, you are like a big on-line shoulder...or hug!  What a lovely perspective.  I always enjoy your comments.<br/>\nDanke, <br/>\nAllison</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: making home more fun","postDate":"1259056812","msgId":42155,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdCNzczM0UwLUFGRUYtNEQ4Qy1CQTBGLTMyMDVBRDBFMzg2NUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGNjNjEyMGExMDkxMTIzMTMzOXQ0ZTgzZGEzY29jYzc1ZTZmYTk0MTQ0MTJhQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDk1NTE1MS4zNzk4NC5xbUB3ZWIxODAzMTMubWFpbC5ncTEueWFob28uY29tPiA8aGVla2NlKzhiNzVAZUdyb3Vwcy5jb20+IDxjYzYxMjBhMTA5MTEyMzEzMzl0NGU4M2RhM2NvY2M3NWU2ZmE5NDE0NDEyYUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":42154,"nextInTopic":42158,"prevInTime":42154,"nextInTime":42156,"topicId":42120,"numMessagesInTopic":0,"msgSnippet":"... And important to remember, not much fun to write! I think it s easy for people to fall into the mental pitfall of subconsciously feeling that something","messageBody":"<div id=\"ygrps-yiv-1025565392\">On Nov 23, 2009, at 4:39 PM, Faith Void wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It just isn&#39;t that interesting to read :-)<br/>\n<br/>\n </span></blockquote>And important to remember, not much fun to write!<br/>\n<br/>\nI think it&#39;s easy for people to fall into the mental pitfall of  <br/>\nsubconsciously feeling that something that took 10 seconds to read  <br/>\nalso took 10 seconds to write!<br/>\n<br/>\nIt can *easily* take a half hour to write out a day. It&#39;s *much*  <br/>\neasier to spend that half hour writing out exciting events that you  <br/>\nwant to share with someone. Not so fun to take time from a busy day  <br/>\nto detail something not inherently interesting or work to find an  <br/>\ninteresting way to tell it!<br/>\n<br/>\nSo as National Novel Writing Month draws to a close and people are  <br/>\nfeverishly trying to get out 50,000 words before midnight November  <br/>\n30th it&#39;s an appropriate time to send out kudos to all the people who  <br/>\ndo take a huge chunk of time from their lives to share their  <br/>\nunschooling thoughts and help people all year long :-)<br/>\n<br/>\nJoyce<br/>\n(and that took almost 10 minutes to write!)</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Re: making home more fun","postDate":"1259012394","msgId":42154,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkxMTIzMTMzOXQ0ZTgzZGEzY29jYzc1ZTZmYTk0MTQ0MTJhQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhlZWtjZSs4Yjc1QGVHcm91cHMuY29tPg==","referencesHeader":"PDk1NTE1MS4zNzk4NC5xbUB3ZWIxODAzMTMubWFpbC5ncTEueWFob28uY29tPgkgPGhlZWtjZSs4Yjc1QGVHcm91cHMuY29tPg=="},"prevInTopic":42150,"nextInTopic":42155,"prevInTime":42153,"nextInTime":42155,"topicId":42120,"numMessagesInTopic":0,"msgSnippet":"... I see a lot of people get stuck on this. I think because we are only seeing or hearing a small part of what goes on in each others worlds. I don t blog ","messageBody":"<div id=\"ygrps-yiv-1830601489\">On Mon, Nov 23, 2009 at 1:30 PM,wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; &gt;&gt;I think, oh, other people are having way more fun so that&#39;s what I must<br/>\n&gt; be doing wrong.<br/>\n&gt; ******************<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I see a lot of people get stuck on this. I think because we are only seeing<br/>\nor hearing a small part of what goes on in each others worlds. I don&#39;t blog<br/>\nabout days that we spend a lot of time watching TV or reading or<br/>\ndaydreaming. It just isn&#39;t that interesting to read :-) And usually it is a<br/>\nperiod we are all (or some of us) reflecting rather than doing.<br/>\n<br/>\nRecipe for a FUN home:<br/>\n<br/>\nFun, loving, connected parent<br/>\n<br/>\nUnlimited freedom, space to be<br/>\n<br/>\nNew and exciting things to explore<br/>\n<br/>\n<br/>\nI am just kind of thinking out loud here. The specifics look different in<br/>\neach families home. But in general to live with joy these are the basic<br/>\ningredients. I set my home up for success. Success for my kids to live<br/>\njoyFULL lives.<br/>\n<br/>\nWe have space to run, jump, climb and when we had a smaller house with<br/>\nlittle yard I took them places frequently to run, explore, and use their<br/>\nbodies. We have space to play quietly and noisily without being disturbed.<br/>\nWe have space to create and get messy. We have furniture that is kid<br/>\nfriendly (I love our older leather sofas!). Our house is kept in a manner<br/>\nthat they can move and create and be kids. It isn&#39;t up to BH&G standards but<br/>\nwe are happy with it.<br/>\n<br/>\nMy kids have the freedom to choose their day and what is fun for them,<br/>\nexploring a new outdoor place or quietly sitting at the computer or an art<br/>\nproject or helping with a house project or reading a book, etc. I have ideas<br/>\navailable for people to choose from if they need help. I will often ask if<br/>\nthey would like to do something quiet (read a story with me, etc) or do<br/>\nsomething active (play with the physical therapy ball or trampoline, etc) or<br/>\ncreate (cook, art, etc). I will just offer a couple things at a time to not<br/>\noverwhelm. And when my kids are doing their own thing, I use that as a time<br/>\nto do my own thing. That is sometimes create a clean space for more<br/>\nadventure or knit or read, or a new passion.<br/>\n<br/>\nThey have the materials they need to do the things they enjoy. We also look<br/>\nfor new and enticing things that we think they might like or that they ask<br/>\nfor. We find stuff at thrift stores, yard sales, craigslist, freecycle, the<br/>\nfree store, online, swaps with friends etc. Each of our family members have<br/>\na vision board. That has all the things (tangible and conceptual) we want to<br/>\nbring into our lives.<br/>\n<br/>\nI am not happy all the time. My kids are not happy every moment. But we live<br/>\na happy fun life. When we feel dissatisfied we do what needs to be done to<br/>\nchange it. Only you can decide if you are living a FUN and JOYFULL life. As<br/>\nsoon as you decide that you do, you will!<br/>\n<br/>\nFaith<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: making home more fun","postDate":"1259001038","msgId":42150,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlZWtjZSs4Yjc1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk1NTE1MS4zNzk4NC5xbUB3ZWIxODAzMTMubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":42145,"nextInTopic":42154,"prevInTime":42149,"nextInTime":42151,"topicId":42120,"numMessagesInTopic":0,"msgSnippet":"... ***************** But your dh is part of that issue, right? He s putting pressure on the kids to want school - the pressure of his approval. Not saying","messageBody":"<div id=\"ygrps-yiv-13157841\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Toby Rosenberg &lt;philipntoby@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Thank you for your comments. The &quot;issues&quot; I have are definitely more mine than my kids. One thought I have is that I I feel like I I&#39;ve failed because 2 of my children have chosen to go to school.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nBut your dh is part of that issue, right? He&#39;s putting pressure on the kids to &quot;want&quot; school - the pressure of his approval. Not saying that to get you mad at your dh, but its not a cut and dried situation.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I think, oh, other people are having way more fun so that&#39;s what I must be doing wrong.<br/>\n </span></blockquote>******************<br/>\n<br/>\nMaking home more &quot;fun&quot; than school is like saying to make it more fun than a trip to the dentist! Its more a matter of being engaged with kids, in ways and to the extent that they want, of providing opportunities rather than pushing them. <br/>\n<br/>\nWinter holidays are coming up, so look for ways to make home cozy and attractive to all your kids. Maybe not with the intent of &quot;winning them over&quot; since there are other forces at work than their own desires but in terms of making home a place where everyone can relax and enjoy themselves.   <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":294879737,"authorName":"Toby Rosenberg","from":"Toby Rosenberg &lt;philipntoby@...&gt;","profile":"philipntoby@sbcglobal.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] making home more fun","postDate":"1258911569","msgId":42145,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk1NTE1MS4zNzk4NC5xbUB3ZWIxODAzMTMubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGhlYm9zMitrcnYyQGVHcm91cHMuY29tPg=="},"prevInTopic":42142,"nextInTopic":42150,"prevInTime":42144,"nextInTime":42146,"topicId":42120,"numMessagesInTopic":0,"msgSnippet":"Thank you for your comments. The issues I have are definitely more mine than my kids. One thought I have is that I I feel like I I ve failed because 2 of my","messageBody":"<div id=\"ygrps-yiv-1069105797\">Thank you for your comments. The &quot;issues&quot; I have are definitely more mine than my kids. One thought I have is that I I feel like I I&#39;ve failed because 2 of my children have chosen to go to school. I think, oh, other people are having way more fun so that&#39;s what I must be doing wrong. I definitely need more patience. I like being very active and involved in alot of things but I don&#39;t have the patience to bring my family into it anymore when I hear negative comments from them. Also, I have a hard time having fun lately because I feel too responsible for taking care of my house. So these are definitely things I need to work on.<br/>\n <br/>\nI will look into some of the online gaming that I can share with my son. Although we own only one computer, maybe it will inspire me to get another one. <br/>\n <br/>\nOn a positive not, my son and I made Krabby Patties (from Sponge Bob) for dinner last week. Everyone love them!<br/>\n <br/>\nToby<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Sun, 11/22/09, plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:meredith@...\">meredith@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:meredith@...\">meredith@...</a>&gt;<br/>\nSubject: [unschoolingbasics] making home more fun<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Sunday, November 22, 2009, 11:28 AM<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n--- In unschoolingbasics@ yahoogroups. com, Toby Rosenberg &lt;philipntoby@ ....&gt; wrote:<br/>\n&gt;Besides my worry over his development, our life has been pretty peaceful and enjoyable lately but I wouldn&#39;t call it fun.<br/>\n************ ****<br/>\n<br/>\nSaying your life is enjoyable but not fun is an oxymoron - what do you mean by the words? Do you think &quot;fun&quot; needs to be a thrill a minute? That&#39;s not what *I* mean by &quot;fun&quot; personally, I mean something that engages at least some of my attention and brings me some joy. Knitting is fun for me, while climbing in the mountains is dreary. <br/>\n<br/>\nDoes your son enjoy what he&#39;s doing? You listed: video games, legos, bionicles, other dramatic play, reading graphic novels with mom, and periodic outings - that&#39;s quite a bit to be doing, really! Are you reading stories of others fantastic lives and wishing that your kid was more like that? Better to look at what brings light to your own child&#39;s eyes and seek to support that.<br/>\n<br/>\n&gt;&gt;He doesn&#39;t like to go to unschooling events even though he seems to enjoy parts of them (like making goop)<br/>\n************ ********* *<br/>\n<br/>\nMaybe you need to get some books like &quot;rainy day activities&quot; or &quot;science experiments you can do at home&quot; (not actual titles, but suggested themes) so you can make your own goop, or baking soda rockets, or whatever together. If he&#39;s not very social, then bring the parts of the social activities he likes into the home more. <br/>\n<br/>\nIf he likes legos and bionicles, look into expanding on that, too. Knex are compatible building toys, and lego and Knex both have sets with motors. <br/>\n<br/>\n&gt;&gt;I think the main problem is trying to find something we both would love to do. <br/>\n************ *****<br/>\n<br/>\nThat&#39;s an idea that can keep you stuck indefinitely. There isn&#39;t anything Ray does that I&#39;d love to do, but that hasn&#39;t stopped me from taking an interest in his loves and supporting those. Sometimes we don&#39;t have the luxury of kids who share some of our interests - we can see that as a bummer, or a grand opportunity to expand our own worlds a little. <br/>\n<br/>\n&gt;&gt;fun things to do for quiet video loving boys with mothers who have almost no patience for technology <br/>\n************ *******<br/>\n<br/>\nMaybe the problem is that you&#39;re looking for &quot;patience&quot;. Find ways to be caught up in his excitement rather than simply enduring the game. I&#39;m pretty inept at the video games Morgan plays, but I can sit and watch her play from time to time, enjoy her enthusiasm and involvement, ask her questions and make conversation about the game. I can watch enough of her play to compare video games and help her shop for new ones. I&#39;m still not terribly excited about the newest Spongebob or Teen Titans game for my own self, but I&#39;m pleased that Mo&#39;s excitied, and glad to chat with her about the highlights. <br/>\n<br/>\nHas your son played with any programming platforms? They are amazingly simple to use, and can allow kids to build short games or movies of their own. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"making home more fun","postDate":"1258907330","msgId":42142,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlYm9zMitrcnYyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI5OTgyMy45ODUzNS5xbUB3ZWIxODAzMDkubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":42139,"nextInTopic":42145,"prevInTime":42141,"nextInTime":42143,"topicId":42120,"numMessagesInTopic":0,"msgSnippet":"... **************** Saying your life is enjoyable but not fun is an oxymoron - what do you mean by the words? Do you think fun needs to be a thrill a","messageBody":"<div id=\"ygrps-yiv-849301460\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Toby Rosenberg &lt;philipntoby@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Besides my worry over his development, our life has been pretty peaceful and enjoyable lately but I wouldn&#39;t call it fun.<br/>\n </span></blockquote>****************<br/>\n<br/>\nSaying your life is enjoyable but not fun is an oxymoron - what do you mean by the words? Do you think &quot;fun&quot; needs to be a thrill a minute? That&#39;s not what *I* mean by &quot;fun&quot; personally, I mean something that engages at least some of my attention and brings me some joy. Knitting is fun for me, while climbing in the mountains is dreary. <br/>\n<br/>\nDoes your son enjoy what he&#39;s doing? You listed: video games, legos, bionicles, other dramatic play, reading graphic novels with mom, and periodic outings - that&#39;s quite a bit to be doing, really! Are you reading stories of others fantastic lives and wishing that your kid was more like that? Better to look at what brings light to your own child&#39;s eyes and seek to support that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;He doesn&#39;t like to go to unschooling events even though he seems to enjoy parts of them (like making goop)<br/>\n </span></blockquote>**********************<br/>\n<br/>\nMaybe you need to get some books like &quot;rainy day activities&quot; or &quot;science experiments you can do at home&quot; (not actual titles, but suggested themes) so you can make your own goop, or baking soda rockets, or whatever together. If he&#39;s not very social, then bring the parts of the social activities he likes into the home more. <br/>\n<br/>\nIf he likes legos and bionicles, look into expanding on that, too. Knex are compatible building toys, and lego and Knex both have sets with motors. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I think the main problem is trying to find something we both would love to do. <br/>\n </span></blockquote>*****************<br/>\n<br/>\nThat&#39;s an idea that can keep you stuck indefinitely. There isn&#39;t anything Ray does that I&#39;d love to do, but that hasn&#39;t stopped me from taking an interest in his loves and supporting those. Sometimes we don&#39;t have the luxury of kids who share some of our interests - we can see that as a bummer, or a grand opportunity to expand our own worlds a little. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;fun things to do for quiet video loving boys with mothers who have almost no patience for technology <br/>\n </span></blockquote>*******************<br/>\n<br/>\nMaybe the problem is that you&#39;re looking for &quot;patience&quot;. Find ways to be caught up in his excitement rather than simply enduring the game. I&#39;m pretty inept at the video games Morgan plays, but I can sit and watch her play from time to time, enjoy her enthusiasm and involvement, ask her questions and make conversation about the game. I can watch enough of her play to compare video games and help her shop for new ones. I&#39;m still not terribly excited about the newest Spongebob or Teen Titans game for my own self, but I&#39;m pleased that Mo&#39;s excitied, and glad to chat with her about the highlights. <br/>\n<br/>\nHas your son played with any programming platforms? They are amazingly simple to use, and can allow kids to build short games or movies of their own. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar@earthlink.net","from":"&lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: How to prepare for school?","postDate":"1258865626","msgId":42139,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPQ0VCSERDQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDI5OTgyMy45ODUzNS5xbUB3ZWIxODAzMDkubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":42137,"nextInTopic":42142,"prevInTime":42138,"nextInTime":42140,"topicId":42120,"numMessagesInTopic":0,"msgSnippet":"... I have an 8 year old video game loving daughter. She has gotten into some of the online role playing games like Gaia and Yoville. My husband and I both","messageBody":"<div id=\"ygrps-yiv-141795561\"><blockquote><span title=\"ireply\">&gt;&gt;&gt; Ok, I need fun things to do. I&#39;ve written before about my 8 year old son and video games. &lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I have an 8 year old video game loving daughter. She has gotten into some of the online role playing games like Gaia and Yoville. My husband and I both have accounts and we meet up with her online. It is really amazing because it has eliminated so many of my fears. In order to communicate in those games, she has to type. Her spelling has improved tremendously. Her vocabulary has expanded. Her math skills are increasing by the day because she is always figuring out ways to earn money on the games and how she wants to spend the money once she earns it. She is learning about geography. We were watching a gameshow the other night and they mentioned Finland and she said that one of her online friends is from Finland. <br/>\n<br/>\nIf any of the games are online, see if you can create a character and meet your son in cyberspace. My husband and I had a meeting with our daughter online and she staged a wedding for us. We have her on our buddy lists so that if she doesn&#39;t answer when we call her or try to talk to us, we go online and talk to her there. It give a whole new meaning to meeting her where she is. LOL<br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":294879737,"authorName":"Toby Rosenberg","from":"Toby Rosenberg &lt;philipntoby@...&gt;","profile":"philipntoby@sbcglobal.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: How to prepare for school?","postDate":"1258850542","msgId":42137,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5OTgyMy45ODUzNS5xbUB3ZWIxODAzMDkubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PEI3MkM4NzBDMTg3MDRFRkI4MUFEOUJCMUFFMkU0Q0Q4QFJvY2tldFNhdWNlMj4="},"prevInTopic":42132,"nextInTopic":42139,"prevInTime":42136,"nextInTime":42138,"topicId":42120,"numMessagesInTopic":0,"msgSnippet":"Our focus is unschooling and ways we can make home fun and interesting. It *should* be more fun than school! It should be so fun school doesn t look even a","messageBody":"<div id=\"ygrps-yiv-2040667521\">&quot;Our focus is unschooling and ways we can make home fun and interesting. It *should* be more fun than school! It should be so fun school doesn&#39;t look even a little bit better. &quot;<br/>\n<br/>\n<br/>\nOk, I need fun things to do. I&#39;ve written before about my 8 year old son and video games. We&#39;ve started doing some more of other stuff, but it always seems like I have to push him (gently) to do something. He doesn&#39;t like to go to unschooling events even though he seems to enjoy parts of them (like making goop). We&#39;ve gotten into reading graphic novels together (I read them to him). I think the main problem is trying to find something we both would love to do. In the meantime, I keep busy with things I like to do (starting my own personal catering business), while he plays video games and watches shows. Sometimes he builds with legos and plays make believe stuff with his bionicles or &quot;guys&quot;. Besides my worry over his development, our life has been pretty peaceful and enjoyable lately but I wouldn&#39;t call it fun.<br/>\n <br/>\nBy the way, my 5 year old is in school partially because he was curious about it and partially because my husband wanted him to go. He says he likes it because he&#39;s really learning stuff there. (Those are his words) He doesn&#39;t like going to bed early or waking up early. (He doesn&#39;t want to miss days because his Dad  will be upset.) My 5 year old is extremely active and social. One of the days that he missed school he had a great time at one of the unschooling events. However, when my older son makes negative comments about the events, my younger son is influenced by him. <br/>\n <br/>\nWhen they are both home, there is more conflict because one child wants to go do stuff and the other wants to stay home quietly. So, sometimes I think the arrangement we have is what works for my family even though in my heart I wish they were all home.<br/>\n <br/>\nAny feedback is greatly appreciated, especially fun things to do for quiet video loving boys with mothers who have almost no patience for technology (hence the reason for my rare postings)<br/>\n <br/>\nThanks<br/>\n <br/>\nToby<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Fri, 11/20/09, DJ250 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dj250@...\">dj250@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: DJ250 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dj250@...\">dj250@...</a>&gt;<br/>\nSubject: Re: [unschoolingbasics] Re: How to prepare for school?<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Friday, November 20, 2009, 12:48 Ps<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\nOh, for cryin&#39; out loud! Home is fun--she said so herself (my dd)!! This is just curiosity on her part, an exploration of something her friend said. She plays with the kids in the neighborhood and would like to experience a day like their&#39;s--out of curiosity! We encourage our kids to explore, why shouldn&#39;t they have curiosity about that part of the world? She has since dropped the idea, not out of discouragement but out of sheer understanding that she DOES like and appreciate the way things are.<br/>\n<br/>\nThanks for advice,<br/>\n~Melissa <br/>\n<br/>\n----- Original Message ----- <br/>\nFrom: Deb Lewis <br/>\nTo: unschoolingbasics@ yahoogroups. com <br/>\nSent: Friday, November 20, 2009 12:34 PM<br/>\nSubject: [unschoolingbasics] Re: How to prepare for school?<br/>\n<br/>\nWe&#39;re not a &quot;Help your kids go to school&quot; list. &lt;g&gt; <br/>\n<br/>\nYou could mention to your daughter that what seems like fun in school is relative to the other stuff that is not at all fun. Most of the day is not fun. When her friend is visiting ask specifically what is fun about school.<br/>\n<br/>\nIf the thing that sounds fun to your daughter is to be around other kids, find ways for her to do that. School is not the best place to have fun with other kids. School is where you usually get in trouble for having too much fun. If it&#39;s some specific thing in an art class or some playground game those things can be done at home or in the park, on a picnic, in a boat, up a tree, in a pool....&lt;g&gt; <br/>\n<br/>\nOur focus is unschooling and ways we can make home fun and interesting. It *should* be more fun than school! It should be so fun school doesn&#39;t look even a little bit better. <br/>\n<br/>\nThere are lots of reasons older kids might choose to take a class or two but a ten year old looking for &quot;fun&quot; can find A LOT more fun outside of school. &lt;g&gt; If you need ideas for fun things to do, let us know. If you fill up every day with fun and different things she might not be tempted by school at all. <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n------------ --------- --------- --------- --------- --------- -<br/>\n<br/>\nNo virus found in this incoming message.<br/>\nChecked by AVG - www.avg.com <br/>\nVersion: 9.0.707 / Virus Database: 270.14.74/2515 - Release Date: 11/20/09 03:02:00<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: How to prepare for school?","postDate":"1258830421","msgId":42132,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY2RkVBMEFFRUVBNDQzQTZBNzUwMUJBMjk4ODI4OTY3QGJpZ3N1cnByaXNlPg=="},"prevInTopic":42128,"nextInTopic":42137,"prevInTime":42131,"nextInTime":42133,"topicId":42120,"numMessagesInTopic":0,"msgSnippet":"***We are a support your kids where they are list.*** Unschoolingbasics is different than some unschooling lists because it s focus is for people new to the","messageBody":"<div id=\"ygrps-yiv-599470447\">***We are a support your kids where they are list.***<br/>\n<br/>\nUnschoolingbasics is different than some unschooling lists because it&#39;s focus is for people new to the idea of unschooling.   If we help moms who come along wondering how to prepare her kid for school when the purpose of the list is to help moms learn about the things that will make unschooling successful that&#39;s not the best use of this list.    We risk confounding our message and our focus if information we give here sounds like schooling and unschooling are the same. <br/>\n<br/>\nSome new unschooling parents don&#39;t know how learning can happen naturally.  They don&#39;t know how a kid can learn to read if no one teaches him.   A mom who wants to understand natural learning won&#39;t get there as soon if this list is used to help people prepare their kids for school.  <br/>\n<br/>\nThe op got help and links for her purpose.  The op posted to a list of twenty five hundred people most of whom are not here to find out how to prepare a child for school.   Every time someone talks about a child wanting school on an unschooling list it&#39;s important.   Probably more so on a list for new unschoolers. <br/>\n<br/>\n***Our focus is unschooling and ways we can make home fun and interesting. It<br/>\n*should* be more fun than school! ***<br/>\n<br/>\n***I am uncomfortable with *should*.*** <br/>\n<br/>\nI don&#39;t understand.  Are you uncomfortable with the idea that home should be more fun than school?   For lots of kids it&#39;s not.  For lot&#39;s of kids school is much better than home.   Learning happens best when humans are safe, happy, healthy and engaged.  That means, for people who have deliberately exempted their children from compulsory schooling, home needs to be better than school.   <br/>\n  <br/>\n***I agree that home should be fun but that assumes that children only want to<br/>\ntry school because home it lacking.***<br/>\n<br/>\nFor a lot of homeschooled kids the reason school looks better is because home *is* lacking.  That&#39;s reality.   If it is not true in the op&#39;s case or in your case that&#39;s great!  You don&#39;t have to cram your foot into a shoe that doesn&#39;t fit you.&lt;g&gt;  But we are responsible *on this list* to help list members understand unschooling and the things that can help it or hurt it.   Making home a good and fun place to be is a very big part of unschooling. <br/>\n<br/>\n***IN fact this attitude kept<br/>\nme from supporting my daughter&#39;s desire for over a year. Not cool!****<br/>\n<br/>\nThat&#39;s why understanding how learning happens is so important.   Someone else&#39;s attitude didn&#39;t keep you from supporting your daughter.   When we understand how learning happens how it can be nurtured and how it can be hurt then we can help our kids no matter what&#39;s written on a list or in a book.   <br/>\n<br/>\n***I think that first and<br/>\nforemost we want to create an environment that nurtures and supports.***<br/>\n<br/>\nA nurturing and supporting environment is wonderful and lots of parents who give their kids no choice about school consider themselves nurturing and supportive.   Their children consider them nurturing and supportive.  So their must be more to unschooling than being nurturing and supportive.   We need to be actively providing for the intellectual stimulation of our children just like we provide food for their hungry bodies.  Being happy at home, loving them and caring for them doesn&#39;t mean we can ignore our other responsibility to inspire them, excite them, engage them.   We&#39;ve read lots of times on this list how some mom sat back and waited for her kids to &quot;learn something&quot;.   I don&#39;t think reminders that parents have more of a responsibility than to provide food and shelter and love are unwarranted. <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":231930081,"authorName":"DJ250","from":"&quot;DJ250&quot; &lt;dj250@...&gt;","profile":"wibberbie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Re: How to prepare for school?","postDate":"1258812774","msgId":42128,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI3RjBCMzI2OEU2RTQ2QTlCN0FDMjQ4OTEwQjhDN0I1QFJvY2tldFNhdWNlMj4=","inReplyToHeader":"PGNjNjEyMGExMDkxMTIxMDM1Mm81MjFhMmYwNGk3NDFjMDNiMWI0YzNhODhmQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDA2QzQyNzI4QUQ3NjQ5Rjg4ODU1RDQxN0Q5RDdEMEI0QGJpZ3N1cnByaXNlPiA8Y2M2MTIwYTEwOTExMjEwMzUybzUyMWEyZjA0aTc0MWMwM2IxYjRjM2E4OGZAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":42127,"nextInTopic":42132,"prevInTime":42127,"nextInTime":42129,"topicId":42120,"numMessagesInTopic":0,"msgSnippet":"Well-said, Faith!  Thanks! ~Melissa :) ... From: Faith Void To: unschoolingbasics@yahoogroups.com Sent: Saturday, November 21, 2009 6:52 AM Subject: Re:","messageBody":"<div id=\"ygrps-yiv-609803972\">Well-said, Faith!  Thanks!<br/>\n<br/>\n~Melissa :)<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Faith Void <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Saturday, November 21, 2009 6:52 AM<br/>\n  Subject: Re: [unschoolingbasics] Re: How to prepare for school?<br/>\n<br/>\n<br/>\n    <br/>\n  We&#39;re not a &quot;Help your kids go to school&quot; list. &lt;g&gt;<br/>\n<br/>\n  ***We are a support your kids where they are list.<br/>\n  -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-=<br/>\n<br/>\n  You could mention to your daughter that what seems like fun in school is<br/>\n  relative to the other stuff that is not at all fun. Most of the day is not<br/>\n  fun. When her friend is visiting ask specifically what is fun about school.<br/>\n<br/>\n  If the thing that sounds fun to your daughter is to be around other kids,<br/>\n  find ways for her to do that. School is not the best place to have fun with<br/>\n  other kids. School is where you usually get in trouble for having too much<br/>\n  fun. If it&#39;s some specific thing in an art class or some playground game<br/>\n  those things can be done at home or in the park, on a picnic, in a boat, up<br/>\n  a tree, in a pool....&lt;g&gt;<br/>\n<br/>\n  *** I *know* that I did all these things for years. We watched shows about<br/>\n  school and read books about school. We discussed all these things. School<br/>\n  can still be intriguing to some children.<br/>\n  -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-=<br/>\n<br/>\n  Our focus is unschooling and ways we can make home fun and interesting. It<br/>\n  *should* be more fun than school! It should be so fun school doesn&#39;t look<br/>\n  even a little bit better.<br/>\n<br/>\n  ***I am uncomfortable with *should*. If my child wants to go to Japan then<br/>\n  all the making home like Japan ideas I have may help a little but it isn&#39;t<br/>\n  going to Japan. Many kids might be satisfied with playing &quot;Japan&quot;. It will<br/>\n  be fun for a while. It may satisfy all their needs. Some kids may still need<br/>\n  to go to &quot;Japan&quot;.<br/>\n<br/>\n  I agree that home should be fun but that assumes that children only want to<br/>\n  try school because home it lacking. Or not fun. IN fact this attitude kept<br/>\n  me from supporting my daughter&#39;s desire for over a year. Not cool!<br/>\n  -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-=<br/>\n<br/>\n  I think that unschooling is the best way for us to have a great relationship<br/>\n  with our children and to live a life full of joy. I think that first and<br/>\n  foremost we want to create an environment that nurtures and supports.<br/>\n<br/>\n  My oldest has just started school, three weeks ago. We are still<br/>\n  unschooling. She is there for a different reason than the other kids. She&#39;s<br/>\n  there to get the experience of school, to know what it&#39;s like. She is an<br/>\n  explorer and a scientist. She is a traveler. This is a great adventure to<br/>\n  her, and exotic location. Once I gave up the idea that it was my goal to<br/>\n  keep her out of school or I had failed as an unschooling parent I was free<br/>\n  to met her needs. She loves school, the challenges, the kids, the horrible<br/>\n  teachers, the crappy food, etc. She is joyfull to go each morning to this<br/>\n  new place and experience all it has to offer. I didn&#39;t fail to make home<br/>\n  &quot;fun&quot;. I didn&#39;t fail to &quot;provide her with a great life&quot;. She wasn&#39;t trying<br/>\n  to escape me or our family.<br/>\n<br/>\n  I learned from Kelly Lovejoy to embrace each place your kid is at. If they<br/>\n  are into magic, then support them like they will always love magic like they<br/>\n  ARE a magician. I think that goes with everything. When I was closed to<br/>\n  school, I just caused a riff in my relationship with my child. *I* made the<br/>\n  world smaller for her. That wasn&#39;t my goal. I want to make the world as<br/>\n  accessible as possible for all my children.<br/>\n<br/>\n  Faith<br/>\n<br/>\n  -- <br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\n  www.bearthmama.com<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\n<br/>\n  No virus found in this incoming message.<br/>\n  Checked by AVG - www.avg.com <br/>\n  Version: 9.0.707 / Virus Database: 270.14.74/2515 - Release Date: 11/20/09 03:02:00<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Re: How to prepare for school?","postDate":"1258804328","msgId":42127,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkxMTIxMDM1Mm81MjFhMmYwNGk3NDFjMDNiMWI0YzNhODhmQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDA2QzQyNzI4QUQ3NjQ5Rjg4ODU1RDQxN0Q5RDdEMEI0QGJpZ3N1cnByaXNlPg==","referencesHeader":"PDA2QzQyNzI4QUQ3NjQ5Rjg4ODU1RDQxN0Q5RDdEMEI0QGJpZ3N1cnByaXNlPg=="},"prevInTopic":42123,"nextInTopic":42128,"prevInTime":42126,"nextInTime":42128,"topicId":42120,"numMessagesInTopic":0,"msgSnippet":"We re not a Help your kids go to school list.  ***We are a support your kids where they are list. ","messageBody":"<div id=\"ygrps-yiv-1148417870\">We&#39;re not a &quot;Help your kids go to school&quot; list. &lt;g&gt;<br/>\n<br/>\n***We are a support your kids where they are list.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-=<br/>\n<br/>\nYou could mention to your daughter that what seems like fun in school is<br/>\nrelative to the other stuff that is not at all fun. Most of the day is not<br/>\nfun. When her friend is visiting ask specifically what is fun about school.<br/>\n<br/>\nIf the thing that sounds fun to your daughter is to be around other kids,<br/>\nfind ways for her to do that. School is not the best place to have fun with<br/>\nother kids. School is where you usually get in trouble for having too much<br/>\nfun. If it&#39;s some specific thing in an art class or some playground game<br/>\nthose things can be done at home or in the park, on a picnic, in a boat, up<br/>\na tree, in a pool....&lt;g&gt;<br/>\n<br/>\n*** I *know* that I did all these things for years. We watched shows about<br/>\nschool and read books about school. We discussed all these things. School<br/>\ncan still be intriguing to some children.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-=<br/>\n<br/>\nOur focus is unschooling and ways we can make home fun and interesting. It<br/>\n*should* be more fun than school! It should be so fun school doesn&#39;t look<br/>\neven a little bit better.<br/>\n<br/>\n***I am uncomfortable with *should*. If my child wants to go to Japan then<br/>\nall the making home like Japan ideas I have may help a little but it isn&#39;t<br/>\ngoing to Japan. Many kids might be satisfied with playing &quot;Japan&quot;. It will<br/>\nbe fun for a while. It may satisfy all their needs. Some kids may still need<br/>\nto go to &quot;Japan&quot;.<br/>\n<br/>\nI agree that home should be fun but that assumes that children only want to<br/>\ntry school because home it lacking. Or not fun. IN fact this attitude kept<br/>\nme from supporting my daughter&#39;s desire for over a year. Not cool!<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=-=<br/>\n<br/>\nI think that unschooling is the best way for us to have a great relationship<br/>\nwith our children and to live a life full of joy. I think that first and<br/>\nforemost we want to create an environment that nurtures and supports.<br/>\n<br/>\nMy oldest has just started school, three weeks ago. We are still<br/>\nunschooling. She is there for a different reason than the other kids. She&#39;s<br/>\nthere to get the experience of school, to know what it&#39;s like. She is an<br/>\nexplorer and a scientist. She is a traveler. This is a great adventure to<br/>\nher, and exotic location. Once I gave up the idea that it was my goal to<br/>\nkeep her out of school or I had failed as an unschooling parent I was free<br/>\nto met her needs. She loves school, the challenges, the kids, the horrible<br/>\nteachers, the crappy food, etc. She is joyfull to go each morning to this<br/>\nnew place and experience all it has to offer. I didn&#39;t fail to make home<br/>\n&quot;fun&quot;. I didn&#39;t fail to &quot;provide her with a great life&quot;. She wasn&#39;t trying<br/>\nto escape me or our family.<br/>\n<br/>\nI learned from Kelly Lovejoy to embrace each place your kid is at. If they<br/>\nare into magic, then support them like they will always love magic like they<br/>\nARE a magician. I think that goes with everything. When I was closed to<br/>\nschool, I just caused a riff in my relationship with my child. *I* made the<br/>\nworld smaller for her. That wasn&#39;t my goal. I want to make the world as<br/>\naccessible as possible for all my children.<br/>\n<br/>\nFaith<br/>\n<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: How to prepare for school?","postDate":"1258746999","msgId":42123,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERBOTNDQTA4M0Y1ODQ3NUE4NkY0Rjg0MDAzNzkyMzk5QGJpZ3N1cnByaXNlPg=="},"prevInTopic":42122,"nextInTopic":42127,"prevInTime":42122,"nextInTime":42124,"topicId":42120,"numMessagesInTopic":0,"msgSnippet":"***Oh, for cryin out loud! Home is fun--*** I wasn t accusing you of anything. ***She plays with the kids in the neighborhood and would like to experience a","messageBody":"<div id=\"ygrps-yiv-113113067\">***Oh, for cryin&#39; out loud! Home is fun--***<br/>\n<br/>\nI wasn&#39;t accusing you of anything.  <br/>\n<br/>\n***She plays with the kids in the neighborhood and would like to experience a day like<br/>\ntheir&#39;s--out of curiosity! ***<br/>\n<br/>\nThen maybe she can go to school for a day with her friend, some schools will let kids do that.  One of Dylan&#39;s friends wanted to take him to school for show and tell.&lt;g&gt;  (He&#39;s really not *that* odd&lt;g&gt;) We know a young man who went for a day with one his friends.  I think it was the friends sophomore year in high school.  He thought it a terrible waste of time... and dehumanizing, all the herding around by bells and such.  <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: How to prepare for school?","postDate":"1258744842","msgId":42122,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVDMDRCMEI5OTMxRDQ2MDJBMzA2REY4RENGNEEyMDZGQGJpZ3N1cnByaXNlPg=="},"prevInTopic":42121,"nextInTopic":42123,"prevInTime":42121,"nextInTime":42123,"topicId":42120,"numMessagesInTopic":0,"msgSnippet":"About preparing a child for school:  Some kids who look at what can seem like a daunting list of things they re supposed to know in order to be in the X","messageBody":"<div id=\"ygrps-yiv-1641554512\">About preparing a child for school:  Some kids who look at what can seem like a daunting list of things they&#39;re &quot;supposed&quot; to know in order to be in the X grade, might end up feeling badly about themselves for not knowing it.   Some kids wouldn&#39;t care and kids who&#39;ve always been unschooled might even think a list like that funny but some kids might get concerned.     I&#39;d be careful.   My kid could look at that list and laugh it off, knowing that lots of adults with good jobs and happy lives might not be able to claim knowledge of some of that grade school stuff but he&#39;s never been one to think that what he knows and when he knew it is the  business of publishers of scholastic materials.&lt;g&gt;   <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":231930081,"authorName":"DJ250","from":"&quot;DJ250&quot; &lt;dj250@...&gt;","profile":"wibberbie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: How to prepare for school?","postDate":"1258739332","msgId":42121,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI3MkM4NzBDMTg3MDRFRkI4MUFEOUJCMUFFMkU0Q0Q4QFJvY2tldFNhdWNlMj4=","inReplyToHeader":"PDA2QzQyNzI4QUQ3NjQ5Rjg4ODU1RDQxN0Q5RDdEMEI0QGJpZ3N1cnByaXNlPg==","referencesHeader":"PDA2QzQyNzI4QUQ3NjQ5Rjg4ODU1RDQxN0Q5RDdEMEI0QGJpZ3N1cnByaXNlPg=="},"prevInTopic":42120,"nextInTopic":42122,"prevInTime":42120,"nextInTime":42122,"topicId":42120,"numMessagesInTopic":0,"msgSnippet":"Oh, for cryin out loud!  Home is fun--she said so herself (my dd)!!  This is just curiosity on her part, an exploration of something her friend said.  She","messageBody":"<div id=\"ygrps-yiv-878037830\">Oh, for cryin&#39; out loud!  Home is fun--she said so herself (my dd)!!  This is just curiosity on her part, an exploration of something her friend said.  She plays with the kids in the neighborhood and would like to experience a day like their&#39;s--out of curiosity!  We encourage our kids to explore, why shouldn&#39;t they have curiosity about that part of the world?  She has since dropped the idea, not out of discouragement but out of sheer understanding that she DOES like and appreciate the way things are.<br/>\n<br/>\nThanks for advice,<br/>\n~Melissa <br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Deb Lewis <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Friday, November 20, 2009 12:34 PM<br/>\n  Subject: [unschoolingbasics] Re: How to prepare for school?<br/>\n<br/>\n<br/>\n    <br/>\n  We&#39;re not a &quot;Help your kids go to school&quot; list. &lt;g&gt; <br/>\n<br/>\n  You could mention to your daughter that what seems like fun in school is relative to the other stuff that is not at all fun. Most of the day is not fun. When her friend is visiting ask specifically what is fun about school.<br/>\n<br/>\n  If the thing that sounds fun to your daughter is to be around other kids, find ways for her to do that. School is not the best place to have fun with other kids. School is where you usually get in trouble for having too much fun. If it&#39;s some specific thing in an art class or some playground game those things can be done at home or in the park, on a picnic, in a boat, up a tree, in a pool....&lt;g&gt; <br/>\n<br/>\n  Our focus is unschooling and ways we can make home fun and interesting. It *should* be more fun than school! It should be so fun school doesn&#39;t look even a little bit better. <br/>\n<br/>\n  There are lots of reasons older kids might choose to take a class or two but a ten year old looking for &quot;fun&quot; can find A LOT more fun outside of school. &lt;g&gt; If you need ideas for fun things to do, let us know. If you fill up every day with fun and different things she might not be tempted by school at all. <br/>\n<br/>\n  Deb Lewis<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\n<br/>\n  No virus found in this incoming message.<br/>\n  Checked by AVG - www.avg.com <br/>\n  Version: 9.0.707 / Virus Database: 270.14.74/2515 - Release Date: 11/20/09 03:02:00<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: How to prepare for school?","postDate":"1258738440","msgId":42120,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2QzQyNzI4QUQ3NjQ5Rjg4ODU1RDQxN0Q5RDdEMEI0QGJpZ3N1cnByaXNlPg=="},"prevInTopic":0,"nextInTopic":42121,"prevInTime":42119,"nextInTime":42121,"topicId":42120,"numMessagesInTopic":0,"msgSnippet":"We re not a Help your kids go to school list.  You could mention to your daughter that what seems like fun in school is relative to the other stuff that","messageBody":"<div id=\"ygrps-yiv-1267827468\">We&#39;re not a &quot;Help your kids go to school&quot; list. &lt;g&gt; <br/>\n<br/>\nYou could mention to your daughter that what seems like fun in school is relative to the other stuff that is not at all fun.   Most of the day is not fun.  When her friend is visiting ask specifically what is fun about school.<br/>\n<br/>\nIf the thing that sounds fun to your daughter is to be around other kids, find ways for her to do that.  School is not the best place to have fun with other kids.  School is where you usually get in trouble for having too much fun.    If it&#39;s some specific thing in an art class or some playground game those things can be done at home or in the park, on a picnic, in a boat, up a tree, in a pool....&lt;g&gt;  <br/>\n<br/>\nOur focus is unschooling and ways we can make home fun and interesting.  It *should* be more fun than school!  It should be so fun school doesn&#39;t look even a little bit better.  <br/>\n<br/>\nThere are lots of reasons older kids might choose to take a class or two but a ten year old looking for &quot;fun&quot; can find A LOT more fun outside of school. &lt;g&gt;   If you need ideas for fun things to do, let us know. If you fill up every day with fun and different things she might not be tempted by school at all.   <br/>\n<br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":42157,"nextTopicId":42268}}