{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":17,"messages":[{"userId":205483142,"authorName":"Melissa Gray","from":"Melissa Gray &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] How to screw up unschooling","postDate":"1214415552","msgId":34068,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ2MDM2QkVGLUMwMDItNDg0Ni1BNUMwLURDNkIwQjJDQUVFRUBjb3gubmV0Pg==","inReplyToHeader":"PGczcXBhOStxczFlQGVHcm91cHMuY29tPg==","referencesHeader":"PGczcXBhOStxczFlQGVHcm91cHMuY29tPg=="},"prevInTopic":34061,"nextInTopic":0,"prevInTime":34067,"nextInTime":34069,"topicId":33982,"numMessagesInTopic":0,"msgSnippet":"... The number one thing *I* did to respect my own personal boundaries was to reassess where they were. A childhood of mainstream parenting (bordering on","messageBody":"<div id=\"ygrps-yiv-1914773029\">On Jun 24, 2008, at 7:28 AM, Ren Allen wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How do you respect the individual AND other<br/>\n&gt; people&#39;s (including your own) personal boundaries?<br/>\n<br/>\n </span></blockquote>The number one thing *I* did to respect my own personal boundaries  <br/>\nwas to reassess where they were. A childhood of mainstream parenting  <br/>\n(bordering on neglect and abuse) left me with really unrealistic  <br/>\nboundaries. I definitely believed that adults had the right of way,  <br/>\nregardless of the topic. Once I saw that my boundaries, my  <br/>\nexpectations were unrealistic, I could move them (slowly and  <br/>\npainfully, sometimes) Sometimes that goes for other people&#39;s  <br/>\nboundaries as well, if I need to advocate for my child, and help  <br/>\nsomeone realize that their boundaries are arbitrary or unfair.<br/>\n<br/>\nFor an individual child whose choices are not okay with someone else,  <br/>\nit may mean respecting them enough to realize that they just can&#39;t  <br/>\nhandle a situation yet. A child who lashes out at the park needs a  <br/>\nLOT more help at the park than a child who can deal, so I respect  <br/>\nthat by either staying with them, or visiting the park when it&#39;s not  <br/>\na busy, or at night, or finding another park that is not as full.  <br/>\nSeeing an individuals needs helps to address them. I have a child  <br/>\nwho&#39;s really sensitive to what people say. Seemingly innocuous  <br/>\nstatements hurt her so deeply. So *if* she did strike out and hurt  <br/>\nsomeone I would respect HER enough not to be embarrassed, and enough  <br/>\nthat I wouldn&#39;t change my parenting to placate others. I would step  <br/>\nin and advocate for my child, saying to someone that I&#39;m sorry they  <br/>\ngot hurt. I know my kids well enough to know she would not mind if I  <br/>\nsaid &quot;E did this because of that, and she really didn&#39;t mean to hurt  <br/>\nyou, she was upset&quot; (which some kids would not like)<br/>\n<br/>\nSimilarly, since discussion just touched on painting walls, I&#39;ll talk  <br/>\nabout cleaning house. I love a spotless house. I love totally clean  <br/>\nwalls and windows and floors. Again, not feasible in a house with  <br/>\nchildren, so I had to reassess my boundaries. Were they realistic?  <br/>\nNo. Were they fair to anyone else in the house? NO, especially if I  <br/>\nwould tirade about the mess to them! My husband loves white walls.  <br/>\nEvery wall in our house would be white if he wanted. But as part of  <br/>\ncompromise, he had to move those boundaries of what was okay with  <br/>\nhim, to include bright yellow, purple, red, pink, or blue walls.  <br/>\nEspecially in the kids rooms. Breanna wrote in crayon on every single  <br/>\nwall (wished I had taken a picture before we repainted her room, it  <br/>\nwas awesome) My boundary was to keep the entry way with white walls.  <br/>\nThe kids were more than happy with that, because they KNEW that they  <br/>\nhad lots of choices. It wasn&#39;t color the walls or not. Anyway, I&#39;m  <br/>\noperating on lack of sleep, so I know not if this make sense.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n </span></blockquote>I&#39;m not going to touch the rest of them right now. Zane is out of  <br/>\ntown, and I&#39;m tired. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] How to screw up unschooling","postDate":"1214408810","msgId":34061,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2NEQzMjQ5LUIwODItNEU5NS1CQ0VFLTUwQ0MxMjU3NjQwQ0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDgxMWYwMWM4ZDY2OSQzMDEzOTkwMCRjYTAxYThjMEBDb3lvdGU+","referencesHeader":"PGczcXBhOStxczFlQGVHcm91cHMuY29tPiA8NDE5NDAxYzhkNWZiJGEwMGEzNDMwJGNhMDFhOGMwQENveW90ZT4gPDhDQUE0Nzg2NjlBMEUxRC0xMjU4LTI2MUNAd2VibWFpbC1tZDE5LnN5c29wcy5hb2wuY29tPiA8ODExZjAxYzhkNjY5JDMwMTM5OTAwJGNhMDFhOGMwQENveW90ZT4="},"prevInTopic":34044,"nextInTopic":34068,"prevInTime":34060,"nextInTime":34062,"topicId":33982,"numMessagesInTopic":0,"msgSnippet":"... Not even close, which is why understanding history is important. For one, growing up during the cold war when the US had nuclear missiles pointed at the","messageBody":"<div id=\"ygrps-yiv-242318964\">On Jun 24, 2008, at 10:14 PM, Coyote wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This is the first generation that can not be gauranteed that they  <br/>\n&gt; will &#39;do better&#39;<br/>\n<br/>\n </span></blockquote>Not even close, which is why understanding history is important. For  <br/>\none, growing up during the cold war when the US had nuclear missiles  <br/>\npointed at the USSR and vice versa, and a finger hovered over the  <br/>\nbuttons nuclear annihilation felt like the safer bet than peace. (In  <br/>\ngrade school, in addition to fire drills, we had air raid drills  <br/>\nwhere we&#39;d line up in the halls facing the wall. I suspect it would  <br/>\nhave saved us from nothing.) Those are just quaint words of ancient  <br/>\ntimes to anyone born after the mid 1980s. It was my reality.<br/>\n<br/>\nAnd those who spent those years focusing on the doom of the future?  <br/>\nWhat did they gain from years of pessimism? Time spent being  <br/>\ndepressed, basically.<br/>\n<br/>\nI don&#39;t think people should bury their heads in the sand (unless they  <br/>\nwant to!) but I think that *if* being informed doesn&#39;t help someone  <br/>\nfeel empowered to make changes, *if* being informed causes them to  <br/>\nfeel the world can&#39;t be saved, they owe it to their child to set  <br/>\naside being informed until the children are grown and out of the house.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The earth is warming, there are food riots in parts of the world  <br/>\n&gt; that will eventually happen here. Over population is a major  <br/>\n&gt; problem. The floods in the midwest will cause food prices to rise  <br/>\n&gt; sharply. Oil will continue to be a major addiction of ours and like  <br/>\n&gt; all addictions, if we don&#39;t deal with it, it will deal with us. We  <br/>\n&gt; have reached peak oil. Period. Our nation is horribly in debt and  <br/>\n&gt; our children will pay for that. Think of how the world was 50 years  <br/>\n&gt; ago. Picture it in 50 years.<br/>\n&gt;<br/>\n&gt; I think of my daughter at 60...45 years from now. According to many  <br/>\n&gt; scientists, much of our Rhode Island seacoast will be gone, under  <br/>\n&gt; water.<br/>\n<br/>\n </span></blockquote>*If* there&#39;s nothing we can do about it, dwelling on it will only  <br/>\nmake the period from now until then unpleasant.<br/>\n<br/>\nThere&#39;s nothing we can do about death either but it doesn&#39;t make  <br/>\nsense to spend life dwelling on the inevitable end. It makes more  <br/>\nsense to make the best life one can possibly make since we only get  <br/>\none chance.<br/>\n<br/>\nIf your daughter has no future, then make the present the best  <br/>\npresent you can make for her. It will fill her up with happy memories  <br/>\nthat will sustain her way longer than living through a childhood of  <br/>\ncertainty that she has no future.<br/>\n<br/>\n*If* there&#39;s something you feel empowered to do, then do it. If  <br/>\nyou&#39;re already doing something, invite people on the list to join.<br/>\n<br/>\nDwelling on what someone *feels* they can&#39;t change doesn&#39;t help  <br/>\nanyone and only makes them and those around them miserable. The  <br/>\nbeliefs of negative people are pretty much self fulfilling! If  <br/>\nsomeone believes nothing can be done, they won&#39;t do anything. And  <br/>\ninstead of finding a way to enjoy the time before the change, they  <br/>\nspend the time miserable.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I&#39;m not pessimistic. I&#39;m informed and realistic.<br/>\n<br/>\n </span></blockquote>And the people who thought we were all going to die in nuclear  <br/>\nannihilation felt the same way. But spreading around those visions of  <br/>\na dark future just depressed people. They could have used the energy  <br/>\nspent spreading a gloomy future and bearing the weight on their  <br/>\nshoulders into doing something positive.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How to screw up unschooling","postDate":"1214401097","msgId":34044,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGczdGhvOStncGF2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGczdGFhYyttZnEyQGVHcm91cHMuY29tPg=="},"prevInTopic":34043,"nextInTopic":34061,"prevInTime":34043,"nextInTime":34045,"topicId":33982,"numMessagesInTopic":0,"msgSnippet":"~~ The earth is warming, there are food riots in parts of the world that will eventually happen here. Over population is a major problem. The floods in the","messageBody":"<div id=\"ygrps-yiv-1452504461\">~~&gt;&gt;&gt;&gt;The earth is warming, there are food riots in parts of the<br/>\nworld that will eventually happen here. Over population is a major<br/>\nproblem. The floods in the midwest will cause food prices to rise<br/>\nsharply. Oil will continue to be a major addiction of ours and like<br/>\nall addictions, if we don&#39;t deal with it, it will deal with us. We<br/>\nhave reached peak oil. Period. Our nation is horribly in debt and our<br/>\nchildren will pay for that. Think of how the world was 50 years ago.<br/>\nPicture it in 50 years.~~<br/>\n<br/>\n<br/>\nI actually agree with all of the above. I believe the same things will<br/>\nhappen....faster than most believe possible. Yet I don&#39;t choose to<br/>\ndrop my doom and gloom all over the place and focus on what is<br/>\nprobably an inevitable blip in history. I like to think of myself as a<br/>\ncynical optimist.:)<br/>\n<br/>\nThose ideas and principles I hold, do not overshadow the choices I<br/>\nmake with my family.<br/>\n<br/>\nAs to the vegetarian issue that was brought up:<br/>\n<br/>\n~Just last week, I cooked a *steak* for Seth, because he asked for<br/>\none. ewww. Evan was grossed out by it, even though he&#39;ll eat burgers.<br/>\nSeth didn&#39;t see my &quot;ewww&quot; face as I got it out and cooked it - what he<br/>\nsaw was me, listening to him and taking his needs and wants seriously.~~<br/>\n<br/>\nI think Caren nailed the entire point right here. Her child&#39;s needs<br/>\nand desires aren&#39;t trumped by her own principles. More strong than any<br/>\nother belief I have, is the belief that each and every person needs to<br/>\nlearn in their own way, in their own time, whatever it is they choose.<br/>\n<br/>\nThat includes food choices. If MY choice to eat vegetarian most of the<br/>\ntime (I choose seafood on occasion now) was more important than my<br/>\nchild&#39;s desires, then yeah, I&#39;d just say no. But it isn&#39;t. My children<br/>\nshould have the right to choose what they want to eat and what kind of<br/>\nprinciples THEY want to live by.<br/>\n<br/>\nI think the people that believe modeling is to ensure your child<br/>\n&quot;turn&#39;s out&quot; a certain way are deluding themselves. Your child was<br/>\nborn with their own inner wiring that will dictate many choices<br/>\noutside of your modeling and views. I truly hope my children will<br/>\nanalyze the way they were raised, analyze what their parents believe<br/>\nenough to come up with their OWN ideas and rationale for what they do.<br/>\nI don&#39;t want them to blindly follow what was modeled here. That isn&#39;t<br/>\nthinking.<br/>\n<br/>\nI have very strong beliefs about global warming and food supply and<br/>\nsustainability (teawithren.blogspot.com)....I move forward with my<br/>\ngoal to live more sustainably right here in suburbia. My children see<br/>\nthat, they know it. They shouldn&#39;t have to agree with it.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"&quot;Faith Void&quot; &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] How to screw up unschooling","postDate":"1214400806","msgId":34043,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDgwNjI1MDYzM3c1ODhkODg4MWpkNGU1ZGRkNjVlODkyZTk0QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDgxMWYwMWM4ZDY2OSQzMDEzOTkwMCRjYTAxYThjMEBDb3lvdGU+","referencesHeader":"PGczcXBhOStxczFlQGVHcm91cHMuY29tPiA8NDE5NDAxYzhkNWZiJGEwMGEzNDMwJGNhMDFhOGMwQENveW90ZT4JIDw4Q0FBNDc4NjY5QTBFMUQtMTI1OC0yNjFDQHdlYm1haWwtbWQxOS5zeXNvcHMuYW9sLmNvbT4JIDw4MTFmMDFjOGQ2NjkkMzAxMzk5MDAkY2EwMWE4YzBAQ295b3RlPg=="},"prevInTopic":34042,"nextInTopic":34044,"prevInTime":34042,"nextInTime":34044,"topicId":33982,"numMessagesInTopic":0,"msgSnippet":"... If a ball rolls into the street my child will ask me to get it for him (5) or retrieve it safely herself (11). There is no allowing . If me child wanted","messageBody":"<div id=\"ygrps-yiv-201648786\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt;How to cross the street.<br/>\n&gt;<br/>\n&gt; -=-=-=-=-=<br/>\n&gt;<br/>\n&gt; Is there a certain way? Is it valid in all situations?<br/>\n&gt;<br/>\n&gt;&gt;&gt;&gt;&gt;There are different &#39;street crossing&#39; situations. Would you let your<br/>\n&gt;&gt;&gt;&gt;&gt; child chase a ball onto a city street? Would you let your child cross with<br/>\n&gt;&gt;&gt;&gt;&gt; her/his eyes closed as a game? Would it be acceptable to cross 5th Ave<br/>\n&gt;&gt;&gt;&gt;&gt; against the light?<br/>\n<br/>\n </span></blockquote>If a ball rolls into the street my child will ask me to get it for him<br/>\n(5) or retrieve it safely herself (11). There is no &quot;allowing&quot;.<br/>\nIf me child wanted to cross with eyes closed as a game I would look<br/>\nfor solutions to make that happen. I could hold his/her hand. I could<br/>\nwalk closely beside them. If I had a blind child I would certainly<br/>\nhelp them find a way to safely cross a street. The same with a sighted<br/>\nchild.<br/>\nI don&#39;t see the world like that &quot;acceptable&quot;. I have no idea what 5th<br/>\nAve is. However both me and my children have crossed various streets<br/>\nin various cities and towns in America. We take into consideration<br/>\nwhat is safe. I use words and my actions to show them when they are<br/>\nlittle.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-=-=-=-<br/>\n&gt;<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;How to answer, or not answer the door,<br/>\n&gt;<br/>\n&gt; -=-=-=-=-<br/>\n&gt;<br/>\n&gt; Again, is there protocol for this?<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;If you are alone in the house with a 4 year old and you are in the<br/>\n&gt;&gt;&gt;&gt;&gt;&gt; shower and the doorbell rings, should your child answer it?<br/>\n&gt; -=-=-=-=-=-<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Well, we must live in a different situation because there is not issue<br/>\nto a little person answering the door here. When we lived in the city<br/>\nI did ask my kids to ignore the door when I was out if it was someone<br/>\nthey didn&#39;t know. If they were too young to understand then I probably<br/>\nwould have keep them closer to me, ie in the bathroom or at least the<br/>\ntop floor.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;how to answer the phone,<br/>\n&gt;<br/>\n&gt; -=-=-=-=-<br/>\n&gt;<br/>\n&gt; I learned a certain way in second grade. Another from my mother. And<br/>\n&gt; another while in Germany. I bet there are zillions of ways to answer a<br/>\n&gt; phone.<br/>\n&gt;<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;Hello works for me. I&#39;ve heard children answer the phone and babble or<br/>\n&gt;&gt;&gt;&gt;&gt;&gt; refuse to get the adult. Not everyone wants to speak to our kids. Is it<br/>\n&gt;&gt;&gt;&gt;&gt;&gt; appropriate for a 5 or 6 year old to answer and insist on speaking to the<br/>\n&gt;&gt;&gt;&gt;&gt;&gt; caller - when the caller may be someone calling in an emergency or<br/>\n&gt;&gt;&gt;&gt;&gt;&gt; professional capacity?<br/>\n<br/>\n </span></blockquote>If people don&#39;t want to talk to kids that is their issue not mine. I<br/>\nam my children&#39;s mother not theirs. I am not going to limit my<br/>\nchildren on the off chance that some stranger might feel uncomfortable<br/>\ncalling our home. This isn&#39;t even a very real scenario.<br/>\nA 5 or 6 year old that is treated respectfully will probably be able<br/>\nto tell if someone wants to talk to them or not. Also a child that age<br/>\ncan hear panic or would understand an emergency. Also the word<br/>\nappropriate is disconcerting to me. I am curious what you mean when<br/>\nyou write that.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-=-==-=-<br/>\n&gt;<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;I have spoken to parents<br/>\n&gt; that think that unschooling, hence unparenting means letting the kids<br/>\n&gt; smoke pot,<br/>\n&gt; steal, hit each other....because they want to.<br/>\n&gt;<br/>\n&gt; -=-=-=-=-=-<br/>\n&gt;<br/>\n&gt; What unschoolers? Where?<br/>\n&gt;<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;I&#39;ll name no names. I&#39;d wager that we&#39;ll all met those that mistake<br/>\n&gt;&gt;&gt;&gt;&gt;&gt; unschooling for not paying attention, or taking the easy road. There are<br/>\n&gt;&gt;&gt;&gt;&gt;&gt; countless ways to &#39;teach&#39;. A good way is to strive to be the kind of adult<br/>\n&gt;&gt;&gt;&gt;&gt;&gt; you&#39;d like your child to be. I do not mean that I want my 15 y.o. to be like<br/>\n&gt;&gt;&gt;&gt;&gt;&gt; me. But, I can&#39;t expect her to have respect for herself if I have none for<br/>\n&gt;&gt;&gt;&gt;&gt;&gt; me. I can&#39;t expect her to stand for her beliefs if I don&#39;t.<br/>\n<br/>\n </span></blockquote>I don&#39;t teach. I live my life side by side with my kids we make<br/>\nmistakes and together we learn from them. I agree with the end<br/>\nstatement. One must respect yourself before others will.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; In our home, my 15 year old studies what she wants for as long as she wants<br/>\n&gt; the way she wants. She is a responsible, funny, creative, motivated, self<br/>\n&gt; respecting female. She has pets. She is, for the most part, responsible for<br/>\n&gt; them. I help. I pay for the food, etc, but she pays with her actions. She<br/>\n&gt; takes responsibility for certain chores. It&#39;s a partnership.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>In our home we are all responsible to ourselves and each other. But as<br/>\nthe adult I take responsibility for the chores. My kids will help if I<br/>\nneed them to and there are several things they do regularly.<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-=-=-=-<br/>\n&gt;<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;To me, unschooling has boundaries.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>For us it is limitless. I try to have unlimited creativity.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;If your child is breaking the law, and you do not try as hard as you can<br/>\n&gt;&gt;&gt;&gt;&gt; to stop that behavior, that is a boundry that should not be crossed.<br/>\n&gt;<br/>\n&gt; For example?<br/>\n<br/>\n </span></blockquote>I don&#39;t understand what you might be talking about. I would partner<br/>\nwith my child in any endevour they would want to take on, legal or<br/>\nnot. If it was illegal I would probably try to find a more leagl<br/>\nsolution that worked for everyone My dd wanted to spary paint when she<br/>\nwas 6~after seeing graffiti. I bought her spray paint and took her<br/>\nsomewhere she could spray away without legal repercussions.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-=-=-=-=-<br/>\n&gt;<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;Brianna can&#39;t run into the freeway, for<br/>\n&gt; example.<br/>\n&gt;<br/>\n&gt; -=-=-=-<br/>\n&gt;<br/>\n&gt; Cameron did. On the way to Bonaroo when traffic was stopped for miles<br/>\n&gt; and miles and for hours. Folks got out, grilled hotdogs, played<br/>\n&gt; frisbee, tossed fottballs.<br/>\n&gt;<br/>\n&gt; My friend&#39;s daughter ran on I-26 when fleeing Hurricane Fran a few<br/>\n&gt; years ago. Again---traffic backed up for miles.<br/>\n&gt;<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;Can he run out into the freeway in &#39;normal&#39; traffic? I played on 195<br/>\n&gt;&gt;&gt;&gt;&gt;&gt; East during a blizzard. You know what I mean. Coming up with these<br/>\n&gt;&gt;&gt;&gt;&gt;&gt; extraordinary examples is beneath you.<br/>\n<br/>\n </span></blockquote>My children are capable of it. I doubt they have any inclination. I<br/>\nthought Kelly made good points. I am confident through partnering with<br/>\nthem we could find a solution. That isn&#39;t unparenting that takes a lot<br/>\nof patience and creativity.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -==-=-=-<br/>\n&gt;<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;She can&#39;t walk outside naked,<br/>\n&gt;<br/>\n&gt; =-=-=-=<br/>\n&gt;<br/>\n&gt; I bet she *can*!<br/>\n&gt;<br/>\n&gt;&gt;&gt;&gt;&gt;She &#39;can&#39;, but eventually one of the neighbors would report her to the<br/>\n&gt;&gt;&gt;&gt;&gt; police. Our city police are not friendly. Furthermore, can she walk into the<br/>\n&gt;&gt;&gt;&gt;&gt; city, into a store naked? Please don&#39;t bring up nudist colonies. We don&#39;t<br/>\n&gt;&gt;&gt;&gt;&gt; live in one.<br/>\n<br/>\n<br/>\n </span></blockquote>So are you saying if she was inclined to be naked you would refuse to<br/>\nallow her istead of looking for a solution?<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-=-=-=-<br/>\n&gt;<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;she can&#39;t steal,<br/>\n&gt;<br/>\n&gt; -=-=-=-=-<br/>\n&gt;<br/>\n&gt; I bet she *can*!<br/>\n&gt;<br/>\n&gt;&gt;&gt;&gt;She &#39;can&#39; also set fire to a church, or a person, should I let her and<br/>\n&gt;&gt;&gt;&gt; call it unschooling? Should I let her take heroin or crystal meth into our<br/>\n&gt;&gt;&gt;&gt; home - if that were her choice? What of the legal ramifications? The health<br/>\n&gt;&gt;&gt;&gt; ramifications? As the adult, I would be held responsible in acourt of law<br/>\n&gt;&gt;&gt;&gt; and perhaps imprisoned. No thanks.<br/>\n<br/>\n </span></blockquote>unschooling isn&#39;t about allowing your children lisence to hurt other<br/>\npeople or others property. it is about finding solutions that work for<br/>\neveryone. It is about not limited but finding a way. I am not the most<br/>\nelegant of speaker but I don&#39;t think anyone on here would want their<br/>\nkid to hurt others indiscriminately. From what I have learned and seen<br/>\nunschoolers partner with their children to find possibilities where<br/>\nothers place limits and rules.<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-=-=-=-<br/>\n&gt;<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;she has to be responsible for managing her own money,<br/>\n&gt;<br/>\n&gt; -=-=-=-=-<br/>\n&gt;<br/>\n&gt; &quot;Has to?&quot;<br/>\n&gt;<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;I&#39;m not responsible for her money.. As a functioning adult, a budget is<br/>\n&gt;&gt;&gt;&gt;&gt;&gt; a good thing to have. She&#39;s learned to manage her money. I don&#39;t make her<br/>\n&gt;&gt;&gt;&gt;&gt;&gt; save or spend. She does it on her own. We are not wealthy. There is a<br/>\n&gt;&gt;&gt;&gt;&gt;&gt; limited amount of money. If she wants something that I can&#39;t afford, she has<br/>\n&gt;&gt;&gt;&gt;&gt;&gt; her savings - if it&#39;s that important to her.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I think it is your language that is stopping you from hearing what<br/>\npeople are saying.<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-=-=-=-=-<br/>\n&gt;<br/>\n&gt;&gt;&gt;&gt;&gt;she has to be responsible for her safety<br/>\n&gt; when she is out alone or with friends.<br/>\n&gt;<br/>\n&gt; -==-=-=-<br/>\n&gt;<br/>\n&gt; &quot;Has to?&quot;<br/>\n&gt;<br/>\n&gt;&gt;&gt;&gt;&gt;Ever been raped?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>So are women that are raped irresponsible? I am sure that my daughter<br/>\nchooses to be as safe as possible and tries to make choices that keep<br/>\nher healthy and keep her safe. Sometimes she makes desions that I<br/>\nwouldn&#39;t, sometimes they work other times not as well. But they are<br/>\nlearning experiences. I want her to learn these things and amek<br/>\nmistakes while I am here to help her , catch her if she falls. I can&#39;t<br/>\nstop &quot;bad&quot; thins from happening to her, I can only help to keep her<br/>\nstrong and resilient, able to make it through what life offers.<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-=-=-=-<br/>\n<br/>\n </span></blockquote>-<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;Do we not stop them from driving a car with out the proper<br/>\n&gt; knowledge & practice?<br/>\n&gt;<br/>\n&gt; -=-=-=-=-<br/>\n<br/>\n<br/>\n </span></blockquote>How do you get experience? If you need experience before you drive, I<br/>\ndon&#39;t get it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;Unschooling doesn&#39;t mean not parenting. I think it means parenting<br/>\n&gt; with common<br/>\n&gt; sense and a sense of enabling our kids to adapt and survive in a<br/>\n&gt; horribly changing world.<br/>\n&gt;<br/>\n&gt; -=-=-=-=-<br/>\n&gt;<br/>\n&gt; &quot;Horribly&quot; changing world? Why such a pessimistic view?<br/>\n&gt;<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;The earth is warming, there are food riots in parts of the world that<br/>\n&gt;&gt;&gt;&gt;&gt;&gt; will eventually happen here. Over population is a major problem. The floods<br/>\n&gt;&gt;&gt;&gt;&gt;&gt; in the midwest will cause food prices to rise sharply. Oil will continue to<br/>\n&gt;&gt;&gt;&gt;&gt;&gt; be a major addiction of ours and like all addictions, if we don&#39;t deal with<br/>\n&gt;&gt;&gt;&gt;&gt;&gt; it, it will deal with us. We have reached peak oil. Period. Our nation is<br/>\n&gt;&gt;&gt;&gt;&gt;&gt; horribly in debt and our children will pay for that. Think of how the world<br/>\n&gt;&gt;&gt;&gt;&gt;&gt; was 50 years ago. Picture it in 50 years.<br/>\n&gt;<br/>\n&gt; I think of my daughter at 60...45 years from now. According to many<br/>\n&gt; scientists, much of our Rhode Island seacoast will be gone, under water.<br/>\n&gt; This is the first generation that can not be gauranteed that they will &#39;do<br/>\n&gt; better&#39;<br/>\n&gt;<br/>\n&gt; I&#39;m not pessimistic. I&#39;m informed and realistic.<br/>\n<br/>\n </span></blockquote>wow!<br/>\nThat is heavy stuff to unload on a kid. I am feeling the weight of<br/>\nyour thoughts. It is a sucky way to live. I will choose to be more<br/>\noptimistic and help do my part to make sure the world turns out better<br/>\nthan that! I want my kids to see possibilities and opportunities to<br/>\nmake the world shine bright for all humans. I don&#39;t think loading them<br/>\ndown with a sad world view will help them.<br/>\nAlso, I concede that I can not tell the future so I can only hope and dream<br/>\n<br/>\nFaith<br/>\n<br/>\n-- <br/>\nwww.bearthmama.com</div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How to screw up unschooling","postDate":"1214393484","msgId":34034,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGczdGFhYyttZnEyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgxMWYwMWM4ZDY2OSQzMDEzOTkwMCRjYTAxYThjMEBDb3lvdGU+"},"prevInTopic":34033,"nextInTopic":34038,"prevInTime":34033,"nextInTime":34035,"topicId":33982,"numMessagesInTopic":0,"msgSnippet":"Informed and realistic?  Or a product of all the fear mongering politicians? I consider myself realistic and informed, so I know that the warmest year on","messageBody":"<div id=\"ygrps-yiv-1688198288\">Informed and realistic?  Or a product of all the fear mongering<br/>\npoliticians?<br/>\n<br/>\nI consider myself realistic and informed, so I know that the warmest<br/>\nyear on record was 1998.  10 years ago.  I consider myself informed<br/>\nand realistic, and I believe that global warming is <br/>\n<br/>\n1. Natural<br/>\n2. Over <br/>\n3. Has happened before and Rhode Island didn&#39;t sink.<br/>\n<br/>\nThis doesn&#39;t make me right.  I&#39;m saying this to make a point.  NOT to<br/>\nstart a discussion on global warming.  <br/>\n<br/>\nWe can&#39;t live our lives in fear of all the terrible things that MIGHT<br/>\nhappen.  There&#39;s been an awful lot of &quot;prophecies&quot; that have not come<br/>\ntrue.  And we certainly shouldn&#39;t be raising our children in fear. <br/>\nFor every study that says &quot;there is&quot;  there is another study that says<br/>\n&quot;there isn&#39;t&quot;<br/>\n<br/>\n***<br/>\n<br/>\n&quot;This is the first generation that can not be gauranteed that they<br/>\nwill &#39;do better&#39;&quot;<br/>\n<br/>\n***<br/>\n<br/>\nI also happen to think that, that statement is a matter of opinion.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Coyote&quot; &lt;janis@...&gt; wrote:<br/>\n<br/>\n&gt;   &gt;&gt;&gt;&gt;&gt;The earth is warming, there are food riots in parts of the<br/>\nworld that will eventually happen here. Over population is a major<br/>\nproblem. The floods in the midwest will cause food prices to rise<br/>\nsharply. Oil will continue to be a major addiction of ours and like<br/>\nall addictions, if we don&#39;t deal with it, it will deal with us. We<br/>\nhave reached peak oil. Period. Our nation is horribly in debt and our<br/>\nchildren will pay for that. Think of how the world was 50 years ago.<br/>\nPicture it in 50 years.<br/>\n&gt; <br/>\n&gt;   I think of my daughter at 60...45 years from now. According to<br/>\nmany scientists, much of our Rhode Island seacoast will be gone, under<br/>\nwater. This is the first generation that can not be gauranteed that<br/>\nthey will &#39;do better&#39;<br/>\n&gt; <br/>\n&gt;   I&#39;m not pessimistic. I&#39;m informed and realistic. </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] How to screw up unschooling","postDate":"1214392879","msgId":34033,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk1RjFDNEIwLUQ2NUQtNDQ3Ri1BRTVDLTg4M0MyNzM5RTBBN0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDQxOTQwMWM4ZDVmYiRhMDBhMzQzMCRjYTAxYThjMEBDb3lvdGU+","referencesHeader":"PGczcXBhOStxczFlQGVHcm91cHMuY29tPiA8NDE5NDAxYzhkNWZiJGEwMGEzNDMwJGNhMDFhOGMwQENveW90ZT4="},"prevInTopic":34031,"nextInTopic":34034,"prevInTime":34032,"nextInTime":34034,"topicId":33982,"numMessagesInTopic":0,"msgSnippet":"... I agree, those are all useful things to know. But rather than creating a long check list under the heading Must Know box, it s more helpful for","messageBody":"<div id=\"ygrps-yiv-1459999069\">On Jun 24, 2008, at 9:10 AM, Coyote wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I believe there are things that a child must know. How to cross the  <br/>\n&gt; street. How to answer, or not answer the door, how to answer the  <br/>\n&gt; phone, how to be courteous to others, how to respect others space,  <br/>\n&gt; property and time.<br/>\n<br/>\n </span></blockquote>I agree, those are all useful things to know.<br/>\n<br/>\nBut rather than creating a long check list under the heading &quot;Must  <br/>\nKnow&quot; box, it&#39;s more helpful for unschoolers to see that those are  <br/>\nall part of living life.<br/>\n<br/>\nRather than thinking in terms of &quot;Here&#39;s what you must know,&quot; it&#39;s  <br/>\nmore helpful for unschooling to trust they&#39;ll be learning as we help  <br/>\nthem get what they want in safe and respectful ways. They&#39;ll be  <br/>\nlearning from how we handle situations. They&#39;ll be learning as we  <br/>\nhelp them find better ways to handle a situation. Rather than  <br/>\nassuming we must specifically tell them everything, we trust that  <br/>\nthey will be drawing conclusions (as well as absorbing specific  <br/>\ninformation) from how we live our lives and how we help them live  <br/>\ntheirs.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How to cross the street<br/>\n<br/>\n </span></blockquote>There isn&#39;t one way. But when we encounter a street we will naturally  <br/>\nhelp find ways to keep them safe with suggestions, actions, words,  <br/>\njokes. They will  build up a repertoire of ways to stay safe not just  <br/>\ncrossing streets but that apply to other situations too.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have spoken to parents that think that unschooling, hence  <br/>\n&gt; unparenting means letting the kids smoke pot, steal, hit each  <br/>\n&gt; other....because they want to.<br/>\n<br/>\n </span></blockquote>Unschooling shouldn&#39;t be &quot;hence unparenting.&quot; The two aren&#39;t related.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; To me, unschooling has boundaries.<br/>\n<br/>\n </span></blockquote>I was going to say &quot;Life has boundaries,&quot; but an even better way to  <br/>\nview it is that everything we choose to do entails risks. As we live  <br/>\nlife with our kids, we&#39;ll talk about what could happen and help them  <br/>\nfind solutions that minimize risk (keep them safe and don&#39;t harm  <br/>\nothers), we&#39;ll stand back when the risk seems something they&#39;d be  <br/>\nwilling to put up with to allow them to explore the consequences,  <br/>\nwe&#39;ll point out something they may be missing (and keep quiet when  <br/>\nthey&#39;re willing to take the risk), we&#39;ll help them clean up the  <br/>\nconsequences of their trials, we may help them reassess or trust  <br/>\nthey&#39;re reassessing (depends on the child and on the situation).<br/>\n<br/>\nIt will never be one lesson for one situation. It will be many  <br/>\ndifferent encounters with similar situations where we helped  them  <br/>\nget what they wanted safely and respectfully. It will be applying  <br/>\nwhat they figured out in other situations to totally different  <br/>\nsituations.<br/>\n<br/>\nThis is how humans naturally learn. It&#39;s very unnatural to learn by  <br/>\nmemorizing rules to situations! It&#39;s very natural to pick up an  <br/>\nunderstanding of how the world works by watching and doing and  <br/>\nthinking about what happened and why it  happened and how to avoid  <br/>\nthe bad parts.<br/>\n<br/>\nA child will slowly build a picture of how the world works just by  <br/>\nliving and being with attentive, aware parents who talk about  <br/>\nanything and everything. Children will come to understand that  <br/>\neverything they do comes with a risk. Just getting out of bed carries  <br/>\na risk! As part of growing up, we&#39;ll be helping them think about  <br/>\nproblems and ways to solve them safely and respectfully.<br/>\n<br/>\nRather than saying &quot;These are the things you can&#39;t do,&quot; it&#39;s more  <br/>\nuseful for the child to get loads of practice solving problems in a  <br/>\nsafe environment with aware parents they know are there to help them.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Brianna can&#39;t run into the freeway, for example.<br/>\n<br/>\n </span></blockquote>Yes, she can, but if she understood the consequences she probably  <br/>\nwouldn&#39;t want to.<br/>\n<br/>\nThis is a good example where people&#39;s thinking gets stuck when trying  <br/>\nto understand unschooling and mindful parenting. When a child wants  <br/>\nsomething:<br/>\n<br/>\n1) The child doesn&#39;t always understand the consequences.<br/>\n<br/>\n2) The child always has other goals they&#39;re trying to achieve at the  <br/>\nsame time<br/>\n<br/>\n3) The child doesn&#39;t necessarily want exactly what they&#39;re trying to  <br/>\ndo or asking for.<br/>\n<br/>\nA child may want to run into the street but they *also* want to not  <br/>\nget hurt.<br/>\n<br/>\nA child may want a toy another child has but they *also* want to get  <br/>\nalong in society.<br/>\n<br/>\nBasically the child&#39;s goal is to explore the world safely and  <br/>\nrespectfully. They just don&#39;t have the skills. Our role is to help  <br/>\nthem find ways to do what they want to do safely and respectfully.<br/>\n<br/>\nA child who runs toward the road needs to not be put in situations  <br/>\nwhere there are roads to run towards. If there are times they need to  <br/>\nbe near a road, we need to be right by their side. We can also help  <br/>\nthem explore roads (like quiet streets) until they&#39;ve gotten as much  <br/>\nas they need. (It won&#39;t take long! Streets really aren&#39;t that  <br/>\ninteresting ;-) If they&#39;re interested it&#39;s probably because they&#39;ve  <br/>\nheard &quot;No, you can&#39;t!&quot; ;-) We should also respond to heading for the  <br/>\nstreet (or anything dangerous) with *better* ideas, something that&#39;s  <br/>\nmore fun.<br/>\n<br/>\nWe&#39;ll also be telling them, in terms appropriate to their age, why  <br/>\nthat isn&#39;t safe. &quot;Cars could hit you,&quot; for example. Older kids can  <br/>\nget more detailed explanations but the explanations *shouldn&#39;t* be  <br/>\nseen as ways to remotely control the kids. They&#39;re *information* to  <br/>\nhelp kids make better (safer, more respectful) decisions. But it&#39;s up  <br/>\nto us to keep them safe.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She can&#39;t walk outside naked,<br/>\n<br/>\n </span></blockquote>Sure she can.<br/>\n<br/>\nBut what does the child really want? How can she be helped to do it  <br/>\nsafely and respectfully?<br/>\n<br/>\nIf this were a real child with a penchant for running outside naked  <br/>\nevery chance she got, I&#39;m sure there would be lots of ideas from  <br/>\npeople on the list thrown out involving both principles and how other  <br/>\npractically implemented them.<br/>\n<br/>\nIn some communities it might be perfectly acceptable to be 2 and  <br/>\nnaked. There might be creepy neighbors. There might be a screened  <br/>\nbackyard.  There aren&#39;t hard and fast rules.<br/>\n<br/>\nWhere people get confused is this doesn&#39;t need to be &quot;A Lesson in  <br/>\nConsequences for a Lifetime.&quot; In many instances it&#39;s more helpful to  <br/>\ndeal with kids where they are now rather than thinking into the far  <br/>\ndistant future. A 2 yo running out naked isn&#39;t the same as a 12  <br/>\nyo ;-) They don&#39;t need treated the same. But the 12 yo shouldn&#39;t have  <br/>\nbeen running out at 11 naked or at 8 naked. By that time they should  <br/>\nhave been through with mom a lot of other options that are safe and  <br/>\nrespectful.<br/>\n<br/>\nAnd a 2 yo isn&#39;t running outside naked for the same reasons a 12 yo  <br/>\nmight. In fact probably the most likely reason a 12 yo would want to  <br/>\nwalk out naked (assuming they haven&#39;t been raised in a nudist colony  <br/>\nand just forgot they aren&#39;t any more ;-) is because they heard &quot;No,  <br/>\nyou can&#39;t&quot; to everything they tried to do.<br/>\n<br/>\nIf kids grow up in an atmosphere of &quot;Let&#39;s figure out how to do that  <br/>\nsafely and respectfully,&quot; and &quot;Let&#39;s find something even better,&quot; she  <br/>\ndoesn&#39;t even need to  hear &quot;You can&#39;t walk outside naked.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; she can&#39;t steal,<br/>\n<br/>\n </span></blockquote>That she can do too.<br/>\n<br/>\nIf a child is growing up in a home where their being helped to find  <br/>\nways to get what they want in ways that are safe and respectful, the  <br/>\nwill have concluded that it isn&#39;t nice to steal.<br/>\n<br/>\nSpecifically they will have probably heard &quot;We need to pay for that  <br/>\nfirst. It doesn&#39;t belong to us. It belongs to the store.&quot; &quot;I will  <br/>\nalmost always say yes, but I&#39;d appreciate it if you&#39;d ask before you use<br/>\n<br/>\nIt&#39;s really doubtful we&#39;ll ever need to tell a child they can&#39;t  <br/>\nsteal. I don&#39;t think I&#39;ve ever told my daughter! But, as we help them  <br/>\nbe respectful of others as they try to get what they want in life,  <br/>\nthey will naturally draw the conclusion that taking something that  <br/>\ndoesn&#39;t belong to you is hurtful and disrepectful.<br/>\n<br/>\nIt needn&#39;t be a single lesson. It&#39;s just a natural conclusion of  <br/>\nliving life respectfully.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; she has to be responsible for managing her own money,<br/>\n<br/>\n </span></blockquote>I  think it&#39;s very helpful for parents to pass on the tricks they&#39;ve  <br/>\npicked up to make life easier.<br/>\n<br/>\nOur kids&#39; responsibility is to do what makes *their* life happier. If  <br/>\nwe&#39;ve raised them in an atmosphere of being safe and respectful, we  <br/>\nhave to trust them once they leave home.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; she has to be responsible for her safety when she is out alone or  <br/>\n&gt; with friends.<br/>\n<br/>\n </span></blockquote>Well, yes .... but that&#39;s a tall order and will trap parenting into  <br/>\nthinking of all the rules they need to teach their kids to keep  <br/>\nthemselves safe.<br/>\n<br/>\nWe raise them in an atmosphere of solving problems while keeping safe  <br/>\nand being respectful, then they will use that skill when faced with  <br/>\nnovel situations.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There are many things that our kids need to know. Practical day -  <br/>\n&gt; to - day stuff. We would be highly remiss in not teaching them  <br/>\n&gt; these things.<br/>\n&gt; Do we not tell them not to take a bath with a radio?<br/>\n&gt; Do we not stop them from driving a car with out the proper  <br/>\n&gt; knowledge & practice?<br/>\n<br/>\n </span></blockquote>Again, this is where people trying to get unschooling get confused.<br/>\n<br/>\nTeaching isn&#39;t the only way kids get information into them.<br/>\n<br/>\nPassing on information isn&#39;t teaching. It&#39;s polite!<br/>\n<br/>\nI&#39;d be darn ticked off if my husband saw me doing something and knew  <br/>\nit was dangerous but let me do it anyway!<br/>\n<br/>\nWe don&#39;t need to tell them specifically not to take a bath with a  <br/>\nradio (though if we see them headed that direction, of course speak  <br/>\nup!) But, it&#39;s more likely, in the course of living life, we will  <br/>\nhave mentioned in several contexts that electricity and water don&#39;t  <br/>\nplay nice and talked about why. So they will then be able to easily  <br/>\ndraw the conclusion not to take a radio or hairdryer into the bath.  <br/>\n*But*, since they weren&#39;t handed just a rule of &quot;Never take a radio  <br/>\ninto the bath&quot;, when they see an ad for a shower radio, they&#39;ll also  <br/>\nbe able to conclude the manufacturers have taken special precautions  <br/>\nto overcome the limitations of electricity and water. (They will  <br/>\n*also* have picked up through various experiences in their lives that  <br/>\nmanufacturers are in the business of making money and that it&#39;s  <br/>\nalways a good idea to read the fine print. (A fun example that makes  <br/>\nthat point is the last page of Consumer Reports!))<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Unschooling doesn&#39;t mean not parenting. I think it means parenting  <br/>\n&gt; with common sense and a sense of enabling our kids to adapt and  <br/>\n&gt; survive in a horribly changing world.<br/>\n<br/>\n </span></blockquote>No one should be assuming unschooling means let them figure out life  <br/>\nall on their own.<br/>\n<br/>\nAnd I think it helps us live more joyful lives to make a concerted  <br/>\neffort to see the progress we&#39;ve made in society to counter the  <br/>\nnegatives that are still there and any new ones that get added.<br/>\n<br/>\nWhen society becomes more the way we expect it should be -- treating  <br/>\nothers with respect, for example -- it&#39;s hard to imagine how life  <br/>\nfelt when it wasn&#39;t that way. All someone needs as a reminder is to  <br/>\nread  a couple of Nancy Drews  from the 30&#39;s or the Bobsey Twins to  <br/>\nsee how acceptable it was to have the few black characters be lazy  <br/>\nand shiftless and drunk and stupid. That was mainstream (white)  <br/>\nAmerica, not pockets of ignorance.<br/>\n<br/>\nIt&#39;s hard to call up what it felt like to be a woman who wanted a  <br/>\nchallenging job but was faced with a huge horde of messages from  <br/>\nfamily, friends, strangers, universities, employers, books,  <br/>\nmagazines ... that had nothing supportive to say to her idea.<br/>\n<br/>\nWhile unions might be seen by some as the bane of American industry,  <br/>\nwithout the understanding that employers held all the power at the  <br/>\nturn of the previous century and could fire someone for not jumping  <br/>\nwhen they said jump, it&#39;s hard to see the tremendous amount good  <br/>\nthey&#39;ve done.<br/>\n<br/>\nWhile people may deride modern medicine, and look back to simpler  <br/>\ntimes, it wasn&#39;t very long ago that families *expected* that not all  <br/>\nof their kids would live to adulthood. Without the advances in  <br/>\nmedicine we wouldn&#39;t have the luxury of seeing the advantages of  <br/>\nsimpler methods.<br/>\n<br/>\nWithout seeing a *true* picture of where we used to be -- rather than  <br/>\nthe fantasized images of simpler times that lots of people end up  <br/>\nholding -- it makes it difficult to appreciate how far we&#39;ve come.  <br/>\nYes, there are new bad things cropping up. Yes, we&#39;ve got lots  <br/>\nfurther to go.  (I suspect unschooling mindful parents see that  <br/>\n*very* clearly! Just a visit to Walmart at Christmas time to view how  <br/>\nmainstream parents treat their kids can send a hopeful person into  <br/>\ndespair that things will ever improve!) But I see a lot of hope in  <br/>\nthe people here and in the kids they&#39;re raising. Without the examples  <br/>\nof a different way, things can&#39;t improve.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":275818265,"authorName":"Therese","from":"&quot;Therese&quot; &lt;theresefranklin@...&gt;","profile":"luvmy2gifts","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How to screw up unschooling","postDate":"1214380950","msgId":34042,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGczc3UybStqaDEyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgxMWYwMWM4ZDY2OSQzMDEzOTkwMCRjYTAxYThjMEBDb3lvdGU+"},"prevInTopic":34038,"nextInTopic":34043,"prevInTime":34041,"nextInTime":34043,"topicId":33982,"numMessagesInTopic":0,"msgSnippet":"But, I can t expect her to have respect for herself if I have none for me. I can t expect her to stand for her beliefs if I don t.  *Round of applause*","messageBody":"<div id=\"ygrps-yiv-820700375\">&quot;But, I can&#39;t expect her to have respect for herself if I have none for<br/>\nme. I can&#39;t expect her to stand for her beliefs if I don&#39;t. &quot;<br/>\n<br/>\n*Round of applause*  [=D&gt;]<br/>\n<br/>\nAnd can I say I am loving this convo?<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":275818265,"authorName":"Therese","from":"&quot;Therese&quot; &lt;theresefranklin@...&gt;","profile":"luvmy2gifts","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How to screw up unschooling","postDate":"1214373001","msgId":34038,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGczc21hOStqN3JhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGczcjFuaytzc2RnQGVHcm91cHMuY29tPg=="},"prevInTopic":34034,"nextInTopic":34042,"prevInTime":34037,"nextInTime":34039,"topicId":33982,"numMessagesInTopic":0,"msgSnippet":"... said toy away because he s hitting someone with it.  We all feel awful after a situation like this, but don t feel ... happen often, but when it does it","messageBody":"<div id=\"ygrps-yiv-380609060\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;I feel like we have to step in physically and remove him or take <br/>\n </span></blockquote>said toy away because he&#39;s hitting someone with it.  We all feel <br/>\nawful after a situation like this, but don&#39;t feel <br/>\n<blockquote><span title=\"ireply\"> &gt; like there is an alternative.  Any suggestions?  This doesn&#39;t <br/>\n </span></blockquote>happen often, but when it does it feels like we are damaging our <br/>\n<blockquote><span title=\"ireply\"> &gt; relationship because everyone gets so upset and my son gets so <br/>\n </span></blockquote>angry  at us for stopping him.  <br/>\n<br/>\nI am totally at this stage so I wanted to mention something here.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Truly the only time we physically stop him or take a toy away is <br/>\n </span></blockquote>when he&#39;s hurting another child. &gt;&gt;<br/>\n<br/>\nI don&#39;t see a problem with that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; We are respectful in the beginning and say &quot;hey bud, so and so&#39;s <br/>\n </span></blockquote>not &gt; o.k. with that, please stop&quot; and sometimes he does and <br/>\nsometimes he doesn&#39;t.  Sometimes we suggest an alternative of what he <br/>\nwas doing, to do it on something else or somewhere else and sometimes <br/>\nthis works and sometimes it doesn&#39;t.  Sometimes we try to suggest <br/>\nanother game and that works sometimes and sometimes not.&gt;&gt;&gt; <br/>\n<br/>\nThis sounds like a good start, but I would say they need to know that <br/>\nhitting with an object is NOT okay.  Don&#39;t sweet talk him when he <br/>\ndoes this- but don&#39;t yell either. Tell him matter-of-factly.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;.I usually just blurt out &quot;hey stop bud, so and so&#39;s not liking <br/>\n </span></blockquote>that game&quot;, which doesn&#39;t seem to help either.<br/>\n<blockquote><span title=\"ireply\"> &gt; Any suggestions?&gt;&gt;<br/>\n<br/>\n </span></blockquote>Yes.  I started to applying some Grace-based discipline in this <br/>\nsituation where I would; 1) get to their level, explain clearly what <br/>\nthey need to do and why, &quot;I see your friend is getting hurt.  Toys <br/>\nare not for hurting people&quot;.  You can also try to distract at this <br/>\npoint as well. 2) stay close- if its still happening, then I use this <br/>\nverbage; &quot;Can you stop yourself from hitting, or do you need mommy to <br/>\nhelp you to stop?&quot;<br/>\n<br/>\nUsually that is all my kids need to stop, because they know what will <br/>\nhappen next- which is 3) - &quot;I see you are having a hard time stopping <br/>\nyourself from hitting, so I am going to help you now&quot;.  And I pick <br/>\nthem up and sit them with me (not a time-out, but a time for them to <br/>\nsit with me while I talk to them quietly, or just hold them until <br/>\nthey are calm).  If they cry I just validate validate validate their <br/>\nfeelings; &quot;You are upset&quot;  &quot;You are really frustrated right now&quot; <br/>\n<br/>\nI try not to take the toy out of their hands. Usually sitting with me <br/>\ngets old and they want to play again, and I let them get up if they <br/>\nwant to get up- but I will repeat the sequence if they are having a <br/>\nhard time.  Also- distracting with food, drink etc.  I note if they <br/>\nare tired and we may have to leave.  Sometimes kids get overwhelmed <br/>\nand need some quiet time from lots of children.  <br/>\n<br/>\nI use the &#39;Can you stop yourself from ___ or do you need help?&#39; and <br/>\nit usually helps the situation greatly.  It may require some co-<br/>\nercian as far as taking them out of the situation, but I really try <br/>\nto use it when the child is hurting someone and talking to them isn&#39;t <br/>\nworking.  But try to remember that there is alwasy an underlying <br/>\nreason for the behavior- find out what that is.<br/>\n<br/>\nTherese</div>","specialLinks":[]},{"userId":49412617,"authorName":"Coyote","from":"&quot;Coyote&quot; &lt;janis@...&gt;","profile":"janacoyote","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] How to screw up unschooling","postDate":"1214360063","msgId":34031,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgxMWYwMWM4ZDY2OSQzMDEzOTkwMCRjYTAxYThjMEBDb3lvdGU+","referencesHeader":"PGczcXBhOStxczFlQGVHcm91cHMuY29tPiA8NDE5NDAxYzhkNWZiJGEwMGEzNDMwJGNhMDFhOGMwQENveW90ZT4gPDhDQUE0Nzg2NjlBMEUxRC0xMjU4LTI2MUNAd2VibWFpbC1tZDE5LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":34017,"nextInTopic":34033,"prevInTime":34030,"nextInTime":34032,"topicId":33982,"numMessagesInTopic":0,"msgSnippet":"... From: Coyote  ... big worry. I believe there are things that a child must know. -=-=-=-=- All children? Or just yours? ... ","messageBody":"<div id=\"ygrps-yiv-1395419339\">-----Original Message-----<br/>\n  From: Coyote &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:janis@...\">janis@...</a>&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;When we first heard of unschooling, the &#39;unparenting&#39; part was a <br/>\n </span></blockquote>  big worry. I<br/>\n  believe there are things that a child must know.<br/>\n<br/>\n  -=-=-=-=-<br/>\n<br/>\n  All children? Or just yours?<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;I think there are things in life that everyone should know. Everyone, as in all children & adults. Any situation that may  probably be dangerous, if done incorrectly....as in crossing the street. <br/>\n<br/>\n </span></blockquote>  -==-=-==-<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;How to cross the street.<br/>\n<br/>\n </span></blockquote>  -=-=-=-=-=<br/>\n<br/>\n  Is there a certain way? Is it valid in all situations?<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;There are different &#39;street crossing&#39; situations. Would you let your child chase a ball onto  a city street?  Would you let your child cross with her/his eyes closed as a game? Would it be acceptable to cross 5th Ave against the light?<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>  -=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;How to answer, or not answer the door,<br/>\n<br/>\n </span></blockquote>  -=-=-=-=-<br/>\n<br/>\n  Again, is there protocol for this?<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;If you are alone in the house with a 4 year old and you are in the shower and the doorbell rings, should your child answer it?<br/>\n </span></blockquote>  -=-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;how to answer the phone,<br/>\n<br/>\n </span></blockquote>  -=-=-=-=-<br/>\n<br/>\n  I learned a certain way in second grade. Another from my mother. And <br/>\n  another while in Germany. I bet there are zillions of ways to answer a <br/>\n  phone.<br/>\n<br/>\n<blockquote><span title=\"ireply\">    &gt;&gt;&gt;&gt;&gt;Hello works for me. I&#39;ve heard children answer the phone and babble or refuse to get the adult. Not everyone wants to speak to our kids. Is it appropriate for a 5 or 6 year old to answer and insist on speaking to the caller - when the caller may be someone calling in an emergency or professional capacity?<br/>\n<br/>\n </span></blockquote>  -=-=-==-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;I have spoken to parents<br/>\n </span></blockquote>  that think that unschooling, hence unparenting means letting the kids <br/>\n  smoke pot,<br/>\n  steal, hit each other....because they want to.<br/>\n<br/>\n  -=-=-=-=-=-<br/>\n<br/>\n  What unschoolers? Where?<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;I&#39;ll name no names. I&#39;d wager that we&#39;ll all met those that mistake unschooling for not paying attention, or taking the easy road. There are countless ways to &#39;teach&#39;. A good way is to strive to be the kind of adult you&#39;d like your child to be. I do not mean that I want my 15 y.o.  to be like me. But, I can&#39;t expect her to have respect for herself if I have none for me. I can&#39;t expect her to stand for her beliefs if I don&#39;t. <br/>\n<br/>\n </span></blockquote>  In our home, my 15 year old studies what she wants for as long as she wants the way she wants. She is a responsible, funny, creative, motivated, self respecting female. She has pets. She is, for the most part, responsible for them. I help. I pay for the food, etc, but she pays with her actions. She takes responsibility for certain chores. It&#39;s a partnership.<br/>\n<br/>\n<br/>\n<br/>\n  -=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;To me, unschooling has boundaries.<br/>\n<br/>\n </span></blockquote>  -=-=--=-=-<br/>\n<br/>\n  For everyone?<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;If your child is breaking the law, and you do not try as hard as you can to stop that behavior, that is a boundry that should not be crossed.<br/>\n<br/>\n </span></blockquote>  For example?<br/>\n<br/>\n  -=-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;Brianna can&#39;t run into the freeway, for<br/>\n </span></blockquote>  example.<br/>\n<br/>\n<br/>\n<br/>\n  -=-=-=-<br/>\n<br/>\n  Cameron did. On the way to Bonaroo when traffic was stopped for miles <br/>\n  and miles and for hours. Folks got out, grilled hotdogs, played <br/>\n  frisbee, tossed fottballs.<br/>\n<br/>\n  My friend&#39;s daughter ran on I-26 when fleeing Hurricane Fran a few <br/>\n  years ago. Again---traffic backed up for miles.<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;Can he run out into the freeway in &#39;normal&#39; traffic? I played on 195 East during a blizzard. You know what I mean. Coming up with these extraordinary examples is beneath you.<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>  -==-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;She can&#39;t walk outside naked,<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>  =-=-=-=<br/>\n<br/>\n  I bet she *can*!<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;She &#39;can&#39;, but eventually one of the neighbors would report her to the police. Our city police are not friendly. Furthermore, can she walk into the city, into a store naked?  Please don&#39;t bring up nudist colonies. We don&#39;t live in one.<br/>\n<br/>\n<br/>\n </span></blockquote>  -=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;she can&#39;t steal,<br/>\n<br/>\n </span></blockquote>  -=-=-=-=-<br/>\n<br/>\n  I bet she *can*!<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;She &#39;can&#39; also set fire to a church, or a person, should I let her and call it unschooling?  Should I let her take heroin or crystal meth into our home - if that were her choice? What of the legal ramifications? The health ramifications? As the adult, I would be held responsible in acourt of law and perhaps imprisoned. No thanks. <br/>\n<br/>\n </span></blockquote>  -=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;she has to be responsible for managing her own money,<br/>\n<br/>\n<br/>\n </span></blockquote>  -=-=-=-=-<br/>\n<br/>\n  &quot;Has to?&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;I&#39;m not responsible for her money.. As  a functioning adult, a budget is a good thing to have. She&#39;s learned to manage her money. I don&#39;t make her save or spend. She does it on her own. We are not wealthy. There is a limited amount of money. If she wants something that I can&#39;t afford, she has her savings - if it&#39;s that important to her.<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>  -=-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;she has to be responsible for her safety<br/>\n </span></blockquote>  when she is out alone or with friends.<br/>\n<br/>\n  -==-=-=-<br/>\n<br/>\n  &quot;Has to?&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;Ever been raped?<br/>\n<br/>\n </span></blockquote>  -=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;There are many things that our kids need to know. Practical day - <br/>\n </span></blockquote>  to - day<br/>\n  stuff. We would be highly remiss in not teaching them these things.<br/>\n<br/>\n  -=-=-=-=-=-<br/>\n<br/>\n  Most things they don&#39;t need to be &quot;taught.&quot; They learn by *your* good <br/>\n  example.<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;&gt;I don&#39;t know eveything. I&#39;m still growing, still learning.<br/>\n </span></blockquote>  -=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;&gt;Do we not tell them not to take a bath with a radio?<br/>\n<br/>\n </span></blockquote>  -=-=-=-=-<br/>\n<br/>\n  I don&#39;t think I&#39;ve had to tell mine that.<br/>\n<br/>\n  We used to have a radio in the tub. It was pretty cool. Maybe we need <br/>\n  to get another!<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;&gt;&gt;I won&#39;t even address this.<br/>\n </span></blockquote>  -=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;Do we not stop them from driving a car with out the proper <br/>\n </span></blockquote>  knowledge & practice?<br/>\n<br/>\n  -=-=-=-=-<br/>\n<br/>\n  Huh? Both of mine have driven my car. I was right there, but they <br/>\n  didn&#39;t necessarily have the &quot;proper knowledge.&quot; They&#39;d watched me drive <br/>\n  for years. They had never &quot;practiced&quot;---you mean like a pretend car? Or <br/>\n  bumper cars? Or go-carts? Duncan drove the minivan last year when he <br/>\n  was 11. Did pretty well too!<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;You prove my point.<br/>\n </span></blockquote>  -=-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;Unschooling doesn&#39;t mean not parenting. I think it means parenting <br/>\n </span></blockquote>  with common<br/>\n  sense and a sense of enabling our kids to adapt and survive in a <br/>\n  horribly changing world.<br/>\n<br/>\n  -=-=-=-=-<br/>\n<br/>\n  &quot;Horribly&quot; changing world? Why such a pessimistic view?<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;The earth is warming, there are food riots in parts of the world that will eventually happen here. Over population is a major problem. The floods in the midwest will cause food prices to rise sharply. Oil will continue to be a major addiction of ours and like all addictions, if we don&#39;t deal with it, it will deal with us. We have reached peak oil. Period. Our nation is horribly in debt and our children will pay for that. Think of how the world was 50 years ago. Picture it in 50 years.<br/>\n<br/>\n </span></blockquote>  I think of my daughter at 60...45 years from now. According to many scientists, much of our Rhode Island seacoast will be gone, under water. This is the first generation that can not be gauranteed that they will &#39;do better&#39;<br/>\n<br/>\n  I&#39;m not pessimistic. I&#39;m informed and realistic.<br/>\n<br/>\n  ~Kelly<br/>\n<br/>\n  Kelly Lovejoy<br/>\n  Conference Coordinator<br/>\n  Live and Learn Unschooling Conference<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] How to screw up unschooling","postDate":"1214356662","msgId":34017,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQUE0Nzg2NjlBMEUxRC0xMjU4LTI2MUNAd2VibWFpbC1tZDE5LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PDQxOTQwMWM4ZDVmYiRhMDBhMzQzMCRjYTAxYThjMEBDb3lvdGU+","referencesHeader":"PGczcXBhOStxczFlQGVHcm91cHMuY29tPiA8NDE5NDAxYzhkNWZiJGEwMGEzNDMwJGNhMDFhOGMwQENveW90ZT4="},"prevInTopic":34013,"nextInTopic":34031,"prevInTime":34016,"nextInTime":34018,"topicId":33982,"numMessagesInTopic":0,"msgSnippet":"... From: Coyote  ... big worry. I believe there are things that a child must know. -=-=-=-=- All children? Or just yours? -==-=-==- ","messageBody":"<div id=\"ygrps-yiv-1303888895\">-----Original Message-----<br/>\nFrom: Coyote &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:janis@...\">janis@...</a>&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;When we first heard of unschooling, the &#39;unparenting&#39; part was a <br/>\n </span></blockquote>big worry. I<br/>\nbelieve there are things that a child must know.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nAll children? Or just yours?<br/>\n<br/>\n-==-=-==-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;How to cross the street.<br/>\n<br/>\n </span></blockquote>-=-=-=-=-=<br/>\n<br/>\nIs there a certain way? Is it valid in all situations?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;How to answer, or not answer the door,<br/>\n<br/>\n </span></blockquote>-=-=-=-=-<br/>\n<br/>\nAgain, is there protocol for this?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;how to answer the phone,<br/>\n<br/>\n </span></blockquote>-=-=-=-=-<br/>\n<br/>\nI learned a certain way in second grade. Another from my mother. And <br/>\nanother while in Germany. I bet there are zillions of ways to answer a <br/>\nphone.<br/>\n<br/>\n-=-=-==-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&gt;&gt;I have spoken to parents<br/>\n </span></blockquote>that think that unschooling, hence unparenting means letting the kids <br/>\nsmoke pot,<br/>\nsteal, hit each other....because they want to.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nWhat unschoolers? Where?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;To me, unschooling has boundaries.<br/>\n<br/>\n </span></blockquote>-=-=--=-=-<br/>\n<br/>\nFor everyone?<br/>\n<br/>\nFor example?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;Brianna can&#39;t run into the freeway, for<br/>\n </span></blockquote>example.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nCameron did. On the way to Bonaroo when traffic was stopped for miles <br/>\nand miles and for hours. Folks got out, grilled hotdogs, played <br/>\nfrisbee, tossed fottballs.<br/>\n<br/>\nMy friend&#39;s daughter ran on I-26 when fleeing Hurricane Fran a few <br/>\nyears ago. Again---traffic backed up for miles.<br/>\n<br/>\n-==-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;She can&#39;t walk outside naked,<br/>\n<br/>\n </span></blockquote>-=-=-=-=<br/>\n<br/>\nI bet she *can*!<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;she can&#39;t steal,<br/>\n<br/>\n </span></blockquote>-=-=-=-=-<br/>\n<br/>\nI bet she *can*!<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;she has to be responsible for managing her own money,<br/>\n<br/>\n </span></blockquote>-=-=-=-=-<br/>\n<br/>\n&quot;Has to?&quot;<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;she has to be responsible for her safety<br/>\n </span></blockquote>when she is out alone or with friends.<br/>\n<br/>\n-==-=-=-<br/>\n<br/>\n&quot;Has to?&quot;<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;There are many things that our kids need to know. Practical day - <br/>\n </span></blockquote>to - day<br/>\nstuff. We would be highly remiss in not teaching them these things.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nMost things they don&#39;t need to be &quot;taught.&quot; They learn by *your* good <br/>\nexample.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;Do we not tell them not to take a bath with a radio?<br/>\n<br/>\n </span></blockquote>-=-=-=-=-<br/>\n<br/>\nI don&#39;t think I&#39;ve had to tell mine that.<br/>\n<br/>\nWe used to have a radio in the tub. It was pretty cool. Maybe we need <br/>\nto get another!<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;Do we not stop them from driving a car with out the proper <br/>\n </span></blockquote>knowledge & practice?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nHuh? Both of mine have driven my car. I was right there, but they <br/>\ndidn&#39;t necessarily have the &quot;proper knowledge.&quot; They&#39;d watched me drive <br/>\nfor years. They had never &quot;practiced&quot;---you mean like a pretend car? Or <br/>\nbumper cars? Or go-carts? Duncan drove the minivan last year when he <br/>\nwas 11. Did pretty well too!<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;Unschooling doesn&#39;t mean not parenting. I think it means parenting <br/>\n </span></blockquote>with common<br/>\nsense and a sense of enabling our kids to adapt and survive in a <br/>\nhorribly changing world.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n&quot;Horribly&quot; changing world? Why such a pessimistic view?<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a></div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: How to screw up unschooling","postDate":"1214352964","msgId":34013,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgwNjI0MTcxNnEyNTkwNTY1ZWllMGFlZTM4ZGI3MDk4ZjIwQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGczcjFuaytzc2RnQGVHcm91cHMuY29tPg==","referencesHeader":"PGczcXBhOStxczFlQGVHcm91cHMuY29tPiA8ZzNyMW5rK3NzZGdAZUdyb3Vwcy5jb20+"},"prevInTopic":34000,"nextInTopic":34017,"prevInTime":34012,"nextInTime":34014,"topicId":33982,"numMessagesInTopic":0,"msgSnippet":"Children may not look like they re getting it.  It takes a lot of time to develop empathy.  It also takes something most of us don t have...  most of us are","messageBody":"<div id=\"ygrps-yiv-525139577\">Children may not look like they&#39;re getting it.  It takes a lot of time to<br/>\ndevelop empathy.  It also takes something most of us don&#39;t have...  most of<br/>\nus are individualistic enough to pay attention to our own thoughts, ideas,<br/>\nwishes, etc on some level.  Yet we&#39;re not particularly attuned to others.<br/>\nOne of the reasons for this =as adults= is the taboo against saying what we<br/>\nwant which so often gets translated as &quot;selfish,&quot; but would really help<br/>\nsometimes.  As a result, kids don&#39;t typically say what they want either<br/>\nbecause they imitate what they see for the most part.<br/>\n<br/>\nI&#39;ve had luck intermediating between ds and someone else.  By coming up with<br/>\nalternatives for something another child might prefer.  If for instance ds<br/>\nwants to be rowdy and a tiny reluctant younger kid walks up in tow with a<br/>\nmom, I might suggest playing on the swing together or at the sandbox,<br/>\n(something introductory instead of going in full tilt).  Sometimes it takes<br/>\nor...<br/>\n<br/>\nRedirecting or providing a fun thing to do or playing/talking about<br/>\nsomething else can change a bored scene and take the lead out of a hot<br/>\nsituation too.  Shifting to a different gear rather than focusing on what&#39;s<br/>\n&quot;wrong.&quot;  Move on to something new and if possible something fun or just<br/>\nsomething mildly interesting.  It&#39;s doesn&#39;t have to win any Emmy&#39;s.<br/>\n<br/>\nI finally have gotten to the place I usually remember to take something<br/>\nfamiliar and solitary for ds to do in case he&#39;s feeling not so sociable when<br/>\nwe&#39;re at someone&#39;s house or he doesn&#39;t know anybody or there&#39;s no kids, like<br/>\nthe library at dinner time or the playgroups he doesn&#39;t know well or at a<br/>\nfriend&#39;s.  Last time we were at a homeschool group and he didn&#39;t know the<br/>\nkids, he had markers, pipecleaners, paper, glitter glue as well as the park<br/>\nto play in.  The other kids played with the craft stuff too.  It was sort of<br/>\nan icebreaker for them as they sat around making stuff together.  You can do<br/>\nthe same thing with food or making food.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 6/24/08, Julie v. &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:thewekkenfam@...\">thewekkenfam@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   Ren,<br/>\n&gt;<br/>\n&gt; How do unschoolers respectfully say &quot;stop it&quot; or &quot;knock it off, so<br/>\n&gt; and so&#39;s not o.k. with that&quot;? This is where we seem to have conflict<br/>\n&gt; with my 6 year old. My husband and I seem to revert back to<br/>\n&gt; mainstream parenting when these types of situations come along and<br/>\n&gt; our son resents being told what to do and will either just continue<br/>\n&gt; until my husband or I feel like we have to step in physically and<br/>\n&gt; remove him or take said toy away because he&#39;s hitting someone with<br/>\n&gt; it. We all feel awful after a situation like this, but don&#39;t feel<br/>\n&gt; like there is an alternative. Any suggestions? This doesn&#39;t happen<br/>\n&gt; often, but when it does it feels like we are damaging our<br/>\n&gt; relationship because everyone gets so upset and my son gets so angry<br/>\n&gt; at us for stopping him. Truly the only time we physically stop him<br/>\n&gt; or take a toy away is when he&#39;s hurting another child.<br/>\n&gt;<br/>\n&gt; We are respectful in the beginning and say &quot;hey bud, so and so&#39;s not<br/>\n&gt; o.k. with that, please stop&quot; and sometimes he does and sometimes he<br/>\n&gt; doesn&#39;t. Sometimes we suggest an alternative of what he was doing,<br/>\n&gt; to do it on something else or somewhere else and sometimes this works<br/>\n&gt; and sometimes it doesn&#39;t. Sometimes we try to suggest another game<br/>\n&gt; and that works sometimes and sometimes not.<br/>\n&gt;<br/>\n&gt; I guess my question is all on how we word things, which may not seem<br/>\n&gt; like a big deal, but I can tell that my son responds very well when<br/>\n&gt; his needs and wants are being listened to and respected along with<br/>\n&gt; the child he is hitting. It&#39;s just hard for me to be respectful when<br/>\n&gt; he&#39;s hitting a child with an object and he thinks it&#39;s funny & a game<br/>\n&gt; and the other child is wanting him to stop. I usually just blurt<br/>\n&gt; out &quot;hey stop bud, so and so&#39;s not liking that game&quot;, which doesn&#39;t<br/>\n&gt; seem to help either.<br/>\n&gt;<br/>\n&gt; Any suggestions?<br/>\n&gt;<br/>\n&gt; Thanks<br/>\n&gt; Julie v.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lerendzonderschool.blogspot.com/\">http://www.lerendzonderschool.blogspot.com/</a><br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&lt;unschoolingbasics%40yahoogroups.com&gt;,<br/>\n&gt; &quot;Ren Allen&quot;<br/>\n&gt; &lt;starsuncloud@...&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; I started to think about it and one of the topics that came to mind<br/>\n&gt; is<br/>\n&gt; &gt; the whole &quot;unparenting&quot; issue. That word is used as a slam against<br/>\n&gt; &gt; those of us that believe strongly in freedom and respect for<br/>\n&gt; children.<br/>\n&gt; &gt; But I&#39;ve actually witnessed true &quot;unparenting&quot; in the form of<br/>\n&gt; neglect<br/>\n&gt; &gt; from some that choose unschooling.<br/>\n&gt; &gt;<br/>\n&gt; &gt; It&#39;s not pretty. We talk so much about freedoms, do we help people<br/>\n&gt; &gt; understand how unschoolers respectfully say &quot;knock it off&quot; or &quot;that<br/>\n&gt; &gt; isn&#39;t cool&quot; or &quot;I&#39;m not ok with this&quot;? I think that part can get<br/>\n&gt; &gt; missed at these lists. How do you respect the individual AND other<br/>\n&gt; &gt; people&#39;s (including your own) personal boundaries?<br/>\n&gt; &gt;<br/>\n&gt; &gt; How can unschooling get screwed up?<br/>\n&gt; &gt; How can we create conditions for it to flourish and what kind of<br/>\n&gt; &gt; behaviors/activities inhibit joyful unschooling?<br/>\n&gt; &gt;<br/>\n&gt; &gt; Ren<br/>\n&gt; &gt; learninginfreedom.com<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How to screw up unschooling","postDate":"1214333238","msgId":33996,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGczcmZmbSsxdHRmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGczcjFuaytzc2RnQGVHcm91cHMuY29tPg=="},"prevInTopic":33992,"nextInTopic":34000,"prevInTime":33995,"nextInTime":33997,"topicId":33982,"numMessagesInTopic":0,"msgSnippet":"... I don t have a problem with being blunt about such things with my kids. Being blunt doesn t mean being mean or punitive.  It s just simple and straight to","messageBody":"<div id=\"ygrps-yiv-363930091\"><blockquote><span title=\"ireply\">&gt; How do unschoolers respectfully say &quot;stop it&quot; or &quot;knock it off, so<br/>\n&gt; and so&#39;s not o.k. with that&quot;? This is where we seem to have conflict<br/>\n&gt; with my 6 year old.<br/>\n<br/>\n&gt; We are respectful in the beginning and say &quot;hey bud, so and so&#39;s not<br/>\n&gt; o.k. with that, please stop&quot; and sometimes he does and sometimes he<br/>\n&gt; doesn&#39;t. Sometimes we suggest an alternative of what he was doing,<br/>\n&gt; to do it on something else or somewhere else and sometimes this works<br/>\n&gt; and sometimes it doesn&#39;t. Sometimes we try to suggest another game<br/>\n&gt; and that works sometimes and sometimes not.<br/>\n<br/>\n<br/>\n </span></blockquote>I don&#39;t have a problem with being blunt about such things with my kids. <br/>\nBeing blunt doesn&#39;t mean being mean or punitive.  It&#39;s just simple and<br/>\nstraight to the point.  Saying to a child that is clearly not respecting<br/>\nanother&#39;s personal boundaries, &quot;knock it off&quot; seems appropriate to me,<br/>\nand perhaps futher saying, &quot;so and so, is clearly not liking that&quot;. <br/>\nOffering alternatives is good, redirecting energy is good, asking nice<br/>\nfirst is good.<br/>\n<br/>\nPerhaps some have kids that may be too sensitive to that, but clear<br/>\nhonest direction has always seemed best for my kids.  I think a lot of<br/>\n5, 6, and 7 yr olds are really just getting clued into all those social<br/>\nnuances and personal boundaries, most learn how to do better sooner than<br/>\nlater, much through trial and error.  Even totally schooled and<br/>\ntraditionally parented kids figure out how to be a little better, even<br/>\nthough other issues surface that unschoolers get to avoid by going one<br/>\nstep further.</div>","specialLinks":[]},{"userId":220041937,"authorName":"hbmccarty","from":"hbmccarty &lt;hbmccarty@...&gt;","profile":"heathermccarty1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] How to screw up unschooling","postDate":"1214321857","msgId":33992,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4NjExNEMxLjcwMzA1MDNAdHdjbnkucnIuY29tPg==","inReplyToHeader":"PGczcXBhOStxczFlQGVHcm91cHMuY29tPg==","referencesHeader":"PGczcXBhOStxczFlQGVHcm91cHMuY29tPg=="},"prevInTopic":33990,"nextInTopic":33996,"prevInTime":33991,"nextInTime":33993,"topicId":33982,"numMessagesInTopic":0,"msgSnippet":"I ve seen people screw up unschooling by: Judging their kids choice of activities instead of spending time with them and actually seeing what they are doing","messageBody":"<div id=\"ygrps-yiv-1778112286\">I&#39;ve seen people screw up unschooling by:<br/>\n<br/>\nJudging their kids&#39; choice of activities instead of spending time with <br/>\nthem and actually seeing what they are doing and learning.<br/>\n<br/>\nNot supporting their kids interests fully.<br/>\n<br/>\nForgetting to enjoy their kids and life in general.<br/>\n<br/>\nTaking state reporting requirements way too seriously!<br/>\n<br/>\nHeather</div>","specialLinks":[]},{"userId":345152630,"authorName":"Julie v.","from":"&quot;Julie v.&quot; &lt;thewekkenfam@...&gt;","profile":"vegfam3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How to screw up unschooling","postDate":"1214319156","msgId":33990,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGczcjFuaytzc2RnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGczcXBhOStxczFlQGVHcm91cHMuY29tPg=="},"prevInTopic":33986,"nextInTopic":33992,"prevInTime":33989,"nextInTime":33991,"topicId":33982,"numMessagesInTopic":0,"msgSnippet":"Ren, How do unschoolers respectfully say stop it or knock it off, so and so s not o.k. with that ?  This is where we seem to have conflict with my 6 year","messageBody":"<div id=\"ygrps-yiv-537984916\">Ren,<br/>\n<br/>\nHow do unschoolers respectfully say &quot;stop it&quot; or &quot;knock it off, so <br/>\nand so&#39;s not o.k. with that&quot;?  This is where we seem to have conflict <br/>\nwith my 6 year old.  My husband and I seem to revert back to <br/>\nmainstream parenting when these types of situations come along and <br/>\nour son resents being told what to do and will either just continue <br/>\nuntil my husband or I feel like we have to step in physically and <br/>\nremove him or take said toy away because he&#39;s hitting someone with <br/>\nit.  We all feel awful after a situation like this, but don&#39;t feel <br/>\nlike there is an alternative.  Any suggestions?  This doesn&#39;t happen <br/>\noften, but when it does it feels like we are damaging our <br/>\nrelationship because everyone gets so upset and my son gets so angry <br/>\nat us for stopping him.  Truly the only time we physically stop him <br/>\nor take a toy away is when he&#39;s hurting another child.<br/>\n<br/>\nWe are respectful in the beginning and say &quot;hey bud, so and so&#39;s not <br/>\no.k. with that, please stop&quot; and sometimes he does and sometimes he <br/>\ndoesn&#39;t.  Sometimes we suggest an alternative of what he was doing, <br/>\nto do it on something else or somewhere else and sometimes this works <br/>\nand sometimes it doesn&#39;t.  Sometimes we try to suggest another game <br/>\nand that works sometimes and sometimes not.  <br/>\n<br/>\nI guess my question is all on how we word things, which may not seem <br/>\nlike a big deal, but I can tell that my son responds very well when <br/>\nhis needs and wants are being listened to and respected along with <br/>\nthe child he is hitting.  It&#39;s just hard for me to be respectful when <br/>\nhe&#39;s hitting a child with an object and he thinks it&#39;s funny & a game <br/>\nand the other child is wanting him to stop.  I usually just blurt <br/>\nout &quot;hey stop bud, so and so&#39;s not liking that game&quot;, which doesn&#39;t <br/>\nseem to help either.<br/>\n<br/>\nAny suggestions?<br/>\n<br/>\nThanks<br/>\nJulie v.  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lerendzonderschool.blogspot.com/\">http://www.lerendzonderschool.blogspot.com/</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Ren Allen&quot; <br/>\n&lt;starsuncloud@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; I started to think about it and one of the topics that came to mind <br/>\n </span></blockquote>is<br/>\n<blockquote><span title=\"ireply\"> &gt; the whole &quot;unparenting&quot; issue. That word is used as a slam against<br/>\n&gt; those of us that believe strongly in freedom and respect for <br/>\n </span></blockquote>children.<br/>\n<blockquote><span title=\"ireply\"> &gt; But I&#39;ve actually witnessed true &quot;unparenting&quot; in the form of <br/>\n </span></blockquote>neglect<br/>\n<blockquote><span title=\"qreply\"> &gt; from some that choose unschooling.<br/>\n&gt; <br/>\n&gt; It&#39;s not pretty. We talk so much about freedoms, do we help people<br/>\n&gt; understand how unschoolers respectfully say &quot;knock it off&quot; or &quot;that<br/>\n&gt; isn&#39;t cool&quot; or &quot;I&#39;m not ok with this&quot;? I think that part can get<br/>\n&gt; missed at these lists. How do you respect the individual AND other<br/>\n&gt; people&#39;s (including your own) personal boundaries?<br/>\n&gt; <br/>\n&gt; How can unschooling get screwed up?<br/>\n&gt; How can we create conditions for it to flourish and what kind of<br/>\n&gt; behaviors/activities inhibit joyful unschooling?<br/>\n&gt; <br/>\n&gt; Ren<br/>\n&gt; learninginfreedom.com<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":49412617,"authorName":"Coyote","from":"&quot;Coyote&quot; &lt;janis@...&gt;","profile":"janacoyote","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] How to screw up unschooling","postDate":"1214313007","msgId":34000,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxOTQwMWM4ZDVmYiRhMDBhMzQzMCRjYTAxYThjMEBDb3lvdGU+","referencesHeader":"PGczcXBhOStxczFlQGVHcm91cHMuY29tPg=="},"prevInTopic":33996,"nextInTopic":34013,"prevInTime":33999,"nextInTime":34001,"topicId":33982,"numMessagesInTopic":0,"msgSnippet":"Good Morning, When we first heard of unschooling, the unparenting part was a big worry. I believe there are things that a child must know. How to cross the","messageBody":"<div id=\"ygrps-yiv-1017651541\">Good Morning,<br/>\nWhen we first heard of unschooling, the &#39;unparenting&#39; part was a big worry. I believe there are things that a child must know. How to cross the street. How to answer, or not answer the door, how to answer the phone, how to be courteous to others, how to respect others space, property and time. I have spoken to parents that think that unschooling, hence unparenting means letting the kids smoke pot, steal, hit each other....because they want to.<br/>\nTo me, unschooling has boundaries. Brianna can&#39;t run into the freeway, for example. She can&#39;t walk outside naked, she can&#39;t steal, she has to be responsible for managing her own money, she has to be responsible for her safety when she is out alone or with friends. <br/>\nThere are many things that our kids need to know. Practical day - to - day stuff. We would be highly remiss in not teaching them these things.<br/>\nDo we not tell them not to take a bath with a radio?<br/>\nDo we not stop them from driving a car with out the proper knowledge & practice?<br/>\nUnschooling doesn&#39;t mean not parenting. I think it means parenting with common sense and a sense of enabling our kids to adapt and survive in a horribly changing world.<br/>\nJanis<br/>\nEast Providence, RI<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nCoyotes Corner<br/>\nwww.coyotescorner.com<br/>\n401-438-7678<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Ren Allen <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Tuesday, June 24, 2008 8:28 AM<br/>\n  Subject: [unschoolingbasics] How to screw up unschooling<br/>\n<br/>\n<br/>\n  Over at Always Learning there is a really interesting thread going<br/>\n  right now. It&#39;s titled &quot;How to screw up unschooling&quot; and people are<br/>\n  listing things that can hinder unschooling.<br/>\n<br/>\n  ~Buy only &quot;educational&quot; materials<br/>\n  and<br/>\n  ~Don&#39;t change plans midstream <br/>\n  are a couple examples.<br/>\n<br/>\n  I started to think about it and one of the topics that came to mind is<br/>\n  the whole &quot;unparenting&quot; issue. That word is used as a slam against<br/>\n  those of us that believe strongly in freedom and respect for children.<br/>\n  But I&#39;ve actually witnessed true &quot;unparenting&quot; in the form of neglect<br/>\n  from some that choose unschooling.<br/>\n<br/>\n  It&#39;s not pretty. We talk so much about freedoms, do we help people<br/>\n  understand how unschoolers respectfully say &quot;knock it off&quot; or &quot;that<br/>\n  isn&#39;t cool&quot; or &quot;I&#39;m not ok with this&quot;? I think that part can get<br/>\n  missed at these lists. How do you respect the individual AND other<br/>\n  people&#39;s (including your own) personal boundaries?<br/>\n<br/>\n  How can unschooling get screwed up?<br/>\n  How can we create conditions for it to flourish and what kind of<br/>\n  behaviors/activities inhibit joyful unschooling?<br/>\n<br/>\n  Ren<br/>\n  learninginfreedom.com<br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":193064123,"authorName":"Nance Confer","from":"&quot;Nance Confer&quot; &lt;marbleface@...&gt;","profile":"nanceconfer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"How to screw up unschooling","postDate":"1214312634","msgId":33986,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDgwMWM4ZDVmYSRjMjZjMGFlMCQ2NDAyYThjMEB5b3VydzA0Z3R4bGQ2Nz4="},"prevInTopic":33982,"nextInTopic":33990,"prevInTime":33985,"nextInTime":33987,"topicId":33982,"numMessagesInTopic":0,"msgSnippet":"Good questions. Sometimes when I read a comment here, I think of our 2-yo nephew. He has the benefit of visiting our unschooled home about 2 days a week. And","messageBody":"<div id=\"ygrps-yiv-303146523\">Good questions. <br/>\n<br/>\nSometimes when I read a comment here, I think of our 2-yo nephew. He has the &quot;benefit&quot; of visiting our unschooled home about 2 days a week. And he is 2 and walking and running and climbing, on us and everything else. <br/>\n<br/>\nSo there are a lot of opportunities to experiment with limits. <br/>\n<br/>\nExample:<br/>\n<br/>\nYes, he is allowed to climb all over me and anyone else who is willing to be climbed on. No, he is not allowed to pull our hair to hoist himself. <br/>\n<br/>\nHe hears &quot;yes&quot; most of the time and a consistent, firm, uncurling fingers from hair &quot;no&quot; as needed.<br/>\n<br/>\nYes, we could all shave our heads. But we&#39;re not going to do that. :)<br/>\n<br/>\nHe is living in a real family with real things to explore and real limits. More of the former than the latter.<br/>\n<br/>\nThen he goes back to his home where he lives with his Mom and Grammy. Grammy is a ps teacher. Grammy has a much more decorated and formal house than we do. So he&#39;s probably getting a lot of confusing messages about furniture. But what I&#39;ve seen is that he gets the same sort of gentle, loving, encouraging response from them as he gets from us. So that&#39;s a good thing, I think. <br/>\n<br/>\nNo solid point here. I just think of Dear Nephew many times when I read this list. I don&#39;t think he&#39;s been scewed up by our unschooling lifestyle or that we have failed to unschool correctly. I do think he gets a lot of different inputs. <br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nIt&#39;s not pretty. We talk so much about freedoms, do we help people<br/>\nunderstand how unschoolers respectfully say &quot;knock it off&quot; or &quot;that<br/>\nisn&#39;t cool&quot; or &quot;I&#39;m not ok with this&quot;? I think that part can get<br/>\nmissed at these lists. How do you respect the individual AND other<br/>\npeople&#39;s (including your own) personal boundaries?<br/>\n<br/>\nHow can unschooling get screwed up?<br/>\nHow can we create conditions for it to flourish and what kind of<br/>\nbehaviors/activities inhibit joyful unschooling?<br/>\n<br/>\nRen<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"How to screw up unschooling","postDate":"1214310537","msgId":33982,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGczcXBhOStxczFlQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":33986,"prevInTime":33981,"nextInTime":33983,"topicId":33982,"numMessagesInTopic":0,"msgSnippet":"Over at Always Learning there is a really interesting thread going right now. It s titled How to screw up unschooling and people are listing things that can","messageBody":"<div id=\"ygrps-yiv-67985861\">Over at Always Learning there is a really interesting thread going<br/>\nright now. It&#39;s titled &quot;How to screw up unschooling&quot; and people are<br/>\nlisting things that can hinder unschooling.<br/>\n<br/>\n~Buy only &quot;educational&quot; materials<br/>\n and<br/>\n~Don&#39;t change plans midstream <br/>\nare a couple examples.<br/>\n<br/>\nI started to think about it and one of the topics that came to mind is<br/>\nthe whole &quot;unparenting&quot; issue. That word is used as a slam against<br/>\nthose of us that believe strongly in freedom and respect for children.<br/>\nBut I&#39;ve actually witnessed true &quot;unparenting&quot; in the form of neglect<br/>\nfrom some that choose unschooling.<br/>\n<br/>\nIt&#39;s not pretty. We talk so much about freedoms, do we help people<br/>\nunderstand how unschoolers respectfully say &quot;knock it off&quot; or &quot;that<br/>\nisn&#39;t cool&quot; or &quot;I&#39;m not ok with this&quot;? I think that part can get<br/>\nmissed at these lists. How do you respect the individual AND other<br/>\npeople&#39;s (including your own) personal boundaries?<br/>\n<br/>\nHow can unschooling get screwed up?<br/>\nHow can we create conditions for it to flourish and what kind of<br/>\nbehaviors/activities inhibit joyful unschooling?<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]}],"prevTopicId":34021,"nextTopicId":34059}}