{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":279433414,"authorName":"lelania1","from":"&quot;lelania1&quot; &lt;ckmidwife@...&gt;","profile":"lelania1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Any ideas for SAHM/Unschooling moms to save $$ on...","postDate":"1167586559","msgId":20154,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVuOHNlMCtvbnZwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVuN2xrYyt0dnQ5QGVHcm91cHMuY29tPg=="},"prevInTopic":20150,"nextInTopic":0,"prevInTime":20153,"nextInTime":20155,"topicId":20116,"numMessagesInTopic":0,"msgSnippet":"... lemon juice : P.  I ve never heard of this. I just add 2 tbspns of lemon juice to the crock pot of water and soaking beans, then rinse them a few times","messageBody":"<div id=\"ygrps-yiv-1406007961\"><blockquote><span title=\"ireply\">&gt;&gt; How?  : )  Do you make a lemon juice/water mixture or straight <br/>\n </span></blockquote>lemon juice : P.  I&#39;ve never heard of this.&gt;&gt;&gt;<br/>\n<br/>\nI just add 2 tbspns of lemon juice to the crock pot of water and <br/>\nsoaking beans, then rinse them a few times and refill (with plain <br/>\nwater)during the day or so of soaking. Sometimes I forget to change <br/>\nthe water during soaking and they still come out fine. Of course, use <br/>\nfresh water or broth to cook them in after soaking.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; my sister and I decided it wasn&#39;t worth it to have to put up with <br/>\n&gt; her.  <br/>\n<br/>\n </span></blockquote>WIC can be a hassle for sure. I think that if you aren&#39;t truly <br/>\nstruggling financially then it probably will seem like too much work. <br/>\nBut the food amounts to roughly $100/month for two children, and when <br/>\nI was pregnant and nursing even more. That is substantial for a lot <br/>\nof us struggling to provide healthy diets. I think that combined with <br/>\na lot of the other strategies people outlined it can be a huge assett <br/>\nto many lower and middle income families especially ones whose <br/>\nfinances cause a painful stretching of money toward the end of the <br/>\nmonth, or even unexpected lapses in food money for a week or two. <br/>\nThere were times in my pregnancy with my second that WIC food was the <br/>\nonly food I had to eat for several days or at one time two weeks <br/>\nbecause of wait times being paid for jobs and so forth. <br/>\nOne of the ways we have used the benefits to help, is that in reality <br/>\ndh eats pretty basic conventional food. He likes breakfast cereal, <br/>\ndrinks milk, canned juice, peanut butter, eggs and cheese. So when we <br/>\ndidn&#39;t need the food in the house, these foods went to work with him. <br/>\nThe money we saved in his food while away from home went into the <br/>\nkids higher quality food. Smaller bodies need more careful <br/>\nconsiderations to hormones and such. Obviously we would have <br/>\npreferred everyone have an organic diet, but in the hierarchy of need <br/>\nhe was more than willing to eat conventional eggs so the kids could <br/>\nhave hormone free ones. <br/>\nThe idea behind the program is to allow families to spend more of <br/>\ntheir food budget on produce and other nutritious foods by giving <br/>\naway higher priced staples that are normally thrown away when <br/>\noverproduced. Any way you accomplish that goal by putting the food to <br/>\nuse makes sense to me ethically.<br/>\nI make quiche with WIC food and that uses up a lot of the milk eggs <br/>\nand cheese plus organic veggies, split pea soup with the bean <br/>\nalottment and when I was getting them, the carrotts, and we buy the <br/>\nfrozen juice concentrate to use as a sweetner for desserts and breads <br/>\nwhich is a healthy alternative to sugar. I also get the orange- <br/>\npineapple which my kids love and we try and save it for high vit-c <br/>\nneeds.  I have found a store that lets me use WIC checks for a brand <br/>\nof local milk that doesn&#39;t use hormones, and we buy Cabot cheese with <br/>\nWIC. I feel similarly about the hormone issue, but have found a place <br/>\nfor WIC in my own life that is balanced. If it allows me to keep my <br/>\nkids home more, their diet is most definately going to be better than <br/>\nif they spent their days in an institutional setting. I&#39;m not <br/>\nsweating that the cheerios and instant oatmeal aren&#39;t organic. Using <br/>\nWIC allows me to buy 80% of our total diet organically.<br/>\n<br/>\nWith WIC and other kinds of social services, it helps to believe you <br/>\nand your kids deserve this. The jobs involved in administering social <br/>\nservices whether they are veterans benefits, disability benefits, <br/>\nchidcare subsidies or WIC basically suck. They are low paying, many <br/>\nemployees also receive these benefits due to their low wages, provide <br/>\nlittle chance for education or advancement and involve a high level <br/>\nof personal interaction with clients who can be irritable, nasty and <br/>\nsometimes violent. I try and cut them as much slack as possible <br/>\nbecause I worked their side of the table many years ago. You have <br/>\nrights. You can report nasty or abusive behavior. I they threaten you <br/>\nor are rude ask for their supervisors information. You do not have to <br/>\nhave them do the physical assessment. My family doc faxes them a form <br/>\ntwice a year saying all is well. The form is blue and is a medical <br/>\nverification form. All WIC offices take it. Most docs who are <br/>\nsupportive of us non-vaxing types are more than happy to fax a form <br/>\nso your kid can get WIC. I have been &quot;forgetting&quot; to bring my vax <br/>\nrecords for four years. It hasn&#39;t been a problem. Once, when we <br/>\ncouldn&#39;t get the form faxed, I gave alistair a choice and he said he <br/>\ndidn&#39;t want the finger stick. I told the woman &quot;we both know it isn&#39;t <br/>\nnecessary, but if you need to withold food from him, which is more <br/>\nlikely to cause him anemia, then I understand that&#39;s what you have to <br/>\ndo, but I won&#39;t restrain him for this test.&quot; and she agreed it was <br/>\nstupid and gave him the checks anyway. I was polite and friendly. <br/>\nownership doesn&#39;t mean being nasty or egotistical, just clear that <br/>\nyou qualify for the benefit and your kids deserve their share. <br/>\nRealistically, it takes me about 4 hours a year to get $1200 worth of <br/>\nfood. That&#39;s $300/hr and well worth the time to me!<br/>\ncoming soon, my zine all about wic...<br/>\ncarrie</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Any ideas for SAHM/Unschooling moms to save $$ on...","postDate":"1167572771","msgId":20144,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYxMjMxMTM0NjEyLjg2MTgucW1haWxAd2ViNTM4MDMubWFpbC55YWhvby5jb20+","inReplyToHeader":"PDAwMTEwMWM3MmM5MyRkMGI4MWM5MCQzNzAwYThjMEBLaW1iYWxsRmFtaWx5Pg=="},"prevInTopic":20143,"nextInTopic":20150,"prevInTime":20143,"nextInTime":20145,"topicId":20116,"numMessagesInTopic":0,"msgSnippet":"I ve enjoyed the ideas for saving grocery money -- one of my goals in the coming year is to bring our grocery bill down, while also going organic and homemade,","messageBody":"<div id=\"ygrps-yiv-1943344977\">I&#39;ve enjoyed the ideas for saving grocery money -- one of my goals in the coming year is to bring our grocery bill down, while also going organic and homemade, so we don&#39;t sacrifice health for cost.  I&#39;m glad this topic came up when it did.<br/>\n   <br/>\n  *****<br/>\n   <br/>\n  I also wanted to mention WIC, Women Infants and Children. This is available to families who earn middle class incomes as well, depending on family size and covers pregnant and nursing mothers and children under five....... It can be a hassle to get it set up, but you only have to go back with the kids twice a year. I find it makes a big difference and allows me to put more money toward produce my kids will eat. <br/>\n   <br/>\n  *****<br/>\n   <br/>\n  In my experience, WIC can be an even bigger hassle to keep up.  In theory, you only have to go twice a year -- unless your breastfeeding 18 mo tests &#39;low&#39; for iron.  Then you have to go more often and be subjected to continued &quot;suggestions&quot; (in the form of threatening insistence) that you try iron supplements (totally unnecessary for a healthy breastfed toddler).  And those check-up visits involve heel-stabs to take iron levels in your under five-yo kids. For me, the intrusion and complete disregard for Dan&#39;s right to his own bodily integrity were too high a price for generic, chemical-laden grocery store foods. <br/>\n   <br/>\n  Sylvia<br/>\n   <br/>\n<br/>\n __________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":216914372,"authorName":"riasplace3","from":"&quot;riasplace3&quot; &lt;riasplace3@...&gt;","profile":"riasplace3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Any ideas for SAHM/Unschooling moms to save $$ on...","postDate":"1167546828","msgId":20150,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVuN2xrYyt0dnQ5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMTEwMWM3MmM5MyRkMGI4MWM5MCQzNzAwYThjMEBLaW1iYWxsRmFtaWx5Pg=="},"prevInTopic":20144,"nextInTopic":20154,"prevInTime":20149,"nextInTime":20151,"topicId":20116,"numMessagesInTopic":0,"msgSnippet":"... How?  : )  Do you make a lemon juice/water mixture or straight lemon juice : P.  I ve never heard of this. ... We don t get coupons with WIC here... : (","messageBody":"<div id=\"ygrps-yiv-225661235\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Carrie Kimball&quot; <br/>\n&lt;ckmidwife@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;If you buy dry beans which is super cheap, soak them with some <br/>\n&gt;&gt;lemon juice <br/>\n<br/>\n </span></blockquote>How?  : )  Do you make a lemon juice/water mixture or straight lemon <br/>\njuice : P.  I&#39;ve never heard of this.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I also wanted to mention WIC, Women Infants and Children. This is <br/>\n&gt;available to families who earn middle class incomes as well, <br/>\n&gt;depending on family size and covers pregnant and nursing mothers and <br/>\n&gt;children under five. It provides breakfast cereal, juice, milk, <br/>\n&gt;cheese, eggs, beans or peanut butter and the best part- farmers <br/>\n&gt;&gt;market coupons june through october.<br/>\n<br/>\n </span></blockquote>We don&#39;t get coupons with WIC here... : (  that sounds wonderful. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;  It can be a hassle to get it set up, but you only have to go back <br/>\n&gt;&gt;with the kids twice a year. <br/>\n<br/>\n </span></blockquote>That might be different in different states.  It&#39;s been so long since <br/>\nmine were young enough for it, I&#39;ve forgotten, but it seemed like <br/>\nmore than 2x&#39;s a year.  Here, though, there was the MOST dreadful <br/>\nwoman working there, (She might have made it seem like more) and both <br/>\nmy sister and I decided it wasn&#39;t worth it to have to put up with <br/>\nher.  My sister has two still under 5, and just couldn&#39;t take her <br/>\nanymore...always asking if you&#39;ve been in the program in the last six <br/>\nmonths, with your file right there in front of her...and my sister <br/>\nwas with the program for most of 14 years!  I would go into more <br/>\ndetail, but someone might recognize the profile and know who I&#39;m <br/>\ntalking about, and be related....so I&#39;m not going there. : )  Suffice <br/>\nit to say, she was awful.  :)<br/>\nDidn&#39;t I just drift off topic?<br/>\nlol<br/>\nRia</div>","specialLinks":[]},{"userId":279433414,"authorName":"Carrie Kimball","from":"&quot;Carrie Kimball&quot; &lt;ckmidwife@...&gt;","profile":"lelania1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Any ideas for SAHM/Unschooling moms to save $$ on...","postDate":"1167539174","msgId":20143,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTEwMWM3MmM5MyRkMGI4MWM5MCQzNzAwYThjMEBLaW1iYWxsRmFtaWx5Pg=="},"prevInTopic":20125,"nextInTopic":20144,"prevInTime":20142,"nextInTime":20144,"topicId":20116,"numMessagesInTopic":0,"msgSnippet":"I have found that the bean-a-day strategy was helpful with this. Get a large crockpot, either at a yard sale or thrift shop (or request one as a gift), and","messageBody":"<div id=\"ygrps-yiv-884537891\">I have found that the bean-a-day strategy was helpful with this. Get a large crockpot, either at a yard sale or thrift shop (or request one as a gift), and make a daily habit of making beans and greens. If you buy dry beans which is super cheap, soak them with some lemon juice or whey until they just sprout- at least 24 hours, they will be more easily digested and assimilated and also more nutritious. Crockpot soaked beans with broth (homeade broth is easily and cheaply made from edges, peelings and other food parts you don&#39;t normally eat- just designate a container for collecting broth additions in the fridge) and food processor greens and herbs of various types(kids don&#39;t notice them at all this way) overnight and the next day you have a bean dish people can snack on, pack up and take along or what have you. You can puree leftovers into bean dip to serve with chips or roll into burritos.<br/>\nI also recommend a rice (or grain) cooker. Get to know Amaranth, quinoa, millett and buckwheat as well as rice, and make a habit of keeping a big cooked pot of these around for reheating beans with and so forth. Quinoa is high in protein, and several of the above listed grains are actually seeds, and not technically grains.<br/>\nWe don&#39;t do dry cereal for breakfast- too expensive. We make hot cereal porrdiges in the mornings, or cold ones by mixing up homeade granola or muesli and then soaking it overnight. We keep yogurt around for snacking- add seeds, fruit, nuts, maple syrup etc.. or use as sour cream in burritos and such. We drink water, rarely juice and when we do we dilute it a lot. Herb teas- especially fruit ones- work as well and are cheaper. <br/>\nI also use the muffin trick. We use half almond flour so they have more bang for the buck, and mini muffin tins to encourage folks to wait and see how big a snack they really need. These prep fast, cook fast and keep well in the freezer even. Grate zucchini and carrot into them for more veggies.<br/>\nWe do some shopping at trader joes, some at whole foods, but most through a bulk buying food co-op. Most communities have one, and you can save a lot by buying in bulk and through co-op&#39;s. <br/>\n<br/>\nI also wanted to mention WIC, Women Infants and Children. This is available to families who earn middle class incomes as well, depending on family size and covers pregnant and nursing mothers and children under five. It provides breakfast cereal, juice, milk, cheese, eggs, beans or peanut butter and the best part- farmers market coupons june through october. The food in the program is donated by coporate america, and is food that otherwise gets thrown away when not purchased- that&#39;s why the selections are so specific. But we get cheerios (63 oz), RgBH free milk (6 gallons) and cheese (8 pounds), commercial eggs (I make into quiche and use in muffins)(3 doz) beans (2 pounds), juice (8 cans of frozen concentrate or shelf stable) and about 10 bucks a week for produce at the farmers market in the season. This is for two kids. It can be a hassle to get it set up, but you only have to go back with the kids twice a year. I find it makes a big difference and allows me to put more money toward produce my kids will eat. I have a friend whose family income is in the 40&#39;s and they qualify, so check it out. I think a lot of families assume they won&#39;t qualify when they do.<br/>\nHTH,<br/>\nCarrie<br/>\nAlistair 11/02<br/>\nGaelin 12/04<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193844353,"authorName":"Nicole Willoughby","from":"Nicole Willoughby &lt;cncnawilloughby@...&gt;","profile":"cncnawilloughby","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Any ideas for SAHM/Unschooling moms to save $$ on...","postDate":"1167504010","msgId":20125,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYxMjMwMTg0MDEwLjI1Nzg1LnFtYWlsQHdlYjMxOTA2Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGVuNjZqcSs2ZXZoQGVHcm91cHMuY29tPg=="},"prevInTopic":20122,"nextInTopic":20143,"prevInTime":20124,"nextInTime":20126,"topicId":20116,"numMessagesInTopic":0,"msgSnippet":"I have a question sorta on this topic..... I have bar castile soap ( small bar. ) that Id like to make into liquid soap. Is this doable? How do I do it and how","messageBody":"<div id=\"ygrps-yiv-1219471895\">I have a question sorta on this topic.....<br/>\n   <br/>\n  I have bar castile soap ( small bar. ) that Id like to make into liquid soap. Is this doable? How do I do it and how much water would I use? <br/>\n   <br/>\n  Thanks,<br/>\n   <br/>\n  Nicole <br/>\n<br/>\n __________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141440271,"authorName":"drusila00","from":"&quot;drusila00&quot; &lt;drusila00@...&gt;","profile":"drusila00","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Any ideas for SAHM/Unschooling moms to save $$ on...","postDate":"1167498682","msgId":20122,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVuNjZqcSs2ZXZoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDOEZBM0NFQkQyOENFQi1CODgtOTk2N0B3ZWJtYWlsLWRhMDcuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":20120,"nextInTopic":20125,"prevInTime":20121,"nextInTime":20123,"topicId":20116,"numMessagesInTopic":0,"msgSnippet":"Saving money links-- I use coupons and take advantage of price matching stores. Some stores offer double coupons (which means they double the ammount of your","messageBody":"<div id=\"ygrps-yiv-405658715\">Saving money links--<br/>\n I use coupons and take advantage of price matching stores.<br/>\nSome stores offer double coupons (which means they double the <br/>\nammount of your coupon)<br/>\n<br/>\n<br/>\nI get ton s of freebies from the internet- plenty of hygene freebies <br/>\nto be had, as well as other things too.<br/>\n<br/>\nI do test drives for extra money, sometimes dealerships will have <br/>\npromos where if you go in and test drive a car they will give you an <br/>\nAMX gift card worth 25-100.00 (watch for those!)<br/>\n<br/>\nWinning internet contests is nice too.<br/>\nRemember to always look for rebates- use them to save $$.<br/>\nBuy1 Get1 sales are great- especialy combined with coupons!<br/>\n<br/>\n<br/>\nHere are my best links- Enjoy.<br/>\n<br/>\nfor freebies:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.freesamplesite.com/\">http://www.freesamplesite.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://walmart.triaddigital.com/Free-Samples.aspx?fromPageCatId=11\">http://walmart.triaddigital.com/Free-Samples.aspx?fromPageCatId=11</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.thefunplace.com/forums/forumdisplay.php?s=&forumid=25\">http://www.thefunplace.com/forums/forumdisplay.php?s=&forumid=25</a><br/>\n<br/>\nFind grocery deals without using the newspaper:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sundaysaver.com/\">http://www.sundaysaver.com/</a><br/>\n<br/>\nCoupons, buy them or print them:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.couponsandforms.com/\">http://www.couponsandforms.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.thecouponclippers.com/\">http://www.thecouponclippers.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.wow-coupons.com/\">http://www.wow-coupons.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.refundcents.com/\">http://www.refundcents.com/</a><br/>\n<br/>\nDiscounts on eating out:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.restaurant.com/\">http://www.restaurant.com/</a><br/>\nthis is their current deal:<br/>\nCelebrate the new year by dining out and save. Right now $25 Dining <br/>\nCertificates are as low as $3, after the 70% off additional savings. <br/>\n<br/>\nTo take advantage of the instant 70% off savings, just enter <br/>\ndiscount code CHEERS and hit &quot;recalculate total&quot; during the purchase <br/>\nprocess.<br/>\n<br/>\n<br/>\n<br/>\nAlso moneysavers---<br/>\nCook at home without &quot;insant/easy&quot; stuff. Crock pot meals, soups, <br/>\nbeans and rice, store brands instead of name brands, reuse & <br/>\nrecycle. (freecycle.org IS amazing!)<br/>\n<br/>\nif you do not have a low flush toilet make one by placing 2 bricks <br/>\ninto the tank of your toilet- it displaces water.<br/>\n<br/>\nkeep the heat and AC off as long as possible then as low as possible-<br/>\n Use the budget plans&#39; for power companies to keep your bill from <br/>\nfluctuating.  <br/>\n<br/>\nShop at thrift shops. I love the thrifts!</div>","specialLinks":[]},{"userId":184232345,"authorName":"CherylWarnke@AOL.com","from":"CherylWarnke@...","profile":"cherylwarnke","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Re: Any ideas for SAHM/Unschooling moms to save $$ on...","postDate":"1167491920","msgId":20120,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOEZBM0NFQkQyOENFQi1CODgtOTk2N0B3ZWJtYWlsLWRhMDcuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PGMzZC5jODhhMmEwLjMyYzcwOTljQGFvbC5jb20+","referencesHeader":"PGMzZC5jODhhMmEwLjMyYzcwOTljQGFvbC5jb20+"},"prevInTopic":20116,"nextInTopic":20122,"prevInTime":20119,"nextInTime":20121,"topicId":20116,"numMessagesInTopic":0,"msgSnippet":"And, don t forget www.craigslist.com ... From: singdoula@aol.com To: unschoolingbasics@yahoogroups.com Sent: Fri, 29 Dec 2006 7:15 PM Subject: Re:","messageBody":"<div id=\"ygrps-yiv-729681822\">And, don&#39;t forget www.craigslist.com<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n-----Original Message-----<br/>\nFrom: singdoula@...<br/>\nTo: unschoolingbasics@yahoogroups.com<br/>\nSent: Fri, 29 Dec 2006 7:15 PM<br/>\nSubject: Re: [unschoolingbasics] Re: Any ideas for SAHM/Unschooling moms to save $$ on...<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI have 2 flexible part-time jobs and am a single unschooling mother of three <br/>\nchildren, 4 dogs, 3 cats and 2 ponies. We have to find LOTS of ways to save. <br/>\nThrift stores are a biggie, and of course all the things everyone has <br/>\nalready mentioned like bulk shopping, growing a garden, cooking our own food, <br/>\netc...but the biggest two things that have helped us TREMENDOUSLY with our budget <br/>\nare selling odds and ends on eBay (there is almost NO HOME in the United <br/>\nStates, that doesn&#39;t have something they can sell on eBay! SERIOUSLY, even your <br/>\nhusbands old 8-track cassettes are worth something to someone, LOL) and also <br/>\nbeing members online of _www.freecycle.org_ (http://www.freecycle.org) If you <br/>\ndon&#39;t already freecycle, it is one of the most amazing changes you can make <br/>\nfor your life. You will get rid of all that extra stuff around your house <br/>\nthat nobody would ever buy on eBay and give it away to those who need it, and <br/>\nyou can post for stuff you need or wait until someone posts and save BUNDLES. <br/>\nWe know people who have received CARS, computers, dryers, refrigerators, <br/>\nwashers, dishwashers, jeans, shoes, pets, TVs on freecycle, the list goes on and <br/>\non....I received a PERFECTLY working dryer this year, picked it up the day <br/>\nsomeone was getting rid of it, plugged it in and have never once had a problem! <br/>\nThe savings on that dryer alone was 2 months of groceries for us. Freecycle <br/>\nis FREE and easy and wonderful. All you have to do is go to your local <br/>\ngroup&#39;s site and sign on!<br/>\n<br/>\nOne thing that has been really great for our unschooling is getting the <br/>\nchildren involved in selling on eBay as well as freecycling. They have really <br/>\ndeveloped wonderful entrepreneurial skills as a result, and have also learned <br/>\nthe joy of giving.<br/>\n<br/>\nAdriana <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n________________________________________________________________________<br/>\nCheck out the new AOL.  Most comprehensive set of free safety and security tools, free access to millions of high-quality videos from across the web, free AOL Mail and more.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":4560266,"authorName":"singdoula@aol.com","from":"singdoula@...","profile":"singdoula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Re: Any ideas for SAHM/Unschooling moms to save $$ on...","postDate":"1167437724","msgId":20116,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMzZC5jODhhMmEwLjMyYzcwOTljQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":20120,"prevInTime":20115,"nextInTime":20117,"topicId":20116,"numMessagesInTopic":0,"msgSnippet":"I have 2 flexible part-time jobs and am a single  unschooling mother of three children, 4 dogs, 3 cats and 2 ponies.  We have to find LOTS of ways to save. ","messageBody":"<div id=\"ygrps-yiv-250901215\">I have 2 flexible part-time jobs and am a single  unschooling mother of three <br/>\nchildren, 4 dogs, 3 cats and 2 ponies.  We have to find LOTS of ways to save. <br/>\nThrift  stores are a biggie, and of course all the things everyone has  <br/>\nalready mentioned like bulk shopping, growing a garden, cooking our  own food, <br/>\netc...but the biggest two things that have helped us  TREMENDOUSLY with our budget <br/>\nare selling odds and ends on eBay (there is  almost NO HOME in the United <br/>\nStates, that doesn&#39;t have something they can  sell on eBay! SERIOUSLY, even your <br/>\nhusbands old 8-track cassettes are  worth something to someone, LOL) and also <br/>\nbeing members online of _www.freecycle.org_ (http://www.freecycle.org)  If you <br/>\ndon&#39;t already  freecycle, it is one of the most amazing changes you can make <br/>\nfor your  life. You will get rid of all that extra stuff around your house <br/>\nthat  nobody would ever buy on eBay and give it away to those who need it, and  <br/>\nyou can post for stuff you need or wait until someone posts and save  BUNDLES. <br/>\nWe know people who have received CARS, computers, dryers,  refrigerators, <br/>\nwashers, dishwashers, jeans, shoes, pets, TVs on freecycle,  the list goes on and <br/>\non....I received a PERFECTLY working dryer this year,  picked it up the day <br/>\nsomeone was getting rid of it, plugged it in and have  never once had a problem! <br/>\nThe savings on that dryer alone was 2  months of groceries for us. Freecycle <br/>\nis FREE and easy and wonderful. All  you have to do is go to your local <br/>\ngroup&#39;s site and sign on!<br/>\n <br/>\nOne thing that has been really great for our unschooling  is getting the <br/>\nchildren involved in selling on eBay as well as  freecycling. They have really <br/>\ndeveloped wonderful entrepreneurial skills  as a result, and have also learned <br/>\nthe joy of giving.<br/>\n <br/>\nAdriana <br/>\n <br/>\n   <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":20140,"nextTopicId":20135}}