{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Still doubting ...","postDate":"1225660404","msgId":36942,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdlbDU1aytqcm5jQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdlanYzYiszZWVoQGVHcm91cHMuY29tPg=="},"prevInTopic":36940,"nextInTopic":0,"prevInTime":36941,"nextInTime":36943,"topicId":36919,"numMessagesInTopic":0,"msgSnippet":"... they ... that ... That was *my* biggest hurdle, in terms of trust, too, early in my unschooling journey. To some extent, time was the biggest help. The ","messageBody":"<div id=\"ygrps-yiv-1392644613\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;seccotine_ch&quot; <br/>\n&lt;seccotine@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I trust my kids to know what is good for them and to show me what <br/>\n </span></blockquote>they<br/>\n<blockquote><span title=\"ireply\"> &gt; need, but I find it very hard to trust myself. I have the feeling <br/>\n </span></blockquote>that<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t have what it takes to be an unschooling mom. <br/>\n<br/>\n </span></blockquote>That was *my* biggest hurdle, in terms of trust, too, early in my <br/>\nunschooling journey. To some extent, time was the biggest help. The <br/>\nmore I could see my kids growing and learning and becomming, despite <br/>\nme sometimes! the easier it was to trust that I really could be their <br/>\npartner, imperfect as I am. <br/>\n<br/>\nTo some extent, our very imperfection is one of the great gifts we <br/>\nhave to give our children - because they get to see real grown up <br/>\npeople learning through living. That&#39;s not something school can <br/>\noffer, or even &quot;do it bc I&#39;m the mom&quot; parenting. Its a plus, I <br/>\npromise!<br/>\n<br/>\nWhat does it take to be an effective unschooling parent? My list is <br/>\ndifferent from yours:<br/>\n<br/>\nBeing willing to appologise.<br/>\nBeing willing to change your mind.<br/>\n<br/>\nHaving an idea of what your principles/core values are. That&#39;s pretty <br/>\nimportant. It gives you a place to start figuring out how you want to <br/>\nact/respond - and catching yourself when you go &quot;wrong&quot; by your own <br/>\nstandards. Then, if necessary, you can appologise and change your <br/>\nmind. <br/>\n<br/>\nBeing willing to ask for input, even when you Know, by means of your <br/>\nfantastic mom-powers, what&#39;s best ;)<br/>\n<br/>\nBeing authentic. By which I mean, be yourself. Hopefully your best <br/>\nself, but if not... well, you still get to appologise and change your <br/>\nmind. Knowing your principles is a big help, here. If you know what&#39;s <br/>\nimportant to you, its easier to work towards being your best self. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; - turning a deaf ear to all the people who give me unsollicited <br/>\n </span></blockquote>advise<br/>\n<blockquote><span title=\"ireply\"> &gt; about : how to teach things to my kids, why I should put them back <br/>\n </span></blockquote>to<br/>\n<blockquote><span title=\"ireply\"> &gt; school, why HOMEschooling is so much better than UNschooling, why<br/>\n&gt; diplomas are so important in our world and so on and so forth<br/>\n<br/>\n </span></blockquote>As your trust in yourself builds, this will get easier. Have a good <br/>\nunderstanding of your principles will help, too. Something else that <br/>\nhelps is to *sound* confident when you talk about your family. Don&#39;t <br/>\nfall into the habit of venting about your kids as a way to connect <br/>\nwith others - as you can see, it leaves you feeling cruddy about <br/>\nyourself and your family. Tell happy stories. Tell funny stories only <br/>\nif they don&#39;t put anyone down. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Actually, the only person who agrees with me is my husband. <br/>\n<br/>\n </span></blockquote>Great! If you need to vent, vent to him. But also be sure to heap him <br/>\nwith love and appreciation - its sooooooo great to have a partner who <br/>\nis supportive.<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":357843301,"authorName":"lyeping2008","from":"&quot;lyeping2008&quot; &lt;lyeping2008@...&gt;","profile":"lyeping2008","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Still doubting ...To Helen Very Long.","postDate":"1225658550","msgId":36940,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdlbDNibSsyZDlwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdlanYzYiszZWVoQGVHcm91cHMuY29tPg=="},"prevInTopic":36933,"nextInTopic":36942,"prevInTime":36939,"nextInTime":36941,"topicId":36919,"numMessagesInTopic":0,"msgSnippet":"Hi Helen, You wrote :- I have the ","messageBody":"<div id=\"ygrps-yiv-483506230\">Hi Helen,<br/>\n<br/>\nYou wrote :-&gt;&gt;I have the &lt;feeling that I don&#39;t have what it takes to <br/>\nbe an &gt;&gt;unschooling mom. <br/>\n<br/>\nBear in mind my tone is coming across gentle and kind. <br/>\n<br/>\n<br/>\nWhy do you have so little faith in yourself that what you&#39;re doing <br/>\nis the best for your kids? That you&#39;ve given them a better option <br/>\nthan schooling. That your love and concern for thier well being is <br/>\nall that it needs to guide you and your kids towards a better future?<br/>\n<br/>\nUnschooling is an ongoing process. It is about living and learning <br/>\nas we go along. It doesn&#39;t have guidelines or dealines.  <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So what does it take ?  being a good listener (I could do better)<br/>\n&gt; being available for them at any time<br/>\n<br/>\n<br/>\n </span></blockquote>I don&#39;t know for I am not a very good listener, but I do pay <br/>\nattention to what my kid is doing and saying, all the time while I&#39;m <br/>\ncooking, reading or tidying my house. I don&#39;t have to sit down and <br/>\nlisten intently but I do listen to him. Like from which toy he would <br/>\nlike to what cartoon he is watching; to asking him why is he <br/>\ncrushing poor little Lego man with his Lego mail van LOL!!<br/>\n<br/>\nWell it is obvious the &quot;van&quot; is running over the Lego man, but I <br/>\nreally wanted to know why would the &quot;van&quot; run over the man so many <br/>\ntimes LOL!<br/>\n<br/>\nI asked and listen to his explanation what he&#39;s doing, where is he <br/>\ndriving his &quot;new sport car&quot; to, and what new furniture have he got <br/>\nin his house in Grand Theft Auto game.  <br/>\n<br/>\nI listen to him explaining to me what he had to do in his new Batman <br/>\nLego game, and watch him acting out the Lego Cat woman&#39;s and Poison <br/>\nIvy&#39;s mannerisms. <br/>\n<br/>\nNowadays, I&#39;m not really that focused on him. <br/>\n<br/>\nEven tho I am always at home, I&#39;m not necessary available to him all <br/>\nthe time, like now, I&#39;m typing my &quot;3 hour&quot; response to you (yeah, <br/>\nI&#39;m abit slow in typing), DS is playing at the front room on his <br/>\nown. Occasionally I&#39;ll asked what is he doing? <br/>\n<br/>\nIt&#39;s like we&#39;re in the same house, we&#39;re each doing our own thing <br/>\nbut we are aware what we each is doing.  I supposed I am listening,  <br/>\nby taking interest with whatever he is doing. <br/>\n<br/>\nLike if I put on a new cd, I&#39;ll asked if he&#39;s got any music <br/>\npreferance? So when he tells me which cd he wants, I&#39;m listening. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; - being able to support them on their projects without interfering <br/>\n </span></blockquote>in them or turning them into &quot;study units&quot; of any kind. <br/>\n<blockquote><span title=\"ireply\"> &gt; - knowing when to turn to books or material to help them when they<br/>\n&gt; need (for instance, my daughter want me to teach her how to read - <br/>\n </span></blockquote>I don&#39;t know how to do that). <br/>\n<br/>\n<br/>\nYou wrote &quot;I trust my kids to know what is good for them and to show <br/>\nme what they need&quot;. <br/>\n<br/>\nIf you trust your kids to know what they want, then let THEM SHOW <br/>\nYOU what to do. <br/>\n<br/>\nYou need to allow them to take control and ownership of thier <br/>\nlearning and interest directions, by allowing them to do whatever <br/>\nthier heart tells them to. <br/>\n<br/>\nAnd when they don&#39;t want to do it, then they don&#39;t want to do it. <br/>\nSimple as that. If you want to do it, then you do it instead. <br/>\n<br/>\nDon&#39;t impose your expectation on them. <br/>\n<br/>\nFor example- your daughter wants to learn to read. Can she read <br/>\nalready? Let&#39;s explore the many ways to leanr to read. Computer? <br/>\nElectronic books? <br/>\n<br/>\nIf not, start easy by letting her pick the books she likes.  Library <br/>\nnear you? Go to a library,  and allow her to pick the books that she <br/>\nlike and read together. By giving her freedom to choose what and how <br/>\nshe wants to read, you are facilitating her learning. <br/>\n<br/>\nI believe reading to the child facilitates thier reading. I also <br/>\nbelieve reading for pleasure should come first before learning to <br/>\nread. Despite the fact that my son is very advance in reading <br/>\nskills, he prefers me reading to him. In the library, he&#39;ll pick the <br/>\nbooks he wants to &quot;read&quot; and I&#39;m his &quot;reading machine&quot; LOL!!  <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; - proposing a lot of interesting things to do, without feeling<br/>\n&gt; rejected when they&#39;re not interested in them. <br/>\n&gt;&gt;What could ruin an unschooling project?<br/>\n<br/>\n<br/>\n </span></blockquote>Your expectations!!!  When you expect co-orporation, results or an <br/>\nending, you WILL ruin any project. <br/>\n<br/>\nRemember, it&#39;s THE KID&quot;S project, and their interest, and thier <br/>\ncuriosities that&#39;s needed to be quench. Not yours. <br/>\n<br/>\n<br/>\nI like astronomy, but my kid thinks it&#39;s ultimate boring LOL!! I <br/>\nwould never force him to sit down and do one of those astronomy kits <br/>\nwith me. He&#39;ll say &quot;you do it, and show it to me afterwards&quot;. Of <br/>\nwhich, when finished, he&#39;s quite happy to claimed it as his, to be <br/>\npart of his Star Wars Lego&#39;s set up LOL!!<br/>\n<br/>\n<br/>\nYou also have to allow them to be able to change thier mind and <br/>\nswitch to something different, if they deem fit. You have to trust <br/>\nthey know what they are doing best for their mind (tho not necessary <br/>\nfor thier body LOL! but that&#39;s another whole unschooling chapter on <br/>\nlearning to trust our kids to eat what they need LOL!!) <br/>\n<br/>\nSo the kids will only take the project as far as they want to. Once <br/>\nthey had enough, they will want to move onto another interest/ <br/>\nproject.  <br/>\n<br/>\n<br/>\nMy kid&#39;s projects is always on an on-going or KIV basis. Sometimes <br/>\nhe&#39;ll start a project he thinks is fun, but stop 5 minutes into it <br/>\nbecause he realised it&#39;s harder than he expected it to be; or too <br/>\nmuch work and not willing to sacrifice his time on it; or it&#39;s just <br/>\nplain boring. <br/>\n<br/>\nOk, I&#39;m cool with that and he&#39;ll either go onto something easier or <br/>\ndecide to watch tv instead. <br/>\n<br/>\nBut a few days later, he might decide he&#39;ll give it ago again, now <br/>\nthat he knows what to expect. <br/>\n<br/>\nSo if I did have an expectation of some sort, I would have got upset <br/>\nwith him, and that inturn would have frightened him off trying <br/>\nanything in the future, because he definetely wouldn&#39;t want me <br/>\ngetting upset with him again. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; - trusting them even when they spend their whole day playing with <br/>\n&gt;   the Nintendo. <br/>\n<br/>\n </span></blockquote>There is a big difference between &quot;accomodating&quot; and &quot;trusting&quot;. <br/>\nAccomodating is when you allow the child to do what they want, <br/>\nwithout understanding why, other than because it is just what <br/>\nunschoolers do.  <br/>\n<br/>\nTrusting is about understanding and accpeting and having confidence <br/>\nin that your child knows his/ her own way to happiness and <br/>\ncontentment to adulthood and life.    <br/>\n<br/>\n<br/>\nYes, I trust my kid is doing something good for himself in whatever <br/>\nhe is doing all the time. And that he will grow up learning to <br/>\nlisten to his own better judgement, relevant to his life, and not <br/>\nmine. <br/>\n<br/>\nAnd this may include not having a diploma at all. <br/>\n <br/>\n<br/>\nDo you really trust you kids that much, that you believe every <br/>\nmoment, every decision they make is contributing to a better future <br/>\nfor themselves? <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; - turning a deaf ear to all the people who give me unsollicited <br/>\n&gt;advise about : how to teach things to my kids, why I should put <br/>\n&gt;them back to school, why HOMEschooling is so much better than <br/>\n&gt;UNschooling, why diplomas are so important in our world and so on <br/>\n&gt;and so forth<br/>\n<br/>\n<br/>\n </span></blockquote>You&#39;re tired of listening!! So tell them you&#39;re not being rude, but <br/>\nwould prefer not to listen to THIER opinion. If they pursue, then <br/>\nTHEY ARE BEING RUDE! Which gives you every right to be rude by <br/>\ntelling them to mind thier own bl**dy business!<br/>\n<br/>\n<br/>\nNevermind what everybody says, but DO YOU THINK IT IS A PROBLEM? <br/>\nBecause if you don&#39;t, then why shoudl you care what other people <br/>\nsay? Do they pay your bills? Do they feed you? Do you need them? Do <br/>\nthey REALLY know best? WHO ARE THEY?<br/>\n<br/>\nWhy do you need them? <br/>\n<br/>\nDiplomas!! Asked yourself this question. The world is at war <br/>\neverywhere. Nobody knows what&#39;s gonna happen in the next 2 or 3 or 5 <br/>\nyears?  <br/>\n<br/>\nWhat good is a diploma do should your children find themselves in a <br/>\nwar zone? I know this is a very harsh and seem not relevant <br/>\nquestion, but nobody can say for sure it won&#39;t happen. <br/>\n<br/>\nSo what&#39;s so good of a diploma is the holder itself is so unsure of <br/>\nhis/ her life? I know so many uni- graduated people, so unhappy and <br/>\nstuck with thier life!<br/>\n<br/>\nI, for one, would prefer my kid&#39;s happiness more than any piece of <br/>\npaper qualification. I don&#39;t believe that without a piece of paper, <br/>\nmy son is any less qualified than any other person in his choice of <br/>\ncareer. I also believe should my son requires a diploma or degree, <br/>\nthen he&#39;ll see sense for it, and will work towards it. <br/>\n<br/>\nMy kid wants to be a toy shop owner, so no need for diploma or <br/>\ndegree for that. Before this, he wants to be a train driver, again <br/>\nno need for a diploma for that. Maybe  afew years from now, he&#39;ll <br/>\ntell me he wants to be in the medical profession, only then we&#39;ll <br/>\nstart thinking what&#39;s necessary then. <br/>\n <br/>\nAt the moment, nobody can distinguish a good diploma from a bad <br/>\ndiploma because it is already so generic. Everbody can get a <br/>\ndiplomma, or a degree or a MBA.  <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Oh, and also to those who feel so sorry for my kids being kept away<br/>\n&gt; from this wonderful institution, and from all these great things <br/>\n </span></blockquote>and projects they do ...<br/>\n<br/>\n<br/>\nJust smile at thier ignorance, and tell yourself (and BELIVE IT) <br/>\nthat you have better common sense and a better brain to see that is <br/>\nSO NOT TRUE!!!<br/>\n<br/>\nAcknowledge what they are saying is VERY relevant and APPLICABLE to <br/>\nTHIER life, but not relevant to yours. <br/>\n<br/>\nBelieve and  acknowledge and ACCEPT that your life IS different, and <br/>\nas such will have different needs.  <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Actually, the only person who agrees with me is my husband. <br/>\n<br/>\n </span></blockquote>Good, if your husband believe you, then it must mean you&#39;re not <br/>\ncrazy LOL!!!<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I have ONE friend who is also homeschooling, but she is really far <br/>\n&gt;from  unschooling and sincerely thinks that teaching french and <br/>\n&gt;mathematics to her kids is necessary.<br/>\n <br/>\n </span></blockquote>Yes, acknowledge that her beliefs is true and sincerely RELEVANT <br/>\nonly to her life and her kids. Not you, and your kids.<br/>\n<br/>\n<br/>\nIf i say I believe eating alot of chillies is good for my body, it&#39;s <br/>\nmy cultural beliefs for centuries, does this means its&#39; good for you <br/>\ntoo? NO!! Of course not, too much chillies might hurt you and give <br/>\nyou severe gastric problems. But then, why not, becuase it doesn&#39;t <br/>\nhurt me, and my tummy&#39;s fine and my ancestors had fantastic <br/>\nhealth??!!<br/>\n<br/>\nSee what I mean? Look at it this manner. What is relevant and <br/>\nperceived good for another person&#39;s mind, is not necessary good for <br/>\nyou and your kids. <br/>\n<br/>\n <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Which is not completely false, as we have to comply to annual <br/>\n </span></blockquote>testing, &gt; here in Geneva (Switzerland). At his first test, my son <br/>\nwas in the average for reading (though I never taught him anything <br/>\ndirectly) and his results weren&#39;t very good in maths. The only way <br/>\nto escape testing is to enroll in a correspondance school and send <br/>\nits reports to the Public School Department. <br/>\n<br/>\n<br/>\nI&#39;ll say &quot;Amazing!! we never taught him anything, and already he&#39;s <br/>\npassed his first reading test and didn&#39;t come out zero on his <br/>\nmaths!!&quot; Proves that he is not brain dead sitting around playing <br/>\ngames. <br/>\n<br/>\n<br/>\nI don&#39;t know your laws there, but if by testing and your son is <br/>\ndoing enough to fullfill the criteria, so then it is enough. There <br/>\nis no need to do anymore, to show who?!<br/>\n <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So here I am, full of trust, on one hand, and doubts, on the other<br/>\n&gt; hand. Hard to keep deschooling your own mind without help (I don&#39;t<br/>\n&gt; believe all the things people tell me, it&#39;s not that the problem, <br/>\n&gt;it&#39;s just that I can&#39;t share my thoughts/doubts/reflexions with <br/>\n&gt;anyone, as everybody believes I&#39;m so wrong doing what I do). <br/>\n&gt; &gt; Unschooling feels so right to me - and still, I &gt;have doubts. <br/>\n </span></blockquote>About me, about the context (maybe unschooling isn&#39;t &gt;possible when <br/>\nEVERYBODY goes to school around you and believes it&#39;s &gt;the best <br/>\nthing ever created), about the fact that we&#39;ll be able to &gt;bypass <br/>\nthe compulsory testing ...<br/>\n<br/>\n<br/>\nYou&#39;re tired, You&#39;re burnt out. You&#39;re not that convinced if you&#39;re <br/>\ndoing the right thing. Whihc is why when EVERYONE IS TELLING and <br/>\nSHOWING YOU SO.  <br/>\n<br/>\nYou &quot;allowed&quot; their opinion to make you think you&#39;re doing wrong. <br/>\nWhcih is why they succeed into making you feel like a failure, <br/>\nbecause you, yourself is not sure of yourself.<br/>\n<br/>\nYou&#39;re giving them the impression that you don&#39;t really know what <br/>\nyou&#39;re doing, which is why you&#39;re get all this un-solicited advise. <br/>\n<br/>\nBe confident. Exudes it and show them you&#39;re happy with what you&#39;re <br/>\ndoing. Don&#39;t get drawn into moaning about anything the kids is NOT <br/>\ndoing. Stay clamed up until your confident enough to flaunt your <br/>\nunschooling. <br/>\n<br/>\n<br/>\nBut if you have to share, share good things. I find sharing little <br/>\nhappy things works like a dream, like his Lego buidling, his fire <br/>\nburning activities, my son&#39;s great sense of money counting. <br/>\n<br/>\nInfact, when I start rattling off al these good and happy moments,  <br/>\nit usually never fails to start the other mothers off,  moaning <br/>\nabout thier kid&#39;s in-competencies!! <br/>\n<br/>\nI&#39;m amazed by how many parents always fails to see the best in their <br/>\nkids, instead always highlights thier kid&#39;s &quot;not doing enough&quot; <br/>\nmoments!   <br/>\n<br/>\nMy favourite is mentioning which grade of Jumpstart (pc educational <br/>\ngames that my kid likes) program my kid&#39;s on. He&#39;s 8, and is between <br/>\nGrade 3-5. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How is it for you ? <br/>\n<br/>\n </span></blockquote>My family&#39;s unschooling success is due to conviction, determination <br/>\nand PROUD TO BE DIFFERENT!!<br/>\n<br/>\nI do flaunt that we are different, and we enjoy it. I am rebellious <br/>\nto start off with. <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; What is the&gt; part of your inner resources ?<br/>\n<br/>\n </span></blockquote>My son is the focus of my determination. Read what I&#39;ve written to <br/>\nChristie&#39;s post of &quot;1st week into unschooling&quot; , and you&#39;ll <br/>\nunderstand that I am passionate about nurturing my son&#39;s uniqueness. <br/>\nAnd nothing will deter or convince me otherwise, for I am following <br/>\nmy son&#39;s lead in his unschooling. <br/>\n<br/>\nThis is what I call trusting your kids. Allowing you kid to grow and <br/>\nflorish the way they deemed fit, and YOU, being the mother, should <br/>\nbe like the Lioness, fiercely protecting them and ensuring that they <br/>\nhave the best possible and safe environment to grow up in, without <br/>\nany other busybody&#39;s interferring opinion and beliefs. <br/>\n<br/>\nThink it this way, if your kid is a lion cub, you wouldn&#39;t allow the <br/>\nBaa Baa Sheep Mummy to tell you that you need to fed your kids grass <br/>\nand teach them to live happily and contently by grazing thier life <br/>\naway on sweet grass, would you? <br/>\n<br/>\nOf course NOT. Your kids are lions! And should do what Lions do. <br/>\nPlay and hunt! Not eat grass!!!<br/>\n<br/>\nSo be that Lioness now! Trust you can do no wrong by protecting them <br/>\nfrom this &quot;controlling, generic brainwashed world&quot;. Trust that you <br/>\ncan do no harm to your kids, no matter how stupid you were in maths <br/>\n(in this case, I&#39;m referring to myself LOL!!) <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; What are the required qualities for being a unschooling mom, an <br/>\n </span></blockquote>unschooling family ?<br/>\n<br/>\nPatience, determination and thick skin LOL!! <br/>\n<br/>\nLOVE - Great love for your kids, and the determination to give them <br/>\nthe best, which is what you&#39;re already doing by unschooling them. <br/>\n<br/>\nKeep this in FOCUS. Write it down and paste it up! LOVE. <br/>\n<br/>\n<br/>\n<br/>\nI live exactly on the school path, a few block away from the school, <br/>\nand everyone around me goes to school. I&#39;m the only unschooling <br/>\nmother, amongst all the homeschooling groups we attend. But <br/>\nmy &quot;structured&quot; homescooling friends still happily shares what they <br/>\nare doing in thier lives, and I don&#39;t feel like I&#39;m any of a lesser <br/>\nmother that they are, just because I don&#39;t do lessons. <br/>\n<br/>\nI am happy to hear what they are doing, because it&#39;s what they <br/>\nbelieve and obviously thrived in. It works for them, so I&#39;m happy <br/>\nfor them. But because I have this &quot;i&#39;m happy and proud we don&#39;t do <br/>\nlessons&quot; approach, they are equally happy to accept me for what I <br/>\nam - The Wierd One!!! LOL!! <br/>\n<br/>\nBut I am happy being the wierd one out!! LOL!!<br/>\n<br/>\n<br/>\nI believe it&#39;s time that you should stop worrying about not being <br/>\nfit enough to unschool, and just live your life the way you want. <br/>\n<br/>\nI do think you have yet to unschool yourself too, so go on, take a <br/>\nyear long sabbatical from being a conventional &quot;do it right mum&quot; and <br/>\njust melt and fall apart. Be un-conventional for once. <br/>\n<br/>\nI think you&#39;re being too hard on yourself by measuring what you&#39;re <br/>\ndoing and not doing. By listening to what other people said, is you <br/>\nmeasuring yourself againt thier judgement. <br/>\n<br/>\nTo me unschooling is about being our trueselves, being individuals, <br/>\nbeing unique, and this cannot possibly be measured against anything.<br/>\n<br/>\nOnce you understand that, everything will fall in place naturally <br/>\nand painlessly.  <br/>\n<br/>\n<br/>\nHope this helps.<br/>\n<br/>\nBest Wishes,<br/>\nSharonBugs.</div>","specialLinks":[]},{"userId":192566012,"authorName":"balickgoodmanfamily","from":"&quot;balickgoodmanfamily&quot; &lt;catonsvillenanny@...&gt;","profile":"balickgoodmanfamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Still doubting ...","postDate":"1225637767","msgId":36933,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdla2YyNys5YzNtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdlanYzYiszZWVoQGVHcm91cHMuY29tPg=="},"prevInTopic":36919,"nextInTopic":36940,"prevInTime":36932,"nextInTime":36934,"topicId":36919,"numMessagesInTopic":0,"msgSnippet":"Dear Helen - What really help me, sometimes, is to take the 10,000 foot view. What does my child want?  What brings him joy?  What makes him sparkle? How can I","messageBody":"<div id=\"ygrps-yiv-356386958\">Dear Helen -<br/>\n<br/>\nWhat really help me, sometimes, is to take the 10,000 foot view.<br/>\n<br/>\nWhat does my child want?  What brings him joy?  What makes him sparkle?<br/>\nHow can I help facilitate their growth, both emotionally, physically,<br/>\nmentally?<br/>\nHow can I make myself a better person and help myself emotionally,<br/>\nphysically, mentally?<br/>\n<br/>\nKeeping the focus small and on your child and your family, can help <br/>\nfind less importance in what others think.<br/>\n<br/>\nTake care, Lyssa</div>","specialLinks":[]},{"userId":323764344,"authorName":"seccotine_ch","from":"&quot;seccotine_ch&quot; &lt;seccotine@...&gt;","profile":"seccotine_ch","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Still doubting ...","postDate":"1225621419","msgId":36919,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdlanYzYiszZWVoQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":36933,"prevInTime":36918,"nextInTime":36920,"topicId":36919,"numMessagesInTopic":0,"msgSnippet":"Hi everybody ! Sylvain is almost 8 and we ve been unschooling for two years now. I firmly believe that this is the best path for all of us - though not the","messageBody":"<div id=\"ygrps-yiv-2009156315\">Hi everybody !<br/>\n<br/>\nSylvain is almost 8 and we&#39;ve been unschooling for two years now. I<br/>\nfirmly believe that this is the best path for all of us - though not<br/>\nthe easiest for me, maybe ... <br/>\n<br/>\nI trust my kids to know what is good for them and to show me what they<br/>\nneed, but I find it very hard to trust myself. I have the feeling that<br/>\nI don&#39;t have what it takes to be an unschooling mom. <br/>\n<br/>\nSo what does it take ? <br/>\n<br/>\n- being a good listener (I could do better)<br/>\n- being available for them at any time<br/>\n- being able to support them on their projects without interfering in<br/>\nthem or turning them into &quot;study units&quot; of any kind. <br/>\n- knowing when to turn to books or material to help them when they<br/>\nneed (for instance, my daughter want me to teach her how to read - I<br/>\ndon&#39;t know how to do that). <br/>\n- proposing a lot of interesting things to do, without feeling<br/>\nrejected when they&#39;re not interested in them. <br/>\n- trusting them even when they spend their whole day playing with the<br/>\nNintendo. <br/>\n<br/>\n- turning a deaf ear to all the people who give me unsollicited advise<br/>\nabout : how to teach things to my kids, why I should put them back to<br/>\nschool, why HOMEschooling is so much better than UNschooling, why<br/>\ndiplomas are so important in our world and so on and so forth<br/>\n<br/>\nOh, and also to those who feel so sorry for my kids being kept away<br/>\nfrom this wonderful institution, and from all these great things and<br/>\nprojects they do ...<br/>\n<br/>\nActually, the only person who agrees with me is my husband. I have ONE<br/>\nfriend who is also homeschooling, but she is really far from<br/>\nunschooling and sincerely thinks that teaching french and mathematics<br/>\nto her kids is necessary.<br/>\n<br/>\nWhich is not completely false, as we have to comply to annual testing,<br/>\nhere in Geneva (Switzerland). At his first test, my son was in the<br/>\naverage for reading (though I never taught him anything directly) and<br/>\nhis results weren&#39;t very good in maths. The only way to escape testing<br/>\nis to enroll in a correspondance school and send its reports to the<br/>\nPublic School Department. <br/>\n<br/>\nSo here I am, full of trust, on one hand, and doubts, on the other<br/>\nhand. Hard to keep deschooling your own mind without help (I don&#39;t<br/>\nbelieve all the things people tell me, it&#39;s not that the problem, it&#39;s<br/>\njust that I can&#39;t share my thoughts/doubts/reflexions with anyone, as<br/>\neverybody believes I&#39;m so wrong doing what I do). <br/>\n<br/>\nI try not to feel pressured by the disapproval around me, and most of<br/>\nthe time, I succeed, but not always. Sometimes, it comes back to me,<br/>\nand I think &quot;Oh my God, what if THEY were right ? Who am I to know<br/>\nbetter ?&quot;<br/>\n<br/>\nUnschooling feels so right to me - and still, I have doubts. About me,<br/>\nabout the context (maybe unschooling isn&#39;t possible when EVERYBODY<br/>\ngoes to school around you and believes it&#39;s the best thing ever<br/>\ncreated), about the fact that we&#39;ll be able to bypass the compulsory<br/>\ntesting ...<br/>\n<br/>\nHow is it for you ? In your unschooling path, how helpful is the<br/>\ncontext ? Is it as favorable as it looks from abroad ? What is the<br/>\npart of your inner resources ? What are the required qualities for<br/>\nbeing a unschooling mom, an unschooling family ? What could ruin an<br/>\nunschooling project ?<br/>\n<br/>\nHope my questions aren&#39;t too confused. <br/>\n<br/>\nAs always, I&#39;m deeply grateful for your answers and insights.<br/>\n<br/>\nHelen, unschooling mom of Sylvain (8), Cyrielle (6) and Circé (3), in<br/>\nGeneva, Switzerland</div>","specialLinks":[]}],"prevTopicId":36839,"nextTopicId":36913}}