{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Question about ds&#39;s intense interests  (For Deb R.)","postDate":"1239299028","msgId":39416,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlFRTlFQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":39404,"nextInTopic":0,"prevInTime":39415,"nextInTime":39417,"topicId":39400,"numMessagesInTopic":0,"msgSnippet":"... I have an almost 11 yr old DS and he s taught me a LOT over the years. And, I have an almost 41 yr old hubby who can have the same transition issues as","messageBody":"<div id=\"ygrps-yiv-1666158336\"><blockquote><span title=\"ireply\">&gt; How did you figure it out? That&#39;s the answer right there. I cannot thank you enough!\r<br/>\n\r<br/>\n </span></blockquote>I have an almost 11 yr old DS and he&#39;s taught me a LOT over the years. And, I have an almost 41 yr old hubby who can have the same transition issues as well (I joke that they share a brain because they&#39;re so much alike). It was really helpful when DS was really little to be able to run an idea past DH and see what he thought because he could run it through his own &quot;when I was that age&quot; filter - both in the &#39;traditional&#39; mode as he was raised and how he felt about it and in the &quot;if I could be a kid again, this is what I&#39;d want to happen&quot; filter.\r<br/>\n\r<br/>\nAs far as new stuff, relax. There&#39;s no reason ANYONE has to try anything new ever - really (okay well babies do eventually need to stop eating off momma at some point, for momma&#39;s sanity if nothing else). I often buy 4 pairs of the same exact jeans so I don&#39;t actually have to try anything &quot;new&quot; - I just grab &quot;pants&quot; and that&#39;s it. Part of trying something new is deciding - &quot;if I&#39;m not having my usual mac & cheese, then what exactly will I have? There are 30 things on this menu...&quot; It can be overwhelming, making the &quot;right&quot; choice - and yes, that&#39;s probably how it&#39;s being framed in his head - there&#39;s a &#39;right&#39; food and everything else isn&#39;t. Easier to stick to a known &#39;right answer&#39; than to risk a &#39;wrong&#39; answer (not that you&#39;re giving that impression, just relating what I&#39;ve learned from DS because he&#39;d verbalize these sorts of things). So, we&#39;ve had all sorts of strategies over time to sort this type of stuff out. A biggie is freeing him from the idea that there&#39;s no way out once a choice is made. We&#39;ve doggie bagged many an entrée because DS tried something new and didn&#39;t want it. He knew he was free to try it and then choose something else. We evolved a system for a while where I kept 3 &quot;cocktail toothpicks&quot; in my purse - each with a different color cellophane on it. He&#39;d look over the kid&#39;s menu (Or adult menu, his choice) and identify which 3 items were possible at that point (and we had variants on the strategy for &gt;3 options that were all possible). Each option was assigned to a toothpick. I&#39;d hide them, point up, in my hand, so it was a random selection. When he pulled the yellow (for example) we&#39;d look and see that mac & cheese was assigned to yellow. Then he&#39;d decide if that was his choice or if that was getting tossed aside. And so on. It was a way to bring the myriad options down to manageable. We&#39;ve also given him information - &#39;I had the tilapia last time and it was quite tasty. It had a buttery sauce on it that I liked, not too salty or spicy. The broccoli with it was cooked good - not mushy or hard.&quot; I might point out ways to adjust things or favorites he&#39;s had before (&quot;Oh look - the soup of the day is clam chowder! I know you like that so I thought I&#39;d mention it for you to think about&quot;). The freedom to change his mind even AFTER we&#39;ve ordered really helps him to be able to actually decide BEFORE we order (did that make sense? LOL) It&#39;s a lot like buying shoes - if you know you can return them even after wearing them for a day or two, it&#39;s a lot easier to decide than if you are &#39;stuck&#39; with whatever you pick right this minute. There are always OPTIONS but often having not enough AND having too many can both be problematic.\r<br/>\n\r<br/>\nOh, also, a good book was Parenting your Spirited Child. Don&#39;t agree with 100% of it but it was very helpful in making me consciously aware of some things I kind of knew but couldn&#39;t quite put my finger on KWIM? Once I was conscious of it, it was easier to make a habit of ways to address those areas (developing tools), instead of having to think about it every time a situation arose. I don&#39;t have to -think- about bringing along DS&#39; bag o&#39; stuff when we go someplace, it&#39;s a habit to make sure he&#39;s got water, snack, a few current favorite portable activities. And, now that DS is older, he actually goes and packs his bag himself some of the time. He&#39;s learned, from my habits, the things that are helpful skills/tools for his own self to use.\r<br/>\n\r<br/>\n\r<br/>\nDeb R\r<br/>\n\r<br/>\n\r<br/>\n**********************************************************************\r<br/>\nThis email and any files transmitted with it are confidential and\r<br/>\nintended solely for the use of the individual or entity to whom they\r<br/>\nare addressed. If you have received this email in error please notify\r<br/>\nthe system manager.\r<br/>\n\r<br/>\nThis footnote also confirms that this email message has been swept by\r<br/>\nMIMEsweeper for the presence of computer viruses.\r<br/>\n\r<br/>\nwww.mastercam.com\r<br/>\n**********************************************************************\r<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Question about ds&#39;s intense interests  (For Deb R.)","postDate":"1239271925","msgId":39404,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdya2hsbCtpdjQ4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDYxODNGODFERjI0NjQyQUQ4QTc4QUY2MzUzOEE1NjU4QHJvYnlQQz4="},"prevInTopic":39403,"nextInTopic":39416,"prevInTime":39403,"nextInTime":39405,"topicId":39400,"numMessagesInTopic":0,"msgSnippet":"... I m feeling so dumb already for not having thought of all ... ******It s a never ending journey.  You ve taken a step toward more peaceful and gentle","messageBody":"<div id=\"ygrps-yiv-759356047\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &lt;hunnybunnies5@...&gt; wrote:<br/>\n<br/>\nI&#39;m feeling so dumb already for not having thought of all <br/>\n&gt; these wonderful things!  <br/>\n<br/>\n******It&#39;s a never ending journey.  You&#39;ve taken a step toward more peaceful and gentle parenting.  As my family grows and changes and each day presents itself with new situations I continue my journey, learning while I go.  <br/>\n===================================================================<br/>\n<br/>\n<br/>\n&gt; Yes, I think, you&#39;re right.  I can&#39;t wait to discuss this all with my family!<br/>\n<br/>\n******Feel out the situation before you go discussing it all.  Sometimes it&#39;s better just to implement the new ideas and go from there.  I learned pretty quick that letting my kids know how life was going to change didn&#39;t matter so much, until it actually changed.  :-)<br/>\n=====================================================================<br/>\n<br/>\n<br/>\n&gt; Given this great insight, could I ask you one last question, though?  When it comes to trying out new food or books or movies, etc., how would you suggest we help him transition from his &#39;comfort zone&#39; to trying out these new things?  <br/>\n<br/>\n******I guess I might ask myself who really wants these things?  Me or him?  Is it necessary that he try new foods etc.?  <br/>\n=====================================================================<br/>\n<br/>\n<br/>\nBecause, like I mentioned in a previous post, what we&#39;ve been doing is just reminding him that all the food / books / films he enjoys right now were once new, and that he just has to make a leap of faith.  <br/>\n<br/>\n******At this point, he is 12, do you think he doesn&#39;t realize that very fact?  I could be wrong, but after all the reminders, I&#39;m betting he does. &lt;G&gt;<br/>\n<br/>\nI make lots of food platters.  Lots of us call them monkey platters.  I fill them with food and snacks they like.  Every so often, I&#39;ll throw something new on there.  I don&#39;t tell them, or remind them, or ask them to try it.  Sometimes they do, more often they don&#39;t.  <br/>\n<br/>\nMy oldest doesn&#39;t care for new foods.  Sometimes I ask him, &quot;would you like to try this?&quot; Often he says no.  I respect that.  I think respecting his no, is more important than being adventurous with food.  <br/>\n==================================================================== </span></blockquote></div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Question about ds&#39;s intense interests  (For Deb R.)","postDate":"1239260092","msgId":39403,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI3RURCM0RGLUE4RUItNEQyMC05MkVDLUQ2MjhFRjEzNkNDNUBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDYxODNGODFERjI0NjQyQUQ4QTc4QUY2MzUzOEE1NjU4QHJvYnlQQz4=","referencesHeader":"PDYxODNGODFERjI0NjQyQUQ4QTc4QUY2MzUzOEE1NjU4QHJvYnlQQz4="},"prevInTopic":39400,"nextInTopic":39404,"prevInTime":39402,"nextInTime":39404,"topicId":39400,"numMessagesInTopic":0,"msgSnippet":"... It s a process. It will come as your thinking changes from this is the way we ve always done it to we have choices. ... Be aware that you might get","messageBody":"<div id=\"ygrps-yiv-1674105699\"><blockquote><span title=\"ireply\">&gt;  I guess I just feel a little frustrated that I haven&#39;t gotten the<br/>\n&gt; unschooling mindset down pat yet.<br/>\n<br/>\n </span></blockquote>It&#39;s a process. It will come as your thinking changes from &quot;this is  <br/>\nthe way we&#39;ve always done it&quot; to &quot;we have choices.&quot;<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;&gt; Maybe a change in the expectation of what constitutes &quot;Celebrating<br/>\n&gt;&gt; as a family&quot; would help.<br/>\n&gt;<br/>\n&gt; Yes, I think, you&#39;re right.  I can&#39;t wait to discuss this all with  <br/>\n&gt; my family!<br/>\n&gt;<br/>\n </span></blockquote>Be aware that you might get some resistance to this if you &quot;discuss  <br/>\nthis all&quot; with your family. If your ds is sensitive to transitions,  <br/>\nthen saying &quot;oh, look at all the things we could do instead!&quot; or  <br/>\n&quot;let&#39;s dispense with expectations!&quot; could easily be met with &quot;I don&#39;t  <br/>\nwant to do that.&quot; And not just from your ds. Expecting everyone to  <br/>\njump on your unschooling bandwagon might be a bit much all at once!<br/>\n<br/>\nIt might be better to start implementing changes gently, instance by  <br/>\ninstance. Work on your own thinking first. Read at Sandra&#39;s and  <br/>\nJoyce&#39;s sites. Use the random generators for some angles for change.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling\">http://sandradodd.com/unschooling</a> (click on &quot;randomize me&quot; then on the  <br/>\ndoor)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a> (click on &quot;go to a random page&quot;)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When it comes to trying out new food or books or movies, etc., how  <br/>\n&gt; would you suggest we help him transition from his &#39;comfort zone&#39; to  <br/>\n&gt; trying out these new things?  Because, like I mentioned in a  <br/>\n&gt; previous post, what we&#39;ve been doing is just reminding him that all  <br/>\n&gt; the food / books / films he enjoys right now were once new, and that  <br/>\n&gt; he just has to make a leap of faith.  Don&#39;t know if that&#39;s the right  <br/>\n&gt; approach, but would greatly appreciate your thoughts.<br/>\n<br/>\n<br/>\n </span></blockquote>This leads back to expectations. You seem to need some kind of outcome  <br/>\nhere, like you want him to make a leap of faith for your reasons, not  <br/>\nhis. Why can&#39;t he enjoy what he enjoys now, for as long as he does?  <br/>\nHe&#39;ll move on when he&#39;s ready, if you give him opportunities. He can  <br/>\nsay yes or no &lt;g&gt;. Have you heard of strewing?<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strewing\">http://sandradodd.com/strewing</a><br/>\n<br/>\nI think reminding him that he isn&#39;t trying new things, but ought to,  <br/>\ncould be keeping him stuck. It might feel like pressure to him, so  <br/>\nhe&#39;s going to hold onto whatever he loves even more tightly.<br/>\n<br/>\nMy dd ate Dove Bars for breakfast for months and months. I could have  <br/>\nsaid &quot;why don&#39;t you have this instead?&quot; or &quot;how about you try french  <br/>\ntoast? You know how you felt about Dove Bars before? It could be the  <br/>\nsame with french toast!&quot; That would have been me with an agenda. She  <br/>\nwould probably never have tried french toast if I approached it that  <br/>\nway.<br/>\n<br/>\nInstead, I made sure we had Dove Bars until she was done enjoying  <br/>\nthem.  I gave suggestions when I could tell she was beginning to move  <br/>\non. Now she likes raisin bran or bacon or eggs or chicken curry with  <br/>\nnaan, or pasta, or strawberries, or crepes, or whatever she feels  <br/>\nlike. Even french toast!<br/>\n<br/>\nRight now, her favorite meal is cheddar & potato perogies. I&#39;ve  <br/>\nstocked lots, so she can have them. My husband&#39;s favorite breakfast is  <br/>\nMultigrain Cheerios. I&#39;ve stocked lots, so he can have them. Then  <br/>\nthings will change. Or not. Dh has eaten Cheerios for breakfast since  <br/>\nhe was in elementary school. He does eat other things, but he prefers  <br/>\nthat particular cereal. It&#39;s okay. Really!<br/>\n<br/>\nIt comes down to acceptance of where your ds is *right now.* And you  <br/>\nbeing open to change when he shows he&#39;s ready. It&#39;s definitely a shift  <br/>\nin thinking.<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":346820406,"authorName":"hunnybunnies5@verizon.net","from":"&lt;hunnybunnies5@...&gt;","profile":"shelleydaez","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Question about ds&#39;s intense interests  (For Deb R.)","postDate":"1239251143","msgId":39400,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxODNGODFERjI0NjQyQUQ4QTc4QUY2MzUzOEE1NjU4QHJvYnlQQz4="},"prevInTopic":0,"nextInTopic":39403,"prevInTime":39399,"nextInTime":39401,"topicId":39400,"numMessagesInTopic":0,"msgSnippet":"... Oh, another great idea!  I m feeling so dumb already for not having thought of all these wonderful things!  Don t get me wrong -- I SO appreciate all of","messageBody":"<div id=\"ygrps-yiv-839790694\"><blockquote><span title=\"ireply\">&gt; Can you separate the events? Have cake and ice cream at home as a family<br/>\n&gt; then have a special event chosen by the birthday person that is open to<br/>\n&gt; everyone if they choose to come along. <br/>\n<br/>\n </span></blockquote>Oh, another great idea!  I&#39;m feeling so dumb already for not having thought of all <br/>\nthese wonderful things!  Don&#39;t get me wrong -- I SO appreciate all of you ladies&#39; <br/>\nterrific suggestions.  I guess I just feel a little frustrated that I haven&#39;t gotten the <br/>\nunschooling mindset down pat yet.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If you invited all the neighbors to come to a party, you wouldn&#39;t expect <br/>\n&gt; everyone to come - some might not be available that day/time, some <br/>\n&gt; might not like barbecue, some might come to the party but bring their <br/>\n&gt; own vegetarian option (to eat and share). <br/>\n<br/>\n </span></blockquote>Great analogy!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Maybe a change in the expectation of what constitutes &quot;Celebrating <br/>\n&gt; as a family&quot; would help.<br/>\n<br/>\n </span></blockquote>Yes, I think, you&#39;re right.  I can&#39;t wait to discuss this all with my family!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also, sometimes it can be helpful for transitioning to bring along a<br/>\n&gt; favorite item or two - maybe get your DS(12) an Army surplus backpack<br/>\n<br/>\n </span></blockquote>Yes, we already did get him an Army surplus backpack.  [ Love how we&#39;re on<br/>\nthe same wavelength. ]  :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; that he can keep a couple books and whatever else is easily portable in<br/>\n&gt; that he can bring along on these sorts of ventures. That way, if he<br/>\n&gt; chooses, he can find a corner to just read his favorite &quot;aircraft of<br/>\n&gt; WWII&quot; book while others make origami cranes. <br/>\n<br/>\n </span></blockquote>Yes, that&#39;s exactly what we did -- and he does have that book!  Though, in<br/>\nthe end, just being in the tent with everyone else, he decided to try his hand<br/>\non the crafts and ended up enjoying what he made.  And I was surprised<br/>\nthat they didn&#39;t even have to do with anything military!  He made a leaping<br/>\norigami frog (as I mentioned in an earlier post), a collage of a sailboat and <br/>\na Japanese lantern.  (OK, the frog and the lantern had the instructions right<br/>\non the table.  But the collage, he did on his own with no instructions or <br/>\nsuggestions from the craft people in charge.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Because it sounds not so much like he doesn&#39;t like the proposed <br/>\n&gt; activity but rather that the transition from his &#39;comfort zone&#39; to a <br/>\n&gt; new activity (even something he&#39;ll probably like) is the hard part, <br/>\n&gt; the automatic no. <br/>\n  <br/>\n </span></blockquote>YES!!!  You nailed it -- excellent, excellent point!!!  Thank you for helping <br/>\nme figure out my son!  I now realize that it&#39;s the transitioning that he has <br/>\ntrouble with.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If he can bring along part of the &#39;comfort zone&#39; to <br/>\n&gt; make the transition easier, that might be helpful for everyone.<br/>\n<br/>\n </span></blockquote>And that&#39;s exactly what happened in the crafts tent!  Deb, you&#39;re a genius!  <br/>\nHow did you figure it out?  That&#39;s the answer right there.  I cannot thank you <br/>\nenough!<br/>\n<br/>\nGiven this great insight, could I ask you one last question, though?  When it comes to trying out new food or books or movies, etc., how would you suggest we help him transition from his &#39;comfort zone&#39; to trying out these new things?  Because, like I mentioned in a previous post, what we&#39;ve been doing is just reminding him that all the food / books / films he enjoys right now were once new, and that he just has to make a leap of faith.  Don&#39;t know if that&#39;s the right approach, but would greatly appreciate your thoughts.<br/>\n<br/>\nShelley<br/>\n<br/>\nP.S.  I hope I&#39;m not overburdening you with these difficult questions.  You don&#39;t have to answer if you don&#39;t have the time.  As it is, I&#39;m already grateful for the wonderful insights you&#39;ve given me above.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Deb R<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":39017,"nextTopicId":39411}}