{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":96057767,"authorName":"Katharine Wise","from":"Katharine Wise &lt;katharinewise@...&gt;","profile":"katharinewise","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] problem -- very long response to Danielle","postDate":"1171037758","msgId":21323,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUzMTE5MC41OTEucW1Ad2ViNjAzMTIubWFpbC55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":21322,"nextInTime":21324,"topicId":21323,"numMessagesInTopic":0,"msgSnippet":"Sorry, this is very, very long!  Thank you for your response, Danielle.  Your experience has definitely resonated with me.  Lots of what you say about Sam","messageBody":"<div id=\"ygrps-yiv-1997211599\">Sorry, this is very, very long!  Thank you for your response, Danielle.  Your experience has definitely resonated with me.  Lots of what you say about Sam matches my own child, although I have the sense that my son&#39;s intensity and angry outbursts started a lot later.   (6.5yo with some aggression leading up in the 6-8 months before -- started when my then-2.5yo went through a short-lived biting phase which the 5.5yo picked up on.).  He was a very easy child for a long time.<br/>\n<br/>\nDanielle wrote:  I hear that you&#39;re desperately wanting to help your guy find a way to process his anger, and I know how it feels to want to help with that <br/>\n<br/>\nintense emotion but also be caught up in the intense protective emotion <br/>\n<br/>\nof your own for your other children. It&#39;s a really heart-wrenching place <br/>\n<br/>\nto be.<br/>\n<br/>\nMe:  You know, reading that I realized that what I actually want is to know that I&#39;m doing the right thing!  I think that what I&#39;m doing now -- making sure everyone&#39;s safe, staying with him, holding him if he wants as long as he&#39;s not hurting me, trying to minimize physical intervention (get between the two children but trying not to pick up and remove the angry child) and my own emotional response (if I get obviously upset it heightens his own anger), and just repeating back what he&#39;s saying (&quot;you want me to bite your brother&quot;) without adding to it much -- seems most effective at giving him the support and space he needs to diffuse (and de-fuse:-) his anger.  But still I wonder, should we be trying x, y, or z?  Is there something environmental that we could change (i.e., not the fact of having a younger brother!) contributing to his emotional state?  Would &quot;time-outs&quot; or &quot;time-ins&quot; be better -- we&#39;ve never really used them, so how would I know?  Friends who do, and do so<br/>\n very calmly and pretty much limit them to aggression, don&#39;t have a children attacking one-another.  Of course, my older child doesn&#39;t hit usually either (might on the rare occasions for self-defense).  Medicine?  I&#39;ve always been opposed, but if my child would be happier?  <br/>\n<br/>\n<br/>\n<br/>\nDanielle:  It sounds like your husband is really available and willing to help <br/>\n<br/>\nout--that&#39;s wonderful! <br/>\n<br/>\n<br/>\nMe:  When he&#39;s around.  In many ways, his time is pretty flexible (I can often call him home if I&#39;m desperate), but then he often has evening meetings, and he does have to work!  He&#39;s not (yet) able to respond very calmly though -- he has a hard time not taking it personally.  On the other hand, his work involves dealing with a lot of the same issues (learning how to handle conflict appropriately) except on an adult level, which makes for some interesting conversations:-)<br/>\n<br/>\nDanielle:  Would you be willing to offer more details? Because at face value, <br/>\n<br/>\nshredding newspaper doesn&#39;t sound like a bad thing to me; in fact, it&#39;s <br/>\n<br/>\na strategy we tried for a while to see if it helped release some of <br/>\n<br/>\nSam&#39;s anger. <br/>\n<br/>\n<br/>\nMe:  Actually, I have tried giving him old magazines to tear up.  He liked it once, but since then he&#39;ll say, no, he wants to break something real (i.e., something that matters to someone).  <br/>\n<br/>\n<br/>\nMore details:  Looking back, I&#39;m realizing this incident really started the day before -- and was really started by the youngest.  After opening the castle, all 3 boys played together really well for a long time.  Then the older left.  Then the youngest started to head out, but he paused, looked at the middle and said, &quot;I want to put the castle away.&quot;  I stalled.   (Personal possession vs. sharing.  Do I put it away because it belongs to him even though the middle is still playing with it.  It&#39;s big, where would I put it anyway?  Do I insist that we share the toys?)  Maybe I should have guided the issue into a discussion between the two boys (&quot;Oh, you want to put the castle away?  It looks like brother still wants to play with it.  Why don&#39;t we ask him what he thinks?&quot;), but what I did was try to discuss it with the younger.  I don&#39;t really remember what happened, but after a couple minutes of this the middle lost it.  I think when he&#39;d calmed down, we went to fix lunch and<br/>\n later on it didn&#39;t appear to be an issue anymore.  <br/>\n<br/>\n<br/>\nThen, in the morning, the boys were playing with it.  I was taking a shower; I don&#39;t know what dh was doing but I think he was nearby though he didn&#39;t see what happened until he discovered middle trying to bite younger.  He pulled middle off at which point middle started screaming, kicking, etc -- at dh and younger, I think.  Dh sent oldest up to get me.  There happened to be  a roll of newsprint nearby which is why middle was shredding it (I think he thought he was destroying something important).  Dh, who was very upset, went off to the bedroom to recuperate.  I stayed with middle who started grabbing the figures from the castle while younger hovered over it.    (Maybe I had already proposed that we put the castle away until we could figure out how to play with it without fights?)  Oldest moved castle to storage room at my request, except for the figures middle was still clutching.  I put them away later when he had gone on to other play.  While I was with middle, I was<br/>\n doing the kinds of things I described earlier.  Younger was where?  With me for awhile, then probably with older.  Yes, he needed comfort too, but middle needed it *now*.  We all needed middle to have it *now* for our own safety. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\nDanielle:  Those kinds of things have never really worked for Sam--he&#39;s just not <br/>\n<br/>\ninterested in redirecting his anger energy in that way. What we&#39;ve found <br/>\n<br/>\nto be most successful is finding a safe place where he can simply vent <br/>\n<br/>\nin his own in-the-moment way. I&#39;ve had to learn over the years how to be <br/>\n<br/>\npresent and calm for him while he&#39;s venting, allowing his anger to flow <br/>\n<br/>\naround me without taking it personally or trying to stop it. I&#39;ve found <br/>\n<br/>\nthat when I directly engage his energy with my own, that the situation <br/>\n<br/>\nescalates and spirals out of control.<br/>\nMe:  Yes, yes, yes.  <br/>\n<br/>\n<br/>\n<br/>\nDanielle:  And with several <br/>\n<br/>\nyears of doing this, and him trusting that I will be there and trusting <br/>\n<br/>\nthat I am his partner in his process, I can honestly see a *huge* <br/>\n<br/>\ndifference from where we were three years ago. Part of that, certainly, <br/>\n<br/>\nis age, but there&#39;s a huge part of it that is Sam&#39;s trust in the process <br/>\n<br/>\nand trust that he *can* handle the incredibly intense emotions raging <br/>\n<br/>\nthrough his body, that *I* can handle those incredibly intense emotions.<br/>\n<br/>\nMe:  I hope so.   For us, this started pretty much out of the blue.  Yes, there was some sibling rivalry.  Yes, I remember a tantrum here or there that lasted a long time.  Yes, problem solving was sometimes challenging -- his attention didn&#39;t hold very long -- but I attributed that to age.  Over 6-8 months we&#39;d had aggression toward the younger (with some incidents toward neighbors in the past), but the rages started with a *boom* one night about a year ago and they&#39;ve cycled in waves ever since.  <br/>\n<br/>\n <br/>\nDanielle:  This, too, is only one side of the process--the part that has to do with <br/>\n<br/>\nhow to handle situations once they&#39;ve gotten to this stage. There&#39;s a <br/>\n<br/>\nwhole &#39;nother, larger part of the process that has to do with <br/>\n<br/>\n*preventing* the escalation and *cultivating* calming and coping <br/>\n<br/>\nstrategies for dealing with and dissipating intense emotion as it&#39;s <br/>\n<br/>\nmounting. I also highly recommend what I call an &quot;autonomy inventory,&quot; <br/>\n<br/>\nwhich is an observational list of all the ways your guy is empowered/ <br/>\n<br/>\ndisempowered during his day. Not just the things he hears from you, but <br/>\n<br/>\nthe things the world hands him on his plate--too big, too small, too <br/>\n<br/>\nweak, etc. What can&#39;t he reach, what can&#39;t he do, all the times reality <br/>\n<br/>\ndoesn&#39;t match the vision in his head, the weather, the time, etc., all <br/>\n<br/>\nthe things out of his control. That will both help you see the world <br/>\n<br/>\nfrom his perspective and demonstrate the places where you can make <br/>\n<br/>\nempowering changes for him.<br/>\n<br/>\nMe:  Did you actually do this in writing?  Had you read about it somewhere, or did you come up with it yourself?<br/>\n<br/>\nDanielle:  I may have a different perspective on this process than what you&#39;re <br/>\n<br/>\ncomfortable with, however, and certainly, I can&#39;t know to what extent <br/>\n<br/>\nyou&#39;re dealing with anger from this one post. &lt;snip&gt;  I, personally, am very opposed to outside intervention and therapists.  *deep sigh* I think they send the message that a child&#39;s emotions are not only too big for him to deal with, but also too big for mom and dad--that the child *himself* is too much for mom and dad. Sometimes the intense emotions *are* too big for mom and dad, absolutely, but I don&#39;t believe that added layer of labeling and intervention helps the child.<br/>\n<br/>\n<br/>\n<br/>\nWhat I&#39;ve done, instead, is to read as much as I can, to spend as much <br/>\n<br/>\ntime with my child, observing my child, and empowering myself as the <br/>\n<br/>\nexpert. I&#39;ve adapted lots of tools from books to our lives, and we&#39;ve <br/>\n<br/>\nfound them really helpful, but I&#39;ve been able to do this without Sam <br/>\n<br/>\nfeeling as if he&#39;s a &quot;problem.&quot; And, I think that&#39;s really crucial.<br/>\n<br/>\n<br/>\n<br/>\nAt any rate, this is long, and I don&#39;t even know if it&#39;s been helpful or <br/>\n<br/>\nnot. I&#39;d be happy to talk about<br/>\n<br/>\nMe:  It&#39;s been very helpful.  It&#39;s helpful just to know someone else experiences something similar and that they&#39;ve found similar ways to handle it.  I&#39;d actually discovered your blog and website some time ago (from Sandra Dodd&#39;s)  though I think it was the fact that you were also in Maryland that first caught my attention.  (We had just moved from NJ with no reporting, to MD and I was a little stressed about it!  We&#39;re in Frostburg, just outside of Cumberland.)   Later, however, I remembered your discussions of handling Sam&#39;s emotions.  I looked back at your website yesterday and did find a lot more that I didn&#39;t remember seeing before, plus the links.<br/>\n<br/>\n<br/>\n<br/>\nKatharine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\n8:00? 8:25? 8:40? Find a flick in no time <br/>\nwith the Yahoo! Search movie showtime shortcut.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tools.search.yahoo.com/shortcuts/#news\">http://tools.search.yahoo.com/shortcuts/#news</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":21290,"nextTopicId":21313}}