{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: 4-year old son addicted to iPad.  Questions about my own de-schooling.","postDate":"1347902542","msgId":49041,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGszN204ZStndXNpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGszNzFpOCs2NGRhQGVHcm91cHMuY29tPg=="},"prevInTopic":49038,"nextInTopic":0,"prevInTime":49040,"nextInTime":49042,"topicId":49038,"numMessagesInTopic":0,"msgSnippet":"... **************** If he was spending as much time playing with blocks, would you be worried? If he wanted to spend the same amount of time hearing the same","messageBody":"<div id=\"ygrps-yiv-883234454\">&quot;Jen&quot; &lt;jenyoust@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;if we go outside and play and the neighbors are there, he will play, have fun, be active...do other things, but the minute we are inside or in the car, it is &quot;where&#39;s the iPad?&quot; <br/>\n </span></blockquote>****************<br/>\n<br/>\nIf he was spending as much time playing with blocks, would you be worried? If he wanted to spend the same amount of time hearing the same story read over and over? You&#39;ve put a lot of fun things on the IPad, so he&#39;s doing more than one thing - it will help to see All the things he&#39;s doing and not just the device he&#39;s using. If you need the IPad for other things, set him up with similar kinds of fun on a desktop computer or game console, or hand-held game. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; He always ends up finding something else to do --which makes me think, then, that taking away the iPad is sometimes a good move<br/>\n </span></blockquote>****************<br/>\n<br/>\nKids are often good at making the best of things. My brother and I were really good at making the best of dull afternoons at the babysitter&#39;s house and long car rides - but we didn&#39;t enjoy them and didn&#39;t learn anything positive. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;it&#39;s hard for me to imagine how not disciplining in a traditional sense (time out, go to your room, etc.) will &quot;teach&quot; someone that it&#39;s not right to clock someone in the head<br/>\n </span></blockquote>**************<br/>\n<br/>\nTeaching doesn&#39;t control learning. Most of what kids learn from &quot;discipline&quot; is about resentment and vengeance. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Usually, it&#39;s the iPads that result in this behavior....she is using his or vice versa<br/>\n </span></blockquote>*************<br/>\n<br/>\nDon&#39;t let them share for now, if it&#39;s a cause of conflict. If they like programs the other has, make sure they have the same programs. <br/>\n<br/>\nLook for other patterns, too - hunger, tiredness, one kid talking more than the other wants, that sort of thing. The more you can predict the behavior, the better your chance of preventing it. Look for other signs that your 4yo resents the younger child! If the 4yo is expected to be &quot;the big boy&quot; that could be an issue: he needs to be babied more. <br/>\n<br/>\nBut to some extent, this is part of having a 2 and 4yo. They don&#39;t have very many skills for communicating their feelings yet.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Books, paper, painting, crayons, pencils, music, toys...it all lasts minutes to an hour or so, and then he&#39;s on to the iPad again.<br/>\n </span></blockquote>*************<br/>\n<br/>\nBecause the iPad has elements of all of those things and more. The only kinds of activities which have any chance of competing are things which involve whole body movement and a lot of physical stimulation - and how much your kids want to do those things will depend on their personalities/temperaments. <br/>\n<br/>\nStrew big-body play, opportunities to run, jump, twirl, crawl, climb and wrestle. Strew things to squish, throw, stir, smell, and pet. Electronics toys can&#39;t do those things.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":479109089,"authorName":"Jen","from":"&quot;Jen&quot; &lt;jenyoust@...&gt;","profile":"boo_boo_flower","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"4-year old son addicted to iPad.  Questions about my own de-schooling.","postDate":"1347881352","msgId":49038,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGszNzFpOCs2NGRhQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":49041,"prevInTime":49037,"nextInTime":49039,"topicId":49038,"numMessagesInTopic":0,"msgSnippet":"We are new to unschooling (son is 4 and daughter is 2).  We are also new to the unconditional parenting style that comes along with the unschooling lifestyle.","messageBody":"<div id=\"ygrps-yiv-39774945\">We are new to unschooling (son is 4 and daughter is 2).  We are also new to the unconditional parenting style that comes along with the unschooling lifestyle.  I am thrilled to have found this unschooling and this particular unschooling community, but I am having such trouble practicing what I feel in my heart is right.<br/>\n<br/>\nFor example, I KNOW that my son playing the iPad for hours a day (even though I am ever-strewing) is something he feels the need to do right now.  I have loaded games upon games for him (educational and just-for-fun silly games), in order to strew on the iPad as well.  But, the &quot;schoolie&quot; in me keeps having the fear that he will NEVER want to do other things (and that the iPad is inherently bad).  Now, if we go outside and play and the neighbors are there, he will play, have fun, be active...do other things, but the minute we are inside or in the car, it is &quot;where&#39;s the iPad?&quot;  Winter is coming, so I know this will be more of an issue as it gets colder outside.  <br/>\n<br/>\nI find myself resorting back to authoritarian/manipulative behavior by saying &quot;it&#39;s charging&quot; when it&#39;s not, and then helping him engage in some other activity.  He always ends up finding something else to do --which makes me think, then, that taking away the iPad is sometimes a good move (but the new unschooling voice in the back of my head is telling me that I should not have made that decision for him).  Do I just keep the iPad available to him at ALL times and let him play to his heart&#39;s content?  I do sit with him and play from time to time, when he wants me to...most of this is going on in my own head.<br/>\n<br/>\nNow onto more of a parenting question...my son is starting to hit.  I could be RIGHT THERE with them, and he&#39;s so fast that I can&#39;t stop him from hitting his sister in the face/head, etc.  I always comfort her first, and lately it has been so frustrating to me that I end up raising my voice and telling him please do not do that, it&#39;s not nice (I know, I know...)  I get so impatient with this behavior, and it&#39;s hard for me to imagine how not disciplining in a traditional sense (time out, go to your room, etc.) will &quot;teach&quot; someone that it&#39;s not right to clock someone in the head, especially if he keeps doing it over and over again.  (I have suggested that he go to his room and relax for a bit...?)  Should I not let them play together for awhile right now?  I&#39;m not sure what I should do here to limit the blows to my 2 year old...other times they are great together.  Usually, it&#39;s the iPads that result in this behavior....she is using his or vice versa -- they each have one, what more can I do?  HE is also always suggesting the she play with hers when he&#39;s playing with his (even though she may be happily playing Play-Doh, coloring, etc.)<br/>\n<br/>\nNot on to strewing...I&#39;ve been trying SO HARD to strew interesting and new things for both of my kids.  The iPad wins out every. single. time.  Even my 2 year old is exhibiting the &quot;addiction&quot;.  Do I keep trying with him at this point, or should I wait until he comes to me with an interest?  Recently, we got some maps of prehistoric times at Costco, he loved them for about 5 minutes.  We got new games to play...for the whole family to play with him...nope.  Books, paper, painting, crayons, pencils, music, toys...it all lasts minutes to an hour or so, and then he&#39;s on to the iPad again.<br/>\n<br/>\nI&#39;m thinking you might all tell me to just go with the iPad, I think I need to hear that that&#39;s ok or something.  I am still de-schooling, and it&#39;s hard to wrap my mind around the fact that this is ok for a little person who has shown no real interest in reading, writing, numbers, etc.  Just gaming.  :)  Any help is appreciated, lay it on me!</div>","specialLinks":[]}],"prevTopicId":49040,"nextTopicId":49043}}