{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: some progress, I think","postDate":"1334684709","msgId":48365,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4MzUyMTIxQzZAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":48364,"nextInTopic":0,"prevInTime":48364,"nextInTime":48366,"topicId":48364,"numMessagesInTopic":0,"msgSnippet":"... I have allowed myself to yell a few times and I m trying to figure out how I can prevent getting to that point. It s usually when I m getting tired or worn","messageBody":"<div id=\"ygrps-yiv-5118424\"><blockquote><span title=\"ireply\">&gt; So I still have a long way to go, but wanted to share some of my progress. :)<br/>\n </span></blockquote>I have allowed myself to yell a few times and I&#39;m trying to figure out how I can<br/>\nprevent getting to that point. It&#39;s usually when I&#39;m getting tired or worn down<br/>\nby the kids. Instead of staying calm and choosing how I want to respond, I fly<br/>\noff the handle. Even if I can just walk away, that&#39;s a better choice.<br/>\n<br/>\nYelling is fine - as long as it is not aimed at hurting, belittling, scaring others. When I was a kid, my mom would get frustrated and just yell &quot;blblblblblblb&quot; (uh it&#39;s hard to type a random nonsense type sound, kind of the cartooney boogety boogy sound that non-scary ghosts and goblins make, but not that exactly either). When DS was small, less verbal, we encouraged him to yell if he was frustrated - not AT anyone, just a big deep breath and AHHHHHHHHHHH! We even went around and found the best yelling spots in the house (how to get max sound volume!) Yelling serves a purpose - in order to really yell well, you have to take a deep breath all the way and then use all the muscles from feet to hair. Just that process can help relaxation start and add oxygen to the system so you can think more clearly (when one is tense, we tend to breathe more shallowly). If you can say (aloud) &quot;I need to scream right now...I&#39;m going to the scream spot&quot; and then take yourself to a good spot (bathrooms echo really well, as do stairwells) and let a big YELL out. Verbalizing it so as not to startle anyone is helpful too, it lets them know they&#39;re not the target.<br/>\n<br/>\n*       Deb R<br/>\n<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":237699340,"authorName":"Kristie","from":"Kristie &lt;messy_boys@...&gt;","profile":"messy_boys","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"some progress, I think","postDate":"1334622699","msgId":48364,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzQ2MjI2OTkuMTA0MTguWWFob29NYWlsUkNAd2ViMTgxNjEzLm1haWwubmUxLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":48365,"prevInTime":48363,"nextInTime":48365,"topicId":48364,"numMessagesInTopic":0,"msgSnippet":"Hello all, I just wanted to share that we have mostly been having good days.  I ve been reading more about unschooling and think that I am slowly starting to","messageBody":"<div id=\"ygrps-yiv-149122420\">Hello all,<br/>\n<br/>\nI just wanted to share that we have mostly been having good days.  I&#39;ve been <br/>\nreading more about unschooling and think that I am slowly starting to get it and <br/>\nshift my perspective some.  It is so true that the parent needs the most <br/>\ndeschooling!  But I was thinking about math, because that is something that will <br/>\nbe very hard for me to let go of.  And it dawned on me that the difference with <br/>\nunschooling is that you learn what you need to know, when you need to know it.<br/>\n<br/>\nI was also thinking about my school experiences, and how much of all that <br/>\n&quot;learning&quot; I actually use on a day to day basis.  And it&#39;s not much!  I remember <br/>\nbeing in high school and feeling that it was such a waste of time.  I did the <br/>\nminimum that I had to do just so I could get the heck out of there.  I was so <br/>\nrelieved when I graduated!  Finally, I could get on with life!<br/>\n<br/>\nI can really see where I have squashed the love of learning out of my older <br/>\nboys.  Especially my 13 yo.  I am hopeful that it&#39;s not too late for it to come <br/>\nback.  Right now he is enamored with computers and Minecraft, though he has also <br/>\nloved gardening for a long time (wants some apple trees), and told me he is <br/>\nthinking that he might want to be a veterinarian.<br/>\n<br/>\nBut my younger ones, who have been less coerced by me...they just LOVE <br/>\nlearning.  They ask so many questions, to the point of exhausting sometimes!  <br/>\nBut I see that curiosity and drive in them.  I really want them to keep that.<br/>\n<br/>\nThe four youngest have been catching bugs for the last few days.  Any and every <br/>\nbug they can find.  This morning they were still in their PJ&#39;s and wanted to go <br/>\nout immediately.  I was still bleary eyed and hadn&#39;t had my coffee.  In the <br/>\npast, I would have said no...that they needed to get dressed first, etc...But <br/>\ntoday I said yes.  My 7 yr old got dressed voluntarily, but the 5, 4 and 2 yr <br/>\nold went right on out.   Not long after that, they asked to get dressed because <br/>\nit was a little cool outside.  <br/>\n<br/>\n<br/>\nI am a night owl myself and have fought that through the years.  For some <br/>\nreason, I have always believed that it was &quot;right&quot; to get up early and that I <br/>\nwas lazy if I wasn&#39;t up, dressed and ready to go by 8 am.  The last week or so, <br/>\nI&#39;ve been allowing myself to stay up and work on painting my bathroom.  <br/>\nSomething I&#39;ve wanted to finish for a while now.  And then I sleep in with the <br/>\nkids until 9 or so. <br/>\n<br/>\n<br/>\nI actually LOVE our mornings right now.  The four youngest usually end up in bed <br/>\nwith me at some point...and then we cuddle until we&#39;re ready to crawl out and <br/>\nmake coffee.  We then all (yes, all 7 of us) have a cup of coffee together and <br/>\njust zone for a while.  We eat breakfast...if we need showers, we take <br/>\nthem...but it&#39;ll be noon before I&#39;m up dressed and &#39;ready to go.&#39;  That old <br/>\nirrational guilt has tried to poke it&#39;s head out.  I was thinking about the <br/>\nadvice I&#39;ve heard here, when others say that I should look at a belief and &quot;pull <br/>\nit apart.&quot;  So I did that, and I realized that if someone worked a night shift <br/>\nand slept some during the day, no one would say their were lazy!  There really <br/>\nis no right and wrong time to go to bed...only what works for us at the moment!<br/>\n<br/>\nSo I still have a long way to go, but wanted to share some of my progress.  :)  <br/>\nI have allowed myself to yell a few times and I&#39;m trying to figure out how I can <br/>\nprevent getting to that point.  It&#39;s usually when I&#39;m getting tired or worn down <br/>\nby the kids.  Instead of staying calm and choosing how I want to respond, I fly <br/>\noff the handle.  Even if I can just walk away, that&#39;s a better choice.<br/>\n<br/>\nThanks again!<br/>\nKristie<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":48321,"nextTopicId":48366}}