{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":94040812,"authorName":"Lisa H","from":"&quot;Lisa H&quot; &lt;Lmanathome@...&gt;","profile":"lmanathome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"competing needs  WAS Re: video watching advice","postDate":"1103556635","msgId":4455,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTQtREFWMTE4MDgyNzE0OUIyQzdFQUNDNzIzQkQxQTIwQHBoeC5nYmw+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":4454,"nextInTime":4456,"topicId":4455,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1702672831\">&lt;&lt;Jessie wrote: The one thing I&#39;m still struggling with though is my 18 month old who is always wanting to turn the TV off. I think its driving her crazy. <br/>\nUnfortunately our house isn&#39;t big enough to really separate her from <br/>\nthe noise of the tube. How do you deal when you have multiples with <br/>\ncompeting needs?&gt;&gt;<br/>\n<br/>\nOver all, this idea of competing needs, perhaps is the underlying nature of most conflict discussions.  This is confronted in our house amongst not only the children but includes struggles we parents have as well with each other and with our children.  And it certainly comes up in the dynamics between children/adults/parents/professionals/colleagues/state leaders - you get the picture.<br/>\n<br/>\nIts great to see a list like this suggest an idea that alone a family or person might not otherwise have considered - like Wireless headphones.  And if that&#39;s not within the realm of financial or technical feasibility - other options can be discussed and offered until a solution is found that works for *everyone.*<br/>\n<br/>\nWe get into trouble in our house when needs, feelings, ideas, wants are not communicated clearly.  Or a person&#39;s impatience translates into a tone that makes communication difficult as others become defensive and/or feel manipulated by anger.  I&#39;ve experienced (and thankfully have just about outgrown the time) when a young child of mine uses physical force, potentially hurting another, to express frustration because they don&#39;t have the words yet to express their anger, desire, needs, frustration, etc.  For some kids it happens more than others and for others they may outgrow it earlier than the next.   To me it seems more a function of age.  As infants one of our primary forms of communication is through physical means (sucking, grabbing, pushing, pulling, until eventually pointing and ultimately talking).  <br/>\n<br/>\nThat aside, discussions about what one needs, wants, feels generally works well for us.  Sometimes i find myself an advocate for a child who is either too young to have the words that clearly express his/her ideas or another person is not understanding the words expressed.  But beyond that - when all persons involved are given a chance to talk and have the experience of being respected we ALWAYS come up with solutions that work for everyone.  Yes I said ALWAYS and EVERYONE...because it does work BUT only when *everyone* involved is being honest, and feel respected and considered.  Invariably the solutions tend to be different than any one person may have considered from the start.  <br/>\n<br/>\nAnd hey, i don&#39;t want to pretend, we have no conflicts (we are human - not saints)...just sharing one way that we deal with competing needs that works for us.<br/>\n<br/>\nLisa Heyman<br/>\nNY<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":4383,"nextTopicId":4290}}