{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: HELP!!!!!!!!!!","postDate":"1358164518","msgId":49388,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhGMTFFODU3LTQ0RjctNDdEMi1CMkY0LUIxMjI0QjhBMzM1MEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGtkMGhrNitoOW91QGVHcm91cHMuY29tPg==","referencesHeader":"PGtkMGhrNitoOW91QGVHcm91cHMuY29tPg=="},"prevInTopic":49387,"nextInTopic":0,"prevInTime":49387,"nextInTime":49389,"topicId":49369,"numMessagesInTopic":0,"msgSnippet":"... Unless a spouse won t budge, unless it s a state requirement to homeschool, assessment tests are a really bad idea. No matter how certain a person believes","messageBody":"<div id=\"ygrps-yiv-1794938035\">On Jan 14, 2013, at 4:03 AM, lindaguitar wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What would they think of trying some practice tests online, just to see<br/>\n&gt; what kinds of questions there are, and assess their own academic knowledge?<br/>\n<br/>\n </span></blockquote>Unless a spouse won&#39;t budge, unless it&#39;s a state requirement to homeschool, assessment tests are a really bad idea.<br/>\n<br/>\nNo matter how certain a person believes that tests aren&#39;t meaningful, seeing low scores can cause a *parent* to fail ;-) <br/>\n<br/>\nAnd in general kids won&#39;t have the objectivity to disconnect. In states where testing is mandatory, &quot;The test is a hoop we all just have to jump through&quot; is part of the fabric of life. Those unschooling kids will hear it many times from their parents. They&#39;ll hear other unschooling kids and moms say the same thing.<br/>\n<br/>\nBut for everyone else, &quot;Let&#39;s take this test to see how well you do even though it doesn&#39;t mean anything,&quot; is tempting a can of worms that doesn&#39;t need opened unless someone&#39;s backed into a corner.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  If you are the one with custody, then you are the one who has the legal<br/>\n&gt; right to choose whether to homeschool or not, and how to homeschool.<br/>\n<br/>\n </span></blockquote>This is *really* bad advice.<br/>\n<br/>\nUnless someone has *sole legal custody* they don&#39;t have the legal right to make the choices. Far more common is legal custody that&#39;s joint, where husband and wife need to agree.<br/>\n<br/>\nOnce a marriage has broken down, it&#39;s a rare case where the trust survives too. It takes trust to unschool. Unschooling is weird. It&#39;s counter to what everyone else is trusting. Ex-spouses want to trust their kids are getting the best care. If the other spouse is doing something the ex-spouse was willing to go along with during the marriage to keep the peace, the other spouse needs to work extra hard to help ease the ex-spouse&#39;s fears. It&#39;s a courtesy and just common sense.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If there&#39;s some concern about the kids&#39; self-esteem, then maybe you could<br/>\n&gt; get him to give the kids a year to do some &quot;catching up&quot; before taking any kind of tests.<br/>\n<br/>\n </span></blockquote>I&#39;d be wary of making deals with a deadline without knowing whether I could honor them or not!<br/>\n<br/>\nI suspect you find test taking for your kids not a big deal since it&#39;s a periodic part of your lives. But you&#39;ve said the scores aren&#39;t even looked at. Knowing a year down the road that an ex-husband will cause an even bigger stink if the kids don&#39;t do well on tests isn&#39;t likely to make a joyful next year. It&#39;s going to be full of worry and tension.<br/>\n<br/>\nUnschooled kids do great in the elementary years when skills and knowledge are compared with school. They tend to fall behind during the middle school years because academics in school become more focused. In high school, unschooled kids tend to shine once again, though it may or may not be reflected on standardized tests. <br/>\n<br/>\nAt 10 and 13, no matter how much they&#39;re learning, what they&#39;re learning very likely won&#39;t match what&#39;s on the tests.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There are lots of private schools in the U.S. that don&#39;t follow a standard public school curriculum.<br/>\n&gt; When their kids take standardized tests, the come out ahead in some areas and behind<br/>\n&gt; in others. That&#39;s OK with the parents, because they know that the school follows a different curriculum. <br/>\n<br/>\n </span></blockquote>There&#39;s also Sudbury Schools. They aren&#39;t all like the original in Massachusetts but they are the most unschool like schools.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Homeschoolers have the right to choose their own methods and schedules for learning.<br/>\n<br/>\n </span></blockquote>Not true. Unschoolers in some states have to do a lot of contortions to make their home education look like what the state requires. Discussion of those contortions is best left to the experts in those states.<br/>\n<br/>\nAnd this is an international list. Homeschooling is difficult in some countries. It&#39;s even illegal in some countries.<br/>\n<br/>\nThinking in terms of rights is a slippery slope. It&#39;s especially slippery on a list where members may be in other countries.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It doesn&#39;t make sense to expect them to be at the same level as students in public schools,<br/>\n<br/>\n </span></blockquote>It may not make sense, but often emotions don&#39;t listen to sense. If a mom is taking a stance to convince her ex she&#39;s right, it&#39;s far more likely to trigger his defenses. It&#39;s what humans do when they feel their ideas are being attacked. And they&#39;ll tend to protect their ideas from being ripped away, even if they have doubts about them! It&#39;s a matter of holding onto what&#39;s yours and not losing. It&#39;s human nature.<br/>\n<br/>\nIt&#39;s hard enough to make taking a stance work in an intact marriage, let alone a broken one! Best to avoid getting into a struggle at all. Better to learn how to approach disagreements with an eye towards working together.<br/>\n<br/>\nBetter -- better for all relationships -- is to take a spouse&#39;s feelings seriously, just as seriously as you take a child&#39;s feelings. Even if you don&#39;t agree with them. You don&#39;t need to agree in order to sympathize and understand why someone might feel that way.<br/>\n<br/>\nEven if he doesn&#39;t believe the kids should be keeping up with school, he&#39;s concerned about his kids. He wants *something* to help him feel less concerned. Better to find something that will help him that the mom knows she can do.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It doesn&#39;t seem likely that there could be any legal consequences for them<br/>\n&gt; not scoring well on a test, since the homeschooling laws in most states<br/>\n&gt; don&#39;t require certain test scores to be allowed to continue homeschooling.<br/>\n<br/>\n </span></blockquote>If she doesn&#39;t have sole legal custody, the husband can go back to court. A judge is highly unlikely to think poor tests scores are no more meaningful than failing at Jeopardy.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: HELP!!!!!!!!!!","postDate":"1358154182","msgId":49387,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtkMGhrNitoOW91QGVHcm91cHMuY29tPg=="},"prevInTopic":49385,"nextInTopic":49388,"prevInTime":49386,"nextInTime":49388,"topicId":49369,"numMessagesInTopic":0,"msgSnippet":"Lora, What do your kids think of the idea of taking a test? What would they think of trying some practice tests online, just to see what kinds of questions","messageBody":"<div id=\"ygrps-yiv-1267283005\">Lora,<br/>\n<br/>\nWhat do your kids think of the idea of taking a test? What would they think of trying some practice tests online, just to see what kinds of questions there are, and assess their own academic knowledge? Just out of curiosity, like a game?<br/>\n<br/>\nHow much will the results &quot;matter&quot;? If you are the one with custody, then you are the one who has the legal right to choose whether to homeschool or not, and how to homeschool. For legal purposes, unschooling is just a style of homeschooling. If you comply with state homeschooling laws, test scores don&#39;t matter. Unschoolers can be in compliance in every state.<br/>\n<br/>\nHere in GA, homeschoolers are supposed to give their kids some kind of standardized test every three years. Unschoolers who comply with the law usually tell their kids that they have a choice of either trying to take the test seriously, or just randomly filling in the bubbles, or making some kind of pattern with them, etc. But in GA, the state law says nothing about results. We don&#39;t have to send the scores in to anyone. Just keep them for our records for at least three years.<br/>\n<br/>\nWhat kind of relationship does your ex have with you, and with the kids? Is he the type to make the kids feel bad about themselves if they&#39;re not up to their &quot;grade level&quot; in one or more subjects? If there&#39;s some concern about the kids&#39; self-esteem, then maybe you could get him to give the kids a year to do some &quot;catching up&quot; before taking any kind of tests.<br/>\n<br/>\nThere are lots of private schools in the U.S. that don&#39;t follow a standard public school curriculum. When their kids take standardized tests, the come out ahead in some areas and behind in others. That&#39;s OK with the parents, because they know that the school follows a different curriculum.  <br/>\n<br/>\nIn the public schools, half of the students score &quot;below average&quot; on standardized tests - by the very definition of the term &quot;average&quot;! This doesn&#39;t mean that half of the kids in the schools are stupid, uneducated, or &quot;bad students&quot;. It&#39;s just the way the tests are designed. Tests scores for NON-public school kids are even more meaningless than they are for kids who DO attend the schools.<br/>\n<br/>\nHave you ever read the book &quot;What Does it Mean to Be Well Educated? And Other Essays on Standards, Grading, and Other Follies&quot;, by Alfie Kohn? I highly recommend it. It may help alleviate your worries, help you deal with your ex (if he&#39;s the type to consider the point of view of a well-known educator/author), and help you help your kids feel OK about tests if they do have to take them. It is, ultimately, just an assessment, and not much different than a trivia game.<br/>\n<br/>\nIf your kids do take a test, and don&#39;t score well, it only shows what you probably already know - that the things they&#39;re good at and know about aren&#39;t the things that the test tests for.<br/>\n<br/>\nHomeschoolers have the right to choose their own methods and schedules for learning. Unschooling, as a method of homeschooling, allows kids to learn on their own natural timetable, in the ways that work best for them. It gives them the freedom to choose from a whole world of knowledge! It is unlimited education! <br/>\n<br/>\nIt doesn&#39;t make sense to expect them to be at the same level as students in public schools, any more than it makes sense to expect kids in public schools to be able to score well in tests in Hebrew just because that&#39;s what the kids learn in the private Jewish day schools, or to score well in tests of art and creativity just because that&#39;s what the kids in the Waldorf schools focus on.<br/>\n<br/>\nKnowing that any comparison is meaningless, just look at the tests as nothing more than a random trivia quiz. Like seeing how many of the questions you can answer on the show &quot;Jeopardy&quot;. It doesn&#39;t seem likely that there could be any legal consequences for them not scoring well on a test, since the homeschooling laws in most states don&#39;t require certain test scores to be allowed to continue homeschooling.<br/>\n<br/>\nHopefully you can persuade their dad not to make a big deal of test scores. But if he does, you are there to reassure your kids that there is value in what they DO know, and in how the spend their time, and that unschoolers all over the world have an advantage when they grow up, because they know WHO they are, what they&#39;re interested in, and how to be self-directed in learning and pursuing their goals. &quot;Keeping up&quot; with one&#39;s grade level, especially at the age of 10 or 13 - doesn&#39;t really mean much in life.<br/>\n<br/>\nLinda<br/>\n  <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Lora P&quot;  wrote:<br/>\n&gt;<br/>\n&gt; OK, I have been unschooling since the beginning.  Now I am a single mom and the ex has decided the boys need to be &quot;tested&quot; to see where they are.  Uh, they are not necessarily going to test on the comparison scale with the public school kids.  We are in Florida and are under and umbrella school for that very purpose.  Now I am worried.  They don&#39;t know stuff that they will be tested on.  They are 13 and 10.  That would mean they should be in what, 7th and 4th?  I am sick to my stomach.  I don&#39;t think he would go after custody, but he feels they &quot;need&quot; the testing.  UGH UGH UGH...<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Helping with Concern/Disconnect  was  Re: HELP!!!!!!!!!!","postDate":"1358115952","msgId":49385,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtjdmM5ZytuYmFkQGVHcm91cHMuY29tPg=="},"prevInTopic":49382,"nextInTopic":49387,"prevInTime":49384,"nextInTime":49386,"topicId":49369,"numMessagesInTopic":0,"msgSnippet":"... ************* It could help to think about what sorts of things your ex-husband likes - maybe he s not a reader, so a blog wouldn t be so good, but","messageBody":"<div id=\"ygrps-yiv-1865010444\">&quot;messy_boys&quot;  wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I wanted to ask if you all had any more ideas on providing ways for others to feel more connected.  This idea [keep a blog] was really helpful to me, as I am having the same problems with my ex-husband.<br/>\n </span></blockquote>*************<br/>\n<br/>\nIt could help to think about what sorts of things your ex-husband likes - maybe he&#39;s not a reader, so a blog wouldn&#39;t be so good, but pictures? Either online or make them into postcards and send them via real mail? Would the kids like to do or make things for him now and then? Does he have hobbies they can share in some way? <br/>\n<br/>\nPast a certain point, though, it&#39;s going to be up to him to reach out and connect. I wouldn&#39;t want you to get your kids hopes up about something and have dad fall through... that was an ongoing issue we had with Ray&#39;s bio mom when he was little - lots of promises and &quot;interest&quot; but no follow-through, and he&#39;d be crushed. What helped to boost her relationship with Ray was actually for me and George to have nothing whatsoever to do with any of her interests so they could be all about her and her kid, with no shadow of &quot;the others&quot; to ruin it for her. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Although I believe a lot of his issue is simply a desire to cause problems...<br/>\n </span></blockquote>***************<br/>\n<br/>\nThe desire to cause problems comes from deep insecurity. You can&#39;t fix that and shouldn&#39;t try - it will only drag you down into crazy. What you can do is look for ways to leave him a feeling of safety wrt his relationship with his children. What&#39;s important to him? Is there something you can do (or avoid) which might let him feel less threatened in that area of his life?<br/>\n<br/>\nDealing with a hugely insecure Ex is incredibly difficult because you actually have to see your child&#39;s relationship with that person as being more about the adult than your child. The relationship will get better when the adult feels better about life and worse when the adult feels unhappy or threatened or uncertain. And that sucks! but it&#39;s one of the real life limits some people have - a parent whose love is  conditional on that parent&#39;s happiness. The good news is that being kind and generous and supportive helps your kids to know that it&#39;s not their fault, it&#39;s the other person who is broken.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":237699340,"authorName":"messy_boys","from":"&quot;messy_boys&quot; &lt;messy_boys@...&gt;","profile":"messy_boys","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Helping with Concern/Disconnect  was  Re: HELP!!!!!!!!!!","postDate":"1358092544","msgId":49382,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtjdWxlMCtoaWo5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk3Mzg1RDI0LTJFMDgtNDE4NC1CMTZDLTBDNTRGQ0E1MzZGNkB2ZXJpem9uLm5ldD4="},"prevInTopic":49371,"nextInTopic":49385,"prevInTime":49381,"nextInTime":49383,"topicId":49369,"numMessagesInTopic":0,"msgSnippet":"I wanted to ask if you all had any more ideas on providing ways for others to feel more connected.  This idea (below) was really helpful to me, as I am having","messageBody":"<div id=\"ygrps-yiv-2024081974\">I wanted to ask if you all had any more ideas on providing ways for others to feel more connected.  This idea (below) was really helpful to me, as I am having the same problems with my ex-husband.  Although I believe a lot of his issue is simply a desire to cause problems...I would still like to do what I can on my end to provide him the opportunity to be connected to the kids&#39; day to day lives.<br/>\n<br/>\nThanks,<br/>\nKristie<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joyce Fetteroll  wrote:<br/>\n&gt;<br/>\n&gt; he&#39;s concerned and feeling disconnected. He&#39;s cut off from the day to day goings on and can&#39;t see what&#39;s happening. Take that feeling as seriously as you would your kids feeling concerned and disconnected.<br/>\n&gt; <br/>\n&gt; Think how you&#39;d feel if you were cut off from your kids, depending entirely on your husband to see to their welfare. And what if the kids were saying odd things that suggested their father was being neglectful -- even though he really wasn&#39;t.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Try starting a blog of what you guys are doing, update it regularly so he can see pictures and read about what they&#39;re doing. Ask him if he would try that out for a while and see if it eases his worries.<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] HELP!!!!!!!!!!","postDate":"1357910494","msgId":49371,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk3Mzg1RDI0LTJFMDgtNDE4NC1CMTZDLTBDNTRGQ0E1MzZGNkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGtjbjFmNCtrc2gxQGVHcm91cHMuY29tPg==","referencesHeader":"PGtjbjFmNCtrc2gxQGVHcm91cHMuY29tPg=="},"prevInTopic":49370,"nextInTopic":49382,"prevInTime":49370,"nextInTime":49372,"topicId":49369,"numMessagesInTopic":0,"msgSnippet":"... Two unschooling friendly options are Oak Meadow curriculum and Clonlara. ... As Meredith said, he s concerned and feeling disconnected. He s cut off from","messageBody":"<div id=\"ygrps-yiv-1733498472\">Meredith:<br/>\n<blockquote><span title=\"ireply\"> &gt; Look into other kinds of<br/>\n&gt; homeschooling and see what you can negotiate with him.<br/>\n<br/>\n<br/>\n </span></blockquote>Two unschooling friendly options are Oak Meadow curriculum and Clonlara.<br/>\n<br/>\nLora:<br/>\n<blockquote><span title=\"ireply\"> &gt; Now I am a single mom and the ex has decided the boys need to be &quot;tested&quot; to see where they are. <br/>\n<br/>\n<br/>\n </span></blockquote>As Meredith said, he&#39;s concerned and feeling disconnected. He&#39;s cut off from the day to day goings on and can&#39;t see what&#39;s happening. Take that feeling as seriously as you would your kids feeling concerned and disconnected.<br/>\n<br/>\nThink how you&#39;d feel if you were cut off from your kids, depending entirely on your husband to see to their welfare. And what if the kids were saying odd things that suggested their father was being neglectful -- even though he really wasn&#39;t.<br/>\n<br/>\nUnschooling from the outside can sound like neglect. Kids will say things like they don&#39;t do anything when they mean they don&#39;t do any school work. Or they&#39;ll say they play video games all day when they&#39;re really deeply involved in solving puzzles. Or say mom never feeds them, when really she&#39;s attentive to their hunger and makes food readily available more than she makes formal meals.<br/>\n<br/>\nHe&#39;d like to feel more connected. Talk to him about it. Suggest that since unschooling follows a much different order and path that tests will focus on what they don&#39;t know but miss entirely the more important things they&#39;ve been learning instead. <br/>\n<br/>\nTry starting a blog of what you guys are doing, update it regularly so he can see pictures and read about what they&#39;re doing. Ask him if he would try that out for a while and see if it eases his worries.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: HELP!!!!!!!!!!","postDate":"1357842724","msgId":49370,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtjbjFmNCtrc2gxQGVHcm91cHMuY29tPg=="},"prevInTopic":49369,"nextInTopic":49371,"prevInTime":49369,"nextInTime":49371,"topicId":49369,"numMessagesInTopic":0,"msgSnippet":"This is cross-posted, so I m just cutting and pasting my reply from the other list, for the sake of continuity if this thread goes anywhere. Can you exert any","messageBody":"<div id=\"ygrps-yiv-1465457023\">This is cross-posted, so I&#39;m just cutting and pasting my reply from the other list, for the sake of continuity if this thread goes anywhere.<br/>\n<br/>\n<br/>\nCan you exert any influence over which test will be used or whether you can do some<br/>\nother evaluative process instead? Divorce can be a huge impediment to<br/>\nunschooling and even homeschooling - in many ways a divorced father, in<br/>\nparticular, has more of a &quot;say&quot; in the education of his children than if he&#39;s<br/>\nmarried, and that can be a good thing. It&#39;s important to see him as concerned<br/>\nabout his kids&#39; wellbeing and using what power he has to assure it.<br/>\n<br/>\n<br/>\n<br/>\nIf your children&#39;s father wants them to be tested your options are limited to<br/>\nwhat results will satisfy Him. And that may mean that it would be better to agree to<br/>\nsomething other than unschooling in the future. If you&#39;ve been drawing a line in the sand and<br/>\nsaying &quot;we Will unschool&quot; then back off from that. Look into other kinds of<br/>\nhomeschooling and see what you can negotiate with him. Maybe a different<br/>\numbrella school, one that offers a curriculum and regular evaluations, would be<br/>\nmore reassuring to him. Maybe he&#39;d feel better with some kind of online school.<br/>\nIf you&#39;ve burned your bridges and can&#39;t negotiate, though, or if you think he&#39;s<br/>\nonly trying to be an ass and jerk your chain, your best option is likely to put<br/>\nthem in school. Even there, many states now have an online options where your<br/>\nkids actually use the school&#39;s curriculum, so you may have some wiggle room.<br/>\n<br/>\n<br/>\nI absolutely don&#39;t recommend &quot;standing firm&quot; about unschooling - it&#39;s not worth<br/>\nit. Unschooling doesn&#39;t exist without a certain amount of peace and harmony, and<br/>\nmaking your kids&#39; education into a battleground doesn&#39;t do that.<br/>\n<br/>\n<br/>\nSpecific information about specific states, countries, provinces, and tests are<br/>\nbetter addressed at the local level. Know your local laws and loopholes. It may<br/>\nbe better, for instance, to register with the state, test, and jump through<br/>\nwhatever hoops the state requires - for instance in some states, your kids can<br/>\nbe a great deal &quot;behind&quot; before the state even raises an eyebrow. Check with<br/>\nlocal resources about that, though.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":162651771,"authorName":"Lora P","from":"&quot;Lora P&quot; &lt;lcmpek@...&gt;","profile":"lcmpek","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"HELP!!!!!!!!!!","postDate":"1357825760","msgId":49369,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtjbWd0MCtpa2ZyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":49370,"prevInTime":49368,"nextInTime":49370,"topicId":49369,"numMessagesInTopic":0,"msgSnippet":"OK, I have been unschooling since the beginning.  Now I am a single mom and the ex has decided the boys need to be tested to see where they are.  Uh, they","messageBody":"<div id=\"ygrps-yiv-221188813\">OK, I have been unschooling since the beginning.  Now I am a single mom and the ex has decided the boys need to be &quot;tested&quot; to see where they are.  Uh, they are not necessarily going to test on the comparison scale with the public school kids.  We are in Florida and are under and umbrella school for that very purpose.  Now I am worried.  They don&#39;t know stuff that they will be tested on.  They are 13 and 10.  That would mean they should be in what, 7th and 4th?  I am sick to my stomach.  I don&#39;t think he would go after custody, but he feels they &quot;need&quot; the testing.  UGH UGH UGH...</div>","specialLinks":[]}],"prevTopicId":49357,"nextTopicId":49381}}