{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":150527288,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Learning--rather than punish","postDate":"1089513961","msgId":1756,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjcTlsOStjYThsQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":1755,"nextInTime":1757,"topicId":1756,"numMessagesInTopic":0,"msgSnippet":"Your 100% right though, for most adults, if they had dropped the eggs they would have done little more then say sorry. But we Hubby and I try to be a little","messageBody":"<div id=\"ygrps-yiv-114324961\">&quot;Your 100% right though, for most adults, if they had dropped the<br/>\neggs they would have done little more then say sorry. But we Hubby<br/>\nand I try to be a little more mindful then that and so we might have<br/>\ndone something more, like make dinner, do the dishes, wash the<br/>\nfloor. &lt;&lt;&lt;&lt;&lt;&quot;<br/>\n<br/>\nThis sounds to me like there is a lot of punishing oneself in your <br/>\nfamily. Why wouldn&#39;t &quot;sorry&quot; be enough? We like to do nice things <br/>\nfor each other from a place of love and joy, not guilt and &quot;owing&quot;.<br/>\n<br/>\nI don&#39;t feel a need to make up for anything if I accidentally break <br/>\nsomething, it&#39;s just an accident. Accidents shouldn&#39;t get too much <br/>\nattention....it just causes internalized guilt.<br/>\nYou&#39;re putting a lot of pressure on a very little person and <br/>\nteaching her she is responsible for things she is NOT responsible <br/>\nfor. Daddy&#39;s anger is being internalized, trust me.<br/>\n<br/>\nNo person is responsible for another person&#39;s feelings. To teach <br/>\nyour child otherwise is very unhealthy. I know this is a lot being <br/>\nthrown at you all at once, and I know you are trying very hard to <br/>\nmake changes. I think some of these patterns are family patterns <br/>\nthat we aren&#39;t even aware of until someone points it out, so no <br/>\nguilt for you either, but maybe something to start thinking about.:)<br/>\n<br/>\nAround here, we are a team. Accidents aren&#39;t a reason to make <br/>\nsomeone feel badly, the person feels bad already and we help them <br/>\nclean up and feel ok about it. My dh doesn&#39;t hold things over my <br/>\nhead, I don&#39;t hold them over his, and ditto for the kids. We&#39;re <br/>\nlearning together, striving to do better all the time. That doesn&#39;t <br/>\nmean we don&#39;t get frustrated by messes sometimes, but we try really <br/>\nhard to catch ourselves and make sure the child knows we aren&#39;t <br/>\nblaming them and that we do the same things ourselves.<br/>\n<br/>\nIf I wrecked Markus&#39;s car, I would feel really, really awful. I <br/>\nwouldn&#39;t be expected to replace it on my own, or spend some amount <br/>\nof time trying to make up for it. I would want to help fix it, <br/>\nbecause that&#39;s what families do. He would be upset about the car, <br/>\nbut we would all work together for the good of everyone here.<br/>\n<br/>\nBeing a team, a support system, means working together. It involves <br/>\nunderstanding and empathy. I think your dh would do really well to <br/>\ntry and read up on child development a bit. It sounds like he has <br/>\nreally high expectations for your dd. It also sounds like he&#39;s <br/>\nventing his own childhood trauma somewhat. It might take a ton of <br/>\nmodeling kindness and deep respect for you, in order for it to rub <br/>\noff on him...but it can be done! <br/>\n<br/>\nI think it was really, really great that you put your foot down when <br/>\nhe was on his tirade. You stood up for your dd, who couldn&#39;t stand <br/>\nup for herself...that&#39;s really important. You did a good thing.<br/>\nI would have said, &quot;Hey, eggs get broken&quot; and told her a story of <br/>\nwhen I broke something. Eggs are cheap. They aren&#39;t worth harming <br/>\nthe fragile emotions of a child.<br/>\nGo buy two dozen really cheap eggs. Throw them against a tree, or <br/>\ndrop them from a deck. Tell her that eggs can be replaced, but she <br/>\ncan&#39;t and that the important thing is the love you all share. <br/>\n<br/>\nIf your dh is going to get really pissed about eggs, I have to warn <br/>\nyou, the older children get, the more expensive the breaks!:)<br/>\nWe&#39;ve lost windows, fragile things, food (hell, Jalen dumped a $7 <br/>\nbag of dried blueberries today) and eventually CARS.<br/>\nIt&#39;s just stuff.<br/>\nTrevor made a huge error and left $2,000 worth of camera and video <br/>\nequipment on the back of my car, when he was supposed to put it IN <br/>\nthe car. It was all destroyed...all but one really old camera. I <br/>\nstill mourn for my equipment! But as he cried, knowing how much it <br/>\nsaddened me to lose it, I simply hugged him and said &quot;Trevor, these <br/>\nkind of things happen in life, it&#39;s stuff I loved, but it&#39;s stuff I <br/>\ncan replace. I&#39;m really, really glad nothing bad happened to one of <br/>\nyou, I can&#39;t replace the people I love.&quot; and also &quot;that camera <br/>\nequipment could never be as important as your feelings, you matter <br/>\nmore to me than anything I own.&quot;<br/>\nIt helped a lot. He already felt absolutely horrible. There was no <br/>\nreplacing that equipment by making him feel worse!  If you live to <br/>\nbe my age, and not destroy something valuable, plus a lot of <br/>\ninvaluable things, then you are unusual. You might as well accept <br/>\nthese accidents as part of life, and allow her the freedom of <br/>\nknowing she is still a good, wonderful person, in spite of making <br/>\nmistakes.<br/>\nHaving her &quot;make up&quot; for accidents is setting her up for emotions <br/>\nand unhealthy patterns that need to stop.<br/>\n<br/>\n<br/>\nRen</div>","specialLinks":[]}],"prevTopicId":1754,"nextTopicId":1762}}