{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":279433414,"authorName":"Carrie Kimball","from":"&quot;Carrie Kimball&quot; &lt;ckmidwife@...&gt;","profile":"lelania1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: balancing self care and kids needs","postDate":"1171722569","msgId":21490,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGUwMWM3NTJhMCQwOGVhODI2MCQzNTAwYThjMEBLaW1iYWxsRmFtaWx5Pg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":21489,"nextInTime":21491,"topicId":21490,"numMessagesInTopic":0,"msgSnippet":"... could watch a movie, he said sure. But if he d wanted me to stop doing the dishes, I would have. There is nothing in my life more important than Simon or","messageBody":"<div id=\"ygrps-yiv-1521202630\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;I asked if I could quickly finish the dishes and then we <br/>\n </span></blockquote>could watch a movie, he said sure. But if he&#39;d wanted me to stop doing the <br/>\ndishes, I would have. There is nothing in my life more important than Simon or Linnaea. Nothing <br/>\nthat I am not willing to juggle around their needs.&gt;&gt;&gt;<br/>\n<br/>\nI have been struggling with this lately. When my first was born, people always chastised me for &quot;holding him too much&quot; and so forth, and asked me how I ever got anything done. I think thats BS, and still do, but also really struggled over the intervening years with the increasing chaos certain aspects of our lives became. I took Alistair everywhere with me, and it was great. When he got to be a toddler, it didn&#39;t work to bring him to appointment with clients anymore so he would hang with friends and their kids. But I worked the absolute bare minimum I thought I needed to, which turned out not to be enough. So then all this stress started creeping in because as time went by our finances got more stretched and pained. <br/>\n   <br/>\n In our environment, I didn&#39;t really mind the unwashed dishes, the piles of laundry for the most part, but it got progressivey worse as time went by and started making me a bit nutty because I could never find something when I needed it and so forth. I was the parent who pulled over everytime he was unhappy in his car seat, even if it took us an hour to go 8 miles to town. I wouldn&#39;t do the dishes, cook food and so forth because he needed my attention. And a lot of days it all worked out, but many days were really stressfull because I couldn&#39;t get things done that were essentially tied to basic functioning. So their dad would get home at the end of the day, and there would be all this tension, and energy about me being a bad housewife, and he would kick into high gear and clean the house and cook and stuff. He was always saying he got it- that the baby needed and wanted me to hold him, to nurse all day sometimes, to play with him, but over time there was this depletion that happened in our bank of reserves. But even if I could go back, I wouldn&#39;t change a thing about my relationship with Alistair.<br/>\n    With two kids, I feel like it just spiraled completely out of control. Food was maybe the biggest problem, and the only solutions I got were to put him down and let him cry, or order in and eat quick foods. So I opted for the later, and the financial problems spiraled again because we couldn&#39;t afford it. Babywearing helped, involving the kids helped, and what really really helped was www.flylady.com. Because I could often chunk things down into 15 minute intervals, and make steady progress over the day to an actual meal at the end. When I got a giant crock pot, that really helped too. <br/>\n<br/>\nSo now, we have really different lives than when I was attachment parenting a baby and toddler with a co-parent in the house, in that I DO put the kids off a lot and hate that. Or I find myself feeling angry or frustrated because they &quot;won&#39;t let me&quot; eat, and its a breathing exercise to talk my way out of that unhelpful thinking.<br/>\nI see myself seesawing back and forth between two ways of being- one where they are the first priority in my life, and in every moment I am responsive and focused there, and then this burnout period where I realize I haven&#39;t been paying enough attention to keeping my house, made time to pay my bills, prepared healthy foods and some crisis ensues, so I try and get disciplined and tell the kids I can play with them &quot;later&quot; so I can get the whole way through the dishes, or finish making food, or paying bills, or get laundry in. And added to that, study for my classes. And the whole time that is going on, I can see their dissapointment and feel exactly what you are saying- the message is that ceramic dishware being clean is more important than you. And that isn&#39;t true.<br/>\nI feel like my whole life as a parent has been an exercise in finding a &quot;system&quot;. Some magic way that I will be able to juggle all of this busy work, while also focusing on my kids. I tried for a long time to just say that the busy work didn&#39;t matter, and then the stress that stemmed from the chaos would affect my interactions with them as well. So I would see that and say &quot;I really need to get more organized, because it isn&#39;t fair to them to be irritable and dragging them all over the place because I have to pay this thing today!&quot; I had a really big shock this week, which was that some lab tests came back abnormal and it seems like I have a pre-cancerous condition going on. And I am not really scared, because its totally treatable, and won&#39;t become cancer, but it just kind of shocked me into looking at how I care for me. And whats happening elsewhere in my body that there isn&#39;t a test for? SO its interesting to read this this morning, as last night I was engaged in conversation with a friend who was admonishing me that I needed to stop making excuses about my diet, exercise, sleep, stress. I need to leave the kids more, even if they don&#39;t want it, because I need to take care of myself. And on some level I think she&#39;s right, I want the kids to have a mother period, as long into their lives as possible, and I also really feel that life IS those seemingly small moments- when Alistair wants to build something he imagined RIGHT NOW! It is so intense and real for him.<br/>\n<br/>\nI don&#39;t have a solution, maybe it just all keeps getting easier and working its way out. <br/>\nCarrie<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":21445,"nextTopicId":21437}}