{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":2346607,"authorName":"ohpurple1@aol.com","from":"ohpurple1@...","profile":"openmindedfamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Re:OT: Regarding dog ownership","postDate":"1171105949","msgId":21355,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMxOS4xMDA1MzZlZS4zMmZmMDI5ZEBhb2wuY29tPg=="},"prevInTopic":21349,"nextInTopic":0,"prevInTime":21354,"nextInTime":21356,"topicId":21248,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/9/2007 9:38:05 PM Eastern Standard Time, godzilla.matthews@verizon.net writes: I do want to let you know that the dog is with the dad of","messageBody":"<div id=\"ygrps-yiv-1724830313\">In a message dated 2/9/2007 9:38:05 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:godzilla.matthews@...\">godzilla.matthews@...</a> writes:<br/>\nI do want to let you know that the dog is with the dad of the owners <br/>\nwho had to give him up because of a move. He&#39;s not in rescue or <br/>\nanything<br/>\n<br/>\n<br/>\n<br/>\nHi Tonya,<br/>\n<br/>\nIts taken me awhile to respond to this but here&#39;s a story.  My kids had <br/>\nbegged for a dog for years.  With the rabbits and fish and other critters we&#39;ve <br/>\nhad, the responsibility for their care has always been up to me so I was sure I <br/>\ndidn&#39;t want to add a dog to the mix.  One day last summer I saw an ad on <br/>\nfreecycle from a family who was desperate to find a loving home for their <br/>\nkid-friendly, 4 year old black lab.  After considering it for a few days, I responded to <br/>\nthe ad with a bunch of questions.  The family had two young children (3 and <br/>\n4) who loved the dog, rode on him etc.  They were unable to keep the dog due to <br/>\ntheir living situation.  We went, just to meet the dog, that afternoon and <br/>\nfigured out from the appearance of things that these people were either about to <br/>\nbecome homeless or were moving in with someone.  The dog had not been to the <br/>\nvet in years, had no rabies shots or heartworm tests, etc.  He was a <br/>\nbeautiful, overweight black lab with a shabby coat and some serious, flaky excema.  We <br/>\ntook him home.  On the ride, he puked all over our van--his fat stomach was <br/>\nfull of grapes (he had been eating from their yard) and rock hard chunks of <br/>\nItalian bread.  They had no dog food or bowls or a leash for the dog.  We <br/>\nimmediately brought him to the vet and he got caught up on his shots and got a clean <br/>\nbill of health except that he weighed 88 lbs which was a bit overweight.  He&#39;s <br/>\nbeen with us since July and we have NO regrets.  He warns us of any intruders <br/>\nor passersby.  My husband works odd hours so it has been very reassuring <br/>\nhaving our watch dog here to let us know when someone is coming.  He is very <br/>\nprotective of the children and I have no doubt that if a coyote came into the yard <br/>\n(or anyone) he would kill to protect them.  His one tragic flaw is that he <br/>\nlikes his freedom and does not come when we call him.  Thanks to our dog whisperer <br/>\nfriend who has been helping us train him, he is doing better but not <br/>\ncompletely.  I still chase him around the neighborhood at least once a week but it <br/>\nused to be ten times a day.<br/>\n<br/>\nHere&#39;s the most telling story about how much we love this dog; his name is <br/>\nLucky.  My three year old has never really had an indoor animal.  When she was <br/>\nborn we had two cats but both met their demise in our yard with some coyotes so <br/>\nshe has had very limited interaction with cats and dogs.  In the beginning <br/>\nshe was constantly torturing the dog, squeezing her arms tightly around his neck <br/>\nand calling it hugging, yanking him around on the leash, pulling his tail and <br/>\nso on.  The worst thing she did was that she occasionally grabbed his penis, <br/>\nthe red, sensitive part that pops out (we call it his lipstick).  He usually <br/>\nyelped and we corrected her and told her that that was his private penis and <br/>\nthat it hurt him when it was touched.  One night she got him good.  We were all <br/>\nsitting right there but nobody is exactly sure what she did to cause him to <br/>\nyelp in pain and lash out at her.  The dog bit her face, scraping his canine <br/>\nteeth and his tiny front teeth across her cheek.  We all freaked out and we found <br/>\na new home for the dog.  The family that was planning to take Lucky needed a <br/>\nweek to prepare for his arrival so we agreed to keep him away from our three <br/>\nyear old until they could come for him.  During that week I mourned the loss of <br/>\nhim and we realized we loved him so much (the kids and I cried daily about <br/>\nparting with him) and that we would never find a dog that would be as perfect <br/>\nfor us as he was.  We decided to give it another shot and be hyper vigilant when <br/>\nthe 3 year old was around him.  It has been months since the bite and most <br/>\npeople think we were nuts to &quot;sacrifice&quot; our daughter&#39;s face and keep the dog, <br/>\nbut we have no regrets.  The baby is completely healed (no scars) and the dog <br/>\nis hers.  He guards her 24/7 and sleeps at the foot of the bed/couch/hammock <br/>\nwherever she is.  She has learned to respect him and has not tried to grab his <br/>\npenis or hurt him since his reaction.<br/>\n<br/>\nAnyway Tonya,  let your kids get the dog!  I&#39;d take a vote and agree to go <br/>\nwith what the majority decides.  Kids (families) need dogs!<br/>\n<br/>\nMy alcoholic neighbor, a MA state trooper, used to lurk around our yard at <br/>\nnight.  I&#39;d find his cigarette butts in my driveway and would often smell smoke <br/>\nwafting through the windows at night while my husband was working.  We live <br/>\nfar enough from each other that we cannot smell his smoke or even hear each <br/>\nother if we stay in our own yards. He has even been in our pool on hot summer <br/>\nnights, drunk and without permission. He had become a liability and we installed <br/>\nmotion sensored lighting just for him.  Since we got Lucky, he has stopped <br/>\nlurking.  Just another reason to have an alert dog around.<br/>\n<br/>\nGo for it!  What have you got to lose?<br/>\n<br/>\nLove,<br/>\nRobin<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224193221,"authorName":"Tonya Matthews","from":"&quot;Tonya Matthews&quot; &lt;godzilla.matthews@...&gt;","profile":"auburntonya","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:OT: Regarding dog ownership","postDate":"1171074617","msgId":21349,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVxamFucCtudDJvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVxZzc0NitybTNtQGVHcm91cHMuY29tPg=="},"prevInTopic":21288,"nextInTopic":21355,"prevInTime":21348,"nextInTime":21350,"topicId":21248,"numMessagesInTopic":0,"msgSnippet":"Thank you, Everyone, for all of your input. I do want to let you know that the dog is with the dad of the owners who had to give him up because of a move. He s","messageBody":"<div id=\"ygrps-yiv-1182992467\">Thank you, Everyone, for all of your input.<br/>\n<br/>\nI do want to let you know that the dog is with the dad of the owners <br/>\nwho had to give him up because of a move. He&#39;s not in rescue or <br/>\nanything.<br/>\n<br/>\nHonestly, we haven&#39;t really figured it out yet but I do appreciate all <br/>\nof your very positive input.<br/>\n<br/>\nWarm regards,<br/>\nTonya in MA</div>","specialLinks":[]},{"userId":214857126,"authorName":"kristenhendricks55","from":"&quot;kristenhendricks55&quot; &lt;kristenhendricks55@...&gt;","profile":"kristenhendricks55","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:OT: Regarding dog ownership","postDate":"1170972614","msgId":21288,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVxZzc0NitybTNtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1MjYzMTczQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":21267,"nextInTopic":21349,"prevInTime":21287,"nextInTime":21289,"topicId":21248,"numMessagesInTopic":0,"msgSnippet":"Okay I dont want to make this long.. so I just wanted to say that.. with dogs- they are way more likely to follow the nurture than the nature . This dog is","messageBody":"<div id=\"ygrps-yiv-1096236439\">Okay I dont want to make this long.. so I just wanted to say that.. <br/>\nwith dogs- they are way more likely to follow the &quot;nurture&quot; than <br/>\nthe &quot;nature&quot;.<br/>\n<br/>\nThis dog is three. If he was never given a chew toy, he probably has <br/>\nno will to chew. He is beyond his puppy stage and is probably set in <br/>\nhis ways. However, if hes a chewer you will know right away. Try <br/>\ntaking a chew toy with you when you go see him (n orawhides) and see <br/>\nwhat he does.<br/>\n<br/>\nAnd the question &quot;why does he need a new home when hes three&quot;.... if <br/>\nyou only knew. Most people who get large breed dogs just simply <br/>\ndon&#39;t realize how big the dog will get and decide its not for them. <br/>\n<br/>\nIf you&#39;d like to chat with me about &quot;2nd chance&quot; animals.. (meaning <br/>\nanimals who have already had a previous home).. feel free to email <br/>\nme off-list. While I&#39;m sure the below poster means well (and has <br/>\nalot of good points in there if youre starting with a puppy or very <br/>\nyoung dog).. I do this every day of my life and I know what to look <br/>\nfor and what to expect in dogs out of their &quot;puppy stage&quot;. <br/>\nEspecially with large breed dogs :)<br/>\n<br/>\nOne other thing I&#39;d like to add that I noticed was mentioned... <br/>\ninvisible fences are nice.. but only for the convenience of the <br/>\nowner.<br/>\n<br/>\nInvisible fences MAY keep your dog in, but what keeps other dogs <br/>\nout? How do you keep strays from coming into your yard and fighting <br/>\nwith your dog? How do you keep out disease-ridden critters without a <br/>\ntrue fence (a structure, not a buried wire)? How do you insure that <br/>\na child doesnt wander into your yard and stratle your dog and your <br/>\ndog possibly bites this child. Now you are left with a lawsuit and <br/>\nyour dog to be put to sleep.<br/>\n<br/>\nAnother FYI... there was recently a test using german shepards, <br/>\ncocker spaniels, and toy poodles, all of three different sizes.. <br/>\nwhere they were exposed to a dog being walked by on the other side <br/>\nof the &quot;invisible fence&quot;. In over 70% of the trials, the dog in <br/>\nquestion ran right through the fence. None of the three dogs were <br/>\nmore or less likely to do so. Something to think about...<br/>\n<br/>\nIn my opinion... invisible fences are one of the warst things you <br/>\ncan do to your pet.<br/>\n<br/>\nI&#39;ll get off my soap box now.. sorry :)<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Debra Rossing&quot; <br/>\n&lt;debra.rossing@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; One thing I&#39;d for sure want to know is WHY a 3 yr old dog is <br/>\n </span></blockquote>needing a<br/>\n<blockquote><span title=\"ireply\"> &gt; new home. Is he coming from a shelter? Is the current owner&#39;s <br/>\n </span></blockquote>lifestyle<br/>\n<blockquote><span title=\"ireply\"> &gt; changing (moving to an apartment for instance)? <br/>\n&gt;  <br/>\n&gt; I&#39;d also want to meet the dog first for a good long visit, with the<br/>\n&gt; whole family there. Just because he&#39;s 3 don&#39;t discount the fact <br/>\n </span></blockquote>that<br/>\n<blockquote><span title=\"ireply\"> &gt; labs can sometimes be very &#39;mouthy&#39; and want to chew - plan on <br/>\n </span></blockquote>having<br/>\n<blockquote><span title=\"ireply\"> &gt; lots of big bones and other chewables - keep in mind that labs are<br/>\n&gt; designed to retrieve - pick up things in their mouths. It won&#39;t be<br/>\n&gt; &#39;teething&#39; that you&#39;d have with a puppy but there still might be <br/>\n </span></blockquote>chewing<br/>\n<blockquote><span title=\"ireply\"> &gt; situations. <br/>\n&gt;  <br/>\n&gt; When we started looking for a dog, DS was about 4. I grew up with <br/>\n </span></blockquote>dogs,<br/>\n<blockquote><span title=\"ireply\"> &gt; so I was really excited about it when we finally had our own home <br/>\n </span></blockquote>and<br/>\n<blockquote><span title=\"ireply\"> &gt; could even think about being owned by a pup. I also had a <br/>\n </span></blockquote>checklist of<br/>\n<blockquote><span title=\"ireply\"> &gt; behavioral &#39;tests&#39; in my head for any potential dog addition to our<br/>\n&gt; family. We found our pup (he&#39;s now about 6 years old, a yellow<br/>\n&gt; lab/golden retriever mix) at a shelter. I watched -really- <br/>\n </span></blockquote>carefully to<br/>\n<blockquote><span title=\"ireply\"> &gt; see how he would react to DH (6 feet tall, big, bearded male) and <br/>\n </span></blockquote>how he<br/>\n<blockquote><span title=\"ireply\"> &gt; would react to DS (at the time, 4 yr old, excited, bouncy child). I<br/>\n&gt; wanted to NOT see cowering or cringing toward DH - a scared dog is <br/>\n </span></blockquote>more<br/>\n<blockquote><span title=\"ireply\"> &gt; likely to feel cornered and react aggressively. I also did not <br/>\n </span></blockquote>want to<br/>\n<blockquote><span title=\"ireply\"> &gt; see aggression toward DS, a &#39;smaller&#39; member of the &#39;pack&#39;. <br/>\n&gt;  <br/>\n&gt; One thing to consider (if you haven&#39;t already) is that labs need <br/>\n </span></blockquote>lots of<br/>\n<blockquote><span title=\"ireply\"> &gt; exercise and play. And, they want to be WITH you, they are very <br/>\n </span></blockquote>social.<br/>\n<blockquote><span title=\"ireply\"> &gt; They are not happy if left alone a lot. Our lab thinks he&#39;s a lap <br/>\n </span></blockquote>dog -<br/>\n<blockquote><span title=\"ireply\"> &gt; anyone sitting on the couch can expect him to climb up onto their <br/>\n </span></blockquote>lap if<br/>\n<blockquote><span title=\"ireply\"> &gt; they aren&#39;t paying attention (though you can also teach him to <br/>\n </span></blockquote>stay off<br/>\n<blockquote><span title=\"ireply\"> &gt; the furniture - we don&#39;t bother - our third hand couch is fine for <br/>\n </span></blockquote>dogs<br/>\n<blockquote><span title=\"ireply\"> &gt; and kids, we deliberately don&#39;t have &#39;good&#39; furniture at this <br/>\n </span></blockquote>stage).<br/>\n<blockquote><span title=\"ireply\"> &gt; One positive is that labs are super trainable specifically because <br/>\n </span></blockquote>they<br/>\n<blockquote><span title=\"ireply\"> &gt; are such pack, people pleaser critters. Once you establish yourself<br/>\n&gt; (you, DH, the kids) as the top of the pecking order and the dog at <br/>\n </span></blockquote>the<br/>\n<blockquote><span title=\"ireply\"> &gt; bottom, they will do just about anything you care to teach them. <br/>\n </span></blockquote>When we<br/>\n<blockquote><span title=\"ireply\"> &gt; got Bucky (our lab), we also got the invisible fence so he could <br/>\n </span></blockquote>go in<br/>\n<blockquote><span title=\"ireply\"> &gt; and out at will and have the run of the yard. The trainer (came <br/>\n </span></blockquote>with the<br/>\n<blockquote><span title=\"ireply\"> &gt; purchase of the fence) noted that labs are particularly easy to <br/>\n </span></blockquote>train<br/>\n<blockquote><span title=\"ireply\"> &gt; because they want to please. <br/>\n&gt;  <br/>\n&gt; Can you maybe arrange a weekend &#39;trial visit&#39; with no strings -<br/>\n </span></blockquote> &quot;pet<br/>\n<blockquote><span title=\"ireply\"> &gt; sitting&quot; if you will. That way you&#39;d get to see the dog in your<br/>\n&gt; environment. The shelter we got our lab from *requires* an <br/>\n </span></blockquote>overnight<br/>\n<blockquote><span title=\"ireply\"> &gt; &#39;trial&#39; visit before they will finalize the adoption (even though <br/>\n </span></blockquote>I knew<br/>\n<blockquote><span title=\"ireply\"> &gt; right away that this was Our Dog, I complied and then went back <br/>\n </span></blockquote>the next<br/>\n<blockquote><span title=\"ireply\"> &gt; day they were open and did the paperwork).<br/>\n&gt;  <br/>\n&gt; I&#39;d also want to prep the kids ahead of time as to how to &#39;meet&#39; a <br/>\n </span></blockquote>new<br/>\n<blockquote><span title=\"ireply\"> &gt; dog so there are no mishaps due to excitement - approaching <br/>\n </span></blockquote>slowly, one<br/>\n<blockquote><span title=\"ireply\"> &gt; hand out slightly palm down to allow the dog to sniff you before <br/>\n </span></blockquote>you<br/>\n<blockquote><span title=\"ireply\"> &gt; even touch the dog to start with. Don&#39;t raise your hand quickly <br/>\n </span></blockquote>above<br/>\n<blockquote><span title=\"ireply\"> &gt; the dogs head  since they can&#39;t see there and might consider it a <br/>\n </span></blockquote>threat<br/>\n<blockquote><span title=\"ireply\"> &gt; (particularly if they&#39;ve been smacked for misbehaving) - this is a <br/>\n </span></blockquote>tough<br/>\n<blockquote><span title=\"ireply\"> &gt; one because it seems everyone wants to just scratch a pup&#39;s head <br/>\n </span></blockquote>or ears<br/>\n<blockquote><span title=\"ireply\"> &gt; (it&#39;s SOOOOO soft there). It can be better to start with patting <br/>\n </span></blockquote>the<br/>\n<blockquote><span title=\"ireply\"> &gt; mid-back, the head and throat area are more likely to evoke <br/>\n </span></blockquote>a &#39;threat&#39;<br/>\n<blockquote><span title=\"ireply\"> &gt; reaction than the middle of the back.<br/>\n&gt;  <br/>\n&gt; Having a good family dog is really worth it (speaking as both a <br/>\n </span></blockquote>person<br/>\n<blockquote><span title=\"ireply\"> &gt; who always had a dog around growing up and now as a parent with a <br/>\n </span></blockquote>family<br/>\n<blockquote><span title=\"ireply\"> &gt; dog)<br/>\n&gt;  <br/>\n&gt; Deb <br/>\n&gt; <br/>\n&gt; <br/>\n </span></blockquote>*********************************************************************<br/>\n*<br/>\n<blockquote><span title=\"ireply\"> &gt; This email and any files transmitted with it are confidential and<br/>\n&gt; intended solely for the use of the individual or entity to whom <br/>\n </span></blockquote>they<br/>\n<blockquote><span title=\"ireply\"> &gt; are addressed. If you have received this email in error please <br/>\n </span></blockquote>notify<br/>\n<blockquote><span title=\"ireply\"> &gt; the system manager.<br/>\n&gt; <br/>\n&gt; This footnote also confirms that this email message has been swept <br/>\n </span></blockquote>by<br/>\n<blockquote><span title=\"ireply\"> &gt; MIMEsweeper for the presence of computer viruses.<br/>\n&gt; <br/>\n&gt; CNC Software, Inc.<br/>\n&gt; www.mastercam.com<br/>\n&gt; <br/>\n </span></blockquote>*********************************************************************<br/>\n*<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:OT: Regarding dog ownership","postDate":"1170945933","msgId":21267,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1MjYzMTc0QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":21266,"nextInTopic":21288,"prevInTime":21266,"nextInTime":21268,"topicId":21248,"numMessagesInTopic":0,"msgSnippet":"Kristen Wish we were near you - we d probably have a houseful of adoptees! Okay, probably not - DH s limit is two (or one very active lab LOL). I d volunteer","messageBody":"<div id=\"ygrps-yiv-84845675\">Kristen<br/>\n <br/>\nWish we were near you - we&#39;d probably have a houseful of adoptees! Okay,<br/>\nprobably not - DH&#39;s limit is two (or one very active lab LOL). I&#39;d<br/>\nvolunteer to help you with the animal care though if you needed it. And,<br/>\nour current dog is a rescue from a shelter near us (a no-kill shelter<br/>\nBTW. Bucky was a stray picked up in the city near us and the city pound<br/>\nhas a strict limit on the length of stay, if they aren&#39;t adopted or<br/>\nreclaimed, that&#39;s it. So, the shelter will go and &#39;adopt&#39; any that are<br/>\nnear the end of their stay that they have room for in their facility.<br/>\nThat&#39;s how we got Bucky)<br/>\n <br/>\nDeb <br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:OT: Regarding dog ownership","postDate":"1170945623","msgId":21266,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1MjYzMTczQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":21262,"nextInTopic":21267,"prevInTime":21265,"nextInTime":21267,"topicId":21248,"numMessagesInTopic":0,"msgSnippet":"One thing I d for sure want to know is WHY a 3 yr old dog is needing a new home. Is he coming from a shelter? Is the current owner s lifestyle changing (moving","messageBody":"<div id=\"ygrps-yiv-453359091\">One thing I&#39;d for sure want to know is WHY a 3 yr old dog is needing a<br/>\nnew home. Is he coming from a shelter? Is the current owner&#39;s lifestyle<br/>\nchanging (moving to an apartment for instance)? <br/>\n <br/>\nI&#39;d also want to meet the dog first for a good long visit, with the<br/>\nwhole family there. Just because he&#39;s 3 don&#39;t discount the fact that<br/>\nlabs can sometimes be very &#39;mouthy&#39; and want to chew - plan on having<br/>\nlots of big bones and other chewables - keep in mind that labs are<br/>\ndesigned to retrieve - pick up things in their mouths. It won&#39;t be<br/>\n&#39;teething&#39; that you&#39;d have with a puppy but there still might be chewing<br/>\nsituations. <br/>\n <br/>\nWhen we started looking for a dog, DS was about 4. I grew up with dogs,<br/>\nso I was really excited about it when we finally had our own home and<br/>\ncould even think about being owned by a pup. I also had a checklist of<br/>\nbehavioral &#39;tests&#39; in my head for any potential dog addition to our<br/>\nfamily. We found our pup (he&#39;s now about 6 years old, a yellow<br/>\nlab/golden retriever mix) at a shelter. I watched -really- carefully to<br/>\nsee how he would react to DH (6 feet tall, big, bearded male) and how he<br/>\nwould react to DS (at the time, 4 yr old, excited, bouncy child). I<br/>\nwanted to NOT see cowering or cringing toward DH - a scared dog is more<br/>\nlikely to feel cornered and react aggressively. I also did not want to<br/>\nsee aggression toward DS, a &#39;smaller&#39; member of the &#39;pack&#39;. <br/>\n <br/>\nOne thing to consider (if you haven&#39;t already) is that labs need lots of<br/>\nexercise and play. And, they want to be WITH you, they are very social.<br/>\nThey are not happy if left alone a lot. Our lab thinks he&#39;s a lap dog -<br/>\nanyone sitting on the couch can expect him to climb up onto their lap if<br/>\nthey aren&#39;t paying attention (though you can also teach him to stay off<br/>\nthe furniture - we don&#39;t bother - our third hand couch is fine for dogs<br/>\nand kids, we deliberately don&#39;t have &#39;good&#39; furniture at this stage).<br/>\nOne positive is that labs are super trainable specifically because they<br/>\nare such pack, people pleaser critters. Once you establish yourself<br/>\n(you, DH, the kids) as the top of the pecking order and the dog at the<br/>\nbottom, they will do just about anything you care to teach them. When we<br/>\ngot Bucky (our lab), we also got the invisible fence so he could go in<br/>\nand out at will and have the run of the yard. The trainer (came with the<br/>\npurchase of the fence) noted that labs are particularly easy to train<br/>\nbecause they want to please. <br/>\n <br/>\nCan you maybe arrange a weekend &#39;trial visit&#39; with no strings - &quot;pet<br/>\nsitting&quot; if you will. That way you&#39;d get to see the dog in your<br/>\nenvironment. The shelter we got our lab from *requires* an overnight<br/>\n&#39;trial&#39; visit before they will finalize the adoption (even though I knew<br/>\nright away that this was Our Dog, I complied and then went back the next<br/>\nday they were open and did the paperwork).<br/>\n <br/>\nI&#39;d also want to prep the kids ahead of time as to how to &#39;meet&#39; a new<br/>\ndog so there are no mishaps due to excitement - approaching slowly, one<br/>\nhand out slightly palm down to allow the dog to sniff you before you<br/>\neven touch the dog to start with. Don&#39;t raise your hand quickly above<br/>\nthe dogs head  since they can&#39;t see there and might consider it a threat<br/>\n(particularly if they&#39;ve been smacked for misbehaving) - this is a tough<br/>\none because it seems everyone wants to just scratch a pup&#39;s head or ears<br/>\n(it&#39;s SOOOOO soft there). It can be better to start with patting the<br/>\nmid-back, the head and throat area are more likely to evoke a &#39;threat&#39;<br/>\nreaction than the middle of the back.<br/>\n <br/>\nHaving a good family dog is really worth it (speaking as both a person<br/>\nwho always had a dog around growing up and now as a parent with a family<br/>\ndog)<br/>\n <br/>\nDeb <br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126884268,"authorName":"HMSL2@aol.com","from":"HMSL2@...","profile":"dobsiedoe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"OT: Regarding dog ownership","postDate":"1170910719","msgId":21262,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNiMi5hYTlmODllLjMyZmMwN2ZmQGFvbC5jb20+"},"prevInTopic":21261,"nextInTopic":21266,"prevInTime":21261,"nextInTime":21263,"topicId":21248,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1470636808\">&lt;&lt;We have the opportunity to get a 3 yr old choc lab. The fact that  <br/>\nhe&#39;s not a chew-the-furniture-he&#39;s not ahe&#39;s not a chew-the-furniture-<br/>\nI&#39;m happy with that. When we mentioned it to the kids, they were  <br/>\nestatic with the idea, but aren&#39;t most kids?<br/>\n<br/>\nAny really important  reasons why I should consider this??&gt;&gt;<br/>\n*************************************************************************<br/>\n <br/>\nCompanionship<br/>\nMemories<br/>\nHappy memories<br/>\nLasting memories<br/>\nGiggles and smiles<br/>\n <br/>\nA little story for you.<br/>\nAs a small child living in Ayer , MA my father used to bring home stray  <br/>\ndogs. Mom hated it. I don&#39;t remember that part much but what i do remember is  dad <br/>\nleaving and the dogs leaving too. I spent a good 8+ years longing for a dog  <br/>\nevery holiday and birthday. I was heart broken every time those days came and  <br/>\nwent.<br/>\n <br/>\nMy mother never got it bc she couldn&#39;t be bothered with the upkeep. It was  <br/>\nmore about the cleaning than the connection to her. My story is one of  <br/>\nseparation and divorce but I have happier days to share. <br/>\nI breed Brittanys now.. we have 5 of them 2 males and 3 females(which  are <br/>\nexpecting ). Our children still light up when they see the dogs and  cuddle when <br/>\none of the dogs comes to lay down. Our dogs have been through every  test you <br/>\ncan imagine and some day I swear they wouldn&#39;t have it any other way:)  You <br/>\nsee they are part of the family. They are part of who we are. Each year  we <br/>\nhave 1-3 litters and our children get to see every happy face that comes  through <br/>\nour door. Memories and stories of past dogs being replaced with new and  <br/>\nthose who never owned a dog making new memories. Nervous parents with happy  <br/>\ngiggling children running around the yard with their new puppy. <br/>\nWe can deny what we fear... the feelings we may never know we  had.... but we <br/>\nwill never know until we open that door of hope... A smile,  a dream.. a <br/>\nmemory to last a lifetime...of what could be..<br/>\n <br/>\nLaura<br/>\n_http://www.drewsbrittanys.com_ (http://www.drewsbrittanys.com) <br/>\n_http://www.unschoolingmaine.com_ (http://www.unschoolingmaine.com) <br/>\n_http://www.countrymoosekids.com_ (http://www.countrymoosekids.com) <br/>\nBTW I finally talked my mom into buying a dog when I was 20. She&#39;s had  one <br/>\never since:) <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":214857126,"authorName":"Kristen Hendricks","from":"Kristen Hendricks &lt;kristenhendricks55@...&gt;","profile":"kristenhendricks55","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:OT: Regarding dog ownership","postDate":"1170905862","msgId":21261,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxODkwMy43NDk0OS5xbUB3ZWI4MzAxMi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":21258,"nextInTopic":21262,"prevInTime":21260,"nextInTime":21262,"topicId":21248,"numMessagesInTopic":0,"msgSnippet":"Another reason... (totally has nothing to do with the kids)... There are so many animals out there who get put to sleep everyday. I think that if you are","messageBody":"<div id=\"ygrps-yiv-1255812293\">Another reason... (totally has nothing to do with the kids)...<br/>\n   <br/>\n  There are so many animals out there who get put to sleep everyday. I think that if you are willing to open your heart and home to a dog, then that is awesome!<br/>\n   <br/>\n  I run an animal rescue and see so many homeless animals.. I think if everyone would make the consideration you are... then there would be alot more happy endings for the dogs (AND for the happy kids who now have a pet!!)<br/>\n   <br/>\n  Thanks for considering it!! Thats a topic that is close to the heart for me :)<br/>\n<br/>\n<br/>\n      *Kristen*<br/>\n  Kendall MacKenzie<br/>\n  8/30/2003<br/>\n  Riley Elizabeth<br/>\n  11/7/2005<br/>\n  Nolan Alexander<br/>\n  9/20/2006<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n---------------------------------<br/>\nFinding fabulous fares is fun.<br/>\nLet Yahoo! FareChase search your favorite travel sites to find flight and hotel bargains.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":197731387,"authorName":"Marieke Willis","from":"Marieke Willis &lt;luuknam@...&gt;","profile":"luuknam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] OT: Regarding dog ownership","postDate":"1170892749","msgId":21258,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MDA0OS45MTMyMC5xbUB3ZWI1MzAxMi5tYWlsLnlhaG9vLmNvbT4=","inReplyToHeader":"PDhDOTE5MUY5NDcwOTk2Mi05OEMtMzFCREBXRUJNQUlMLVJBMDkuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":21255,"nextInTopic":21261,"prevInTime":21257,"nextInTime":21259,"topicId":21248,"numMessagesInTopic":0,"msgSnippet":"... Personally I would ve said to do w/e, but considering you mentioned it to your kids (even if qualified with a maybe ), I find it kinda cruel to then say","messageBody":"<div id=\"ygrps-yiv-151699201\">--- <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; -----Original Message-----<br/>\n&gt; From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:godzilla.matthews@...\">godzilla.matthews@...</a><br/>\n&gt; We have the opportunity to get a 3 yr old choc lab. The fact that<br/>\n&gt; he&#39;s not a chew-the-furniture-go-on-the-floor age is a major plus so<br/>\n&gt; I&#39;m happy with that. When we mentioned it to the kids, they were<br/>\n&gt; estatic with the idea, but aren&#39;t most kids?<br/>\n&gt; <br/>\n&gt; Any really important reasons why I should consider this??<br/>\n&gt; <br/>\n&gt; -=-=-=-=-<br/>\n&gt; <br/>\n&gt; Wouldn&#39;t your children&#39;s ecstatic emotions be enough? &lt;bwg&gt;<br/>\n<br/>\n </span></blockquote>Personally I would&#39;ve said to do w/e, but considering you mentioned it<br/>\nto your kids (even if qualified with a &#39;maybe&#39;), I find it kinda cruel<br/>\nto then say &#39;no&#39;. <br/>\n<br/>\nMarieke<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\nGet your own web address.  <br/>\nHave a HUGE year through Yahoo! Small Business.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://smallbusiness.yahoo.com/domains/?p=BESTDEAL\">http://smallbusiness.yahoo.com/domains/?p=BESTDEAL</a></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] OT: Regarding dog ownership","postDate":"1170887804","msgId":21252,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOTE5MUY5NDcwOTk2Mi05OEMtMzFCREBXRUJNQUlMLVJBMDkuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PGVxZDcwZyt1ajBpQGVHcm91cHMuY29tPg==","referencesHeader":"PGVxZDcwZyt1ajBpQGVHcm91cHMuY29tPg=="},"prevInTopic":21249,"nextInTopic":21255,"prevInTime":21251,"nextInTime":21253,"topicId":21248,"numMessagesInTopic":0,"msgSnippet":"... From: godzilla.matthews@verizon.net I listed to my husband all the reasons why NOT to have a dog. I got to my second set of fingers (meaning more than 10)","messageBody":"<div id=\"ygrps-yiv-1851288394\">-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:godzilla.matthews@...\">godzilla.matthews@...</a><br/>\n<br/>\nI listed to my husband all the reasons why NOT to have a dog. I got<br/>\nto my second set of fingers (meaning more than 10) before I started<br/>\nto slow down. I then tried to mention the things that were pros and<br/>\nonly got to 3.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nWould you care to elaborate? Maybe I could turn a few cons into pros....<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nWe have the opportunity to get a 3 yr old choc lab. The fact that<br/>\nhe&#39;s not a chew-the-furniture-go-on-the-floor age is a major plus so<br/>\nI&#39;m happy with that. When we mentioned it to the kids, they were<br/>\nestatic with the idea, but aren&#39;t most kids?<br/>\n<br/>\nAny really important reasons why I should consider this??<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nWouldn&#39;t your children&#39;s ecstatic emotions be enough? &lt;bwg&gt;<br/>\n<br/>\n<br/>\nOlder dogs make GREAT pets usually, although they too can come with <br/>\nissues. Why is the family giving him away?<br/>\n<br/>\nAlthough I don&#39;t do well with sibling issues or highly <br/>\nsensitive/explosive/angry/difficult child questions, I can help with <br/>\n*this*. &lt;bwg&gt;<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nCheck out the new AOL.  Most comprehensive set of free safety and <br/>\nsecurity tools, free access to millions of high-quality videos from <br/>\nacross the web, free AOL Mail and more.</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] OT: Regarding dog ownership","postDate":"1170879212","msgId":21249,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNCNzdCN0JELTU3QzItNDEyOC04NTlBLTBGRDdGRjhFNzIyQkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGVxZDcwZyt1ajBpQGVHcm91cHMuY29tPg==","referencesHeader":"PGVxZDcwZyt1ajBpQGVHcm91cHMuY29tPg=="},"prevInTopic":21248,"nextInTopic":21252,"prevInTime":21248,"nextInTime":21250,"topicId":21248,"numMessagesInTopic":0,"msgSnippet":"... Basically it boils down to a good experience for the kids which is a way bigger point than any of the others. If you were to do the same kind of pros and","messageBody":"<div id=\"ygrps-yiv-947424430\">On Feb 7, 2007, at 1:49 PM, Tonya Matthews wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Any really important reasons why I should consider this??<br/>\n<br/>\n </span></blockquote>Basically it boils down to a good experience for the kids which is a  <br/>\nway bigger point than any of the others.<br/>\n<br/>\nIf you were to do the same kind of pros and cons for having kids, I  <br/>\nthink the cons would come out way ahead. ;-) Kids *are* inconvenient.  <br/>\nDogs are too.<br/>\n<br/>\nWe make the effort to get kids to the museum, to fireworks, to weekly  <br/>\ndance classes because it&#39;s something they value not because the  <br/>\nnumber of pros outnumber the cons.<br/>\n<br/>\nThat doesn&#39;t make the cons of dogs go away ;-) I think the most  <br/>\nhelpful mindset with getting pets for the kids is that it&#39;s an  <br/>\nexperience we want to give them and to expect to take care of the  <br/>\nptes while inviting the kids along to help.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":4560266,"authorName":"singdoula@aol.com","from":"singdoula@...","profile":"singdoula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] OT: Regarding dog ownership","postDate":"1170875937","msgId":21255,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMxOC5lNzkxYjc1LjMyZmI4MDIxQGFvbC5jb20+"},"prevInTopic":21252,"nextInTopic":21258,"prevInTime":21254,"nextInTime":21256,"topicId":21248,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/7/2007 1:53:35 P.M. Eastern Standard Time, godzilla.matthews@verizon.net writes: We have the opportunity to get a 3 yr old choc lab. The","messageBody":"<div id=\"ygrps-yiv-889057533\">In a message dated 2/7/2007 1:53:35 P.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:godzilla.matthews@...\">godzilla.matthews@...</a> writes:<br/>\n<br/>\nWe have the opportunity to get a 3 yr old choc lab. The fact that  <br/>\nhe&#39;s not a chew-the-furniture-he&#39;s not ahe&#39;s not a <br/>\nchew-the-furniture-&lt;WBR&gt;go-o<br/>\nI&#39;m happy with that. When we mentioned it to the kids,  they were <br/>\nestatic with the idea, but aren&#39;t most kids?<br/>\n<br/>\nAny  really important reasons why I should consider  this??<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nyou should consider it because the chocolate lab will  show you how to love <br/>\nthe way God loves; how to forgive unconditionally,  how to be happy even when <br/>\nin pain or even when not treated exactly the way  you want to be treated. He <br/>\nwill teach you lessons about how to be a better  human being that no human being <br/>\ncan teach you. He will fill your house  with joy, give your life more <br/>\npurpose, and when he dies you will not know  how to live one second without him. You <br/>\nwill see him in every corner and  you&#39;ll think you hear his footsteps at <br/>\nnight. You will look at the foot of  the bed and cry because you wish he was still <br/>\nthere. THERE IS NOTHING like  a dog to make your family whole - complete - and <br/>\nwonderful! And a  chocolate lab! WOW, what a great breed! There is nothing <br/>\nlike a lab -  America&#39;s favorite breed!!!<br/>\n <br/>\nWe pick up our 4th dog Gershwin, a white/cream  Labradoodle this Friday <br/>\nmorning. The kids and I can barely sleep at  night from excitement.<br/>\n <br/>\nTHERE IS NOTHING LIKE A DOG!!!!!!!!!!!<br/>\nPlease give this a try!<br/>\n <br/>\nAdriana   <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224193221,"authorName":"Tonya Matthews","from":"&quot;Tonya Matthews&quot; &lt;godzilla.matthews@...&gt;","profile":"auburntonya","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"OT: Regarding dog ownership","postDate":"1170874192","msgId":21248,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVxZDcwZyt1ajBpQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":21249,"prevInTime":21247,"nextInTime":21249,"topicId":21248,"numMessagesInTopic":0,"msgSnippet":"Hi All, I m looking for some wisdom here. Anyone that knows me knows that I m not big into pets. I think of the mess before anything else. I *have* been a dog","messageBody":"<div id=\"ygrps-yiv-2085337814\">Hi All,<br/>\nI&#39;m looking for some wisdom here. Anyone that knows me knows that <br/>\nI&#39;m not big into pets. I think of the mess before anything else. I <br/>\n*have* been a dog owner though so I do know what it entails somewhat.<br/>\n<br/>\nWhat I haven&#39;t had, though, is experience with a family dog(as a <br/>\nparent, had a dog for a short time as a teen). The dog we had when <br/>\nthe kids were little was my husband&#39;s old dog. It was given back to <br/>\nus after my mom couldn&#39;t take care of him anymore and I wouldn&#39;t <br/>\nregard him as a family pet as he was outside/in the basement most of <br/>\nthe short time we had him.<br/>\n<br/>\nI listed to my husband all the reasons why NOT to have a dog. I got <br/>\nto my second set of fingers (meaning more than 10) before I started <br/>\nto slow down. I then tried to mention the things that were pros and <br/>\nonly got to 3.<br/>\n<br/>\nWe have the opportunity to get a 3 yr old choc lab. The fact that <br/>\nhe&#39;s not a chew-the-furniture-go-on-the-floor age is a major plus so <br/>\nI&#39;m happy with that. When we mentioned it to the kids, they were <br/>\nestatic with the idea, but aren&#39;t most kids?<br/>\n<br/>\nAny really important reasons why I should consider this??<br/>\n<br/>\nThanks for your input. If you&#39;d like you can email me offlist @ <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cheftonya@...\">cheftonya@...</a><br/>\n<br/>\nThanks again in advance,<br/>\nTonya in Auburn</div>","specialLinks":[]}],"prevTopicId":21296,"nextTopicId":21278}}