{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":269399205,"authorName":"polykowholsteins","from":"&quot;polykowholsteins&quot; &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"OT Xylitol and teeth health","postDate":"1194193985","msgId":27548,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZna3M4MitkbGloQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":27547,"nextInTime":27549,"topicId":27548,"numMessagesInTopic":0,"msgSnippet":"This is a great article that was posted today at veryyoungkidsteeth and alternativekidsteeth and the subject of taking care of kids teeth has come up many","messageBody":"<div id=\"ygrps-yiv-371929472\">This is a great article that was posted today at veryyoungkidsteeth <br/>\nand alternativekidsteeth and the subject of taking care of kids teeth <br/>\nhas come up many times in these list.<br/>\nThe use of xylitol can be of great help for little ones that don;t <br/>\nlike brushing their teeth.<br/>\nI hope it helps:<br/>\n <br/>\nhttp://www.angelfire.com/az/sthurston/xylitol_natural_sweetener.html<br/>\n <br/>\n  <br/>\nXylitol - All Natural Sweetener <br/>\nXylitol - Our Sweet Salvation?<br/>\n<br/>\n<br/>\nXylitol is not only a safe, natural sweetener without the bad side-<br/>\neffects of sugar and artificial substitutes, it&#39;s also good for your <br/>\nteeth, stabilises insulin and hormone levels and promotes good <br/>\nhealth. <br/>\n<br/>\n <br/>\n<br/>\nAmericans have a mighty hankering for sugar. It seems that we just <br/>\ncan&#39;t get enough of the stuff. On average, a half a cup of sugar is <br/>\nconsumed per person every day. It is estimated that the average <br/>\nAmerican eats, drinks, slurps, stirs and sprinkles about 150 pounds <br/>\nof it annually. Never in modern history has a culture consumed so <br/>\nmuch sugar. <br/>\n<br/>\nSugar truly does deserve its reputation as a &quot;white poison&quot;. Thinking <br/>\nof sugar as a food is really a stretch of the imagination, because it <br/>\nis more a chemical that is difficult for our bodies to utilise and <br/>\ndigest. Humans were really not designed to eat large amounts of sugar <br/>\nin whatever form it may take: white and brown, corn syrup, sucrose, <br/>\ndextrose, glucose, fructose, lactose, maltose, barley malt, honey, <br/>\nrice syrup and maple syrup. Sugar is also highly seductive, acting <br/>\nlike an addictive drug that lures even the most well-intentioned <br/>\nperson back into its sweet clutches. <br/>\n<br/>\nAccording to Chinese wisdom, sweetness is one of the flavours <br/>\nnecessary for maintaining balance in the body. But regularly eating <br/>\nlarge amounts of sugar will cause serious harm. Sugar can cause <br/>\nhypoglycaemia and weight gain, leading to diabetes and obesity in <br/>\nboth children and adults. It leaches the body of vital minerals and <br/>\nvitamins. It raises blood pressure, triglycerides and the bad <br/>\ncholesterol (LDL), increasing the risk of heart disease. It causes <br/>\ntooth decay and periodontal disease, which leads to tooth loss and <br/>\nsystemic infections. It makes it difficult for a child&#39;s brain to <br/>\nlearn, resulting in a lack of concentration. Both children and adults <br/>\nexhibit disruptive behaviour, learning disorders and forgetfulness <br/>\nfrom sugar consumption. It initiates auto-immune and immune <br/>\ndeficiency disorders such as arthritis, allergies and asthma. It also <br/>\nupsets hormonal imbalance and supports the growth of cancer cells.<br/>\n<br/>\nSo what are we to do? Will our sugar-cravings always hold us hostage, <br/>\nor is there really a way to lick the sugar habit successfully? <br/>\n<br/>\n <br/>\n<br/>\nXylitol to the Rescue! <br/>\n<br/>\nDuring World War II, Finland was suffering from an acute sugar <br/>\nshortage. With no domestic supply of sugar, the Finns searched for an <br/>\nalternative. It was then that the Finnish scientists re-discovered <br/>\nxylitol, a low-calorie sugar made from birch bark. It had, in fact, <br/>\nbeen known to the world of organic chemistry since it was first <br/>\nmanufactured in 1891 by a German chemist. <br/>\n<br/>\nBy 1930, xylitol had been purified, but it wasn&#39;t until World War II <br/>\nthat the sugar shortages forced researchers to look at alternative <br/>\nsweeteners. It was only when xylitol was stabilised that it became a <br/>\nviable sweetener in foods. It was also during this time that <br/>\nresearchers discovered xylitol&#39;s insulin-independent nature (it <br/>\nmetabolises in the body without using insulin). <br/>\n<br/>\nBy the 1960s, xylitol was being used in Germany, Switzerland, the <br/>\nSoviet Union and Japan as a preferred sweetener in diabetic diets and <br/>\nas an energy source for infusion therapy in patients with impaired <br/>\nglucose tolerance and insulin resistance. Since then, many other <br/>\ncountries including Italy and China have been producing xylitol for <br/>\nuse in their domestic markets--and with remarkable health benefits. <br/>\nIt has been relatively unknown in the USA and Australia, primarily <br/>\nbecause cheap supplies of cane sugar made the more expensive xylitol <br/>\nless economically viable. <br/>\n<br/>\nXylitol is a natural substance found in fibrous vegetables and fruit, <br/>\nas well as in corn cobs and various hardwood trees like birch. It is <br/>\na natural, intermediate product which regularly occurs in the glucose <br/>\nmetabolism of man and other animals as well as in the metabolism of <br/>\nseveral plants and micro-organisms. Xylitol is produced naturally in <br/>\nour bodies; in fact, we make up to 15 grams daily during normal <br/>\nmetabolism.<br/>\n<br/>\nAlthough xylitol tastes and looks exactly like sugar, that is where <br/>\nthe similarities end. Xylitol is really sugar&#39;s mirror image. While <br/>\nsugar wreaks havoc on the body, xylitol heals and repairs. It also <br/>\nbuilds immunity, protects against chronic degenerative disease and <br/>\nhas anti-ageing benefits. Xylitol is considered a five-carbon sugar, <br/>\nwhich means it is an antimicrobial, preventing the growth of <br/>\nbacteria. While sugar is acid forming, xylitol is alkaline enhancing. <br/>\nAll other forms of sugar, including sorbitol, another popular <br/>\nalternative sweetener, are six-carbon sugars which feed dangerous <br/>\nbacteria and fungi.<br/>\n<br/>\nApproved by the US Food and Drug Administration (FDA) in 1963, <br/>\nxylitol has no known toxic levels. The only discomfort that some <br/>\nsensitive people may notice initially when taking large amounts is <br/>\nmild diarrhoea or slight cramping. Since the body makes xylitol <br/>\ndaily, as well as the enzymes to break it down, any discomfort <br/>\nusually disappears within a few days as the body&#39;s enzymatic activity <br/>\nadjusts to a higher intake. <br/>\n<br/>\nXylitol has 40 per cent fewer calories and 75 per cent fewer <br/>\ncarbohydrates than sugar and is slowly absorbed and metabolised, <br/>\nresulting in very negligible changes in insulin. About one-third of <br/>\nthe xylitol that is consumed is absorbed in the liver. The other two-<br/>\nthirds travels to the intestinal tract where it is broken down by gut <br/>\nbacteria into short-chain fatty acids. <br/>\n<br/>\nXylitol looks, feels and tastes exactly like sugar and leaves no <br/>\nunpleasant aftertaste. It is available in many forms. In its <br/>\ncrystalline form, it can replace sugar in cooking, baking or as a <br/>\nsweetener for beverages. It is also included as an ingredient in <br/>\nchewing gum, mints and nasal spray. <br/>\n<br/>\n <br/>\n<br/>\nXylitol and Oral Health <br/>\n<br/>\nTooth decay and gum disease are serious problems. According to the <br/>\nAmerican Dental Association, 75 per cent of American adults over the <br/>\nage of 35 suffer from some form of periodontal disease.1 Needless to <br/>\nsay, diet plays a major role in dental heath. When there is an excess <br/>\nof sugar in the diet, this weakens the immune system and creates an <br/>\nacidic environment; thus oral health suffers. The mouth is home to <br/>\nover 400 strains of bacteria. Most of these are benign, but when <br/>\nsugar enters the scene it feeds the destructive strains, allowing <br/>\nthem to proliferate. <br/>\n<br/>\nPeriodontal disease is basically caused by bacteria. These deposits <br/>\npermit the growth of bacteria that cause inflammation of the gums. <br/>\nThe bacteria also release minute amounts of toxins that break down <br/>\ngum tissue, thereby helping the infection to progress. Plaque is an <br/>\ninvisible, sticky film of saliva and food residue that constantly <br/>\nforms on the teeth. Ongoing low-grade bacterial infection also <br/>\nburdens the immune system. <br/>\n<br/>\nBacteria help to create plaque and they also thrive within it. Unless <br/>\nremoved, plaque formed along the gum line can lead to gum disease. <br/>\nWhen left untreated, plaque at or below the gum line hardens into <br/>\ntartar. Periodontal disease takes two forms: simple gum inflammation, <br/>\ncalled gingivitis; and a more severe gum infection, called <br/>\nperiodontitis, which may lead to tooth loss and receding gums. <br/>\n<br/>\nGingivitis results from the build-up of plaque and tartar which <br/>\nirritate the gum or periodontal tissue. The more advanced state of <br/>\ngum disease, periodontitis, occurs when inflammation of the gums is <br/>\naccompanied by bone and ligament destruction. Bleeding gums are <br/>\nusually the first indication that gum disease is developing, but <br/>\nobvious symptoms may not always be present. <br/>\n<br/>\nGum infection can also lead to other serious health problems. It <br/>\ndoubles the risk of stroke, triples the risk of heart attack, <br/>\nincreases the incidence of premature, low-weight babies and also <br/>\ncontributes to bronchitis, pneumonia and emphysema. In fact, the same <br/>\nbacteria that cause gum disease end up either directly or indirectly <br/>\ninfecting your heart and arteries. A study conducted at the <br/>\nUniversity of Minnesota in 1998 found that rabbits injected with <br/>\ntooth plaque developed blood clots which led to heart disease.2 It <br/>\nseems that the bacteria first attack the bones and gums in the mouth <br/>\nand then enter the bloodstream through small cracks in the gums. <br/>\n<br/>\nEating sugar causes tooth decay by creating a highly acidic condition <br/>\nin the mouth. Acidity strips tooth enamel of minerals, causing it to <br/>\nweaken and making it more vulnerable to attack by bacteria, leading <br/>\nto tooth decay or demineralisation. Ordinarily, saliva bathes the <br/>\nmouth with an alkaline solution that neutralises all acidity and <br/>\nactually remineralises the teeth. Saliva also washes away leftover <br/>\nbits of food and helps the digestion process. But when saliva turns <br/>\nacidic because of too many sweets, bacteria in the mouth have a <br/>\nfeeding frenzy. These nasty bacteria, along with carbohydrate waste, <br/>\nstick to the teeth and tongue and hold the acid close to the teeth <br/>\nwhere it eats away enamel. Virtually whatever food you ingest, the <br/>\nremaining particles become food for plaque-producing bacteria. Using <br/>\nxylitol helps to raise plaque pH, thereby reducing the time that <br/>\nteeth are exposed to damaging acids as well as starving harmful <br/>\nbacteria of their food source. <br/>\n<br/>\nXylitol is a dentist&#39;s dream. It reverses all these destructive <br/>\neffects of sugar on oral health. Xylitol is non-fermentable and <br/>\ntherefore cannot be converted to acids by oral bacteria, thus it <br/>\nhelps to restore a proper alkaline/acid balance in the mouth. This <br/>\nalkaline environment is inhospitable to all the destructive bacteria, <br/>\nespecially the worst variety, Streptococcus mutans. It also inhibits <br/>\nplaque formation. <br/>\n<br/>\nUsing xylitol right before bedtime, after brushing and flossing, <br/>\nprotects and heals the teeth and gums. Unlike sugar, it can even be <br/>\nleft on the teeth overnight. With proper use, xylitol actually stops <br/>\nthe fermentation process leading to tooth decay. Long-term use <br/>\nsuppresses the most harmful strains of oral bacteria, making a long-<br/>\nlasting change in those bacterial communities. Xylitol even has the <br/>\nability to enhance the mineralisation of the enamel. It is most <br/>\neffective in treating small decay spots. Although larger cavities <br/>\nwon&#39;t go away, they can harden and become less sensitive. <br/>\n<br/>\nConsistently using small amounts of xylitol tends to increase <br/>\nprotective factors in saliva. Xylitol stimulates saliva flow and <br/>\nhelps keep salivary minerals in a useful form. Prolonged xylitol use <br/>\nincreases the buffering capacity and protective factors in saliva. <br/>\nIncreased saliva production is especially important for people <br/>\nsuffering with a dry mouth due to illness, ageing or drug side-<br/>\neffects. <br/>\n<br/>\nSince the oral environment becomes less acidic with continued xylitol <br/>\nuse, it is advisable to chew xylitol gum or suck a xylitol mint after <br/>\nevery meal or after eating sweet snacks. The best news is that <br/>\nstudies have shown that xylitol&#39;s effect is long-lasting and possibly <br/>\neven permanent. <br/>\n<br/>\nXylitol has recently received positive support in the Journal of the <br/>\nAmerican Dental Association. &quot;Xylitol is an effective preventive <br/>\nagent against dental caries ... Consumption of xylitol-containing <br/>\nchewing gum has been demonstrated to reduce caries in Finnish <br/>\nteenagers by 30&endash;60 per cent. Studies conducted in Canada, <br/>\nThailand, Polynesia and Belize have shown similar results...&quot;3 A <br/>\nstudy conducted at Harvard School of Dental Medicine concluded <br/>\nthat &quot;xylitol can significantly decrease the incidence of dental <br/>\ncaries&quot;.4<br/>\n<br/>\nAnother unexpected benefit came from a Finnish study which showed <br/>\nthat children whose teeth are colonised between 19 and 31 months of <br/>\nage by Streptococcus mutans bacteria are more likely to have a large <br/>\nnumber of cavities. Most children acquire this bacteria from their <br/>\nmother&#39;s saliva through food tasting, sharing cups and kissing. The <br/>\nstudy showed a dramatic 70 per cent reduction in tooth decay among <br/>\nchildren whose mothers chewed xylitol gum.5<br/>\n<br/>\nXylitol, however, isn&#39;t just for the young. In a paper published in <br/>\nthe Journal of the American Geriatrics Society, researchers tested <br/>\n111 adults aged 60 and older over a 12-month period. All were frail <br/>\nbut healthy adults. In the study, one group of volunteers chewed no <br/>\ngum, a second chewed gum containing xylitol, and a third group chewed <br/>\ngum containing both xylitol and an antimicrobial. In the two groups <br/>\nreceiving gum, the participants chewed two pieces for 15 minutes, two <br/>\ntimes per day. At the end of the study, the researchers reported that <br/>\nthe group who received xylitol gum had substantially lowered their <br/>\nrisk of developing thrush, a fungal or yeast infection that can cause <br/>\nmouth soreness. (The group who received xylitol plus the <br/>\nantimicrobial had equal benefits.) It had also reduced their risk of <br/>\ndeveloping angular cheilitis, a condition in which sores develop in <br/>\nthe corners of the mouth. The researchers noted that xylitol gum can <br/>\nprovide a &quot;real clinical benefit&quot; to frail, elderly people.6<br/>\n<br/>\n <br/>\n<br/>\nXylitol and Ear, Nose and Throat Infections <br/>\n<br/>\nRecurring middle ear infections pose a great health threat to <br/>\nchildren. Tubes are often inserted into the ear drum in children with <br/>\nthese recurring infections to reduce the fluid that is attempting to <br/>\nwash out the infection from the middle ear. While this procedure <br/>\nsometimes helps to reduce the frequency of infections, it is also <br/>\ndesigned to help with hearing. <br/>\n<br/>\nLanguage, a critical part of learning, is built by auditory input <br/>\nduring the first two years of life--the same period when ear <br/>\ninfections are most common. If this input is dampened by infection or <br/>\nfluid in the middle ear during this important period, it can cause <br/>\nlearning problems. One researcher demonstrated that even when <br/>\nproperly treated, recurrent middle ear infections during the first <br/>\ntwo years result in significant impairment in reading ability up to <br/>\nthe age of nine.7 Another study followed children longer and showed <br/>\nsignificant learning and social problems extending up to age <br/>\neighteen.8<br/>\n<br/>\nOne of xylitol&#39;s versatile benefits is its ability to inhibit the <br/>\ngrowth of bacteria that cause middle ear infections in young <br/>\nchildren. In two recent studies involving over 1,000 children, <br/>\nxylitol-flavoured chewing gum was found to reduce the incidence of <br/>\nmiddle ear infections by 40 per cent, significantly decreasing <br/>\nongoing middle ear complications and the need for antibiotics. <br/>\n<br/>\nRegularly washing the nose with a spray containing xylitol decreases <br/>\nthe number of harmful bacteria and stimulates normal defensive <br/>\nwashing of this area. A clean nose reduces problems with allergies <br/>\nand asthma that originate from nasal irritants and pollutants. <br/>\nCurrent research shows how bacteria attach to cells in the body, <br/>\ncausing infection. Some sugars like xylitol are known to be able to <br/>\ninterfere with this binding, blocking the attachment of the major <br/>\ninfection-causing bacteria that live in the nose. Dr Lon Jones, a <br/>\nphysician in Plainsview, Texas, reported that the use of a xylitol <br/>\nnasal spray in his practice prevented 93 per cent of ear infections <br/>\nand resulted in comparable reductions in sinus infections, allergies <br/>\nand asthma.9<br/>\n<br/>\nXylitol has been shown to be effective in inhibiting Candida <br/>\nalbicans, a serious systemic yeast problem, and other harmful gut <br/>\nbacteria including H. pylori, implicated in periodontal disease, bad <br/>\nbreath, gastric and duodenal ulcers and even stomach cancer. <br/>\n<br/>\n <br/>\n<br/>\nXylitol and Osteoporosis <br/>\n<br/>\nAnother exciting benefit from xylitol is its role in reversing bone <br/>\nloss. Studies in Finland found that xylitol maintained bone density <br/>\nin rats that had their ovaries removed. Without ovaries, oestrogen <br/>\nlevels plummeted and so did the bone density in rats that were not <br/>\ngiven xylitol. However, in the rats that had ovaries removed and were <br/>\ngiven xylitol, bone density actually increased.10 Another study <br/>\nshowed that xylitol was effective in decreasing age-related bone loss <br/>\nin older male rats by 10 per cent.11<br/>\n<br/>\nIn an unprecedented action, the Finnish researchers made bold <br/>\nrecommendations for human application of their studies. They <br/>\nsuggested that an effective human dose would be about 40 grams daily. <br/>\nThe scientists speculated that xylitol&#39;s bone density enhancing <br/>\nproperties are due to its ability to promote intestinal absorption of <br/>\ncalcium. Including xylitol in one&#39;s diet is certainly an enjoyable <br/>\nway to reap the benefits of greater bone density, along with other <br/>\nhealth benefits. <br/>\n<br/>\n <br/>\n<br/>\nXylitol and Insulin Resistance, Diabetes Hypertension and Hormonal <br/>\nImbalances<br/>\n<br/>\nConsuming sugar and other refined carbohydrates results in the rapid <br/>\nrelease of glucose, or blood sugar. In response, the pancreas <br/>\nsecretes insulin to usher glucose into the cells, where it is burned <br/>\nfor energy. Excess glucose stresses the system, and over time the <br/>\ncells become less responsive to insulin. This condition, known as <br/>\ninsulin resistance, is a huge health problem and it is estimated to <br/>\naffect half the American population. Insulin resistance is associated <br/>\nwith abnormalities in cholesterol and triglyceride levels, <br/>\nhypertension, increased risk of heart disease and diabetes.<br/>\n<br/>\nThe dramatic rise in type-2 diabetes since the mid-1900s directly <br/>\ncoincides with our increased consumption of sugar. One long-term <br/>\nstudy of more than 65,000 women demonstrated that a high-sugar, low-<br/>\nfibre diet increased the risk of type-2 diabetes by 250 per cent. <br/>\nAnother recent study found that excessive intake of sugar was the <br/>\nsingle most important dietary risk factor for heart disease in women <br/>\nand for men. It has been estimated that sugar intake may account for <br/>\nmore than 150,000 premature deaths from heart disease in the United <br/>\nStates each year.12<br/>\n<br/>\nXylitol has been demonstrated in repeated clinical studies to be very <br/>\nslowly metabolised. In fact, on the glycaemic index, which measures <br/>\nhow quickly foods enter the bloodstream, sugar is rated at 100 and <br/>\nxylitol at just seven! Xylitol is a natural insulin stabiliser, <br/>\ntherefore it causes none of the abrupt rises and falls that occur <br/>\nwith sugar. In fact, it actually helps in stopping sugar and <br/>\ncarbohydrate cravings. Foods sweetened with xylitol will not raise <br/>\ninsulin levels. This makes it a perfect sweetener for people with <br/>\ndiabetes as well as those wanting to lose weight. There is a growing <br/>\nconsensus amongst anti-ageing researchers that maintaining low <br/>\ninsulin levels is a key to a successful anti-ageing program. <br/>\n<br/>\nInsulin resistance also plays a significant role in hormonal <br/>\nimbalances, including those that lead to breast cancer. High insulin <br/>\nlevels increase the production of oestrogens, leading to an oestrogen-<br/>\ndominant condition, and also interfere with healthy ovarian function. <br/>\nInsulin resistance is a major cause of a growing hormonal problem <br/>\ncalled polycystic ovarian syndrome (PCOS). PCOS causes the ovaries to <br/>\nbecome anovulatory, which means that the normal cyclic production of <br/>\noestrogen followed by progesterone either ceases or becomes <br/>\ndysfunctional. Insulin stimulates the ovaries to produce <br/>\npredominantly male hormones, which, in combination with higher <br/>\ninsulin and glucose levels, increase weight-gain around the waist--a <br/>\nbody type that is a risk factor for breast cancer. Signs that the <br/>\nbody is being exposed to higher levels of the male hormones include <br/>\nacne, loss of head hair and an increase in body hair. Lowering <br/>\ninsulin levels is crucial for not only treating PCOS but also <br/>\nresolving most other hormonal imbalances, including those leading to <br/>\nbreast cancer.13 <br/>\n<br/>\nDr John Lee, author of What Your Doctor May Not Tell You About Breast <br/>\nCancer, explains the connection between insulin resistance and breast <br/>\ncancer:<br/>\n&quot;Overeating junk food makes you fat. Increased body fat and lack of <br/>\nexercise lead to insulin resistance. Insulin resistance leads to <br/>\nfurther craving of sugary carbohydrates to generate energy for the <br/>\nbody. More insulin is released in response to increased carbohydrate <br/>\nintake, leading to more weight gain. More fat leads to more <br/>\nestrogens, which, in turn, lead to earlier breast development and <br/>\nmenstruation. Earlier onset of menstruation leads to more ovulatory <br/>\ncycles and a greater lifetime exposure to oestrogens without adequate <br/>\nprogesterone. A greater lifetime exposure to estrogens increases <br/>\nbreast cancer risk.<br/>\n<br/>\n&quot;Simultaneously, increased consumption of simple carbohydrates, <br/>\ncoupled with insulin resistance, leads to polycystic ovaries and lack <br/>\nof ovulation during menstrual cycles, resulting in excess production <br/>\nof androgens and estrogens, along with inadequate production of <br/>\nprogesterone. Excessive estrogen production in the absence of <br/>\nprogesterone production leads to estrogen dominance and increased <br/>\nbreast cancer risk. Use of contraceptive hormones increases insulin <br/>\nresistance, exacerbating all the above problems.&quot;14<br/>\n<br/>\nUsing xylitol instead of sugar as well as reducing intake of high-<br/>\nglycaemic, refined carbohydrate foods helps to lower the risk not <br/>\nonly of PCOS but also of ovarian cysts, fibroids, endometriosis, PMS, <br/>\nhot flushes, weight gain and depression. <br/>\n<br/>\n <br/>\n<br/>\nThe Safer Sweetener<br/>\n<br/>\nIncreased sugar consumption has bedevilled Western cultures with more <br/>\nand more health problems, many of which are putting an enormous <br/>\nstrain on health care systems. Finally, there is an answer to our <br/>\ncollective prayers for something truly healthy that can also satisfy <br/>\nour sweet tooth. Over 1,500 scientific studies have found that the <br/>\nmore you use xylitol, the more you can eliminate sugar cravings, <br/>\nreduce insulin levels and alkalinise your body. It&#39;s a great aid on <br/>\nthe way to good health and long life. <br/>\n<br/>\nImagine never having to feel those twinges of guilt when you bite <br/>\ninto a xylitol-sweetened brownie. Or how about increasing your bone <br/>\ndensity while enjoying your favourite hot drink with two spoonfuls of <br/>\nxylitol crystals, or knowing that xylitol-sweetened chewing gum is <br/>\npreventing cavities and gum disease? <br/>\n<br/>\nWith xylitol, you can now have your sweet tooth and treat it, too!<br/>\n<br/>\n<br/>\n----------------------------------------------------------------------<br/>\n----------<br/>\n<br/>\nFootnotes: <br/>\n1. Zeines, Victor, DDS, MS, FAGD. Healthy Mouth, Healthy Body. <br/>\nKensington Publishing Corporation, 2000, p. 55.<br/>\n2. ibid., p. 29.<br/>\n3. Beiswanger, BB, Boneta AE, Mau MS, Katz BP, Proskin HM, Stookey <br/>\nGK. The effect of chewing sugar-free gum after meals on clinical <br/>\ncaries incidence. J. Am. Dent. Assoc. 1998;129:1623-6.<br/>\n4. Hayes, Catherine, DMD, DMSc. The effect of non-cariogenic <br/>\nsweeteners on the prevention of dental caries: A review of evidence. <br/>\nHarvard School of Dental Medicine. See <br/>\nhttp://www.lib.umich.edu/dentlib/ nihcdc/abstracts/hayes.html.<br/>\n5. How Xylitol-containing Products Affect Cariogenic Bacteria. J. Am. <br/>\nDent. Assoc., April 2000.<br/>\n6. J. Am. Geriatrics Soc. 2002;50. See <br/>\nhttp://www.globalaging.org/health/world/medgum.htm.<br/>\n7. Luotonen M, Uhari M, Aitola, L et al. Recurrent otitis media <br/>\nduring infancy and linguistic skills at the age of nine years. <br/>\nPediatr. Infect. J. 1996;15:854-8.<br/>\n8. Bennett KE, Haggard MP, Silva PA, Stewart IA. Behavior and <br/>\ndevelopment effects of otitis media with effusion into the teens. <br/>\nArch. Dis. Child 2001 Aug;85(2):91-5.<br/>\n9. See website http://www.nasal-xylitol.com.<br/>\n10. Svanberg M, Mattila P, Knuttila M. Dietary xylitol retards the <br/>\novariectomy-induced increase of bone turnover in rats. Calcif. Tissue <br/>\nInt. 60:462-466.<br/>\n11. Mattila P, Svanberg, M, Knuttila, M. Increased bone volume and <br/>\nbone mineral content in xylitol-fed aged rats. Gerontology <br/>\n2001;47:300-305.<br/>\n12. Carbohydrates: The Good, the Bad, and the Ugly. Dr James <br/>\nWhittaker Newsletter, vol. 13, no. 4, April 2000.<br/>\n13. John, Lee MD. What Your Doctor May Not Tell You About Breast <br/>\nCancer. Warner Books, 2002, p. 61.<br/>\n14. ibid, p. 62.<br/>\n<br/>\n <br/>\n<br/>\nExtracted from Nexus Magazine, Volume 10, Number 1 (Dec &#39;02-Jan 2003)<br/>\nPO Box 30, Mapleton Qld 4560 Australia. editor@...<br/>\nTelephone: +61 (0)7 5442 9280; Fax: +61 (0)7 5442 9381<br/>\nFrom our web page at: www.nexusmagazine.com <br/>\n<br/>\nby Sherrill Sellman © 2002<br/>\nGetWell International<br/>\nPO Box 690416<br/>\nTulsa, OK 74169-0416, USA<br/>\nEmail: golight@...<br/>\nWebsite: http://www.ssellman.com <br/>\n<br/>\n<br/>\n----------------------------------------------------------------------<br/>\n----------<br/>\n<br/>\n[Editor&#39;s Note: Several mentions of animal experiments are made in <br/>\nthis article. NEXUS does not agree with the practices of animal <br/>\nexperimentation and vivisection, but we also don&#39;t want to censor the <br/>\narticles we publish.]<br/>\n<br/>\nAbout the Author:<br/>\nSherrill Sellman is the author of the bestselling book, Hormone <br/>\nHeresy: What Women Must Know About Their Hormones. She can be <br/>\ncontacted via her website, http://www.ssellman.com, or by email at <br/>\ngolight@.... To subscribe to her monthly HormoneWise e-<br/>\nDigest, send an email to hwise@....</div>","specialLinks":[]}],"prevTopicId":27545,"nextTopicId":20039}}