{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":236,"messages":[{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Introduction","postDate":"1092146252","msgId":2673,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5QzRDRDU0LUVBRDUtMTFEOC1BOTNGLTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDEwMy40YzE5ODE0ZC4yZTQyNTZhMEBhb2wuY29tPg==","referencesHeader":"PDEwMy40YzE5ODE0ZC4yZTQyNTZhMEBhb2wuY29tPg=="},"prevInTopic":2653,"nextInTopic":2712,"prevInTime":2672,"nextInTime":2674,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"... She will. My daughters have done NO formal math at all. But I m not going to say, We don t do math, because it comes up all the time. How could somebody","messageBody":"<div id=\"ygrps-yiv-1164673373\">On Aug 4, 2004, at 8:11 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Math is a large subject, and it does build on itself, but it doesn&#39;t <br/>\n&gt; take  12<br/>\n&gt; years of worksheets to do it! Your three year old (?right?) already <br/>\n&gt; probably<br/>\n&gt; knows some math concepts---&quot;more vs less&quot;, for sure! I bet she can <br/>\n&gt; count to<br/>\n&gt; three cookies! Hold up three fingers! Watch and learn! One day she&#39;ll <br/>\n&gt; say,<br/>\n&gt; &quot;Daddy, did you know three fives are fifteen?&quot; She&#39;ll figure it out. <br/>\n&gt; She  WILL!<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>She will.<br/>\n<br/>\nMy daughters have done NO formal math at all. But I&#39;m not going to say, <br/>\n&quot;We don&#39;t do math,&quot; because it comes up all the time. How could <br/>\nsomebody be living in the real world and not add, subtract, multiply, <br/>\nand divide? How could they not notice fractions, decimals, and <br/>\npercentages? They&#39;ll see them and they&#39;ll pick them up in very natural <br/>\nways - each in their own way - depending on what happens to catch their <br/>\nattention. The child interested in shopping will notice the percentage <br/>\noff sale items. The child interested in carpentry will learn fractions <br/>\nin a measurement context.  The baseball player will learn all about <br/>\naverages. All the basic arithmetic learned, generally, in grades K <br/>\nthrough 8, will come up in life. Parents can be ready to explain them, <br/>\nwhen kids ask, just exactly like they&#39;d be ready to explain anything <br/>\nelse.<br/>\n<br/>\nThe ONLY thing I&#39;d add about math (get the pun?) is that parents who <br/>\nhave their OWN math anxiety and math phobia to deal with should get <br/>\nover it - for their kids&#39; sakes. Try to imagine a kid learning to read <br/>\n&quot;naturally&quot; in a household where a parent has reading phobia - thinks <br/>\nit is SUPER LARGE and BUILDS ON ITSELF and IF YOU DON&#39;T LEARN IT IN <br/>\nORDER YOU&#39;LL GET LOST and &quot;SOME PEOPLE HAVE READING BRAINS&quot; and &quot;BOYS <br/>\nARE BETTER AT IT THAN GIRLS&quot; and &quot;YOU HAVE TO BREAK IT DOWN AND LEARN <br/>\nLITTLE BITS AT A TIME&quot; and &quot;IT ISN&#39;T GOING TO BE FUN, BUT YOU HAVE TO <br/>\nLEARN IT ANYWAY&quot; and &quot;IT DOESN&#39;T ALWAYS MAKE SENSE BUT YOU HAVE TO <br/>\nMEMORIZE CERTAIN THINGS&quot; and so on. Imagine your child asks you, &quot;What <br/>\nis this word?&quot; And you answer - &quot;I&#39;m not a reading brain, ask your dad <br/>\nwhen he gets home.&quot; Imagine your child never sees you enjoying reading <br/>\nand, when you&#39;re forced to read something, you moan and groan about it. <br/>\nSuppose when you get the check at a restaurant, you glance at it and <br/>\nsay, &quot;Here, somebody else do this, I can&#39;t read it.&quot; Suppose you simply <br/>\navoided anything to do with reading, as much as possible.<br/>\n<br/>\nNone of those thoughts and resulting behaviors would be conducive to <br/>\nyour unschooled child learning to read. And those are exactly the kinds <br/>\nof thoughts people have about math - and more.<br/>\n<br/>\nSo MANY people are math phobic/anxious as a direct result of the way <br/>\nmath is taught in schools. It is sad, frightening, and the MOST <br/>\nconvincing evidence, to me, that unschooling is the best way for kids <br/>\nto learn. Far from being a &quot;risky endeavor&quot; - at LEAST we&#39;re able to <br/>\nnot create the kind of anxieties and phobias that school creates. At <br/>\nLEAST do no harm.<br/>\n<br/>\nThat was my goal with my kids - I wasn&#39;t sure how to support their math <br/>\nlearning, exactly - I only knew I did NOT want to do to them what <br/>\nschools do to almost everybody (Oh - and don&#39;t be fooled by people who <br/>\nare good at school math. MOST of them are clueless about when and where <br/>\nand how to apply it and MANY of them get good grades in school but are <br/>\njust as anxious as those with poor grades. But that&#39;s another story for <br/>\nanother time.)<br/>\n<br/>\nMy goal for my kids was that they&#39;d grow up without the prejudices and <br/>\nfears and frustrations and low self-esteem that school math programs <br/>\nseem so GOOD at creating. I was less concerned that they &quot;could&quot; do <br/>\nmath, than that they&#39;d &quot;want to&quot; do math.<br/>\n<br/>\nSo - we had fun. I kept my own anxieties at bay - and kept any <br/>\ninteractions that we had relating to math light and easy and enjoyable. <br/>\nI did buy pattern blocks and base ten cubes - we played with them if <br/>\nand when the kids felt like it. We played with tangrams and fraction <br/>\nblocks and geo-boards. We played cards and dice games and paper and <br/>\npencil dot games and lots and lots of board games. We played SET and <br/>\nFLUX and we played blackjack and poker, including betting with <br/>\ntoothpicks or pennies.<br/>\n<br/>\nMy kids are now 13, 16, and 19. My 19 yo has completed 2 years of <br/>\ncollege. She started with the lowest math class offered at the college <br/>\n- because she wasn&#39;t sure where else to start &lt;G&gt;. It was a breeze - <br/>\nshe picked up a few little tricks, but otherwise there was nothing in <br/>\nthe class she didn&#39;t already know. Same for the next math class - easy <br/>\nto pick up the bit of new stuff. Then she had algebra for the first <br/>\ntime. She LOVED it. It was just more puzzles and game playing to her. <br/>\nSometimes she got frustrated (my opinion is that this was mostly when <br/>\nthe teacher confused them &lt;G&gt;), but she worked at it and figured it out <br/>\nand easily got the highest grade in the class. So much for needing 13 <br/>\nYEARS of studying math! She went on to a second semester of algebra and <br/>\nthen took probability and statistics. This was a tough class - she took <br/>\nit in a 4-week summer school - so it was 4 hours per day plus at LEAST <br/>\nthat many hours spent on studying. I worked with her every single day <br/>\non it. It was hard. But, in working with her on it, I noticed that she <br/>\nwas insisting on fully understanding every bit of it - was not at all <br/>\ncontent to memorize &quot;how to do&quot; something, unless she totally <br/>\nunderstood why it worked. This is very unusual for kids in this class <br/>\n(I&#39;ve taught it). Again, she got by far the highest grade in the class. <br/>\nWhat gave her this ability? She isn&#39;t a &quot;math brain&quot; - she&#39;s an artist <br/>\nand writer. But (1) she worked HARD and (2) she expected that it all <br/>\nmade sense and that she could understand it.<br/>\n<br/>\nThat willingness to work hard and that confidence that it made sense <br/>\nand she could get it - those are the two things missing in my college <br/>\nstudents. CLEARLY - they did not learn those things by doing math, bit <br/>\nby bit, day after day, for years.<br/>\n<br/>\nWhatever it is the schools are doing, it is disastrous. We have an <br/>\nepidemic of math phobia and anxiety and avoidance as a result. So - <br/>\nwhatever we&#39;re going to do about math at home - duplicating school-type <br/>\nmath is clearly not a good idea.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Unschooling is trusting that it will happen. NOT that she&#39;ll become an<br/>\n&gt; engineer, but that she will learn what she needs to know. Unschooling <br/>\n&gt; is about<br/>\n&gt; your facilitating her exploration and respecting her needs at that <br/>\n&gt; moment.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>-pam<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations.</div>","specialLinks":[]},{"userId":183485564,"authorName":"Daniel Macintyre","from":"&quot;Daniel Macintyre&quot; &lt;macintyd@...&gt;","profile":"macintyred","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: math (Daniel)","postDate":"1092053816","msgId":2653,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNmN3B2bythZDFhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwZWMwMWM0N2JmYiQ2ZjJkMTYxMCQ2ODAyYThjMEAyMDAyZGVza3RvcD4="},"prevInTopic":2599,"nextInTopic":2673,"prevInTime":2652,"nextInTime":2654,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"... paying attention to you and thinking about things that you might like the in way that unschooling parents are able to.  I think it does take attention to","messageBody":"<div id=\"ygrps-yiv-22627700\"><blockquote><span title=\"ireply\">&gt; But also part of school is that at school there is no one really<br/>\n </span></blockquote>paying attention to you and thinking about things that you might like<br/>\nthe in way that unschooling parents are able to.  I think it does take<br/>\nattention to your children and their interests to minimize the chance<br/>\nthat they will be unaware of areas that they would appreciate.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n </span></blockquote>Another part of school is that people who see what you like and/or are<br/>\ngood at in school get a distorted idea of what you would like in real<br/>\nlife.  For example, when I was in High school, my parents suggested to<br/>\nme that I might like to be a Postal Worker.  Their reasoning was that<br/>\nit was a very secure job with good benefits and you had to take a<br/>\nstandardized test to qualify for it.  I&#39;m VERY good at standardized<br/>\ntests, but only did average in school through high school.  I spent<br/>\ntoo much time reading science fiction to get good grades in<br/>\neverything, so I just got good grades in the subjects I liked.  <br/>\n<br/>\nThey were definately NOT supportive when I majored in Physics.  They<br/>\nknew I liked science, but kept telling me that there were many<br/>\nsciences that did not need so much math.  I think that&#39;s part of why I<br/>\ntook the extra math courses - just to show that I could.  I&#39;m not<br/>\ntrying to be unkind.  There was not too much reason to believe I could<br/>\nhandle the amount of math involved.  I only got C&#39;s in math in high<br/>\nschool and it was the only subject I ever scored average on in<br/>\nachievement tests in grade school.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   But that being said -- I think the chances are good that you and<br/>\n </span></blockquote>they will miss some things that you and they will wish they had<br/>\ndiscovered earlier.  I think a real advantage of unschooling is that<br/>\nit helps prevent the &quot;schoolthink&quot; feeling of something being too late.  <br/>\n<br/>\nOr too early either, right? :)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When you discover that you like something - you are free to pursue<br/>\n </span></blockquote>it, regardless of where you are on some arbitrary &quot;educational path.&quot; <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; From my own life: when I was in college, I realized that I was<br/>\n </span></blockquote>interested in Artificial Intelligence research.  At the time, I<br/>\ndecided that since I would be so far behind people who were already<br/>\nsteeped in programming, that it wasn&#39;t even worth pursuing.  Now, of<br/>\ncourse, at 38, I laugh to think that I ever thought that ANYTHING at<br/>\n21 was too late to pursue.  Ultimately, I am glad that I followed the<br/>\ncourse that I ended up following (law school and practice in corporate<br/>\nlaw), so I don&#39;t actually regret my actions and am no longer<br/>\nparticularly interested in AI research  -but I would like to prevent<br/>\nmy children being indoctrinated into having the same sense of<br/>\nartificial limits and windows on when things can be studied.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n </span></blockquote>I had a friend in High school who was programming.  He was designing<br/>\nsimple games that would play on an Apple IIe.  I thought it was cool,<br/>\nbut I didn&#39;t understand a lot of what he did.  I remember thinking<br/>\nthat going into computer programming would be neat, but I felt I was<br/>\nalready behind the curve on this.  After all, it seemed the people<br/>\ndoing it had been doing it since they were kids.  I had some knowledge<br/>\nin Basic, but the Apple II operating system was new to me.  So, at 17,<br/>\nI decided it was too late for me to go into computer science.  <br/>\n<br/>\nI&#39;m now 34 and am going back to school to get my associate&#39;s in<br/>\nComputer Science (hopefully to get enough prerequisites to jump into a<br/>\nmasters degree program).<br/>\n<br/>\nGo figure :)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; -Cat <br/>\n&gt;   <br/>\n&gt;   ----- Original Message ----- <br/>\n&gt;   From: Daniel Macintyre <br/>\n&gt;   To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n&gt;   Sent: Friday, August 06, 2004 1:27 PM<br/>\n&gt;   Subject: [unschoolingbasics] Re: math (Daniel)<br/>\n&gt; <br/>\n&gt; <br/>\n&gt;    but thought I would give it a try after<br/>\n&gt;   my experience with Diff Eq., so I came &quot;THAT&quot; close to never knowing<br/>\n&gt;   how much I would enjoy it.<br/>\n&gt; <br/>\n&gt;   Daniel<br/>\n&gt;    <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: math (Daniel)","postDate":"1091830108","msgId":2599,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDViLjU1N2JhOWM3LjJlNDU1YjVjQGFvbC5jb20+"},"prevInTopic":2598,"nextInTopic":2653,"prevInTime":2598,"nextInTime":2600,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/6/2004 5:35:58 PM Eastern Daylight Time, aceto3@verizon.net writes: Part of  the problem with schoolthink is that the concept of math","messageBody":"<div id=\"ygrps-yiv-1913717025\">In a message dated 8/6/2004 5:35:58 PM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aceto3@...\">aceto3@...</a> writes:<br/>\n<br/>\nPart of  the problem with &quot;schoolthink&quot; is that the concept of &quot;math&quot; seems <br/>\nlike a  uniform thing including both arithmetic and topology -- and knowing <br/>\nthat you  don&#39;t like one part can make it seem that you won&#39;t like the  whole. &lt;&lt;&lt;<br/>\n <br/>\nScience, history, and english too! If you don&#39;t like geology, you hate  <br/>\nscience----even though you might LOVE anatomy or botany. Elizabethan England  makes <br/>\nyou hate history, but you&#39;d be GLUED to the Han Dynasty or  WWII. Hemingway <br/>\nturned you off of English, but you would have ADORED  Steinbeck.<br/>\n <br/>\n&quot;School subjects&quot; screw with kids&#39; heads for years!<br/>\n <br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":149995806,"authorName":"catherine aceto","from":"&quot;catherine aceto&quot; &lt;aceto3@...&gt;","profile":"cat4cat15217","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: math (Daniel)","postDate":"1091827329","msgId":2598,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZWMwMWM0N2JmYiQ2ZjJkMTYxMCQ2ODAyYThjMEAyMDAyZGVza3RvcD4=","referencesHeader":"PGNmMGYxaStnaXM4QGVHcm91cHMuY29tPg=="},"prevInTopic":2596,"nextInTopic":2599,"prevInTime":2597,"nextInTime":2599,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"Looking back at your other interests, can you see why someone who was paying attention to your interests would have realized that you would have liked","messageBody":"<div id=\"ygrps-yiv-1623335989\">Looking back at your other interests, can you see why someone who was paying attention to your interests would have realized that you would have liked Differential Equations, etc.?  Part of the problem with &quot;schoolthink&quot; is that the concept of &quot;math&quot; seems like a uniform thing including both arithmetic and topology -- and knowing that you don&#39;t like one part can make it seem that you won&#39;t like the whole.  And, of course, the sheer amount of time that one wastes in school reduces the amount of time that you can spend experimenting and trying things out and seeing what you like. <br/>\n<br/>\nBut also part of school is that at school there is no one really paying attention to you and thinking about things that you might like the in way that unschooling parents are able to.  I think it does take attention to your children and their interests to minimize the chance that they will be unaware of areas that they would appreciate.<br/>\n<br/>\n  But that being said -- I think the chances are good that you and they will miss some things that you and they will wish they had discovered earlier.  I think a real advantage of unschooling is that it helps prevent the &quot;schoolthink&quot; feeling of something being too late.  When you discover that you like something - you are free to pursue it, regardless of where you are on some arbitrary &quot;educational path.&quot; <br/>\n<br/>\nFrom my own life: when I was in college, I realized that I was interested in Artificial Intelligence research.  At the time, I decided that since I would be so far behind people who were already steeped in programming, that it wasn&#39;t even worth pursuing.  Now, of course, at 38, I laugh to think that I ever thought that ANYTHING at 21 was too late to pursue.  Ultimately, I am glad that I followed the course that I ended up following (law school and practice in corporate law), so I don&#39;t actually regret my actions and am no longer particularly interested in AI research  -but I would like to prevent my children being indoctrinated into having the same sense of artificial limits and windows on when things can be studied.<br/>\n<br/>\n-Cat <br/>\n  <br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Daniel Macintyre <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Friday, August 06, 2004 1:27 PM<br/>\n  Subject: [unschoolingbasics] Re: math (Daniel)<br/>\n<br/>\n<br/>\n   but thought I would give it a try after<br/>\n  my experience with Diff Eq., so I came &quot;THAT&quot; close to never knowing<br/>\n  how much I would enjoy it.<br/>\n<br/>\n  Daniel<br/>\n   <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":183485564,"authorName":"Daniel Macintyre","from":"&quot;Daniel Macintyre&quot; &lt;macintyd@...&gt;","profile":"macintyred","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Introduction","postDate":"1091814314","msgId":2596,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNmMGczYStqMHM3QGVHcm91cHMuY29tPg=="},"prevInTopic":2594,"nextInTopic":2598,"prevInTime":2595,"nextInTime":2597,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"You re probably right.  I hated math through most of my school time - I enjoy it a lot now, but I still remember all the time I didn t.  I certainly don t want","messageBody":"<div id=\"ygrps-yiv-1714378075\">You&#39;re probably right.  I hated math through most of my school time -<br/>\nI enjoy it a lot now, but I still remember all the time I didn&#39;t.  I<br/>\ncertainly don&#39;t want to traumatize my children with it - I just don&#39;t<br/>\nwant them to miss out on any opportunity they want to take.<br/>\n<br/>\nDaniel<br/>\n<br/>\n--- In unschoolingbasics@yahoogroups.com, &quot;Robyn Coburn&quot;<br/>\n&lt;dezigna@c...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt;&lt;I guess I&#39;m just worried that they won&#39;t be interested in math until<br/>\n&gt; they are adults and then one will suddenly want to be an engineer or<br/>\n&gt; astrophysicist and realize he or she has several years worth of Math<br/>\n&gt; to catch up on - Other subjects I&#39;m not so worried about - but math<br/>\n&gt; builds on itself and is such a LARGE subject!&gt;&gt;&gt;<br/>\n&gt; <br/>\n&gt; It is *not* a large subject in the scary way you are saying - that<br/>\n </span></blockquote>is your<br/>\n<blockquote><span title=\"ireply\"> &gt; residual schoolthink talking. Math concepts can be learnt very<br/>\n </span></blockquote>quickly when<br/>\n<blockquote><span title=\"ireply\"> &gt; there is a real motivation to do so - just like anything else. Nor<br/>\n </span></blockquote>does it<br/>\n<blockquote><span title=\"ireply\"> &gt; necessarily build on itself in the supposedly sequential manner that<br/>\n </span></blockquote>it is<br/>\n<blockquote><span title=\"ireply\"> &gt; destroyed ...I mean taught..in schools. The several years are<br/>\n </span></blockquote>*school years*<br/>\n<blockquote><span title=\"ireply\"> &gt; not real time interest based learning. The hours and hours are<br/>\n </span></blockquote>mostly drill<br/>\n<blockquote><span title=\"ireply\"> &gt; - and guess what? Drill is not necessary if the concepts are<br/>\n </span></blockquote>understood. How<br/>\n<blockquote><span title=\"ireply\"> &gt; are they understood? Through learning them in real contexts in the order<br/>\n&gt; that makes sense to the learner. <br/>\n&gt; <br/>\n&gt; Try &quot;The Unprocessed Child&quot; by Valerie Fitzenreiter, for an account,<br/>\n </span></blockquote>amongst<br/>\n<blockquote><span title=\"ireply\"> &gt; other great experiences, of a college bound Unschooler who never saw<br/>\n </span></blockquote>a work<br/>\n<blockquote><span title=\"ireply\"> &gt; book grasping all the math she needed to be Sumna Cum Laude (is that<br/>\n </span></blockquote>right<br/>\n<blockquote><span title=\"ireply\"> &gt; spelling?) in an amazingly short time.<br/>\n&gt; <br/>\n&gt; Of course if you spend your time anxiously watching for math &quot;teachable<br/>\n&gt; moments&quot; to appear, and saying things like &quot;This is really hard<br/>\n </span></blockquote>stuff, so<br/>\n<blockquote><span title=\"ireply\"> &gt; don&#39;t worry if you don&#39;t get it right away&quot; even in your own mind,<br/>\n </span></blockquote>you are<br/>\n<blockquote><span title=\"qreply\"> &gt; well on the way to creating math phobia without a school to assist you.<br/>\n&gt; <br/>\n&gt; Robyn L. Coburn<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ---<br/>\n&gt; Outgoing mail is certified Virus Free.<br/>\n&gt; Checked by AVG anti-virus system (http://www.grisoft.com).<br/>\n&gt; Version: 6.0.732 / Virus Database: 486 - Release Date: 7/29/2004 </span></blockquote></div>","specialLinks":[]},{"userId":183485564,"authorName":"Daniel Macintyre","from":"&quot;Daniel Macintyre&quot; &lt;macintyd@...&gt;","profile":"macintyred","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: math (Daniel)","postDate":"1091813234","msgId":2594,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNmMGYxaStnaXM4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNldTdkNCtzcDZiQGVHcm91cHMuY29tPg=="},"prevInTopic":2552,"nextInTopic":2596,"prevInTime":2593,"nextInTime":2595,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"Valerie, Thanks!  I needed to hear that.  I guess part of my worries with math actually stem from my own experiences in school.  I didn t like math through","messageBody":"<div id=\"ygrps-yiv-685275820\">Valerie,<br/>\n<br/>\nThanks!  I needed to hear that.  I guess part of my worries with math<br/>\nactually stem from my own experiences in school.  I didn&#39;t like math<br/>\nthrough school, Hated college math through Calculus, started thinking<br/>\nit was ok in Differential equations, and then fell in love with Modern<br/>\nalgebra, Set theory and Discrete Analysis.  I didn&#39;t need to take<br/>\nModern Algebra for my major, but thought I would give it a try after<br/>\nmy experience with Diff Eq., so I came &quot;THAT&quot; close to never knowing<br/>\nhow much I would enjoy it.<br/>\n<br/>\nDaniel<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Valerie&quot; &lt;valerie@u...&gt; wrote:<br/>\n&gt; &gt; I guess I&#39;m just worried that they won&#39;t be interested in math <br/>\n&gt; until they are adults and then one will suddenly want to be an <br/>\n&gt; engineer or astrophysicist and realize he or she has several years <br/>\n&gt; worth of Math to catch up on - Other subjects I&#39;m not so worried <br/>\n&gt; about - but math builds on itself and is such a LARGE subject!<br/>\n&gt; <br/>\n&gt; ***** Hi Daniel<br/>\n&gt; <br/>\n&gt; I apologize to those that have heard this before, but Laurie is a <br/>\n&gt; summa cum laude grad and now pursuing her PhD. She hated math. She <br/>\n&gt; didn&#39;t want anything math-like to come within 20 feet of her. She <br/>\n&gt; went so far as to find out that there was a college student in Texas <br/>\n&gt; that was so non-mathematical, that she was able to get a waiver from <br/>\n&gt; taking math classes to graduate from college. Laurie wanted to do <br/>\n&gt; that too. She felt that there should be a restriction on the back of <br/>\n&gt; her degree much like someone who has to wear glasses has a <br/>\n&gt; restriction on the back of their driver&#39;s license. &lt;g&gt;  I&#39;m <br/>\n&gt; grinning; Laurie was dead serious. <br/>\n&gt; <br/>\n&gt; Then Laurie decided she wanted to go to college. She took the <br/>\n&gt; remedial math classes and scored 100%. She went on to take 3 <br/>\n&gt; statistics classes that weren&#39;t required for her degree...just <br/>\n&gt; because she LOVES math so much. Statistics is so special to her now <br/>\n&gt; that her chosen career will be in that field. <br/>\n&gt; <br/>\n&gt; Basically, when SHE decided that she needed to know math, she was <br/>\n&gt; able to learn how quickly. As a sophomore, she was teaching seniors <br/>\n&gt; how to use their calculators and work statistics problems. <br/>\n&gt; <br/>\n&gt; Not bad for a kid that wasn&#39;t interested in math huh? <br/>\n&gt; <br/>\n&gt; love, Valerie<br/>\n&gt; www.ubpub.com </span></blockquote></div>","specialLinks":[]},{"userId":166012225,"authorName":"Nichole, in Dallas","from":"&quot;Nichole, in Dallas&quot; &lt;skhosaeviani@...&gt;","profile":"ms_fausey","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Introduction","postDate":"1091741838","msgId":2552,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYWQwMWM0N2IzNCQ2MjFjMTU2MCRiZTg5MTgwYUBTaGFocmFtPg==","referencesHeader":"PGNldTgwNitvOHRlQGVHcm91cHMuY29tPg=="},"prevInTopic":2551,"nextInTopic":2594,"prevInTime":2551,"nextInTime":2553,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"I know a girl in Montana who did just this thing. It can be done. ... Nichole ... From: Valerie To: unschoolingbasics@yahoogroups.com Sent: Thursday, August","messageBody":"<div id=\"ygrps-yiv-1975243261\">I know a girl in Montana who did just this thing.<br/>\n<br/>\nIt can be done.<br/>\n<br/>\n:o)<br/>\nNichole<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Valerie <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Thursday, August 05, 2004 4:14 PM<br/>\n  Subject: [unschoolingbasics] Re: Introduction<br/>\n<br/>\n<br/>\n  &gt; What is that statistics I&#39;ve heard?  All of high school math can <br/>\n  be <br/>\n  &gt; learned in 2 months or something like that by someone who is <br/>\n  &gt; interested and developmentally ready.   <br/>\n  &gt; Christy<br/>\n<br/>\n  ***** Try &quot;12 years of math can be learned in 2 months!&quot; &lt;g&gt;<br/>\n<br/>\n  love, Valerie<br/>\n  www.ubpub.com<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":141910957,"authorName":"Valerie","from":"&quot;Valerie&quot; &lt;valerie@...&gt;","profile":"valfitz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Introduction","postDate":"1091740486","msgId":2551,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNldTgwNitvOHRlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNlcXUxYityZjJsQGVHcm91cHMuY29tPg=="},"prevInTopic":2548,"nextInTopic":2552,"prevInTime":2550,"nextInTime":2552,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"... be ... ***** Try 12 years of math can be learned in 2 months!  love, Valerie www.ubpub.com","messageBody":"<div id=\"ygrps-yiv-668289955\"><blockquote><span title=\"ireply\">&gt; What is that statistics I&#39;ve heard?  All of high school math can <br/>\n </span></blockquote>be <br/>\n<blockquote><span title=\"ireply\"> &gt; learned in 2 months or something like that by someone who is <br/>\n&gt; interested and developmentally ready.   <br/>\n&gt; Christy<br/>\n<br/>\n </span></blockquote>***** Try &quot;12 years of math can be learned in 2 months!&quot; &lt;g&gt;<br/>\n<br/>\nlove, Valerie<br/>\nwww.ubpub.com</div>","specialLinks":[]},{"userId":141910957,"authorName":"Valerie","from":"&quot;Valerie&quot; &lt;valerie@...&gt;","profile":"valfitz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"math (Daniel)","postDate":"1091739876","msgId":2548,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNldTdkNCtzcDZiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNlcXJuYytxaDBpQGVHcm91cHMuY29tPg=="},"prevInTopic":2522,"nextInTopic":2551,"prevInTime":2547,"nextInTime":2549,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"... until they are adults and then one will suddenly want to be an engineer or astrophysicist and realize he or she has several years worth of Math to catch up","messageBody":"<div id=\"ygrps-yiv-1813664290\"><blockquote><span title=\"ireply\">&gt; I guess I&#39;m just worried that they won&#39;t be interested in math <br/>\n </span></blockquote>until they are adults and then one will suddenly want to be an <br/>\nengineer or astrophysicist and realize he or she has several years <br/>\nworth of Math to catch up on - Other subjects I&#39;m not so worried <br/>\nabout - but math builds on itself and is such a LARGE subject!<br/>\n<br/>\n***** Hi Daniel<br/>\n<br/>\nI apologize to those that have heard this before, but Laurie is a <br/>\nsumma cum laude grad and now pursuing her PhD. She hated math. She <br/>\ndidn&#39;t want anything math-like to come within 20 feet of her. She <br/>\nwent so far as to find out that there was a college student in Texas <br/>\nthat was so non-mathematical, that she was able to get a waiver from <br/>\ntaking math classes to graduate from college. Laurie wanted to do <br/>\nthat too. She felt that there should be a restriction on the back of <br/>\nher degree much like someone who has to wear glasses has a <br/>\nrestriction on the back of their driver&#39;s license. &lt;g&gt;  I&#39;m <br/>\ngrinning; Laurie was dead serious. <br/>\n<br/>\nThen Laurie decided she wanted to go to college. She took the <br/>\nremedial math classes and scored 100%. She went on to take 3 <br/>\nstatistics classes that weren&#39;t required for her degree...just <br/>\nbecause she LOVES math so much. Statistics is so special to her now <br/>\nthat her chosen career will be in that field. <br/>\n<br/>\nBasically, when SHE decided that she needed to know math, she was <br/>\nable to learn how quickly. As a sophomore, she was teaching seniors <br/>\nhow to use their calculators and work statistics problems. <br/>\n<br/>\nNot bad for a kid that wasn&#39;t interested in math huh? <br/>\n<br/>\nlove, Valerie<br/>\nwww.ubpub.com</div>","specialLinks":[]},{"userId":140240070,"authorName":"eriksmama2001","from":"&quot;eriksmama2001&quot; &lt;scubamama@...&gt;","profile":"eriksmama2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Trust was Re: Introduction","postDate":"1091654205","msgId":2522,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNlcmpudCtlbzN0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNlb2lrbSt0YjVqQGVHcm91cHMuY29tPg=="},"prevInTopic":2507,"nextInTopic":2548,"prevInTime":2521,"nextInTime":2523,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"Trust your child to learn from life, don t teach fear of living life. Pat .--- In unschoolingbasics@yahoogroups.com, Daniel Macintyre ... I ... can t ... is","messageBody":"<div id=\"ygrps-yiv-502315504\">Trust your child to learn from life, don&#39;t teach fear of living life.<br/>\n<br/>\nPat<br/>\n<br/>\n<br/>\n.--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Daniel Macintyre&quot; <br/>\n&lt;macintyd@s...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Hi, <br/>\n&gt; <br/>\n&gt; I am new to the group and thought I would introduce myself.  I am <br/>\n&gt; Daniel Macintyre from O&#39;Fallon IL.  I am looking at homeschooling <br/>\n&gt; options and am leaning towards the unschooling route.  I have a son <br/>\n&gt; and a daughter, 3 1/2 years and 10 months respectively, so I still <br/>\n&gt; have a decent amount of time to make a decision.  Just to get the <br/>\n&gt; ball rolling, I thought I would come right out and ask, Why should <br/>\n </span></blockquote>I <br/>\n<blockquote><span title=\"ireply\"> &gt; unschool?  What are the pitfalls to avoid?  what are the cons I <br/>\n </span></blockquote>can&#39;t <br/>\n<blockquote><span title=\"ireply\"> &gt; avoid?  It seems that there is some variation in what people think <br/>\n </span></blockquote>is <br/>\n<blockquote><span title=\"qreply\"> &gt; unschooling, is that true?  What do you feel is essential to <br/>\n&gt; unschooling?  What about math?  What about College?  <br/>\n&gt; <br/>\n&gt; Sorry for the unloading<br/>\n&gt; <br/>\n&gt; Daniel </span></blockquote></div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Introduction","postDate":"1091637995","msgId":2507,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODA0LjEwNDYzNi4yMjYwLjEuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":2499,"nextInTopic":2522,"prevInTime":2506,"nextInTime":2508,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"***Why should I unschool?*** Because people want to be free and children are people. Institutionalization of children is *not* a normal part of healthy human ","messageBody":"<div id=\"ygrps-yiv-1467244660\">***Why should I unschool?***<br/>\n<br/>\nBecause people want to be free and children are people. <br/>\nInstitutionalization of children is *not* a normal part of healthy human<br/>\ngrowth.  It&#39;s a social experiment and the tactics they use are shame,<br/>\nguilt, conformity, obedience, confinement and force.  If your children<br/>\nare not lab rats, don&#39;t put them in the cage.  <br/>\n<br/>\nUnschooling is the free and joyful life of learning humans are meant to<br/>\nlive.   <br/>\nChildren who live with loving, interesting people learn what they need to<br/>\nknow in their lives because that&#39;s exactly what humans specialize in.    <br/>\n <br/>\n***What are the pitfalls to avoid? ***<br/>\n<br/>\nYour own public or private school programing that tells you children need<br/>\nto be taught or they won&#39;t learn.<br/>\nYou may find yourself unfairly assessing your children or comparing them<br/>\nto children who attend school.   You may be tempted to blame unschooling<br/>\nfor family problems when unschooling is not the problem.  You may find it<br/>\ndifficult to let go of and rethink society&#39;s blueprint of what it means<br/>\nto be a responsible parent.  <br/>\n<br/>\n*** what are the cons I can&#39;t avoid? ***<br/>\n<br/>\nFriends, family members and strangers will not understand and in many<br/>\ncases will do their damndest to convince you you&#39;re wrong.  They may try<br/>\nto convince you by showing you your children are lacking in some area. <br/>\nThey may try to convince you with books, studies, experts, laws, or<br/>\nanger.  You may lose friends.  <br/>\n<br/>\n***It seems that there is some variation in what people think is<br/>\nunschooling, is that true?***<br/>\n<br/>\nYes.  Some people think unschooling is letting a child choose which unit<br/>\nstudy to work on this month. <br/>\nSome people think unschooling is letting a child choose when and where he<br/>\nwants to do his math workbook. Some people think unschooling is not doing<br/>\nschool.<br/>\nSome people think unschooling is life, naturally.  They think children<br/>\nlearn what they need to know in the course of living life in world full<br/>\nof possibilities.<br/>\n<br/>\n***What do you feel is essential to unschooling?***<br/>\n<br/>\nTrusting your children will learn and grow.  Being involved in their<br/>\nlives and interests and being available to inspire, encourage and help<br/>\nthem in ways they need.   Understanding learning is a personal journey<br/>\nand happens when the learner is ready for it, not when *you* think they<br/>\nshould be ready.  Parents need to be interesting people who find pleasure<br/>\nin life.  They need to be positive.  They need to have humor and<br/>\nflexibility and patience.   <br/>\n<br/>\n***What about math?***  <br/>\n<br/>\nMath is all around us.  When your child pays for a toy at the store, when<br/>\nshe divides cookies evenly between family members, when she counts the<br/>\nchannels from your favorite news station to Boomerang, when she waits an<br/>\nhour for popsicles to freeze, math is a part of a child&#39;s real life.  <br/>\nWhen their real lives call for the use and understanding of other types<br/>\nof math they will find it and use it. <br/>\n<br/>\n***What about College?***  <br/>\n<br/>\nYour kids might not choose college.  Life is big.  Life is bigger than<br/>\ncollege.  Lots of times people go to college to make their small lives<br/>\nlarger, by getting away from their parents, meeting new people, doing new<br/>\nthings, being independent.   But kids who were never confined in an<br/>\ninstitution and boxed into thinking life was about SAT scores and school,<br/>\nwill have a world of options and college will be only one.  <br/>\n<br/>\nIn the years between your three year old and college things might change<br/>\nin ways you cannot conceive of.  <br/>\nBut if your children choose college they will be able to go.   <br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Introduction","postDate":"1091632288","msgId":2499,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwMy40YzE5ODE0ZC4yZTQyNTZhMEBhb2wuY29tPg=="},"prevInTopic":2498,"nextInTopic":2507,"prevInTime":2498,"nextInTime":2500,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/4/2004 10:28:34 AM Eastern Daylight Time, macintyd@scott.disa.mil writes: I like  the idea that my children will learn what interests","messageBody":"<div id=\"ygrps-yiv-343799849\">In a message dated 8/4/2004 10:28:34 AM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:macintyd@...\">macintyd@...</a> writes:<br/>\n<br/>\nI like  the idea that my children will learn what interests them.  I<br/>\nwant them  to enjoy learning and feel that they will learn more and<br/>\nmore effectively  if the are interested in what they learn.<br/>\n<br/>\nI feel kind of silly saying  that here - like telling Donald Trump that<br/>\nthere is money to be made in  real estate.&lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\nYeah. &lt;g&gt; But you have the right idea! &lt;BWG&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;I guess I&#39;m just worried that they won&#39;t be interested  in math until<br/>\n </span></blockquote>they are adults and then one will suddenly want to be an  engineer or<br/>\nastrophysicist and realize he or she has several years worth of  Math<br/>\nto catch up on - Other subjects I&#39;m not so worried about - but  math<br/>\nbuilds on itself and is such a LARGE  subject!&lt;&lt;&lt;&lt;<br/>\n <br/>\nAnd then you go and write THIS! &lt;g&gt;<br/>\n <br/>\nChances aren&#39;t good that a person will suddenly, out of the blue, with NO  <br/>\npreparation at all beforehand, will, at the age of 38 or so, decide to be  an <br/>\nengineer! Much more likely is that someone who is drawn to math and physics  <br/>\nwill hone in immediately or either meander towards astrophysics throughout his  <br/>\nlife. Those who are less math-interested will learn all the math they need to  <br/>\nuse. How much of your calculus did you use today? &lt;g&gt;<br/>\n <br/>\nA child, who is allowed to pursue his passions, WILL. His passions may  <br/>\nchange or grow or abruptly end. But all the while, he&#39;s making connections. His  <br/>\npassions (and therefore his connections) will include math---the world is  FULL <br/>\nof math: you can&#39;t avoid it. Math is art is science is history is  agriculture <br/>\nis literature is life (and I&#39;m mathphobic! &lt;g&gt;).<br/>\n <br/>\nTell you what----give me a &quot;subject&quot; or a passion, and I&#39;ll find the math  in <br/>\nit. (If I fail, I&#39;ll hand it over to our resident mathie, PamS.) Give me ten! <br/>\n &lt;g&gt; I dare you! &lt;G&gt; But I bet you&#39;ll find the math yourself before  you even <br/>\nthrow it at me!<br/>\n <br/>\nMath is a large subject, and it does build on itself, but it doesn&#39;t take  12 <br/>\nyears of worksheets to do it! Your three year old (?right?) already probably  <br/>\nknows some math concepts---&quot;more vs less&quot;, for sure! I bet she can count to  <br/>\nthree cookies! Hold up three fingers! Watch and learn! One day she&#39;ll say,  <br/>\n&quot;Daddy, did you know three fives are fifteen?&quot; She&#39;ll figure it out. She  WILL!<br/>\n <br/>\nUnschooling is trusting that it will happen. NOT that she&#39;ll become an  <br/>\nengineer, but that she will learn what she needs to know. Unschooling is about  <br/>\nyour facilitating her exploration and respecting her needs at that moment.<br/>\n <br/>\nI&#39;m glad you&#39;re here.<br/>\n <br/>\n~Kelly<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":129294861,"authorName":"christy_imnotred","from":"&quot;christy_imnotred&quot; &lt;christy_imnotred@...&gt;","profile":"christy_imnotred","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Introduction","postDate":"1091631979","msgId":2498,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNlcXUxYityZjJsQGVHcm91cHMuY29tPg=="},"prevInTopic":2495,"nextInTopic":2499,"prevInTime":2497,"nextInTime":2499,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"... until ... What is that statistics I ve heard?  All of high school math can be learned in 2 months or something like that by someone who is interested and","messageBody":"<div id=\"ygrps-yiv-1848613322\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Robyn Coburn&quot; <br/>\n&lt;dezigna@c...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt;&lt;I guess I&#39;m just worried that they won&#39;t be interested in math <br/>\n </span></blockquote>until<br/>\n<blockquote><span title=\"ireply\"> &gt; they are adults and then one will suddenly want to be an engineer or<br/>\n&gt; astrophysicist and realize he or she has several years worth of Math<br/>\n&gt; to catch up on - Other subjects I&#39;m not so worried about - but math<br/>\n&gt; builds on itself and is such a LARGE subject!&gt;&gt;&gt;<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>What is that statistics I&#39;ve heard?  All of high school math can be <br/>\nlearned in 2 months or something like that by someone who is <br/>\ninterested and developmentally ready.  And I don&#39;t think kids that <br/>\nhave had the freedom to explore their interests and really get to <br/>\nknow themselves will suddenly decide to be anything.  They most <br/>\nlikely will have been interested in the subject for quite a while and <br/>\nlearning about it as they go along.<br/>\n<br/>\nChristy</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Re: Introduction","postDate":"1091630730","msgId":2495,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGNlcXJuYytxaDBpQGVHcm91cHMuY29tPg=="},"prevInTopic":2493,"nextInTopic":2498,"prevInTime":2494,"nextInTime":2496,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-421419685\">&lt;&lt;&lt;I guess I&#39;m just worried that they won&#39;t be interested in math until<br/>\nthey are adults and then one will suddenly want to be an engineer or<br/>\nastrophysicist and realize he or she has several years worth of Math<br/>\nto catch up on - Other subjects I&#39;m not so worried about - but math<br/>\nbuilds on itself and is such a LARGE subject!&gt;&gt;&gt;<br/>\n<br/>\nIt is *not* a large subject in the scary way you are saying - that is your<br/>\nresidual schoolthink talking. Math concepts can be learnt very quickly when<br/>\nthere is a real motivation to do so - just like anything else. Nor does it<br/>\nnecessarily build on itself in the supposedly sequential manner that it is<br/>\ndestroyed ...I mean taught..in schools. The several years are *school years*<br/>\nnot real time interest based learning. The hours and hours are mostly drill<br/>\n- and guess what? Drill is not necessary if the concepts are understood. How<br/>\nare they understood? Through learning them in real contexts in the order<br/>\nthat makes sense to the learner. <br/>\n<br/>\nTry &quot;The Unprocessed Child&quot; by Valerie Fitzenreiter, for an account, amongst<br/>\nother great experiences, of a college bound Unschooler who never saw a work<br/>\nbook grasping all the math she needed to be Sumna Cum Laude (is that right<br/>\nspelling?) in an amazingly short time.<br/>\n<br/>\nOf course if you spend your time anxiously watching for math &quot;teachable<br/>\nmoments&quot; to appear, and saying things like &quot;This is really hard stuff, so<br/>\ndon&#39;t worry if you don&#39;t get it right away&quot; even in your own mind, you are<br/>\nwell on the way to creating math phobia without a school to assist you.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.732 / Virus Database: 486 - Release Date: 7/29/2004</div>","specialLinks":[]},{"userId":183485564,"authorName":"Daniel Macintyre","from":"&quot;Daniel Macintyre&quot; &lt;macintyd@...&gt;","profile":"macintyred","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Introduction","postDate":"1091629612","msgId":2493,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNlcXJuYytxaDBpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEyOC40N2QzNDkyMy4yZTQxMzliZUBhb2wuY29tPg=="},"prevInTopic":2479,"nextInTopic":2495,"prevInTime":2492,"nextInTime":2494,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"Thanks for the reply; ... 90 s. ... Solaire ... grown SO  much ... the  arch ... I live right by Solaire Kennel!  When I pass it I know I need to turn on my","messageBody":"<div id=\"ygrps-yiv-1274863019\">Thanks for the reply;<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In unschoolingbasics@yahoogroups.com, kbcdlovejo@a... wrote:<br/>\n&gt; In a message dated 8/3/2004 2:01:59 PM Eastern Daylight Time,  <br/>\n&gt; macintyd@s... writes:<br/>\n&gt; <br/>\n&gt; I am new  to the group and thought I would introduce myself.  I am <br/>\n&gt; Daniel  Macintyre from O&#39;Fallon IL.&lt;&lt;&lt;&lt;<br/>\n&gt;  <br/>\n&gt; Welcome, Daniel! My husband, Ben, was stationed @ Scott in the early<br/>\n90&#39;s.  <br/>\n&gt; We lived in Belleville (202 East E St) for three years. I worked @<br/>\nSolaire  <br/>\n&gt; Kennel in O&#39;Fallon when we were there. I  miss it----though it&#39;s<br/>\ngrown SO  much <br/>\n&gt; since we were there ten years ago! I still get teary whenever I see<br/>\nthe  arch <br/>\n&gt; on tv! &lt;g&gt;<br/>\n<br/>\n<br/>\nI live right by Solaire Kennel!  When I pass it I know I need to turn<br/>\non my turn signal :)<br/>\n<br/>\n<br/>\n&gt; <br/>\n&gt; &gt;&gt;&gt;&gt;Just to get the ball rolling, I thought I would  come right out<br/>\nand ask, <br/>\n&gt; Why should I  unschool?&lt;&lt;&lt;&lt;&lt;<br/>\n&gt;  <br/>\n&gt; Well, why are you looking into it in the first place? Something<br/>\nabout it  <br/>\n&gt; must intrigue you. What is it?<br/>\n&gt; <br/>\n<br/>\nI like the idea that my children will learn what interests them.  I<br/>\nwant them to enjoy learning and feel that they will learn more and<br/>\nmore effectively if the are interested in what they learn.<br/>\n<br/>\nI feel kind of silly saying that here - like telling Donald Trump that<br/>\nthere is money to be made in real estate.<br/>\n<br/>\n&gt; &gt;&gt;&gt;&gt;What are the pitfalls to  avoid?&lt;&lt;&lt;&lt;<br/>\n&gt;  <br/>\n&gt; Hanging around strict school-at-homers (doh!) and looking at<br/>\ncurriculum  <br/>\n&gt; catalogues. Using school-think and school-speak. Thinking that one<br/>\nkind of  <br/>\n&gt; learning (academic) is more important than all other kinds. It ALL<br/>\ncounts!<br/>\n&gt; <br/>\n&gt; &gt;&gt;&gt;&gt; what are the cons I can&#39;t  avoid?&lt;&lt;&lt;&lt;<br/>\n&gt;  <br/>\n&gt; The same old questions: What about socialization? What about<br/>\nreading? What  <br/>\n&gt; about math? What about college? <br/>\n&gt;  <br/>\n&gt; Living in a world of people who DON&#39;T respect or trust their<br/>\nkids---that&#39;s  <br/>\n&gt; the hardest, for me.<br/>\n&gt;  <br/>\n&gt; &gt;&gt;&gt;&gt;&gt;It seems that there is some variation in what people think  is <br/>\n&gt; unschooling, is that true?&lt;&lt;&lt;<br/>\n&gt;  <br/>\n&gt; You bet! Basically and at it&#39;s simplest form, it&#39;s NOT  replicating<br/>\nschool in <br/>\n&gt; your home----NOT schooling. But many of us have found that <br/>\nextending that <br/>\n&gt; into a philosophy of unschooling our LIVES is much more <br/>\nwonderful----letting <br/>\n&gt; the children learn about their bodies&#39; needs as well as  their<br/>\nminds&#39;. It&#39;s <br/>\n&gt; about respect and trust and honoring the children for who  they are<br/>\nnow---not what <br/>\n&gt; we want them to become.<br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt;  &gt;&gt;&gt;What do you feel is essential to  unschooling?&lt;&lt;&lt;&lt;<br/>\n&gt;  <br/>\n&gt; TRUST. RESPECT.<br/>\n&gt;  <br/>\n&gt; &gt;&gt;&gt;  What about math?&lt;&lt;&lt;&lt;<br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt; What about it? &lt;g&gt; Our lives are surrounded by math. They will  pick<br/>\nit up in <br/>\n&gt; a world rich with math. A child with a deep interest in math will,  of <br/>\n&gt; course, pick up more math than a child who is more interested in the<br/>\nwritten  word <br/>\n&gt; or animals or baseball or art (although EACH of those things is RICH<br/>\nin  math! <br/>\n&gt; &lt;g&gt;). But that&#39;s true of any &quot;subject&quot;: we learn what we&#39;re <br/>\ninterested in, <br/>\n&gt; what we love.<br/>\n&gt;  <br/>\n<br/>\nI guess I&#39;m just worried that they won&#39;t be interested in math until<br/>\nthey are adults and then one will suddenly want to be an engineer or<br/>\nastrophysicist and realize he or she has several years worth of Math<br/>\nto catch up on - Other subjects I&#39;m not so worried about - but math<br/>\nbuilds on itself and is such a LARGE subject!<br/>\n&gt;  <br/>\n&gt; &gt;&gt;&gt;What about College? &lt;&lt;&lt;<br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt; What about college? &lt;g&gt; Anyone with an interest in college can go. <br/>\nReally. <br/>\n&gt; Many colleges are actively pursuing unschoolers because of their<br/>\nlove of  <br/>\n&gt; learning (they&#39;re not tired of it like most high school grads) and<br/>\ntheir intense  <br/>\n&gt; interests and reasoned goals. Unschoolers who chose to go to college<br/>\ndo  VERY <br/>\n&gt; well.<br/>\n<br/>\nThat is what I figured, but I still feel reassured hearing it.  <br/>\n<br/>\n<br/>\n&gt;  <br/>\n&gt; Mostly, now, I&#39;d advise you to read here, read the message boards at  <br/>\n&gt; _www.unschooling.com_ (http://www.unschooling.com) , read all of<br/>\nJohn  Holt----in <br/>\n&gt; order, subscribe to Life Learning magazine, attend the Live and Learn  <br/>\n&gt; Unschooling Conference when you can-----but mostly PLAY with and<br/>\nobserve your  children. <br/>\n&gt; They&#39;ll teach you far more about learning and how it happens than <br/>\nanything <br/>\n&gt; else!<br/>\n&gt;  <br/>\n&gt; ~Kelly<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":152271008,"authorName":"Jon and Rue Kream","from":"&quot;Jon and Rue Kream&quot; &lt;skreams@...&gt;","profile":"ruekream","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Introduction","postDate":"1091561040","msgId":2479,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNDIwMWM0Nzk4ZiQ2ZjBmZmVlMCQ2NDAwYThjMEBsaXZpbmdyb29tMT4=","inReplyToHeader":"PGNlb2lrbSt0YjVqQGVHcm91cHMuY29tPg=="},"prevInTopic":2475,"nextInTopic":2493,"prevInTime":2478,"nextInTime":2480,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"Hi Daniel - ... unschool? **Our family unschools because we want our kids to be free, to be treated as whole people, and to choose their own lives.  For what","messageBody":"<div id=\"ygrps-yiv-1795086420\">Hi Daniel -<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Why should I<br/>\n </span></blockquote>unschool?<br/>\n<br/>\n**Our family unschools because we want our kids to be free, to be treated as<br/>\nwhole people, and to choose their own lives.  For what reasons do you find<br/>\nyourself leaning towards unschooling?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;What are the pitfalls to avoid?<br/>\n<br/>\n </span></blockquote>**I&#39;d say getting caught up in the ideas that children need to be molded and<br/>\nhurried along and should live under another person&#39;s authority.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;what are the cons I can&#39;t<br/>\n </span></blockquote>avoid?<br/>\n<br/>\n**Most people aren&#39;t going to understand how you live.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;What do you feel is essential to<br/>\n </span></blockquote>unschooling?<br/>\n<br/>\n**Seeing your children for who they are, enjoying their company, being<br/>\nwilling to help them get what they want and need, and being interested in<br/>\nthe world.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;What about math?<br/>\n<br/>\n </span></blockquote>**Math is all around us. My kids learn about math the same way they learn<br/>\nabout anything else - by observing the world around them, asking questions,<br/>\nmaking connections, and being open to new information.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;What about College?<br/>\n<br/>\n </span></blockquote>**Unschooled kids can get into college if they want to. The unschooled kids<br/>\nI know see it very much as a choice as opposed to seeing it as what you do<br/>\nwhen you turn 18 like so many schooled kids do.  ~Rue<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Introduction","postDate":"1091559358","msgId":2475,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyOC40N2QzNDkyMy4yZTQxMzliZUBhb2wuY29tPg=="},"prevInTopic":2472,"nextInTopic":2479,"prevInTime":2474,"nextInTime":2476,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/3/2004 2:01:59 PM Eastern Daylight Time, macintyd@scott.disa.mil writes: I am new  to the group and thought I would introduce myself.  I","messageBody":"<div id=\"ygrps-yiv-584683265\">In a message dated 8/3/2004 2:01:59 PM Eastern Daylight Time,  <br/>\nmacintyd@... writes:<br/>\n<br/>\nI am new  to the group and thought I would introduce myself.  I am <br/>\nDaniel  Macintyre from O&#39;Fallon IL.&lt;&lt;&lt;&lt;<br/>\n <br/>\nWelcome, Daniel! My husband, Ben, was stationed @ Scott in the early 90&#39;s.  <br/>\nWe lived in Belleville (202 East E St) for three years. I worked @ Solaire  <br/>\nKennel in O&#39;Fallon when we were there. I  miss it----though it&#39;s grown SO  much <br/>\nsince we were there ten years ago! I still get teary whenever I see the  arch <br/>\non tv! &lt;g&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;Just to get the ball rolling, I thought I would  come right out and ask, <br/>\n </span></blockquote>Why should I  unschool?&lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\nWell, why are you looking into it in the first place? Something about it  <br/>\nmust intrigue you. What is it?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;What are the pitfalls to  avoid?&lt;&lt;&lt;&lt;<br/>\n <br/>\n </span></blockquote>Hanging around strict school-at-homers (doh!) and looking at curriculum  <br/>\ncatalogues. Using school-think and school-speak. Thinking that one kind of  <br/>\nlearning (academic) is more important than all other kinds. It ALL counts!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt; what are the cons I can&#39;t  avoid?&lt;&lt;&lt;&lt;<br/>\n <br/>\n </span></blockquote>The same old questions: What about socialization? What about reading? What  <br/>\nabout math? What about college? <br/>\n <br/>\nLiving in a world of people who DON&#39;T respect or trust their kids---that&#39;s  <br/>\nthe hardest, for me.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;It seems that there is some variation in what people think  is <br/>\n </span></blockquote>unschooling, is that true?&lt;&lt;&lt;<br/>\n <br/>\nYou bet! Basically and at it&#39;s simplest form, it&#39;s NOT  replicating school in <br/>\nyour home----NOT schooling. But many of us have found that  extending that <br/>\ninto a philosophy of unschooling our LIVES is much more  wonderful----letting <br/>\nthe children learn about their bodies&#39; needs as well as  their minds&#39;. It&#39;s <br/>\nabout respect and trust and honoring the children for who  they are now---not what <br/>\nwe want them to become.<br/>\n <br/>\n <br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;What do you feel is essential to  unschooling?&lt;&lt;&lt;&lt;<br/>\n <br/>\n </span></blockquote>TRUST. RESPECT.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;  What about math?&lt;&lt;&lt;&lt;<br/>\n <br/>\n <br/>\n </span></blockquote>What about it? &lt;g&gt; Our lives are surrounded by math. They will  pick it up in <br/>\na world rich with math. A child with a deep interest in math will,  of <br/>\ncourse, pick up more math than a child who is more interested in the written  word <br/>\nor animals or baseball or art (although EACH of those things is RICH in  math! <br/>\n&lt;g&gt;). But that&#39;s true of any &quot;subject&quot;: we learn what we&#39;re  interested in, <br/>\nwhat we love.<br/>\n <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;What about College? &lt;&lt;&lt;<br/>\n <br/>\n <br/>\n </span></blockquote>What about college? &lt;g&gt; Anyone with an interest in college can go.  Really. <br/>\nMany colleges are actively pursuing unschoolers because of their love of  <br/>\nlearning (they&#39;re not tired of it like most high school grads) and their intense  <br/>\ninterests and reasoned goals. Unschoolers who chose to go to college do  VERY <br/>\nwell.<br/>\n <br/>\nMostly, now, I&#39;d advise you to read here, read the message boards at  <br/>\n_www.unschooling.com_ (http://www.unschooling.com) , read all of John  Holt----in <br/>\norder, subscribe to Life Learning magazine, attend the Live and Learn  <br/>\nUnschooling Conference when you can-----but mostly PLAY with and observe your  children. <br/>\nThey&#39;ll teach you far more about learning and how it happens than  anything <br/>\nelse!<br/>\n <br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":183485564,"authorName":"Daniel Macintyre","from":"&quot;Daniel Macintyre&quot; &lt;macintyd@...&gt;","profile":"macintyred","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Introduction","postDate":"1091554774","msgId":2472,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNlb2lrbSt0YjVqQGVHcm91cHMuY29tPg=="},"prevInTopic":1321,"nextInTopic":2475,"prevInTime":2471,"nextInTime":2473,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"Hi, I am new to the group and thought I would introduce myself.  I am Daniel Macintyre from O Fallon IL.  I am looking at homeschooling options and am leaning","messageBody":"<div id=\"ygrps-yiv-237183643\">Hi, <br/>\n<br/>\nI am new to the group and thought I would introduce myself.  I am <br/>\nDaniel Macintyre from O&#39;Fallon IL.  I am looking at homeschooling <br/>\noptions and am leaning towards the unschooling route.  I have a son <br/>\nand a daughter, 3 1/2 years and 10 months respectively, so I still <br/>\nhave a decent amount of time to make a decision.  Just to get the <br/>\nball rolling, I thought I would come right out and ask, Why should I <br/>\nunschool?  What are the pitfalls to avoid?  what are the cons I can&#39;t <br/>\navoid?  It seems that there is some variation in what people think is <br/>\nunschooling, is that true?  What do you feel is essential to <br/>\nunschooling?  What about math?  What about College?  <br/>\n<br/>\nSorry for the unloading<br/>\n<br/>\nDaniel</div>","specialLinks":[]},{"userId":779600,"authorName":"KathrynJB@aol.com","from":"KathrynJB@...","profile":"kathrynbeth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Introduction","postDate":"1088743110","msgId":1321,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1ZC4zOGYxZWEyOC4yZTE2NDBjNkBhb2wuY29tPg=="},"prevInTopic":1302,"nextInTopic":2472,"prevInTime":1320,"nextInTime":1322,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/1/2004 4:19:07 PM Eastern Standard Time, unschoolingbasics@yahoogroups.com writes: unschoolers that were listed in the Growing Without","messageBody":"<div id=\"ygrps-yiv-1763420803\">In a message dated 7/1/2004 4:19:07 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> writes:<br/>\n&quot;unschoolers that were listed in the Growing Without Schooling <br/>\nmagazine&#39;s list of unschoolers willing to host families traveling <br/>\nthorough out the world (I was heartbroken when that magazine stopped <br/>\nbeing published).&quot;<br/>\n<br/>\nMe TOO! I still have some beat up copies, can&#39;t bear to part with <br/>\nthem.:)<br/>\n*****************************<br/>\nRen, here&#39;s a REALLY good reason to come to the conference this August.<br/>\n<br/>\nI scored the coolest Raffle prize, from The Family Resource Center.<br/>\n<br/>\nNot a COMPLETE set, but a huge set of GWS, from #1.<br/>\n<br/>\nKathryn<br/>\n<br/>\n<br/>\nCome to the Live and Learn Unschooling Conference August 27-29 in Peabody, MA!<br/>\nFor more information, go to www.LiveandLearnConference.org<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Introduction","postDate":"1088704007","msgId":1302,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjMWltNyttdjRzQGVHcm91cHMuY29tPg=="},"prevInTopic":1301,"nextInTopic":1321,"prevInTime":1301,"nextInTime":1303,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"unschoolers that were listed in the Growing Without Schooling magazine s list of unschoolers willing to host families traveling thorough out the world (I was","messageBody":"<div id=\"ygrps-yiv-457381159\">&quot;unschoolers that were listed in the Growing Without Schooling <br/>\nmagazine&#39;s list of unschoolers willing to host families traveling <br/>\nthorough out the world (I was heartbroken when that magazine stopped <br/>\nbeing published).&quot;<br/>\n<br/>\nMe TOO! I still have some beat up copies, can&#39;t bear to part with <br/>\nthem.:)<br/>\n<br/>\nWelcome to the list Erika....it&#39;s nice to have folks that formerly <br/>\nlived in the NW. I left there 6 years ago and still miss it a lot.<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":142569454,"authorName":"erikad428","from":"&quot;erikad428&quot; &lt;davpitok@...&gt;","profile":"erikad428","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Introduction","postDate":"1088702809","msgId":1301,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjMWhncCttNWxAZUdyb3Vwcy5jb20+"},"prevInTopic":894,"nextInTopic":1302,"prevInTime":1300,"nextInTime":1302,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"Hello Everyone, I am happy to be a member of this group. The archives have made for a most interesting read. I think I m going to really like it here. My name","messageBody":"<div id=\"ygrps-yiv-1670111910\">Hello Everyone,<br/>\n <br/>\nI am happy to be a member of this group. The archives have made for <br/>\na most interesting read. I think I&#39;m going to really like it here. <br/>\nMy name is Erika and I live in Connecticut. My husband and I have 4 <br/>\nkids - One daughter (25) and three sons (21,19 & 11). <br/>\nMy Daughter lives in Seattle,(that where my husband and I grew up-we <br/>\nhave only lived in Ct for 4 1/2yrs)where she is a physician&#39;s <br/>\nassistant, and my oldest son lives in Boston(where he is a college <br/>\nsenior).  <br/>\nThe 19yr old is a recent highschool graduate(his choice, he was <br/>\nhomeschooled and will be attending college in Boston in the fall) <br/>\nand the 11yr old is my unschooler. He says he&#39;s not going to leave <br/>\nhome until college! <br/>\nWe are loving how close everything is in the northeast. With the <br/>\namount of museums, historic sites, universities and concentrations <br/>\nof so many different cultures, this is the perfect place to <br/>\nunschool. Our only problem is over-commitment, and here it is so <br/>\neasy to do(I am getting better at saying no). <br/>\nI belong to several HS groups here, two local ones that are all <br/>\nlearning-styles inclusive, a state wide inclusive group (it&#39;s nice <br/>\nthat Ct is so small) and a national unschooler group that just <br/>\nhappens to be based in Ct (it&#39;s called Unschoolers Unlimited and <br/>\ntheir e-mail address is www.borntoexplore.org/unschool). <br/>\nWe even picked the neighborhood we live in based in part because of <br/>\nsome unschoolers that were listed in the Growing Without Schooling <br/>\nmagazine&#39;s list of unschoolers willing to host families traveling <br/>\nthorough out the world (I was heartbroken when that magazine stopped <br/>\nbeing published). I knew if this small town had a family of friendly <br/>\nunschoolers living in it, then this was the town for me:-). <br/>\nWe have a great family life and have always been very close. I <br/>\nsometimes think that we are the only parents who never had un-<br/>\nattached teenagers(all three of my older kids have always loved to <br/>\nbe with us and have included us in most things going on in their <br/>\nlives). <br/>\nWe unschool because we wanted my youngest son to have a childhood <br/>\nthat was similar to the one my older kids had. It is so different <br/>\ntoday from when my oldest was starting out.<br/>\nI was always seen as strange because I roomed in with my daughter <br/>\nafter she was born (in a teaching hospital), had one of the first <br/>\nVBAC&#39;s (Vaginal Birth After a Cesarean) in a Seattle hospital, <br/>\nbreastfed all my kids beyond 6 months and now after years of owning <br/>\nmy own business (a small private school) I am a SAHM of 6 1/2yrs. So <br/>\nunschooling only adds to my long list of &quot;strange traits&quot;. I hope to <br/>\nkeep growing and learning from all who post here. <br/>\nI&#39;m happy to have found out about this site. I hope to participate <br/>\nhere a lot.<br/>\n <br/>\nTake Care,<br/>\nErika<br/>\n&quot;I am learning all the time, the tombstone will be my diploma&quot;-<br/>\nEartha Kitt</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Introduction","postDate":"1087933422","msgId":894,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkMC4yNDFjZDgwMi4yZTA5ZTVlZUBhb2wuY29tPg=="},"prevInTopic":851,"nextInTopic":1301,"prevInTime":893,"nextInTime":895,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/22/2004 11:11:24 AM Eastern Daylight Time, valerie@ubpub.com writes: *****Kelly, would you mind  giving your mailing address again  so ","messageBody":"<div id=\"ygrps-yiv-599757019\">In a message dated 6/22/2004 11:11:24 AM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:valerie@...\">valerie@...</a> writes:<br/>\n<br/>\n*****Kelly, would you mind &lt;g&gt; giving your mailing address again  so <br/>\nI can send a few things for the auction?  &lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\n118 Steeplechase South<br/>\nColumbia, SC 29209-4810<br/>\n<br/>\n<br/>\n<br/>\nI&#39;ll be there too, but I&#39;m getting damned nervous about  speaking!&lt;&lt;&lt;&lt;<br/>\n <br/>\nAs long as you&#39;re not me, you&#39;ll be fine!<br/>\n<br/>\n~Kelly, the fainting  public speaker<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141910957,"authorName":"Valerie","from":"&quot;Valerie&quot; &lt;valerie@...&gt;","profile":"valfitz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Introduction","postDate":"1087916764","msgId":851,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNiOWhzcytuYzZpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc4LjU5Zjc1OTcxLjJlMDg4NmZjQGFvbC5jb20+"},"prevInTopic":834,"nextInTopic":894,"prevInTime":850,"nextInTime":852,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"... August  27-29 in ... *****Kelly, would you mind  giving your mailing address again so I can send a few things for the auction? I ll be there too, but","messageBody":"<div id=\"ygrps-yiv-1347814158\"><blockquote><span title=\"ireply\">&gt; We&#39;ll be going to the Live and Learn Unschooling Conference <br/>\n </span></blockquote>August  27-29 in <br/>\n<blockquote><span title=\"ireply\"> &gt; Peabody, MA!<br/>\n&gt; <br/>\n&gt; ~Kelly<br/>\n<br/>\n </span></blockquote>*****Kelly, would you mind &lt;g&gt; giving your mailing address again so <br/>\nI can send a few things for the auction? <br/>\n<br/>\nI&#39;ll be there too, but I&#39;m getting damned nervous about speaking!<br/>\n<br/>\nlove, Valerie</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Introduction","postDate":"1087857992","msgId":834,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":""},"prevInTopic":831,"nextInTopic":851,"prevInTime":833,"nextInTime":835,"topicId":21,"numMessagesInTopic":0,"msgSnippet":" My last seemed a bit","messageBody":"<div id=\"ygrps-yiv-1846676547\">&lt;&lt;&lt;were my main teaching goals for our first year. <br/>\n.... Moving into American History next year......Haley is in Pre-K and<br/>\nloving it.  &gt;&gt;&gt;<br/>\n<br/>\n<br/>\nMy last seemed a bit snarky - thought I was on <br/>\nUnschoolingDiscussion - so here is the reply I wish had sent first.<br/>\n<br/>\nIf you do not wish to Unschool, then don&#39;t! However this is an Unschooling<br/>\nlist with people coming here to learn how to unschool better. It is no good<br/>\nfor someone then to come along and say, &quot;Or you could do *this* schoolish<br/>\nthing like we do, and your kids will still be happy&quot;, and not expect to be<br/>\nchallenged. Challenged at least on their definition of unschooling.<br/>\n<br/>\nEvery time a parent, seeing themselves as a teacher, has an educational goal<br/>\n*for* their child, they are depriving their child of developing their own<br/>\nlearning goal. Our children are wise. Their goals will most likely be so far<br/>\nbeyond the mere &quot;teaching&quot; goals that we could devise for them.<br/>\n<br/>\nUnschooling does not divide the world into grades or subjects. If allowed to<br/>\nfollow their interests without prodding, our children will make more<br/>\nconnections than we can dream of for them.<br/>\n<br/>\nI don&#39;t doubt that your kids are delightful and happy. I hope, if you write<br/>\na book about your homeschooling progam, it will be very successful and<br/>\nhelpful. However I hope you do *not* try to tell the world that what you are<br/>\ndoing *now* is Unschooling.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.707 / Virus Database: 463 - Release Date: 6/15/2004</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Introduction","postDate":"1087843580","msgId":831,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc4LjU5Zjc1OTcxLjJlMDg4NmZjQGFvbC5jb20+"},"prevInTopic":827,"nextInTopic":834,"prevInTime":830,"nextInTime":832,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/21/2004 10:41:59 AM Eastern Daylight Time, joannecwatson@charter.net writes: Anyone  else heading anywhere on holiday? ","messageBody":"<div id=\"ygrps-yiv-339995443\">In a message dated 6/21/2004 10:41:59 AM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:joannecwatson@...\">joannecwatson@...</a> writes:<br/>\n<br/>\nAnyone  else heading anywhere on <br/>\nholiday?<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\nWe&#39;ll be going to the Live and Learn Unschooling Conference August  27-29 in <br/>\nPeabody, MA!<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Introduction","postDate":"1087837010","msgId":827,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZEMjk2NkZGLUMzQTMtMTFEOC04M0EwLTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PGJlLmZhMDJhYTcuMmUwODU0NzFAYW9sLmNvbT4=","referencesHeader":"PGJlLmZhMDJhYTcuMmUwODU0NzFAYW9sLmNvbT4="},"prevInTopic":824,"nextInTopic":831,"prevInTime":826,"nextInTime":828,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"You don t need any math to understand a LOT of physics. In fact, schools have it backwards (as usual) - they should NOT be showing how to think about physics","messageBody":"<div id=\"ygrps-yiv-850422342\">You don&#39;t need any math to understand a LOT of physics. In fact, <br/>\nschools have it backwards (as usual) - they should NOT be showing how <br/>\nto think about physics using math until the student already has a HUGE <br/>\namount of conceptual understanding of physics. Otherwise, they separate <br/>\nphysics from what is &quot;real&quot; by inserting mathematics in the middle of <br/>\nit and they make it far more difficult for students to understand it.<br/>\n<br/>\nOH OH -- I have a book for you.<br/>\n<br/>\n&quot;Thinking Physics&quot; -- here is something from the back cover:<br/>\n<br/>\n&quot;In real life, the question comes first and the explanation follows. In <br/>\nschool the lecture comes first and the exam follows. In this book, as <br/>\nin real life, the question comes first. When the explanation follows it <br/>\ngoes to the central point fast. There is an easy way to explain <br/>\neverything (it&#39;s just hard to find it). That is Epsteins&#39;s Law, and <br/>\nthis book demonstrates it.&#39;<br/>\n<br/>\nHere is a sample. The way this would work is you should read the <br/>\nquestion and then NOT read the answer. Spend time talking about it with <br/>\nyour child - let them come up with ideas and you do too. Maybe wait a <br/>\nday or two before looking at the answer. Don&#39;t look at the answer too <br/>\nsoon - the point is to think about the question enough - delve into it <br/>\nenough - that when you do read the answer you go, &quot;AHA - okay, yeah <br/>\nthat&#39;s kind of what I was thinking&quot; or &quot;Whoa - that is a whole <br/>\ndifferent way of thinking about it.&quot; Or whatever - but you don&#39;t want <br/>\nto read the answer without having fooled with the question first, on <br/>\nyour own. The questions and answers sometimes have vocabulary I don&#39;t <br/>\nfully understand - they use real physics vocabulary, this is rigorous <br/>\nstuff, not watered down, in spite of the appearance of simplicity. So <br/>\nsometimes I have too look up words and sort those out before fully <br/>\nunderstanding. The answers sometimes take some hard work to understand. <br/>\nAND - sometimes I don&#39;t fully understand but understand as much as I <br/>\nwant at that moment so I just leave one and go on to something else.<br/>\n<br/>\nGluug, Gluug, Gluug<br/>\n<br/>\nYou are emptying a gallon jug or gallon can. As the liquid runs out it <br/>\nmakes a &quot;gluug gluug gluug&quot; sound. As the gallon becomes empty, the <br/>\nfrequency of the sound:<br/>\na) gets lower, that is: glug, gluug, gluuug.<br/>\nb) does not change, that is: gluug, gluug, gluug.<br/>\nc) gets higher, that is: gluuug, gluug, glug.<br/>\n<br/>\nThe answer is down below - I&#39;ll put a bunch of blank lines in so people <br/>\nwon&#39;t accidentally see it, in case they want to think for a while <br/>\nfirst. (I hope that&#39;ll work.)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nThe answer is: a.<br/>\nAs the liquid runs out the size of the air space in the jug grows and <br/>\nthe large air space, or cavity, has a lower resonant frequency. <br/>\nRemember: big organ pipes make the low notes. The liquid flow pulses at <br/>\nthe resonant frequency of the air cavity and that frequency decreases <br/>\nas the liquid spills out.<br/>\n    The reverse happens when you run water into a container. As the air <br/>\nspace becomes smaller the frequency of the sound which comes out of the <br/>\ncontainer increases. By listening, you can almost tell when the <br/>\ncontainer is full, without looking.<br/>\n   But why is the glugging sound frequency emitted on emptying always so <br/>\nvery much lower than the hissing sound emitted on filling? Because when <br/>\nthe container is emptying the water must vibrate with air, but when the <br/>\ncontainer is filling the air alone vibrates.<br/>\n  Imagine a little mass hanging on a spring and bouncing up and down. <br/>\nThen imagine a larger mass on the same spring. The larger mass bounces <br/>\nslower. It is harder to accelerate the larger mass. In a similar <br/>\nmanner, when emptying the container, the mass of water slows down the <br/>\nvibes.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jun 21, 2004, at 8:10 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Eberwhite@...\">Eberwhite@...</a> wrote:<br/>\n<br/>\n&gt; But, I know this works.  10 year old Logan (who came out of school  <br/>\n&gt; with a<br/>\n&gt; real math phobia) expressed an interest in &quot;learning more about  <br/>\n&gt; physics&quot;.  I<br/>\n&gt; informed him it&#39;s rather math heavy, did he still want to go  there?  <br/>\n&gt; He said,<br/>\n&gt; &quot;Well, give me a math problem I&#39;ve never done  before.&quot;<br/>\n<br/>\n-pam<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations. </span></blockquote></div>","specialLinks":[]},{"userId":84582487,"authorName":"Eberwhite@aol.com","from":"Eberwhite@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Introduction","postDate":"1087830641","msgId":824,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJlLmZhMDJhYTcuMmUwODU0NzFAYW9sLmNvbT4="},"prevInTopic":53,"nextInTopic":827,"prevInTime":823,"nextInTime":825,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/21/2004 3:07:31 AM Eastern Standard Time, doulos@ezymail.us writes: Well, I  guess that s enough to start on.  Who else is here?  What are","messageBody":"<div id=\"ygrps-yiv-1077820188\">In a message dated 6/21/2004 3:07:31 AM Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:doulos@...\">doulos@...</a> writes:<br/>\n<br/>\nWell, I  guess that&#39;s enough to start on.  Who else is here?  What are you  <br/>\nguys<br/>\n&quot;into&quot; right now?  <br/>\n<br/>\n<br/>\nGreetings!<br/>\n <br/>\nMy name is Linda and I am relatively new to this list also.<br/>\n <br/>\nI am Mom to 5 children, two sons (25, 22) who made it through the public  <br/>\nschools, though not unscathed.  I have 3 children still at home (12, 10 - a  <br/>\nLogan also!) and a daughter who just turned 9.<br/>\n <br/>\nWe began our homeschooling adventure with Logan, 2 years ago - pulling him  <br/>\nfrom 2nd grade.  His brother joined us in September this year, deciding not  to <br/>\nreturn to middle school 7th grade (thank goodness!).  Daughter, Holly  was my <br/>\nhold out and joined in January.  She&#39;s very social and didn&#39;t want  to give <br/>\nup her circle of friends, but also has dreadful allergies that were  <br/>\nexacerbated when she went into her classroom, often needing me to pick her up by  10:00 <br/>\nAM.  She just decided not to go back.<br/>\n <br/>\nWe dabbled with &quot;homeschooling&quot; or &quot;school at home&quot;, but no one was too  <br/>\nenthusiastic and I began to do a lot of reading - John Holt, John Taylor Gatto,  <br/>\nand my favorite, Frank Smith.  I was easily convinced the unschooling style  of <br/>\nlife would work for us.... it simply made so much sense!  <br/>\n <br/>\nWe are all currently &quot;deschooling&quot; - me included, to try to rid ourselves  of <br/>\nthe concepts and beliefs that we were inundated with in the public school  <br/>\nsystem.  I&#39;ve found these email lists to be supportive and helpful,  especially <br/>\nwhen I&#39;m feeling like the only one who is struggling or wondering  about <br/>\nsomething.<br/>\n <br/>\nBut, I know this works.  10 year old Logan (who came out of school  with a <br/>\nreal math phobia) expressed an interest in &quot;learning more about  physics&quot;.  I <br/>\ninformed him it&#39;s rather math heavy, did he still want to go  there?  He said, <br/>\n&quot;Well, give me a math problem I&#39;ve never done  before.&quot;  So I verbally gave him <br/>\na simple algebraic equation to solve,  something like:<br/>\n2x + 3y - 4 = 17.  After a few moments, in his head, came up with x =  3 and <br/>\ny = 5.  Well, needless to say, I am still reeling.  We did  several more and <br/>\nhe came up with some for me on his own.  We did this all  in the dark as we <br/>\nwere getting ready to fall asleep.<br/>\n <br/>\nAnyway, I never &quot;taught&quot; him any of this.  It is something he learned  when <br/>\nhe was ready and that will continue to be my reminder that this will work  and <br/>\nI needn&#39;t worry about anything.<br/>\n <br/>\nAs for summer treks, we are planning an early fall trip out west to the  <br/>\nGrand Canyon, past Mt. Rushmore, Badlands, etc., etc.  We choose to do it  early <br/>\nOctober to beat the heat and the crowds, since we have the flexibility of  not <br/>\nhaving to conform to a school schedule.  Part of the fun will be  <br/>\ninvestigating all the possible side trips, with the kids, via the Internet, to  make this <br/>\n3 week driving trip from Michigan a fun one.  We did the same  thing 2 years <br/>\nago when we drove, for 2 weeks, out to Cape Cod.  We never  drove for more than <br/>\n6 hours and stopped someplace new and interesting every  day.  We spent a <br/>\ncouple of days in New York City and 5 on the Cape and the  rest traveling and <br/>\nvisiting things we&#39;d never seen before - Frank Lloyd Wright&#39;s  Falling Water <br/>\nhouse, Valley Forge, Plymouth Rock, Niagara Falls.  We did  another trip the year <br/>\nbefore that to Williamsburg, stopping in Hershey, PA and  Washington, DC.  <br/>\n <br/>\nAnyway, welcome!<br/>\n <br/>\nLinda in Ann Arbor<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:_Eberwhite@...\">_Eberwhite@...</a>_ (mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Eberwhite@...\">Eberwhite@...</a>) <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":125789604,"authorName":"Onesnotenough@aol.com","from":"Onesnotenough@...","profile":"justlikemama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Introduction","postDate":"1085836789","msgId":53,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdlLjRmOTE3M2FhLjJkZTllN2Y1QGFvbC5jb20+"},"prevInTopic":51,"nextInTopic":824,"prevInTime":52,"nextInTime":54,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"I wish there was an unschooling conference going on in Missouri, it sounds like so much fun! We worry about what a child will be tomorrow, yet we forget that","messageBody":"<div id=\"ygrps-yiv-1232473564\"><html><head>\n \n</head> \n \n<div>I wish there was an unschooling conference going on in Missouri, it sounds like so much fun!</div>\n<div>&nbsp;</div>\n<div><font face=\"Arial\" color=\"#ff8080\" size=\"2\" FAMILY=\"SANSSERIF\"><i>We worry about what a child will be tomorrow, yet we forget that he<br>is someone today.<br>Stacia Tauscher</i></font></div></html></div>","specialLinks":[]},{"userId":779600,"authorName":"KathrynJB@aol.com","from":"KathrynJB@...","profile":"kathrynbeth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Introduction","postDate":"1085834526","msgId":51,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5YTBldStzM2NrQGVHcm91cHMuY29tPg=="},"prevInTopic":21,"nextInTopic":53,"prevInTime":50,"nextInTime":52,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"Hi folks! I m Kathryn Baptista, and my life is a little insane right now. I live in Salem, MA with my partner, Beth, and son Julian, who is 14. Thanks to the","messageBody":"<div id=\"ygrps-yiv-1995024694\">Hi folks!<br/>\nI&#39;m Kathryn Baptista, and my life is a little insane right now.<br/>\n<br/>\nI live in Salem, MA with my partner, Beth, and son Julian, who is 14. <br/>\nThanks to the Massachusetts Supreme Judicial Court (those &quot;activist <br/>\njudges!&quot;) Beth and I are getting married in one week! <br/>\n<br/>\nSo I&#39;ve been planning a wedding, and the Live and Learn Unschooling <br/>\nconference, working (I&#39;m a Director of Religious Education at a <br/>\nUnitarian Universalist church), and unschooling with Julian. As I <br/>\nsaid, a bit crazy right now.<br/>\n<br/>\nAbout Unschooling: we&#39;ve been unschoolers since about six weeks <br/>\nbefore Julian left the third grade, and school, for good. It&#39;s the <br/>\nmost wonderful way to be a family. Early on, we realized that we <br/>\ncouldn&#39;t &quot;unschool Julian.&quot;  We all had to agree that our family <br/>\nvalued and loved learning and would support each other to be the best <br/>\npeople we could be. So while we support Julian in learning and <br/>\nexploring, etc., he does the same for us. <br/>\n<br/>\nWe&#39;re almost a ridiculously happy family.<br/>\n<br/>\nAnyway....you probably won&#39;t see much of me for the next couple of <br/>\nweeks, but then I go into Full Conference mode.<br/>\n<br/>\nPLEASE come to the conference! It&#39;s going to be a blast. You&#39;ll learn <br/>\ntons about unschooling, and you and the kids won&#39;t want to go home. <br/>\nThe Early Bird deadline is June 1. Go to <br/>\nwww.LiveandLearnConference.org for more information.<br/>\n<br/>\nKathryn</div>","specialLinks":[]},{"userId":163221353,"authorName":"Tina","from":"&quot;Tina&quot; &lt;zoocrew@...&gt;","profile":"tina010871","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Introduction","postDate":"1085786888","msgId":21,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5OGh1OCsyYzJoQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":51,"prevInTime":20,"nextInTime":22,"topicId":21,"numMessagesInTopic":0,"msgSnippet":"Hi, I m Tina.  Pat and I have a combined family of seven children: Tabitha, 18, and Amy, 17 for another month, both had their last day of public high school","messageBody":"<div id=\"ygrps-yiv-1664984373\">Hi, I&#39;m Tina.  Pat and I have a combined family of seven children:  <br/>\nTabitha, 18, and Amy, 17 for another month, both had their last day <br/>\nof public high school yesterday.  YIPPEE!!!  I&#39;m SO happy to have two <br/>\nless children in that institution!  Tammi and Tracey are 16-year-old <br/>\ntwins with one year of public high school left.  Amie is 14 and in <br/>\n8th grade, and Andrew is 12 in 6th grade both at a local charter <br/>\nschool system.  Adrian is 10 years old and my only home schooled <br/>\nchild.  He has been unschooled since Christmas.  We really haven&#39;t <br/>\ndone any &quot;school work&quot; since before the holidays.  <br/>\n<br/>\nSo, as you can see, our family is a little unique to say the least.  <br/>\nIt is my dream to someday homeschool Amie and Andrew, but I don&#39;t <br/>\nknow if that will ever happen.  Long story...I&#39;ve had a ton of advice <br/>\non that topic, but I just can&#39;t go there right now.  So, Adrian and I <br/>\nare it.  He loves being homeschooled and is taking to unschooling <br/>\nnaturally.  Yeah, I know...no surprise there.  <br/>\n<br/>\nI have been immersing myself in books.  I just finished, &quot;Do What You <br/>\nLove, The Money Will Follow&quot; and &quot;Unjobbing: The Adult Liberation <br/>\nHandbook&quot; and am currently reading &quot;The Teenage Liberation Handbook&quot; <br/>\nwhich I HIGHLY recommend to anyone interested in unschooling, not <br/>\njust teenagers.  This book is awesome.  The book that really hooked <br/>\nmy interest in unschooling was, &quot;Homeschooling our Children, <br/>\nUnschooling Ourselves.&quot;  That book is awesome as well!<br/>\n<br/>\nAnyway, this group was recommended to me by April at UofM; the local <br/>\nunschooling group in Michigan that I newly belong to.  I was a bit <br/>\napprehensive at first, but seeing everyone&#39;s posts and being <br/>\nencouraged by April, I am very happy to be here.  (My initial <br/>\nexperience when first seeking out other unschoolers wasn&#39;t exactly <br/>\npositive.)  I&#39;m happy to be in a friendly place with <br/>\nfamiliar &quot;faces&quot;, and I really look forward to learning and sharing <br/>\nwith everyone.<br/>\n<br/>\nTina</div>","specialLinks":[]}],"prevTopicId":49074,"nextTopicId":48813}}