{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":18,"messages":[{"userId":191799655,"authorName":"b prince","from":"b prince &lt;flyingtwinsmom@...&gt;","profile":"flyingtwinsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Why is deschooling important?","postDate":"1272206713","msgId":43774,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3ODg0Ny4yMDU3My5xbUB3ZWI1NDYwMS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGhxdm1zMStzMXE5QGVHcm91cHMuY29tPg==","referencesHeader":"PGhxdm1zMStzMXE5QGVHcm91cHMuY29tPg=="},"prevInTopic":43772,"nextInTopic":43775,"prevInTime":43773,"nextInTime":43775,"topicId":43751,"numMessagesInTopic":0,"msgSnippet":"Amberlee, Thanks for the ideas about groceries. I like the idea of asking them for their wants. Usually groceries aren t such a problem because they normally","messageBody":"<div id=\"ygrps-yiv-526128527\">Amberlee,<br/>\nThanks for the ideas about groceries. I like the idea of asking them for their wants. Usually groceries aren&#39;t such a problem because they normally do have what they want here. I&#39;m lucky in that they have always been very open to food, and have normally liked to eat &quot;good&quot; along with the &quot;bad.&quot; I remember when they were little they would order a sundae after dinner if we were eating out and they would take a few spoonfulls then ask if they &quot;had&quot; to finish it. I loved that they knew they could but really didn&#39;t want to. <br/>\nBonni <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":191799655,"authorName":"b prince","from":"b prince &lt;flyingtwinsmom@...&gt;","profile":"flyingtwinsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Why is deschooling important?","postDate":"1272206185","msgId":43775,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0MDMyNS4yNzUxOS5xbUB3ZWI1NDYwNy5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDE2MDgzMy40MTkyMC5xbUB3ZWI2NTcwOS5tYWlsLmFjNC55YWhvby5jb20+","referencesHeader":"PDE2MDgzMy40MTkyMC5xbUB3ZWI2NTcwOS5tYWlsLmFjNC55YWhvby5jb20+"},"prevInTopic":43774,"nextInTopic":0,"prevInTime":43774,"nextInTime":43776,"topicId":43751,"numMessagesInTopic":0,"msgSnippet":"**What kind of things do your kids do when they have friends over?** They play lots of outside games. Some organized like soccer and some just running around.","messageBody":"<div id=\"ygrps-yiv-513560701\">**What kind of things do your kids do when they have friends over?**<br/>\nThey play lots of outside games. Some organized like soccer and some just running around. At other times, they play on our playset and swing or run around it playing tag. Sometimes they just go into the woods and play in the water. If, and only if, the weather is so horrible they can&#39;t play outside do they bring it inside. When inside, they may play some computer games, WebKinz, or Wii, but usually they watch TV or find some made up game to play inside.<br/>\nBonni<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136944076,"authorName":"Jenna Robertson","from":"Jenna Robertson &lt;mamamole@...&gt;","profile":"Mamamole","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Why is deschooling important?","postDate":"1272157389","msgId":43772,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2MDgzMy40MTkyMC5xbUB3ZWI2NTcwOS5tYWlsLmFjNC55YWhvby5jb20+","inReplyToHeader":"PDg1ODM5MS4xNTk4LnFtQHdlYjU0NjAzLm1haWwucmUyLnlhaG9vLmNvbT4="},"prevInTopic":43771,"nextInTopic":43774,"prevInTime":43771,"nextInTime":43773,"topicId":43751,"numMessagesInTopic":0,"msgSnippet":"You say your house is the neighborhood hang out :) which sounds fun and busy.  What kind of things do your kids do when they have friends over?  My younger","messageBody":"<div id=\"ygrps-yiv-1549234515\">You say your house is the neighborhood hang out :) which sounds fun and busy.  What kind of things do your kids do when they have friends over?  My younger two love to act out stories they are reading.  There is probably a better way to say this but it&#39;s &quot;dramatic interpretation of the text&quot; or &quot;exploring literature through dramatic interpretation.&quot;  They have one friend they do this w/, with other friends they work cooperatively to solve computer games, and when they go to another friend&#39;s house they almost always play group games on the trampoline.<br/>\n<br/>\nYou might look to these times to see what skills they are expanding on beyond just social.  Learning happens all the time and time with friends can be very creative and full of learning.  <br/>\n<br/>\n:)<br/>\nJenna<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":301158115,"authorName":"amberlee_b","from":"&quot;amberlee_b&quot; &lt;amberlee16@...&gt;","profile":"amberlee_b","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Why is deschooling important?","postDate":"1272143553","msgId":43771,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxdm1zMStzMXE5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA2N0M2RTM5NEY1RjRGRTBCMDc0NTM1NTZENTEwMjg0QGRlYm9yYWg0M2YxM2ZkPg=="},"prevInTopic":43769,"nextInTopic":43772,"prevInTime":43770,"nextInTime":43772,"topicId":43751,"numMessagesInTopic":0,"msgSnippet":"I just wanted to toss in a couple things about groceries/grocery shopping....something that helped us was to sit down with each child and make a list of","messageBody":"<div id=\"ygrps-yiv-809140884\">I just wanted to toss in a couple things about groceries/grocery shopping....something that helped us was to sit down with each child and make a list of everything they wanted to eat or at least for us to purchase for the next 2 weeks. This way they saw that they were getting everything they wanted for breakfast, lunch and snacks and I took care of dinners from things they all like or enjoy helping to make.  The first time I did this with all 3 kids we only spent about $60 more than what we usually spent every 2 weeks.  The kids realized I would get them whatever they asked for and they had enough of &quot;their&quot; food to choose their breakfasts, lunches and snacks everyday for 2 weeks.  Then the next time they looked at what they still had on hand and told me what they wanted.  I spent $100 less than usual.  <br/>\n<br/>\nI am sure many new unschool parents think &quot;OMG you are insane, I will be buying pringles and M&Ms and frosted flakes/sugary cereals and they will never eat anything else.....&quot;  Well, maybe that is true for the first couple trips.  We discussed that we would get them what they wanted/needed, but that we wouldn&#39;t make more trips unless we needed something major like milk or bread.  They were ok with that idea.  The first list for my youngest (10) looked something like this Corn flakes, shredded wheat, honeycomb, peanut butter, strawberry jelly, milk, pringles, M&Ms, grapes, melons, oranges, apples, cheese slices, ham slices, crackers, string cheese, ravioli, corn tortillas... Not bad.  They choose what they love and really enjoy eating and are still getting all they need.  They don&#39;t eat it all at once, they choose what they want when and don&#39;t feel they need to horde or eat so much they burst.  They can graze or make monkey platters (I help with that) or they can ask me to make quesadillas, or whatever.  I always have eggs on hand so if they want pancakes or eggs I can do that as well.<br/>\n<br/>\nNow if you aren&#39;t ready to purchase everything they want ask for their top 5.  Recently we have had to really penny pinch, so I tell the kids to give me their lists and I will try to get everything on the list that I can but I may not be able to get all of it.  They are very understanding especially since I don&#39;t automatically choose the chips or candy as the thing not to get.  I find if there is candy or pop-tarts in the house they know they could choose, they are likely to not eat them all in one sitting.  <br/>\n<br/>\nWe have a teen that loves everything transformers/robotech/animae...if we had the money we would buy him everything, but we don&#39;t.  So how do we deal with that?  He keeps his top 5 available for us so if we have a little extra we can pick one up for him.  Same with the other kids.  One would love all the Legos another would love more DS games....they keep us posted on what they are interested in or want so that we could grab one when we can.  We also check all the thrift stores because sometimes we find legos or robots or pieces parts there that the kids can use.<br/>\n<br/>\nHope that helps...<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; ***I never used to have a problem with them wanting so much and now that I&#39;ve started saying yes more, they want more.***<br/>\n&gt; <br/>\n&gt;  ***I just don&#39;t have the $ for it. We&#39;ve even gotten into them telling me I shouldn&#39;t buy groceries because I had to tell them no to s </span></blockquote></div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Why is deschooling important?","postDate":"1272129222","msgId":43769,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIwMTMzNUZEN0M0OTQyNUFCM0IxQjkwQzdBNTRFNDczQGRlYm9yYWg0M2YxM2ZkPg=="},"prevInTopic":43768,"nextInTopic":43771,"prevInTime":43768,"nextInTime":43770,"topicId":43751,"numMessagesInTopic":0,"msgSnippet":"***Even something simple as my asking their favorite character gets an I don t know. *** Right.  This is what we ve been writing about.  Deschooling.  Your","messageBody":"<div id=\"ygrps-yiv-1316627798\">***Even something simple as my asking their favorite character gets an &quot;I don&#39;t know.&quot; ***<br/>\n<br/>\nRight.  This is what we&#39;ve been writing about.  Deschooling.  Your questions feel to them like mini examinations and they are resisting them.  They don&#39;t want to feel like they&#39;re being evaluated.  <br/>\n<br/>\nWhat you&#39;re not getting is that if you spend time watching with them, watching them watch, seeing their enjoyment, you will be able to see and hear what they like about the shows and you won&#39;t have to ask.    It&#39;s not their job to prove anything to you.  It&#39;s your job to see and understand what they&#39;re learning.    <br/>\n<br/>\n***...what do you mean by pulling stuff out of TV or their play?***<br/>\n<br/>\nIf your kids spend money, get change, consider their budgets, figure a score in a board game or bowling game, look at the clock to figure out when a TV program will air, bake or set a timer for baking - they&#39;re expanding their knowledge of math, demonstrating problem solving and operational skills.   That&#39;s what you put in the portfolio.   You can take pictures of items your child bought, receipts, pictures of your child shopping at the store, of your child playing a game or of the game by itself. You can  include a score card from a game,(or not)  and your assessment of their growing skills and understanding.    That&#39;s &quot;showing progress.&quot; <br/>\n<br/>\nIf your kids are watching Good Luck, Charlie, The Suite Life, etc. This can be &quot;social sciences&quot;    Your kids are exploring sibling relationships, parent child relationships, authority, morality and ethics, psychology, culture, etc.   When you notice your kids have an interesting observation about an episode or scene write it down, it can go into the portfolio. <br/>\n<br/>\nWhen they watch these programs they&#39;re also expanding their listening skill, comprehension, vocabulary.  This can be &quot;English.&quot; in your portfolio.    If there are fan magazines about those shows, get them.       For your kids they will be an extension of the shows they love, for you they will be samples for the portfolio of what your kids are enjoying.   <br/>\n<br/>\nDoes this help you to see how this can work?   You have to show that your kids are making progress.  From your own post to this list about how your children told the evaluator they hate reading and learning, any activity they engage in willingly and happily will be &quot;progress.&quot;   You don&#39;t have to prove they&#39;re on the road to a Masters degree by the end of the school year.    &quot;Show progress&quot; is pretty broad. <br/>\n<br/>\n***... having them &quot;do school&quot; still sticks with me.***<br/>\n<br/>\nYeah, get over that.   Seriously. <br/>\n<br/>\nIf you let your kids deschool, next year&#39;s portfolio will be easier.   If you make them do school work for the portfolio you *will* ruin unschooling and you won&#39;t be getting closer to your goal of helping them love learning.   You&#39;ll struggle and fight with them to get your samples and you&#39;ll have the same struggle next year.   You said your evaluator is willing to work with you.  She already knows your kids don&#39;t want to do anything that looks like school work.   If you give your assessment of what they&#39;re getting out of play with other kids, interests at home, shopping, etc.,  she&#39;s going to see progress.   <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":191799655,"authorName":"b prince","from":"b prince &lt;flyingtwinsmom@...&gt;","profile":"flyingtwinsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Why is deschooling important?","postDate":"1272073148","msgId":43766,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0NTYzMC4zMTY1NS5xbUB3ZWI1NDYwMS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGhxc3YwYSttM2lkQGVHcm91cHMuY29tPg==","referencesHeader":"PGhxc3YwYSttM2lkQGVHcm91cHMuY29tPg=="},"prevInTopic":43764,"nextInTopic":43767,"prevInTime":43765,"nextInTime":43767,"topicId":43751,"numMessagesInTopic":0,"msgSnippet":"plaidpanties666  also wrote: **So there s more going on! Great! Take pictures of that more - those may be things you can use as","messageBody":"<div id=\"ygrps-yiv-1680353238\">plaidpanties666 <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt; also wrote:<br/>\n**So there&#39;s more going on! Great! Take pictures of that &quot;more&quot; - those <br/>\nmay be things you can use as documentation for your evaluator.**<br/>\n<br/>\nThe more is things like finding the cat so they can play with him. Washing the neighbors dog because he likes our house during the day. Or just wondering around the house rather aimlessly. Sometimes, they/we play ball games outside or they ride bikes. <br/>\n<br/>\n<br/>\n*Please don&#39;t fall in the trap of having your kids fabricate &#39;samples&#39;. <br/>\nIf you&#39;re going to go that far, fabricate them yourself and be done with it. Do something more like a photo album if you possibly can, and write some descriptors that turn dressing Barbie into an educational <br/>\nexperience.*<br/>\n<br/>\nI&#39;m struggling with finding an evaluator that will accept photos or my written narrative as &quot;samples of work&quot; that our state requires. I don&#39;t want to make anything up to show. That is the reason that having them &quot;do school&quot; still sticks with me. I cringe at the idea, but I haven&#39;t been able to let it go yet. I am still a major work in progress, especially with deschooling myself. <br/>\nI was shocked by your description of Chowder. I guess I haven&#39;t given it a fair chance because if I&#39;m in the room when it comes on, I cringe and usually end up leaving. This brings up another fear of mine- what if I&#39;m not smart enough to unschool them? Also, we do talk all the time, but I&#39;ve never carried on a conversation about something like this without coming off as &quot;teaching.&quot; How does that work?<br/>\n<br/>\n**It might help you to go read some unschoolers blogs for ideas about the <br/>\nkinds of things you can &quot;report&quot; and how that looks - some unschoolers <br/>\nuse their blogs for that purpose. **<br/>\n<br/>\nCan you share some blogs that are good unschooling blogs? Most of them that I&#39;ve found, and I&#39;ve had a hard time finding them, share more of mom&#39;s thoughts on life rather than unschooling.<br/>\nThanks<br/>\nBonni<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":191799655,"authorName":"b prince","from":"b prince &lt;flyingtwinsmom@...&gt;","profile":"flyingtwinsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Why is deschooling important?","postDate":"1272072057","msgId":43768,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg1ODM5MS4xNTk4LnFtQHdlYjU0NjAzLm1haWwucmUyLnlhaG9vLmNvbT4=","inReplyToHeader":"PGhxc3RpOCs2ZXJsQGVHcm91cHMuY29tPg==","referencesHeader":"PGhxc3RpOCs2ZXJsQGVHcm91cHMuY29tPg=="},"prevInTopic":43767,"nextInTopic":43769,"prevInTime":43767,"nextInTime":43769,"topicId":43751,"numMessagesInTopic":0,"msgSnippet":"plaidpanties666  wrote: **Plan to go somewhere frivolous for lunch - a pastry shop, maybe.** That reminded me of a Kenyan restaurant","messageBody":"<div id=\"ygrps-yiv-1928821625\">plaidpanties666 <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt; wrote:<br/>\n**Plan to go somewhere frivolous for lunch - a pastry shop, maybe.**<br/>\nThat reminded me of a Kenyan restaurant that I&#39;ve wanted to try. It also reminds me that  we are pretty new to the area and really could use some time to explore the neat little shops rather than just using chain stores and heading home. <br/>\n<br/>\n**What are they watching on tv? You can pull a lot of literature, social <br/>\nstudies, science, even math out of common television programs. You can <br/>\nalso pull a lot of those themes out of play - are you able to watch them play with their friends? That&#39;s something else to think about, making <br/>\nyour home enticing to Other kids so that you get to see more of what <br/>\nyour kids are enjoying.**<br/>\nThey watch a lot of Disney, anything from Chowder to Suite Life to my new favorite Disney show-Good Luck, Charlie. The TV rarely goes off Disney, Nick or CN. They haven&#39;t come to like discussing TV with me. Even something simple as my asking their favorite character gets an &quot;I don&#39;t know.&quot; So, as stupid as this is to ask, what do you mean by pulling stuff out of TV or their play?<br/>\nOh- I should mention that they split their time between our house and one other. We are the neighborhood hang out and the other house is in a bordering neighborhood that they play at. My husband has a problem with everyone being here, but it is something that he realizes that he needs to work on. I grew up with my mom being the cool mom and I want the same for my kids. <br/>\nThanks<br/>\nBonni <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":191799655,"authorName":"b prince","from":"b prince &lt;flyingtwinsmom@...&gt;","profile":"flyingtwinsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Why is deschooling important?","postDate":"1272071539","msgId":43767,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyNzk4MS45NTIwOS5xbUB3ZWI1NDYwMy5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDQwNTA3Ny41NTM0OS5xbUB3ZWI2NTcwMS5tYWlsLmFjNC55YWhvby5jb20+","referencesHeader":"PDQwNTA3Ny41NTM0OS5xbUB3ZWI2NTcwMS5tYWlsLmFjNC55YWhvby5jb20+"},"prevInTopic":43766,"nextInTopic":43768,"prevInTime":43766,"nextInTime":43768,"topicId":43751,"numMessagesInTopic":0,"msgSnippet":"Jenna Robertson  wrote: **Ember replied, It means you feel like you don t have anything to do. That was a great moment for me because it","messageBody":"<div id=\"ygrps-yiv-862586148\">Jenna Robertson &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamamole@...\">mamamole@...</a>&gt; wrote:<br/>\n<br/>\n**Ember replied, &quot;It means you feel like you don&#39;t have anything to do.&quot;  <br/>\nThat was a great moment for me because it showed that Ember knows she <br/>\ndoes have things she could do and she has realized bored is a feeling.  **<br/>\n    That&#39;s a great way to look at boredom. Thanks for sharing.<br/>\n**Don&#39;t make it about learning, make it about getting out of the house and having fun, you&#39;ll learn w/out trying or planning.**<br/>\nThanks for all the great ideas about how to get out and about. I tend to say yes when they went something while we&#39;re out even though I know we can&#39;t afford it, then I am resentful that I let them talk me into it. I love your ideas about just fun trips. <br/>\nThanks again.<br/>\nBonni<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Why is deschooling important?","postDate":"1272064380","msgId":43764,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERDMERENjI4OEU1RDRDNzFBMUU0NjhGNDlCNEQ0NzRGQGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PGhxc3YwYSttM2lkQGVHcm91cHMuY29tPg=="},"prevInTopic":43763,"nextInTopic":43766,"prevInTime":43763,"nextInTime":43765,"topicId":43751,"numMessagesInTopic":0,"msgSnippet":"***they have gotten bored which is something they had never said before. *** Here is a link to some thoughts about boredom, if you haven t seen this yet:","messageBody":"<div id=\"ygrps-yiv-572619072\">***they have gotten &quot;bored&quot; which is something they had never said before. ***<br/>\n<br/>\nHere is a link to some thoughts about boredom, if you haven&#39;t seen this yet:   <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/BoredNoMore\">http://sandradodd.com/BoredNoMore</a>  <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Why is deschooling important?","postDate":"1272057867","msgId":43763,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2N0M2RTM5NEY1RjRGRTBCMDc0NTM1NTZENTEwMjg0QGRlYm9yYWg0M2YxM2ZkPg=="},"prevInTopic":43762,"nextInTopic":43764,"prevInTime":43762,"nextInTime":43764,"topicId":43751,"numMessagesInTopic":0,"msgSnippet":"***So they will move into this naturally? I m stuck in the here and now and find it hard to see that they will ever want to do any of those things, let alone","messageBody":"<div id=\"ygrps-yiv-1720647304\">***So they will move into this naturally? I&#39;m stuck in the here and now and find it hard to see that they will ever want to do any of those things, let alone that it will ever feel natural.***<br/>\n<br/>\nWhen they can stop associating &quot;doing&quot; with school they&#39;ll happily do all kinds of things.   That doesn&#39;t mean they&#39;ll ever do anything that *looks* like school work, but it means following a recipe won&#39;t feel like school work or a trip to a museum won&#39;t feel like a school field trip. <br/>\n<br/>\n*** I&#39;m unclear on the part about finding more of what they like and sharing it. Would I find games online, etc? We&#39;ve put the Hannah series on instant play (Netflix) for them, but they haven&#39;t gotten to it yet.***<br/>\n<br/>\nI don&#39;t know from Hannah or Chowder&lt;g&gt; but the idea would be to provide more of what they already like.  The Netflix stuff is great!  If there are Hannah movies, rent those.  Games?  Find some.  If you understand or can figure out what they like about Chowder or Hannah, look for other shows or movies that have that same element.  Look for music from the shows, look for online videos, etc.   If books aren&#39;t thrilling them right now then go easy on the books.  Make as much available to them as you can but don&#39;t expect them to use all of what you make available.  You&#39;re making it available to broaden their world.   They get to decide if and how they use it.<br/>\n<br/>\n*** Another problem is that they want to spend $ every time we go out, and I&#39;m broke now.***<br/>\n<br/>\nMake thrift stores or dollar stores or yard sales the outing destinations when you have a little money to spend.   When you don&#39;t have money, go for a hike or a picnic or a bike ride or whatever they like. <br/>\nOr make something at home that they love and have a fancy dinner or eat in the yard or something you think might be fun and different.   You live with your mom, is that right?  It&#39;s probably harder to be creative and spontaneous in somebody else&#39;s house.  Maybe have a little get away in your room with a picnic on the floor or something.  Whatever your kids might think is fun.  I&#39;m sorry, I can&#39;t remember how old you said your girls are.   <br/>\n<br/>\n***I never used to have a problem with them wanting so much and now that I&#39;ve started saying yes more, they want more.***<br/>\n<br/>\nIt&#39;s not that they want more, only that now there is the possibility that if they ask they might get what they want.  The want was always there. You&#39;re considering it now instead of shutting it down. <br/>\n<br/>\n ***I just don&#39;t have the $ for it. We&#39;ve even gotten into them telling me I shouldn&#39;t buy groceries because I had to tell them no to something they wanted. ***<br/>\n<br/>\nEvery time you go to the grocery store you are buying things you want.  You might be buying them for the whole family, but they were still your choice, still things you decided on.  From a kid&#39;s point of view that looks like you getting what you want while you&#39;re telling them there&#39;s no money for what they want.    I&#39;ve seen women in Wal-mart with their shopping carts full of hair color and makeup and nail polish and new kitchen towels telling their kids there was no money for some ten dollar toy.  Kids aren&#39;t stupid.   Even if you&#39;re buying rice and beans the kids see you getting what you want.   So, if you can shift some stuff so your budget includes something for the kids as often as you can, they will eventually see that you&#39;re making an effort.  <br/>\n<br/>\nNot having the money is your reality right now.   I know it makes things more challenging but there&#39;s a lot you can do if you get creative.   Think of ways you might help them get some of the things they want.  Check Freecycle lists.  Tell relatives who might be needing ideas for birthday gifts, let friends know what you&#39;re looking for so that they might pass on to you what they&#39;ve finished with, etc. <br/>\n<br/>\n***I actually have to meet with her again and show her the samples, etc. ***<br/>\n<br/>\nLook at the unschooling record keeping page in the Files section of this groups home page, print it out and make notes for yourself, casually, calmly. &lt;g&gt;     Your evaluator already knows how they feel about learning, she&#39;ll likely give you some leeway.   If reading is one of the required fields you need to show progress in you might write that your goal is for your children to enjoy reading and to be able to read for information and with that goal in mind you are making available materials you think will interest them and then list some of that material.  Include titles of books you have available,  things you read to them for pleasure and audio books.  The progress will be that they hate reading less. &lt;g&gt;   Be calm and positive and confident.   Your attitude will help your evaluator be calm and positive too.  Don&#39;t focus on what your kids aren&#39;t doing.  Look at what they are doing and fit  it to some evaluation field.  <br/>\n<br/>\n*** I&#39;ve actually thought about explaining the law to the girls and asking if they would agree to do just 5 &quot;sample&quot; works each week/every other week,***<br/>\n<br/>\nDon&#39;t do that!   Your kids will never get over the injury of school if they have to keep doing school.  You&#39;ll set back any progress you&#39;ve made deschooling.   The responsibility for meeting your state&#39;s requirements is *yours* not your children&#39;s.      <br/>\n<br/>\n <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Why is deschooling important?","postDate":"1272053578","msgId":43762,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxc3YwYSttM2lkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg5MDk5NC4yMzI5MS5xbUB3ZWI1NDYwNS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":43761,"nextInTopic":43763,"prevInTime":43761,"nextInTime":43763,"topicId":43751,"numMessagesInTopic":0,"msgSnippet":"... **************** So there s more going on! Great! Take pictures of that more - those may be things you can use as documentation for your evaluator. ","messageBody":"<div id=\"ygrps-yiv-1373780228\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, b prince &lt;flyingtwinsmom@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; They don&#39;t usually watch at any particular time. They turn it on when they wake up, then they wonder in and out depending on what else is going on.<br/>\n </span></blockquote>****************<br/>\n<br/>\nSo there&#39;s more going on! Great! Take pictures of that &quot;more&quot; - those may be things you can use as documentation for your evaluator. <br/>\n<br/>\nPlease don&#39;t fall in the trap of having your kids fabricate &#39;samples&#39;. If you&#39;re going to go that far, fabricate them yourself and be done with it. Do something more like a photo album if you possibly can, and write some descriptors that turn dressing Barbie into an educational experience. There&#39;s far more veracity to that than pretend workbook pages!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;shows like Chowder and Suite Life and Hannah, etc. <br/>\n<br/>\n </span></blockquote>I know cartoons better than the &quot;live action&quot; shows, but someone just wrote wonderful things about Suite Life, so go back and read that, too - for your own self as well as ideas for things to &quot;report&quot;. <br/>\n<br/>\nChowder! Wow, you&#39;ve got really fabulous artwork in that one, done in a sort of simulated cut and paste style - really reminds me of Terry Gilliam&#39;s animation style, great stuff, with exquisite color! Chowder is, appropriately, a visual feast. Its also a verbal feast. Lots of wordplay in Chowder, lots of quirky little references hidden in the wordplay, too, to things within the show and also outside the show - to other shows, old movies, history and politics (and of course, food). Like many children&#39;s cartoons, there&#39;s a good bit of visual metaphor, and Chowder has lots of exploration of excess vs lack as concepts in the visual themes as well as in the plot. Anything with a plot explores plot development! Anything with a character explores character development! Which characters do you kids like and not like? That&#39;s something that could come up casually in conversation - you don&#39;t even have to ask just say &quot;oh, that guy is so funny&quot; and see what your girls say. You can call that a &quot;discussion of character portrayal&quot; if you like ;)<br/>\n<br/>\nIt might help you to go read some unschoolers blogs for ideas about the kinds of things you can &quot;report&quot; and how that looks - some unschoolers use their blogs for that purpose. Did you see this already? Is it any help?<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschoolingcurriculum.html\">http://sandradodd.com/unschoolingcurriculum.html</a><br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Why is deschooling important?","postDate":"1272052104","msgId":43761,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxc3RpOCs2ZXJsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE0ODkwMS42NTk1Ny5xbUB3ZWI1NDYwNS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":43759,"nextInTopic":43762,"prevInTime":43760,"nextInTime":43762,"topicId":43751,"numMessagesInTopic":0,"msgSnippet":"... ************ There may be some of that going on, because that s what they know to do - and from their perspective, there s no telling how long this new","messageBody":"<div id=\"ygrps-yiv-370067295\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, b prince &lt;flyingtwinsmom@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Are we just coming into the &quot;let&#39;s test mom and see what she does&quot; phase?<br/>\n </span></blockquote>************<br/>\n<br/>\nThere may be some of that going on, because that&#39;s what they know to do - and from their perspective, there&#39;s no telling how long this new phase of yours will last. They&#39;re still needing to soak up a whole lot of &quot;do nothing&quot; but its starting to be dull. In a similar phase, I remember asking Ray if home was dull and he said &quot;kind of, but its still waaaaaaayyyyy better than school! That was boring and horrible, now if I&#39;m bored, I&#39;m Just bored.&quot; That was a pretty amazing statement - that &quot;just bored&quot; was a massive improvement in his life and something he didn&#39;t have to be afraid of, or afraid to admit. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;But now I&#39;m wondering what to do. I can&#39;t take the bickering and restlessness that they are starting to show. I try to find things they may be interested in but most of the time, they just don&#39;t want to do whatever it is that I&#39;ve suggested.<br/>\n </span></blockquote>******************<br/>\n<br/>\nMaybe don&#39;t worry so much about &quot;interesting things&quot;. If you&#39;re going stir crazy, find ways to get out of the house a bit. Go somewhere - a store, maybe - and wander. Don&#39;t worry about excitement. During the week shops have fewer customers and its possible to hang around a little. Plan to go somewhere frivolous for lunch - a pastry shop, maybe. Bring books or projects, even electronic games (gasp!). <br/>\n<br/>\nRight now they may not trust you not to have a Learning Agenda, and that could be part of why they resist going places and doing things. So its important to look for things that are (seemingly) a looooong way from &quot;learning opportunities&quot;. Rent the entire series of something ludicrous... Buffy the Vampire Slayer, or Pokemon something or other - whatever floats their boat. Get some new electronic games - a bunch at once (online... cheeeeeeaaap!) so they know you&#39;re trying to take fun seriously. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; I&#39;m stuck with finding some &quot;proof&quot; of learning. Our state requires the evaluator to examine samples of work from the 5 required subjects. So while I try to relax and let them be, I&#39;m still thinking about how I can show this to the evaluator.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nWhat are they watching on tv? You can pull a lot of literature, social studies, science, even math out of common television programs. You can also pull a lot of those themes out of play - are you able to watch them play with their friends? That&#39;s something else to think about, making your home enticing to Other kids so that you get to see more of what your kids are enjoying. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":136944076,"authorName":"Jenna Robertson","from":"Jenna Robertson &lt;mamamole@...&gt;","profile":"Mamamole","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Why is deschooling important?","postDate":"1272046780","msgId":43759,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwNTA3Ny41NTM0OS5xbUB3ZWI2NTcwMS5tYWlsLmFjNC55YWhvby5jb20+","inReplyToHeader":"PDE0ODkwMS42NTk1Ny5xbUB3ZWI1NDYwNS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":43758,"nextInTopic":43761,"prevInTime":43758,"nextInTime":43760,"topicId":43751,"numMessagesInTopic":0,"msgSnippet":"... Bonni I can really relate.  I m bored has been my youngest daughter s mantra for a while now.  First I had to let go of my feelings about that work","messageBody":"<div id=\"ygrps-yiv-221646480\">:) <br/>\nBonni I can really relate.  &quot;I&#39;m bored&quot; has been my youngest daughter&#39;s mantra for a while now.  First I had to let go of my feelings about that work (it&#39;s a trigger word for me, we were not allowed to say we were bored as children.  My father was always happy to find us something to do - and not something fun.)  Then I had to figure out if she wanted my help (she usually didn&#39;t) and then I started letting her know, &quot;It&#39;s o.k. to feel bored.&quot;  Yesterday we had a 5 yr old friend over and when Ember said,&quot;I&#39;m Bored&quot; our young friend asked &quot;What does &quot;bored&quot; mean?&quot;  Ember replied, &quot;It means you feel like you don&#39;t have anything to do.&quot;  That was a great moment for me because it showed that Ember knows she does have things she could do and she has realized bored is a feeling.  <br/>\n<br/>\nDo your girls like to shop?  This is the one thing my girls all love to do (and I don&#39;t - ironic!)  Before you say you don&#39;t have money for that, let me share that we&#39;ve been living on partial unemployment checks and part time jobs for 9 months.  Even when we aren&#39;t, my husband works for a non-profit and we usually pay the bills but don&#39;t have a lot extra.<br/>\n<br/>\nMy middle daughter loves to go on-line and look at the store sites and figure out different outfits she could buy w/ the money she has because she can get over whelmed by choices once in the store.  My youngest became really good at adding prices on candy at the corner gas station.  Yesterday my middle got a 40% off coupon from Justice - a store w/ cringe worthy prices! - and she was asking how to figure percentages and was subtracting and adding so she could figure out what she could get w/ her $20 she earned as a mother&#39;s helper last week.<br/>\n<br/>\nPlease don&#39;t tell your girls ;)  but shopping involved reading, socialization, all kinds of math, budgeting, map reading skills (if you are going to a new place), writing if you make lists, geography if there is any discussion of where things grow or come from..... <br/>\n<br/>\nEven if it&#39;s a trip to the $1 store or to get a kid scoop of ice cream at Baskin Robbins, it gives you an outing that your girls will not feel is in any way &quot;educational&quot; and yet it&#39;s real life and real learning.  And did I mention it&#39;s fun?  Then come up w/ a reason you want to stop in at the craft store along the way and pick up whatever catches their eye :)  or at the grocery store see if you can each find one new food to try (even if it&#39;s an ice cream flavor.)<br/>\n<br/>\n:)<br/>\nToday we are making the 20 minute walk to the grocery store (physical activity, too) as an outing and we&#39;ll buy food for tonight&#39;s sleepover and walk home (up hill carrying groceries - how crazy!!)<br/>\n<br/>\nDon&#39;t make it about learning, make it about getting out of the house and having fun, you&#39;ll learn w/out trying or planning.<br/>\n<br/>\nJenna<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n What is essential is to realize that children learn independently, not in bunches; that they learn out of interest and curiosity , not to please or appease the adults in power; and that they ought to be in control of their own learning, deciding for themselves what they want to learn and how they want to learn it. ~ John Holt ~ How Children Learn <br/>\n<br/>\n---<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":191799655,"authorName":"b prince","from":"b prince &lt;flyingtwinsmom@...&gt;","profile":"flyingtwinsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Why is deschooling important?","postDate":"1272037443","msgId":43758,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg5MDk5NC4yMzI5MS5xbUB3ZWI1NDYwNS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PERCNEY1NzJGMzZEMzRFMUFBQzRCRTE0MjVCNTY5RDFDQGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PDI3NTgyNS44MDE1Ny5xbUB3ZWI1NDYwNS5tYWlsLnJlMi55YWhvby5jb20+IDxEQjRGNTcyRjM2RDM0RTFBQUM0QkUxNDI1QjU2OUQxQ0BkZWJvcmFoNDNmMTNmZD4="},"prevInTopic":43757,"nextInTopic":43759,"prevInTime":43757,"nextInTime":43759,"topicId":43751,"numMessagesInTopic":0,"msgSnippet":"Deb Lewis  wrote: **Unschooling is normal life, when writing or drawing or following a recipe in a cook book feels natural, feels like","messageBody":"<div id=\"ygrps-yiv-1717671327\">Deb Lewis &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:d.lewis@...\">d.lewis@...</a>&gt; wrote:<br/>\n**Unschooling is normal life, when writing or drawing or following a <br/>\nrecipe in a cook book feels natural, feels like living,  and not like <br/>\nschool.**<br/>\nand<br/>\n**You won&#39;t have to shift, it will be a natural, gradual change.  **<br/>\n<br/>\nSo they will move into this naturally? I&#39;m stuck in the here and now and find it hard to see that they will ever want to do any of those things, let alone that it will ever feel natural.<br/>\n<br/>\n**   What kinds of TV shows and movies do they enjoy?  Try to find more of what they&#39;re liking and share it with them.**<br/>\n<br/>\nThey don&#39;t usually watch at any particular time. They turn it on when they wake up, then they wonder in and out depending on what else is going on. They watch Disney and Nick and CN so shows like Chowder and Suite Life and Hannah, etc. I usually come and sit when I notice they are into something. I&#39;m unclear on the part about finding more of what they like and sharing it. Would I find games online, etc? We&#39;ve put the Hannah series on instant play (Netflix) for them, but they haven&#39;t gotten to it yet. <br/>\n<br/>\n**Get out of the house if you can and just go wander.**<br/>\n<br/>\nI&#39;ve been trying to do that relatively often, and at first, they wanted to go with me, now they don&#39;t. Another problem is that they want to spend $ every time we go out, and I&#39;m broke now. I never used to have a problem with them wanting so much and now that I&#39;ve started saying yes more, they want more. I just don&#39;t have the $ for it. We&#39;ve even gotten into them telling me I shouldn&#39;t buy groceries because I had to tell them no to something they wanted. Very frustrating for me, and I have talked to them about budgeting but they don&#39;t get it.<br/>\n<br/>\n**But you only have to do that once a year, right? And you just saw the <br/>\nevaluator.  So you have another year before you need to worry about what to show her.**<br/>\n<br/>\nI actually have to meet with her again and show her the samples, etc. This was the first time we met her, and it was more of a let&#39;s see if we can work together type thing than the actual evaluation. So I&#39;ll actually have to come up with some &quot;samples&quot; from the time that I&#39;ve been deschooling. I&#39;ve actually thought about explaining the law to the girls and asking if they would agree to do just 5 &quot;sample&quot; works each week/every other week, even if I had to help them with it. That just goes so against unschooling and I know it would send a mixed message to them, but it would solve my issue with the evaluations.<br/>\n<br/>\nThanks for the words of wisdom.<br/>\nBonni<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Why is deschooling important?","postDate":"1272032620","msgId":43757,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERCNEY1NzJGMzZEMzRFMUFBQzRCRTE0MjVCNTY5RDFDQGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PDI3NTgyNS44MDE1Ny5xbUB3ZWI1NDYwNS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":43756,"nextInTopic":43758,"prevInTime":43756,"nextInTime":43758,"topicId":43751,"numMessagesInTopic":0,"msgSnippet":"***I m not sure I understand how deschooling is any different from unschooling. *** After an injury, or trauma, or a big stressful thing, a person needs time","messageBody":"<div id=\"ygrps-yiv-755009728\">***I&#39;m not sure I understand how deschooling is any different from unschooling. ***<br/>\n<br/>\nAfter an injury, or trauma, or a big stressful thing, a person needs time to recover.    For awhile, to help themselves feel better or get calmer, people sometimes avoid anything that reminds them of the trauma or stress.   School or school at home can make reading, drawing, writing, explaining, answering questions, asking questions or following directions of any kind feel like torture.  While kids are deschooling they might avoid any or all of those things that seem too similar to school or that remind them of the way they felt doing those things for school.   <br/>\n<br/>\nUnschooling is normal life, when writing or drawing or following a recipe in a cook book feels natural, feels like living,  and not like school.   <br/>\n<br/>\n***Or how to make the shift from deschooling to unschooling. ***<br/>\n<br/>\nYou won&#39;t have to shift, it will be a natural, gradual change.  <br/>\n<br/>\n***I&#39;ve let them alone to watch TV as much as they want.***<br/>\n<br/>\nMaybe try making a special event out of one of their favorite programs.  If they regularly watch a certain thing at a certain time, make some favorite food or popcorn or whatever they&#39;d like and sit with them and watch and be cheery.   What kinds of TV shows and movies do they enjoy?  Try to find more of what they&#39;re liking and share it with them. <br/>\n<br/>\n***I can&#39;t take the bickering and restlessness that they are starting to show***<br/>\n<br/>\nGet out of the house if you can and just go wander.  If they like to walk, go for walks.   Late night walks feel different and energizing.  Go for a ride, go wander the mall, go out for a sandwich.  Think about what you might do if you were on vacation and do those kinds of things.  Drive to another town if you can and wander through shops or parks.  <br/>\n<br/>\n***Are we just coming into the &quot;let&#39;s test mom and see what she does&quot; phase?***<br/>\n<br/>\nIf they&#39;ve said they&#39;re bored then they&#39;re bored.  Get out of the house.  You don&#39;t have to have a destination.  Pack a lunch and go.  <br/>\n<br/>\n ***Our state requires the evaluator to examine samples of work from the 5 required subjects. So while I try to relax and let them be, I&#39;m still thinking about how I can show this to the evaluator. ***<br/>\n<br/>\nBut you only have to do that once a year, right? And you just saw the evaluator.  So you have another year before you need to worry about what to show her.  <br/>\n<br/>\nDeb Lewis <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":191799655,"authorName":"b prince","from":"b prince &lt;flyingtwinsmom@...&gt;","profile":"flyingtwinsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Why is deschooling important?","postDate":"1271981070","msgId":43756,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0ODkwMS42NTk1Ny5xbUB3ZWI1NDYwNS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDNBREM0MzRDLUZDQzMtNDlGRi1CNUMzLUExQkUzNUQzNEU3NEB2ZXJpem9uLm5ldD4=","referencesHeader":"PDI3NTgyNS44MDE1Ny5xbUB3ZWI1NDYwNS5tYWlsLnJlMi55YWhvby5jb20+IDwzQURDNDM0Qy1GQ0MzLTQ5RkYtQjVDMy1BMUJFMzVEMzRFNzRAdmVyaXpvbi5uZXQ+"},"prevInTopic":43752,"nextInTopic":43757,"prevInTime":43755,"nextInTime":43757,"topicId":43751,"numMessagesInTopic":0,"msgSnippet":"Joyce Fetteroll  wrote: ** I m not sure I understand how deschooling is any different from ... They won t be saying they hate learning","messageBody":"<div id=\"ygrps-yiv-1977544637\">Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt; wrote:<br/>\n<br/>\n**&gt; I&#39;m not sure I understand how deschooling is any different from <br/>\n<blockquote><span title=\"ireply\"> &gt; unschooling.<br/>\n </span></blockquote>They won&#39;t be saying they hate learning ;-)**<br/>\n<br/>\nMy computer almost got a drenching from my tea when I read this. I needed the laugh today. Thanks.<br/>\n<br/>\n* It&#39;s time when they get to revel in the  freedom to reject what&#39;s been forced on them and to suck in the  freedom to do what was limited.*<br/>\n<br/>\nOver the last 2 weeks, they have gotten &quot;bored&quot; which is something they had never said before. I&#39;ve let them alone to watch TV as much as they want. I&#39;ve joined them watching some of their favorites too.  They wanted to drop out of 4H and soccer which I let them do. But now I&#39;m wondering what to do. I can&#39;t take the bickering and restlessness that they are starting to show. I try to find things they may be interested in but most of the time, they just don&#39;t want to do whatever it is that I&#39;ve suggested. They wait around until ps kids are home then play with friends. Is that rather normal? It wasn&#39;t like that for the first 4-6 weeks. They were interested in doing things like the museums and zoo. Now they aren&#39;t. Are we just coming into the &quot;let&#39;s test mom and see what she does&quot; phase?<br/>\n <br/>\n<br/>\n**She&#39;s* still thinking schoolishly. Observing and wondering and doing  are more powerful learning than reading someone else&#39;s observations  and conclusions.*<br/>\n<br/>\nI&#39;m stuck with finding some &quot;proof&quot; of learning. Our state requires the evaluator to examine samples of work from the 5 required subjects. So while I try to relax and let them be, I&#39;m still thinking about how I can show this to the evaluator. <br/>\n<br/>\n*For example kids deschooling might hate museums.*<br/>\n<br/>\nI had another laugh over this because it seemed like you must have been inside our home lately. The girls used to love the local Science Center, now they don&#39;t even want to go there. <br/>\n<br/>\nThanks Joyce<br/>\nBonni<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Why is deschooling important?","postDate":"1271963401","msgId":43752,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBREM0MzRDLUZDQzMtNDlGRi1CNUMzLUExQkUzNUQzNEU3NEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDI3NTgyNS44MDE1Ny5xbUB3ZWI1NDYwNS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDI3NTgyNS44MDE1Ny5xbUB3ZWI1NDYwNS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":43751,"nextInTopic":43756,"prevInTime":43751,"nextInTime":43753,"topicId":43751,"numMessagesInTopic":0,"msgSnippet":"... They won t be saying they hate learning ;-) Nor will they necessarily say they love learning. But they may say they re happy with life. In school learning","messageBody":"<div id=\"ygrps-yiv-1835766342\">On Apr 22, 2010, at 11:33 AM, b prince wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m not sure I understand how deschooling is any different from  <br/>\n&gt; unschooling.<br/>\n<br/>\n </span></blockquote>They won&#39;t be saying they hate learning ;-)<br/>\n<br/>\nNor will they necessarily say they love learning. But they may say  <br/>\nthey&#39;re happy with life. In school learning is shoved in their faces  <br/>\nand graded on. Real leaning is as conscious as breathing.<br/>\n<br/>\nDeschooling is the recovery period. Like detoxing. Like recovering  <br/>\nfrom a broken leg. It&#39;s time when they when they get to revel in the  <br/>\nfreedom to reject what&#39;s been forced on them and to suck in the  <br/>\nfreedom to do what was limited.<br/>\n<br/>\nDeschooling since February? Not enough time. One month for each year  <br/>\nthey were in school (or made to do school) is a rule of thumb but they  <br/>\nmight need more if the damage was excessive. The countdown clock  <br/>\nstarts again as soon as you make them do something schoolish!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; and then she asked if they ever wanted to get more info on some of  <br/>\n&gt; the bugs/tree/etc that they found outside.<br/>\n<br/>\n </span></blockquote>*She&#39;s* still thinking schoolishly. Observing and wondering and doing  <br/>\nare more powerful learning than reading someone else&#39;s observations  <br/>\nand conclusions.<br/>\n<br/>\nIt&#39;s unfortunate that memorization is equated with learning and being  <br/>\nintelligent. Richard Feynman, the physicist who passed away a bit ago,  <br/>\nsaid:<br/>\n<br/>\n&quot;You can know the name of a bird in all the languages of the world,  <br/>\nbut when you&#39;re finished, you&#39;ll know absolutely nothing whatever  <br/>\nabout the bird... So let&#39;s look at the bird and see what it&#39;s doing --  <br/>\nthat&#39;s what counts. I learned very early the difference between  <br/>\nknowing the name of something and knowing something.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Or how to make the shift from deschooling to unschooling.<br/>\n<br/>\n<br/>\n </span></blockquote>There won&#39;t be anything you do differently. They will respond  <br/>\ndifferently. Just as a person who has recovered from the flu behaves  <br/>\ndifferently than one who has the flu.<br/>\n<br/>\nFor example kids deschooling might hate museums. But that doesn&#39;t mean  <br/>\nthey&#39;ll always hate museums so even 3 years from now you shouldn&#39;t  <br/>\noffer. The reaction to anything schoolish can be similar to someone  <br/>\nwho polishes off a dozen donuts and &quot;never&quot; wants to see another  <br/>\ndonut. Right now they&#39;re still in that &quot;donuts are disgusting&quot; phase.&#92;<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":191799655,"authorName":"b prince","from":"b prince &lt;flyingtwinsmom@...&gt;","profile":"flyingtwinsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Why is deschooling important?","postDate":"1271950415","msgId":43751,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3NTgyNS44MDE1Ny5xbUB3ZWI1NDYwNS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":43752,"prevInTime":43750,"nextInTime":43752,"topicId":43751,"numMessagesInTopic":0,"msgSnippet":"I had a few responses to my issue with deschooling vs unschooling, but I m still struggling. I stopped doing forced work at the end of Feb. One of the biggest","messageBody":"<div id=\"ygrps-yiv-1507452942\">I had a few responses to my issue with deschooling vs unschooling, but I&#39;m still struggling. I stopped doing forced work at the end of Feb. One of the biggest reasons that we wanted to homeschool our girls was to instill a love of learning. I think I did more harm than if I had sent them to public school by forcing homeschool work. <br/>\n    We just met with our evaluator (We have to do a portfolio evaluation once a year in WV.) and I searched hard to find someone that got unschooling. Luckily, she is great that way and willing to work with me, but in talking to the kids a theme kept coming up that they hated learning. I see it all the time, but to have it so clearly shown to a stranger was enlightening. <br/>\n    I&#39;m not talking just about &quot;school.&quot; She encouraged them to drop that word. But she asked them what they were interested in, found out that they both enjoy being outdoors, and then she asked if they ever wanted to get more info on some of the bugs/tree/etc that they found outside. They simply said no. They didn&#39;t care. <br/>\n    They hate reading. Both read poorly, by the way. And the only thing we could come up with is that they like some games and watching TV (just Disney and Nick type stuff though).<br/>\n    They stated over and over again that they didn&#39;t want to read/do math(even if cooking)/etc, and they hated learning. She encouraged me to look up more info on reluctant learners and maybe talk to them about unschooling by telling them that they need to get involved or that I would have to take charge again.<br/>\n    But we both wondered if I haven&#39;t given them enough time yet. I&#39;m not sure I understand how deschooling is any different from unschooling. Or how to make the shift from deschooling to unschooling. Or what I should be doing/looking for in each stage. I could use some experienced deschoolers/unschoolers advice about how to handle this.<br/>\nThanks<br/>\nBonni<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":43739,"nextTopicId":43783}}