{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":14,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: internet","postDate":"1316706175","msgId":47332,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1ZmwxditwMnBtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo1ZWN2Nis1ZmV0QGVHcm91cHMuY29tPg=="},"prevInTopic":47330,"nextInTopic":0,"prevInTime":47331,"nextInTime":47333,"topicId":47285,"numMessagesInTopic":0,"msgSnippet":"... ******************** That s a good example of how building trust in a relationship can lead to kids and parents working together to solve a problem. In","messageBody":"<div id=\"ygrps-yiv-1367784316\">&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; The solutions were however not done as any kind of punishment, but with full involvement and agreement from T. He said (and when I checked in with him today, still says) that he felt out of control, very uncomfortable but also very attracted to what he was seeing and was happy to not have the choice to visit those sites anymore at the time.<br/>\n </span></blockquote>********************<br/>\n<br/>\nThat&#39;s a good example of how building trust in a relationship can lead to kids and parents working together to solve a problem. In hindsight, mistakes were made on both sides, but instead of leading to punishments and bad feelings all around, y&#39;all came together and worked things out. <br/>\n<br/>\nUnschooling doesn&#39;t automatically create picture perfect kids who never make bad decisions! It Does set things up so their mistakes really can be learning opportunities for the whole family, rather than just things everyone wishes they could forget. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: internet","postDate":"1316694120","msgId":47330,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4NDc1NzU3LUNDNDEtNDM4OS1BMTUxLUE3RDE0QUYxOTQ2MUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGo1ZWN2Nis1ZmV0QGVHcm91cHMuY29tPg==","referencesHeader":"PGo1ZWN2Nis1ZmV0QGVHcm91cHMuY29tPg=="},"prevInTopic":47325,"nextInTopic":47332,"prevInTime":47329,"nextInTime":47331,"topicId":47285,"numMessagesInTopic":0,"msgSnippet":"... Which is pretty much the message we try to get across :-) But so many people have mental roadblocks in the way like I need to limit the internet. It s","messageBody":"<div id=\"ygrps-yiv-919416906\">On Sep 22, 2011, at 12:18 AM, meadowgirl11 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; we did our best to work with T to help him feel safe, loved and also  <br/>\n&gt; trusted<br/>\n<br/>\n </span></blockquote>Which is pretty much the message we try to get across :-)<br/>\n<br/>\nBut so many people have mental roadblocks in the way like &quot;I need to  <br/>\nlimit the internet. It&#39;s dangerous. The internet/porn&#39;s addictive.&quot;<br/>\n<br/>\nAnd when those fears are ripped open and their foundations examined  <br/>\nand truths searched for, the message they unfortunately come away with  <br/>\nis often &quot;No limits.&quot; :-/<br/>\n<br/>\nWhen the real message is &quot;Make the world accessible and then help your  <br/>\nkids find what they like and avoid what they don&#39;t like. Support their  <br/>\non going building, tearing apart, rebuilding, expanding ideas about  <br/>\nwhat&#39;s right and wrong for them, what&#39;s important to them, and how the  <br/>\nworld works. Support them with your interest in them and their  <br/>\ninterests, your time and energy, your greater knowledge about the  <br/>\nworld and where they might want to look, your greater power at  <br/>\nmanipulating the world.&quot;<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":370007365,"authorName":"meadowgirl11","from":"&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt;","profile":"meadowgirl11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: internet","postDate":"1316665126","msgId":47325,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1ZWN2Nis1ZmV0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo1OGN0NyszaXRmQGVHcm91cHMuY29tPg=="},"prevInTopic":47307,"nextInTopic":47330,"prevInTime":47324,"nextInTime":47326,"topicId":47285,"numMessagesInTopic":0,"msgSnippet":"... Thanks for bringing that up Meredith. It might help with the discussion to know that the child in question is coming from a very similar background to Ray,","messageBody":"<div id=\"ygrps-yiv-554800275\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Meredith&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;This is something I&#39;ve gotten to see directly, since my stepson has been living with me for five years, but also spending time at his bio mom&#39;s house where there are a lot of rules and limits designed to protect him. And Ray&#39;s consistently made less thoughtful decisions in that environment or when he has a lot of contact with his mom - the more she tries to protect him, the more likely he is to do something dangerous. &lt;&lt;<br/>\n<br/>\n </span></blockquote>Thanks for bringing that up Meredith. It might help with the discussion to know that the child in question is coming from a very similar background to Ray, with Khan being his step-dad and coming to unschooling after years of controlling, back and forth parenting and lots of difficulties with behaviour, limits, expectations, etc. <br/>\n<br/>\nMy husband, who is much more onboard than he realizes and just not a wordsmith like some of the writers here, didn&#39;t really give the context and how the whole thing worked for us. Basically, when T was 8 and we had just started unschooling/deschooling, he was really pushing for unlimited access to media, which we were still struggling with, but since our start with unschooling came because of serious, destructive power struggles, we felt pushed to lift limits faster than was probably wise. With me very busy with an active baby/toddler and working hard to apply the principles of unschooling without really having the relationship and trust established, and T still in a pretty negative head space, he found his way onto some porn sites and basically visited them every time we were out of the room for several months. We found out by accident when Khan was doing some computer stuff and looked at the history. He was unfortunately exposed to some pretty nasty stuff and not just once or by accident. At the time he was really exploring the limits and would be on the computer for marathon 6 to 8 hour sessions with very little break, staying up into the early morning watching anime and movies and also frequently visiting these sites, as we discovered. With a small babe taking a lot of time and energy and needing to be on the move a lot with her as well as occasionally sleep, we missed a lot of what was going on for him at the time.<br/>\n<br/>\nThe solutions were however not done as any kind of punishment, but with full involvement and agreement from T. He said (and when I checked in with him today, still says) that he felt out of control, very uncomfortable but also very attracted to what he was seeing and was happy to not have the choice to visit those sites anymore at the time. We did give him the choice of whether or not to block them or come up with some other solution. We also moved his computer and later his whole room into the main area of the house rather than downstairs, which while public, had been quite isolated for him. We spent much more time with him watching his anime, playing his games and building the relationship and we said yes for as long as he wanted any time he wanted to watch something blocked, which has never been anything we&#39;d worry about since that time. The only control we put on was for sexually explicit content and even then we will happily figure out a solution if there is something he wants to see that might fall under that category, like Austin Powers which he loved. Really, having worked in sexual health education, I know kids, especially preteens and teens, are going to find stuff, whether it is a friend&#39;s dad&#39;s stash or somebody&#39;s big brother&#39;s videos or whatever. If he wanted to watch explicit sexual content now, I would find a way to safely support that interest, although I&#39;d obviously encourage other sources than graphic internet porn. And at this point (he is 11 now and we have been unschooling for 3 years) I feel pretty good about the relationship and about his own sense of himself, which at the time was pretty compromised, as Meredith suggests. <br/>\n<br/>\nI know why you would make the points you did Joyce and I think they are totally valid and important, especially for people new to the list and to unschooling in general. Having been on the list for 3 years and seeing the kind of comments and responses people get on other lists, I know it is what needs to be said. What Khan wrote, taken out of context, doesn&#39;t fit with the view of unschooling that this list is meant to focus on. At the same time, in this situation, in this context, we felt safety really was in question and we did our best to work with T to help him feel safe, loved and also trusted as much as we could at the time. Over the last few years I have grown to really trust my kids, much more than I did back then, but I still don&#39;t entirely trust the internet, especially with a child who is really impulsive and has a history of feeling like he needs (and still has a need to with his bio dad) to sneak, lie and generally not trust adults to be on his side and also had some pretty big empty places he was trying to fill. Now that he is much more full, it is a different picture, although he will likely never have he full experience that always unschooled kids with both parents on board have.  <br/>\n<br/>\nI actually find it quite amusing that what Khan wrote would make it look like we control and limit our kids exposure to media, which couldn&#39;t be further from the truth. I have come so far in my parenting journey with that, from a totally TV free early childlhood, waldorf school and tight parental control on media of all sorts, to having fun watching Buffy with T or watching him play minecraft or chat with xbox live friends all over the world while A plays games on her ipod with her dad or watches favorite shows on netflix on one of many TV&#39;s, computers and idevices in our home. Khan is actually the media guy in the family and I have him to thank for all the awesome geekery we have like a networked media server that can play movies from one hardrive onto any computer in the house. He does still have a lot of hang-ups about it, but he keeps them to himself for the most part. It was probably good for him to hear it from someone else but me.<br/>\n<br/>\nAnyway, maybe the clarification here will shed some light for anyone considering shifting from limits on media and internet. It has certainly been a journey in our lives and will continue to evolve as kids get older and needs and interests change, but I can say for sure that I wouldn&#39;t go back to the way it was before, even though we have dealt with some pretty intense stuff because of it. <br/>\n<br/>\n~ Tammy</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: internet","postDate":"1316486735","msgId":47307,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5RjUyMjE3LTRDQzctNDQyMi05Q0VELTRCNTM5Q0I4Njk5MUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEzMTY0NjA4MTMuOTMxOTIuWWFob29NYWlsUkNAd2ViODExMDgubWFpbC5tdWQueWFob28uY29tPg==","referencesHeader":"PENBUGFCQnpUMVBHTW9CYWFGU3I1WjdhMkgxZGJOUThwMnBQSngxeWJGWi0zRkthOEgtUUBtYWlsLmdtYWlsLmNvbT4gPDBEMDlEQkY0LUFFQTUtNEJEMS1CMURFLUI5NUMwMzk2MkY5OUB2ZXJpem9uLm5ldD4gPDEzMTY0NjA4MTMuOTMxOTIuWWFob29NYWlsUkNAd2ViODExMDgubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":47306,"nextInTopic":47325,"prevInTime":47306,"nextInTime":47308,"topicId":47285,"numMessagesInTopic":0,"msgSnippet":"... Why would I recommend that parents give their kids dynamite to play with? If all the things people fear were addictive really were, then radical ","messageBody":"<div id=\"ygrps-yiv-1212330633\">On Sep 19, 2011, at 3:33 PM, Kristie wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Joyce, this makes a lot of sense to me, but at the same time is hard  <br/>\n&gt; to<br/>\n&gt; swallow. I guess I feel like I am giving them a stick of dynamite to  <br/>\n&gt; play<br/>\n&gt; with. Pornography can be addictive. ???<br/>\n<br/>\n </span></blockquote>Why would I recommend that parents give their kids dynamite to play  <br/>\nwith?<br/>\n<br/>\nIf all the things people fear were addictive really were, then radical  <br/>\nunschooling kids would be totally messed up! They&#39;d be addicted to TV,  <br/>\nsugar, &quot;junk&quot; food, internet, video games, buying stuff because  <br/>\nradical unschoolers don&#39;t put artificial limits on those. Since  <br/>\naddicts need to keep upping the dose to get the same effect, our kids  <br/>\nwould be so strung out by all their addictions by the time they were  <br/>\n20 that I&#39;d hope there would be a general uproar against unschooling!<br/>\n<br/>\nWhat makes way more sense, what fits with what we see in our own kids,  <br/>\nis that none of these things is addictive. Not even drugs. What causes  <br/>\naddiction is the need to escape an environment that&#39;s painful in some  <br/>\nway that they have no control over.<br/>\n<br/>\nSchuyler has posted the Rat Park studies that show that drugs aren&#39;t  <br/>\naddictive. (The study is worth reading no matter what you fear is  <br/>\naddictive.) The need for drugs is caused by stressful environments,  <br/>\nnot the drugs themselves.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.walrusmagazine.com/articles/2007.12-health-rat-trap/\">http://www.walrusmagazine.com/articles/2007.12-health-rat-trap/</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: internet","postDate":"1316469082","msgId":47305,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1OGRncStzOXRxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMTY0NjA4MTMuOTMxOTIuWWFob29NYWlsUkNAd2ViODExMDgubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":47304,"nextInTopic":47306,"prevInTime":47304,"nextInTime":47306,"topicId":47285,"numMessagesInTopic":0,"msgSnippet":"... People don t become addicted to things at random - even people with a genetic predisposition don t. Environment plays a biiiiiiig role! An environment","messageBody":"<div id=\"ygrps-yiv-496015643\">Kristie &lt;messy_boys@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;   I guess I feel like I am giving them a stick of dynamite to play<br/>\n&gt; with.  Pornography can be addictive.  ???<br/>\n<br/>\n </span></blockquote>People don&#39;t become addicted to things at random - even people with a genetic predisposition don&#39;t. Environment plays a biiiiiiig role! An environment which seems unsafe and overwhelming can lead some people to look for an escape. And environment which sets people up for low self esteem and feelings of powerlessness can lead some people to do self-destructive things because then they at least have power over some of their own hurt. Does any of that describe your home or your kids? If so, that&#39;s something to look for ways to change. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":46477013,"authorName":"Ulrike Haupt","from":"&quot;Ulrike Haupt&quot; &lt;rica@...&gt;","profile":"ulrikehaupt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: internet","postDate":"1316469044","msgId":47306,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgyQzU5MUUwRkYzNjQ0OUM4NEQ2OTQxNjMyOTBEMUFGQHVscmlrZT4=","inReplyToHeader":"PDEzMTY0NjA4MTMuOTMxOTIuWWFob29NYWlsUkNAd2ViODExMDgubWFpbC5tdWQueWFob28uY29tPg==","referencesHeader":"PENBUGFCQnpUMVBHTW9CYWFGU3I1WjdhMkgxZGJOUThwMnBQSngxeWJGWi0zRkthOEgtUUBtYWlsLmdtYWlsLmNvbT4gPDBEMDlEQkY0LUFFQTUtNEJEMS1CMURFLUI5NUMwMzk2MkY5OUB2ZXJpem9uLm5ldD4gPDEzMTY0NjA4MTMuOTMxOTIuWWFob29NYWlsUkNAd2ViODExMDgubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":47305,"nextInTopic":47307,"prevInTime":47305,"nextInTime":47307,"topicId":47285,"numMessagesInTopic":0,"msgSnippet":"Kristie you wrote Pornography can be addictive. ??? I think/believe that addiction only happens when a fear of a deficit of something is perceived somehow. I","messageBody":"<div id=\"ygrps-yiv-1209616117\">Kristie<br/>\n<br/>\n <br/>\n<br/>\nyou wrote &quot;Pornography can be addictive. ???&quot;<br/>\n<br/>\n <br/>\n<br/>\nI think/believe that addiction only happens when a fear of a deficit of something is<br/>\nperceived somehow. I really firmly believe and know if there is &#39;enoughness&#39; of &#39;whatever&#39;<br/>\nthere is no &#39;need&#39; for any addictve behaviour at all.<br/>\n<br/>\nAn example - for many years sweetness/perceived love was not enough in my life and I was<br/>\naddicted to sugar/chocolate. When I was able to let go of my &#39;angst&#39; of not enough<br/>\nsweetness (being loved for who I am not) it became a total NON-ISSUE and now the crowd<br/>\naround me can have the sweetest (chocolate) cakes and it lets me absolutely &#39;cold&#39;. (What<br/>\na joke! It was my parent&#39;s 60th wedding anniversary last Saturday. 5 Cakes for 13 people!<br/>\nArgh! I am still shuddering. The small piece of &#39;sugar free&#39; apple tart I had was actually<br/>\ntoo much already for me. &lt;grin&gt; ) BUT I have other &#39;anxieties&#39; that I have not figured out<br/>\nyet and they have me deeply addicted to some other stuff. <br/>\n<br/>\nJust this afternoon as I was driving along I thought how ridiculous it is for anyone to<br/>\nwant to not allow anyone else to not do anything that they think is not appropriate for<br/>\nany reason. It is what wars are made of.<br/>\n<br/>\n <br/>\n<br/>\nBlissings<br/>\n<br/>\nUlrike<br/>\n<br/>\n<br/>\n__________ Information from ESET NOD32 Antivirus, version of virus signature database 6477<br/>\n(20110919) __________<br/>\n<br/>\n<br/>\nThe message was checked by ESET NOD32 Antivirus.<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.eset.com\">http://www.eset.com</a><br/>\n<br/>\n <br/>\n<br/>\n__________ Information from ESET NOD32 Antivirus, version of virus signature database 6477<br/>\n(20110919) __________<br/>\n<br/>\nThe message was checked by ESET NOD32 Antivirus.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.eset.com\">http://www.eset.com</a><br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: internet","postDate":"1316468455","msgId":47304,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1OGN0NyszaXRmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBUGFCQnpUMVBHTW9CYWFGU3I1WjdhMkgxZGJOUThwMnBQSngxeWJGWi0zRkthOEgtUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":47303,"nextInTopic":47305,"prevInTime":47303,"nextInTime":47305,"topicId":47285,"numMessagesInTopic":0,"msgSnippet":"... It helps to assume that your child wants to access safe sites and help him to do that - hiding those sites from him doesn t help him learn the skills he","messageBody":"<div id=\"ygrps-yiv-896864185\">Shahriar Khan &lt;beheshto@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; When we are not around, we only want our kid to be able to<br/>\n&gt; access safe sites<br/>\n<br/>\n </span></blockquote>It helps to assume that your child wants to access safe sites and help him to do that - hiding those sites from him doesn&#39;t help him learn the skills he needs to keep Himself safe. It prevents him from learning those skills. If he decides to use the internet in a way you don&#39;t control, he&#39;ll be vulnerable by not knowing what to expect And he&#39;ll be vulnerable because he&#39;ll be more focused on &quot;pulling one over on dad&quot; than on being thoughtful. *That&#39;s* how teens make dangerous decisions - all their intellect is being used to get around parents instead of evaluating the real dangers in the world. <br/>\n<br/>\nThis is something I&#39;ve gotten to see directly, since my stepson has been living with me for five years, but also spending time at his bio mom&#39;s house where there are a lot of rules and limits designed to protect him. And Ray&#39;s consistently made less thoughtful decisions in that environment or when he has a lot of contact with his mom - the more she tries to protect him, the more likely he is to do something dangerous. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I guess the underlying principal is that talking to your kids about what<br/>\n&gt; they are comfortable with openly, and you&#39;d be surprised how much<br/>\n&gt; they censor themselves with the right knowledge, and just need your<br/>\n&gt; guidance.<br/>\n<br/>\n </span></blockquote>They don&#39;t even need &quot;guidance&quot; if you&#39;re talking to them openly and helping them do what they want to do. They may want information or feedback or have questions for you, but they don&#39;t need to be told to stay &quot;safe, sane and consensual&quot; - although they may need an explanation of why principle like that is useful and why some people will go beyond them. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":237699340,"authorName":"Kristie","from":"Kristie &lt;messy_boys@...&gt;","profile":"messy_boys","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: internet","postDate":"1316460813","msgId":47303,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTY0NjA4MTMuOTMxOTIuWWFob29NYWlsUkNAd2ViODExMDgubWFpbC5tdWQueWFob28uY29tPg==","inReplyToHeader":"PDBEMDlEQkY0LUFFQTUtNEJEMS1CMURFLUI5NUMwMzk2MkY5OUB2ZXJpem9uLm5ldD4=","referencesHeader":"PENBUGFCQnpUMVBHTW9CYWFGU3I1WjdhMkgxZGJOUThwMnBQSngxeWJGWi0zRkthOEgtUUBtYWlsLmdtYWlsLmNvbT4gPDBEMDlEQkY0LUFFQTUtNEJEMS1CMURFLUI5NUMwMzk2MkY5OUB2ZXJpem9uLm5ldD4="},"prevInTopic":47302,"nextInTopic":47304,"prevInTime":47302,"nextInTime":47304,"topicId":47285,"numMessagesInTopic":0,"msgSnippet":"Joyce, this makes a lot of sense to me, but at the same time is hard to swallow.  I guess I feel like I am giving them a stick of dynamite to play with.","messageBody":"<div id=\"ygrps-yiv-998046239\">Joyce, this makes a lot of sense to me, but at the same time is hard to<br/>\nswallow.  I guess I feel like I am giving them a stick of dynamite to play<br/>\nwith.  Pornography can be addictive.  ???<br/>\n<br/>\nAny additional thoughts appreciated...<br/>\n<br/>\nKristie</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: internet","postDate":"1316456260","msgId":47302,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBEMDlEQkY0LUFFQTUtNEJEMS1CMURFLUI5NUMwMzk2MkY5OUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PENBUGFCQnpUMVBHTW9CYWFGU3I1WjdhMkgxZGJOUThwMnBQSngxeWJGWi0zRkthOEgtUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBUGFCQnpUMVBHTW9CYWFGU3I1WjdhMkgxZGJOUThwMnBQSngxeWJGWi0zRkthOEgtUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":47301,"nextInTopic":47303,"prevInTime":47301,"nextInTime":47303,"topicId":47285,"numMessagesInTopic":0,"msgSnippet":"... Exposing kids with guidance doesn t sound like an unschooling approach. Being present with kids as they explore is a way to put unschooling principles in","messageBody":"<div id=\"ygrps-yiv-430883695\">On Sep 19, 2011, at 1:39 PM, Shahriar Khan wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This<br/>\n&gt; is a great resource that blocks<br/>\n&gt; questionable sites, and allows you to expose your kids to the  <br/>\n&gt; internet with<br/>\n&gt; your guidance.<br/>\n<br/>\n </span></blockquote>&quot;Exposing kids with guidance&quot; doesn&#39;t sound like an unschooling  <br/>\napproach.<br/>\n<br/>\nBeing present with kids as they explore is a way to put unschooling  <br/>\nprinciples in actions. It will support their learning and build their  <br/>\ntrust that parents are there to help them explore in ways that are  <br/>\nrespectful and safe rather than a wall that slams down when the parent  <br/>\nwants to stop what the child is doing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When we are not around, we only want our kid to be able to<br/>\n&gt; access safe sites.<br/>\n<br/>\n<br/>\n </span></blockquote>And your actions are saying &quot;I don&#39;t trust you.&quot;<br/>\n<br/>\nIf my husband or a friend said that to me just because of who I am, it  <br/>\nwould put a really big hole in the relationship.<br/>\n<br/>\nThere *are* ways to build relationships *and* help kids be safe and  <br/>\nhelp them keep the computer safe. The above isn&#39;t one of them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Some sites (like Anime streaming) we can<br/>\n&gt; make exceptions and allow permanently, or just for 10, 30 or 60  <br/>\n&gt; minutes.<br/>\n<br/>\n </span></blockquote>And if my husband rigged the TV (or computer or my bedside light) to  <br/>\nshut off after 10, 30 or 60 minutes because *he* thought that was  <br/>\nenough for me, I&#39;d be pissed and not be thinking nice thoughts about  <br/>\nhim or our relationship.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; A couple years ago when we found out our kid had stumbled upon some  <br/>\n&gt; not<br/>\n&gt; age appropriate websites, we talked to him about that they are and  <br/>\n&gt; how its<br/>\n&gt; not appropriate for their age openly, and we agreed upon this  <br/>\n&gt; mutually.<br/>\n<br/>\n<br/>\n </span></blockquote>Even better for unschooling, let the kids have control of the  <br/>\nsoftware. Let them decide what to block and what not to block.<br/>\n<br/>\nBeing someone&#39;s partner, helping them explore what fascinates them  <br/>\nabout life *and* avoid the things they don&#39;t like, builds  <br/>\nrelationships and helps them gain skills to help themselves.<br/>\n<br/>\nTrust kids! *Help* them with tools to be safe rather than deciding  <br/>\nwhat&#39;s safe and imposing it on them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; One note is that, we were surprised to find how much pornographic  <br/>\n&gt; material<br/>\n&gt; is available on youtube! Since then youtube visits have been  <br/>\n&gt; supervised.<br/>\n<br/>\n<br/>\n </span></blockquote>What happens when they&#39;re at someone else&#39;s house without you there to  <br/>\nwatch over them?<br/>\n<br/>\nConventional parenting thought is to impose the &quot;right&quot; values on  <br/>\nkids, watch over them and make them go through the motions of  <br/>\nfollowing the same values as mom and dad. Or set up rules so they can  <br/>\nbe punished if they make the wrong choices. And then wish for the best.<br/>\n<br/>\nBetter for relationships, *better for learning* (now and life long),  <br/>\nis trusting them and helping them find ways to avoid what *they* don&#39;t  <br/>\nwant.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Its been working just fine for us so far. However, not sure how/when  <br/>\n&gt; the<br/>\n&gt; unrestricted internet should be open to them. Would appreciate some  <br/>\n&gt; comments<br/>\n&gt; on that.<br/>\n<br/>\n<br/>\n </span></blockquote>Day One. And then show them where the controls are on Google and  <br/>\nYouTube so they can screen out stuff they don&#39;t want. (Though if  <br/>\nthey&#39;re really young more than likely they want a parent right there  <br/>\nwith them because they like having their favorite people with them as  <br/>\nthey do things.) If their search terms are pulling up stuff that isn&#39;t  <br/>\nwhat they want, and they can&#39;t figure out better ways, show them.  <br/>\n(Though it&#39;s more likely the adults will have problems figuring out  <br/>\nGoogle than the kids!)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I guess the underlying principal is that talking to your kids about  <br/>\n&gt; what<br/>\n&gt; they are comfortable with openly, and you&#39;d be surprised how much<br/>\n&gt; they censor themselves with the right knowledge, and just need your<br/>\n&gt; guidance.<br/>\n<br/>\n<br/>\n </span></blockquote>They aren&#39;t censoring themselves. Kids are making choices based on  <br/>\nwhat they want to see and what they don&#39;t want to see. Censoring  <br/>\ncarries connotations of desire to see but being prevented.<br/>\n<br/>\nKids don&#39;t need to talk about what they&#39;re comfortable with if they&#39;re  <br/>\nsupported in using their comfort level as a guide. Too often parents  <br/>\nshort circuit that unintentionally by imposing what they believe is  <br/>\nbetter for the child.<br/>\n<br/>\nChildren won&#39;t make the choices parents do. They will explore avenues  <br/>\nthe parents wouldn&#39;t choose for them. But if we trust them and support  <br/>\nthem in trusting themselves, help them with the tools that will help  <br/>\nthem find what they want and avoid what they don&#39;t want, they will  <br/>\ngrow in their experience of making choices. They will gain confidence  <br/>\nin their &quot;comfort meter.&quot; So when they&#39;re faced with more deadly  <br/>\nchoices as teens, they&#39;ve had lots and lots and lots of experience  <br/>\nthinking through problems and weighing choices and listening to their  <br/>\ninner voices.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":481584503,"authorName":"Shahriar Khan","from":"Shahriar Khan &lt;beheshto@...&gt;","profile":"realizing_peace","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: internet","postDate":"1316453954","msgId":47301,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBUGFCQnpUMVBHTW9CYWFGU3I1WjdhMkgxZGJOUThwMnBQSngxeWJGWi0zRkthOEgtUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":47295,"nextInTopic":47302,"prevInTime":47300,"nextInTime":47302,"topicId":47285,"numMessagesInTopic":0,"msgSnippet":"Hi All, I have been a lurker on the fence unschooling Dad here on this list.  I wanted to speak up about internet usage. The way we do it at our house is that,","messageBody":"<div id=\"ygrps-yiv-1991898633\">Hi All,<br/>\n I have been a lurker on the fence unschooling Dad here on this list.  I<br/>\nwanted to speak up about internet usage. The way we do it at our house is<br/>\nthat, any computers in the kids space (Our older is 11) has<br/>\nK9&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www1.k9webprotection.com/\">http://www1.k9webprotection.com/</a>&gt;web protect (FREE) on them. This<br/>\nis a great resource that blocks<br/>\nquestionable sites, and allows you to expose your kids to the internet with<br/>\nyour guidance. When we are not around, we only want our kid to be able to<br/>\naccess safe sites. You can configure the experience by turning on or off P2P<br/>\nfile sharing, Video sharing(youtube), Chat, all the way to Adult material.<br/>\nWhen a page comes up that meets one of the restricted criteria, you can over<br/>\nride it using a parent password. Some sites (like Anime streaming) we can<br/>\nmake exceptions and allow permanently, or just for 10, 30 or 60 minutes.<br/>\n  A couple years ago when we found out our kid had stumbled upon some not<br/>\nage appropriate websites, we talked to him about that they are and how its<br/>\nnot appropriate for their age openly, and we agreed upon this mutually.  Now<br/>\nwhen he is blocked by the K9 web protect service we talk about why  it might<br/>\nor might not be appropriate and apply exceptions together.<br/>\n  One note is that, we were surprised to find how much pornographic material<br/>\nis available on youtube! Since then youtube visits have been supervised.<br/>\n<br/>\nIts been working just fine for us so far. However, not sure how/when the<br/>\nunrestricted internet should be open to them. Would appreciate some comments<br/>\non that.<br/>\n<br/>\nI guess the underlying principal is that talking to your kids about what<br/>\nthey are comfortable with openly, and you&#39;d be surprised how much<br/>\nthey censor themselves with the right knowledge, and just need your<br/>\nguidance.<br/>\n<br/>\nI should say most of the unshcooling &quot;we&quot; involves my wife leading, and me<br/>\nfollowing along.<br/>\n<br/>\n<br/>\n-Khan<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://listn.to/khan\">http://listn.to/khan</a><br/>\nwww.beheshto.ca<br/>\ncreate::share::celebrate<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: internet","postDate":"1316355401","msgId":47295,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1NHVnOSszZ2FkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwM2MwMWNjNzU4MCQ4NThlZTU2MCQ5MGFjYjAyMCRAY28ubno+"},"prevInTopic":47292,"nextInTopic":47301,"prevInTime":47294,"nextInTime":47296,"topicId":47285,"numMessagesInTopic":0,"msgSnippet":"My computer had a glitchy moment, so sorry if this comes through twice - there are extra links at the bottom of this post that aren t in the other: ... No,","messageBody":"<div id=\"ygrps-yiv-541029088\">My computer had a glitchy moment, so sorry if this comes through twice - there are extra links at the bottom of this post that aren&#39;t in the other:<br/>\n<br/>\n &quot;Anita&quot; &lt;anita@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Perhaps it&#39;s time to sit down and have a talk about what is ok<br/>\n&gt; and what isn&#39;t and why. For example most young men may want to look at<br/>\n&gt; pictures of people naked but you might need to explain that pictures that<br/>\n&gt; degrade women are not ok.<br/>\n<br/>\n </span></blockquote>No, please! Don&#39;t explain that at all! Teenage boys aren&#39;t disembodied penises with no intellect or moral fiber, they&#39;re curious, sensitive young people trying to learn about themselves and the world. Given a chance, they&#39;ll tell You that the kind of pornography that seeks to degrade other people is offensive. Explaining it belittles and degrades them as people.  <br/>\n<br/>\nIf you want your kids to be sensitive to the needs of other people, be sensitive to their needs. If you want your sons to be careful of others&#39; feelings, be careful of Their feelings. Make your home a place where it&#39;s safe to be gentle and kind And passionate. Make it a place where it is safe for kids to talk to parents, where a boy can say &quot;can you believe this website? its atrocious! I can&#39;t believe there are people who Like this kind of stuff!&quot; whether it&#39;s a website of crocheted doilies or pornography. <br/>\n<br/>\nWhich isn&#39;t to say they Will come to you with that, necessarily. Kids can be very shy of sharing their thoughts on sex and sexuality with their parents, and that&#39;s okay, too. <br/>\n<br/>\nThey may even have a difference of opinion with parents as to what&#39;s &quot;degrading&quot; - adult opinions on the subject range from &quot;all erotica and pornography is degrading&quot; and would include Georgia O&#39;Keefe&#39;s paintings in that category (yes, really) to &quot;as long as the model/actor consents its fine&quot;. Those could be topics which come up in conversation with your kids - and that&#39;s where watching tv and movies with kids can come in really handy, especially if you step away from worries over &quot;adult content&quot; and let ideas and topics swirl around. <br/>\n<br/>\nThere are some collected comments on online safety here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/onlinesafety\">http://sandradodd.com/onlinesafety</a><br/>\n<br/>\nand teens and sex here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/sex\">http://sandradodd.com/sex</a><br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":223001876,"authorName":"Anita","from":"&quot;Anita&quot; &lt;anita@...&gt;","profile":"anitaauckland","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: internet","postDate":"1316294803","msgId":47292,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2MwMWNjNzU4MCQ4NThlZTU2MCQ5MGFjYjAyMCRAY28ubno+"},"prevInTopic":47287,"nextInTopic":47295,"prevInTime":47291,"nextInTime":47293,"topicId":47285,"numMessagesInTopic":0,"msgSnippet":"Hi Kristie, I went to a netsafe talk a while ago here in NZ and they basically said parental controls were not the best idea because they can always find a","messageBody":"<div id=\"ygrps-yiv-649713600\">Hi Kristie,<br/>\n<br/>\nI went to a &#39;netsafe&#39; talk a while ago here in NZ and they basically said<br/>\nparental controls were not the best idea because they can always find a way<br/>\naround them <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.netsafe.org.nz/keeping_safe.php?sectionID=parents\">http://www.netsafe.org.nz/keeping_safe.php?sectionID=parents</a><br/>\nInstead they used an analogy of &#39;teaching &#39; your child to walk - start by<br/>\nsitting next to them &#39;holding their hand&#39;, talk to them about what is<br/>\nappropriate to look at and what is not and then gently step away. This fits<br/>\nwith my philosophy.<br/>\n<br/>\nOn the whole &#39;nappropriate material&#39; stuff a 13 yr old boy will be curious.<br/>\nA man I respect very much recently told me that most men look at soft porn<br/>\nsometimes. Perhaps it&#39;s time to sit down and have a talk about what is ok<br/>\nand what isn&#39;t and why. For example most young men may want to look at<br/>\npictures of people naked but you might need to explain that pictures that<br/>\ndegrade women are not ok. Same with children, animals etc. Obviously a very<br/>\nsensitive area and probably one to be tackled by a man in his life but if<br/>\nyou don&#39;t give him any guidance he&#39;s on his own!<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: internet","postDate":"1316203784","msgId":47287,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1MGFlOCszMWtkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMTYxODQ2MzYuNzM1NzAuWWFob29NYWlsUkNAd2ViODExMDgubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":47285,"nextInTopic":47292,"prevInTime":47286,"nextInTime":47288,"topicId":47285,"numMessagesInTopic":0,"msgSnippet":"I want to start out by articulating an important principle when you re transitioning into unschooling: Don t drop all your rules at once. Instead, say Yes","messageBody":"<div id=\"ygrps-yiv-348487837\">I want to start out by articulating an important principle when you&#39;re transitioning into unschooling: Don&#39;t drop all your rules at once. Instead, say Yes more, ease in to offering more choices. That sets you  up for increasingly better relationships rather than confusing everyone in the family for weeks at best and possibly resulting in &quot;cracking down&quot; and deciding unschooling won&#39;t work.<br/>\n<br/>\nGo Slowly. <br/>\n<br/>\nKristie &lt;messy_boys@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Right now, I have <br/>\n&gt; the browser on my son&#39;s PSP locked so that he can&#39;t access the internet.  And <br/>\n&gt; he&#39;s mad about it.  Says I am treating him like a baby (he&#39;s 13).<br/>\n<br/>\n </span></blockquote>The trouble with limiting something is that you turn that something into a special luxury. You make it more desirable. That&#39;s an entirely natural consequence of limits and that understanding lies underneath a great many aspects of unschooling. When you limit something, you set your kids up to Want it more and therefore to be Less Thoughtful about how they use or consume that thing. <br/>\n<br/>\nSay yes more. The time-stamp on your email is 2pm - is that accurate? If you&#39;re awake and able to hang out with your kids, have internet access available to them. It&#39;s a tremendous learning resource, one they&#39;ll find useful their whole lives, so they might as well get comfortable using it Now, when they have an adult handy to consult.<br/>\n<br/>\nIt may mean you need another computer - you have a lot of people using just one, and that can very easily create a feeling of limitation if there&#39;s a lot of &quot;waiting to use the computer&quot; going on. Imagine if only one person in the family could go into a library or museum at a time - it seems crazy, doesn&#39;t it? See the internet in that light. <br/>\n<br/>\nWhile the kids are on the computer, hang out with them. See what they&#39;re looking at, what they&#39;re doing. Be available to answer questions and to share interesting things. All of those are good things in and of themselves, but in addition if you&#39;re close by you can note when someone is going to go to a site which will produce a lot of pop-ups, spam, and potentially leave a virus on your computer.<br/>\n<br/>\nTHAT&#39;s where you start talking about &quot;internet safety&quot; - you start in a non-confrontational way with something that makes sense. No-one wants the computer to have a virus or to get stuck with a ton of spam! Your kids don&#39;t any more than you do. You may find your 13yo already knows how to avoid a lot of that kind of thing already, and that&#39;s a good thing (it would also prove his point that you&#39;re not taking him seriously, something you could then acknowledge and apologize for doing). You could point out, calmly and informationaly, that visiting certain porn sites can leave computers more vulnerable to spam and viruses, so he&#39;ll want to be extra careful in that regard. It&#39;s not All porn sites, though, so don&#39;t try to use it as some kind of scare tactic - he&#39;ll find out otherwise eventually. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;For a while,they did have access and <br/>\n&gt; &#39;someone&#39; (I think my 10yo) was trying to watch certain movies on Netflix that <br/>\n&gt; they should not be watching<br/>\n<br/>\n </span></blockquote>Again, remember that limits make things valuable. If you&#39;ve made things &quot;off limits&quot; for your kids to see, you&#39;ve made those things more exciting and important. Say yes more. Start questioning your own fears about what kids &quot;shouldn&#39;t&quot; see - bring them here if you want.<br/>\n<br/>\nOne of the principles of unschooling could be expressed as: don&#39;t set your kids up to fail. Having lots of rules and restrictions sets kids up to fail over and over - even when they&#39;re Following the rules it can feel like a kind of failure because they&#39;re not getting the valuable, restricted thing. Instead, help kids learn about the world. Make their worlds big and inviting and make yourself available to act as a helper and safety net so they have a chance to make mistakes without those mistakes being disasters. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":237699340,"authorName":"Kristie","from":"Kristie &lt;messy_boys@...&gt;","profile":"messy_boys","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"internet","postDate":"1316184636","msgId":47285,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTYxODQ2MzYuNzM1NzAuWWFob29NYWlsUkNAd2ViODExMDgubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":47287,"prevInTime":47284,"nextInTime":47286,"topicId":47285,"numMessagesInTopic":0,"msgSnippet":"I was hoping you all could give me some insight into balancing my responsibility to protect my children vs. giving them freedom and respect. Computer and the","messageBody":"<div id=\"ygrps-yiv-2103241751\">I was hoping you all could give me some insight into balancing my responsibility <br/>\nto protect my children vs. giving them freedom and respect.<br/>\n<br/>\nComputer and the internet specifically is what I had in mind.  Right now, I have <br/>\nthe browser on my son&#39;s PSP locked so that he can&#39;t access the internet.  And <br/>\nhe&#39;s mad about it.  Says I am treating him like a baby (he&#39;s 13).<br/>\n<br/>\nI also won&#39;t let him have a computer in his room because he wants internet and I <br/>\ndon&#39;t want him on the internet behind a closed door in his room.  Right now we <br/>\nhave a family computer in the kitchen where they can access the internet.<br/>\n<br/>\nAny thoughts on how to handle this?  For a while,they did have access and <br/>\n&#39;someone&#39; (I think my 10yo) was trying to watch certain movies on Netflix that <br/>\nthey should not be watching, so I set up parental controls on that and locked <br/>\ntheir browsers.  I never said anything to him because I didn&#39;t know how to do it <br/>\nwithout embarrassing him.<br/>\n<br/>\nThanks,<br/>\nKristie<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":11938,"nextTopicId":47354}}