{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Gaming Issues","postDate":"1203102144","msgId":29768,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwY2QwMWM4NzAwNSQ0Y2I5MmE5MCQwMjAxYThjMEBiaWdzdXJwcmlzZT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":29767,"nextInTime":29769,"topicId":29768,"numMessagesInTopic":0,"msgSnippet":"*** Latley about the past 6-8 weeks he has been getting very nasty over the gameing. Calling his brother an idiot and that he hates him playing the game with","messageBody":"<div id=\"ygrps-yiv-1033358712\">*** Latley about the past 6-8 weeks he has been<br/>\ngetting very nasty over the gameing. Calling his brother an idiot<br/>\nand that he hates him playing the game with him.***<br/>\n<br/>\nSome challenges (in life and in games) are bigger than others.  Sometimes a challenge is big enough to be frustrating.   <br/>\n<br/>\nAnd maybe your anxiety and uncertainty are adding to the stress.  <br/>\n<br/>\nWould it be possible for you to help your other son find a different game until his brother finishes this one?  Would it be possible for them to play each on a different system, in different rooms?  Is there another way you can accommodate both boys desire to play other than them playing together?  Get another copy of the game?  Borrow another system?  <br/>\n<br/>\n***He seems to be only<br/>\nplaying the game for the win and not for the pleasure of playing it<br/>\nanymore. ***<br/>\n<br/>\nIt should be ok for him to play the game for whatever reason *he* wants to play.   Lot&#39;s of people work toward an end goal.  Surgeons, who probably also enjoy their work have a mind to &quot;win&quot; when they begin an operation.  There&#39;s nothing wrong with wanting to achieve success.   <br/>\n<br/>\n***If he does not get to play if for some reason he also<br/>\nbecomes very nasty and screams and stomps through the house.***<br/>\n<br/>\nHe&#39;s young and doesn&#39;t have a lot of experience dealing with big emotions.  He&#39;ll gain experience and learn better ways to face challenges and frustrations. Part of his learning will come from your example.  How do you deal with frustration?  When things go wrong for you do you stomp around and make your feelings known?  <br/>\n<br/>\n Try not to add to his frustrations by creating arbitrary reasons he can&#39;t play and try to be an example of calm in the face of stress.<br/>\n<br/>\n*** It is becomeing something I want to rid the house of. ***<br/>\n<br/>\nWhat is?  Your son?  Your son&#39;s feelings?  <br/>\n<br/>\nThe game isn&#39;t &quot;becoming&quot; anything, it&#39;s the very same game that sat on the store shelf before you brought it home, so what you want to rid the house of is ...what? <br/>\n<br/>\nThe house is your son&#39;s home.  He has as much right to be happy there as you have and to be sad there, too.  Rather than ridding the house of whatever it is you&#39;re wanting to be rid of, try ridding yourself of negative thoughts about your son.  His feelings are his, not yours.  He gets to feel them.  Your relationship will immediately be fifty percent more peaceful if *you* act and think in more considerate ways toward your kid.   <br/>\n<br/>\n***We have done time<br/>\nconstraints and days off and all of it to letting him play as much as<br/>\nhe wants.***<br/>\n<br/>\nI think part of his frustration might be the fear that if he isn&#39;t successful in the game soon enough you might make him stop playing.    <br/>\n<br/>\n***It does not matter he is just plain ole&#39; nasty about the<br/>\nwhole issue almost OCD over it.<br/>\nAlso it can be the xbox or computer games...***<br/>\n<br/>\nI want to encourage new unschooling parents to make a substantial effort to think about their kids without this kind of exaggeration of  normal human feelings and emotions.   You just wrote that your kid seems like he is obsessive, compulsive and disordered.  He&#39;s a person working on a challenging task.  If you&#39;re limiting him or the time he has to work on his game you&#39;re adding to his stress.  I&#39;m pretty sure anyone who was working on something big and important could get cranky.   If a doctor was stressed because she couldn&#39;t solve a medical mystery for a patient would you think the doctor had a disorder?   Please, please people, stop thinking the worst of children.   Open your mind to the possibility that &quot;normal&quot; might be a bigger window than the one you&#39;re looking through.  Consider how little experience and how short a time children have had to understand social expectations of ways to act while stressed. <br/>\n<br/>\nThe work children do during what parents call play is the precursor to the work they will do in twenty or thirty years.  It&#39;s important stuff and the sooner people recognize children and their work as important the more peaceful life will be for and with children.   This is at the foundation of unschooling.   It&#39;s why unschoolers believe people learn from living life.  It&#39;s not a small thing.<br/>\n<br/>\n***But being a parent that believes in unschooling and letting him lead<br/>\nthe way it is seeming to be a challenge for me to just take it away.***<br/>\n<br/>\n<br/>\nHow long have you been unschooling?  You describe yourself as someone who &quot;believes in unschooling&quot; yet you wrote that you&#39;d tried &quot;time constraints&quot; and &quot;days off&quot;  and &quot;all of it&quot;  (whatever &quot;all of it&quot; means) and that&#39;s not consistent with someone who &quot;believes&quot; in unschooling.    Thinking of  *just* (as if oppression of another person is a simple matter ) *just* taking away his game is not consistent with unschooling.   So I&#39;m not sure what you &quot;believe in&quot; and maybe you&#39;re not sure either.   That&#39;s not a crime.  But maybe more reading about unschooling would help your understanding.  I&#39;m sure you know the websites www.sandradodd.com/unschooling and www.joyfullyrejoycing.com and there are other suggestions in the &quot;files&quot; and &quot;links&quot; section at the group homepage.<br/>\n<br/>\nWould it be possible for you let him play even though he gets frustrated, the way you or any other person might continue in the pursuit of some work or hobby even when frustrated?   If you compared his pursuit to that of a writer or artist or scientist who might be at a single work for weeks or months or even years, enduring some (and possibly great) frustrations, would you call that writer or artist or scientist a nasty obsessive, compulsive disordered person?   Some accounts say Michelangelo worked seven years on &quot;The Last Judgment.&quot;  Do you suppose he was never stressed or frustrated?  Some folks have been working on an AIDS vaccine for years now.  Are they disordered?  <br/>\n<br/>\nIt might at first seem like less work for you to limit or restrict your son&#39;s game play but in the long run, helping your son do what he wants to do will be easier on your whole family and more consistent with the principles of unschooling.   The energy you could put into restricting or limiting, arguing, explaining, fighting, coping with resentment and anger could be spent in the more healthy support and respect for his passion.  <br/>\n<br/>\nMarji gave you some good ideas of ways to offer help or support when he&#39;s frustrated.  When Dylan liked to play video games and would get frustrated we started going for walks together.  When he&#39;d quit a game in frustration I&#39;d say &quot;I&#39;m going for a walk, want to come?&quot; and we&#39;d start out walking fast, sometimes running, sometimes he&#39;d run ahead and after awhile his adrenaline would slow a little and we&#39;d walk and talk (not always about the game, but sometimes) and he&#39;d feel better and be calmer.   <br/>\n<br/>\nDeb Lewis <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":29744,"nextTopicId":29769}}