{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":264026771,"authorName":"LuvnMomma24boys@aol.com","from":"LuvnMomma24boys@...","profile":"prettypainthorsies","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] RE: intro/concerns...coffee , etc.","postDate":"1145363576","msgId":12252,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM1YS4yZDdjMGE3LjMxNzYzNjc4QGFvbC5jb20+"},"prevInTopic":12246,"nextInTopic":0,"prevInTime":12251,"nextInTime":12253,"topicId":12177,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/18/2006 2:31:22 A.M. US Eastern Standard Time, DACunefare@aol.com writes: I ll  read anything. If a book isn t handy I ll settle for","messageBody":"<div id=\"ygrps-yiv-1740534651\">In a message dated 4/18/2006 2:31:22 A.M. US Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:DACunefare@...\">DACunefare@...</a> writes:<br/>\n<br/>\n<br/>\nI&#39;ll  read anything. If a book isn&#39;t handy I&#39;ll settle for cereal boxes. <br/>\nShampoo  bottles. Ads. Whatever.<br/>\n<br/>\n<br/>\nThat is sooooooooo me!!!!!!!! i think i need readers anonymous!   its a <br/>\ncompulsion, i&#39;ll even read when i&#39;m driving!<br/>\n <br/>\nMandy<br/>\n <br/>\n (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.baby-gaga.com/)\">http://www.baby-gaga.com/)</a>  (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.baby-gaga.com/)\">http://www.baby-gaga.com/)</a>  <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.baby-gaga.com/)\">http://www.baby-gaga.com/)</a>  (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.baby-gaga.com/)\">http://www.baby-gaga.com/)</a> <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1123183,"authorName":"DACunefare@aol.com","from":"DACunefare@...","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: intro/concerns...coffee , etc.","postDate":"1145343852","msgId":12246,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJjZC43NjIxMzFjLjMxNzVlOTZjQGFvbC5jb20+"},"prevInTopic":12177,"nextInTopic":12252,"prevInTime":12245,"nextInTime":12247,"topicId":12177,"numMessagesInTopic":0,"msgSnippet":"**How many people zone out reading a book?** I do. My husband has counselled our children over and over to make sure they have eye contact with me if they re","messageBody":"<div id=\"ygrps-yiv-357191624\">**How many people zone out reading a book?**<br/>\n<br/>\nI do.<br/>\n<br/>\nMy husband has counselled our children over and over to make sure they have <br/>\neye contact with me if they&#39;re trying to converse with me when I&#39;m reading. If <br/>\nthey don&#39;t get that, likely I&#39;m not REALLY hearing them, even if I am <br/>\nresponding.<br/>\n<br/>\nI&#39;ll read anything. If a book isn&#39;t handy I&#39;ll settle for cereal boxes. <br/>\nShampoo bottles. Ads. Whatever.<br/>\n<br/>\nSometimes I wonder if my print addiction would be so bad if my parents hadn&#39;t <br/>\ntried so hard to stop me reading so much when I was little. <br/>\n<br/>\nOne of the only things I remember from my very early life is my mother <br/>\nyelling at me to put down my book and go outside in the fresh air. (I took the book <br/>\nwith me.)<br/>\n<br/>\nDeborah</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] intro/concerns...coffee , etc.","postDate":"1145275771","msgId":12177,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhGNjAxNzAzLTZGNjEtNEYzRi04MTEzLTY1MTg5NjU3NEE4NUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDYwNDE3MDAxOS4xZnZsY3k3OGEzTmwzNGowQG14LWF1c3RyaWFuLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PDIwMDYwNDE3MDAxOS4xZnZsY3k3OGEzTmwzNGowQG14LWF1c3RyaWFuLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":0,"nextInTopic":12246,"prevInTime":12176,"nextInTime":12178,"topicId":12177,"numMessagesInTopic":0,"msgSnippet":"... Is that a reason to impose more limitations? Kids will come up against gravity, appointments, rain, rules about running in grocery stores. Life is full of","messageBody":"<div id=\"ygrps-yiv-161151581\">On Apr 17, 2006, at 12:18 AM, Misty Felner wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I also feel that<br/>\n&gt; realistically in life the majority of people have limitations,  <br/>\n&gt; things they<br/>\n&gt; can and can&#39;t do on the job, in public, etc.<br/>\n<br/>\n </span></blockquote>Is that a reason to impose more limitations?<br/>\n<br/>\nKids will come up against gravity, appointments, rain, rules about  <br/>\nrunning in grocery stores. Life is full of limitations. We can help  <br/>\nthem learn to deal with natural limitations by helping them deal with  <br/>\nnatural limitations. We don&#39;t need -- as school does! -- to create  <br/>\nartificial problems for kids to practice on. They get to try out the  <br/>\nreal stuff (while we&#39;re there to keep them safe from onrushing buses  <br/>\nand out of situations they aren&#39;t ready to handle).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but she knows it&#39;s something you shouldn&#39;t eat often<br/>\n&gt; because it doesn&#39;t help you grow.<br/>\n<br/>\n </span></blockquote>But that&#39;s a lie. And when she sees tall, healthy people eating food  <br/>\nthat &quot;doesn&#39;t help you grow&quot; it&#39;s going to confuse her. And the more  <br/>\nideas like that that you put into her that she can see evidence  <br/>\nbefore her eyes the conflicts with what you say,<br/>\n<br/>\nSchools are really good at telling people what they should see, the  <br/>\none right answer so that when they see something different they  <br/>\ndismiss it as an unexplainable anomaly.<br/>\n<br/>\nAbsolutely we should be passing on what we believe but if we tell  <br/>\nthem and it turns out we&#39;re wrong we&#39;ve lost some of their confidence  <br/>\nin our word. It we use our &quot;knowledge&quot; as a way to make them make the  <br/>\nsame choices we do, we&#39;re doing no better than school. We should be  <br/>\nhelping them learn how to make decisions, not make the decisions we do.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She&#39;s never<br/>\n&gt; asked for candy again<br/>\n<br/>\n </span></blockquote>Which means what? I don&#39;t think my daughter liked candy much at that  <br/>\nage. At 2.5 my daughter had a similar food environment because there  <br/>\nwasn&#39;t a reason to have snacky food around. But by 14 she&#39;s been  <br/>\nexposed to lots of snacky foods and *still* without me hovering over  <br/>\nher, without me training her on what&#39;s &quot;right&quot; to eat and what&#39;s  <br/>\n&quot;wrong&quot;, eats well balanced meals. Yes, she has candy. (She had a few  <br/>\npieces of Easter candy. Not because I filled her with &quot;information&quot;  <br/>\nabout how much was the &quot;right&quot; amount. Not because I limited it when  <br/>\nshe was younger until she could make the same decisions I would. But  <br/>\nbecause she has always been able to have as much as she wants in a  <br/>\nhome filled with other, easily accessible good food, so she eats as  <br/>\nmuch as she wants. Which is very little.) Yes, she has an occasional  <br/>\nsoda but she prefers milk with a little chocolate. She prefers herbal  <br/>\ntea to black tea.<br/>\n<br/>\nShe eats some foods that some people consider bad. She is tall, thin,  <br/>\nathletic and healthy. On the whole she does eat foods that will &quot;help  <br/>\nher grow&quot;. Not because I trained her. Not because I limited her, but  <br/>\nbecause she had the freedom to learn her own body, because I served  <br/>\nwhat I considered healthy food and kept healthy food *also* around in  <br/>\naddition to anything snacky (or nutritious!) that she asked for,  <br/>\nbecause I&#39;ve given her real information. (Information as in I showed  <br/>\nher how to read a nutrition label when she wanted to know something  <br/>\nor show her why I was making one choice over another, told her  <br/>\nvarious thing that people believed about food, told her what I  <br/>\nbelieved so she could make her own decisions, not offered in a way  <br/>\nthat said &quot;You can&#39;t possibly make any other choice.&quot;) She *knows*  <br/>\nthat there are more vitamins and minerals and good nutrition in some  <br/>\nfoods than others. She doesn&#39;t fear the other food. She doesn&#39;t limit  <br/>\nless nutritious food. She just eats what she wants and *naturally*  <br/>\neats more nutritious than less nutritious.<br/>\n<br/>\nDon&#39;t fear so much. You&#39;ll be happier. Your daughter will be happier.<br/>\n<br/>\nHow will your daughter reconcile what you say about limiting foods  <br/>\nthat don&#39;t &quot;help people grow&quot; with people like my daughter who are  <br/>\nhealthy and well grown who do eat foods that won&#39;t &quot;help people  <br/>\ngrow&quot;? Will she trust you less? Will she learn that she should just  <br/>\nlisten to experts about such matters because what she sees with her  <br/>\nown eyes can&#39;t be explained except by experts who know so much more  <br/>\nthan she does?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; That&#39;s my opinion others can do as they see fit for their kids.<br/>\n<br/>\n </span></blockquote>But you&#39;re basing your opinion on what you fear. We&#39;re offering ideas  <br/>\nbased on real experience with real unschooled kids. We do care as  <br/>\nmuch about our kids as you do yours. If we let our kids have  <br/>\nchocolate chips instead of carob chips it&#39;s not because we don&#39;t  <br/>\ncare. It&#39;s because we trust that helping them learn how to navigate  <br/>\nthe world will help them a lot more than teaching them how to  <br/>\nnavigate a course we think is right.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Those of<br/>\n&gt; you who responded that I&#39;m limiting her freedom by not letting her  <br/>\n&gt; taste it<br/>\n&gt; would you also let your child have a sip of your margarita (at 2.5)  <br/>\n&gt; and if<br/>\n&gt; your child decided they liked it what then.<br/>\n<br/>\n </span></blockquote>That seems a very legitimate question to ask but does it have any  <br/>\nbasis in reality?<br/>\n<br/>\nAsk! Ask what really happens.<br/>\n<br/>\nMy daughter has always been able to have a sip of alcohol. Alcohol  <br/>\njust doesn&#39;t appeal to her beyond a few sips.<br/>\n<br/>\nI grew up able to have sips of alcohol. My aunt made some really  <br/>\nstrong mixed drinks, often sweet ones, and served them to us at  <br/>\nweekly dinner at grandmas. I *never* drank more than a bit. I *never*  <br/>\ndrank enough to get a buzz. My kid body -- without any adult telling  <br/>\nit -- naturally knew when I&#39;d had enough. (Enough in terms of a food  <br/>\nthat was interesting for a few sips than enough in terms of alcohol.  <br/>\nJust as it knew how to stop after a couple of bites of a so-so cookie.)<br/>\n<br/>\nYou will help your daughter learn how to weigh pros and cons and make  <br/>\ndecisions if you don&#39;t fear so much. Ask what *really* happens when  <br/>\nthe controls are lifted rather than basing your decisions on what you  <br/>\nfear will happen.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know this is true which is why I&#39;m hoping to help shape her  <br/>\n&gt; tastes now so<br/>\n&gt; that the foods that she&#39;d like to try are in general foods that  <br/>\n&gt; would be<br/>\n&gt; good for her.<br/>\n<br/>\n </span></blockquote>Rather than assuming that will work, ask! Ask what outcomes people  <br/>\nhave had trying to get their kids to only choose what the parents  <br/>\nthink is healthy.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How many people zone out reading a book?<br/>\n<br/>\n </span></blockquote>How many kids zone out watching TV?<br/>\n<br/>\n*Unschooled* kids get engaged.<br/>\n<br/>\nIf they aren&#39;t engaged, and are choosing TV because it&#39;s the most  <br/>\ninteresting thing available, then there&#39;s something wrong in the  <br/>\nenvironment. The parents should be providing more opportunities.<br/>\n<br/>\nSome wee little kids can get fixated on the moving images. It&#39;s  <br/>\nneither bad nor good. It just is because that&#39;s the stage of  <br/>\ndevelopment they&#39;re in. If their life is rich and full of other  <br/>\nthings and mom is there for them, they move on. 3 yos do often want  <br/>\nto watch something over and over and over. It&#39;s a stage of  <br/>\ndevelopment, just as banging on pots is a stage of development. They  <br/>\nget what they need and move on.<br/>\n<br/>\n*Adults* often zone out because they&#39;re using TV as a way to relax  <br/>\nafter work or a stressful day. As a schooled kid I watched a lot of  <br/>\nTV for the same reason because it was a way to relieve the stress of  <br/>\nschool. After my freshman year of college I watched *a lot* of TV  <br/>\nover the summer. (I saw Monty Python I estimated 37 times and, at the  <br/>\nbeginning, I didn&#39;t even get it. ;-) I did it to relax. (And because  <br/>\nHBO was brand new and only had a few movies they played over and over.)<br/>\n<br/>\nNow, as an adult I watch less because I don&#39;t need it to relax. I  <br/>\nwatch it purposefully.<br/>\n<br/>\nMy daughter, who has always been able to watch whatever she wants  <br/>\nwhenever she wanted to, also watches it purposefully. She doesn&#39;t  <br/>\nzone out. Though occasionally we&#39;ll all be captivated by a good story  <br/>\nwhich, to someone who fears TV, would look like zoning out.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When she asks to watch something she is allowed.<br/>\n<br/>\n </span></blockquote>When you want to watch something, are you allowed?<br/>\n<br/>\nIt will help you move towards whole life unschooling to not see it as  <br/>\nallowing them but helping them do what they want and enjoy.<br/>\n<br/>\nIt&#39;s okay if you don&#39;t want to move that direction. But any ideas  <br/>\nthat are posted *that hinder someone else* from moving that direction  <br/>\nwill be held up and examined.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Yes I do put some limitations<br/>\n&gt; on my daughter.  She&#39;s 2.5 and I feel at this age she needs  <br/>\n&gt; guidance as to<br/>\n&gt; what is good for her to learn to make good decisions.<br/>\n<br/>\n </span></blockquote>And there are plenty of people here who have teens -- who were 2.5 at  <br/>\none time! -- who *know* from experience it isn&#39;t necessary to control  <br/>\nthem until they can make the same decisions mom would.<br/>\n<br/>\nIf you give specific examples where you feel you need to limit,  <br/>\npeople can give ideas on ways to help kids while not limiting. If you  <br/>\ndon&#39;t want other ideas, and don&#39;t want what you do held up to  <br/>\nexamination, then it&#39;s best not to post about it.<br/>\n<br/>\nThe list exists to help people move away from fear. Lots of people  <br/>\nhave been where you are and they can help ease those fears and tell  <br/>\nyou how their kids got to be healthy and happy at 8, 10, 15 without  <br/>\nlimitations if you want. If you don&#39;t want to move from there, then  <br/>\nthe *idea* of limitations and the conviction that limitations are  <br/>\nnecessary will get discussed every time someone posts it because  <br/>\nthere are parents who know there are other choices. You *can&#39;t*  <br/>\nconvince people who&#39;ve been where you are and have tried  both limits  <br/>\nand being kids partner than limits are necessary because people here  <br/>\nknow from experience that it isn&#39;t true.<br/>\n<br/>\nPeople on the list can limit their kids and even make them do math.  <br/>\nNo one can stop them. But if people choose to post about ideas that  <br/>\nmove away from the principles of unschooling and how they apply to  <br/>\nwhole lives, it will become a topic of discussion to help those who  <br/>\n*want* to let go but are afraid.<br/>\n<br/>\nFor those nervous members just beginning unschooling and those who  <br/>\nhave 2.5 yos it&#39;s comforting to read that others fear their 2.5 yos  <br/>\nneed decisions made for them and give into those fears. But it won&#39;t  <br/>\nhelp them move away.<br/>\n<br/>\nJoyce</div>","specialLinks":[]}],"prevTopicId":12205,"nextTopicId":12222}}