{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":163221353,"authorName":"Tina","from":"&quot;Tina&quot; &lt;zoocrew@...&gt;","profile":"tina010871","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Hugs; was breaking news","postDate":"1151676348","msgId":15106,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU4M2IzcytpZ2pvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU3dHRiMytiMGluQGVHcm91cHMuY29tPg=="},"prevInTopic":15049,"nextInTopic":0,"prevInTime":15105,"nextInTime":15107,"topicId":15021,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1633662385\">&lt;My other children almost NEVER fight. I can&#39;t remember the last time<br/>\nJared and Trevor even had a disagreement (16,12). We rarely have any<br/>\nkind of sibling rivalry issues any more. My house is fairly peaceful<br/>\nover all....&gt;<br/>\n<br/>\nRen<br/>\n<br/>\nI&#39;ve really been enjoying this thread.  I&#39;m wondering if you have <br/>\nany advice for a family that hasn&#39;t lived this lifestyle all along.  <br/>\nWe have three unschoolers still at home.  Adrian, 12, is a veteran <br/>\nunschooler by now, but Amie, 16, and Andrew, 14, are very new to <br/>\nunschooling and have been in PS their entire lives before this.  I <br/>\ndon&#39;t see a lot of sibling rivalry per se, but I do see a lot of <br/>\nlet&#39;s say &quot;heavy debating&quot;, especially between the boys, for <br/>\ndebating&#39;s sake.  These so called debates could go on forever, lead <br/>\nto strong arguing and culminate in bad feelings all around if not <br/>\nthwarted early on.<br/>\n<br/>\nI could learn a little about being more effective in these <br/>\nsituations, but so much information is for starting at the <br/>\nbeginning.  Our beginning has grown kids out of the house and <br/>\nteenagers all around.  It will take some effort to retrain my brain, <br/>\nbut I am diligently working on doing just that.  <br/>\n<br/>\nThe one area that I struggle with the most is Andrew.  He just came <br/>\nhome at Easter.  He&#39;s really having difficulty grasping exactly what <br/>\nit is we are doing here.  His talk and concerns are still very <br/>\nschooly, and I didn&#39;t even know they were still there until he spent <br/>\nthe day with Pat, dh.  He expressed Andrew&#39;s &quot;concerns&quot; and <br/>\nhis &quot;concerns&quot; as well.  I figured out that neither of them really, <br/>\ntruly and honestly understand unschooling.  <br/>\n<br/>\nI know Andrew is still very much in the deschooling phase.  Maybe <br/>\njust continuing doing what we are doing will yield positive results <br/>\nin our home.  In the meantime I would like to have a few &quot;tools&quot; <br/>\nlogged in my mental tool belt in order to develop positive reaction <br/>\nwhen he is less than pleasant.  I&#39;m trying to avoid words like rude <br/>\nor disrespectful in sharing this with you, but they&#39;re the only way <br/>\nI know to see his behavior right now.  I do try to talk with him, <br/>\nbut that is still difficult.  The conversations are usually one-<br/>\nsided.  I look forward to the day that they are two-sided.<br/>\n<br/>\nThanks - Tina</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Hugs; was breaking news","postDate":"1151540645","msgId":15049,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDODY5Mjk3NkEzOTYzOC1ENDQtQTBFQE1CTEstTTI0LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PDAwMmUwMWM2OWIwOSRiZjI3OTBkMCQ2NDU4YThjMEBPZmZpY2U+","referencesHeader":"PGU3dTE3MStvdDM1QGVHcm91cHMuY29tPiA8MDAyZTAxYzY5YjA5JGJmMjc5MGQwJDY0NThhOGMwQE9mZmljZT4="},"prevInTopic":15048,"nextInTopic":15106,"prevInTime":15048,"nextInTime":15050,"topicId":15021,"numMessagesInTopic":0,"msgSnippet":"One of the (many!) great things about Joyce s writings is her ability to get people to look at a situation from a child s point of view---usually by putting an","messageBody":"<div id=\"ygrps-yiv-2100036667\">One of the (many!) great things about Joyce&#39;s writings is her ability <br/>\nto get people to look at a situation from a child&#39;s point of <br/>\nview---usually by putting an adult spin on it. It&#39;s so hard to see <br/>\nthings from a child&#39;s point of view. So many of us have forgotten what <br/>\nit was like to be a child. I don&#39;t---not really. I remember a LOT of <br/>\nhow I felt as a kid.<br/>\n<br/>\n  Anyway, I was thinking about this Joyce-style today while doing some <br/>\ngardening.<br/>\n<br/>\n  When Cameron was eight, there was another eight year old boy who was <br/>\nkilled when he ran across a *very* busy street. His mom was there, but <br/>\nhe scooted out of her reach. A car slammed into him; the driver had no <br/>\nchance to avoid him.<br/>\n<br/>\n  I know we charge a driver with involuntary manslaughter in such a <br/>\ncase, and I&#39;m assuming that&#39;s what happened to this driver. I never <br/>\nhear the follow-up.<br/>\n<br/>\n  But I remember when it happened, I pointed it out to Cameron---that <br/>\nthere was an eight year old boy killed right here. I remember saying <br/>\nhow *horrible* the driver must&#39;ve felt. I bet she could&#39;ve used a hug <br/>\nor two herself that day. I bet the mom could have to. Neither wanted <br/>\nthis to happen. It really *was* an accident.<br/>\n<br/>\n  Yet in our society, we *must* place blame *somewhere*. The mom blamed <br/>\nthe driver. I bet the driver felt guilty--and I bet she blamed the <br/>\nchild or the mom (it wasn&#39;t really her fault!).<br/>\n<br/>\n  But really when accidents happen, everyone involved needs hugs and a <br/>\nkind word.<br/>\n<br/>\n ~Kelly<br/>\n<br/>\n Kelly Lovejoy<br/>\n Conference Coordinator<br/>\n Live and Learn Unschooling Conference<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n<br/>\n  School&#39;s goal is to prepare them to be anything they want. But the <br/>\nprocess is so dullifying and kids haven&#39;t explored the possibilities of <br/>\nwhat they could be that many set their sites as low as possible. They <br/>\ngo to college to get a job to buy stuff. ~Joyce Fetteroll<br/>\n<br/>\n________________________________________________________________________<br/>\nCheck out AOL.com today. Breaking news, video search, pictures, email <br/>\nand IM. All on demand. Always Free.</div>","specialLinks":[]},{"userId":267954153,"authorName":"Brian & Alexandra Polikowsky","from":"&quot;Brian & Alexandra Polikowsky&quot; &lt;polykow@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Hugs; was breaking news","postDate":"1151536958","msgId":15048,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmUwMWM2OWIwOSRiZjI3OTBkMCQ2NDU4YThjMEBPZmZpY2U+","referencesHeader":"PGU3dTE3MStvdDM1QGVHcm91cHMuY29tPg=="},"prevInTopic":15023,"nextInTopic":15049,"prevInTime":15047,"nextInTime":15049,"topicId":15021,"numMessagesInTopic":0,"msgSnippet":"My ds was 3 and a half this January when just after my dd was born one of my friends ( one of the only unschoolers I know in person -and the first) came to","messageBody":"<div id=\"ygrps-yiv-286385421\">My ds was 3 and a half this January when just after my dd was born one of my friends ( one of the only unschoolers I know in person -and the first) came to visit with her son. They were here for most the afternoon until the evening. The kids were playing. Her son is just a few months older that ds and they get along pretty good. Right about 8:00 PM when ds was getting tired and &quot;wild&quot; because of it , we are standing at the top of my stairs that are high and pretty steep, the kids were playing and my son pushed her son down the stairs. It was horrible , I gave the baby to my mom and ran down stairs screaming. I truly believed her son was seriously hurt cause the fall was ugly ( I also peed on my pants in fear). Her son was fine. After checking on him to make sure I went up stairs to find my ds under the bed in fear. He was not in fear of me but what he had done. He actually meant to help his friend slide down ( They were playing sliding in their butts down the stairs) but his friend was standing when he pushed him. I did talk loud and scream but I was able to keep my head a little and just point out that pushing can be dangerous in the stairs. I know he did not meant to hurt his friend and I gave him a hug after I had stopped shaking. He has never pushed anyone in the stairs again.<br/>\n  Love is the best &quot;discipline&quot;.<br/>\n  Alex<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Hugs; was breaking news","postDate":"1151502369","msgId":15023,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU3dTE3MStvdDM1QGVHcm91cHMuY29tPg=="},"prevInTopic":15021,"nextInTopic":15048,"prevInTime":15022,"nextInTime":15024,"topicId":15021,"numMessagesInTopic":0,"msgSnippet":"~Forgive me Ren, but I do not understand how a child can shove another child down the stairs and you expect your first instinct to be a hug.~ I may have","messageBody":"<div id=\"ygrps-yiv-1312664384\">~Forgive me Ren, but I do not understand how a child can shove another<br/>\nchild down the stairs and you expect your first instinct to be a hug.~<br/>\n<br/>\nI may have misunderstood your question Rachell. Perhaps you were<br/>\nreferring to my initial anger that caused him to run away? <br/>\nIt&#39;s not that I necessarily expect the very first reaction to be<br/>\nWANTING to give him a hug, but when I slow down and see my child right<br/>\nbefore me, a being that wants to love and be loved, it helps me<br/>\napproach the situation differently than how my initial response would<br/>\ndictate.<br/>\n<br/>\nI was only regretting that the words out of my mouth were harsh enough<br/>\nto make him want to run away to a room.  I could have phrased it much<br/>\ndifferently and worked through the situation after hearing the whole<br/>\nstory and talking to him about why we can&#39;t do that.<br/>\n<br/>\nThe cool thing is, my very first response to problems is often giving<br/>\na hug.:) That would not have been true when my oldest was a little<br/>\nguy...I wish it would have been. Hugs solve a lot of problems.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Hugs; was breaking news","postDate":"1151498403","msgId":15021,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU3dHRiMytiMGluQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":15023,"prevInTime":15020,"nextInTime":15022,"topicId":15021,"numMessagesInTopic":0,"msgSnippet":"~Forgive me Ren, but I do not understand how a child can shove another child down the stairs and you expect your first instinct to be a hug. I do not mean to","messageBody":"<div id=\"ygrps-yiv-189350287\">~Forgive me Ren, but I do not understand how a child can shove another<br/>\nchild down the stairs and you expect your first instinct to be a hug.<br/>\nI do not mean to seem argumentative, I am genuinely curious. ~<br/>\n<br/>\nBy not seeing anything as reward or punishment. My children and I do<br/>\nnot live in that paradigm, we&#39;re here to work together not hurt or<br/>\nreward each other for anything. <br/>\nThere are times I&#39;ve removed myself and a child from a situation until<br/>\nthey could calm, or very strongly said &quot;no, that&#39;s not ok&quot;, but I<br/>\ndon&#39;t punish my children. <br/>\n<br/>\nAs far as getting to the point where a hug is instinctual, that takes<br/>\ntime. I&#39;ve had four children and lots of years of peaceful parenting<br/>\npractice to get there and I still get more snippy than I&#39;d like<br/>\nsometimes. It&#39;s really not that hard now. I see a child that has hurt<br/>\nanother child and is honestly upset. Kids really don&#39;t want to hurt<br/>\neach other, but by demonizing the act, they start to see themselves as<br/>\nflawed or &quot;mean&quot; or &quot;awful&quot;. By realizing that children sometimes act<br/>\nout in inexperienced manners, I can see the behavior for what it<br/>\nis...a mistake.<br/>\n<br/>\nNobody needs to be harangued for a mistake. Otoh, Sierra was hurt and<br/>\ncrying, so I very clearly pointed out that what he did had a very<br/>\nnegative consequence, that I didn&#39;t like it and I didn&#39;t want anyone<br/>\npushing anybody else especially down stairs.<br/>\nHe was very sorry and sad for his choice. Why would he need<br/>\npunishment? Why wouldn&#39;t he need a hug? Would you rather be berated<br/>\nand made to feel &quot;less than&quot; when you screw up? Or would you rather<br/>\nhave the other person say &quot;I don&#39;t like what you did, but I love you&quot;<br/>\nand give a hug?<br/>\n<br/>\nI feel my kids are a testament to this style of parenting. They don&#39;t<br/>\nfight hardly at all! Sierra and Jalen  are the two most likely to have<br/>\na problem (partly due to Jalen&#39;s younger age and skill level...5y.o.)<br/>\nif anyone does, yet they can play happily all day together without<br/>\nmore than a simple discussion on a disagreement.<br/>\n<br/>\nMy other children almost NEVER fight. I can&#39;t remember the last time<br/>\nJared and Trevor even had a disagreement (16,12).  We rarely have any<br/>\nkind of sibling rivalry issues any more. My house is fairly peaceful<br/>\nover all....<br/>\n<br/>\nI think punishment (even for poor choices) is not the best way to help<br/>\na person navigate the world with self intact. Marji really summarized<br/>\nit beautifully. My kids have the opportunity to feel whole and<br/>\ncomplete, even when they make a poor choice (called learning) and move<br/>\non without all the angst and bad feelings most kids get dumped on<br/>\nthem.  Trust me, hugging and loving when a person screws up does NOT<br/>\nlead to more poor choices, it leads to a healthier human that makes<br/>\nbetter choices each time.<br/>\n<br/>\nJalen has some very intense personality traits, I truly believe he&#39;d<br/>\nbe very squashed with a more traditional style of parenting. He&#39;s been<br/>\nthe best Zen master a person could want.:)<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]}],"prevTopicId":15097,"nextTopicId":15081}}