{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":241747552,"authorName":"fullmoonfarm_mn","from":"&quot;fullmoonfarm_mn&quot; &lt;fullmoonfarm_mn@...&gt;","profile":"fullmoonfarm_mn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"guidance/support","postDate":"1220119315","msgId":35637,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc5YzF1ait1amtuQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":35636,"nextInTime":35638,"topicId":35637,"numMessagesInTopic":0,"msgSnippet":"Hi-- I know this is going to be long so here s your warning in advance !! :) I have been homeschooling my kids since my older daughter was 5, and she is now","messageBody":"<div id=\"ygrps-yiv-574155543\">Hi-- I know this is going to be long so here&#39;s your warning in <br/>\nadvance !! :)   <br/>\n<br/>\nI have been homeschooling my kids since my older daughter was 5, and <br/>\nshe is now 11, her sister is 9 (almost 10--eegads!where does the time <br/>\ngo)  I always felt I was an unschooler, read the lists, etc.  Our <br/>\ncurriculum was life, but I always had Curriculum on hand to help spur <br/>\ntheir interests if they wanted to do something in there. We used Oak <br/>\nMeadow, Little HOuse on the Prairie, and the Well-trained mind, too.  <br/>\nWe are using WTM, right now, because my older daughter wants to be a <br/>\nvet and wants to be fully ready to go full-speed ahead when she is <br/>\nold enough for college (her goal is 16-through minnesota&#39;s post-<br/>\nsecondary education option program).  She does not want to have to <br/>\nstudy too hard for her generals and wants to go straight into college <br/>\nmath.  My other daughter loves doing crafts and art and creating <br/>\nstuffed animals.<br/>\n <br/>\nMy problem lies in this-- I am not a stay-at-home mom.  I work 20 <br/>\nhours a week at the local hospital and am in college full-time to get <br/>\nmy nursing degree (because I do not want to put off my goals for <br/>\nmyself any longer, and we need the money).  Last year, we had an <br/>\nexchange student from Korea living with us, and because she had to go <br/>\nto public school, my girls tried it.  They did not want to continue <br/>\nthis year.  So, now that we are homeschooling again, I have been <br/>\nstruggling to revive my unschooling tendencies which I seem to have <br/>\nlost somehow in the past year, and wondering if I EVER was an <br/>\nunschooler.  I have a deep-seated paranoia that I am not challenging <br/>\nthem enough, that I cannot provide enough experiences for them to be <br/>\nstimulated by the life surrounding them.  My days off (one weekend <br/>\nevery other week) are filled with household duties and schoolwork.  <br/>\nRight now, I am cooking enough for a couple days of lunches and <br/>\nbaking bread while doing laundry. I feel I have to account for their <br/>\nevery moment of the day and whether or not they learned ANYTHING <br/>\nother than that the goats have worms again and it is time to trim the <br/>\nhooves. (That was Wednesday).   <br/>\n<br/>\nI understand that unschooling is about trust, and no punishments, I <br/>\naccept these whole-heartedly... I just worry that I am going to fail <br/>\nmy girls in that I will not have given them what they need to achieve <br/>\nat the rate and level they want!  My girls are so headstrong.  I <br/>\nadmire them so much in their convictions - they are both staunch <br/>\nvegetarians.  Cait for the last 4 years has not touched anything <br/>\nanimal, Clio has only minor setbacks.  I try really hard to just let <br/>\ngo of my fears and trust that they will get what they need somehow, <br/>\nbut lately I&#39;m really struggling.  I don&#39;t have much time to steer <br/>\nthem anymore - like, right now they are out in the fields with a <br/>\nfriend gathering wild blackberries and I feel like I should be out <br/>\nthere with them, pointing out the plantsand their names and uses... <br/>\nhelping them identify animal tracks... looking at clouds and talking <br/>\nabout weather!!!!!  <br/>\n<br/>\nAnyway, this is where I am right now, and why I have subsribed to <br/>\nthis list.  I look forward to reading and trying any advice that <br/>\ncomes my way!  <br/>\n<br/>\nTIA-Dawn</div>","specialLinks":[]}],"prevTopicId":35624,"nextTopicId":35634}}