{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Teens & Late Night Chat","postDate":"1158117875","msgId":17176,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTMwMWM2ZDZlNCQyNDNlYzlhMCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4=","referencesHeader":"PDExNTgwNTc1OTcuNDIwLjE0ODU5Lm0yMEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":17175,"nextInTime":17177,"topicId":17176,"numMessagesInTopic":0,"msgSnippet":"About teens (or anyone) possibly coming into contact with someone scary online: Please keep in mind that it is easy to be influenced by the scary stories of ","messageBody":"<div id=\"ygrps-yiv-540812157\">About teens (or anyone) possibly coming into contact with someone scary <br/>\nonline:<br/>\n<br/>\nPlease keep in mind that it is easy to be influenced by the scary stories of <br/>\ninternet weirdo&#39;s you&#39;ve heard - and the truth is those internet weirdoes <br/>\nare weirdoes in real life somewhere, on some street in some neighborhood and <br/>\nit could be yours.<br/>\n<br/>\nIf your daughter was in school and met a boy she liked and gave him her <br/>\nphone number or let him walk her home from school would you be afraid?<br/>\nHe could be a blossoming serial rapist/killer/burglar.    But walking home <br/>\nfrom school is more what we&#39;re used to, more accepted and we&#39;ve known it to <br/>\nhappen dozens or more times and it seems less frightening to us.    What if <br/>\nshe met a boy at church?  At camp?   At dance class?   What about the boy <br/>\nwho&#39;s lived across the street for three years.<br/>\n<br/>\nMeeting people and beginning a relationship can have risks.<br/>\n<br/>\nWe don&#39;t hear too often about the lives of the kids who are victimized by <br/>\nnuts they met online.  But when you think about the reasons a kid might be <br/>\nsneaky and hide a friendship or relationship one possibility is they cannot <br/>\ntrust their parents.    On another list Marji wrote this:   &quot;when someone <br/>\nlies to someone else, it&#39;s because the person doing the lying actually does <br/>\nnot trust the person being lied to.&quot;    That&#39;s powerful information for <br/>\nparents to have.   Can your child trust you?   Trust you to not go off on a <br/>\nrant, trust you to not get angry, trust you to not punish, trust you to not <br/>\nbadger?<br/>\n<br/>\nSo does your child trust you?   Is your child at risk of being groomed away <br/>\nfrom you by a creep?  Is she needy?   Is she desperate for acceptance, love, <br/>\npositive attention?   These are some questions you can ask yourself.    And <br/>\nif the answer is yes then the danger from some icky grocery store clerk down <br/>\nthe block or some weirdo dance instructor is much more real than some guy on <br/>\nonline, possibly ten states away.<br/>\n<br/>\nTry to keep it in perspective.   There are some kids at higher risk than <br/>\nothers.  Kids are hurt more often by people they know.  Don&#39;t let fear of <br/>\ninternet stalkers overtake you.   Perspective.<br/>\n<br/>\nWe can have relationships that allow our children to trust us.   We can live <br/>\nrespectfully with them so that they are growing more confident everyday.<br/>\nWe can spend time with them, doing what they love so that we really know our <br/>\nkids.   We can reduce the risk of our kids looking for acceptance elsewhere.<br/>\n<br/>\n***I told her about<br/>\nmy concerns, calling at such a late hour, after we&#39;ve gone to bed,<br/>\nit &quot;appears&quot; sneaky etc etc.***<br/>\n<br/>\nI have called my friend on sleepless nights.   I wasn&#39;t being sneaky and I <br/>\nwould have thought my husband an ass if he&#39;d suggested I was.   There is a <br/>\nlovely quality to night time conversation in a quiet house.   Teens <br/>\nespecially are wired for late nights.   It&#39;s part of their chemical make up.<br/>\nYou don&#39;t trust her if you feel it&#39;s sneaky of her to be on the phone late <br/>\nat night.   The biggest danger to any kid is a shaky relationship with <br/>\nparents.<br/>\n<br/>\n***She&#39;s still worried I&#39;ll explode<br/>\nbecause I &quot;worry about this&quot;. I finally said that since she wants me<br/>\nto trust her, then I ask that she trust me when I say that I&#39;m working<br/>\nreally hard on changing that and to listen more (mutual respect). (I<br/>\nhaven&#39;t &quot;exploded&quot; in quite a while, but of course this is part of our<br/>\nhistory, and part of our healing process).***<br/>\n<br/>\nYes, that&#39;s hard but it&#39;s worth the struggle to rebuild trust.  You&#39;ve <br/>\ntalked to her and she seems to understand your concerns.<br/>\nBe careful that your concerns don&#39;t translate to her as control on your part <br/>\nor you could lose ground.<br/>\n<br/>\nRead the book &quot;Parent / Teen Breakthrough The Relationship Approach by Mira <br/>\nKirshenbaum  ISBN 0452266165<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]}],"prevTopicId":17175,"nextTopicId":17151}}