{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":132876517,"authorName":"AECANGORA@aol.com","from":"AECANGORA@...","profile":"amy_aec","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Saying Yes, some examples!","postDate":"1270127551","msgId":43564,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQzlGQjQxRUY0NkJCRi1ENEMtMTFGNUB3ZWJtYWlsLWQwMDUuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":43563,"nextInTime":43565,"topicId":43564,"numMessagesInTopic":0,"msgSnippet":"Hi Meredith, Thanks for the perspective.  In retrospect it probably was a mini lecture, but world s better than my previous speeches.  Since Emma is 9, she s","messageBody":"<div id=\"ygrps-yiv-1335550867\">Hi Meredith,<br/>\n<br/>\nThanks for the perspective.  In retrospect it probably was a mini lecture, but world&#39;s better than my previous speeches.  Since Emma is 9, she&#39;s had years of learning to tune me out when I get too long winded.  For her, the statement was probably refreshingly short;-)  <br/>\n    <br/>\nMy actual goal at the moment was to jump in before her father, who was still waking up and grumpy from sinus congestion, could respond with a flat &quot;NO&quot;.  Instead she got a, &quot;Yes, when he&#39;s done.&quot;  Her need was acknowledged, and she only had to deal with the delay, which she did quite well.  <br/>\n  <br/>\nFrom reading the various e-mails on this group, I&#39;ve gotten the sense that although saying Yes more often is a goal, that it&#39;s also OK to still expect all members of the family to be respectful of one another.  So I was trying to show how I had given Emma her yes and helped her Dad feel respected.  (I haven&#39;t fully discussed radical unschooling with him yet, but have been throwing out subtle hints that there is a change afloat by saying things like, &quot;I&#39;m trying to be less controlling about ....  So, I am conscious of making sure he doesn&#39;t feel pushed aside while I&#39;m trying to give the girls more freedom.)<br/>\n<br/>\nI am definitely in the learning stages and have a long way to go!  My main reason for sharing this as an example was to help Rebecca M., who felt like things were moving too fast.  My main point, and possibly not made very well, is that it is a learning process, and change isn&#39;t going to happen over night. For, example I have been in the process of giving up gluten because it makes me feel tired and achy all the time.  I first gave it up last spring and felt better.  Then I resented not being able to eat it and started cheating.  By Christmas I was eating it regularly and felt sick again.  In Jan. I gave it up again and feel much better.  I&#39;m still not 100 %, but definitely accept that this is the way it has to be and am not planning to go back to eating it.  When I do cheat, I feel it, which helps me resist the next time.  <br/>\n      <br/>\n I imagine that is how it is with unschooling.  One reads the books, etc. and realizes this is what I need to do, I need to make a change.  Then she jumps right in, sees some positive results, but then those old parenting habits rear their ugly heads when one is stressed and overtired.  The hard thing is to then not feel discouraged, but to simply keep trying to do better.  <br/>\n<br/>\nOne of the La Leche League Leaders in my area, when I was a leader, had a saying, that went something like this.  &quot;I did what I knew to do at the time, and when I knew better I did better.&quot;  I always try to keep that in mind when trying to make a shift towards more positive relationships, so that I don&#39;t cling to past mistakes.  <br/>\n    <br/>\nWell, this has become a little long winded, and maybe off track.  Just trying to explain why I choose that example, even though it was less than perfect:-)<br/>\n    <br/>\nAmy C.<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":43556,"nextTopicId":43566}}