{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":18,"messages":[{"userId":308771928,"authorName":"Stacey","from":"&quot;Stacey&quot; &lt;sibach@...&gt;","profile":"stacey_ibach","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New and have a question","postDate":"1317413923","msgId":47394,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2NTg3MytvN2lkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo1ZzFmZCttNzVwQGVHcm91cHMuY29tPg=="},"prevInTopic":47389,"nextInTopic":0,"prevInTime":47393,"nextInTime":47395,"topicId":47310,"numMessagesInTopic":0,"msgSnippet":"... Thanks Angela - it has been a good suggestion that I have used a couple of times aready!! AND in the event anyone would like some follow up to this","messageBody":"<div id=\"ygrps-yiv-1119432702\"><blockquote><span title=\"ireply\">&gt;I can throw out any number of anecdotes about how my children learned &gt;math or science or reading or whatever from various activities or &gt;sources or as if by osmosis because I can&#39;t pinpoint the source at all.<br/>\n<br/>\n </span></blockquote>Thanks Angela - it has been a good suggestion that I have used a couple of times aready!! AND in the event anyone would like some follow up to this converation...my good friend battling with the notion of unschooling (already homeschooling) has taken some great new steps as I had forwarded a lot of the links to blogs and sites people here had recommended. She is turning off the teacher in her and letting them guide their own days. But with regards to piano she had offered her 7 year old a monthly break or one month totally off in exchange for continuing to try to find a way to make it enjoyable. They communicated their issues and ideas to their piano teacher whom I know to be very amazing, and she changed his program to be what HE wanted to learn instead of what he was SUPPOSED to learn. He actually left telling his mom he thought that was a great compromise...for now ;)<br/>\n<br/>\nThanks again everyone!<br/>\nStacey</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Was: New and have a question ?? Fibonacci Games","postDate":"1317400041","msgId":47389,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2NHFsOStpNmZsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo2M2pycSsydW9wQGVHcm91cHMuY29tPg=="},"prevInTopic":47375,"nextInTopic":47394,"prevInTime":47388,"nextInTime":47390,"topicId":47310,"numMessagesInTopic":0,"msgSnippet":"One s The Davinci Code. One is one of the Myst games... that was more for me than the kids, although Mo played along and helped me figure out the puzzles. I m","messageBody":"<div id=\"ygrps-yiv-84404883\">One&#39;s The Davinci Code. One is one of the Myst games... that was more for me than the kids, although Mo played along and helped me figure out the puzzles. I&#39;m thinking there&#39;s a Jimmy Neutron game, though, with a Fibonacci code, and something else... its a really simple way to make a code look harder than it is. We have some &quot;hidden pictures&quot; PC games that usually have extra puzzles and challenges and I bet one of those used a Fibonacci sequence, too. <br/>\n---Meredith</div>","specialLinks":[]},{"userId":288325711,"authorName":"dinapug310","from":"&quot;dinapug310&quot; &lt;b38040@...&gt;","profile":"dinapug310","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Was: New and have a question ?? Fibonacci Games","postDate":"1317360314","msgId":47375,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2M2pycSsydW9wQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo1ZmtoYiticDc0QGVHcm91cHMuY29tPg=="},"prevInTopic":47341,"nextInTopic":47389,"prevInTime":47374,"nextInTime":47376,"topicId":47310,"numMessagesInTopic":0,"msgSnippet":"... Meredith, I was wondering the names of the 2 games? Thanks! Dina","messageBody":"<div id=\"ygrps-yiv-60404669\"><blockquote><span title=\"ireply\">&gt; I chuckled at your story - we have at least two video games which use variations on the Fibonacci sequence! And plenty of kids like to play with numbers and codes... even some schooled kids ;)<br/>\n<br/>\n </span></blockquote>Meredith, I was wondering the names of the 2 games?<br/>\n<br/>\nThanks!<br/>\nDina</div>","specialLinks":[]},{"userId":308771928,"authorName":"Stacey","from":"&quot;Stacey&quot; &lt;sibach@...&gt;","profile":"stacey_ibach","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New and have a question","postDate":"1316731010","msgId":47341,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1Z2RhMitjZXRwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMTY2OTA5OTUuODY1ODguWWFob29NYWlsUkNAd2ViODczMDIubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":47336,"nextInTopic":47375,"prevInTime":47340,"nextInTime":47342,"topicId":47310,"numMessagesInTopic":0,"msgSnippet":"The problem with treating that question as the opening to a Socratic dialogue is that the other party feels very, very emotionally, physically and personally","messageBody":"<div id=\"ygrps-yiv-1558958349\">&quot;The problem with treating that question as the opening to a Socratic dialogue is that the other party feels very, very emotionally, physically and personally tied to what they are doing. Of course the other side, the almost flippant response of all they do is watch tv and video games, suggests that you aren&#39;t nearly as tied into what you are doing as I imagine you are.&quot;<br/>\n<br/>\nI totally agree. Of course you only hear what I type about the situation and is was at the end of a long conversation about what their (these women) day looks like, each offering the schedule board with 15 minute flash card sessions. I wasn&#39;t making eye contact or contributing and it went noticed so when pressed I offered that I was an unschooler which was met with immediate scarcasm about letting my kids watch TV, play video game and eat ice cream all day. It was a bit of a hostile crowd - not all - just the 2 women who obviously has done some reading about it. Interestingly they saw Dayna Martin on Dr. Phil. I haven&#39;t seen it but I heard she was blind sided. So with all the other insight I tried to offer they only heard what they wanted to. Those that came to me later had more questions and offered experiences of their own where they were amazed at their own children given the freedom to choose their daily activities. Of course TV and video games were off limits to these kids - but I could see the sparkle in their eyes when they talked of the possibilities. I have never wanted to be an advocate for unschooling, but it seems to be too interesting for others to let me be. In hindsight I should have recognized the tone of the room and said something less controversial, like I follow my own program which is more relaxed....I don&#39;t know.<br/>\n<br/>\nThose who are geniunely interested but still question the concern with wasting away their day and subsequently their life, I needed some help. This whole discussion has been great:<br/>\n<br/>\n&quot;Who am I to limit their relationship to the world to my understanding of &quot;own good&quot;?&quot;<br/>\n<br/>\nExactly!!! Yes, yes, yes!<br/>\n<br/>\nMy kids are designing lemonade stand signs as they feel they need more money. My 6 year old Lochlan wrote on it &quot;Lemen Joos&quot;. Of course it is! I was commenting on the lettering and spelling and he made a funny face...he was WAY more proud of the bubble arrow he drew on it.<br/>\n<br/>\nStacey</div>","specialLinks":[]},{"userId":76589361,"authorName":"Angela","from":"&quot;Angela&quot; &lt;argwolff@...&gt;","profile":"argwolff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New and have a question","postDate":"1316718893","msgId":47336,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1ZzFmZCttNzVwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo1ZTNyaytzb2k5QGVHcm91cHMuY29tPg=="},"prevInTopic":47335,"nextInTopic":47341,"prevInTime":47335,"nextInTime":47337,"topicId":47310,"numMessagesInTopic":0,"msgSnippet":"... I think maybe rather than launching into what you do, even though that is what they are asking, maybe ask them more questions: Why is it so important to","messageBody":"<div id=\"ygrps-yiv-1815766057\"><blockquote><span title=\"ireply\">&gt;&gt; and yes they come right out and ask &quot;what should I do? I tell them they can quit in 3 or 4 years and then they cry which makes me want to cry. How do I show them that this is for their own good&quot;. &lt;&lt;<br/>\n<br/>\n </span></blockquote>I think maybe rather than launching into what you do, even though that is what they are asking, maybe ask them more questions: Why is it so important to you that they continue? What are you afraid will happen if they quit? What do you think will be the long-term benefit if they continue against their will? (though there&#39;s probably a gentler way to word that), etc.<br/>\n<br/>\nI&#39;m thinking of people asking me how I get my son to go to Hebrew school without complaint. When I tell them it&#39;s his choice, they say, &quot;Well if I gave my kids a choice, they&#39;d never go!&quot; <br/>\n<br/>\nThey are worried that if they don&#39;t go they won&#39;t be able to &quot;have&quot; a bar/bat mitzvah &quot;on time&quot;. But what&#39;s on time? Why is the public celebration at 13 so important to them? what if it&#39;s not important to their child? is there another way to mark the milestone? Do they realize that there is nothing proscribed to &quot;become bar/bat mitzvah,&quot; that it just happens when a child turns 13? If the child decides at 12 that  it&#39;s important to them to have the typical celebration at 13, couldn&#39;t they just hire a tutor to help them prepare? What is the long-term goal: bar mitzvah at 13, or life-long connection to Judaism? etc.<br/>\n<br/>\nDo any of those people change the way they think about Hebrew school, piano lessons/practice, homework, or whatever, being mandatory or change the way they interact with their kids around those subjects? I don&#39;t know, but it may help them think about &quot;have to&quot; and their ultimate goals a little more, and it doesn&#39;t set it up the knee-jerk response of &quot;That&#39;s great for you, but I could NEVER do that?&quot; And no one can accuse you of lying (-; <br/>\n<br/>\nWhen people ask specifically about what we do, I rarely call it unschooling, because even if they&#39;ve heard of it, usually only other unschoolers have a positive connotation or any real understanding what it means. I say things like: &quot;because of my son&#39;s learning style we don&#39;t have structured lessons&quot; ... &quot;We do things a little differently with each child because they have such different preferences and interests&quot; ... &quot;I used to worry about &#39;too much&#39; tv and computer time, but I&#39;ve come to see that it&#39;s just another source of information and that they are making all kinds of connections that I never could have imagined&quot; ... etc<br/>\n<br/>\nThat&#39;s usually enough for them to feel like I&#39;m not attacking their choices and that I&#39;ve really given thought to ours. And if they push further about &quot;well how do you know they are getting enough ...?&quot; I can throw out any number of anecdotes about how my children learned math or science or reading or whatever from various activities or sources or as if by osmosis because I can&#39;t pinpoint the source at all.<br/>\n<br/>\nbest,<br/>\nAngela in NJ<br/>\nwith Joseph, 9; Hannah, 6; and Miriam, almost 4</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New and have a question","postDate":"1316713064","msgId":47335,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1ZnJwOCs3ZjhzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4MEFEQTJCMTVAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":47334,"nextInTopic":47336,"prevInTime":47334,"nextInTime":47336,"topicId":47310,"numMessagesInTopic":0,"msgSnippet":"And you get pie! Sometimes for eating. Sometimes for throwing. :) Nance","messageBody":"<div id=\"ygrps-yiv-1901903776\">And you get pie! Sometimes for eating. Sometimes for throwing. :)<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Debra Rossing &lt;debra.rossing@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; &gt; To some extent you have to believe in it a little in order to see it &quot;working&quot; otherwise it seems incomprehensible that a &quot;normal&quot; child would actually choose to learn something complex or choose to do a rather dull sequential task like figure a Fibonacci sequence or memorize Pi to the nth digit or learn to read and write Tolkien&#39;s elvish script. &lt;eye roll&gt;<br/>\n&gt; <br/>\n&gt; Oh Pi is quite important in our house - we love Pi Day. Pi Day is the occasion for learning a few more digits of pi each year. DS has more digits memorized than I do now. </span></blockquote></div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New and have a question","postDate":"1316712535","msgId":47334,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4MEFEQTJCMTVAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":47333,"nextInTopic":47335,"prevInTime":47333,"nextInTime":47335,"topicId":47310,"numMessagesInTopic":0,"msgSnippet":"... Oh Pi is quite important in our house - we love Pi Day. Pi Day is the occasion for learning a few more digits of pi each year. DS has more digits memorized","messageBody":"<div id=\"ygrps-yiv-1028380073\"><blockquote><span title=\"ireply\">&gt; To some extent you have to believe in it a little in order to see it &quot;working&quot; otherwise it seems incomprehensible that a &quot;normal&quot; child would actually choose to learn something complex or choose to do a rather dull sequential task like figure a Fibonacci sequence or memorize Pi to the nth digit or learn to read and write Tolkien&#39;s elvish script. &lt;eye roll&gt;<br/>\n<br/>\n </span></blockquote>Oh Pi is quite important in our house - we love Pi Day. Pi Day is the occasion for learning a few more digits of pi each year. DS has more digits memorized than I do now.<br/>\n<br/>\nThe first thing, though, was E=mc^2. It showed up on Jimmy Neutron one day and became a topic of discussion - DS wanted to know what &#39;squared&#39; meant, what the letters stood for, why it was &#39;invented&#39;, who &#39;invented&#39; it, etc. It just so happened (ain&#39;t it funny how often that pops up?) that one of our magazines (I don&#39;t remember if it was Discover or Smithsonian or what) had a big article about Albert Einstein that same month, so I grabbed that and showed DS that famous picture of the &quot;crazy guy with the wild hair&quot; LOL<br/>\n<br/>\nBut, a key piece of the whole puzzle here (how do people &#39;get it&#39;) is that most people lose that exploratory curiosity about the world around them, they don&#39;t want to think about numbers (or whatever it was that was difficult in school) and at the same time they don&#39;t want to say &quot;I don&#39;t know&quot; to their kids. When the whole household is exploring, trying, learning, curious, swirling all around with different information, then it&#39;s not as surprising that anyone (adult or child) would want to learn/explore the Fibonacci sequence, pi, Shakespeare, pig latin, video capture (like for YouTube), sewing, baking, gardening, Monty Python, Civil War history, ...<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New and have a question","postDate":"1316710777","msgId":47333,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1ZnBocCtrNmFrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo1ZTNyaytzb2k5QGVHcm91cHMuY29tPg=="},"prevInTopic":47331,"nextInTopic":47334,"prevInTime":47332,"nextInTime":47334,"topicId":47310,"numMessagesInTopic":0,"msgSnippet":"Sometimes the other parents just have to go through it. They have to try and maybe fail. It just doesn t sound real until they have experienced whatever they","messageBody":"<div id=\"ygrps-yiv-276256007\">Sometimes the other parents just have to go through it. They have to try and maybe fail. It just doesn&#39;t sound real until they have experienced whatever they are trying. And sometimes that&#39;s sad for their children. But you can only do what you can do and then get on with your life.<br/>\n<br/>\nI was on the phone with a Mom to a 3 and a 4-year-old yesterday. Currently enrolled in a Montessori school. The school is closing and she wanted to know if she was allowed to hire a teacher to come to her house and continue with the children&#39;s education. <br/>\n<br/>\nSigh. . .<br/>\n<br/>\nWell, we went through the hsing requirements but when I then urged her to consider that 3 and 4 are very young ages, that she doesn&#39;t need to replicate school at home, even a Montessori flavored school, etc., etc. . . . she listened politely but I think she basically thought I was some kind of crazy, liberal, radical something-or-other by the end of the conversation.<br/>\n<br/>\nMaybe she will have our conversation in the back of her mind as she tries to set up a Montessori-type school in her living room, complete with paid tutor/babysitter (as it turned out, that was part of the reason the teacher was being considered, so the Mom could work), and maybe it will all work out and I&#39;ll be that odd crank she talked to. But maybe it won&#39;t all work out and she&#39;ll at least know there is another option out there.<br/>\n<br/>\nNance<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Stacey&quot; &lt;sibach@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Thanks Meredith - and yes they come right out and ask &quot;what should I do? I tell them they can quit in 3 or 4 years and then they cry which makes me want to cry. How do I show them that this is for their own good&quot;. This is usually part of asking me directly what I do all day and how my kids learn ending with &quot;I could never let mine do that cause all they would do is watch TV and play video games&quot;. Sometimes I&#39;m cheeky and say &quot;yup that&#39;s what mine do&quot;. It shuts the conversation down, until yesterday when I had YET AGAIN this conversation because I&#39;m introduced to a whole new group of homeschoolers. I just became the beaver leader for a homeschool Scout group. None are unschoolers. And they all asked this question in a room - it felt like I was being interviewed! But I smiled and gave bits and pieces and ended with &quot;yup it&#39;s video games all day&quot; which some popped their mouths open, others laughed assuming I was joking...at that moment my eight year old, Murdoch, walked into the room and asked if I had a calculator on my phone, &quot;yes&quot;. I handed him the phone. I don&#39;t ask why because he&#39;ll ask me another question if he needs my help but one mom asked him what he was going to use it for, &quot;I can add the Fibonacci sequence to 144, but after that I get bored and the calculator works faster&quot;. I have no idea why he was doing that in a group of 6 to 8 year olds, but the women in the room then came to me one by one to ask if I was secretly teaching them and pretending to unschool. I have come to realize this will never end as long as we keep meeting new people and with that I get to talk about my joyful abundant life. Lucky me! I appreciate some concrete responses to more in depth conversation I get into with closer friends trying so hard to wrap their brain around this. You have all be very very helpful!<br/>\n&gt; <br/>\n&gt; I can&#39;t wait to get to know y&#39;all better!<br/>\n&gt; <br/>\n&gt; With Gratitude,<br/>\n&gt; Stacey<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New and have a question","postDate":"1316705643","msgId":47331,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1ZmtoYiticDc0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo1ZTNyaytzb2k5QGVHcm91cHMuY29tPg=="},"prevInTopic":47329,"nextInTopic":47333,"prevInTime":47330,"nextInTime":47332,"topicId":47310,"numMessagesInTopic":0,"msgSnippet":"... ****************** I chuckled at your story - we have at least two video games which use variations on the Fibonacci sequence! And plenty of kids like to","messageBody":"<div id=\"ygrps-yiv-949307321\">&quot;Stacey&quot; &lt;sibach@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&quot;I can add the Fibonacci sequence to 144, but after that I get bored and the calculator works faster&quot;. I have no idea why he was doing that in a group of 6 to 8 year olds, but the women in the room then came to me one by one to ask if I was secretly teaching them and pretending to unschool.<br/>\n </span></blockquote>******************<br/>\n<br/>\nI chuckled at your story - we have at least two video games which use variations on the Fibonacci sequence! And plenty of kids like to play with numbers and codes... even some schooled kids ;)<br/>\n<br/>\nBut that&#39;s one of the troubles with trying to explain unschooling to people who don&#39;t get it. To some extent you have to believe in it a little in order to see it &quot;working&quot; otherwise it seems incomprehensible that a &quot;normal&quot; child would actually choose to learn something complex or choose to do a rather dull sequential task like figure a Fibonacci sequence or memorize Pi to the nth digit or learn to read and write Tolkien&#39;s elvish script. &lt;eye roll&gt;<br/>\n<br/>\nYou might try saying your goal is to make Enjoying learning a priority and are less concerned with What your kids learn. But really, chances are most people will decide there&#39;s something special about your kids... or as has already happened will wonder if you&#39;re even telling the truth.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: New and have a question","postDate":"1316690995","msgId":47329,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTY2OTA5OTUuODY1ODguWWFob29NYWlsUkNAd2ViODczMDIubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PGo1ZTNyaytzb2k5QGVHcm91cHMuY29tPg==","referencesHeader":"PGo1ZTNyaytzb2k5QGVHcm91cHMuY29tPg=="},"prevInTopic":47328,"nextInTopic":47331,"prevInTime":47328,"nextInTime":47330,"topicId":47310,"numMessagesInTopic":0,"msgSnippet":"... The problem with treating that question as the opening to a Socratic dialogue is that the other party feels very, very emotionally, physically and","messageBody":"<div id=\"ygrps-yiv-698529124\"><blockquote><span title=\"ireply\">&gt;&gt;and yes they come right out and ask &quot;what should I do? I tell them they  can <br/>\n&gt;&gt;quit in 3 or 4 years and then they cry which makes me want to cry.  How do I <br/>\n&gt;&gt;show them that this is for their own good&quot;&lt;&lt;<br/>\n<br/>\n </span></blockquote>The problem with treating that question as the opening to a Socratic dialogue is <br/>\nthat the other party feels very, very emotionally, physically and personally <br/>\ntied to what they are doing. Of course the other side, the almost flippant <br/>\nresponse of all they do is watch tv and video games, suggests that you aren&#39;t <br/>\nnearly as tied into what you are doing as I imagine you are. <br/>\n<br/>\n<br/>\nMaybe, if it could be done gently, and I&#39;m not gifted enough to do it, one could <br/>\nsuggest that their children have their own interests at heart at least as <br/>\npassionately as their parents do. Someone could question whether or not one <br/>\nperson has a more complete knowledge of what it is to be a good self, an <br/>\naccomplished self, a capable and contented self. There is a Calvin and Hobbes <br/>\ncartoon that happens not long after Calvin&#39;s home is burgled with the two <br/>\nparents lying in bed and the dad saying &quot;It&#39;s funny...when I was a kid, I <br/>\nthought grown-ups never worried about anything. I trusted my parents to take <br/>\ncare of everything and it never ocurred to me that they might not know how. I <br/>\nfigured once you grew up, you automatically knew what to do in any given <br/>\nscenario. I don&#39;t think I&#39;d have been in such a hurry to reach adulthood if I&#39;d <br/>\nknown the whole thing was going to be ad-libbed.&quot; We are, each of us, filled <br/>\nwith imperfect knowledge. Knowledge is a personal thing. Calvin&#39;s parents had to <br/>\nad-lib for different situations than their parents did, with different people, <br/>\ndifferent references, different memories. <br/>\n<br/>\n<br/>\nYesterday Simon used the term homunculus in a sentence. We were talking about <br/>\nartificial intelligence and Orson Scott Card&#39;s desire to find a way for it to <br/>\nfit within his own belief system. In the discussion Simon mentioned homunculus <br/>\nand I had to ask him what it meant. I am proud to be ignorant in the face of his <br/>\nknowledge. By recognising my own ignorance about the world and facilitating his <br/>\nexploration he knows a word, a way of thinking, an idea stream that I didn&#39;t <br/>\nknow. That isn&#39;t watching TV and playing video games all day, that&#39;s thinking <br/>\nand listening and discussing and exploring. Sometimes that&#39;s with a companion <br/>\nand sometimes that is lying in bed at night turning over ideas in their own <br/>\nheads, their minds that are filled with at least as much curiousity as my own. <br/>\nWho am I to limit their relationship to the world to my understanding of &quot;own <br/>\ngood&quot;? <br/>\n<br/>\n<br/>\nAnd I&#39;m not post-modern about it, I don&#39;t believe that there is no judgement, <br/>\nbut I do believe that they are at least as capable of judging interest, <br/>\nengagement, joy in their learning as I am. They are at least as interested in <br/>\ntheir own world as I am. But I don&#39;t know how you help someone who is worried <br/>\nabout the future, who wants not so much a happy now as a successful sometime <br/>\ntime yet to come, to see that. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Stacey &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sibach@...\">sibach@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Thursday, 22 September, 2011 2:43:16<br/>\nSubject: [unschoolingbasics] Re: New and have a question<br/>\n<br/>\nThanks Meredith - and yes they come right out and ask &quot;what should I do? I tell <br/>\nthem they can quit in 3 or 4 years and then they cry which makes me want to cry. <br/>\nHow do I show them that this is for their own good&quot;. This is usually part of <br/>\nasking me directly what I do all day and how my kids learn ending with &quot;I could <br/>\nnever let mine do that cause all they would do is watch TV and play video <br/>\ngames&quot;. Sometimes I&#39;m cheeky and say &quot;yup that&#39;s what mine do&quot;. It shuts the <br/>\nconversation down, until yesterday when I had YET AGAIN this conversation <br/>\nbecause I&#39;m introduced to a whole new group of homeschoolers. I just became the <br/>\nbeaver leader for a homeschool Scout group. None are unschoolers. And they all <br/>\nasked this question in a room - it felt like I was being interviewed! But I <br/>\nsmiled and gave bits and pieces and ended with &quot;yup it&#39;s video games all day&quot; <br/>\nwhich some popped their mouths open, others laughed assuming I was joking...at <br/>\nthat moment my eight year old, Murdoch, walked into the room and asked if I had <br/>\na calculator on my phone, &quot;yes&quot;. I handed him the phone. I don&#39;t ask why because <br/>\nhe&#39;ll ask me another question if he needs my help but one mom asked him what he <br/>\nwas going to use it for, &quot;I can add the Fibonacci sequence to 144, but after <br/>\nthat I get bored and the calculator works faster&quot;. I have no idea why he was <br/>\ndoing that in a group of 6 to 8 year olds, but the women in the room then came <br/>\nto me one by one to ask if I was secretly teaching them and pretending to <br/>\nunschool. I have come to realize this will never end as long as we keep meeting <br/>\nnew people and with that I get to talk about my joyful abundant life. Lucky me! <br/>\nI appreciate some concrete responses to more in depth conversation I get into <br/>\nwith closer friends trying so hard to wrap their brain around this. You have all <br/>\nbe very very helpful!<br/>\n<br/>\nI can&#39;t wait to get to know y&#39;all better!<br/>\n<br/>\nWith Gratitude,<br/>\nStacey<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":308771928,"authorName":"Stacey","from":"&quot;Stacey&quot; &lt;sibach@...&gt;","profile":"stacey_ibach","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New and have a question","postDate":"1316655796","msgId":47326,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1ZTNyaytzb2k5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo1YmNhZytnMmxpQGVHcm91cHMuY29tPg=="},"prevInTopic":47322,"nextInTopic":47327,"prevInTime":47325,"nextInTime":47327,"topicId":47310,"numMessagesInTopic":0,"msgSnippet":"Thanks Meredith - and yes they come right out and ask what should I do? I tell them they can quit in 3 or 4 years and then they cry which makes me want to","messageBody":"<div id=\"ygrps-yiv-1710678695\">Thanks Meredith - and yes they come right out and ask &quot;what should I do? I tell them they can quit in 3 or 4 years and then they cry which makes me want to cry. How do I show them that this is for their own good&quot;. This is usually part of asking me directly what I do all day and how my kids learn ending with &quot;I could never let mine do that cause all they would do is watch TV and play video games&quot;. Sometimes I&#39;m cheeky and say &quot;yup that&#39;s what mine do&quot;. It shuts the conversation down, until yesterday when I had YET AGAIN this conversation because I&#39;m introduced to a whole new group of homeschoolers. I just became the beaver leader for a homeschool Scout group. None are unschoolers. And they all asked this question in a room - it felt like I was being interviewed! But I smiled and gave bits and pieces and ended with &quot;yup it&#39;s video games all day&quot; which some popped their mouths open, others laughed assuming I was joking...at that moment my eight year old, Murdoch, walked into the room and asked if I had a calculator on my phone, &quot;yes&quot;. I handed him the phone. I don&#39;t ask why because he&#39;ll ask me another question if he needs my help but one mom asked him what he was going to use it for, &quot;I can add the Fibonacci sequence to 144, but after that I get bored and the calculator works faster&quot;. I have no idea why he was doing that in a group of 6 to 8 year olds, but the women in the room then came to me one by one to ask if I was secretly teaching them and pretending to unschool. I have come to realize this will never end as long as we keep meeting new people and with that I get to talk about my joyful abundant life. Lucky me! I appreciate some concrete responses to more in depth conversation I get into with closer friends trying so hard to wrap their brain around this. You have all be very very helpful!<br/>\n<br/>\nI can&#39;t wait to get to know y&#39;all better!<br/>\n<br/>\nWith Gratitude,<br/>\nStacey</div>","specialLinks":[]},{"userId":308771928,"authorName":"Stacey","from":"&quot;Stacey&quot; &lt;sibach@...&gt;","profile":"stacey_ibach","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New and have a question","postDate":"1316654938","msgId":47327,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1ZTMwcSszNmVqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMTY1MDgxNjQuNjczMTQuWWFob29NYWlsUkNAd2ViODczMDcubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":47326,"nextInTopic":47328,"prevInTime":47326,"nextInTime":47328,"topicId":47310,"numMessagesInTopic":0,"msgSnippet":"Schuyler I had to read that a few times there is so much wisdom buried in there! Thank you. I remember reading blog conversations in Sandra s book from you.","messageBody":"<div id=\"ygrps-yiv-1180480266\">Schuyler I had to read that a few times there is so much wisdom buried in there! Thank you. I remember reading blog conversations in Sandra&#39;s book from you. Which I in turn read to my husband who would say &quot;duh - no kidding&quot;. It was then I realized I&#39;ve been married to an unschooler and didn&#39;t know it.<br/>\n<br/>\nStacey</div>","specialLinks":[]},{"userId":308771928,"authorName":"Stacey","from":"&quot;Stacey&quot; &lt;sibach@...&gt;","profile":"stacey_ibach","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New and have a question","postDate":"1316654742","msgId":47328,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1ZTJxbStiNzJvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDkxNDQ0RjcxNjE4MzQ2NjVCMDAxOUFCNDVBMEM2Q0M2QEx5bGFQQz4="},"prevInTopic":47327,"nextInTopic":47329,"prevInTime":47327,"nextInTime":47329,"topicId":47310,"numMessagesInTopic":0,"msgSnippet":"thank you Lyla - I have forwarded your blog to others as well with this question. Even those trying to move into more respectful ways of parenting but not","messageBody":"<div id=\"ygrps-yiv-1071718682\">thank you Lyla - I have forwarded your blog to others as well with this question. Even those trying to move into more respectful ways of parenting but not willing to let go of the piano lessons ;) That was brilliant!<br/>\n<br/>\nStacey</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New and have a question","postDate":"1316566160","msgId":47322,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1YmNhZytnMmxpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo1YmF0bytidGZqQGVHcm91cHMuY29tPg=="},"prevInTopic":47320,"nextInTopic":47326,"prevInTime":47321,"nextInTime":47323,"topicId":47310,"numMessagesInTopic":0,"msgSnippet":"Ack! sorry... laptop butterfingers! ... **************** You might want to rethink why you re asking those kinds of questions to begin with - have these other","messageBody":"<div id=\"ygrps-yiv-1557755593\">Ack! sorry... laptop butterfingers!<br/>\n<br/>\n&quot;Stacey&quot; &lt;sibach@&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;my question of &quot;why are you forcing them to play piano when they clearly don&#39;t want to?&quot; <br/>\n </span></blockquote>****************<br/>\n<br/>\nYou might want to rethink why you&#39;re asking those kinds of questions to begin with - have these other parents asked you for parenting advice? It may be better to resist the urge to engage other parents on topics on which you&#39;re likely to disagree. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;However, they see how relaxed and happy I am and I don&#39;t EVER complain about what my kids aren&#39;t doing and want the &quot;secret&quot;.<br/>\n </span></blockquote>****************<br/>\n<br/>\nTell them what you do as plainly as you can, without turning the question back on them - real life isn&#39;t like a radical unschooling discussion list ;) Likely, they still won&#39;t &quot;get it&quot; and think that there&#39;s something special about your kid. I know from personal experience, though, that something as simple as the idea that parents and kids can Like each other can stick with someone and act as a kind of burr under all that conventional &quot;wisdom&quot;. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New and have a question","postDate":"1316564728","msgId":47320,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1YmF0bytidGZqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo1OTdsYytxcHZmQGVHcm91cHMuY29tPg=="},"prevInTopic":47313,"nextInTopic":47322,"prevInTime":47319,"nextInTime":47321,"topicId":47310,"numMessagesInTopic":0,"msgSnippet":"Life is filled with hardship and they need to learn to push through things they don t necessarily want to do, but have to. How will they learn this skill if I","messageBody":"<div id=\"ygrps-yiv-247422227\">&quot;Life is filled with hardship and they need to learn to push through things they don&#39;t necessarily want to do, but have to. How will they learn this skill if I don&#39;t make them (insert forced activity here)&quot;.<br/>\n************<br/>\n<br/>\nVideo games. <br/>\nThat sounds flippant, but both my kids have struggled over various games, playing and replaying levels in order to get through them - or get a higher score. There have been tears more than once. Humans are wired for perseverence. <br/>\n<br/>\nPeople do difficult things because they value some aspect of that thing - the goal, maybe, or some by-product of the process. Both my kids have dealt with very difficult situations by choice and struggled through difficult things by choice. It&#39;s part of natural learning. <br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;&quot;Why press?&quot; I ask.<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Stacey&quot; &lt;sibach@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hello everyone! I&#39;m new to this list but have been unschooling for the past 3 years when my children let me (they are in a 1 day a week blended homeschool program because they wanted to &quot;try&quot; school this year). I have joined this group to help get through some family and friend hurdles I just can&#39;t noodle through.<br/>\n&gt; <br/>\n&gt; So I&#39;m going to start out the gate with a question. I&#39;m often faced with many questions and challenges about unschooling that I&#39;m well prepared to answer but this one: &quot;Life is filled with hardship and they need to learn to push through things they don&#39;t necessarily want to do, but have to. How will they learn this skill if I don&#39;t make them (insert forced activity here)&quot;.<br/>\n&gt; <br/>\n&gt; This is usually the response to my question of &quot;why are you forcing them to play piano when they clearly don&#39;t want to?&quot; which is usually after they are complaining about their children&#39;s resistance or they actually feel bad about pressing this issue. &quot;Why press?&quot; I ask. Regardless of the issue (piano, workbooks, chores, clean your plate blah, blah, blah) they all use this as a defense. I usually shrug because it&#39;s their issue and, well, I&#39;m not interested in convincing them otherwise. However, they see how relaxed and happy I am and I don&#39;t EVER complain about what my kids aren&#39;t doing and want the &quot;secret&quot;. Apparently &quot;stop making them do it&quot; is not the answer they are looking for.<br/>\n&gt; <br/>\n&gt; I would love some words of wisdom that seem to escape me in that moment. Any ideas? Something to make them stop and think, really think, that perhaps ASKING what their child would rather do in that moment and run with it, instead of saying &quot;you need to practice your piano first&quot; would offer a lifetime of good memories instead of something to add to their resume of miserable childhood &quot;have tos&quot;. How in that answer can I show them that offering choice is likely to encourage far greater skills then &quot;toughing it out&quot;.<br/>\n&gt; <br/>\n&gt; Thank you! And I&#39;m so happy to be here!<br/>\n&gt; Stacey (way up here in Alberta!)<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] New and have a question","postDate":"1316508164","msgId":47313,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTY1MDgxNjQuNjczMTQuWWFob29NYWlsUkNAd2ViODczMDcubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PGo1OTdsYytxcHZmQGVHcm91cHMuY29tPg==","referencesHeader":"PGo1OTdsYytxcHZmQGVHcm91cHMuY29tPg=="},"prevInTopic":47312,"nextInTopic":47320,"prevInTime":47312,"nextInTime":47314,"topicId":47310,"numMessagesInTopic":0,"msgSnippet":"I do lots of things that are probably not particularly pleasant and nobody forces me to and I didn t learn those things as a child. I do them because they are","messageBody":"<div id=\"ygrps-yiv-1620623248\">I do lots of things that are probably not particularly pleasant and nobody <br/>\nforces me to and I didn&#39;t learn those things as a child. I do them because they <br/>\nare a part of what I want to do, they are a part of how I want something to be. <br/>\nI am self-motivated to achieve something or have something be a certain way and <br/>\nI don&#39;t really notice the less than appealling aspects of whatever needs doing <br/>\nfor that end goal to come together. I&#39;m choosing. <br/>\n<br/>\n<br/>\nWhen someone forces another person to suffer for an end goal that is deemed good <br/>\nfor them why would they ever be dedicated to it? If someone forced me to walk <br/>\nthe dog every day or to trim the hedges or to learn the ukulele I would quickly <br/>\ncome to resent each of those tasks and the person forcing me to do it. I would <br/>\nhave no pride in my achievement, only a sense that what I had done only happened <br/>\nbecause someone else made me do it. I would own nothing of my effort, my skill, <br/>\nmy patience, my dedication. I would be a puppet in someone else&#39;s play. I would <br/>\nbe the good girl in someone else&#39;s eyes. <br/>\n<br/>\n<br/>\nLinnaea draws. She draws every day of late. She often asks for advice and when <br/>\nmy help or David&#39;s help doesn&#39;t give her what she needs she posts her drawings <br/>\non a forum where she&#39;s an active member and gets someone else to help her. She <br/>\nisn&#39;t working to anyone else&#39;s expectations. She&#39;s doing a lot of work to <br/>\nacquire a skill because she&#39;s interested in doing so, she&#39;s engaged by the <br/>\nprocess, by the challenge, by the ideas and not because someone else is telling <br/>\nher that this skill will come in handy at a later date. I&#39;ve watched Simon solve <br/>\nproblems in computer and video games from a very young age. We collaborated for <br/>\na long time, but because part of my engagement was about him, he&#39;s left me in <br/>\nthe dust. He can read a scene in a game so quickly that I have no idea what <br/>\nhappened. That&#39;s a huge set of skills. All acquired because of his interests, <br/>\nhis desires, his own motivation. My video gaming skills pale in comparison. My <br/>\ndedication to being a better gamer is nothing on his engagement. <br/>\n<br/>\n<br/>\nSo, how do you tell someone that quickly and without leaving them feeling bitter <br/>\nor angry? I don&#39;t know, maybe you ask them to remember something that they <br/>\nsuffered through as a child, ask if they ever skipped school; if they did all <br/>\ntheir homework; if they play piano at concert pianist level;  if they are all <br/>\nthat their parents wished that they were and if not is that alright? Pam <br/>\nSorooshian told a story of going to a concert with a guest conductor who asked <br/>\nthe orchestra to raise their hands if their parents had forced them to practice <br/>\ntheir instruments, only two members of the orchestra raised their hands. Maybe <br/>\nthat&#39;s the story you can tell. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Stacey &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sibach@...\">sibach@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Tuesday, 20 September, 2011 6:17:32<br/>\nSubject: [unschoolingbasics] New and have a question<br/>\n<br/>\nHello everyone! I&#39;m new to this list but have been unschooling for the past 3 <br/>\nyears when my children let me (they are in a 1 day a week blended homeschool <br/>\nprogram because they wanted to &quot;try&quot; school this year). I have joined this group <br/>\nto help get through some family and friend hurdles I just can&#39;t noodle through.<br/>\n<br/>\nSo I&#39;m going to start out the gate with a question. I&#39;m often faced with many <br/>\nquestions and challenges about unschooling that I&#39;m well prepared to answer but <br/>\nthis one: &quot;Life is filled with hardship and they need to learn to push through <br/>\nthings they don&#39;t necessarily want to do, but have to. How will they learn this <br/>\nskill if I don&#39;t make them (insert forced activity here)&quot;.<br/>\n<br/>\nThis is usually the response to my question of &quot;why are you forcing them to play <br/>\npiano when they clearly don&#39;t want to?&quot; which is usually after they are <br/>\ncomplaining about their children&#39;s resistance or they actually feel bad about <br/>\npressing this issue. &quot;Why press?&quot; I ask. Regardless of the issue (piano, <br/>\nworkbooks, chores, clean your plate blah, blah, blah) they all use this as a <br/>\ndefense. I usually shrug because it&#39;s their issue and, well, I&#39;m not interested <br/>\nin convincing them otherwise. However, they see how relaxed and happy I am and I <br/>\ndon&#39;t EVER complain about what my kids aren&#39;t doing and want the &quot;secret&quot;. <br/>\nApparently &quot;stop making them do it&quot; is not the answer they are looking for.<br/>\n<br/>\nI would love some words of wisdom that seem to escape me in that moment. Any <br/>\nideas? Something to make them stop and think, really think, that perhaps ASKING <br/>\nwhat their child would rather do in that moment and run with it, instead of <br/>\nsaying &quot;you need to practice your piano first&quot; would offer a lifetime of good <br/>\nmemories instead of something to add to their resume of miserable childhood <br/>\n&quot;have tos&quot;. How in that answer can I show them that offering choice is likely to <br/>\nencourage far greater skills then &quot;toughing it out&quot;.<br/>\n<br/>\nThank you! And I&#39;m so happy to be here!<br/>\nStacey (way up here in Alberta!)<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"lylaw","from":"&quot;lylaw&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] New and have a question","postDate":"1316505755","msgId":47312,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkxNDQ0RjcxNjE4MzQ2NjVCMDAxOUFCNDVBMEM2Q0M2QEx5bGFQQz4=","inReplyToHeader":"PGo1OTdsYytxcHZmQGVHcm91cHMuY29tPg==","referencesHeader":"PGo1OTdsYytxcHZmQGVHcm91cHMuY29tPg=="},"prevInTopic":47310,"nextInTopic":47313,"prevInTime":47311,"nextInTime":47313,"topicId":47310,"numMessagesInTopic":0,"msgSnippet":"I wrote a blog post on this topic a while back that might be useful... http://lylawolf.blogspot.com/2011/03/real-costs-of-parental-pressure.html lyla [Non-text","messageBody":"<div id=\"ygrps-yiv-1822188370\">I wrote a blog post on this topic a while back that might be useful...<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://lylawolf.blogspot.com/2011/03/real-costs-of-parental-pressure.html\">http://lylawolf.blogspot.com/2011/03/real-costs-of-parental-pressure.html</a><br/>\nlyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":308771928,"authorName":"Stacey","from":"&quot;Stacey&quot; &lt;sibach@...&gt;","profile":"stacey_ibach","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"New and have a question","postDate":"1316495852","msgId":47310,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1OTdsYytxcHZmQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":47312,"prevInTime":47309,"nextInTime":47311,"topicId":47310,"numMessagesInTopic":0,"msgSnippet":"Hello everyone! I m new to this list but have been unschooling for the past 3 years when my children let me (they are in a 1 day a week blended homeschool","messageBody":"<div id=\"ygrps-yiv-580497939\">Hello everyone! I&#39;m new to this list but have been unschooling for the past 3 years when my children let me (they are in a 1 day a week blended homeschool program because they wanted to &quot;try&quot; school this year). I have joined this group to help get through some family and friend hurdles I just can&#39;t noodle through.<br/>\n<br/>\nSo I&#39;m going to start out the gate with a question. I&#39;m often faced with many questions and challenges about unschooling that I&#39;m well prepared to answer but this one: &quot;Life is filled with hardship and they need to learn to push through things they don&#39;t necessarily want to do, but have to. How will they learn this skill if I don&#39;t make them (insert forced activity here)&quot;.<br/>\n<br/>\nThis is usually the response to my question of &quot;why are you forcing them to play piano when they clearly don&#39;t want to?&quot; which is usually after they are complaining about their children&#39;s resistance or they actually feel bad about pressing this issue. &quot;Why press?&quot; I ask. Regardless of the issue (piano, workbooks, chores, clean your plate blah, blah, blah) they all use this as a defense. I usually shrug because it&#39;s their issue and, well, I&#39;m not interested in convincing them otherwise. However, they see how relaxed and happy I am and I don&#39;t EVER complain about what my kids aren&#39;t doing and want the &quot;secret&quot;. Apparently &quot;stop making them do it&quot; is not the answer they are looking for.<br/>\n<br/>\nI would love some words of wisdom that seem to escape me in that moment. Any ideas? Something to make them stop and think, really think, that perhaps ASKING what their child would rather do in that moment and run with it, instead of saying &quot;you need to practice your piano first&quot; would offer a lifetime of good memories instead of something to add to their resume of miserable childhood &quot;have tos&quot;. How in that answer can I show them that offering choice is likely to encourage far greater skills then &quot;toughing it out&quot;.<br/>\n<br/>\nThank you! And I&#39;m so happy to be here!<br/>\nStacey (way up here in Alberta!)</div>","specialLinks":[]}],"prevTopicId":47337,"nextTopicId":47414}}