{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":17,"messages":[{"userId":146052230,"authorName":"Sacha Davis","from":"&quot;Sacha Davis&quot; &lt;sacha@...&gt;","profile":"sacha_pie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Hospital situation","postDate":"1291324922","msgId":45354,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4NzUuMTI4Ljk1LjIzOC4yNDguMTI5MTMyNDkyMi5zcXVpcnJlbEB3ZWJtYWlsLmRyaXp6bGUuY29tPg==","inReplyToHeader":"PEFBTkxrVGltU0Q3RTF2Um1VY3Q2d0NfajBEZ05laC1wdTRVQndfNS16TlpaekBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrMEZ4dVVpNVZaWDlZYWRRbjdZLUVaMFl1PThVbzJDRm1ORGRCbkBtYWlsLmdtYWlsLmNvbT4gICAgPGljM3Y0MSsyanExQGVHcm91cHMuY29tPiAgICA8QUFOTGtUaW1TRDdFMXZSbVVjdDZ3Q19qMERnTmVoLXB1NFVCd181LXpOWlp6QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":45352,"nextInTopic":0,"prevInTime":45353,"nextInTime":45355,"topicId":45325,"numMessagesInTopic":0,"msgSnippet":"Thank you for sharing this - it was beautiful and such an example of thoughtful parenting. S. My son struggles with other people touching him and sensory","messageBody":"<div id=\"ygrps-yiv-2120298577\">Thank you for sharing this - it was beautiful and such an example of<br/>\nthoughtful parenting.<br/>\n<br/>\nS.<br/>\n<br/>\n<br/>\n My son struggles with other people touching him and sensory things.. it<br/>\n<blockquote><span title=\"qreply\"> &gt; can<br/>\n&gt; be such a hard thing when his particular barometer of sensitive is in<br/>\n&gt; conflict with my fears as a parent.  I use the wait and see approach a<br/>\n&gt; lot.<br/>\n&gt;  Pretty much all the time.  We talk about it all and foreshadow it all.<br/>\n&gt;  Only three times have I had to just leap into action or been in<br/>\n&gt; uncomfortable medical situations in the 5 years since he was born.<br/>\n&gt;<br/>\n&gt; At 15 months the docs thought he had leukemia.  He did not - he had a very<br/>\n&gt; rare aplastic crisis and fully recovered.  This was all discovered at the<br/>\n&gt; ER<br/>\n&gt; when we were in for a high fever and complications of a cold - we thought.<br/>\n&gt;  Similar to your post.  There were procedures etc.  (He had every marker<br/>\n&gt; in<br/>\n&gt; his blood etc - there was time sensitive information that was critically<br/>\n&gt; needed to figure out how to treat him.)  The ER folks kept saying they<br/>\n&gt; were<br/>\n&gt; going to do the initial procedure soon and wanted me not to breastfeed<br/>\n&gt; him.<br/>\n&gt;  He ended up hysterical because I had never in his life refused to nurse<br/>\n&gt; him.  I had to leave the room and could hear him screaming to his daddy<br/>\n&gt; from<br/>\n&gt; the waiting room that he needed his mama and to nurse.  I learned in that<br/>\n&gt; moment, that other people need to wait and any people pleasing tendency I<br/>\n&gt; had would be dominated by my mama bear.  I should have (and would any time<br/>\n&gt; after that) nursed him and made them wait the 3 hours for the test once it<br/>\n&gt; was clear it would be delayed.  He had no immune system and we had to go<br/>\n&gt; into isolation in the pediatric oncology dept.  Once admitted to the<br/>\n&gt; pediatric dept, I requested (and received without any push back) to have<br/>\n&gt; the<br/>\n&gt; crib removed and a bed to cosleep brought in, morning tests timed so that<br/>\n&gt; his breastfeeding would not be held off, let them know that I would be<br/>\n&gt; nursing him and if a test was delayed that we needed to work around his<br/>\n&gt; nursing needs etc...  I told him how sorry I was and how wrong I was to<br/>\n&gt; not<br/>\n&gt; honor his needs because of my own fear.  He was totally ok with all the<br/>\n&gt; other procedures etc because he nursed down and they had me laying in his<br/>\n&gt; bed as he woke from procedures.  We worked with the amazing team there to<br/>\n&gt; do<br/>\n&gt; things for him as wholly and completely as possible.  In the ER, I needed<br/>\n&gt; to<br/>\n&gt; be a more skilled and demanding advocate for him.<br/>\n&gt;<br/>\n&gt; Once was a febrile seizure when he was almost 3 and he was so freaked out<br/>\n&gt; by<br/>\n&gt; it and rather out of it, that he was fine about me rushing him in.  He<br/>\n&gt; just<br/>\n&gt; said he wanted his mommy with him.  It was also to his regular ped who he<br/>\n&gt; knew and trusted after years of gentle and child led exams etc.  That was<br/>\n&gt; easy enough.<br/>\n&gt;<br/>\n&gt; Finally, he fell and cut open his head earlier this year.  We are talking<br/>\n&gt; big flap of skin, down to the bone cut.  One look and I knew we would need<br/>\n&gt; stitches and that I did not have the skill to deal with this alone and<br/>\n&gt; needed help.  We talked through the entire process.  I was very clear with<br/>\n&gt; all the ER staff that minimal people and activity should be in his room<br/>\n&gt; and<br/>\n&gt; (in front of him) advocated for his desires with each person that came in<br/>\n&gt; the room as well as asking the doctor (repeatedly) to let my son know each<br/>\n&gt; and every step/touch before they happened.  (And apologizing to my son<br/>\n&gt; when<br/>\n&gt; they doctor forgot - he then stopped forgetting.)  At one point a nurse<br/>\n&gt; rushed in and turned on the super bright overhead light &quot;to help&quot; and my<br/>\n&gt; son<br/>\n&gt; had a sensory meltdown due to that intrusion, we waited until he was ready<br/>\n&gt; to proceed.  At this point, the doc was fully on board and was helping to<br/>\n&gt; keep the environment comfortable for my son.  My bub ended up with<br/>\n&gt; something<br/>\n&gt; like 7 stitches.  He screamed with each stitch (very very numbed with<br/>\n&gt; medication both internal and topical and only begun when he said to) and I<br/>\n&gt; asked him if he wanted to wait and stop.  He said no.  He said he just<br/>\n&gt; wanted to get it done and that it did not really hurt, but it was scary<br/>\n&gt; and<br/>\n&gt; he just needed to scream and he needed me to hold him and then he needed<br/>\n&gt; his<br/>\n&gt; daddy to get him 3 flavors of coconut milk ice cream.  I teared up at his<br/>\n&gt; amazing ability to articulate his needs and his trust that we would do<br/>\n&gt; everything we could to make it happen.  I would not have handled this<br/>\n&gt; situation as well as I did, had I not learned from our previous ER<br/>\n&gt; experience.<br/>\n&gt;<br/>\n&gt; So, you say your are sorry and you learn.  My kids know I am a flawed and<br/>\n&gt; imperfect human.  They also know that I am working to be the best person<br/>\n&gt; and<br/>\n&gt; mommy I can.  When I discover that I have made a choice based in fear or<br/>\n&gt; anger, then I say I am sorry and tell them that I made a poor choice from<br/>\n&gt; a<br/>\n&gt; place of fear, anger etc and tell them how I plan to work to make a<br/>\n&gt; different choice next time.  I think this gives them the freedom to be<br/>\n&gt; their<br/>\n&gt; own imperfect humans and know that the love here is unconditional.  Give<br/>\n&gt; them the greatest amount of voice they can have - ask for it, facilitate<br/>\n&gt; it<br/>\n&gt; etc.  Say your sorry when you don&#39;t protect them or listen when they are<br/>\n&gt; telling you their needs.  I think trust is a process and it is very rare<br/>\n&gt; for<br/>\n&gt; a single event to destroy it.  But, that does not mean that you do not<br/>\n&gt; have<br/>\n&gt; work to do to hear his feelings about this, honor his needs and feelings,<br/>\n&gt; help him choose how to proceed and acknowledge your role and the decisions<br/>\n&gt; that you are sorry for.  Not in a self judgmental way - self flagellation<br/>\n&gt; and guilt is not needed.  Just in an honest and open way.<br/>\n&gt;<br/>\n&gt; peace,<br/>\n&gt; kathryn<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On Thu, Nov 18, 2010 at 2:34 PM, Cara A &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:joeybiscuit@...\">joeybiscuit@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; Poor Tina!<br/>\n&gt;&gt;<br/>\n&gt;&gt; I totally understand freaking out and doing the wrong thing.<br/>\n&gt;&gt; I am learning the hard way about how I want to parent too.<br/>\n&gt;&gt;<br/>\n&gt;&gt; Faith nailed it by saying you need to apologize.<br/>\n&gt;&gt;<br/>\n&gt;&gt; We&#39;re still waiting out the &quot;foreskin not retracting&quot; thing with my 8<br/>\n&gt;&gt; year<br/>\n&gt;&gt; old, and I haven&#39;t even discussed it with him yet...&lt;sigh&gt;.<br/>\n&gt;&gt;<br/>\n&gt;&gt; This post will prompt me to discuss it today.<br/>\n&gt;&gt;<br/>\n&gt;&gt; Thanks for the reminder and good luck with that discussion!!!<br/>\n&gt;&gt;<br/>\n&gt;&gt; Cara<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; --- In<br/>\n&gt;&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&lt;unschoolingbasics%40yahoogroups.com&gt;,<br/>\n&gt;&gt; Tina Tarbutton &lt;tina.tarbutton@...&gt; wrote:<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; I know I handled this whole situation wrong, and at the time I knew I<br/>\n&gt;&gt; &gt; was handling it wrong, but I couldn&#39;t figure out another way to handle<br/>\n&gt;&gt; &gt; it and felt like it had to be done. So now I&#39;m opening up to you guys<br/>\n&gt;&gt; &gt; hoping someone can give me some better insights on how to handle it,<br/>\n&gt;&gt; &gt; if it occurs again.<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; I also plan to talk to my son tomorrow when we&#39;re a bit further from<br/>\n&gt;&gt; &gt; the situation to find out a better way to handle it.<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; My 10 y/o son Draven told me last night that he was having a hard time<br/>\n&gt;&gt; &gt; emptying his bladder, and that he felt a lot of pressure when he was<br/>\n&gt;&gt; &gt; urinating. I figured it was the beginning of a UTI and called the<br/>\n&gt;&gt; &gt; doctors office this morning. They said they don&#39;t have a way to do<br/>\n&gt;&gt; &gt; urinalysis there, and for us to just hit the ER because it would be<br/>\n&gt;&gt; &gt; quicker then them waiting for results.<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; So we get to the ER, everything is okay, he pees in a cup, they send<br/>\n&gt;&gt; &gt; it off, we get into the room and the doctor wants to have a quick look<br/>\n&gt;&gt; &gt; &quot;down there&quot;. Draven says no at first, but after I talked to him and<br/>\n&gt;&gt; &gt; explained it would be quick and fast and would just happen once<br/>\n&gt;&gt; &gt; (whoops, big mistake), he agreed, I turned my head, he covered his<br/>\n&gt;&gt; &gt; eyes, the doctor looked and said we&#39;d wait for the results from the<br/>\n&gt;&gt; &gt; urinalysis.<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; He comes back 30 minutes later with another doctor. Said the quick<br/>\n&gt;&gt; &gt; test of the urine was negative, but that he thought the opening to his<br/>\n&gt;&gt; &gt; urethra was too small for his age and wanted another opinion (from<br/>\n&gt;&gt; &gt; this other doctor). Draven went ballistic, no, mommy said once, you<br/>\n&gt;&gt; &gt; guys had your chance, you didn&#39;t figure it out, you&#39;re not looking<br/>\n&gt;&gt; &gt; again, no no no no no. I pulled the doctor aside and asked how big of<br/>\n&gt;&gt; &gt; an issue it was if it was too small and he asked me a few questions,<br/>\n&gt;&gt; &gt; all of which had an affirmative answer (he&#39;s always used the restroom<br/>\n&gt;&gt; &gt; a whole lot ever since he was first potty trained, we&#39;re constantly<br/>\n&gt;&gt; &gt; rushing to bathrooms, and he had accidents for long after he knew how<br/>\n&gt;&gt; &gt; to use the toilet). The doctor then told me this problem will get<br/>\n&gt;&gt; &gt; worse if the urethra opening is too small, and may in fact cause him<br/>\n&gt;&gt; &gt; more serious problems once he his puberty. So I got scared, wanted<br/>\n&gt;&gt; &gt; this taken care of and decided to put my foot down. This consisted of<br/>\n&gt;&gt; &gt; a nurse and I holding Draven down while they looked. The whole time<br/>\n&gt;&gt; &gt; him and I are both in tears, I know I&#39;ve screwed up, but I&#39;m worried<br/>\n&gt;&gt; &gt; about his health at this point.<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; That doctor says yes, something is wrong, we&#39;ll have the surgical team<br/>\n&gt;&gt; &gt; take a look if the long urinalysis comes back negative.<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; Draven curls into a ball and says (and I quote here) &quot;screw you all,<br/>\n&gt;&gt; &gt; not another person is touching me, it&#39;s time to go home&quot;.<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; I calm him down again and we take a walk outside so we can call his<br/>\n&gt;&gt; &gt; father (who lives 14 hours away) and maybe he can explain why this is<br/>\n&gt;&gt; &gt; so important. We also call my partner, his stepmom, so she can be<br/>\n&gt;&gt; &gt; there for moral support for both of us.<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; By the time we get back inside the urinalysis is back and negative.<br/>\n&gt;&gt; &gt; Draven won&#39;t let me touch him and won&#39;t talk to me, he all but cussed<br/>\n&gt;&gt; &gt; his dad out on the phone. I was expecting him to take off at any<br/>\n&gt;&gt; &gt; second and I couldn&#39;t figure out how to make him feel more in control<br/>\n&gt;&gt; &gt; while still protecting his health. I even asked the doctor if it was<br/>\n&gt;&gt; &gt; possible to either sedate him or give him something for anxiety to try<br/>\n&gt;&gt; &gt; and make this easier. They refused.<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; Surgical team comes in, it starts to look like it&#39;s going to be<br/>\n&gt;&gt; &gt; another hold him down situation, but at the last minute he says fine,<br/>\n&gt;&gt; &gt; whatever, just get it done. They look (all 3 of them, how freaking<br/>\n&gt;&gt; &gt; stupid) and all agree that he needs surgery to open it up more. It&#39;s<br/>\n&gt;&gt; &gt; not an emergency so I can call tomorrow to schedule the pre-op<br/>\n&gt;&gt; &gt; consult.<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; Draven went back to being curled in a ball, wouldn&#39;t talk to me for<br/>\n&gt;&gt; &gt; the rest of the time there, or the ride home and pulled away whenever<br/>\n&gt;&gt; &gt; I tried to touch him.<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; He asked to be dropped off at home while my partner and I went to the<br/>\n&gt;&gt; &gt; grocery store, we offered to have either of us stay with him, he said<br/>\n&gt;&gt; &gt; no he needed alone time.<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; By the time we got back from the quick shopping trip he was basically<br/>\n&gt;&gt; &gt; back to his normal self. He helped with the groceries, loved the<br/>\n&gt;&gt; &gt; little surprises (favorite foods) we got for him, joked and laughed<br/>\n&gt;&gt; &gt; around with us like nothing was wrong. He asked when he&#39;ll meet with<br/>\n&gt;&gt; &gt; the surgeons, I explained we needed to schedule it and asked if it was<br/>\n&gt;&gt; &gt; okay that I did that tomorrow, he said it&#39;s fine just to let him know<br/>\n&gt;&gt; &gt; what&#39;s happening.<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; He&#39;s made a few jokes about it, some which hurt my feelings (better<br/>\n&gt;&gt; &gt; not upset mom, she&#39;ll hold me down and let them get me), but I know<br/>\n&gt;&gt; &gt; it&#39;s his way of dealing with it. In the end, it mostly came out fine,<br/>\n&gt;&gt; &gt; however I know I destroyed quite a bit of the trust he has in me. I<br/>\n&gt;&gt; &gt; can&#39;t figure out how I could have handled today better that would have<br/>\n&gt;&gt; &gt; gotten this situation checked out, but still let him feel in control.<br/>\n&gt;&gt; &gt; I&#39;m at a loss.<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; Thanks for any insight.<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; Tina<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; --<br/>\n&gt; Nonviolence is absolute commitment to the way of love. Love is not<br/>\n&gt; emotional<br/>\n&gt; bash; it is not empty sentimentalism. It is the active outpouring of one&#39;s<br/>\n&gt; whole being into the being of another.<br/>\n&gt; --Martin Luther King, Jr. 1957<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":235865494,"authorName":"kmlewpea","from":"kmlewpea &lt;kmlewpea@...&gt;","profile":"burdiegirltoo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Hospital situation","postDate":"1291313850","msgId":45352,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGltU0Q3RTF2Um1VY3Q2d0NfajBEZ05laC1wdTRVQndfNS16TlpaekBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGljM3Y0MSsyanExQGVHcm91cHMuY29tPg==","referencesHeader":"PEFBTkxrVGlrMEZ4dVVpNVZaWDlZYWRRbjdZLUVaMFl1PThVbzJDRm1ORGRCbkBtYWlsLmdtYWlsLmNvbT4gPGljM3Y0MSsyanExQGVHcm91cHMuY29tPg=="},"prevInTopic":45348,"nextInTopic":45354,"prevInTime":45351,"nextInTime":45353,"topicId":45325,"numMessagesInTopic":0,"msgSnippet":"My son struggles with other people touching him and sensory things.. it can be such a hard thing when his particular barometer of sensitive is in conflict with","messageBody":"<div id=\"ygrps-yiv-920585367\">My son struggles with other people touching him and sensory things.. it can<br/>\nbe such a hard thing when his particular barometer of sensitive is in<br/>\nconflict with my fears as a parent.  I use the wait and see approach a lot.<br/>\n Pretty much all the time.  We talk about it all and foreshadow it all.<br/>\n Only three times have I had to just leap into action or been in<br/>\nuncomfortable medical situations in the 5 years since he was born.<br/>\n<br/>\nAt 15 months the docs thought he had leukemia.  He did not - he had a very<br/>\nrare aplastic crisis and fully recovered.  This was all discovered at the ER<br/>\nwhen we were in for a high fever and complications of a cold - we thought.<br/>\n Similar to your post.  There were procedures etc.  (He had every marker in<br/>\nhis blood etc - there was time sensitive information that was critically<br/>\nneeded to figure out how to treat him.)  The ER folks kept saying they were<br/>\ngoing to do the initial procedure soon and wanted me not to breastfeed him.<br/>\n He ended up hysterical because I had never in his life refused to nurse<br/>\nhim.  I had to leave the room and could hear him screaming to his daddy from<br/>\nthe waiting room that he needed his mama and to nurse.  I learned in that<br/>\nmoment, that other people need to wait and any people pleasing tendency I<br/>\nhad would be dominated by my mama bear.  I should have (and would any time<br/>\nafter that) nursed him and made them wait the 3 hours for the test once it<br/>\nwas clear it would be delayed.  He had no immune system and we had to go<br/>\ninto isolation in the pediatric oncology dept.  Once admitted to the<br/>\npediatric dept, I requested (and received without any push back) to have the<br/>\ncrib removed and a bed to cosleep brought in, morning tests timed so that<br/>\nhis breastfeeding would not be held off, let them know that I would be<br/>\nnursing him and if a test was delayed that we needed to work around his<br/>\nnursing needs etc...  I told him how sorry I was and how wrong I was to not<br/>\nhonor his needs because of my own fear.  He was totally ok with all the<br/>\nother procedures etc because he nursed down and they had me laying in his<br/>\nbed as he woke from procedures.  We worked with the amazing team there to do<br/>\nthings for him as wholly and completely as possible.  In the ER, I needed to<br/>\nbe a more skilled and demanding advocate for him.<br/>\n<br/>\nOnce was a febrile seizure when he was almost 3 and he was so freaked out by<br/>\nit and rather out of it, that he was fine about me rushing him in.  He just<br/>\nsaid he wanted his mommy with him.  It was also to his regular ped who he<br/>\nknew and trusted after years of gentle and child led exams etc.  That was<br/>\neasy enough.<br/>\n<br/>\nFinally, he fell and cut open his head earlier this year.  We are talking<br/>\nbig flap of skin, down to the bone cut.  One look and I knew we would need<br/>\nstitches and that I did not have the skill to deal with this alone and<br/>\nneeded help.  We talked through the entire process.  I was very clear with<br/>\nall the ER staff that minimal people and activity should be in his room and<br/>\n(in front of him) advocated for his desires with each person that came in<br/>\nthe room as well as asking the doctor (repeatedly) to let my son know each<br/>\nand every step/touch before they happened.  (And apologizing to my son when<br/>\nthey doctor forgot - he then stopped forgetting.)  At one point a nurse<br/>\nrushed in and turned on the super bright overhead light &quot;to help&quot; and my son<br/>\nhad a sensory meltdown due to that intrusion, we waited until he was ready<br/>\nto proceed.  At this point, the doc was fully on board and was helping to<br/>\nkeep the environment comfortable for my son.  My bub ended up with something<br/>\nlike 7 stitches.  He screamed with each stitch (very very numbed with<br/>\nmedication both internal and topical and only begun when he said to) and I<br/>\nasked him if he wanted to wait and stop.  He said no.  He said he just<br/>\nwanted to get it done and that it did not really hurt, but it was scary and<br/>\nhe just needed to scream and he needed me to hold him and then he needed his<br/>\ndaddy to get him 3 flavors of coconut milk ice cream.  I teared up at his<br/>\namazing ability to articulate his needs and his trust that we would do<br/>\neverything we could to make it happen.  I would not have handled this<br/>\nsituation as well as I did, had I not learned from our previous ER<br/>\nexperience.<br/>\n<br/>\nSo, you say your are sorry and you learn.  My kids know I am a flawed and<br/>\nimperfect human.  They also know that I am working to be the best person and<br/>\nmommy I can.  When I discover that I have made a choice based in fear or<br/>\nanger, then I say I am sorry and tell them that I made a poor choice from a<br/>\nplace of fear, anger etc and tell them how I plan to work to make a<br/>\ndifferent choice next time.  I think this gives them the freedom to be their<br/>\nown imperfect humans and know that the love here is unconditional.  Give<br/>\nthem the greatest amount of voice they can have - ask for it, facilitate it<br/>\netc.  Say your sorry when you don&#39;t protect them or listen when they are<br/>\ntelling you their needs.  I think trust is a process and it is very rare for<br/>\na single event to destroy it.  But, that does not mean that you do not have<br/>\nwork to do to hear his feelings about this, honor his needs and feelings,<br/>\nhelp him choose how to proceed and acknowledge your role and the decisions<br/>\nthat you are sorry for.  Not in a self judgmental way - self flagellation<br/>\nand guilt is not needed.  Just in an honest and open way.<br/>\n<br/>\npeace,<br/>\nkathryn<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Nov 18, 2010 at 2:34 PM, Cara A &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:joeybiscuit@...\">joeybiscuit@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Poor Tina!<br/>\n&gt;<br/>\n&gt; I totally understand freaking out and doing the wrong thing.<br/>\n&gt; I am learning the hard way about how I want to parent too.<br/>\n&gt;<br/>\n&gt; Faith nailed it by saying you need to apologize.<br/>\n&gt;<br/>\n&gt; We&#39;re still waiting out the &quot;foreskin not retracting&quot; thing with my 8 year<br/>\n&gt; old, and I haven&#39;t even discussed it with him yet...&lt;sigh&gt;.<br/>\n&gt;<br/>\n&gt; This post will prompt me to discuss it today.<br/>\n&gt;<br/>\n&gt; Thanks for the reminder and good luck with that discussion!!!<br/>\n&gt;<br/>\n&gt; Cara<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&lt;unschoolingbasics%40yahoogroups.com&gt;,<br/>\n&gt; Tina Tarbutton &lt;tina.tarbutton@...&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; I know I handled this whole situation wrong, and at the time I knew I<br/>\n&gt; &gt; was handling it wrong, but I couldn&#39;t figure out another way to handle<br/>\n&gt; &gt; it and felt like it had to be done. So now I&#39;m opening up to you guys<br/>\n&gt; &gt; hoping someone can give me some better insights on how to handle it,<br/>\n&gt; &gt; if it occurs again.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I also plan to talk to my son tomorrow when we&#39;re a bit further from<br/>\n&gt; &gt; the situation to find out a better way to handle it.<br/>\n&gt; &gt;<br/>\n&gt; &gt; My 10 y/o son Draven told me last night that he was having a hard time<br/>\n&gt; &gt; emptying his bladder, and that he felt a lot of pressure when he was<br/>\n&gt; &gt; urinating. I figured it was the beginning of a UTI and called the<br/>\n&gt; &gt; doctors office this morning. They said they don&#39;t have a way to do<br/>\n&gt; &gt; urinalysis there, and for us to just hit the ER because it would be<br/>\n&gt; &gt; quicker then them waiting for results.<br/>\n&gt; &gt;<br/>\n&gt; &gt; So we get to the ER, everything is okay, he pees in a cup, they send<br/>\n&gt; &gt; it off, we get into the room and the doctor wants to have a quick look<br/>\n&gt; &gt; &quot;down there&quot;. Draven says no at first, but after I talked to him and<br/>\n&gt; &gt; explained it would be quick and fast and would just happen once<br/>\n&gt; &gt; (whoops, big mistake), he agreed, I turned my head, he covered his<br/>\n&gt; &gt; eyes, the doctor looked and said we&#39;d wait for the results from the<br/>\n&gt; &gt; urinalysis.<br/>\n&gt; &gt;<br/>\n&gt; &gt; He comes back 30 minutes later with another doctor. Said the quick<br/>\n&gt; &gt; test of the urine was negative, but that he thought the opening to his<br/>\n&gt; &gt; urethra was too small for his age and wanted another opinion (from<br/>\n&gt; &gt; this other doctor). Draven went ballistic, no, mommy said once, you<br/>\n&gt; &gt; guys had your chance, you didn&#39;t figure it out, you&#39;re not looking<br/>\n&gt; &gt; again, no no no no no. I pulled the doctor aside and asked how big of<br/>\n&gt; &gt; an issue it was if it was too small and he asked me a few questions,<br/>\n&gt; &gt; all of which had an affirmative answer (he&#39;s always used the restroom<br/>\n&gt; &gt; a whole lot ever since he was first potty trained, we&#39;re constantly<br/>\n&gt; &gt; rushing to bathrooms, and he had accidents for long after he knew how<br/>\n&gt; &gt; to use the toilet). The doctor then told me this problem will get<br/>\n&gt; &gt; worse if the urethra opening is too small, and may in fact cause him<br/>\n&gt; &gt; more serious problems once he his puberty. So I got scared, wanted<br/>\n&gt; &gt; this taken care of and decided to put my foot down. This consisted of<br/>\n&gt; &gt; a nurse and I holding Draven down while they looked. The whole time<br/>\n&gt; &gt; him and I are both in tears, I know I&#39;ve screwed up, but I&#39;m worried<br/>\n&gt; &gt; about his health at this point.<br/>\n&gt; &gt;<br/>\n&gt; &gt; That doctor says yes, something is wrong, we&#39;ll have the surgical team<br/>\n&gt; &gt; take a look if the long urinalysis comes back negative.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Draven curls into a ball and says (and I quote here) &quot;screw you all,<br/>\n&gt; &gt; not another person is touching me, it&#39;s time to go home&quot;.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I calm him down again and we take a walk outside so we can call his<br/>\n&gt; &gt; father (who lives 14 hours away) and maybe he can explain why this is<br/>\n&gt; &gt; so important. We also call my partner, his stepmom, so she can be<br/>\n&gt; &gt; there for moral support for both of us.<br/>\n&gt; &gt;<br/>\n&gt; &gt; By the time we get back inside the urinalysis is back and negative.<br/>\n&gt; &gt; Draven won&#39;t let me touch him and won&#39;t talk to me, he all but cussed<br/>\n&gt; &gt; his dad out on the phone. I was expecting him to take off at any<br/>\n&gt; &gt; second and I couldn&#39;t figure out how to make him feel more in control<br/>\n&gt; &gt; while still protecting his health. I even asked the doctor if it was<br/>\n&gt; &gt; possible to either sedate him or give him something for anxiety to try<br/>\n&gt; &gt; and make this easier. They refused.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Surgical team comes in, it starts to look like it&#39;s going to be<br/>\n&gt; &gt; another hold him down situation, but at the last minute he says fine,<br/>\n&gt; &gt; whatever, just get it done. They look (all 3 of them, how freaking<br/>\n&gt; &gt; stupid) and all agree that he needs surgery to open it up more. It&#39;s<br/>\n&gt; &gt; not an emergency so I can call tomorrow to schedule the pre-op<br/>\n&gt; &gt; consult.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Draven went back to being curled in a ball, wouldn&#39;t talk to me for<br/>\n&gt; &gt; the rest of the time there, or the ride home and pulled away whenever<br/>\n&gt; &gt; I tried to touch him.<br/>\n&gt; &gt;<br/>\n&gt; &gt; He asked to be dropped off at home while my partner and I went to the<br/>\n&gt; &gt; grocery store, we offered to have either of us stay with him, he said<br/>\n&gt; &gt; no he needed alone time.<br/>\n&gt; &gt;<br/>\n&gt; &gt; By the time we got back from the quick shopping trip he was basically<br/>\n&gt; &gt; back to his normal self. He helped with the groceries, loved the<br/>\n&gt; &gt; little surprises (favorite foods) we got for him, joked and laughed<br/>\n&gt; &gt; around with us like nothing was wrong. He asked when he&#39;ll meet with<br/>\n&gt; &gt; the surgeons, I explained we needed to schedule it and asked if it was<br/>\n&gt; &gt; okay that I did that tomorrow, he said it&#39;s fine just to let him know<br/>\n&gt; &gt; what&#39;s happening.<br/>\n&gt; &gt;<br/>\n&gt; &gt; He&#39;s made a few jokes about it, some which hurt my feelings (better<br/>\n&gt; &gt; not upset mom, she&#39;ll hold me down and let them get me), but I know<br/>\n&gt; &gt; it&#39;s his way of dealing with it. In the end, it mostly came out fine,<br/>\n&gt; &gt; however I know I destroyed quite a bit of the trust he has in me. I<br/>\n&gt; &gt; can&#39;t figure out how I could have handled today better that would have<br/>\n&gt; &gt; gotten this situation checked out, but still let him feel in control.<br/>\n&gt; &gt; I&#39;m at a loss.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Thanks for any insight.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Tina<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nNonviolence is absolute commitment to the way of love. Love is not emotional<br/>\nbash; it is not empty sentimentalism. It is the active outpouring of one&#39;s<br/>\nwhole being into the being of another.<br/>\n--Martin Luther King, Jr. 1957<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":333388203,"authorName":"Rinelle","from":"&quot;Rinelle&quot; &lt;rinelle@...&gt;","profile":"rinelle2011","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Getting really concerned about food","postDate":"1290907780","msgId":45348,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA1MDcyOTM5QUE5MTRGMjI5QjRGM0YyNUYxNzE2RjQzQFRhbWFyYT4=","inReplyToHeader":"PDhDRDVDNThFMEE5RjQ1MS0xRTcwLTg3RjFAd2VibWFpbC1kMDcyLnN5c29wcy5hb2wuY29tPg==","referencesHeader":"PGljM3B0bytzcHN0QGVHcm91cHMuY29tPiA8OTZDMTVCOTg2N0M4NDBFMkJEQTZEMDc0ODFFRDc0NTRAVGFtYXJhPiA8OENENUM1OEUwQTlGNDUxLTFFNzAtODdGMUB3ZWJtYWlsLWQwNzIuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":45347,"nextInTopic":45352,"prevInTime":45347,"nextInTime":45349,"topicId":45325,"numMessagesInTopic":0,"msgSnippet":"Thanks for your replies.  I m feeling a little more relaxed about it today. I seem to go through periods of being really concerned, and then periods when I can","messageBody":"<div id=\"ygrps-yiv-1938505286\">Thanks for your replies.  I&#39;m feeling a little more relaxed about it today. <br/>\nI seem to go through periods of being really concerned, and then periods <br/>\nwhen I can deal with it OK, and realise that it&#39;s probably temporary.<br/>\n<br/>\nShe isn&#39;t into dips at all.  She will sometimes do dips into honey or jam, <br/>\nbut pretty much only bread.  She loves cooking, especially cooking computer <br/>\ngames, but making her own doesn&#39;t have any correlation to her eating it.<br/>\n<br/>\nShe has always been a very picky eater, and I can totally sympathise, <br/>\nbecause I am myself.  She basically won&#39;t eat anything mixed, anything with <br/>\nsauce (she makes her own pizza with no sauce and only bacon pices and <br/>\npineapple pieces on top, then will seperate them before she eats them pretty <br/>\nmuch!) or gravy or soups etc.  Once I tried making my own tomato sauce as an <br/>\nexperiment, and she tasted it, and hasn&#39;t eaten tomato sauce since, even <br/>\nthough I only buy it now.<br/>\n<br/>\nMy guess on why she likes the chips and rice cakes is that they&#39;re <br/>\nprocessed, and taste exactly the same every time s he has them, no <br/>\nsurprises.  It&#39;s only a guess though, and she&#39;s too young to really confirm <br/>\nit for me.  I only wish I had of known this years ago, and I possibly could <br/>\nhave helped her to be able to rely on other foods being the same!  We are <br/>\nslowly working on finding foods that are similar,  yet different, to the <br/>\nones she likes, and some days I realise that we&#39;re getting there.  I just <br/>\nneed to be patient I guess, and not panic. :)<br/>\n<br/>\nWith the sleep, I know we&#39;re not fully unschooling it yet.  I&#39;m trying to <br/>\nwork towards it, but right now, I&#39;m just not ready to take the risks that I <br/>\ncan see coming with fully letting go of a bedtime.  So far, she won&#39;t go to <br/>\nsleep unless she is in her room with the lights out, her white noise sound <br/>\non etc.  I do always stay with her until she&#39;s asleep, and we&#39;re reasonably <br/>\nflexible on bedtimes.  She won&#39;t fall asleep on the couch though, because <br/>\nshe just won&#39;t sit still long enough!  She will keep playing and running <br/>\naround and playing until she gets grumpy and starts screaming at everyone <br/>\nand crying.  I&#39;m hoping that as she gets older (and most importantly, a <br/>\nlittle self reliant so that DH and I can do something ourselves instead of <br/>\ncontinuously occupying her), that we can let up on bedtimes even more.<br/>\n<br/>\nTamara</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Getting really concerned about food","postDate":"1290869133","msgId":45347,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRDVDNThFMEE5RjQ1MS0xRTcwLTg3RjFAd2VibWFpbC1kMDcyLnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PDk2QzE1Qjk4NjdDODQwRTJCREE2RDA3NDgxRUQ3NDU0QFRhbWFyYT4=","referencesHeader":"PGljM3B0bytzcHN0QGVHcm91cHMuY29tPiA8OTZDMTVCOTg2N0M4NDBFMkJEQTZEMDc0ODFFRDc0NTRAVGFtYXJhPg=="},"prevInTopic":45346,"nextInTopic":45348,"prevInTime":45346,"nextInTime":45348,"topicId":45325,"numMessagesInTopic":0,"msgSnippet":"When I was three, I ate ONLY Rice Krispies cereal. For seven months. I m fine.  Often kids will eat 1) things that they make themselves and 2) things that","messageBody":"<div id=\"ygrps-yiv-1216406903\">When I was three, I ate ONLY Rice Krispies cereal. For seven months. I&#39;m fine. &lt;g&gt;<br/>\n<br/>\n<br/>\nOften kids will eat 1) things that they make themselves and 2) things that can be dipped.<br/>\n<br/>\n<br/>\n<br/>\nMaybe french fry your own vegies---like shaved sweet potatoes, shaved zucchini, shaved carrots, tiny broccoli florets. (Put the carrots, zucchini and sweet potatoes in ice water first: they&#39;ll curl!) Let her help. Serve them with a sauce---like bbq or ranch or bleu cheese. Make sure they are things *you* would eat, so that you *will* eat them when she refuses. I wouldn&#39;t make a big deal out of it---just let her help make them for *you*. <br/>\n<br/>\n<br/>\nMake fondue (two birds here too, making and dipping). Meat, cheese, and chocolate/dessert are all fun! <br/>\n<br/>\n<br/>\nMake mini sandwiches---Pepperidge Farm makes a thin, thin bread---and cut them out with cookie cutters. Maybe use a panini maker or make grilled cheese sandwiches.<br/>\n<br/>\n<br/>\nMake your own puffed rice cakes. There are tons of recipes online. Add things she suggests for fun.<br/>\n<br/>\n<br/>\nIt sounds as if it *could* be the crunchiness/crispness she prefers now---find/make crunchier things.<br/>\n<br/>\n<br/>\nAs for sleep: if you don&#39;t/won&#39;t let her get up again, she&#39;s probably avoiding GOing to bed. I&#39;d be willing to get back up with her. Or let her fall asleep beside you on the sofa. She&#39;s still little enough to carry to bed.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Rinelle &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rinelle@...\">rinelle@...</a>&gt;<br/>\n<br/>\n<br/>\nMy daughter is six, and I&#39;m beginning to be really concerned about her food <br/>\nchoices.  She is pretty much living on rice wheels (flavoured rice cakes, so <br/>\npuffed rice), and hot potato chips/fries.  That is about all she wants to <br/>\neat (other than some ice cream, chocolate and lollies thrown in there), and <br/>\nI&#39;m really feeling like it&#39;s not meeting her body&#39;s needs at this point, but <br/>\nI really don&#39;t know how to help her, or what to do.  She will eat 3-4 <br/>\npackets of rice wheels a day (they are quite small packets), and 2-3 <br/>\nservings of chips (or chip like products, like hash browns etc) a day.  She <br/>\nwill only pick at dinner (vegetables and a meat serving usually), and will <br/>\nsample fruit if it&#39;s offered.  I did try getting a multivitamin, thinking <br/>\nthat would allay some of my concerns (and DH&#39;s), but she won&#39;t eat it.<br/>\n<br/>\nShe&#39;s complaining about being tired a lot lately, and I&#39;m not sure if it&#39;s <br/>\nthe food, or possibly the lack of sleep (she hates sleeping, and will say <br/>\n&quot;I&#39;m tired,&quot; then &quot;I don&#39;t want to go to bed&quot; in the same sentence.  She <br/>\nwill ask to go to bed, then once we&#39;re in there, want to get straight back <br/>\nup again  (which I have to admit, we don&#39;t do).<br/>\n<br/>\nI don&#39;t know how to help her.  I don&#39;t want to be pushy about food, but it <br/>\njust seems that we&#39;re not getting to the point where she will choose any <br/>\nfoods other than the ones mentioned above.  She used to eat a lot of <br/>\nsandwiches, and a huge plate of fruit, and most of her dinner, but since <br/>\nwe&#39;ve dropped the controls on food (which weren&#39;t really that extreme, more <br/>\njust not having that kind of food in the house) about 4 months ago or so, <br/>\nthis is all we&#39;re seeing.<br/>\n<br/>\nFunnily enough, I&#39;m not in the least worried about her eating <br/>\nlollies/chocolate, because she seems to have a really good sense of when <br/>\nshe&#39;s had enough, and will often stop eating half way through a chocolate <br/>\nbar etc, saying she doesn&#39;t want the rest.  Why is she like this with other <br/>\ntypes of food?<br/>\n<br/>\nI&#39;d love to hear any advice on how to get her eating a bit better.  I don&#39;t <br/>\nreally mind how many chips etc she eats, just so long as she&#39;s eating <br/>\nsomething else as well!<br/>\n<br/>\nTamara <br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":240002389,"authorName":"Andrea Catalano","from":"Andrea Catalano &lt;fennel1001@...&gt;","profile":"fennel1001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Getting really concerned about food","postDate":"1290825230","msgId":45346,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2MTAyNy40NTQ4Ny5xbUB3ZWI1NTAwMi5tYWlsLnJlNC55YWhvby5jb20+"},"prevInTopic":45345,"nextInTopic":45347,"prevInTime":45345,"nextInTime":45347,"topicId":45325,"numMessagesInTopic":0,"msgSnippet":"Hi Tamara, About sleep -- she says she s tired but doesn t want to go to bed. Can you help her get comfortable on the couch with covers, a pillow and you with","messageBody":"<div id=\"ygrps-yiv-84162190\">Hi Tamara, About sleep -- she says she&#39;s tired but doesn&#39;t want to go to bed. Can you help her get comfortable on the couch with covers, a pillow and you with her or nearby? She just might not like being alone in bed. If she lies down on the couch with lights low while you read a book (to yourself) or have the tv on a quiet channel with volume low, she will probably fall asleep on the couch if she&#39;s tired.  She can be carried to her bed later. <br/>\n<br/>\nandrea <br/>\n<br/>\nSent from my iPhone</div>","specialLinks":[]},{"userId":333388203,"authorName":"Rinelle","from":"&quot;Rinelle&quot; &lt;rinelle@...&gt;","profile":"rinelle2011","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Getting really concerned about food","postDate":"1290734387","msgId":45345,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2QzE1Qjk4NjdDODQwRTJCREE2RDA3NDgxRUQ3NDU0QFRhbWFyYT4=","inReplyToHeader":"PGljM3B0bytzcHN0QGVHcm91cHMuY29tPg==","referencesHeader":"PGljM3B0bytzcHN0QGVHcm91cHMuY29tPg=="},"prevInTopic":45339,"nextInTopic":45346,"prevInTime":45344,"nextInTime":45346,"topicId":45325,"numMessagesInTopic":0,"msgSnippet":"My daughter is six, and I m beginning to be really concerned about her food choices.  She is pretty much living on rice wheels (flavoured rice cakes, so puffed","messageBody":"<div id=\"ygrps-yiv-214426615\">My daughter is six, and I&#39;m beginning to be really concerned about her food <br/>\nchoices.  She is pretty much living on rice wheels (flavoured rice cakes, so <br/>\npuffed rice), and hot potato chips/fries.  That is about all she wants to <br/>\neat (other than some ice cream, chocolate and lollies thrown in there), and <br/>\nI&#39;m really feeling like it&#39;s not meeting her body&#39;s needs at this point, but <br/>\nI really don&#39;t know how to help her, or what to do.  She will eat 3-4 <br/>\npackets of rice wheels a day (they are quite small packets), and 2-3 <br/>\nservings of chips (or chip like products, like hash browns etc) a day.  She <br/>\nwill only pick at dinner (vegetables and a meat serving usually), and will <br/>\nsample fruit if it&#39;s offered.  I did try getting a multivitamin, thinking <br/>\nthat would allay some of my concerns (and DH&#39;s), but she won&#39;t eat it.<br/>\n<br/>\nShe&#39;s complaining about being tired a lot lately, and I&#39;m not sure if it&#39;s <br/>\nthe food, or possibly the lack of sleep (she hates sleeping, and will say <br/>\n&quot;I&#39;m tired,&quot; then &quot;I don&#39;t want to go to bed&quot; in the same sentence.  She <br/>\nwill ask to go to bed, then once we&#39;re in there, want to get straight back <br/>\nup again  (which I have to admit, we don&#39;t do).<br/>\n<br/>\nI don&#39;t know how to help her.  I don&#39;t want to be pushy about food, but it <br/>\njust seems that we&#39;re not getting to the point where she will choose any <br/>\nfoods other than the ones mentioned above.  She used to eat a lot of <br/>\nsandwiches, and a huge plate of fruit, and most of her dinner, but since <br/>\nwe&#39;ve dropped the controls on food (which weren&#39;t really that extreme, more <br/>\njust not having that kind of food in the house) about 4 months ago or so, <br/>\nthis is all we&#39;re seeing.<br/>\n<br/>\nFunnily enough, I&#39;m not in the least worried about her eating <br/>\nlollies/chocolate, because she seems to have a really good sense of when <br/>\nshe&#39;s had enough, and will often stop eating half way through a chocolate <br/>\nbar etc, saying she doesn&#39;t want the rest.  Why is she like this with other <br/>\ntypes of food?<br/>\n<br/>\nI&#39;d love to hear any advice on how to get her eating a bit better.  I don&#39;t <br/>\nreally mind how many chips etc she eats, just so long as she&#39;s eating <br/>\nsomething else as well!<br/>\n<br/>\nTamara</div>","specialLinks":[]},{"userId":10159702,"authorName":"Cara A","from":"&quot;Cara A&quot; &lt;joeybiscuit@...&gt;","profile":"joeybiscuit","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Hospital situation","postDate":"1290108865","msgId":45339,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGljM3Y0MSsyanExQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGlrMEZ4dVVpNVZaWDlZYWRRbjdZLUVaMFl1PThVbzJDRm1ORGRCbkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":45338,"nextInTopic":45345,"prevInTime":45338,"nextInTime":45340,"topicId":45325,"numMessagesInTopic":0,"msgSnippet":"Poor Tina! I totally understand freaking out and doing the wrong thing. I am learning the hard way about how I want to parent too. Faith nailed it by saying","messageBody":"<div id=\"ygrps-yiv-550097133\">Poor Tina!<br/>\n<br/>\nI totally understand freaking out and doing the wrong thing.<br/>\nI am learning the hard way about how I want to parent too.<br/>\n<br/>\nFaith nailed it by saying you need to apologize.<br/>\n<br/>\nWe&#39;re still waiting out the &quot;foreskin not retracting&quot; thing with my 8 year old, and I haven&#39;t even discussed it with him yet...&lt;sigh&gt;.<br/>\n<br/>\nThis post will prompt me to discuss it today.<br/>\n<br/>\nThanks for the reminder and good luck with that discussion!!!<br/>\n<br/>\nCara<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Tina Tarbutton &lt;tina.tarbutton@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I know I handled this whole situation wrong, and at the time I knew I<br/>\n&gt; was handling it wrong, but I couldn&#39;t figure out another way to handle<br/>\n&gt; it and felt like it had to be done.  So now I&#39;m opening up to you guys<br/>\n&gt; hoping someone can give me some better insights on how to handle it,<br/>\n&gt; if it occurs again.<br/>\n&gt; <br/>\n&gt; I also plan to talk to my son tomorrow when we&#39;re a bit further from<br/>\n&gt; the situation to find out a better way to handle it.<br/>\n&gt; <br/>\n&gt; My 10 y/o son Draven told me last night that he was having a hard time<br/>\n&gt; emptying his bladder, and that he felt a lot of pressure when he was<br/>\n&gt; urinating.  I figured it was the beginning of a UTI and called the<br/>\n&gt; doctors office this morning.  They said they don&#39;t have a way to do<br/>\n&gt; urinalysis there, and for us to just hit the ER because it would be<br/>\n&gt; quicker then them waiting for results.<br/>\n&gt; <br/>\n&gt; So we get to the ER, everything is okay, he pees in a cup, they send<br/>\n&gt; it off, we get into the room and the doctor wants to have a quick look<br/>\n&gt; &quot;down there&quot;.  Draven says no at first, but after I talked to him and<br/>\n&gt; explained it would be quick and fast and would just happen once<br/>\n&gt; (whoops, big mistake), he agreed, I turned my head, he covered his<br/>\n&gt; eyes, the doctor looked and said we&#39;d wait for the results from the<br/>\n&gt; urinalysis.<br/>\n&gt; <br/>\n&gt; He comes back 30 minutes later with another doctor.  Said the quick<br/>\n&gt; test of the urine was negative, but that he thought the opening to his<br/>\n&gt; urethra was too small for his age and wanted another opinion (from<br/>\n&gt; this other doctor).  Draven went ballistic, no, mommy said once, you<br/>\n&gt; guys had your chance, you didn&#39;t figure it out, you&#39;re not looking<br/>\n&gt; again, no no no no no.  I pulled the doctor aside and asked how big of<br/>\n&gt; an issue it was if it was too small and he asked me a few questions,<br/>\n&gt; all of which had an affirmative answer (he&#39;s always used the restroom<br/>\n&gt; a whole lot ever since he was first potty trained, we&#39;re constantly<br/>\n&gt; rushing to bathrooms, and he had accidents for long after he knew how<br/>\n&gt; to use the toilet).  The doctor then told me this problem will get<br/>\n&gt; worse if the urethra opening is too small, and may in fact cause him<br/>\n&gt; more serious problems once he his puberty.  So I got scared, wanted<br/>\n&gt; this taken care of and decided to put my foot down.  This consisted of<br/>\n&gt; a nurse and I holding Draven down while they looked.  The whole time<br/>\n&gt; him and I are both in tears, I know I&#39;ve screwed up, but I&#39;m worried<br/>\n&gt; about his health at this point.<br/>\n&gt; <br/>\n&gt; That doctor says yes, something is wrong, we&#39;ll have the surgical team<br/>\n&gt; take a look if the long urinalysis comes back negative.<br/>\n&gt; <br/>\n&gt; Draven curls into a ball and says (and I quote here) &quot;screw you all,<br/>\n&gt; not another person is touching me, it&#39;s time to go home&quot;.<br/>\n&gt; <br/>\n&gt; I calm him down again and we take a walk outside so we can call his<br/>\n&gt; father (who lives 14 hours away) and maybe he can explain why this is<br/>\n&gt; so important.  We also call my partner, his stepmom, so she can be<br/>\n&gt; there for moral support for both of us.<br/>\n&gt; <br/>\n&gt; By the time we get back inside the urinalysis is back and negative.<br/>\n&gt; Draven won&#39;t let me touch him and won&#39;t talk to me, he all but cussed<br/>\n&gt; his dad out on the phone.  I was expecting him to take off at any<br/>\n&gt; second and I couldn&#39;t figure out how to make him feel more in control<br/>\n&gt; while still protecting his health.  I even asked the doctor if it was<br/>\n&gt; possible to either sedate him or give him something for anxiety to try<br/>\n&gt; and make this easier.  They refused.<br/>\n&gt; <br/>\n&gt; Surgical team comes in, it starts to look like it&#39;s going to be<br/>\n&gt; another hold him down situation, but at the last minute he says fine,<br/>\n&gt; whatever, just get it done.  They look (all 3 of them, how freaking<br/>\n&gt; stupid) and all agree that he needs surgery to open it up more.  It&#39;s<br/>\n&gt; not an emergency so I can call tomorrow to schedule the pre-op<br/>\n&gt; consult.<br/>\n&gt; <br/>\n&gt; Draven went back to being curled in a ball, wouldn&#39;t talk to me for<br/>\n&gt; the rest of the time there, or the ride home and pulled away whenever<br/>\n&gt; I tried to touch him.<br/>\n&gt; <br/>\n&gt; He asked to be dropped off at home while my partner and I went to the<br/>\n&gt; grocery store, we offered to have either of us stay with him, he said<br/>\n&gt; no he needed alone time.<br/>\n&gt; <br/>\n&gt; By the time we got back from the quick shopping trip he was basically<br/>\n&gt; back to his normal self.  He helped with the groceries, loved the<br/>\n&gt; little surprises (favorite foods) we got for him, joked and laughed<br/>\n&gt; around with us like nothing was wrong.  He asked when he&#39;ll meet with<br/>\n&gt; the surgeons, I explained we needed to schedule it and asked if it was<br/>\n&gt; okay that I did that tomorrow, he said it&#39;s fine just to let him know<br/>\n&gt; what&#39;s happening.<br/>\n&gt; <br/>\n&gt; He&#39;s made a few jokes about it, some which hurt my feelings (better<br/>\n&gt; not upset mom, she&#39;ll hold me down and let them get me), but I know<br/>\n&gt; it&#39;s his way of dealing with it.  In the end, it mostly came out fine,<br/>\n&gt; however I know I destroyed quite a bit of the trust he has in me.  I<br/>\n&gt; can&#39;t figure out how I could have handled today better that would have<br/>\n&gt; gotten this situation checked out, but still let him feel in control.<br/>\n&gt; I&#39;m at a loss.<br/>\n&gt; <br/>\n&gt; Thanks for any insight.<br/>\n&gt; <br/>\n&gt; Tina<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":163414916,"authorName":"Scott & Marygrace Sorensen","from":"&quot;Scott & Marygrace Sorensen&quot; &lt;sorensen@...&gt;","profile":"unity_yfm_specialist","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Imaginative play?","postDate":"1290107664","msgId":45338,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzYzgwMWNiODc1NCRkMGExODUwMCQ3MWU0OGYwMCRAanVnZ2xlMTIuY29tPg=="},"prevInTopic":45337,"nextInTopic":45339,"prevInTime":45337,"nextInTime":45339,"topicId":45325,"numMessagesInTopic":0,"msgSnippet":"Her games have to be played exactly the way she want s no deviations, and quite frequently she won t tell you what she wants us to play until we do something","messageBody":"<div id=\"ygrps-yiv-2043352755\">Her games have to be played exactly the way she want&#39;s no deviations, <br/>\nand quite frequently she won&#39;t tell you what she wants us to play until we <br/>\ndo something different, when we find out because she&#39;s screaming at us. ..<br/>\n<br/>\n<br/>\nthen she gets upset, and keeps asking over and over again, or saying we <br/>\n&#39;have to&#39; play right now.<br/>\n<br/>\n<br/>\n<br/>\nIt seems she&#39;s suffering from impatience as the other child in another<br/>\nthread.  I&#39;ve suffered from impatience all of my life, as well.<br/>\n<br/>\n <br/>\n<br/>\nThese are the things that have helped me:<br/>\n<br/>\nDEEP breathing<br/>\n<br/>\n <br/>\n<br/>\nYoga (just get a DVD and play it and see if he joins, but don&#39;t make it a<br/>\nbig deal)<br/>\n<br/>\n <br/>\n<br/>\nThe Bach Remedy - Impatience.  (I didn&#39;t find this until my early 20s and<br/>\nwhile I wish I&#39;d had it earlier, it&#39;s been a life saver for me.)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bachflower.com/38_Essences.htm#Impatiens\">http://www.bachflower.com/38_Essences.htm#Impatiens</a><br/>\n<br/>\nThis also would probably be helpful to the little girl and her imaginative<br/>\nplay, as well.<br/>\n<br/>\n <br/>\n<br/>\nAlso the Bach Remedy - Recue Remedy is terrific too, when feeling stressed.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bachflower.com/Rescue_Remedy.htm\">http://www.bachflower.com/Rescue_Remedy.htm</a><br/>\n<br/>\n <br/>\n<br/>\nGood luck,<br/>\n<br/>\n <br/>\n<br/>\nMg<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Imaginative play?","postDate":"1290103544","msgId":45337,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGljM3B0bytzcHN0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA2OEVDNUQzMDI2MDRFNDU4RDI0QzQ1QTQwOEI5M0ZEQFRhbWFyYT4="},"prevInTopic":45336,"nextInTopic":45338,"prevInTime":45336,"nextInTime":45338,"topicId":45325,"numMessagesInTopic":0,"msgSnippet":"... As hard as that is for you, realize that its just as hard, if not harder for her. She s not trying to bully you or drive you crazy, she really needs the","messageBody":"<div id=\"ygrps-yiv-270556316\">&quot;Rinelle&quot; &lt;rinelle@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;If we say we&#39;ll play just as soon as we&#39;ve finished what we&#39;re <br/>\n&gt; doing (usually something like being in the middle of eating a meal, etc), <br/>\n&gt; then she gets upset, and keeps asking over and over again, or saying we <br/>\n&gt; &#39;have to&#39; play right now.<br/>\n<br/>\n </span></blockquote>As hard as that is for you, realize that its just as hard, if not harder for her. She&#39;s not trying to bully you or drive you crazy, she really needs the support and attention! That&#39;s not to say you should jump up the moment she calls, but do treat her needs and desires and feelings seriously - they are serious to her. Be gentle with her. <br/>\n<br/>\nKids with bit emotions get their feelings hurt more often. That&#39;s one of the realities of their lives - they feel things in Big ways where other kids can shrug and move on. Treating your dd&#39;s needs seriously means honoring her disappointments without beating yourself up when you can&#39;t be the perfect mommy she&#39;d like you to be. Look for ways to say yes more and sooner, for sure! but also be honest about your own needs and boundaries. <br/>\n<br/>\nAs much as we&#39;d all love for our kids to enjoy and cherish their childhoods, some kids have a very hard time being children. Its hard to be small and dependent, and its harder on some kids, emotionally, than others, and the best you can do is be the gentle, caring friend who tries to help when you can, and commiserate when the world is just too much. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Imaginative play?","postDate":"1290075735","msgId":45336,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5NzUwNy45Mjk4MC5xbUB3ZWI4NjIwMS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDA2OEVDNUQzMDI2MDRFNDU4RDI0QzQ1QTQwOEI5M0ZEQFRhbWFyYT4=","referencesHeader":"PEFBTkxrVGlrMEZ4dVVpNVZaWDlZYWRRbjdZLUVaMFl1PThVbzJDRm1ORGRCbkBtYWlsLmdtYWlsLmNvbT4gPDA2OEVDNUQzMDI2MDRFNDU4RDI0QzQ1QTQwOEI5M0ZEQFRhbWFyYT4="},"prevInTopic":45335,"nextInTopic":45337,"prevInTime":45335,"nextInTime":45337,"topicId":45325,"numMessagesInTopic":0,"msgSnippet":"You can t change someone else. You can t help her to see how waiting will get her what she needs in a better way. She needs you right now! She needs you to ","messageBody":"<div id=\"ygrps-yiv-785375278\">You can&#39;t change someone else. You can&#39;t help her to see how waiting will get <br/>\nher what she needs in a better way. She needs you right now! She needs you to <br/>\ntake the toy and run through the game she&#39;s planned for you. And how fantastic <br/>\nit is that she has such trust that you will do it, she believes that you are <br/>\ncapable of fulfilling the role she has created for you. No matter how much you <br/>\ntry and put off her neediness, you daughter will still be needy until you can <br/>\nfigure out ways to be with her more. <br/>\n<br/>\nSimon and Linnaea are 13 and 10 now, but when they were littler I did very <br/>\nlittle that took focus or time. Being able to stop doing something and turn <br/>\ntoward them was much, much more important when they were younger. It still is <br/>\nimportant, but they need my time much less. I have projects now. I haven&#39;t had <br/>\nprojects for a long time. I even stopped reading much when they were younger. <br/>\nActually I still don&#39;t read as much as I used to largely because I&#39;m less <br/>\ninterested in reading books these days. Most things could be paused, most things <br/>\nput off. Food can grow cold without me suffering too much, or, the more I&#39;d <br/>\ngiven the more willing Simon and Linnaea were to adapt the situation to my <br/>\nneeds, food can be brought along and eaten as I go. Dishwater can be changed, <br/>\nand the dishes are easier to clean for the soaking. Vacuuming doesn&#39;t do itself <br/>\n(unless you have a roomba, I suppose), it&#39;ll be there when your daughter isn&#39;t. <br/>\nThe only thing that can&#39;t wait, the only thing that needs your presence truly is <br/>\nyour daughter. Even your husband can probably hold on for a few minutes, or join <br/>\nin. Maybe you two could hold hands as you follow your daughter&#39;s guidance, or <br/>\nlook at each other in the moments while she&#39;s designing the next moment of play, <br/>\nor make some other affectionate gesture. <br/>\n<br/>\nThe more you turn towards your daughter in her moments of need the less she&#39;ll <br/>\nbe needy. I know it can seem like it&#39;s all you are doing for a long while, but <br/>\nshe may have huge needs for love and attention. The fuller up her cup gets the <br/>\nless it will take to fill in future moments and the more patient she&#39;ll be <br/>\nlikely to be about your own needs being met. Linnaea will have times when she <br/>\nneeds me. She&#39;ll want foot massages and stories and back rubs and engagement and <br/>\ncuddles and conversations and walks and so on and so forth. If I can help her, <br/>\nif I can give to her, she&#39;s less likely to have a hard time with Simon or to get <br/>\nfrustrated with someone else. Simon will have times when he wants affection, he <br/>\nwants to sit on my lap, he wants to cuddle up and watch a movie, he wants to <br/>\nsquoosh up to me in the kitchen. The more I can give to him, the more I can help <br/>\nhim out, the better the rest of his day is. I have times when I want attention <br/>\nand love and words and the more I&#39;ve been affectionate and loving and playful <br/>\nand giving, the more likely I&#39;m going to receive the care and attention I&#39;m <br/>\nhoping for from the rest of my family. <br/>\n<br/>\nI think it&#39;s fantastic that she&#39;ll come to you story in hand and assume that you <br/>\nare capable of fulfilling the role she&#39;s cast for you. That&#39;s a big thing. She <br/>\nloves you and wants you to be with her. She loves you and wants you to play with <br/>\nher. It helps me a lot to have a few little phrases that I can pull into my head <br/>\nin moments where I&#39;m torn between what I&#39;m doing and Simon or Linnaea. Things <br/>\nlike they&#39;ll only be this age right now; life without them is so much less fun; <br/>\nwhich is truly more important; wouldn&#39;t it have been nice for my mom to play <br/>\nwith me like this. That doesn&#39;t mean that I always go when they ask, but it <br/>\nmeans that I&#39;m truly working to go with them more than not. They still ask me to <br/>\nengage with them because they like me and they want to be with me. That&#39;s a <br/>\nreally cool piece of knowledge. And sometimes that knowledge gives me enough <br/>\npatience to move along with their needs and not my own desires. <br/>\n<br/>\nI found when I would sit and play with Simon and/or Linnaea for the whole day <br/>\nwith only moments away to get food or drink that I often had lots of moments <br/>\nduring their play to think my own thoughts, to have my own ideas. If I wasn&#39;t <br/>\nfighting the moment, if I wasn&#39;t sitting there making lists about what I needed <br/>\nto be doing instead of this unfocused activity of being with my children, I got <br/>\na lot of peace playing with them. Playing with dolls was tactile, I could brush <br/>\ntheir hair or dress them or feel the weird skins that manufacturers gave them. <br/>\nIf it was B&#39;damen battles, the setting up of the blocks was engaging and <br/>\nrelaxing, the finding the balls was a challenge, the figuring out how best to <br/>\nbuild a fort that would take time to knock down was fun. There were some games I <br/>\nstruggled at, like imaginary Pokemon battles, but David was brilliant at riding <br/>\nout Simon&#39;s rule changes. I was so pleased to have a partner who had strengths <br/>\nto match my weaknesses. And my weaknesses grew less the more I exercised them. <br/>\n<br/>\nIf she&#39;s disturbing you at dinner, it may help to think back to how many other <br/>\ntimes during the day you put her off. There may be a pattern, if you&#39;ve been <br/>\nmore responsive to her over the day is she more likely to let you sit down to <br/>\neat? Does her neediness ramp up when Dad is home? Does she miss him and want him <br/>\nto play? is she jealous of the attention you pay to him? Simon would always step <br/>\nbetween David and I if he caught us kissing. It became a game, but he definitely <br/>\nwanted our attention to be for him and not for each other. Make special effort <br/>\nto include her in your time with her dad and it may make it easier for you two <br/>\nto have a few moments together, here and there. David and I tend to make dinner <br/>\ntogether in part because it is easier for us to have moments together then. We <br/>\nget to kiss and cuddle and flirt and cook. It may explain why I enjoy cooking so <br/>\nmuch.<br/>\n<br/>\nSay yes more. Reach out to her play more. There isn&#39;t a way to stop her desire <br/>\nto do imaginative play without it being a hurtful or mean thing. The more you <br/>\ngive the more you will receive. Really. She&#39;s only 6. Soon she won&#39;t be 6 <br/>\nanymore. Soon she&#39;ll be 7 and then 8 and then 9 and then 10. It goes both slowly <br/>\nand way, way too quickly. Enjoy the slower ride as much as you can. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\n<br/>\nI&#39;m having some struggles right now with my daughter (6), and her intense <br/>\ndesire for imaginative play.  It&#39;s not really a new desire, she&#39;s always <br/>\nplayed very intense and involved imaginative play games, and DH and I have <br/>\nboth tried our best to meet this need for her.  The trouble is, both of us <br/>\nare finding it harder and harder to meet her needs on the level she seems to <br/>\nwant.  She would happily be involved in one imaginative game or another all <br/>\nday, and both DH and I are feeling very overwhemed by playing at all right <br/>\nnow.  Her games have to be played exactly the way she want&#39;s no deviations, <br/>\nand quite frequently she won&#39;t tell you what she wants us to play until we <br/>\ndo something different, when we find out because she&#39;s screaming at us.  (As <br/>\nan example, while I was in the middle of typing this, she came up and handed <br/>\nme a toy and launched into a big description of what I had to do and what <br/>\nshe was going to do, not even asking me if I would play, just assuming that <br/>\nI would.)  If we say we&#39;ll play just as soon as we&#39;ve finished what we&#39;re <br/>\ndoing (usually something like being in the middle of eating a meal, etc), <br/>\nthen she gets upset, and keeps asking over and over again, or saying we <br/>\n&#39;have to&#39; play right now.<br/>\n<br/>\nWe&#39;ve been trying recently to find some other children she can play with, <br/>\nbut many of them either don&#39;t seem to be into the same style of imaginative <br/>\nplay, or in the case of the one family we&#39;ve found who is, the parents <br/>\naren&#39;t interested in finding the time for us to get the kids together for <br/>\nsome extended play time.<br/>\n<br/>\nI&#39;m at a loss as to how to find a way we can meet this need for imaginative <br/>\nplay, without DH and I feeling like we just want to escape so we can have a <br/>\nprivate thought, or even more difficult, discuss something with each other <br/>\nwithout being screamed at.<br/>\n<br/>\nTamara <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":333388203,"authorName":"Rinelle","from":"&quot;Rinelle&quot; &lt;rinelle@...&gt;","profile":"rinelle2011","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Imaginative play?","postDate":"1290052780","msgId":45335,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2OEVDNUQzMDI2MDRFNDU4RDI0QzQ1QTQwOEI5M0ZEQFRhbWFyYT4=","inReplyToHeader":"PEFBTkxrVGlrMEZ4dVVpNVZaWDlZYWRRbjdZLUVaMFl1PThVbzJDRm1ORGRCbkBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrMEZ4dVVpNVZaWDlZYWRRbjdZLUVaMFl1PThVbzJDRm1ORGRCbkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":45333,"nextInTopic":45336,"prevInTime":45334,"nextInTime":45336,"topicId":45325,"numMessagesInTopic":0,"msgSnippet":"I m having some struggles right now with my daughter (6), and her intense desire for imaginative play.  It s not really a new desire, she s always played very","messageBody":"<div id=\"ygrps-yiv-215040403\">I&#39;m having some struggles right now with my daughter (6), and her intense <br/>\ndesire for imaginative play.  It&#39;s not really a new desire, she&#39;s always <br/>\nplayed very intense and involved imaginative play games, and DH and I have <br/>\nboth tried our best to meet this need for her.  The trouble is, both of us <br/>\nare finding it harder and harder to meet her needs on the level she seems to <br/>\nwant.  She would happily be involved in one imaginative game or another all <br/>\nday, and both DH and I are feeling very overwhemed by playing at all right <br/>\nnow.  Her games have to be played exactly the way she want&#39;s no deviations, <br/>\nand quite frequently she won&#39;t tell you what she wants us to play until we <br/>\ndo something different, when we find out because she&#39;s screaming at us.  (As <br/>\nan example, while I was in the middle of typing this, she came up and handed <br/>\nme a toy and launched into a big description of what I had to do and what <br/>\nshe was going to do, not even asking me if I would play, just assuming that <br/>\nI would.)  If we say we&#39;ll play just as soon as we&#39;ve finished what we&#39;re <br/>\ndoing (usually something like being in the middle of eating a meal, etc), <br/>\nthen she gets upset, and keeps asking over and over again, or saying we <br/>\n&#39;have to&#39; play right now.<br/>\n<br/>\nWe&#39;ve been trying recently to find some other children she can play with, <br/>\nbut many of them either don&#39;t seem to be into the same style of imaginative <br/>\nplay, or in the case of the one family we&#39;ve found who is, the parents <br/>\naren&#39;t interested in finding the time for us to get the kids together for <br/>\nsome extended play time.<br/>\n<br/>\nI&#39;m at a loss as to how to find a way we can meet this need for imaginative <br/>\nplay, without DH and I feeling like we just want to escape so we can have a <br/>\nprivate thought, or even more difficult, discuss something with each other <br/>\nwithout being screamed at.<br/>\n<br/>\nTamara</div>","specialLinks":[]},{"userId":412956600,"authorName":"Christine Yablonski","from":"Christine Yablonski &lt;christineyablonski@...&gt;","profile":"iksnolbay67","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Hospital situation","postDate":"1289939395","msgId":45333,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlubUJRdDdLbUZMajhDOFord1FnMjVMX25oaEtSTDJjRXRfek9DM0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEFBTkxrVGltU3l2VF8tRGFldGdMalNQSEtMQTcxa0J5LXRkTDlEektFeHlVYkBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrMEZ4dVVpNVZaWDlZYWRRbjdZLUVaMFl1PThVbzJDRm1ORGRCbkBtYWlsLmdtYWlsLmNvbT4gPEFBTkxrVGltU3l2VF8tRGFldGdMalNQSEtMQTcxa0J5LXRkTDlEektFeHlVYkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":45332,"nextInTopic":45335,"prevInTime":45332,"nextInTime":45334,"topicId":45325,"numMessagesInTopic":0,"msgSnippet":"Beautiful post on honoring your child s needs during medical situations, Faith.  It is so hard when you re already worried to ignore the pressure from those","messageBody":"<div id=\"ygrps-yiv-1541593122\">Beautiful post on honoring your child&#39;s needs during medical situations,<br/>\nFaith.  It is so hard when you&#39;re already worried to ignore the pressure<br/>\nfrom those who, for all their good intentions, don&#39;t know your child better<br/>\nthan you.<br/>\n<br/>\n~ Christine<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, Nov 16, 2010 at 1:11 PM, Faith Void &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:littlemsvoid@...\">littlemsvoid@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I would start by apologizing for violating my child&#39;s body autonomy. I<br/>\n&gt; would<br/>\n&gt; explain that I was parenting from fear in that moment.<br/>\n&gt;<br/>\n&gt; In April Easy (7) , his sister (2) and I were running down a grassy hill<br/>\n&gt; over an over. At one point Easy stepped wrong and slipped in his knee.<br/>\n&gt; He said it made a horrible noise and was very painful. He was inconsolable<br/>\n&gt; and unable to walk. I suspected it might be broken. I carried him home. At<br/>\n&gt; home we discussed his leg and what might be going on. I suggested the<br/>\n&gt; doctors. Easy was opposed. He really just wanted to &quot;wait and see&quot;. So he<br/>\n&gt; soaked in a tub hoping to relax the knee and make it less painful. He was<br/>\n&gt; carried around so that it wasn&#39;t used. We gave him a little ibuprofen.<br/>\n&gt;<br/>\n&gt; He cried all through the night. We stayed with him. In the morning he<br/>\n&gt; decided that it was so painful (and there was no bruising) that something<br/>\n&gt; might need to be done by a doctor. So we went to the ER to get pictures<br/>\n&gt; (xrays). It was indeed broken. I was worried that the doctors would give me<br/>\n&gt; a hard time for not bringing him in immediately but they were very<br/>\n&gt; understanding and all felt that &quot;wait and see&quot; was an excellent policy in<br/>\n&gt; most cases. I made sure that Easy was part of all decision making. He<br/>\n&gt; needed<br/>\n&gt; everything spelled out to the letter. He needed to choose who touched him<br/>\n&gt; and who wasn&#39;t allowed.<br/>\n&gt;<br/>\n&gt; I have done this with all my kids. It is very challenging to parent through<br/>\n&gt; this especially when your child is making a decision you wouldn&#39;t make or<br/>\n&gt; the doctors/nurses are pushing you to &quot;control&quot; your child. I have left<br/>\n&gt; offices and fired doctors for this. You r health care providers are giving<br/>\n&gt; you a service. If you don&#39;t like them or the service they are giving you<br/>\n&gt; are<br/>\n&gt; free to leave.<br/>\n&gt;<br/>\n&gt; I would give your child time to heal. Then see a urologist. Find one that<br/>\n&gt; will be sensitive about handling your child and taking cues from him. It is<br/>\n&gt; reasonable for only one person to handle his genitals and he should decide<br/>\n&gt; when and which doctor.<br/>\n&gt;<br/>\n&gt; You can also read up on what this condition is and how it is handled. Find<br/>\n&gt; options. As many as possible.<br/>\n&gt;<br/>\n&gt; Faith<br/>\n&gt;<br/>\n&gt; On Mon, Nov 15, 2010 at 8:19 PM, Tina Tarbutton &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tina.tarbutton@...\">tina.tarbutton@...</a>&lt;tina.tarbutton%40gmail.com&gt;<br/>\n&gt; &gt;wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; So we get to the ER, everything is okay, he pees in a cup, they send<br/>\n&gt; &gt; it off, we get into the room and the doctor wants to have a quick look<br/>\n&gt; &gt; &quot;down there&quot;. Draven says no at first, but after I talked to him and<br/>\n&gt; &gt; explained it would be quick and fast and would just happen once<br/>\n&gt; &gt; (whoops, big mistake), he agreed, I turned my head, he covered his<br/>\n&gt; &gt; eyes, the doctor looked and said we&#39;d wait for the results from the<br/>\n&gt; &gt; urinalysis.<br/>\n&gt; &gt;<br/>\n&gt; &gt; He comes back 30 minutes later with another doctor. Said the quick<br/>\n&gt; &gt; test of the urine was negative, but that he thought the opening to his<br/>\n&gt; &gt; urethra was too small for his age and wanted another opinion (from<br/>\n&gt; &gt; this other doctor). Draven went ballistic, no, mommy said once, you<br/>\n&gt; &gt; guys had your chance, you didn&#39;t figure it out, you&#39;re not looking<br/>\n&gt; &gt; again, no no no no no. I pulled the doctor aside and asked how big of<br/>\n&gt; &gt; an issue it was if it was too small and he asked me a few questions,<br/>\n&gt; &gt; all of which had an affirmative answer (he&#39;s always used the restroom<br/>\n&gt; &gt; a whole lot ever since he was first potty trained, we&#39;re constantly<br/>\n&gt; &gt; rushing to bathrooms, and he had accidents for long after he knew how<br/>\n&gt; &gt; to use the toilet). The doctor then told me this problem will get<br/>\n&gt; &gt; worse if the urethra opening is too small, and may in fact cause him<br/>\n&gt; &gt; more serious problems once he his puberty. So I got scared, wanted<br/>\n&gt; &gt; this taken care of and decided to put my foot down. This consisted of<br/>\n&gt; &gt; a nurse and I holding Draven down while they looked. The whole time<br/>\n&gt; &gt; him and I are both in tears, I know I&#39;ve screwed up, but I&#39;m worried<br/>\n&gt; &gt; about his health at this point.<br/>\n&gt; &gt;<br/>\n&gt; &gt; --<br/>\n&gt; www.bearthmama.com<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n~ Christine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":299286442,"authorName":"Cameron Parham","from":"Cameron Parham &lt;acsp2205@...&gt;","profile":"acsp2205","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Hospital situation","postDate":"1289937500","msgId":45332,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzNDE0Ljg5MDczLnFtQHdlYjEyMDUxOS5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":45330,"nextInTopic":45333,"prevInTime":45330,"nextInTime":45333,"topicId":45325,"numMessagesInTopic":0,"msgSnippet":"I love Brianls advice.  While this question shouldd eventually be addressed, there is no danger in waiting until your son has had time to heal emotionally and","messageBody":"<div id=\"ygrps-yiv-273134071\">I love Brianls advice.  While this question shouldd eventually be addressed, there is no danger in waiting until your son has had time to heal emotionally and participate in the next plan.  There are pediatric urologists (not many, but some).  Depending where you live, there may  be more than one, so your son can interview them and choose.  You can try googling the issue to assess risks involved.  You may find a gentle,experienced pediatrician who doesn&#39;t find patient autonomy threatening.  As long as there is no infection occurring there is no emergency.  Even then you can discuss the pros and cons of antibiotcs, with your son.  Maybe the concern about a small urethral opening isn&#39;t even accurate.  That is fairly rare.  Help your son have the facts, help yourself have the facts, then rest with them.  The whole thing was sad.  I also agree with telling your son that you are sorry.  My kids sure hear a lot of that.  I hope that you don&#39;t mind my input<br/>\n from the position of an unschooling ER doc.  I always tell patients that my job is to share with them what I know and help them make the choice that feels best to them, but that comes  after years of unschooling! Cameron P<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue Nov 16th, 2010 11:24 AM MST BRIAN POLIKOWSKY wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;I couldn&#39;t agree more with what Faith said.<br/>\n&gt;Research about it and listen to your child.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;Alex Polikowsky<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;________________________________<br/>\n&gt;From: Faith Void &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:littlemsvoid@...\">littlemsvoid@...</a>&gt;<br/>\n&gt;To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n&gt;Sent: Tue, November 16, 2010 12:11:18 PM<br/>\n&gt;Subject: Re: [unschoolingbasics] Hospital situation<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;I would start by apologizing for violating my child&#39;s body autonomy. I would<br/>\n&gt;explain that I was parenting from fear in that moment.<br/>\n&gt;<br/>\n&gt;In April Easy (7) , his sister (2) and I were running down a grassy hill<br/>\n&gt;over an over. At one point Easy stepped wrong and slipped in his knee.<br/>\n&gt;He said it made a horrible noise and was very painful. He was inconsolable<br/>\n&gt;and unable to walk. I suspected it might be broken. I carried him home. At<br/>\n&gt;home we discussed his leg and what might be going on. I suggested the<br/>\n&gt;doctors. Easy was opposed. He really just wanted to &quot;wait and see&quot;. So he<br/>\n&gt;soaked in a tub hoping to relax the knee and make it less painful. He was<br/>\n&gt;carried around so that it wasn&#39;t used. We gave him a little ibuprofen.<br/>\n&gt;<br/>\n&gt;He cried all through the night. We stayed with him. In the morning he<br/>\n&gt;decided that it was so painful (and there was no bruising) that something<br/>\n&gt;might need to be done by a doctor. So we went to the ER to get pictures<br/>\n&gt;(xrays). It was indeed broken. I was worried that the doctors would give me<br/>\n&gt;a hard time for not bringing him in immediately but they were very<br/>\n&gt;understanding and all felt that &quot;wait and see&quot; was an excellent policy in<br/>\n&gt;most cases. I made sure that Easy was part of all decision making. He needed<br/>\n&gt;everything spelled out to the letter. He needed to choose who touched him<br/>\n&gt;and who wasn&#39;t allowed.<br/>\n&gt;<br/>\n&gt;I have done this with all my kids. It is very challenging to parent through<br/>\n&gt;this especially when your child is making a decision you wouldn&#39;t make or<br/>\n&gt;the doctors/nurses are pushing you to &quot;control&quot; your child. I have left<br/>\n&gt;offices and fired doctors for this. You r health care providers are giving<br/>\n&gt;you a service. If you don&#39;t like them or the service they are giving you are<br/>\n&gt;free to leave.<br/>\n&gt;<br/>\n&gt;I would give your child time to heal. Then see a urologist. Find one that<br/>\n&gt;will be sensitive about handling your child and taking cues from him. It is<br/>\n&gt;reasonable for only one person to handle his genitals and he should decide<br/>\n&gt;when and which doctor.<br/>\n&gt;<br/>\n&gt;You can also read up on what this condition is and how it is handled. Find<br/>\n&gt;options. As many as possible.<br/>\n&gt;<br/>\n&gt;Faith<br/>\n&gt;<br/>\n&gt;On Mon, Nov 15, 2010 at 8:19 PM, Tina Tarbutton &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tina.tarbutton@...\">tina.tarbutton@...</a>&gt;wrote:<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; So we get to the ER, everything is okay, he pees in a cup, they send<br/>\n&gt;&gt; it off, we get into the room and the doctor wants to have a quick look<br/>\n&gt;&gt; &quot;down there&quot;. Draven says no at first, but after I talked to him and<br/>\n&gt;&gt; explained it would be quick and fast and would just happen once<br/>\n&gt;&gt; (whoops, big mistake), he agreed, I turned my head, he covered his<br/>\n&gt;&gt; eyes, the doctor looked and said we&#39;d wait for the results from the<br/>\n&gt;&gt; urinalysis.<br/>\n&gt;&gt;<br/>\n&gt;&gt; He comes back 30 minutes later with another doctor. Said the quick<br/>\n&gt;&gt; test of the urine was negative, but that he thought the opening to his<br/>\n&gt;&gt; urethra was too small for his age and wanted another opinion (from<br/>\n&gt;&gt; this other doctor). Draven went ballistic, no, mommy said once, you<br/>\n&gt;&gt; guys had your chance, you didn&#39;t figure it out, you&#39;re not looking<br/>\n&gt;&gt; again, no no no no no. I pulled the doctor aside and asked how big of<br/>\n&gt;&gt; an issue it was if it was too small and he asked me a few questions,<br/>\n&gt;&gt; all of which had an affirmative answer (he&#39;s always used the restroom<br/>\n&gt;&gt; a whole lot ever since he was first potty trained, we&#39;re constantly<br/>\n&gt;&gt; rushing to bathrooms, and he had accidents for long after he knew how<br/>\n&gt;&gt; to use the toilet). The doctor then told me this problem will get<br/>\n&gt;&gt; worse if the urethra opening is too small, and may in fact cause him<br/>\n&gt;&gt; more serious problems once he his puberty. So I got scared, wanted<br/>\n&gt;&gt; this taken care of and decided to put my foot down. This consisted of<br/>\n&gt;&gt; a nurse and I holding Draven down while they looked. The whole time<br/>\n&gt;&gt; him and I are both in tears, I know I&#39;ve screwed up, but I&#39;m worried<br/>\n&gt;&gt; about his health at this point.<br/>\n&gt;&gt;<br/>\n&gt;&gt; --<br/>\n&gt;www.bearthmama.com<br/>\n&gt;<br/>\n&gt;[Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;[Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Hospital situation","postDate":"1289931884","msgId":45330,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5MTgxMS40ODY1Ni5xbUB3ZWI4MTUwNC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PEFBTkxrVGltU3l2VF8tRGFldGdMalNQSEtMQTcxa0J5LXRkTDlEektFeHlVYkBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrMEZ4dVVpNVZaWDlZYWRRbjdZLUVaMFl1PThVbzJDRm1ORGRCbkBtYWlsLmdtYWlsLmNvbT4gPEFBTkxrVGltU3l2VF8tRGFldGdMalNQSEtMQTcxa0J5LXRkTDlEektFeHlVYkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":45329,"nextInTopic":45332,"prevInTime":45329,"nextInTime":45332,"topicId":45325,"numMessagesInTopic":0,"msgSnippet":"I couldn t agree more with what Faith said. Research about it and listen to your child. Alex Polikowsky ________________________________ From: Faith Void","messageBody":"<div id=\"ygrps-yiv-1106727672\">I couldn&#39;t agree more with what Faith said.<br/>\nResearch about it and listen to your child.<br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Faith Void &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:littlemsvoid@...\">littlemsvoid@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Tue, November 16, 2010 12:11:18 PM<br/>\nSubject: Re: [unschoolingbasics] Hospital situation<br/>\n<br/>\n <br/>\nI would start by apologizing for violating my child&#39;s body autonomy. I would<br/>\nexplain that I was parenting from fear in that moment.<br/>\n<br/>\nIn April Easy (7) , his sister (2) and I were running down a grassy hill<br/>\nover an over. At one point Easy stepped wrong and slipped in his knee.<br/>\nHe said it made a horrible noise and was very painful. He was inconsolable<br/>\nand unable to walk. I suspected it might be broken. I carried him home. At<br/>\nhome we discussed his leg and what might be going on. I suggested the<br/>\ndoctors. Easy was opposed. He really just wanted to &quot;wait and see&quot;. So he<br/>\nsoaked in a tub hoping to relax the knee and make it less painful. He was<br/>\ncarried around so that it wasn&#39;t used. We gave him a little ibuprofen.<br/>\n<br/>\nHe cried all through the night. We stayed with him. In the morning he<br/>\ndecided that it was so painful (and there was no bruising) that something<br/>\nmight need to be done by a doctor. So we went to the ER to get pictures<br/>\n(xrays). It was indeed broken. I was worried that the doctors would give me<br/>\na hard time for not bringing him in immediately but they were very<br/>\nunderstanding and all felt that &quot;wait and see&quot; was an excellent policy in<br/>\nmost cases. I made sure that Easy was part of all decision making. He needed<br/>\neverything spelled out to the letter. He needed to choose who touched him<br/>\nand who wasn&#39;t allowed.<br/>\n<br/>\nI have done this with all my kids. It is very challenging to parent through<br/>\nthis especially when your child is making a decision you wouldn&#39;t make or<br/>\nthe doctors/nurses are pushing you to &quot;control&quot; your child. I have left<br/>\noffices and fired doctors for this. You r health care providers are giving<br/>\nyou a service. If you don&#39;t like them or the service they are giving you are<br/>\nfree to leave.<br/>\n<br/>\nI would give your child time to heal. Then see a urologist. Find one that<br/>\nwill be sensitive about handling your child and taking cues from him. It is<br/>\nreasonable for only one person to handle his genitals and he should decide<br/>\nwhen and which doctor.<br/>\n<br/>\nYou can also read up on what this condition is and how it is handled. Find<br/>\noptions. As many as possible.<br/>\n<br/>\nFaith<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Nov 15, 2010 at 8:19 PM, Tina Tarbutton &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tina.tarbutton@...\">tina.tarbutton@...</a>&gt;wrote:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; So we get to the ER, everything is okay, he pees in a cup, they send<br/>\n&gt; it off, we get into the room and the doctor wants to have a quick look<br/>\n&gt; &quot;down there&quot;. Draven says no at first, but after I talked to him and<br/>\n&gt; explained it would be quick and fast and would just happen once<br/>\n&gt; (whoops, big mistake), he agreed, I turned my head, he covered his<br/>\n&gt; eyes, the doctor looked and said we&#39;d wait for the results from the<br/>\n&gt; urinalysis.<br/>\n&gt;<br/>\n&gt; He comes back 30 minutes later with another doctor. Said the quick<br/>\n&gt; test of the urine was negative, but that he thought the opening to his<br/>\n&gt; urethra was too small for his age and wanted another opinion (from<br/>\n&gt; this other doctor). Draven went ballistic, no, mommy said once, you<br/>\n&gt; guys had your chance, you didn&#39;t figure it out, you&#39;re not looking<br/>\n&gt; again, no no no no no. I pulled the doctor aside and asked how big of<br/>\n&gt; an issue it was if it was too small and he asked me a few questions,<br/>\n&gt; all of which had an affirmative answer (he&#39;s always used the restroom<br/>\n&gt; a whole lot ever since he was first potty trained, we&#39;re constantly<br/>\n&gt; rushing to bathrooms, and he had accidents for long after he knew how<br/>\n&gt; to use the toilet). The doctor then told me this problem will get<br/>\n&gt; worse if the urethra opening is too small, and may in fact cause him<br/>\n&gt; more serious problems once he his puberty. So I got scared, wanted<br/>\n&gt; this taken care of and decided to put my foot down. This consisted of<br/>\n&gt; a nurse and I holding Draven down while they looked. The whole time<br/>\n&gt; him and I are both in tears, I know I&#39;ve screwed up, but I&#39;m worried<br/>\n&gt; about his health at this point.<br/>\n&gt;<br/>\n&gt; --<br/>\nwww.bearthmama.com<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Hospital situation","postDate":"1289931078","msgId":45329,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGltU3l2VF8tRGFldGdMalNQSEtMQTcxa0J5LXRkTDlEektFeHlVYkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEFBTkxrVGlrMEZ4dVVpNVZaWDlZYWRRbjdZLUVaMFl1PThVbzJDRm1ORGRCbkBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrMEZ4dVVpNVZaWDlZYWRRbjdZLUVaMFl1PThVbzJDRm1ORGRCbkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":45327,"nextInTopic":45330,"prevInTime":45328,"nextInTime":45330,"topicId":45325,"numMessagesInTopic":0,"msgSnippet":"I would start by apologizing for violating my child s body autonomy. I would explain that I was parenting from fear in that moment. In April Easy (7) , his","messageBody":"<div id=\"ygrps-yiv-195468805\">I would start by apologizing for violating my child&#39;s body autonomy. I would<br/>\nexplain that I was parenting from fear in that moment.<br/>\n<br/>\nIn April Easy (7) , his sister (2) and I were running down a grassy hill<br/>\nover an over. At one point Easy stepped wrong and slipped in his knee.<br/>\nHe said it made a horrible noise and was very painful. He was inconsolable<br/>\nand unable to walk. I suspected it might be broken. I carried him home. At<br/>\nhome we discussed his leg and what might be going on. I suggested the<br/>\ndoctors. Easy was opposed. He really just wanted to &quot;wait and see&quot;. So he<br/>\nsoaked in a tub hoping to relax the knee and make it less painful. He was<br/>\ncarried around so that it wasn&#39;t used. We gave him a little ibuprofen.<br/>\n<br/>\nHe cried all through the night. We stayed with him. In the morning he<br/>\ndecided that it was so painful (and there was no bruising) that something<br/>\nmight need to be done by a doctor. So we went to the ER to get pictures<br/>\n(xrays). It was indeed broken. I was worried that the doctors would give me<br/>\na hard time for not bringing him in immediately but they were very<br/>\nunderstanding and all felt that &quot;wait and see&quot; was an excellent policy in<br/>\nmost cases. I made sure that Easy was part of all decision making. He needed<br/>\neverything spelled out to the letter. He needed to choose who touched him<br/>\nand who wasn&#39;t allowed.<br/>\n<br/>\nI have done this with all my kids. It is very challenging to parent through<br/>\nthis especially when your child is making a decision you wouldn&#39;t make or<br/>\nthe doctors/nurses are pushing you to &quot;control&quot; your child. I have left<br/>\noffices and fired doctors for this. You r health care providers are giving<br/>\nyou a service. If you don&#39;t like them or the service they are giving you are<br/>\nfree to leave.<br/>\n<br/>\nI would give your child time to heal. Then see a urologist. Find one that<br/>\nwill be sensitive about handling your child and taking cues from him. It is<br/>\nreasonable for only one person to handle his genitals and he should decide<br/>\nwhen and which doctor.<br/>\n<br/>\nYou can also read up on what this condition is and how it is handled. Find<br/>\noptions. As many as possible.<br/>\n<br/>\nFaith<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Nov 15, 2010 at 8:19 PM, Tina Tarbutton &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tina.tarbutton@...\">tina.tarbutton@...</a>&gt;wrote:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; So we get to the ER, everything is okay, he pees in a cup, they send<br/>\n&gt; it off, we get into the room and the doctor wants to have a quick look<br/>\n&gt; &quot;down there&quot;. Draven says no at first, but after I talked to him and<br/>\n&gt; explained it would be quick and fast and would just happen once<br/>\n&gt; (whoops, big mistake), he agreed, I turned my head, he covered his<br/>\n&gt; eyes, the doctor looked and said we&#39;d wait for the results from the<br/>\n&gt; urinalysis.<br/>\n&gt;<br/>\n&gt; He comes back 30 minutes later with another doctor. Said the quick<br/>\n&gt; test of the urine was negative, but that he thought the opening to his<br/>\n&gt; urethra was too small for his age and wanted another opinion (from<br/>\n&gt; this other doctor). Draven went ballistic, no, mommy said once, you<br/>\n&gt; guys had your chance, you didn&#39;t figure it out, you&#39;re not looking<br/>\n&gt; again, no no no no no. I pulled the doctor aside and asked how big of<br/>\n&gt; an issue it was if it was too small and he asked me a few questions,<br/>\n&gt; all of which had an affirmative answer (he&#39;s always used the restroom<br/>\n&gt; a whole lot ever since he was first potty trained, we&#39;re constantly<br/>\n&gt; rushing to bathrooms, and he had accidents for long after he knew how<br/>\n&gt; to use the toilet). The doctor then told me this problem will get<br/>\n&gt; worse if the urethra opening is too small, and may in fact cause him<br/>\n&gt; more serious problems once he his puberty. So I got scared, wanted<br/>\n&gt; this taken care of and decided to put my foot down. This consisted of<br/>\n&gt; a nurse and I holding Draven down while they looked. The whole time<br/>\n&gt; him and I are both in tears, I know I&#39;ve screwed up, but I&#39;m worried<br/>\n&gt; about his health at this point.<br/>\n&gt;<br/>\n&gt; --<br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":151505017,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;carenkh@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Hospital situation","postDate":"1289921684","msgId":45327,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlidThhaytka2V2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGlrMEZ4dVVpNVZaWDlZYWRRbjdZLUVaMFl1PThVbzJDRm1ORGRCbkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":45325,"nextInTopic":45329,"prevInTime":45326,"nextInTime":45328,"topicId":45325,"numMessagesInTopic":0,"msgSnippet":"What a tough situation! One thing I kept thinking was that it wasn t an emergency. You had time to go home, and discuss with him the best way to handle it. It","messageBody":"<div id=\"ygrps-yiv-1702430115\">What a tough situation!<br/>\n<br/>\nOne thing I kept thinking was that it wasn&#39;t an emergency. You had time to go home, and discuss with him the best way to handle it. It didn&#39;t have to be done right then, or even looked at right then.<br/>\n<br/>\nMaybe a guideline is: is this *really* life or death in this moment? If not (and pay attention to your son, and the real situation, not scary &quot;what if&quot; statements from the doctors), there&#39;s time to find the win-win.<br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":196677035,"authorName":"Tina Tarbutton","from":"Tina Tarbutton &lt;tina.tarbutton@...&gt;","profile":"dravensmomhome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Hospital situation","postDate":"1289881191","msgId":45325,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrMEZ4dVVpNVZaWDlZYWRRbjdZLUVaMFl1PThVbzJDRm1ORGRCbkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":45327,"prevInTime":45324,"nextInTime":45326,"topicId":45325,"numMessagesInTopic":0,"msgSnippet":"I know I handled this whole situation wrong, and at the time I knew I was handling it wrong, but I couldn t figure out another way to handle it and felt like","messageBody":"<div id=\"ygrps-yiv-1381994591\">I know I handled this whole situation wrong, and at the time I knew I<br/>\nwas handling it wrong, but I couldn&#39;t figure out another way to handle<br/>\nit and felt like it had to be done.  So now I&#39;m opening up to you guys<br/>\nhoping someone can give me some better insights on how to handle it,<br/>\nif it occurs again.<br/>\n<br/>\nI also plan to talk to my son tomorrow when we&#39;re a bit further from<br/>\nthe situation to find out a better way to handle it.<br/>\n<br/>\nMy 10 y/o son Draven told me last night that he was having a hard time<br/>\nemptying his bladder, and that he felt a lot of pressure when he was<br/>\nurinating.  I figured it was the beginning of a UTI and called the<br/>\ndoctors office this morning.  They said they don&#39;t have a way to do<br/>\nurinalysis there, and for us to just hit the ER because it would be<br/>\nquicker then them waiting for results.<br/>\n<br/>\nSo we get to the ER, everything is okay, he pees in a cup, they send<br/>\nit off, we get into the room and the doctor wants to have a quick look<br/>\n&quot;down there&quot;.  Draven says no at first, but after I talked to him and<br/>\nexplained it would be quick and fast and would just happen once<br/>\n(whoops, big mistake), he agreed, I turned my head, he covered his<br/>\neyes, the doctor looked and said we&#39;d wait for the results from the<br/>\nurinalysis.<br/>\n<br/>\nHe comes back 30 minutes later with another doctor.  Said the quick<br/>\ntest of the urine was negative, but that he thought the opening to his<br/>\nurethra was too small for his age and wanted another opinion (from<br/>\nthis other doctor).  Draven went ballistic, no, mommy said once, you<br/>\nguys had your chance, you didn&#39;t figure it out, you&#39;re not looking<br/>\nagain, no no no no no.  I pulled the doctor aside and asked how big of<br/>\nan issue it was if it was too small and he asked me a few questions,<br/>\nall of which had an affirmative answer (he&#39;s always used the restroom<br/>\na whole lot ever since he was first potty trained, we&#39;re constantly<br/>\nrushing to bathrooms, and he had accidents for long after he knew how<br/>\nto use the toilet).  The doctor then told me this problem will get<br/>\nworse if the urethra opening is too small, and may in fact cause him<br/>\nmore serious problems once he his puberty.  So I got scared, wanted<br/>\nthis taken care of and decided to put my foot down.  This consisted of<br/>\na nurse and I holding Draven down while they looked.  The whole time<br/>\nhim and I are both in tears, I know I&#39;ve screwed up, but I&#39;m worried<br/>\nabout his health at this point.<br/>\n<br/>\nThat doctor says yes, something is wrong, we&#39;ll have the surgical team<br/>\ntake a look if the long urinalysis comes back negative.<br/>\n<br/>\nDraven curls into a ball and says (and I quote here) &quot;screw you all,<br/>\nnot another person is touching me, it&#39;s time to go home&quot;.<br/>\n<br/>\nI calm him down again and we take a walk outside so we can call his<br/>\nfather (who lives 14 hours away) and maybe he can explain why this is<br/>\nso important.  We also call my partner, his stepmom, so she can be<br/>\nthere for moral support for both of us.<br/>\n<br/>\nBy the time we get back inside the urinalysis is back and negative.<br/>\nDraven won&#39;t let me touch him and won&#39;t talk to me, he all but cussed<br/>\nhis dad out on the phone.  I was expecting him to take off at any<br/>\nsecond and I couldn&#39;t figure out how to make him feel more in control<br/>\nwhile still protecting his health.  I even asked the doctor if it was<br/>\npossible to either sedate him or give him something for anxiety to try<br/>\nand make this easier.  They refused.<br/>\n<br/>\nSurgical team comes in, it starts to look like it&#39;s going to be<br/>\nanother hold him down situation, but at the last minute he says fine,<br/>\nwhatever, just get it done.  They look (all 3 of them, how freaking<br/>\nstupid) and all agree that he needs surgery to open it up more.  It&#39;s<br/>\nnot an emergency so I can call tomorrow to schedule the pre-op<br/>\nconsult.<br/>\n<br/>\nDraven went back to being curled in a ball, wouldn&#39;t talk to me for<br/>\nthe rest of the time there, or the ride home and pulled away whenever<br/>\nI tried to touch him.<br/>\n<br/>\nHe asked to be dropped off at home while my partner and I went to the<br/>\ngrocery store, we offered to have either of us stay with him, he said<br/>\nno he needed alone time.<br/>\n<br/>\nBy the time we got back from the quick shopping trip he was basically<br/>\nback to his normal self.  He helped with the groceries, loved the<br/>\nlittle surprises (favorite foods) we got for him, joked and laughed<br/>\naround with us like nothing was wrong.  He asked when he&#39;ll meet with<br/>\nthe surgeons, I explained we needed to schedule it and asked if it was<br/>\nokay that I did that tomorrow, he said it&#39;s fine just to let him know<br/>\nwhat&#39;s happening.<br/>\n<br/>\nHe&#39;s made a few jokes about it, some which hurt my feelings (better<br/>\nnot upset mom, she&#39;ll hold me down and let them get me), but I know<br/>\nit&#39;s his way of dealing with it.  In the end, it mostly came out fine,<br/>\nhowever I know I destroyed quite a bit of the trust he has in me.  I<br/>\ncan&#39;t figure out how I could have handled today better that would have<br/>\ngotten this situation checked out, but still let him feel in control.<br/>\nI&#39;m at a loss.<br/>\n<br/>\nThanks for any insight.<br/>\n<br/>\nTina</div>","specialLinks":[]}],"prevTopicId":45308,"nextTopicId":45350}}