{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":22,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: algebra IRL (long and rambling)","postDate":"1191818664","msgId":26885,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOUQ3N0QwOTA5NUMzMi1EMEMtNUIzRUB3ZWJtYWlsLWRiMTguc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PGZkcmxxaytrcDVhQGVHcm91cHMuY29tPg=="},"prevInTopic":26636,"nextInTopic":0,"prevInTime":26884,"nextInTime":26886,"topicId":26540,"numMessagesInTopic":0,"msgSnippet":"... From: trektheory  No, you aren t the only one.  The point I had been trying to make earlier (and failed, I think - and I dropped it","messageBody":"<div id=\"ygrps-yiv-523409859\">-----Original Message-----<br/>\nFrom: trektheory &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:trektheory@...\">trektheory@...</a>&gt;<br/>\n<br/>\n<br/>\nNo, you aren&#39;t the only one.  The point I had been trying to make<br/>\nearlier (and failed, I think - and I dropped it there) was that when<br/>\nyou make those judgements while driving, you are NOT doing an<br/>\nequation.  I defy anyone judging when to apply the brakes to tell me<br/>\nwhat variable they were solving for, what the distance between their<br/>\ncar and the one in front was, etc.  Real world estimating, sure, but<br/>\nnot equation solving.<br/>\n<br/>\n-=-=-=<br/>\n<br/>\nBut understanding that variables are at work in that example can evolve <br/>\ninto an equation that would make sense if you were to want to give <br/>\nvalues to the variables.<br/>\n<br/>\nAlgebra made sense to me when I was riding race horses. I was learning <br/>\nhow to handicap a race. Algebra seemed worthless during high school but <br/>\nwas crystal clear in racing! &lt;g&gt;<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nEmail and AIM finally together. You&#39;ve gotta check out free AOL Mail! - <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.aol.com\">http://mail.aol.com</a></div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: algebra IRL (long and rambling)","postDate":"1191332246","msgId":26636,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZkdGhpbStsZ3BqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZkcm1jcSs1MTluQGVHcm91cHMuY29tPg=="},"prevInTopic":26635,"nextInTopic":26885,"prevInTime":26635,"nextInTime":26637,"topicId":26540,"numMessagesInTopic":0,"msgSnippet":"... it s almost as though since ... believe they should be part of ... of life as letters and books. ... Well, there are a few different issues intertwined.","messageBody":"<div id=\"ygrps-yiv-2096909658\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Elly&quot; &lt;ellyzoe@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; there&#39;s a little &quot;equation phobia&quot; here (am i misreading?) where <br/>\n </span></blockquote>it&#39;s almost as though since <br/>\n<blockquote><span title=\"ireply\"> &gt; equations and abstractions are taught in school folks don&#39;t <br/>\n </span></blockquote>believe they should be part of <br/>\n<blockquote><span title=\"ireply\"> &gt; life or discussed at all. seems to me like they&#39;re as much a part <br/>\n </span></blockquote>of life as letters and books. <br/>\n<blockquote><span title=\"ireply\"> &gt; not something to be forced, but not something to be avoided either.<br/>\n<br/>\n </span></blockquote>Well, there are a few different issues intertwined. Unschooling math <br/>\nis ulitmately going to look different for kids who get to unschool <br/>\nfrom a young age vs kids who leave school after a few years. Its <br/>\nalso going to be different with a kid who is pretty logically <br/>\ninclined vs one who isn&#39;t. On top of that, unschooling math is going <br/>\nto look different in families where the parents have some math <br/>\nanxiety. Those are the reasons why I&#39;m doing the whole &quot;you don&#39;t <br/>\nneed numbers and equations to learn math&quot; thing. <br/>\n<br/>\nIn my own family I&#39;m saying a lot of &quot;you don&#39;t need formalized math <br/>\nto figure things out&quot; to my stepson, who is pretty scarred by his <br/>\nschool experience *and* not terribly logical by nature - but is <br/>\ngetting interested in woodworking. But otoh, my 6yo dd and I spent <br/>\nthe afternoon playing with the properties of circles in some pretty <br/>\nformal ways, yesterday, and had a blast - but then she&#39;s always been <br/>\nunschooled and has a very logical approach to problem solving. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; okay, so i&#39;ve gotten wrapped up in my comparison of formalized <br/>\n </span></blockquote>math to reading. what if <br/>\n<blockquote><span title=\"ireply\"> &gt; my kids *don&#39;t* choose to learn to read? i don&#39;t think that&#39;s <br/>\n </span></blockquote>possible. i feel like if i raise <br/>\n<blockquote><span title=\"ireply\"> &gt; them in a text-rich environment in which reading is interesting <br/>\n </span></blockquote>and essential and relevant, <br/>\n<blockquote><span title=\"ireply\"> &gt; they simply WILL learn to read. i don&#39;t see how math is any <br/>\n </span></blockquote>different except that so many <br/>\n<blockquote><span title=\"ireply\"> &gt; parents are afraid of it or ignorant about it or do not use it <br/>\n </span></blockquote>themselves.  obviously, those <br/>\n<blockquote><span title=\"ireply\"> &gt; kids would not be growing up in a math-enriched environment.<br/>\n<br/>\n </span></blockquote>This is the sort of mis-understanding I want to address - the Math <br/>\nis still there, even if mom doesn&#39;t see it. Its *not* like learning <br/>\nto read - its not really necessary to provide a &quot;math rich <br/>\nenvironment&quot; for people to learn about math. In order to remove the <br/>\nmath from daily life you&#39;d have to shut someone in a sensory <br/>\ndeprivation tank. Eating and drinking involve mathematical concepts. <br/>\nPreparing food requires using them. Playing with any toy at all <br/>\ninvolves mathematical concepts. Sharing toys with siblings or <br/>\nfriends requires using those concepts. Looking at a car involves <br/>\nmathematical concepts - and driving one involves using them. <br/>\n<br/>\nSo its not that anyone needs to create a &quot;math rich environment&quot; - <br/>\nits impossible to have an environment that lacks math. Formalized <br/>\nmath is something else again. Its lovely - but its not something <br/>\nmost people use. If anything, many people learn to actively avoid <br/>\nanything that looks like formal math in the same way that many <br/>\nothers learn to avoid organized sports (and for the same reasons). <br/>\nIts possible to go one&#39;s whole life without playing American <br/>\nfootball, and its equally possible to go without learning a single <br/>\ntheorem.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; anyways, i think there are so many ways to make math a part of <br/>\n </span></blockquote>life. and not in a forcing <br/>\n<blockquote><span title=\"ireply\"> &gt; or &quot;you should learn this&quot; way, just in a providing-paths-for-<br/>\n </span></blockquote>exploring-your-child&#39;s-<br/>\n<blockquote><span title=\"ireply\"> &gt; interest way<br/>\n<br/>\n </span></blockquote>Its totally possible to make formalized math a familiar part of <br/>\nnormal life, but its not necessary in the same way learning to play <br/>\nbaseball isn&#39;t necessary. Some kids will find it fun, others <br/>\nbaffling - or utterly dull. Yes, the opportunity *should* be <br/>\navailable, but parents without a lot of math skills need to know <br/>\nthat they don&#39;t have to talk about numbers and proofs and equations <br/>\nfor their kids to learn about math *and* parents with kids who <br/>\naren&#39;t very logical, or who have had an ugly time in school need to <br/>\nknow that their kids really will learn &quot;enough&quot; about math to do <br/>\nwhat the want to do in their lives *without* the formal stuff. <br/>\n<br/>\nI&#39;m not trying to discourage Anyone from sharing their love of <br/>\nformalized math with their kids! Good grief, that would be like <br/>\nsaying &quot;read to your kids but avoid mentioning sonnets&quot; or &quot;play <br/>\nwith your kids, but don&#39;t say anything about soccer&quot;. That&#39;s not <br/>\nwhat I&#39;m trying to say at all.<br/>\n<br/>\n---Meredith (Mo 6, Ray 14)</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: algebra IRL (long and rambling)","postDate":"1191322152","msgId":26635,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQwRjU3RTdBLUZCMzctNDJBRi1BNEU2LUZENUNCNUQ5NzYwN0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGZkcjV1OCtzM3ZjQGVHcm91cHMuY29tPg==","referencesHeader":"PGZkcjV1OCtzM3ZjQGVHcm91cHMuY29tPg=="},"prevInTopic":26620,"nextInTopic":26636,"prevInTime":26634,"nextInTime":26636,"topicId":26540,"numMessagesInTopic":0,"msgSnippet":"... As a math head I do enjoy a good formula. But not everyone does. Just as not everyone enjoys a Jackson Pollock painting. I have noticed an interesting","messageBody":"<div id=\"ygrps-yiv-1259730978\">On Oct 1, 2007, at 12:06 PM, Elly wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; ok, maybe i&#39;m the only nerd who feels this way, but there IS a  <br/>\n&gt; value to formalizing the<br/>\n&gt; math<br/>\n<br/>\n </span></blockquote>As a math head I do enjoy a good formula.<br/>\n<br/>\nBut not everyone does. Just as not everyone enjoys a Jackson Pollock  <br/>\npainting.<br/>\n<br/>\nI have noticed an interesting phenomenon. I went through school  <br/>\nsucking up the algebra process. I  enjoyed identifying the type of  <br/>\nproblem and finding the type of solution that went with it. It was  <br/>\nlike puzzles to me.<br/>\n<br/>\nBut I didn&#39;t truly understand the underlying concepts of what the  <br/>\nformulas represented.<br/>\n<br/>\nOver the years, though, I&#39;ve come to understand what lays beneath the  <br/>\nmath, how the numbers relate to one another. I *conceptually*  <br/>\nunderstand what&#39;s going on even though I&#39;ve forgotten most of the  <br/>\nformulas. I can *conceptually* figure out the area of a right  <br/>\ntriangle in a number of ways because I understand how all the pieces  <br/>\nrelate to each other.<br/>\n<br/>\nMy husband teaches college math. He&#39;s become an expert at applying  <br/>\nformulas to problems.<br/>\n<br/>\nRecently, as just one example, he was stuck on an algebra problem and  <br/>\nasked me to help him see where he was stuck. He wanted to hand me the  <br/>\nformula but I didn&#39;t want that. I want to see how the parts all  <br/>\nworked together.<br/>\n<br/>\nI remember what it was and it&#39;s a good one for illustration.<br/>\n<br/>\nThere are two inspectors working independently. A part passes  <br/>\ninspection only if both inspectors pass it. If inspector A passes 80%  <br/>\nand inspector B passes 60%, and the percentage of parts that both  <br/>\npass is 40%, how many parts are passed by only one inspector?<br/>\n<br/>\nThere is a formula to calculate that.<br/>\n<br/>\nBut the formula doesn&#39;t help you understand the underlying  <br/>\nrelationships. It&#39;s a short cut so you don&#39;t have to write out all  <br/>\nthe possibilities. I simplified the problem to 5 parts being  <br/>\ninspected, drew a chart of possibilities and came up with not only  <br/>\nthe answer but the formula. I could see the underlying way things  <br/>\nwere working and I could see how the formula represented that.<br/>\n<br/>\nBut my husband was stuck because he&#39;s so used to plugging numbers  <br/>\ninto a formula (and enjoys that part of math.) He doesn&#39;t need to  <br/>\nunderstand what the formula represents. He just knows this problem  <br/>\nuses this formula because that&#39;s how math is taught in school. (He&#39;s  <br/>\na smart guy and *could* figure it out and understood what I showed  <br/>\nhim. The point is that for school math he doesn&#39;t need to understand.  <br/>\nHe just needs to know how to recognize which problem gets which  <br/>\nformula.)<br/>\n<br/>\nHe&#39;s an adjunct professor, by the way, not someone with a degree in  <br/>\nmath. His love of teaching math comes from a love of school math. I  <br/>\nloved school math too. I got As in it but it&#39;s only after being away  <br/>\nfrom it that I can see the underlying flaws in how it&#39;s taught. It  <br/>\ndoesn&#39;t teach what they hope it teaches.<br/>\n<br/>\nAnd *that&#39;s* where the argument lies. What people here are trying to  <br/>\npoint out is that unschooling is about understanding the underlying  <br/>\nrelationships: intuitively seeing how one thing relates to another.  <br/>\nThat&#39;s what carpenters do. That&#39;s what the ladies buying fabric do.  <br/>\nThere may be a formula that will give them an answer, but it&#39;s just a  <br/>\n*representation* of what&#39;s going on underneath. What people are  <br/>\ntrying to point out is that once someone has the underlying  <br/>\nunderstanding, seeing and understanding the representation (formula)  <br/>\nis not that hard.<br/>\n<br/>\nNo one. NO ONE, is saying avoid formulas just because that&#39;s what  <br/>\nthey do in school. What people are saying is until you can see how  <br/>\nimportant an underlying understanding of what the formulas represent  <br/>\nis, you&#39;re not going to be able to see what math really is. Until you  <br/>\ncan forget that huge reliance that schools have on formulas, you  <br/>\nwon&#39;t understand what their purpose really is. It took me *years* of  <br/>\nletting go of formulas, *years* of seeing real understand of number  <br/>\nrelationships being applied without formulas to appreciate formulas  <br/>\nand what their purpose is.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; driving a car is NOT the same as knowing algebra.<br/>\n&gt;<br/>\n </span></blockquote>No it isn&#39;t, but experiencing real life is how people build up a  <br/>\n*conceptual* (feel it in the bones) understanding what the formulas  <br/>\nare trying to represent.<br/>\n<br/>\nSchools hope that the conceptual understanding will come from the  <br/>\nformulas. Mainly because they can&#39;t teach -- and more importantly  <br/>\ncan&#39;t test for -- conceptual understanding.<br/>\n<br/>\nMostly it doesn&#39;t work. A few people who would have understood anyway  <br/>\ndo get it. Lots of people come out with lots of nifty formulas to  <br/>\nsolve book problems. (Lots of people  come out hating it.) I had  <br/>\nnifty formulas after 4 years of engineering. What I experienced in  <br/>\nreal life were messy problems that didn&#39;t look like book problems! To  <br/>\nsolve the problems required an underlying understanding of what was  <br/>\ngoing on. I didn&#39;t really have that. Once someone set the problem up  <br/>\nI could do it, but setting it up is the real work and setting it up  <br/>\nrequires understanding what&#39;s really going on beneath the formula and  <br/>\nnumbers. A computer can solve it!<br/>\n<br/>\nSomeone in college said that boys got physics (mechanics really)  <br/>\nbecause they had spent the previous 17 years throwing, catching and  <br/>\n*being* the ball. Their bodies understood the principles and all they  <br/>\nneeded was to see how the formula related to what they already  <br/>\nunderstood. The girls needed to try to understand the underlying  <br/>\nprinciples through the formula. It didn&#39;t work nearly as well for the  <br/>\ngirls as the boys!<br/>\n<br/>\n(Yes, that&#39;s a bit sexist but it was 30 years ago ;-) Though I do  <br/>\nthink it still tends to fall along testosterone lines: boys are more  <br/>\nlikely (though not exclusively!) to be asking &quot;Let&#39;s see what happens  <br/>\nwhen I punch this really hard.&quot; ;-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: algebra IRL (long and rambling)","postDate":"1191289559","msgId":26620,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4Njk3MS45MjQ5Ny5xbUB3ZWI1MzgwMy5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGZkcm1jcSs1MTluQGVHcm91cHMuY29tPg=="},"prevInTopic":26619,"nextInTopic":26635,"prevInTime":26619,"nextInTime":26621,"topicId":26540,"numMessagesInTopic":0,"msgSnippet":"and something that s always driven me *nuts* about mythbusters is that, while i love many of hte experiments they do, it sometimes frustrates me that they do","messageBody":"<div id=\"ygrps-yiv-530581587\">and something that&#39;s always driven me *nuts* about mythbusters is that, while i love many <br/>\nof hte experiments they do, it sometimes frustrates me that they do all the experiments <br/>\nand never discuss the math/physics/ whatever underlying some of the myths that they&#39;re <br/>\ntrying to bust. and so sometimes their experiments work and they either bust or don&#39;t <br/>\nbust the myth, which is fine, and satisfying as a &quot;proof by example&quot; or &quot;disproof by <br/>\ncounterexample&quot; or whatever, but sometimes they neither prove nor disprove with their <br/>\nexperiments and are left basically saying &quot;we dunno&quot;---those situations especially just <br/>\nBEG for math. they had one on mirrors where they were trying to reflect hte light of the <br/>\nsun onto a specific point to make a fire. that just BEGGED to me for a physics book and <br/>\nsome formulas---they could&#39;ve figured out just how many mirrors etc and whether it <br/>\nwould&#39;ve been physically possible, and THEN tried to build it to demonstrate. ..<br/>\n<br/>\n   <br/>\n  *****<br/>\n  Honestly, if they digressed into a physics book, we&#39;d stop watching.  I don&#39;t care about all the details of every experiment, but many of them have prompted us to explore the science or math behind them.  As you said, if a child is watching mythbusters and they want to explore further that&#39;s an opportunity for adult and parent to do so -- along the way they&#39;ll find a physics book if they need one.<br/>\n   <br/>\n  I realize part of what bothers me about this topic is the assumption that math is somehow more important than other topics, for example history (I&#39;m a big history buff and find it very relevant to life in this world).  Sadly, history as it&#39;s taught in public schools is nothing more than propaganda, and it&#39;s taught in such a boring fashion that most people don&#39;t care about history by the time they hit college, when the real education on history is available to them. <br/>\n   <br/>\n  Sylvia<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nGot a little couch potato? <br/>\nCheck out fun summer activities for kids.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: algebra IRL (long and rambling)","postDate":"1191289236","msgId":26619,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4ODU1OS44MTYxNy5xbUB3ZWI1MzgwMi5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGZkcmxxaytrcDVhQGVHcm91cHMuY29tPg=="},"prevInTopic":26618,"nextInTopic":26620,"prevInTime":26618,"nextInTime":26620,"topicId":26540,"numMessagesInTopic":0,"msgSnippet":"My son is finding math VERY useful -- he wants to be a programmer -preferably game programner. He is loving the calculus he is taking this year, and knows that","messageBody":"<div id=\"ygrps-yiv-1663123530\">My son is finding math VERY useful -- he wants to be a programmer -preferably game programner. He is loving the calculus he is taking this year, and knows that it, along with the physics he has had (andprobably will have in the future at college) will help him with his<br/>\ngoals. <br/>\n   <br/>\n  ****<br/>\n  And for him, the math will be a very useful thing to know.  Not for everyone, tho - some of us need only as much math as it takes to balance the checkbook and prepare our taxes.<br/>\n   <br/>\n  *****<br/>\n<br/>\nWord problems try to be real-life sort of applications, which is why they are so important.<br/>\n   <br/>\n  *****<br/>\n  Then why don&#39;t they make them real-life?  Who gives a fig when Train A will pass Train B on the track between St. Louis and San Francisco?  <br/>\n   <br/>\n  Here&#39;s a math problem any 16yo can solve -- you have $30 in your pocket for your date tonight.  The movie costs $8.75 each, popcorn is 4.50 and cokes 2.75 each.  It&#39;s going to be 20 miles roundtrip to your date&#39;s house and the movie and your gas tank is on empty.  Gas costs $2.75 a gallon, and you get 25 miles to the gallon.  Can you afford movie for two, 2 sodas, shared popcorn and to put enough gas in your car to get back home tonight?  <br/>\n   <br/>\n  That&#39;s when math will get the support of most high school students.<br/>\n   <br/>\n  Sylvia<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nBoardwalk for $500? In 2007? Ha! <br/>\nPlay Monopoly Here and Now (it&#39;s updated for today&#39;s economy) at Yahoo! Games.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: algebra IRL (long and rambling)","postDate":"1191288578","msgId":26618,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2NDg1Ny44MDk2Mi5xbUB3ZWI1MzgwMi5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGZkcmxnNCtmZzloQGVHcm91cHMuY29tPg=="},"prevInTopic":26604,"nextInTopic":26619,"prevInTime":26616,"nextInTime":26619,"topicId":26540,"numMessagesInTopic":0,"msgSnippet":"and i had very good reason to believe it would shrink to a particular size. i am glad to have the ability to decide to calculate this or not rather than","messageBody":"<div id=\"ygrps-yiv-50184676\">and i had very good reason to believe it would shrink to a particular size. i am glad to have the ability to decide to calculate this or not rather than &quot;having to&quot; wash first, IYKWIM.<br/>\n<br/>\nelly<br/>\n<br/>\n  *****<br/>\n  I have the ability -- I could do the math my way, and on paper just to keep track of the smaller numbers, but I doubt it would look like any algebra formula anyone ever wrote.  The two years I spent in high school algebra was the most frustrating experience of my entire life.  Really.  The teachers insisted on *showing work* so they could know you understood the formula being taught. No matter how I tried, those formulas made NO sense to me.  I could figure out the answer in my head -- and get it right -- but not using their formulas.  The just did not make sense to me.  My solution -- at my Mom&#39;s suggestion, since she had the same difference with math learning -- was to do the work my way, get the right answer, then plug my numbers into the required formula.  Math homework took twice as long as it should, and I NEVER learned the formula being taught.  Sure, I got a B in Algebra both years and got my credit, but it scared me away from math for many years.  <br/>\n   <br/>\n  Since then, I&#39;ve discovered that -- had anyone bothered to ask since no one really expected me to excel at math -- that I like have some degree of discalculia. While I was in high school, tho the answer was math for dumb girls and jocks. &lt;g&gt;  The actually made us waste a three- week block on something they called FOIL factoring.  I suspect it was a special form of math designed to keep the non-math students busy, because it took me no time at all to find a much faster method for solving those problems -- again leaving me to do the math twice.  <br/>\n   <br/>\n  I&#39;m sorry to have to say it, but no one can convince me that math -- as it&#39;s taught in high school -- is a useful endeavor at all.<br/>\n   <br/>\n  Sylvia<br/>\n   <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nLooking for a deal? Find great prices on flights and hotels with Yahoo! FareChase.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322052460,"authorName":"Elly","from":"&quot;Elly&quot; &lt;ellyzoe@...&gt;","profile":"ellyzoe1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: algebra IRL (long and rambling)","postDate":"1191271642","msgId":26604,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZkcm1jcSs1MTluQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZkcmU5cithMTFlQGVHcm91cHMuY29tPg=="},"prevInTopic":26603,"nextInTopic":26618,"prevInTime":26603,"nextInTime":26605,"topicId":26540,"numMessagesInTopic":0,"msgSnippet":"... i guess my goal as an unschooler would be to create a lot of opportunities for exploring this. it s not that i want my kids to have to sit in a classroom","messageBody":"<div id=\"ygrps-yiv-2082245487\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Meredith&quot; &lt;meredith@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; The trouble is, that&#39;s not what the vast majority of people learn <br/>\n&gt; from algebra. People either know how to solve problems and apply <br/>\n&gt; that knowledge to algebra or don&#39;t see a connection between the <br/>\n&gt; formalized math and any real life situations. <br/>\n<br/>\n </span></blockquote>i guess my goal as an unschooler would be to create a lot of opportunities for exploring <br/>\nthis. it&#39;s not that i want my kids to have to sit in a classroom and study algebra in a <br/>\nvacuum, it&#39;s that i think it&#39;s a valuable tool to present and demonstrate, and the <br/>\nabstractions should not be rejected as &quot;schoolish&quot;. i guess i think that if a kid wants to <br/>\nbuild a slingshot, or a tree house, or likes to watch &quot;mythbusters&quot;, that part of the <br/>\ndiscussion and part of what the parent would bring to the project would be the math <br/>\nunderlying it. not to press it on the kid, but if i&#39;m helping someone build a slingshot, i <br/>\nmight find it interesting myself to see how heavy of a weight it can lift, or how far it could <br/>\nconceivably throw something and how i could make it throw farther (Etc).<br/>\n<br/>\nand something that&#39;s always driven me *nuts* about mythbusters is that, while i love many <br/>\nof hte experiments they do, it sometimes frustrates me that they do all the experiments <br/>\nand never discuss the math/physics/whatever underlying some of the myths that they&#39;re <br/>\ntrying to bust. and so sometimes their experiments work and they either bust or don&#39;t <br/>\nbust the myth, which is fine, and satisfying as a &quot;proof by example&quot; or &quot;disproof by <br/>\ncounterexample&quot; or whatever, but sometimes they neither prove nor disprove with their <br/>\nexperiments and are left basically saying &quot;we dunno&quot;---those situations especially just <br/>\nBEG for math. they had one on mirrors where they were trying to reflect hte light of the <br/>\nsun onto a specific point to make a fire. that just BEGGED to me for a physics book and <br/>\nsome formulas---they could&#39;ve figured out just how many mirrors etc and whether it <br/>\nwould&#39;ve been physically possible, and THEN tried to build it to demonstrate...<br/>\n<br/>\nanyways, i think there are so many ways to make math a part of life. and not in a forcing <br/>\nor &quot;you should learn this&quot; way, just in a providing-paths-for-exploring-your-child&#39;s-<br/>\ninterest way, just as we help our kids with anything (including reading). it seems like <br/>\nthere&#39;s a little &quot;equation phobia&quot; here (am i misreading?) where it&#39;s almost as though since <br/>\nequations and abstractions are taught in school folks don&#39;t believe they should be part of <br/>\nlife or discussed at all. seems to me like they&#39;re as much a part of life as letters and books. <br/>\nnot something to be forced, but not something to be avoided either.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;(a real life example <br/>\n&gt; &gt; from recently: if my fabric is 4.9 meters long and is likely to <br/>\n&gt; shrink to 4.7m after washing, <br/>\n&gt; &gt; and i want to cut it, prewashing, into a piece that, post-washing, <br/>\n&gt; will end up 3.2m, where <br/>\n&gt; &gt; do i cut?)<br/>\n&gt; <br/>\n&gt; Perfect! I worked in fabric stores for years, talked to lots and <br/>\n&gt; lots of customers and co-workers with high-school algebra who never <br/>\n&gt; once realized that was an algebra problem. Most people learn that <br/>\n&gt; sort of thing either by trial and error or asking the lady who is <br/>\n&gt; cutting the fabric &quot;how much will it shrink?&quot; <br/>\n<br/>\n </span></blockquote>yeah, well obviously that would be my goal in enabling my kids to understand math; to live <br/>\nit & help with it as it&#39;s relevant to our lives, just like with reading or walking or anything <br/>\nelse, and hopefully it will be connected to and relevant to their lives.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; From an unschooling perspective, its more important to ask yourself <br/>\n&gt; what will happen if your kids *don&#39;t* either understand or choose to <br/>\n&gt; use formalized mathematical notations as a means of problem solving. <br/>\n&gt; Do you push them to do it bc you believe its &quot;good for them&quot;? Do you <br/>\n&gt; drop the matter and hope it never comes up? Do you help your kids <br/>\n&gt; find other, different ways of looking at situations and finding <br/>\n&gt; solutions? <br/>\n<br/>\n </span></blockquote>okay, so i&#39;ve gotten wrapped up in my comparison of formalized math to reading. what if <br/>\nmy kids *don&#39;t* choose to learn to read? i don&#39;t think that&#39;s possible. i feel like if i raise <br/>\nthem in a text-rich environment in which reading is interesting and essential and relevant, <br/>\nthey simply WILL learn to read. i don&#39;t see how math is any different except that so many <br/>\nparents are afraid of it or ignorant about it or do not use it themselves. obviously, those <br/>\nkids would not be growing up in a math-enriched environment. do y&#39;all think there&#39;s <br/>\nsomething fundamentally unnatural about math that isn&#39;t so of reading, walking, or <br/>\ntalking?<br/>\n<br/>\ni guess i feel like it&#39;s part of my job as a parent to create a math-enriched environment, <br/>\njust as it is my job to create a text-enriched environment, with magazines and papers and <br/>\nmail and books and notes and etc, and just as it is my job to create an environment <br/>\nenriched with movement, with swings and slides and climbing structures and bikes and <br/>\netc. it&#39;s part of creating a healthy place in which a complete person can develop, and <br/>\ntrusting them to develop fully. and yes, i&#39;d say being able to formulate and solve basic <br/>\nalgebra problems is part of developing fully. i dunno that i could argue the same about <br/>\ncalculus, though dh thinks he could. ;)<br/>\n<br/>\nthanks for providing food for thought!<br/>\n<br/>\nelly</div>","specialLinks":[]},{"userId":203677783,"authorName":"trektheory","from":"&quot;trektheory&quot; &lt;trektheory@...&gt;","profile":"trektheory","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: algebra IRL (long and rambling)","postDate":"1191271060","msgId":26603,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZkcmxxaytrcDVhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZkcjV1OCtzM3ZjQGVHcm91cHMuY29tPg=="},"prevInTopic":26602,"nextInTopic":26604,"prevInTime":26602,"nextInTime":26604,"topicId":26540,"numMessagesInTopic":0,"msgSnippet":"... to formalizing the ... what-have-you. No, you aren t the only one.  The point I had been trying to make earlier (and failed, I think - and I dropped it","messageBody":"<div id=\"ygrps-yiv-1340134708\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Elly&quot; &lt;ellyzoe@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; ok, maybe i&#39;m the only nerd who feels this way, but there IS a value<br/>\n </span></blockquote>to formalizing the <br/>\n<blockquote><span title=\"ireply\"> &gt; math, and not just knowing how to drive, or how to saw trim, or<br/>\n </span></blockquote>what-have-you.<br/>\n<br/>\nNo, you aren&#39;t the only one.  The point I had been trying to make<br/>\nearlier (and failed, I think - and I dropped it there) was that when<br/>\nyou make those judgements while driving, you are NOT doing an<br/>\nequation.  I defy anyone judging when to apply the brakes to tell me<br/>\nwhat variable they were solving for, what the distance between their<br/>\ncar and the one in front was, etc.  Real world estimating, sure, but<br/>\nnot equation solving.<br/>\n<br/>\nMy son is finding math VERY useful -- he wants to be a programmer -<br/>\npreferably game programner.  He is loving the calculus he is taking<br/>\nthis year, and knows that it, along with the physics he has had (and<br/>\nprobably will have in the future at college) will help him with his<br/>\ngoals.  <br/>\n<br/>\nWord problems try to be real-life sort of applications, which is why<br/>\nthey are so important.  Some things, yeah, you can jerry-rig them<br/>\nwithout precise calculations.  Other things, though, you do want to<br/>\nget right, or you may waste a lot of time and/or money.  <br/>\n<br/>\n(BTW, if anyone has a child who is trying to learn algebra word<br/>\nproblems and is having trouble, the book that was a HUGE help to my<br/>\nson was How To Solve Algebra Word Problems.  Straight forward title,<br/>\neh?  We borrowed it from the library.)<br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":322052460,"authorName":"Elly","from":"&quot;Elly&quot; &lt;ellyzoe@...&gt;","profile":"ellyzoe1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: algebra IRL (long and rambling)","postDate":"1191270724","msgId":26602,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZkcmxnNCtmZzloQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU2NzUxOS4yMTUzNi5xbUB3ZWI1MzgwOC5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":26594,"nextInTopic":26603,"prevInTime":26601,"nextInTime":26603,"topicId":26540,"numMessagesInTopic":0,"msgSnippet":"... 4.7m after washing, and i want to cut it, prewashing, into a piece that, post-washing, will end up 3.2m, where do i cut?) at will. ... there something to","messageBody":"<div id=\"ygrps-yiv-1165378913\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Sylvia Toyama &lt;sylgt04@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; a real life example from recently: if my fabric is 4.9 meters long and is likely to shrink to <br/>\n </span></blockquote>4.7m after washing, and i want to cut it, prewashing, into a piece that, post-washing, will <br/>\nend up 3.2m, where do i cut?) at will.<br/>\n<blockquote><span title=\"ireply\"> &gt;    <br/>\n&gt;   ****<br/>\n&gt;   Um, if the size will be important to me post-washing, why not just cut it down then?  Is <br/>\n </span></blockquote>there something to be gained by cutting first, and washing second?  And if so, this sounds <br/>\nmore like a fabric/sewing problem than a math problem.  Besides that, I have no faith in <br/>\nthe objective measure of how much my washer and dryer (and can I stretch and use a <br/>\nclothesline instead of a dryer?) will shrink it.  I feel much safe just chucking the math and <br/>\nwashing before I cut. <br/>\n<br/>\nah. it&#39;s a lot nicer to work with pre-washing---flat and starched and stretched out from <br/>\nthe loom. washing can tend to warp fabrics. ironing can help, but prewashing is just so <br/>\nmuch easier with many fabrics. and i had very good reason to believe it would shrink to a <br/>\nparticular size. i am glad to have the ability to decide to calculate this or not rather than <br/>\n&quot;having to&quot; wash first, IYKWIM.<br/>\n<br/>\nelly</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: algebra IRL (long and rambling)","postDate":"1191263355","msgId":26594,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZkcmU5cithMTFlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZkcjV1OCtzM3ZjQGVHcm91cHMuY29tPg=="},"prevInTopic":26589,"nextInTopic":26602,"prevInTime":26593,"nextInTime":26595,"topicId":26540,"numMessagesInTopic":0,"msgSnippet":"... value to formalizing the ... what-have-you. the ... problems that you ... driving thing exactly. The trouble is, that s not what the vast majority of","messageBody":"<div id=\"ygrps-yiv-1353655001\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Elly&quot; &lt;ellyzoe@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; ok, maybe i&#39;m the only nerd who feels this way, but there IS a <br/>\n </span></blockquote>value to formalizing the <br/>\n<blockquote><span title=\"ireply\"> &gt; math, and not just knowing how to drive, or how to saw trim, or <br/>\n </span></blockquote>what-have-you. the <br/>\n<blockquote><span title=\"ireply\"> &gt; value, in my eyes anyways, is in knowing how to quickly solve NEW <br/>\n </span></blockquote>problems that you <br/>\n<blockquote><span title=\"ireply\"> &gt; haven&#39;t seen before, and in knowing how to solve problems like the <br/>\n </span></blockquote>driving thing exactly.<br/>\n<br/>\nThe trouble is, that&#39;s not what the vast majority of people learn <br/>\nfrom algebra. People either know how to solve problems and apply <br/>\nthat knowledge to algebra or don&#39;t see a connection between the <br/>\nformalized math and any real life situations. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;(a real life example <br/>\n&gt; from recently: if my fabric is 4.9 meters long and is likely to <br/>\n </span></blockquote>shrink to 4.7m after washing, <br/>\n<blockquote><span title=\"ireply\"> &gt; and i want to cut it, prewashing, into a piece that, post-washing, <br/>\n </span></blockquote>will end up 3.2m, where <br/>\n<blockquote><span title=\"ireply\"> &gt; do i cut?)<br/>\n<br/>\n </span></blockquote>Perfect! I worked in fabric stores for years, talked to lots and <br/>\nlots of customers and co-workers with high-school algebra who never <br/>\nonce realized that was an algebra problem. Most people learn that <br/>\nsort of thing either by trial and error or asking the lady who is <br/>\ncutting the fabric &quot;how much will it shrink?&quot; <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; so: school may suck in many ways, but numbers and x&#39;s and y&#39;s are <br/>\n </span></blockquote>GREAT at versatility; i <br/>\n<blockquote><span title=\"ireply\"> &gt; hope my kids choose to use and understand them.<br/>\n<br/>\n </span></blockquote>They may not have the option of &quot;choosing to understand them&quot; you <br/>\nknow. Some people don&#39;t solve problems via logic - my stepson is <br/>\none. It drives me and his dad batty sometimes because we&#39;re both <br/>\nterribly logical thinkers (me especially). I&#39;ve found personality <br/>\nand learning models like the MBTI and Gardner&#39;s theory of Multiple <br/>\nIntelligences very helpful in learning to understand that this isn&#39;t <br/>\nsome kind of lack on Ray&#39;s part - its a whole different way of <br/>\nthinking. *I* need those formalized models to help me think about <br/>\nhim, but he doesn&#39;t need them to understand himself or his own <br/>\nlearning processes.<br/>\n<br/>\nFrom an unschooling perspective, its more important to ask yourself <br/>\nwhat will happen if your kids *don&#39;t* either understand or choose to <br/>\nuse formalized mathematical notations as a means of problem solving. <br/>\nDo you push them to do it bc you believe its &quot;good for them&quot;? Do you <br/>\ndrop the matter and hope it never comes up? Do you help your kids <br/>\nfind other, different ways of looking at situations and finding <br/>\nsolutions? <br/>\n<br/>\n---Meredith (did I deliberately word my answers so as to suggest a <br/>\nspecific result? wink)</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: algebra IRL (long and rambling)","postDate":"1191261028","msgId":26589,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI2ODhDMDcxLThGMDEtNEU2Ri1BNTU0LTIyNUYxRjZCMTRBNEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGZkcjV1OCtzM3ZjQGVHcm91cHMuY29tPg==","referencesHeader":"PGZkcjV1OCtzM3ZjQGVHcm91cHMuY29tPg=="},"prevInTopic":26585,"nextInTopic":26594,"prevInTime":26588,"nextInTime":26590,"topicId":26540,"numMessagesInTopic":0,"msgSnippet":"... I m a statistician and economist, myself, and really enjoyed learning formal math. I enjoy helping other people learn it, when they re interested. My","messageBody":"<div id=\"ygrps-yiv-226578676\">On Oct 1, 2007, at 9:06 AM, Elly wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; so: school may suck in many ways, but numbers and x&#39;s and y&#39;s are  <br/>\n&gt; GREAT at versatility; i<br/>\n&gt; hope my kids choose to use and understand them.<br/>\n<br/>\n </span></blockquote>I&#39;m a statistician and economist, myself, and really enjoyed learning  <br/>\nformal math. I enjoy helping other people learn it, when they&#39;re  <br/>\ninterested.<br/>\n<br/>\nMy observation and experience has been that those who have LOTS and  <br/>\nlots and lots of experience of all kinds, but little paper and pencil  <br/>\n(or online, these days) formal structured math, are very capable of  <br/>\nlearning the formal math later, if and when they do have an interest  <br/>\nor discover a need for it.<br/>\n<br/>\nAlso, because numbers and equations and geometry and measurement are,  <br/>\nas you said, &quot;GREAT,&quot; kids will be drawn to them and will choose to  <br/>\nuse and understand them.<br/>\n<br/>\nBut, that doesn&#39;t mean that parents need to act like schoolteachers  <br/>\nand provide lessons. It can all happen completely naturally and even  <br/>\nthe formal stuff can arise out of genuine interests.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: algebra IRL (long and rambling)","postDate":"1191258465","msgId":26585,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU2NzUxOS4yMTUzNi5xbUB3ZWI1MzgwOC5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGZkcjV1OCtzM3ZjQGVHcm91cHMuY29tPg=="},"prevInTopic":26581,"nextInTopic":26589,"prevInTime":26584,"nextInTime":26586,"topicId":26540,"numMessagesInTopic":0,"msgSnippet":"a real life example from recently: if my fabric is 4.9 meters long and is likely to shrink to 4.7m after washing, and i want to cut it, prewashing, into a","messageBody":"<div id=\"ygrps-yiv-1995546816\">a real life example from recently: if my fabric is 4.9 meters long and is likely to shrink to 4.7m after washing, and i want to cut it, prewashing, into a piece that, post-washing, will end up 3.2m, where do i cut?) at will.<br/>\n   <br/>\n  ****<br/>\n  Um, if the size will be important to me post-washing, why not just cut it down then?  Is there something to be gained by cutting first, and washing second?  And if so, this sounds more like a fabric/sewing problem than a math problem.  Besides that, I have no faith in the objective measure of how much my washer and dryer (and can I stretch and use a clothesline instead of a dryer?) will shrink it.  I feel much safe just chucking the math and washing before I cut. <br/>\n   <br/>\n  ****<br/>\n  so: school may suck in many ways, but numbers and x&#39;s and y&#39;s are GREAT at versatility; i hope my kids choose to use and understand them.<br/>\n   <br/>\n  *****<br/>\n  I do almost all math in my head (have since I was a kid, as did/do my parents) and have figured out my own formulas for how to answer the math-kinda questions that come up in every day life (or like the fabric I answer them without using algebra, thru other practical methods) but I have no idea how that would look on paper. And yet, it still works for me.  However, if my kids choose never to figure out these tricks it won&#39;t bother me a bit!  I&#39;m sure they&#39;ll fill their heads and minds with the life-coping skills they need in their own lives, not those I deem necessary.  After all, I don&#39;t get to live their lives!<br/>\n   <br/>\n  Sylvia<br/>\n<br/>\n<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nBuilding a website is a piece of cake. <br/>\nYahoo! Small Business gives you all the tools to get online.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322052460,"authorName":"Elly","from":"&quot;Elly&quot; &lt;ellyzoe@...&gt;","profile":"ellyzoe1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: algebra IRL (long and rambling)","postDate":"1191254791","msgId":26581,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZkcjV1OCtzM3ZjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZkbTFyditmY3ZtQGVHcm91cHMuY29tPg=="},"prevInTopic":26576,"nextInTopic":26585,"prevInTime":26580,"nextInTime":26582,"topicId":26540,"numMessagesInTopic":0,"msgSnippet":"ok, maybe i m the only nerd who feels this way, but there IS a value to formalizing the math, and not just knowing how to drive, or how to saw trim, or","messageBody":"<div id=\"ygrps-yiv-1121806226\">ok, maybe i&#39;m the only nerd who feels this way, but there IS a value to formalizing the <br/>\nmath, and not just knowing how to drive, or how to saw trim, or what-have-you. the <br/>\nvalue, in my eyes anyways, is in knowing how to quickly solve NEW problems that you <br/>\nhaven&#39;t seen before, and in knowing how to solve problems like the driving thing exactly.<br/>\n<br/>\ndriving a car is NOT the same as knowing algebra. driving a car is driving a car. knowing <br/>\nalgebra is being able to figure out any number of other calculations (a real life example <br/>\nfrom recently: if my fabric is 4.9 meters long and is likely to shrink to 4.7m after washing, <br/>\nand i want to cut it, prewashing, into a piece that, post-washing, will end up 3.2m, where <br/>\ndo i cut?) at will. driving a car, no matter how skilled i am at it, will not help me figure out <br/>\nany other non-driving related problems. yes, you could formulate kelly&#39;s examples <br/>\nalgebraically and precisely, but you don&#39;t need to to drive and i&#39;d hazard a guess that <br/>\n99.999 percent of people never do.<br/>\n<br/>\nso: school may suck in many ways, but numbers and x&#39;s and y&#39;s are GREAT at versatility; i <br/>\nhope my kids choose to use and understand them.<br/>\n<br/>\nelly<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Meredith&quot; &lt;meredith@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;trektheory&quot; <br/>\n&gt; &lt;trektheory@&gt; wrote:<br/>\n&gt; &gt;  I don&#39;t view that as solving an equation,<br/>\n&gt; &gt; though - the level of precision isn&#39;t there.<br/>\n&gt; <br/>\n&gt; I&#39;d disagree ;) It&#39;s totally possible to represent Kelly&#39;s examples <br/>\n&gt; algebraically, and pretty precicely, if you wanted to. One of the <br/>\n&gt; skills drivers learn is &quot;eyeballing&quot; those kinds of measurements - <br/>\n&gt; 200ft looks different if you&#39;re looking at a line on the road vs a <br/>\n&gt; vertical surface, and different at 5mph than at 15mph. That &quot;seems&quot; <br/>\n&gt; imprecise, but I&#39;ve learned to &quot;eyeball&quot; a quarter of an inch while <br/>\n&gt; sewing, and at one point I could &quot;eyeball&quot; measurements in tenths of <br/>\n&gt; a milimeter under a microscope.<br/>\n&gt; <br/>\n&gt; It can also be solved without getting into the physics/calculus, <br/>\n&gt; since the objects in motion are on a (relatively) flat surface - <br/>\n&gt; just as statstical problems can be solved algebraically or via <br/>\n&gt; calculus without necessarily sacrificing precision. <br/>\n&gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; However, there ARE real-life reasons for knowing and using algebra,<br/>\n&gt; &gt; geometry, trig., etc.  Heck, ask your local carpenter how he <br/>\n&gt; figures<br/>\n&gt; &gt; out odd-angle mitred corners. <br/>\n&gt; <br/>\n&gt; Since I happen to have a carpenter handy...he uses a tool. He makes <br/>\n&gt; or buys a jig and does a bit of trial-and-error. I&#39;m not trying to <br/>\n&gt; be obnoxious, but it really does help, when thinking about the way <br/>\n&gt; people learn, to step away from the obvious a bit. There&#39;s as much <br/>\n&gt; (and sometimes more) conceptual geometry involved in re-arranging <br/>\n&gt; furniture as carpentry - the carpentry just has more numbers. <br/>\n&gt; <br/>\n&gt; Mathematics isn&#39;t really about numbers, its about relationships. The <br/>\n&gt; relationship between up and down and sideways is so facinating to us <br/>\n&gt; humans that several different kinds of mathematics exist to describe <br/>\n&gt; those relationships - algebra, geometry, trigonometry and calculus <br/>\n&gt; all deal with those relationships in different ways. The math isn&#39;t <br/>\n&gt; in memorizing the jargon and formulas, its in thinking about what <br/>\n&gt; all that stuff is designed to express, and that can be done without <br/>\n&gt; a single number. <br/>\n&gt; <br/>\n&gt; The trouble that most people run into is having been taught that the <br/>\n&gt; numbers and the jargon *are* the math - that&#39;s what makes a <br/>\n&gt; carpenter using a jig &quot;look&quot; more mathematical than a mom trying to <br/>\n&gt; get her kids home from the park before the traffic gets bad, even <br/>\n&gt; though *he&#39;s* just doing what Bubbah showed him and *she&#39;s* juggling <br/>\n&gt; fourteen different variables in her head. <br/>\n&gt; <br/>\n&gt; ---Meredith (Mo 6, Ray 14)<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: algebra IRL","postDate":"1191251116","msgId":26576,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZkcjJiYys5aG84QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMDUwMWM4MDM2NyRjYTI1MGUwMCQ2NjAyYThjMEBsYXVuY2htb2RlbS5jb20+"},"prevInTopic":26560,"nextInTopic":26581,"prevInTime":26575,"nextInTime":26577,"topicId":26540,"numMessagesInTopic":0,"msgSnippet":"... My carpenter says what the heck does she mean by an odd-angled mitre? That s too vague. He learned the geometry formula for figuring out the unknown ","messageBody":"<div id=\"ygrps-yiv-1521964887\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Nance Confer&quot;<br/>\n&lt;marbleface@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; unschoolingbasicsHeck, ask your local carpenter how he figures<br/>\n&gt; out odd-angle mitred corners. <br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>My carpenter says &quot;what the heck does she mean by an &#39;odd-angled&#39;<br/>\nmitre? That&#39;s too vague.&quot;  <br/>\n<br/>\nHe learned the geometry formula for figuring out the unknown<br/>\nmeasurement of one side of a triangle on the job. What he says about<br/>\nbuilding is that basic math skills are all you need unless you&#39;re<br/>\ngetting into extreme precision work (ie: detailed furniture or other<br/>\nmasterwork type building). Basic geometry is occasionally useful, but<br/>\nany kind of regular construction can be done with plain-old-vanilla<br/>\nbasic arithmetic.<br/>\n<br/>\nHe worked in construction for almost 20 years and is one of the most<br/>\nprecise, careful and skilled builders I know and he just told me that<br/>\nprecision math is rather useless when working with wood because it<br/>\nisn&#39;t a precision material.<br/>\n<br/>\nYou can have a 2x4 that is 1 1/2 inches thick or one that is 1 9/16ths<br/>\nthick. Most all the pieces vary slightly, you&#39;re dealing with<br/>\ndifferent grains etc...  Carpenters don&#39;t become great by sitting in a<br/>\nmath class and learning algebra. They learn to become great builders<br/>\nby building. They pick up needed tools as they learn to build. If they<br/>\nneed a geometry formula, a more expert builder will show it to them at<br/>\nthe time they need it (as in dh&#39;s case).<br/>\n<br/>\nThe best kind of learning comes from doing.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":193064123,"authorName":"Nance Confer","from":"&quot;Nance Confer&quot; &lt;marbleface@...&gt;","profile":"nanceconfer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] algebra IRL","postDate":"1191159767","msgId":26560,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDUwMWM4MDM2NyRjYTI1MGUwMCQ2NjAyYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PDExOTExNTkzOTcuODQ1LjE1ODI1Lm00MEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":26554,"nextInTopic":26576,"prevInTime":26559,"nextInTime":26561,"topicId":26540,"numMessagesInTopic":0,"msgSnippet":"unschoolingbasicsHeck, ask your local carpenter how he figures out odd-angle mitred corners. *** Then ask him where he learned how to do this -- in an algebra","messageBody":"<div id=\"ygrps-yiv-1923282032\">unschoolingbasicsHeck, ask your local carpenter how he figures<br/>\nout odd-angle mitred corners. <br/>\n<br/>\n***<br/>\n<br/>\nThen ask him where he learned how to do this -- in an algebra class or on the job.<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":153118561,"authorName":"airokat@comcast.net","from":"airokat@...","profile":"dawakat2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: algebra IRL (long and rambling)","postDate":"1191090016","msgId":26554,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA5MjkyMDA3MTgyMC43MDYxLjQ2RkU5NzYwMDAwNzY5RUMwMDAwMUI5NTIyMDY0MjQ2MTM5QjBFMDUwMTlEMDcwRUBjb21jYXN0Lm5ldD4="},"prevInTopic":26551,"nextInTopic":26560,"prevInTime":26553,"nextInTime":26555,"topicId":26540,"numMessagesInTopic":0,"msgSnippet":"I use geometry while flying airplanes. I use known landmarks and draw trajectory lines in space from point to point, combining two or three trajectories to","messageBody":"<div id=\"ygrps-yiv-663992631\">I use geometry while flying airplanes. I use known landmarks and draw trajectory lines in space from point to point, combining two or three trajectories to figure out angles where my next landmark should be located so I can then pick up a heading and fly it. I use landmarks off on the horizon, really &quot;big picture&quot; stuff. I was not taught to navigate this way. I made it up because it worked for me, and I struggled in Geometry in High School. I have never been lost in an airplane, either, but I have been lost in a car. <br/>\nKathryn<br/>\n<br/>\n-------------- Original message -------------- <br/>\nFrom: &quot;Meredith&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:meredith@...\">meredith@...</a>&gt; <br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;trektheory&quot; <br/>\n&lt;trektheory@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t view that as solving an equation,<br/>\n&gt; though - the level of precision isn&#39;t there.<br/>\n<br/>\n </span></blockquote>I&#39;d disagree ;) It&#39;s totally possible to represent Kelly&#39;s examples <br/>\nalgebraically, and pretty precicely, if you wanted to. One of the <br/>\nskills drivers learn is &quot;eyeballing&quot; those kinds of measurements - <br/>\n200ft looks different if you&#39;re looking at a line on the road vs a <br/>\nvertical surface, and different at 5mph than at 15mph. That &quot;seems&quot; <br/>\nimprecise, but I&#39;ve learned to &quot;eyeball&quot; a quarter of an inch while <br/>\nsewing, and at one point I could &quot;eyeball&quot; measurements in tenths of <br/>\na milimeter under a microscope.<br/>\n<br/>\nIt can also be solved without getting into the physics/calculus, <br/>\nsince the objects in motion are on a (relatively) flat surface - <br/>\njust as statstical problems can be solved algebraically or via <br/>\ncalculus without necessarily sacrificing precision. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; However, there ARE real-life reasons for knowing and using algebra,<br/>\n&gt; geometry, trig., etc. Heck, ask your local carpenter how he <br/>\n </span></blockquote>figures<br/>\n<blockquote><span title=\"ireply\"> &gt; out odd-angle mitred corners. <br/>\n<br/>\n </span></blockquote>Since I happen to have a carpenter handy...he uses a tool. He makes <br/>\nor buys a jig and does a bit of trial-and-error. I&#39;m not trying to <br/>\nbe obnoxious, but it really does help, when thinking about the way <br/>\npeople learn, to step away from the obvious a bit. There&#39;s as much <br/>\n(and sometimes more) conceptual geometry involved in re-arranging <br/>\nfurniture as carpentry - the carpentry just has more numbers. <br/>\n<br/>\nMathematics isn&#39;t really about numbers, its about relationships. The <br/>\nrelationship between up and down and sideways is so facinating to us <br/>\nhumans that several different kinds of mathematics exist to describe <br/>\nthose relationships - algebra, geometry, trigonometry and calculus <br/>\nall deal with those relationships in different ways. The math isn&#39;t <br/>\nin memorizing the jargon and formulas, its in thinking about what <br/>\nall that stuff is designed to express, and that can be done without <br/>\na single number. <br/>\n<br/>\nThe trouble that most people run into is having been taught that the <br/>\nnumbers and the jargon *are* the math - that&#39;s what makes a <br/>\ncarpenter using a jig &quot;look&quot; more mathematical than a mom trying to <br/>\nget her kids home from the park before the traffic gets bad, even <br/>\nthough *he&#39;s* just doing what Bubbah showed him and *she&#39;s* juggling <br/>\nfourteen different variables in her head. <br/>\n<br/>\n---Meredith (Mo 6, Ray 14)<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: algebra IRL (long and rambling)","postDate":"1191086783","msgId":26551,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZkbTFyditmY3ZtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZkbHNjZys1bmV2QGVHcm91cHMuY29tPg=="},"prevInTopic":26550,"nextInTopic":26554,"prevInTime":26550,"nextInTime":26552,"topicId":26540,"numMessagesInTopic":0,"msgSnippet":"... I d disagree ;) It s totally possible to represent Kelly s examples algebraically, and pretty precicely, if you wanted to. One of the skills drivers learn","messageBody":"<div id=\"ygrps-yiv-345183280\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;trektheory&quot; <br/>\n&lt;trektheory@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;  I don&#39;t view that as solving an equation,<br/>\n&gt; though - the level of precision isn&#39;t there.<br/>\n<br/>\n </span></blockquote>I&#39;d disagree ;) It&#39;s totally possible to represent Kelly&#39;s examples <br/>\nalgebraically, and pretty precicely, if you wanted to. One of the <br/>\nskills drivers learn is &quot;eyeballing&quot; those kinds of measurements - <br/>\n200ft looks different if you&#39;re looking at a line on the road vs a <br/>\nvertical surface, and different at 5mph than at 15mph. That &quot;seems&quot; <br/>\nimprecise, but I&#39;ve learned to &quot;eyeball&quot; a quarter of an inch while <br/>\nsewing, and at one point I could &quot;eyeball&quot; measurements in tenths of <br/>\na milimeter under a microscope.<br/>\n<br/>\nIt can also be solved without getting into the physics/calculus, <br/>\nsince the objects in motion are on a (relatively) flat surface - <br/>\njust as statstical problems can be solved algebraically or via <br/>\ncalculus without necessarily sacrificing precision. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; However, there ARE real-life reasons for knowing and using algebra,<br/>\n&gt; geometry, trig., etc.  Heck, ask your local carpenter how he <br/>\n </span></blockquote>figures<br/>\n<blockquote><span title=\"ireply\"> &gt; out odd-angle mitred corners. <br/>\n<br/>\n </span></blockquote>Since I happen to have a carpenter handy...he uses a tool. He makes <br/>\nor buys a jig and does a bit of trial-and-error. I&#39;m not trying to <br/>\nbe obnoxious, but it really does help, when thinking about the way <br/>\npeople learn, to step away from the obvious a bit. There&#39;s as much <br/>\n(and sometimes more) conceptual geometry involved in re-arranging <br/>\nfurniture as carpentry - the carpentry just has more numbers. <br/>\n<br/>\nMathematics isn&#39;t really about numbers, its about relationships. The <br/>\nrelationship between up and down and sideways is so facinating to us <br/>\nhumans that several different kinds of mathematics exist to describe <br/>\nthose relationships - algebra, geometry, trigonometry and calculus <br/>\nall deal with those relationships in different ways. The math isn&#39;t <br/>\nin memorizing the jargon and formulas, its in thinking about what <br/>\nall that stuff is designed to express, and that can be done without <br/>\na single number. <br/>\n<br/>\nThe trouble that most people run into is having been taught that the <br/>\nnumbers and the jargon *are* the math - that&#39;s what makes a <br/>\ncarpenter using a jig &quot;look&quot; more mathematical than a mom trying to <br/>\nget her kids home from the park before the traffic gets bad, even <br/>\nthough *he&#39;s* just doing what Bubbah showed him and *she&#39;s* juggling <br/>\nfourteen different variables in her head. <br/>\n<br/>\n---Meredith (Mo 6, Ray 14)</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Re: algebra IRL","postDate":"1191084289","msgId":26550,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOUQwQ0YyRjM5QUFBMC1CODQtMTNDOUBNQkxLLU0xMC5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PGZkbHNjZys1bmV2QGVHcm91cHMuY29tPg=="},"prevInTopic":26548,"nextInTopic":26551,"prevInTime":26549,"nextInTime":26551,"topicId":26540,"numMessagesInTopic":0,"msgSnippet":"... From: trektheory  Actually, I think that is more of physics.  (Though physics is strongly math-based.) -=-=-=- Yeah---but I never saw","messageBody":"<div id=\"ygrps-yiv-1445062768\">-----Original Message-----<br/>\nFrom: trektheory &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:trektheory@...\">trektheory@...</a>&gt;<br/>\n<br/>\n<br/>\nActually, I think that is more of physics.  (Though physics is<br/>\nstrongly math-based.)<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nYeah---but I never saw much difference between the two.<br/>\n<br/>\nI think I saw physics as &quot;practical algebra.&quot; But neither made too much <br/>\nsense until just a few years ago. I took those subjects waaaay too <br/>\nyoung. I got As, but the letter grades didn&#39;t translate in <br/>\ncomprehension---just correct answers on the page. (Imagaine that!)<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nI don&#39;t view that as solving an equation,<br/>\nthough - the level of precision isn&#39;t there.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nPrecision is in the eye of the rear-ended. &lt;g&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nEmail and AIM finally together. You&#39;ve gotta check out free AOL Mail! - <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.aol.com\">http://mail.aol.com</a></div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: algebra IRL","postDate":"1191082213","msgId":26548,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZkbHRkNSs1NDliQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDOUQwQTg2NkQ1ODM1QS03MDAtQjY0NEB3ZWJtYWlsLW1kMDkuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":26547,"nextInTopic":26550,"prevInTime":26547,"nextInTime":26549,"topicId":26540,"numMessagesInTopic":0,"msgSnippet":"Social situations can also thought of algebraically. Variables can include the number of people in a situation, their ages, whether they are introverts or","messageBody":"<div id=\"ygrps-yiv-585079744\">Social situations can also thought of algebraically. Variables can <br/>\ninclude the number of people in a situation, their ages, whether they <br/>\nare introverts or extroverts (heck, the whole MBTI is a way of <br/>\ndescribing personality types based on four variables), etc.<br/>\n<br/>\nI tend to think about the stressors in mine and my kids&#39; lives in terms <br/>\nof variables that interact with each other. If x=time since protein, <br/>\ny=amount of sleep and z=days to my period, how do we caluclate the <br/>\nlikelihood that Meredith will meltdown in the grocery store?<br/>\n<br/>\n---Meredith (not so well rested, but well-fed and not premenstrual, so <br/>\nits a good day to shop!)</div>","specialLinks":[]},{"userId":203677783,"authorName":"trektheory","from":"&quot;trektheory&quot; &lt;trektheory@...&gt;","profile":"trektheory","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: algebra IRL","postDate":"1191081168","msgId":26547,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZkbHNjZys1bmV2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDOUQwQTg2NkQ1ODM1QS03MDAtQjY0NEB3ZWJtYWlsLW1kMDkuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":26541,"nextInTopic":26548,"prevInTime":26546,"nextInTime":26548,"topicId":26540,"numMessagesInTopic":0,"msgSnippet":"Actually, I think that is more of physics.  (Though physics is strongly math-based.)  I don t view that as solving an equation, though - the level of precision","messageBody":"<div id=\"ygrps-yiv-1956161129\">Actually, I think that is more of physics.  (Though physics is<br/>\nstrongly math-based.)  I don&#39;t view that as solving an equation,<br/>\nthough - the level of precision isn&#39;t there.<br/>\n<br/>\nHowever, there ARE real-life reasons for knowing and using algebra,<br/>\ngeometry, trig., etc.  Heck, ask your local carpenter how he figures<br/>\nout odd-angle mitred corners. <br/>\n<br/>\nFiguring out how to optimize your fenced garden for minimal money? <br/>\nThe length of the edges/area inside for the garden (and if you have<br/>\nrambunctious dogs, a fence may be critical!) is an algebraic equation.<br/>\n<br/>\nNot to mention optimal yield in your garden.  (Planting fewer plants<br/>\nwith higher yields, vs more plants with lower yields per plant.)  <br/>\n<br/>\nOther physics -- playing with magnets (that is always a blast!),<br/>\ntossing a ball up in the air and catching it, etc.<br/>\n<br/>\nAnd if you play games, well, there you get probability.  <br/>\n<br/>\nOh, I love math!  ;-)<br/>\n<br/>\nLinda<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, kbcdlovejo@... wrote:<br/>\n&gt;<br/>\n&gt; I had a few unschooling families over last week. Math came up, as usual.<br/>\n&gt; <br/>\n&gt; In the midst of explaining that math is everywhere and a part of daily <br/>\n&gt; life, I came up with a really simple example of how we all use it every <br/>\n&gt; day.<br/>\n&gt; <br/>\n&gt; You understand that algebra is simply understanding how variables <br/>\n&gt; change the equation, right? That&#39;s all it is: that something that <br/>\n&gt; *varies* changes the situation.<br/>\n&gt; <br/>\n&gt; So...<br/>\n&gt; <br/>\n&gt; You&#39;re driving along. Up ahead you see a traffic light that&#39;s red. When <br/>\n&gt; (at what point) do you apply your brakes?<br/>\n&gt; <br/>\n&gt; You&#39;re driving long. At that light, there&#39;s a car stopped in front of <br/>\n&gt; you. *Now* when do you apply your brakes?<br/>\n&gt; <br/>\n&gt; You&#39;re driving along. At the light, there&#39;s a car stopped in front of <br/>\n&gt; you, and it&#39;s raining. *Now* when do you apply your brakes?<br/>\n&gt; <br/>\n&gt; You&#39;re driving along---in a *friend&#39;s* new car (one you&#39;ve never driven <br/>\n&gt; before). There&#39;s a car stopped in front of you, and it&#39;s raining. *Now* <br/>\n&gt; when do you apply your brakes?<br/>\n&gt; <br/>\n&gt; While driving, we solve all sorts of algebraic equations---many in a <br/>\n&gt; split-second. Without pencils and paper and without formulae. I bet <br/>\n&gt; some of you mathies could put the &quot;problems&quot; above iinto equations. We <br/>\n&gt; don&#39;t *need* to to solve them that way. We do *that* every day, <br/>\n&gt; naturally, without &#39;x&#39; and &#39;y&#39;. We&#39;re still solving algebra in our <br/>\n&gt; heads---and often don&#39;t even know it!<br/>\n&gt; <br/>\n&gt; ~Kelly<br/>\n&gt; <br/>\n&gt; Kelly Lovejoy<br/>\n&gt; Conference Coordinator<br/>\n&gt; Live and Learn Unschooling Conference<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n&gt; ________________________________________________________________________<br/>\n&gt; Email and AIM finally together. You&#39;ve gotta check out free AOL Mail! - <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.aol.com\">http://mail.aol.com</a><br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":153118561,"authorName":"airokat@comcast.net","from":"airokat@...","profile":"dawakat2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] algebra IRL","postDate":"1191074923","msgId":26541,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA5MjkyMDA3MTQwOC4yODYyMS40NkZFNUM2QjAwMEQ1NkEzMDAwMDZGQ0QyMjAwNzM0MDc2OUIwRTA1MDE5RDA3MEVAY29tY2FzdC5uZXQ+"},"prevInTopic":26540,"nextInTopic":26547,"prevInTime":26540,"nextInTime":26542,"topicId":26540,"numMessagesInTopic":0,"msgSnippet":"Wow...thanks for that. My dd is going to do driver s ed/training soon and I was wondering what subject categores I could use for her records! Any other ideas","messageBody":"<div id=\"ygrps-yiv-26365336\">Wow...thanks for that. My dd is going to do driver&#39;s ed/training soon and I was wondering what subject categores I could use for her records! <br/>\nAny other ideas for &quot;educationese&quot; for drivers ed/training?<br/>\nKathryn<br/>\n<br/>\n-------------- Original message -------------- <br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> <br/>\nI had a few unschooling families over last week. Math came up, as usual.<br/>\n<br/>\nIn the midst of explaining that math is everywhere and a part of daily <br/>\nlife, I came up with a really simple example of how we all use it every <br/>\nday.<br/>\n<br/>\nYou understand that algebra is simply understanding how variables <br/>\nchange the equation, right? That&#39;s all it is: that something that <br/>\n*varies* changes the situation.<br/>\n<br/>\nSo...<br/>\n<br/>\nYou&#39;re driving along. Up ahead you see a traffic light that&#39;s red. When <br/>\n(at what point) do you apply your brakes?<br/>\n<br/>\nYou&#39;re driving long. At that light, there&#39;s a car stopped in front of <br/>\nyou. *Now* when do you apply your brakes?<br/>\n<br/>\nYou&#39;re driving along. At the light, there&#39;s a car stopped in front of <br/>\nyou, and it&#39;s raining. *Now* when do you apply your brakes?<br/>\n<br/>\nYou&#39;re driving along---in a *friend&#39;s* new car (one you&#39;ve never driven <br/>\nbefore). There&#39;s a car stopped in front of you, and it&#39;s raining. *Now* <br/>\nwhen do you apply your brakes?<br/>\n<br/>\nWhile driving, we solve all sorts of algebraic equations---many in a <br/>\nsplit-second. Without pencils and paper and without formulae. I bet <br/>\nsome of you mathies could put the &quot;problems&quot; above iinto equations. We <br/>\ndon&#39;t *need* to to solve them that way. We do *that* every day, <br/>\nnaturally, without &#39;x&#39; and &#39;y&#39;. We&#39;re still solving algebra in our <br/>\nheads---and often don&#39;t even know it!<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n__________________________________________________________<br/>\nEmail and AIM finally together. You&#39;ve gotta check out free AOL Mail! - <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.aol.com\">http://mail.aol.com</a><br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"algebra IRL","postDate":"1191067632","msgId":26540,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOUQwQTg2NkQ1ODM1QS03MDAtQjY0NEB3ZWJtYWlsLW1kMDkuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":0,"nextInTopic":26541,"prevInTime":26539,"nextInTime":26541,"topicId":26540,"numMessagesInTopic":0,"msgSnippet":"I had a few unschooling families over last week. Math came up, as usual. In the midst of explaining that math is everywhere and a part of daily life, I came up","messageBody":"<div id=\"ygrps-yiv-1330622766\">I had a few unschooling families over last week. Math came up, as usual.<br/>\n<br/>\nIn the midst of explaining that math is everywhere and a part of daily <br/>\nlife, I came up with a really simple example of how we all use it every <br/>\nday.<br/>\n<br/>\nYou understand that algebra is simply understanding how variables <br/>\nchange the equation, right? That&#39;s all it is: that something that <br/>\n*varies* changes the situation.<br/>\n<br/>\nSo...<br/>\n<br/>\nYou&#39;re driving along. Up ahead you see a traffic light that&#39;s red. When <br/>\n(at what point) do you apply your brakes?<br/>\n<br/>\nYou&#39;re driving long. At that light, there&#39;s a car stopped in front of <br/>\nyou. *Now* when do you apply your brakes?<br/>\n<br/>\nYou&#39;re driving along. At the light, there&#39;s a car stopped in front of <br/>\nyou, and it&#39;s raining. *Now* when do you apply your brakes?<br/>\n<br/>\nYou&#39;re driving along---in a *friend&#39;s* new car (one you&#39;ve never driven <br/>\nbefore). There&#39;s a car stopped in front of you, and it&#39;s raining. *Now* <br/>\nwhen do you apply your brakes?<br/>\n<br/>\nWhile driving, we solve all sorts of algebraic equations---many in a <br/>\nsplit-second. Without pencils and paper and without formulae. I bet <br/>\nsome of you mathies could put the &quot;problems&quot; above iinto equations. We <br/>\ndon&#39;t *need* to to solve them that way. We do *that* every day, <br/>\nnaturally, without &#39;x&#39; and &#39;y&#39;. We&#39;re still solving algebra in our <br/>\nheads---and often don&#39;t even know it!<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n________________________________________________________________________<br/>\nEmail and AIM finally together. You&#39;ve gotta check out free AOL Mail! - <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.aol.com\">http://mail.aol.com</a></div>","specialLinks":[]}],"prevTopicId":26531,"nextTopicId":26888}}