{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":301158115,"authorName":"amberlee_b","from":"&quot;amberlee_b&quot; &lt;amberlee16@...&gt;","profile":"amberlee_b","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Moving","postDate":"1253120274","msgId":41480,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4cjVlaSsxMDIyb0BlR3JvdXBzLmNvbT4=","inReplyToHeader":"PDk4NTMzOS4zNjA3My5xbUB3ZWI2NTcxMS5tYWlsLmFjNC55YWhvby5jb20+"},"prevInTopic":41475,"nextInTopic":0,"prevInTime":41479,"nextInTime":41481,"topicId":41429,"numMessagesInTopic":0,"msgSnippet":"When we moved 2 years ago it was pretty difficult to think about.  The kids were leaving behind friends they had made and were worried about all the same","messageBody":"<div id=\"ygrps-yiv-1535348941\">When we moved 2 years ago it was pretty difficult to think about.  The kids were leaving behind friends they had made and were worried about all the same things---change is change and it can be painful.  However, we researched the area.  My DH moved here first for his job and would visit houses and take pics to send back to us so we could all look at the places to live together.  We discussed all the things about the new area that would be good, fun and great.  We talked about feelings a lot....from not wanting to leave friends behind to how to keep in touch (isn&#39;t email wonderful!) to wanting to hurry up and be with daddy.  We got the kids input on what they wanted from a new home.  They each wanted their own rooms and we found a place that we could do that with.  They wanted to make it all new when we got here so they got to pick out new bedding and curtains.  They asked about painting their rooms and if we would &quot;let&quot; them.  (we are still in the process of deciding what the boys want but dd has a plan for her room now).  <br/>\n<br/>\nThe kids wanted either a place to run around or a park.  Get them involved and talking about what they want and what they need in the new home and surrounding area.  Does this mean there won&#39;t be tears and upset feelings?  Of course not, heck even I was crying at times.  It does mean you will work together as a family toward finding a place or making a home work for everyone.<br/>\n<br/>\nYour 4.5 year old is going to feel very strongly about this. He is worried he will never see his things again and sounds like he needs reassurance that everything will be back in place eventually.  I think if you talk to him about the things he wants in a new home and make it an adventure it might help...as well as keeping his things together and explaining what happens. Does he like you to read to him?  Maybe find some fun colorful stories at the library about moving.  I hope this helps a bit.  I know how tough it can be to move at a young age, but as long as you keep communication open I think he will be ok.  I had moved 2 or 3 times by his age myself.  <br/>\n<br/>\nMy youngest just wanted to be sure our family would be back together, she had a fear we wouldn&#39;t be able to be together again.  You may be surprised what he is really worried about.  He may think he will never see his favorite toys again once they have gone into a box.  So talk to him, have some just him time and let him talk about what he thinks, feels or sees this &quot;moving thing&quot; to be.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; &gt; or leave the house. He will probably have the hardest time with it all. He<br/>\n&gt; &gt; doesn&#39;t quite understand the whole idea of selling your house and moving.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Anyway... I&#39;m looking for ideas to make this easier for him (and for all of<br/>\n&gt; &gt; them really).<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":234185411,"authorName":"Bekki Kirby","from":"Bekki Kirby &lt;junegoddess@...&gt;","profile":"bekkijune","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving","postDate":"1253105065","msgId":41475,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMyNzI3NmNjMDkwOTE2MDU0NGw0NGZhYmI2N3EyNzA5OTdlMzg3NzMwODZkQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDk4NTMzOS4zNjA3My5xbUB3ZWI2NTcxMS5tYWlsLmFjNC55YWhvby5jb20+","referencesHeader":"PDM2NDRjMGIzMDkwOTE1MTcyNm5mN2NlOGIzaDM5ZGEwNDAwMTM2MmQ1NDRAbWFpbC5nbWFpbC5jb20+CSA8OTg1MzM5LjM2MDczLnFtQHdlYjY1NzExLm1haWwuYWM0LnlhaG9vLmNvbT4="},"prevInTopic":41470,"nextInTopic":41480,"prevInTime":41474,"nextInTime":41476,"topicId":41429,"numMessagesInTopic":0,"msgSnippet":"I have sympathy, but no better ideas that what has been offered here.  I am going to copy and paste those into a file for myself, although our military moving","messageBody":"<div id=\"ygrps-yiv-2093107586\">I have sympathy, but no better ideas that what has been offered here.  I am<br/>\ngoing to copy and paste those into a file for myself, although our military<br/>\nmoving days are over.  I sure wish I&#39;d had some of those ideas in mind<br/>\nearlier!<br/>\n<br/>\nI have a pretty sensitive little guy, also 4 1/2, who is almost done<br/>\n&quot;processing&quot; what happened this July.  We thought we were going to buy a<br/>\nhouse... right here in the city we already live in, but still, a different<br/>\nhouse.  He was only 2 1/2 when we moved here, so doesn&#39;t seem to have any<br/>\nrecollection of previous houses and moves.<br/>\n<br/>\nWe initially tried to have him go play at Grandma&#39;s when we&#39;d go out<br/>\nhouse-hunting, because we know how sensitive he is and how much he can latch<br/>\nonto an idea and worry about it.  That didn&#39;t work out for long... he really<br/>\nneeds to be wherever I am.  So, he came along, and kind of enjoyed seeing<br/>\ninside the houses with our &quot;house unlocker friend.&quot;  But he kept insisting<br/>\nthat &quot;we already HAVE a house.&quot;  I still haven&#39;t come up with a good way to<br/>\nexplain that we rent our current house... and want to OWN a house someday.<br/>\n<br/>\nWell, anyway, after a few weeks, we narrowed it down to two houses, invited<br/>\nGrandma and our daughter to come see and offer opinions, picked one, and<br/>\nmade an offer.  It was accepted, and that same afternoon we found out were<br/>\nabout to lose half our income... so there&#39;d be no house-buying any time<br/>\nsoon.  I really feel badly about how it all happened, because we&#39;d finally<br/>\ntalked him into how cool the new house would be... and really sold our<br/>\ndaughter on it, too.. and then yanked the rug out from under them.  Our son<br/>\nwas thoroughly confused for a while after that.  He wanted to see our house<br/>\nunlocker friend again, for one thing.  He wanted to go back to that house we<br/>\npicked.  He REALLY wanted the swingset we said we were going to buy for the<br/>\nnew house (not allowed to have one here.)  And he got totally obsessed with<br/>\nthe idea of chickens in the backyard, because I&#39;d talked about that being<br/>\none of my requirements for the new house.  So... he&#39;s losing out on a lot of<br/>\ncool things.  We all are.  Not a darn thing we can DO about it.<br/>\n<br/>\nI&#39;m pretty sure I have mild Asperger&#39;s, which can make empathy hard...<br/>\nbeyond hugging him and agreeing that I wish we were moving, too... I&#39;m<br/>\ngenerally at a loss.<br/>\n<br/>\nI swear I had a point when I started this... I have the flu at the moment<br/>\nand have been interrupted several times while typing.  I think my main point<br/>\nwas just to agree that some kids have a hard time with change.  If we were<br/>\ndoing a military move right now, with my son at this age and stage, I think<br/>\nI&#39;d want to let them pack it all for me.  It seems like that would take some<br/>\nof the focus off of the Stuff.  I know that would add extra motel days,<br/>\nthough.<br/>\n<br/>\nBekki<br/>\n<br/>\n-- <br/>\nThe true test of intelligence is not how much we know how to do, but how we<br/>\nbehave when we don&#39;t know what to do.<br/>\n-John Holt<br/>\n<br/>\nEducation is the ability to listen to almost anything without  losing your<br/>\ntemper or your self-confidence.<br/>\n-Robert Frost<br/>\n<br/>\nMother of four angels, two pirates, and one TBD<br/>\n Kayla (10)<br/>\n Hunter (b. 8/9/03, d. 8/22/03)<br/>\n Jo (misc 1/15/04)<br/>\n Jared (4)<br/>\n Camelia (b. 12/16/07, d. 12/10/07)<br/>\n Hope/Chance (misc 11/25/08)<br/>\n Capt. Jack probably arriving 12/09<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":335051187,"authorName":"lrowx001","from":"&quot;lrowx001&quot; &lt;lrowx001@...&gt;","profile":"lrowx001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Moving - Young Child&#39;s Sadness","postDate":"1253081288","msgId":41470,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4cHZjOCtrajM1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg4b29lbStza2lhQGVHcm91cHMuY29tPg=="},"prevInTopic":41455,"nextInTopic":41475,"prevInTime":41469,"nextInTime":41471,"topicId":41429,"numMessagesInTopic":0,"msgSnippet":"We moved in Oct 2007 from southern VA to NC. Ryan was 5.5 years old and Danny was 6.5 when we moved. We lived in a furnished rental house for 6 months, across","messageBody":"<div id=\"ygrps-yiv-294165544\">We moved in Oct 2007 from southern VA to NC. Ryan was 5.5 years old and Danny was 6.5 when we moved. We lived in a furnished rental house for 6 months, across the street from our house that was being remodeled. We took many toys to the rental home, and left the rest in the old home until it sold. Then the furniture and those toys went into storage for several months. A door-to-door move may have been better for Ryan, but unfortunately, it wasn&#39;t an option. <br/>\n<br/>\nRyan is also very emotional. He grieved for a long time (at least a year) about moving. He frequently spoke of missing &quot;the white house&quot; (our VA home) and sometimes cried about it. He even grieved for the rental house - &quot;the brown house.&quot; Just today, nearly 2 years later, he told me that missed our elderly neighbor &quot;Miss Betty Lea.&quot; The intensity of his emotion seems to have lessened, but the move affected him for a long time. He did not want to go places - especially if we had to take a vehicle. In VA we ran errands often, then in NC he did not want to go. For about a year and a half, I stayed home with him while his Dad and brother ran errands. Ryan would sometimes go to the park or for a woods walk (vehicle required). And anytime he would walk to the beach to play in the sand or feed the birds. But, following any type of outing we often experienced emotional outbursts after we came back home. This summer Ryan has asked to go along more often for errands, and the emotional after effects from an outing have lessened. <br/>\n<br/>\nDanny is a completely different personality. He outwardly handled the move more easily and was clearly excited about the adventure. He loved touring the moving truck, watching the packers and movers, visiting the house during its remodel, and helping us unpack.<br/>\n<br/>\nMy advice is to expect the grief, especially if that is the only house your son has ever known. We acknowledged Ryan&#39;s feelings of sadness without amplifying them or dismissing them. If he asked what we missed about &quot;the white house&quot; we answered honestly, though briefly. You might also be prepared for changes in his behavior that seem quite different from now. He will respond in his own way to the new locale, just as you will. <br/>\n<br/>\nBefore you go, and after you arrive, take advantage of moving boxes. Moving boxes can be the most wonderful play toys ever! I have some great photos of our boys playing in the boxes. The big dish packs and wardrobe cartons are best because little guys can completely hide inside. You can color them, or paint them. After you arrive, you can cut  a big box down to become a car or boat....<br/>\n<br/>\nAs others mentioned, take his favorite things. Not just toys and clothes, but maybe his pillow and bed cover or sleeping bag. These might help during the trip across country. Take as much of his stuff as you can fit. You can also mail some boxes ahead if you can&#39;t carry everything: favored board games, movies, art supplies.... Having his &quot;things&quot; may bring some comfort while the rest of his life is in turmoil. <br/>\n<br/>\nBest of luck! Lisa<br/>\n<br/>\n<br/>\n-- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;swissarmy_wife&quot; &lt;heatherbean@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; The whole family is on board, but I know it&#39;s about to a very emotional time for all of us.  The one I need some ideas for is my 4.5 year old.  He becomes sad when he sees things leaving the house.  He will probably have the hardest time with it all.  He doesn&#39;t quite understand the whole idea of selling your house and moving.  <br/>\n&gt; <br/>\n&gt; Anyway...  I&#39;m looking for ideas to make this easier for him (and for all of them really).  <br/>\n&gt; <br/>\n&gt; Thanks in advance.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":136944076,"authorName":"Jenna Robertson","from":"Jenna Robertson &lt;mamamole@...&gt;","profile":"Mamamole","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving","postDate":"1253067751","msgId":41455,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk4NTMzOS4zNjA3My5xbUB3ZWI2NTcxMS5tYWlsLmFjNC55YWhvby5jb20+","inReplyToHeader":"PDM2NDRjMGIzMDkwOTE1MTcyNm5mN2NlOGIzaDM5ZGEwNDAwMTM2MmQ1NDRAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":41452,"nextInTopic":41470,"prevInTime":41454,"nextInTime":41456,"topicId":41429,"numMessagesInTopic":0,"msgSnippet":"Google maps or google Earth might be good resources.  A friend of ours was recently visiting family in England and her daughter was really struggling w/ being","messageBody":"<div id=\"ygrps-yiv-681935367\">Google maps or google Earth might be good resources.  A friend of ours was recently visiting family in England and her daughter was really struggling w/ being away from everything familiar, particularly one of her stuffed animals, and her mom would go online and show her the google images of their neighborhood and find their house w/ her daughter so she knew where her fish was waiting, safe and sound.<br/>\n <br/>\nYou can often see the street level views, though in some places it&#39;s only from above.  On google earth people post pictures of specific locations and you might find some of your new location.<br/>\n <br/>\n:)<br/>\nJenna<br/>\n<br/>\n<br/>\n <br/>\n <br/>\n <br/>\n&quot;If I had influence with the good fairy who is supposed to preside over the christening of all children, I would ask that her gift to each child in the world be a sense of wonder so indestructible that it would last throughout life.&quot; <br/>\n               - Rachel Carson <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Tue, 9/15/09, Three Mommies &lt;3mommies@...&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: Three Mommies &lt;3mommies@...&gt;<br/>\nSubject: Re: [unschoolingbasics] Moving<br/>\nTo: unschoolingbasics@yahoogroups.com<br/>\nDate: Tuesday, September 15, 2009, 5:26 PM<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\nWe moved from New Orleans to Connecticut when Ethan was 5 and Ryan was 2.<br/>\nActually we evacuated from the city due to Katrina, spent 8 months bouncing<br/>\naround homeless, and finally settled in CT. Anyway, what really helped the<br/>\nguys be as comfortable as possible was assuring them that we brought<br/>\neverything they owned except the swing set and the trampoline and that those<br/>\nwould be replaced as soon as humanly possible. (Yes, we did jettison most of<br/>\nour belongings from the vans as we fled in favor of every toy and piece of<br/>\nclothing the kids owned.) Once we got settled, we unpacked all their stuff<br/>\nfirst. We also let them choose some things to have with them all the time.<br/>\n<br/>\nMaybe the little guy would like to decorate the boxes of his stuff? I&#39;m sure<br/>\nyou already talk about what sad about leaving and what is exciting about<br/>\nleaving. My guys liked drawing and playing the story of what happened. Would<br/>\nyour guy be into that? Do you know where you&#39;ll live out there? Maybe he&#39;d<br/>\nlike to draw a picture of what his new room will look like? You could put<br/>\nlove notes with his stuff so he sees them as he packs and then hid more in<br/>\nthe boxes so he finds them when unpacks. How about looking at photos of the<br/>\nplace or using Google earth to see parks and playgrounds and other places<br/>\nthat he can go there? You could make a photo book of all the places you love<br/>\nto go in Vermont and all the people he likes and he could have that to carry<br/>\naround.<br/>\n<br/>\nThose are few ideas off the top of my head.<br/>\n<br/>\nHope the house sells and the move is easy.<br/>\n<br/>\nPeace,<br/>\nJean Elizabeth<br/>\n<br/>\nhttp://3mommies. blogspot. com<br/>\n<br/>\nOn Tue, Sep 15, 2009 at 3:03 PM, swissarmy_wife &lt;heatherbean@ gmail.com&gt;wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; We&#39;re making a pretty big move, coming up pretty quick too. From the east<br/>\n&gt; coast to the west coast. :-)<br/>\n&gt;<br/>\n&gt; The whole family is on board, but I know it&#39;s about to a very emotional<br/>\n&gt; time for all of us. The one I need some ideas for is my 4.5 year old. He<br/>\n&gt; becomes sad when he sees things leaving the house. He became VERY emotional<br/>\n&gt; when we put our chest freezer into storage for the time being, and he&#39;s<br/>\n&gt; never even noticed it before. He&#39;s not keen on seeing things go into boxes<br/>\n&gt; or leave the house. He will probably have the hardest time with it all. He<br/>\n&gt; doesn&#39;t quite understand the whole idea of selling your house and moving.<br/>\n&gt;<br/>\n&gt; Anyway... I&#39;m looking for ideas to make this easier for him (and for all of<br/>\n&gt; them really).<br/>\n&gt;<br/>\n&gt; Thanks in advance.<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":1191428,"authorName":"Robin Krest","from":"&quot;Robin Krest&quot; &lt;rlkrest@...&gt;","profile":"nibormij","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving","postDate":"1253062083","msgId":41452,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDkwOTE1LjIwNDgwMy44NjUzLjBAd2VibWFpbDAxLmRjYS51bnRkLmNvbT4="},"prevInTopic":41450,"nextInTopic":41455,"prevInTime":41451,"nextInTime":41453,"topicId":41429,"numMessagesInTopic":0,"msgSnippet":"We moved a bit when I was a kid...proud military brat here...and some things my mom did was: 1.  Made a graph paper layout of our new house (if we knew the","messageBody":"<div id=\"ygrps-yiv-1510450640\">We moved a bit when I was a kid...proud military brat here...and some things my mom did was:<br/>\n<br/>\n1.  Made a graph paper layout of our new house (if we knew the dimensions) and let us move paper furniture (cut to scale) around to determine where our furniture would go.<br/>\n<br/>\n2.  Our rooms were last to be packed, first to be unpacked.<br/>\n<br/>\n3.  Since we drove to our new base, we had a ditty bag to fill up with toys we wanted to have with us; if it fit in the bag we could have it (cut down on volume of stuff in the car, which cut down on the stress for my mom).  Nowadays we would have DVD players, I am sure : ).  We stopped a lot along the way at parks and points of interest.<br/>\n<br/>\nA lot of the other suggestions I read were good, I really liked the playing moving and talking it through.  My brother and I always knew we did not have a choice about moving (thanks to the military), but my mom made sure we learned the layout of the neighborhood and discovered the rec center, library, parks, as soon as possible.<br/>\n<br/>\nRobin K. <br/>\n<br/>\n<br/>\n<br/>\n---------- Original Message ----------<br/>\nFrom: &quot;swissarmy_wife&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heatherbean@...\">heatherbean@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: [unschoolingbasics] Moving<br/>\nDate: Tue, 15 Sep 2009 19:03:50 -0000<br/>\n<br/>\nWe&#39;re making a pretty big move, coming up pretty quick too.  From the east coast to the west coast.  :-)<br/>\n<br/>\nThe whole family is on board, but I know it&#39;s about to a very emotional time for all of us.  The one I need some ideas for is my 4.5 year old.  He becomes sad when he sees things leaving the house.  He became VERY emotional when we put our chest freezer into storage for the time being, and he&#39;s never even noticed it before.  He&#39;s not keen on seeing things go into boxes or leave the house.    He will probably have the hardest time with it all.  He doesn&#39;t quite understand the whole idea of selling your house and moving.  <br/>\n<br/>\nAnyway...  I&#39;m looking for ideas to make this easier for him (and for all of them really).  <br/>\n<br/>\nThanks in advance.  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n____________________________________________________________<br/>\nBest Weight Loss Program - Click Here!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://thirdpartyoffers.juno.com/TGL2141/fc/BLSrjpTFoYdNHdNUfdcrKUdGoho2JvRGAEarmW49BCCh54Ykwrl34wtJIcQ/\">http://thirdpartyoffers.juno.com/TGL2141/fc/BLSrjpTFoYdNHdNUfdcrKUdGoho2JvRGAEarmW49BCCh54Ykwrl34wtJIcQ/</a></div>","specialLinks":[]},{"userId":1123183,"authorName":"undermom","from":"&quot;undermom&quot; &lt;DACunefare@...&gt;","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Moving","postDate":"1253060942","msgId":41450,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4cGJnZStzZDlkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg4b3Bxays3ZG81QGVHcm91cHMuY29tPg=="},"prevInTopic":41449,"nextInTopic":41452,"prevInTime":41449,"nextInTime":41451,"topicId":41429,"numMessagesInTopic":0,"msgSnippet":"If at all possible, give him pictures of where you re going so he knows what to look forward to. Photos of the neighborhood, the house, etc. When we did our","messageBody":"<div id=\"ygrps-yiv-1422004476\">If at all possible, give him pictures of where you&#39;re going so he knows what to look forward to. Photos of the neighborhood, the house, etc. When we did our big moves, on military orders, we weren&#39;t able to do that as we didn&#39;t know where we&#39;d end up living. So we researched the area and looked at books together. (Pre-internet - today that kind of stuff is so much easier!)<br/>\n<br/>\nHelp him take pictures of what he&#39;s leaving behind. Let him help label stuff going into storage or shipping, it will help him understand that you will see these things again. Help him take pictures with friends and in places he&#39;s going to miss.<br/>\n<br/>\nDeborah in IL</div>","specialLinks":[]},{"userId":327581399,"authorName":"Three Mommies","from":"Three Mommies &lt;3mommies@...&gt;","profile":"three.moms","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving","postDate":"1253060803","msgId":41449,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2NDRjMGIzMDkwOTE1MTcyNm5mN2NlOGIzaDM5ZGEwNDAwMTM2MmQ1NDRAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGg4b29lbStza2lhQGVHcm91cHMuY29tPg==","referencesHeader":"PGg4b29lbStza2lhQGVHcm91cHMuY29tPg=="},"prevInTopic":41446,"nextInTopic":41450,"prevInTime":41448,"nextInTime":41450,"topicId":41429,"numMessagesInTopic":0,"msgSnippet":"We moved from New Orleans to Connecticut when Ethan was 5 and Ryan was 2. Actually we evacuated from the city due to Katrina, spent 8 months bouncing around","messageBody":"<div id=\"ygrps-yiv-866049260\">We moved from New Orleans to Connecticut when Ethan was 5 and Ryan was 2.<br/>\nActually we evacuated from the city due to Katrina, spent 8 months bouncing<br/>\naround homeless, and finally settled in CT. Anyway, what really helped the<br/>\nguys be as comfortable as possible was assuring them that we brought<br/>\neverything they owned except the swing set and the trampoline and that those<br/>\nwould be replaced as soon as humanly possible. (Yes, we did jettison most of<br/>\nour belongings from the vans as we fled in favor of every toy and piece of<br/>\nclothing the kids owned.) Once we got settled, we unpacked all their stuff<br/>\nfirst. We also let them choose some things to have with them all the time.<br/>\n<br/>\nMaybe the little guy would like to decorate the boxes of his stuff? I&#39;m sure<br/>\nyou already talk about what sad about leaving and what is exciting about<br/>\nleaving. My guys liked drawing and playing the story of what happened. Would<br/>\nyour guy be into that? Do you know where you&#39;ll live out there? Maybe he&#39;d<br/>\nlike to draw a picture of what his new room will look like? You could put<br/>\nlove notes with his stuff so he sees them as he packs and then hid more in<br/>\nthe boxes so he finds them when unpacks.  How about looking at photos of the<br/>\nplace or using Google earth to see parks and playgrounds and other places<br/>\nthat he can go there? You could make a photo book of all the places you love<br/>\nto go in Vermont and all the people he likes and he could have that to carry<br/>\naround.<br/>\n<br/>\nThose are few ideas off the top of my head.<br/>\n<br/>\nHope the house sells and the move is easy.<br/>\n<br/>\nPeace,<br/>\nJean Elizabeth<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://3mommies.blogspot.com\">http://3mommies.blogspot.com</a><br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, Sep 15, 2009 at 3:03 PM, swissarmy_wife &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heatherbean@...\">heatherbean@...</a>&gt;wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; We&#39;re making a pretty big move, coming up pretty quick too. From the east<br/>\n&gt; coast to the west coast. :-)<br/>\n&gt;<br/>\n&gt; The whole family is on board, but I know it&#39;s about to a very emotional<br/>\n&gt; time for all of us. The one I need some ideas for is my 4.5 year old. He<br/>\n&gt; becomes sad when he sees things leaving the house. He became VERY emotional<br/>\n&gt; when we put our chest freezer into storage for the time being, and he&#39;s<br/>\n&gt; never even noticed it before. He&#39;s not keen on seeing things go into boxes<br/>\n&gt; or leave the house. He will probably have the hardest time with it all. He<br/>\n&gt; doesn&#39;t quite understand the whole idea of selling your house and moving.<br/>\n&gt;<br/>\n&gt; Anyway... I&#39;m looking for ideas to make this easier for him (and for all of<br/>\n&gt; them really).<br/>\n&gt;<br/>\n&gt; Thanks in advance.<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar@earthlink.net","from":"&lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Moving","postDate":"1253057246","msgId":41446,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPRUVJQkNMQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDhDQzA0NTdCMEQ3OTU2RS03OTY0LThDODZAd2VibWFpbC1kMDQ5LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":41438,"nextInTopic":41449,"prevInTime":41445,"nextInTime":41447,"topicId":41429,"numMessagesInTopic":0,"msgSnippet":"We recently did a big move. Are you going to be driving with the kids and have the moving truck come later? The reason I ask is that you need to have each of","messageBody":"<div id=\"ygrps-yiv-1633901125\">We recently did a big move. Are you going to be driving with the kids and<br/>\nhave the moving truck come later?<br/>\n<br/>\nThe reason I ask is that you need to have each of the kids pack a box of<br/>\ntheir most precious items and carry it with them. That way, when you get to<br/>\nthe destination, they will have their most important stuff right there with<br/>\nthem. Also, make sure that you include them on all of the decisions. One of<br/>\nmy daughters had just turned 3 and the other one was 6 when we did our big<br/>\nmoves. We made sure that they felt like they had a say in what was going on.<br/>\nIf we were on the road and they wanted to stop somewhere specific to eat, we<br/>\ndid. Once we got to our destination, we made sure that they got to be<br/>\ninvolved in finding a new place to live.<br/>\n<br/>\nThe older kids can do research on where you are going and help find where<br/>\nthe rest stops are. We had a pile of stuff that my 6 year old collected on<br/>\nthe road during our move.<br/>\n<br/>\nAlso, you can make sure that you take some pictures of the place that you<br/>\nare leaving for a scrap book. Have going away party. There are tons of<br/>\nlittle things that you can do to help kids through a move.<br/>\n<br/>\nThe most important thing to do is acknowledge their feelings and do not<br/>\ndismiss them. When we made our big moves, some of the adults in our lives<br/>\nbrushed off the kids&#39; feelings. You cannot do that. Each of my kids handled<br/>\nthe move slightly differently so I had to be very mindful of meeting them<br/>\nwhere they were.<br/>\n<br/>\n<br/>\n<br/>\nThe whole family is on board, but I know it&#39;s about to a very emotional time<br/>\nfor<br/>\nall of us. The one I need some ideas for is my 4.5 year old. He becomes sad<br/>\nwhen he sees things leaving the house. He became VERY emotional when we put<br/>\nour<br/>\nchest freezer into storage for the time being, and he&#39;s never even noticed<br/>\nit<br/>\nbefore. He&#39;s not keen on seeing things go into boxes or leave the house. He<br/>\nwill probably have the hardest time with it all. He doesn&#39;t quite understand<br/>\nthe whole idea of selling your house and moving.<br/>\n<br/>\nAnyway... I&#39;m looking for ideas to make this easier for him (and for all of<br/>\nthem really).<br/>\nRecent Activity<br/>\n  a..  13New Members<br/>\nVisit Your Group<br/>\nGive Back<br/>\nYahoo! for Good<br/>\n<br/>\nGet inspired<br/>\n<br/>\nby a good cause.<br/>\n<br/>\nY! Toolbar<br/>\nGet it Free!<br/>\n<br/>\neasy 1-click access<br/>\n<br/>\nto your groups.<br/>\n<br/>\nYahoo! Groups<br/>\nStart a group<br/>\n<br/>\nin 3 easy steps.<br/>\n<br/>\nConnect with others.<br/>\n.<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":209361242,"authorName":"jrossedd","from":"&quot;jrossedd&quot; &lt;jrossedd@...&gt;","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Moving","postDate":"1253047087","msgId":41433,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4b3R2Zit1cjI0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg4b29lbStza2lhQGVHcm91cHMuY29tPg=="},"prevInTopic":41432,"nextInTopic":41438,"prevInTime":41432,"nextInTime":41434,"topicId":41429,"numMessagesInTopic":0,"msgSnippet":"We moved (across town) when Young Son was turning five.  He was and is a sentimental kid who dislikes change, even cries every New Year s Eve to lose the old","messageBody":"<div id=\"ygrps-yiv-1479708793\">We moved (across town) when Young Son was turning five.  He was and is a sentimental kid who dislikes change, even cries every New Year&#39;s Eve to &quot;lose&quot; the old year!  Seriously.<br/>\n<br/>\nWe bought a giant stuffed bear with a ribbon around his neck and had it sitting on his bunk bed in the new house, waiting to greet him and sleep with him (all the old favorites came too, and they got to &quot;meet&quot; the new bear, introduce themselves one by one with Young Son doing the voices. It made everything seem friendlier and put him in the director&#39;s role, gave him a job to take care of.  He still mentioned the old house for awhile of source, and would say he was sad he&#39;d never see it again or missed something.  I would say something I missed too, but cheerfully.  The things he missed were not what I would have expected thouggh and I&#39;m not even sure it was &quot;true&quot; -- I think he missed the whole reality before things changed and so he would say things he remembered in that moment, not necessarily anything that he&#39;d even noticed before the move or now really missed, specifically.  Which was okay, because I understood what he meant.  :)<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;swissarmy_wife&quot; &lt;heatherbean@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; We&#39;re making a pretty big move, coming up pretty quick too.  From the east coast to the west coast.  :-)<br/>\n&gt; <br/>\n&gt; The whole family is on board, but I know it&#39;s about to a very emotional time for all of us.  The one I need some ideas for is my 4.5 year old.  He becomes sad when he sees things leaving the house.  He became VERY emotional when we put our chest freezer into storage for the time being, and he&#39;s never even noticed it before.  He&#39;s not keen on seeing things go into boxes or leave the house.    He will probably have the hardest time with it all.  He doesn&#39;t quite understand the whole idea of selling your house and moving.  <br/>\n&gt; <br/>\n&gt; Anyway...  I&#39;m looking for ideas to make this easier for him (and for all of them really).  <br/>\n&gt; <br/>\n&gt; Thanks in advance.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving","postDate":"1253045422","msgId":41432,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQzA0NTdCMEQ3OTU2RS03OTY0LThDODZAd2VibWFpbC1kMDQ5LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PGg4b29lbStza2lhQGVHcm91cHMuY29tPg==","referencesHeader":"PGg4b29lbStza2lhQGVHcm91cHMuY29tPg=="},"prevInTopic":41429,"nextInTopic":41433,"prevInTime":41431,"nextInTime":41433,"topicId":41429,"numMessagesInTopic":0,"msgSnippet":"I d google Family Fun. I used to subscribe---years and years ago. But I m sure I remember lots of articles on ways to help children with moves. Another option","messageBody":"<div id=\"ygrps-yiv-108779356\">I&#39;d google Family Fun. I used to subscribe---years and years ago. But I&#39;m sure I remember lots of articles on ways to help children with moves.<br/>\n<br/>\nAnother option would be the military. It&#39;s a VERY common issue among military families. Just google...maybe...&quot;military PCS anxiety children&quot;---maybe?<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n?~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n <br/>\n<br/>\n-----Original Message-----<br/>\nFrom: swissarmy_wife &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heatherbean@...\">heatherbean@...</a>&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nWe&#39;re making a pretty big move, coming up pretty quick too.  From the east coast <br/>\nto the west coast.  :-)<br/>\n<br/>\nThe whole family is on board, but I know it&#39;s about to a very emotional time for <br/>\nall of us.  The one I need some ideas for is my 4.5 year old.  He becomes sad <br/>\nwhen he sees things leaving the house.  He became VERY emotional when we put our <br/>\nchest freezer into storage for the time being, and he&#39;s never even noticed it <br/>\nbefore.  He&#39;s not keen on seeing things go into boxes or leave the house.    He <br/>\nwill probably have the hardest time with it all.  He doesn&#39;t quite understand <br/>\nthe whole idea of selling your house and moving.  <br/>\n<br/>\nAnyway...  I&#39;m looking for ideas to make this easier for him (and for all of <br/>\nthem really).  <br/>\n<br/>\nThanks in advance.  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":311108332,"authorName":"evawitsel","from":"&quot;evawitsel&quot; &lt;evawitsel@...&gt;","profile":"evawitsel","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Moving","postDate":"1253042836","msgId":41438,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4b3Bxays3ZG81QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg4b29lbStza2lhQGVHcm91cHMuY29tPg=="},"prevInTopic":41433,"nextInTopic":41446,"prevInTime":41437,"nextInTime":41439,"topicId":41429,"numMessagesInTopic":0,"msgSnippet":"... Does he understand that all the things will be transported to your new house and not disappear into a big black hole? My son didn t understand that when we","messageBody":"<div id=\"ygrps-yiv-722227859\">---The one I need some ideas for is my 4.5 year old.  He becomes sad when he sees things leaving the house.  He became VERY emotional when we put our chest freezer into storage for the time being, and he&#39;s never even noticed it before. He&#39;s not keen on seeing things go into boxes or leave the house.---<br/>\n<br/>\nDoes he understand that all the things will be transported to your new house and not disappear into a big black hole? My son didn&#39;t understand that when we were packing to move. He thought we had to leave all our things behind and live in a new house with other people&#39;s things in it... After we explained that we would take all our things to the new house (&quot;not the kitchen, but the plates, cups, etc; not the bathroom, but the bed and the cupboard etc&quot;).<br/>\nAnd we played &#39;moving house&#39; a couple of times. Pack up lots of things, put them on a cart and move them to another room, and back again, and again ;-)<br/>\nThis helped him enormously.<br/>\n<br/>\nEva<br/>\nand Berend and Fiene<br/>\nfrom the Netherlands</div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Moving","postDate":"1253041430","msgId":41429,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4b29lbStza2lhQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":41432,"prevInTime":41428,"nextInTime":41430,"topicId":41429,"numMessagesInTopic":0,"msgSnippet":"We re making a pretty big move, coming up pretty quick too.  From the east coast to the west coast.  :-) The whole family is on board, but I know it s about to","messageBody":"<div id=\"ygrps-yiv-85051005\">We&#39;re making a pretty big move, coming up pretty quick too.  From the east coast to the west coast.  :-)<br/>\n<br/>\nThe whole family is on board, but I know it&#39;s about to a very emotional time for all of us.  The one I need some ideas for is my 4.5 year old.  He becomes sad when he sees things leaving the house.  He became VERY emotional when we put our chest freezer into storage for the time being, and he&#39;s never even noticed it before.  He&#39;s not keen on seeing things go into boxes or leave the house.    He will probably have the hardest time with it all.  He doesn&#39;t quite understand the whole idea of selling your house and moving.  <br/>\n<br/>\nAnyway...  I&#39;m looking for ideas to make this easier for him (and for all of them really).  <br/>\n<br/>\nThanks in advance.</div>","specialLinks":[]}],"prevTopicId":41426,"nextTopicId":41334}}