{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Thinking of unschooling, but I still don&#39;t know if it&#39;s right","postDate":"1359658162","msgId":49498,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtlZWViaStvdWlhQGVHcm91cHMuY29tPg=="},"prevInTopic":49497,"nextInTopic":0,"prevInTime":49497,"nextInTime":49499,"topicId":49490,"numMessagesInTopic":0,"msgSnippet":"... **************** It s an absolutely normal and natural response to education - most school kids don t want to learn . Most homeschooled kids don t want","messageBody":"<div id=\"ygrps-yiv-1595521386\">&quot;Michelle&quot;  wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; So, I tried the unschooling approach and still they don&#39;t want to learn anything.<br/>\n </span></blockquote>****************<br/>\n<br/>\nIt&#39;s an absolutely normal and natural response to education - most school kids &quot;don&#39;t want to learn&quot;. Most homeschooled kids &quot;don&#39;t want to learn&quot;. Longtime unschoolers, kids who have gotten past the deschooling stage, love to learn... but a big part of that is that their parents aren&#39;t weighing and measuring what they learn and dismissing the parts which don&#39;t look like school. <br/>\n<br/>\nHere&#39;s a secret you won&#39;t learn through school or homeschooling: kids always love to learn. They can&#39;t help it. What they don&#39;t like is being told what to learn and when and how. <br/>\n<br/>\nYour kids are learning. The trouble is you&#39;re still missing most of it because you&#39;re looking for schoolishness. There&#39;s a good essay about looking for learning here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/seeingit\">http://sandradodd.com/seeingit</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;All they want to do is watch TV...<br/>\n<br/>\n </span></blockquote>Be careful of the word &quot;all&quot; - you listed several things after it, complex things, too. There&#39;s a lot to be learned watching tv - and it&#39;s usually not what parents are afraid of ;) Unschooling kids, kids who are free to watch without scorn for watching, learn about literature, problem solving, history, social dynamics, science and more - and that&#39;s from watching fiction, not necessarily &quot;educational tv&quot;. It&#39;s a source of rich, complex stuff - and for kids who have come to equate &quot;learning&quot; with torture, it&#39;s a fantastic way for them to begin learning on their own terms. Watch some tv with them. Enjoy their company, have conversations, bring snacks. Learn about what they enjoy, find interesting, and value. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;play dolls<br/>\n<br/>\n </span></blockquote>Good gosh wooooooorlds of learning takes place in dramatic play. It&#39;s hands-on experiential learning. In dramatic play, kids take what they&#39;ve learned in other situations and try it out, they experiment with ideas about human interactions - everything from daily etiquette to big, universal issues of life and death, good and evil. Play with them! If you&#39;ve forgotten how to play, the book Playful Parenting might help. Or your kids might be willing to coach you ;) children are often generous that way (no, mama, you&#39;re supposed to say...).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; fight with each other.<br/>\n<br/>\n </span></blockquote>They need help working things out. They need you to be in the middle of things, talking with them, playing with them, seeing who&#39;s getting tired, or frustrated, or hungry and taking care of those things before they trigger a quarrel. Maybe they need more attention in general. Maybe they need you to do some thinking about logistics - are they fighting over the tv? Get another one. Be more present. Be where they are, doing what they&#39;re doing. With three, spread out in age, that could be a bit of a juggling act! But it helps to See it as a juggling act - a problem to be solved with some extra thought, planning, and a big of practice, too. New skills take practice. <br/>\n<br/>\nI don&#39;t know if you had siblings or not, but sometimes parents who grew up as onlies or with wide age gaps between siblings don&#39;t realize how much it&#39;s natural for kids to quarrel. A certain amount of bickering is How they&#39;re learning about social dynamics and problem solving in a group. They&#39;re learning by making mistakes - just like you ;) You can and should help them! But don&#39;t think you&#39;re failing if they snip and snarl at one another now and then, either. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;We have turned into a family who fights all the time to get anything done.  We argue over the same things everyday like school work, chores, hygiene. <br/>\n </span></blockquote>**************<br/>\n<br/>\nStop fighting. Drop the school work and chores - they aren&#39;t learning anything positive from those things. Ease up on hygiene and look for alternatives for big issues for awhile. Reconsider what needs to &quot;get done&quot; - maybe a whole lot less than you think!<br/>\n<br/>\nFrom their perspective, these are all things they&#39;ve been bullied to do. It&#39;s natural to want to avoid things you&#39;ve been bullied to do for a long time, even if you liked them before you were bullied and come to like them again later, there&#39;s a long period of aversion. So be sweet and kind and helpful rather than the family bully - that doesn&#39;t help you&#39;re self image any more than it helps the kids! <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;My 8 year old isn&#39;t reading well at all and doesn&#39;t care.  They hate chapter books that come with curriculum boxes like Heart of Dakota, My Father&#39;s World, they hate to have to listen to someone (anyone) read.  They don&#39;t even like story time at the Library.  Is this normal???<br/>\n </span></blockquote>***************<br/>\n<br/>\nIt&#39;s entirely normal for kids who have been schooled or homeschooled. <br/>\n<br/>\nAt the same time, listening to someone read is unpleasant for some kids - I didn&#39;t know that until my daughter came along. She learned to read early, but never liked to be read to as a toddler or young child. It has only been in the last year (she&#39;s 11) that she has been interested in listening to audio books with me. And it has only been in the last year that she has been interested in reading any book other than a graphic novel. She was able to read, but found it merely a sometimes-useful but otherwise unpleasant tool... kind of like how I feel about my car ;) So it&#39;s not the case that &quot;a love of reading&quot; is some kind of necessary goal - it isn&#39;t. <br/>\n<br/>\nRight now, they&#39;ll learn more good things about literacy watching tv. They&#39;ll learn about stories, plots, characters, scene and setting, mood, themes, symbolism, vocabulary, grammar, and more. And all of that will eventually inform their literacy. <br/>\n<br/>\nThere&#39;s good stuff about what sorts of things kids learn from tv here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/t/gilligan\">http://sandradodd.com/t/gilligan</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Never make them clean their room? <br/>\n<br/>\n </span></blockquote>Nope. Be sweet and kind and gracious. If there&#39;s some overwhelming need to clean a room, do it happily, as a gift to yourself and the people you love. They may not want their rooms clean - my daughter doesn&#39;t. Now and then I&#39;ll ask to clean hers, and sometimes she says yes, but she prefers to see things spread out before her - it helps her think and imagine. <br/>\n<br/>\nKids are busy, creative people; busy learning about the world, and that&#39;s messy work. It doesn&#39;t help them in any way to stop in the midst of their busy, creative life and do a tedious, mindless task. In the adult world, busy, creative people don&#39;t stop in the middle to clean. They either wait until a logical time, like the beginning of a new project, or they Hire someone to clean. It is only children who are made to stop thinking and imagining, creating and learning to satisfy someone else&#39;s idea of order. <br/>\n<br/>\nSome time in the teen years, kids who haven&#39;t been made to clean start noticing what they can do to help - even start asking to help. It&#39;s part of the developmental process where they learn to see a broader perspective. You can&#39;t teach someone to have a broader perspective, you can only undermine the developmental process or support it. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I want us to be happy and have fun with homeschooling, but we are not. <br/>\n<br/>\n </span></blockquote>You can be happy and have fun with unschooling, but it will take some work on your part to step back from wanting to homeschool. Homeschooling can be worse than school in terms of how it breaks down a family. In that sense, your husband is right - it would be better to put the kids in school and work on rebuilding your relationship as a family, learn to hang out and have fun together, than to go on fighting all the time. If you can step back from expectations about what your kids Should be doing and learning and see them as busy, creative people, learning every day in wonderful, exciting ways, then you can have a fun, happy, unschooling life. <br/>\n<br/>\n---Meredith<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Thinking of unschooling, but I still don&#39;t know if it&#39;s right","postDate":"1359656136","msgId":49497,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTk2NTYxMzYuNzU1NjYuWWFob29NYWlsTmVvQHdlYjE4MjIwNS5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PDEzNTk2NTU4NjUuNjMyMzcuWWFob29NYWlsTmVvQHdlYjE4MjIwMy5tYWlsLmJmMS55YWhvby5jb20+","referencesHeader":"PGtlY25lNCszbzZyQGVHcm91cHMuY29tPiA8NUEzMDA0RDktQzdFNS00MThCLUI4NTgtNDQyNUYwRjhENUMzQHZlcml6b24ubmV0PiA8MTM1OTY0ODQ0OS4yOTAyLllhaG9vTWFpbE5lb0B3ZWIxODIyMDEubWFpbC5iZjEueWFob28uY29tPiA8MTM1OTY1MDI2Mi44OTQyMi5ZYWhvb01haWxOZW9Ad2ViMTI2MTA0Lm1haWwubmUxLnlhaG9vLmNvbT4gPDEzNTk2NTU4NjUuNjMyMzcuWWFob29NYWlsTmVvQHdlYjE4MjIwMy5tYWlsLmJmMS55YWhvby5jb20+"},"prevInTopic":49496,"nextInTopic":49498,"prevInTime":49496,"nextInTime":49498,"topicId":49490,"numMessagesInTopic":0,"msgSnippet":"Ha I think she wrote in magic disappearing ink! Somehow it is gone from my post!! Alex, Your perfectly written post came at a perfect time, as I am trying to","messageBody":"<div id=\"ygrps-yiv-1486487246\">Ha I think she wrote in magic disappearing ink!<br/>\nSomehow it is gone from my post!!<br/>\n<br/>\nAlex,<br/>\nYour perfectly written post came at a perfect time, as I am trying to grasp what unschooling is all about.<br/>\n I&#39;ve been reading posts on this site since May 2012 and trying to  <br/>\n&#39;read,try,wait and watch&#39; all the while. I&#39;m trying to figure out when &#39;deschooling&#39; ends and<br/>\n&#39;unschooling&#39; begins b/c we are making positive changes to our lifestyle as situations arise, <br/>\nbut I don&#39;t know when we will be &quot;there&quot;(unschooling). Is it when we no longer think<br/>\nabout &#39;subjects&#39; for school? Is it when there is more peace for the children in regards<br/>\nto learning? I keep telling myself that we are &#39;deschooling&#39; for the past 9 months!<br/>\nI&#39;m unsure of when to acknowledge that we are unschooling.<br/>\nDo you have any thoughts on this? <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Thinking of unschooling, but I still don&#39;t know if it&#39;s right","postDate":"1359655865","msgId":49496,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTk2NTU4NjUuNjMyMzcuWWFob29NYWlsTmVvQHdlYjE4MjIwMy5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PDEzNTk2NTAyNjIuODk0MjIuWWFob29NYWlsTmVvQHdlYjEyNjEwNC5tYWlsLm5lMS55YWhvby5jb20+","referencesHeader":"PGtlY25lNCszbzZyQGVHcm91cHMuY29tPiA8NUEzMDA0RDktQzdFNS00MThCLUI4NTgtNDQyNUYwRjhENUMzQHZlcml6b24ubmV0PiA8MTM1OTY0ODQ0OS4yOTAyLllhaG9vTWFpbE5lb0B3ZWIxODIyMDEubWFpbC5iZjEueWFob28uY29tPiA8MTM1OTY1MDI2Mi44OTQyMi5ZYWhvb01haWxOZW9Ad2ViMTI2MTA0Lm1haWwubmUxLnlhaG9vLmNvbT4="},"prevInTopic":49494,"nextInTopic":49497,"prevInTime":49495,"nextInTime":49497,"topicId":49490,"numMessagesInTopic":0,"msgSnippet":"Someone wrote me on the side and I think she has really good questions that may help others so I am forwarding her message here and I hope she forgives me.","messageBody":"<div id=\"ygrps-yiv-188188336\">Someone wrote me on the side and I think she has really good questions that may help others so I am forwarding her message here and I hope she forgives me. That way it may help many and it is a better use of someone taking their time away from family to answer questions.|<br/>\nIt will go anonymous and you do not need to out yourself and claim  to be the author.<br/>\n<br/>\nHere is the message and questions and I will send some great links that may really help under it!:<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;Alex,<br/>\nYour perfectly written post came at a perfect time, as I am trying to grasp what unschooling is all about. <br/>\n I&#39;ve been reading posts on this site since May 2012 and trying to  <br/>\n&#39;read,try,wait and watch&#39; all the while. I&#39;m trying to figure out when &#39;deschooling&#39; ends and <br/>\n&#39;unschooling&#39; begins b/c we are making positive changes to our lifestyle as situations arise, <br/>\nbut I don&#39;t know when we will be &quot;there&quot;(unschooling). Is it when we no longer think<br/>\nabout &#39;subjects&#39; for school? Is it when there is more peace for the children in regards<br/>\nto learning? I keep telling myself that we are &#39;deschooling&#39; for the past 9 months!<br/>\nI&#39;m unsure of when to acknowledge that we are unschooling.<br/>\nDo you have any thoughts on this? &gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\nThe wonderful Kelly Lovejoy who originally started this list wrote this great piece on stages of unschooling:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/kellylovejoy/stages\">http://sandradodd.com/kellylovejoy/stages</a><br/>\n<br/>\n<br/>\nPam Laricchia also wrote about it:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.livingjoyfully.ca/unschooling/stages.htm\">http://www.livingjoyfully.ca/unschooling/stages.htm</a><br/>\n<br/>\n<br/>\nand this is a great article:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/seeingit\">http://sandradodd.com/seeingit</a><br/>\n<br/>\n<br/>\nI would start by reading those and then ask questions!<br/>\n<br/>\nAnother thought I have is that it takes longer for parents to deschool than children and we  will need deschooling as our children grows and new phases and situations arise. <br/>\n<br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Thinking of unschooling, but I still don&#39;t know if it&#39;s right","postDate":"1359648449","msgId":49494,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTk2NDg0NDkuMjkwMi5ZYWhvb01haWxOZW9Ad2ViMTgyMjAxLm1haWwuYmYxLnlhaG9vLmNvbT4=","inReplyToHeader":"PDVBMzAwNEQ5LUM3RTUtNDE4Qi1CODU4LTQ0MjVGMEY4RDVDM0B2ZXJpem9uLm5ldD4=","referencesHeader":"PGtlY25lNCszbzZyQGVHcm91cHMuY29tPiA8NUEzMDA0RDktQzdFNS00MThCLUI4NTgtNDQyNUYwRjhENUMzQHZlcml6b24ubmV0Pg=="},"prevInTopic":49493,"nextInTopic":49496,"prevInTime":49493,"nextInTime":49495,"topicId":49490,"numMessagesInTopic":0,"msgSnippet":" I wrote this one time in this","messageBody":"<div id=\"ygrps-yiv-835545804\">&lt;&lt;&lt;All of the books I have seen on unschooling seem to say let them do whatever they want to do, but what if they do nothing.&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nI wrote this one time in this list:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/alex/unschooling\">http://sandradodd.com/alex/unschooling</a><br/>\n<br/>\n<br/>\nI am going to make a point and maybe it is not the case of the mom above [this was originally on the Unschooling Basics list] but it may be the case for others new to unschooling. I am making this point because I have seen it and I have seen it in person and it does not work and the results are not pretty and have nothing to do with unschooling and being a mindful parent.<br/>\nUnschooling is not letting children take care of themselves or work out things alone or without help and guidance, it is not letting them do whatever they want, it is not about freedom, it is not about only saying yes, it is not about letting them figure out things by themselves, it is not child-led learning.<br/>\n<br/>\nUnschooling takes more, more presence, more guidance, more attention, more mindfulness, more connection, more thinking and questioning, more choices and better choices.<br/>\n<br/>\nThere are some people that come to unschooling because they read blogs or ideas of families having fun and going about doing fun things and not being bogged down by a curriculum or rules and control. They may read a little and think all they have to do is not have rules, not have curriculum, not have bedimes, not have limits in TV, computers and food.<br/>\n<br/>\nWhat they are not reading is all the things an unschooling parent IS doing. They are sitting and playing computer games with their children, they are present, attentive, connected, facilitating, guiding, preventing, strewing, sharing, discovering together, learning right along, creating a learning environment, interested and interesting.<br/>\nSo if you are new to unschooling Sandra has a good suggestion: Read a little, try a little, wait a while, watch.<br/>\n<br/>\nIt takes time to get it. I have been reading and applying unschooling in my home for almost eight years and I am still getting it. It takes time to deschool. Most of us has a minimum of 13 years of schooling and some way more. Ask questions and just sit on the answers, re-read them, think about them, read them again, try them, wait a while and watch!<br/>\nSo all this to say that if someone comes to usnchooling thinking that it will be just sitting there while the kids fend for themselves and it is a piece of cake think again! That is not to say it is not wonderful and yes easier and more peaceful, but not in the way many think it is.<br/>\nAlex Polikowsky<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Thinking of unschooling, but I still don&#39;t know if it&#39;s right","postDate":"1359639715","msgId":49493,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVBMzAwNEQ5LUM3RTUtNDE4Qi1CODU4LTQ0MjVGMEY4RDVDM0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGtlY25lNCszbzZyQGVHcm91cHMuY29tPg==","referencesHeader":"PGtlY25lNCszbzZyQGVHcm91cHMuY29tPg=="},"prevInTopic":49490,"nextInTopic":49494,"prevInTime":49492,"nextInTime":49494,"topicId":49490,"numMessagesInTopic":0,"msgSnippet":"... Right for what? What are your goals? (You don t need to answer on the list. These are questions for you to think about.) Unschooling is a tool. It s like a","messageBody":"<div id=\"ygrps-yiv-598941836\"><blockquote><span title=\"ireply\">&gt; but I still don&#39;t know if it&#39;s right<br/>\n<br/>\n </span></blockquote>Right for what? What are your goals?<br/>\n<br/>\n(You don&#39;t need to answer on the list. These are questions for you to think about.)<br/>\n<br/>\nUnschooling is a tool. It&#39;s like a screw driver. If you want to hammer a nail in, a screw driver won&#39;t be much use.<br/>\n<br/>\nSo what family do you want to have today? What do you want for your children right now? What do you want them to have with them when they leave home? Who do you want to be?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So, I tried the unschooling approach and still they don&#39;t want to learn anything.<br/>\n<br/>\n </span></blockquote>I think what you tried is letting go of curriculum. You didn&#39;t replace it with anything.<br/>\n<br/>\nWhere did you learn about unschooling? I ask not to criticize your reading choices but to understand how people get the understanding of unschooling that they do.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; All of the books I have seen on unschooling seem to say let them do whatever they want to do, but what if they do nothing.<br/>\n<br/>\n </span></blockquote>Though that&#39;s a common description floating about in the world, it&#39;s very misleading. It&#39;s a (misworded) little piece of unschooling which loses its meaning when taken out of context but it gets used to represent all of unschooling. It&#39;s like calling a human a foot.<br/>\n<br/>\nThe real *piece* is better worded as: help them explore whatever interests them. BUT, the context is: Create a rich, nurturing environment that supports kids exploring their interests in and finding new interests. Unschooling is trusting that if they&#39;re exploring in a rich environment they are feeding the seed of the unique person they are.<br/>\n<br/>\nIt requires more involvement than curriculum. It&#39;s about getting to know your kids and helping them reach what&#39;s meaningful to them. It&#39;s about being interested in the world yourself :-) It&#39;s about taking them to the parts of the world you think might interest them -- NOT the parts that would be &quot;good for them&quot; to be interested in! -- and bringing the world to them <br/>\n<br/>\nA good place to begin finding out what unschooling really is, is Pam Laricchia&#39;s set of introductory emails. By subscribing to her twice monthly newsletter, you&#39;ll get the introductory emails too:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://livingjoyfully.ca/newsletter/\">http://livingjoyfully.ca/newsletter/</a><br/>\n<br/>\nHer site also has a lot of good stuff to read.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://livingjoyfully.ca/\">http://livingjoyfully.ca/</a><br/>\n<br/>\nThere&#39;s also:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.ocm/unschooling\">http://sandradodd.ocm/unschooling</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com\">http://joyfullyrejoycing.com</a><br/>\n<br/>\nThe two sites have very different flavors so it&#39;s a matter of which suits your style of exploring best :-)<br/>\n<br/>\nBUT, there&#39;s a massive collection of new ideas at all three sites. The 2 most important ideas to get in place first -- maybe even post on your fridge!:<br/>\n<br/>\nDON&#39;T CHANGE EVERYTHING AT ONCE.<br/>\n<br/>\nRead this first:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/gradualchange\">http://sandradodd.com/gradualchange</a><br/>\n<br/>\nREAD A LITTLE. TRY A LITTLE. WAIT A WHILE. WATCH. REPEAT.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; All they want to do is watch TV, play dolls,<br/>\n<br/>\n </span></blockquote>If you are swirling their life full of interesting things that *they* enjoy and from that they choose TV and playing dolls, then that&#39;s what they need for learning right now. It&#39;s the way of understanding a piece of the world that they find meaningful right now.<br/>\n<br/>\nIf TV and doll play were limited before, they can be filling up a void. Which means they&#39;ll do way more than they normally would until their emotions believe those two won&#39;t be limited again.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/playing\">http://sandradodd.com/playing</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/tv\">http://sandradodd.com/tv</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; fight with each other.<br/>\n<br/>\n </span></blockquote>Be more present. Be more proactive. Rather than waiting for the fight before you step in, step in when you sense the mood turning sour. Bring food. Call one away to do something interesting with you -- like get snacks :-) <br/>\n<br/>\nThe first few links -- and undoubtedly there are links on each page -- should be very helpful:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/siblings\">http://sandradodd.com/siblings</a><br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My 8 and 5 year old hate to read and to be read to.<br/>\n<br/>\n </span></blockquote>Then don&#39;t read to them. You can&#39;t make them like to read, but you can make them not like to read or be read to.<br/>\n<br/>\nDon&#39;t give up! Do something other than what you&#39;ve been doing. (See below)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My 8 year old isn&#39;t reading well at all and doesn&#39;t care.<br/>\n<br/>\n </span></blockquote>He&#39;s learning in loads of other ways. And I don&#39;t mean there&#39;s loads of 2nd class ways of learning. There&#39;s loads of ways to learn that schools ignore because they can&#39;t accommodate them in the production line that schools are. Schools focus on reading not because it&#39;s by far and away the best, but because it allows public school to be *cheap*.  They can have 1 teacher teaching the same thing to 30 students.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/reading\">http://sandradodd.com/reading</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/bookworship\">http://sandradodd.com/bookworship</a><br/>\n<br/>\nAnother thing that might help are these:<br/>\n<br/>\nProducts of Education<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/joyce/products\">http://sandradodd.com/joyce/products</a><br/>\n<br/>\nWhy You Can&#39;t Let Go<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/joyce/talk\">http://sandradodd.com/joyce/talk</a><br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They hate chapter books that come with curriculum boxes like<br/>\n&gt; Heart of Dakota, My Father&#39;s World, they hate to have to listen<br/>\n&gt; to someone (anyone) read. They don&#39;t even like story time at<br/>\n&gt; the Library. Is this normal???<br/>\n<br/>\n </span></blockquote>It&#39;s normal for your family right now. <br/>\n<br/>\nIt&#39;s likely been caused by forcing them to read books they didn&#39;t want to. And that feeling has spilled over onto all books. They need to heal from that. If someone made you eat ice cream everyday -- not LET you but MADE you -- eventually you&#39;d come to dread the daily dose of ice cream.<br/>\n<br/>\nYou can&#39;t make that feeling go away any more than you can make a broken leg heal. But you can create an environment for healing, part of which will involve not reading to them when they don&#39;t want you to. And for right now -- for several months -- don&#39;t even offer. (If they say something bad about reading, don&#39;t correct them. IT&#39;s how they feel right now. You can apologize and say &quot;I&#39;m really sorry that I forced you to listen to books you didn&#39;t want to. I thought I was right but I realize I was wrong now.&quot; State that *factually* as how you feel, not as a plea for their forgiveness. They will come around when they are healed.<br/>\n<br/>\nIn the mean time make their experiences with print pleasant and voluntary. They *will* recover. Just as people recover from broken legs. But it takes time and patience with not walking and not reading.<br/>\n<br/>\nAccept *for now* that they are people who don&#39;t have a need for reading. Do other things. Don&#39;t focus on what they aren&#39;t doing. Focus on what they enjoy doing. They&#39;ll be healed when they heal.<br/>\n<br/>\nAlso be aware that not every unschooled child loves reading. Just as not every child loves ice cream! Or skateboarding. Or dress up. Or Spongebob. But every unschooled child does *learn* to read. They will read what they find useful which is the purpose of reading. They may not ever read for pleasure. They may love nonfiction but turn their noses up at fiction. They may not ever do much reading at all. But they will be able to.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We have turned into a family who fights all the time to get anything done. <br/>\n<br/>\n </span></blockquote>This should help:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a><br/>\n<br/>\nThe best place to begin is probably the audio of a talk Sandra and Rich Prystowsky did about Parenting Peacefully.<br/>\n<br/>\nAnd the Peace page and its links in general:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/\">http://sandradodd.com/peace/</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We argue over the same things everyday like school work, chores, hygiene.<br/>\n<br/>\n </span></blockquote>Most of what you&#39;ll read about chores and hygiene will fly in the face of what parents tell you you must do.<br/>\n<br/>\nIt will also *sound* like let go and let them decide on their own when they want to.<br/>\n<br/>\nIt&#39;s not. You&#39;ll need to let go of a lot of preconceived notions to understand the ideas. It&#39;s about creating an environment that removes as many obstacles between them and making certain choices. It&#39;s about letting go of getting them to do what you want and instead creating a nurturing environment to make choices in.<br/>\n<br/>\nEven that doesn&#39;t capture it.<br/>\n<br/>\nOne thing that might help you understand how this partnership works is reading the page I have of helping kids brush teeth. Note that the first line is &quot;This is not about ways to get kids to brush teeth.&quot;<br/>\n<br/>\nAnd it goes on: It isn&#39;t even solutions to the problem of getting kids to brush teeth. What it is, is how parents who practice mindful parenting and respecting their kids go about finding ways to help their kids have clean teeth. What&#39;s important is not the solutions (though there are several that might work for people) but the process of being a child&#39;s partner.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/unschooling%20in%20action/brushingteeth.html\">http://joyfullyrejoycing.com/unschooling%20in%20action/brushingteeth.html</a><br/>\n<br/>\nHere&#39;s a beginning place about chores:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores\">http://sandradodd.com/chores</a><br/>\n<br/>\nand down the right side of:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n<br/>\nAgain, all of that will sound goofy! And yet those who&#39;ve done it find that by not requiring kids to do chores, by inviting kids to be with you, by offering them real pieces of real work that will help you out, by retaining ownership of all chores and thus: by shifting your thoughts away from them needing to help to how you&#39;d ask among your friends to give you a helping hand, that by the time kids are teens they will voluntarily and sweetly help. Not grumpily and half-assedly as teens who&#39;ve been made to help all along do!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Should I let them fall behind on learning?<br/>\n<br/>\n </span></blockquote>They can&#39;t fall behind if you live as though school didn&#39;t exist.<br/>\n<br/>\nIf you see schools as the only measure of whether something is working, unschooling won&#39;t work well for you. <br/>\n<br/>\nLook instead at your kids.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":409415855,"authorName":"Michelle","from":"&quot;Michelle&quot; &lt;michellebatemanmomof3@...&gt;","profile":"michellebatemanmomof3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Thinking of unschooling, but I still don&#39;t know if it&#39;s right","postDate":"1359601924","msgId":49490,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtlY25lNCszbzZyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":49493,"prevInTime":49489,"nextInTime":49491,"topicId":49490,"numMessagesInTopic":0,"msgSnippet":"This is our 3rd year homeschooling (we started Kindergarten).  This year I have an 8, 5, and 3 year old.  The first year was great, 2nd OK and this year awful.","messageBody":"<div id=\"ygrps-yiv-1865632032\">This is our 3rd year homeschooling (we started Kindergarten).  This year I have an 8, 5, and 3 year old.  The first year was great, 2nd OK and this year awful.  I have tried different textbooks, computer lessons, they don&#39;t want to do any of it this year.  So, I tried the unschooling approach and still they don&#39;t want to learn anything.  All they want to do is watch TV, play dolls, fight with each other.  My 8 and 5 year old hate to read and to be read to.  My 8 year old isn&#39;t reading well at all and doesn&#39;t care.  They hate chapter books that come with curriculum boxes like Heart of Dakota, My Father&#39;s World, they hate to have to listen to someone (anyone) read.  They don&#39;t even like story time at the Library.  Is this normal??? We have turned into a family who fights all the time to get anything done.  We argue over the same things everyday like school work, chores, hygiene. All of the books I have seen on unschooling seem to say let them do whatever they want to do, but what if they do nothing.  Should I let them fall behind on learning? Should I not make them brush teeth and take a bath?  Never make them clean their room? Because if I don&#39;t make them do these things they wouldn&#39;t do them.  I know this because I have tried it for a few months now and nothing.  I know they are young, but when do you start to worry? I don&#39;t know what to do, should I just let it go and one day it will click and not worry that my 8 year old is fallen behind? My husband is tired of all the fussing and them not wanting to learn that he wants to send them to public school next year.  I really don&#39;t want that, but I starting to think maybe homeschooling is what I want for them and not what they want. I am scared and I&#39;m tired.  I want us to be happy and have fun with homeschooling, but we are not.  Any thoughts, suggestions?<br/>\n<br/>\nMichelle</div>","specialLinks":[]}],"prevTopicId":49482,"nextTopicId":49499}}