{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":212934673,"authorName":"Pampered Chef Michelle","from":"&quot;Pampered Chef Michelle&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] no t.v. and coffee","postDate":"1145308249","msgId":12221,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA0MTcxNDEwdzVmYjcwMTNjbTlmOGIwMmY3NzAzNmM4ODFAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDNBMTZDRUQ2LTgxN0UtNDEwRS1CQkUzLTI0NjEyREI4RjFBREBlYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PDIwMDYwNDE3MTM1Ny4xZnZ4WWw5MTNObDM0ajBAbXgtYXVzdHJpYW4uYXRsLnNhLmVhcnRobGluay5uZXQ+CSA8M0ExNkNFRDYtODE3RS00MTBFLUJCRTMtMjQ2MTJEQjhGMUFEQGVhcnRobGluay5uZXQ+"},"prevInTopic":12219,"nextInTopic":0,"prevInTime":12220,"nextInTime":12222,"topicId":12210,"numMessagesInTopic":0,"msgSnippet":"... I meant to comment on this earlier and forgot.  My co-parent is diabetic. Because of Keon s eating issues (for those that may not have read recent past","messageBody":"<div id=\"ygrps-yiv-552879746\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; &gt; Diabetes is very prevalent in my family and my daughter and I both<br/>\n&gt; &gt; have<br/>\n&gt; &gt; about a 75% chance of getting it<br/>\n<br/>\n<br/>\n </span></blockquote>I meant to comment on this earlier and forgot.  My co-parent is diabetic.<br/>\nBecause of Keon&#39;s eating issues (for those that may not have read recent<br/>\npast posts on this Keon falls into the autistic spectrum and has difficulty<br/>\nwith many issues including food) Dan was concerned that he, too, would end<br/>\nup diabetic.  My maternal grandfather was also diabetic.  We too had heard<br/>\n75% thrown at us.  Dan talked to his doctor and what she said is that<br/>\nsomeone having a 75% chance of getting something is grossly misworded.  The<br/>\nway that it should be worded is that a person who has a family history of<br/>\ndiabetes has a 75% higher chance of developing diabetes than someone with NO<br/>\nfamily history of diabetes and that it is very rare to find someone who has<br/>\nNO history of diabetes.  She said also to consider what type of diabetes it<br/>\nis and when it developed in a person.  Was the diabetes juvenile or<br/>\nsomething that was an issue in a healthy fit adult or did the diabetes<br/>\ndevelop when the adult was in his late 30&#39;s or later and was a result of<br/>\nimproper eating.  The reason that we see family histories of late-onset<br/>\ndiabetes has more to do with diet than genetics.  Fat adults mostly have fat<br/>\nchildren not because of genetics but because of the type of diet that they<br/>\nsubject their children to.  The children develop diabetes not because of<br/>\ngenetics but because of lifestyle<br/>\n<br/>\nSo how does unschooling play in all this?  Simple, children when allowed to<br/>\nset their own eating patterns may indulge at first, but eventually will<br/>\nbalance out because they learn what feels good when they eat and what feels<br/>\nnot so good.  Sure watermelon tastes good but if you eat half a watermelon<br/>\n(or even a 2&quot; ring of watermelon) you will get a tummy ache and that doesn&#39;t<br/>\nfeel good.  So the next time they may have only a quarter of a watermelon<br/>\n(or 1/2 of a 2&quot; ring.)  Maybe chocolate cake tastes great, but if you eat<br/>\nhalf a chocolate cake while your mouth may be happy your body isn&#39;t.  They<br/>\nlearn to distinguish those things without an adult telling them what to<br/>\neat.  It may surprise you to know that even though our house has quite a bit<br/>\nof &quot;junk food&quot; in it, my kids are just as apt to grab a piece of fruit or<br/>\ncheese or a slice of bread as they are chips, cookies or candy.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--<br/>\nMichelle<br/>\nIndependent Kitchen Consultant #413652<br/>\nThe Pampered Chef<br/>\n850-474-0817<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.pamperedchef.biz/michellelr\">http://www.pamperedchef.biz/michellelr</a><br/>\nAsk me how you can save 60% on some of our most favorite products!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8667530,"authorName":"Manisha Kher","from":"Manisha Kher &lt;m_kher@...&gt;","profile":"m_kher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] no t.v. and coffee","postDate":"1145302824","msgId":12219,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNDE3MTk0MDI0LjM4NjkwLnFtYWlsQHdlYjU0NDEwLm1haWwueWFob28uY29tPg=="},"prevInTopic":12218,"nextInTopic":12221,"prevInTime":12218,"nextInTime":12220,"topicId":12210,"numMessagesInTopic":0,"msgSnippet":"... Whoa! You made a big leap there from not denying a sip when a child asks for it to offering it your child. No one has suggested that you offer","messageBody":"<div id=\"ygrps-yiv-1993087232\">--- Misty Felner &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:misty@...\">misty@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; My answer to the question about coffee.  Yes, I&#39;ve<br/>\n&gt; heard there are benefits<br/>\n&gt; to drinking it, as with red wine, but I wouldn&#39;t<br/>\n&gt; start giving my child a<br/>\n&gt; glass of wine every night for dinner or coffee every<br/>\n&gt; morning.<br/>\n&gt; <br/>\n </span></blockquote>Whoa! You made a big leap there from not denying a sip<br/>\nwhen a child asks for it to offering it your child. No<br/>\none has suggested that you offer non-nutritious stuff<br/>\nto your kid. The issue is what do you do when your kid<br/>\nasks for it. <br/>\n<br/>\nManisha<br/>\n<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] no t.v. and coffee","postDate":"1145302299","msgId":12218,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBMTZDRUQ2LTgxN0UtNDEwRS1CQkUzLTI0NjEyREI4RjFBREBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDYwNDE3MTM1Ny4xZnZ4WWw5MTNObDM0ajBAbXgtYXVzdHJpYW4uYXRsLnNhLmVhcnRobGluay5uZXQ+","referencesHeader":"PDIwMDYwNDE3MTM1Ny4xZnZ4WWw5MTNObDM0ajBAbXgtYXVzdHJpYW4uYXRsLnNhLmVhcnRobGluay5uZXQ+"},"prevInTopic":12213,"nextInTopic":12219,"prevInTime":12217,"nextInTime":12219,"topicId":12210,"numMessagesInTopic":0,"msgSnippet":"... Before I get into that, what do you fear will happen if she watches more TV than you would allow her to? Why does that frighten you? What evidence in","messageBody":"<div id=\"ygrps-yiv-580964831\">On Apr 17, 2006, at 1:55 PM, Misty Felner wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What sticks out most is that when you watch<br/>\n&gt; television the brain waves in your brain switch the wave that is the<br/>\n&gt; meditation/sleep wave.   For this reason, especially at my  <br/>\n&gt; daughter&#39;s age I<br/>\n&gt; feel it appropriate for me to monitor the amount of TV viewing she  <br/>\n&gt; does.<br/>\n<br/>\n </span></blockquote>Before I get into that, what do you fear will happen if she watches  <br/>\nmore TV than you would allow her to?<br/>\n<br/>\nWhy does that frighten you?<br/>\n<br/>\nWhat evidence in unschooled children have you seen that supports what  <br/>\nyou fear?<br/>\n<br/>\nHere&#39;s something I wrote a while ago when someone brought up the  <br/>\nmeditation/sleep wave &quot;research&quot;:<br/>\n<br/>\n++++++++<br/>\nhttp://home.earthlink.net/~fetteroll/rejoycing/influencing%20kid% <br/>\n20behavior/tv%20and%20video%20games/argumentsagainsttv.html<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And, actually a study was done that shows that some children, a  <br/>\n&gt; limited number, do not think while &quot;zoning&quot; in front of the boob  <br/>\n&gt; tube. Some children actually go into an almost sleep/dream state, a  <br/>\n&gt; sort of self-hypnosis in which they brain waves patterns indicate  <br/>\n&gt; no active thought patterns.<br/>\n </span></blockquote>Can you site a source for this? I can&#39;t seem to find one. What I did  <br/>\nfind (over and over and over) is a quote from &quot;Battle for Your Mind:  <br/>\nSubliminal Programming&quot;: by Dick Sutphen:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Recent tests by researcher Herbert Krugman showed that, while  <br/>\n&gt;&gt; viewers were watching TV, right-brain activity outnumbered left- <br/>\n&gt;&gt; brain activity by a ratio of two to one. Put more simply, the  <br/>\n&gt;&gt; viewers were in an altered state . . . in trance more often than  <br/>\n&gt;&gt; not. They were getting their Beta-endorphin &quot;fix.&quot;<br/>\n&gt;&gt;<br/>\n&gt;&gt; To measure attention spans, psychophysiologist Thomas Mulholland  <br/>\n&gt;&gt; of the Veterans Hospital in Bedford, Massachusetts, attached young  <br/>\n&gt;&gt; viewers to an EEG machine that was wired to shut the TV set off  <br/>\n&gt;&gt; whenever the children&#39;s brains produced a majority of alpha waves.  <br/>\n&gt;&gt; Although the children were told to concentrate, only a few could  <br/>\n&gt;&gt; keep the set on for more than 30 seconds!<br/>\n<br/>\n </span></blockquote>Left brain activity (according to an anatomy and physiology text) is  <br/>\nassociated with spoken and written language, numerical and scientific  <br/>\nskills and reasoning. Right brain activity is associated with musical  <br/>\nand artistic awareness, space and pattern perception, insight,  <br/>\nimagination, generating mental images to compare spatial  <br/>\nrelationships. (No connection is made between right brained  <br/>\nactivities and being in a trance like state.)<br/>\n<br/>\n From that list, it makes sense to me that TV watching would be a  <br/>\nright brained activity. I suppose if there&#39;s something inherently  <br/>\nwrong with right brained activities, we should stop kids from drawing  <br/>\nand imagining and being insightful.<br/>\n<br/>\nThe text says that alpha waves are present in the EEGs of nearly all  <br/>\nnormal individuals when they are awake and resting with their eyes  <br/>\nclosed. These waves disappear entirely during sleep. Beta waves  <br/>\ngenerally appear when the nervous system is active, that is, during  <br/>\nperiods of sensory input and mental activity. (Note that it says  <br/>\ngenerally.)<br/>\n<br/>\n(Just as an interesting factoid, it says delta waves occur during  <br/>\ndeep sleep but they are also normal in an awake infant.)<br/>\n<br/>\nAnother site says alpha waves are brought out by closing the eyes and  <br/>\nby relaxation, and abolished by eye opening or alerting by any  <br/>\nmechanism (thinking, calculating). Alpha waves are the major rhythm  <br/>\nseen in normal relaxed adults - it is present during most of life  <br/>\nespecially beyond the thirteenth year when it dominates the resting  <br/>\ntracing. (Alpha waves are also present during meditation and  <br/>\nhypnosis.) And that beta waves are the dominant rhythm in patients  <br/>\nwho are alert or anxious or who have their eyes open.<br/>\n<br/>\nThat would suggest people aren&#39;t thinking when they watch TV. But  <br/>\ndoes that make sense? I could list off a huge number of things that  <br/>\nI&#39;ve learned from watching TV. How can learning take place without  <br/>\nthinking? There is also research into Controlling Computers With  <br/>\nNeural Signals (in Scientific American) which uses Alpha and Mu  <br/>\nwaves. If alpha waves stop when thought happens, how could those  <br/>\nwaves be used to perform a computer action if we have to stop  <br/>\nthinking in order to generate them?<br/>\n<br/>\nWhat it really means is that people enjoy dabbling in pseudo-science.  <br/>\nThey are using faulty logic -- hypnosis may generate alpha but that  <br/>\ndoesn&#39;t mean alpha indicates hypnosis, thinking may generate beta but  <br/>\nthat doesn&#39;t mean that beta indicates thinking (or that lack of beta  <br/>\nmeans lack of thinking) -- to draw a conclusion to fit their theory.<br/>\n<br/>\nTo get a more complete picture we need to know what the waves look  <br/>\nlike when we&#39;re deeply involved in a novel. Or watching a play. Or  <br/>\nplaying a video game. Or watching a sporting event. Or painting. Or  <br/>\ngazing down at a sleeping or nursing infant. (Not that it would  <br/>\nindicate anything. It would just be more data on how the brain  <br/>\noperates.) If alpha waves increased during those times, should we  <br/>\nstop those things? Or does it merely mean that &quot;thinking stops alpha  <br/>\nwaves&quot; and &quot;beta is present during mental activity&quot; are too  <br/>\nsimplistic and don&#39;t adequately describe what&#39;s going on?<br/>\n<br/>\n++++++<br/>\n<blockquote><span title=\"ireply\"> &gt; I &quot;censor&quot; what my daughter eats.<br/>\n<br/>\n </span></blockquote>A coworker had an adult son with juvenile diabetes. She too felt his  <br/>\neating habits and behavior were her responsibility until he showed he  <br/>\ncould be trusted. And because he fought against the control he never  <br/>\nshowed he could be trusted. He was an adult when she told me of his  <br/>\nself destructive behavior but she still felt she needed to save him  <br/>\nfrom himself. (Which I think *is* a perfectly natural need!)<br/>\n<br/>\nThis was long before I read about  trusting kids but even I could see  <br/>\nthat he was self-destructing not because he was stupid but because  <br/>\nhis mother had never trusted him to be intelligent enough not to want  <br/>\nto die.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Diabetes is very prevalent in my family and my daughter and I both  <br/>\n&gt; have<br/>\n&gt; about a 75% chance of getting it<br/>\n<br/>\n </span></blockquote>Family history of diabetes and alcoholism, food allergies are all  <br/>\nrealities of some kids&#39; lives. If we trust them, children can  <br/>\nunderstand the consequences of the choices they have.<br/>\n<br/>\nTrust doesn&#39;t mean letting them learn entirely through  <br/>\nexperimentation. We can give them information. When death is not  <br/>\nimminent, we can help them experiment and learn what their own bodies  <br/>\nare capable of.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Yes, I&#39;ve heard there are benefits<br/>\n&gt; to drinking it, as with red wine, but I wouldn&#39;t start giving my  <br/>\n&gt; child a<br/>\n&gt; glass of wine every night for dinner or coffee every morning.<br/>\n<br/>\n </span></blockquote>No one said give your child coffee because it&#39;s healthy. Someone was  <br/>\nquestioning the statement that coffee is bad for you.<br/>\n<br/>\nThe principle is to be our children&#39;s partner as they explore the  <br/>\nworld. A sip of coffee or a sip of alcohol won&#39;t hurt a kid. Even, as  <br/>\nmany people pointed out, nothing bad has come from kids who had  <br/>\ncoffee somewhat regularly.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; especially when you add the amount of sugar in a vanilla latte.<br/>\n<br/>\n </span></blockquote>What do you fear will happen if your child drinks the amount of sugar  <br/>\nin a vanilla latte?<br/>\n<br/>\nHave you asked how radical unschoolers handle children with special  <br/>\ndietary needs?<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":212934673,"authorName":"Pampered Chef Michelle","from":"&quot;Pampered Chef Michelle&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] no t.v. and coffee","postDate":"1145297968","msgId":12213,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA0MTcxMTE5cTI3ZWExOTJhdzdhYzM2MWYzODY4NjQyNTBAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDQ0NDNkNzA0LjZiYzUxMmZhLjE4YjQuZmZmZmFiYjNTTVRQSU5fQURERURAbXguZ21haWwuY29tPg==","referencesHeader":"PDExNDUyMjUzMDUuMTAyNC40OTU0NS5tMjNAeWFob29ncm91cHMuY29tPgkgPDQ0NDNkNzA0LjZiYzUxMmZhLjE4YjQuZmZmZmFiYjNTTVRQSU5fQURERURAbXguZ21haWwuY29tPg=="},"prevInTopic":12210,"nextInTopic":12218,"prevInTime":12212,"nextInTime":12214,"topicId":12210,"numMessagesInTopic":0,"msgSnippet":"... That s because the majority of people who watch television are not truly engaged in this activity.  Did you know that people who knit also switch to a","messageBody":"<div id=\"ygrps-yiv-201195319\">On 4/17/06, Misty Felner &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:misty@...\">misty@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; I agree t.v. is not a demon, however in writing an article for local<br/>\n&gt; magazines about the increasing number of TVs in local restaurants and<br/>\n&gt; requesting that local owners do away with them or turn them off unless<br/>\n&gt; otherwise requested I&#39;ve uncovered a lot of research from around the world<br/>\n&gt; regarding television watching.  What sticks out most is that when you<br/>\n&gt; watch<br/>\n&gt; television the brain waves in your brain switch the wave that is the<br/>\n&gt; meditation/sleep wave.  For this reason, especially at my daughter&#39;s age I<br/>\n&gt; feel it appropriate for me to monitor the amount of TV viewing she does.<br/>\n<br/>\n<br/>\n </span></blockquote>That&#39;s because the majority of people who watch television are not truly<br/>\nengaged in this activity.  Did you know that people who knit also switch to<br/>\na meditative/sleep wave pattern?  People who do repetitive activities also<br/>\nwill do this.  Also, how truly engaged were these people in watching tv or<br/>\nwere they watching it because it was there?  What about the difference<br/>\nbetween a person who was watching a rerun of Law and Order and someone who<br/>\nwas watching something that truly interested them such as a sporting event,<br/>\naction movie, documentary, news or a new episode of a favorite program?<br/>\n<br/>\nIf someone is truly unschooled and have unlimited access to television then<br/>\ntelevision will become just another tool to engage with.  When limited it<br/>\nbecomes something coveted.  I&#39;ve watched my daughter&#39;s friend who is<br/>\ntraditionally schooled with lots of limitations put on her come to our house<br/>\nand want to spend the entire weekend watching tv or playing video games.  My<br/>\ndaughter is saying, &quot;Come on let&#39;s go do something&quot; or &quot;Would you like to<br/>\nwalk down to the park?&quot; and her friend totally zoned out in front of the<br/>\ntv.  She thinks my kids are so lucky that they can watch tv anytime that<br/>\nthey want!  To her tv is a limited commodity and when she does get to watch<br/>\nit she watches all she can.<br/>\n<br/>\nOh and I knit while I watch tv, so I must be nearly catatonic :)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--<br/>\nMichelle<br/>\nIndependent Kitchen Consultant #413652<br/>\nThe Pampered Chef<br/>\n850-474-0817<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.pamperedchef.biz/michellelr\">http://www.pamperedchef.biz/michellelr</a><br/>\nAsk me how you can save 60% on some of our most favorite products!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":217204862,"authorName":"Misty Felner","from":"&quot;Misty Felner&quot; &lt;misty@...&gt;","profile":"mistyfelner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"no t.v. and coffee","postDate":"1145296512","msgId":12210,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDExNDUyMjUzMDUuMTAyNC40OTU0NS5tMjNAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":12213,"prevInTime":12209,"nextInTime":12211,"topicId":12210,"numMessagesInTopic":0,"msgSnippet":"Joyce wrote: TV is not a demon. It s just another medium. It s another window to the world, more akin, in fact, to the internet and the library than to a book.","messageBody":"<div id=\"ygrps-yiv-181449525\">Joyce wrote:<br/>\nTV is not a demon. It&#39;s just another medium. It&#39;s another window to  <br/>\nthe world, more akin, in fact, to the internet and the library than  <br/>\nto a book.<br/>\n<br/>\nI agree t.v. is not a demon, however in writing an article for local<br/>\nmagazines about the increasing number of TVs in local restaurants and<br/>\nrequesting that local owners do away with them or turn them off unless<br/>\notherwise requested I&#39;ve uncovered a lot of research from around the world<br/>\nregarding television watching.  What sticks out most is that when you watch<br/>\ntelevision the brain waves in your brain switch the wave that is the<br/>\nmeditation/sleep wave.  For this reason, especially at my daughter&#39;s age I<br/>\nfeel it appropriate for me to monitor the amount of TV viewing she does.<br/>\nLet me remind you I do not claim to be a RU, so I&#39;m sure there are those of<br/>\nyou who will disagree with my &quot;interference&quot;.  But, just like the mother who<br/>\ncensors what her son watches so he doesn&#39;t get nightmares I&#39;m doing what I<br/>\nfeel is best for my daughter.  <br/>\n<br/>\nThis is the same way I feel about the question of me not allowing my<br/>\ndaughter to partake of some foods.  I &quot;censor&quot; what my daughter eats.<br/>\nDiabetes is very prevalent in my family and my daughter and I both have<br/>\nabout a 75% chance of getting it, me in the next 10 yrs, her by the age of<br/>\n20-30.  I have a aunt who is blind and dying from the disease.  So I&#39;m<br/>\ntaking measures now to help develop healthy eating habits in all of our<br/>\nfamily.  My DH has a cholesterol, and yes there was a time when he asked for<br/>\nsteak and I told him no, not until is cholesterol is lowered.  For me it&#39;s<br/>\nless about freedom and more about health/nutrition.<br/>\n<br/>\nMy answer to the question about coffee.  Yes, I&#39;ve heard there are benefits<br/>\nto drinking it, as with red wine, but I wouldn&#39;t start giving my child a<br/>\nglass of wine every night for dinner or coffee every morning. Nutritionally<br/>\n(these post have made me realize I should be using the word nutritious<br/>\nrather than healthy)I don&#39;t think there&#39;s much if any value in either,<br/>\nespecially when you add the amount of sugar in a vanilla latte.  <br/>\n<br/>\n<br/>\nMisty</div>","specialLinks":[]}],"prevTopicId":12108,"nextTopicId":12242}}