{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ideas, please!","postDate":"1258508811","msgId":42097,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhkdmptYis3c3E3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhkcjh2ciszbXJ1QGVHcm91cHMuY29tPg=="},"prevInTopic":42096,"nextInTopic":0,"prevInTime":42096,"nextInTime":42098,"topicId":42083,"numMessagesInTopic":0,"msgSnippet":"... ********************* Some kids are naturally more competitive than others - you may have two very competitive kids. If you think that s the case, find","messageBody":"<div id=\"ygrps-yiv-905976691\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Kathryn&quot; &lt;kathryndubay@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; No 2:  The two eldest are really competing for my attention at present.  They are also both highly competitive of each other.<br/>\n </span></blockquote>*********************<br/>\n<br/>\nSome kids are naturally more competitive than others - you may have two very competitive kids. If you think that&#39;s the case, find ways for each of them to compete and win, maybe with you and dad, rather than each other, so there&#39;s someone who can lose graciously! In the moment, when both are wanting to &quot;win&quot; look for ways to validate both of them as winners in some way, maybe each in a different way. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Jude doesn&#39;t seem to have any concept/acceptance of taking turns<br/>\n<br/>\n </span></blockquote>It may be that he sees &quot;taking turns&quot; as being asked/told to give something up. Generally, for people to be okay with doing that, they have to feel like they&#39;ve had &quot;enough&quot; first. Taking turns may not work for him for awhile, unless he gets a really looooooong turn - as in, he plays with whatever until he&#39;s done. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;We went to the local Botanic Gardens, and they both took a scooter with them.  Both are Judes (4y/o) but one is preferred by both kids. <br/>\n </span></blockquote>**************************<br/>\n<br/>\nOne unschooling mom I know never gets anything for just one of her boys - either they can afford two, or none. Another would buy some toys that &quot;belonged&quot; to mom! Then she could choose to share, and no-one else &quot;had to&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I get why they both reacted as they did.  I tried hard to help them solve their problem, but they didn&#39;t want a bar of it.  They just got more and more heated. <br/>\n </span></blockquote>*********************<br/>\n<br/>\nSometimes its possible to distract and redirect, if you get in early enough. Especially if you know you&#39;re kids tend to argue on and on, it might be better to see the whole arguement as a &quot;need&quot; for a change of space, change in energy. Offer to do something completely different like go get ice-cream, or play a different game. Work on changing the dynamic, rather than trying to &quot;solve&quot; something that isn&#39;t really fixable. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; No 1:  BUSTING for some really good, original ideas from those out there that have high energy kids.  Not necessarily structured games, as such, more a purge of energy; BIG purge, that is!  We have a tramp and a hammock (used as a swing), and an old ladder that I intend to convert into monkey-bars.  Backyard games, please.  Our space is fairly small.  Kids are 7, 4 & 1.<br/>\n </span></blockquote>*********************<br/>\n<br/>\nMonkey bars are good. Hang some kind of rope ladder from the monkey bars for more climbing. <br/>\n<br/>\nDo you have a net on your tramp? Balls inside the net are great fun. Also stuffed toys. <br/>\n<br/>\nPool noodles for soft battling could be good or a mess. You&#39;ll have to stay on top of that, for sure. <br/>\n<br/>\nBalloons can be used for &quot;ball&quot; games indoors and out. <br/>\n<br/>\nFlimsy scarves are fun for dancing. Extra long scarves are fun to twirl in the air. <br/>\n<br/>\nWrap kids up in a sleeping bag like a burrito and roll them back and forth. Other kids can help with the rolling. <br/>\n<br/>\nInflatable furniture can be great for wrestling with and climbing on/over. Get it as cheap as you can, though, so its not a crisis when it deflates. Inflatable punching bags are good for this, too. <br/>\n<br/>\nBig exercise balls have lots of wonderful uses. Those &quot;bouncy&quot; balls with the handles on top are good, too. <br/>\n<br/>\nDo you have a sandbox? The little ones, especially, may find playing in the sand calming. <br/>\n<br/>\nMake tunnels with bedsheets etc and do some crawling fun. Pretend to be animals. <br/>\n<br/>\nYelling games can be good for purging energy - roar like a lion or screech like a... oh, geez I&#39;m tired all I can think is zombie. Snort!<br/>\n<br/>\nHope some of that helps. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar@earthlink.net","from":"&lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: Ideas, please!","postDate":"1258489496","msgId":42096,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPTUVOUERCQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGhkdGhtMytucjBzQGVHcm91cHMuY29tPg=="},"prevInTopic":42095,"nextInTopic":42097,"prevInTime":42095,"nextInTime":42097,"topicId":42083,"numMessagesInTopic":0,"msgSnippet":"... Need at present.  ","messageBody":"<div id=\"ygrps-yiv-1774245535\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; Our time Together is not the issue; it&#39;s the one-on-one they seem to<br/>\n </span></blockquote>Need at present.  &lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nI didn&#39;t get that from the original post. If they need one-on-one time, then<br/>\nthat is what you need to do. Even though we have four children, we try to<br/>\nsend time with each of the kids on a daily basis. My 2 year old wakes up<br/>\nbefore the older kids so I will cuddle with her and nurse her before her<br/>\nsisters wake up. My oldest likes to spend time on the computer so I will try<br/>\nto find time each day to play with her on the computer. She really likes<br/>\nYoville so I will get on my computer and go visit her and say hi. Her dad<br/>\nand I have had family &quot;meetings&quot; in Yoville where we go visit her together.<br/>\nShe even hosted a wedding for us to get married online. My 5 year old really<br/>\nlikes to go shopping so my husband or I will try to find time for her (and<br/>\njust her) to run an errand or go shopping with us. When we are all doing<br/>\nother stuff, my husband and I try to make it a point to go check on each of<br/>\nthe kids and say hi and ask about what they are doing and give them some<br/>\none-on-one time. Whenever they get into a pattern of fighting over us, then<br/>\nwe know it is time to find ways to give them more one-on-one time where they<br/>\ndon&#39;t have to compete for our attention.<br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Ideas, please!","postDate":"1258477099","msgId":42095,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3OEI3RTQ1RjVGNzRDQjdCNTI1NkRDN0YyQTU2ODA0QExZTEFMQVAyPg==","inReplyToHeader":"PGhkdGhtMytucjBzQGVHcm91cHMuY29tPg==","referencesHeader":"PGhkdGhtMytucjBzQGVHcm91cHMuY29tPg=="},"prevInTopic":42094,"nextInTopic":42096,"prevInTime":42094,"nextInTime":42096,"topicId":42083,"numMessagesInTopic":0,"msgSnippet":"==Did Mia ask Jude if she could claim it for the day? If not, then Mia is being very presumptive. I don t think she should get to claim her brother s stuff for","messageBody":"<div id=\"ygrps-yiv-1299622024\">==Did Mia ask Jude if she could claim it for the day? If not, then Mia is being very presumptive. I don&#39;t think she should get to claim her brother&#39;s stuff for a day. Why can&#39;t Mia get her own scooter? It seems like it might be a good idea to take her to the store and let her pick out her own scooter to eliminate her need to take her brother&#39;s.==<br/>\n<br/>\nShe didn&#39;t ask him, but he did know, and was fine with it. I used the scooter incident as an example of the type of conflict that occurs here. Funny you mention Mia getting her own scooter; that was my idea after the dust settled! We went and got one today at the op-shop. <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>it sounds like maybe the kids are being viewed as/treated as a &quot;unit&quot; more than they are appreciating right now.  nothing big or overt, or terrible, but it just sounds like they are showing a need for more indvidual recognition of their needs, their existence right now?<br/>\n<br/>\nmy kids (now 11 and 14) have gone through phases of needing more separate time, more &quot;special time&quot; where their unique interests are celebrated and focused on, etc.<br/>\n<br/>\ni could be wrong, but just the impression i get from what you shared about finding games  they would both like to play (an honorable and necessary thing of course, sometimes), jude having two scooters and mia having none, but being able to &quot;claim&quot; his, and what you share about them wanting to exclude only each other at times.  perhaps they are &quot;the kids&quot; more than they are needing right now, instead of mia and jude?<br/>\n<br/>\ndo you carve out any individual time with each of them?  doing just exactly what brings them joy and comfort?  completely undistracted by what the other one would want?  i have found that to be *essential* in my kids&#39; relationship with each other.  the more they felt that the other detracted from their life by having differing needs, the worse their relationship got.  the more i could fill each of their indvidual cups, the better their relationship got, and the more time we could spend all together.<br/>\n<br/>\nlyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":367169565,"authorName":"Melissa Gray","from":"Melissa Gray &lt;melissagr8@...&gt;","profile":"graymamacita","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Ideas, please!","postDate":"1258471286","msgId":42094,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4OUU1NDdBLTQwMDEtNDZENC1BOEIwLTJGNEE0NTBEOUYwN0BnbWFpbC5jb20+","inReplyToHeader":"PGhkdGhtMytucjBzQGVHcm91cHMuY29tPg==","referencesHeader":"PGhkdGhtMytucjBzQGVHcm91cHMuY29tPg=="},"prevInTopic":42092,"nextInTopic":42095,"prevInTime":42093,"nextInTime":42095,"topicId":42083,"numMessagesInTopic":0,"msgSnippet":"have you thought about scheduling one-on-one time with them? If you can get that guaranteed intense one on one with them, it may help with day to day type of","messageBody":"<div id=\"ygrps-yiv-1566382329\">have you thought about scheduling one-on-one time with them? If you  <br/>\ncan get that guaranteed intense one on one with them, it may help  <br/>\nwith day to day type of stuff. Whether it&#39;s taking them each out to  <br/>\ndinner once a week, or one Saturday a month that is just them, hiking  <br/>\nor fishing or shopping or whatever you &#39;do&#39;, with a lunch and dinner  <br/>\nout. My family runs much smoother when my kids have their date night,  <br/>\nit&#39;s easier to compromise on time spent all together if they know  <br/>\nthat their time is coming up. It doesn&#39;t even have to be a date, just  <br/>\ngetting to the store alone with mom, or walking around the  <br/>\nneighborhood after dinner while the other child spends time with your  <br/>\ndh or dp, or even a trusted neighbor or friend.<br/>\n<br/>\nMelissa<br/>\nMom to Joshua, Breanna, Emily, Rachel, Samuel, Daniel, Avari, and  <br/>\nbaby Nathan!<br/>\nWife to Zane<br/>\nTIGERS HERE<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://pack777cubscouts.blogspot.com/\">http://pack777cubscouts.blogspot.com/</a><br/>\nBLOG ME at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives.blogspot.com/\">http://startlinglives.blogspot.com/</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Nov 17, 2009, at 1:00 AM, Kathryn wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &lt;otherstar@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; =If you use the swing as a hammock, why can&#39;t both kids get in it  <br/>\n&gt; together?=<br/>\n&gt;<br/>\n&gt; We do! Even Rueben (1 y/o) often climbs on in and enjoys a swing.  <br/>\n&gt; I&#39;m pretty active with them, jumping on the tramp, etc. I LOVE  <br/>\n&gt; playing with them! Our time Together is not the issue; it&#39;s the one- <br/>\n&gt; on-one they seem to Need at present.<br/>\n&gt;<br/>\n&gt; =I tell them to find games or things that we can do together.=<br/>\n&gt;<br/>\n&gt; I do sit and attempt to &#39;nut out&#39; with the eldest two activities we  <br/>\n&gt; can play together. Often, Mia expresses her desire to Not involve  <br/>\n&gt; Jude, and to play alone with me. Jude is now expressing the same  <br/>\n&gt; Need! It&#39;s hard, almost impossible to problem solve with two kids  <br/>\n&gt; that are adamant they Want on-on-one with me!<br/>\n&gt;<br/>\n&gt; ==I have heard the book &quot;Siblings Without Rivalry&quot; is a good read.==<br/>\n&gt;<br/>\n&gt; Got it, read it. It does have really great information, and the  <br/>\n&gt; communication skills it mentions are already at play here. Lots of  <br/>\n&gt; listening on my behalf . . . I do get why they are frustrated with  <br/>\n&gt; each other, and I think they know this too; which is why they lash  <br/>\n&gt; out at me!<br/>\n&gt;<br/>\n&gt; ==You need to help him learn to take turns.==<br/>\n&gt;<br/>\n&gt; Good point! However, he is a very genorous, sharing person by  <br/>\n&gt; nature. His dislike in sharing me is for Mia alone! And vice-versa<br/>\n&gt;<br/>\n&gt; ==If they are not being physical with each other, why did you need  <br/>\n&gt; to physically step in? ==<br/>\n&gt;<br/>\n&gt; I physically stepped in just before they came to blows. I think I  <br/>\n&gt; should have stepped in earlier . . .<br/>\n&gt;<br/>\n&gt; ==I know that sibling disagreements can be pretty heated and they  <br/>\n&gt; can go beyond our own comfort zone rapidly. If nobody is getting  <br/>\n&gt; hurt, I don&#39;t think a little yelling between siblings is going to  <br/>\n&gt; hurt.==<br/>\n&gt;<br/>\n&gt; The yelling doesn&#39;t concern me, it&#39;s the obvious upset that is  <br/>\n&gt; escalating into something More. It&#39;s like they have NO tolerance  <br/>\n&gt; *by choice* to deal with their problems.<br/>\n&gt;<br/>\n&gt; ==Perhaps you need to say, &quot;Look guys, I love you both and I can see<br/>\n&gt; both sides of this so I am not going to get involved. You guys need to<br/>\n&gt; figure this out for yourselves.&quot; Or, you can help them to see each  <br/>\n&gt; other&#39;s side. Look Mia, your brother is mad because blah, blah,  <br/>\n&gt; blah. Look Jude, your sister is mad because blah, blah, blah. I am  <br/>\n&gt; not going to get involved because you both have equally valid  <br/>\n&gt; points.==<br/>\n&gt;<br/>\n&gt; Wouldn&#39;t work. Emotions are running too high, and all my talk is  <br/>\n&gt; just &#39;blah blah blah&#39; at this point.<br/>\n&gt;<br/>\n&gt; ==Did Mia ask Jude if she could claim it for the day? If not, then  <br/>\n&gt; Mia is being very presumptive. I don&#39;t think she should get to  <br/>\n&gt; claim her brother&#39;s stuff for a day. Why can&#39;t Mia get her own  <br/>\n&gt; scooter? It seems like it might be a good idea to take her to the  <br/>\n&gt; store and let her pick out her own scooter to eliminate her need to  <br/>\n&gt; take her brother&#39;s.==<br/>\n&gt;<br/>\n&gt; She didn&#39;t ask him, but he did know, and was fine with it. I used  <br/>\n&gt; the scooter incident as an example of the type of conflict that  <br/>\n&gt; occurs here. Funny you mention Mia getting her own scooter; that  <br/>\n&gt; was my idea after the dust settled! We went and got one today at  <br/>\n&gt; the op-shop.<br/>\n&gt;<br/>\n&gt; I appreciate your input, but there is still something I&#39;m not  <br/>\n&gt; seeing here . . . hoping for some further discussion . . . .<br/>\n&gt;<br/>\n&gt; KathrynD<br/>\n&gt; x<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":141243160,"authorName":"Kathryn","from":"&quot;Kathryn&quot; &lt;kathryndubay@...&gt;","profile":"observeandlearn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ideas, please!","postDate":"1258441219","msgId":42092,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhkdGhtMytucjBzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPTUVNTkRCQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+"},"prevInTopic":42085,"nextInTopic":42094,"prevInTime":42091,"nextInTime":42093,"topicId":42083,"numMessagesInTopic":0,"msgSnippet":"... =If you use the swing as a hammock, why can t both kids get in it together?= We do!  Even Rueben (1 y/o) often climbs on in and enjoys a swing.  I m pretty","messageBody":"<div id=\"ygrps-yiv-1866954354\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &lt;otherstar@...&gt; wrote:<br/>\n<br/>\n=If you use the swing as a hammock, why can&#39;t both kids get in it together?=<br/>\n<br/>\nWe do!  Even Rueben (1 y/o) often climbs on in and enjoys a swing.  I&#39;m pretty active with them, jumping on the tramp, etc.  I LOVE playing with them!  Our time Together is not the issue; it&#39;s the one-on-one they seem to Need at present.  <br/>\n<br/>\n=I tell them to find games or things that we can do together.=<br/>\n<br/>\nI do sit and attempt to &#39;nut out&#39; with the eldest two activities we can play together.  Often, Mia expresses her desire to Not involve Jude, and to play alone with me.  Jude is now expressing the same Need!  It&#39;s hard, almost impossible to problem solve with two kids that are adamant they Want on-on-one with me! <br/>\n<br/>\n==I have heard the book &quot;Siblings Without Rivalry&quot; is a good read.==<br/>\n<br/>\nGot it, read it.  It does have really great information, and the communication skills it mentions are already at play here.  Lots of listening on my behalf . . .  I do get why they are frustrated with each other, and I think they know this too; which is why they lash out at me!<br/>\n<br/>\n==You need to help him learn to take turns.== <br/>\n<br/>\nGood point!  However, he is a very genorous, sharing person by nature.  His dislike in sharing me is for Mia alone!  And vice-versa<br/>\n <br/>\n==If they are not being physical with each other, why did you need to physically step in? ==<br/>\n<br/>\nI physically stepped in just before they came to blows.  I think I should have stepped in earlier . . .  <br/>\n<br/>\n==I know that sibling disagreements can be pretty heated and they can go beyond our own comfort zone rapidly. If nobody is getting hurt, I don&#39;t think a little yelling between siblings is going to hurt.==<br/>\n<br/>\nThe yelling doesn&#39;t concern me, it&#39;s the obvious upset that is escalating into something More.  It&#39;s like they have NO tolerance *by choice* to deal with their problems.<br/>\n<br/>\n==Perhaps you need to say, &quot;Look guys, I love you both and I can see<br/>\nboth sides of this so I am not going to get involved. You guys need to<br/>\nfigure this out for yourselves.&quot;  Or, you can help them to see each other&#39;s side. Look Mia, your brother is mad because blah, blah, blah. Look Jude, your sister is mad because blah, blah, blah. I am not going to get involved because you both have equally valid points.==<br/>\n<br/>\n<br/>\nWouldn&#39;t work.  Emotions are running too high, and all my talk is just &#39;blah blah blah&#39; at this point. <br/>\n<br/>\n<br/>\n==Did Mia ask Jude if she could claim it for the day? If not, then Mia is being very presumptive. I don&#39;t think she should get to claim her brother&#39;s stuff for a day. Why can&#39;t Mia get her own scooter? It seems like it might be a good idea to take her to the store and let her pick out her own scooter to eliminate her need to take her brother&#39;s.==<br/>\n<br/>\nShe didn&#39;t ask him, but he did know, and was fine with it.  I used the scooter incident as an example of the type of conflict that occurs here.  Funny you mention Mia getting her own scooter; that was my idea after the dust settled!  We went and got one today at the op-shop.  <br/>\n<br/>\nI appreciate your input, but there is still something I&#39;m not seeing here . . . hoping for some further discussion . . . .<br/>\n<br/>\nKathrynD<br/>\nx </span></blockquote></div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar@earthlink.net","from":"&lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Ideas, please!","postDate":"1258389261","msgId":42085,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPTUVNTkRCQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGhkcjh2ciszbXJ1QGVHcm91cHMuY29tPg=="},"prevInTopic":42083,"nextInTopic":42092,"prevInTime":42084,"nextInTime":42086,"topicId":42083,"numMessagesInTopic":0,"msgSnippet":"No 2: The two eldest are really competing for my attention at present. They are also both highly competitive of each other. Perfect example:- Mia will say,","messageBody":"<div id=\"ygrps-yiv-1562052317\">No 2: The two eldest are really competing for my attention at present. They<br/>\nare also both highly competitive of each other. Perfect example:- Mia will<br/>\nsay, &quot;See who gets to the hammock first&quot; and rush out the door with Jude<br/>\nscreaming behind her, saying, &quot;I was going to go in the hammock!&quot; Sometimes<br/>\nthe situation is reversed, but the scenario is always the same. Conflict<br/>\narises, and I offer to jump on the tramp with one, while the other has their<br/>\ntime on the hammock. Then they BOTH want me and the tramp, and the conflict<br/>\ncontinues . . . There focus is not much on the activity, but who &#39;wins&#39;.<br/>\nJude doesn&#39;t seem to have any concept/acceptance of taking turns; just leads<br/>\nto more conflict . . .<br/>\n<br/>\n-If you use the swing as a hammock, why can&#39;t both kids get in it together?<br/>\nThen, you can push them and they both get your attention. We have a really<br/>\ncool hammock swing that my girls will sometimes fight over. I will have them<br/>\nget in it together and push them. Heck, I have gotten in it and had them<br/>\npush me. Can you find activities where they can get your attention at the<br/>\nsame time? I have been known to tell my girls that I will play with both of<br/>\nthem at the same time. I tell them to find games or things that we can do<br/>\ntogether. I have heard the book &quot;Siblings Without Rivalry&quot; is a good read. I<br/>\nhaven&#39;t had a chance to read it but it has been recommended to me. It sounds<br/>\nlike a lot of this is the result of sibling rivalry.<br/>\n<br/>\nYou need to help him learn to take turns. My husband and I have been known<br/>\nto get involved in their games or whatever they are doing and insist that we<br/>\nget a turn too. Then, we demonstrate what taking turns looks like. Four year<br/>\nolds are just starting to get the whole &quot;taking turns&quot; thing.<br/>\n<br/>\nNo 3: Conflict! Today it escalated to outright explosiveness on behalf of<br/>\nboth of them. We went to the local Botanic Gardens, and they both took a<br/>\nscooter with them. Both are Judes (4y/o) but one is preferred by both kids.<br/>\nMia (7) claimed the &#39;better&#39; scooter for the outing. Later in the day,<br/>\nneither scooter was being used and Jude started riding it. He knew as well<br/>\nas I did that Mia would react negatively. She did. Jude refused to give it<br/>\nback and they both begged, &quot;get it off him/her!!&quot; I didn&#39;t know what to do.<br/>\nJude Owns the scooter, but Mia claimed it for the day trip. No one was<br/>\nriding it at that very moment. So many variables! I get why they both<br/>\nreacted as they did. I tried hard to help them solve their problem, but they<br/>\ndidn&#39;t want a bar of it. They just got more and more heated. I physically<br/>\nstepped in, only to have Jude punch me a couple of times. At this point I<br/>\nlost my focus on Their Needs and turned to Mine. The old, &#39;how dare they<br/>\ntake it out on me&#39;, way of thinking. I spat the dummy and insisted we go<br/>\nhome. I kinda feel like I try to help them, and they use me as the puching<br/>\nbag.<br/>\n<br/>\n-It sounds like maybe you need to step back and let them do more problem<br/>\nsolving for themselves. If they are not being physical with each other, why<br/>\ndid you need to physically step in? I know that sibling disagreements can be<br/>\npretty heated and they can go beyond our own comfort zone rapidly. If nobody<br/>\nis getting hurt, I don&#39;t think a little yelling between siblings is going to<br/>\nhurt. Perhaps you need to say, &quot;Look guys, I love you both and I can see<br/>\nboth sides of this so I am not going to get involved. You guys need to<br/>\nfigure this out for yourselves.&quot; Or, you can help them to see each other&#39;s<br/>\nside. Look Mia, your brother is mad because blah, blah, blah. Look Jude,<br/>\nyour sister is mad because blah, blah, blah. I am not going to get involved<br/>\nbecause you both have equally valid points.<br/>\n<br/>\nIn our house, the owner gets to express desires about their stuff. If Jude<br/>\nis the owner, then he gets to decide unless he and his sister have mutually<br/>\nagreed on letting her have it for the day. Did Mia ask Jude if she could<br/>\nclaim it for the day? If not, then Mia is being very presumptive. I don&#39;t<br/>\nthink she should get to claim her brother&#39;s stuff for a day. Why can&#39;t Mia<br/>\nget her own scooter? It seems like it might be a good idea to take her to<br/>\nthe store and let her pick out her own scooter to eliminate her need to take<br/>\nher brother&#39;s.<br/>\n  <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141243160,"authorName":"Kathryn","from":"&quot;Kathryn&quot; &lt;kathryndubay@...&gt;","profile":"observeandlearn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Ideas, please!","postDate":"1258366779","msgId":42083,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhkcjh2ciszbXJ1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":42085,"prevInTime":42082,"nextInTime":42084,"topicId":42083,"numMessagesInTopic":0,"msgSnippet":"A few issues to be addressed here -- No 1:  BUSTING for some really good, original ideas from those out there that have high energy kids.  Not necessarily","messageBody":"<div id=\"ygrps-yiv-17332858\">A few issues to be addressed here --<br/>\n<br/>\nNo 1:  BUSTING for some really good, original ideas from those out there that have high energy kids.  Not necessarily structured games, as such, more a purge of energy; BIG purge, that is!  We have a tramp and a hammock (used as a swing), and an old ladder that I intend to convert into monkey-bars.  Backyard games, please.  Our space is fairly small.  Kids are 7, 4 & 1.<br/>\n<br/>\nNo 2:  The two eldest are really competing for my attention at present.  They are also both highly competitive of each other.  Perfect example:- Mia will say, &quot;See who gets to the hammock first&quot; and rush out the door with Jude screaming behind her, saying, &quot;I was going to go in the hammock!&quot;  Sometimes the situation is reversed, but the scenario is always the same.  Conflict arises, and I offer to jump on the tramp with one, while the other has their time on the hammock.  Then they BOTH want me and the tramp, and the conflict continues . . .  There focus is not much on the activity, but who &#39;wins&#39;.  Jude doesn&#39;t seem to have any concept/acceptance of taking turns; just leads to more conflict . . .  <br/>\n<br/>\nNo 3:  Conflict!  Today it escalated to outright explosiveness on behalf of both of them.  We went to the local Botanic Gardens, and they both took a scooter with them.  Both are Judes (4y/o) but one is preferred by both kids.  Mia (7) claimed the &#39;better&#39; scooter for the outing.  Later in the day, neither scooter was being used and Jude started riding it.  He knew as well as I did that Mia would react negatively.  She did.  Jude refused to give it back and they both begged, &quot;get it off him/her!!&quot;  I didn&#39;t know what to do.  Jude Owns the scooter, but Mia claimed it for the day trip.  No one was riding it at that very moment.  So many variables!  I get why they both reacted as they did.  I tried hard to help them solve their problem, but they didn&#39;t want a bar of it.  They just got more and more heated. I physically stepped in, only to have Jude punch me a couple of times.  At this point I lost my focus on Their Needs and turned to Mine.  The old, &#39;how dare they take it out on me&#39;, way of thinking.  I spat the dummy and insisted we go home.  I kinda feel like I try to help them, and they use me as the puching bag.<br/>\n<br/>\nMia has always wanted More of me.  I&#39;ve always done my utmost to get that time with her; I&#39;d like more one-on-one with her too!  But the reality is that she has two brothers.  Life&#39;s busy!<br/>\n<br/>\nAny advice would be much appreciated.  <br/>\n<br/>\nKathrynD<br/>\nx</div>","specialLinks":[]}],"prevTopicId":42089,"nextTopicId":42093}}