{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":415930464,"authorName":"Amy Morgan","from":"Amy Morgan &lt;amymorgan1970@...&gt;","profile":"amymorgan1970","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Continuing to Change Myself/how life is changing and a attached photo","postDate":"1357516906","msgId":49368,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTc1MTY5MDYuOTk0ODAuWWFob29NYWlsTmVvQHdlYjE2MDQwNS5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PGtjNGloMytoYWlmQGVHcm91cHMuY29tPg==","referencesHeader":"PDEzNTcxNzc2MjQuNTcwNjUuWWFob29NYWlsTmVvQHdlYjE2MDQwNS5tYWlsLmJmMS55YWhvby5jb20+IDxrYzRpaDMraGFpZkBlR3JvdXBzLmNvbT4="},"prevInTopic":49366,"nextInTopic":0,"prevInTime":49366,"nextInTime":49369,"topicId":49357,"numMessagesInTopic":0,"msgSnippet":"Her stories are really wild and complex.  It is a riot.   The best part of the lake is that there is a park on the other side.  They have a great","messageBody":"<div id=\"ygrps-yiv-429975897\">Her stories are really wild and complex.  It is a riot.<br/>\n <br/>\nThe best part of the lake is that there is a park on the other side.  They have a great playground.<br/>\n <br/>\nAmy M.    Mrs.Rooster</div>","specialLinks":[]},{"userId":366861124,"authorName":"Bryandmiss96@aol.com","from":"&quot;Bryandmiss96@...&quot; &lt;bryandmiss96@...&gt;","profile":"lvhomeschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Continuing to Change Myself","postDate":"1357407366","msgId":49366,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM3MzYzREI5LUY4MTctNEFGMC1CMDc0LTJGRkQ0NjU5QUFGRUBhb2wuY29tPg=="},"prevInTopic":49365,"nextInTopic":49368,"prevInTime":49365,"nextInTime":49368,"topicId":49357,"numMessagesInTopic":0,"msgSnippet":"... believed that television, computer, and video games have as much value as other things, such as playing outside, reading, coloring, etc. I am struggling ","messageBody":"<div id=\"ygrps-yiv-155638123\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Also, I was hoping you could share how you came to the moment where you really <br/>\n </span></blockquote>believed that television, computer, and video games have as much value as other <br/>\nthings, such as playing outside, reading, coloring, etc. I am struggling <br/>\ninternally with this, even though I have read all the posts and wonderful pages <br/>\non how kids have done well without limits.&lt;&lt;&lt;<br/>\n<br/>\nHi There:<br/>\nFor me, there were a few things. I put myself in my children&#39;s place. And imagined how I would feel if my husband decided I watched TV to much or played video games to much or was playing with my iphone to much. And if he did what a lot of parents do, and chase and chide kids or in this case me to do something they found merit in.<br/>\nWhen I began to see that books hold no higher value than any other way my kids wish to spend their time. <br/>\nAnd when I reflected on all the things I&#39;d learned over my lifetime via TV and gaming.<br/>\n<br/>\nMy 6 year old and I have some glorious chats while beating the Legos out of characters together on Lego Wii games.<br/>\nMy 9 and 11 year olds and I love watching shows like the real housewives and discussing the ladies behavior and interactions, as well as concepts of money and happiness and other such things.<br/>\nMy 3 year old and I watch Fresh beat band and do the dance moves together and sing along.<br/>\n<br/>\nJust last night my older girls and I watched an episode of Hauntings which took place in Saranac Lake, N.Y. They talked about cure cottages, which had us do googling to find out more about them, looking at historical pictures, which led to googling TB.<br/>\nEarlier in the day we had watched an Infested marathon and that always leads to some great conversations and googling. <br/>\n<br/>\n<br/>\nAnything my children value is valuable to me. That is TV, gaming, reading, playing monster high dolls, transformers, or the horde of other things they love and enjoy. <br/>\n~Melissa~<br/>\nSent from my iPhone</div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Continuing to Change Myself/how life is changing and a attached photo","postDate":"1357237603","msgId":49365,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtjNGloMytoYWlmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNTcxNzc2MjQuNTcwNjUuWWFob29NYWlsTmVvQHdlYjE2MDQwNS5tYWlsLmJmMS55YWhvby5jb20+"},"prevInTopic":49364,"nextInTopic":49366,"prevInTime":49364,"nextInTime":49366,"topicId":49357,"numMessagesInTopic":0,"msgSnippet":"Amy, I love your daughter s idea of there being a mermaid in the lake! :-) My family used to live in an apartment complex with a lake, too. Although we have a","messageBody":"<div id=\"ygrps-yiv-144989391\">Amy,<br/>\n<br/>\nI love your daughter&#39;s idea of there being a mermaid in the lake! :-)<br/>\n<br/>\nMy family used to live in an apartment complex with a lake, too. Although we have a private house now, sometimes I really miss the apartment! It was a wonderful place to be homeschooling/unschooling, with kids. There was always something to do and see outside. Lots of space for riding bikes, walking, running around. Lots of other kids playing outside after public school got out, and on weekends/holidays/summer break.<br/>\n<br/>\nI can&#39;t remember if we still lived there when we read &quot;Harry Potter and the Goblet of Fire&quot;. If we did, I would think that my daughter and I would also have imagined mermaids living in that lake. :-) (Before that book, I only thought of mermaids as living in the ocean.)<br/>\n<br/>\nLinda<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Amy Morgan  wrote:<br/>\n&gt;<br/>\n&gt; She also loves to tell me about the mermaid that lives in the lake that our apartment is next to.  Her stories are very involved and complex.  It is amazing.  <br/>\n&gt;  <br/>\n&gt; Sh also is doing many more chores since I don&#39;t tell her to do them.  I just start doing them and she hops in to help.  She is even now finding things that need done. <br/>\n&gt;  <br/>\n&gt; It has truly brought down the stress and fussing in the house.<br/>\n&gt;  <br/>\n&gt; Amy M.     Mrs.Rooster </span></blockquote></div>","specialLinks":[]},{"userId":9543528,"authorName":"Dana Hoffman Ellis","from":"Dana Hoffman Ellis &lt;hoffmanwilson@...&gt;","profile":"hoffmanwilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Continuing to Change Myself","postDate":"1357229991","msgId":49364,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFEMDgxMDdELUY0NEEtNDE2OC1BNzNDLTc5MzJGNDA5QkQxQUB5YWhvby5jb20+","inReplyToHeader":"PDEzNTcxNDM3NTUuNjE0NjAuWWFob29NYWlsTmVvQHdlYjE2MDQwMi5tYWlsLmJmMS55YWhvby5jb20+","referencesHeader":"PDEzNTcwOTg0MzIuNTU4NjEuWWFob29NYWlsUkNAd2ViMTgxNDA2Lm1haWwubmUxLnlhaG9vLmNvbT4gPDEzNTcxNDM3NTUuNjE0NjAuWWFob29NYWlsTmVvQHdlYjE2MDQwMi5tYWlsLmJmMS55YWhvby5jb20+"},"prevInTopic":49363,"nextInTopic":49365,"prevInTime":49363,"nextInTime":49365,"topicId":49357,"numMessagesInTopic":0,"msgSnippet":"... Embrace comics as a family!  Put on lavish costumes and head to comicon!  Many cities have one.  My daughter is 4, but won best cosplay at our local","messageBody":"<div id=\"ygrps-yiv-1556083582\"><blockquote><span title=\"ireply\">&gt; I think he lets her watch too much TV and is not as careful about what she watches.  She is a tomboy and loves DC/Marvel comics, Star Wars, Transformers, etc.  He let her watch the Dark Knight movies.  I didn&#39;t care for that.  But she isn&#39;t afraid of this stuff.  She even tells me wild stories using her figures while we are waiting in the car for her Dad to get off work.  She has a very great imagination.  <br/>\n<br/>\n </span></blockquote>Embrace comics as a family!  Put on lavish costumes and head to comicon!  Many cities have one.  My daughter is 4, but won best cosplay at our local comicon for her awesome spiderman impersonation :). Enjoy with your daughter!  It was the time of my daughter&#39;s life, and it was so great to be there with her and share her joy! :)<br/>\n<br/>\nDana<br/>\n<br/>\nSent from my iPad<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":415930464,"authorName":"Amy Morgan","from":"Amy Morgan &lt;amymorgan1970@...&gt;","profile":"amymorgan1970","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"5"},"subject":"Re: [unschoolingbasics] Re: Continuing to Change Myself/how life is changing and a attached photo","postDate":"1357177624","msgId":49363,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTcxNzc2MjQuNTcwNjUuWWFob29NYWlsTmVvQHdlYjE2MDQwNS5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PGtjMXVqaSs5OThvQGVHcm91cHMuY29tPg==","referencesHeader":"PGtjMXUycCthbmowQGVHcm91cHMuY29tPiA8a2MxdWppKzk5OG9AZUdyb3Vwcy5jb20+"},"prevInTopic":49362,"nextInTopic":49364,"prevInTime":49362,"nextInTime":49364,"topicId":49357,"numMessagesInTopic":0,"msgSnippet":"She also loves to tell me about the mermaid that lives in the lake that our apartment is next to.  Her stories are very involved and complex.  It is","messageBody":"<div id=\"ygrps-yiv-154943366\">She also loves to tell me about the mermaid that lives in the lake that our apartment is next to.  Her stories are very involved and complex.  It is amazing.  <br/>\n <br/>\nSh also is doing many more chores since I don&#39;t tell her to do them.  I just start doing them and she hops in to help.  She is even now finding things that need done. <br/>\n <br/>\nIt has truly brought down the stress and fussing in the house.<br/>\n <br/>\nAmy M.     Mrs.Rooster<br/>\n  <br/>\n  <br/>\n         <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Continuing to Change Myself","postDate":"1357173477","msgId":49362,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtjMmp0NStndHRtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNTcwOTg0MzIuNTU4NjEuWWFob29NYWlsUkNAd2ViMTgxNDA2Lm1haWwubmUxLnlhaG9vLmNvbT4="},"prevInTopic":49361,"nextInTopic":49363,"prevInTime":49361,"nextInTime":49363,"topicId":49357,"numMessagesInTopic":0,"msgSnippet":"... First of all, I wish you success in your business! Not knowing you or your kids, I can t say how your working from home will impact them. I hope the older","messageBody":"<div id=\"ygrps-yiv-1653625007\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Kristie &lt;messy_boys@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; ... I will be starting a business this year.  I am a single mom,<br/>\n&gt; and will be able to work from home most of the time, but it&#39;s still<br/>\n&gt; going to require a good four hours a day.  I am wondering how this<br/>\n&gt; will impact my kids and what I can do to make it work for us all.<br/>\n&gt; Any ideas or suggestions appreciated.  ... six kids, <br/>\n&gt; ages 14, 11, 8, 6, 5 and 3)<br/>\n<br/>\n </span></blockquote>First of all, I wish you success in your business!<br/>\n<br/>\nNot knowing you or your kids, I can&#39;t say how your working from home will impact them. I hope the older ones are the types who don&#39;t mind helping with the little ones, as a way of contributing to the family income. But if the older ones don&#39;t want to, or are not capable of looking after the little ones while you work, there are some ways you might be able to get adult help, even if you can&#39;t afford to pay a babysitter/nanny.<br/>\n<br/>\nYou could try bartering for childcare. Is there any service you could offer in return - perhaps even watching a child during the hours you aren&#39;t working? <br/>\n<br/>\nPerhaps you could find a woman who is unemployed and in need of food, who would watch your kids in your home in exchange for transportation and two meals a day? <br/>\n<br/>\nIf there is an unschool group in your area, maybe you could ask for volunteer help from another unschooling mom? Or maybe there is some organization in your area that has retirees who want to volunteer for those in need - like single moms, trying to start a business?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also, I was hoping you could share how you came to the moment where<br/>\n&gt; you really believed that television, computer, and video games have<br/>\n&gt; as much value as other things, such as playing outside, reading,<br/>\n&gt; coloring, etc.  <br/>\n<br/>\n </span></blockquote>I never &quot;came to a moment&quot; on this; I always believed it! I believed it as a kid, and no one ever talked me out of it! Not that we had computers and video games, when I was a kid. But we had TV. I was always a fan of all kinds of TV shows. Science-fiction and fantasy, above all. But also musical-variety shows, science and nature shows, comedy/satire, family-dramas (Little House on the Prairie, and The Waltons, for example), mysteries, detective shows, westerns, and game shows. These TV shows were/are an important part of the literature of our time!<br/>\n<br/>\nI wasn&#39;t raised in an anti-TV household, and there wasn&#39;t nearly so much anti-TV propaganda coming from the educational (and pediatric) establishment when I was a kid. As the anti-TV rhetoric started increasing, from the schools and pediatricians, I became increasingly annoyed! What kind of idiots lump all content together, and denounce it all as useless and without value, just because the medium is audio-visual and electronic (and relatively *new*, in the greater context of history), rather than solely text-based? <br/>\n<br/>\nWith the advent of home computers, the internet, and video games, my husband and I embraced all of it! (He&#39;s a computer geek; not into games at all, but very into computers. My son and I are into computer games; my daughter likes one or two games - basically the story-lines and characters of a few popular video games, and reads and writes fan-fiction based on them.) There&#39;s a whole world in these electronic boxes! There&#39;s information, entertainment, culture, instruction, connection with other people, etc.<br/>\n<br/>\nI can&#39;t begin to tell you how much my kids and I have been inspired, artistically and intellectually, by TV shows, movies, videos, games, and the internet. Think of the people who *create* the shows, movies, videos, games, etc. Some of them are the Shakespeares and Mozarts of our time! Yes, there&#39;s a lot of not-so-inspirational stuff out there too. But each kid is going to figure out for himself what is inspirational, or worthwhile, and what isn&#39;t. Just as my family members and I did.<br/>\n<br/>\nNow I&#39;m not saying that I think it&#39;s healthy for anyone to sit in front of a screen all day, every day. But, given access to other activities, most people will feel the need to get up and do other things. I never limited my kids&#39; time with TV, the computer, or video games. But they still played with toys, ran around outside (and inside), got together with friends, enjoyed listening to stories (being dyslexic, they didn&#39;t enjoy reading to themselves, but they liked listening to me read to them, or to audio books), did lots of art projects and crafts, played musical instruments, went swimming and skating and indoor rock climbing, rode bikes, went to various homeschool classes (of their choice) and rec-center classes (karate, archery, dance, etc), did the occasional science experiment, helped around the house, etc.<br/>\n<br/>\nThink about the people who have been trying to convince you that TV/computer/video games are &quot;bad&quot; for kids. Then think about ALL the people who *create* the TV shows, internet content, and video games. Writers, actors, camera operators, musicians, video and sound editors, artists, animators, and computer programmers. (And more.) Which group contains the greater number of creative, successful, mostly happy people? Do you think that the latter group is illiterate and/or poorly educated, or are, taken as a group, bad citizens? Of course *some of them* are, or pretend to be. But, on the whole, the creators of our multi-media are very well-informed, very creative and talented, and I believe that they are good role models for our kids, and are creating very worthwhile content! <br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Continuing to Change Myself","postDate":"1357151666","msgId":49361,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtjMXVqaSs5OThvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtjMXUycCthbmowQGVHcm91cHMuY29tPg=="},"prevInTopic":49360,"nextInTopic":49362,"prevInTime":49360,"nextInTime":49362,"topicId":49357,"numMessagesInTopic":0,"msgSnippet":"Dangit, laptop butterfingers! ... **************** She knows more about what is upsetting or frightening to her than you do! Trust her to know when she s upset","messageBody":"<div id=\"ygrps-yiv-879385153\">Dangit, laptop butterfingers! <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;&gt;He let her watch the Dark<br/>\n&gt; Knight movies.  I didn&#39;t care for that.  But she isn&#39;t afraid of this stuff. <br/>\n </span></blockquote>****************<br/>\n<br/>\nShe knows more about what is upsetting or frightening to her than you do! Trust her to know when she&#39;s upset or scared and follow her cues in that regard. If she doesn&#39;t want to watch something, help her know she has the power to say No or to modify what she&#39;s watching so it&#39;s more palatable - like turning off the sound, or watching in another language, or watching the extras first so she can see how the effects are done. But also keep in mind that as long as you are limiting her she&#39;s unlikely to tell you if she&#39;s upset or doesn&#39;t want to see something because she&#39;ll &quot;lose her chance&quot;. Limits set kids up to see things they don&#39;t really want to see. When she knows she has the freedom to watch what she wants, she&#39;ll be free to say No.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;She even tells me wild stories using her figures while we are waiting in the car<br/>\n </span></blockquote>for her Dad to get off work.  She has a very great imagination. <br/>\n**************<br/>\n<br/>\nHooray! <br/>\nSometimes parents get stuck thinking kids &quot;shouldn&#39;t&quot; tell stories or create artwork using tv/movie/game characters, but it&#39;s really no different than storytellers re-telling traditional tales, or people making up variations to fairy tales, or alternative versions of the legends of King Arthur or Robin Hood.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Continuing to Change Myself","postDate":"1357151129","msgId":49360,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtjMXUycCthbmowQGVHcm91cHMuY29tPg=="},"prevInTopic":49359,"nextInTopic":49361,"prevInTime":49359,"nextInTime":49361,"topicId":49357,"numMessagesInTopic":0,"msgSnippet":"... Don t make your home a battlefield. Be sweet and kind and giving. Say yes more. It will help to sit and watch with your daughter and play with her - I","messageBody":"<div id=\"ygrps-yiv-720532668\"><blockquote><span title=\"ireply\">&gt;&gt;I too am locked in a battle over TV, DVDs, gaming, etc.<br/>\n<br/>\n </span></blockquote>Don&#39;t make your home a battlefield. Be sweet and kind and giving. Say yes more. <br/>\n<br/>\nIt will help to sit and watch with your daughter and play with her - I don&#39;t mean every minute of the day ;) and I don&#39;t mean you should sit and critique what she loves. Sit with her and see what she finds interesting, funning, curious, wonderful, so you can know her better as a person. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I try to let my daughter<br/>\n </span></blockquote>have this items on weekends and evenings.  <br/>\n************<br/>\n<br/>\nThe trouble with setting those kinds of limits is they make things even more desirable - you turn them into luxury items. If she can Only watch tv on weekends, she&#39;s going to want to spend the weekend watching tv. In a sense, you&#39;re taking away her ability to say No. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;He let her watch the Dark<br/>\n </span></blockquote>Knight movies.  I didn&#39;t care for that.  But she isn&#39;t afraid of this stuff. <br/>\n****************</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Continuing to Change Myself","postDate":"1357150688","msgId":49359,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtjMXRsMCtsMjBtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNTcwOTg0MzIuNTU4NjEuWWFob29NYWlsUkNAd2ViMTgxNDA2Lm1haWwubmUxLnlhaG9vLmNvbT4="},"prevInTopic":49358,"nextInTopic":49360,"prevInTime":49358,"nextInTime":49360,"topicId":49357,"numMessagesInTopic":0,"msgSnippet":"... With video games, it helped me to find a few games *I* enjoyed - that let me understand what was interesting about them, it let me see that games are the","messageBody":"<div id=\"ygrps-yiv-1802703767\">Kristie &lt;messy_boys@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Also, I was hoping you could share how you came to the moment where you really <br/>\n&gt; believed that television, computer, and video games have as much value as other <br/>\n&gt; things<br/>\n<br/>\n </span></blockquote>With video games, it helped me to find a few games *I* enjoyed - that let me understand what was interesting about them, it let me see that games are the interactive story-books people of my generation fantasized about but that never really worked in book form. <br/>\n<br/>\nWith games and tv/movies, it also helped me to see how much my daughter learned about literacy in general and the process of creating her own stories in particular. She&#39;s not much of a reader, but from games and movies/shows she&#39;s learned about plot, character development, scene and setting, mood, foreshadowing, dramatic tension, timing, and all sorts of real-world techniques involving the use of language - and in her drawing the use of line - to express emotion. For kids who aren&#39;t natural storytellers, you won&#39;t get to see the results quite so dramatically, but movies, shows and games are some of the best tools for learning real-world literacy skills ever created. <br/>\n<br/>\nIf there was one aha moment for me, it was when we went first got a satellite dish and my daughter&#39;s drawing exploded - she went from rarely drawing to using a whole packet of paper in a week. Maybe she would have discovered a love of drawing anyway - probably - but having all the cartoons she wanted at her disposal was an enormous inspiration.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":415930464,"authorName":"Amy Morgan","from":"Amy Morgan &lt;amymorgan1970@...&gt;","profile":"amymorgan1970","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Continuing to Change Myself","postDate":"1357143755","msgId":49358,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTcxNDM3NTUuNjE0NjAuWWFob29NYWlsTmVvQHdlYjE2MDQwMi5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PDEzNTcwOTg0MzIuNTU4NjEuWWFob29NYWlsUkNAd2ViMTgxNDA2Lm1haWwubmUxLnlhaG9vLmNvbT4=","referencesHeader":"PDEzNTcwOTg0MzIuNTU4NjEuWWFob29NYWlsUkNAd2ViMTgxNDA2Lm1haWwubmUxLnlhaG9vLmNvbT4="},"prevInTopic":49357,"nextInTopic":49359,"prevInTime":49357,"nextInTime":49359,"topicId":49357,"numMessagesInTopic":0,"msgSnippet":"Kristie, I am new to this group and to the whole unschooled idea.    I am looking forward to relaxing and let things get calmer and happier.   I too am","messageBody":"<div id=\"ygrps-yiv-671555126\">Kristie, I am new to this group and to the whole unschooled idea.  <br/>\n <br/>\nI am looking forward to relaxing and let things get calmer and happier.<br/>\n <br/>\nI too am locked in a battle over TV, DVDs, gaming, etc. I try to let my daughter have this items on weekends and evenings.  But my Rooster is so much more relaxed about it.  It can cause friction between us.  I think he lets her watch too much TV and is not as careful about what she watches.  She is a tomboy and loves DC/Marvel comics, Star Wars, Transformers, etc.  He let her watch the Dark Knight movies.  I didn&#39;t care for that.  But she isn&#39;t afraid of this stuff.  She even tells me wild stories using her figures while we are waiting in the car for her Dad to get off work.  She has a very great imagination.  <br/>\n <br/>\nCan I get some opinions?  She is eight.<br/>\n <br/>\nAmy M.     Mrs.Rooster<br/>\n    <br/>\n       <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":237699340,"authorName":"Kristie","from":"Kristie &lt;messy_boys@...&gt;","profile":"messy_boys","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Continuing to Change Myself","postDate":"1357098432","msgId":49357,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTcwOTg0MzIuNTU4NjEuWWFob29NYWlsUkNAd2ViMTgxNDA2Lm1haWwubmUxLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":49358,"prevInTime":49356,"nextInTime":49358,"topicId":49357,"numMessagesInTopic":0,"msgSnippet":"Hello everyone, Things have been going very well for the kids and I.  The more I change, relax and say yes, the calmer and happier we all have become. There","messageBody":"<div id=\"ygrps-yiv-2075885076\">Hello everyone,<br/>\n<br/>\nThings have been going very well for the kids and I.  The more I change, relax <br/>\nand say yes, the calmer and happier we all have become.<br/>\n<br/>\nThere are a couple things I was hoping to ask your ideas and experience on.<br/>\n<br/>\nI will be starting a business this year.  I am a single mom, and will be able to <br/>\nwork from home most of the time, but it&#39;s still going to require a good four <br/>\nhours a day.  I am wondering how this will impact my kids and what I can do to <br/>\nmake it work for us all.  Any ideas or suggestions appreciated.  (just to remind <br/>\nya&#39;ll, I have six kids, ages 14, 11, 8, 6, 5 and 3)<br/>\n<br/>\nAlso, I was hoping you could share how you came to the moment where you really <br/>\nbelieved that television, computer, and video games have as much value as other <br/>\nthings, such as playing outside, reading, coloring, etc.  I am struggling <br/>\ninternally with this, even though I have read all the posts and wonderful pages <br/>\non how kids have done well without limits.<br/>\n<br/>\nIt kinda reminds me of the issues people have with their kids and food.  Where <br/>\nthey think that all their kids will want to eat is junk food.  I was fortunate <br/>\nto never make food an issue...and my kids love fruits and vegetables.  They will <br/>\nliterally fight over broccoli.  Other moms are always shocked when I tell them <br/>\nthat I have never required my kids to eat veggies...but I always make sure they <br/>\nare available.<br/>\n<br/>\nSo I&#39;m wondering if it would be similar with the gaming vs. other activities.  <br/>\nGaming has always been restricted (like &#39;junk&#39; food in other families) and &#39;good <br/>\nfor you&#39; activities (fruits and veggies) have always been forced on them.<br/>\n<br/>\nDo I need to just continue saying &quot;yes&quot; more but making sure there are lots of <br/>\noptions available to them?  There are times when they will spontaneously throw <br/>\ndown their controllers and run outside, jump on the trampoline, play with the <br/>\ndogs, dig holes in the sand, etc...<br/>\n<br/>\nIt&#39;s just a real struggle for me to overcome my programming on this - tv/gaming <br/>\nis BAD...plus I feel the pressure from outside me (family and friends) that I am <br/>\na bad mom if I don&#39;t force limits on my kids.<br/>\n<br/>\nSo, again, any ideas are appreciated on continuing to change ME!<br/>\n<br/>\nThank you, and Happy New Year!<br/>\nKristie<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":49333,"nextTopicId":49369}}