{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":292986105,"authorName":"connie","from":"&quot;connie&quot; &lt;conniekangas@...&gt;","profile":"ckangas1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] We&#39;ve been shunned!","postDate":"1167580239","msgId":20155,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzNGIwMWM3MmNmMyQ2YmI5ZWIxMCQyZTAxYThjMEBLYW5nYXM+","referencesHeader":"PGVuNzBxZis0dGlrQGVHcm91cHMuY29tPg=="},"prevInTopic":20145,"nextInTopic":0,"prevInTime":20154,"nextInTime":20156,"topicId":20135,"numMessagesInTopic":0,"msgSnippet":"I would just let it go.  People have different expecations - can t change that.  We are very liberal and relaxed at our home - but I certainly wouldn t want","messageBody":"<div id=\"ygrps-yiv-1339082239\">I would just let it go.  People have different expecations - can&#39;t change that.  We are very liberal and relaxed at our home - but I certainly wouldn&#39;t want the kids saying cuss words (which is why I try not to let them slip out.)  It&#39;s just generally socially disrespectful.   Some people may be offended in the general population.  Try to imagine that it&#39;s like saying a racial slur - or a disrespectful remark about a woman - or &#39;j - c&#39; - some folks might be offended in stores - theaters - whatever.  <br/>\neveryone has different views of what&#39;s normal.  Some parents might not want to &#39;encourage&#39; violence if they are pacifists - i.e. encouraging swordplay - or having pretend weapons, guns, etc.<br/>\n<br/>\nIt&#39;s not a matter of &#39;power struggle&#39; - but just creating an environment that a parent finds conducive to their idea of &#39;normal&#39; living.<br/>\nMy son always like playing at homes when the parents weren&#39;t there - I think most kids love that freedom.  I told him that I didn&#39;t want him in these homes due to liability issues, etc.  He did as he pleased and was my one kid out of five that became sexually active very young and began using drugs at 14.  He copied the &#39;freedom&#39; that was allowed the other kids because they were 100% not supervised. (while the parents are out working or drinking or whatever). These other parents might feel the same about your house - that possibly it crosses the line of personal expression to downright socially unacceptable.<br/>\n<br/>\nand yes, I&#39;ve had a few parents who would not allow their kids to play with mine - one I still can&#39;t figure out why.  But I don&#39;t spend much time thinking about it.  Most are jealous because their kids wish they didn&#39;t have to go to school - or go to bed at a certian time or whatever...<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Alice <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Saturday, December 30, 2006 7:38 PM<br/>\n  Subject: [unschoolingbasics] We&#39;ve been shunned!<br/>\n<br/>\n<br/>\n  Ok, so I have read a lot of people&#39;s difficulties with friends who<br/>\n  have opposite parenting approaches. Some of you have stopped seeing<br/>\n  certain families because the differences became so great that there<br/>\n  were more negatives than positives to the relationship. Has anyone<br/>\n  been outright ditched by a friend because of your radical unschooling<br/>\n  approach has a negative affect (supposedly!) on their traditionally<br/>\n  parented children???<br/>\n<br/>\n  I have neighbors who live 2 doors down from us with 2 kids the same<br/>\n  age and gender as mine. The kids all enjoy playing together. The<br/>\n  neighbor family does all the traditional things - school, timeouts,<br/>\n  groundings, spankings, arbritrary rules, etc. So their two kids LOVE<br/>\n  LOVE LOVE to play at our house. All four kids will happily play for<br/>\n  days on end- at our home only. The neighbor kids (nk) beg to eat with<br/>\n  us, sleep with us, everything! The neighbor mom has expressed dismay<br/>\n  at the fact that no one wants to play at her house. I was honest with<br/>\n  her about the reason. The kids told me that they like to play at my<br/>\n  house because I let them play things that are not allowed at their<br/>\n  house, such as Dungeons & Dragons and swordplay. My house is just<br/>\n  more fun!<br/>\n<br/>\n  Lately, we - meaning my family and the neighbor kids - have had<br/>\n  conversations about topics such as being made to eat all your food on<br/>\n  your plate, being punished, stuff like that. I try to be supportive<br/>\n  of their parents - I guess... but it is hard! And my kids like to<br/>\n  say, &quot;We don&#39;t have to eat what we don&#39;t want to eat!&quot; I can only<br/>\n  imagine what gets back to the neighbor parents. The kids are old<br/>\n  enough to discuss this type of thing with each other and they do.<br/>\n<br/>\n  So the other day the nk&#39;s told us that they were no longer allowed to<br/>\n  play at our home because we &quot;cuss&quot;. I am just not sure how to take<br/>\n  this! Of course we don&#39;t punish our children for their language<br/>\n  (which exactly mimics are own). We say things like crap, sh*t, maybe<br/>\n  d**mn occasionally. We are not spewing profanity in every sentence. <br/>\n  So I certainly feel that saying we cuss is a gross overstatement. My<br/>\n  kids say that the nk&#39;s &quot;cuss like mad sailors&quot; when they are over at<br/>\n  our house. (probably because they can&#39;t at home and so they go wild<br/>\n  over here?) My guess is that the boy cussed at his own home, blamed it<br/>\n  on us when he got in trouble, and now they are both forbidden to come<br/>\n  over because we are a bad influence.<br/>\n<br/>\n  My own kids really don&#39;t care that much and find it rather humorous. <br/>\n  They like playing with these kids but don&#39;t miss them either. And my<br/>\n  kids can still go over to their house, just not vice versa. I guess<br/>\n  that way the neighbors can keep a better eye on the kids - presumably<br/>\n  step in if anybody starts &quot;misbehaving&quot;. My kids don&#39;t like going<br/>\n  over there for obvious reasons. I am not sure if I should say<br/>\n  anything or if I should just let this play itself out or what. I feel<br/>\n  falsely accused but if I step back and look at it from their point of<br/>\n  view, yes, we parent in a radically different way then them and it<br/>\n  very well could undermine their &quot;authority&quot;. I feel sad for their<br/>\n  kids most of all. <br/>\n<br/>\n  Has anyone else had any experiences like this? Any advice? The mom<br/>\n  hasn&#39;t exactly said anything to me yet - I have just heard of the<br/>\n  &quot;shunning&quot; from the kids.<br/>\n  -Alice<br/>\n  the rabid cusser<br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":226477113,"authorName":"mamavegg","from":"&quot;mamavegg&quot; &lt;pstujo@...&gt;","profile":"mamavegg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: We&#39;ve been shunned!","postDate":"1167579417","msgId":20145,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVuOGxlcCtnbHVqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVuNzBxZis0dGlrQGVHcm91cHMuY29tPg=="},"prevInTopic":20142,"nextInTopic":20155,"prevInTime":20144,"nextInTime":20146,"topicId":20135,"numMessagesInTopic":0,"msgSnippet":"... ****************************************** We had a similar situation occur here a few years back.  Family down the street, very strict in the same ways","messageBody":"<div id=\"ygrps-yiv-1882085804\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; Has anyone else had any experiences like this?  Any advice?  The mom<br/>\n&gt; hasn&#39;t exactly said anything to me yet - I have just heard of the<br/>\n&gt; &quot;shunning&quot; from the kids.<br/>\n&gt; -Alice<br/>\n&gt; the rabid cusser<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>          ******************************************<br/>\n<br/>\nWe had a similar situation occur here a few years back.  Family down <br/>\nthe street, very strict in the same ways the parents of your kids&#39; <br/>\nfriends are, and their kids practically lived here for a couple years <br/>\nor so.  Then, I was suddenly getting the cold shoulder from the mom, <br/>\nand the kids weren&#39;t coming over as often, either.  After a while, I <br/>\nwent over and asked the mom what was up.  She burst into tears, and <br/>\nspilled out how her kids wanted their house to be like ours, her to <br/>\nbe more like me, blah blah.  But then she bucked up, quit crying, and <br/>\nsaid &quot;But everyone I&#39;ve talked to about it says my kids need PARENTS, <br/>\nnot another best friend!  And that what I&#39;m doing is the right thing <br/>\nas a parent.&quot;  I wasn&#39;t about to get into an argument, so I let her <br/>\nknow her kids were welcome here, and let it go at that.  The kids <br/>\nreturned happily, but same thing happened soon after, and they pretty <br/>\nmuch don&#39;t come around anymore.  The mom hasn&#39;t spoken to me in a few <br/>\nyears, and I have just let it go.<br/>\n<br/>\nThe kids do occasionally play outside, on more neutral ground, but <br/>\ntheir kids seem different around us.  My family has taken it in <br/>\nstride for the most part.  I found it sad that all the parents could <br/>\nsee was our differences, and that those differences were <br/>\nsomehow &quot;bad&quot;.  Differences in religious beliefs played in here, <br/>\nalso - a great learning experience for my family, but uncomfortable <br/>\nfor theirs, I guess.<br/>\n<br/>\nThis was a really hard situation for me at first, and I guess I <br/>\nreally have no advice to offer other than some things it&#39;s best to <br/>\njust let go of. Getting over the &quot;shun shock&quot; took a bit, but I <br/>\nwouldn&#39;t change our values and way of life for anything right now! :)<br/>\n<br/>\ndeanna</div>","specialLinks":[]},{"userId":174410770,"authorName":"D Smith","from":"D Smith &lt;sandshuse@...&gt;","profile":"sandshuse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] We&#39;ve been shunned!","postDate":"1167540015","msgId":20138,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYxMjMxMDQ0MDE1LjcxMDYzLnFtYWlsQHdlYjUyOTEyLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGVuNzBxZis0dGlrQGVHcm91cHMuY29tPg=="},"prevInTopic":20135,"nextInTopic":20142,"prevInTime":20137,"nextInTime":20139,"topicId":20135,"numMessagesInTopic":0,"msgSnippet":"Alice, I d let it play out. The kids know what s going on. They see the truth. I m shunned by my cousin s soon to be ex-husband. I can only see the kids if she","messageBody":"<div id=\"ygrps-yiv-431072068\">Alice,<br/>\n<br/>\nI&#39;d let it play out. The kids know what&#39;s going on.<br/>\nThey see the truth. I&#39;m shunned by my cousin&#39;s soon to<br/>\nbe ex-husband. I can only see the kids if she (their<br/>\nmom) is here with us. No amount of pleading will<br/>\nchange their dad&#39;s mind to let them spend the night,<br/>\nwhich is what everyone wants so badly. He just doesn&#39;t<br/>\nlike me, never has, and I&#39;m sure now that his kids<br/>\ncome home to him and tell him how great I am, it just<br/>\nfuels his hatered for me. I think it&#39;s sad. I&#39;ve let<br/>\nmy kid spend the night, but he doesn&#39;t like it there.<br/>\nI know you&#39;ll pull through this. And as you said, the<br/>\nkids are fine with it. Hopefully it&#39;s just<br/>\ntemporary??? <br/>\n<br/>\nDanie- who swears more than drunk saliors<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":36763427,"authorName":"Sherry T.","from":"&quot;Sherry T.&quot; &lt;mesherryt@...&gt;","profile":"mesherryt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] We&#39;ve been shunned!","postDate":"1167528310","msgId":20142,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4MTE2NS42MTg2NC5xbUB3ZWIzNDAwOC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGVuNzBxZis0dGlrQGVHcm91cHMuY29tPg=="},"prevInTopic":20138,"nextInTopic":20145,"prevInTime":20141,"nextInTime":20143,"topicId":20135,"numMessagesInTopic":0,"msgSnippet":"Alice, Sometimes it s best to let things settle down a bit before confronting someone, especially when you re still feeling emotional about it. I have the","messageBody":"<div id=\"ygrps-yiv-1333114827\">Alice,<br/>\n<br/>\nSometimes it&#39;s best to let things settle down a bit<br/>\nbefore confronting someone, especially when you&#39;re<br/>\nstill feeling emotional about it. I have the tendency<br/>\nto want to deal with things as soon as they happen,<br/>\nand doing so sometimes causes more harm than good.  If<br/>\nit were me, I would wait until an opportunity<br/>\npresented itself to discuss these issues with the<br/>\nneighbors.  JMHO.  Good luck!<br/>\n<br/>\nSherry<br/>\n<br/>\n<br/>\n--- Alice &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:thesackmans@...\">thesackmans@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Ok, so I have read a lot of people&#39;s difficulties<br/>\n&gt; with friends who<br/>\n&gt; have opposite parenting approaches.  Some of you<br/>\n&gt; have stopped seeing<br/>\n&gt; certain families because the differences became so<br/>\n&gt; great that there<br/>\n&gt; were more negatives than positives to the<br/>\n&gt; relationship.  Has anyone<br/>\n&gt; been outright ditched by a friend because of your<br/>\n&gt; radical unschooling<br/>\n&gt; approach has a negative affect (supposedly!) on<br/>\n&gt; their traditionally<br/>\n&gt; parented children???<br/>\n&gt; <br/>\n&gt; I have neighbors who live 2 doors down from us with<br/>\n&gt; 2 kids the same<br/>\n&gt; age and gender as mine.  The kids all enjoy playing<br/>\n&gt; together.  The<br/>\n&gt; neighbor family does all the traditional things -<br/>\n&gt; school, timeouts,<br/>\n&gt; groundings, spankings, arbritrary rules, etc.  So<br/>\n&gt; their two kids LOVE<br/>\n&gt; LOVE LOVE to play at our house.  All four kids will<br/>\n&gt; happily play for<br/>\n&gt; days on end- at our home only.  The neighbor kids<br/>\n&gt; (nk) beg to eat with<br/>\n&gt; us, sleep with us, everything! The neighbor mom has<br/>\n&gt; expressed dismay<br/>\n&gt; at the fact that no one wants to play at her house. <br/>\n&gt; I was honest with<br/>\n&gt; her about the reason.  The kids told me that they<br/>\n&gt; like to play at my<br/>\n&gt; house because I let them play things that are not<br/>\n&gt; allowed at their<br/>\n&gt; house, such as Dungeons & Dragons and swordplay.  My<br/>\n&gt; house is just<br/>\n&gt; more fun!<br/>\n&gt; <br/>\n&gt; Lately, we - meaning my family and the neighbor kids<br/>\n&gt; - have had<br/>\n&gt; conversations about topics such as being made to eat<br/>\n&gt; all your food on<br/>\n&gt; your plate, being punished, stuff like that.  I try<br/>\n&gt; to be supportive<br/>\n&gt; of their parents - I guess... but it is hard!  And<br/>\n&gt; my kids like to<br/>\n&gt; say, &quot;We don&#39;t have to eat what we don&#39;t want to<br/>\n&gt; eat!&quot;  I can only<br/>\n&gt; imagine what gets back to the neighbor parents.  The<br/>\n&gt; kids are old<br/>\n&gt; enough to discuss this type of thing with each other<br/>\n&gt; and they do.<br/>\n&gt; <br/>\n&gt; So the other day the nk&#39;s told us that they were no<br/>\n&gt; longer allowed to<br/>\n&gt; play at our home because we &quot;cuss&quot;.   I am just not<br/>\n&gt; sure how to take<br/>\n&gt; this!  Of course we don&#39;t punish our children for<br/>\n&gt; their language<br/>\n&gt; (which exactly mimics are own).  We say things like<br/>\n&gt; crap, sh*t, maybe<br/>\n&gt; d**mn occasionally.  We are not spewing profanity in<br/>\n&gt; every sentence. <br/>\n&gt; So I certainly feel that saying we cuss is a gross<br/>\n&gt; overstatement.  My<br/>\n&gt; kids say that the nk&#39;s &quot;cuss like mad sailors&quot; when<br/>\n&gt; they are over at<br/>\n&gt; our house. (probably because they can&#39;t at home and<br/>\n&gt; so they go wild<br/>\n&gt; over here?) My guess is that the boy cussed at his<br/>\n&gt; own home, blamed it<br/>\n&gt; on us when he got in trouble, and now they are both<br/>\n&gt; forbidden to come<br/>\n&gt; over because we are a bad influence.<br/>\n&gt; <br/>\n&gt; My own kids really don&#39;t care that much and find it<br/>\n&gt; rather humorous. <br/>\n&gt; They like playing with these kids but don&#39;t miss<br/>\n&gt; them either.  And my<br/>\n&gt; kids can still go over to their house, just not vice<br/>\n&gt; versa.  I guess<br/>\n&gt; that way the neighbors can keep a better eye on the<br/>\n&gt; kids - presumably<br/>\n&gt; step in if anybody starts &quot;misbehaving&quot;.  My kids<br/>\n&gt; don&#39;t like going<br/>\n&gt; over there for obvious reasons.  I am not sure if I<br/>\n&gt; should say<br/>\n&gt; anything or if I should just let this play itself<br/>\n&gt; out or what.  I feel<br/>\n&gt; falsely accused but if I step back and look at it<br/>\n&gt; from their point of<br/>\n&gt; view, yes, we parent in a radically different way<br/>\n&gt; then them and it<br/>\n&gt; very well could undermine their &quot;authority&quot;.  I feel<br/>\n&gt; sad for their<br/>\n&gt; kids most of all.  <br/>\n&gt; <br/>\n&gt; Has anyone else had any experiences like this?  Any<br/>\n&gt; advice?  The mom<br/>\n&gt; hasn&#39;t exactly said anything to me yet - I have just<br/>\n&gt; heard of the<br/>\n&gt; &quot;shunning&quot; from the kids.<br/>\n&gt; -Alice<br/>\n&gt; the rabid cusser<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":220662483,"authorName":"Alice","from":"&quot;Alice&quot; &lt;thesackmans@...&gt;","profile":"alice_in_idaho","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"We&#39;ve been shunned!","postDate":"1167525519","msgId":20135,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVuNzBxZis0dGlrQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":20138,"prevInTime":20134,"nextInTime":20136,"topicId":20135,"numMessagesInTopic":0,"msgSnippet":"Ok, so I have read a lot of people s difficulties with friends who have opposite parenting approaches.  Some of you have stopped seeing certain families","messageBody":"<div id=\"ygrps-yiv-1850436991\">Ok, so I have read a lot of people&#39;s difficulties with friends who<br/>\nhave opposite parenting approaches.  Some of you have stopped seeing<br/>\ncertain families because the differences became so great that there<br/>\nwere more negatives than positives to the relationship.  Has anyone<br/>\nbeen outright ditched by a friend because of your radical unschooling<br/>\napproach has a negative affect (supposedly!) on their traditionally<br/>\nparented children???<br/>\n<br/>\nI have neighbors who live 2 doors down from us with 2 kids the same<br/>\nage and gender as mine.  The kids all enjoy playing together.  The<br/>\nneighbor family does all the traditional things - school, timeouts,<br/>\ngroundings, spankings, arbritrary rules, etc.  So their two kids LOVE<br/>\nLOVE LOVE to play at our house.  All four kids will happily play for<br/>\ndays on end- at our home only.  The neighbor kids (nk) beg to eat with<br/>\nus, sleep with us, everything! The neighbor mom has expressed dismay<br/>\nat the fact that no one wants to play at her house.  I was honest with<br/>\nher about the reason.  The kids told me that they like to play at my<br/>\nhouse because I let them play things that are not allowed at their<br/>\nhouse, such as Dungeons & Dragons and swordplay.  My house is just<br/>\nmore fun!<br/>\n<br/>\nLately, we - meaning my family and the neighbor kids - have had<br/>\nconversations about topics such as being made to eat all your food on<br/>\nyour plate, being punished, stuff like that.  I try to be supportive<br/>\nof their parents - I guess... but it is hard!  And my kids like to<br/>\nsay, &quot;We don&#39;t have to eat what we don&#39;t want to eat!&quot;  I can only<br/>\nimagine what gets back to the neighbor parents.  The kids are old<br/>\nenough to discuss this type of thing with each other and they do.<br/>\n<br/>\nSo the other day the nk&#39;s told us that they were no longer allowed to<br/>\nplay at our home because we &quot;cuss&quot;.   I am just not sure how to take<br/>\nthis!  Of course we don&#39;t punish our children for their language<br/>\n(which exactly mimics are own).  We say things like crap, sh*t, maybe<br/>\nd**mn occasionally.  We are not spewing profanity in every sentence. <br/>\nSo I certainly feel that saying we cuss is a gross overstatement.  My<br/>\nkids say that the nk&#39;s &quot;cuss like mad sailors&quot; when they are over at<br/>\nour house. (probably because they can&#39;t at home and so they go wild<br/>\nover here?) My guess is that the boy cussed at his own home, blamed it<br/>\non us when he got in trouble, and now they are both forbidden to come<br/>\nover because we are a bad influence.<br/>\n<br/>\nMy own kids really don&#39;t care that much and find it rather humorous. <br/>\nThey like playing with these kids but don&#39;t miss them either.  And my<br/>\nkids can still go over to their house, just not vice versa.  I guess<br/>\nthat way the neighbors can keep a better eye on the kids - presumably<br/>\nstep in if anybody starts &quot;misbehaving&quot;.  My kids don&#39;t like going<br/>\nover there for obvious reasons.  I am not sure if I should say<br/>\nanything or if I should just let this play itself out or what.  I feel<br/>\nfalsely accused but if I step back and look at it from their point of<br/>\nview, yes, we parent in a radically different way then them and it<br/>\nvery well could undermine their &quot;authority&quot;.  I feel sad for their<br/>\nkids most of all.  <br/>\n<br/>\nHas anyone else had any experiences like this?  Any advice?  The mom<br/>\nhasn&#39;t exactly said anything to me yet - I have just heard of the<br/>\n&quot;shunning&quot; from the kids.<br/>\n-Alice<br/>\nthe rabid cusser</div>","specialLinks":[]}],"prevTopicId":20116,"nextTopicId":20139}}