{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":15,"messages":[{"userId":202791723,"authorName":"ruthhmhaas","from":"&quot;ruthhmhaas&quot; &lt;vivajeste@...&gt;","profile":"ruthhmhaas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Disrespect?","postDate":"1301532594","msgId":46433,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGluMGozaStqdHR2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGk9QS1UWlpiTDJVRj1SN0pCSmo1V0U9YmtUPVRhVHNfaVJkSHFZbUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":46221,"nextInTopic":0,"prevInTime":46432,"nextInTime":46434,"topicId":46160,"numMessagesInTopic":0,"msgSnippet":"Hi, Ive been going through a difficult time with my own daughter, and after 2 years and finally being able to have an open conversation, I have found out that","messageBody":"<div id=\"ygrps-yiv-1468173812\">Hi, Ive been going through a difficult time with my own daughter, and after 2 years and finally being able to have an open conversation, I have found out that it was having a difficulty in our own relationship.  What I thought was a teenage stage, was also a feeling that my daughter thought she was disappointing me whenever I had even a slightly negative reaction to anything.  She is starting to trust our relationship again, but its definitely a process.  <br/>\n<br/>\nAnd, part of what was making this so difficult was that it was in an area I wasnt willing to see, which was that it could be about how I was parenting her.  Sometimes when we are trying to figure out why something is happening and cant quite get a handle on it, it is worth looking where we are afraid to look.  I was afraid to look because my own relationship with my parents wasnt good.  And I couldnt see that if I was imperfect as a parent, it wasnt the most awful thing.  My relationship with my parents was a pattern that was throughout my whole childhood, but my parenting with my children is always something that can change as my children change and are growing up.  I didnt realize this and thought I was failing because things were not perfect with my children, and I was putting up a wall that I could tell I was putting up but wasnt sure what it was.<br/>\n<br/>\nIt helps to understand that looking inside what appears to be a black box is actually okay.  Growth is what happens.  And healing happens, too.  It is really, really worth it, because we have the opportunity to make our relationship grow rather than shut it down.  And, we can then look forward to the years ahead with our children as adults, who feel they can be who they are and will still want to visit us.<br/>\n<br/>\nFor you, it might be something different.  And, therapy and counselling can be a great big help.  Sometimes our children dont tell us what they are feeling because they dont feel comfortable, and that is when we see acting out behavior.  Its okay to get help.  Its much better to have help, and its also a gift to our children to give them another outlet even if they say things that are hurtful to us in therapy.  They need a way to express what they are feeling, and all the things they say will be things counselors have heard a 1,000 times, and they sincerely want to help.  They can be neutral because they arent in the thick of the situation.  We are and have definitely had the help of therapists, and I am so happy we have!<br/>\n<br/>\nThough it looks like disrespect, it is really a cry for help in a way.  Its their way of venting, and it is another gift for us to see it this way for our children.  We certainly need a moment or two to vent once in a while as adults.  Thats all their doing, too.  It doesnt carry all the hurt that we feel when we are on the receiving end.  They still love us very much.  They just cant handle whatever is going on for them, and they are still learning maturity.  Adolescence is a hard thing to come to reconcile and adding all the things that each of us come into the world with, and all our relationships within our families can all be something that can feel like a lot.  The more open we can be, the more helpful it can be for our children because they know that they are acceptable, and that they have our ear and our help.<br/>\n<br/>\nIf we have a reaction to our childrens behavior, it also means that one of our buttons is just getting pushed.  My family couldnt really deal with anger very well, and we could have been put out of the house, so when my daughter was upset, it was unknown to me that it was pushing deep buttons within me.  Our children will get through things with our help, and we can heal, too.<br/>\n<br/>\nMuch, much support to you,<br/>\nYours, Ruth<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Tina Tarbutton &lt;tina.tarbutton@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I&#39;m angry right now, so I know I&#39;m not viewing this from the proper<br/>\n&gt; position.  I need help re-framing the situation, or something, so this<br/>\n&gt; doesn&#39;t anger me the way it does.<br/>\n&gt; <br/>\n&gt; Draven (10 y/o) has had the Xbox 360 for about 2 months now, and he&#39;s<br/>\n&gt; had Xbox Live for a good part of that.  Most days are spent with him<br/>\n&gt; shut in his room playing online with friends.  I&#39;m okay with that.  He<br/>\n&gt; wants his privacy, and also wants to not hear the background noises in<br/>\n&gt; the rest of the house.  Occasionally in the evenings he&#39;ll come out<br/>\n&gt; for a few minutes or an hour to spend time with my partner and I.  I<br/>\n&gt; really am okay with that.  We&#39;ve stopped asking him for any help<br/>\n&gt; around the house (because we would have to interrupt his game to ask).<br/>\n&gt; <br/>\n&gt; However, we still bring him food and such so that he eats something<br/>\n&gt; other than the chips that are kept in his room.  Not that I have a<br/>\n&gt; problem with him eating chips and beef jerky, it&#39;s more that I&#39;d like<br/>\n&gt; to add to that diet somewhat.  We go in there once a day and clean out<br/>\n&gt; the dishes from what we&#39;ve brought into him, but we make sure to do<br/>\n&gt; that when he&#39;s not involved in his game, so we don&#39;t disturb him.<br/>\n&gt; <br/>\n&gt; This afternoon my mother was heading to BK after my step father&#39;s<br/>\n&gt; therapy appointment.  She called to make sure I could cover an<br/>\n&gt; appointment here at the house, which I could.  I asked her to bring<br/>\n&gt; home an Original Chicken sandwich from BK as a surprise for Draven.<br/>\n&gt; It&#39;s his favorite food from his favorite place.  When she got here I<br/>\n&gt; knocked on his door, he snapped &quot;WHAT?&quot;  I told him I had a surprise<br/>\n&gt; for him he said &quot;Then bring it here&quot;  So I opened his door and sat it<br/>\n&gt; in front of him, being careful not to block his view of the screen.<br/>\n&gt; He yelled &quot;Great, you got me killed . . . I can&#39;t eat this and play<br/>\n&gt; anyway so why&#39;d you bring it to me&quot;  That hurt, a lot, however I<br/>\n&gt; apologized for interrupting his game and left.<br/>\n&gt; <br/>\n&gt; A few hours later I cooked tacos.  Tacos are something that he either<br/>\n&gt; loves or hates.  After I cooked it, and ate I waited to see if he<br/>\n&gt; would pop out to use the restroom or something and he didn&#39;t, so I<br/>\n&gt; knocked again (&quot;WHAT!&quot;) I started to ask him if he wanted tacos before<br/>\n&gt; I put them away and less than 2 words into it he snapped &quot;Damn mom,<br/>\n&gt; you got me killed AGAIN!&quot;  So I said never mind and walked away.<br/>\n&gt; <br/>\n&gt; My gut reaction is to say, that&#39;s it, time to unplug and focus on your<br/>\n&gt; family some more . . . . however that&#39;s not the reaction I want to<br/>\n&gt; have.  We try to treat Draven with respect, we try to anticipate his<br/>\n&gt; needs and provide for him, we try to give him as much time as humanly<br/>\n&gt; possible on his game.  We&#39;re even setting things up to meet one of his<br/>\n&gt; online friends in person in a few weeks.  I would, however, like my<br/>\n&gt; sweet little boy back, who appreciates things that are done for him,<br/>\n&gt; and enjoys helping around the house sometimes and enjoys being around<br/>\n&gt; his parents.  At the very least I&#39;d like not to be yelled at when I<br/>\n&gt; try to do something for him.<br/>\n&gt; <br/>\n&gt; Thanks for any input!<br/>\n&gt; <br/>\n&gt; Tina<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":172748165,"authorName":"Judy Negrey","from":"Judy Negrey &lt;soulinsights@...&gt;","profile":"anamarria2004","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Disrespect?","postDate":"1298311563","msgId":46221,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM5ODdGNzlCLjEwODZBJXNvdWxpbnNpZ2h0c0BzaGF3LmNhPg=="},"prevInTopic":46202,"nextInTopic":46433,"prevInTime":46220,"nextInTime":46222,"topicId":46160,"numMessagesInTopic":0,"msgSnippet":"Hmmm...First I will apologize for overlooking the living in step-father s house.  I too would probably want to withdraw. Having said that...asking children to","messageBody":"<div id=\"ygrps-yiv-637699923\">Hmmm...First I will apologize for overlooking the living in step-father&#39;s<br/>\nhouse.  I too would probably want to withdraw.<br/>\n<br/>\nHaving said that...asking children to be involved in things like choosing<br/>\ntheir own food depending on the situation isn&#39;t all bad.<br/>\n<br/>\nNo, tit-for-tat was not what I was getting at for you are right...it can<br/>\njust lend to bigger resentment.<br/>\n<br/>\nNot always do ideas get &#39;written&#39; out as well as they are in our heads.<br/>\n<br/>\nGood luck and peaceful journeys during your next 4 - 6 months.<br/>\n<br/>\nJudy</div>","specialLinks":[]},{"userId":193844353,"authorName":"Nicole Willoughby","from":"Nicole Willoughby &lt;cncnawilloughby@...&gt;","profile":"cncnawilloughby","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Disrespect?","postDate":"1298176892","msgId":46202,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5NTIxMi44ODc3Mi5xbUB3ZWIxMTE3MTQubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDRFMjFBOTdFQUI5MzRGNDBCNTIwNDhDMUE2ODc4QjQwQGRlYm9yYWg0M2YxM2ZkPg=="},"prevInTopic":46196,"nextInTopic":46221,"prevInTime":46201,"nextInTime":46203,"topicId":46160,"numMessagesInTopic":0,"msgSnippet":"I don t know if you have the stamina for that after a full day but it is a really wonderful way to reconnect.  Dylan really likes walking late at night.  The","messageBody":"<div id=\"ygrps-yiv-1818003227\">I don&#39;t know if you have the stamina for that after a full day but <br/>\nit is a really wonderful way to reconnect.  Dylan really likes walking <br/>\nlate at night.  The dark and quiet make it seem possible to talk about <br/>\nanything.  It might be a way for you to catch up with what Draven&#39;s been<br/>\n thinking about and a way for you to share the funny things you heard <br/>\nthat day.  &gt;&gt;&gt;<br/>\n<br/>\nCourtney (11) and I just took a late night drive to sonic. We have the flu and the only thing she wants to eat with a sore throat is ice cream. We pulled over and looked at stars and talked though an issue she had ( she was angry at me for taking the friend who has been staying with us this week to her dad&#39;s when she didn&#39;t want to go ) so we talked though it and I started driving again. <br/>\n<br/>\nThen I get a txt from her. ...Thx mom. <br/>\n<br/>\nAnyhow, if you can&#39;t go face to face Id thought Id mention it as a tool. Sometimes its easier to face things whithout having to speak directly to someone. <br/>\n<br/>\nNicole<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n                <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Sat, 2/19/11, Deb Lewis &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:d.lewis@...\">d.lewis@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Deb Lewis &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:d.lewis@...\">d.lewis@...</a>&gt;<br/>\nSubject: Re: [unschoolingbasics] Disrespect?<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Saturday, February 19, 2011, 9:02 AM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      I will echo what Schuyler said.   You&#39;re all living under some unnatural stress.   Be more forgiving than you might otherwise be.  <br/>\n<br/>\n<br/>\n<br/>\nIt was nice of you to get him a sandwich but it&#39;s probably true he couldn&#39;t have eaten it without pausing the game.  One hand, one bite foods are better for gaming kids and you could surprise him with a trip to BK maybe when he does come out for awhile. <br/>\n<br/>\n<br/>\n<br/>\nMaybe sometime when he&#39;s not playing ask if when you bring food you can just come in and leave it.  Maybe that will work better.   Maybe all other times you want to enter his room you knock but for food you just creep in and out.   <br/>\n<br/>\n<br/>\n<br/>\nWhen Dylan was about that age we started going out for long walks together late at night.    I don&#39;t know if you have the stamina for that after a full day but it is a really wonderful way to reconnect.  Dylan really likes walking late at night.  The dark and quiet make it seem possible to talk about anything.  It might be a way for you to catch up with what Draven&#39;s been thinking about and a way for you to share the funny things you heard that day.  <br/>\n<br/>\n<br/>\n<br/>\nSandra Dodd wrote a bit about that kind of side by side connecting.  It&#39;s here:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/truck\">http://sandradodd.com/truck</a><br/>\n<br/>\n<br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Disrespect?","postDate":"1298136688","msgId":46196,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqb3VwZytqcmVqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGlrODBkVVBVYz1HUUZTaEp1ZXVwNEstMURxOVZPNzZxay0rT3VIQ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":46195,"nextInTopic":46202,"prevInTime":46195,"nextInTime":46197,"topicId":46160,"numMessagesInTopic":0,"msgSnippet":"... So, on the one hand I think there are great comments coming out that other people will be able to use, too, but at the same time, you ve said you re","messageBody":"<div id=\"ygrps-yiv-1951520132\">Tina Tarbutton &lt;tina.tarbutton@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; &gt; When I&#39;m angry I tend to only see the bad side of stuff..<br/>\n<br/>\n </span></blockquote>So, on the one hand I think there are great comments coming out that other people will be able to use, too, but at the same time, you&#39;ve said you&#39;re working on your own emotional reactions so it might be worth thinking a little more before you hit &quot;send&quot;. <br/>\n<br/>\nSomething I used to do when Ray had just moved back into our house from a few years of living with his bio mom - so from school and a zillion rules a minute to radical unschooling - is that I would write out a post and then go through and start editing it. I&#39;d look at my own remarks and try to imagine how other unschoolers would respond - how *I* would respond if someone else read it. I&#39;d see things I hadn&#39;t noticed in terms of the words I used and how I used them and I&#39;d start reframing. By the time I was done reframing, I had a lot of my answers already but more than that, a lot of What I was reframing was how I thought about Ray and the situation. So I&#39;d go from &quot;he&#39;s so disrespectful&quot; to &quot;he&#39;s struggling a lot right now&quot; and then I&#39;d soften up a whooooole lot. <br/>\n<br/>\nWhen I could soften up, it was easier to see that some of the &quot;rough patches&quot; were more about me than Ray - about me having unrealistic expectations of a family where everyone&#39;s happy and everyone works for everyone else. Sometimes a kid in a bad mood is Just a kid in a bad mood!<br/>\n<br/>\nIf sending out posts is helping you, then keep doing it. <br/>\n<br/>\n---Meredith (Mo 9, Ray 17)</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Disrespect?","postDate":"1298135529","msgId":46195,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqb3RsOStsZG40QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEM5ODNGOEI1LjEwNkU0JXNvdWxpbnNpZ2h0c0BzaGF3LmNhPg=="},"prevInTopic":46187,"nextInTopic":46196,"prevInTime":46194,"nextInTime":46196,"topicId":46160,"numMessagesInTopic":0,"msgSnippet":"... Keep in mind that this is an unschooling list, not a standard parenting list - not all advice is equal. Advising someone to withdraw respect because she","messageBody":"<div id=\"ygrps-yiv-992445196\">Judy Negrey &lt;soulinsights@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; What is it you want and how can that best be explained or discussed - family<br/>\n&gt; meeting? withdrawal of x-box? Limited time on x-box?  x-amount of time<br/>\n&gt; helping with house chores?<br/>\n<br/>\n </span></blockquote>Keep in mind that this is an unschooling list, not a standard parenting list - not all advice is equal. Advising someone to withdraw respect because she doesn&#39;t feel respected by her child isn&#39;t going to build a better relationship, its going to set up the kind of tit-for-tat pettiness that breaks relationships down. If the goal is creating an environment that&#39;s warm and supportive, its not a good idea.<br/>\n<br/>\nFinding a way to talk with Draven is a good idea, but not from the perspective of &quot;get a better attitude, son&quot; - that&#39;s a proven failure of a strategy. Better to acknowledge that mom&#39;s feeling left out of her son&#39;s life and look for ways to reconnect. Would he be okay with mom hanging out in the same room for the company? Can mom get on the same game and play, too? On another computer? Can mom and son have &quot;dates&quot; where they go out and do things together - see a movie, get a fun meal, buy electronics? <br/>\n<br/>\nThere&#39;s some family stress, too, isn&#39;t there? It could be that Draven is insultaing himself a bit from that, or even feels like the current situation is disrespectful of him as a person. That&#39;s all the more reason for mom to actively look for ways to connect and work on that relationship, so he&#39;s not left to meet his connection and relationship needs only from peers online. <br/>\n<br/>\nAll that being said, he may just be allllllll wrapped up in this game right now. It might be a good idea to ask him to be more sensitive of his tone of voice - but it could just as easily backfire. That&#39;s a &quot;know your kid&quot; sort of issue - how is he likely to respond either to being asked to be more careful or to being sniped at? If he&#39;s generally thick skinned then he may be okay with a flat out &quot;dude, how bout a please and thank you, now and then?&quot; <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Disrespect?","postDate":"1298127751","msgId":46187,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFMjFBOTdFQUI5MzRGNDBCNTIwNDhDMUE2ODc4QjQwQGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PEFBTkxrVGk9QS1UWlpiTDJVRj1SN0pCSmo1V0U9YmtUPVRhVHNfaVJkSHFZbUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":46185,"nextInTopic":46195,"prevInTime":46186,"nextInTime":46188,"topicId":46160,"numMessagesInTopic":0,"msgSnippet":"I will echo what Schuyler said.   You re all living under some unnatural stress.   Be more forgiving than you might otherwise be. It was nice of you to get him","messageBody":"<div id=\"ygrps-yiv-121013022\">I will echo what Schuyler said.   You&#39;re all living under some unnatural stress.   Be more forgiving than you might otherwise be.  <br/>\n<br/>\nIt was nice of you to get him a sandwich but it&#39;s probably true he couldn&#39;t have eaten it without pausing the game.  One hand, one bite foods are better for gaming kids and you could surprise him with a trip to BK maybe when he does come out for awhile. <br/>\n<br/>\nMaybe sometime when he&#39;s not playing ask if when you bring food you can just come in and leave it.  Maybe that will work better.   Maybe all other times you want to enter his room you knock but for food you just creep in and out.   <br/>\n<br/>\nWhen Dylan was about that age we started going out for long walks together late at night.    I don&#39;t know if you have the stamina for that after a full day but it is a really wonderful way to reconnect.  Dylan really likes walking late at night.  The dark and quiet make it seem possible to talk about anything.  It might be a way for you to catch up with what Draven&#39;s been thinking about and a way for you to share the funny things you heard that day.  <br/>\n<br/>\nSandra Dodd wrote a bit about that kind of side by side connecting.  It&#39;s here:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/truck\">http://sandradodd.com/truck</a><br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Disrespect?","postDate":"1298118236","msgId":46185,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqb2NvcysxMGhkakBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PEFBTkxrVGlrODBkVVBVYz1HUUZTaEp1ZXVwNEstMURxOVZPNzZxay0rT3VIQ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":46183,"nextInTopic":46187,"prevInTime":46184,"nextInTime":46186,"topicId":46160,"numMessagesInTopic":0,"msgSnippet":"***Oh, absolutely. Who would want to put up with that negativity if they could avoid it. Four more months. . . maybe you can treat yourselves and cut it short.","messageBody":"<div id=\"ygrps-yiv-2069408519\">***Oh, absolutely. Who would want to put up with that negativity if they could avoid it. Four more months. . . maybe you can treat yourselves and cut it short. :)<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\nWe agreed to 6 months, we&#39;re 1/3 of the way there.<br/>\n<br/>\nIt was my partner and my decision to move here. In hindsight we<br/>\ndidn&#39;t really need to (my stepfather is doing everything except<br/>\ndriving on his own already). I would rather provide Draven with<br/>\neverything he needs so he doesn&#39;t have to step out of our little<br/>\ncomfort area, then expect him to put up with constant negativity.<br/>\nUnfortunately the negativity affects us all, and makes it a little<br/>\nmore difficult to let things roll off our backs.</div>","specialLinks":[]},{"userId":111495799,"authorName":"Cornelia","from":"&quot;Cornelia&quot; &lt;corneliablik@...&gt;","profile":"corneliablik","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Disrespect?","postDate":"1298101083","msgId":46183,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqbnMwcitwYW1mQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGlrODBkVVBVYz1HUUZTaEp1ZXVwNEstMURxOVZPNzZxay0rT3VIQ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":46180,"nextInTopic":46185,"prevInTime":46182,"nextInTime":46184,"topicId":46160,"numMessagesInTopic":0,"msgSnippet":"Dear Tina, Just a thought which may or may not be of use to you- when I get angry with my DS or loose sight of *him* and see instead a bunch of responses or","messageBody":"<div id=\"ygrps-yiv-1533155311\">Dear Tina,<br/>\nJust a thought which may or may not be of use to you- when I get angry with my DS or loose sight of *him* and see instead a bunch of responses or actions which make me disconnected and unhappy, it is usually because his behavior is echoing someone else. Usually this is someone from my childhood, or another time I felt vulnerable and afraid, and it&#39;s usually someone who had authority over me somehow. Once I see that, and realize that my son is my son, and I am a fully empowered adult, I can *see* my son again, and feel & react differently. And in those rare moments when I get hit by some real compassion, I can reframe my original hurt.<br/>\n<br/>\nYour stepfather sounds like he is a difficult man to share a space with, and I am imagining since you say that this is nothing new for you, you are way more vulnerable to seeing your dear son&#39;s anger/outbursts as domineering and threatening, possibly unloving and disrespectful..? Clearly it doesn&#39;t last, from what you described, but I wanted to put that out there in case it was at all helpful.<br/>\nWith love,<br/>\nCornelia</div>","specialLinks":[]},{"userId":196677035,"authorName":"Tina Tarbutton","from":"Tina Tarbutton &lt;tina.tarbutton@...&gt;","profile":"dravensmomhome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Disrespect?","postDate":"1298073509","msgId":46180,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrODBkVVBVYz1HUUZTaEp1ZXVwNEstMURxOVZPNzZxay0rT3VIQ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEFBTkxrVGk9QS1UWlpiTDJVRj1SN0pCSmo1V0U9YmtUPVRhVHNfaVJkSHFZbUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGk9QS1UWlpiTDJVRj1SN0pCSmo1V0U9YmtUPVRhVHNfaVJkSHFZbUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":46177,"nextInTopic":46183,"prevInTime":46179,"nextInTime":46181,"topicId":46160,"numMessagesInTopic":0,"msgSnippet":"Thank you so much for all of the input, I m going to try to address what everyone said in one email. On Thu, Feb 17, 2011 at 5:57 PM, Tina Tarbutton ... Draven","messageBody":"<div id=\"ygrps-yiv-1426339464\">Thank you so much for all of the input, I&#39;m going to try to address<br/>\nwhat everyone said in one email.<br/>\n<br/>\n<br/>\n<br/>\nOn Thu, Feb 17, 2011 at 5:57 PM, Tina Tarbutton<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tina.tarbutton@...\">tina.tarbutton@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m angry right now, so I know I&#39;m not viewing this from the proper<br/>\n&gt; position.  I need help re-framing the situation, or something, so this<br/>\n&gt; doesn&#39;t anger me the way it does.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Draven came out of the room later that evening and wanted hugs and<br/>\nkisses and snuggles.  I jokingly (with a smile on my face) said &quot;WHAT!<br/>\n. . . . Jeeze man you just made me delete an email I was trying to<br/>\nread&quot;  He said &quot;Wow mom, temper temper&quot;  And I tackled him onto the<br/>\nbed and said &quot;Doesn&#39;t feel so great does it&quot; while tickling and<br/>\nlaughing with him.  He said he was sorry he acted that way earlier, he<br/>\nhad woken up in a bad mood and thought playing would get him out of<br/>\nit, unfortunately he was playing with a bunch of newbies (or shall I<br/>\nsay n00bs) and that just frustrated him more.  He enjoys helping new<br/>\nplayers to the game, however he&#39;s realized he has to be in the right<br/>\nmindset to do that without getting frustrated.<br/>\n<br/>\nWe talked some about leaving the door open more often so I can at<br/>\nleast hear his cute little voice and he said we&#39;ll work on that.<br/>\n<br/>\nLast night he helped set up the new TV tuner on the computer, helped<br/>\nme run cables and set it up with the PS3.  While I was out I wanted to<br/>\nbuy fluxx, but saw zombie fluxx so I got that (zombies are a favorite<br/>\nfor him right now) we played 2 or 3 games with various amounts of<br/>\nfriendly cheating.  Parker has to spend 4 days out of town this week<br/>\nand when she&#39;s gone him and I tend to cling to each other because we<br/>\nmiss her.<br/>\n<br/>\nEarly this morning I was settling down for bed and brought up the park<br/>\nday idea again, which he had previously said he didn&#39;t want to attend<br/>\n. . . he decided he wanted to go, and slept with me for the morning<br/>\nhours before getting up at noon to go to the park.<br/>\n<br/>\nWhen I&#39;m angry I tend to only see the bad side of stuff.  We just<br/>\nspent a ton of time together this past weekend.  He has, overall, been<br/>\ncoming out of his room for more cuddles and closeness over the last<br/>\nfew weeks.  He typically is appreciative when we bring him food, and<br/>\nwhile we may not ask him directly for help very often anymore, he will<br/>\nstop his game if he sees us coming home with groceries, and he does<br/>\nfeed the cats when someone mentions it to him.  He is still my same<br/>\nhelpful caring little boy, I think that now we see the calm restful<br/>\nmoments so often, that the rude reactions stand out more.  I remember<br/>\na time when every interaction with him involved yelling and rudeness<br/>\nand disrespect on both sides.  Things are better, I just need to<br/>\nremember that we won&#39;t have perfect days very often, and that&#39;s okay.<br/>\n<br/>\nHe has been making his own food since he was 3 when we had a chart on<br/>\nthe side of the microwave with pictures of foods, and pictures of the<br/>\nbuttons he needed to hit to cook those foods, he&#39;s always wanted to be<br/>\nindependent.  Now however, he&#39;d rather not leave our area of the house<br/>\nlong enough to do that.  He would happily eat bag after bag of<br/>\ndorritos (which I provide for him happily) instead of taking the time<br/>\nto cook something, even a 30 second microwave burrito.  Part of it is<br/>\nthat non of us are fully comfortable here, my stepfather is a very<br/>\ndifficult person to be around, his negativity is affecting us all.  My<br/>\nstep father tends to hang in the living room, which is between our<br/>\nrooms and the kitchen, so getting his own food means interacting with<br/>\nthe grump.  And then while he&#39;s in the kitchen cooking (or even just<br/>\ngetting a drink) my stepdad loves to follow him in there and give a<br/>\nrunning commentary of his every move (don&#39;t keep the freezer open too<br/>\nlong, why are you using that plate instead of that plate, make sure<br/>\nyou cover that before it goes in the microwave, did you shut the<br/>\nfreezer tightly, don&#39;t use paper towels for that, use napkins, make<br/>\nsure you wipe up, you missed a crumb, some of it got on the floor make<br/>\nsure the floor gets wiped up).  I wish I could stay this was because<br/>\nof his stroke, unfortunately it&#39;s how I grew up, so I know first hand<br/>\nhow uncomfortable it is.  He still does it to me now and I&#39;m an adult.<br/>\n We agreed to 6 months, we&#39;re 1/3 of the way there.<br/>\n<br/>\nIt was my partner and my decision to move here.  In hindsight we<br/>\ndidn&#39;t really need to (my stepfather is doing everything except<br/>\ndriving on his own already).  I would rather provide Draven with<br/>\neverything he needs so he doesn&#39;t have to step out of our little<br/>\ncomfort area, then expect him to put up with constant negativity.<br/>\nUnfortunately the negativity affects us all, and makes it a little<br/>\nmore difficult to let things roll off our backs.<br/>\n<br/>\nAs for moving the Xbox out of the room, that&#39;s not a possibility right<br/>\nnow.  Our only private areas are the 2 bedrooms.  The living<br/>\nroom/kitchen/dining room is shared, and to my stepfather that means as<br/>\nthe eldest he gets to decide what&#39;s being done out there at any given<br/>\ntime.  I can&#39;t even comfortably watch a TV show out there honestly.<br/>\nWe currently have the Wii and PS3 and computer set up in my room, and<br/>\nthe Xbox 360 an netbook set up in Draven&#39;s room.  He doesn&#39;t like<br/>\nusing the netbook much, so most computer usage takes place in our<br/>\nroom, he hasn&#39;t gotten all that into the PS3 but when he does play it<br/>\nhe&#39;s in here as well.<br/>\n<br/>\nThe last 24 hours have been great, I just need to keep that in mind<br/>\nnext time we have a rough patch.  Just like with disappointment, one<br/>\nrough patch doesn&#39;t mean all is bad.<br/>\n<br/>\n<br/>\nThanks everyone!<br/>\nTina</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Disrespect?","postDate":"1298055416","msgId":46177,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYwOTQ3QTZBLUFBMzktNDA0Mi04NzhCLTJBMzhCNTUwMDQzQ0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEM5ODNGOEI1LjEwNkU0JXNvdWxpbnNpZ2h0c0BzaGF3LmNhPg==","referencesHeader":"PEM5ODNGOEI1LjEwNkU0JXNvdWxpbnNpZ2h0c0BzaGF3LmNhPg=="},"prevInTopic":46176,"nextInTopic":46180,"prevInTime":46176,"nextInTime":46178,"topicId":46160,"numMessagesInTopic":0,"msgSnippet":"... It s a fairly typical adult reaction to assume a child is just choosing to be an ungrateful brat and needs to be made to choose differently. How can you","messageBody":"<div id=\"ygrps-yiv-838872409\"><blockquote><span title=\"ireply\">&gt; and yet the reciprocal basics of thank you, being acknowledged and<br/>\n&gt; being mindful that others in the house like to listen to things is  <br/>\n&gt; being<br/>\n&gt; ignored.<br/>\n<br/>\n </span></blockquote>It&#39;s a fairly typical adult reaction to assume a child is just  <br/>\nchoosing to be an ungrateful brat and needs to be made to choose  <br/>\ndifferently.<br/>\n<br/>\nHow can you make someone be respectful? You can make him *act*  <br/>\nrespectful, but I hope the list can help parents strive for better  <br/>\nthan that!<br/>\n<br/>\nWhy would any person *just choose* to be mean?<br/>\n<br/>\nIf behavior is seen as communication, it sure sounds like he&#39;s  <br/>\ncommunicating anger. What&#39;s making him angry?<br/>\n<br/>\nSomeone mentioned a lot of changes in his life. Part of it may be he  <br/>\nfeels he&#39;s being jerked around with no say in the matter. Schuyler  <br/>\nmentioned she&#39;d found it a mistake to give Simon a space to retreat  <br/>\nthat was away from the family. If he&#39;s angry, he needs connection and  <br/>\ncontact so being cut off is probably feeding the anger.<br/>\n<br/>\nIs it possible to bring the computer out? Perhaps give him some  <br/>\nheadphones if the sound bothers others?<br/>\n<br/>\nI agree, walking on egg shells for fear of setting him off isn&#39;t  <br/>\nhelping him deal with what he&#39;s dealing with and is probably making it  <br/>\nworse.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Disrespect?","postDate":"1298055366","msgId":46176,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGltVlRweVpZXz1CeU9uTVdKcWNEd0ZpTUFYaVgrNm1jWXhYTHFQdUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEM5ODNGOEI1LjEwNkU0JXNvdWxpbnNpZ2h0c0BzaGF3LmNhPg==","referencesHeader":"PEM5ODNGOEI1LjEwNkU0JXNvdWxpbnNpZ2h0c0BzaGF3LmNhPg=="},"prevInTopic":46175,"nextInTopic":46177,"prevInTime":46175,"nextInTime":46177,"topicId":46160,"numMessagesInTopic":0,"msgSnippet":"... ***None of these sounds very respectful, except perhaps having a meeting when he is not on the Xbox and talking about it, brainstorming. ... *** What do","messageBody":"<div id=\"ygrps-yiv-852423596\">On Fri, Feb 18, 2011 at 9:21 AM, Judy Negrey &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:soulinsights@...\">soulinsights@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; What is it you want and how can that best be explained or discussed -<br/>\n&gt; family<br/>\n&gt; meeting? withdrawal of x-box? Limited time on x-box? x-amount of time<br/>\n&gt; helping with house chores?<br/>\n&gt;<br/>\n </span></blockquote>***None of these sounds very respectful, except perhaps having a meeting<br/>\nwhen he is not on the Xbox and talking about it, brainstorming.<br/>\n-----------------------------------------------------------------------------------------------------<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; What if you make him responsible for getting his own meals i.e. instead of<br/>\n&gt; bringing it to him you give him the responsibility for coming out of the<br/>\n&gt; room and getting it for him. When you run out of his favorite food he has<br/>\n&gt; to come the store to help purchase the foods.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>*** What do you think these options would offer your family? I see this as<br/>\narbitrarily inconveniencing your child to meet your needs. I would feel<br/>\ndisrespected if my partner did this to me. I would feel angry and want to<br/>\nresist. It seems to me that this would create resentment.<br/>\n----------------------------------------------------------------------------------------------------<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; No disrespect intended but you are sounding more like servant than a<br/>\n&gt; valued,<br/>\n&gt; considerate member of the family.<br/>\n&gt;<br/>\n&gt; ***That&#39;s a common mainstream view on this. However, becoming a mother is a<br/>\n </span></blockquote>choice. How you parent is a choice. Serving is not a bad thing, it is one<br/>\nway in which many people experience love. I feel loved when my partner<br/>\nwashes the dishes, especially when it is my turn. It feels so wonderful.<br/>\n----------------------------------------------------------------------------------------------------<br/>\n<br/>\nFaith<br/>\n-- <br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":172748165,"authorName":"Judy Negrey","from":"Judy Negrey &lt;soulinsights@...&gt;","profile":"anamarria2004","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Disrespect?","postDate":"1298049701","msgId":46175,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM5ODNGOEI1LjEwNkU0JXNvdWxpbnNpZ2h0c0BzaGF3LmNhPg=="},"prevInTopic":46171,"nextInTopic":46176,"prevInTime":46174,"nextInTime":46176,"topicId":46160,"numMessagesInTopic":0,"msgSnippet":"I believe my reaction would also be of anger as from what I have read there does seem to be an inequality of respect.  I have read you and your family are","messageBody":"<div id=\"ygrps-yiv-1712667939\">I believe my reaction would also be of anger as from what I have read there<br/>\ndoes seem to be an inequality of respect.  I have read you and your family<br/>\nare giving your son respect - his space, quiet, bringing him the foods he<br/>\nlikes - and yet the reciprocal basics of thank you, being acknowledged and<br/>\nbeing mindful that others in the house like to listen to things is being<br/>\nignored.  <br/>\n<br/>\nI sounds as though you are walking on some egg shells - not asking him to<br/>\nhelp for fear of interrupting his game and perhaps his reaction of it?<br/>\n<br/>\nWhat is it you want and how can that best be explained or discussed - family<br/>\nmeeting? withdrawal of x-box? Limited time on x-box?  x-amount of time<br/>\nhelping with house chores?<br/>\n<br/>\nWhat if you make him responsible for getting his own meals i.e. instead of<br/>\nbringing it to him you give him the responsibility for coming out of the<br/>\nroom and getting it for him.  When you run out of his favorite food he has<br/>\nto come the store to help purchase the foods.<br/>\n<br/>\nHave you thought on how what you are doing is helping to have him show<br/>\nrespect and consideration or rather enabling him to continue to be rude?<br/>\n<br/>\nNo disrespect intended but you are sounding more like servant than a valued,<br/>\nconsiderate member of the family.<br/>\n<br/>\nAll the best, Mama Judy</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Disrespect?","postDate":"1298031287","msgId":46171,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqbG5ybitzOWhyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGk9QS1UWlpiTDJVRj1SN0pCSmo1V0U9YmtUPVRhVHNfaVJkSHFZbUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":46170,"nextInTopic":46175,"prevInTime":46170,"nextInTime":46172,"topicId":46160,"numMessagesInTopic":0,"msgSnippet":"I m thinking he is totally immersed in this new thing and needs you to leave him alone for a while. Which is hard on a loving parent. :) Would it work to speak","messageBody":"<div id=\"ygrps-yiv-1250508076\">I&#39;m thinking he is totally immersed in this new thing and needs you to leave him alone for a while. Which is hard on a loving parent. :)<br/>\n<br/>\nWould it work to speak to him the next time he pokes his head out and say something along the lines that you know you upset him when you try to bring him food and you don&#39;t want to do that, and you don&#39;t want to have your head snapped off for trying, and so you won&#39;t be doing that anymore?<br/>\n<br/>\nThat you will make sure there are plenty of things he can make for himself to eat but he&#39;s going to have to pay attention to his own eating more and not count on room service from now on. Unless he wants it again some time when he is not feeling so intruded upon. <br/>\n<br/>\nOr put it in a note? I know it seems silly but sometimes it can be useful. Everyone here is usually on different schedules and not always at their best to discuss things at the same time. Everyone is not even awake at the same time, many days. :) <br/>\n<br/>\nAnd be prepared for a messier kitchen and eating habits that would not be yours if feeding himself becomes the plan. FWIW, I prepare one meal a day -- dinner -- and, mostly, everyone eats it or part of it. But for the rest, everyone makes their own when they want to. My kids are older but they have been doing this for years -- maybe since they were about 10, if I remember correctly. <br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Tina Tarbutton &lt;tina.tarbutton@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I&#39;m angry right now, so I know I&#39;m not viewing this from the proper<br/>\n&gt; position.  I need help re-framing the situation, or something, so this<br/>\n&gt; doesn&#39;t anger me the way it does.<br/>\n&gt; <br/>\n&gt; Draven (10 y/o) has had the Xbox 360 for about 2 months now, and he&#39;s<br/>\n&gt; had Xbox Live for a good part of that.  Most days are spent with him<br/>\n&gt; shut in his room playing online with friends.  I&#39;m okay with that.  He<br/>\n&gt; wants his privacy, and also wants to not hear the background noises in<br/>\n&gt; the rest of the house.  Occasionally in the evenings he&#39;ll come out<br/>\n&gt; for a few minutes or an hour to spend time with my partner and I.  I<br/>\n&gt; really am okay with that.  We&#39;ve stopped asking him for any help<br/>\n&gt; around the house (because we would have to interrupt his game to ask).<br/>\n&gt; <br/>\n&gt; However, we still bring him food and such so that he eats something<br/>\n&gt; other than the chips that are kept in his room.  Not that I have a<br/>\n&gt; problem with him eating chips and beef jerky, it&#39;s more that I&#39;d like<br/>\n&gt; to add to that diet somewhat.  We go in there once a day and clean out<br/>\n&gt; the dishes from what we&#39;ve brought into him, but we make sure to do<br/>\n&gt; that when he&#39;s not involved in his game, so we don&#39;t disturb him.<br/>\n&gt; <br/>\n&gt; This afternoon my mother was heading to BK after my step father&#39;s<br/>\n&gt; therapy appointment.  She called to make sure I could cover an<br/>\n&gt; appointment here at the house, which I could.  I asked her to bring<br/>\n&gt; home an Original Chicken sandwich from BK as a surprise for Draven.<br/>\n&gt; It&#39;s his favorite food from his favorite place.  When she got here I<br/>\n&gt; knocked on his door, he snapped &quot;WHAT?&quot;  I told him I had a surprise<br/>\n&gt; for him he said &quot;Then bring it here&quot;  So I opened his door and sat it<br/>\n&gt; in front of him, being careful not to block his view of the screen.<br/>\n&gt; He yelled &quot;Great, you got me killed . . . I can&#39;t eat this and play<br/>\n&gt; anyway so why&#39;d you bring it to me&quot;  That hurt, a lot, however I<br/>\n&gt; apologized for interrupting his game and left.<br/>\n&gt; <br/>\n&gt; A few hours later I cooked tacos.  Tacos are something that he either<br/>\n&gt; loves or hates.  After I cooked it, and ate I waited to see if he<br/>\n&gt; would pop out to use the restroom or something and he didn&#39;t, so I<br/>\n&gt; knocked again (&quot;WHAT!&quot;) I started to ask him if he wanted tacos before<br/>\n&gt; I put them away and less than 2 words into it he snapped &quot;Damn mom,<br/>\n&gt; you got me killed AGAIN!&quot;  So I said never mind and walked away.<br/>\n&gt; <br/>\n&gt; My gut reaction is to say, that&#39;s it, time to unplug and focus on your<br/>\n&gt; family some more . . . . however that&#39;s not the reaction I want to<br/>\n&gt; have.  We try to treat Draven with respect, we try to anticipate his<br/>\n&gt; needs and provide for him, we try to give him as much time as humanly<br/>\n&gt; possible on his game.  We&#39;re even setting things up to meet one of his<br/>\n&gt; online friends in person in a few weeks.  I would, however, like my<br/>\n&gt; sweet little boy back, who appreciates things that are done for him,<br/>\n&gt; and enjoys helping around the house sometimes and enjoys being around<br/>\n&gt; his parents.  At the very least I&#39;d like not to be yelled at when I<br/>\n&gt; try to do something for him.<br/>\n&gt; <br/>\n&gt; Thanks for any input!<br/>\n&gt; <br/>\n&gt; Tina<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":280852700,"authorName":"s.waynforth@btopenworld.com","from":"&quot;s.waynforth@...&quot; &lt;s.waynforth@...&gt;","profile":"s.waynforth@btopenworld.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Disrespect?","postDate":"1298027943","msgId":46170,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqbGtqNysyYnByQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGk9QS1UWlpiTDJVRj1SN0pCSmo1V0U9YmtUPVRhVHNfaVJkSHFZbUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":46160,"nextInTopic":46171,"prevInTime":46169,"nextInTime":46171,"topicId":46160,"numMessagesInTopic":0,"msgSnippet":"Draven was rude. I would say that to Linnaea or Simon. Possibly as a joke, possibly as a statement. But that is me and my relationship with Simon and my","messageBody":"<div id=\"ygrps-yiv-1860945187\">Draven was rude. I would say that to Linnaea or Simon. Possibly as a joke, possibly as a statement. But that is me and my relationship with Simon and my relationship with Linnaea. <br/>\n<br/>\nWe have a house that is all ours. The gaming room has lots of chairs. It is easy for me to go in and sit next to Linnaea when she&#39;s playing. The computers are in the living room. Another television with xbox and ps2 are in the living room as well. Interaction is a part of the day to day. <br/>\n<br/>\nWhen Simon was little and Linnaea was littler, 5 and 2, 4 and 1? I set up the television in a back room with lots of toys and little Simon would go and watch television in there on his own. In retrospect it wasn&#39;t a good decision on my part. It was so that he could be private, without Linnaea, and so that I didn&#39;t have to hear all of the shows he was watching. It was much better when the television came back out of that room and Simon came with it. It was much better for all of us to have shared space. <br/>\n<br/>\nI don&#39;t know if it is possible for you in your mom&#39;s house to share space easily with Draven and the xbox. I don&#39;t know if that is a possible answer to your desire to be with Draven more. <br/>\n<br/>\nCan you talk to Draven? Some kids are less amenable to conversation than others. Can you tell him you miss him? Ask if there are ways that you can join him in his room? Talk about caring for him and wanting to see him more. Can you set up his room so that it is easy for you to come in and not get in the way of the television? Or so that you can come in and sit next to him without really interfering? <br/>\n<br/>\nVideo games are incredibly absorbing. The focus required is amazing. I played Mario Galaxy 2 with Simon yesterday and it&#39;s been an age since I&#39;ve played a video game other than my ds games. I sucked. Oh, and I felt so bad because I was terrible help to Simon. He was very patient with me. But I&#39;m going to have to do some playing on my own so that I am not the completely useless partner in a game. And I got irritable. Simon and Linnaea were trying to advise me and I was just trying to figure out how to get on Yoshi again. I didn&#39;t snap, but I could feel it bubbling away inside my gullet. I had to look for amusement and focus in a very different way. <br/>\n<br/>\nDraven got killed at the moment or in the moments when you were in the room. It was easy to turn that frustration on to you. You were the easy point of blame. Don&#39;t take it personally. Even if it feels so very personal. Recognise that he would have sworn or shouted or done something else if you hadn&#39;t been there to direct his frustration towards. I probably would have made a joke, or done something light about it, something like &quot;just trying to help you perfect your spawning technique.&quot; Maybe even have just &quot;sorry&quot; or something. I also would have said, &quot;hey, your Grandma got it special for you, &quot; about the sandwich. And then I would have left the room and thought as many good thoughts about whichever child it was who had just snapped at me as I could. <br/>\n<br/>\nIt&#39;s easy to build up a picture of someone doing things that are awful. It is remarkably easy. It takes a bit of work to find value and goodness in something that isn&#39;t necessarily what you want for yourself or for somebody else. <br/>\n<br/>\nIn those minutes and hours when you get to be with Draven offer things to do that will be bigger, like a trip to the Planetarium another day. Or a day of going to see friends or going and doing other things that he really likes. Look up things in and around where you are that he&#39;ll enjoy and come up with ideas for other activities. And remember that you moved from all that he knew and he came willingly. His friends aren&#39;t where you are any more. His life is somewhat in upheaval. And he&#39;s really exploring something he wants to do in that upheaval. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Tina Tarbutton &lt;tina.tarbutton@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I&#39;m angry right now, so I know I&#39;m not viewing this from the proper<br/>\n&gt; position.  I need help re-framing the situation, or something, so this<br/>\n&gt; doesn&#39;t anger me the way it does.<br/>\n&gt; <br/>\n&gt; Draven (10 y/o) has had the Xbox 360 for about 2 months now, and he&#39;s<br/>\n&gt; had Xbox Live for a good part of that.  Most days are spent with him<br/>\n&gt; shut in his room playing online with friends.  I&#39;m okay with that.  He<br/>\n&gt; wants his privacy, and also wants to not hear the background noises in<br/>\n&gt; the rest of the house.  Occasionally in the evenings he&#39;ll come out<br/>\n&gt; for a few minutes or an hour to spend time with my partner and I.  I<br/>\n&gt; really am okay with that.  We&#39;ve stopped asking him for any help<br/>\n&gt; around the house (because we would have to interrupt his game to ask).<br/>\n&gt; <br/>\n&gt; However, we still bring him food and such so that he eats something<br/>\n&gt; other than the chips that are kept in his room.  Not that I have a<br/>\n&gt; problem with him eating chips and beef jerky, it&#39;s more that I&#39;d like<br/>\n&gt; to add to that diet somewhat.  We go in there once a day and clean out<br/>\n&gt; the dishes from what we&#39;ve brought into him, but we make sure to do<br/>\n&gt; that when he&#39;s not involved in his game, so we don&#39;t disturb him.<br/>\n&gt; <br/>\n&gt; This afternoon my mother was heading to BK after my step father&#39;s<br/>\n&gt; therapy appointment.  She called to make sure I could cover an<br/>\n&gt; appointment here at the house, which I could.  I asked her to bring<br/>\n&gt; home an Original Chicken sandwich from BK as a surprise for Draven.<br/>\n&gt; It&#39;s his favorite food from his favorite place.  When she got here I<br/>\n&gt; knocked on his door, he snapped &quot;WHAT?&quot;  I told him I had a surprise<br/>\n&gt; for him he said &quot;Then bring it here&quot;  So I opened his door and sat it<br/>\n&gt; in front of him, being careful not to block his view of the screen.<br/>\n&gt; He yelled &quot;Great, you got me killed . . . I can&#39;t eat this and play<br/>\n&gt; anyway so why&#39;d you bring it to me&quot;  That hurt, a lot, however I<br/>\n&gt; apologized for interrupting his game and left.<br/>\n&gt; <br/>\n&gt; A few hours later I cooked tacos.  Tacos are something that he either<br/>\n&gt; loves or hates.  After I cooked it, and ate I waited to see if he<br/>\n&gt; would pop out to use the restroom or something and he didn&#39;t, so I<br/>\n&gt; knocked again (&quot;WHAT!&quot;) I started to ask him if he wanted tacos before<br/>\n&gt; I put them away and less than 2 words into it he snapped &quot;Damn mom,<br/>\n&gt; you got me killed AGAIN!&quot;  So I said never mind and walked away.<br/>\n&gt; <br/>\n&gt; My gut reaction is to say, that&#39;s it, time to unplug and focus on your<br/>\n&gt; family some more . . . . however that&#39;s not the reaction I want to<br/>\n&gt; have.  We try to treat Draven with respect, we try to anticipate his<br/>\n&gt; needs and provide for him, we try to give him as much time as humanly<br/>\n&gt; possible on his game.  We&#39;re even setting things up to meet one of his<br/>\n&gt; online friends in person in a few weeks.  I would, however, like my<br/>\n&gt; sweet little boy back, who appreciates things that are done for him,<br/>\n&gt; and enjoys helping around the house sometimes and enjoys being around<br/>\n&gt; his parents.  At the very least I&#39;d like not to be yelled at when I<br/>\n&gt; try to do something for him.<br/>\n&gt; <br/>\n&gt; Thanks for any input!<br/>\n&gt; <br/>\n&gt; Tina<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":196677035,"authorName":"Tina Tarbutton","from":"Tina Tarbutton &lt;tina.tarbutton@...&gt;","profile":"dravensmomhome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Disrespect?","postDate":"1297983425","msgId":46160,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9QS1UWlpiTDJVRj1SN0pCSmo1V0U9YmtUPVRhVHNfaVJkSHFZbUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":46170,"prevInTime":46159,"nextInTime":46161,"topicId":46160,"numMessagesInTopic":0,"msgSnippet":"I m angry right now, so I know I m not viewing this from the proper position.  I need help re-framing the situation, or something, so this doesn t anger me the","messageBody":"<div id=\"ygrps-yiv-357250150\">I&#39;m angry right now, so I know I&#39;m not viewing this from the proper<br/>\nposition.  I need help re-framing the situation, or something, so this<br/>\ndoesn&#39;t anger me the way it does.<br/>\n<br/>\nDraven (10 y/o) has had the Xbox 360 for about 2 months now, and he&#39;s<br/>\nhad Xbox Live for a good part of that.  Most days are spent with him<br/>\nshut in his room playing online with friends.  I&#39;m okay with that.  He<br/>\nwants his privacy, and also wants to not hear the background noises in<br/>\nthe rest of the house.  Occasionally in the evenings he&#39;ll come out<br/>\nfor a few minutes or an hour to spend time with my partner and I.  I<br/>\nreally am okay with that.  We&#39;ve stopped asking him for any help<br/>\naround the house (because we would have to interrupt his game to ask).<br/>\n<br/>\nHowever, we still bring him food and such so that he eats something<br/>\nother than the chips that are kept in his room.  Not that I have a<br/>\nproblem with him eating chips and beef jerky, it&#39;s more that I&#39;d like<br/>\nto add to that diet somewhat.  We go in there once a day and clean out<br/>\nthe dishes from what we&#39;ve brought into him, but we make sure to do<br/>\nthat when he&#39;s not involved in his game, so we don&#39;t disturb him.<br/>\n<br/>\nThis afternoon my mother was heading to BK after my step father&#39;s<br/>\ntherapy appointment.  She called to make sure I could cover an<br/>\nappointment here at the house, which I could.  I asked her to bring<br/>\nhome an Original Chicken sandwich from BK as a surprise for Draven.<br/>\nIt&#39;s his favorite food from his favorite place.  When she got here I<br/>\nknocked on his door, he snapped &quot;WHAT?&quot;  I told him I had a surprise<br/>\nfor him he said &quot;Then bring it here&quot;  So I opened his door and sat it<br/>\nin front of him, being careful not to block his view of the screen.<br/>\nHe yelled &quot;Great, you got me killed . . . I can&#39;t eat this and play<br/>\nanyway so why&#39;d you bring it to me&quot;  That hurt, a lot, however I<br/>\napologized for interrupting his game and left.<br/>\n<br/>\nA few hours later I cooked tacos.  Tacos are something that he either<br/>\nloves or hates.  After I cooked it, and ate I waited to see if he<br/>\nwould pop out to use the restroom or something and he didn&#39;t, so I<br/>\nknocked again (&quot;WHAT!&quot;) I started to ask him if he wanted tacos before<br/>\nI put them away and less than 2 words into it he snapped &quot;Damn mom,<br/>\nyou got me killed AGAIN!&quot;  So I said never mind and walked away.<br/>\n<br/>\nMy gut reaction is to say, that&#39;s it, time to unplug and focus on your<br/>\nfamily some more . . . . however that&#39;s not the reaction I want to<br/>\nhave.  We try to treat Draven with respect, we try to anticipate his<br/>\nneeds and provide for him, we try to give him as much time as humanly<br/>\npossible on his game.  We&#39;re even setting things up to meet one of his<br/>\nonline friends in person in a few weeks.  I would, however, like my<br/>\nsweet little boy back, who appreciates things that are done for him,<br/>\nand enjoys helping around the house sometimes and enjoys being around<br/>\nhis parents.  At the very least I&#39;d like not to be yelled at when I<br/>\ntry to do something for him.<br/>\n<br/>\nThanks for any input!<br/>\n<br/>\nTina</div>","specialLinks":[]}],"prevTopicId":46422,"nextTopicId":17235}}