{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":66,"messages":[{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I was wondering about the future","postDate":"1179937037","msgId":23981,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzMXBlZCtxMWZiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGYzMW5sbytyaGt0QGVHcm91cHMuY29tPg=="},"prevInTopic":23980,"nextInTopic":23982,"prevInTime":23980,"nextInTime":23982,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"~~Ren, I think your wording is a bit harsh for someone who is trying to understand this whole world and make a decision to enter it. I dont know if that is","messageBody":"<div id=\"ygrps-yiv-981990840\">~~Ren,<br/>\n<br/>\nI think your wording is a bit harsh for someone who is trying to<br/>\nunderstand this whole world and make a decision to enter it. I dont<br/>\nknow if that is your intention but that is how it feels.~~<br/>\n<br/>\nRight now I&#39;m more concerned about the harshness your child is<br/>\nexperiencing than rendering advice that is geared to make you feel<br/>\nbetter about your choices. That IS harsh. I understand.<br/>\n<br/>\nBut your child is in a world of hurt and YOU can stop it. I could pat<br/>\nyou on the back and tell you everything is ok, but it&#39;s not. I totally<br/>\nunderstand that this is a lot to take in, but you&#39;ve only got a few<br/>\nyears left before this child is a legal adult, only a few short years<br/>\nto try and mend relationships and damaged self-esteem. <br/>\n<br/>\nI hope my words can reach through some of the crud you (and most of<br/>\nus) have learned that are lies and do what is best for your child. He<br/>\nis hurting badly. YOu have the power to change that. Do it.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I was wondering about the future","postDate":"1179936748","msgId":23980,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzMXA1YytvcDRsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGYzOTFjYzE0MDcwNTIzMDY0MGhiNDBjMDJjeWViYzdkNmViZjhjZWVjMDFAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":23979,"nextInTopic":23981,"prevInTime":23979,"nextInTime":23981,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"... write.  I ... more the has ... doesnt ... finishes it. You could do it for him. Seriously. There was a three week period when my stepson moved in where his","messageBody":"<div id=\"ygrps-yiv-1210251785\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Robyn Bentley&quot; <br/>\n&lt;robyn.bentley@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; The things Nate refuses to do is writing anything.  He hates to <br/>\n </span></blockquote>write.  I<br/>\n<blockquote><span title=\"ireply\"> &gt; mean anything.. I dont necessarily mean stories.  It seems the <br/>\n </span></blockquote>more the has<br/>\n<blockquote><span title=\"ireply\"> &gt; to do actual writing the more he gets emotionally upset.  So he <br/>\n </span></blockquote>doesnt<br/>\n<blockquote><span title=\"ireply\"> &gt; complete any of his work unless you sit there and make sure he <br/>\n </span></blockquote>finishes it.<br/>\n<br/>\nYou could do it for him. Seriously. There was a three week period <br/>\nwhen my stepson moved in where his mom wouldn&#39;t let us pull him out <br/>\nof school. So I did his homework for him. His grades didn&#39;t get any <br/>\nworse in that time period - he actually got higher scores on the <br/>\ntests he took during that time, and I&#39;m convinced the reduction of <br/>\nstress was a big part of that. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have thought about how I would handle this at home.  He would <br/>\n </span></blockquote>learn how to<br/>\n<blockquote><span title=\"ireply\"> &gt; type.<br/>\n<br/>\n </span></blockquote>If he chooses to, sure he will. My stepson is a great typist from <br/>\nplaying Runescape - he&#39;s fast and accurate. He loves meeting new <br/>\npeople online and he Loves! virtual commerce. He can bid on dragon-<br/>\nscale armor in english and german, now.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Nate doesnt finish anything.. Well<br/>\n&gt; unless he is building something with Legos or making paper <br/>\n </span></blockquote>airplanes.<br/>\n<br/>\nWow, what a great example of the difference between chosen work and <br/>\nimposed work! He *has* the ability and attention to finish projects -<br/>\n the trouble is you are not asigning value to his projects. <br/>\n<br/>\nThis statement of yours is also a good look at why you can&#39;t make <br/>\nassumptions about how unschooling will look in your home based on <br/>\nhow a kid responds to schooling and imposed chores. Ray fought and <br/>\nfought and fought against both - he &quot;looked&quot; alot like your <br/>\ndescriptions of Nate. Now, after six months of deschooling, he&#39;s <br/>\npractically exploding with new projects and ideas. He&#39;s drawing and <br/>\npainting and manipulating digital images. He&#39;s writing programs and <br/>\nexploring other languages and cultures. He&#39;s waterskiing and <br/>\nlearning to use a fire-staff. The other day he spent two hours in <br/>\nthe woodshop making a staff for a guest bc she left hers home. He <br/>\nlearned to use a new powertool in the process. He&#39;s cooking and <br/>\ncleaning without ever being *made* to do so - although he has asked <br/>\nus to remind him to do the dishes. He *wants* to help. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have read that unschooled children tend to be more successful<br/>\n&gt; intrapersonally then conventional schooled children. I for some <br/>\n </span></blockquote>reason<br/>\n<blockquote><span title=\"ireply\"> &gt; believed (and I am sorry for my assumption) that unschooled kids <br/>\n </span></blockquote>mainly<br/>\n<blockquote><span title=\"ireply\"> &gt; associated with other unschooled kids.  <br/>\n<br/>\n </span></blockquote>My kids don&#39;t *know* very many unschooled kids. Mo knows a handful, <br/>\nbut they all live an hour or more away from us. Ray knows no <br/>\nunschoolers his age irl - although he&#39;s met some online. They both <br/>\nspend more time with adults than kids in general. They both have <br/>\nreally great social skills for dealing with adults - including the <br/>\nability to gently deflect adults who are condescending and <br/>\nbelittling to them.<br/>\n<br/>\n Mo&#39;s better at asking for help with social situations she&#39;s not <br/>\ncomfortable exploring on her own, but that may be as much a matter <br/>\nof personality. Ray&#39;s an extrovert, so he tends to dive in and <br/>\nfigure things out in the middle, as it were. That got him into <br/>\ntrouble when he was expected to &quot;be respectful&quot; to adults in <br/>\nparticular, but also in a lot of kid situations where he was <br/>\nexpected to behave in certain ways. Ironically, now that he&#39;s not <br/>\nstruggling against those expectations he&#39;s far more tactful and <br/>\ngracious, even with people he doesn&#39;t like or disagrees with. I&#39;ve <br/>\nseen him &quot;work as a team&quot; with people he barely knows to get a job <br/>\ndone more efficiently, whereas half a year ago he would have done <br/>\nhis passive-agressive best to make a mess of things to &quot;get out of&quot; <br/>\nhaving to help.<br/>\n<br/>\n---Meredith (Mo 5.5, Ray 13)</div>","specialLinks":[]},{"userId":282107434,"authorName":"Chris","from":"&quot;Chris&quot; &lt;chris@...&gt;","profile":"thegoodlife_73","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I was wondering about the future","postDate":"1179935947","msgId":23979,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzMW9jYis5M2pxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGYzOTFjYzE0MDcwNTIzMDY0MGhiNDBjMDJjeWViYzdkNmViZjhjZWVjMDFAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":23978,"nextInTopic":23980,"prevInTime":23978,"nextInTime":23980,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"Robin, These are all natural concerns for those who are first getting interested in unschooling.  One thing that always caught my attention was when somebody","messageBody":"<div id=\"ygrps-yiv-1790159226\">Robin,<br/>\n<br/>\nThese are all natural concerns for those who are first getting<br/>\ninterested in unschooling.  One thing that always caught my attention<br/>\nwas when somebody pointed out to me how artificial the &#39;socializing&#39;<br/>\nat school was.<br/>\n<br/>\nFor some reason we think that having our children associate with lots<br/>\nof children of the same age is &#39;socializing.&#39;  However, that is a far<br/>\ncry from the reality each and every one of us live every day.  A<br/>\nfamily (especially extended families) tends to be a lot more<br/>\nindicative of the way we socialize as adults than school could ever be.  <br/>\n<br/>\nWhat you write here seems to indicate that you understand this<br/>\nintuitively, but maybe it just hasn&#39;t fully sunk in yet (or you don&#39;t<br/>\nbelieve it because you haven&#39;t experienced it):<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have read that unschooled children tend to be more successful<br/>\n&gt; intrapersonally then conventional schooled children.<br/>\n<br/>\n </span></blockquote>In regards to extra curriculars, etc, these don&#39;t have to cost a lot<br/>\nof money.  For starters, simply spending some time in public places or<br/>\ngoing to the park are not only great opportunities to socialize with<br/>\npeople of all ages, but also great unschooling opportunities.<br/>\n<br/>\nYour child will socialize whether you actively try or not.  It might<br/>\nbe when the two of you go to the grocery store or run errands, it<br/>\nmight be when talking with a neighbor or visiting a friend, it could<br/>\nsimply be talking on the phone with extended family (if they&#39;re not<br/>\nlocal).<br/>\n<br/>\nThere&#39;s tons of opportunities to &#39;socialize&#39; with people of all ages<br/>\nif you remove yourself from the assumption/expectation that a school<br/>\nis the best place for children to socialize.<br/>\n<br/>\nUnschooling is very much about thinking outside the box, so use this<br/>\nopportunity to see if you can find solutions that will help you feel<br/>\nenabled to curb your fears and meet your child&#39;s needs more<br/>\neffectively than school does.<br/>\n<br/>\n-Chris</div>","specialLinks":[]},{"userId":235453246,"authorName":"jnaisi","from":"&quot;jnaisi&quot; &lt;robyn.bentley@...&gt;","profile":"jnaisi","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I was wondering about the future","postDate":"1179935224","msgId":23978,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzMW5sbytyaGt0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDUwNzY1OS43OTQ5Ny5xbUB3ZWI1NDQwOS5tYWlsLnlhaG9vLmNvbT4="},"prevInTopic":23977,"nextInTopic":23979,"prevInTime":23977,"nextInTime":23979,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"To answer your question.. NO I didnt have a choice in taking him home.. Well I suppose I did.. I could have tried and been arrested. When a child is found to","messageBody":"<div id=\"ygrps-yiv-1977887937\">To answer your question.. NO I didnt have a choice in taking him<br/>\nhome.. Well I suppose I did.. I could have tried and been arrested. <br/>\nWhen a child is found to have suicidal thoughts or attempts it is<br/>\nconsidered so emergent that the rights of the parents to take that<br/>\nchild home is taken away.  I was told if I tried to remove him I would<br/>\nhave been arrested and my child put in protective custody.  They<br/>\nbelieved that it was safest for the child to be under constant<br/>\npsychiatric care and supervision until the child shows no desires to<br/>\nkill them self.<br/>\n<br/>\nIt broke my heart to leave him there but I knew he was getting the<br/>\nattention from a professional he needed.  We learned he was bipolar<br/>\nand needed medication to control his moods.  he is not on<br/>\nantidepressants.. He is on medication to control his mood swings.<br/>\n<br/>\nWhy is my son in school?<br/>\n<br/>\nWell to be honest up until recently I have never heard of unschooling<br/>\nand only heard of homeschooling from one other family.  <br/>\n<br/>\nI have only known conventional schooling.  I am still trying to<br/>\nunderstand everything that is involved with unschooling and<br/>\nhomeschooling.  It may seem so simple to you but not to someone who<br/>\nhas never heard of it before.  I am trying to get as much information<br/>\nas I can.   I do want to do what is best for my children and I am not<br/>\ngoing to just blindly make decisions.<br/>\n<br/>\nFor the most part I raise my kids with their feelings in mind but<br/>\nthere are certain things I have always believed the parent knew best.<br/>\n It was how I was raised.  To choose to go against that is to question<br/>\nhow I was raised and who I am as a person.  I am doing this but it<br/>\nisnt something I take lightly.<br/>\n<br/>\n<br/>\nRen,<br/>\n<br/>\nI think your wording is a bit harsh for someone who is trying to<br/>\nunderstand this whole world and make a decision to enter it.  I dont<br/>\nknow if that is your intention but that is how it feels.  <br/>\n<br/>\n<br/>\n<br/>\nHow about trying to understand what it was like before making a harsh<br/>\nstatement.  What parent wants their child to suffer at any time.  You<br/>\ndont think you are making your child suffer.  You believe and trust<br/>\nthat you are doing what is best for your child to keep them safe.  <br/>\n<br/>\nI dont know if this is the community for me if you are going to be so<br/>\nrude and harsh about what a parent felt was best for their child.  I<br/>\nam always trying to do what is best for my child.  Sometimes it takes<br/>\ntime to learn what is best.  That is why I am considering bringing him<br/>\nhome.. But that is a big life altering decision that I have to think<br/>\nabout how he would handle it and is it really what is best for him..<br/>\nDo I believe it is best for him?  Yes about 99% sure. there are a<br/>\ncouple things that I am worried about.. That is why I came here.  But<br/>\nI feel like I am looked down upon because I made choices you feel were<br/>\nwrong.  <br/>\n<br/>\nI am trying to understand this way of thinking.  I wanted guidance and<br/>\nunderstanding and support in making a transition.. Not judgement of my<br/>\nfears and concerns.<br/>\n<br/>\nI feel for the most part I have gotten that but from some you are so<br/>\nharsh in your words.</div>","specialLinks":[]},{"userId":117369878,"authorName":"Kelli Traaseth","from":"Kelli Traaseth &lt;kellitraas@...&gt;","profile":"kellitraas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: I was wondering about the future","postDate":"1179934523","msgId":23977,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0MTcyLjY4NTExLnFtQHdlYjUxMTAxLm1haWwucmUyLnlhaG9vLmNvbT4=","inReplyToHeader":"PGYzOTFjYzE0MDcwNTIzMDY0MGhiNDBjMDJjeWViYzdkNmViZjhjZWVjMDFAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":23976,"nextInTopic":23978,"prevInTime":23976,"nextInTime":23978,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"First off I d say Get him out of school! . Then, ***The things Nate refuses to do is writing anything.  He hates to write.  I mean anything.. I dont","messageBody":"<div id=\"ygrps-yiv-1616944572\">First off I&#39;d say &quot;Get him out of school!&quot;.<br/>\n<br/>\nThen,<br/>\n<br/>\n***The things Nate refuses to do is writing anything.  He hates to write.  I<br/>\n mean anything.. I dont necessarily mean stories.  It seems the more the has<br/>\n to do actual writing the more he gets emotionally upset.  ***<br/>\n<br/>\nThen don&#39;t make him write anything.  Help him to do things without the writing. Really.  If he wants to get something accomplished he will do what it takes.  But if he&#39;s had that slammed on him all this time in school it might take a long time for him to want to write again.<br/>\n<br/>\nMy son (14) also hates to write.  He rarely writes.  Sometimes he worries about it, but we talk about and he knows we&#39;ll help him figure out something when the need arises.  I tell him I know he&#39;ll be just fine either way, writing or not writing.  I think for him he worries about doing it so perfectly. From his life pre-unschooling, I truly believe he&#39;s scared to write and then on top of that its not something he likes to do.  (I hate writing too :)  Yet, I&#39;m a very proficient typer. :D  We let him know that there are lots of people out there who scribble their signature,  there are lots of people who rarely write and they are happy and getting through life just fine.<br/>\n<br/>\nTry and help him to see that he&#39;s OK and wonderful in being just who he is.  Even if he doesn&#39;t want to write right now,  that&#39;s OK.<br/>\n<br/>\n<br/>\n***He only really has one chore.  To take out the trash.  I dont enforce really<br/>\n any other chore for him.  I wanted him to have one thing that he is solely<br/>\n responsible for.  It doesnt require alot of attention. It is over quickly.<br/>\n All other chores I have tried with him he takes 5 hours because he is so<br/>\n distracted or in another world.***<br/>\n<br/>\nI&#39;d get rid of chores too.  I hope you read at Joyce&#39;s site.  Its so amazing what a shift in perspective you can get from looking at things from a point of joy instead of a world of &quot;have-tos&quot;.  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.joyfullyrejoycing.com/\">http://www.joyfullyrejoycing.com/</a>  On the right hand side there&#39;s a section about chores.  Please read that and lots of her other stuff too.  It&#39;s brilliant! :)<br/>\n<br/>\nReally, I hope that you can get him out of school now and then spend some time with him, talk and listen and just let him be him.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  Kelli~<br/>\n<br/>\n   <br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://ourjoyfullife.blogspot.com/\">http://ourjoyfullife.blogspot.com/</a>  <br/>\n<br/>\n&quot;Life shrinks or expands in proportion to one&#39;s courage.&quot;  ~Anais Nin<br/>\n<br/>\n<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nGot a little couch potato? <br/>\nCheck out fun summer activities for kids.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8667530,"authorName":"Manisha Kher","from":"Manisha Kher &lt;m_kher@...&gt;","profile":"m_kher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: I was wondering about the future","postDate":"1179933521","msgId":23976,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwNzY1OS43OTQ5Ny5xbUB3ZWI1NDQwOS5tYWlsLnlhaG9vLmNvbT4=","inReplyToHeader":"PGYzOTFjYzE0MDcwNTIzMDY1Nnc3ODk1ZGIyZmhlYTVmMjgzOGU5ZTA5ZThAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":23973,"nextInTopic":23977,"prevInTime":23975,"nextInTime":23977,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"... If I had a kid with a medical problem like this, I would focus on getting the meds in him and drop all other battles. Why is taking his meds such a battle?","messageBody":"<div id=\"ygrps-yiv-1577797528\">--- Robyn Bentley &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robyn.bentley@...\">robyn.bentley@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So I shouldn&#39;t battle him on doing everyday things<br/>\n&gt; like taking his<br/>\n&gt; medication.  Yes there is a choice there but his<br/>\n&gt; choice would yield him one<br/>\n&gt; of two things.  Take his meds and not be depressed<br/>\n&gt; or manic. <br/>\n <br/>\n </span></blockquote>If I had a kid with a medical problem like this, I<br/>\nwould focus on getting the meds in him and drop all<br/>\nother battles. Why is taking his meds such a battle?<br/>\nDo they taste awful? If so, can you somehow make them<br/>\ntaste better? Are you bring his meds to him or asking<br/>\nhim to go take them? <br/>\n<br/>\nI would also bring him home from school and let him<br/>\nspend time doing what he likes. It sounds like between<br/>\ngoing to school, then doing homework and battling over<br/>\ntaking out trash, he&#39;s not getting much playtime.<br/>\n<br/>\nManisha<br/>\n<br/>\n<br/>\n<br/>\n       <br/>\n____________________________________________________________________________________You snooze, you lose. Get messages ASAP with AutoCheck<br/>\nin the all-new Yahoo! Mail Beta.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://advision.webevents.yahoo.com/mailbeta/newmail_html.html\">http://advision.webevents.yahoo.com/mailbeta/newmail_html.html</a></div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: I was wondering about the future","postDate":"1179931222","msgId":23973,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzMjM5OS4yODgwNi5xbUB3ZWI1MzgwNC5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGYzOTFjYzE0MDcwNTIzMDY0MGhiNDBjMDJjeWViYzdkNmViZjhjZWVjMDFAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":23972,"nextInTopic":23976,"prevInTime":23972,"nextInTime":23974,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"The things Nate refuses to do is writing anything. He hates to write. I mean anything.. I dont necessarily mean stories. It seems the more the has to do actual","messageBody":"<div id=\"ygrps-yiv-1706488842\">The things Nate refuses to do is writing anything. He hates to write. I<br/>\nmean anything.. I dont necessarily mean stories. It seems the more the has<br/>\nto do actual writing the more he gets emotionally upset. So he doesnt<br/>\ncomplete any of his work unless you sit there and make sure he finishes it.<br/>\n<br/>\n  ****<br/>\n  My oldest son hated to write in school -- and his handwriting was way below the school&#39;s expectations.  I let it go.  How many men do we know who really have nice handwriting anyway?  The few I know tell horrible stories of they &#39;learned&#39; to write -- most involve nuns and rulers. &lt;g&gt;  <br/>\n   <br/>\n  Now, at 22, my firstborn has the neatest, smallest print writing -- it&#39;s like looking at a book.  Somewhere around 15, he started writing down song lyrics he wanted to remember, and to make it all fit on the page, he had to come up with tiny writing.  <br/>\n   <br/>\n  Andy, who&#39;s almost 11, just began writing all kinds of things -- spontaneously -- after months of saying he &#39;couldn&#39;t write&#39; and asking us to write things for him.  Now, he&#39;s making lists of pokemon characters, schedules for his juggling practice (his idea and schedule, not ours) and more.  Because, now he was ready.  He might keep up with it, or he might leave it by the wayside for the next pursuit, but he knows &#39;how&#39; and will do it when he needs it.<br/>\n   <br/>\n  My point is, writing will come -- when your son is ready and needs it.  <br/>\n   <br/>\n  ****<br/>\n  I have thought about how I would handle this at home. He would learn how to<br/>\ntype.<br/>\n   <br/>\n  Or maybe not -- typing, too, will come when he&#39;s ready and when it meets his needs.  It need not come on anyone else&#39;s agenda.  <br/>\n<br/>\n  *******<br/>\n  <br/>\nI just wanted to say I wasnt implyng that unschooled children wouldnt be<br/>\nable to transition. I think alot if not most of them would do smoothly but<br/>\nhow did they handle the culture shock. I guess I am more worried about how<br/>\nmy Nate would transition into society (not general everyday society but<br/>\nadult/work society) where someone isnt there to make sure he is taking his<br/>\nmedication, bathing, eating right, sleeping enough, etc.<br/>\n<br/>\n  He&#39;s medicated?  For behavioral/ADD issues?  Those medications can make a huge impact -- and not a good one, IMO -- on kids.  From the school problems you&#39;ve shared, and your concerns about his &#39;distractibility&#39; I&#39;m beginning to see a little boy with a lot of impositions on his life and spirit.  All those impositions lead to frustration, anger and resentment on the part of any person, especially a small child who has to feel powerless against the system that&#39;s telling there&#39;s something &#39;wrong&#39; with him.  Poor little guy!<br/>\n   <br/>\n  *****<br/>\n   <br/>\n  I have my first meeting to see how the school responds to the services Nate needs. Should they give me a really hard time I will just forgo the doctor&#39;s recommendation and bring him home for schooling. I know he would be successful at home with so much but I am worried about him developing socially. I dont live in an area with alot of extra curricular activities.<br/>\nI would have to travel a bit. We dont have any extra money so I am limited there. (cost of travel etc). So that is the only thing I am worried about. Would I be stunting his social development. Granted he isnt getting much at school other then some teasing.<br/>\n<br/>\n  ****<br/>\n  I&#39;ve been down the testing road -- with my oldest son when he was 8.  It was awful, and they didn&#39;t even find anything to label Will with.  As to whether they give you a &#39;really hard time&#39; -- my concern would be what kind of time are they giving Nate?  And how are you adding to his burden by being their agent for coercion of your son?  <br/>\n   <br/>\n  It sounds to me like you know he&#39;d do better at home.  Go with your instincts -- bring him home, and let him blossom.  I&#39;d also re-visit the meds situation, too.  I know that if we had Andy in school, they&#39;d be pushing meds -- heck, he&#39;d need meds just to be in school!  It wouldnt&#39; be the right thing for Andy&#39;s soul.  He is just perfectly wonderful, exactly as he is right now.  School isn&#39;t a place that could embrace or appreciate Andy for who he is, and the constant stuffing of his light would eat at his soul, in a thousand ways.  <br/>\n   <br/>\n  *****<br/>\n  I am sorry I am just rambling. I am kinda in that mood today. It has been a long road with Nate. I love him so much and my heart aches to see him have it so very hard compared to his peers. Even when he is playing with his cousin you can see the difference in their maturities. Nate always looks so hurt and confused.<br/>\n<br/>\n  ****<br/>\n  Make it your goal to relieve his hurt and confusion.  Find ways to celebrate his shine, his unique gifts to and from the universe.  <br/>\n   <br/>\n  Have you been over to the Shine with unschooling list?  Not because you&#39;ve described Nate as &#39;special&#39; (there&#39;s a confusion that Shine is about specially-diagnosed kids) but because over at Shine <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/shinewithunschooling.\">http://groups.yahoo.com/group/shinewithunschooling.</a> you&#39;ll find lots of wonderful stories of how all kids shine with unschooling.  It&#39;s a wonderful place to find and celebrate Nate&#39;s -- and your own -- shine.<br/>\n   <br/>\n  Sylvia<br/>\n<br/>\n<br/>\n <br/>\n---------------------------------<br/>\nNeed Mail bonding?<br/>\nGo to the Yahoo! Mail Q&A for great tips from Yahoo! Answers users.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":214857126,"authorName":"kristenhendricks55","from":"&quot;kristenhendricks55&quot; &lt;kristenhendricks55@...&gt;","profile":"kristenhendricks55","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I was wondering about the future","postDate":"1179931158","msgId":23972,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzMWptbStzYXQwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGYzOTFjYzE0MDcwNTIzMDY1Nnc3ODk1ZGIyZmhlYTVmMjgzOGU5ZTA5ZThAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":23968,"nextInTopic":23973,"prevInTime":23971,"nextInTime":23973,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"I had to go home for 3 months without my boy because he wanted to die. It was the worst 3 months of my entire existence. I didn t want to go home without him","messageBody":"<div id=\"ygrps-yiv-2005069152\">I had to go home for 3 months without my boy because he wanted to <br/>\ndie. It<br/>\nwas the worst 3 months of my entire existence. I didn&#39;t want to go <br/>\nhome<br/>\nwithout him but I did it because it was what HAD to be done for him <br/>\nto get<br/>\nbetter. Yes it was a choice.. everything is a choice..<br/>\n<br/>\n********<br/>\n<br/>\nWhat if he died while he was there? Would you have felt okay about <br/>\nleaving him there alone without you or your support? WHY did you have <br/>\nto leave? Did someone tell you that you had to leave? Or was it your <br/>\nchoice? I would have to guess that if I were depressed and the person <br/>\nthat should be there to help went home without me. I would probably <br/>\nwant to give up too. Just like you said... everything is a choice. <br/>\nWanting to die is a choice, too. What if you could change his mind? I <br/>\nknow you said you have him on antidepressants... but also.. what <br/>\nabout just celebrating the fact that hes HERE with you and he&#39;s not <br/>\nDEAD. What about instead of talking about how you think about him <br/>\nbeing dead all the time... why dont you think about him being alive <br/>\nand how great it is that hes here today and you still have him. Why <br/>\nnot just go do something crazy/outrageous/exciting... something HE <br/>\nwould really enjoy just because.. to show him that you are glad he&#39;s <br/>\nhere and you wouldnt have had that fun without him.<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Robyn Bentley&quot; <br/>\n&lt;robyn.bentley@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; So I shouldn&#39;t battle him on doing everyday things like taking his<br/>\n&gt; medication.  Yes there is a choice there but his choice would yield <br/>\n </span></blockquote>him one<br/>\n<blockquote><span title=\"ireply\"> &gt; of two things.  Take his meds and not be depressed or manic.  Not <br/>\n </span></blockquote>get into<br/>\n<blockquote><span title=\"ireply\"> &gt; such a dark place that he thinks of death all the time.  or not <br/>\n </span></blockquote>take his<br/>\n<blockquote><span title=\"ireply\"> &gt; meds and cycle and have overwhelming irrational fears constantly <br/>\n </span></blockquote>coming at<br/>\n<blockquote><span title=\"ireply\"> &gt; him.  Not be able to sleep because his mind is racing so fast it <br/>\n </span></blockquote>makes him<br/>\n<blockquote><span title=\"ireply\"> &gt; scream for it to stop.  These are things that despite whether you <br/>\n </span></blockquote>really<br/>\n<blockquote><span title=\"ireply\"> &gt; want to or not you have to do.. Because the alternative is so <br/>\n </span></blockquote>horrible.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I had to go home for 3 months without my boy because he wanted to <br/>\n </span></blockquote>die.  It<br/>\n<blockquote><span title=\"ireply\"> &gt; was the worst 3 months of my entire existence.  I didn&#39;t want to go <br/>\n </span></blockquote>home<br/>\n<blockquote><span title=\"ireply\"> &gt; without him but I did it because it was what HAD to be done for him <br/>\n </span></blockquote>to get<br/>\n<blockquote><span title=\"ireply\"> &gt; better.  Yes it was a choice.. everything is a choice..<br/>\n&gt; <br/>\n&gt; So I think about what if my son was dead a lot.. because he has <br/>\n </span></blockquote>wanted to be<br/>\n<blockquote><span title=\"ireply\"> &gt; dead.<br/>\n&gt; <br/>\n&gt; If I allowed my son to do what he wanted to do he would never get <br/>\n </span></blockquote>out of bed<br/>\n<blockquote><span title=\"ireply\"> &gt; because of his fears.  He needs to face his fears and learn he is <br/>\n </span></blockquote>stronger<br/>\n<blockquote><span title=\"ireply\"> &gt; then they are.  I should give him the choice to never leave the <br/>\n </span></blockquote>house for<br/>\n<blockquote><span title=\"ireply\"> &gt; fears of things outdoors?<br/>\n&gt; <br/>\n&gt; My son has instant gratification needs and if he doesn&#39;t get it <br/>\n </span></blockquote>right or<br/>\n<blockquote><span title=\"ireply\"> &gt; becomes the best at it when he first does it he quits.  He has a <br/>\n </span></blockquote>major<br/>\n<blockquote><span title=\"ireply\"> &gt; emotional breakdown over it.  I should let him just give up on <br/>\n </span></blockquote>everything<br/>\n<blockquote><span title=\"ireply\"> &gt; that is a challenge because he isn&#39;t the best at it?<br/>\n&gt; <br/>\n&gt; I am very encouraging but insistent.  I want him to complete the <br/>\n </span></blockquote>things he<br/>\n<blockquote><span title=\"ireply\"> &gt; starts.  I want him to keep trying and learn through repetition you <br/>\n </span></blockquote>can<br/>\n<blockquote><span title=\"qreply\"> &gt; become just as good and sometimes better then others.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I was wondering about the future","postDate":"1179930641","msgId":23968,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzMWo2aCtqZWxyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGYzOTFjYzE0MDcwNTIzMDY1Nnc3ODk1ZGIyZmhlYTVmMjgzOGU5ZTA5ZThAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":23967,"nextInTopic":23972,"prevInTime":23967,"nextInTime":23969,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"~Yes there is a choice there but his choice would yield him one of two things. Take his meds and not be depressed or manic. ~ Maybe he d be less depressed if","messageBody":"<div id=\"ygrps-yiv-245858093\">~Yes there is a choice there but his choice would yield him one<br/>\nof two things. Take his meds and not be depressed or manic. ~<br/>\n<br/>\n<br/>\nMaybe he&#39;d be less depressed if he was being celebrated and not forced<br/>\ninto a box every day of his life. Even if he needs the meds, why make<br/>\nanything else a battle. That might be the only important one....the<br/>\nrest of what you listed is ridiculous to battle over.<br/>\n<br/>\nPlease explain why this child is in school??? I would think that is<br/>\ndepressing him far more than anything. Schools are not equipped to<br/>\nnourish the spirit of a child.  Why is he being subjected to that damage??<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I was wondering about the future","postDate":"1179930439","msgId":23967,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzMWowNytxZWxmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGYzOTFjYzE0MDcwNTIzMDY0MGhiNDBjMDJjeWViYzdkNmViZjhjZWVjMDFAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":23966,"nextInTopic":23968,"prevInTime":23966,"nextInTime":23968,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"~~Nate always looks so hurt and confused.~~ So put him in situations and around people that help him look and feel strong and perfect. Ren ","messageBody":"<div id=\"ygrps-yiv-1894643025\">~~Nate always<br/>\nlooks so hurt and confused.~~<br/>\n<br/>\nSo put him in situations and around people that help him look and feel<br/>\nstrong and perfect.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I was wondering about the future","postDate":"1179930394","msgId":23966,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzMWl1cStzNnFuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGYzOTFjYzE0MDcwNTIzMDY0MGhiNDBjMDJjeWViYzdkNmViZjhjZWVjMDFAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":23963,"nextInTopic":23967,"prevInTime":23965,"nextInTime":23967,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"~~It seems the more the has to do actual writing the more he gets emotionally upset. So he doesnt complete any of his work unless you sit there and make sure","messageBody":"<div id=\"ygrps-yiv-563544029\">~~It seems the more the has<br/>\nto do actual writing the more he gets emotionally upset. So he doesnt<br/>\ncomplete any of his work unless you sit there and make sure he<br/>\nfinishes it.~~<br/>\n<br/>\n<br/>\nWhy would you aid and assist the damage the schools are inflicting on<br/>\nthis child???? WHY?  If he doesn&#39;t do the work, then he is choosing<br/>\nnot to do the work? Why would it matter if he chooses to ignore work<br/>\nthat isn&#39;t beneficial for him nor is it teaching  him anything but a<br/>\ndistaste for learning. ugh.<br/>\n<br/>\nLet him choose his school experiences (why is he in school anyway???),<br/>\nlet him own that experience and choose what he gets from it. If he<br/>\nfails, that is NOT a reflection of who he is or how intelligent he is.<br/>\nCounter the school damage and focus on what he LOVES, not what he<br/>\nCAN&#39;T do!!!<br/>\n<br/>\nIt sounds like this child has been seen as a failure on many levels.<br/>\nHe needs to shine in someone&#39;s eyes. He needs to have his strengths<br/>\nfocused on, NOT his weaknesses. He needs to know he is perfect and<br/>\nbeautiful right NOW.  <br/>\n<br/>\nTake out the trash for him and say &quot;I know how you hate taking out the<br/>\ntrash sweetheart, so I did it for you today&quot; and then do it again<br/>\ntomorrow!! Does the trash matter more than your son&#39;s spirit...because<br/>\nhe&#39;s being crushed over really meaningless crap.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":235453246,"authorName":"Robyn Bentley","from":"&quot;Robyn Bentley&quot; &lt;robyn.bentley@...&gt;","profile":"jnaisi","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: I was wondering about the future","postDate":"1179928603","msgId":23963,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzOTFjYzE0MDcwNTIzMDY1Nnc3ODk1ZGIyZmhlYTVmMjgzOGU5ZTA5ZThAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":23959,"nextInTopic":23966,"prevInTime":23962,"nextInTime":23964,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"So I shouldn t battle him on doing everyday things like taking his medication.  Yes there is a choice there but his choice would yield him one of two things.","messageBody":"<div id=\"ygrps-yiv-655854545\">So I shouldn&#39;t battle him on doing everyday things like taking his<br/>\nmedication.  Yes there is a choice there but his choice would yield him one<br/>\nof two things.  Take his meds and not be depressed or manic.  Not get into<br/>\nsuch a dark place that he thinks of death all the time.  or not take his<br/>\nmeds and cycle and have overwhelming irrational fears constantly coming at<br/>\nhim.  Not be able to sleep because his mind is racing so fast it makes him<br/>\nscream for it to stop.  These are things that despite whether you really<br/>\nwant to or not you have to do.. Because the alternative is so horrible.<br/>\n<br/>\nI had to go home for 3 months without my boy because he wanted to die.  It<br/>\nwas the worst 3 months of my entire existence.  I didn&#39;t want to go home<br/>\nwithout him but I did it because it was what HAD to be done for him to get<br/>\nbetter.  Yes it was a choice.. everything is a choice..<br/>\n<br/>\nSo I think about what if my son was dead a lot.. because he has wanted to be<br/>\ndead.<br/>\n<br/>\nIf I allowed my son to do what he wanted to do he would never get out of bed<br/>\nbecause of his fears.  He needs to face his fears and learn he is stronger<br/>\nthen they are.  I should give him the choice to never leave the house for<br/>\nfears of things outdoors?<br/>\n<br/>\nMy son has instant gratification needs and if he doesn&#39;t get it right or<br/>\nbecomes the best at it when he first does it he quits.  He has a major<br/>\nemotional breakdown over it.  I should let him just give up on everything<br/>\nthat is a challenge because he isn&#39;t the best at it?<br/>\n<br/>\nI am very encouraging but insistent.  I want him to complete the things he<br/>\nstarts.  I want him to keep trying and learn through repetition you can<br/>\nbecome just as good and sometimes better then others.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":235453246,"authorName":"Robyn Bentley","from":"&quot;Robyn Bentley&quot; &lt;robyn.bentley@...&gt;","profile":"jnaisi","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: I was wondering about the future","postDate":"1179927648","msgId":23959,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzOTFjYzE0MDcwNTIzMDY0MGhiNDBjMDJjeWViYzdkNmViZjhjZWVjMDFAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":23948,"nextInTopic":23963,"prevInTime":23958,"nextInTime":23960,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"The things Nate refuses to do is writing anything.  He hates to write.  I mean anything.. I dont necessarily mean stories.  It seems the more the has to do","messageBody":"<div id=\"ygrps-yiv-166002855\">The things Nate refuses to do is writing anything.  He hates to write.  I<br/>\nmean anything.. I dont necessarily mean stories.  It seems the more the has<br/>\nto do actual writing the more he gets emotionally upset.  So he doesnt<br/>\ncomplete any of his work unless you sit there and make sure he finishes it.<br/>\n<br/>\nI have thought about how I would handle this at home.  He would learn how to<br/>\ntype.<br/>\n<br/>\nHe has had issues with hand writing since he was first ever in school.  He<br/>\nhad a very very negative experience with a teacher and I believe it has left<br/>\na permanent mark on him.<br/>\n<br/>\nHe will come home from school and whine about how much he had to write and<br/>\nhow his hand hurts.  I have spoken to doctors about it but nothing was ever<br/>\nfound.<br/>\n<br/>\nHe only really has one chore.  To take out the trash.  I dont enforce really<br/>\nany other chore for him.  I wanted him to have one thing that he is solely<br/>\nresponsible for.  It doesnt require alot of attention. It is over quickly.<br/>\nAll other chores I have tried with him he takes 5 hours because he is so<br/>\ndistracted or in another world.<br/>\n<br/>\nIt is becoming quite an issue between my children too.  My daughter does her<br/>\nchores quickly and completely where as Nate doesnt finish anything.. Well<br/>\nunless he is building something with Legos or making paper airplanes.<br/>\n<br/>\nI just wanted to say I wasnt implyng that unschooled children wouldnt be<br/>\nable to transition.  I think alot if not most of them would do smoothly but<br/>\nhow did they handle the culture shock.  I guess I am more worried about how<br/>\nmy Nate would transition into society (not general everyday society but<br/>\nadult/work society) where someone isnt there to make sure he is taking his<br/>\nmedication, bathing, eating right, sleeping enough, etc.<br/>\n<br/>\nI have read that unschooled children tend to be more successful<br/>\nintrapersonally then conventional schooled children. I for some reason<br/>\nbelieved (and I am sorry for my assumption) that unschooled kids mainly<br/>\nassociated with other unschooled kids.  Not that they never associated with<br/>\nothers but I meant primarily.  I think I got that idea from my aunt-in-law<br/>\nwho homeschools and her girls mainly associate with a specific grouping of<br/>\npeople.<br/>\n<br/>\nI have my first meeting to see how the school responds to the services Nate<br/>\nneeds.  Should they give me a really hard time I will just forgo the<br/>\ndoctor&#39;s recommendation and bring him home for schooling.  I know he would<br/>\nbe successful at home with so much but I am worried about him developing<br/>\nsocially.  I dont live in an area with alot of extra curricular activities.<br/>\nI would have to travel a bit.  We dont have any extra money so I am limited<br/>\nthere. (cost of travel etc).  So that is the only thing I am worried about.<br/>\nWould I be stunting his social development.  Granted he isnt getting much at<br/>\nschool other then some teasing.<br/>\n<br/>\nI am sorry I am just rambling.  I am kinda in that mood today.  It has been<br/>\na long road with Nate.  I love him so much and my heart aches to see him<br/>\nhave it so very hard compared to his peers.  Even when he is playing with<br/>\nhis cousin you can see the difference in their maturities.  Nate always<br/>\nlooks so hurt and confused.<br/>\n<br/>\nSorry again for rambling.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":285628717,"authorName":"thehomeopathicway","from":"&quot;thehomeopathicway&quot; &lt;thehomeopathicway@...&gt;","profile":"thehomeopathicway","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I was wondering about the future","postDate":"1179894971","msgId":23948,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzMGdicitoNnRyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwNmIwMWM3OWNiMiRlZjhhYzdmMCQwMjAxYThjMEBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":23943,"nextInTopic":23959,"prevInTime":23947,"nextInTime":23949,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"... prisoners at Abu Ghraib they said they were just doing their job. When Adolf Eichmann was on trial for crimes against humanity he insisted he was only","messageBody":"<div id=\"ygrps-yiv-2018959872\"><blockquote><span title=\"ireply\">&gt; When the young military people were busted over the treatment of <br/>\n </span></blockquote>prisoners at Abu Ghraib they said they were &quot;just doing their job.&quot;   <br/>\nWhen Adolf Eichmann was on trial for crimes against humanity he <br/>\ninsisted he was only following orders.  <br/>\n<br/>\n<br/>\nThanks so much for saying this!  It was the first thing I thought of <br/>\nwhen I read the post questioning the future abilities of unschoolers.  <br/>\nIMO, this &#39;factory worker - don&#39;t question authority&#39; mentality is what <br/>\nis truly the problem with our society today.  Thank goodness for the <br/>\nindependent thinkers who will always question before they act.</div>","specialLinks":[]},{"userId":252551372,"authorName":"Su Penn","from":"Su Penn &lt;supenn@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] I was wondering about the future","postDate":"1179889803","msgId":23943,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZENDhDOURDLTNEN0QtNERGNS1CMzQ5LTdEMzI4NUIxMUFFMEBkaWVyYXVlci5uZXQ+","inReplyToHeader":"PGYydmVhNitpcnU4QGVHcm91cHMuY29tPg==","referencesHeader":"PGYydmVhNitpcnU4QGVHcm91cHMuY29tPg=="},"prevInTopic":23940,"nextInTopic":23948,"prevInTime":23942,"nextInTime":23944,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"... Why do so many people have this image that when you take a job you give up all autonomy to some kind of overload and have to do whatever they say without","messageBody":"<div id=\"ygrps-yiv-1293874003\">On May 22, 2007, at 2:55 PM, jnaisi wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; With the way you are raising you child(ren), do you feel they will<br/>\n&gt; handle society well.  What I mean is when you go out to work you are<br/>\n&gt; not asked how you feel about something..<br/>\n<br/>\n </span></blockquote>Why do so many people have this image that when you take a job you  <br/>\ngive up all autonomy to some kind of overload and have to do whatever  <br/>\nthey say without any input? The only job I ever had that was really  <br/>\nlike that was when I worked in a Revlon packaging plant, on the  <br/>\nassembly line. And even then, I got to choose whether to take that  <br/>\njob or another one. So did the other people I worked with--I remember  <br/>\none day, on a line that wasn&#39;t working right, with more and more  <br/>\nmanagement coming along and treating us like we were stupid and not  <br/>\nlistening when we told them what the problem was, about half the  <br/>\npeople left for lunch and just never came back.<br/>\n<br/>\nEven when I worked fast food, I had input as to whether I worked the  <br/>\ndrive-thru or the front counter, whether I preferred to open at 5 in  <br/>\nthe morning or stay until 2 a. m. to close, and so on. I&#39;ve had  <br/>\ncrappy jobs and left them. I&#39;ve had crappy jobs and stayed with them  <br/>\nbecause what I got from them outweighed the trouble and stress.<br/>\n<br/>\nIn my experience, K-12 schooling is the only place I&#39;ve ever been  <br/>\nsubject to that kind of complete top-down authority, and had no  <br/>\nrecourse to either change the situation or remove myself from it.<br/>\n<br/>\nSu</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I was wondering about the future","postDate":"1179888411","msgId":23940,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzMDl1citocHJvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGYzOTFjYzE0MDcwNTIyMTU1M3MzNTE5ZTMwOG85NWUzMTMzZmRmODVlODQzQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":23939,"nextInTopic":23943,"prevInTime":23939,"nextInTime":23941,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"~~ I have been telling my children that there will always be things in your life that you do not want to do nor will you like but will have to be done.~~ Why","messageBody":"<div id=\"ygrps-yiv-1324236779\">~~<br/>\nI have been telling my children that there will always be things in your<br/>\nlife that you do not want to do nor will you like but will have to be<br/>\ndone.~~<br/>\n<br/>\nWhy would you want them to believe that?  I do nothing in my life that<br/>\nisn&#39;t a choice. Some activities I don&#39;t care for, but dislike the<br/>\nconsequences so I choose it anyway. It&#39;s still a choice. Nothing HAS<br/>\nto be done. <br/>\n<br/>\nI&#39;d rather that my children see all of life as a choice. Empower them,<br/>\ndon&#39;t try to instill feelings of futility. Life is a grand<br/>\nadventure...make it so.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I was wondering about the future","postDate":"1179888300","msgId":23939,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzMDlyYythNXRsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGMzYy4xNDYwZDU1MS4zMzg0ZDVhZUBhb2wuY29tPg=="},"prevInTopic":23934,"nextInTopic":23940,"prevInTime":23938,"nextInTime":23940,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"~~There are things daily that my oldest refuses to do because he doesnt want to or like to do it. It has been one of our biggest battles.~~ So quit battling","messageBody":"<div id=\"ygrps-yiv-1932756192\">~~There are things daily that my oldest refuses to do because he<br/>\ndoesnt want to or like to do it. It has been one of our biggest battles.~~<br/>\n<br/>\nSo quit battling him. What if your dh tried to make you do things you<br/>\ndidn&#39;t want to do? How would that affect your relationship? How do you<br/>\nthink it&#39;s building trust to force him to do things he doesn&#39;t want to<br/>\ndo rather than being his partner?  If he died next week, would the<br/>\nbattles have been worth the cost to your relationship?<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":145246818,"authorName":"Christy Mahoney","from":"&quot;Christy Mahoney&quot; &lt;unschooling1@...&gt;","profile":"unschooling1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I was wondering about the future","postDate":"1179877712","msgId":23923,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYydnZnZytyODQ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGYzOTFjYzE0MDcwNTIyMTU1M3MzNTE5ZTMwOG85NWUzMTMzZmRmODVlODQzQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":23922,"nextInTopic":23932,"prevInTime":23922,"nextInTime":23924,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"There have been many many threads about have tos .  I m sure you can find a lot of stuff if you search under chores in the archives or at other sites. But","messageBody":"<div id=\"ygrps-yiv-315387341\">There have been many many threads about &quot;have tos&quot;.  I&#39;m sure you <br/>\ncan find a lot of stuff if you search under &quot;chores&quot; in the archives <br/>\nor at other sites.<br/>\n<br/>\nBut it really comes down to the fact that all of these things are <br/>\nstill choices.  He can choose to do the chores or not to do them.  <br/>\nThat is his choice.  And it is your choice to respond to his <br/>\nchoice.  You can choose to punish, discuss, ignore, whatever.  It is <br/>\nstill your choice.  <br/>\n<br/>\nAdults and kids certainly do choose to do things that they don&#39;t <br/>\nparticularly enjoy.  They may choose to do something in order to <br/>\navoid a punishment or negative result, or perhaps to help someone <br/>\nthey love.  I think it&#39;s super important to model making choices, <br/>\neven with chores.  <br/>\n<br/>\nGotta go,<br/>\nChristy M.<br/>\n<br/>\n<br/>\n<br/>\n  --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Robyn Bentley&quot; <br/>\n&lt;robyn.bentley@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I have been telling my children that there will always be things <br/>\n </span></blockquote>in your<br/>\n<blockquote><span title=\"ireply\"> &gt; life that you do not want to do nor will you like but will have to <br/>\n </span></blockquote>be done.<br/>\n<blockquote><span title=\"ireply\"> &gt; There are things  daily that my oldest refuses to do because he <br/>\n </span></blockquote>doesnt want<br/>\n<blockquote><span title=\"ireply\"> &gt; to or like to do it.  It has been one of our biggest battles.<br/>\n&gt; <br/>\n&gt; Mostly it will be his homework assignments or the work they are <br/>\n </span></blockquote>doing in<br/>\n<blockquote><span title=\"ireply\"> &gt; school.  A lot of time it is his chores.<br/>\n&gt; <br/>\n&gt; These are things that still have to be done.  Granted when <br/>\n </span></blockquote>unschooling you<br/>\n<blockquote><span title=\"ireply\"> &gt; have the option to alter things to make them more fun or <br/>\n </span></blockquote>acceptable to your<br/>\n<blockquote><span title=\"ireply\"> &gt; child but not in conventional schooling.  Which is where he is <br/>\n </span></blockquote>currently.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I like a lot of what you say I really do.. I can see all the <br/>\n </span></blockquote>positives of<br/>\n<blockquote><span title=\"ireply\"> &gt; it.  However I have never dealt with so little actual structure and<br/>\n&gt; routine.  It is so foreign to me.  It is hard for me to wrap my <br/>\n </span></blockquote>mind around.<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; I am sure if I just did it then it would make sense to me.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":77669557,"authorName":"gailbrocop@aol.com","from":"gailbrocop@...","profile":"gailbrocop","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: I was wondering about the future","postDate":"1179876457","msgId":23921,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ0NS45NDMwZWFjLjMzODRkNjY5QGFvbC5jb20+"},"prevInTopic":23920,"nextInTopic":23922,"prevInTime":23920,"nextInTime":23922,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/22/2007 6:54:24 P.M. Eastern Daylight Time,  robyn.b entley@gmail.com writes: Mostly  it will be his homework assignments or the work they","messageBody":"<div id=\"ygrps-yiv-2025476809\">In a message dated 5/22/2007 6:54:24 P.M. Eastern Daylight Time,  robyn.b<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:entley@...\">entley@...</a> writes:<br/>\n<br/>\nMostly  it will be his homework assignments or the work they are doing in<br/>\nschool. A  lot of time it is his chores.<br/>\n<br/>\nThese are things that still have to be  done. Granted when unschooling you<br/>\nhave the option to alter things to make  them more fun or acceptable to your<br/>\nchild but not in conventional  schooling. Which is where he is currently.<br/>\n______<br/>\nI didn&#39;t read this post before I responded and didn&#39;t realize your child  was <br/>\nin school.  So I guess my question would still be along the same  lines.  <br/>\nWhat chores?  And what would happen if they didn&#39;t get  done?<br/>\n <br/>\nGail<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n************************************** See what&#39;s free at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com\">http://www.aol.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":77669557,"authorName":"gailbrocop@aol.com","from":"gailbrocop@...","profile":"gailbrocop","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: I was wondering about the future","postDate":"1179876270","msgId":23922,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMzYy4xNDYwZDU1MS4zMzg0ZDVhZUBhb2wuY29tPg=="},"prevInTopic":23921,"nextInTopic":23923,"prevInTime":23921,"nextInTime":23923,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/22/2007 6:55:40 P.M. Eastern Daylight Time, robyn.bentley@gmail.com writes: I have  been telling my children that there will always be","messageBody":"<div id=\"ygrps-yiv-159130161\">In a message dated 5/22/2007 6:55:40 P.M. Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robyn.bentley@...\">robyn.bentley@...</a> writes:<br/>\n<br/>\nI have  been telling my children that there will always be things in your<br/>\nlife that  you do not want to do nor will you like but will have to be done.<br/>\nThere are  things daily that my oldest refuses to do because he doesnt want<br/>\nto or like  to do it. It has been one of our biggest battles.<br/>\n<br/>\n<br/>\n<br/>\n______<br/>\n <br/>\nWhat exactly do you think your child needs to do that he doesn&#39;t want or  <br/>\nlike to do?  Would you mind sharing some concrete examples?<br/>\n <br/>\nI used to think that there were just so many things we had to do.  A  huge <br/>\npart of my living a joyful life was the realization that there are really  few <br/>\nthings that we &quot;have&quot; to do.  It was a huge leap for me to realize that  not <br/>\ndoing something that I thought had to be done really didn&#39;t have the huge  <br/>\nconsequences that I imagined. Now, I know I can choose to do those  things <br/>\nhappily.......or not do them at all.<br/>\n <br/>\nSome things that used to be on my list were things like showering, washing  <br/>\ndishes, laundry, balancing my checkbook, going to the grocery store, getting  <br/>\ndressed......I&#39;m not saying that my kids and I don&#39;t do those things but  <br/>\nsometimes we just don&#39;t.  Nothing bad happens.   Really.   Sometimes, really cool <br/>\nthings happen.<br/>\n <br/>\nI found that examining those notions of mine and actually seeing what does  <br/>\nhappen has opened up a whole new world for us.<br/>\n <br/>\nWhat are some of the things you think need to be done?<br/>\n <br/>\nGail<br/>\n<br/>\n<br/>\n<br/>\n************************************** See what&#39;s free at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com\">http://www.aol.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":235453246,"authorName":"Robyn Bentley","from":"&quot;Robyn Bentley&quot; &lt;robyn.bentley@...&gt;","profile":"jnaisi","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: I was wondering about the future","postDate":"1179874401","msgId":23920,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzOTFjYzE0MDcwNTIyMTU1M3MzNTE5ZTMwOG85NWUzMTMzZmRmODVlODQzQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":23918,"nextInTopic":23921,"prevInTime":23919,"nextInTime":23921,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"I have been telling my children that there will always be things in your life that you do not want to do nor will you like but will have to be done. There are","messageBody":"<div id=\"ygrps-yiv-1417942010\">I have been telling my children that there will always be things in your<br/>\nlife that you do not want to do nor will you like but will have to be done.<br/>\nThere are things  daily that my oldest refuses to do because he doesnt want<br/>\nto or like to do it.  It has been one of our biggest battles.<br/>\n<br/>\nMostly it will be his homework assignments or the work they are doing in<br/>\nschool.  A lot of time it is his chores.<br/>\n<br/>\nThese are things that still have to be done.  Granted when unschooling you<br/>\nhave the option to alter things to make them more fun or acceptable to your<br/>\nchild but not in conventional schooling.  Which is where he is currently.<br/>\n<br/>\nI like a lot of what you say I really do.. I can see all the positives of<br/>\nit.  However I have never dealt with so little actual structure and<br/>\nroutine.  It is so foreign to me.  It is hard for me to wrap my mind around.<br/>\n<br/>\nI am sure if I just did it then it would make sense to me.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] I was wondering about the future","postDate":"1179871576","msgId":23918,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUzMkNFMjhGLTVDM0ItNEQyMS05NTk5LThBQ0RBNUY2MTkxNkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGYydmVhNitpcnU4QGVHcm91cHMuY29tPg==","referencesHeader":"PGYydmVhNitpcnU4QGVHcm91cHMuY29tPg=="},"prevInTopic":23915,"nextInTopic":23920,"prevInTime":23917,"nextInTime":23919,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"... Do you honestly think your kids won t be able to tell the difference between someone asking them to do a favor and an assignment for a job that they ve","messageBody":"<div id=\"ygrps-yiv-599134807\">On May 22, 2007, at 2:55 PM, jnaisi wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What I mean is when you go out to work you are<br/>\n&gt; not asked how you feel about something.. Nor are you asked if you want<br/>\n&gt; to complete a particular task etc.<br/>\n<br/>\n </span></blockquote>Do you honestly think your kids won&#39;t be able to tell the difference  <br/>\nbetween someone asking them to do a favor and an assignment for a job  <br/>\nthat they&#39;ve chosen to take?<br/>\n<br/>\nDo you think they won&#39;t grasp the concept that they&#39;ve *chosen* to  <br/>\nsign on to do a particular job and are being paid to do what&#39;s asked  <br/>\nof them?<br/>\n<br/>\nOn the surface asking a child to do something looks like a boss  <br/>\nasking an employee to do something. But the underlying motivations  <br/>\nare completely different. Children *know* this and it confuses them  <br/>\nwhen parents try to treat the situations the same and get upset that  <br/>\nkids aren&#39;t treating them the same.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do you feel they will get a shock when others do not treat them the<br/>\n&gt; way they are used to being treated at home?<br/>\n<br/>\n </span></blockquote>Unlike school kids my daughter has been out in the world  <br/>\nextensively ;-) She has friends who are unschooled and homeschooled  <br/>\nand schooled. She has friends who are 10-89, She&#39;s also seen the  <br/>\nworld on TV :-) And read about it in books!<br/>\n<br/>\nShe isn&#39;t living in a bubble. She&#39;s been exposed to people who treat  <br/>\neach other differently than she is treated.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have been raising my son that in society when you are given a task<br/>\n&gt; (at work or in college etc) you are expected to complete it despite<br/>\n&gt; your feelings on it.<br/>\n<br/>\n </span></blockquote>It *really* isn&#39;t brain surgery. It&#39;s not a concept that needs  <br/>\ndrilled into them.<br/>\n<br/>\nPlus he knows -- perhaps subconsciously -- that there&#39;s a huge  <br/>\ndifference between a job imposed on him and a job he has willingly  <br/>\ntaken that he *wants* to do. He *will* treat being asked to interrupt  <br/>\nwhat&#39;s important to him to do a favor to someone else differently  <br/>\nthan a task that&#39;s personally meaningful to him that he&#39;s *chosen* to  <br/>\ndo -- like beating a video game level, getting a jump right on a  <br/>\nskateboard.<br/>\n<br/>\nI think one of the biggest flubs parents can make is to look at who  <br/>\ntheir child is at the moment and assume that unless what are  <br/>\nperceived as flaws are trained out of them that they&#39;ll be exactly as  <br/>\nthey are as adults.<br/>\n<br/>\nWhen your son couldn&#39;t walk, did you give him walking lessons,  <br/>\nfearing he might never walk? When he couldn&#39;t say milk properly, did  <br/>\nyou immediately start lessons to insure that he didn&#39;t spend the rest  <br/>\nof his life saying &quot;gook&quot;?<br/>\n<br/>\nChildren learn loads better if we trust that they can learn when it&#39;s  <br/>\nimportant to them and that right now they&#39;re doing the best they can  <br/>\nwith the information, skills and needs they have right now.<br/>\n<br/>\nKids don&#39;t learn responsibility by having jobs imposed on them and  <br/>\nhaving someone hover over them to judge how well they do. How well  <br/>\nwould you learn if your husband decided you needed to manicure the  <br/>\nlawn with scissors? Would you feel responsible after you&#39;d done it?  <br/>\nOr would you feel resentful? Why? (It&#39;s important that why. It&#39;s the  <br/>\nfoundational difference between choosing to take on a responsibility  <br/>\nand having someone impose a task on us.)<br/>\n<br/>\nKids learn to be responsible by being treated with respect. When they  <br/>\nknow they&#39;re respected -- truly deeply respected for who they are and  <br/>\nnot just when they&#39;re doing what they parents approve of -- then they  <br/>\nwant to maintain that respect, the respect of others and even more  <br/>\nimportantly their respect for themselves.<br/>\n<br/>\n(And, yes, I&#39;ve seen a great deal of responsibility in my daughter at  <br/>\n15. In fact I think she&#39;s way more responsible than I am!)<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":187841659,"authorName":"Janet","from":"Janet &lt;janeteg@...&gt;","profile":"janeteg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] I was wondering about the future","postDate":"1179871574","msgId":23932,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIwMjQ4NDIyMTc3QHJydi5uZXQ+","inReplyToHeader":"PGYydmVhNitpcnU4QGVHcm91cHMuY29tPg==","referencesHeader":"PGYydmVhNitpcnU4QGVHcm91cHMuY29tPg=="},"prevInTopic":23923,"nextInTopic":23934,"prevInTime":23931,"nextInTime":23933,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"I have had three who have gone from unschooling to college - two have good jobs now. Not a one has had a big transition problem. They may have had a surprise","messageBody":"<div id=\"ygrps-yiv-1232685738\">I have had three who have gone from unschooling to college - two have <br/>\ngood jobs now. Not a one has had a big transition problem. They may <br/>\nhave had a surprise or two, but nothing they didn&#39;t understand or <br/>\nhave the ability to deal with.  We have unschooled for 20 years. I <br/>\nworried about the first one going off to college at age 16 with no <br/>\n&quot;formal schooling&quot; LOL. (State pays for it - he wanted to try it <br/>\nbadly, so off he went - just as a commuter student.) He ended up <br/>\nstaying there for four years, graduated and now works as a well paid <br/>\ncomputer programmer in NC. The other one has transferred to another <br/>\ncollege and is working towards a degree in mechanical engineering. <br/>\nTheir unschooling years really helped them focus on what THEY wanted <br/>\nto do and what THEIR strengths were. One lived breathed and slept <br/>\nwith computers - and he&#39;s very good at what he does. The other loved <br/>\nthings mechanical! And he too is good at what he does. Had they been <br/>\nin school all day all those years they never would have known where <br/>\ntheir interests lie, at least I can&#39;t see how they could have. They <br/>\nwere free to really explore at home. And explore they did.<br/>\n<br/>\nJanet in MN<br/>\n<br/>\nAt 01:55 PM 5/22/2007, you wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;However I am wondering about the future.<br/>\n&gt;<br/>\n&gt;I want to word this without it sounding attacking or rude or anything<br/>\n&gt;negative as that is not my intent.<br/>\n&gt;<br/>\n&gt;With the way you are raising you child(ren), do you feel they will<br/>\n&gt;handle society well. What I mean is when you go out to work you are<br/>\n&gt;not asked how you feel about something.. Nor are you asked if you want<br/>\n&gt;to complete a particular task etc. Since this is how you are at home<br/>\n&gt;do you feel they will be able to make the transition into a world that<br/>\n&gt;may not and actually most likely will not support that way of thinking.<br/>\n&gt;<br/>\n&gt;Do you feel they will get a shock when others do not treat them the<br/>\n&gt;way they are used to being treated at home?<br/>\n&gt;<br/>\n&gt;I have been raising my son that in society when you are given a task<br/>\n&gt;(at work or in college etc) you are expected to complete it despite<br/>\n&gt;your feelings on it.<br/>\n&gt;<br/>\n&gt;How do you prepare your child to deal with this? </span></blockquote></div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: I was wondering about the future","postDate":"1179867073","msgId":23915,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNmIwMWM3OWNiMiRlZjhhYzdmMCQwMjAxYThjMEBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":23913,"nextInTopic":23918,"prevInTime":23913,"nextInTime":23916,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"***What I mean is when you go out to work you are not asked how you feel about something.. Nor are you asked if you want to complete a particular task etc.*** ","messageBody":"<div id=\"ygrps-yiv-707172821\">***What I mean is when you go out to work you are<br/>\nnot asked how you feel about something.. Nor are you asked if you want<br/>\nto complete a particular task etc.***<br/>\n<br/>\nI am!  My boss asks me if I want certain projects and if I were to get stuck <br/>\nshe&#39;d finish a project for me.  I work at a job I like, I work only as much <br/>\nas I want, I do only the jobs I want and so your statement isn&#39;t true of all <br/>\njobs!  &lt;g&gt;<br/>\n<br/>\n***Since this is how you are at home<br/>\ndo you feel they will be able to make the transition into a world that<br/>\nmay not and actually most likely will not support that way of thinking.***<br/>\n<br/>\nMy son won&#39;t be transitioning into the world - he&#39;s been in the word for <br/>\nfifteen years!  By the time he&#39;s out, living on his own he&#39;ll have spent his <br/>\nwhole life on this planet!&lt;g&gt;  He knows lots of different people, he&#39;s <br/>\nalready worked at several different jobs. (Critter sitter stuff)   He&#39;s been <br/>\nin clubs and groups made up of all kinds of folks, adults, kids his age, <br/>\nkids younger than him.   He knows not everyone thinks the way he does.<br/>\n<br/>\n***Do you feel they will get a shock when others do not treat them the<br/>\nway they are used to being treated at home?***<br/>\n<br/>\nIf someone treats him badly he has the confidence to deal with them in a <br/>\nmature and rational manner.<br/>\n<br/>\n***I have been raising my son that in society when you are given a task<br/>\n(at work or in college etc) you are expected to complete it despite<br/>\nyour feelings on it.***<br/>\n<br/>\nWhen the young military people were busted over the treatment of prisoners <br/>\nat Abu Ghraib they said they were &quot;just doing their job.&quot;   When Adolf <br/>\nEichmann was on trial for crimes against humanity he insisted he was only <br/>\nfollowing orders.  I think it&#39;s a terrible mistake to believe we must follow <br/>\norders in spite of our own feelings about whatever we&#39;ve been asked to do. <br/>\n(If you&#39;re interested in this idea there was a bizarre study called the <br/>\nMilgram experiments (Stanley Milgram) that showed just how far some folks <br/>\nwould be willing to compromise their ethics if they were directed to by an <br/>\nauthority figure)  If my son is in a job where he doesn&#39;t feel good about <br/>\ndoing the work then I hope he leaves that job PRONTO.<br/>\n<br/>\nWe have choices about what jobs we take and whether we stay at that job and <br/>\nfor how long.   I think the majority of the people who are having a hard <br/>\ntime in life are people who feel like they have no choice about what happens <br/>\nto them or who feel like they *have to* do things in their life because they <br/>\nhave no choice.<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] I was wondering about the future","postDate":"1179866127","msgId":23913,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxMDgyMC44NTQ0NC5xbUB3ZWI1MzgxMS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDYwMzA4MC40OTk4OS5xbUB3ZWI1MzgwNS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":23912,"nextInTopic":23915,"prevInTime":23912,"nextInTime":23915,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"And yes, I do think our kids wil be able to finish a task, keep a joy and manage in society. **** okay, so I meant keep a job -- but, hey, I think I like it","messageBody":"<div id=\"ygrps-yiv-1167669183\">And yes, I do think our kids wil be able to finish a task, keep a joy and manage in society. <br/>\n   <br/>\n  ****<br/>\n  okay, so I meant &#39;keep a job&#39; -- but, hey, I think I like it better as keep a joy....<br/>\n   <br/>\n  Sylvia<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nNeed a vacation? Get great deals to amazing places on Yahoo! Travel. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] I was wondering about the future","postDate":"1179865006","msgId":23912,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwMzA4MC40OTk4OS5xbUB3ZWI1MzgwNS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGYydmVhNitpcnU4QGVHcm91cHMuY29tPg=="},"prevInTopic":23911,"nextInTopic":23913,"prevInTime":23911,"nextInTime":23913,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"I have been raising my son that in society when you are given a task (at work or in college etc) you are expected to complete it despite your feelings on it. ","messageBody":"<div id=\"ygrps-yiv-90785036\">I have been raising my son that in society when you are given a task<br/>\n(at work or in college etc) you are expected to complete it despite<br/>\nyour feelings on it. <br/>\n<br/>\n  ***<br/>\n  First, while you may expected to complete it, you still have a choice not to.  The question is whether you want what the completed job will give you -- a paycheck, respect for your work, joy in accomplishing what you do, etc. <br/>\n   <br/>\n  And yes, I do think our kids wil be able to finish a task, keep a joy and manage in society.  I&#39;ve noticed that as my boys get older, they are more likely to complete what they start.  They&#39;re even more likely to take on tasks they wouldn&#39;t have in the past.  Earlier today, while I was hanging clothes to dry, Andy asked me to make pancakes.  I said I would as soon as I was free.  His next question was &#39;How do I make them myself?&quot;  I talked him thru it, calling out ingredients and amounts while I hung clothes.  He found things, mixed up and cooked the pancakes.  Even once I was done with the clothes, he continued to pour and flip pancakes.  Sunday I came home from a walk to find him scrubbing the toilet in the hall bathroom -- he&#39;d noticed it needed cleaning and did it himself.  He&#39;s beginning to show initiative, and does things my Mom had to force us to do!  All just because he sees thigns that need to be done.  <br/>\n   <br/>\n  It helps to have stories, too, of the adventures of grown unschoolers, too.  Kids who have gone to college, tackling classes they weren&#39;t crazy about, but because it was part of the curriculum; who&#39;ve found and held jobs, learning about how the &#39;real&#39; world does work along the way.  I&#39;m not worried about my kids managing the future -- well, at least not because of unschooling.  I expect they&#39;ll be much more adept at learning new skills on a job, and much more willing to do what&#39;s required of the job they&#39;ve chosen -- because as unschoolers, they&#39;re very aware that everything we do is a choice.  <br/>\n   <br/>\n  Sylvia<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nGet the free Yahoo! toolbar and rest assured with the added security of spyware protection. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] I was wondering about the future","postDate":"1179864728","msgId":23911,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOTZBQzQ5QzNGMzA3Ni0xMjcwLUIxM0B3ZWJtYWlsLW1lMTEuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PGYydmVhNitpcnU4QGVHcm91cHMuY29tPg==","referencesHeader":"PGYydmVhNitpcnU4QGVHcm91cHMuY29tPg=="},"prevInTopic":23909,"nextInTopic":23912,"prevInTime":23910,"nextInTime":23912,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"... From: jnaisi  With the way you are raising you child(ren), do you feel they will handle society well.  What I mean is when you go","messageBody":"<div id=\"ygrps-yiv-1190316986\">-----Original Message-----<br/>\nFrom: jnaisi &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robyn.bentley@...\">robyn.bentley@...</a>&gt;<br/>\n<br/>\n<br/>\nWith the way you are raising you child(ren), do you feel they will<br/>\nhandle society well.  What I mean is when you go out to work you are<br/>\nnot asked how you feel about something.. Nor are you asked if you want<br/>\nto complete a particular task etc.  Since this is how you are at home<br/>\ndo you feel they will be able to make the transition into a world that<br/>\nmay not and actually most likely will not support that way of thinking.<br/>\n<br/>\n-=-=-=-=<br/>\n<br/>\nCameron&#39;s 19. He&#39;s handling society just fine.<br/>\n<br/>\nIn fact, when I was his age, I didn&#39;t handle things nearly as well.<br/>\n<br/>\nGranted, Cameron is still on the naive side---but that&#39;s OK. He really <br/>\nexpects the best out of others---at least as good as they will get from <br/>\nhim! He doesn&#39;t let other run all over him though---he&#39;s QUITE happy to <br/>\nstand up for himself. Much more so than I would at his age. Authority <br/>\ncarried a LOT of weight with me: I would crumble if someone were &quot;in <br/>\nauthority.&quot; Cameron is happy to challenge *anyone* if that person is <br/>\n*wrong*. Blows me away. Has had no problem asking for and justifying <br/>\nraises or challenging &quot;how things are done.&quot;<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nDo you feel they will get a shock when others do not treat them the<br/>\nway they are used to being treated at home?<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nHe IS shocked, and then he tries to fix it (just like at home).<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nI have been raising my son that in society when you are given a task<br/>\n(at work or in college etc) you are expected to complete it despite<br/>\nyour feelings on it.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nHow do you prepare your child to deal with this? (Throwing your own <br/>\nquestion back at you. &lt;g&gt;) Do you want  him to do whatever his boss or <br/>\nprofessor says? WhatEVER?????<br/>\n<br/>\nYou know, that was one of the problems with the Calley case (are y&#39;all <br/>\ntoo young to remember that? &lt;g&gt;). William Cally was a lieuteant in the <br/>\nUS army during the Viet Nam war who said he was &quot;just following orders&quot; <br/>\nwhen he and his men massacred over 300 civilians in the village of My <br/>\nLai. &quot;Just following orders&quot;---they were given a task and completed it <br/>\ndepite their feelings about it.<br/>\n<br/>\nI think it&#39;s a REALLY bad idea to do whatever task depite your feelings <br/>\nabout it. REALLY bad.<br/>\n<br/>\nI hope my boys never have that expectation!<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nAOL now offers free email to everyone.  Find out more about what&#39;s free <br/>\nfrom AOL at AOL.com.</div>","specialLinks":[]},{"userId":295439124,"authorName":"Julie Hampton","from":"&quot;Julie Hampton&quot; &lt;wisdom1133@...&gt;","profile":"hammy454","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] I was wondering about the future","postDate":"1179861660","msgId":23934,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEyMC1EQVY2MkE1NzA3OTA5QUYxRTUwOUJFMTRDNDM2MEBwaHguZ2JsPg==","referencesHeader":"PGYydmVhNitpcnU4QGVHcm91cHMuY29tPg=="},"prevInTopic":23932,"nextInTopic":23939,"prevInTime":23933,"nextInTime":23935,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"I hope my kids also do not conform to society but find their passion and niche in society. I really do not want my kids to get a job and be told what to do I","messageBody":"<div id=\"ygrps-yiv-1740112872\">I hope my kids also do not conform to society but find their passion and niche in society. I really do not want my kids to &quot;get a job and be told what to do&quot; I want them to explore and leave their mark on society. Julie<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: jnaisi&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robyn.bentley@...\">robyn.bentley@...</a>&gt; <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt; <br/>\n  Sent: Tuesday, May 22, 2007 12:55 PM<br/>\n  Subject: [unschoolingbasics] I was wondering about the future<br/>\n<br/>\n<br/>\n  I have been reading what everyone has been saying and on a lot of it I<br/>\n  can see it&#39;s benefits. However I am wondering about the future.<br/>\n<br/>\n  I want to word this without it sounding attacking or rude or anything<br/>\n  negative as that is not my intent.<br/>\n<br/>\n  With the way you are raising you child(ren), do you feel they will<br/>\n  handle society well. What I mean is when you go out to work you are<br/>\n  not asked how you feel about something.. Nor are you asked if you want<br/>\n  to complete a particular task etc. Since this is how you are at home<br/>\n  do you feel they will be able to make the transition into a world that<br/>\n  may not and actually most likely will not support that way of thinking.<br/>\n<br/>\n  Do you feel they will get a shock when others do not treat them the<br/>\n  way they are used to being treated at home?<br/>\n<br/>\n  I have been raising my son that in society when you are given a task<br/>\n  (at work or in college etc) you are expected to complete it despite<br/>\n  your feelings on it. <br/>\n<br/>\n  How do you prepare your child to deal with this? <br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":145246818,"authorName":"Christy Mahoney","from":"&quot;Christy Mahoney&quot; &lt;unschooling1@...&gt;","profile":"unschooling1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I was wondering about the future","postDate":"1179861104","msgId":23909,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYydmY5ZythajdxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGYydmVhNitpcnU4QGVHcm91cHMuY29tPg=="},"prevInTopic":23906,"nextInTopic":23911,"prevInTime":23908,"nextInTime":23910,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"If by handle society well you mean react the way most people do, I think it would be great if my kids did not handle it well.  I hope they will actually","messageBody":"<div id=\"ygrps-yiv-683034881\">If by &quot;handle society well&quot; you mean react the way most people do, I <br/>\nthink it would be great if my kids did not handle it well.  I hope <br/>\nthey will actually think about what they are asked/told to do, and <br/>\ndecide if it is worth it to them.  Most people think, &quot;This is my <br/>\njob, so I have to do this task.&quot;  I think it would be great if <br/>\neveryone realized that these are all CHOICES.  <br/>\n<br/>\n-Christy M.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; With the way you are raising you child(ren), do you feel they will<br/>\n&gt; handle society well.  What I mean is when you go out to work you <br/>\n </span></blockquote>are<br/>\n<blockquote><span title=\"ireply\"> &gt; not asked how you feel about something.. Nor are you asked if you <br/>\n </span></blockquote>want<br/>\n<blockquote><span title=\"ireply\"> &gt; to complete a particular task etc.  Since this is how you are at <br/>\n </span></blockquote>home<br/>\n<blockquote><span title=\"ireply\"> &gt; do you feel they will be able to make the transition into a world <br/>\n </span></blockquote>that<br/>\n<blockquote><span title=\"ireply\"> &gt; may not and actually most likely will not support that way of <br/>\n </span></blockquote>thinking.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Do you feel they will get a shock when others do not treat them the<br/>\n&gt; way they are used to being treated at home?<br/>\n&gt; <br/>\n&gt; I have been raising my son that in society when you are given a <br/>\n </span></blockquote>task<br/>\n<blockquote><span title=\"qreply\"> &gt; (at work or in college etc) you are expected to complete it despite<br/>\n&gt; your feelings on it.  <br/>\n&gt; <br/>\n&gt; How do you prepare your child to deal with this?<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":235453246,"authorName":"jnaisi","from":"&quot;jnaisi&quot; &lt;robyn.bentley@...&gt;","profile":"jnaisi","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"I was wondering about the future","postDate":"1179860102","msgId":23906,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYydmVhNitpcnU4QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":23909,"prevInTime":23905,"nextInTime":23907,"topicId":23906,"numMessagesInTopic":0,"msgSnippet":"I have been reading what everyone has been saying and on a lot of it I can see it s benefits.  However I am wondering about the future. I want to word this","messageBody":"<div id=\"ygrps-yiv-1475588392\">I have been reading what everyone has been saying and on a lot of it I<br/>\ncan see it&#39;s benefits.  However I am wondering about the future.<br/>\n<br/>\nI want to word this without it sounding attacking or rude or anything<br/>\nnegative as that is not my intent.<br/>\n<br/>\nWith the way you are raising you child(ren), do you feel they will<br/>\nhandle society well.  What I mean is when you go out to work you are<br/>\nnot asked how you feel about something.. Nor are you asked if you want<br/>\nto complete a particular task etc.  Since this is how you are at home<br/>\ndo you feel they will be able to make the transition into a world that<br/>\nmay not and actually most likely will not support that way of thinking.<br/>\n<br/>\nDo you feel they will get a shock when others do not treat them the<br/>\nway they are used to being treated at home?<br/>\n<br/>\nI have been raising my son that in society when you are given a task<br/>\n(at work or in college etc) you are expected to complete it despite<br/>\nyour feelings on it.  <br/>\n<br/>\nHow do you prepare your child to deal with this?</div>","specialLinks":[]}],"prevTopicId":24090,"nextTopicId":24103}}