{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":232627122,"authorName":"Judy Anderson","from":"&quot;Judy Anderson&quot; &lt;segwyne@...&gt;","profile":"kblackclaw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"What do you say? was Re: [unschoolingbasics] Re: Intro: considering Unschooling..","postDate":"1129239097","msgId":6999,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNjQwMWM1ZDAzZCQ3ZWYwN2YwMCQ0ZjMwMTQ0NkBtb21kYWQ+","referencesHeader":"PDdhLjdkY2EyZDNkLjMwODAxMTcxQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":6998,"nextInTime":7000,"topicId":6999,"numMessagesInTopic":0,"msgSnippet":"I had the state called on me when I took my kids out of school, too.  When folks ask, I say we homeschool.  They will often aske which curriculum we use, and I","messageBody":"<div id=\"ygrps-yiv-451520171\">I had the state called on me when I took my kids out of school, too.  When<br/>\nfolks ask, I say we homeschool.  They will often aske which curriculum we<br/>\nuse, and I say, &quot;We don&#39;t use a set curriculum.  We just take it day by<br/>\nday.&quot;  I like the looks on folks&#39; faces when the kids tell them that they<br/>\ndon&#39;t do homework.  This suffuces for most people I have met.  If they want<br/>\nmore specifics, I give examples of things they have learned and how, such as<br/>\ntoday they were watching the second disc in the Gold Edition Beauty and the<br/>\nBeast.  On the disc was a history of the fairy tale in different cultures,<br/>\nso I wrote that down for their portfolio (I am required by law to keep one<br/>\nhere in NH, but law also says that viewing it is soley at my discretion).<br/>\nDH asked me to write such things down because he is still so schooly and has<br/>\nthe typical worries about them playing computer games and watching movies<br/>\nall day instead of &quot;learning anything&quot;.  The kids and I had a brief<br/>\ndiscussion on interracial marriage while watching Mystery Men for the<br/>\numpteenth time because one of the main characters is a white man married to<br/>\na black woman.  I was looking at photos of the horrible flooding we had here<br/>\nin southwest NH last weekend and that led to a discussion on cause and<br/>\neffects of floods, etc.  We were watching The Village and my 5yo was asking<br/>\nhow Ivy (who is blind) could run through the field without falling, so we<br/>\ntalked about different ways she had adapted to her blindness.  If you give a<br/>\ncouple of specific examples that will usually satisfy anyone.  As far as<br/>\ndeschooling, point out that children are only required to attend school for<br/>\n6 hours a day, 180 days per year (at least here in NH), which is really just<br/>\nunder every other day.  I say that we homeschool year-round; summertime,<br/>\nweekends, traditional school days are all the same to us.  I also point out<br/>\nthat by letting the kids pick which days are school days and which are days<br/>\noff (I don&#39;t really, as we don&#39;t have any school days), they can learn<br/>\nthings when they are in the best frame of mind for learning that particular<br/>\nthing, thus eliminating the power struggle over learning something at a<br/>\npre-determined time.  As for DYFS, I showed them my approval letter from the<br/>\nschool district.  She asked to see the same things that the school district<br/>\nrequired, so I showed her and that was that.  When she first met me, she<br/>\ncommented that jsut from speaking with me, it was obvious I was not<br/>\nneglecting my children&#39;s education, but she did have to see something so she<br/>\ncould mark it in her file.<br/>\n<br/>\nI hope this helps.  I&#39;m sure others will have much better answers for you,<br/>\nthough.<br/>\n<br/>\nJudy</div>","specialLinks":[]}],"prevTopicId":6993,"nextTopicId":6998}}