{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":244360311,"authorName":"Deb","from":"&quot;Deb&quot; &lt;soggyboysmom@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I get tired of watching their TV","postDate":"1157139507","msgId":17032,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVkYTI3aittajVvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVkOXBjOCtiYnEwQGVHcm91cHMuY29tPg=="},"prevInTopic":17031,"nextInTopic":0,"prevInTime":17031,"nextInTime":17033,"topicId":17027,"numMessagesInTopic":0,"msgSnippet":"I think part of the situation is that you have lots of previous baggage (though that word does get so overused). Words like come to terms , subjected to ,","messageBody":"<div id=\"ygrps-yiv-663206510\">I think part of the situation is that you have lots of <br/>\nprevious &quot;baggage&quot; (though that word does get so overused). Words <br/>\nlike &quot;come to terms&quot;, &quot;subjected to&quot;, &quot;retreat&quot; pop right out in <br/>\nthat regard.<br/>\n<br/>\nDo you actually sit and watch them watch? Do you get familiar with <br/>\nthe characters and such? Do you *choose* to spend time with them <br/>\ndoing things they enjoy (which might be TV) rather than <br/>\nfeeling &quot;subjected to&quot; things you have to &quot;come to terms&quot; with? <br/>\nWould it be an issue for you if you hadn&#39;t &quot;been subjected&quot; to loud <br/>\nmusic and disengaged parenting?<br/>\n<br/>\nPart of &quot;coming to terms&quot; with it is dealing with the fact that this <br/>\nis your issue, not theirs - they don&#39;t have that background of <br/>\nhaving a mom who prefers TV to them, they don&#39;t have a background of <br/>\ncompeting stereos, etc. To them, TV is just something fun (and <br/>\nsomething to use to decompress from daily stresses if they&#39;re still <br/>\nin school or deschooling). And part of it is getting everyone <br/>\ntogether and discussing it and brainstorming ways that mom can get <br/>\nsome quiet occasionally AND they can watch their favorite programs. <br/>\nFor instance, can you record/TiVO their favorite shows so they can <br/>\nturn the TV off sometimes and watch the show later? Is there a place <br/>\nwhere you can go and close the door for 20 minutes of quiet? (at 10 <br/>\nand 12, they can surely be by themselves for 20 minutes). Can they <br/>\nuse closed captioning sometimes? We do that often because of the <br/>\ntrucks going by the house - instead of turning the TV louder, we <br/>\nturn on closed captioning. It makes us all a bit nuts to go to MIL&#39;s <br/>\nhouse where they have the TV blasting loud most all the time (of <br/>\ncourse, MIL&#39;s eyesight is about as bad as her hearing so either way <br/>\nshe misses stuff). <br/>\n<br/>\nUnschooling is not about turning the house into a free-for-all. It <br/>\nis all about respect and trust - for everyone in the household, not <br/>\njust kids, not just adults. By extending that respect, you build a <br/>\nbank account of respect so that when you request something that you <br/>\nneed, it is there to draw on (poor analogy there really in many <br/>\nways). My 8 yr old, never regulated re: TV, DS sometimes wants to <br/>\nspend time with me on days I&#39;m home from work when I&#39;m not feeling <br/>\nwell. I&#39;m usually sleeping most of the time if I&#39;m home on a sick <br/>\nday. He turns on the TV in my room BUT first he asks if it&#39;s okay <br/>\nwith me. If I say Okay (which I usually do, I can generally sleep <br/>\nthrough anything, especially if I&#39;ve taken some head cold <br/>\nmedication). He then turns it way down low and puts on captioning so <br/>\nhe can watch and be with me and still not bother me. It&#39;s just <br/>\nmutual respect, person for person. How would you approach another <br/>\nadult about the situation? You likely wouldn&#39;t yell at them that <br/>\nthey HAD TO turn it down ...or else.... Nor would you (I hope) <br/>\nsuffer martyr-like in silence and then snipe and put down their TV <br/>\nwatching. Maybe take it totally out of the realm of TV and pick <br/>\nsomething else - cooking fish for instance. If you really hated the <br/>\nsmell of fish cooking but your SO really enjoyed baked halibut, what <br/>\nwould you do? You&#39;d probably work out some compromise - your SO <br/>\nbakes halibut only when you&#39;re out visiting friends or you invest in <br/>\na really good air freshener/cleaner for those occasions or your SO <br/>\nchooses to only get baked halibut out at a restaurant so you don&#39;t <br/>\nhave to live with the cooking smells or something  - you&#39;d <br/>\nbrainstorm ideas. Do the same with the kids over TV.<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":185550057,"authorName":"Joanne","from":"&quot;Joanne&quot; &lt;billyandjoanne@...&gt;","profile":"billyandjoanne","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I get tired of watching their TV","postDate":"1157136668","msgId":17031,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVkOXZlcytiZzZyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVkOXBjOCtiYnEwQGVHcm91cHMuY29tPg=="},"prevInTopic":17030,"nextInTopic":17032,"prevInTime":17030,"nextInTime":17032,"topicId":17027,"numMessagesInTopic":0,"msgSnippet":"... tell their kids I am tired of having that TV on and listening to it, can we turn it off now? . Yes. Of course! But I don t tell , I ask them. It s","messageBody":"<div id=\"ygrps-yiv-1941914106\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Beth Mouser&quot; &lt;mouser4@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;Are there unschoolers here who don&#39;t place restrictions on TV, but <br/>\n </span></blockquote>tell their kids &quot;I am tired of having that TV on and listening to it, <br/>\ncan we turn it off now?&quot;.&gt;&gt;&gt;&gt;  <br/>\n<br/>\nYes. Of course! But I don&#39;t &quot;tell&quot;, I ask them. It&#39;s just like when <br/>\nwe&#39;re in the car and I&#39;m BLASTING Metallica (or Sabbath...lol).....they <br/>\nsometimes ask &quot;Mom, can you lower that?&quot; or &quot;Mom, can we listen to <br/>\nsomething else?&quot; It&#39;s all about respect....on every side. As far as <br/>\nTV....I&#39;m bothered by the commercials so I ask that they (including my <br/>\nhusband) mute them and that helps me a lot.  <br/>\n<br/>\n~ Joanne ~<br/>\nMom to Jacqueline (8), Shawna (11) & Cimion (13)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://anunschoolinglife.blogspot.com/\">http://anunschoolinglife.blogspot.com/</a></div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela S.","from":"&quot;Angela S.&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] I get tired of watching their TV","postDate":"1157136009","msgId":17030,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWQwMWM2Y2RmNiQwZDVlMjM4MCQ2NTAwYThjMEBlYm9ueT4=","inReplyToHeader":"PGVkOXBjOCtiYnEwQGVHcm91cHMuY29tPg=="},"prevInTopic":17027,"nextInTopic":17031,"prevInTime":17029,"nextInTime":17031,"topicId":17027,"numMessagesInTopic":0,"msgSnippet":"I think there is a big difference between an Unschooling household where TV is just one of many interesting things to do and a home where the children are left","messageBody":"<div id=\"ygrps-yiv-250287753\">I think there is a big difference between an Unschooling household where TV<br/>\nis just one of many interesting things to do and a home where the children<br/>\nare left alone after school to fend for themselves.  Have you always<br/>\nunschooled?  Do your kids feel they need TV as an escape from something<br/>\nstressful?  Are they still deschooling after being brought out of school<br/>\nrecently?  Do you bring neat things into your home to introduce to your<br/>\nkids?  Do you play games with your kids and read to them?  Are you providing<br/>\na rich environment for them based on their interests?  <br/>\n<br/>\n <br/>\n<br/>\nI too can&#39;t stand to be around the constant noise of the TV.  We have two<br/>\nTVs.  One is in the basement family room and the other is on the main floor<br/>\nin the living room where the noise carries all through the house.  There is<br/>\nalways one place to escape from the noise of the TV.  But my kids still like<br/>\nme to watch with them (almost 10 and 11.75) and they often will wait for me<br/>\nto be free to sit and watch TV with them and do something else until I am<br/>\nready.  The TV noise isn&#39;t a distraction for me if I am sitting there<br/>\nwatching it.  It&#39;s when I am not watching it that it bothers me.<br/>\n<br/>\n <br/>\n<br/>\nIs there another room in the house where you could put the TV that would put<br/>\na door between you and the TV?  Could they turn the volume really low and<br/>\nput the closed captioning on so they won&#39;t miss something?<br/>\n<br/>\n <br/>\n<br/>\nI wouldn&#39;t hesitate to let the kids know that I felt I needed some quiet<br/>\ntime if the TV had been on loudly for a LONG period of time.  I wouldn&#39;t<br/>\nforce the issue, but I have always been respectful of my children when they<br/>\nneed something and so I am confident they would be respectful of my needs<br/>\ntoo.  They might ask if I minded if they finished a show or turned it down<br/>\nbut they would try to meet my needs too.  <br/>\n<br/>\n <br/>\n<br/>\nAngela<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a> <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":75406115,"authorName":"Beth Mouser","from":"&quot;Beth Mouser&quot; &lt;mouser4@...&gt;","profile":"mouser4983703","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"I get tired of watching their TV","postDate":"1157130440","msgId":17027,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVkOXBjOCtiYnEwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":17030,"prevInTime":17026,"nextInTime":17028,"topicId":17027,"numMessagesInTopic":0,"msgSnippet":"I have been lurking here for quite awhile and am so tempted to unschool, but several things are holding me back. One thing that I can t come to terms with is","messageBody":"<div id=\"ygrps-yiv-1663516950\">I have been lurking here for quite awhile and am so tempted to <br/>\nunschool, but several things are holding me back.   <br/>\n<br/>\nOne thing that I can&#39;t come to terms with is the TV and music <br/>\nissue.  I grew up in a trailer and after school I would come home <br/>\nand be forced to listen to Very Loud music from each end of the <br/>\ntrailer due to my brothers.  I think the trailer was actually <br/>\nshaking to the loud bass of Black Sabbath and such.  I just wanted <br/>\nto play my choir music on the piano (my mom wasn&#39;t at home after <br/>\nschool).  I felt like I was always subjected to loud music.  Also, <br/>\nmy mom would come home from work around dinner and would then watch <br/>\nher TV shows all evening long and I got so tired of having her TV on <br/>\n(secretly, I was bored and wished she would do something with me).  <br/>\nI would retreat to my bedroom to just get away from it.  I do enjoy <br/>\nwatching TV with them at times, but sometimes I want to hear quiet~  <br/>\nI am afraid my kids would always want to watch TV if I didn&#39;t place <br/>\nany restrictions on it.  And I would rather not get them TVs in <br/>\ntheir bedrooms.  Are there unschoolers here who don&#39;t place <br/>\nrestrictions on TV, but tell their kids &quot;I am tired of having that <br/>\nTV on and listening to it, can we turn it off now?&quot;.  The living <br/>\nroom is right off of the kitchen so I have to listen while I am <br/>\ncooking.  They always watch cartoons and I am really tired of them.  <br/>\nMy boys are 10 and 12.    As far as the music, I know they can <br/>\nlisten to their own IPods and such, but I haven&#39;t encouraged that <br/>\neither.  We have hearing issues in our family.  My grandma has <br/>\nterrible hearing and I suffer from some hearing loss as well.  <br/>\nListening to music with something jammed in your ear is not a good <br/>\nidea.  I have looked into it.  <br/>\n<br/>\nRegards,<br/>\nBeth</div>","specialLinks":[]}],"prevTopicId":17002,"nextTopicId":17033}}