{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":187549037,"authorName":"Christe Bruderlin","from":"Christe Bruderlin &lt;techwritercsbn@...&gt;","profile":"techwritercsbn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Food and Fear","postDate":"1152856768","msgId":15752,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNzE0MDU1OTI4LjM5MTY5LnFtYWlsQHdlYjMyNjAyLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDExNTI4NDM4MDguMTM0Mi45NTgzMy5tMjBAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":15753,"prevInTime":15751,"nextInTime":15753,"topicId":15752,"numMessagesInTopic":0,"msgSnippet":"Ren Allen wrote: Maybe quit working at it.:) I see your point.  I don t worry about the actual food at this point (though I love doing the research and","messageBody":"<div id=\"ygrps-yiv-204876713\">Ren Allen wrote:<br/>\n<br/>\n&quot;Maybe quit &quot;working&quot; at it.:)&quot;<br/>\n <br/>\nI see your point.  I don&#39;t worry about the actual food at this point (though I love doing the research and having the discussion), but I *do* worry about how to present information as just that, without all of my research interjected, etc., in a way that causes guilt or something, you know?  <br/>\n <br/>\n&quot;Food is ideally a source of joy. If food tastes good, is eaten in joy and a source of pleasure, then most of the concerns fall by the wayside.&quot;<br/>\n <br/>\nI wish that I believed that just enjoying food made it all okay to eat...oh well.  Maybe I&#39;ll get there....  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":187549037,"authorName":"Christe Bruderlin","from":"Christe Bruderlin &lt;techwritercsbn@...&gt;","profile":"techwritercsbn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Food and Fear","postDate":"1152856230","msgId":15753,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNzE0MDU1MDMwLjMxNjQ2LnFtYWlsQHdlYjMyNjA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDExNTI4MzQzMjcuOTgzLjE3OTIxLm0zMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":15752,"nextInTopic":0,"prevInTime":15752,"nextInTime":15754,"topicId":15752,"numMessagesInTopic":0,"msgSnippet":"~Saturated fat is an easy comparison if you do the research.~ Ren Allen wrote: NOT TRUE!! One of the worst comparisons actually. Recent studies are finding","messageBody":"<div id=\"ygrps-yiv-935765713\">~Saturated fat is an easy comparison if you<br/>\ndo the research.~<br/>\n<br/>\nRen Allen wrote:<br/>\n <br/>\n&quot;NOT TRUE!!<br/>\nOne of the worst comparisons actually. Recent studies are finding that<br/>\nthe KIND of fat (not saturated or non, but as in what source) has more<br/>\nto do with it than previously thought.&quot;<br/>\n <br/>\nYes, I should have specified animal vs. plant source saturated fat.  See recent email to Keirsten (or is it Kiersten?  Sorry for potential spelling error!)<br/>\n<br/>\n&quot;Even animal fat is not thought to be as big a culprit as before.&quot;<br/>\n <br/>\nAccording to?  You mean that the associations aren&#39;t as strong as with animal protein or something else?  <br/>\n<br/>\n&quot;My Grandparents were farmers from the 1940&#39;s until recently. Still<br/>\nhave a huge garden and eat tons of meat. They raised pigs, cows, grew<br/>\nstrawberries, wheat etc.... and ate a LOT of red meat. My Dad was<br/>\nraised on that diet. None of them have heart disease, my grandparents<br/>\nare in their 90&#39;s and going strong. Grandpa has been slowing down, but<br/>\nnot because of his heart or any disease...his body is just wearing out.&quot;<br/>\n <br/>\nI&#39;m truly happy for your grandparents!<br/>\n <br/>\nI do unfortunately believe that most Americans have some stage of CAD (see Bogalusa Heart Study and its findings on Americans under 30 but also lots of other studies as well as the facts on CAD screening tests), including me!  However, current medical tests for CAD only look at certain arteries and then only measure above a certain threshold.  They do *not* pick up all heart disease  - just when you&#39;ve got it bad - so are not truly representative of the disease out there.  When old people &quot;just die,&quot; and are autopsied, they almost always have heart disease, and often &quot;just died&quot; as a result of that disease. <br/>\n <br/>\nBut I&#39;ve always joked that we can do all this stuff to try and maximize our health for however we are on this earth, and a split second could mean we get hit by a bus anyway.  And then, I might has well have lived on cigarettes, martinis and Twinkies!  :)  <br/>\n<br/>\n&quot;My personal belief is that hydrogenated oils share a much greater blame than any saturated fat.&quot;<br/>\n<br/>\n <br/>\nAgree.  I emptied my cupboard of them about 13 years ago (my family thought I was such an extremist, which might be true hee hee).  Food manufacturers seem to be (at least attempting) pulling them out of foods, so hopefully that will become less of a problem.<br/>\n<br/>\n&quot;There are the French, who eat a diet high in fat and have very little heart disease.&quot;<br/>\n <br/>\nPlease see most recent WHO stats (or French stats, but WHO is convenient because you can compare countries easily).  Previously, there was hype because they were *lower* than us (us the US), but most affluent countries have what I would consider much more than &quot;very little,&quot; including France.  However, their lower-than-the-U.S. heart disease was associated with a higher fruit and veggie consumption and the fact that (until recent years -- and oh boy has it changed) the women were far less likely to be smokers.  I have never seen data that negated the belief that the heart disease they *did* have was related to animal-source saturated fat.  Have you?<br/>\n <br/>\n&quot;Greenland traditionally eats a diet very high in saturated fats from animals like seals and sea lions...lotsa blubber and all. Virtually no heart disease or athersclerosis.&quot;<br/>\n <br/>\nI recall the initial study (70s-80s) that started the fish oil hype (since they thought it was protective with their high saturated fat diet).  Even then, heart disease was the third most common cause of death in Greenland, and the rate has gone up significantly since that time, which is hardly on par with the &quot;virtually no&quot; statement above. Followup findings in the 90s explained that the first study compared Danish and Greenlandic diets, but that in fact the Greenlandic diet had overall far less saturated and polyunsaturated fat and far more monounsaturated fat than originally highlighted -- and this accounted for the much lower rate in the Greenlandic diet compared to the Danish diet.  <br/>\n <br/>\nHowever, an even more recent study on Greenland indicates that their overall fat intake has led to an overall increase in obesity (and rate of increase of obesity) and its related sequelae (heart disease, atherosclerosis, etc.) in the population that override the benefits of the higher n-3 fatty acid consumption anyway.  But perhaps I&#39;m I missing something?  <br/>\n<br/>\n&quot;Nope, the connection is not clear at all. That&#39;s why so much research is still being done on this topic.&quot;<br/>\n <br/>\nI see some very clear connections, but I agree, not *all* the connections are clear (though a natural diet seems intuitive to me) and I also agree that we all need to come to our own conclusions.<br/>\n <br/>\nBUT Ren, on the cigarette-buying note, I have to respect you even more (I have ever since joining these lists anyway, but...) for actually *answering* the cigarette question as well as for your reply!!!  It really is making me think (although I admit to being frightened by the thoughts!).<br/>\n <br/>\nAlso, I do agree this is a very privileged conversation and that we are lucky to have food at all!!!  But aren&#39;t they all?  I mean, to even have computers!  Yes, off to count blessings!<br/>\n <br/>\nAnd lastly, I&#39;m way over my personally-imposed computer limit ;)  I had to redo this email because I lost it once.  Ugh!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":15749,"nextTopicId":15754}}