{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Fears, was Dental was Food and behavior","postDate":"1262612600","msgId":42768,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFFRDQ5NTYyLTY5MzItNEEzQy1BODRELTkwMTFDMjBBNDNCRUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDRCNDEzNDZFLjkwMzAyMDFAeWFob28uY2E+","referencesHeader":"PDRCNDEzNDZFLjkwMzAyMDFAeWFob28uY2E+"},"prevInTopic":42766,"nextInTopic":0,"prevInTime":42767,"nextInTime":42769,"topicId":42765,"numMessagesInTopic":0,"msgSnippet":"... Maybe think of the advice given not as parenting rules but as ways to help your kids explore the world safely and build relationships to support","messageBody":"<div id=\"ygrps-yiv-232030962\">On Jan 3, 2010, at 7:21 PM, Shira Rocklin wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So, when I was forcing her to hold hands or else pick her up, was I<br/>\n&gt; taking her choice away?<br/>\n<br/>\n </span></blockquote>Maybe think of the advice given not as parenting rules but as ways to  <br/>\nhelp your kids explore the world safely and build relationships to  <br/>\nsupport unschooling.<br/>\n<br/>\nMaybe. I&#39;m not saying that&#39;s a rule ;-) It might be a way of helping  <br/>\nyou think clearer but I haven&#39;t quite thought through the pitfalls of  <br/>\nthat line of thought.<br/>\n<br/>\nPresumably, since you&#39;re unschooling, you want to help them explore  <br/>\nthe world and want to build relationships with them as much as  <br/>\npossible. But reality doesn&#39;t make every moment best for that.<br/>\n<br/>\nWhat you want to be aware of is how you define &quot;reality&quot;. Highways  <br/>\nare dangerous. Busy parking lots are dangerous. If Dad appreciates  <br/>\ndinner when he gets home from work and you&#39;re not there a lot that  <br/>\nwill tear at that relationship. Staying at a party after it&#39;s done is  <br/>\nrude. Reality limits our choices if we don&#39;t want the negative  <br/>\nconsequences.<br/>\n<br/>\nBut all the things most conventional parents lump into the &quot;have to&quot;  <br/>\ncategory and say are &quot;just reality&quot; like grocery shopping, cleaning,  <br/>\nquiet adult time, organic foods ;-), adult purchases trumping kid  <br/>\npurchases all those -- in reality ;-) -- are flexible. As adults we  <br/>\nhave greater power to arrange our lives to fit those in. To build  <br/>\nrelationships we should work to minimize the times we take from the  <br/>\nkids in order to meet those needs.<br/>\n<br/>\nWhen reality bumps up against a child&#39;s desires there are techniques  <br/>\nto help ease their disappointment. Sympathy. Being playful. Turning  <br/>\nsomething into a game (though obviously being cautious not to create  <br/>\na game that encourages running into the street!). Finding the choices  <br/>\nyou can give in the situation (for instance I think Deb Lewis said  <br/>\nher son didn&#39;t mind holding onto her rather than her holding onto him.)<br/>\n<br/>\nBut the more you arrange your life to avoid the disappointments that  <br/>\nare in your control, the fewer times you&#39;re tearing at the  <br/>\nrelationships you want to build.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Fears, was Dental was Food and behavior","postDate":"1262579853","msgId":42766,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxQ0VDOThFMTY1NDRGOTI5NzRBNjc2NkFGNzg4MDg3QENvbm5pZVBDPg==","inReplyToHeader":"PDRCNDEzNDZFLjkwMzAyMDFAeWFob28uY2E+","referencesHeader":"PDRCNDEzNDZFLjkwMzAyMDFAeWFob28uY2E+"},"prevInTopic":42765,"nextInTopic":42768,"prevInTime":42765,"nextInTime":42767,"topicId":42765,"numMessagesInTopic":0,"msgSnippet":"... well be true, but if brushing would reduce the risk of lots of cavities by 50% (I m making that up), then it would still be worth it to do that.","messageBody":"<div id=\"ygrps-yiv-1248672142\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;Because, the two other statements could very <br/>\n </span></blockquote>well be true, but if brushing would reduce the risk of lots of cavities <br/>\nby 50% (I&#39;m making that up), then it would still be worth it to do that.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nYes, it would be worth doing. However, if brushing teeth became a battle of the wills that ruined your relationship with your child, then no, it would not be worth doing. Reducing (not completely removing) the risk is good but not at the expense of everything else. My oldest daughter refused to brush her teeth. I had a choice between holding her down and forcing the issue or letting it go. She didn&#39;t go for the cutesy games. It didn&#39;t matter what I said or did. She just would not submit to having her teeth brushed. I will admit that I tried to force the issue once or twice. The end result was that we were both mentally and physically exhausted. If I had to choose between torturing my daughter every night (that is what it felt like) and having a higher risk of cavities. I would take the latter. Even if the statement is true, there are still trade offs that each person must evaluate. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;When does sharing our fears become fear-mongering? &lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Sharing your fears becomes fear-mongering when you state your fears as absolute truths. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;If the Mack truck isn&#39;t thundering down the road right now, do you let <br/>\n </span></blockquote>your kids (lets say 3-4 years old) play in the street?&lt;&lt;&lt;&lt;<br/>\n<br/>\nThat depends. I would probably let them play in the street if I was there to help them in case a car did come.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;So, when I was forcing her to hold hands or else pick her up, was I <br/>\n </span></blockquote>taking her choice away? Did her age matter? I followed this &#39;rule&#39; <br/>\nwith her even on small streets, because I&#39;m not able to predict when a <br/>\ncar might suddenly turn onto those streets, or speed up unexpectedly, etc.&lt;&lt;&lt;&lt;<br/>\n<br/>\nYes, you were taking away her choice but she was not capable of making a choice in that situation. If I fell and hit my head and passed out, I would hope that my husband would call 911 or would somehow help me. I don&#39;t expect him to give me a choice or ask my opinion? I get the feeling that you are misunderstanding the role of choice. We are not saying that you have to stop and ask your kid&#39;s permission for everything. We are also not saying that you have to give your children a choice in every single thing that goes on. There are some things where giving them a choice is not possible. <br/>\n<br/>\nI would venture to say that you can usually tell if you are in a situation where it is okay to let her dally while crossing the street or if it isn&#39;t. Sometimes, kids don&#39;t care if they have a choice. My older kids accepted the fact that they had to hold my hand or be held while crossing the street so it was never an issue. My 2 year old is a good example of a kid that insists on having choices when crossing the street. She refuses to hold my hand and does not want to be picked up. So, I tell her she has to walk beside me or her dad or her big sister. I keep her close enough that if a car were to come, I could scoop her up and get her out of the way. Age doesn&#39;t matter. What matters is the individual situation and the individual child. There are situations that contain imminent danger where it is just plain silly to give your child a choice. I don&#39;t give my kids a choice on every. single. thing that goes on in our house. However, I am open to them questioning me about things. If they question MY choices, I will be happy to explain. I will also be happy to let them make choices when they express an interest in making those choices.<br/>\n<br/>\nThe easiest analogy is the relationship that I have with my spouse. I will make choices for him based on what I know about him. If he doesn&#39;t like that, he tells me and I act accordingly. Likewise, there are times that I don&#39;t want to be burden with a choice so I let my husband or kids make a decision for me.  <br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\n<br/>\nNo virus found in this incoming message.<br/>\nChecked by AVG - www.avg.com <br/>\nVersion: 9.0.725 / Virus Database: 270.14.124/2598 - Release Date: 01/03/10 03:41:00<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":251210887,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Fears, was Dental was Food and behavior","postDate":"1262564462","msgId":42765,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNDEzNDZFLjkwMzAyMDFAeWFob28uY2E+"},"prevInTopic":0,"nextInTopic":42766,"prevInTime":42764,"nextInTime":42766,"topicId":42765,"numMessagesInTopic":0,"msgSnippet":"I m having difficulty with this issue.  I understand what everyone is saying about not putting our fears onto our children.  And I know that belief in","messageBody":"<div id=\"ygrps-yiv-2084445355\">I&#39;m having difficulty with this issue.  I understand what everyone is <br/>\nsaying about not putting our fears onto our children.  And I know that <br/>\nbelief in &#39;science&#39; and &#39;studies&#39; is questionable, since science changes <br/>\n&quot;its&quot; mind all the time.<br/>\n<br/>\nSomeone said, some kids get cavities no matter how much you brush their <br/>\nteeth.  Some kids never get a cavity and never brush their teeth.  Are <br/>\nthere studies showing that children who brush their teeth regularly have <br/>\na decrease in cavities?  Because, the two other statements could very <br/>\nwell be true, but if brushing would reduce the risk of lots of cavities <br/>\nby 50% (I&#39;m making that up), then it would still be worth it to do that. <br/>\n<br/>\nWhen does sharing our fears become fear-mongering? <br/>\n<br/>\nIf the Mack truck isn&#39;t thundering down the road right now, do you let <br/>\nyour kids (lets say 3-4 years old) play in the street?  Of course it <br/>\ndepends on circumstances, like a little side street versus a heavily <br/>\ntrafficked street.  But say a medium traffic street, its empty right <br/>\nnow, but cars do come by every few minutes. <br/>\n<br/>\nWhen Temima was two, and I never knew which direction she was going to <br/>\nwalk/run, I made sure that we held hands when crossing the street, <br/>\nunless she was in a stroller, and if she refused, I would pick her up <br/>\nand carry her across.  I gave her time to dally, and play, I talked with <br/>\nher, all sorts of stuff... but at the end, there were times when it just <br/>\nwasn&#39;t working, and we did need to cross the street, and I just picked <br/>\nher up.  Or times when we needed to hurry and I just picked her up at <br/>\nthe beginning when she first refused.   As she got more predictable in <br/>\nher &#39;bolting&#39; I slowly let up, and now I remind her that we are coming <br/>\nto a street, and she usually comes to me and holds hands, or holds the <br/>\nstroller, but often also just moves closer, stands close by, etc.  So I <br/>\ndon&#39;t make her hold hands now, because she obviously has an awareness of <br/>\nthe dangers and that I can guide her across, as I try to inform her on <br/>\nthe information that is guiding me, so that she will be able to follow <br/>\nthose signs later on (the walk signs, traffic, check for cars, etc).  <br/>\nSo, when I was forcing her to hold hands or else pick her up, was I <br/>\ntaking her choice away?  Did her age matter?  I followed this &#39;rule&#39; <br/>\nwith her even on small streets, because I&#39;m not able to predict when a <br/>\ncar might suddenly turn onto those streets, or speed up unexpectedly, etc.</div>","specialLinks":[]}],"prevTopicId":42761,"nextTopicId":42776}}