{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Update","postDate":"1152370187","msgId":15452,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFGMDQxQzgxLUYyMjYtNEJERS1BQjNDLUE0NkVCQjlBMjA5NUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDYwNzA3MTUzODA5LjIwNTAzLnFtYWlsQHdlYjUwMzExLm1haWwueWFob28uY29tPg==","referencesHeader":"PDIwMDYwNzA3MTUzODA5LjIwNTAzLnFtYWlsQHdlYjUwMzExLm1haWwueWFob28uY29tPg=="},"prevInTopic":15440,"nextInTopic":0,"prevInTime":15451,"nextInTime":15453,"topicId":15405,"numMessagesInTopic":0,"msgSnippet":"... It will help you relax to see the things they *are* doing rather than what they aren t doing. Picture yourself being able to spend time doing the things","messageBody":"<div id=\"ygrps-yiv-140131729\">On Jul 7, 2006, at 11:38 AM, Jennifer Dion wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Well the kids are loving not doing a thing.<br/>\n<br/>\n </span></blockquote>It will help you relax to see the things they *are* doing rather than  <br/>\nwhat they aren&#39;t doing.<br/>\n<br/>\nPicture yourself being able to spend time doing the things you enjoy:  <br/>\nreading, sewing, driving race cars, talking to friends, having a  <br/>\nlatte, whatever it might be. Then picture you doing those things  <br/>\nwhile your husband hovers in the background waiting for you to spend  <br/>\ntime doing things *he* thinks would be a better use of your free  <br/>\ntime, eg, learning to cook like a gourmet, learning a new language,  <br/>\nlearning how to rebuild carburetors.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I must say I think it is harder for me to transition.<br/>\n<br/>\n </span></blockquote>Yes, parents need to deschool too! Often more than the kids.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Because I feel that we are missing something.<br/>\n<br/>\n </span></blockquote>That&#39;s a hard concept to let go of.<br/>\n<br/>\nIt *feels* like school provides everything someone needs to know to  <br/>\nprepare for college or a job. And it&#39;s *hard* to force that  <br/>\ninformation and those skills into someone, especially those who are  <br/>\nresisting! So it doesn&#39;t feel like kids should be able to get all  <br/>\nthat by living and playing and doing things they find interesting.<br/>\n<br/>\nWhat if there were a list of words all 3 yos should know before they  <br/>\nturned 4 and you found out your child didn&#39;t know 20% of them the day  <br/>\nbefore his 4th birthday. Would you think, &quot;Goodness, he has less than  <br/>\n24 hours to catch up or he&#39;ll be behind and his vocabulary will be  <br/>\nforever stunted.&quot;?<br/>\n<br/>\nThe only reason to think there&#39;s a time limit on learning something  <br/>\nis when it&#39;s being presented in assembly line fashion as in school.<br/>\n<br/>\n1) Tests are designed to show what a child has remembered from what  <br/>\nwas presented to him. They *don&#39;t* show what a child who was doing  <br/>\nsomething else -- like living life! -- learned instead.<br/>\n<br/>\n2) Tests are designed to show what a child has remembered for a test.  <br/>\nThey *don&#39;t* represent understanding. They *don&#39;t* show how long a  <br/>\nchild will remember it.<br/>\n<br/>\nIf you were learning how to sew, would it be possible to miss  <br/>\nsomething you needed? Either your project gives you feedback that  <br/>\nyou&#39;ve missed needed, or you don&#39;t really need it -- like a zipper  <br/>\nthat isn&#39;t going in right, or seams that are splitting. And if  <br/>\nsomething works without it, then it&#39;s not really needed.<br/>\n<br/>\nSchools scare us with the idea that there&#39;s this body of knowledge  <br/>\nthat we need in order to start &quot;real&quot; learning or doing (like college  <br/>\nor a job). Unschoolers know that you learn what you need as you need it.<br/>\n<br/>\nI remember I was reading a book to my daughter when she was 11 and we  <br/>\ncame upon the word &quot;frequently&quot; (I think it was.) Because it was a  <br/>\njoke and because she wanted to understand the joke, she asked what it  <br/>\nmeant. Now at 11 she&#39;d certainly heard frequently used in various  <br/>\ncontexts, had been building an idea of what it meant, but hadn&#39;t  <br/>\nrefined it enough to know exactly. So I told her and she got the joke  <br/>\nand we moved on, with -- as a side effect -- a solid understanding of  <br/>\n&quot;frequently&quot;.<br/>\n<br/>\nThat&#39;s not so much an illustration of how unschooling works, eg,  <br/>\nreading and they ask about words, but an illustration of how learning  <br/>\nworks. As we live life and use various skills and knowledge, we don&#39;t  <br/>\nneed to thoroughly understand them. We just need to understand well  <br/>\nenough for something to work. And as we use them, we refine them and  <br/>\nget better at them *as a side effect*. The point of reading wasn&#39;t to  <br/>\nlearn new words. It was just to enjoy a book. She refined her  <br/>\nunderstanding of &quot;frequently&quot; because she needed it. But it was a  <br/>\nside effect of reading for pleasure.<br/>\n<br/>\nYour kids will pursue what fascinates them. What fascinates them will  <br/>\nget refined over the years. But whatever they end up doing as an  <br/>\nadult will have its foundation in what they&#39;ve been pursuing. If they  <br/>\nshrug off animal shows and trips to the zoo, in favor of a monster  <br/>\ntruck rally, it&#39;s not likely they&#39;re going to decide to be a vet and  <br/>\nneed to catch up on their zoological classifications ;-)<br/>\n<br/>\n(And if they do, it&#39;s because they&#39;ve discovered a passion and  <br/>\nthey&#39;ll *want* the information. Then it will go in effortlessly.)<br/>\n<br/>\nEverything we need, we&#39;ll be using. And because we&#39;re learning from  <br/>\nusing, we&#39;ll learn as effortlessly as we learned English as opposed  <br/>\nto the little learning and lots of effort it took to sit through  <br/>\nSpanish class to end up with a few Spanish words we hadn&#39;t picked up  <br/>\nfrom living. (Like la escritoria. Big fat lot of use that&#39;s been ;-)  <br/>\nThe Spanish words that have come in handy are the ones I&#39;ve  <br/>\nencountered over and over *by living life*.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have to walk away from the TV room because it really makes me  <br/>\n&gt; sick to see my kids just laying in front of the TV.hour after hour.<br/>\n<br/>\n </span></blockquote>There are a lot of aspects to TV watching, especially right after  <br/>\nletting go of controls.<br/>\n<br/>\nFirst, it&#39;s totally common to glut after something&#39;s been restricted.<br/>\n<br/>\nSecond, if they&#39;re coming off school, TV can be a way to relax. I  <br/>\nwatched a *lot* of TV when I was a kid. A *lot*. Lots of classic  <br/>\nmovies. Bowling. Wide World of Sports on weekends. Nova. Lots of  <br/>\n&quot;trash&quot; TV that&#39;s now classics: Lost in Space, Batman, Gilligan&#39;s  <br/>\nIsland ... After my freshman year in college I spent practically the  <br/>\nentire summer watching HBO. I estimated I watched Monty Python and  <br/>\nthe Holy Grail 37 times that summer ;-) (Way back when HBO first  <br/>\nstarted and they played the same few movies over and over and over.)  <br/>\nI wasn&#39;t even sure I liked the movie and definitely didn&#39;t get the  <br/>\nhumor at the beginning of the summer. (Though I did by the end! :-)  <br/>\nDo I regret having &quot;missed&quot; a summer? Not a bit. It was a great  <br/>\nsummer :-)<br/>\n<br/>\nThird, my daughter, who&#39;s never had controls on TV, watched a lot of  <br/>\nCartoon Network between ages 9 and 11. A lot of it was she didn&#39;t  <br/>\nwant to miss what might come on next. She felt at the mercy of the  <br/>\nstation programmers who might throw in a new episode, or switch the  <br/>\nschedule around. Often I would record something so she could watch it  <br/>\nlater if we needed to go do something. (Usually she didn&#39;t watch the  <br/>\ntapes later but it freed her to have the option which live TV  <br/>\ndoesn&#39;t.) What would have really helped was having TiVo. You can set  <br/>\nit to record favorite series and it faithfully stores them on its  <br/>\nhard drive :-)<br/>\n<br/>\nFourth, make sure they have other activities that *they* enjoy just  <br/>\nas much if not more available. Don&#39;t try to entice  them away from  <br/>\nthe TV, but make sure they have opportunities. Try planning at the  <br/>\nbeginning of the week or the day before the things that you find that  <br/>\nyou think the kids will enjoy -- not things that would be good for  <br/>\nthem! Things they&#39;ll enjoy. Run some things by them. Just do other  <br/>\nthings. But you have to be careful about the things you plan without  <br/>\nasking! We only get so many &quot;trust mes&quot; before they stop trusting!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When there is so much to do outside. Our summers don&#39;t last very  <br/>\n&gt; long. So I try to enjoy the summer months as much as possible. My  <br/>\n&gt; children could care less about the outside. With makes me a little  <br/>\n&gt; sad.<br/>\n<br/>\n </span></blockquote>Think about things your husband enjoys but you don&#39;t. What if  <br/>\nwhenever you did something you enjoyed he were regretting that you  <br/>\nwere doing that and not what he loves? How would it feel? What if  <br/>\nyour kids were looking at you frolicking outside and feeling sad that  <br/>\nyou weren&#39;t capable of getting pleasure from all the great offerings  <br/>\nfrom TV? Those kind of thoughts can get into the atmosphere and weigh  <br/>\nit down.<br/>\n<br/>\nIt helps us relax a lot to see the pleasure someone is getting out of  <br/>\nsomething they enjoy rather than to regret that they aren&#39;t the same  <br/>\nas we are! Rather than looking at what they aren&#39;t doing, looking at  <br/>\ntheir happiness and know that you&#39;ve made it possible for them to be  <br/>\nthat happy and free.<br/>\n<br/>\nJoyce<br/>\nAnswers to common unschooling questions:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://home.earthlink.net/~fetteroll/rejoycing/\">http://home.earthlink.net/~fetteroll/rejoycing/</a><br/>\nBlog of writing prompts for speculative fiction writers:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://dragonwritingprompts.blogsome.com/\">http://dragonwritingprompts.blogsome.com/</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":212820206,"authorName":"Jennifer Dion","from":"Jennifer Dion &lt;maggielou007@...&gt;","profile":"maggielou007","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Update","postDate":"1152286689","msgId":15440,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNzA3MTUzODA5LjIwNTAzLnFtYWlsQHdlYjUwMzExLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGU4ajd0diszbzQ0QGVHcm91cHMuY29tPg=="},"prevInTopic":15434,"nextInTopic":15452,"prevInTime":15439,"nextInTime":15441,"topicId":15405,"numMessagesInTopic":0,"msgSnippet":"This is the first summer we haven t had workbook sessions in the morning right after breakfast. That was always our plan.We have never home schooled before let","messageBody":"<div id=\"ygrps-yiv-1599161068\">This is the first summer we haven&#39;t had workbook sessions in the morning right after breakfast. That was always our plan.We have never home schooled before let alone unschooled. So to keep my kids brushed up on there educational skills. We did work books everyday. The teachers at there school would recommend them. Because.This is coming from them not me. &quot;In the summer months kids lost 3 months of there education&quot;. So when they come back to school, they are already 3 months behind. So I was thinking that. What a waste of time and how boring for kids who are not behind.(The ones who work in the work books in the summer of course) To have to sit through 3 months of review. I am just tried of going by there rules. My daughter missed 21 days of school last year. Just because she didn&#39;t want to go. I was fine with that. The school was not. I told them to bad. They couldn&#39;t hold her back because she gets all As.The school wasn&#39;t happy,oh well. At this point I really could care<br/>\n less. She has taught herself all her multiplication tables this summer . I was amazed because she had come up to me and said mom test me on these. Right there I thought what school.  Well the kids are loving not doing a thing. I must say I think it is harder for me to transition. Because I feel that we are missing something.I sure I will get used to it. I have to walk away from the TV room because it really makes me sick to see my kids just laying in front of the TV.hour after hour. When there is so much to do outside. Our summers don&#39;t last very long. So I try to enjoy the summer months as much as possible. My children could care less about the outside. With makes me a little sad.<br/>\nJenny in Sunny Michigan<br/>\n<br/>\nagasma7 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:facingeast@...\">facingeast@...</a>&gt; wrote:                                  I wanted to give an update on our unschooling progress. <br/>\n <br/>\n My eldest daughter (who finished the year at her school) is <br/>\n currently on vacataion with family in another state doing all the <br/>\n wonderful things she loves to do and being spoiled to no end. Can&#39;t <br/>\n wait to get her back though! <br/>\n <br/>\n My 6 year old has been dating other kids like crazy. We went <br/>\n camping, to state parks to play, hiking, swimming and kyacking. <br/>\n (which is more outings than we have taken in a year because of <br/>\n school-hell at home and running back and forth to the private school-<br/>\n which I realize was all self-inflicted). I haven&#39;t pushed a single <br/>\n paper in her direction to complete.<br/>\n <br/>\n She asked me for some papers yesterday because she was tired of <br/>\n playing Barbies. So she matched words to pictures. I almost screwed <br/>\n up and told her she got one wrong. I said, I think this word goes to <br/>\n the other picture. She slapped the table and immediately got <br/>\n frustrated. I looked again at the paper and said &quot;you know what? I&#39;m <br/>\n wrong. It looks like that word can fit there too. (it really could-<br/>\n it just wasn&#39;t the answer THEY wanted). I told her there is more <br/>\n than one way to answer a problem and don&#39;t let anybody tell her <br/>\n there is just one way. Good Job&quot;. She beamed and giggled.<br/>\n <br/>\n She is 6 and isn&#39;t a great reader. She has very little interest in <br/>\n sitting and learning to do it. She isn&#39;t even a bit &quot;read to me&quot; <br/>\n child. Never has been. So instead of stressing about it which I have <br/>\n done so well in the past, I just decided to give her time. I know <br/>\n she will be able to read when she needs to.<br/>\n <br/>\n When we went hiking she pointed out the many animals we saw, gave <br/>\n her opinions on the scene, decided which paths to take. She was such <br/>\n a pleasure to spend time with. <br/>\n <br/>\n Cartoons went off PBS (which, if we are home, I have been letting <br/>\n them watch until they are done)and a documentary about fire ants <br/>\n came on. I assumed she was just zoning with my 3 and half year old. <br/>\n I said, okay, time to turn the tv off and go outside. BOTH of them <br/>\n said &quot;NOoooo&quot; My 6 year old said &quot;This is interesting&quot; and my 3 and <br/>\n half year old put his hands on the tv screen and said &quot;I&#39;m watching <br/>\n it&quot;. LOL! <br/>\n <br/>\n I haven&#39;t even given my son (3 1/2 yr old) a single formal reading <br/>\n lesson or color lesson or shape lesson.<br/>\n He loves books more than any toy and is constantly saying &quot;read to <br/>\n me&quot;. He brings me magazinges, books, pamphlets, whatever. He points <br/>\n to letters and guesses at what they are-I tell him the correct <br/>\n letter, he repeats me, and we continue reading. He wants to know <br/>\n what numbers are and colors are and shapes are. (popcicles are great <br/>\n for that-if I cared) He asks. I don&#39;t have to put him in &quot;circle <br/>\n time&quot; or &quot;book hour&quot;, all day is learning time.<br/>\n <br/>\n We are expecting our 5th child and I took my son with me to an <br/>\n ultrasound. The baby is only 10 wks, so there isn&#39;t much to look at. <br/>\n And for the novice it might be hard to see what it is. As soon as <br/>\n she located the baby, my son said (we had been telling him there was <br/>\n a baby in there) &quot;Look mommy-the baby!&quot; I smiled at him and said <br/>\n yes. He said &quot;The baby is down there in the tummy&quot;. When the baby <br/>\n moved he said &quot;look the baby moved...what&#39;s he doing?&quot; When she went <br/>\n to measure the placenta and we couldn&#39;t see the baby anymore, he <br/>\n said &quot;Mommy, where&#39;d the baby go?&quot; It was classic. I didn&#39;t even <br/>\n know before he said anything that he was watching. I didn&#39;t tell him <br/>\n that we were going to look at the baby either. I just said &quot;going to <br/>\n the dr.&quot; <br/>\n The best part...after it was over and I was sitting in a chair, he <br/>\n was so excited about the baby he walked up to me and said &quot;I wanna <br/>\n see the baby&quot; as he tried to look down my throat! How logical. :) <br/>\n That&#39;s probably how it got in, you know.<br/>\n <br/>\n My baby who is a year and a half watches everything (he actually <br/>\n owns the world, you can see it on his face) brings me books just <br/>\n like his older brother. <br/>\n <br/>\n Today, we are painting in the front yard, and I have a recipe for <br/>\n slime.<br/>\n It&#39;s going to be a really good day...again.<br/>\n <br/>\n Free.<br/>\n <br/>\n <br/>\n     <br/>\n                       <br/>\n<br/>\n \t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\n Get on board. You&#39;re invited to try the new Yahoo! Mail Beta.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":248268539,"authorName":"Elissa Jill Cleaveland","from":"&quot;Elissa Jill Cleaveland&quot; &lt;MystikMomma@...&gt;","profile":"elissajc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Update","postDate":"1152286582","msgId":15434,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjIwMWM2YTFkYiQxYTE5MTkwMCQwMWZlYThjMEBzcXVpZD4=","referencesHeader":"PDJhNi42ZjlmYjMzLjMxZGZjMmFlQGFvbC5jb20+"},"prevInTopic":15432,"nextInTopic":15440,"prevInTime":15433,"nextInTime":15435,"topicId":15405,"numMessagesInTopic":0,"msgSnippet":"It s going to be a really good day...again. ***** Our day is starting out very cool. When we discovered there was no milk left for cereal, we haded out to our","messageBody":"<div id=\"ygrps-yiv-1046347898\">It&#39;s going to be a really good day...again.<br/>\n*****<br/>\nOur day is starting out very cool.<br/>\nWhen we discovered there was no milk left for cereal, we haded out to our local farm market to  pick up two gallons of our favorite milk. They come is glass bottles from an area dairy that uses ecologically responsible practices. Yummy! They were out of everything but skim (yuk, no cream on top), but the farmer gave me a few handfuls of Gardia (sp?) flowers to sprinkle in our morning garden. Those were free!<br/>\nAfter stopping at the country store to pick up regular old ucky milk, we hit the yard sale next door. 2 belts, a Pokedex, a Pokemon lunch box, and a new deck of Pokemon trading cards. ($8.00). As we headed home to play with our treasures while watching Spirited Away (On cartoon network right now!!) we saw  a woman walking down our road with a GOAT on a leash! It turns out that this goat was hand raised in the house by the woman, after the mother rejected it, and thinks it&#39;s a dog. She loves to go on walks. We got some great leads on natural local meats although we are still looking for raw milk.<br/>\nNow I&#39;m going to spend some time on the food sites and find a spectacular fruit basket to make for a neighbor&#39;s wedding tomorrow, in the hopes that it&#39;ll wow someone who is looking for a fledgeling caterer.<br/>\nTonight we&#39;re going to the annual Trebuchet festival in our crunchy granola town to see Watermelons flung hundreds of feet and hear great music.<br/>\nAs ZenMomma says, &quot;Life is Good.&quot;<br/>\nElissa Jill<br/>\nA Kindersher saychel iz oychet a saychel.<br/>\n&quot;A Child&#39;s wisdom is also wisdom.&quot; ~Yiddish Proverb<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":92643757,"authorName":"Leslie530@aol.com","from":"Leslie530@...","profile":"lescather","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Update","postDate":"1152280750","msgId":15432,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJhNi42ZjlmYjMzLjMxZGZjMmFlQGFvbC5jb20+"},"prevInTopic":15427,"nextInTopic":15434,"prevInTime":15431,"nextInTime":15433,"topicId":15405,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/6/2006 1:38:31 P.M. Eastern Daylight Time, facingeast@surewest.net writes: Today,  we are painting in the front yard, and I have a recipe","messageBody":"<div id=\"ygrps-yiv-1505293066\">In a message dated 7/6/2006 1:38:31 P.M. Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:facingeast@...\">facingeast@...</a> writes:<br/>\n<br/>\nToday,  we are painting in the front yard, and I have a recipe for <br/>\nslime.<br/>\nIt&#39;s  going to be a really good day...again.<br/>\n<br/>\nFree.<br/>\n<br/>\n<br/>\n********<br/>\n <br/>\nThanks, I enjoyed a glimpse into your day.  I remember those early  &quot;hey, I&#39;m <br/>\nunschooling!&quot; days and they were magical!<br/>\n <br/>\nAs with life, some days are less than magical &lt;g&gt;, but they are  always <br/>\nbetter than live before unschooling.<br/>\n <br/>\nHave a great day, again.<br/>\n <br/>\nLeslie in SC<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":229821133,"authorName":"WitchyMama","from":"WitchyMama &lt;witchymama2@...&gt;","profile":"lady_ivey","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Update","postDate":"1152233195","msgId":15427,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyN2U4MGE5MDYwNzA2MTc0NncyNjdiZjJhM281YzIxN2RhMDM2YjYzODJlQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGU4ajd0diszbzQ0QGVHcm91cHMuY29tPg==","referencesHeader":"PGU4ajd0diszbzQ0QGVHcm91cHMuY29tPg=="},"prevInTopic":15423,"nextInTopic":15432,"prevInTime":15426,"nextInTime":15428,"topicId":15405,"numMessagesInTopic":0,"msgSnippet":"I just wanted to say, as someone just beginning and practicing letting go and trusting in my childrens natural desire to learn... this was beautiful and","messageBody":"<div id=\"ygrps-yiv-1166921947\">I just wanted to say, as someone just beginning and practicing &quot;letting go&quot;<br/>\nand trusting in my childrens natural desire to learn... this was beautiful<br/>\nand encouraging to read. Thank you! =)<br/>\n<br/>\n~Ana<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 7/6/06, agasma7 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:facingeast@...\">facingeast@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   I wanted to give an update on our unschooling progress.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; .__,<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Update","postDate":"1152231583","msgId":15423,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlEQzQ0NzAyLUYwQTEtNDQxRC1CRUUzLTU0M0Q2MTEzODhGNEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGU4ajd0diszbzQ0QGVHcm91cHMuY29tPg==","referencesHeader":"PGU4ajd0diszbzQ0QGVHcm91cHMuY29tPg=="},"prevInTopic":15405,"nextInTopic":15427,"prevInTime":15422,"nextInTime":15424,"topicId":15405,"numMessagesInTopic":0,"msgSnippet":"... Just to reinforce your own decision, here -- I have three kids who didn t have formal reading lessons or color lessons or shape lessons. Can you believe","messageBody":"<div id=\"ygrps-yiv-809580476\">On Jul 6, 2006, at 7:49 AM, agasma7 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I haven&#39;t even given my son (3 1/2 yr old) a single formal reading<br/>\n&gt; lesson or color lesson or shape lesson.<br/>\n<br/>\n </span></blockquote>Just to reinforce your own decision, here -- I have three kids who  <br/>\ndidn&#39;t have formal reading lessons or color lessons or shape lessons.<br/>\n<br/>\nCan you believe it? At 21, 18, and 15 they not only know how to read,  <br/>\nthey know the names of colors and shapes I&#39;ve never even heard of! &lt;G&gt;<br/>\n<br/>\n-pam<br/>\n<br/>\nUnschooling shirts, cups, bumper stickers, bags...<br/>\nLive Love Learn<br/>\nUNSCHOOL!<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cafepress.com/livelovelearn\">http://www.cafepress.com/livelovelearn</a>&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265650445,"authorName":"agasma7","from":"&quot;agasma7&quot; &lt;facingeast@...&gt;","profile":"agasma7","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Update","postDate":"1152197375","msgId":15405,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU4ajd0diszbzQ0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":15423,"prevInTime":15404,"nextInTime":15406,"topicId":15405,"numMessagesInTopic":0,"msgSnippet":"I wanted to give an update on our unschooling progress. My eldest daughter (who finished the year at her school) is currently on vacataion with family in","messageBody":"<div id=\"ygrps-yiv-960631735\">I wanted to give an update on our unschooling progress. <br/>\n<br/>\nMy eldest daughter (who finished the year at her school) is <br/>\ncurrently on vacataion with family in another state doing all the <br/>\nwonderful things she loves to do and being spoiled to no end. Can&#39;t <br/>\nwait to get her back though! <br/>\n<br/>\nMy 6 year old has been dating other kids like crazy. We went <br/>\ncamping, to state parks to play, hiking, swimming and kyacking. <br/>\n(which is more outings than we have taken in a year because of <br/>\nschool-hell at home and running back and forth to the private school-<br/>\nwhich I realize was all self-inflicted). I haven&#39;t pushed a single <br/>\npaper in her direction to complete.<br/>\n<br/>\nShe asked me for some papers yesterday because she was tired of <br/>\nplaying Barbies. So she matched words to pictures. I almost screwed <br/>\nup and told her she got one wrong. I said, I think this word goes to <br/>\nthe other picture. She slapped the table and immediately got <br/>\nfrustrated. I looked again at the paper and said &quot;you know what? I&#39;m <br/>\nwrong. It looks like that word can fit there too. (it really could-<br/>\nit just wasn&#39;t the answer THEY wanted). I told her there is more <br/>\nthan one way to answer a problem and don&#39;t let anybody tell her <br/>\nthere is just one way. Good Job&quot;. She beamed and giggled.<br/>\n<br/>\nShe is 6 and isn&#39;t a great reader. She has very little interest in <br/>\nsitting and learning to do it. She isn&#39;t even a bit &quot;read to me&quot; <br/>\nchild. Never has been. So instead of stressing about it which I have <br/>\ndone so well in the past, I just decided to give her time. I know <br/>\nshe will be able to read when she needs to.<br/>\n<br/>\nWhen we went hiking she pointed out the many animals we saw, gave <br/>\nher opinions on the scene, decided which paths to take. She was such <br/>\na pleasure to spend time with. <br/>\n<br/>\nCartoons went off PBS (which, if we are home, I have been letting <br/>\nthem watch until they are done)and a documentary about fire ants <br/>\ncame on. I assumed she was just zoning with my 3 and half year old. <br/>\nI said, okay, time to turn the tv off and go outside. BOTH of them <br/>\nsaid &quot;NOoooo&quot; My 6 year old said &quot;This is interesting&quot; and my 3 and <br/>\nhalf year old put his hands on the tv screen and said &quot;I&#39;m watching <br/>\nit&quot;. LOL! <br/>\n<br/>\nI haven&#39;t even given my son (3 1/2 yr old) a single formal reading <br/>\nlesson or color lesson or shape lesson.<br/>\nHe loves books more than any toy and is constantly saying &quot;read to <br/>\nme&quot;. He brings me magazinges, books, pamphlets, whatever. He points <br/>\nto letters and guesses at what they are-I tell him the correct <br/>\nletter, he repeats me, and we continue reading. He wants to know <br/>\nwhat numbers are and colors are and shapes are. (popcicles are great <br/>\nfor that-if I cared) He asks. I don&#39;t have to put him in &quot;circle <br/>\ntime&quot; or &quot;book hour&quot;, all day is learning time.<br/>\n<br/>\nWe are expecting our 5th child and I took my son with me to an <br/>\nultrasound. The baby is only 10 wks, so there isn&#39;t much to look at. <br/>\nAnd for the novice it might be hard to see what it is. As soon as <br/>\nshe located the baby, my son said (we had been telling him there was <br/>\na baby in there) &quot;Look mommy-the baby!&quot; I smiled at him and said <br/>\nyes. He said &quot;The baby is down there in the tummy&quot;. When the baby <br/>\nmoved he said &quot;look the baby moved...what&#39;s he doing?&quot; When she went <br/>\nto measure the placenta and we couldn&#39;t see the baby anymore, he <br/>\nsaid &quot;Mommy, where&#39;d the baby go?&quot; It was classic. I didn&#39;t even <br/>\nknow before he said anything that he was watching. I didn&#39;t tell him <br/>\nthat we were going to look at the baby either. I just said &quot;going to <br/>\nthe dr.&quot; <br/>\nThe best part...after it was over and I was sitting in a chair, he <br/>\nwas so excited about the baby he walked up to me and said &quot;I wanna <br/>\nsee the baby&quot; as he tried to look down my throat! How logical. :) <br/>\nThat&#39;s probably how it got in, you know.<br/>\n<br/>\nMy baby who is a year and a half watches everything (he actually <br/>\nowns the world, you can see it on his face) brings me books just <br/>\nlike his older brother. <br/>\n<br/>\nToday, we are painting in the front yard, and I have a recipe for <br/>\nslime.<br/>\nIt&#39;s going to be a really good day...again.<br/>\n<br/>\nFree.</div>","specialLinks":[]}],"prevTopicId":15429,"nextTopicId":15336}}