{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] intro. and manners","postDate":"1093428394","msgId":2956,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDIwMDQwODI0MTUzMjI4Ljg1MjczLnFtYWlsQHdlYjUxNzA0Lm1haWwueWFob28uY29tPg=="},"prevInTopic":2948,"nextInTopic":0,"prevInTime":2955,"nextInTime":2957,"topicId":2935,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1799727632\">&lt;&lt;&lt;&lt;Well, at the time, I DID send my kids to public school -- and there was<br/>\nno intention to humiliate about it -- it was *natural consequences* of his<br/>\nchoice.  We cannot protect them from everything, and if he were going to be<br/>\nTHAT insistent about wearing his pjs, so be it ... there DOES come a time<br/>\nwhen you have to be firm -- whether it&#39;s about not running into the street,<br/>\nor doing an unpleasant task ... whether they&#39;re *ready* or not.  Although I<br/>\nwork with my kids and compromise and negotiate, I AM still the mom, and<br/>\nthere ARE times when we ALL have to do something, whether we want to or not.<br/>\nLet&#39;s understand and respect MY situation in those days, as a single mom<br/>\ngoing to college and working two jobs -- I sent my kids to ps!   Did I want<br/>\nto?  No, BUT ... sometimes the best of plans are overtaken by events out of<br/>\nour control    :)   And how a kid feels is HIS choice -- but I WILL help him<br/>\nunderstand those feelings and work through them, which you ought to do also<br/>\n-- there WILL be<br/>\n times when kids feel unpleasant emotions -- it&#39;s a fact of life.&gt;&gt;&gt;<br/>\n<br/>\nIf you are going to post experiences that suggest that you were not being<br/>\nrespectful of your children, people here are going to challenge it.<br/>\n<br/>\nIf you were sending your children to school for essential reasons of<br/>\npracticality, then that is where your life was, but it is not the same for<br/>\nthe children as having the free choice to go there. It was a time in your<br/>\nlife when Unschooling was apparently impossible. You don&#39;t have to live now<br/>\nas if your kids were still in school.<br/>\n<br/>\nThis list is about Unschooling. The focus will always, always be on helping<br/>\npeople get to an understanding and practical application of Unschooling in<br/>\ntheir lives, regardless of their history and prior school experiences. The<br/>\npoint of view expressed here will generally be in favor of more respect for<br/>\nchildren, and a child&#39;s autonomy, and more kindness, more equality, more<br/>\nunderstanding. We will protect our children, because we can, in order to<br/>\ngive them a place of strength to step out from. Have you read Sandra&#39;s<br/>\nEmpowerment Certificate?<br/>\n<br/>\nwww.sandradodd.com/empowerment<br/>\n<br/>\nEmphatic statements that place the mom ahead of the child will be<br/>\nchallenged. Sometimes this kind of language suggests that you are not<br/>\nexamining ideas with the eyes of an Unschooler.<br/>\n<br/>\nIf you are living by Principles instead of Rules, such as the principle of<br/>\nSafety First, there gets to be a lot less being firm, and a lot more<br/>\npleasant reminders when necessary. If Mom is the only person who has to be<br/>\nhappy with the compromise, it isn&#39;t really compromise. When Jayn doesn&#39;t<br/>\nwant to do something that might be essential, I wait for her to be ready.<br/>\nThe list of things that are genuinely essential is very small. <br/>\n <br/>\n&lt;&lt;&lt;&lt;So, let&#39;s be a little more respectful and less critical of someone<br/>\nelse&#39;s experiences, shall we?&gt;&gt;&gt;&gt;<br/>\n<br/>\nOnly if it helps other people get to Unschooling. You were talking about a<br/>\nschool experience. <br/>\n<br/>\nLet&#39;s face it. You could have just quietly brought some other clothes for<br/>\nhim to change into, without comment, when he saw what others were wearing<br/>\nand felt embarrassed. You wanted him to learn an unpleasant lesson, and<br/>\npretend that it was &quot;natural consequences&quot;. That kind of action won&#39;t get<br/>\nyou respect on this Unschooling list. Talking about how you have changed now<br/>\nwill.<br/>\n<br/>\nRobyn L. Coburn <br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.740 / Virus Database: 494 - Release Date: 8/16/2004</div>","specialLinks":[]},{"userId":141910957,"authorName":"Valerie","from":"&quot;Valerie&quot; &lt;valerie@...&gt;","profile":"valfitz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"manners","postDate":"1093391279","msgId":2948,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNnZ2szZitza2IyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDQwODI0MTU1MjI5LjcwNDYucW1haWxAd2ViNTM4MTAubWFpbC55YWhvby5jb20+"},"prevInTopic":2943,"nextInTopic":2956,"prevInTime":2947,"nextInTime":2949,"topicId":2935,"numMessagesInTopic":0,"msgSnippet":"... express gratitude and kindness is to treat them, and others, with kindness and gratitude.  Then trust that they ll adopt your behaviors without the need to","messageBody":"<div id=\"ygrps-yiv-848947269\"><blockquote><span title=\"ireply\">&gt; The only really effective way to help your children learn to <br/>\n </span></blockquote>express gratitude and kindness is to treat them, and others, with <br/>\nkindness and gratitude.  Then trust that they&#39;ll adopt your <br/>\nbehaviors without the need to constantly nag them.  I find that, <br/>\nmost often, the parents who feel the need to &#39;teach&#39; kids to say <br/>\nthank you & please, seldom say those words to their own children.<br/>\n<blockquote><span title=\"ireply\"> &gt;  <br/>\n&gt; Syl<br/>\n<br/>\n </span></blockquote>****** Bowing low to Syl. Perfect, totally perfect. <br/>\n<br/>\nIn Laurie&#39;s advanced grammar class, the students were asked to write <br/>\na letter showing personal opinions about honorifics. Laurie wrote <br/>\nabout how she found the words to be superficial if said only because <br/>\nit was the proper thing to say rather than something you truly felt <br/>\nfrom your heart. <br/>\n<br/>\nWhen 14-year old Laurie&#39;s grandmother gave her a birthday card in <br/>\nfront of 100 or so other relatives and the inscription read, &quot;We <br/>\nlove you and it&#39;s important that you lose some weight,&quot; (not <br/>\nverbatim, but as close as I can remember) Laurie didn&#39;t feel obliged <br/>\nto thank her for the card. :-| <br/>\n<br/>\nLaurie only uses honorifics when she feels sincerity about them. I <br/>\nknow when she tells me &quot;thank you&quot; that she REALLY means it...that <br/>\nI&#39;ve done something special. I like that. <br/>\n<br/>\nLaurie&#39;s professor said, &quot;Well, it&#39;s common in the south to use <br/>\nhonorifics, but since your mom isn&#39;t from the south, it&#39;s <br/>\nunderstandable that you don&#39;t use them religiously.&quot; Laurie <br/>\nsaid, &quot;My mom was born and raised here.&quot; Prof said, &quot;WOW! How did <br/>\nshe escape the southern mentality?&quot; Laurie grinned and said <br/>\nsomething about how &quot;weird&quot; her mom was. Made me smile. :-) <br/>\n<br/>\nlove, Valerie<br/>\nwww.ubpub.com</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] intro. and manners","postDate":"1093363099","msgId":2943,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODI0MTU1ODE5LjU5MTAxLnFtYWlsQHdlYjUzODA4Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDIwMDQwODI0MTUzMjI4Ljg1MjczLnFtYWlsQHdlYjUxNzA0Lm1haWwueWFob28uY29tPg=="},"prevInTopic":2937,"nextInTopic":2948,"prevInTime":2942,"nextInTime":2944,"topicId":2935,"numMessagesInTopic":0,"msgSnippet":"We were at the bank the other day and the teller went to get Jalen a lolly. I whispered let s make sure we tell her thanks for getting the color you wanted","messageBody":"<div id=\"ygrps-yiv-1757960478\">We were at the bank the other day and the teller went to get Jalen a lolly. I whispered &quot;let&#39;s make sure we tell her thanks for getting the color you wanted&quot; or something along those lines, but when she came back he just grinned and grabbed the lolly. I said &quot;thank you so much&quot; and we left. I think it would be humiliating to have someone making ME say something in front of people, so I won&#39;t do that to them. <br/>\n<br/>\nRen<br/>\n*****<br/>\n<br/>\nThat&#39;s just kind of situation where my mil would insist the child say thank you for the treat.  We&#39;ve had a few occasions where she pushed a child so far, he no longer wanted the treat, said so and was angry.  How did that help anyone? And she&#39;ll wonder why he declines when someone offers to do something unexpected for him. <br/>\n<br/>\nBesides that, in a 3yo child, a smile is the best kind of thank you!  I&#39;d much rather get a big smile on an otherwise shy face (3 is so shy sometimes) than a parroted thank you.<br/>\n<br/>\nSyl<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nWin 1 of 4,000 free domain names from Yahoo! Enter now.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] intro. and manners","postDate":"1093362749","msgId":2937,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODI0MTU1MjI5LjcwNDYucW1haWxAd2ViNTM4MTAubWFpbC55YWhvby5jb20+","inReplyToHeader":"PDIwMDQwODI0LjA4MjE1OS4yMTg0My4zOTkyNDdAd2VibWFpbDIxLm55Yy51bnRkLmNvbT4="},"prevInTopic":2936,"nextInTopic":2943,"prevInTime":2936,"nextInTime":2938,"topicId":2935,"numMessagesInTopic":0,"msgSnippet":"On the manners issue, this is one of my husband s favorites, because his Mom has always made the biggest fuss about thank you & please.  He spent his entire","messageBody":"<div id=\"ygrps-yiv-1834030954\">On the manners issue, this is one of my husband&#39;s favorites, because his Mom has always made the biggest fuss about thank you & please.  He spent his entire childhood being hounded to say thank you -- and with her one can&#39;t possibly say thank you enough!  His feeling is that nagging a child (or anyone) to constantly say thank you and please somehow conveys that they are unworthy of whatever it is they received, and only benefited because someone deigned to do so.  Like if you&#39;re not grateful enough, it&#39;ll all be pulled away.  Just a very artificial and unhealthy feel to things.  <br/>\n <br/>\nReminding your kids to say thank you and please (or any other expected thing) also implies to them that you don&#39;t expect them to remember it on their own, or that you don&#39;t feel they&#39;re being appropriately grateful for all that&#39;s been done for them.  <br/>\n <br/>\nOur kids say please and thank you regularly.  They&#39;re also pretty quick with I&#39;m sorry or excuse me.  Not because we&#39;ve drummed it into them (tho my mil tries) but because that&#39;s what we do, with each other and with them.  Also heard often around here are &#39;no problem&#39; or &#39;sure thing&#39; in anwer to requests to help with something.  <br/>\n <br/>\nThe only really effective way to help your children learn to express gratitude and kindness is to treat them, and others, with kindness and gratitude.  Then trust that they&#39;ll adopt your behaviors without the need to constantly nag them.  I find that, most often, the parents who feel the need to &#39;teach&#39; kids to say thank you & please, seldom say those words to their own children.<br/>\n <br/>\nSyl<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nWin 1 of 4,000 free domain names from Yahoo! Enter now.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":57650593,"authorName":"Anne","from":"Anne &lt;texascathouse@...&gt;","profile":"texascathouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] intro. and manners","postDate":"1093361548","msgId":2936,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODI0MTUzMjI4Ljg1MjczLnFtYWlsQHdlYjUxNzA0Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDIwMDQwODI0LjA4MjE1OS4yMTg0My4zOTkyNDdAd2VibWFpbDIxLm55Yy51bnRkLmNvbT4="},"prevInTopic":2935,"nextInTopic":2937,"prevInTime":2935,"nextInTime":2937,"topicId":2935,"numMessagesInTopic":0,"msgSnippet":"Well, at the time, I DID send my kids to public school -- and there was no intention to humiliate about it -- it was *natural consequences* of his choice.  We","messageBody":"<div id=\"ygrps-yiv-1015458555\">Well, at the time, I DID send my kids to public school -- and there was no intention to humiliate about it -- it was *natural consequences* of his choice.  We cannot protect them from everything, and if he were going to be THAT insistent about wearing his pjs, so be it ... there DOES come a time when you have to be firm -- whether it&#39;s about not running into the street, or doing an unpleasant task ... whether they&#39;re *ready* or not.  Although I work with my kids and compromise and negotiate, I AM still the mom, and there ARE times when we ALL have to do something, whether we want to or not.  Let&#39;s understand and respect MY situation in those days, as a single mom going to college and working two jobs -- I sent my kids to ps!   Did I want to?  No, BUT ... sometimes the best of plans are overtaken by events out of our control    :)   And how a kid feels is HIS choice -- but I WILL help him understand those feelings and work through them, which you ought to do also -- there WILL be<br/>\n times when kids feel unpleasant emotions -- it&#39;s a fact of life.<br/>\n <br/>\nSo, let&#39;s be a little more respectful and less critical of someone else&#39;s experiences, shall we?<br/>\n <br/>\nAnne  <br/>\n<br/>\nRen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt; wrote:<br/>\n<br/>\n&quot;. for example, a kid who refused to get dressed <br/>\nfor kindergarten ... well, when told he HAD to go, he chose to go in his pj&#39;s <br/>\n... no problem for me, but HE didn&#39;t like being the center of attention that <br/>\nday, and it didn&#39;t happen again.  &quot;<br/>\n<br/>\nI don&#39;t think this is a good example for an unschooling list.<br/>\nFirst of all, our children AREN&#39;T told they have to go to school...ever, and secondly, I would never humiliate my child by making them wear pajamas somewhere it would bother them.<br/>\n<br/>\nIf my child didn&#39;t want to get ready to go somewhere, I would assume that either they don&#39;t want to go or they need more help from me.<br/>\n<br/>\nAs to the manners issues, children learn what they are surrounded by.<br/>\nMy little guy (Jalen is 3.5) almost ALWAYS says &quot;thanks mom&quot; when I bring him food or paint or whatever he wants. He&#39;s heard us saying it and so he says it. I&#39;ve found that&#39;s pretty normal.<br/>\nMy children don&#39;t need force to learn anything. They do sometimes need a prompt here or there as a gentle reminder. &quot;let&#39;s make sure we let so-and-so know how grateful we are for ___________&quot;<br/>\nIf they say thank you, great...but sometimes we show gratefulness other ways too, and sometimes they forget and I say thank you for them without saying a thing to the child.<br/>\nWe were at the bank the other day and the teller went to get Jalen a lolly. I whispered &quot;let&#39;s make sure we tell her thanks for getting the color you wanted&quot; or something along those lines, but when she came back he just grinned and grabbed the lolly. I said &quot;thank you so much&quot; and we left.<br/>\nI think it would be humiliating to have someone making ME say something in front of people, so I won&#39;t do that to them. <br/>\n<br/>\nThe only things set in stone around here are about respecting other people&#39;s boundaries and trying to create positive energy in our home.<br/>\nThat&#39;s it.<br/>\nJust about everything else is flexible or up for negotiation.<br/>\n<br/>\nRen<br/>\n<br/>\n<br/>\nLearn about unschooling at:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n                 <br/>\n<br/>\nYahoo! Groups SponsorADVERTISEMENT<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nYahoo! Groups Links<br/>\n<br/>\n   To visit your group on the web, go to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n  <br/>\n   To unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n  <br/>\n   Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n~  Not all who wander are lost .... ~<br/>\n <br/>\nWell-behaved women rarely make history.<br/>\n <br/>\n&quot;There are more things in heaven and earth, Horatio, Than are dreamt of in your philosophy.&quot; <br/>\n<br/>\n--From Hamlet (I, v, 166-167)<br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! Mail - 50x more storage than other providers!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren","from":"&quot;Ren&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"intro. and manners","postDate":"1093360870","msgId":2935,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODI0LjA4MjE1OS4yMTg0My4zOTkyNDdAd2VibWFpbDIxLm55Yy51bnRkLmNvbT4="},"prevInTopic":0,"nextInTopic":2936,"prevInTime":2934,"nextInTime":2936,"topicId":2935,"numMessagesInTopic":0,"msgSnippet":". for example, a kid who refused to get dressed for kindergarten ... well, when told he HAD to go, he chose to go in his pj s ... no problem for me, but HE","messageBody":"<div id=\"ygrps-yiv-398734228\">&quot;. for example, a kid who refused to get dressed <br/>\nfor kindergarten ... well, when told he HAD to go, he chose to go in his pj&#39;s <br/>\n... no problem for me, but HE didn&#39;t like being the center of attention that <br/>\nday, and it didn&#39;t happen again.  &quot;<br/>\n<br/>\nI don&#39;t think this is a good example for an unschooling list.<br/>\nFirst of all, our children AREN&#39;T told they have to go to school...ever, and secondly, I would never humiliate my child by making them wear pajamas somewhere it would bother them.<br/>\n<br/>\nIf my child didn&#39;t want to get ready to go somewhere, I would assume that either they don&#39;t want to go or they need more help from me.<br/>\n<br/>\nAs to the manners issues, children learn what they are surrounded by.<br/>\nMy little guy (Jalen is 3.5) almost ALWAYS says &quot;thanks mom&quot; when I bring him food or paint or whatever he wants. He&#39;s heard us saying it and so he says it. I&#39;ve found that&#39;s pretty normal.<br/>\nMy children don&#39;t need force to learn anything. They do sometimes need a prompt here or there as a gentle reminder. &quot;let&#39;s make sure we let so-and-so know how grateful we are for ___________&quot;<br/>\nIf they say thank you, great...but sometimes we show gratefulness other ways too, and sometimes they forget and I say thank you for them without saying a thing to the child.<br/>\nWe were at the bank the other day and the teller went to get Jalen a lolly. I whispered &quot;let&#39;s make sure we tell her thanks for getting the color you wanted&quot; or something along those lines, but when she came back he just grinned and grabbed the lolly. I said &quot;thank you so much&quot; and we left.<br/>\nI think it would be humiliating to have someone making ME say something in front of people, so I won&#39;t do that to them. <br/>\n<br/>\nThe only things set in stone around here are about respecting other people&#39;s boundaries and trying to create positive energy in our home.<br/>\nThat&#39;s it.<br/>\nJust about everything else is flexible or up for negotiation.<br/>\n<br/>\nRen<br/>\n<br/>\n<br/>\nLearn about unschooling at:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a></div>","specialLinks":[]}],"prevTopicId":2950,"nextTopicId":2921}}