{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":140885507,"authorName":"Kathleen Gehrke","from":"&quot;Kathleen Gehrke&quot; &lt;gehrkes@...&gt;","profile":"gehrkes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Is my life too boring for unschooling...This is Mine, what&#39;s your&#39;s like?","postDate":"1183071218","msgId":24748,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY2MWU1aSs1dm5oQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDcwNjI4MjE1NTI3LjQzOTQyLnFtYWlsQHdlYjI3MzAyLm1haWwudWtsLnlhaG9vLmNvbT4="},"prevInTopic":24747,"nextInTopic":0,"prevInTime":24747,"nextInTime":24749,"topicId":24747,"numMessagesInTopic":0,"msgSnippet":"... but ... people ... up ... I would say we are not average. We are a large family, fairly isolated living five miles north of a town of 2,800. The nearest ","messageBody":"<div id=\"ygrps-yiv-395959306\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; stacyzme &lt;stacyzme@yahoo. com&gt; wrote:<br/>\n&gt; <br/>\n&gt;   I have read many of John Holts books and numerous unschooling <br/>\n&gt; websites/blogs and I am both excited and nervous. Most of the <br/>\n&gt; featured families seem to live much more enriching lives than our <br/>\n&gt; family. I am not complaining, I love our life and felt content, <br/>\n </span></blockquote>but <br/>\n<blockquote><span title=\"ireply\"> &gt; now I wonder if it is &quot;enough&quot; of an environment to unschool. <br/>\n&gt;    <br/>\n&gt;   So I guess I am wondering how average (god I hate that word) <br/>\n </span></blockquote>people <br/>\n<blockquote><span title=\"ireply\"> &gt; unschool. Do they? Or maybe this is also an opportunity to really <br/>\n&gt; examine the &quot;averageness&quot; of our lives and make some changes? Are <br/>\n&gt; there any reading materials that include how children are soaking <br/>\n </span></blockquote>up <br/>\n<blockquote><span title=\"ireply\"> &gt; knowledge in the midst of conventional life? Or are the featured <br/>\n&gt; families I am reading about not the norm but the &quot;goal&quot;?&quot;<br/>\n&gt;    <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I would say we are not average. We are a large family, fairly <br/>\nisolated living five miles north of a town of 2,800. The nearest <br/>\nlarge town is 120 miles away.<br/>\n<br/>\nOur day right now are swim team practice, big breakfast, gaming, TV, <br/>\nreading, board games, training the dogs, painting. Lunch somewhere <br/>\nin the middle of that.In the evenning we generally, after another <br/>\nhours swim team practice, sing, dance around to music from the <br/>\ncomputer. We play pool, check the chickens,jump on the trampoline, <br/>\nplay cribbage or another game. Sometimes we practice backflips on <br/>\nthe tramp, ride our bikes, walk to the creek and look for crawdads <br/>\nor fish. Kids invite town kids out and that usually means playing <br/>\nthe Wii or World of Warcraft, Guitar Hero. We rent movies from <br/>\nNetflix and things here settle down for the night somewhere between <br/>\n11 and 1 am. <br/>\n<br/>\nIt is a good, busy, full life.<br/>\n<br/>\nOn occasion we travel. This spring we took all seven kids who are <br/>\nhome to Washington DC. We camped and looked all over. We just <br/>\nreturned from a family week, with my sibs and grown kids and their <br/>\nkids to a lake. There we swam, boated and fished. We played cards <br/>\ntill one am. every night. We ate great food and had a great visit.<br/>\n<br/>\nThis weekend we will have two extra kids and go to a swim meet in a <br/>\ntown about thirty miles away. <br/>\n<br/>\nI used to worry that my life was boring and my kids would not be <br/>\nenriched and then it happened we started enjoying the day.<br/>\n<br/>\nGood wishes,<br/>\nKathleen</div>","specialLinks":[]},{"userId":274933479,"authorName":"sharon currie","from":"sharon currie &lt;lyeping2607@...&gt;","profile":"lyeping2607","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Is my life too boring for unschooling...This is Mine, what&#39;s your&#39;s like?","postDate":"1183067727","msgId":24747,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwNjI4MjE1NTI3LjQzOTQyLnFtYWlsQHdlYjI3MzAyLm1haWwudWtsLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":24748,"prevInTime":24746,"nextInTime":24748,"topicId":24747,"numMessagesInTopic":0,"msgSnippet":"stacyzme  wrote: I have read many of John Holts books and numerous unschooling websites/blogs and I am both excited and nervous. Most of","messageBody":"<div id=\"ygrps-yiv-645737189\">stacyzme &lt;stacyzme@yahoo. com&gt; wrote:<br/>\n<br/>\n  I have read many of John Holts books and numerous unschooling <br/>\nwebsites/blogs and I am both excited and nervous. Most of the <br/>\nfeatured families seem to live much more enriching lives than our <br/>\nfamily. I am not complaining, I love our life and felt content, but <br/>\nnow I wonder if it is &quot;enough&quot; of an environment to unschool. <br/>\n   <br/>\n  So I guess I am wondering how average (god I hate that word) people <br/>\nunschool. Do they? Or maybe this is also an opportunity to really <br/>\nexamine the &quot;averageness&quot; of our lives and make some changes? Are <br/>\nthere any reading materials that include how children are soaking up <br/>\nknowledge in the midst of conventional life? Or are the featured <br/>\nfamilies I am reading about not the norm but the &quot;goal&quot;?&quot;<br/>\n   <br/>\n   <br/>\n  Hmmmm... good point Stacyzme. Let&#39;s examin it coz I&#39;m thinking the same as you. Are these featured families not the norm but goals? Or could it be just the end result of years and years of homeschooling? Well, I think our homeschooling life is pretty basic and plain and I know a few more of our homeschooling friends just like us( could be because our children are around the same age, it also means we&#39;re unschooling for about the same time). <br/>\n  This is my average weekly routine and I&#39;ve been unschooling since February. <br/>\n   <br/>\n  Monday - Staying in Day because we&#39;re normally busy during weekends with daddy. <br/>\n  Tuesday - we sometimes go swimming in the evening with another homeschooling friend.<br/>\n  Wed - At the moment it&#39;s Nowhere to go Day because our regular Homeschooling gathering has stopped until Sept. <br/>\n  Alternate Thursday - another Homeschooling gathering/ Nowhere to go Day  <br/>\n  Friday - Nowhere to go Day<br/>\n   <br/>\n  Unless if we are out for the 3/4 of the day (i normally schedule 1-2 outings per week but there are times we&#39;ll have events to go to, everyday of the week especially now in the summer, we have lots of excursions to parks and farms), our normal routine is PS2 in the morning till lunch, then me and son do something together like watch tv or play board/ card game, at the moment it is trivial pursuit, then it&#39;s off for a walk around the block or a trip to the library which is just round the corner from our house. Then when we&#39;re back home, son gets onto the pc games/internet while I cook dinner. After dinner, it&#39;s shower time and then it&#39;s tv time/ board game with daddy and me before going to bed at 10ish with bedtime story. Sometimes son&#39;ll last thru 3 stories, sometimes it&#39;s only halfway thru the 1st book. <br/>\n  Weekend is about spending time with daddy playing in the park, sometimes swimming or just potter around the house/ garden. <br/>\n   <br/>\n  And to fill those days when we have nowhere to go, this summer, we&#39;ll have the usage of a private field/ farm which belongs to a kind homeschooling friend of ours, for a small token rental of GBP 10 per month which I insist she must accept. This is also my way of intergrating nature into my son&#39;s life, away from his PS2 and PC games. I can see us dozing in the fields idling away amongst all those wild flowers (and weeds)or jumping on the trampoline or helping our friend feed her sheeps. And she&#39;s got a huge vegetable patch that we can get involve with too. Or just have a party of homeschooling friends around. Today, we had 10 homeschooling families there and we got to look and examine a huge but dead dragonfly, on top of hours of trampolining and tractor riding and climbing. So here you go, another event to be made regular, added onto our average intinery. <br/>\n   <br/>\n  I&#39;m really interested to know what other homeschooler&#39;s week&#39; s like.<br/>\n   <br/>\n  With Best Regards,<br/>\n  SharonC<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\n Yahoo! Answers - Get better answers from someone who knows. Tryit now.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":24743,"nextTopicId":24696}}