{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Verbal skills","postDate":"1342299756","msgId":48774,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp0c21wYys1OHI1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp0c2tycitoOW5pQGVHcm91cHMuY29tPg=="},"prevInTopic":48773,"nextInTopic":0,"prevInTime":48773,"nextInTime":48775,"topicId":48770,"numMessagesInTopic":0,"msgSnippet":"... ************** I think the important thing is to not assume that just because someone is shy they Won t want to do social things like theater. Don t put","messageBody":"<div id=\"ygrps-yiv-2118201143\">&quot;lindaguitar&quot; &lt;lindaguitar@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; In some cases, shy children can become more confident with groups and speaking to others through theater. Is there a local children&#39;s theater group where you live? If so, would participating in a theater group be something your daughter would enjoy?<br/>\n </span></blockquote>**************<br/>\n<br/>\nI think the important thing is to not assume that just because someone is shy they Won&#39;t want to do social things like theater. Don&#39;t put something like theater in a category of &quot;ways to learn social skills&quot; - I learned more social skills working retail than I did in high school drama club, in large part because it was kind of expected that all the theater folks were rampant extraverts, whereas my first boss saw that I was shy and gave me some tips as to how to &quot;fake it for the customers&quot;. It&#39;s all going to depend on the specific people and situations. <br/>\n<br/>\n---Meredith<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; My daughter is also shy and an introvert (like her dad; I&#39;m pretty sure it&#39;s a genetic trait), and also expresses herself in writing a lot better than she does in person, unless she&#39;s speaking to someone she knows very well, in a one-on-one or small group situation.<br/>\n&gt; <br/>\n&gt; When she was 10, she definitely preferred to spend time with just one friend, rather than with groups. She used to take some classes with our local homeschool group, and she didn&#39;t mind being in a group for classes, but at the park or the swimming pool or playground, she stuck with her best friend and the two of them both preferred to avoid the larger group.<br/>\n&gt; <br/>\n&gt; My husband is *very* sensitive, emotionally. He has full-blown social anxiety disorder, to such an extent that he needs medication for it just to cope with work. My daughter, who was raised much more gently and wasn&#39;t pushed to do things, socially, that she didn&#39;t feel ready for, is still shy and an introvert, but does not have the type of anxiety that her dad has.<br/>\n&gt; <br/>\n&gt; She started feeling more comfortable in group situations when she was about 13. She joined a Sea Scout group that her brother had already been in for a couple of years, which she is still a member of, and which has afforded her all kinds of wonderful opportunities for adventure, friendship, and learning; when she was 14 or 15, the teens from our homeschool group started having monthly get-togethers at each other&#39;s homes, occasional lunches at restaurants, group volunteer activities, etc, and my daughter enjoyed participating in these group activities. These were mostly the same kids she had known but NOT really made friends with when she was younger. Now, even though they don&#39;t all get together so often anymore, they&#39;re all Facebook friends.<br/>\n&gt; <br/>\n&gt; In some cases, shy children can become more confident with groups and speaking to others through theater. Is there a local children&#39;s theater group where you live? If so, would participating in a theater group be something your daughter would enjoy? If not now, maybe when she&#39;s a little older?<br/>\n&gt; <br/>\n&gt; Linda<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Verbal skills","postDate":"1342297787","msgId":48773,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp0c2tycitoOW5pQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp0cHA1cytnZWo4QGVHcm91cHMuY29tPg=="},"prevInTopic":48772,"nextInTopic":48774,"prevInTime":48772,"nextInTime":48774,"topicId":48770,"numMessagesInTopic":0,"msgSnippet":"My daughter is also shy and an introvert (like her dad; I m pretty sure it s a genetic trait), and also expresses herself in writing a lot better than she does","messageBody":"<div id=\"ygrps-yiv-197507051\">My daughter is also shy and an introvert (like her dad; I&#39;m pretty sure it&#39;s a genetic trait), and also expresses herself in writing a lot better than she does in person, unless she&#39;s speaking to someone she knows very well, in a one-on-one or small group situation.<br/>\n<br/>\nWhen she was 10, she definitely preferred to spend time with just one friend, rather than with groups. She used to take some classes with our local homeschool group, and she didn&#39;t mind being in a group for classes, but at the park or the swimming pool or playground, she stuck with her best friend and the two of them both preferred to avoid the larger group.<br/>\n<br/>\nMy husband is *very* sensitive, emotionally. He has full-blown social anxiety disorder, to such an extent that he needs medication for it just to cope with work. My daughter, who was raised much more gently and wasn&#39;t pushed to do things, socially, that she didn&#39;t feel ready for, is still shy and an introvert, but does not have the type of anxiety that her dad has.<br/>\n<br/>\nShe started feeling more comfortable in group situations when she was about 13. She joined a Sea Scout group that her brother had already been in for a couple of years, which she is still a member of, and which has afforded her all kinds of wonderful opportunities for adventure, friendship, and learning; when she was 14 or 15, the teens from our homeschool group started having monthly get-togethers at each other&#39;s homes, occasional lunches at restaurants, group volunteer activities, etc, and my daughter enjoyed participating in these group activities. These were mostly the same kids she had known but NOT really made friends with when she was younger. Now, even though they don&#39;t all get together so often anymore, they&#39;re all Facebook friends.<br/>\n<br/>\nIn some cases, shy children can become more confident with groups and speaking to others through theater. Is there a local children&#39;s theater group where you live? If so, would participating in a theater group be something your daughter would enjoy? If not now, maybe when she&#39;s a little older?<br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":334892198,"authorName":"Ann","from":"&quot;Ann&quot; &lt;auntannies2002@...&gt;","profile":"auntannies2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Verbal skills","postDate":"1342275368","msgId":48772,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp0cnV2OCtlZTQ4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp0cHA1cytnZWo4QGVHcm91cHMuY29tPg=="},"prevInTopic":48771,"nextInTopic":48773,"prevInTime":48771,"nextInTime":48773,"topicId":48770,"numMessagesInTopic":0,"msgSnippet":"Sounds like she is an introvert.  I am an introvert, but I always thought my kids were extrovert until recently.  They were chatty around me and certain","messageBody":"<div id=\"ygrps-yiv-665191145\">Sounds like she is an introvert.  I am an introvert, but I always thought my kids were extrovert until recently.  They were chatty around me and certain friends, but after reading the book The Introvert Advantage by Marti Laney, then talking to my kids about how they felt when interacting with other people, I realized they were introverts as well, I had just subconsciously help them set up their lives so they were very comfortable socially.  I highly recommend this book.  It explains very well the introvert&#39;s brain.<br/>\n<br/>\nAnn</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Verbal skills","postDate":"1342274375","msgId":48771,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp0cnUwNys3aGNoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp0cHA1cytnZWo4QGVHcm91cHMuY29tPg=="},"prevInTopic":48770,"nextInTopic":48772,"prevInTime":48770,"nextInTime":48772,"topicId":48770,"numMessagesInTopic":0,"msgSnippet":"... ************** I can so totally relate to your daughter. I m very wordy in print and people are usually shocked to discover I m shy when they meet me (and","messageBody":"<div id=\"ygrps-yiv-408089827\">&quot;ribadavia7&quot; &lt;ebdietz@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; My daughter recently turned 10 and I feel like her verbal & emotional skills are quite behind those of friends her age. She is extremely bright & a gifted writer. Verbally, however, her thoughts do not come across as clearly or easily. To compound things (for me), she isn&#39;t all that interested in getting together with friends.<br/>\n </span></blockquote>**************<br/>\n<br/>\nI can so totally relate to your daughter. I&#39;m very wordy in print and people are usually shocked to discover I&#39;m shy when they meet me (and shocked to be reminded once I&#39;ve warmed up and gotten friendly). Depending on the situation, I can fake my way through shyness and be personable even with people I don&#39;t know, but I couldn&#39;t do that when I was a kid, it&#39;s something I&#39;ve learned over time. <br/>\n<br/>\nMy daughter isn&#39;t much of a talker, either, especially with people she doesn&#39;t know well. Once she warms up, she can be chatty, but she&#39;s also capable of long periods of silence and introspection. Not everyone in the world is a chatterbox... and that&#39;s not a bad thing. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;In my crazy/deschooling mind, I feel like long periods of socialization with other people besides our family would be good for her ... to get used to talking to others<br/>\n </span></blockquote>*****************<br/>\n<br/>\nThe problem with that theory is that it assumes everyone has the same needs and learns about people and social situations the same way - by interacting - and that&#39;s not the case. Introverts need time away from other people or they become overwhelmed - and when someone is overwhelmed she&#39;s not learning much of anything. Some people (often introverts, but not always) need to hang back from social situations and observe before interacting - if they&#39;re put in the position of interacting before they&#39;ve observed enough they&#39;re prevented from learning. That may seem strange, if you&#39;ve never experienced it! I know from personal experience, though, that I don&#39;t think as well when someone else is talking - all my own thoughts feel like they&#39;re being &quot;washed away&quot; by others&#39; words. It helps if I take notes or do something else with my hands (knitting is good), if I have something visual or kinesthetic to &quot;tie down&quot; words and thoughts I don&#39;t tend to lose them.<br/>\n<br/>\nOne of the reasons shy people often have poor social skills is that when others try to &quot;draw them out&quot; they interrupt the learning process and the shy person doesn&#39;t get to learn anything new. Long periods of enforced &quot;socialization&quot; are the worst thing for introverts and observant learners! It has been fascinating watching my daughter learn to socialize without the usual pressures to interact. Her social skills are much, much better than mine were at the same age, and I&#39;m convinced they&#39;re hugely better than they would be if she were in school or if I&#39;d made her socialize when she didn&#39;t want to do so. <br/>\n<br/>\nWhat you can do is listen to your daughter and notice when she&#39;s had enough, when she needs to hang back or even hide behind something. Let her have as much space as she wants. It can help to bring something along - a book or hand-held game for instance - that she can focus on, so she can decide when she&#39;s ready to deal with people on her own terms. If people try to &quot;draw her out&quot; defend her - actively put your own body between her and others. Be polite but firm. It&#39;s awkward being at a picnic with the one kid who has her nose in a video game, I know! But it can make a huge difference to your kid to know that she&#39;s not going to be pushed to do something she isn&#39;t really able to do. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":485977771,"authorName":"ribadavia7","from":"&quot;ribadavia7&quot; &lt;ebdietz@...&gt;","profile":"ribadavia7","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Verbal skills","postDate":"1342203900","msgId":48770,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp0cHA1cytnZWo4QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":48771,"prevInTime":48769,"nextInTime":48771,"topicId":48770,"numMessagesInTopic":0,"msgSnippet":"Hi everyone, This is my first year trying out radical unschooling with my two children. They were in public school before. Besides my deschooling issues,","messageBody":"<div id=\"ygrps-yiv-1489464622\">Hi everyone,<br/>\n<br/>\nThis is my first year trying out radical unschooling with my two children. They were in public school before. Besides my deschooling issues, everything has been going great. There is one persistent worry of mine that I wanted to share to ease my mind.<br/>\n<br/>\nMy daughter recently turned 10 and I feel like her verbal & emotional skills are quite behind those of friends her age. She is extremely bright & a gifted writer. Verbally, however, her thoughts do not come across as clearly or easily. To compound things (for me), she isn&#39;t all that interested in getting together with friends. In my crazy/deschooling mind, I feel like long periods of socialization with other people besides our family would be good for her ... to get used to talking to others, which isn&#39;t as easy. Emotionally, she&#39;s *very* sensitive and particular about who she plays with so as to avoid conflicts. <br/>\n<br/>\nSo far, I&#39;ve set up playdates w/ individual friends to minimize feelings of discomfort, instead of going to large playgroups (which she hates); these are few and far between, though. We do go out in the community often, so it&#39;s not like she doesn&#39;t communicate. I guess I&#39;m worried that it&#39;s not enough.<br/>\n<br/>\nThanks ... I&#39;m just looking for words of support since I know this is normal, but as a new unschooler I don&#39;t want to make the mistake of pushing her into situations that she doesn&#39;t want for the sake of &quot;development.&quot;</div>","specialLinks":[]}],"prevTopicId":48759,"nextTopicId":48775}}