{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Three Myths of Education","postDate":"1285956476","msgId":44908,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4NTgxcytoaXJqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDRDJDODhCODg5QjhDQS1GNDQtNjREQHdlYm1haWwtbTAzNy5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":44894,"nextInTopic":0,"prevInTime":44907,"nextInTime":44909,"topicId":44882,"numMessagesInTopic":0,"msgSnippet":"... ***************** I ve so BTDT! I m doing it now, in fact, at 40, learning yet another kind of math, carpenter math, which is utterly different from school","messageBody":"<div id=\"ygrps-yiv-1133814961\">Kelly Lovejoy &lt;kbcdlovejo@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;This squares with my own experience because when I left school at 16 and went work in a bank, my &#39;O&#39; level Maths proved to be pretty useless and I had to learn the number games of the bank on the spot.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nI&#39;ve so BTDT! I&#39;m doing it now, in fact, at 40, learning yet another kind of math, carpenter math, which is utterly different from school math. Ray has been working on and off at a cabinet shop and learning the same thing in essentially the same way. His boss&#39;s wife, a former math teacher, tried to scare him by telling him he&#39;d have to &quot;improve his math skills&quot; but he doesn&#39;t find learning &quot;carpenter math&quot; to be the least difficult as its all hands on and based around the tools - totally different than the theoretical inanity of school math. <br/>\n<br/>\n---Meredith (Mo 9, Ray 17)</div>","specialLinks":[]},{"userId":148869672,"authorName":"rosehavencottage","from":"&quot;rosehavencottage&quot; &lt;rosehavencottage@...&gt;","profile":"rosehavencottage","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Can I unschool?","postDate":"1285677603","msgId":44894,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk3c25uMytncDBkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI0ODc5NS4yMTkwOC5xbUBzbXRwMTA4LW1vYi5iaXoubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":44893,"nextInTopic":44908,"prevInTime":44893,"nextInTime":44895,"topicId":44882,"numMessagesInTopic":0,"msgSnippet":"Roblox (online game), friends, going places, Vampire Diaries, Twilight series, movies/tv/Netflix, music, baking, science experiments, crafts, playing with","messageBody":"<div id=\"ygrps-yiv-1327341792\">Roblox (online game), friends, going places, Vampire Diaries, Twilight series, movies/tv/Netflix, music, baking, science experiments, crafts, playing with Barbie dolls, animals, drawing, rainbows, weather, beach, and a whole lot more I imagine. :)<br/>\n<br/>\n~ Tracy<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Amy Chester &lt;quinlonsma@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; What are your children interested in? What makes their eyes light up and gets them excited?<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":139413400,"authorName":"Amy Chester","from":"Amy Chester &lt;quinlonsma@...&gt;","profile":"quinlonsma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: Can I unschool?","postDate":"1285632626","msgId":44891,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0ODc5NS4yMTkwOC5xbUBzbXRwMTA4LW1vYi5iaXoubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":44888,"nextInTopic":44893,"prevInTime":44890,"nextInTime":44892,"topicId":44882,"numMessagesInTopic":0,"msgSnippet":"What are your children interested in? What makes their eyes light up and gets them excited? Love and laughter, Amy [Non-text portions of this message have been","messageBody":"<div id=\"ygrps-yiv-43384170\">What are your children interested in? What makes their eyes light up and gets them excited?<br/>\n<br/>\nLove and laughter,<br/>\nAmy<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"The Movement is Growing","postDate":"1285613134","msgId":44888,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRDJDOEI0RDg4M0YxOS1FNDQtMTU3QHdlYm1haWwtbTAzNy5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PDhDRDJDODhCODg5QjhDQS1GNDQtNjREQHdlYm1haWwtbTAzNy5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":44887,"nextInTopic":44891,"prevInTime":44887,"nextInTime":44889,"topicId":44882,"numMessagesInTopic":0,"msgSnippet":"Also in Bob s Newsletter. ~Kelly Kelly Lovejoy There is no single effort more radical in its potential for saving the world than a transformation of the way","messageBody":"<div id=\"ygrps-yiv-1209478302\">Also in Bob&#39;s Newsletter.<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n<br/>\n<br/>\nThe Deschooling and Unschooling Movement Is Growing<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nA small but growing movement known as deschooling, life learning, unschooling, and edu-punk is home-schooling returned to its postwar progressive roots, far from the Bible-thumping mould that has come to dominate the modern image of home-schoolers. <br/>\n<br/>\nUnschooling takes children out of schools, but, unlike a lot of home-school approaches, it doesn&#39;t import the classroom into the home. It does away altogether with educational clutter such as curricula and grades.<br/>\nUnschoolers maintain that a child&#39;s learning should be curiosity-driven rather than dictated by teachers and textbooks, and that forcing kids to adhere to curricula quashes their natural inclination to explore and ask questions. <br/>\n<br/>\nFor kids the typical guideline for deschooling is about 1 month for every year of school though in reality, most parents have a lot more deschooling to do than their kids.<br/>\n<br/>\nUnschooled children can organize their knowledge in free and better ways. They never need to feel they are through learning, or past the point that they can begin something new. Each thing they discover can be useful eventually. If we help provide them with ever-changing opportunities to see, hear, smell, taste, feel, move and discuss, what they know will exceed in breadth and depth what any school&#39;s curriculum would have covered. It won&#39;t be the same set of materials—it will be clearer and larger but different.<br/>\nTo an outsider, unschooling may sound like pedagogical tofu: a shapeless, idealistic substitute for an education. But there&#39;s a growing consensus that unschoolers might be on to something. Their ideals have been quietly infiltrating public education.<br/>\n“An unschooling family mostly just looks like a family living life … hanging out on the weekend,” says mother Pam Laricchia, a former nuclear engineer who lives in Orangeville, Ont. “But there is lots of learning going on when you take the time to look at it from the kids&#39; point of view.”<br/>\nHome-schoolers – and unschoolers in particular – are by nature difficult to count. But observers say that, thanks in part to social networking and the blossoming of Internet resources, their movement is growing.<br/>\nOne sign is that dozens of unschooling families will converge near Ms. Laricchia&#39;s home this weekend for the fifth annual Toronto Unschooling Conference. Another is that since 2002, unschoolers have had their own publication, Life Learning Magazine. (More recently, it has metamorphosized into LifeLearningMagazine.com.)<br/>\nMeanwhile, school boards and education ministries are embracing experiential learning.<br/>\nThere was a time when students were drilled and heavily tested on rote memory, such as the names and dates of British sovereigns. But research suggests that this is a temporary, limited form of learning: Kids gain more when they can ask questions and learning is tied to emotion.<br/>\nThe change in thinking has been slow, but it surfaces in the expansion of high-school co-op programs, or the emphasis on play in the new full-day kindergarten curriculum Ontario launched this week.<br/>\nSome children thrive in the classroom and others don&#39;t and, despite the best of intentions, the system sorts them into winners and losers.<br/>\nRecent initiatives by education ministries and school boards to shrink dropout rates, promote alternative schools and improve kindergarten are all fundamentally an effort to reduce the sorting. Unschooling&#39;s underlying idea is that all kids are winners.<br/>\nA LIBERATION MOVEMENT FOR THE LOVE OF LEARNING<br/>\nThe foundational tome of the unschooler is How Children Fail, the first book by an American teacher named John Holt published in 1964. The writer suggested that smart children struggle “because they are afraid, bored, and confused.<br/>\n“They are afraid, above all else, of failing, of disappointing or displeasing the many anxious adults around them, whose limitless hopes and expectations for them hang over their heads like a cloud.”<br/>\nMr. Holt supports his thesis with observations from a sort of classroom diary he kept throughout the 1950s and 60s. He concludes that “a child who is learning naturally, following his curiosity where it leads him, adding to his mental model of reality whatever he needs and can find a place for, and rejecting without fear or guilt what he does not need, is growing – in knowledge, in the love of learning, and in the ability to learn.”<br/>\nThe idea puts a lot of faith in children, their innate interest in learning and in their intelligence. It also restores faith in parents, returning some control over their children&#39;s growth that they handed to educators and politicians more than a century ago.<br/>\nThis was the philosophy behind home-schooling when it emerged in the 1960s and 70s as a way for children to learn from the world around them. Then, in the past few decades, home-schooling was embraced by the Christian right, which saw it as a way that kids could be shielded from the secular world.<br/>\nThen the Internet galvanized unschoolers. It provided a support network for parents seeking alternatives, and made satisfying the whims of a child&#39;s curiosity a lot easier. Why is the sky blue? Google it. How do you make a baking-soda volcano? Ask YouTube.<br/>\nThis type of experiential learning suits boys and concrete learners in particular, who “are set up to fail in the regular school system,” according to Ron Hansen, a professor at the University of Western Ontario.<br/>\nHe says the school system favours abstract learners, the half of the population who find it easy to think in symbols and signs, for whom written work comes naturally. Concrete learners “need action, they need projects, they need to be tactile as well as using their eyes and their ears.”<br/>\nAlthough Mr. Hansen believes that unschooling might not work in every home, he thinks its emphasis on experiential learning is laudable and has a thing or two to teach public education.<br/>\nThere is an obvious objection, and one familiar to home-schoolers of any stripe: Does any kid who hangs out all day with his parents and who lives by the whims of his own curiosity have any hope at being anything less than a dork?<br/>\nThough unschooled children tend to have highly developed critical-thinking and problem-solving skills, some find it difficult to socialize with large groups of children, according to Paige Fisher, an instructor in education at Vancouver Island University who has observed unschooled children.<br/>\nAnother concern more specific to unschooling is if children&#39;s education is formed by their own interests, or solely by those of their parents, there are likely to be gaps.<br/>\n“Individual children might be happy, but it&#39;s not clear that this makes for an autonomous or well-rounded adult, or for a better community,” Christopher Lubienski, an associate professor at the University of Illinois, writes by e-mail.<br/>\nStructured learning, with external direction, “can force people to experience things that they wouldn&#39;t otherwise, and quite often find new interests. ... Ones that may also have some wider social value.”<br/>\nOFF THE BUS, BUT NOT ENTIRELY OFF THE GRID<br/>\nThis week, as most children kissed their parents goodbye and boarded yellow school buses, a group of home-schooling families gathered in a park in Toronto&#39;s west end for a Welcome Back to Not-School party.<br/>\nThey represented a fair cross-section of the city&#39;s home-schooling community, and most would place themselves somewhere on the unschooling spectrum.<br/>\nGenerally white and well-educated, the unschoolers were the kind of middle-to-upper-middle-class parents who don&#39;t dream of a home in Rosedale or their kids graduating from medical school.<br/>\nThey didn&#39;t fit any other stereotypes, except that all were able to stay home at least part-time. And they knew their kids&#39; daily lives in a detail that made the average helicopter parent seem negligent.<br/>\nThey stood in clusters, discussing current events and their children, who buzzed about from swings to picnic tables in swarms of mixed-age groups. The sight was a bit jarring to eyes accustomed to traditional school playgrounds, where kids tend to stick with their classmates.<br/>\nCarlo Ricci, an associate professor at Nippissing University, was pushing his younger, unschooled daughter, Karina, 5, on a swing. His older daughter, Annabel, 7, attends Grade 2. He had gradually figured out the differences that made one girl prefer unschooling while the other was drawn to the classroom.<br/>\n“[Annabel] is like a movie star when she goes to school. She gets a lot of praise,&quot; he said. Karina is more shy.<br/>\nJohn Day&#39;s 10-year-old daughter, Brenda, has never seen the inside of a classroom. Still, he specified, “I&#39;d say we&#39;re part-unschoolers.”<br/>\nMr. Day, an engineer who holds graduate degrees from Oxford, the Massachusetts Institute of Technology and Stanford, lets his daughter&#39;s interests drive most of her learning. That may mean writing Artemis Fowl fan fiction, watching the pop science program Mythbusters or a trip to the Ontario Science Centre.<br/>\n“It&#39;s awesome,” said Brenda, a spindly pre-teen with sun-bleached hair. “I spend more time outside and I see my friends every day.”<br/>\nHowever, Mr. Day added: “I think potentially one of the problems with the unschooled kids is they haven&#39;t been prepared with the basics.” So on top of her self-directed learning, Brenda follows a math curriculum and solves problems in graded workbooks.<br/>\nTHE MANY SCHOOLS OF UNSCHOOLING<br/>\nThere are other factions within the movement, from the radical unschoolers, who extend the philosophy beyond education to parenting, to those who reject the term unschooling altogether.<br/>\nSome unschoolers will refer to the occasional exercise book for math lessons. Others will never consider a number outside a speedometer or a grocery receipt. Some are vegans, while the unschoolers who let their children eat more liberally quietly refer to them as the Granola Gestapo.<br/>\n“There&#39;s everything from very earthy grassroots people to very educated professional people,” says Judy Arnall, a Calgary-based author on parenting who has unschooled her five children. She is on the phone from Newfoundland, where she is dropping her 18-year-old son off at Memorial University.<br/>\n“I think the one thing everyone agrees on is that we want our kids to foster a love of learning that&#39;s intrinsic.”<br/>\n“Unschooling is an acknowledgment that schools and education are in many ways contradictory, that there&#39;s an implicit tension between them,” says Jason Price, an assistant professor at the University of Victoria.<br/>\n“Education is about the production of more democracy, production of peace, production of happiness whereas schooling is often the production of global economic competitiveness.”<br/>\nIn Orangeville this weekend, over campfires and potluck dinners, unschoolers will discuss ways of supporting their children&#39;s learning at Ms. Laricchia&#39;s Toronto Unschooling Conference.<br/>\nThroughout the day, guest speakers will address quandaries such as the ways kids learn math without a textbook and how to transition your children out of the regular school system – a sort of psychological-detox process known as deschooling.<br/>\nWhen the conference is over, Ms. Laricchia will return to collaborating on building an online business with her son, Michael, 13. Her daughter, Lissy, 16, is a photographer who was recently invited to participate in a show in New York. The oldest child, Joseph, has turned 18 and is no longer being actively unschooled. His mom happily admits that the change has had almost no effect on his day-to-day life.<br/>\nKate Hammer is The Globe and Mail&#39;s Education Reporter.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Three Myths of Education","postDate":"1285612025","msgId":44887,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRDJDODhCODg5QjhDQS1GNDQtNjREQHdlYm1haWwtbTAzNy5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PGk3cW40Yis3NGNkQGVHcm91cHMuY29tPg=="},"prevInTopic":44886,"nextInTopic":44888,"prevInTime":44886,"nextInTime":44888,"topicId":44882,"numMessagesInTopic":0,"msgSnippet":"This was in Bob Collier s Parental Intelligence Newsletter this week. ~Kelly Kelly Lovejoy There is no single effort more radical in its potential for saving","messageBody":"<div id=\"ygrps-yiv-1327381351\">This was in Bob Collier&#39;s Parental Intelligence Newsletter this week.<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n<br/>\nEducational Heretics Press<br/>\n<br/>\nPages from the Roland Meighan column in Natural Parent magazine<br/>\n<br/>\n4. Educational Superstitions of our time - Shakespeare, Maths and Handwriting<br/>\nProfessor S. Bengu, The Minister of Education for South Africa, gave a keynote speech at a conference on democratic education last May. In it explained his country&#39;s intention to move away from a bureaucrat-driven imposed curriculum towards a learner-driven curriculum by 2005.<br/>\n<br/>\n<br/>\nThe enthusiasts for imposing a curriculum on the learners are often horrified at such heresy. &quot;What if the learners do not choose to learn Shakespeare?&quot; I always thought that Bertrand Russell gave the cool answer here, when he said: &quot;Shakespeare did not write with a view to boring school-children; he wrote to with a view to delighting his audiences. If he does not give you delight, you had better ignore him.&quot;<br/>\n<br/>\n<br/>\nI always found comfort in this view, since I admit that, despite many visits to performances at Stratford-on-Avon, I can take or leave the bard. This does not mean I want to stand in the way of those who want to encounter Shakespeare, and for this reason, I find that the work of John and Leela Hort in making the language of his plays intelligible, is well worth both parents and children investigating. With their love of the bard, Leela and John have spent their time and money producing the Inessential Shakespeare series, &#39;shortened and simplified versions in modern English&#39;, a snip at £2-95 each. Five plays have been translated into modern English so far, and the sixth, Hamlet, is in preparation ready.<br/>\n<br/>\n<br/>\nThe enthusiasts for imposing a curriculum on the learners are also worried by Maths. &quot;What if the learners do not choose to learn Mathematics?&quot; Bertrand Russell, who should have a valid opinion since he was one of the world&#39;s most renowned mathematicians himself, had this to say on the matter: &quot;In universities, mathematics is taught mainly to men who are going to teach mathematics to men who are going to teach mathematics to ... Sometimes, it is true, there is an escape from this treadmill. Archimedes used mathematics to kill Romans, Galileo to improve the Grand Duke of Tuscany&#39;s artillery, modern physicists (grown more ambitious) to exterminate the human race. It is usually on this account that the study of mathematics is commended to the general public as worthy of State support.&quot;<br/>\n<br/>\n<br/>\nMaths is useful, however, if you are doing something like designing bridges, but the idea that we must all go through the Maths experience to identify those who are good at it and need it later for specific tasks, is about as sound as saying we must all study dentistry to enable some expert dentists to emerge. When I was learning Maths at school, then teaching it in school myself, and then watching my son learn it, the same heretical thought kept occurring, that surely there are better things we could all be doing than this. <br/>\nIt is a common error to confuse mathematics with arithmetic, and so perhaps it is the latter that should be imposed? Again, Russell is a dissenter: &quot;Arithmetic ... is overvalued; in British elementary schools and it takes up far more of the time than it should. He goes on to propose that there are much more useful things to learn. Russell admitted that although he was a leading mathematician and philosopher, he was never much good at arithmetic himself.<br/>\n<br/>\n<br/>\nIt is another common error to think industry has &#39;needs&#39; that can be &#39;covered&#39;. A colleague who was a Maths tutor, conducted a survey of the &#39;needs&#39; of hundreds of firms around Birmingham. When I asked him what he had found, he said, &quot;Total confusion.&quot; He could not find any common requirements in mathematics, and the common ground as regards arithmetic amounted to knowledge and confidence in the four basic rules. This squares with my own experience because when I left school at 16 and went work in a bank, my &#39;O&#39; level Maths proved to be pretty useless and I had to learn the number games of the bank on the spot.<br/>\n<br/>\n<br/>\nOne home-educating family, where the father was an engineer, asked me at a conference what to do about Maths. I ran through the arguments. They decided it was a superstition, and to have the courage to ignore it unless it cropped-up in the course of other investigations. Later they said how pleased they were with this policy and how well it had worked out in practice. But then, with CD-ROM interactive discs now available that will teach you &#39;O&#39; level Maths in a quarter or less of the time of a taught course, you can take the subject on board whenever you wish.<br/>\n<br/>\n<br/>\nIf I believed in compelling people to learn things, which I no longer do since I advocate the learner-driven/catalogue curriculum approach instead, I could make out a much better case for teaching Logic which is usually missing from the curriculum altogether. But it was Paul Goodman, in a book that shocked people in 1962 entitled Compulsory Mis-education, who described mass schooling, including its imposed mathematics, as a mass superstition.<br/>\n<br/>\n<br/>\nThe enthusiasts for imposing a curriculum on the learners are also worried by joined-up handwriting. &quot;What if the learners do not choose to learn joined-up handwriting?&quot; I must admit to being much more worried if they do not develop the skills of joined-up thinking that learning logic encourages, but that is another issue. Perhaps more pain is inflicted on children in the joined-up handwriting pursuit than any other. Yet printers print in script because it is clearer. Natural Parent would be hard work to read if it were presented in handwriting. <br/>\n<br/>\n<br/>\nNobody shows much enthusiasm for joined-up figures in sums either, and would see anyone as a bit odd for suggesting it. John Holt in his investigations could find no reasons on offer except a claim that joined-up handwriting was speedier. He showed that this usually was a fallacy by conducting a number of classroom experiments and by experimenting on himself. Usually, script was as quick or often quicker, more legible and looked better. Those who chose to learn Italic script produced very attractive results.<br/>\n<br/>\n<br/>\nIn discussion recently, one handwriting enthusiast told me that the body movements used in the teaching of it were essential for the composed development of children. This was her justification for teaching handwriting. If this is so, why not teach the body movements on their own without the clutter? <br/>\n<br/>\n<br/>\nThe enthusiasts for imposing learning on children in school do not have a good track record. There were earlier superstitions. For a time they tried to make all left-handed children become right-handed, with a heavy punishment regime. Drill was imposed as a subject on all children for many years. Children in Welsh-speaking areas of Wales were punished if they did not speak in English in school. Later compulsory Welsh appeared in English-speaking parts of Wales and I have met adults who resented this being enforced on them as children. And so on.<br/>\n<br/>\n<br/>\nPart of the task of &#39;parents as researchers&#39; that I advocated in a previous edition of Natural Parent, is to be on the look-out for learning systems based on possible superstitions and get equipped to answer them and deal with them. In later editions I intend to analyse two big superstitions - &#39;socialisation&#39;, and then &#39;subjects&#39;.<br/>\n<br/>\n<br/>\nThe Inessential Shakespeare website<br/>\nThe Inessential Shakespeare Series is available from 239 Bramcote Lane, Wollaton, Nottingham NG8 2QL Telephone 0115 928 3001 for a brochure.<br/>\nA version of this piece was published in Natural Parent in April 1998, as the Roland Meighan column, entitled &#39;The three myths&#39;.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":148869672,"authorName":"rosehavencottage","from":"&quot;rosehavencottage&quot; &lt;rosehavencottage@...&gt;","profile":"rosehavencottage","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Can I unschool?","postDate":"1285611467","msgId":44886,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk3cW40Yis3NGNkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDBGQjMxNTdEM0U5MDQzNDg5MjMwNzQ3RTExMUZFN0ExQENvbm5pZVBDPg=="},"prevInTopic":44885,"nextInTopic":44887,"prevInTime":44885,"nextInTime":44887,"topicId":44882,"numMessagesInTopic":0,"msgSnippet":"I would prefer whole-life unschooling but I think that is a bit of a stretch at this point. We have three children. Our son will be 18 in January and has a","messageBody":"<div id=\"ygrps-yiv-1341121652\">I would prefer whole-life unschooling but I think that is a bit of a stretch at this point. <br/>\n<br/>\nWe have three children. Our son will be 18 in January and has a full time job. He was taking GED classes but stopped attending those and asked us for a GED prep book instead. I don&#39;t think he is studying it though.<br/>\n<br/>\nOur daughters are 10 and almost 14. We have used basic curriculums off and on over the past 6+ years they have been home, but my youngest fights it tooth and nail! He would like the girls to be taught at the very least the three R&#39;s. The 14yo struggles with math and the 10yo struggles with spelling, though she can read....although probably not at her age level.<br/>\n<br/>\n~ Tracy <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;otherstar&quot; &lt;otherstar@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; From: rosehavencottage <br/>\n&gt; Sent: Monday, September 27, 2010 11:37 AM<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n&gt; Subject: [unschoolingbasics] Can I unschool?<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &gt;&gt;&gt;&gt;Can I unschool even though my husband doesn&#39;t understand or agree with the concept of unschooling? He thinks children must be taught how to do math, spell, and read. How can I show him otherwise? &lt;&lt;&lt;<br/>\n&gt; <br/>\n&gt; Are you wanting to do academic unschooling or whole life unschooling? How old are your children? What have you been doing up until now? What are your kids used to doing with regards to school? <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":148869672,"authorName":"rosehavencottage","from":"&quot;rosehavencottage&quot; &lt;rosehavencottage@...&gt;","profile":"rosehavencottage","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Can I unschool?","postDate":"1285610551","msgId":44893,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk3cW03bitpZjdyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk3cWtncStncTF1QGVHcm91cHMuY29tPg=="},"prevInTopic":44891,"nextInTopic":44894,"prevInTime":44892,"nextInTime":44894,"topicId":44882,"numMessagesInTopic":0,"msgSnippet":"No, we have homeschooled for the past 6 years, this being our 7th year. I have never been strict with curriculum, but I m lacking ideas for fun, interesting","messageBody":"<div id=\"ygrps-yiv-1430699597\">No, we have &quot;homeschooled&quot; for the past 6 years, this being our 7th year. I have never been strict with curriculum, but I&#39;m lacking ideas for fun, interesting things we can do given out finances are tight right now. We all have Facebook, too. :)<br/>\n<br/>\nI&#39;ll check out the link. Thanks Meredith!<br/>\n<br/>\n~ Tracy <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; &quot;rosehavencottage&quot; &lt;rosehavencottage@&gt; wrote:<br/>\n okay with the idea of homeschooling at all or is he resisting the idea of pulling kids out of school? If he&#39;s okay with the kids being home, then your challenge is to let him &quot;see&quot; what they kids are doing/learning when he&#39;s not looking. A blog is a good way to do that, or a scrapbook, so you can take lots of pictures and tell fun stories about your day. If y&#39;all are on facebook or some other social network, that&#39;s a good tool, too, for little daily updates. <br/>\n&gt; <br/>\n&gt; It might help to look here for some ideas about how to &quot;frame&quot; unschooling in more educational sounding terms to help him understand:<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschoolingcurriculum.html\">http://sandradodd.com/unschoolingcurriculum.html</a><br/>\n&gt; <br/>\n&gt; ---Meredith<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Can I unschool?","postDate":"1285608799","msgId":44885,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBGQjMxNTdEM0U5MDQzNDg5MjMwNzQ3RTExMUZFN0ExQENvbm5pZVBDPg==","inReplyToHeader":"PGk3cWg3aStmZDdqQGVHcm91cHMuY29tPg==","referencesHeader":"PGk3cWg3aStmZDdqQGVHcm91cHMuY29tPg=="},"prevInTopic":44884,"nextInTopic":44886,"prevInTime":44884,"nextInTime":44886,"topicId":44882,"numMessagesInTopic":0,"msgSnippet":"From: rosehavencottage Sent: Monday, September 27, 2010 11:37 AM To: unschoolingbasics@yahoogroups.com Subject: [unschoolingbasics] Can I unschool? ... Are you","messageBody":"<div id=\"ygrps-yiv-1369310434\">From: rosehavencottage <br/>\nSent: Monday, September 27, 2010 11:37 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSubject: [unschoolingbasics] Can I unschool?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;Can I unschool even though my husband doesn&#39;t understand or agree with the concept of unschooling? He thinks children must be taught how to do math, spell, and read. How can I show him otherwise? &lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Are you wanting to do academic unschooling or whole life unschooling? How old are your children? What have you been doing up until now? What are your kids used to doing with regards to school? <br/>\n<br/>\nI have found that it is best to go into things with a team attitude rather than one where you have made up your mind and are trying to get your husband on board. The first step is to talk to your husband about what he wants and why and work from there.<br/>\n<br/>\nConnie<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Can I unschool?","postDate":"1285608794","msgId":44884,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk3cWtncStncTF1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk3cWg3aStmZDdqQGVHcm91cHMuY29tPg=="},"prevInTopic":44883,"nextInTopic":44885,"prevInTime":44883,"nextInTime":44885,"topicId":44882,"numMessagesInTopic":0,"msgSnippet":"... *************** Is he okay with the idea of homeschooling at all or is he resisting the idea of pulling kids out of school? If he s okay with the kids","messageBody":"<div id=\"ygrps-yiv-102109111\">&quot;rosehavencottage&quot; &lt;rosehavencottage@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Can I unschool even though my husband doesn&#39;t understand or agree with the concept of unschooling? He thinks children must be taught how to do math, spell, and read. How can I show him otherwise?<br/>\n </span></blockquote>***************<br/>\n<br/>\nIs he okay with the idea of homeschooling at all or is he resisting the idea of pulling kids out of school? If he&#39;s okay with the kids being home, then your challenge is to let him &quot;see&quot; what they kids are doing/learning when he&#39;s not looking. A blog is a good way to do that, or a scrapbook, so you can take lots of pictures and tell fun stories about your day. If y&#39;all are on facebook or some other social network, that&#39;s a good tool, too, for little daily updates. <br/>\n<br/>\nIt might help to look here for some ideas about how to &quot;frame&quot; unschooling in more educational sounding terms to help him understand:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschoolingcurriculum.html\">http://sandradodd.com/unschoolingcurriculum.html</a><br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":174155498,"authorName":"Carrie","from":"&quot;Carrie&quot; &lt;frazzledhetumom@...&gt;","profile":"frazzledhetumom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Can I unschool?","postDate":"1285607447","msgId":44883,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk3cWo2bit0bWFvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk3cWg3aStmZDdqQGVHcm91cHMuY29tPg=="},"prevInTopic":44882,"nextInTopic":44884,"prevInTime":44882,"nextInTime":44884,"topicId":44882,"numMessagesInTopic":0,"msgSnippet":"Hi Tracy, While it almost always helps to have the support of your spouse, there still may be some solutions for you to be able to unschool. Especially if your","messageBody":"<div id=\"ygrps-yiv-1774722896\">Hi Tracy,<br/>\n<br/>\nWhile it almost always helps to have the support of your spouse, there still may be some solutions for you to be able to unschool. Especially if your husband is usually communicative and cooperative in other areas of your relationship. In any case, if he does not understand and agree with unschooling, you will need to try to find a compromise if this is something you are passionate about pursuing.<br/>\n<br/>\n1.) Perhaps your hubby would agree to a trial period, say a year and let him know a year can be made up so you have nothing to lose with at least trying, if it does not work in that years time, perhaps agree you will go back to more traditional homeschooling methods.<br/>\n<br/>\n2.) You could try just a relaxed homeschool approach, agreeing to pursue the 3 R&#39;s of arithmatic, reading and writing in a traditional manner while following more the child led interests in other academic pursuits.<br/>\n<br/>\n3.) You might want to try more of a democratic school model where the kids are able to vote on material and subjects they learn. Sudbury Valley Schools offer a great look at the democratic school model.<br/>\n<br/>\nPerhaps you could leave short clips of articles, quotes and other written material for your husband to read in places he might read them and see them.<br/>\n<br/>\nMaybe you can get him to agree to go to an unschooling conference.<br/>\n<br/>\nMaybe you could show him some of the best unschooling blogs out there like The Sparkling Martins or Just a Bald Man!<br/>\n<br/>\nIn the meantime read and do your research as much as possible and share with your hubby some of the tidbits you have learned from these unschooling books.<br/>\n<br/>\nThere are always options and you will need to decide how best to reach a middle ground with hubby that you both are comfortable with, with time he may get on board if he can see how great it is working and it can progress into something more, shifting more and more towards a total unschooling lifestyle.<br/>\n<br/>\nCarrie<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://freespiritsnaturalliving.blogspot.com/\">http://freespiritsnaturalliving.blogspot.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.associatedcontent.com/user/216089/rainbow_rivers.html\">http://www.associatedcontent.com/user/216089/rainbow_rivers.html</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lulu.com/spotlight/frazzledhetumomathotmaildotcom\">http://www.lulu.com/spotlight/frazzledhetumomathotmaildotcom</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;rosehavencottage&quot; &lt;rosehavencottage@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Can I unschool even though my husband doesn&#39;t understand or agree with the concept of unschooling? He thinks children must be taught how to do math, spell, and read. How can I show him otherwise? <br/>\n&gt; <br/>\n&gt; He is not very involved in what our children are learning other than asking them if they&#39;ve &quot;done school&quot;. I know he just wants the best for them, but I wish he was a little more open-minded. He didn&#39;t even finish high school, but he did get his GED. <br/>\n&gt; <br/>\n&gt; Tracy<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":148869672,"authorName":"rosehavencottage","from":"&quot;rosehavencottage&quot; &lt;rosehavencottage@...&gt;","profile":"rosehavencottage","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Can I unschool?","postDate":"1285605426","msgId":44882,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk3cWg3aStmZDdqQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":44883,"prevInTime":44881,"nextInTime":44883,"topicId":44882,"numMessagesInTopic":0,"msgSnippet":"Can I unschool even though my husband doesn t understand or agree with the concept of unschooling? He thinks children must be taught how to do math, spell, and","messageBody":"<div id=\"ygrps-yiv-358641819\">Can I unschool even though my husband doesn&#39;t understand or agree with the concept of unschooling? He thinks children must be taught how to do math, spell, and read. How can I show him otherwise? <br/>\n<br/>\nHe is not very involved in what our children are learning other than asking them if they&#39;ve &quot;done school&quot;. I know he just wants the best for them, but I wish he was a little more open-minded. He didn&#39;t even finish high school, but he did get his GED. <br/>\n<br/>\nTracy</div>","specialLinks":[]}],"prevTopicId":44895,"nextTopicId":44898}}