{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":19,"messages":[{"userId":435652323,"authorName":"gemlily14","from":"&quot;gemlily14&quot; &lt;gemlily14@...&gt;","profile":"gemlily14","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New with quick question","postDate":"1267357138","msgId":43263,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhtZGtraSs5OWxtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk0OTg5NS40MDg0NC5xbUB3ZWI1NDYwMy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":43261,"nextInTopic":0,"prevInTime":43262,"nextInTime":43264,"topicId":43215,"numMessagesInTopic":0,"msgSnippet":"horses are great, kind souls and generally good with kids. others have already given some good suggestions, just thought I would add that maybe your kids could","messageBody":"<div id=\"ygrps-yiv-249268470\">horses are great, kind souls and generally good with kids.<br/>\nothers have already given some good suggestions, just thought I would add that maybe your kids could help out in a volunteer capacity with horses, say riding for the disabled. the barter is a good idea, maybe your kids could muck out stalls in exchange for lessons or a reduced price. I have found most people willing to find a solution that suits you and them, if you ask for help.<br/>\ngood luck <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, b prince &lt;flyingtwinsmom@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I am new to the group and to the idea of unschooling. I&#39;ve loved reading all the wonderful info I can find, but time is short. I would love to find some audios on unschooling. Does anyone have any ideas where to check? <br/>\n&gt; <br/>\n&gt; And the next question that I&#39;m struggling with is how do you afford to unschool? I know that sounds really stupid, but I&#39;ve read over and over again that if a child shows an interest you provide for it. My girls love horses and would love lessons but at $45/ hour each, I just can&#39;t do it. And that is just one example. I&#39;d love to hear how you provide experiences/materials for your children without going broke.<br/>\n&gt; Thanks<br/>\n&gt; <br/>\n&gt; <br/>\n&gt;       <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New with quick question","postDate":"1267314438","msgId":43261,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhtY2F1NitzNWJqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM5NzEwNS42NzY4Ny5xbUB3ZWI1NDYwMi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":43258,"nextInTopic":43263,"prevInTime":43260,"nextInTime":43262,"topicId":43215,"numMessagesInTopic":0,"msgSnippet":"... **************** Think of this - most homeschooling families live on one income, so chances are, most unschoolers aren t rolling in dough. My family gets","messageBody":"<div id=\"ygrps-yiv-34242016\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, b prince &lt;flyingtwinsmom@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I think I&#39;m a bit nervous about trying unschooling because (promise you won&#39;t laugh or flame me) it sounds expensive.<br/>\n </span></blockquote>****************<br/>\n<br/>\nThink of this - most homeschooling families live on one income, so chances are, most unschoolers aren&#39;t rolling in dough. My family gets by one one income, mine - and I&#39;m working in a luxury portion of the construction bus (plaster architechtural details - anyone need a ten foot coffered dome in their living room?) so work is thin on the ground these days. We&#39;re scraping by. <br/>\n<br/>\nIt takes some practice thinking outside the box, but its the sort of thing you get better at over time. Several people suggested getting farther out into farm country to look for horse opportunities - small farms and the like. Those places tend to come with ready-made chances to barter labor. It won&#39;t be glamorous - you might end up watching a couple toddlers while another mom gets a break by taking your big kids out on the horse for an hour. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I tend to like to leave books, art projects, etc out, but that is only acceptable for a few days at most before everything needs to be &quot;put away&quot; again....<br/>\n&gt; I&#39;m struggling now with keeping one of the girl&#39;s rooms tidy.<br/>\n<br/>\n </span></blockquote>Okay, I put those two quotes together to give you an idea - what about &quot;strewing&quot; in your girls rooms? And yours if you have one? Do those spaces have to stay neat by some &quot;house rules&quot; or can y&#39;all shut the doors if the others get upset about mess?<br/>\n<br/>\nMost of my &quot;strewing&quot; doesn&#39;t take the form of me leaving things out, but rather in the form of having things on-hand and making them accessible. And honestly, I&#39;m not the tidiest person on the planet, so sometimes I clean in order to make things accessible, if you catch my drift. I joke that I &quot;unstrew&quot;. My house is less a museum and more like a rummage sale. <br/>\n<br/>\nI&#39;m most likely to actively &quot;strew&quot; when one of my kids is obviously bored, in the form of going out (or online) and getting something new (to us) to add to the mix, or digging around for something I picked up along the way that I think would appeal. The rest of the time its the kids who are leading the way - asking, wondering, busy with projects and ideas, and I get to be the helper, partner, facilitator or consultant. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I could go in and clean up for her, but would she learn anything from this?<br/>\n<br/>\n </span></blockquote>Yes! She&#39;d learn that you&#39;re a kind and thoughtful person who wants her to be able to find her things! If it annoys her for you to clean, then don&#39;t - some people do better with a bit of disorder, believe it or not. Its a perceptual style. <br/>\n<br/>\nMo likes it when I sort her legos for her, but doesn&#39;t keep them sorted. Its too much work, when she&#39;s in the moment of creation, to put things Back - it impedes her creativity. And by the time she&#39;s done the mess is more than she can handle - its overwhelming. Over time she&#39;s gotten more comfortable with smaller messes. For instance, since its been cold, she&#39;s been playing a lot on my bed and is totally fine cleaning up the bed so that I can get in it at night. A mess bigger than the bed is too much, still. But two years ago a mess As big as the bed would have been too much. As she&#39;s getting older, she&#39;s able to handle bigger tasks naturally. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I could ask her to clean up with me or I could just leave it go. <br/>\n<br/>\n </span></blockquote>Invite her to help if you&#39;re able to clean cheerfully, but be willing to accept &quot;no&quot; for an answer. Kids are busy people! All that playing is How they learn, its important work. So if they&#39;re too busy to help, work on being okay with that. As they get older, and are better able to manage time and appreciate others&#39; needs naturally, they&#39;ll look for ways to help out. It may not always be what you expect, though!<br/>\n<br/>\nMy 16yo just brought me a truck load of rocks. The rocks are big flakes of slate to cover a particularly muddy patch in our path - its been a wet fall and winter and we&#39;re very muddy, here. It was a Lot of work on his part! Loading and unloading rocks isn&#39;t a picnic. He didn&#39;t have to do that, he did it to be helpful. But like I said, its not the sort of &quot;help&quot; most parents look for. That&#39;s okay. I&#39;d be washing the floors whether he was here or not - I wouldn&#39;t have a new stone walkway, though, if he wasn&#39;t around (and really, its a partial solution to the muddy floor, too, what a sweetie). <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":136944076,"authorName":"Jenna Robertson","from":"Jenna Robertson &lt;mamamole@...&gt;","profile":"Mamamole","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] New with quick question","postDate":"1267295940","msgId":43258,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyOTA0OC4yMDk2Ni5xbUB3ZWI2NTcxMi5tYWlsLmFjNC55YWhvby5jb20+","inReplyToHeader":"PEJFNTI0MkVCLTcwMkUtNEU5MC04MDkzLTZFOEYxNDYzMUVDMkB2ZXJpem9uLm5ldD4="},"prevInTopic":43257,"nextInTopic":43261,"prevInTime":43257,"nextInTime":43259,"topicId":43215,"numMessagesInTopic":0,"msgSnippet":"...   It s interesting that once we stopped trying to make/bribe/encourage/demand that our girls clean their rooms the one who was the most resistant to","messageBody":"<div id=\"ygrps-yiv-1156873321\">:) Does your daughter want her room cleaned up?<br/>\n <br/>\nIt&#39;s interesting that once we stopped trying to make/bribe/encourage/demand that our girls clean their rooms the one who was the most resistant to cleaning (would melt down at the mention of the word) turned out to be the one who most valued having a clean space.  Now when her room gets too messy for her happiness I go in and help for a bit and then she finishes up.  She&#39;s also the first kid to jump in and help now when we have friends coming over and need to clear space for activities.  <br/>\n <br/>\nAnother really wants her room cleaned up but does not want to do it, so I try and get up there whenever I can, though we haven&#39;t quite gotten it to her level of happiness because she has the room that friends play in the most so the chaos gets recreated regularly.  Her joy when I clean up her room is so wonderful to see :).<br/>\n <br/>\nThe third was the one who complained the most about how her sisters made messes when they all shared one room.  Once we created a bedroom for her you couldn&#39;t even walk into it.  Where ever she sits in the house, clutter gathers at her side.  :)  But then one day when she was having friends over she went upstairs and started cleaning up the piles.  And she&#39;s increasingly willing to jump in and help in ways other than cleaning - making food, doing things for her sisters.<br/>\n <br/>\nParticularly if you live w/ extended family, it&#39;s important for a kid to have their own space be respected and kept the way that they want it since they have less control over the shared family space.  :)<br/>\n <br/>\n:)<br/>\nJenna<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n What is essential is to realize that children learn independently, not in bunches; that they learn out of interest and curiosity , not to please or appease the adults in power; and that they ought to be in control of their own learning, deciding for themselves what they want to learn and how they want to learn it. ~ John Holt ~ How Children Learn <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] New with quick question","postDate":"1267268833","msgId":43257,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJFNTI0MkVCLTcwMkUtNEU5MC04MDkzLTZFOEYxNDYzMUVDMkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDM5NzEwNS42NzY4Ny5xbUB3ZWI1NDYwMi5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PGhscWZiMStmZnZjQGVHcm91cHMuY29tPiA8Y2M2MTIwYTExMDAyMjEwNjM3cTJkZGIzYzhhaDQ3ZDI5NDY0ZjFkMjM2NzhAbWFpbC5nbWFpbC5jb20+IDw5NDk4OTUuNDA4NDQucW1Ad2ViNTQ2MDMubWFpbC5yZTIueWFob28uY29tPiA8OTA1QkI1NkMtQUI4NS00MzAyLUJEQjQtRDYxRDI2MTg0N0RGQHZlcml6b24ubmV0PiA8Mzk3MTA1LjY3Njg3LnFtQHdlYjU0NjAyLm1haWwucmUyLnlhaG9vLmNvbT4="},"prevInTopic":43254,"nextInTopic":43258,"prevInTime":43256,"nextInTime":43258,"topicId":43215,"numMessagesInTopic":0,"msgSnippet":"... Yes. :-) For some reason this society thinks children are some creature other than human ;-) Conventional parenting has parents treating children in ways","messageBody":"<div id=\"ygrps-yiv-753849799\">On Feb 26, 2010, at 1:16 PM, b prince wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I could go in and clean up for her, but would she learn anything  <br/>\n&gt; from this?<br/>\n<br/>\n </span></blockquote>Yes. :-)<br/>\n<br/>\nFor some reason this society thinks children are some creature other  <br/>\nthan human ;-) Conventional parenting has parents treating children  <br/>\nin ways they would never expect an adult to respond positively to and  <br/>\nthat would damage the relationship they had.<br/>\n<br/>\nIf someone held a value you didn&#39;t understand or agree with and they  <br/>\nmade you comply with that value, what would you learn from them? (It  <br/>\nhas to be a value that you don&#39;t agree with right now, not something  <br/>\nyour future self might agree with.) Might you conclude they had some  <br/>\ncontrol issues? That they valued their values more than you as a  <br/>\nseparate unique individual? That the best method they had come up  <br/>\nwith to resolve conflicting needs was to be bigger and stronger and  <br/>\nmake someone do their bidding?<br/>\n<br/>\nIf you see the need for order as something you value that you can  <br/>\nshare with your daughter it&#39;s far more likely she&#39;ll join in when you  <br/>\nask than if you do the above. (The asking needs to be a real question  <br/>\nwhere &quot;No, thanks,&quot; is an acceptable answer.) If she experiences  <br/>\nclean up as something done joyfully with an end result that has its  <br/>\nadvantages (its disadvantages too!) she&#39;ll have pleasant associations  <br/>\nwith it.<br/>\n<br/>\n*If* she&#39;s been made to clean, she will probably need a recovery  <br/>\nperiod. Even if you change, it will take a while before the change  <br/>\nfeels real to her. Asking if she&#39;ll help will feel like a new way of  <br/>\ntelling her to do it. She&#39;ll need the freedom to say no.<br/>\n<br/>\nIt may take a long time before she does any spontaneous straightening  <br/>\nup on her own. As my daughter reached puberty I could see the shift  <br/>\nin her. Tasks that *I* thought were simple, like matching socks and  <br/>\nfolding towels, she had found overwhelming. But as puberty approached  <br/>\nshe was able to do them effortlessly.<br/>\n<br/>\nThis should help:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n<br/>\nDown the right side are several pages about chores.<br/>\n<br/>\nAnd Sandra Dodd has several pages too:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores/\">http://sandradodd.com/chores/</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":191799655,"authorName":"b prince","from":"b prince &lt;flyingtwinsmom@...&gt;","profile":"flyingtwinsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] New with quick question","postDate":"1267208215","msgId":43254,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5NzEwNS42NzY4Ny5xbUB3ZWI1NDYwMi5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDkwNUJCNTZDLUFCODUtNDMwMi1CREI0LUQ2MUQyNjE4NDdERkB2ZXJpem9uLm5ldD4=","referencesHeader":"PGhscWZiMStmZnZjQGVHcm91cHMuY29tPiA8Y2M2MTIwYTExMDAyMjEwNjM3cTJkZGIzYzhhaDQ3ZDI5NDY0ZjFkMjM2NzhAbWFpbC5nbWFpbC5jb20+IDw5NDk4OTUuNDA4NDQucW1Ad2ViNTQ2MDMubWFpbC5yZTIueWFob28uY29tPiA8OTA1QkI1NkMtQUI4NS00MzAyLUJEQjQtRDYxRDI2MTg0N0RGQHZlcml6b24ubmV0Pg=="},"prevInTopic":43242,"nextInTopic":43257,"prevInTime":43253,"nextInTime":43255,"topicId":43215,"numMessagesInTopic":0,"msgSnippet":"Sorry I haven t replied to all yet. I haven t dropped off the face of the earth. I tend to like to read, re-read and think a lot before replying. Thanks to all","messageBody":"<div id=\"ygrps-yiv-696319291\">Sorry I haven&#39;t replied to all yet. I haven&#39;t dropped off the face of the earth. I tend to like to read, re-read and think a lot before replying. Thanks to all of you that gave specific ideas on how I might work horses into their lives. I&#39;m still working on it. But this has shown me that I must be more creative in how I approach things. For instance, I can&#39;t think of a time that I&#39;ve really bartered for anything. I&#39;m a bit nervous about trying it. Would you share some experience? How do you ask about this and what might I be able to barter with? I&#39;m thinking I would just ask outright but that may be awkward in a business. As for things we could barter, I can think of my photography when I get my camera back, but after that I run out of ideas. I&#39;m not sure how to put a dollar amount on it either.<br/>\n<br/>\nAlso, I&#39;ve been thinking over Joyce&#39;s post about &quot;can&#39;t.&quot; My husband hates that word. I find I use it too often to mean &quot;won&#39;t&quot; or some such. When we got married, he was teaching me wood working and wouldn&#39;t ever let me say &quot;I can&#39;t do it.&quot; I think I need to apply that more to our lives now. We don&#39;t have extra $, but that doesn&#39;t mean that I can&#39;t come up with some way to work out the horse situation and unschooling in general. I think I&#39;m a bit nervous about trying unschooling because (promise you won&#39;t laugh or flame me) it sounds expensive. I can see how my girls would grow if I could provide more opportunities for them, but I&#39;m so new to this that I fail to see different ways to do that.  <br/>\n<br/>\nWhich leads my mind to asking about your homes. We live with other family, so we haven&#39;t been able to find a way to &quot;strew&quot; things that keeps the house in order for others. Can you unschool successfully in a &quot;picked up&quot; house? How? I tend to like to leave books, art projects, etc out, but that is only acceptable for a few days at most before everything needs to be &quot;put away&quot; again. <br/>\n<br/>\nI&#39;m struggling now with keeping one of the girl&#39;s rooms tidy. She throws clothes all over the place, leaves stuffed animals and, well, everything out. You can barely walk in her room, but I&#39;m stuck on the &quot;best&quot; way to deal with this. I could go in and clean up for her, but would she learn anything from this? I could ask her to clean up with me or I could just leave it go. I&#39;m struggling by trying to look at it (and everything about our lives now) in unschooling terms. <br/>\n<br/>\nThanks<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New to unschooling and this group, seeking advice","postDate":"1266969260","msgId":43242,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhtMXByYytjMjZ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhsdm5lbCtyamRxQGVHcm91cHMuY29tPg=="},"prevInTopic":43234,"nextInTopic":43254,"prevInTime":43241,"nextInTime":43243,"topicId":43215,"numMessagesInTopic":0,"msgSnippet":"... **************** I always love healing-via-unschooling stories! It was really amazing just the first year Ray was home seeing the sullen, angry young","messageBody":"<div id=\"ygrps-yiv-1393901965\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;play_jer_eyes&quot; &lt;play_jer_eyes@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; So, this rather loooong story is just meant to show you that, no matter how hurt your daughter is feeling right now or how scared you are, unschooling provides you the time to heal.<br/>\n </span></blockquote>****************<br/>\n<br/>\nI always love healing-via-unschooling stories! It was really amazing just the first year Ray was home seeing the sullen, angry young person grow into a much happier, more thoughtful, more creative person entirely. Unschooling does wonders. <br/>\n<br/>\nIts not a panacea, though, not some kind of magic bullet. There are problems and issues in life that are bigger than unschooling. I&#39;m not saying that to scare anyone off, just to be clear this isn&#39;t snake oil we&#39;re peddling ;) <br/>\n<br/>\nUnschooling does wonders because it works *with* human nature, rather than against it. Humans are marvelously resiliant and can have amazing reserves of grace and strength, and that&#39;s something parents pulling kids out of school (or agreeing to let kids leave) can work to foster. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] New with quick question","postDate":"1266933173","msgId":43233,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwNUJCNTZDLUFCODUtNDMwMi1CREI0LUQ2MUQyNjE4NDdERkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDk0OTg5NS40MDg0NC5xbUB3ZWI1NDYwMy5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PGhscWZiMStmZnZjQGVHcm91cHMuY29tPiA8Y2M2MTIwYTExMDAyMjEwNjM3cTJkZGIzYzhhaDQ3ZDI5NDY0ZjFkMjM2NzhAbWFpbC5nbWFpbC5jb20+IDw5NDk4OTUuNDA4NDQucW1Ad2ViNTQ2MDMubWFpbC5yZTIueWFob28uY29tPg=="},"prevInTopic":43232,"nextInTopic":43234,"prevInTime":43232,"nextInTime":43234,"topicId":43215,"numMessagesInTopic":0,"msgSnippet":"... To add to what others have said, can t is one of those things to examine. People are often raised with a definition of what too expensive means without","messageBody":"<div id=\"ygrps-yiv-676004685\">On Feb 22, 2010, at 10:21 AM, b prince wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My girls love horses and would love lessons but at $45/ hour each,  <br/>\n&gt; I just can&#39;t do it.<br/>\n<br/>\n </span></blockquote>To add to what others have said, &quot;can&#39;t&quot; is one of those things to  <br/>\nexamine. People are often raised with a definition of what &quot;too  <br/>\nexpensive&quot; means without actually digging into the worth of something.<br/>\n<br/>\nThis is a generalized expansion on the word &quot;can&#39;t&quot; and doesn&#39;t  <br/>\nnecessarily apply to your situation. What the finances are in your  <br/>\nhouse aren&#39;t as important as seeing the idea of &quot;can&#39;t&quot; more clearly.<br/>\n<br/>\n&quot;Can&#39;t&quot; can mean someone&#39;s beginning the paycheck period  <br/>\n&quot;luxuriously&quot; eating franks and beans and by the end is doling out  <br/>\nrice and beans and burning scrap wood to keep warm. But &quot;can&#39;t&quot; in  <br/>\nthat context applies to money. Bartering is still an option. It&#39;s  <br/>\nbeen around long before money ;-)<br/>\n<br/>\n&quot;Can&#39;t&quot; can mean it falls into some vague definition of &quot;too  <br/>\nexpensive&quot;. As an example, my daughter hated taking showers in a cold  <br/>\nbathroom, but I knew space heaters were energy hogs and therefore  <br/>\nexpensive to run. But &quot;too expensive&quot; really only applies to long  <br/>\nterm continuous use. They&#39;re an expensive way to heat a house, but to  <br/>\nrun a 1000 Watt space heater for an hour costs (here in Boston) about  <br/>\n10 cents.<br/>\n<br/>\nAnother example is from the Ramona series. In one book she wraps up a  <br/>\nbox of tissues for her friend as a birthday present because she would  <br/>\nhave loved to have the freedom to pull out every tissue in a box. Her  <br/>\nmother argued that it was a waste. But to put it in context, where  <br/>\nelse can you have an hour&#39;s worth of entertainment for $1?<br/>\n<br/>\n&quot;Can&#39;t&quot; is a huge insurmountable roadblock that blocks the direct  <br/>\nroute. It&#39;s helps enormously to get rid of it. *And*, as a second  <br/>\nstep, to look at alternative routes to the goal. Or whether the goal  <br/>\ncan be met in other ways.<br/>\n<br/>\nIt also helps to involve the kids in working towards something. If  <br/>\nyou find a path that&#39;s just $20/hour but even that&#39;s too expensive,  <br/>\nwhat ways can the kids work towards that goal? Maybe they can collect  <br/>\nreturnable soda cans. Maybe they can find cheap stuff at Goodwill and  <br/>\nsell it for even more on eBay.<br/>\n<br/>\nThat&#39;s more about the idea of turning &quot;can&#39;t&quot; into &quot;can&quot; than  <br/>\nspecific solutions that might help in your situation. But the focus  <br/>\nof the list is on helping people grasp the principles. It&#39;s more  <br/>\nabout helping someone learn how to fish than about handing out fish ;-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New with quick question","postDate":"1266931346","msgId":43232,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NkRFQzc5QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":43229,"nextInTopic":43233,"prevInTime":43231,"nextInTime":43233,"topicId":43215,"numMessagesInTopic":0,"msgSnippet":"... hobby, that is barter-able. I am a coffee roaster, and I trade for EVERYTHING. People with horses need their dishes washed, their computers fixed, their","messageBody":"<div id=\"ygrps-yiv-1141260643\"><blockquote><span title=\"ireply\">&gt; Also, think about what you or your husband does, either for work or<br/>\n </span></blockquote>hobby, that is barter-able. I am a coffee roaster, and I trade for<br/>\nEVERYTHING. People with horses need their dishes washed, their computers<br/>\nfixed, their cars washed, whatever it is you do;)<br/>\n<br/>\nJust a caveat since this is tax-season: if you barter a product or<br/>\nservice that you would normally charge for, that counts as taxable. For<br/>\ninstance, if you trade your professional dog grooming skills for someone<br/>\nelse&#39;s baby quilt, and normally you charge $30 for a comparable dog<br/>\ngrooming, then that&#39;s $30 of &quot;income&quot; for you even though it&#39;s in the<br/>\nform of a baby quilt. The flip side is that if it&#39;s not something you&#39;d<br/>\nnormally charge someone cash for (like if you would put it in a yard<br/>\nsale or do it &#39;just for friends&#39;), then there&#39;s no tax liability<br/>\ninvolved. So, check with a tax professional if you barter your<br/>\nprofessional-type skills to make sure you don&#39;t end up owing penalties<br/>\nor whatever that end up costing more than the baby quilt would have.<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":12252351,"authorName":"Gwen","from":"Gwen &lt;willow_selene@...&gt;","profile":"willow_selene","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] New with quick question","postDate":"1266914916","msgId":43229,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5OTQxOC41ODI5NS5xbUB3ZWI1MDQwNy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":43227,"nextInTopic":43232,"prevInTime":43228,"nextInTime":43230,"topicId":43215,"numMessagesInTopic":0,"msgSnippet":"I love horses. When I was young, my best friend had horses so I was able to, sort of, grow up around horses. I was so horse crazy! I read all the Black","messageBody":"<div id=\"ygrps-yiv-1728320654\">I love horses. When I was young, my best friend had horses so I was able to, sort of, grow up around horses. I was so horse crazy! I read all the Black Stallion books, all the Margurite Henry books, if had a horse anywhere in the book - I read it!  One of my favorite books was a coffee table book that had these glorious pictures of all the different breeds and information about each one. <br/>\n<br/>\nThe library is great for grabbing 15 books on a single topic! I saw a computer game at the library today that was all about horses. I know the Wii & DS have horse based games.  <br/>\n<br/>\nWhen I was a pre-teen, I traded yardwork for a chance to ride a friend-of-a-friend-of-a-friend&#39;s horse.<br/>\n<br/>\nWhere we live there is a county Parks & Recreation department that offers lower cost classes.  I&#39;ve seen horseback riding lessons (4 classes/month, I think for $80 - ok, still not cheap)). <br/>\n<br/>\nLast summer we visited a large animal rescue & they had several horses (and pigs & goats too!). The kids loved it. We were able to touch & feed all the animals.   <br/>\n<br/>\nMaybe you could arrange a tour of a local stable?<br/>\n<br/>\nI&#39;ve had great luck finding events at the local fairgrounds - maybe you could attend a 4-H horse show or something similar?<br/>\n<br/>\nGwen<br/>\n<br/>\n<br/>\nAnd the next question that I&#39;m struggling with is how do you afford to<br/>\nunschool? I know that sounds really stupid, but I&#39;ve read over and over<br/>\nagain that if a child shows an interest you provide for it. My girls love<br/>\nhorses and would love lessons but at $45/ hour each, I just can&#39;t do it. And<br/>\nthat is just one example. I&#39;d love to hear how you provide<br/>\nexperiences/materials for your children without going broke.<br/>\nThanks</div>","specialLinks":[]},{"userId":227355922,"authorName":"play_jer_eyes","from":"&quot;play_jer_eyes&quot; &lt;play_jer_eyes@...&gt;","profile":"play_jer_eyes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New to unschooling and this group, seeking advice","postDate":"1266901269","msgId":43234,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhsdm5lbCtyamRxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhscWZiMStmZnZjQGVHcm91cHMuY29tPg=="},"prevInTopic":43233,"nextInTopic":43242,"prevInTime":43233,"nextInTime":43235,"topicId":43215,"numMessagesInTopic":0,"msgSnippet":"So, I m new to this group (just joined about... oh, ten minutes ago!) and I know that in the introductory e-mail to the group it said we might need to lurk for","messageBody":"<div id=\"ygrps-yiv-832779136\">So, I&#39;m new to this group (just joined about... oh, ten minutes ago!) and I know that in the introductory e-mail to the group it said we might need to lurk for a while, but I&#39;m known for being a bit of a rebel, so here goes!<br/>\n<br/>\nJust so you know that people do turn out rather well after pretty darn dramatic experiences in school, let me tell you a bit about my story. I was also a &quot;brain&quot; in school, did well on tests, but found it boring. My escape was to read, so I never lost that love (thank goodness) but I spent every school day sitting in the back of class waiting to get home where my *real* education would begin.<br/>\n<br/>\nThen, in middle school, I had a principal who actually assaulted me. It turned out she had assaulted several other girls in the school (ten or eleven came forward; who knows how many were too scared). So, my mom and the parents of these girls took us out of school and we all started homeschooling together. We were all the smart, behaviorally challenged girls, and many of us actually looked pretty similar. Anyway, we had each other, something many people leaving school in the older years don&#39;t have.<br/>\n<br/>\nI am blessed with dyslexia and I learn my own way, something the school tried to convince me made me stupid. I never believed it. My mom and I tried an Independent Study Program for a few months, before I finally told her I was either dropping out of school to join Cirque du Soleil or we were going to unschool. I had just finished reading Grace Llewellyn&#39;s book &quot;The Teenage Liberation Handbook.&quot; My mom was skeptical (in fact, she asked all the same questions you are asking now) but she trusted me and we tentatively agreed I would have one year to try unschooling and then, for my &quot;freshman&quot; year of high school, I would use my father&#39;s address to go to a better school in a much nicer district.<br/>\n<br/>\nIn my heart, I knew I would never have to go back to school. <br/>\n<br/>\nI did, however, take a few classes (drama, speech and debate, journalism) for one period per day at the *good* public school. They were fine with me taking first period, although I got tackled by truancy officers and security for ditching for the first few weeks! :)<br/>\n<br/>\nAnyway, long story short, I love unschooling. I graduated at the age of 16 and worked full time for a year. Then I went travelling around the country, with nothing but a backpack and some art supplies. I made money selling art on the street. When I applied to college a few years later, they felt I had a *lot* to offer and gave me a full ride scholarship, elected me for Presidential Fellows (the most prestigious fellowship on campus) and gave me a job as a subsitute professor.<br/>\n<br/>\nEvery one of the girls who was initially assualted and allowed to homeschool/unschool (we all rebelled at the same time!) recovered and went on to lead really happy lives.<br/>\n<br/>\nSo, this rather loooong story is just meant to show you that, no matter how hurt your daughter is feeling right now or how scared you are, unschooling provides you the time to heal. Universities are, for the most part, overjoyed to accept unschooled students who have unique transcripts and abilities that don&#39;t necessarily fit the mold. And given time and support, your daughter will once again flourish.<br/>\n<br/>\nBy the way, I joined this group because now I am a proud mama of a 5.5yods who absolutely adores unschooling!<br/>\n<br/>\nHTH,<br/>\nTamara in SoCal</div>","specialLinks":[]},{"userId":9543528,"authorName":"The Coffee Goddess","from":"The Coffee Goddess &lt;hoffmanwilson@...&gt;","profile":"hoffmanwilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] New with quick question","postDate":"1266896070","msgId":43227,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxODY3OC4yOTY5OC5xbUB3ZWIxMTMyMTIubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDk0OTg5NS40MDg0NC5xbUB3ZWI1NDYwMy5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PGhscWZiMStmZnZjQGVHcm91cHMuY29tPiA8Y2M2MTIwYTExMDAyMjEwNjM3cTJkZGIzYzhhaDQ3ZDI5NDY0ZjFkMjM2NzhAbWFpbC5nbWFpbC5jb20+IDw5NDk4OTUuNDA4NDQucW1Ad2ViNTQ2MDMubWFpbC5yZTIueWFob28uY29tPg=="},"prevInTopic":43226,"nextInTopic":43229,"prevInTime":43226,"nextInTime":43228,"topicId":43215,"numMessagesInTopic":0,"msgSnippet":"... unschool? I know that sounds really stupid, but I ve read over and over again that if a child shows an interest you provide for it. My girls love horses","messageBody":"<div id=\"ygrps-yiv-1204760529\"><blockquote><span title=\"ireply\">&gt;&gt;And the next question that I&#39;m struggling with is how do you afford to<br/>\n </span></blockquote>unschool? I know that sounds really stupid, but I&#39;ve read over and over<br/>\nagain that if a child shows an interest you provide for it. My girls<br/>\nlove horses and would love lessons but at $45/ hour each, I just can&#39;t<br/>\ndo it.&gt;&gt;<br/>\n<br/>\nSome ideas:<br/>\n<br/>\n*Some stables will trade clean-up work for lessons.<br/>\n*If you join a 4-H group, there are often people who will &quot;lease&quot; you horses for the year, for riding, care, etc.  This also may be a way to contact people who have horses who are in need of exercise or just don&#39;t mind if you come over and ride.<br/>\n*Check into scholarships.<br/>\n*I have seen more than once on Craigslist, people looking for someone to exercise their horses.<br/>\n*You can often just rent a horse for an hour ride for $20 or so, and perhaps it&#39;s the experience with the horses that your girls want, not the lessons.  My parents bought me a horse when I was about 7, and I learned how to ride just hanging out, jumping onto her back from the fence, walking with her in the pasture, etc.<br/>\n<br/>\nAlso, think about what you or your husband does, either for work or hobby, that is barter-able.  I am a coffee roaster, and I trade for EVERYTHING.  People with horses need their dishes washed, their computers fixed, their cars washed, whatever it is  you do;)<br/>\n<br/>\nThis is just about riding lessons, but it works for everything.  A few years ago my daughter was very interested in cryptozoology.  We went to the national convention (??Who knew there was one!), and she was invited to be a volunteer at the next convention--she had to work the ticket booth, and got free admittance to all the lectures!  Situations like this are easy to find once you know to look for them!  :)<br/>\n<br/>\nDana<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] New with quick question","postDate":"1266891873","msgId":43226,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMTAwMjIyMTgyNGgyNTM5NzY2MHYxNDRlMzI2YmQyN2VmZWFlQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDk0OTg5NS40MDg0NC5xbUB3ZWI1NDYwMy5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PGhscWZiMStmZnZjQGVHcm91cHMuY29tPgkgPGNjNjEyMGExMTAwMjIxMDYzN3EyZGRiM2M4YWg0N2QyOTQ2NGYxZDIzNjc4QG1haWwuZ21haWwuY29tPgkgPDk0OTg5NS40MDg0NC5xbUB3ZWI1NDYwMy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":43225,"nextInTopic":43227,"prevInTime":43225,"nextInTime":43227,"topicId":43215,"numMessagesInTopic":0,"msgSnippet":"... Meredith pointed out some. ... It is life, we afford what we can when we can. My kids love horses too. All three of them. The two older ones have each had ","messageBody":"<div id=\"ygrps-yiv-168165299\">On Mon, Feb 22, 2010 at 10:21 AM, b prince &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:flyingtwinsmom@...\">flyingtwinsmom@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; I am new to the group and to the idea of unschooling. I&#39;ve loved reading<br/>\n&gt; all the wonderful info I can find, but time is short. I would love to find<br/>\n&gt; some audios on unschooling. Does anyone have any ideas where to check?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Meredith pointed out some.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; And the next question that I&#39;m struggling with is how do you afford to<br/>\n&gt; unschool? I know that sounds really stupid, but I&#39;ve read over and over<br/>\n&gt; again that if a child shows an interest you provide for it. My girls love<br/>\n&gt; horses and would love lessons but at $45/ hour each, I just can&#39;t do it. And<br/>\n&gt; that is just one example. I&#39;d love to hear how you provide<br/>\n&gt; experiences/materials for your children without going broke.<br/>\n&gt; Thanks<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>It is life, we afford what we can when we can.<br/>\n<br/>\nMy kids love horses too. All three of them. The two older ones have each had<br/>\n2 horse riding sessions. We haven&#39;t figured out a way to afford regular<br/>\nlessons but there are other things. My little ones do pony rides whenever we<br/>\ncan find them and have money. We have a few board games that pertain to<br/>\nhorses. We&#39;ve done things and looked them up online here and there. If they<br/>\nwere more interested I am sure I could have thought of other ideas.<br/>\n<br/>\nThere are always many resources for any thing. You tube videos, movies, TV<br/>\nshows, toys and games, video games, food, specialty shops, etc. We &quot;shop&quot; on<br/>\nfreecycle and craigslist. I hit thrift stores and discount places, yard<br/>\nsales and trash piles. I ask friends and relatives to get certain things or<br/>\ngive them an interests (like E is into robotics) I look for community<br/>\nresources, either in real life or on line. We create things all the time.<br/>\n<br/>\nAlso before you say can&#39;t, consider. Is there anything you spend $100 on<br/>\neach month that doesn&#39;t serve your family&#39;s needs right now? Can you pinch a<br/>\nfew bucks from groceries and a few more from this or that, cut out a<br/>\nrestaurant meal etc. Get creative. Can you forgo organic fair trade coffee<br/>\nand get a less expensive kind for a couple months? Think outside the box.<br/>\nYou still may not be able to do it. It is important to look for alternatives<br/>\nand extraordinary ideas.<br/>\n<br/>\nOur kids sometimes have to wait for things they want. It isn&#39;t because we<br/>\ndon&#39;t want them to have things or we thing that waiting will build<br/>\ncharacter, waiting is sometimes necessary. When the kids wanted an Xbox we<br/>\ndidn&#39;t have the resources to run out and buy one. We put it on our<br/>\ncollective vision board. We skimped and saved and worked towards it.<br/>\n<br/>\nI just spent my youngest child&#39;s nap time looking for some activities for my<br/>\nkids. We are really broke (not poor but broke) . I am needing to be very<br/>\ncreative right now :-) I scoured the libraries, community events, nature<br/>\ncenters, recreation places, museums (for discount days) and various<br/>\nspecialty places I could find that might have a free or cheap program that<br/>\none or more of my kids might like. I write them on our calendar.<br/>\n<br/>\nTwo resources that are invaluable to our family are our calendar and our<br/>\n(collectively and individually) vision board. They really help me focus my<br/>\nenergies on what is important to us right now.<br/>\n<br/>\nFaith<br/>\n-- <br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":231930081,"authorName":"DJ250","from":"&quot;DJ250&quot; &lt;dj250@...&gt;","profile":"wibberbie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] New with quick question","postDate":"1266888288","msgId":43225,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhEMkFEQkZFQjg0MTQwQkM4MjlDOUI4RDM1MzU2REI3QHJvY2tldHNhdWNlPg==","inReplyToHeader":"PDk0OTg5NS40MDg0NC5xbUB3ZWI1NDYwMy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":43224,"nextInTopic":43226,"prevInTime":43224,"nextInTime":43226,"topicId":43215,"numMessagesInTopic":0,"msgSnippet":"Well, my dh works about 1 and a half jobs—account manager at a medium-sized company for his regular job and a wedding DJ for about ½ to ¾ of the year. I","messageBody":"<div id=\"ygrps-yiv-1585171149\">Well, my dh works about 1 and a half jobsaccount manager at a medium-sized<br/>\ncompany for his regular job and a wedding DJ for about ½ to ¾ of the year.<br/>\nI watch an unschooling friends 4 boys on Fridays, which is quite helpful<br/>\nfor activity money for us!  Weve been lucky to find a good barn that only<br/>\ncharges $25 an hour on purposethe owner has said for 35 years that riding<br/>\nshould be a sport accessible to the masses, not just the rich.  I wonder if<br/>\nyou could begin there at the one youve found so far, with one lesson a week<br/>\nand gain some experience and then volunteer at the barn.  Thats allowed my<br/>\ngirls to be able to be at the barn for hours, grooming, mucking stalls,<br/>\nletting horses out at the end of the day, and even exercising them.  Look<br/>\naround, you may find a cheaper barn!  Ask at the local tack store.  We<br/>\nactually travel about 30 minutes FURTHER to go to this barn because the one<br/>\nnear us charges $45, like the one youve found.  I asked our barn owner why<br/>\nthis other place can get away with charging so much and she said Because<br/>\nthey can! (I thought it was property values or something.) Sad!!<br/>\n<br/>\n <br/>\n<br/>\nIm sure others can provide info on audios.  There have been some wonderful<br/>\nunschooling conferences (and still are upcoming!) that have recorded<br/>\nspeakers and such and you can purchase copies.  Look on YouTube for the<br/>\nmomentSandra Dodd is on there, Dayna Martin, etc.<br/>\n<br/>\n <br/>\n<br/>\n~Melissa, in MD :-)<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>] On Behalf Of b prince<br/>\nSent: Monday, February 22, 2010 10:22 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: [unschoolingbasics] New with quick question<br/>\n<br/>\n <br/>\n<br/>\n  <br/>\n<br/>\nI am new to the group and to the idea of unschooling. I&#39;ve loved reading all<br/>\nthe wonderful info I can find, but time is short. I would love to find some<br/>\naudios on unschooling. Does anyone have any ideas where to check? <br/>\n<br/>\nAnd the next question that I&#39;m struggling with is how do you afford to<br/>\nunschool? I know that sounds really stupid, but I&#39;ve read over and over<br/>\nagain that if a child shows an interest you provide for it. My girls love<br/>\nhorses and would love lessons but at $45/ hour each, I just can&#39;t do it. And<br/>\nthat is just one example. I&#39;d love to hear how you provide<br/>\nexperiences/materials for your children without going broke.<br/>\nThanks<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\nNo virus found in this incoming message.<br/>\nChecked by AVG - www.avg.com<br/>\nVersion: 9.0.733 / Virus Database: 271.1.1/2703 - Release Date: 02/22/10<br/>\n02:34:00<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New with quick question","postDate":"1266883985","msgId":43224,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhsdjZpaCt0bmNoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk0OTg5NS40MDg0NC5xbUB3ZWI1NDYwMy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":43222,"nextInTopic":43225,"prevInTime":43223,"nextInTime":43225,"topicId":43215,"numMessagesInTopic":0,"msgSnippet":"... http://sandradodd.com/listen/ ... ******************* There are real limits in life, and finances are often one of those real limits. The thing is not to","messageBody":"<div id=\"ygrps-yiv-1466196844\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, b prince &lt;flyingtwinsmom@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I would love to find some audios on unschooling.<br/>\n<br/>\n </span></blockquote><a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/listen/\">http://sandradodd.com/listen/</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; And the next question that I&#39;m struggling with is how do you afford to unschool? I know that sounds really stupid, but I&#39;ve read over and over again that if a child shows an interest you provide for it.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nThere are real limits in life, and finances are often one of those real limits. The thing is not to think of limits as brick walls - there are almost always options! Not every option is a picture perfect ideal, but its amazing how looking for alternatives and keeping an open mind can produce opportunities you didn&#39;t even know existed. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;My girls love horses and would love lessons but at $45/ hour each, I just can&#39;t do it.<br/>\n </span></blockquote>********************<br/>\n<br/>\nHow old are they? Do they actually want lessons, per se, or is it that they love horses and want to play horse games, get horse toys, run around and pretend to be horses, and now and then get to look at, pet and ride a horse? Lessons are a whooooooole different ball of wax than what most girls want from the &quot;horse phase&quot;. <br/>\n<br/>\nIf they really did want lessons - how much would you pay for homeschooling curriculum? How much would you pay for materials and school clothes if they were in school? Those kinds of questions can be a good &quot;reality check&quot; when you&#39;re balking at spending money on something your kids desire. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":191799655,"authorName":"b prince","from":"b prince &lt;flyingtwinsmom@...&gt;","profile":"flyingtwinsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"New with quick question","postDate":"1266852094","msgId":43222,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk0OTg5NS40MDg0NC5xbUB3ZWI1NDYwMy5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGNjNjEyMGExMTAwMjIxMDYzN3EyZGRiM2M4YWg0N2QyOTQ2NGYxZDIzNjc4QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGhscWZiMStmZnZjQGVHcm91cHMuY29tPiA8Y2M2MTIwYTExMDAyMjEwNjM3cTJkZGIzYzhhaDQ3ZDI5NDY0ZjFkMjM2NzhAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":43221,"nextInTopic":43224,"prevInTime":43221,"nextInTime":43223,"topicId":43215,"numMessagesInTopic":0,"msgSnippet":"I am new to the group and to the idea of unschooling. I ve loved reading all the wonderful info I can find, but time is short. I would love to find some audios","messageBody":"<div id=\"ygrps-yiv-1671222069\">I am new to the group and to the idea of unschooling. I&#39;ve loved reading all the wonderful info I can find, but time is short. I would love to find some audios on unschooling. Does anyone have any ideas where to check? <br/>\n<br/>\nAnd the next question that I&#39;m struggling with is how do you afford to unschool? I know that sounds really stupid, but I&#39;ve read over and over again that if a child shows an interest you provide for it. My girls love horses and would love lessons but at $45/ hour each, I just can&#39;t do it. And that is just one example. I&#39;d love to hear how you provide experiences/materials for your children without going broke.<br/>\nThanks<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":431670068,"authorName":"Jan Smith","from":"Jan Smith &lt;inthemoment35@...&gt;","profile":"inthemoment35","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"1"},"subject":"Re: [unschoolingbasics] New to unschooling and this group, seeking advice","postDate":"1266850016","msgId":43221,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0MjIxNy4yOTM5LnFtQHdlYjExNDExOC5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PGhscWZiMStmZnZjQGVHcm91cHMuY29tPg==","referencesHeader":"PGhscWZiMStmZnZjQGVHcm91cHMuY29tPg=="},"prevInTopic":43217,"nextInTopic":43222,"prevInTime":43220,"nextInTime":43222,"topicId":43215,"numMessagesInTopic":0,"msgSnippet":"Hi Diane! I am also pretty new to unschooling, and to the group. I really wanted to wish you luck with your new journey. I started homeschooling my 14yom and","messageBody":"<div id=\"ygrps-yiv-1385018036\">Hi Diane!<br/>\n<br/>\nI am also pretty new to unschooling, and to the group.<br/>\n<br/>\nI really wanted to wish you luck with your new journey. I started homeschooling my 14yom and 8yof this last fall. My son has not had the best experience &quot;in school&quot; and started struggling to produce grades because he was often very bored, therefor when unknown material was covered, the on switch didn&#39;t always come &quot;on&quot;. However he always placed very high on the tests the schools required. He lost interest in school, learning, and began to hate reading, something he previously loved to do. While we tried at first to school at home, I quickly began to realize that he was doing more for himself and learning more when I just let him guide his own learning. I admittedly am scared that he will not learn what he is suppose to according to colleges etc. Yet in my heart I see the growth in my son in such a short time of our &quot;the world is our classroom, even during school hours&quot; attitude. I even see his love of reading returning more and more every day. By the<br/>\n way I do refer to &quot;our&quot; learning, becauses this is not just my childrens journey. We as a family are all taking this journey, and my children seem to me to be understanding that learning is meant to be fun and that it is a lifelong journey.<br/>\n<br/>\nWe are all so much happier with an unschooling style of education in our lives:) !<br/>\n<br/>\nGood luck to you and your daughter Diane. I have quickly learned that we are not alone on this journey.<br/>\n<br/>\nThank you to all of you out there that have helped me on my journey thus far! </div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New to unschooling and this group, seeking advice","postDate":"1266765786","msgId":43217,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhscmo0cStjaGhyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhscWZiMStmZnZjQGVHcm91cHMuY29tPg=="},"prevInTopic":43216,"nextInTopic":43221,"prevInTime":43216,"nextInTime":43218,"topicId":43215,"numMessagesInTopic":0,"msgSnippet":"... Hi Diane! I m Meredith, mom to always unschooled Morgan (8) and step mom to 16yo Ray, who s been through school at home, then public school, and now","messageBody":"<div id=\"ygrps-yiv-1868785652\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;dphock&quot; &lt;dphock@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m new to the group and new to unschooling. We are on the verge of introducing this concept with our 14 year old daughter.<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Hi Diane! I&#39;m Meredith, mom to &quot;always&quot; unschooled Morgan (8) and step mom to 16yo Ray, who&#39;s been through school at home, then public school, and now whole life unschooling (sometimes called &quot;radical&quot; unschooling). We love unschooling and love the fact that the same principles can be extended to all aspects of life - all life is learning! <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Are there people here doing this for kids in the 14-18 yr age range? How does it work for your child? What is your child doing? Are you concerned about whether your child will learn what he/she needs to learn to get to college?<br/>\n </span></blockquote>****************<br/>\n<br/>\nMy 16yo isn&#39;t currently interested in college, but that&#39;s something that could change, for sure. Currently he&#39;s studying artisan blacksmithing (as opposed to farrier work) and apprenticing with a local wood sculptor while doing odd-jobs. Most of his friends are in their early twenties and he doesn&#39;t have much in common with high-school teens unless they&#39;re unschoolers or relaxed homeschoolers. <br/>\n<br/>\nSomething that can really help, when thinking about college, is to realize that students who wait past the usual age to start have more interest, better focus, more enthusism - and a better idea of why they&#39;re there. Your dd doesn&#39;t &quot;have to&quot; start college at 18 (or younger) to be successful. Some unschoolers start out in junior colleges during the high-school years, while others wait until their twenties, or find they don&#39;t need college at all. <br/>\n<br/>\nMy 8yo is the sort of kid who could very well be taking junior college classes during her late teens, and there are programs in my area that other home educators make use of. She&#39;s very interested in maths and sciences, but also in visual arts, so its hard to say which direction her passions will lead her. I don&#39;t worry about her getting &quot;formal&quot; education in preparation for any of that - I can see that she has a really love of exploring and discovering and is picking up even the underlying concepts of formal mathematics and even &quot;hard&quot; science as she explores. The concepts are the hard thing to teach! And since those are areas of interst to her we have some more formal books - tucked in with the stories and arts-n-crafts books, and no special emphasis. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;So we really have reached the decision that her emotional well being and good physical health are most important, and that if we just let her explore learning on her own for a bit,she might discover she likes learning instead of associating &quot;learning&quot; with &quot;school&quot; and hating it all on principle.<br/>\n </span></blockquote>***************<br/>\n<br/>\nThis is very much how things went with Ray. He hated school and home-ed and it was stressing him out enormously. He was miserable. It took Time for him to recover from that! It might help you to read about deschooling - the process by which kids recover from school, and also about how &quot;natural&quot; learning looks. Here are some links to get you started:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/beginning\">http://sandradodd.com/beginning</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/pam/principles\">http://sandradodd.com/pam/principles</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<br/>\nIts valuable to know that it Is a process and can look a lot like a kid &quot;doing nothing&quot; for awhile. It can also help - a lot! - to do a little deschooling of your own, get some of those old school messages and assumptions out of your head. That&#39;s important because natural learning often doesn&#39;t look much like school, even for teens. It can look more like adult learning - trying new things, goofing off, making mistakes, getting all wrapped up in something... Adults don&#39;t always turn to classes to learn, although we sometimes do.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;The more we read, the more we think that allowing C to follow her interests is the way to go, at least for a while. But we are nervous and don&#39;t know how this will work, and we are concerned about doing this for the first time during 8th grade and high school.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nRay was 13 when we pulled him out of school - its okay! there&#39;s still time! Give her plenty of time to recoup and decompress. Its good that you&#39;re already thinking in terms of supporting her emotionally first and foremost - that&#39;s an idea that helps unschooling &quot;work&quot; better, and its often one that&#39;s hard for parents to wrap their minds around. But when a person is under a lot of stress it impedes learning - you learn about stress and being stressed and not much more. When a person is relaxed and happy, learning is effortless! Even learning something challenging goes much much more easily. <br/>\n<br/>\nRay now works pretty dang hard pounding metal and trying to wrap his mind around the technical side of smithing, but because he&#39;s excited about it, he&#39;s happy to put himself through the challenge. This same kid was continually in trouble at school for not finishing his homework and seemed to need to be pushed to do anything. <br/>\n<br/>\nMy 8yo will also work hard to overcome challenges and learn new things - and most school parents find 8yos &quot;need&quot; a lot of pushing. That&#39;s not something magic or special about my dd, its an aspect of human nature. We *like* challenges, but on our own terms. Unschooling gives kids the ability to choose their own terms, to Choose to be challenged. Its exciting to see. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;she&#39;s pretty introverted, and it seemed that just being in a classroom with 20 other kids was pretty stressful for her<br/>\n </span></blockquote>**************<br/>\n<br/>\nThis next is sort of tangential to your main post, but still relates to unschooling in the whole-life sense, helping them learn to navigate their world and challenges. <br/>\n<br/>\nMy 8yo gets easily overwhelmed in crowds and very social situations - sometimes to the point of freezing up and becomming almost totally non-responsive. One of the things that helps her is having a portable game system! It lets her narrow her focus down away from People, catch her breath, and then decide when she&#39;s ready to interact. In social scenes it can look a little odd - one girl off by herself with her game, but as long as no-one tries to coax her out of her comfort zone she eventually makes the choice to interact with others. <br/>\n<br/>\nThat&#39;s really an aspect about what I said above about kids being willing to undergo challenges when they set the terms - as I said, the basic principles of how natural learning works apply to all aspects of life, not just academics. Helping your dd find her comfort zone and set the conditions by which she&#39;ll move out of it frees her up to learn more about the world, about herself, about people in general. <br/>\nThat&#39;s valuable stuff to learn!<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] New to unschooling and this group, seeking \tadvice","postDate":"1266763026","msgId":43216,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMTAwMjIxMDYzN3EyZGRiM2M4YWg0N2QyOTQ2NGYxZDIzNjc4QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhscWZiMStmZnZjQGVHcm91cHMuY29tPg==","referencesHeader":"PGhscWZiMStmZnZjQGVHcm91cHMuY29tPg=="},"prevInTopic":43215,"nextInTopic":43217,"prevInTime":43215,"nextInTime":43217,"topicId":43215,"numMessagesInTopic":0,"msgSnippet":"So, we have concluded that this child needs a different path. We saw her happiest and healthiest when we took the emphasis off of school and just played with","messageBody":"<div id=\"ygrps-yiv-565408171\">So, we have concluded that this child needs a different path. We saw her<br/>\nhappiest and healthiest when we took the emphasis off of &quot;school&quot; and just<br/>\nplayed with exploring new subjects, reading, etc. We&#39;ve decided that we<br/>\nwould rather have a child who is emotionally stable and happy and interested<br/>\nin learning (which, generally, she is), than a depressed, anxious kid who<br/>\nhas a piece of paper that says she did 8th grade thru STanford.<br/>\n<br/>\nIt&#39;s clear that the school path she has experienced has caused C to hate<br/>\nschool and anything associated with school. The more we read, the more we<br/>\nthink that allowing C to follow her interests is the way to go, at least for<br/>\na while. But we are nervous and don&#39;t know how this will work, and we are<br/>\nconcerned about doing this for the first time during 8th grade and high<br/>\nschool.<br/>\n<br/>\nAre there people here doing this for kids in the 14-18 yr age range? How<br/>\ndoes it work for your child? What is your child doing? Are you concerned<br/>\nabout whether your child will learn what he/she needs to learn to get to<br/>\ncollege?<br/>\n<br/>\n*** De-schooling is the first place to start :-) For you and your child.<br/>\nHere&#39;s a link to a wealth of information. <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<br/>\nFind fun things for you and your child to do. Fun, not worrying about<br/>\nacademics, school or even learning. Play, laugh, re-discover joy. Its harder<br/>\nthan you think for some people. As a parent, you may want to learn as much<br/>\nas possible about unschooling. There are many great resources, books, blogs,<br/>\nvlogs, videos, conferences, etc al about unschooling. Sink in deep. Focus on<br/>\nyour own joy in learning, do you want to learn to knit? bake a cake? martial<br/>\narts? etc...what passions drive you?<br/>\n<br/>\n&quot;How does it work for your child?&quot; My child has been unschooled since birth<br/>\nand radically unschooled for several years, its going to look different. My<br/>\n13dd spends her time, writing her novel (her passion), texting and emailing<br/>\nfriends, making videos, creating art, reading, going to live music events,<br/>\nriding her bike. It might not sound like a lot of &quot;learning&quot; but its in<br/>\nthere :-) She just tried out school (because she wanted to) she caught up to<br/>\nher age peers in a week. And was then bored by the work (easy and<br/>\nuninteresting) and kids (boring and passionateness) after a month.<br/>\n<br/>\n&quot;Are you concerned about whether your child will learn what he/she needs to<br/>\nlearn to get to college?&quot; I am not. First because college isn&#39;t necessarily<br/>\na goal. And second because I trust that she will learn what she needs to<br/>\nknow, when she needs to know it. She did that with school recently. She<br/>\nnever needed written math before but certainly learned that really fast :-)<br/>\nShe wanted to edit her book, she learned grammar and spelling because it<br/>\nmeant something to her. She now loves grammar!<br/>\nCollege will happen if she wants it. Or it won&#39;t. She may discover a passion<br/>\nthat requires something other than college.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\nOf course, we&#39;ve realized that it&#39;s stupid of us to worry about college when<br/>\nwhat confronts us today is a kid who is so miserable that she just wants to<br/>\ndie. So we really have reached the decision that her emotional well being<br/>\nand good physical health are most important, and that if we just let her<br/>\nexplore learning on her own for a bit,she might discover she likes learning<br/>\ninstead of associating &quot;learning&quot; with &quot;school&quot; and hating it all on<br/>\nprinciple.<br/>\n<br/>\nWe are in a scary place, but we have concluded that unschooling feels like<br/>\nthe way to go. But I sure could use some reassurance about how this will<br/>\nwork with a 14 year old!<br/>\n<br/>\n*** I am happy that you see that, its a huge step. If she has fears about<br/>\nhow she may do there are a wealth of blogs, vlogs by unschooled teens and<br/>\nyoung adults.<br/>\n<br/>\nI am not sure where in the country you are but conferences are all over.<br/>\nThere is a great one pertinent to your life coming up, The Autodidactic<br/>\nSymposium, <a rel=\"nofollow\" target=\"_blank\" href=\"http://theautodidactsymposium.com/start.htm?keep_has_js=1\">http://theautodidactsymposium.com/start.htm?keep_has_js=1</a>  It is<br/>\nin South Carolina.<br/>\n<br/>\n<br/>\nFaith<br/>\n-- <br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154931697,"authorName":"dphock","from":"&quot;dphock&quot; &lt;dphock@...&gt;","profile":"dphock","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"New to unschooling and this group, seeking advice","postDate":"1266729121","msgId":43215,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhscWZiMStmZnZjQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":43216,"prevInTime":43214,"nextInTime":43216,"topicId":43215,"numMessagesInTopic":0,"msgSnippet":"Hi -- I m new to the group and new to unschooling. We are on the verge of introducing this concept with our 14 year old daughter. Our situation (and our path","messageBody":"<div id=\"ygrps-yiv-1107483064\">Hi --<br/>\n<br/>\nI&#39;m new to the group and new to unschooling. We are on the verge of introducing this concept with our 14 year old daughter.<br/>\n<br/>\nOur situation (and our path to unschooling) is this: C went to a traditional large elementary school from grades K thru 4. She liked school and always excelled academically, but had some social stresses -- she&#39;s pretty introverted, and it seemed that just being in a classroom with 20 other kids was pretty stressful for her. We moved her to a much smaller elementary school for 5th and 6th grades. During that time, C was diagnosed with Asperger&#39;s. She had a rough<br/>\ntime socially and began to have a lot of stomach aches and was miserable about going to school. She continued to get excellent grades, but hated school.<br/>\n<br/>\nFor 7th grade, we tried a tiny, new private school -- supposedly individualized instruction, etc. Well, that was not a good fit-- even tho the class had 12 kids in it, we saw that the teachers didn&#39;t discipline the kids and the classes were pretty chaotic. We were not impressed. Then C started having frequent, intense migraine headaches, frequently needing to miss school because her<br/>\nheadaches were so severe.<br/>\n<br/>\nWe pulled her out of school by Easter last year, and started home schooling. C was so pleased to be home and away from the school environment. Her migraines lessened. Our whole focus was making learning fun and trying to let her be the happy kid we&#39;d not seen for a while. The spring and the summer went well, and she had a grand time exploring some camps and week-long summer activies.<br/>\n<br/>\nOne of those activities (a computer game design camp) was at STanford<br/>\nUniversity, where we learned of Stanford&#39;s online high school program. It&#39;s distance ed, with &quot;virtual&quot; live classes with interaction with other kids and the teacher. We thought that might be ideal, giving C a connection with peers but from a &quot;save&quot; distance, not isolating her too much, and with academics that<br/>\nwould challenge her. C was excited about giving it a try.<br/>\n<br/>\nI must confess that we have been apprehensive about home-schooling because of our uncertainty about how WE can decide on and provide the curriculum. My husband is a college professor, I&#39;m an attorney -- the &quot;traditional&quot; educational path has worked well for us, and we know that C is capable of doing pretty high level work. We didn&#39;t want to short-change her academic ability, and were just<br/>\nuncertain about how we could manage home-schooling.<br/>\n<br/>\nIn any event, we got started in the Stanford program (EPGY &quot; Educational Program for Gifted Youth&quot;) -- and while we are quite impressed with the humanities side of the program, we are seriously underwhelmed by the math and science side. We thought the teaching was minimal or geared to college kids -- although their admissions team denied it, we got the impression that the program is geared for<br/>\n&quot;type A&quot;, high-achiever kids who are doing work far above their age/grade level. And C&#39;s stress level went through the roof, with resulting depression and more migraines and stomach aches.<br/>\n<br/>\nWe have struggled along, but we are seeing her sink further into depression and anxiety and it is all focused on school. We have a &quot;team&quot; of a mental health counselor, a pediatric neurologist (for the migraines), a pediatric psychiatrist (for working with antidepressant medication) -- and they have been helpful and supportive. But still, C is sinking further and says she hates feeling the way<br/>\nshe feels, she wants to die, and wishes she could just go to sleep and never wake up. We see that most of the anxiety comes from having to do school. Any school. Despite working with stress management stuff, we&#39;re seeing the situation get worse, not better.<br/>\n<br/>\nSo, we have concluded that this child needs a different path. We saw her happiest and healthiest when we took the emphasis off of &quot;school&quot; and just played with exploring new subjects, reading, etc. We&#39;ve decided that we would rather have a child who is emotionally stable and happy and interested in learning (which, generally, she is), than a depressed, anxious kid who has a piece of paper that says she did 8th grade thru STanford.<br/>\n<br/>\nIt&#39;s clear that the school path she has experienced has caused C to hate school and anything associated with school. The more we read, the more we think that allowing C to follow her interests is the way to go, at least for a while. But we are nervous and don&#39;t know how this will work, and we are concerned about doing this for the first time during 8th grade and high school.<br/>\n<br/>\nAre there people here doing this for kids in the 14-18 yr age range? How does it work for your child? What is your child doing? Are you concerned about whether your child will learn what he/she needs to learn to get to college?<br/>\n<br/>\nOf course, we&#39;ve realized that it&#39;s stupid of us to worry about college when what confronts us today is a kid who is so miserable that she just wants to die. So we really have reached the decision that her emotional well being and good physical health are most important, and that if we just let her explore learning on her own for a bit,she might discover she likes learning instead of associating &quot;learning&quot; with &quot;school&quot; and hating it all on principle.<br/>\n<br/>\nWe are in a scary place, but we have concluded that unschooling feels like the way to go. But I sure could use some reassurance about how this will work with a 14 year old!<br/>\n<br/>\nThanks---<br/>\n<br/>\nDiane</div>","specialLinks":[]}],"prevTopicId":43228,"nextTopicId":34886}}