{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":259992243,"authorName":"Karen Mann","from":"&quot;Karen Mann&quot; &lt;MommaDukes420@...&gt;","profile":"celtic_starz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Fear and Food","postDate":"1152884925","msgId":15758,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1ZTJkOWRhMDYwNzE0MDY0OHU3ZGQ2MzBiOWpmYzQ1Y2FkNjU2YWY1YmVlQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGU5NmJsMyt0OHFvQGVHcm91cHMuY29tPg==","referencesHeader":"PDA3MTMyMDA2MDI0Ny4xNDc1Ny40NEI1QjQ1QjAwMDI4MzBCMDAwMDM5QTUyMjE2NTUxNDA2MEUwMzAzMDEwMzAyMEE5NkBjb21jYXN0Lm5ldD4JIDxlOTZibDMrdDhxb0BlR3JvdXBzLmNvbT4="},"prevInTopic":15734,"nextInTopic":0,"prevInTime":15757,"nextInTime":15759,"topicId":15682,"numMessagesInTopic":0,"msgSnippet":"... i have and still do at times.  my boys started when they were about 14. same age i was when i started.  i ve quit smoking 3 times now. ;)  been smoke free","messageBody":"<div id=\"ygrps-yiv-841095507\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; ~*~Yah, me, too. But seriously, what would (will) you do if they want<br/>\n&gt; them? Say you provided good information in a loving way with no<br/>\n&gt; guilt, etc. and they still want them? Will you buy them? ~*~<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>i have and still do at times.  my boys started when they were about 14.<br/>\nsame age i was when i started.  i&#39;ve quit smoking 3 times now. ;)  been<br/>\nsmoke free about a year this time and dh still smokes.<br/>\n<br/>\nthey knew of the dangers of smoking when they started.  i had a feeling that<br/>\nthey would try it.  they tried it to be cool.  when they started, smoking<br/>\nwas just becoming taboo.  they were shocked when i wasn&#39;t mad at them for<br/>\nsmoking.  what could i really do anyway?  if i got all dictorial and<br/>\ntyrannical, they would get sneaky and hide it.  my relationship was NEVER<br/>\nlike that with them and it certainly wasn&#39;t going to start over<br/>\ncigarettes!!   they even got a couple of &quot;smoking tickets&quot;.   the fine was<br/>\n$50, watch a video of people with various diseases caused by smoking and sit<br/>\nin a 4 hour class.  i don&#39;t think they give these out anymore.  it really<br/>\ndidn&#39;t help the cause, it just pissed off alot of parents.  yeah..they had<br/>\nto take time from work to drive to court, watch the video; then, the<br/>\nfollowing saturday, they would have to drive the kiddo to class that began<br/>\nat 8:00 am sharp.  oh and if the kiddo wasn&#39;t there on time, the class would<br/>\ndecide IF the kiddo could join and if they said no, you had to go back to<br/>\ncourt and start all over.   the judge on these cases was a dweeb.  he&#39;d ask<br/>\nthe kids if they still smoke and of course they&#39;d say no.  duh!!  but the<br/>\nmajority would be back in front of him and he&#39;d be all over them.  asking<br/>\nthe parents if the kid listens, does their homework, has a curfew, etc.  i<br/>\nremember a 17 yo (18 was the cutoff for tickets) getting a court imposed<br/>\ncurfew of 8:30 because the parents said he sorta listens some of the time.<br/>\nwish i knew what happened with that kid.<br/>\n<br/>\ni think kids with smoking parents have more of a tendancy to try it than<br/>\nnon-smokers.  i got my first cigarette from my mom.  ugh..nasty things they<br/>\nwere.  they were called herbert taryeton and were non-filtered.   but i HAD<br/>\nto try it.  it was soooo cool.  i was born in &#39;63 and smoking was THE thing<br/>\nback then.  i remember the &quot;chic&quot; matching ashtrays and lighters for the<br/>\ncoffee tables.  smoking was everywhere.  it was on t.v. and in the movies.<br/>\nremember those sexy cigarette holders the stars would use.  AND you could<br/>\nsmoke in stores and at your desk at work.  when i was in high schoool, we<br/>\nhad a &quot;smoking lounge&quot;.  it was located at the back of the school in a<br/>\ncourtyard.  that&#39;s where i spent most of my time.  quit smoking?  hell no.<br/>\nit was too much fun!<br/>\n<br/>\nanyway....they both still smoke and i tease them (and dh) about it.  i would<br/>\nlove for all of them to quit.  they all say they want to quit, just as all<br/>\nsmokers do.  i think it&#39;s all in the mind (addictive personalities and all<br/>\nthat &quot;psycho&quot; stuff), plus the habit of something to do with your hands.<br/>\n<br/>\noh, the girls are a bit different...brittani smoked and quit.  sara tried it<br/>\ndidn&#39;t like it.  hope says she will never smoke because it stinks and people<br/>\nlook &quot;stupid&quot; when they do.  it all depends on the person.  some smoke, some<br/>\ndon&#39;t.<br/>\n<br/>\n<br/>\n-- <br/>\n~*~Karen~*~<br/>\nTony (22) Donnie (21) Brittani (17) Sara (16) Hope (11)<br/>\n~*~Insanity: doing the same thing over and over again and expecting<br/>\ndifferent results. - Albert Einstein<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":187549037,"authorName":"techwritercsbn","from":"&quot;techwritercsbn&quot; &lt;techwritercsbn@...&gt;","profile":"techwritercsbn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Fear and Food","postDate":"1152823779","msgId":15734,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU5NmJsMyt0OHFvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA3MTMyMDA2MDI0Ny4xNDc1Ny40NEI1QjQ1QjAwMDI4MzBCMDAwMDM5QTUyMjE2NTUxNDA2MEUwMzAzMDEwMzAyMEE5NkBjb21jYXN0Lm5ldD4="},"prevInTopic":15696,"nextInTopic":15758,"prevInTime":15733,"nextInTime":15735,"topicId":15682,"numMessagesInTopic":0,"msgSnippet":"... not, why not?  ... using them in some kind of art project.... ... Yah, me, too.  But seriously, what would (will) you do if they want them?  Say you","messageBody":"<div id=\"ygrps-yiv-1755597782\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, zenmomma@... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt;&gt;Does anyone out there keep a bowl of cigarettes on the table? If <br/>\n </span></blockquote>not, why not? &gt;&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; No one has ever asked for cigarettes. &lt;g&gt; Although I could see us <br/>\n </span></blockquote>using them in some kind of art project....<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n </span></blockquote>Yah, me, too.  But seriously, what would (will) you do if they want <br/>\nthem?  Say you provided good information in a loving way with no <br/>\nguilt, etc. and they still want them?  Will you buy them?  <br/>\n<br/>\nIf so, more power to you for being so committed to the principle.  <br/>\n(I&#39;ll keep reading and maybe I&#39;ll get there).  If not, maybe the food <br/>\nstuff comes down to just having information.  Perhaps that is the <br/>\nreason that providing whatever food options seems like a safe choice?<br/>\n<br/>\nI would love a direct answer to this question, because I think it <br/>\nwill get to the point of the matter.  We all would probably limit <br/>\n*somewhere* based on what we might call fact and others might call <br/>\nfear.  As a relatively new unschooler, I&#39;d like to hear more <br/>\nresponses like Kelly&#39;s and perhaps some detailed examples of how to <br/>\nnavigate the tricky world of those times when we feel that for the <br/>\n*safety of our children*, we must do some *form* of limiting (as <br/>\nlittle as possible, of course) -- even when we disagree about what <br/>\n*safe* is. And I&#39;d love to hear that in the context of food.  If <br/>\nthere are none in the context of food, examples in theory using <br/>\ncigarettes or train-racing or whatever floats the boat will work for <br/>\nme.  :)</div>","specialLinks":[]},{"userId":218449772,"authorName":"zenmomma@comcast.net","from":"zenmomma@...","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [unschoolingbasics] Digest Number 1053","postDate":"1152758875","msgId":15696,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA3MTMyMDA2MDI0Ny4xNDc1Ny40NEI1QjQ1QjAwMDI4MzBCMDAwMDM5QTUyMjE2NTUxNDA2MEUwMzAzMDEwMzAyMEE5NkBjb21jYXN0Lm5ldD4="},"prevInTopic":15682,"nextInTopic":15734,"prevInTime":15695,"nextInTime":15697,"topicId":15682,"numMessagesInTopic":0,"msgSnippet":"... No one has ever asked for cigarettes.  Although I could see us using them in some kind of art project.... -- ~Mary http://zenmommasgarden.blogspot.com/ ","messageBody":"<div id=\"ygrps-yiv-346503097\"><blockquote><span title=\"ireply\">&gt;&gt;Does anyone out there keep a bowl of cigarettes on the table? If not, why not? &gt;&gt;<br/>\n<br/>\n </span></blockquote>No one has ever asked for cigarettes. &lt;g&gt; Although I could see us using them in some kind of art project....<br/>\n<br/>\n--<br/>\n~Mary<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://zenmommasgarden.blogspot.com/\">http://zenmommasgarden.blogspot.com/</a><br/>\n<br/>\n&quot;The miracle is not to walk on water. The miracle is to walk on the<br/>\ngreen earth, dwelling deeply in the present moment and feeling truly<br/>\nalive.&quot;<br/>\n                                   ~Thich Nhat Hanh<br/>\n<br/>\n -------------- Original message ----------------------<br/>\nFrom: Christe Bruderlin &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:techwritercsbn@...\">techwritercsbn@...</a>&gt;<br/>\n<blockquote><span title=\"qreply\"> &gt; In a message dated 7/11/2006 11:53:18 P.M. Eastern Standard Time, <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Genant2@...\">Genant2@...</a><br/>\n&gt; unschoolingbasics@ yahoogroups. com writes:<br/>\n&gt; <br/>\n&gt; &quot;Are my personal food choices and those I make with my family based on fear <br/>\n&gt; or fact?&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n&gt; <br/>\n&gt; For me, I can say both.&quot;<br/>\n&gt;  <br/>\n&gt; I think this is probably true for most of the choices most individuals make (not <br/>\n&gt; necessarily OMG FEAR!, but wanting to avoid the alternate option).  <br/>\n&gt;  <br/>\n&gt; &quot;&gt;&gt;&gt;It is unfortunate that the American diet has moved in so many directions <br/>\n&gt; that what is best for human consumption is unclear to most people in our <br/>\n&gt; country. &lt;&lt;&lt;&lt;<br/>\n&gt; <br/>\n&gt; &quot;I am not sure that is fact. I would bet, now I don&#39;t know for sure but just <br/>\n&gt; thinking about my own community of friends, that most people know what the <br/>\n&gt; body needs and how to best feed their body. I know I do, doesn&#39;t mean I eat <br/>\n&gt; that way though.&quot;<br/>\n&gt;  <br/>\n&gt; You might and that might be that most people do know and just choose to ignore <br/>\n&gt; for whatever reasons they have.  Perhaps everyone does do the research, I&#39;m not <br/>\n&gt; sure.  However, *most* people I talk to have felt confused by the conflicting <br/>\n&gt; nutrition information out there and few people take the time to read the actual <br/>\n&gt; scientific literature. <br/>\n&gt;  <br/>\n&gt; For example, I hear statements all the time that just aren&#39;t true, and I see <br/>\n&gt; many people take them as true.  Consider the currently-popular protein.  What <br/>\n&gt; has more protein per calorie (not per oz or lb, because although the USDA views <br/>\n&gt; food that way, our bodies look at nutrients - macro or micro - per calorie) -- <br/>\n&gt; Broccoli or beef?  Or for another one, what has more calcium per calorie -- Kale <br/>\n&gt; or milk?  These are just fun examples if it is something you would enjoy looking <br/>\n&gt; up, but really, the answers shock many people.  <br/>\n&gt; <br/>\n&gt; &quot;So you believe it is a fact(?) that if you don&#39;t limit their food choices they <br/>\n&gt; can&#39;t do it for themselves?&quot;<br/>\n&gt;  <br/>\n&gt; I didn&#39;t say that, however, I cannot say I&#39;m sure either way on this one when <br/>\n&gt; speaking for people (e.g. young children) without full information.  I do think <br/>\n&gt; it is a fact that our tastebuds and emotional state, etc. can easily overrule <br/>\n&gt; our body&#39;s proper hunger signals and drive for nutrients -- leading to the <br/>\n&gt; consumption of non-nutritive food.  I also believe that without full knowledge <br/>\n&gt; (which my children do not have yet), individuals cannot make the safest, <br/>\n&gt; healthiest choices because they just do not know.  Though I am working to <br/>\n&gt; continually provide information, they cannot read the data, do the research, <br/>\n&gt; etc., and the introduction of many non-food foods into the human diet, I truly <br/>\n&gt; believe, can throw off the body&#39;s natural signals.  <br/>\n&gt;  <br/>\n&gt; &quot;That is not our reality.&quot;<br/>\n&gt;  <br/>\n&gt; I am truly glad that you are happy with your family&#39;s diet.  I am *really* <br/>\n&gt; trying to avoid going into the specifics of what anyone eats (perhaps a <br/>\n&gt; meta-discussion) and I don&#39;t want to comment on what your family eats <br/>\n&gt; specifically, because I think that is beside the point of this discussion and it <br/>\n&gt; really isn&#39;t my place to say what is right for any other family.    <br/>\n&gt;  <br/>\n&gt; &quot;People here know that I don&#39;t restrict my children and have this image in their <br/>\n&gt; mind that they eat nothing but candy all day long.&quot;<br/>\n&gt;  <br/>\n&gt; I don&#39;t at all think that about you or anyone on this board.  I see this group <br/>\n&gt; as comprised of many caring, involved, mindful individuals who are honestly <br/>\n&gt; doing the best for their children and weighing the pros of freedom and choice <br/>\n&gt; vs. the cons of the potential results of some of those choices -- and making a <br/>\n&gt; mindful decision based on that.<br/>\n&gt;  <br/>\n&gt; Like I mentioned in my other post, my ideas regarding the ideal diet for humans <br/>\n&gt; might be considered by most to be quite radical.  I wouldn&#39;t choose to supply my <br/>\n&gt; children with non-nutritive calories that could harm out of fear they&#39;d want <br/>\n&gt; them more -- any more than I&#39;d supply them with cigarettes (another item for <br/>\n&gt; human consumption) out of the fear that they would rebel and smoke more if I <br/>\n&gt; limited cigarettes.  I&#39;m not placing a bowl of cigarettes on the table and I&#39;m <br/>\n&gt; not placing a bowl of candy on the table.  <br/>\n&gt; <br/>\n&gt; Anyway, the problem I struggle with is that I fairly strongly disagree with the <br/>\n&gt; majority of people on these boards who say they don&#39;t limit foods and that their <br/>\n&gt; kids make great choices when I read the list of choices.  If I want candy or a <br/>\n&gt; cigarette or a highly processed potato chip, is that really what my body is <br/>\n&gt; saying it &quot;needs&quot;?  Really? Are these great choices?  Maybe they make some great <br/>\n&gt; choices (almost everyone does...even the deathly ill from food), but do their <br/>\n&gt; bodies really direct them to make all or mostly great choices?  And then if so, <br/>\n&gt; I just have a very different idea of what great choices are.<br/>\n&gt;   <br/>\n&gt; For our family, we are really struggling with this, because I *DO* really agree <br/>\n&gt; with the whole forbidden fruit point.  However, there will be things -- perhaps <br/>\n&gt; lots of things -- that I won&#39;t supply based on safety that could feasibly make <br/>\n&gt; them want the given item more -- cigarettes being my favorite example because it <br/>\n&gt; is known that diet choices kill more people than cigarettes, yet people who <br/>\n&gt; would never supply their children with cigarettes seem to feel comfortable <br/>\n&gt; supplying them with all sorts of food that could kill them -- and for most <br/>\n&gt; Americans if you look up diet-related heart disease and cancer stats -- probably <br/>\n&gt; will.   <br/>\n&gt;  <br/>\n&gt; &quot;I also think it is great for you and your family that you care so much and are <br/>\n&gt; really thinking about the choices you make.&quot;<br/>\n&gt;  <br/>\n&gt; Thanks and ditto!  :) <br/>\n&gt; <br/>\n&gt; &quot;Now can I show my brothers your statement about smoking &quot;Many people quit <br/>\n&gt; smoking after learning about lung and other smoking-associated cancers&quot;. We <br/>\n&gt; have had several people in our family die of lung cancer at a young age and <br/>\n&gt; they continue to smoke.&quot;<br/>\n&gt;  <br/>\n&gt; Absolutely.  I just meant that many quit after receiving solid information about <br/>\n&gt; smoking, rather than due to their body&#39;s signals telling them it was good for <br/>\n&gt; them to stop specifically (although many also quit because they become <br/>\n&gt; miserable, get cancer or emphysema, etc. - which are body signals, though <br/>\n&gt; perhaps too late).  Yes, many people also continue to start in the face of all <br/>\n&gt; this information.  Why is that the case?  Is it because their bodies told them <br/>\n&gt; to smoke?<br/>\n&gt;  <br/>\n&gt; I&#39;m not trying to be annoying.  I just see huge holes in the idea that our <br/>\n&gt; bodies, if totally unlimited, will tell us what is right.  Maybe in a vacuum <br/>\n&gt; that might be true, but so many other influences come into play.<br/>\n&gt; <br/>\n&gt; Does anyone out there keep a bowl of cigarettes on the table?  If not, why not?  <br/>\n&gt; Could the same line of reasoning apply to food choices (e.g. after years of <br/>\n&gt; exposure, the food choice could lead to heart disease and cancer)?<br/>\n&gt;  <br/>\n&gt; Thanks again!  I am really appreciative of your thoughtful responses!<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":187549037,"authorName":"Christe Bruderlin","from":"Christe Bruderlin &lt;techwritercsbn@...&gt;","profile":"techwritercsbn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Digest Number 1053","postDate":"1152739007","msgId":15682,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNzEyMjExNjQ3LjMwNDg0LnFtYWlsQHdlYjMyNjA0Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDExNTI3MTUwMjYuNDU2LjU0NzY5Lm0yMEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":15696,"prevInTime":15681,"nextInTime":15683,"topicId":15682,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/11/2006 11:53:18 P.M. Eastern Standard Time, Genant2@aol.com unschoolingbasics@ yahoogroups. com writes: Are my personal food choices and","messageBody":"<div id=\"ygrps-yiv-578645229\">In a message dated 7/11/2006 11:53:18 P.M. Eastern Standard Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Genant2@...\">Genant2@...</a><br/>\nunschoolingbasics@ yahoogroups. com writes:<br/>\n<br/>\n&quot;Are my personal food choices and those I make with my family based on fear <br/>\nor fact?&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nFor me, I can say both.&quot;<br/>\n <br/>\nI think this is probably true for most of the choices most individuals make (not necessarily OMG FEAR!, but wanting to avoid the alternate option).  <br/>\n <br/>\n&quot;&gt;&gt;&gt;It is unfortunate that the American diet has moved in so many directions <br/>\nthat what is best for human consumption is unclear to most people in our <br/>\ncountry. &lt;&lt;&lt;&lt;<br/>\n<br/>\n&quot;I am not sure that is fact. I would bet, now I don&#39;t know for sure but just <br/>\nthinking about my own community of friends, that most people know what the <br/>\nbody needs and how to best feed their body. I know I do, doesn&#39;t mean I eat <br/>\nthat way though.&quot;<br/>\n <br/>\nYou might and that might be that most people do know and just choose to ignore for whatever reasons they have.  Perhaps everyone does do the research, I&#39;m not sure.  However, *most* people I talk to have felt confused by the conflicting nutrition information out there and few people take the time to read the actual scientific literature. <br/>\n <br/>\nFor example, I hear statements all the time that just aren&#39;t true, and I see many people take them as true.  Consider the currently-popular protein.  What has more protein per calorie (not per oz or lb, because although the USDA views food that way, our bodies look at nutrients - macro or micro - per calorie) -- Broccoli or beef?  Or for another one, what has more calcium per calorie -- Kale or milk?  These are just fun examples if it is something you would enjoy looking up, but really, the answers shock many people.  <br/>\n<br/>\n&quot;So you believe it is a fact(?) that if you don&#39;t limit their food choices they can&#39;t do it for themselves?&quot;<br/>\n <br/>\nI didn&#39;t say that, however, I cannot say I&#39;m sure either way on this one when speaking for people (e.g. young children) without full information.  I do think it is a fact that our tastebuds and emotional state, etc. can easily overrule our body&#39;s proper hunger signals and drive for nutrients -- leading to the consumption of non-nutritive food.  I also believe that without full knowledge (which my children do not have yet), individuals cannot make the safest, healthiest choices because they just do not know.  Though I am working to continually provide information, they cannot read the data, do the research, etc., and the introduction of many non-food foods into the human diet, I truly believe, can throw off the body&#39;s natural signals.  <br/>\n <br/>\n&quot;That is not our reality.&quot;<br/>\n <br/>\nI am truly glad that you are happy with your family&#39;s diet.  I am *really* trying to avoid going into the specifics of what anyone eats (perhaps a meta-discussion) and I don&#39;t want to comment on what your family eats specifically, because I think that is beside the point of this discussion and it really isn&#39;t my place to say what is right for any other family.    <br/>\n <br/>\n&quot;People here know that I don&#39;t restrict my children and have this image in their mind that they eat nothing but candy all day long.&quot;<br/>\n <br/>\nI don&#39;t at all think that about you or anyone on this board.  I see this group as comprised of many caring, involved, mindful individuals who are honestly doing the best for their children and weighing the pros of freedom and choice vs. the cons of the potential results of some of those choices -- and making a mindful decision based on that.<br/>\n <br/>\nLike I mentioned in my other post, my ideas regarding the ideal diet for humans might be considered by most to be quite radical.  I wouldn&#39;t choose to supply my children with non-nutritive calories that could harm out of fear they&#39;d want them more -- any more than I&#39;d supply them with cigarettes (another item for human consumption) out of the fear that they would rebel and smoke more if I limited cigarettes.  I&#39;m not placing a bowl of cigarettes on the table and I&#39;m not placing a bowl of candy on the table.  <br/>\n<br/>\nAnyway, the problem I struggle with is that I fairly strongly disagree with the majority of people on these boards who say they don&#39;t limit foods and that their kids make great choices when I read the list of choices.  If I want candy or a cigarette or a highly processed potato chip, is that really what my body is saying it &quot;needs&quot;?  Really? Are these great choices?  Maybe they make some great choices (almost everyone does...even the deathly ill from food), but do their bodies really direct them to make all or mostly great choices?  And then if so, I just have a very different idea of what great choices are.<br/>\n  <br/>\nFor our family, we are really struggling with this, because I *DO* really agree with the whole forbidden fruit point.  However, there will be things -- perhaps lots of things -- that I won&#39;t supply based on safety that could feasibly make them want the given item more -- cigarettes being my favorite example because it is known that diet choices kill more people than cigarettes, yet people who would never supply their children with cigarettes seem to feel comfortable supplying them with all sorts of food that could kill them -- and for most Americans if you look up diet-related heart disease and cancer stats -- probably will.   <br/>\n <br/>\n&quot;I also think it is great for you and your family that you care so much and are really thinking about the choices you make.&quot;<br/>\n <br/>\nThanks and ditto!  :) <br/>\n<br/>\n&quot;Now can I show my brothers your statement about smoking &quot;Many people quit <br/>\nsmoking after learning about lung and other smoking-associated cancers&quot;. We <br/>\nhave had several people in our family die of lung cancer at a young age and <br/>\nthey continue to smoke.&quot;<br/>\n <br/>\nAbsolutely.  I just meant that many quit after receiving solid information about smoking, rather than due to their body&#39;s signals telling them it was good for them to stop specifically (although many also quit because they become miserable, get cancer or emphysema, etc. - which are body signals, though perhaps too late).  Yes, many people also continue to start in the face of all this information.  Why is that the case?  Is it because their bodies told them to smoke?<br/>\n <br/>\nI&#39;m not trying to be annoying.  I just see huge holes in the idea that our bodies, if totally unlimited, will tell us what is right.  Maybe in a vacuum that might be true, but so many other influences come into play.<br/>\n<br/>\nDoes anyone out there keep a bowl of cigarettes on the table?  If not, why not?  Could the same line of reasoning apply to food choices (e.g. after years of exposure, the food choice could lead to heart disease and cancer)?<br/>\n <br/>\nThanks again!  I am really appreciative of your thoughtful responses!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":15757,"nextTopicId":15547}}