{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":236481874,"authorName":"cindybablitz","from":"&quot;cindybablitz&quot; &lt;cindybablitz@...&gt;","profile":"cindybablitz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Postponing Alphabet Soup","postDate":"1239140476","msgId":39352,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyZ2g5cytpdHE0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":39351,"nextInTime":39353,"topicId":39352,"numMessagesInTopic":0,"msgSnippet":"After much consideration, painful and heartfelt, I have realized I need to postpone Alphabet Soup: the 2009 Calgary Unschooling Conference. When I created the","messageBody":"<div id=\"ygrps-yiv-1426344281\">After much consideration, painful and heartfelt, I have realized I need to postpone Alphabet Soup: the 2009 Calgary Unschooling Conference.<br/>\n<br/>\nWhen I created the idea of hosting an unschooling conference in Calgary, I was experiencing the most empowered season of my life. I felt strong and confident and happy. I was grateful to be in joyful service to a community I dearly love, in support of a mindset, lifestyle and cause I highly value.<br/>\n<br/>\nSince that time, the wheels have fallen off my wagon. I find myself grieving the loss of my 18 year marriage. I regret that I am not doing so in very graceful a manner. I spend most of my days just trying to breathe through them, and I am crying a lot.<br/>\n<br/>\nEven as my house of cards began tumbling down, I thought the conference, and writing my book about unschooling, would be healthy diversions away from my grief on which to focus. It turns out I am not experiencing the positive benefit of healthy diversions, rather, additional pressure I can sorely bear. Nothing about my commitment to hosting the Calgary Unschooling Conference, or to writing my book,<br/>\nhas changed, except the timing.<br/>\n<br/>\nI still firmly believe in the value of unschooling. I strongly affirm<br/>\nunschooling as productive in nurturing thriving children who love learning, love life and love themselves and their world. I see evidence every day of that unschooling works and I remain absolutely commited to continuing this path with my own children. Likewise, I remain commited to being in service and support of anyone who wishes to learn and mentor with me about unschooling.<br/>\n<br/>\nA wise and beautiful unschooling mother and dear friend of mine has reminded me, for now, I need to put on my own oxygen mask first. I need to focus on my three sons, and on me. We need to connect deeply with all the unobstructed time I can muster for us as we heal through this painful event together. I need to reconstruct my deconstructed home, and life. And I need to do this without the weight of (self-imposed or otherwise) obligation leaning on me.<br/>\n<br/>\nTo those of you who have already offered your support toward the conference, please trust that when it is time to stir up the Alphabet Soup, we shall all once again know the joy of potluck. For now, it is essential that I tend to other aspects of my hearth, heart and home.<br/>\n<br/>\nStill loving,<br/>\n<br/>\nCindy<br/>\n<br/>\nHost of Alphabet Soup: the Calgary Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.alphabetsoupconference.com\">http://www.alphabetsoupconference.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlphabetSoupConference\">http://groups.yahoo.com/group/AlphabetSoupConference</a></div>","specialLinks":[]}],"prevTopicId":39259,"nextTopicId":39311}}