{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":24,"messages":[{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] how do you determine it&#39;s not working?","postDate":"1345154551","msgId":48934,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZDOTlFREJBLUZFNDYtNEE2OS05MjA1LTY5RTBBNUZGNjMzN0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEzNDUwNzkzODguMjU1MTIuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjIyMDMubWFpbC5iZjEueWFob28uY29tPg==","referencesHeader":"PDEzNDUwNzkzODguMjU1MTIuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjIyMDMubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":48927,"nextInTopic":48935,"prevInTime":48933,"nextInTime":48935,"topicId":48903,"numMessagesInTopic":0,"msgSnippet":"Here s something from Scott Noelle s Daily Groove. Anyone here who doesn t subscribe, they re great *short* practical bits of wisdom that arrive in your mail","messageBody":"<div id=\"ygrps-yiv-2101010803\">Here&#39;s something from Scott Noelle&#39;s Daily Groove. Anyone here who doesn&#39;t subscribe, they&#39;re great *short* practical bits of wisdom that arrive in your mail box every week day. :-)<br/>\n<br/>\n<br/>\n=============<br/>\nTHE DAILY GROOVE ~ by Scott Noelle<br/>\nwww.enjoyparenting.com/dailygroove<br/>\n <br/>\n<br/>\n:: Worry Less, Love More ::<br/>\n<br/>\nPerhaps you&#39;ve been led to believe that worrying<br/>\nabout children goes hand in hand with loving them.<br/>\nBut in truth, parental love is far more powerful<br/>\n*without* worry than with it.<br/>\n<br/>\nWorries focus all your attention on what you *don&#39;t*<br/>\nwant and put you in a state of *fear*. This sends a<br/>\nmessage to your child that you *expect* bad things<br/>\nto happen. And since children naturally tend to meet<br/>\ntheir parents&#39; unspoken expectations, worries are<br/>\nself-fulfilling prophesies.<br/>\n<br/>\nToday, if you catch yourself worrying, don&#39;t worry<br/>\nabout it. :-)<br/>\n<br/>\nInstead, use your awareness of worry to shift your<br/>\nfocus in the direction of what you *do* want, and<br/>\nreach for thoughts that soothe your worries:<br/>\n<br/>\n    &quot;It&#39;s not the end of the world.&quot;<br/>\n    &quot;It won&#39;t last forever.&quot;<br/>\n    &quot;I&#39;ve successfully handled worse situations.&quot;<br/>\n    &quot;We always find our way.&quot;<br/>\n    ...etc.<br/>\n<br/>\nBefore long you&#39;ll start feeling hopeful, and you&#39;ll<br/>\nfeel your heart opening, too. An open heart is all<br/>\nyou need for love to flow unconditionally...<br/>\nunhindered by worries.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://dailygroove.net/worry-less-love-more\">http://dailygroove.net/worry-less-love-more</a><br/>\n===============<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":359124299,"authorName":"Randi Lee","from":"Randi Lee &lt;randily41@...&gt;","profile":"randily41","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: how do you determine it&#39;s not working?","postDate":"1345151813","msgId":48935,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDUxNTE4MTMuODkxNDUuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjIyMDEubWFpbC5iZjEueWFob28uY29tPg==","inReplyToHeader":"PGswaHRodis0MGczQGVHcm91cHMuY29tPg=="},"prevInTopic":48934,"nextInTopic":0,"prevInTime":48934,"nextInTime":48936,"topicId":48903,"numMessagesInTopic":0,"msgSnippet":"linda, her and her sister 8yrs. old always enjoyed school very much until things got worse in school which was 2yrs ago. i make the decision to moved when i","messageBody":"<div id=\"ygrps-yiv-353577476\">linda,<br/>\n<br/>\n<br/>\n<br/>\nher and her sister 8yrs. old always enjoyed school very much until things got<br/>\nworse in school which was 2yrs ago. i make the decision to moved when i started<br/>\nto see her loosing the spark and shrinking each and everyday right before my<br/>\neyes. but at that time my thinking was just moving to next town or so....then i<br/>\nstarted to see her intimated to go to school, started to ask to stay home,<br/>\nasking me to don&#39;t stand up for her because it only make her teacher treat her<br/>\nworse...i lost it and afraid for all my children to be in PS. and somehow<br/>\nhomeschooling got into my head. we don&#39;t know any homeschooler or even a person<br/>\nin our circle that spoke the word of homeschool but yet it got in my head. it<br/>\nsounds dramatic but i took it seriously as a sign and proceed with my decision<br/>\nto homeschool my 3girls. AND i feel that we&#39;re lucky enough to able to move<br/>\nwhere it will be easier to homeschool which is (unfortunately) to another<br/>\nstate.<br/>\n<br/>\n<br/>\n<br/>\nshe missed going school deleting the two bad years out of the picture. of course<br/>\nmissing friends is a given...we often do encourage to keep in touch with her<br/>\nfriends by mail, texting, phone and email. BUT it&#39;s either they&#39;re too young to<br/>\nkeep the communication steady or what?...started once a month to once in few<br/>\nmonths to zero. we (the whole family) went back for two weeks, she was sad to<br/>\nbe back and see her friends. yes another given - she&#39;s seeing herself no longer<br/>\nbelong there. yup! belonging is what she&#39;s missing, i think. also she has<br/>\nexpressed to me that by her moving and doing homeschool make her feel as she&#39;s<br/>\ndifferent from her friends as in negative way. this issue got cleared up over 8<br/>\nmonths time of having conversation with her, borrowing books for her to read to<br/>\nhave better understanding and watching some movies.(this is why i&#39;m hesitant<br/>\nabout her going for visit in december). anyway, we also manage to joined a<br/>\nlocal support group. unfortunately most kids are younger than her. but when<br/>\nfinally few of her age showed up it still took her few meetings to interact<br/>\nwith them. she&#39;s still not embracing homeschool as in making friends with<br/>\nhomeschoolers or interest in participate in co-op. i do have an urge to force<br/>\nupon her whenever she expressed to me she&#39;s bore as of have no friends. but i&#39;m<br/>\nmore than aware that forcing will only make it worse! all these PLUS being<br/>\ntween, have me on my toes.<br/>\n<br/>\n<br/>\n<br/>\ngood thing is we as of whole family enjoy hanging out with each other whether<br/>\nwe watch tv, biking, eating, cooking.....during those years they were in PS.<br/>\nthe differences between then and now is like everyone knows it&#39;s 24/7 now. so i<br/>\ndid expected for siblings friction more so but when i actually dealing with it,<br/>\ni&#39;m more fustrated than i expected myself to be.<br/>\n<br/>\nas for my husband, his way of supporting is doing his best on not questioning<br/>\nme, he do the cooking and occasional cleaning as we agree upon when we were<br/>\nplanning to move and homeschool. he&#39;s semi retiree - yes. can&#39;t ask for more<br/>\nfrom a man, i know. also i admit, i got all 3 of my girls doing chores since<br/>\nthey were toddlers, so my house being in order is part of our daily life. in<br/>\nthis new adventure approach, they are even more willing, i must say. so all<br/>\nthese makes less of the struggle for me adopt deschool/unschool. i&#39;m thankful<br/>\nand feel lucky.<br/>\n<br/>\n<br/>\n<br/>\nabout my daughter and unschooling work or not are not a separate issue to me<br/>\nbecause when i see her crying as she talk about missing the place, and friends,<br/>\ni felt as i&#39;m doing more harm to her than when her former teacher intimidated<br/>\nher, mistreated her to the point she doesn&#39;t feel safe in school. based on this<br/>\nfeeling i&#39;m starting to ask myself - is it a mistake? which lead to the<br/>\nquestion -  how do you determine it&#39;s not working...when i look up, i<br/>\ncouldn&#39;t find any info...which got me here...<br/>\n<br/>\n<br/>\n<br/>\nthe funny thing is, today i got the message from scott noelle (joyce<br/>\nrecommandation for parenting) regarding &quot;worry&quot; get in the way of<br/>\nparenting. isn&#39;t it weird and scary? yes. i will take it as a sign - lol!<br/>\n<br/>\n<br/>\n<br/>\ni&#39;m still interesting in any more answers to my question although like i said i<br/>\ngot plenty good analysis to work with for awhile, thanks to you and all others.<br/>\nbeyond words for your TLC. greatful for all of you (((hugs))) by reading and<br/>\nresponding to my situation. =))))<br/>\n<br/>\n<br/>\n<br/>\nfor those regarding to gymnastic - i&#39;m no expert but there is side effect to<br/>\neverything we do, just little or alot depending???? and definitely individual<br/>\npreference, so yes. her reason can be other or more than concerning of her<br/>\nheight. but i do appreciate you giving me a heads-up. after gaining the<br/>\nknowledge(from reading here and elsewhere) and seeing my girls exploring about<br/>\nthemselves likes and dislikes, i embrace her decision regardless of her reason.<br/>\nthe bottom line is if you love it even you will break your bones, you will<br/>\nstill go for it. and when you don&#39;t, nothing can keep you to continue.<br/>\n<br/>\ni&#39;m adopting, even though slow progress. it&#39;s day and night comparing me now<br/>\nand then..=p. yes i&#39;m giving myself a pat.<br/>\n<br/>\nit&#39;s hard and alot of work than school at home or in PS BUT me and my husband<br/>\nlike what we see so far in our girls even just a tiny bit result. yes. i did<br/>\nskip all the ugliness in between that took place, =B. and yes this is not the<br/>\nlast of me coming here....<br/>\n<br/>\n<br/>\n<br/>\nsorry it&#39;s sooooooooooo long.<br/>\n<br/>\nthanks again everyone!<br/>\n<br/>\nbe well until next time(hopefully not too soon)<br/>\n<br/>\n<br/>\n<br/>\nrandi </div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: how do you determine it&#39;s not working?","postDate":"1345091967","msgId":48926,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGswaHRodis0MGczQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNDUwNzYzNzkuNTI5NDYuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjIyMDQubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":48924,"nextInTopic":48927,"prevInTime":48925,"nextInTime":48927,"topicId":48903,"numMessagesInTopic":0,"msgSnippet":"Randi, Before you moved away, if you had asked your daughter what she would choose to do with her time, if she could choose anything she wanted, would she have","messageBody":"<div id=\"ygrps-yiv-881977191\">Randi,<br/>\n<br/>\nBefore you moved away, if you had asked your daughter what she would choose to do with her time, if she could choose anything she wanted, would she have said, &quot;I want to go to school&quot;?<br/>\n<br/>\nYou have said that she misses her friends - which is to be expected. But does she really miss her old school, or just being with her friends? If she misses her friends, can she connect with them regularly on Facebook or Skype, or by phone? (And why should she NOT visit them if she has the chance?)<br/>\n<br/>\nMy daughter&#39;s best friend moved away - all the way across the country - 6 years ago, when the two girls were 13. They have kept in touch by phone, Skype, and Facebook all these years, and my dd has gone to California to visit her twice, and her friend has come here once.<br/>\n<br/>\nIt took my daughter about a year to find a new &quot;best friend&quot; here. So now she has two best friends, one in California, and one who lives nearby. But she was very lonely for a while, after her first friend moved away. She doesn&#39;t make friends easily. She participated in activities and occasional classes with other homeschooled kids, and she had the opportunity to meet lots of other kids. She just didn&#39;t really &quot;click&quot; with any of them for a long time. (When she was about 15, she started feeling more comfortable with groups, and the kids she socialized with from the homeschool group all became Facebook friends, and she has had more of a social network since then.)   <br/>\n<br/>\nThe unschooling question - about whether it&#39;s &quot;working&quot; or not - is separate from the issue of how your daughter can keep in touch with her old friends.<br/>\n<br/>\nIf moving back to the place you used to live is not an option, and she has to figure her life out where she is living now, unschooling is about you encouraging her to decide how she would like to spend her time, and you facilitating her interests in whatever ways you can. And it&#39;s about you being there to listen when she wants to talk, and being generally supportive of her current choices, even if they change frequently. If she tries something, and then decides it&#39;s not for her, then the &quot;something&quot; that she tried may not have &quot;worked&quot; for her, but that doesn&#39;t mean that *unschooling* isn&#39;t working. It just means that she is still exploring and trying to find a new passion or interest. Unschooling is about giving her the freedom to make her own choices, to be herself, and you trusting and helping her to explore and figure out what&#39;s right for her. (When I say &quot;helping&quot;, I mean helping her to the extent that she wants your help. Listening to her and accepting her as she is is a very good way to start in that process.)<br/>\n<br/>\nRelaxing, &quot;deschooling&quot;, and spending a lot of time watching TV or online, can be fine too, especially if she gets something that&#39;s personally meaningful to her from the TV shows or the internet time, OR if she needs the time to think, and figure out not only what she might want to do with her time, but how to open up to you about how she&#39;s feeling. Teens don&#39;t always know how to express everything they&#39;re feeling and thinking. <br/>\n<br/>\nLet her know that you love her, that you care, and that you&#39;re there for her, when she wants to talk. But if she needs her own space, give her that space. You can&#39;t &quot;fix&quot; her, but you can honor her own process of adjusting, figuring her life out, and becoming herself. <br/>\n<br/>\nThen there&#39;s the aspect of togetherness that others mentioned. Watching TV together has been a big part of my family&#39;s life. There are certain shows we all love. As my kids got older, we started enjoying watching lots of YouTube videos together, too. (YouTube didn&#39;t exist when they were younger. LOL!) There were quite a few activities we enjoyed out of the house together, too. Attending plays and concerts. Swimming. Hanging out at the park with our homeschool group. Volunteering.<br/>\nAre there any TV shows or types/genres of videos that you and your daughter (and the other kids) all enjoy? Are there other activities that you all enjoy doing together? <br/>\n<br/>\nUnschooling &quot;works&quot; when you trust your children to make their own choices, and let them know that you&#39;re there to help them do what they want to do, and to do those things *with* them, if they want you to.<br/>\n<br/>\nUnschooling &quot;works&quot; for the parents when the parents also have interests, activities, hobbies, etc, that they enjoy. What do you like to do for fun and/or relaxation?<br/>\n<br/>\nLinda<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Randi Lee &lt;randily41@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; it&#39;s either i&#39;m so fogged up or you just understand what i&#39;m not seeing....<br/>\n&gt; <br/>\n&gt; yes. i felt a need to fixed her. wants her to moved on so she will be happier sooner - isn&#39;t it what a mother wants for her child? BUT you are right, she needs to experience it and figure out when and how. well obviously i&#39;m not at the level where i have enough courage to believe that she has the ability to that for herself....hopefully from now to december, i learn enough to gain that courage to let her go back for visit in more supported way.<br/>\n&gt; <br/>\n&gt; yes i have read 5love language book and you guessed i didn&#39;t quite figure out for everyone in my family. maybe this time i will get it, =)<br/>\n&gt; <br/>\n&gt; from your op reply - no. i didn&#39;t see unschooling like &quot;a tool&quot;, more like &quot;the way&quot; to do thing. but come to think about it, &quot;the way&quot; is like &quot;a tool&quot;. ok...u got me seeing it differently. so i will rephrase my question.( bare with me, it might not make sense - lol) how do you know, you are using the wrong tool doing the job? it sounds like i&#39;m asking how do you know they&#39;re learning BUT i&#39;m not asking that. AND i&#39;m not doubting unschooling either. it&#39;s more like i believe in it too much that i might not see that&#39;s not what works for her. am i making sense? ( i do apologize, if i sounds crazy) =p<br/>\n&gt; <br/>\n&gt; the link you posted is not about grieving, please resend.<br/>\n&gt; <br/>\n&gt; i will read suggested material again after i take a deep breath. maybe i&#39;m overloaded too - lol!<br/>\n&gt; <br/>\n&gt; really appreciate your TLC, thank you!<br/>\n&gt; <br/>\n&gt; randi </span></blockquote></div>","specialLinks":[]},{"userId":467828622,"authorName":"kim davis","from":"kim davis &lt;k.sd40@...&gt;","profile":"kimmcmillan65","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: how do you determine it&#39;s not working?","postDate":"1345085602","msgId":48924,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENPTDQwMS1FQVMyMDE0RjE3OEQyODM5MzNGRjU2RUMwRTk5QjUwQHBoeC5nYmw+","inReplyToHeader":"PDEzNDQ5OTYxMjMuNTE5MjYuWWFob29NYWlsTmVvQHdlYjgxNTAxLm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDhDRjQ4NUQ3MDU3Q0ZFQy0xMzlDLTM0QTMyQHdlYm1haWwtbTAzMi5zeXNvcHMuYW9sLmNvbT4gPGswZTV1NStxYW4wQGVHcm91cHMuY29tPiA8MTM0NDk5NjEyMy41MTkyNi5ZYWhvb01haWxOZW9Ad2ViODE1MDEubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":48923,"nextInTopic":48926,"prevInTime":48923,"nextInTime":48925,"topicId":48903,"numMessagesInTopic":0,"msgSnippet":"Just wanted to also add to the growth discussion. Although not set in stone or the same for everyone obviously, girls usually grow only an inch or two after","messageBody":"<div id=\"ygrps-yiv-1915867669\">Just wanted to also add to the growth discussion. Although not set in stone or the same for everyone obviously, girls usually grow only an inch or two after they start their menses. At 11, I would imagine that is getting close for her. So more than likely unless she hasn&#39;t had her last prepubertal growth spurt, she&#39;s already close to what her adult height will be. I would guess there are other reasons she doesn&#39;t want to do gymnastics anymore.\r<br/>\n\r<br/>\nSent from my iPhone\r<br/>\n\r<br/>\n<blockquote><span title=\"qreply\"> On Aug 14, 2012, at 7:02 PM, &quot;BRIAN POLIKOWSKY&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:polykowholsteins@...\">polykowholsteins@...</a>&gt; wrote:\r<br/>\n\r<br/>\n&gt; \r<br/>\n&gt; \r<br/>\n&gt;   \r<br/>\n&gt; Certain types of physical activity, gymanstics, some martial arts, weight lifting... I believe Do slow and reduce growth in height.\r<br/>\n&gt; \r<br/>\n&gt; There may be some studies on this, or simply anecdotal, &#39;(un)common knowledge&#39; but I do believe this is true.\r<br/>\n&gt; \r<br/>\n&gt; I&#39;m also aware of exercises to &#39;lengthen&#39;!\r<br/>\n&gt; \r<br/>\n&gt; Consistent focused physical activity during childhood powerfully influences body shape into adulthood. My body still carries a similar form to the athletes that still practice the sport I used to.\r<br/>\n&gt; \r<br/>\n&gt; ---=-=-=-=-=-=-=-=-=\r<br/>\n&gt; \r<br/>\n&gt; Here is just one , and there are many , articles about Gymnastics and growth:\r<br/>\n&gt; \r<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.shortsupport.org/News/0022.html\">http://www.shortsupport.org/News/0022.html</a> \r<br/>\n&gt; \r<br/>\n&gt; Alex Polikowsky\r<br/>\n&gt; \r<br/>\n&gt; [Non-text portions of this message have been removed]\r<br/>\n&gt; \r<br/>\n&gt; \r<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":359124299,"authorName":"Randi Lee","from":"Randi Lee &lt;randily41@...&gt;","profile":"randily41","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: how do you determine it&#39;s not working?","postDate":"1345080846","msgId":48927,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDUwODA4NDYuNDM3MTUuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjIyMDIubWFpbC5iZjEueWFob28uY29tPg==","inReplyToHeader":"PGswaGMzcSszN29kQGVHcm91cHMuY29tPg=="},"prevInTopic":48926,"nextInTopic":48934,"prevInTime":48926,"nextInTime":48928,"topicId":48903,"numMessagesInTopic":0,"msgSnippet":"like i replied to joyce. it can very much be the guilt of doing most of the choosing to moved and homeschool/unschool got me twisting myself. not sure whether","messageBody":"<div id=\"ygrps-yiv-1654230758\">like i replied to joyce. it can very much be the guilt of doing most of the choosing to moved and homeschool/unschool got me twisting myself. not sure whether it&#39;s unnecessary or not. my worry and triple checking consider normal for someone in my shoes, no?<br/>\n<br/>\nbut all in all meredith, thank you for getting me see it from another angle. i&#39;m aware of myself feeling cornered and in a fog - lol. i been thinking to post this question for awhile and each time i said to myself...wait let&#39;s check here and there on the web. but i finally give up looking for the answer and post here to get one. i got plenty enough for time being, =)))<br/>\n<br/>\nrandi<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Wed, 8/15/12, Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt;<br/>\nSubject: [unschoolingbasics] Re: how do you determine it&#39;s not working?<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Wednesday, August 15, 2012, 7:41 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n       Randi Lee &lt;randily41@...&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n<br/>\n&gt; ok i get what you saying BUT i think i&#39;m worried about miss reading the kids...<br/>\n<br/>\n*****************<br/>\n<br/>\n<br/>\n<br/>\nI think you&#39;re twisting yourself into knots unnecessarily. Why did you pull your daughter out of school? Are things as bad as that? If not, then there&#39;s no need to try school again. Why did you stop doing school at home? Are things as hard as that? If not, there&#39;s no need to try school at home again. You already Have standards and measures of better and worse - better/worse than school and homeschool. <br/>\n<br/>\n<br/>\n<br/>\n&gt;&gt; when instead they&#39;re just depressed and hiding behind computer or watching tv. am i making any sense here?<br/>\n<br/>\n***********<br/>\n<br/>\n<br/>\n<br/>\nIs she seeming listless and uninspired? That wasn&#39;t how you described her - more that her interests are changing and she misses her home. Help her explore her new interests and reconnect with her old friends and places.  <br/>\n<br/>\n<br/>\n<br/>\nSometimes when kids are struggling to find something new, or need more attention, they&#39;ll default to something like reading or watching tv. If you think that might be the case, join your kid where she is - watch tv with her or sit and read next to her and see what transpires. It never hurts to spend a little more time where your kid is (unless she wants to be alone!) and it&#39;s a good way to get a sense of what&#39;s going on. Sometimes young teens will turn inward for awhile and not really want to get out and about or dive into new things - but they still need attention and care. <br/>\n<br/>\n<br/>\n<br/>\n&gt;or it works for all children but not for all parents (i read it somewhere...something like that)<br/>\n<br/>\n***************<br/>\n<br/>\n<br/>\n<br/>\nThe philosophy of unschooling derives from three key assumptions - that learning is a natural human drive, that learning is utterly dependent on the perspective of the learner, and that these things are as true for children as for adults. Parents and sometimes older, previously schooled kids, struggle with unschooling because they&#39;ve come to disbelieve one or more of those things and instead are attached to the misconception that it is possible and/or desirable to control what another person learns. For some parents, that misconception gets tied up in personal baggage such that they can&#39;t create an environment in which learning flows freely and joyfully. (And sometimes there aren&#39;t enough other resources available to create that environment.)<br/>\n<br/>\n<br/>\n<br/>\n---Meredith<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":359124299,"authorName":"Randi Lee","from":"Randi Lee &lt;randily41@...&gt;","profile":"randily41","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] how do you determine it&#39;s not working?","postDate":"1345079388","msgId":48923,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDUwNzkzODguMjU1MTIuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjIyMDMubWFpbC5iZjEueWFob28uY29tPg==","inReplyToHeader":"PEQ0QURFRkYwLUUzN0QtNDk2OC05MDBFLTk2QTY3MzhDRkEzQUB2ZXJpem9uLm5ldD4="},"prevInTopic":48922,"nextInTopic":48924,"prevInTime":48922,"nextInTime":48924,"topicId":48903,"numMessagesInTopic":0,"msgSnippet":"your reply sounds like my swimming instructor - just jump in and swim which i don t because of fear. lol! ok get back to the topic..... yes. it s fear but not","messageBody":"<div id=\"ygrps-yiv-934164389\">your reply sounds like my swimming instructor - just jump in and swim which i don&#39;t because of fear. lol! ok get back to the topic.....<br/>\n<br/>\nyes. it&#39;s fear but not because what they do look wrong to me. i have seen even though slowly what they learn from watching tv ..being on computer...just playing...so it&#39;s not i&#39;m doubting they will learn. maybe the guilt that i did most of choosing to move and homeschool/unschool now lead me to double and triple checking whether i did harm than help???? from this thought, if i see it&#39;s more harm than help them while we&#39;re deschooling then the damage is small enough to salvage quickly. just explain where i&#39;m coming from...<br/>\nneedless to say i&#39;m newbie and it&#39;s not how i been programmed so i ask my crazy question. it&#39;s like you tried to figure out how apple taste like when you never seen or eaten it before...i know in this case just go get it and try - lol! but you know what i&#39;m trying to say, well i hope =)))<br/>\n<br/>\nthanks again...i&#39;m gonna go digest what&#39;s been replied to me here.<br/>\n<br/>\nrandi  <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Wed, 8/15/12, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;<br/>\nSubject: Re: [unschoolingbasics] how do you determine it&#39;s not working?<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Wednesday, August 15, 2012, 7:40 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      <br/>\n<br/>\nOn Aug 15, 2012, at 2:21 PM, Randi Lee wrote:<br/>\n<br/>\n<br/>\n<br/>\n&gt; BUT i think i&#39;m worried about miss reading the kids doing well<br/>\n<br/>\n&gt; when instead they&#39;re just depressed and hiding behind computer or watching tv<br/>\n<br/>\n<br/>\n<br/>\nWorry less. Do more kind, supportive, loving things. Put your worry energy into that.<br/>\n<br/>\n<br/>\n<br/>\nYou&#39;re looking at your kids through worry glasses. Nothing we say can make any sense until you take them off. Everything your kids do will look wrong until you take off the worry glasses.<br/>\n<br/>\n<br/>\n<br/>\n&gt; there are alot of info on how it might look when they are doing unschooling or learning<br/>\n<br/>\n<br/>\n<br/>\nAnd very often learning looks like watching TV and playing on the computer.<br/>\n<br/>\n<br/>\n<br/>\nAnd you&#39;re not even unschooling! You&#39;re still deschooling. Which 99% of the time will look like doing the things they loved that were limited before.<br/>\n<br/>\n<br/>\n<br/>\nJoin them. Find out what they love about the shows and games. Become knowledgable enough for you to understand what they tell you well enough you can ask insightful questions.<br/>\n<br/>\n<br/>\n<br/>\nWhen they&#39;re done deschooling, add more to their lives so they have choices. If they still choose TV, add stuff about what they&#39;re exploring on TV and the computer.<br/>\n<br/>\n<br/>\n<br/>\n&gt; but have not find any example of warning sign which we as parents might over look. or it works for all children but not for all parents<br/>\n<br/>\n<br/>\n<br/>\nIf after deschooling plus a year of unschooling, if you&#39;re still worried you can&#39;t do it, then you can&#39;t. Put them back in school.<br/>\n<br/>\n<br/>\n<br/>\nI know that sounds harsh but we can&#39;t make the fears go away only you can. And the way to do that is to just jump in and do fun things as though you didn&#39;t fear. Look more into the moment than out beyond where you have no control. Make this moment better. Make a less fear based choice. Then make another. Keep doing that.<br/>\n<br/>\n<br/>\n<br/>\nIf you&#39;re analytical, read here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.psychologytoday.com/collections/201106/overcoming-fear\">http://www.psychologytoday.com/collections/201106/overcoming-fear</a><br/>\n<br/>\n<br/>\n<br/>\nBut the best tools to let go of fear are knowledge and/or jumping in and doing it.<br/>\n<br/>\n<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] how do you determine it&#39;s not working?","postDate":"1345077870","msgId":48922,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDUwNzc4NzAuODY1MS5ZYWhvb01haWxOZW9Ad2ViODc5MDIubWFpbC5pcjIueWFob28uY29tPg==","inReplyToHeader":"PEM4MjAyMjQxLTdBMUYtNEVGQi1BMTdFLUE2OTdBNTRBQjlEQUB2ZXJpem9uLm5ldD4=","referencesHeader":"PDEzNDUwNzYzNzkuNTI5NDYuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjIyMDQubWFpbC5iZjEueWFob28uY29tPiA8QzgyMDIyNDEtN0ExRi00RUZCLUExN0UtQTY5N0E1NEFCOURBQHZlcml6b24ubmV0Pg=="},"prevInTopic":48921,"nextInTopic":48923,"prevInTime":48921,"nextInTime":48923,"topicId":48903,"numMessagesInTopic":0,"msgSnippet":"It falls out for me: http://en.wikipedia.org/wiki/K%C3%BCbler-Ross_model Maybe that one will be clickable.  Schuyler ________________________________ From:","messageBody":"<div id=\"ygrps-yiv-1970012980\">It falls out for me: <a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/K%C3%BCbler-Ross_model\">http://en.wikipedia.org/wiki/K%C3%BCbler-Ross_model</a><br/>\n<br/>\nMaybe that one will be clickable. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n________________________________<br/>\n From: Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSent: Thursday, 16 August 2012, 10:40<br/>\nSubject: Re: [unschoolingbasics] how do you determine it&#39;s not working?<br/>\n <br/>\n<br/>\n  <br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Aug 15, 2012, at 8:19 PM, Randi Lee wrote:<br/>\n<br/>\n&gt; the link you posted is not about grieving, please resend.<br/>\n<br/>\nDid you click it? It works for me:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/K%c3%bcbler-Ross_model\">http://en.wikipedia.org/wiki/K%c3%bcbler-Ross_model</a><br/>\n<br/>\nKubler Ross model: The 5 Stages of Grief.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] how do you determine it&#39;s not working?","postDate":"1345077605","msgId":48921,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM4MjAyMjQxLTdBMUYtNEVGQi1BMTdFLUE2OTdBNTRBQjlEQUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEzNDUwNzYzNzkuNTI5NDYuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjIyMDQubWFpbC5iZjEueWFob28uY29tPg==","referencesHeader":"PDEzNDUwNzYzNzkuNTI5NDYuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjIyMDQubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":48920,"nextInTopic":48922,"prevInTime":48920,"nextInTime":48922,"topicId":48903,"numMessagesInTopic":0,"msgSnippet":"... Did you click it? It works for me: http://en.wikipedia.org/wiki/Kübler-Ross_model Kubler Ross model: The 5 Stages of Grief. Joyce [Non-text portions of","messageBody":"<div id=\"ygrps-yiv-1326713696\">On Aug 15, 2012, at 8:19 PM, Randi Lee wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; the link you posted is not about grieving, please resend.<br/>\n<br/>\n </span></blockquote>Did you click it? It works for me:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/K%c3%bcbler-Ross_model\">http://en.wikipedia.org/wiki/K%c3%bcbler-Ross_model</a><br/>\n<br/>\nKubler Ross model: The 5 Stages of Grief.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":359124299,"authorName":"Randi Lee","from":"Randi Lee &lt;randily41@...&gt;","profile":"randily41","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] how do you determine it&#39;s not working?","postDate":"1345076379","msgId":48920,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDUwNzYzNzkuNTI5NDYuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjIyMDQubWFpbC5iZjEueWFob28uY29tPg==","inReplyToHeader":"PEMwN0E1NUQ4LTM5NjUtNDUxNy1CNjgwLTI1NzEwNjAzMDBCN0B2ZXJpem9uLm5ldD4="},"prevInTopic":48919,"nextInTopic":48921,"prevInTime":48919,"nextInTime":48921,"topicId":48903,"numMessagesInTopic":0,"msgSnippet":"it s either i m so fogged up or you just understand what i m not seeing.... yes. i felt a need to fixed her. wants her to moved on so she will be happier","messageBody":"<div id=\"ygrps-yiv-879042042\">it&#39;s either i&#39;m so fogged up or you just understand what i&#39;m not seeing....<br/>\n<br/>\nyes. i felt a need to fixed her. wants her to moved on so she will be happier sooner - isn&#39;t it what a mother wants for her child? BUT you are right, she needs to experience it and figure out when and how. well obviously i&#39;m not at the level where i have enough courage to believe that she has the ability to that for herself....hopefully from now to december, i learn enough to gain that courage to let her go back for visit in more supported way.<br/>\n<br/>\nyes i have read 5love language book and you guessed i didn&#39;t quite figure out for everyone in my family. maybe this time i will get it, =)<br/>\n<br/>\nfrom your op reply - no. i didn&#39;t see unschooling like &quot;a tool&quot;, more like &quot;the way&quot; to do thing. but come to think about it, &quot;the way&quot; is like &quot;a tool&quot;. ok...u got me seeing it differently. so i will rephrase my question.( bare with me, it might not make sense - lol) how do you know, you are using the wrong tool doing the job? it sounds like i&#39;m asking how do you know they&#39;re learning BUT i&#39;m not asking that. AND i&#39;m not doubting unschooling either. it&#39;s more like i believe in it too much that i might not see that&#39;s not what works for her. am i making sense? ( i do apologize, if i sounds crazy) =p<br/>\n<br/>\nthe link you posted is not about grieving, please resend.<br/>\n<br/>\ni will read suggested material again after i take a deep breath. maybe i&#39;m overloaded too - lol!<br/>\n<br/>\nreally appreciate your TLC, thank you!<br/>\n<br/>\nrandi<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Wed, 8/15/12, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;<br/>\nSubject: Re: [unschoolingbasics] how do you determine it&#39;s not working?<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Wednesday, August 15, 2012, 4:13 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      <br/>\n<br/>\nOn Aug 14, 2012, at 2:58 PM, Randi Lee wrote:<br/>\n<br/>\n<br/>\n<br/>\n&gt; what i mean by help or not is i don&#39;t want her to take<br/>\n<br/>\n&gt; two steps backward in her progress of moving on, all<br/>\n<br/>\n&gt; because she went back to visit.<br/>\n<br/>\n<br/>\n<br/>\nI wouldn&#39;t second guess her unless you&#39;re absolutely certain. Let her try out her solutions. Let her explore to find out how things make *her* feel.<br/>\n<br/>\n<br/>\n<br/>\n&gt;  i understand there&#39;re<br/>\n<br/>\n&gt; people who never got over &quot;the move&quot;. but not getting<br/>\n<br/>\n&gt; over AND not moving on is what i&#39;m very concern for her.<br/>\n<br/>\n<br/>\n<br/>\nThe things people have the hardest time dealing with are the things they have no control over. She had no control over the move. Don&#39;t take away her control over going back.<br/>\n<br/>\n<br/>\n<br/>\nDon&#39;t rush her to &quot;get over it&quot;. Focus on making her right now life more comfortable. Do nice things for her.<br/>\n<br/>\n<br/>\n<br/>\nDo you know about the 5 love languages? Gary Chapman suggests they are: words of affirmation, quality time, receiving gifts, acts of service, or physical touch. <br/>\n<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Gary_Chapman_(\">http://en.wikipedia.org/wiki/Gary_Chapman_(</a>author)<br/>\n<br/>\n<br/>\n<br/>\nYou don&#39;t need to know her language so much as it&#39;s helpful to know different people have different ideas about what makes them feel loved. Try them all. The ones she (and your other kids! and your husband!) respond most to, do more of those to each :-)<br/>\n<br/>\n<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: how do you determine it&#39;s not working?","postDate":"1345074106","msgId":48919,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGswaGMzcSszN29kQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNDUwNTQ5MTQuNTA1OTcuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjIyMDYubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":48918,"nextInTopic":48920,"prevInTime":48918,"nextInTime":48920,"topicId":48903,"numMessagesInTopic":0,"msgSnippet":"... ***************** I think you re twisting yourself into knots unnecessarily. Why did you pull your daughter out of school? Are things as bad as that? If","messageBody":"<div id=\"ygrps-yiv-631208665\">Randi Lee &lt;randily41@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; ok i get what you saying BUT i think i&#39;m worried about miss reading the kids...<br/>\n </span></blockquote>*****************<br/>\n<br/>\nI think you&#39;re twisting yourself into knots unnecessarily. Why did you pull your daughter out of school? Are things as bad as that? If not, then there&#39;s no need to try school again. Why did you stop doing school at home? Are things as hard as that? If not, there&#39;s no need to try school at home again. You already Have standards and measures of better and worse - better/worse than school and homeschool. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; when instead they&#39;re just depressed and hiding behind computer or watching tv. am i making any sense here?<br/>\n </span></blockquote>***********<br/>\n<br/>\nIs she seeming listless and uninspired? That wasn&#39;t how you described her - more that her interests are changing and she misses her home. Help her explore her new interests and reconnect with her old friends and places.  <br/>\n<br/>\nSometimes when kids are struggling to find something new, or need more attention, they&#39;ll default to something like reading or watching tv. If you think that might be the case, join your kid where she is - watch tv with her or sit and read next to her and see what transpires. It never hurts to spend a little more time where your kid is (unless she wants to be alone!) and it&#39;s a good way to get a sense of what&#39;s going on. Sometimes young teens will turn inward for awhile and not really want to get out and about or dive into new things - but they still need attention and care. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;or it works for all children but not for all parents (i read it somewhere...something like that)<br/>\n </span></blockquote>***************<br/>\n<br/>\nThe philosophy of unschooling derives from three key assumptions - that learning is a natural human drive, that learning is utterly dependent on the perspective of the learner, and that these things are as true for children as for adults. Parents and sometimes older, previously schooled kids, struggle with unschooling because they&#39;ve come to disbelieve one or more of those things and instead are attached to the misconception that it is possible and/or desirable to control what another person learns. For some parents, that misconception gets tied up in personal baggage such that they can&#39;t create an environment in which learning flows freely and joyfully. (And sometimes there aren&#39;t enough other resources available to create that environment.)<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] how do you determine it&#39;s not working?","postDate":"1345074027","msgId":48918,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ0QURFRkYwLUUzN0QtNDk2OC05MDBFLTk2QTY3MzhDRkEzQUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEzNDUwNTQ5MTQuNTA1OTcuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjIyMDYubWFpbC5iZjEueWFob28uY29tPg==","referencesHeader":"PDEzNDUwNTQ5MTQuNTA1OTcuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjIyMDYubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":48917,"nextInTopic":48919,"prevInTime":48917,"nextInTime":48919,"topicId":48903,"numMessagesInTopic":0,"msgSnippet":"... Worry less. Do more kind, supportive, loving things. Put your worry energy into that. You re looking at your kids through worry glasses. Nothing we say can","messageBody":"<div id=\"ygrps-yiv-1903469970\">On Aug 15, 2012, at 2:21 PM, Randi Lee wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; BUT i think i&#39;m worried about miss reading the kids doing well<br/>\n&gt; when instead they&#39;re just depressed and hiding behind computer or watching tv<br/>\n<br/>\n </span></blockquote>Worry less. Do more kind, supportive, loving things. Put your worry energy into that.<br/>\n<br/>\nYou&#39;re looking at your kids through worry glasses. Nothing we say can make any sense until you take them off. Everything your kids do will look wrong until you take off the worry glasses.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; there are alot of info on how it might look when they are doing unschooling or learning<br/>\n<br/>\n </span></blockquote>And very often learning looks like watching TV and playing on the computer.<br/>\n<br/>\nAnd you&#39;re not even unschooling! You&#39;re still deschooling. Which 99% of the time will look like doing the things they loved that were limited before.<br/>\n<br/>\nJoin them. Find out what they love about the shows and games. Become knowledgable enough for you to understand what they tell you well enough you can ask insightful questions.<br/>\n<br/>\nWhen they&#39;re done deschooling, add more to their lives so they have choices. If they still choose TV, add stuff about what they&#39;re exploring on TV and the computer.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but have not find any example of warning sign which we as parents might over look. or it works for all children but not for all parents<br/>\n<br/>\n </span></blockquote>If after deschooling plus a year of unschooling, if you&#39;re still worried you can&#39;t do it, then you can&#39;t. Put them back in school.<br/>\n<br/>\nI know that sounds harsh but we can&#39;t make the fears go away only you can. And the way to do that is to just jump in and do fun things as though you didn&#39;t fear. Look more into the moment than out beyond where you have no control. Make this moment better. Make a less fear based choice. Then make another. Keep doing that.<br/>\n<br/>\nIf you&#39;re analytical, read here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.psychologytoday.com/collections/201106/overcoming-fear\">http://www.psychologytoday.com/collections/201106/overcoming-fear</a><br/>\n<br/>\nBut the best tools to let go of fear are knowledge and/or jumping in and doing it.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] how do you determine it&#39;s not working?","postDate":"1345061634","msgId":48916,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMwN0E1NUQ4LTM5NjUtNDUxNy1CNjgwLTI1NzEwNjAzMDBCN0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEzNDQ5NzA3MDQuMzgzOTEuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjIyMDIubWFpbC5iZjEueWFob28uY29tPg==","referencesHeader":"PDEzNDQ5NzA3MDQuMzgzOTEuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjIyMDIubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":48915,"nextInTopic":48917,"prevInTime":48915,"nextInTime":48917,"topicId":48903,"numMessagesInTopic":0,"msgSnippet":"... I wouldn t second guess her unless you re absolutely certain. Let her try out her solutions. Let her explore to find out how things make *her* feel. ... ","messageBody":"<div id=\"ygrps-yiv-280917131\">On Aug 14, 2012, at 2:58 PM, Randi Lee wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; what i mean by help or not is i don&#39;t want her to take<br/>\n&gt; two steps backward in her progress of moving on, all<br/>\n&gt; because she went back to visit.<br/>\n<br/>\n </span></blockquote>I wouldn&#39;t second guess her unless you&#39;re absolutely certain. Let her try out her solutions. Let her explore to find out how things make *her* feel.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  i understand there&#39;re<br/>\n&gt; people who never got over &quot;the move&quot;. but not getting<br/>\n&gt; over AND not moving on is what i&#39;m very concern for her.<br/>\n<br/>\n </span></blockquote>The things people have the hardest time dealing with are the things they have no control over. She had no control over the move. Don&#39;t take away her control over going back.<br/>\n<br/>\nDon&#39;t rush her to &quot;get over it&quot;. Focus on making her right now life more comfortable. Do nice things for her.<br/>\n<br/>\nDo you know about the 5 love languages? Gary Chapman suggests they are: words of affirmation, quality time, receiving gifts, acts of service, or physical touch. <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Gary_Chapman_(\">http://en.wikipedia.org/wiki/Gary_Chapman_(</a>author)<br/>\n<br/>\nYou don&#39;t need to know her language so much as it&#39;s helpful to know different people have different ideas about what makes them feel loved. Try them all. The ones she (and your other kids! and your husband!) respond most to, do more of those to each :-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] how do you determine it&#39;s not working?","postDate":"1345060560","msgId":48915,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ4RTg2N0QxLTMxNzAtNEZFRC04RDUxLUM4NzE5OURENUZGRUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGswZ21xNCtrb25lQGVHcm91cHMuY29tPg==","referencesHeader":"PGswZ21xNCtrb25lQGVHcm91cHMuY29tPg=="},"prevInTopic":48914,"nextInTopic":48916,"prevInTime":48914,"nextInTime":48916,"topicId":48903,"numMessagesInTopic":0,"msgSnippet":"... I think the question is confusing. I think the question is more easily answered in terms of what you want unschooling for. Unschooling is a tool. Does it","messageBody":"<div id=\"ygrps-yiv-1688460819\"><blockquote><span title=\"ireply\">&gt; how it looks if the unschooling is not working?<br/>\n<br/>\n </span></blockquote>I think the question is confusing. I think the question is more easily answered in terms of what you want unschooling for.<br/>\n<br/>\nUnschooling is a tool. Does it make sense to ask if a screw driver is working? The screwdriver (as a concept) never doesn&#39;t work ;-) But sometimes people don&#39;t know how to use it. Sometimes their expectations of what it can do are unreasonable.<br/>\n<br/>\nBetter is to think in terms of what you want to provide for your daughter. Like ways to explore what interest her. Support for what interests her. A comfortable nest. At first you&#39;ll be guessing. At first *she* may be guessing. Right now she&#39;s deschooling. Right now she&#39;s also grieving for what she lost. Have you read about the stages of grief:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/K%c3%bcbler-Ross_model\">http://en.wikipedia.org/wiki/K%c3%bcbler-Ross_model</a><br/>\n<br/>\nI&#39;d say yes, let her go back. It will be different. Let *her* decide when it&#39;s time to move forward rather than backward.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; and i need her to help me to help her. in this area, maybe i need to say more......<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;d be cautious about saying more. Let your actions speak.<br/>\n<br/>\nI think you&#39;re trying to fix her. She doesn&#39;t need fixed. She needs time to recover. Treat it as you would a broken leg. You wouldn&#39;t be trying to get her to heal faster if it was physical I don&#39;t think! You&#39;d be making life easier for her. Bringing her snacks. Moving obstacles out of her way to make crutches easier to navigate with. And so on.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; can you give few tips on how to be more present,<br/>\n<br/>\n<br/>\n </span></blockquote>Being more present is being there with her and the others. Spend as little time separate from those who need your awareness. Sense the dynamics of what&#39;s going on between the kids. Step in *before* it turns sour. Suggest a different activity. Or pull one aside to do something with you. It really depends on their personalities and what&#39;s going on.<br/>\n<br/>\nSandra Dodd has a page on Being with links to Being more :-)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/being/\">http://sandradodd.com/being/</a><br/>\n<br/>\nYou might try her main unschooling page:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling\">http://sandradodd.com/unschooling</a><br/>\n<br/>\n If you have a specific problem you can describe, it would probably be easier to give you some less vague answers but reading some of the links on the unschooling page might be a better place to start.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":359124299,"authorName":"Randi Lee","from":"Randi Lee &lt;randily41@...&gt;","profile":"randily41","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: how do you determine it&#39;s not working?","postDate":"1345054914","msgId":48917,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDUwNTQ5MTQuNTA1OTcuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjIyMDYubWFpbC5iZjEueWFob28uY29tPg==","inReplyToHeader":"PGswZ21xNCtrb25lQGVHcm91cHMuY29tPg=="},"prevInTopic":48916,"nextInTopic":48918,"prevInTime":48916,"nextInTime":48918,"topicId":48903,"numMessagesInTopic":0,"msgSnippet":"ok i get what you saying BUT i think i m worried about miss reading the kids doing well when instead they re just depressed and hiding behind computer or","messageBody":"<div id=\"ygrps-yiv-1862872711\">ok i get what you saying BUT i think i&#39;m worried about miss reading the kids doing well when instead they&#39;re just depressed and hiding behind computer or watching tv. am i making any sense here? there are alot of info on how it might look when they are doing unschooling or learning....etc. but have not find any example of warning sign which we as parents might over look. or it works for all children but not for all parents (i read it somewhere...something like that).<br/>\n<br/>\nthanks,<br/>\nrandi<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Wed, 8/15/12, Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt;<br/>\nSubject: [unschoolingbasics] Re: how do you determine it&#39;s not working?<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Wednesday, August 15, 2012, 1:38 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n       Randi Lee &lt;randily41@...&gt; wrote:<br/>\n<br/>\n&gt;BUT can you and all others still give example of how it is or how it looks if the unschooling is not working?<br/>\n<br/>\n******************<br/>\n<br/>\n<br/>\n<br/>\nIt&#39;s different for different kids - how do you know school or homeschool &quot;isn&#39;t working&quot;? If your family life is slipping further and further away from what you value, something&#39;s not working, so it could help to think in those terms - what are your deepest values? <br/>\n<br/>\nUnschooling won&#39;t work in an environment where measurable success is more valuable than joyful living and learning, for instance.<br/>\n<br/>\n<br/>\n<br/>\n---Meredith<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: how do you determine it&#39;s not working?","postDate":"1345052292","msgId":48914,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGswZ21xNCtrb25lQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNDQ5NzYyMzkuNzAxMDEuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjIyMDMubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":48913,"nextInTopic":48915,"prevInTime":48913,"nextInTime":48915,"topicId":48903,"numMessagesInTopic":0,"msgSnippet":"... ****************** It s different for different kids - how do you know school or homeschool isn t working ? If your family life is slipping further and","messageBody":"<div id=\"ygrps-yiv-2002215463\">Randi Lee &lt;randily41@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;BUT can you and all others still give example of how it is or how it looks if the unschooling is not working?<br/>\n </span></blockquote>******************<br/>\n<br/>\nIt&#39;s different for different kids - how do you know school or homeschool &quot;isn&#39;t working&quot;? If your family life is slipping further and further away from what you value, something&#39;s not working, so it could help to think in those terms - what are your deepest values? <br/>\nUnschooling won&#39;t work in an environment where measurable success is more valuable than joyful living and learning, for instance.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: how do you determine it&#39;s not working?","postDate":"1345051528","msgId":48913,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGswZ20yOCtnb282QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGswZTV1NStxYW4wQGVHcm91cHMuY29tPg=="},"prevInTopic":48912,"nextInTopic":48914,"prevInTime":48912,"nextInTime":48914,"topicId":48903,"numMessagesInTopic":0,"msgSnippet":"... **************** But would you have practiced that sport if your body had not already been suited to it? Correlation is not causality. If a child doesn t","messageBody":"<div id=\"ygrps-yiv-72294427\">&quot;Daria S&quot; &lt;daria_simionescu@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Consistent focused physical activity during childhood powerfully influences body shape into adulthood.  My body still carries a similar form to the athletes that still practice the sport I used to.<br/>\n </span></blockquote>****************<br/>\n<br/>\nBut would you have practiced that sport if your body had not already been suited to it? Correlation is not causality. If a child doesn&#39;t show aptitude for a sport he or she is unlikely to be encouraged to continue, and body type absolutely will play a part in that. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: how do you determine it&#39;s not working?","postDate":"1344996123","msgId":48912,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDQ5OTYxMjMuNTE5MjYuWWFob29NYWlsTmVvQHdlYjgxNTAxLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGswZTV1NStxYW4wQGVHcm91cHMuY29tPg==","referencesHeader":"PDhDRjQ4NUQ3MDU3Q0ZFQy0xMzlDLTM0QTMyQHdlYm1haWwtbTAzMi5zeXNvcHMuYW9sLmNvbT4gPGswZTV1NStxYW4wQGVHcm91cHMuY29tPg=="},"prevInTopic":48911,"nextInTopic":48913,"prevInTime":48911,"nextInTime":48913,"topicId":48903,"numMessagesInTopic":0,"msgSnippet":"  Certain types of physical activity, gymanstics, some martial arts, weight lifting... I believe Do slow and reduce growth in height. There may be some","messageBody":"<div id=\"ygrps-yiv-1253626711\">  <br/>\nCertain types of physical activity, gymanstics, some martial arts, weight lifting... I believe Do slow and reduce growth in height.<br/>\n<br/>\nThere may be some studies on this, or simply anecdotal, &#39;(un)common knowledge&#39; but I do believe this is true.<br/>\n<br/>\nI&#39;m also aware of exercises to &#39;lengthen&#39;!<br/>\n<br/>\nConsistent focused physical activity during childhood powerfully influences body shape into adulthood.  My body still carries a similar form to the athletes that still practice the sport I used to.<br/>\n<br/>\n---=-=-=-=-=-=-=-=-=<br/>\n<br/>\nHere is just one , and there are many , articles about Gymnastics and growth:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.shortsupport.org/News/0022.html%c2%a0\">http://www.shortsupport.org/News/0022.html%c2%a0</a><br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":359124299,"authorName":"Randi Lee","from":"Randi Lee &lt;randily41@...&gt;","profile":"randily41","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] how do you determine it&#39;s not working?","postDate":"1344976239","msgId":48911,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDQ5NzYyMzkuNzAxMDEuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjIyMDMubWFpbC5iZjEueWFob28uY29tPg==","inReplyToHeader":"PDQ2N0EwNThFLTM0QzktNDBDQS04NDYyLTkwNjU1NzE3M0UxM0B2ZXJpem9uLm5ldD4="},"prevInTopic":48910,"nextInTopic":48912,"prevInTime":48910,"nextInTime":48912,"topicId":48903,"numMessagesInTopic":0,"msgSnippet":"your reply make me feel glad that i gathered my courage and asked. thank you! it never occured to me that she would play up the PS and down play the","messageBody":"<div id=\"ygrps-yiv-303056514\">your reply make me feel glad that i gathered my courage and asked. thank you!<br/>\n<br/>\nit never occured to me that she would play up the PS and down play the homeschool. because she didn&#39;t reject when i suggested to move and homeschool when things were bad with PS. but what you analyzing here make sense, that counts alot for me.<br/>\nnot just going back to any school - she will only wants all of us to return back with her and she goes to the PS where her friends go....=(<br/>\n<br/>\nyes her siblings adjust to the change already because they don&#39;t have friends like she does or see friends like she does. it&#39;s very hard on the whole family. i know we adult experienced before meanwhile she&#39;s just 11 and it&#39;s her first time. =((<br/>\ni got few opportunities to look into her eyes and say to her that i know how hard it is for her and appreciate her doing her best to find her way in this new journey of ours. and tell her that i am on her side and here to support her. and i need her to help me to help her. in this area, maybe i need to say more......<br/>\ni learned how to say these and mean it from reading your post and OP so thanks again.<br/>\n<br/>\nyes.i&#39;m aware of the need to stick to the gun to deschool fully instead of flip flopping myself which no doubt it effected them. ashame to admit but i did skipped the restart button, =p.<br/>\n<br/>\nshe&#39;s less of the people pleaser as each and every year she gets older. BUT she can bottle up to not speak her mind to upset me with serious matter, until the air clear out (few months later). but ex. like with clothing, she will pout n stump if she doesn&#39;t like it or with food or with books....etc. after getting educated here and with books and blogs of unschooling, i understand and support her finding herself, likes and dislike by trying out and testing out with activities she&#39;s interested. i just check in for others point of view to see whether i&#39;m blind sighted or not because i&#39;m IN this situation. yes. i&#39;m shakey but glad to know i can check in here, beside keep on going to those books and blogs.<br/>\n<br/>\ncan you give few tips on how to be more present, have her comfortable, redirect..all that you suggested at the last part of your reply?(regarding to her attitude and name calling)<br/>\n<br/>\nit seems like my situation is not, not working. it&#39;s just beginning of deschooling or something like that.... BUT can you and all others still give example of how it is or how it looks if the unschooling is not working?<br/>\n<br/>\nappreciated, felt like my batteries been recharged, =))<br/>\nrandi</div>","specialLinks":[]},{"userId":359124299,"authorName":"Randi Lee","from":"Randi Lee &lt;randily41@...&gt;","profile":"randily41","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: how do you determine it&#39;s not working?","postDate":"1344970704","msgId":48910,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDQ5NzA3MDQuMzgzOTEuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjIyMDIubWFpbC5iZjEueWFob28uY29tPg==","inReplyToHeader":"PGswZTNuZythMG45QGVHcm91cHMuY29tPg=="},"prevInTopic":48909,"nextInTopic":48911,"prevInTime":48909,"nextInTime":48911,"topicId":48903,"numMessagesInTopic":0,"msgSnippet":"that s why i check in here, don t want to be blind-sighted. do hope it s grieving. what i mean by help or not is i don t want her to take two steps backward in","messageBody":"<div id=\"ygrps-yiv-1894024879\">that&#39;s why i check in here, don&#39;t want to be blind-sighted. do hope it&#39;s grieving.<br/>\n<br/>\nwhat i mean by help or not is i don&#39;t want her to take two steps backward in her progress of moving on, all because she went back to visit. i understand there&#39;re people who never got over &quot;the move&quot;. but not getting over AND not moving on is what i&#39;m very concern for her.<br/>\n<br/>\nthank you!</div>","specialLinks":[]},{"userId":178804705,"authorName":"Daria S","from":"&quot;Daria S&quot; &lt;daria_simionescu@...&gt;","profile":"lilreddgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: how do you determine it&#39;s not working?","postDate":"1344969477","msgId":48909,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGswZTV1NStxYW4wQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDRjQ4NUQ3MDU3Q0ZFQy0xMzlDLTM0QTMyQHdlYm1haWwtbTAzMi5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":48908,"nextInTopic":48910,"prevInTime":48908,"nextInTime":48910,"topicId":48903,"numMessagesInTopic":0,"msgSnippet":"Certain types of physical activity, gymanstics, some martial arts, weight lifting... I believe Do slow and reduce growth in height. There may be some studies","messageBody":"<div id=\"ygrps-yiv-11359284\">Certain types of physical activity, gymanstics, some martial arts, weight lifting... I believe Do slow and reduce growth in height.<br/>\n<br/>\nThere may be some studies on this, or simply anecdotal, &#39;(un)common knowledge&#39; but I do believe this is true.<br/>\n<br/>\nI&#39;m also aware of exercises to &#39;lengthen&#39;!<br/>\n<br/>\nConsistent focused physical activity during childhood powerfully influences body shape into adulthood.  My body still carries a similar form to the athletes that still practice the sport I used to.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Kelly Lovejoy &lt;kbcdlovejo@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; -----Original Message-----<br/>\n&gt; From: Randi &lt;randily41@...&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  -=-=-=-=-=-she used <br/>\n&gt; to serious about gymnastic and was in a team. just recently announced, she wants <br/>\n&gt; to quit due to the reason of gymnastic will stop her from growing(she wants to <br/>\n&gt; be aleast 6feet tall).-=-=-=-=-=-=-<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ***************************************<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Just pulling this out in particular because it&#39;s disturbing.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Gymnastics can&#39;t stop a person from growing (nor can any other sport!). Where did she get this? Growing too tall can make gymnastics difficult, but not the other way around.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Just making sure everyone knows this. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; And she may not get to be over six feet tall----but she can&#39;t blame gymnastics. That&#39;s genetics!<br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  ~Kelly<br/>\n&gt; <br/>\n&gt; Kelly Lovejoy<br/>\n&gt; &quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: how do you determine it&#39;s not working?","postDate":"1344967216","msgId":48908,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGswZTNuZythMG45QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGswZHAzays1Nms4QGVHcm91cHMuY29tPg=="},"prevInTopic":48907,"nextInTopic":48909,"prevInTime":48907,"nextInTime":48909,"topicId":48903,"numMessagesInTopic":0,"msgSnippet":"... *************** It sounds more like grief over the move, to me - all her concerns and issues seem to revolve around going back home , back to visit her","messageBody":"<div id=\"ygrps-yiv-1339937517\">&quot;Randi&quot; &lt;randily41@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; it seems to me my dd-11 is flip flopping with unschooling.or it&#39;s part of deschooling process?<br/>\n </span></blockquote>***************<br/>\n<br/>\nIt sounds more like grief over the move, to me - all her concerns and issues seem to revolve around going back &quot;home&quot;, back to visit her old friends and places. That&#39;s really normal and natural - moving is hard! And it&#39;s totally possible for her to be happy overall, enjoying her new life, and yet still be grieving over the move. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; i&#39;m not sure of letting her go will help or not. <br/>\n<br/>\n </span></blockquote>Help her do what? Are you thinking she&#39;s supposed to get over it? Some people never get over moving away from a childhood home... and if it&#39;s possible to visit and keep up with old friendships, there&#39;s no real need to do so. If she wants to go visit her old friends and places, help her do that so she can maintain the relationships and memories which are important to her. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] how do you determine it&#39;s not working?","postDate":"1344967064","msgId":48907,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRjQ4NUQ3MDU3Q0ZFQy0xMzlDLTM0QTMyQHdlYm1haWwtbTAzMi5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PGswZHAzays1Nms4QGVHcm91cHMuY29tPg==","referencesHeader":"PGswZHAzays1Nms4QGVHcm91cHMuY29tPg=="},"prevInTopic":48905,"nextInTopic":48908,"prevInTime":48906,"nextInTime":48908,"topicId":48903,"numMessagesInTopic":0,"msgSnippet":"... From: Randi  -=-=-=-=-=-she used to serious about gymnastic and was in a team. just recently announced, she wants to quit due to the","messageBody":"<div id=\"ygrps-yiv-1349013877\">-----Original Message-----<br/>\nFrom: Randi &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:randily41@...\">randily41@...</a>&gt;<br/>\n<br/>\n<br/>\n<br/>\n -=-=-=-=-=-she used <br/>\nto serious about gymnastic and was in a team. just recently announced, she wants <br/>\nto quit due to the reason of gymnastic will stop her from growing(she wants to <br/>\nbe aleast 6feet tall).-=-=-=-=-=-=-<br/>\n<br/>\n<br/>\n<br/>\n***************************************<br/>\n<br/>\n<br/>\nJust pulling this out in particular because it&#39;s disturbing.<br/>\n<br/>\n<br/>\nGymnastics can&#39;t stop a person from growing (nor can any other sport!). Where did she get this? Growing too tall can make gymnastics difficult, but not the other way around.<br/>\n<br/>\n<br/>\nJust making sure everyone knows this. <br/>\n<br/>\n<br/>\nAnd she may not get to be over six feet tall----but she can&#39;t blame gymnastics. That&#39;s genetics!<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] how do you determine it&#39;s not working?","postDate":"1344964000","msgId":48905,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2N0EwNThFLTM0QzktNDBDQS04NDYyLTkwNjU1NzE3M0UxM0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGswZHAzays1Nms4QGVHcm91cHMuY29tPg==","referencesHeader":"PGswZHAzays1Nms4QGVHcm91cHMuY29tPg=="},"prevInTopic":48903,"nextInTopic":48907,"prevInTime":48904,"nextInTime":48906,"topicId":48903,"numMessagesInTopic":0,"msgSnippet":"It sounds like you have a problem with indecisiveness. It s either because you re decisive or because you re also indecisive and it s troubling to see it in","messageBody":"<div id=\"ygrps-yiv-810097153\">It sounds like you have a problem with indecisiveness. It&#39;s either because you&#39;re decisive or because you&#39;re also indecisive and it&#39;s troubling to see it in someone else ;-)<br/>\n<br/>\n*Every* choice we make has both good parts and bad parts. It&#39;s natural for people to feel two ways about something. It&#39;s especially true when someone hasn&#39;t made a choice for themselves. Since you pulled her out, it&#39;s natural for her to pump up the good parts of school, down play the bad parts and do the reverse to unschooling. It will take time for her to work through it. It will help a lot if you let her know she can go to school if she wants.<br/>\n<br/>\nSo you moved and then started school at home for 4-5 months. That&#39;s a huge change for anyone, especially for someone who didn&#39;t have a choice in either.<br/>\n<br/>\nSo, yes, it will take her longer to deschool. Expect it to take 1 month for each year she was in school. And the summer doesn&#39;t count! She has always had the summer off so she can&#39;t deschool if she wasn&#39;t expecting to go to school. And the deschooling clock restarts if you panic and start doing school again.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; is she just requested all those to explore, to play along with my interest in unschooling her?<br/>\n<br/>\n </span></blockquote>Unless she&#39;s been a big people-pleaser in the past, I can&#39;t see why she&#39;d put herself through all that you listed if she wasn&#39;t interested.<br/>\n<br/>\nIt&#39;s possible she wants to do all those things because she feels they will fix the unsettled feeling in her. It&#39;s possible she will find out they don&#39;t. Or that some don&#39;t. Or that she only needs one. By picking then trying things out, she&#39;s learning more about herself and what the feelings she has mean and what they&#39;re asking her for. She&#39;s not going to get it right at first. She&#39;ll get better at it each choice she makes.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; is she&#39;s being tween causing the friction we often have(the attitude toward the family and calling names to her siblings)? OR is not working for us?<br/>\n<br/>\n<br/>\n </span></blockquote>It&#39;s both the upheaval in her life and being a tween. <br/>\n<br/>\nShe&#39;s feeling prickly. What she needs is someone to help her feel as comfortable as she can as she recovers.<br/>\n<br/>\nAs do your other kids. She needs to not be calling her siblings names. (The less prickly she feels, the less she&#39;ll feel like directing the prickliness at her siblings.) Be more present. Be aware of the buildup. Help her redirect, bring food, draw her away, or help her or her siblings find something else to do when she&#39;s feeling irritable.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":359124299,"authorName":"Randi","from":"&quot;Randi&quot; &lt;randily41@...&gt;","profile":"randily41","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"how do you determine it&#39;s not working?","postDate":"1344956340","msgId":48903,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGswZHAzays1Nms4QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":48905,"prevInTime":48902,"nextInTime":48904,"topicId":48903,"numMessagesInTopic":0,"msgSnippet":"hi! everyone. i have this nagging questions in my head and yet i can t find an answer anywhere....so i m here to ask you all, how do you determine unschooling","messageBody":"<div id=\"ygrps-yiv-1139790442\">hi! everyone.<br/>\n<br/>\ni have this nagging questions in my head and yet i can&#39;t find an answer anywhere....so i&#39;m here to ask you all, how do you determine unschooling is not working for the family?<br/>\n<br/>\nit seems to me my dd-11 is flip flopping with unschooling.or it&#39;s part of deschooling process?<br/>\n<br/>\na short recap of our story - i pulled her out from PS(being accused of ADD and they wanted to medicate her) and move to another state AND decided to homeschool her and her siblings. for the first 4-5months we did &quot;school&quot; and it was a struggle. all for the reason of her missing her friends and not used to being in the new place(new city/state). then we deschooling/unschooling for awhile and the tension ease up. in june, she actually said to me she enjoyed &quot;this new way of doing school&quot;. BUT wished we didn&#39;t have to moved in the first place. this comment of hers can define in few different ways. it can be she&#39;s coming along or it can also be she likes unschooling but rather go to back to PS that her friends are in. yes. not to PS where we are, it&#39;s the one where&#39;s all her friends are at.....she doesn&#39;t seems to be depressed or sad or in any negative state,even altho not into any kind of homeschool group/activity.she will goes to a week camp here and there, attended computer classes in the library, mostly borrowed alots of books from library to read, go on line to either play games or google celebrities that caught her eyes or about clothings or watch glee. yes she&#39;s into singing and acting as for now. she used to serious about gymnastic and was in a team. just recently announced, she wants to quit due to the reason of gymnastic will stop her from growing(she wants to be aleast 6feet tall). her so-so interest for orchestra also comes to a full stop. her request for &quot;this school year&quot; is explore into acting from hollywood to b&#39;way and everything in between, how and where human started, alot of sewing projects, learn spanish and french, and want to understand about electricity. does this seems like she&#39;s sad or depressed?  <br/>\n<br/>\ni&#39;m confused and worry because her behavior doesn&#39;t indicate she&#39;s sad, depress...etc. BUT yet she often wish &quot;nothing happen so she didn&#39;t need to moved and still in PS with her friends. my question is, is she just requested all those to explore, to play along with my interest in unschooling her? we just step into this journey. my on and off with deschooling IS getting better. i do see learning take place with her and her siblings(dd-9 and dd-6, even though we just started.<br/>\nso back to my questions - is her behavior part of deschool process?<br/>\nis she&#39;s being tween causing the friction we often have(the attitude toward the family and calling names to her siblings)? OR is not working for us?<br/>\n<br/>\nalso she requested to go back to where we moved from as her x&#39;mas gift for about 10days(her father still needs to go back once a month for unfinished business). i&#39;m not sure of letting her go will help or not. our family situation allow us to be able to go back to where we moved from,for a month long time - should we all go back as of &quot;a month winter break&quot;? i will do either or, if it will not further complicate her in all aspect.<br/>\n<br/>\nthank you all in advance, for i&#39;m at lost with parenting a tween and unschooling approach for our situation.<br/>\n<br/>\nrandi</div>","specialLinks":[]}],"prevTopicId":48899,"nextTopicId":48925}}