{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Critisism","postDate":"1239756468","msgId":39565,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzM2Fyays0ZW5rQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY1MThhOTM2MDkwNDE0MTYzNG4yZjM3YWQ4ZXM2MmU0N2VlNWE5NGU3Yjk4QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":39556,"nextInTopic":0,"prevInTime":39564,"nextInTime":39566,"topicId":39537,"numMessagesInTopic":0,"msgSnippet":"~~***...show me end results of grown people who did it this way.***~~ END results? Well, as Diana said, it s death. The idea of there being an end result is","messageBody":"<div id=\"ygrps-yiv-1901335927\">~~***...show me end results of grown people who did it this way.***~~<br/>\n<br/>\n<br/>\nEND results? Well, as Diana said, it&#39;s death.<br/>\n<br/>\nThe idea of there being an &quot;end result&quot; is crazy if you think about it. The idea of talking about how someone &quot;turns out&quot; is equally crazy. Death is the &quot;turn out&quot;, the &quot;end result&quot; and that&#39;s that.<br/>\n<br/>\nAm I &quot;turned out&quot; at the age of (almost) 40? Are you &quot;turned out&quot;? WHEN does this magic thing happen so we can analyze and judge whether the parenting/raising/education of the person was satisfactory? I judge my own life by the quality I&#39;m living TODAY, not what I think I may enjoy in the future. I extend that same privilege to my children.<br/>\n<br/>\nBut if you are wondering what unschooled children look like as adults...well, as diverse as their interests. You can read about Peter and Mae Kowalke <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.kowalke.info/\">http://www.kowalke.info/</a> or Laurie Chancey <a rel=\"nofollow\" target=\"_blank\" href=\"http://lauriechancey.blogspot.com/1999/08/laurie-chancey-learning-new-ways-to.html\">http://lauriechancey.blogspot.com/1999/08/laurie-chancey-learning-new-ways-to.html</a>  but several of us have grown children as well. Grown unschoolrs who are simply living their lives and don&#39;t have blogs or websites talking about their unschooling experiences.<br/>\n<br/>\nTrevor (19) is living with his unschooled girlfriend and getting ready to attend college this fall. She&#39;ll be in her third year of college and I&#39;ve mentored her as a makeup artist, which seems to be taking off as she&#39;s booking jobs and photo shoots now.<br/>\n<br/>\nSo if you&#39;re looking for evidence of grown unschoolers that are doing well and pursuing what they choose, there&#39;s plenty of that.<br/>\n<br/>\nWhat I&#39;d be looking at is evidence of schooled kids doing well!  Many of the adults I meet out there are plodding along, convinced they can&#39;t have the things they love in life, working at jobs they don&#39;t enjoy and complaining about their lives. The folks who are enjoying life to the fullest and are the most interesting (in my opinion) are those that have overcome a lot of the schooling they received and learned how to be in love with their own interests again.<br/>\n<br/>\nALL of my unschooled friends are interesting, bubbly, curious, fascinating people. Their children are fun, interesting, curious, bright, enjoyable people too. I AM surrounded by a community of talented individuals who share their interests and passions with each other. It&#39;s not only possible, it&#39;s highly probable if you decide to let it happen...in it&#39;s own time.<br/>\n<br/>\n<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"diana jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Critisism","postDate":"1239752063","msgId":39556,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDkwNDE0MTYzNG4yZjM3YWQ4ZXM2MmU0N2VlNWE5NGU3Yjk4QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDNFQTkxNjdCQzc0NjQ1NzA4MUQwRTc5NDA4QjQ3RjdCQGJpZ3N1cnByaXNlPg==","referencesHeader":"PDNFQTkxNjdCQzc0NjQ1NzA4MUQwRTc5NDA4QjQ3RjdCQGJpZ3N1cnByaXNlPg=="},"prevInTopic":39537,"nextInTopic":39565,"prevInTime":39555,"nextInTime":39557,"topicId":39537,"numMessagesInTopic":0,"msgSnippet":"... -=-This is where my Q-TIP mantra comes in handy: Quit Taking It Personally. It s not about YOU, the person, rather it s about the actions described (no one","messageBody":"<div id=\"ygrps-yiv-960293267\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; On Tue, Apr 14, 2009 at 12:32 PM, Deb Lewis &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:d.lewis@...\">d.lewis@...</a>&gt; wrote:<br/>\n&gt;<br/>\n </span></blockquote>  ***Yet, I think that these words (below) are rather intrusive on my own<br/>\n<blockquote><span title=\"ireply\"> &gt; free-will and a compassionate conversation.***<br/>\n&gt;<br/>\n&gt; ***Please keep the comments positive and supportive and helpful. I don&#39;t<br/>\n&gt; want to spend time<br/>\n&gt; defending. I&#39;d rather be learning.***<br/>\n&gt;<br/>\n&gt; No one on an email list can intrude on your free will. I&#39;m not even sure<br/>\n&gt; what that would be. You felt stung and no one here wants you to feel badly.<br/>\n&gt; Try to imagine your fellow list members as people who want to help you get<br/>\n&gt; quickly to a place of understanding. Whether you view the free offering here<br/>\n&gt; as compassionate and helpful or critical is really up to you.<br/>\n&gt;<br/>\n&gt; No list member will ever be able to control how other list members write<br/>\n&gt; and offer information. The only thing you can control is what you write and<br/>\n&gt; how you respond. You never have to respond to a post if you don&#39;t want to.<br/>\n&gt; You never have to defend yourself or your ideas to us. Take what you want<br/>\n&gt; from the list, share what you&#39;re willing to share, and follow the list<br/>\n&gt; guidelines, which ask members to refrain from meta discussion, please.<br/>\n&gt; Whatever you post to the list is up for discussion. If you don&#39;t want to<br/>\n&gt; participate in the discussion you don&#39;t have to.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>-=-This is where my Q-TIP mantra comes in handy: Quit Taking It Personally.<br/>\nIt&#39;s not about YOU, the person, rather it&#39;s about the actions described (no<br/>\none has a 24/7 cam in anyone else&#39;s home) and the shift in perspectives<br/>\nnecessary to bring one (read: anyone reading this list, present or future)<br/>\ncloser to unschooling.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; *** We don&#39;t know<br/>\n&gt;&gt; how to make sure that the dishes get done and the laundry gets done so we<br/>\n&gt;&gt; have<br/>\n&gt;&gt; underwear and still are able to be totally present for our children if we<br/>\n&gt;&gt; don&#39;t<br/>\n&gt;&gt; ever insist on anything.***<br/>\n&gt;&gt;<br/>\n&gt;&gt; Sometimes dishes don&#39;t get done. Sometimes laundry sits for another day.<br/>\n&gt;&gt; Dishes and laundry can wait. Children shouldn&#39;t have to. Children are<br/>\n&gt;&gt; growing and changing and getting older every day.<br/>\n&gt;&gt;<br/>\n&gt;&gt; You can change your routine for doing dishes and laundry. Do dishes by<br/>\n&gt;&gt; degrees- two plates now, six cups in an hour... do them at night after<br/>\n&gt;&gt; everyone is in bed, get up early and do them, get a dishwasher, trade<br/>\n&gt;&gt; something you have for dish washing services. You can ask for help without<br/>\n&gt;&gt; insisting. You can hire help. You can use paper plates. There are not just<br/>\n&gt;&gt; two choices - either you make your kids do dishes or the dishes don&#39;t get<br/>\n&gt;&gt; done. If you let yourself think things you never did before you&#39;ll be<br/>\n&gt;&gt; surprised how many possible solutions there are.<br/>\n&gt;&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>-=- It does help to think who would be doing these chores if there were no<br/>\nchildren in the equation? Did you have children with full consent? (if not,<br/>\nthis is probably not the place to discuss that situation) If yes, then they<br/>\ncan easily be seen as &quot;guests&quot; you invited into your home, to guide and<br/>\nsupport until adulthood.  I&#39;d sure hope children are not created (anymore)<br/>\nto become the maids and housekeepers for their parents (or farmworkers).<br/>\nThere will come a day, all too soon, when the only laundry and dishes in<br/>\nyour house to be done are YOURS. Will you miss giving the gift of clean<br/>\ndishes and laundry to your kids? I know I do, and I will :)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; ***I know of no one that is a musician today that blames their<br/>\n&gt; parents when they acknowledge that their parents made them do it. Only a<br/>\n&gt; lucky<br/>\n&gt; few started music so early that they simply don&#39;t remember it ever being an<br/>\n&gt; issue.***<br/>\n&gt;<br/>\n&gt; Some women who get punched by their husbands think they deserve it. Some<br/>\n&gt; kidnap victims grow sympathetic to their kidnappers. Those are really<br/>\n&gt; extreme examples but a quick way to show you that a person who is constantly<br/>\n&gt; under the authority and power of another can come to accept that authority<br/>\n&gt; as the right thing. It is a very hard thing to face, the idea that what was<br/>\n&gt; done to us as children, what we endured was for nothing, that it didn&#39;t have<br/>\n&gt; to be. If we face that then all those years are wasted years, we can never<br/>\n&gt; get them back, our parents were wrong ( and if they were wrong about that,<br/>\n&gt; what else were they wrong about?) It&#39;s a kind of self preservation to<br/>\n&gt; believe it was for our own good and there was some benefit which will<br/>\n&gt; eventually make it worthwhile. And then you have a person who believes he&#39;s<br/>\n&gt; incapable of learning on his own. That if he doesn&#39;t have a teacher, parent,<br/>\n&gt; authority making him do what he ought to he&#39;s so lazy or bad or unmotivated<br/>\n&gt; or stupid he&#39;ll never get it on his own.<br/>\n&gt;<br/>\n&gt; If our kids get to adulthood but their psychology is so altered they don&#39;t<br/>\n&gt; know their true selves I don&#39;t think we can call our parenting successful.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>-=- I had a child who died at 9.5. Would it have been worth it for me to<br/>\nforce her into music so that *one day* she wouldn&#39;t resent me? Nah! I got to<br/>\nsit at her bedside and share 38 seconds of regrets - not a drop of<br/>\nresentment between us. THAT is the gift of unschooling - Each day is<br/>\nappreciated for the Present it is, there is no such thing as &quot;investing for<br/>\nthe future&quot; because the future does NOT exist.<br/>\n<br/>\n***when you are committed to a performance and<br/>\n<blockquote><span title=\"ireply\"> &gt; the others can&#39;t have you gone, just as you can&#39;t be gone from work, you<br/>\n&gt; have to<br/>\n&gt; make choices. ***<br/>\n&gt;<br/>\n&gt; But you&#39;re not letting him make the choices.<br/>\n&gt;<br/>\n&gt; Anyone leading a bunch of kids in a ballet class knows some times some kid<br/>\n&gt; or other won&#39;t show. If the instructor sets up performances he or she has to<br/>\n&gt; know that something can go wrong. It&#39;s his job to take responsibility for<br/>\n&gt; that. It&#39;s his job, he chose it, he can choose something else. A kid pressed<br/>\n&gt; into attendance has none of those choices. A kid paying for lessons never<br/>\n&gt; has as much responsibility to the company as the instructor has. A parent<br/>\n&gt; doesn&#39;t have more responsibility to a ballet director or the other kids in a<br/>\n&gt; ballet class than she does to her own child.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>-=-Talking to kids on sports teams about this very thing, the overwhelming<br/>\nmessage I received is: there is nothing worse than being in team with<br/>\nsomeone who doesn&#39;t want to be there.   It&#39;s a far more pleasant experience<br/>\nfor the kids who are there, following their passions, to be surrounded by<br/>\nothers of like minds. The *one* resentful kid who is being forced to be<br/>\nthere, changes the dynamics (for the worse) of the whole production -<br/>\nwhether it&#39;s ballet, football or basketball doesn&#39;t matter!  Truly, truly,<br/>\nthe passionate kids would prefer the forced ones just stay home.<br/>\n<br/>\n*** He knows he has trouble running and other things,<br/>\n<blockquote><span title=\"ireply\"> &gt; and knows that he wants to improve. So, like most of us, he puts up with<br/>\n&gt; some<br/>\n&gt; negatives to get to the positive of improving his soccer and basketball.***<br/>\n&gt;<br/>\n&gt; The more he plays soccer and basketball the better he&#39;ll get at soccer and<br/>\n&gt; basketball. He doesn&#39;t *have to* have ballet to get good at soccer. And<br/>\n&gt; maybe he&#39;ll never be great at any of those things. That has to be ok. It has<br/>\n&gt; to be ok to do some things because you love them and have fun even if you&#39;ll<br/>\n&gt; never be great. If you could fast forward ten years and see that he cared<br/>\n&gt; nothing at all about soccer or basketball or ballet would you think then<br/>\n&gt; that forcing him was important? These are days you will never get back. How<br/>\n&gt; do you want to live them?<br/>\n&gt;<br/>\n&gt; We can&#39;t know what our kids will love in ten years or twenty. We can&#39;t know<br/>\n&gt; what life will bring them. We *can* help them explore as many things as<br/>\n&gt; possible in positive and enriching ways so they have a big, happy map of<br/>\n&gt; life they can revisit and retrace anytime and in any way they want.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>-=- or that our kids will even still be here in 10 or 20 years!!!  If they<br/>\nare, then I&#39;d like to take steps right now (& I do) to ensure I&#39;m a person<br/>\nthey want to keep in their life 10, 20, 50 years from now. The impetus is on<br/>\nME.<br/>\n<br/>\n***...show me end results of grown people who did it this way.***<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; The end result of everyone will be death. You cannot raise your child to<br/>\n&gt; some point of adult perfection and then have him stay that way for all<br/>\n&gt; eternity. I know you know that. But really, think about it. There is no end<br/>\n&gt; result while people are alive and can learn.<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>-=-we can show you the results of kids *right now, today* who live happy,<br/>\nfulfilled, JOYFUL lives. Now is all we got!!<br/>\n<br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.blogspot.com<br/>\nhannahsashes.blogspot.com<br/>\ndianas365.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Critisism","postDate":"1239737538","msgId":39537,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFQTkxNjdCQzc0NjQ1NzA4MUQwRTc5NDA4QjQ3RjdCQGJpZ3N1cnByaXNlPg=="},"prevInTopic":0,"nextInTopic":39556,"prevInTime":39536,"nextInTime":39538,"topicId":39537,"numMessagesInTopic":0,"msgSnippet":"***Yet, I think that these words (below) are rather intrusive on my own free-will and a compassionate conversation.*** ***Please keep the comments positive and","messageBody":"<div id=\"ygrps-yiv-1775131674\">***Yet, I think that these words (below) are rather intrusive on my own free-will and a compassionate conversation.***<br/>\n<br/>\n***Please keep the comments positive and supportive and helpful. I don&#39;t want to spend time<br/>\ndefending. I&#39;d rather be learning.***<br/>\n<br/>\n<br/>\nNo one on an email list can intrude on your free will.  I&#39;m not even sure what that would be.   You felt stung and no one here wants you to feel badly.  Try to imagine your fellow list members as people who want to help you get quickly to a place of understanding.   Whether you view the free offering here as compassionate and helpful or critical is really up to you. <br/>\n<br/>\nNo list member will ever be able to control how other list members write and offer information.   The only thing you can control is what you write and how you respond.    You never have to respond to a post if you don&#39;t want to.  You never have to defend yourself or your ideas to us.   Take what you want from the list, share what you&#39;re willing to share,  and follow the list guidelines, which ask members to refrain from meta discussion, please.    Whatever you post to the list is up for discussion.   If you don&#39;t want to participate in the discussion you don&#39;t have to.   <br/>\n<br/>\n*** We don&#39;t know<br/>\nhow to make sure that the dishes get done and the laundry gets done so we have<br/>\nunderwear and still are able to be totally present for our children if we don&#39;t<br/>\never insist on anything.***<br/>\n<br/>\nSometimes dishes don&#39;t get done. Sometimes laundry sits for another day.  Dishes and laundry can wait.  Children shouldn&#39;t have to.  Children are growing and changing and getting older every day. <br/>\n<br/>\nYou can change your routine for doing dishes and laundry.  Do dishes by degrees- two plates now, six cups in an hour... do them at night after everyone is in bed, get up early and do them, get a dishwasher, trade something you have for dish washing services.  You can ask for help without insisting.  You can hire help.  You can use paper plates.   There are not just two choices - either you make your kids do dishes or the dishes don&#39;t get done.   If you let yourself think things you never did before you&#39;ll be surprised how many possible solutions there are. <br/>\n<br/>\n***I know of no one that is a musician today that blames their<br/>\nparents when they acknowledge that their parents made them do it. Only a lucky<br/>\nfew started music so early that they simply don&#39;t remember it ever being an<br/>\nissue.***<br/>\n<br/>\nSome women who get punched by their husbands think they deserve it.  Some kidnap victims grow sympathetic to their kidnappers.  Those are really extreme examples but a quick way to show you that a person who is constantly under the authority and power of another can come to accept that authority as the right thing.   It is a very hard thing to face, the idea that what was done to us as children, what we endured was for nothing, that it didn&#39;t have to be.  If we face that then all those years are wasted years, we can never get them back, our parents were wrong ( and if they were wrong about that, what else were they wrong about?)    It&#39;s a kind of self preservation to believe it was for our own good and there was some benefit which will eventually make it worthwhile.     And then you have a person who believes he&#39;s incapable of learning on his own.  That if he doesn&#39;t have a teacher, parent, authority  making him do what he ought to he&#39;s so lazy or bad or unmotivated or stupid he&#39;ll never get it on his own. <br/>\n<br/>\nIf our kids get to adulthood but their psychology is so altered they don&#39;t know their true selves I don&#39;t think we can call our parenting successful. <br/>\n<br/>\n***when you are committed to a performance and<br/>\nthe others can&#39;t have you gone, just as you can&#39;t be gone from work, you have to<br/>\nmake choices. ***<br/>\n<br/>\n<br/>\nBut you&#39;re not letting him make the choices.   <br/>\n<br/>\nAnyone leading a bunch of kids in a ballet class knows some times some kid or other won&#39;t show.  If the instructor sets up performances he or she has to know that something can go wrong.  It&#39;s his job to take responsibility for that.   It&#39;s his job, he chose it, he can choose something else.    A kid pressed into attendance has none of those choices.  A kid paying for lessons never has as much responsibility to the company as the instructor has.   A parent doesn&#39;t have more responsibility to a ballet director or the other kids in a ballet class than she does to her own child. <br/>\n<br/>\n*** He knows he has trouble running and other things,<br/>\nand knows that he wants to improve. So, like most of us, he puts up with some<br/>\nnegatives to get to the positive of improving his soccer and basketball.***<br/>\n<br/>\nThe more he plays soccer and basketball the better he&#39;ll get at soccer and basketball.  He doesn&#39;t *have to* have ballet to get good at soccer.  And maybe he&#39;ll never be great at any of those things.  That has to be ok. It has to be ok to do some things because you love them and have fun even if you&#39;ll never be great.   If you could fast forward ten years and see that he cared nothing at all about soccer or basketball or ballet would you think then that forcing him was important?   These are days you will never get back.  How do you want to live them? <br/>\n<br/>\nWe can&#39;t know what our kids will love in ten years or twenty.  We can&#39;t know what life will bring them.   We *can* help them explore as many things as possible in positive and enriching ways so they have a big, happy map of life they can revisit and retrace anytime and in any way they want.  <br/>\n<br/>\n***I would hope you would want to win me over with<br/>\nexamples of how this looks and works and show me end results of grown people who<br/>\ndid it this way.***<br/>\n<br/>\nNo one here needs to win you over.   What you do is up to you and our lives will go on happily even if you never understand unschooling.  All the responsibility for your understanding is on you.  People offering their help here don&#39;t *have to * help you or anyone.  They choose to, usually because someone helped them.  These are good folks.  <br/>\n<br/>\n***...show me end results of grown people who did it this way.***<br/>\n<br/>\nThe end result of everyone will be death.   You cannot raise your child to some point of adult perfection and then have him stay that way for all eternity.  I know you know that.  But really, think about it.  There is no end result while people are alive and can learn. <br/>\n<br/>\nMy son will be seventeen in May. He is now past the age of compulsory school attendance in our state.   He never went to school.  Today he plays the piano and organ.   He bought and is fixing (struggling a little with) an old modular synthesizer and plays that.     He&#39;s learning about vacuum tubes as he works on an old spinet organ he found at a junk store. (Affectionately called the bird poop organ)  He&#39;s writing a screenplay, not his first one.  He&#39;s learning TV and VCR repair for his own amusement.  He&#39;s fascinated with old media, laser disc players, video discs, old radios, beta vcr&#39;s.  He&#39;s interested in photography, film making, politics, psychology, writing.  He loves watching movies and playing chess.  He reads, reads, reads.  He may or may not go to college.  He&#39;s looking for a summer job.   He&#39;s thinking of taking his driver&#39;s test.  He&#39;s learning Italian from a Pimsleur course.   He does all his own laundry.  He can cook, clean and sew.  He can draw.  He can split firewood.  He manages his own money and accounts responsibly.   And he&#39;s trying to come up with a reason to skip his cousins wedding next month. &lt;g&gt;    He is what people like to call these days a radical unschooler.  He grew up without bedtimes, without food restrictions, without TV or video game limits, without curriculum, without chores.   He is responsible, realistic, mature, calm, thoughtful, philosophical and sometimes cynical and critical  He&#39;s also young, idealistic, hopeful, funny, insightful and brilliant.   Just exactly himself. &lt;g&gt;   <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":39496,"nextTopicId":39571}}