{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Hi from a new member","postDate":"1154299655","msgId":16033,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVhamN1NytuOWJlQGVHcm91cHMuY29tPg=="},"prevInTopic":16031,"nextInTopic":0,"prevInTime":16032,"nextInTime":16034,"topicId":16020,"numMessagesInTopic":0,"msgSnippet":"Last but not least I m scared of being the only one being really radical, even though I m kind of that way anyways.Im scared of isolating my family as we tend","messageBody":"<div id=\"ygrps-yiv-2025242323\">&quot;Last but not least I&#39;m scared of being the only one being really<br/>\nradical, even though I&#39;m kind of that way anyways.Im scared of<br/>\nisolating my family as we tend to be that way a little anyways due to<br/>\nanxiety.<br/>\n<br/>\nThe next thing is I&#39;m actually thinking of driving to the unschooling<br/>\nconferne in Mew Mexico with 3 of my kids the oldest wont come,shes a<br/>\nwild one, just to get some inspiration and jump start me???&quot;<br/>\n<br/>\nI think the conference could be really great. Just realize, that if<br/>\nyour children aren&#39;t used to being free (going to funshops and being<br/>\non their own) the freedom might be a bit intoxicating and can be<br/>\nproblematic at the conference. I might keep them close to me at first,<br/>\nand see how it goes.:)  You will definitely get a huge dose of<br/>\nconfidence and inspiration, I can guarantee that much!<br/>\n<br/>\nAs far as the ex goes, I would NOT try to explain unschooling. If<br/>\nhe&#39;ll let you homeschool without trying to take it to court, then<br/>\nsimply provide him with an abundance of schoolish language documenting<br/>\ntheir learning and scrapbooks with pics of all that you do. I&#39;ve seen<br/>\nmother&#39;s lose their children in court over homeschooling....I don&#39;t<br/>\nrecommend battling an ex on it unless you&#39;re well-armed, and you<br/>\naren&#39;t at this point in time.<br/>\n<br/>\nIf you had to sign up under an umbrella school like Clonlara or Oak<br/>\nMeadow to keep him happy, then I&#39;d do it, just to keep it from<br/>\nbecoming a huge issue. The courts would most likely view unschooling<br/>\nas &quot;educational neglect&quot; so it&#39;s just not worth going there.<br/>\n<br/>\nI hope you make the conference, I think you&#39;d learn a ton and get the<br/>\nneeded dose of confidence!<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":205985676,"authorName":"Sandy Deby","from":"Sandy Deby &lt;pod6freedom@...&gt;","profile":"pod6freedom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] IN NEED OF ADVICE!!Waldorf/unschooling/public","postDate":"1154281832","msgId":16031,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNzMwMTc1MDMyLjIwMzY5LnFtYWlsQHdlYjM3MzE0Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDAwMDUwMWM2YjJiYiQ2NmJjOTAyMCQwZjAwYThjMEBrZWxseWRlc2s+"},"prevInTopic":16020,"nextInTopic":16033,"prevInTime":16030,"nextInTime":16032,"topicId":16020,"numMessagesInTopic":0,"msgSnippet":"Hi I am real need of feedback, Where to start, my oldest is 16 in the fall, has dropped out of school and thinks she might work, she doesn t know. The poor","messageBody":"<div id=\"ygrps-yiv-1963109610\">Hi I am real need of feedback,<br/>\n   <br/>\n  Where to start, my oldest is 16 in the fall, has dropped out of school and thinks she might work, she doesn&#39;t know. The poor girl has bounced around her entire life from public, to Waldorf to public self paced. Waldorf worked the best until the teacher changed and then it was what now, since then.<br/>\n   <br/>\n  Shes an expierntail learner like her Mother and seems kind of lost on one hand right now and yet solidly wise  on the other hand.<br/>\n   <br/>\n  My next child who was diagnoised autistic at the age of 4 is now 13 and it really fell apart the last year in the public for him for he just wanted to stay home and stay up al night inventing motors in his room.  The two old est are from my previous marriage and his dads a dentist  and education is everything to his family, and he,s convinced Adrian he should go to junior high, and that the whole idea of unschooling is for dummies.<br/>\n   <br/>\n  My next child is 8 and went to Waldorf and didn&#39;t do so great there because he didn&#39;t buy into there fairies and Nome&#39;s to well and wanted his video games that the school would never support, So he went to public fpr grade 1  after being held back at Waldorf for having &quot;sensory issues &quot; and immaturity and wasn&#39;t passing his grade one readiness testing?? He loved learning in grade one, but by the end of the year he was crying don&#39;t send me I want to stay home.<br/>\n   <br/>\n  The next child Natalia just finished kindergarten at Waldorf and loved it, she loved there art and songs and stories, it really suits her personality, and saying she wants to go into grade one with her friends so she can learn to play recorder.<br/>\n  Most of the Moms in this class totally support me in unschooling, and we all of seen the benefits and the not so good things at Waldorf.<br/>\n   <br/>\n  Unschooling came to me about 7 years ago after reading the book dumbing us down. I have always felt and known in my heart how could there be a better way than this,I feel as if this is where I&#39;m being asked to go in my life with my children on a very spiritual level, and I&#39;m afraid to trust. <br/>\n   <br/>\n  I feel overwhelmed and at times actually depressed thinking what to do?<br/>\n   <br/>\n   My edest and my 13 years old actually want to anything, yet there Fathers say buck up. I do have concerns with Adrian being home with his needs for he tends to obsess and be compusive obsessionaldemanding all the attention, at leat at school the have aids that can work with meeting all his need?????.<br/>\n   <br/>\n  The youngest two Addison&#39;s my8 year old son wants to home school and Natalia said I should make the decision for her  but that she would like to try Waldorf grade one.<br/>\n   <br/>\n  My husband and I Have been reading Rue Kreams book an  unschooled life, and its been our Bible as far as answering all the insecurities that come up, yet I still find myself wondering how to pull this off with all theses different needs, and I&#39;m a student too!<br/>\n   <br/>\n  I&#39;m thinking of letting all of my schhol stuff go and boycotting my ex on any decisions in regards to the oldest??? For he just parents in the oldest school ways possible.<br/>\n   <br/>\n  My husband and wonder should we let Natalia try Waldorf one year and let Alisha my oldest just find her own way just supporting her with love, let Adrian try junior high, or say nope its better to stay home don&#39;t listen to your Father, hes full off fear. Addison for course he,s very clear on staying home.<br/>\n   <br/>\n  Also wondertree here in Canada, you can sign under for homechooling, but you do have to write in weekly to let them know what your doing???<br/>\n   <br/>\n  Last but not least I&#39;m scared of being the only one being really radical, even though I&#39;m kind of that way anyways.Im scared of isolating my family as we tend to be that way a little anyways due to anxiety.<br/>\n   <br/>\n  The next thing is I&#39;m actually thinking of driving to the unschooling conferne in Mew Mexico with 3 of my kids the oldest wont come,shes a wild one, just to get some inspiration and jump start me??? <br/>\n   <br/>\n  Any feed back would be so appreciated ..................With an open heart to know..Sandy<br/>\n<br/>\nKelly &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kelly@...\">kelly@...</a>&gt; wrote:<br/>\n          Hi all,<br/>\n<br/>\nMy name is Kelly. I wanted to jump in and say Hi briefly. I&#39;ll be reading<br/>\nmore than responding for the next several months .we&#39;re expecting our 2nd<br/>\nchild soon (due date: Aug 19), and we still have a ridiculous amount of<br/>\nthings to do before the munchkin arrives. My husband and I have a daughter,<br/>\nLila, who&#39;ll be 3 on Aug. 31. We&#39;re planning on a home-birth, as we did with<br/>\nLila. (Hour 36 of labor was where the midwives drew the line, so it was off<br/>\nto the hospital with me! Fortunately, it was a midwife-to-midwife transfer,<br/>\nso I still never had to see a doctor, and all went smoothly in the end.) <br/>\n<br/>\nI&#39;m looking forward to learning more from all of you about home/un/eclectic<br/>\n&quot;schooling.&quot; I&#39;ll cop to having some (I figure) common fears about what lays<br/>\nahead, but for the most part, I go to sleep in happy anticipation of what<br/>\nthe day ahead may bring. It helps that Lila is a dream of a child .had<br/>\nsomeone given me the opportunity to order up the perfect child for us, I<br/>\ncouldn&#39;t have done this well. Which isn&#39;t to say she&#39;s perfectly behaved, or<br/>\nalways happy and easy going. Far from it; she&#39;s regularly challenging. It&#39;s<br/>\nthe way she&#39;s challenging, and how she responds to reason and to our efforts<br/>\nthat slays me. Yeah, I&#39;m in love, for sure. But her personality seems so<br/>\nwell suited to this non-school path, and her enthusiasm for everything makes<br/>\nthe challenges fun.<br/>\n<br/>\nOkay, that&#39;s it for now. Pregnant women can ramble like nobody else, so I&#39;m<br/>\ngoing to cut myself off here.<br/>\n<br/>\nHave a great weekend.<br/>\n<br/>\nKelly<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n         <br/>\n<br/>\n \t\t\t\t<br/>\n---------------------------------<br/>\nMake free worldwide PC-to-PC calls. Try the new Yahoo! Canada Messenger with Voice<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":235225792,"authorName":"Kelly","from":"&quot;Kelly&quot; &lt;kelly@...&gt;","profile":"dogsheeptiger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Hi from a new member","postDate":"1154142136","msgId":16020,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDUwMWM2YjJiYiQ2NmJjOTAyMCQwZjAwYThjMEBrZWxseWRlc2s+"},"prevInTopic":0,"nextInTopic":16031,"prevInTime":16019,"nextInTime":16021,"topicId":16020,"numMessagesInTopic":0,"msgSnippet":"Hi all, My name is Kelly. I wanted to jump in and say Hi briefly. I ll be reading more than responding for the next several months .we re expecting our 2nd ","messageBody":"<div id=\"ygrps-yiv-485289027\">Hi all,<br/>\n<br/>\n <br/>\n<br/>\nMy name is Kelly. I wanted to jump in and say Hi briefly. I&#39;ll be reading<br/>\nmore than responding for the next several months .we&#39;re expecting our 2nd<br/>\nchild soon (due date: Aug 19), and we still have a ridiculous amount of<br/>\nthings to do before the munchkin arrives. My husband and I have a daughter,<br/>\nLila, who&#39;ll be 3 on Aug. 31. We&#39;re planning on a home-birth, as we did with<br/>\nLila. (Hour 36 of labor was where the midwives drew the line, so it was off<br/>\nto the hospital with me! Fortunately, it was a midwife-to-midwife transfer,<br/>\nso I still never had to see a doctor, and all went smoothly in the end.) <br/>\n<br/>\n <br/>\n<br/>\nI&#39;m looking forward to learning more from all of you about home/un/eclectic<br/>\n&quot;schooling.&quot; I&#39;ll cop to having some (I figure) common fears about what lays<br/>\nahead, but for the most part, I go to sleep in happy anticipation of what<br/>\nthe day ahead may bring. It helps that Lila is a dream of a child .had<br/>\nsomeone given me the opportunity to order up the perfect child for us, I<br/>\ncouldn&#39;t have done this well. Which isn&#39;t to say she&#39;s perfectly behaved, or<br/>\nalways happy and easy going. Far from it; she&#39;s regularly challenging. It&#39;s<br/>\nthe way she&#39;s challenging, and how she responds to reason and to our efforts<br/>\nthat slays me. Yeah, I&#39;m in love, for sure. But her personality seems so<br/>\nwell suited to this non-school path, and her enthusiasm for everything makes<br/>\nthe challenges fun.<br/>\n<br/>\n <br/>\n<br/>\nOkay, that&#39;s it for now. Pregnant women can ramble like nobody else, so I&#39;m<br/>\ngoing to cut myself off here.<br/>\n<br/>\n <br/>\n<br/>\nHave a great weekend.<br/>\n<br/>\n <br/>\n<br/>\nKelly<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":15391,"nextTopicId":16041}}