{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"desensitization was World of Warcraft","postDate":"1232294636","msgId":37863,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4NDI2OS45NzA0Ny5xbUB3ZWI4NjIwOC5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PGdrcnJmaitmMHNnQGVHcm91cHMuY29tPiA8QkNFN0VERDktNjFERi00OUE4LUEyQzYtQzEyOEI4NEJENTE1QHZlcml6b24ubmV0PiA8NDk3MjYyMEEuNjAyMDIwNUBrdXJ0ei1mZXJuaG91dC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":37862,"nextInTime":37864,"topicId":37863,"numMessagesInTopic":0,"msgSnippet":"... David just got the game Burnout Paradise. It was a birthday present. In it you drive around Paradise City and race and smash cars. It s really fun. I ve","messageBody":"<div id=\"ygrps-yiv-698268178\"><blockquote><span title=\"ireply\">&gt;Even if it is not entirely &quot;addiction&quot;, I believe there is also another <br/>\n&gt;issue in modern life related to &quot;progressive desensitization&quot;. It may <br/>\n&gt;involve drugs (including alcohol and cigarettes), video games, broadcast TV <br/>\n&gt;violence, rich food, or loud music (all aspects of our current popular <br/>\n&gt;technological culture, and all profitable for some people to push). <br/>\n<br/>\n </span></blockquote>David just got the game Burnout Paradise. It was a birthday present. In it you drive around Paradise City and race and smash cars. It&#39;s really fun. I&#39;ve been in accidents in real life and they are scary and stressful, even just fender benders, never fun. I doubt that Burnout Paradise will desensitize me to the adrenaline rush of being in an accident. <br/>\n<br/>\nDesensitization reads like slippery slope arguments. That is idea that if you can be normalized to one thing you will step up to a new experience in order to get the &quot;rush&quot;  you need or that got you started on the first thing. I think that can be true. If you like the easy roller coaster at the local fun fair you may go looking for more extreme roller coasters to ride. However it assumes that one thing desensitizes you to another, cigarette smoking leads to heroin addiction by desensitizing you to a drug, or, even, that cigarette smoking leads to smoking more cigarettes. I used to smoke, on average I smoked around 20 cigarettes a day. I didn&#39;t become desensitized to the nicotine in cigarettes, I didn&#39;t need to smoke more and more over the days and months and years that I smoked until I was chain smoking from the moment that I woke up throughout the day until I went to sleep at night. It wasn&#39;t a slippery slope to chewing tobacco or to filterless<br/>\n cigarettes or to using nicotine patches and smoking at the same time. <br/>\n<br/>\nThe idea of desensitization reminds me of the Boiled Frog story. It&#39;s this story that is based on a test (one of a series done on frogs) performed in the 1880s or so that claimed that a frog put in boiling water would jump out but would stay in water that was cold to start and then brought up to boiling. It&#39;s a lovely analogy, but it isn&#39;t true. Frogs don&#39;t stay in slowly heated water: if they can they jump out. Actually according to one amusing examination of the story (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.fastcompany.com/magazine/01/frog.html)\">http://www.fastcompany.com/magazine/01/frog.html)</a> frogs jump out of lukewarm water being heated slowly in 1.57 seconds and jump out of cold water being heated slowly in 4.20 seconds. Maybe the point is being able to get out and into something better. Maybe the reason why people desensitize to things that seem like bad choices to outside observers are because the other options aren&#39;t any better, or they can&#39;t choose anything else. Simon and Linnaea can change what they do, they can choose<br/>\n other things than World of Warcraft to play, they aren&#39;t stuck in an environment that is worth escaping to World of Warcraft to get away from. So when they do play they are playing because they want to. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":37859,"nextTopicId":37864}}