{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":77,"messages":[{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Moving toward more peaceful parenting and help with dh","postDate":"1231246883","msgId":37612,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NEFFNkI3QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":37611,"nextInTopic":37613,"prevInTime":37611,"nextInTime":37613,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"... that s the way the world works. My Dh is the at home parent, he brings in no income. He does the housework - does that mean that I m paying him for the","messageBody":"<div id=\"ygrps-yiv-421010963\"><blockquote><span title=\"ireply\">&gt; The rationale behind it is that both DH and I work for our money, and<br/>\n </span></blockquote>that&#39;s the way the world works.<br/>\n<br/>\nMy Dh is the at home parent, he brings in no income. He does the<br/>\nhousework - does that mean that I&#39;m paying him for the work he does/he&#39;s<br/>\n&quot;earning&quot; the cash he chooses to spend now and again for items he might<br/>\nwant? Should it be withheld if he doesn&#39;t get the dishes done one day or<br/>\nI take out the trash instead of him? If the money DH spends for things<br/>\nhe might want (the occasional gadget or gizmo whatever) is not payment<br/>\nfor services rendered, why would I tie DS&#39; spending money to services<br/>\nrendered simply because he&#39;s under 18? DS clearly understands where the<br/>\nmoney comes from - he&#39;s even visited me at work and knows what I do. He<br/>\nknows that in order to have any of the money we have, I get up early in<br/>\nthe morning and go to work and come home around dinnertime. He knows<br/>\nthat I can&#39;t just stay home whenever I want - there is an allotted<br/>\nnumber of sick days and vacation days I have available and after that, I<br/>\ncan have money held back from my pay.<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh","postDate":"1231238631","msgId":37611,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2OTYxOC42NzQ0Mi5xbUB3ZWI4NjIwNy5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":37609,"nextInTopic":37612,"prevInTime":37610,"nextInTime":37612,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"John Bock, an anthropologist who is at Cal State University at Fullerton, did some work on children s utility at the chores they might do. It was his Ph.D.","messageBody":"<div id=\"ygrps-yiv-2059722384\">John Bock, an anthropologist who is at Cal State University at Fullerton, did some work on children&#39;s utility at the chores they might do. It was his Ph.D. dissertation work. I can remember sitting in his house watching slides of children of the Okavango Delta Peoples of Botswana trying to crush mongongo nuts to compare how many they could crush in an hour versus an untrained adult. He looked at how much food they could gather compared with how much caloric output their somewhat clumsy fishing and other kinds of gathering produced. He found that they were more of a burden than an assistance. Certainly at younger ages children&#39;s work was much more about keeping them busy than it was about accruing resources to extend a family&#39;s ability to survive.<br/>\nWhich is like the little bit I can remember from Dr. Spock&#39;s Baby and<br/>\nChildcare book when he wrote about taking your toddler for a walk and how you should expect a block to take an hour given all the potential distractions along the path. <br/>\n<br/>\nOoh, here&#39;s a relevant quote from a paper (<a rel=\"nofollow\" target=\"_blank\" href=\"http://anthro.fullerton.edu/jbock/BockJohnson.pdf)\">http://anthro.fullerton.edu/jbock/BockJohnson.pdf)</a> looking at subsistance ecology and play: <br/>\n<br/>\nThis leads us to expect that a household’s participation in<br/>\nagriculture will decrease the amount of time spent in play, since there is<br/>\nsubstantial evidence in this (Bock 2002b) and other traditional communities<br/>\n(Blurton Jones et al. 1989; Bulatao and Arnold 1977; Cain 1977; Caldwell<br/>\n1982; Lee and Kramer 2002; see Kaplan and Bock 2001b for a review)<br/>\nthat children are more able to contribute to the household economy in<br/>\nfarming subsistence ecologies than in foraging or herding.<br/>\n<br/>\nIt suggests that it is only recently that we&#39;ve been handing out chores to ensure subsistance. It might challenge a rawist approach to chores given that chores may have only been around as long as cooking (so 250,000 years), actually, not even that long. <br/>\n<br/>\nAll of this reminds of Rob Walker&#39;s work on hunting proficiency among<br/>\nboys and men of the Ache of Paraguay. He found that Ache hunters were<br/>\nat their hunting peak at between 37 and 42 years of age<br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.eva.mpg.de/ipse/staff/walker/pdfs/achehunt.pdf)\">http://www.eva.mpg.de/ipse/staff/walker/pdfs/achehunt.pdf)</a>. Children don&#39;t help a lot when hunting with their uncles. <br/>\n<br/>\nJohn Bock wrote a paper (Evolutionary Demography and Intrahousehold Time Allocation:School Attendance and Child Labor Among the Okavango Delta Peoples of Botswana) that had this in it&#39;s summary:<br/>\n<br/>\nPerhaps most significant for policy implications<br/>\nis that whether or not a specific<br/>\nchild would benefit from attending school<br/>\nwas not a significant predictor of school attendance.<br/>\nRather, the degree to which parents&#39;<br/>\nown reproductive interests were<br/>\nserved was the primary predictor of which<br/>\nchildren attended school. <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://anthro.fullerton.edu/jbock/BockAJHB.pdf)\">http://anthro.fullerton.edu/jbock/BockAJHB.pdf)</a><br/>\n<br/>\nTo rephrase, parents were manipulating their children&#39;s labor and education to suit the parents&#39; needs. I consider myself really lucky to not have to do that. I get to choose to give Simon and Linnaea the freedom of my reproductive interests so that they can choose the things that will most benefit themselves. I don&#39;t need to pull them away from those things that will give them their best outcome in order to have my needs met. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Meridith Richardson &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ruttegar@...\">ruttegar@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Monday, 5 January, 2009 8:42:00 PM<br/>\nSubject: Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh<br/>\n<br/>\n<br/>\ntrue and natural it has been since the beginning of time where anthropology can show us how humans shared &quot;chores&quot; to make sure life continued.  I am a rawist because I think at our most natural of states that is how we ate.  I also think at appropriate times children will come to the point that they desire/need to be a part of subsistence.  If you feel your son is ready than I agree with your decision.  <br/>\nMeridith<br/>\n<br/>\n<br/>\n <br/>\n    <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":12252351,"authorName":"Gwen","from":"Gwen &lt;willow_selene@...&gt;","profile":"willow_selene","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving toward more peaceful parenting Robin","postDate":"1231226502","msgId":37613,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgyMTc4OC44NjU2NC5xbUB3ZWI1MDQwNS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDExNjczMy4yMzk5NC5xbUB3ZWI1MTcxMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":37612,"nextInTopic":37614,"prevInTime":37612,"nextInTime":37614,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"This reminds me of a comment my mom made a couple of weeks ago.  She said something to the effect of even though she could pretty much buy my niece (6)","messageBody":"<div id=\"ygrps-yiv-1354996663\">This reminds me of a comment my mom made a couple of weeks ago.  She said something to the effect of even though she could pretty much buy my niece (6) anything she wanted, she didn&#39;t want my niece to know that.  She believes it is important for my niece to &quot;know the value of hard work&quot;<br/>\n<br/>\nIt is so different from how I want my kids to feel.  I want Megan and Zoe to feel as if I can help them to achieve what they want.  I want my kids to know that I&#39;m on their side and not standing by waiting to teach them a lesson.<br/>\n<br/>\nOver the weekend, I was looking at a website project called &quot;101 Things in 1,001 Days&quot;.  I thought it was a cool idea.  I was getting ready to start my list when Megan asked what I was doing.  She liked the idea too and came up with 101 things in about an hour.  Twelve items on her list were &quot;things she wanted to buy&quot;.  The rest of the list is filled with places she wants to go and things she wants to do.  Some of them are going to be easy (put on a puppet show, see a ballet) and some are going to be a fun challenge to fulfill (work in a bakery, go fossil hunting, work in kiosk in the mall), and some might not happen at all (fifteen items involve international travel) - but I am so excited to help her list come alive.<br/>\n<br/>\nGwen<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Mon, 1/5/09, Meridith Richardson &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ruttegar@...\">ruttegar@...</a>&gt; wrote:<br/>\nHow do you tell a child no then?  Will it not create a sense of entitlement<br/>\nin child if when you walk through walmart they want 7 or 8 different toys at<br/>\nonce EVERY TIME, and you buy them.  Why should I buy them for them on a whim? <br/>\nI don&#39;t see how that is a MUST for radical unschooling.  If there is<br/>\nsomething she consistently wants then yes I try to provide those things for<br/>\nher.  Meaning if she has to have a certain game and asks for it on more than a<br/>\nfew occasions, not on a whim or because of a cool commercial,  then I say ok<br/>\nlet&#39;s check that out next time we are at the store,  But if I bought<br/>\neverything my daughter asked for we wuld have no room in the house.  Literally,<br/>\nfrom ball pits, to pinball machines, air hockey tables etc.     So when do<br/>\nyou say no Robin, if you are able to afford it but think it is too much?  <br/>\nMeridith<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh","postDate":"1231208643","msgId":37609,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1OTYzMS4yMDA1Mi5xbUB3ZWI4MTUwOC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":37608,"nextInTopic":37611,"prevInTime":37608,"nextInTime":37610,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"Naruto is 6 and Gigi will be 3 in the end of the month. Today we had panned to go to Walmart get some more moon sand  so we could build a castle. I had $20 in","messageBody":"<div id=\"ygrps-yiv-1175993128\">Naruto is 6 and Gigi will be 3 in the end of the month. Today we had panned to go to Walmart get some more moon sand <br/>\nso we could build a castle.<br/>\nI had $20 in my wallet, and the moon sand is $6. We are really really tight in money right now and have talked to the kids about it.<br/>\nJust outside the parking lot there was a homeless man holding a sign and the kids asked what was written on it.<br/>\nI told them that the man did not have money and that he was homeless. Gigi was the first one to say :&quot; Can we build him a home?&quot;<br/>\nWe decided to buy the gentleman some food and give it too him since Gigi said we should give him Naruto&#39;s hamburger.<br/>\nSo we go in and right at the door there is Disney Princesses&#39; Pez set. My kids have been into Pez lately and Cinderella is too much for my little girl to resist.  I ask the kids:<br/>\nIF I buy the Pez than I cannot by the man some food. Both my kids wanted to buy the man food and were OK not buying their Pez.<br/>\nWe came out and the man was gone when we drove by. They were not disappointed. They were worried about were the man went and if he was going to be cold at night because:&quot; Everyone needs a home&quot; The never said ;&quot; Well we should have bought the Pez&quot;<br/>\nThey know I will buy them the Pez when I can. <br/>\nBy the way the Pez set was $14.76 with one of each Princess ( Like 8 or 9)If it was less I had the money I would have gotten it for them.<br/>\nKids that get &quot;everything &quot; they want do not became little brats who feel entlited.<br/>\nMy kids are awesome about getting things or NOT getting things because they know we are on their side.<br/>\nIn 2006 my son Naruto asked for a Nintendo DS for ME his mom for his Christmas present. He was 4 and a half years old.<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n<br/>\n<br/>\n <br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Moving toward more peaceful parenting Robin","postDate":"1231200922","msgId":37608,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI1RTYyM0UwLUM5M0YtNDlERS1BREE2LUJERkMzREQxNDFFQUBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGdqdHVzcityZWxzQGVHcm91cHMuY29tPg==","referencesHeader":"PGdqdHVzcityZWxzQGVHcm91cHMuY29tPg=="},"prevInTopic":37607,"nextInTopic":37609,"prevInTime":37607,"nextInTime":37609,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"Yes, for sure it depends! $1 per age per week is a good starting point, and similar, I think, to what Sandra Dodd did with her kids. We only have one child.","messageBody":"<div id=\"ygrps-yiv-2038952362\">Yes, for sure it depends! $1 per age per week is a good starting  <br/>\npoint, and similar, I think, to what Sandra Dodd did with her kids. We  <br/>\nonly have one child. For her and our situation, something more than  <br/>\nthat was appropriate.<br/>\n<br/>\nYMMV!<br/>\n<br/>\nRobin B.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jan 5, 2009, at 1:42 PM, Erin wrote:<br/>\n<br/>\n&gt; I was reading your post and realized that what we&#39;re doing is what<br/>\n&gt; you consider to be a &quot;small allowance&quot;!  Just more proof that all of<br/>\n&gt; our families and financial situations are different...it actually<br/>\n&gt; made me smile!  We have 6 kids, so we&#39;re giving out nearly $70 a week<br/>\n&gt; in allowance, but it is considered to be a &quot;small allowance&quot; by<br/>\n&gt; some.  It really all depends on a family&#39;s income and how many family<br/>\n&gt; members there are :)<br/>\n&gt;<br/>\n&gt; Erin </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh","postDate":"1231199905","msgId":37607,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4NTQzMi45NzE2OS5xbUB3ZWI4NjIwOC5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":37602,"nextInTopic":37608,"prevInTime":37606,"nextInTime":37608,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"Simon and Linnaea each get an allowance of 7 pounds a week. It used to be 8 but they wanted to each sponser an endangered animal for the other, so Linnaea","messageBody":"<div id=\"ygrps-yiv-559691531\">Simon and Linnaea each get an allowance of 7 pounds a week. It used to be 8 but they wanted to each sponser an endangered animal for the other, so Linnaea sponsers Simon&#39;s tiger and Simon sponsers Linnaea&#39;s orangutan. I also buy things that I can afford that I think they will enjoy. I pay for two WoW accounts, I pay for headphones for Simon so that he can listen to the computer in the same room as the television, they seem to break fairly regularly, and I replace them, I buy their clothes and pay for outings. Their money is completely discretionary. They get to choose what they do with it. <br/>\n<br/>\nI decided that I didn&#39;t like holding all the cards when it came to money and purchases. I decided that I wanted them to have power over what they bought and what they saved for and what they didn&#39;t really want. And I still like getting things for them, so when I feel flush enough, I get things that I choose or that I know they&#39;d like. <br/>\n<br/>\nThe money isn&#39;t free. They totally understand that their dad works for money. They also understand that money is how we pay for things. To heat the house, to pay the rent, to have a tuna sandwich, it all takes money. They don&#39;t live in a vacuum without any awareness of how things work. The other day we went into to town to get video games with their Christmas money. Simon knew precisely what he wanted, having watched youtube Let&#39;s Plays of different games to see what he would like and having looked at reviews at Gamespot.com. Linnaea had really enjoyed Fable 2, so she and I went looking for games that were similar, doing a lot of research for the kind of evil to good continuum that Fable has as well as looking for a game with a dog for a pet. Turns out Fallout 3 has both those things. Anyhow, so we were in town at the game store looking through all the games and I noticed that they had a Sims 2 expansion pack that she didn&#39;t have and pointed it out. She<br/>\n picked it up and looked at it and then said &quot;You know, I want it, but I don&#39;t want it right now. Not more than I want the other game,&quot; and she put it back. These are not people who spend money as if it were free. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Meridith Richardson &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ruttegar@...\">ruttegar@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Monday, 5 January, 2009 5:53:37 PM<br/>\nSubject: Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh<br/>\n<br/>\n<br/>\nI think if he asks for ways to earn money that is fine.  Then provide it if you can.  I don&#39;t think we have to hand out free money to show our love.  BUt forcing him to do chores does not seem appropriate for the environment.  I do all the house work here and sometimes I have asked her to help clean her toys but if she does not then I do it without yelling.  I hope at some point she will find joy in helping others like i do.  But she has asked me, &quot;how can I earn some money.&#39;  I said would you like to do some things I do around the house and she said yes.  So I told her some options she did some and I paid her.  Her choice, just like my choice to work.  Do you all who oppose allowances hand out money to your kids for everything fun they want, or do you only buy needs and occasional wants?<br/>\nMeridith<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":334729351,"authorName":"Erin","from":"&quot;Erin&quot; &lt;theburkemommy@...&gt;","profile":"theburkemommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Moving toward more peaceful parenting Robin","postDate":"1231191771","msgId":37602,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdqdHVzcityZWxzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEI4RjREQzg1LTUxOTYtNEE3Qy04NTY3LUQ1Q0VGM0RDNTI4MkBjb21jYXN0Lm5ldD4="},"prevInTopic":37601,"nextInTopic":37607,"prevInTime":37601,"nextInTime":37603,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"I was reading your post and realized that what we re doing is what you consider to be a small allowance !  Just more proof that all of our families and","messageBody":"<div id=\"ygrps-yiv-296547526\">I was reading your post and realized that what we&#39;re doing is what <br/>\nyou consider to be a &quot;small allowance&quot;!  Just more proof that all of <br/>\nour families and financial situations are different...it actually <br/>\nmade me smile!  We have 6 kids, so we&#39;re giving out nearly $70 a week <br/>\nin allowance, but it is considered to be a &quot;small allowance&quot; by <br/>\nsome.  It really all depends on a family&#39;s income and how many family <br/>\nmembers there are :)<br/>\n<br/>\nErin<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Robin Bentley <br/>\n&lt;robin.bentley@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I didn&#39;t say &quot;never say no.&quot; I also didn&#39;t say &quot;buy them whatever <br/>\n </span></blockquote>they  <br/>\n<blockquote><span title=\"ireply\"> &gt; want, whenever they want it.&quot; &lt;g&gt;<br/>\n&gt; <br/>\n&gt; If you walk through Walmart and a child wants 7 or 8 different toys <br/>\n </span></blockquote>at  <br/>\n<blockquote><span title=\"ireply\"> &gt; once EVERY TIME (does this happen in your house?), what do you do?  <br/>\n&gt; Perhaps, I would say &quot;I have enough to buy x. How about we choose <br/>\n </span></blockquote>one  <br/>\n<blockquote><span title=\"ireply\"> &gt; now and we&#39;ll put the others on your wish list. We can get them as  <br/>\n&gt; soon as we can.&quot; This honors a kid&#39;s desire for the item, and  <br/>\n&gt; expresses the parent&#39;s desire to help them get it. You could even <br/>\n </span></blockquote>pick  <br/>\n<blockquote><span title=\"ireply\"> &gt; 7 or 8 $1.00 items, if it&#39;s sheer volume she&#39;s looking for &lt;g&gt;.<br/>\n&gt; <br/>\n&gt; If it happens every time and the visual stimulation of all those <br/>\n </span></blockquote>toys  <br/>\n<blockquote><span title=\"ireply\"> &gt; is too much, can you go shopping without your daughter? You could <br/>\n </span></blockquote>even  <br/>\n<blockquote><span title=\"ireply\"> &gt; pick up one of the desired items and bring it home, as a surprise <br/>\n </span></blockquote>one  <br/>\n<blockquote><span title=\"ireply\"> &gt; day. How much fun would that be for her?<br/>\n&gt; <br/>\n&gt; Has your daughter played pinball, played in ball pits, played air  <br/>\n&gt; hockey? Does she want to? You could find ways for her to <br/>\n </span></blockquote>experience  <br/>\n<blockquote><span title=\"ireply\"> &gt; those things without having to buy them for your home.<br/>\n&gt; <br/>\n&gt; I believe it&#39;s important to really think about whether &quot;it&#39;s too <br/>\n </span></blockquote>much&quot;  <br/>\n<blockquote><span title=\"ireply\"> &gt; if you can afford it. Is it too much money? Is it too much stuff? <br/>\n </span></blockquote>Is  <br/>\n<blockquote><span title=\"ireply\"> &gt; it too much for you? Motivation is good to explore.<br/>\n&gt; <br/>\n&gt; And, as I said &quot;It doesn&#39;t mean we don&#39;t talk to them about the <br/>\n </span></blockquote>wisdom  <br/>\n<blockquote><span title=\"ireply\"> &gt; of purchases or alternatives.&quot; Maybe not when a child is melting <br/>\n </span></blockquote>down  <br/>\n<blockquote><span title=\"ireply\"> &gt; at the store, if that happens, but some other opportunity. Help <br/>\n </span></blockquote>them  <br/>\n<blockquote><span title=\"ireply\"> &gt; make choices and decisions. It will help the next time.<br/>\n&gt; <br/>\n&gt; My daughter, now 13, is great to shop with now. She gets an <br/>\n </span></blockquote>allowance,  <br/>\n<blockquote><span title=\"ireply\"> &gt; not tied to chores. We determined about how much we would normally  <br/>\n&gt; spend per month on things other than food and clothes and gave it <br/>\n </span></blockquote>to  <br/>\n<blockquote><span title=\"ireply\"> &gt; her each pay day. When our income was reduced, we talked to her <br/>\n </span></blockquote>about  <br/>\n<blockquote><span title=\"ireply\"> &gt; reducing her allowance. She was really cool with that. Sometimes, <br/>\n </span></blockquote>she  <br/>\n<blockquote><span title=\"ireply\"> &gt; doesn&#39;t spend any of it. Sometimes, all of it. Sometimes, she asks <br/>\n </span></blockquote>for  <br/>\n<blockquote><span title=\"ireply\"> &gt; an advance and if we can do it, we do.<br/>\n&gt; <br/>\n&gt; Before we approached it this way, and she had a small allowance <br/>\n </span></blockquote>($1  <br/>\n<blockquote><span title=\"ireply\"> &gt; per age per week) when she was younger, it was difficult because  <br/>\n&gt; things she wanted were more expensive than, say, $7. She was not a  <br/>\n&gt; saver and  nothing we did helped her do that. I would spend money <br/>\n </span></blockquote>on  <br/>\n<blockquote><span title=\"ireply\"> &gt; things she wanted, try to make her feel guilty for it, while I <br/>\n </span></blockquote>felt  <br/>\n<blockquote><span title=\"ireply\"> &gt; resentful that she couldn&#39;t stick to a budget. Who was I kidding? <br/>\n </span></blockquote>I  <br/>\n<blockquote><span title=\"ireply\"> &gt; have trouble with that!  So, we came up with the solution of <br/>\n </span></blockquote>giving  <br/>\n<blockquote><span title=\"ireply\"> &gt; her generally what we&#39;d spend anyway. It&#39;s so easy now.<br/>\n&gt; <br/>\n&gt; With a decent amount of money that is her own, she makes her own  <br/>\n&gt; decisions, some good, some bad. But, she doesn&#39;t have me making <br/>\n </span></blockquote>her  <br/>\n<blockquote><span title=\"ireply\"> &gt; decisions for her. I can give her my opinion. Sometimes, she takes <br/>\n </span></blockquote>my  <br/>\n<blockquote><span title=\"ireply\"> &gt; advice, sometimes she doesn&#39;t. It makes for a more peaceful  <br/>\n&gt; relationship.<br/>\n&gt; <br/>\n&gt; If there is a compelling reason to say no (ie. for safety reasons,  <br/>\n&gt; having to sell your house to accommodate the item &lt;g&gt;), children <br/>\n </span></blockquote>can  <br/>\n<blockquote><span title=\"ireply\"> &gt; more easily understand that &quot;no&quot; than when a &quot;no&quot; comes seemingly  <br/>\n&gt; arbitrarily (at least from the child&#39;s perspective).<br/>\n&gt; <br/>\n&gt; Robin B.<br/>\n&gt; <br/>\n&gt; On Jan 5, 2009, at 11:48 AM, Meridith Richardson wrote:<br/>\n&gt; <br/>\n&gt; &gt;<br/>\n&gt; &gt; How do you tell a child no then?  Will it not create a sense of  <br/>\n&gt; &gt; entitlement in child if when you walk through walmart they want 7 <br/>\n </span></blockquote>or  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; 8 different toys at once EVERY TIME, and you buy them.  Why <br/>\n </span></blockquote>should I  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; buy them for them on a whim?  I don&#39;t see how that is a MUST for  <br/>\n&gt; &gt; radical unschooling.  If there is something she consistently <br/>\n </span></blockquote>wants  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; then yes I try to provide those things for her.  Meaning if she <br/>\n </span></blockquote>has  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; to have a certain game and asks for it on more than a few <br/>\n </span></blockquote>occasions,  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; not on a whim or because of a cool commercial,  then I say ok <br/>\n </span></blockquote>let&#39;s  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; check that out next time we are at the store,  But if I bought  <br/>\n&gt; &gt; everything my daughter asked for we wuld have no room in the <br/>\n </span></blockquote>house.   <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Literally, from ball pits, to pinball machines, air hockey <br/>\n </span></blockquote>tables  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; etc.     So when do you say no Robin, if you are able to afford <br/>\n </span></blockquote>it  <br/>\n<blockquote><span title=\"qreply\"> &gt; &gt; but think it is too much?<br/>\n&gt; &gt; Meridith<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh","postDate":"1231191646","msgId":37600,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBRDkzMDhDLUFDOEYtNEI2Ri04OTY4LTQ2RjYxM0MxRDIwMkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDM1NTgwMi41MTE0MC5xbUB3ZWI1MTcwOS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDM1NTgwMi41MTE0MC5xbUB3ZWI1MTcwOS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":37599,"nextInTopic":37601,"prevInTime":37599,"nextInTime":37601,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"... I d like to hear what Schuyler has to say about this... :-) ... Sure, if her son is ready (and it seems from his suggestion that everyone do chores and","messageBody":"<div id=\"ygrps-yiv-347964963\">On Jan 5, 2009, at 12:42 PM, Meridith Richardson wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; true and natural it has been since the beginning of time where  <br/>\n&gt; anthropology can show us how humans shared &quot;chores&quot; to make sure  <br/>\n&gt; life continued.  I am a rawist because I think at our most natural  <br/>\n&gt; of states that is how we ate..<br/>\n<br/>\n </span></blockquote>I&#39;d like to hear what Schuyler has to say about this... :-)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I also think at appropriate times children will come to the point  <br/>\n&gt; that they desire/need to be a part of subsistence.  If you feel your  <br/>\n&gt; son is ready than I agree with your decision.<br/>\n<br/>\n </span></blockquote>Sure, if her son is ready (and it seems from his suggestion that  <br/>\neveryone do chores and he&#39;s willing to do them ,that he is) that&#39;s  <br/>\ngreat. But, the fact that he only gets allowance if he does chores  <br/>\njust doesn&#39;t make a lot of sense to me. He obviously would like some  <br/>\nmoney. Why not give him some, aside from household duties?<br/>\n<br/>\nIt requires a shift in perspective to see how this can work.<br/>\n<br/>\nCheck out this page:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chore/shift\">http://sandradodd.com/chore/shift</a><br/>\n<br/>\nRobin B.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving toward more peaceful parenting Robin","postDate":"1231191254","msgId":37599,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4RjREQzg1LTUxOTYtNEE3Qy04NTY3LUQ1Q0VGM0RDNTI4MkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDExNjczMy4yMzk5NC5xbUB3ZWI1MTcxMS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDExNjczMy4yMzk5NC5xbUB3ZWI1MTcxMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":37597,"nextInTopic":37600,"prevInTime":37598,"nextInTime":37600,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"I didn t say never say no. I also didn t say buy them whatever they want, whenever they want it.  If you walk through Walmart and a child wants 7 or 8","messageBody":"<div id=\"ygrps-yiv-1327025701\">I didn&#39;t say &quot;never say no.&quot; I also didn&#39;t say &quot;buy them whatever they  <br/>\nwant, whenever they want it.&quot; &lt;g&gt;<br/>\n<br/>\nIf you walk through Walmart and a child wants 7 or 8 different toys at  <br/>\nonce EVERY TIME (does this happen in your house?), what do you do?  <br/>\nPerhaps, I would say &quot;I have enough to buy x. How about we choose one  <br/>\nnow and we&#39;ll put the others on your wish list. We can get them as  <br/>\nsoon as we can.&quot; This honors a kid&#39;s desire for the item, and  <br/>\nexpresses the parent&#39;s desire to help them get it. You could even pick  <br/>\n7 or 8 $1.00 items, if it&#39;s sheer volume she&#39;s looking for &lt;g&gt;.<br/>\n<br/>\nIf it happens every time and the visual stimulation of all those toys  <br/>\nis too much, can you go shopping without your daughter? You could even  <br/>\npick up one of the desired items and bring it home, as a surprise one  <br/>\nday. How much fun would that be for her?<br/>\n<br/>\nHas your daughter played pinball, played in ball pits, played air  <br/>\nhockey? Does she want to? You could find ways for her to experience  <br/>\nthose things without having to buy them for your home.<br/>\n<br/>\nI believe it&#39;s important to really think about whether &quot;it&#39;s too much&quot;  <br/>\nif you can afford it. Is it too much money? Is it too much stuff? Is  <br/>\nit too much for you? Motivation is good to explore.<br/>\n<br/>\nAnd, as I said &quot;It doesn&#39;t mean we don&#39;t talk to them about the wisdom  <br/>\nof purchases or alternatives.&quot; Maybe not when a child is melting down  <br/>\nat the store, if that happens, but some other opportunity. Help them  <br/>\nmake choices and decisions. It will help the next time.<br/>\n<br/>\nMy daughter, now 13, is great to shop with now. She gets an allowance,  <br/>\nnot tied to chores. We determined about how much we would normally  <br/>\nspend per month on things other than food and clothes and gave it to  <br/>\nher each pay day. When our income was reduced, we talked to her about  <br/>\nreducing her allowance. She was really cool with that. Sometimes, she  <br/>\ndoesn&#39;t spend any of it. Sometimes, all of it. Sometimes, she asks for  <br/>\nan advance and if we can do it, we do.<br/>\n<br/>\nBefore we approached it this way, and she had a small allowance ($1  <br/>\nper age per week) when she was younger, it was difficult because  <br/>\nthings she wanted were more expensive than, say, $7. She was not a  <br/>\nsaver and  nothing we did helped her do that. I would spend money on  <br/>\nthings she wanted, try to make her feel guilty for it, while I felt  <br/>\nresentful that she couldn&#39;t stick to a budget. Who was I kidding? I  <br/>\nhave trouble with that!  So, we came up with the solution of giving  <br/>\nher generally what we&#39;d spend anyway. It&#39;s so easy now.<br/>\n<br/>\nWith a decent amount of money that is her own, she makes her own  <br/>\ndecisions, some good, some bad. But, she doesn&#39;t have me making her  <br/>\ndecisions for her. I can give her my opinion. Sometimes, she takes my  <br/>\nadvice, sometimes she doesn&#39;t. It makes for a more peaceful  <br/>\nrelationship.<br/>\n<br/>\nIf there is a compelling reason to say no (ie. for safety reasons,  <br/>\nhaving to sell your house to accommodate the item &lt;g&gt;), children can  <br/>\nmore easily understand that &quot;no&quot; than when a &quot;no&quot; comes seemingly  <br/>\narbitrarily (at least from the child&#39;s perspective).<br/>\n<br/>\nRobin B.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jan 5, 2009, at 11:48 AM, Meridith Richardson wrote:<br/>\n<br/>\n&gt;<br/>\n&gt; How do you tell a child no then?  Will it not create a sense of  <br/>\n&gt; entitlement in child if when you walk through walmart they want 7 or  <br/>\n&gt; 8 different toys at once EVERY TIME, and you buy them.  Why should I  <br/>\n&gt; buy them for them on a whim?  I don&#39;t see how that is a MUST for  <br/>\n&gt; radical unschooling.  If there is something she consistently wants  <br/>\n&gt; then yes I try to provide those things for her.  Meaning if she has  <br/>\n&gt; to have a certain game and asks for it on more than a few occasions,  <br/>\n&gt; not on a whim or because of a cool commercial,  then I say ok let&#39;s  <br/>\n&gt; check that out next time we are at the store,  But if I bought  <br/>\n&gt; everything my daughter asked for we wuld have no room in the house.   <br/>\n&gt; Literally, from ball pits, to pinball machines, air hockey tables  <br/>\n&gt; etc.     So when do you say no Robin, if you are able to afford it  <br/>\n&gt; but think it is too much?<br/>\n&gt; Meridith<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":334729351,"authorName":"Erin","from":"&quot;Erin&quot; &lt;theburkemommy@...&gt;","profile":"theburkemommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Moving toward more peaceful parenting and help with dh","postDate":"1231190380","msgId":37601,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdqdHRoYytzM2xlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDcyOTA2Ny4yMzQ1Mi5xbUB3ZWI1MTcwMi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":37600,"nextInTopic":37602,"prevInTime":37600,"nextInTime":37602,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"Hi, Meridith!  I don t know if what we do is totally in line with the RU philosophy, but I ll share it anyway!  We give our kids an allowance every week.  They","messageBody":"<div id=\"ygrps-yiv-1706202658\">Hi, Meridith!  I don&#39;t know if what we do is totally in line with the <br/>\nRU philosophy, but I&#39;ll share it anyway!  We give our kids an <br/>\nallowance every week.  They get their allowance because they are part <br/>\nof our family.  We don&#39;t require them to do chores or behave in a <br/>\ncertain manner to &quot;earn&quot; their allowance.  <br/>\n<br/>\nMy 14 year olds get $14 a week, my 12 year old gets $12 a week, and <br/>\non and on!  I buy the children things like food and clothing, I pay <br/>\nfor any sport or other extra-curricular activities, and I also buy <br/>\nthem other things here and there when I can.  Basically, by us giving <br/>\nthe kids an allowance, they have access to their portion of the <br/>\nfamily income.  <br/>\n<br/>\nI do not buy every toy or item they ask for at the store.  I simply <br/>\nsuggest we look to see how much money they have.  If they have enough <br/>\nmoney and they want the thing they&#39;re asking for enough...they buy <br/>\nit.  If they don&#39;t have enough money I help them figure out how long <br/>\nit will be until they&#39;ll have enough money to buy it.  <br/>\n<br/>\nThat is what we&#39;re doing.  I don&#39;t think there is only one way to do <br/>\nthis.  Every family and every situation is different.  What works for <br/>\none family may or may not work for others.  I think many of us are <br/>\nliving on one income and there is a budget we need to adhere to.  I <br/>\nlike the idea of my kids having the ability to spend their money when <br/>\nthey want and how they want.<br/>\n<br/>\n<br/>\n    <br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Meridith Richardson <br/>\n&lt;ruttegar@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I think if he asks for ways to earn money that is fine.  Then <br/>\n </span></blockquote>provide it if you can.  I don&#39;t think we have to hand out free money <br/>\nto show our love.  BUt forcing him to do chores does not seem <br/>\nappropriate for the environment.  I do all the house work here and <br/>\nsometimes I have asked her to help clean her toys but if she does not <br/>\nthen I do it without yelling.  I hope at some point she will find joy <br/>\nin helping others like i do.  But she has asked me, &quot;how can I earn <br/>\nsome money.&#39;  I said would you like to do some things I do around the <br/>\nhouse and she said yes.  So I told her some options she did some and <br/>\nI paid her.  Her choice, just like my choice to work.  Do you all who <br/>\noppose allowances hand out money to your kids for everything fun they <br/>\nwant, or do you only buy needs and occasional wants?<br/>\n<blockquote><span title=\"ireply\"> &gt; Meridith<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; --- On Mon, 1/5/09, Schuyler &lt;s.waynforth@...&gt; wrote:<br/>\n&gt; <br/>\n&gt; From: Schuyler &lt;s.waynforth@...&gt;<br/>\n&gt; Subject: Re: [unschoolingbasics] Moving toward more peaceful <br/>\n </span></blockquote>parenting and help with dh<br/>\n<blockquote><span title=\"ireply\"> &gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n&gt; Date: Monday, January 5, 2009, 11:51 AM<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I think the difference between not feeling coerced by your boss <br/>\n </span></blockquote>versus feeling that paying your children a job based salary is <br/>\ninnappropriate is that your relationship with your boss is clearly <br/>\ndefined from the off as a work for pay deal. With your children the <br/>\nmoney for chores thing is something that you are adding to the mix in <br/>\nsome sort of strange desire to set yourself up as their boss. You are <br/>\ncreating an unnatural environment within your home. And damaging your <br/>\nrelationship as their parent in the process. <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Schuyler<br/>\n&gt; <br/>\n&gt; To the allowance issue - we do give Micah an allowance based on <br/>\n </span></blockquote>chores. The rationale behind it is that both DH and I work for our <br/>\nmoney, and that&#39;s the way the world works. No one is just handing us <br/>\nmoney simply for being there. So I feel OK about the allowance for <br/>\nchores thing. We all discussed it, and we have a list of what needs <br/>\nto be done in the house. Each of us chooses which chores to do. If <br/>\nthe chore one person wanted to do is already done, that person needs <br/>\nto choose something else. That way I&#39;m not dictating what needs to be <br/>\ndone by whom, but everything gets done. If he doesn&#39;t do any chores, <br/>\nno allowance for that day. We also pay on my paydays, with a note <br/>\nsaying what he gets and why he may or may not have gotten a certain <br/>\namount. <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I struggled with this a lot. I wanted him to learn the value of <br/>\n </span></blockquote>work and money, and I wanted him to be responsible for his own debts <br/>\n(WoW, XBox Live, etc.). I don&#39;t make him pay for clothing or food, <br/>\nsince we (DH and I) pool our money to cover all those expenses. <br/>\nUnless, of course, he wants something he doesn&#39;t really need - like <br/>\nexpensive sneakers or $75 jeans. We base what he needs on whether he <br/>\nhas something that is a reasonable substitute. If he has three pairs <br/>\nof sneakers, he doesn&#39;t need new ones, for example.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I don&#39;t consider the allowance thing to be coercive, any more than <br/>\n </span></blockquote>I feel coerced at the grocery store to pay for my purchases or by my <br/>\nboss for having to come in to work to get the paycheck. I think it&#39;s <br/>\njust a part of life.<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; Debbie (in Indiana)<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;       <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":184022346,"authorName":"Meridith Richardson","from":"Meridith Richardson &lt;ruttegar@...&gt;","profile":"ruttegar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh","postDate":"1231188120","msgId":37597,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM1NTgwMi41MTE0MC5xbUB3ZWI1MTcwOS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDBBNjNCNDZCMDg5MTQ2QUU5NjA2RjZFNTIwMTlFNzVDQGNlbnRyYWwucHVyZHVlLmxjbD4="},"prevInTopic":37596,"nextInTopic":37599,"prevInTime":37596,"nextInTime":37598,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"true and natural it has been since the beginning of time where anthropology can show us how humans shared chores to make sure life continued.  I am a rawist","messageBody":"<div id=\"ygrps-yiv-536916767\">true and natural it has been since the beginning of time where anthropology can show us how humans shared &quot;chores&quot; to make sure life continued.  I am a rawist because I think at our most natural of states that is how we ate.  I also think at appropriate times children will come to the point that they desire/need to be a part of subsistence.  If you feel your son is ready than I agree with your decision.  <br/>\nMeridith<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Mon, 1/5/09, Deborah Resnick &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:deborah.resnick@...\">deborah.resnick@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Deborah Resnick &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:deborah.resnick@...\">deborah.resnick@...</a>&gt;<br/>\nSubject: Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Monday, January 5, 2009, 3:02 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI agree. We sat down with Micah and asked him what he though (he&#39;s 14). He thought that everyone should participate in chores so that no one person had to do everything. After that discussion, he raised the question of an allowance, and he actually was the one who suggested pay for chores. But I agreed with his logic.<br/>\n<br/>\nWhat is unnatural about contributing to the upkeep of your home and family? I would venture a guess that everyone on this list does something to contribute to the family whether it is income generating or not. Even if it&#39;s just vacuuming or doing the dishes. I know that we parents don&#39;t get paid to do those things, but Micah felt it was appropriate in his situation. <br/>\n<br/>\n----- Original Message ----- <br/>\nFrom: Schuyler <br/>\nTo: unschoolingbasics@ yahoogroups. com <br/>\nSent: Monday, January 05, 2009 11:51 AM<br/>\nSubject: Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh<br/>\n<br/>\nI think the difference between not feeling coerced by your boss versus feeling that paying your children a job based salary is innappropriate is that your relationship with your boss is clearly defined from the off as a work for pay deal. With your children the money for chores thing is something that you are adding to the mix in some sort of strange desire to set yourself up as their boss. You are creating an unnatural environment within your home. And damaging your relationship as their parent in the process. <br/>\n<br/>\nSchuyler<br/>\n<br/>\nTo the allowance issue - we do give Micah an allowance based on chores. The rationale behind it is that both DH and I work for our money, and that&#39;s the way the world works. No one is just handing us money simply for being there. So I feel OK about the allowance for chores thing. We all discussed it, and we have a list of what needs to be done in the house. Each of us chooses which chores to do. If the chore one person wanted to do is already done, that person needs to choose something else. That way I&#39;m not dictating what needs to be done by whom, but everything gets done. If he doesn&#39;t do any chores, no allowance for that day. We also pay on my paydays, with a note saying what he gets and why he may or may not have gotten a certain amount. <br/>\n<br/>\nI struggled with this a lot. I wanted him to learn the value of work and money, and I wanted him to be responsible for his own debts (WoW, XBox Live, etc.). I don&#39;t make him pay for clothing or food, since we (DH and I) pool our money to cover all those expenses. Unless, of course, he wants something he doesn&#39;t really need - like expensive sneakers or $75 jeans. We base what he needs on whether he has something that is a reasonable substitute. If he has three pairs of sneakers, he doesn&#39;t need new ones, for example.<br/>\n<br/>\nI don&#39;t consider the allowance thing to be coercive, any more than I feel coerced at the grocery store to pay for my purchases or by my boss for having to come in to work to get the paycheck. I think it&#39;s just a part of life.<br/>\n<br/>\nDebbie (in Indiana)<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":197788288,"authorName":"Deborah Resnick","from":"&quot;Deborah Resnick&quot; &lt;deborah.resnick@...&gt;","profile":"deborahresnick","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh","postDate":"1231185730","msgId":37596,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBBNjNCNDZCMDg5MTQ2QUU5NjA2RjZFNTIwMTlFNzVDQGNlbnRyYWwucHVyZHVlLmxjbD4=","referencesHeader":"PDk1NDMzNC4xNzM3OC5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":37595,"nextInTopic":37597,"prevInTime":37595,"nextInTime":37597,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"I agree.  We sat down with Micah and asked him what he though (he s 14).  He thought that everyone should participate in chores so that no one person had to do","messageBody":"<div id=\"ygrps-yiv-1947154602\">I agree.  We sat down with Micah and asked him what he though (he&#39;s 14).  He thought that everyone should participate in chores so that no one person had to do everything.  After that discussion, he raised the question of an allowance, and he actually was the one who suggested pay for chores.  But I agreed with his logic.<br/>\n<br/>\nWhat is unnatural about contributing to the upkeep of your home and family?  I would venture a guess that everyone on this list does something to contribute to the family whether it is income generating or not.  Even if it&#39;s just vacuuming or doing the dishes.  I know that we parents don&#39;t get paid to do those things, but Micah felt it was appropriate in his situation.  <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Schuyler <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Monday, January 05, 2009 11:51 AM<br/>\n  Subject: Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  I think the difference between not feeling coerced by your boss versus feeling that paying your children a job based salary is innappropriate is that your relationship with your boss is clearly defined from the off as a work for pay deal. With your children the money for chores thing is something that you are adding to the mix in some sort of strange desire to set yourself up as their boss. You are creating an unnatural environment within your home. And damaging your relationship as their parent in the process. <br/>\n<br/>\n  Schuyler<br/>\n<br/>\n  To the allowance issue - we do give Micah an allowance based on chores. The rationale behind it is that both DH and I work for our money, and that&#39;s the way the world works. No one is just handing us money simply for being there. So I feel OK about the allowance for chores thing. We all discussed it, and we have a list of what needs to be done in the house. Each of us chooses which chores to do. If the chore one person wanted to do is already done, that person needs to choose something else. That way I&#39;m not dictating what needs to be done by whom, but everything gets done. If he doesn&#39;t do any chores, no allowance for that day. We also pay on my paydays, with a note saying what he gets and why he may or may not have gotten a certain amount. <br/>\n<br/>\n  I struggled with this a lot. I wanted him to learn the value of work and money, and I wanted him to be responsible for his own debts (WoW, XBox Live, etc.). I don&#39;t make him pay for clothing or food, since we (DH and I) pool our money to cover all those expenses. Unless, of course, he wants something he doesn&#39;t really need - like expensive sneakers or $75 jeans. We base what he needs on whether he has something that is a reasonable substitute. If he has three pairs of sneakers, he doesn&#39;t need new ones, for example.<br/>\n<br/>\n  I don&#39;t consider the allowance thing to be coercive, any more than I feel coerced at the grocery store to pay for my purchases or by my boss for having to come in to work to get the paycheck. I think it&#39;s just a part of life.<br/>\n<br/>\n  Debbie (in Indiana)<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":184022346,"authorName":"Meridith Richardson","from":"Meridith Richardson &lt;ruttegar@...&gt;","profile":"ruttegar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Moving toward more peaceful parenting Robin","postDate":"1231184923","msgId":37595,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExNjczMy4yMzk5NC5xbUB3ZWI1MTcxMS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PEIzM0U4MTZCLUQ3QkEtNERGQS1BOUQxLTFFMzlFMzcwRkE3QUBjb21jYXN0Lm5ldD4="},"prevInTopic":37594,"nextInTopic":37596,"prevInTime":37594,"nextInTime":37596,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"How do you tell a child no then?  Will it not create a sense of entitlement in child if when you walk through walmart they want 7 or 8 different toys at","messageBody":"<div id=\"ygrps-yiv-418566329\">How do you tell a child no then?  Will it not create a sense of entitlement in child if when you walk through walmart they want 7 or 8 different toys at once EVERY TIME, and you buy them.  Why should I buy them for them on a whim?  I don&#39;t see how that is a MUST for radical unschooling.  If there is something she consistently wants then yes I try to provide those things for her.  Meaning if she has to have a certain game and asks for it on more than a few occasions, not on a whim or because of a cool commercial,  then I say ok let&#39;s check that out next time we are at the store,  But if I bought everything my daughter asked for we wuld have no room in the house.  Literally, from ball pits, to pinball machines, air hockey tables etc.     So when do you say no Robin, if you are able to afford it but think it is too much?  <br/>\nMeridith<br/>\n <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Mon, 1/5/09, Robin Bentley &lt;robin.bentley@...&gt; wrote:<br/>\n<br/>\nFrom: Robin Bentley &lt;robin.bentley@...&gt;<br/>\nSubject: Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh<br/>\nTo: unschoolingbasics@yahoogroups.com<br/>\nDate: Monday, January 5, 2009, 2:40 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&gt; To the allowance issue - we do give Micah an allowance based on <br/>\n&gt; chores. The rationale behind it is that both DH and I work for our <br/>\n&gt; money, and that&#39;s the way the world works. No one is just handing <br/>\n&gt; us money simply for being there. So I feel OK about the allowance <br/>\n&gt; for chores thing.<br/>\n<br/>\nFor an unschooling perspective on this, read Joyce Fetterol&#39;s page:<br/>\n<br/>\nhttp://joyfullyrejo ycing.com/ influencing% 20kid%20behavior /chores/tyingall owancetochores. html<br/>\n<br/>\n&gt; We all discussed it, and we have a list of what needs to be done in <br/>\n&gt; the house. Each of us chooses which chores to do. If the chore one <br/>\n&gt; person wanted to do is already done, that person needs to choose <br/>\n&gt; something else. That way I&#39;m not dictating what needs to be done by <br/>\n&gt; whom, but everything gets done. If he doesn&#39;t do any chores, no <br/>\n&gt; allowance for that day. We also pay on my paydays, with a note <br/>\n&gt; saying what he gets and why he may or may not have gotten a certain <br/>\n&gt; amount.<br/>\n<br/>\nThe responsibility for keeping the house belongs to the adults. Yes, <br/>\nyou can ask for help. But kids are not here to do our jobs. We adults <br/>\ndon&#39;t get paid for housework, yet we do it because we want a certain <br/>\nlevel of cleanliness or tidiness. To expect children to have the same <br/>\nperspective as we do about how a home should look doesn&#39;t make sense. <br/>\nModelling how you would like things to be has more impact in the long <br/>\nrun.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I struggled with this a lot. I wanted him to learn the value of <br/>\n&gt; work and money, and I wanted him to be responsible for his own debts <br/>\n&gt; (WoW, XBox Live, etc.). I don&#39;t make him pay for clothing or food, <br/>\n&gt; since we (DH and I) pool our money to cover all those expenses. <br/>\n&gt; Unless, of course, he wants something he doesn&#39;t really need - like <br/>\n&gt; expensive sneakers or $75 jeans. We base what he needs on whether <br/>\n&gt; he has something that is a reasonable substitute. If he has three <br/>\n&gt; pairs of sneakers, he doesn&#39;t need new ones, for example.<br/>\n<br/>\nSo, these are learning goals *you* have for him.<br/>\n<br/>\nIf it&#39;s a matter of not being able to afford what he wants right now, <br/>\nyou could help him find a way to save for it. Or you could save for <br/>\nit. If you are just determining what is a want vs. a need makes his <br/>\ndesires unimportant, or worse, worthless. Calling what makes his life <br/>\nhappy as &quot;debts&quot; makes me cringe. As Schuyler said, not a relationship- <br/>\nbuilding situation.<br/>\n<br/>\nPart of unschooling is helping our kids get what they want and need. <br/>\nIt doesn&#39;t mean we don&#39;t talk to them about the wisdom of purchases or <br/>\nalternatives, but they should be able to choose the $75 jeans, <br/>\nespecially if they have had a chance to consider the choices. Deciding <br/>\nfor him what is a want, not a need, doesn&#39;t help him learn to make <br/>\ngood choices.<br/>\n&gt;<br/>\n&gt; I don&#39;t consider the allowance thing to be coercive, any more than I <br/>\n&gt; feel coerced at the grocery store to pay for my purchases or by my <br/>\n&gt; boss for having to come in to work to get the paycheck. I think <br/>\n&gt; it&#39;s just a part of life.<br/>\n<br/>\nPart of *your* life. It will be part of his life, eventually. Right <br/>\nnow, you are responsible, as the parent, for providing for him, not <br/>\nmaking him work for what he wants. I don&#39;t know how that would <br/>\n*teach* responsibility without resentment.<br/>\n&gt;<br/>\nRobin B.<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":197788288,"authorName":"Deborah Resnick","from":"&quot;Deborah Resnick&quot; &lt;deborah.resnick@...&gt;","profile":"deborahresnick","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Moving toward more peaceful parenting and help with dh","postDate":"1231184577","msgId":37594,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENENjUzQTY4MDc2RjRFMzdBRUQzOURFMEZBQjVDQjk1QGNlbnRyYWwucHVyZHVlLmxjbD4=","referencesHeader":"PGdqdGVmOSs4cHY4QGVHcm91cHMuY29tPg=="},"prevInTopic":37592,"nextInTopic":37595,"prevInTime":37593,"nextInTime":37595,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"I feel that since our kids do have to live in the real world, and one of the reasons I unschool/homeschool is to make sure that he gets that real world","messageBody":"<div id=\"ygrps-yiv-946558240\">I feel that since our kids do have to live in the real world, and one of the reasons I unschool/homeschool is to make sure that he gets that real world exposure, the way I&#39;m doing things is appropriate for our family.  I would LOVE to choose not to work, but I would also have to choose not to eat, or wear clothes, or have a warm, dry place to sleep.  It&#39;s not really a question of holding a job, it&#39;s the really about the process of obtaining funds in return for labor/services.  Even your friends who choose not to work for someone else have to do something to get money to live on, unless perhaps they live with you?<br/>\n<br/>\nMicah has the same choices at home that he would if he were out on his own - make decisions on purchases/finances based on real world needs.  If he needs something, we talk and decide how it will be acquired.  I don&#39;t think that kids (or adults) should rule the house - I think it&#39;s a joint venture.<br/>\n<br/>\nAs to my choosing to bring him into the world, that&#39;s true.  But I don&#39;t choose to support him for his entire life, although you may feel that&#39;s acceptable for your family.  I have five children who are grown and out in the world.  They&#39;re independent and happy.  That&#39;s my hope for Micah at the appropriate time for him, and for us.<br/>\n<br/>\nDebbie in IN<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\n  From: carenkh <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Monday, January 05, 2009 12:02 PM<br/>\n  Subject: [unschoolingbasics] Re: Moving toward more peaceful parenting and help with dh<br/>\n<br/>\n<br/>\n  I have no desire, in the least, for our home to work like the world.<br/>\n  School is also how the world works - why don&#39;t I make my kids do<br/>\n  schoolwork? Bullying and getting beaten are also how the world works<br/>\n  for many - why don&#39;t I do those with my kids? Because those are parts<br/>\n  of the world that don&#39;t work for us.<br/>\n<br/>\n  An adult CHOOSES to go to work for income; it&#39;s a choice. I have<br/>\n  friends who choose not to do that, they earn income other ways, or<br/>\n  they live on very little. You CHOSE to bring your child into the<br/>\n  world. What you are not offering that the real world offers is CHOICE.<br/>\n  I hear you saying &quot;it is a choice, Micah can get allowance or not&quot;.<br/>\n  But limiting what you will purchase otherwise is NOT Micah&#39;s choice. <br/>\n<br/>\n  Caren<br/>\n<br/>\n  --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Deborah Resnick&quot;<br/>\n  &lt;deborah.resnick@...&gt; wrote:<br/>\n  &gt;<br/>\n  &gt; To the allowance issue - we do give Micah an allowance based on<br/>\n  chores. The rationale behind it is that both DH and I work for our<br/>\n  money, and that&#39;s the way the world works.<br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh","postDate":"1231184434","msgId":37591,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIzM0U4MTZCLUQ3QkEtNERGQS1BOUQxLTFFMzlFMzcwRkE3QUBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PEM5QkFGNTZDMTRFMTQ0Q0VBMUY4Qjc1N0U5RTIxRkRBQGNlbnRyYWwucHVyZHVlLmxjbD4=","referencesHeader":"PDkyNGM0ZDBhMDkwMTAzMDgzNnczZGNmNzNlZHg3NjdjYjM4NzFhYmY0MjFhQG1haWwuZ21haWwuY29tPiA8Mjg5NkMyREEtM0ZFNy00OTMxLUIxREQtMkZBQzBCRTEyOUQ5QGNvbWNhc3QubmV0PiA8OTI0YzRkMGEwOTAxMDUwNDI5cDUzM2UxNmMxcWJlM2JkYTA2M2Q0Zjg3MDRAbWFpbC5nbWFpbC5jb20+IDxDOUJBRjU2QzE0RTE0NENFQTFGOEI3NTdFOUUyMUZEQUBjZW50cmFsLnB1cmR1ZS5sY2w+"},"prevInTopic":37589,"nextInTopic":37592,"prevInTime":37590,"nextInTime":37592,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"... For an unschooling perspective on this, read Joyce Fetterol s page: ","messageBody":"<div id=\"ygrps-yiv-1619326882\"><blockquote><span title=\"ireply\">&gt; To the allowance issue - we do give Micah an allowance based on  <br/>\n&gt; chores.  The rationale behind it is that both DH and I work for our  <br/>\n&gt; money, and that&#39;s the way the world works.  No one is just handing  <br/>\n&gt; us money simply for being there.  So I feel OK about the allowance  <br/>\n&gt; for chores thing.<br/>\n<br/>\n </span></blockquote>For an unschooling perspective on this, read Joyce Fetterol&#39;s page:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/influencing%20kid%20behavior/chores/tyingallowancetochores.html\">http://joyfullyrejoycing.com/influencing%20kid%20behavior/chores/tyingallowancetochores.html</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We all discussed it, and we have a list of what needs to be done in  <br/>\n&gt; the house.  Each of us chooses which chores to do.  If the chore one  <br/>\n&gt; person wanted to do is already done, that person needs to choose  <br/>\n&gt; something else.  That way I&#39;m not dictating what needs to be done by  <br/>\n&gt; whom, but everything gets done.  If he doesn&#39;t do any chores, no  <br/>\n&gt; allowance for that day.  We also pay on my paydays, with a note  <br/>\n&gt; saying what he gets and why he may or may not have gotten a certain  <br/>\n&gt; amount.<br/>\n<br/>\n </span></blockquote>The responsibility for keeping the house belongs to the adults. Yes,  <br/>\nyou can ask for help. But kids are not here to do our jobs. We adults  <br/>\ndon&#39;t get paid for housework, yet we do it because we want a certain  <br/>\nlevel of cleanliness or tidiness. To expect children to have the same  <br/>\nperspective as we do about how a home should look doesn&#39;t make sense.  <br/>\nModelling how you would like things to be has more impact in the long  <br/>\nrun.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; I struggled with this a lot.  I wanted him to learn the value of  <br/>\n&gt; work and money, and I wanted him to be responsible for his own debts  <br/>\n&gt; (WoW, XBox Live, etc.).  I don&#39;t make him pay for clothing or food,  <br/>\n&gt; since we (DH and I) pool our money to cover all those expenses.   <br/>\n&gt; Unless, of course, he wants something he doesn&#39;t really need - like  <br/>\n&gt; expensive sneakers or $75 jeans.  We base what he needs on whether  <br/>\n&gt; he has something that is a reasonable substitute.  If he has three  <br/>\n&gt; pairs of sneakers, he doesn&#39;t need new ones, for example.<br/>\n<br/>\n </span></blockquote>So, these are learning goals *you* have for him.<br/>\n<br/>\nIf it&#39;s a matter of not being able to afford what he wants right now,  <br/>\nyou could help him find a way to save for it. Or you could save for  <br/>\nit. If you are just determining what is a want vs. a need makes his  <br/>\ndesires unimportant, or worse, worthless. Calling what makes his life  <br/>\nhappy as &quot;debts&quot; makes me cringe. As Schuyler said, not a relationship- <br/>\nbuilding situation.<br/>\n<br/>\nPart of unschooling is helping our kids get what they want and need.  <br/>\nIt doesn&#39;t mean we don&#39;t talk to them about the wisdom of purchases or  <br/>\nalternatives, but they should be able to choose the $75 jeans,  <br/>\nespecially if they have had a chance to consider the choices. Deciding  <br/>\nfor him what is a want, not a need, doesn&#39;t help him learn to make  <br/>\ngood choices.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I don&#39;t consider the allowance thing to be coercive, any more than I  <br/>\n&gt; feel coerced at the grocery store to pay for my purchases or by my  <br/>\n&gt; boss for having to come in to work to get the paycheck.  I think  <br/>\n&gt; it&#39;s just a part of life.<br/>\n<br/>\n </span></blockquote>Part of *your* life. It will be part of his life, eventually. Right  <br/>\nnow, you are responsible, as the parent, for providing for him, not  <br/>\nmaking him work for what he wants.  I don&#39;t know how that would  <br/>\n*teach* responsibility without resentment.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>Robin B.</div>","specialLinks":[]},{"userId":184022346,"authorName":"Meridith Richardson","from":"Meridith Richardson &lt;ruttegar@...&gt;","profile":"ruttegar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh","postDate":"1231178017","msgId":37592,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcyOTA2Ny4yMzQ1Mi5xbUB3ZWI1MTcwMi5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDk1NDMzNC4xNzM3OC5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":37591,"nextInTopic":37594,"prevInTime":37591,"nextInTime":37593,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"I think if he asks for ways to earn money that is fine.  Then provide it if you can.  I don t think we have to hand out free money to show our love.  BUt","messageBody":"<div id=\"ygrps-yiv-1978333612\">I think if he asks for ways to earn money that is fine.  Then provide it if you can.  I don&#39;t think we have to hand out free money to show our love.  BUt forcing him to do chores does not seem appropriate for the environment.  I do all the house work here and sometimes I have asked her to help clean her toys but if she does not then I do it without yelling.  I hope at some point she will find joy in helping others like i do.  But she has asked me, &quot;how can I earn some money.&#39;  I said would you like to do some things I do around the house and she said yes.  So I told her some options she did some and I paid her.  Her choice, just like my choice to work.  Do you all who oppose allowances hand out money to your kids for everything fun they want, or do you only buy needs and occasional wants?<br/>\nMeridith<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Mon, 1/5/09, Schuyler &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Schuyler &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt;<br/>\nSubject: Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Monday, January 5, 2009, 11:51 AM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI think the difference between not feeling coerced by your boss versus feeling that paying your children a job based salary is innappropriate is that your relationship with your boss is clearly defined from the off as a work for pay deal. With your children the money for chores thing is something that you are adding to the mix in some sort of strange desire to set yourself up as their boss. You are creating an unnatural environment within your home. And damaging your relationship as their parent in the process. <br/>\n<br/>\nSchuyler<br/>\n<br/>\nTo the allowance issue - we do give Micah an allowance based on chores. The rationale behind it is that both DH and I work for our money, and that&#39;s the way the world works. No one is just handing us money simply for being there. So I feel OK about the allowance for chores thing. We all discussed it, and we have a list of what needs to be done in the house. Each of us chooses which chores to do. If the chore one person wanted to do is already done, that person needs to choose something else. That way I&#39;m not dictating what needs to be done by whom, but everything gets done. If he doesn&#39;t do any chores, no allowance for that day. We also pay on my paydays, with a note saying what he gets and why he may or may not have gotten a certain amount. <br/>\n<br/>\nI struggled with this a lot. I wanted him to learn the value of work and money, and I wanted him to be responsible for his own debts (WoW, XBox Live, etc.). I don&#39;t make him pay for clothing or food, since we (DH and I) pool our money to cover all those expenses. Unless, of course, he wants something he doesn&#39;t really need - like expensive sneakers or $75 jeans. We base what he needs on whether he has something that is a reasonable substitute. If he has three pairs of sneakers, he doesn&#39;t need new ones, for example.<br/>\n<br/>\nI don&#39;t consider the allowance thing to be coercive, any more than I feel coerced at the grocery store to pay for my purchases or by my boss for having to come in to work to get the paycheck. I think it&#39;s just a part of life.<br/>\n<br/>\nDebbie (in Indiana)<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":151505017,"authorName":"carenkh","from":"&quot;carenkh&quot; &lt;carenkh@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Moving toward more peaceful parenting and help with dh","postDate":"1231174953","msgId":37589,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdqdGVmOSs4cHY4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEM5QkFGNTZDMTRFMTQ0Q0VBMUY4Qjc1N0U5RTIxRkRBQGNlbnRyYWwucHVyZHVlLmxjbD4="},"prevInTopic":37588,"nextInTopic":37591,"prevInTime":37588,"nextInTime":37590,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"I have no desire, in the least, for our home to work like the world. School is also how the world works - why don t I make my kids do schoolwork? Bullying and","messageBody":"<div id=\"ygrps-yiv-2104230622\">I have no desire, in the least, for our home to work like the world.<br/>\nSchool is also how the world works - why don&#39;t I make my kids do<br/>\nschoolwork? Bullying and getting beaten are also how the world works<br/>\nfor many - why don&#39;t I do those with my kids? Because those are parts<br/>\nof the world that don&#39;t work for us.<br/>\n<br/>\nAn adult CHOOSES to go to work for income; it&#39;s a choice. I have<br/>\nfriends who choose not to do that, they earn income other ways, or<br/>\nthey live on very little. You CHOSE to bring your child into the<br/>\nworld. What you are not offering that the real world offers is CHOICE.<br/>\nI hear you saying &quot;it is a choice, Micah can get allowance or not&quot;.<br/>\nBut limiting what you will purchase otherwise is NOT Micah&#39;s choice. <br/>\n<br/>\nCaren<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Deborah Resnick&quot;<br/>\n&lt;deborah.resnick@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; To the allowance issue - we do give Micah an allowance based on<br/>\n </span></blockquote>chores.  The rationale behind it is that both DH and I work for our<br/>\nmoney, and that&#39;s the way the world works.</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh","postDate":"1231174309","msgId":37588,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk1NDMzNC4xNzM3OC5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":37587,"nextInTopic":37589,"prevInTime":37587,"nextInTime":37589,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"I think the difference between not feeling coerced by your boss versus feeling that paying your children a job based salary is innappropriate is that your","messageBody":"<div id=\"ygrps-yiv-1452457488\">I think the difference between not feeling coerced by your boss versus feeling that paying your children a job based salary is innappropriate is that your relationship with your boss is clearly defined from the off as a work for pay deal. With your children the money for chores thing is something that you are adding to the mix in some sort of strange desire to set yourself up as their boss. You are creating an unnatural environment within your home. And damaging your relationship as their parent in the process. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nTo the allowance issue - we do give Micah an allowance based on chores.  The rationale behind it is that both DH and I work for our money, and that&#39;s the way the world works.  No one is just handing us money simply for being there.  So I feel OK about the allowance for chores thing.  We all discussed it, and we have a list of what needs to be done in the house.  Each of us chooses which chores to do.  If the chore one person wanted to do is already done, that person needs to choose something else.  That way I&#39;m not dictating what needs to be done by whom, but everything gets done.  If he doesn&#39;t do any chores, no allowance for that day.  We also pay on my paydays, with a note saying what he gets and why he may or may not have gotten a certain amount. <br/>\n<br/>\nI struggled with this a lot.  I wanted him to learn the value of work and money, and I wanted him to be responsible for his own debts (WoW, XBox Live, etc.).  I don&#39;t make him pay for clothing or food, since we (DH and I) pool our money to cover all those expenses.  Unless, of course, he wants something he doesn&#39;t really need - like expensive sneakers or $75 jeans.  We base what he needs on whether he has something that is a reasonable substitute.  If he has three pairs of sneakers, he doesn&#39;t need new ones, for example.<br/>\n<br/>\nI don&#39;t consider the allowance thing to be coercive, any more than I feel coerced at the grocery store to pay for my purchases or by my boss for having to come in to work to get the paycheck.  I think it&#39;s just a part of life.<br/>\n<br/>\nDebbie (in Indiana)<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n    <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":197788288,"authorName":"Deborah Resnick","from":"&quot;Deborah Resnick&quot; &lt;deborah.resnick@...&gt;","profile":"deborahresnick","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh","postDate":"1231173099","msgId":37587,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM5QkFGNTZDMTRFMTQ0Q0VBMUY4Qjc1N0U5RTIxRkRBQGNlbnRyYWwucHVyZHVlLmxjbD4=","referencesHeader":"PDkyNGM0ZDBhMDkwMTAzMDgzNnczZGNmNzNlZHg3NjdjYjM4NzFhYmY0MjFhQG1haWwuZ21haWwuY29tPiA8Mjg5NkMyREEtM0ZFNy00OTMxLUIxREQtMkZBQzBCRTEyOUQ5QGNvbWNhc3QubmV0PiA8OTI0YzRkMGEwOTAxMDUwNDI5cDUzM2UxNmMxcWJlM2JkYTA2M2Q0Zjg3MDRAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":37579,"nextInTopic":37588,"prevInTime":37586,"nextInTime":37588,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"To the allowance issue - we do give Micah an allowance based on chores.  The rationale behind it is that both DH and I work for our money, and that s the way","messageBody":"<div id=\"ygrps-yiv-1294293649\">To the allowance issue - we do give Micah an allowance based on chores.  The rationale behind it is that both DH and I work for our money, and that&#39;s the way the world works.  No one is just handing us money simply for being there.  So I feel OK about the allowance for chores thing.  We all discussed it, and we have a list of what needs to be done in the house.  Each of us chooses which chores to do.  If the chore one person wanted to do is already done, that person needs to choose something else.  That way I&#39;m not dictating what needs to be done by whom, but everything gets done.  If he doesn&#39;t do any chores, no allowance for that day.  We also pay on my paydays, with a note saying what he gets and why he may or may not have gotten a certain amount.  <br/>\n<br/>\nI struggled with this a lot.  I wanted him to learn the value of work and money, and I wanted him to be responsible for his own debts (WoW, XBox Live, etc.).  I don&#39;t make him pay for clothing or food, since we (DH and I) pool our money to cover all those expenses.  Unless, of course, he wants something he doesn&#39;t really need - like expensive sneakers or $75 jeans.  We base what he needs on whether he has something that is a reasonable substitute.  If he has three pairs of sneakers, he doesn&#39;t need new ones, for example.<br/>\n<br/>\nI don&#39;t consider the allowance thing to be coercive, any more than I feel coerced at the grocery store to pay for my purchases or by my boss for having to come in to work to get the paycheck.  I think it&#39;s just a part of life.<br/>\n<br/>\nDebbie (in Indiana)<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":217951851,"authorName":"Christie Craigie-Carter","from":"&quot;Christie Craigie-Carter&quot; &lt;craigiecarter@...&gt;","profile":"c3_2323","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh","postDate":"1231158565","msgId":37579,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyNGM0ZDBhMDkwMTA1MDQyOXA1MzNlMTZjMXFiZTNiZGEwNjNkNGY4NzA0QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDI4OTZDMkRBLTNGRTctNDkzMS1CMURELTJGQUMwQkUxMjlEOUBjb21jYXN0Lm5ldD4=","referencesHeader":"PDkyNGM0ZDBhMDkwMTAzMDgzNnczZGNmNzNlZHg3NjdjYjM4NzFhYmY0MjFhQG1haWwuZ21haWwuY29tPgkgPDI4OTZDMkRBLTNGRTctNDkzMS1CMURELTJGQUMwQkUxMjlEOUBjb21jYXN0Lm5ldD4="},"prevInTopic":37578,"nextInTopic":37587,"prevInTime":37578,"nextInTime":37580,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"That was really good, Robin, thanks.  I m still perplexed about how to reconcile moving in different directions (him wanting to give allowance for doing","messageBody":"<div id=\"ygrps-yiv-23843245\">That was really good, Robin, thanks.  I&#39;m still perplexed about how to<br/>\nreconcile moving in different directions (him wanting to give allowance for<br/>\ndoing chores, me wanting to be more respectful and have a collaborative<br/>\nrelationship with my kids).<br/>\n<br/>\nI also just want to mention beautiful moments, b/c I don&#39;t think I notice<br/>\nthem near enough.  I was having a &quot;bad&quot; day on Saturday (pain, fatigue,<br/>\nstress about having lost something, and yet ever aware that these were small<br/>\nproblems, yet I thought I *had* to find it for the doctor&#39;s appt on Monday),<br/>\nand my youngest, who is 2, walks over to me and goes &quot;here Mama&quot; and gives<br/>\nme a gummy lifesaver.  In his world, that could fix it all, and you know<br/>\nwhat, for that moment, it did for me too.  I&#39;m trying really hard to live in<br/>\nthe moment, *this* moment, and darn if kids don&#39;t already know that, eh?  A<br/>\nfew minutes later, my 7 yr old comes up and just moves in next to me and<br/>\nnuzzles up.  Beautiful moments and a reminder of all we have.<br/>\n<br/>\nI don&#39;t know why I felt compelled to share, but it is what it is ;-).<br/>\n<br/>\nThanks!<br/>\n<br/>\nChristie<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sun, Jan 4, 2009 at 1:17 AM, Robin Bentley &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robin.bentley@...\">robin.bentley@...</a>&gt;wrote:<br/>\n<br/>\n&gt;   &gt;<br/>\n&gt; &gt; Now on to another challenge---dh! First off, no one needs to tell<br/>\n&gt; &gt; me how<br/>\n&gt; &gt; great he is.<br/>\n&gt;<br/>\n&gt; Hey, we don&#39;t even know him &lt;g&gt;.<br/>\n&gt;<br/>\n&gt; Here&#39;s a page on Sandra&#39;s site about spouses and how unschooling can<br/>\n&gt; make relationships better - it&#39;s really good.<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/spouses\">http://sandradodd.com/spouses</a><br/>\n&gt;<br/>\n&gt; Robin B.<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":217951851,"authorName":"Christie Craigie-Carter","from":"&quot;Christie Craigie-Carter&quot; &lt;craigiecarter@...&gt;","profile":"c3_2323","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"2"},"subject":"Re: [unschoolingbasics] Re: Moving toward more peaceful parenting and help with dh","postDate":"1231157055","msgId":37578,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyNGM0ZDBhMDkwMTA1MDQwNGg2OTQ0NDZkNGw1ZWVkNDc3YTRjMTBkNDk2QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdqcjdmMSsyZGlmQGVHcm91cHMuY29tPg==","referencesHeader":"PDczODQ5NC4xNjgwOC5xbUB3ZWI4MTUwMi5tYWlsLm11ZC55YWhvby5jb20+CSA8Z2pyN2YxKzJkaWZAZUdyb3Vwcy5jb20+"},"prevInTopic":37577,"nextInTopic":37579,"prevInTime":37577,"nextInTime":37579,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"Oops, sorry to clog up the list.  I looked at the link afterwards, and that is the exact stuff I have; what luck!!!! Thanks! Christie ... [Non-text portions of","messageBody":"<div id=\"ygrps-yiv-1602853291\">Oops, sorry to clog up the list.  I looked at the link afterwards, and that<br/>\nis the exact stuff I have; what luck!!!!<br/>\n<br/>\nThanks!<br/>\n<br/>\nChristie<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sun, Jan 4, 2009 at 3:50 PM, pclatha &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pclatha@...\">pclatha@...</a>&gt; wrote:<br/>\n<br/>\n&gt;   You did not mention if it was stress related or something topical,<br/>\n&gt; have you tried the miracle salve? I have found it to be useful for a<br/>\n&gt; multitude of things. Here is the link.<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.kerrysherbals.com/herbalsalves.shtml\">http://www.kerrysherbals.com/herbalsalves.shtml</a><br/>\n&gt;<br/>\n&gt; I also find that topical application of coconut oil helps heal most<br/>\n&gt; skin issues.<br/>\n&gt;<br/>\n&gt; Can you also offer him a pedicure? or teach him to do it himself and<br/>\n&gt; apply a foot cream (I love bodyshop products for feet) before he<br/>\n&gt; wears socks and/or at nights with socks?<br/>\n&gt;<br/>\n&gt; Sorry you are having a tough time.<br/>\n&gt;<br/>\n&gt; Latha<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&lt;unschoolingbasics%40yahoogroups.com&gt;,<br/>\n&gt; BRIAN POLIKOWSKY<br/>\n&gt; &lt;polykowholsteins@...&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; The other day, I noticed how bad the bottom<br/>\n&gt; &gt; &gt; of his<br/>\n&gt; &gt; &gt; foot has gotten (they peel, and he picks at it, and now it is<br/>\n&gt; really<br/>\n&gt; &gt; &gt; red and<br/>\n&gt; &gt; &gt; raw with a couple of deep fissures that make me nervous about<br/>\n&gt; &gt; &gt; infection).<br/>\n&gt; &gt; -=-=-=-=-=-=-<br/>\n&gt; &gt;<br/>\n&gt; &gt; Just a note here. My sister used to have that and she found out<br/>\n&gt; that every time she had shoes that were synthetic her feet would get<br/>\n&gt; worse.<br/>\n&gt; &gt; she can only wear natural fibers and leather. No plastic or rubber.<br/>\n&gt; &gt; She also added omega oils to her  diet and it helped heal a lot<br/>\n&gt; faster.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Alex Polikowsky<br/>\n&gt; &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n&gt; &gt;<br/>\n&gt; &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; ________________________________<br/>\n&gt; &gt; From: Robin Bentley &lt;robin.bentley@...&gt;<br/>\n&gt;<br/>\n&gt; &gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&lt;unschoolingbasics%40yahoogroups.com&gt;<br/>\n&gt; &gt; Sent: Saturday, January 3, 2009 11:59:40 PM<br/>\n&gt; &gt; Subject: Re: [unschoolingbasics] Moving toward more peaceful<br/>\n&gt; parenting and help with dh<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; I had a very stressful day yesterday;<br/>\n&gt; &gt;<br/>\n&gt; &gt; &lt;snip&gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Whenever I start justifying my less-than-ideal parenting, it<br/>\n&gt; really is<br/>\n&gt; &gt; a clue to me that I need to look at things differently.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; At this point though, I&#39;m correcting myself after the fact and<br/>\n&gt; really<br/>\n&gt; &gt; &gt; hopeful that I get to the point of catching myself before, which<br/>\n&gt; I&#39;ve<br/>\n&gt; &gt; &gt; certainly done, but not near enough.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Being aware is the first step towards changing how you react, of<br/>\n&gt; &gt; course. So, when you notice a trigger, have a plan. Breathe.<br/>\n&gt; Breathe<br/>\n&gt; &gt; some more. Remove yourself from the situation for a minute to stop<br/>\n&gt; &gt; whatever cycle you are beginning to enter. Exhaustion is common<br/>\n&gt; when<br/>\n&gt; &gt; you have small children and you have three. It will not be like<br/>\n&gt; this<br/>\n&gt; &gt; forever! But giving your kids the gift of a frustrated-less- often<br/>\n&gt; &gt; mother will help your relationships.<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt; At any rate, I&#39;m sad to see my son<br/>\n&gt; &gt; &gt; respond the way he does. He&#39;s very quick to offer an apology for<br/>\n&gt; &gt; &gt; upsetting<br/>\n&gt; &gt; &gt; me, when really he was just being a kid. He&#39;ll preface things by<br/>\n&gt; &gt; &gt; saying &quot;I<br/>\n&gt; &gt; &gt; don&#39;t want to upset you, but&quot;, etc. It has really gotten my<br/>\n&gt; &gt; &gt; attention as to<br/>\n&gt; &gt; &gt; how it feels for him. The other day, I noticed how bad the<br/>\n&gt; bottom<br/>\n&gt; &gt; &gt; of his<br/>\n&gt; &gt; &gt; foot has gotten (they peel, and he picks at it, and now it is<br/>\n&gt; really<br/>\n&gt; &gt; &gt; red and<br/>\n&gt; &gt; &gt; raw with a couple of deep fissures that make me nervous about<br/>\n&gt; &gt; &gt; infection).<br/>\n&gt; &gt; &gt; Anyway, I asked to look at them more closely, and mentioned that<br/>\n&gt; it<br/>\n&gt; &gt; &gt; might be<br/>\n&gt; &gt; &gt; time to go to the doctor to see if she has any ideas. He totally<br/>\n&gt; &gt; &gt; flipped,<br/>\n&gt; &gt; &gt; poor guy. He was cowering in the corner of my bed, shaking.<br/>\n&gt; &gt;<br/>\n&gt; &gt; So, you know that he has fear around doctor&#39;s visits. Maybe,<br/>\n&gt; before<br/>\n&gt; &gt; you mention that likelihood to him, research the possibilities for<br/>\n&gt; &gt; healing his foot without going to the doctor. There are<br/>\n&gt; naturopaths<br/>\n&gt; &gt; and homeopaths who don&#39;t use needles and have success with such<br/>\n&gt; &gt; ongoing issues. But, you could inform yourself first.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; See, he&#39;s had this paranoia about going to the doctor meaning<br/>\n&gt; having<br/>\n&gt; &gt; &gt; shots.<br/>\n&gt; &gt; &gt; We actually stopped vaxing several years ago, when he had a<br/>\n&gt; scary<br/>\n&gt; &gt; &gt; reaction<br/>\n&gt; &gt; &gt; to the DTaP, and the only thing &quot;shot-like&quot; that he&#39;s had since<br/>\n&gt; then<br/>\n&gt; &gt; &gt; has<br/>\n&gt; &gt; &gt; been bloodwork to evaluate for allergies which run in my family.<br/>\n&gt; &gt; &gt; Don&#39;t even<br/>\n&gt; &gt; &gt; get me started about that decision--he turned up positive to<br/>\n&gt; three<br/>\n&gt; &gt; &gt; foods,<br/>\n&gt; &gt; &gt; only to have the allergist say that it was such a weak positive,<br/>\n&gt; &gt; &gt; that it<br/>\n&gt; &gt; &gt; could be ignored, and then imply in his notes that I pushed for<br/>\n&gt; the<br/>\n&gt; &gt; &gt; testing,<br/>\n&gt; &gt; &gt; when I never would have done it w/o his insistence. I&#39;ve learned<br/>\n&gt; a<br/>\n&gt; &gt; &gt; lot<br/>\n&gt; &gt; &gt; about standing up to doctors the last few years.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; Anyway, I told him that the only thing I could anticipate him<br/>\n&gt; &gt; &gt; getting shots<br/>\n&gt; &gt; &gt; for would be if he got bitten by an animal somehow (course<br/>\n&gt; doesn&#39;t<br/>\n&gt; &gt; &gt; our dog<br/>\n&gt; &gt; &gt; go and accidentally bite him and break the skin the very next<br/>\n&gt; day,<br/>\n&gt; &gt; &gt; but it&#39;s<br/>\n&gt; &gt; &gt; okay.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I&#39;m not sure I would even bring this up to my daughter, who has a<br/>\n&gt; lot<br/>\n&gt; &gt; of fear around doctors, dentists and needles. It would set up<br/>\n&gt; another<br/>\n&gt; &gt; fear in her mind about being bitten by a dog and what would happen<br/>\n&gt; &gt; after that.<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt; I ran it by the doc and they said just to watch it for<br/>\n&gt; infection. It<br/>\n&gt; &gt; &gt; was also another opportunity to assure him that I know and Dr.<br/>\n&gt; V.<br/>\n&gt; &gt; &gt; knows how<br/>\n&gt; &gt; &gt; much he doesn&#39;t want shots and we are doing our best to honor<br/>\n&gt; &gt; &gt; that). I said<br/>\n&gt; &gt; &gt; this in an effort to help him feel more relaxed about going to<br/>\n&gt; the<br/>\n&gt; &gt; &gt; doctor,<br/>\n&gt; &gt; &gt; which though we don&#39;t do it often, there are times when it is<br/>\n&gt; &gt; &gt; prudent (like<br/>\n&gt; &gt; &gt; with his foot and when he had Lyme&#39;s Disease for the 2nd time).<br/>\n&gt; &gt;<br/>\n&gt; &gt; So, it might be better not to try to help him feel more relaxed.<br/>\n&gt; Go<br/>\n&gt; &gt; when you really need to go and help him *right then* with his<br/>\n&gt; fears.<br/>\n&gt; &gt; Don&#39;t talk about what may or may not happen, because that can be<br/>\n&gt; &gt; stressful. I used to do just this kind of thing with my very<br/>\n&gt; &gt; sensitive, reactive, and imaginative daughter and it would just<br/>\n&gt; set<br/>\n&gt; &gt; her up for too much worrying about the future. I thought I was<br/>\n&gt; helping<br/>\n&gt; &gt; by &quot;preparing&quot; her. It didn&#39;t help much at all, especially if I<br/>\n&gt; went<br/>\n&gt; &gt; into detail or talked about it more than once.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; At any rate, he says to me while balled up on my bed after I<br/>\n&gt; asked<br/>\n&gt; &gt; &gt; to see<br/>\n&gt; &gt; &gt; his foot &quot;but I&#39;m just different like the guy with Tourette&#39;s&quot;<br/>\n&gt; (we<br/>\n&gt; &gt; &gt; just<br/>\n&gt; &gt; &gt; watched a movie about a man living with Tourette&#39;s). It actually<br/>\n&gt; &gt; &gt; was a<br/>\n&gt; &gt; &gt; really nice opportunity to heal, I think. I just assured him<br/>\n&gt; that I<br/>\n&gt; &gt; &gt; would<br/>\n&gt; &gt; &gt; never intend to make fun of him, that I&#39;m really sorry that&#39;s<br/>\n&gt; what he<br/>\n&gt; &gt; &gt; thought, that it&#39;s totally okay to be who he is, and how much I<br/>\n&gt; love<br/>\n&gt; &gt; &gt; him for<br/>\n&gt; &gt; &gt; who he is, etc. I&#39;m very aware that I need to be cautious about<br/>\n&gt; &gt; &gt; talking<br/>\n&gt; &gt; &gt; about him to others, as even though I&#39;m always doing so lovingly<br/>\n&gt; and<br/>\n&gt; &gt; &gt; out of<br/>\n&gt; &gt; &gt; concern, or pride, he doesn&#39;t hear it that way.<br/>\n&gt; &gt;<br/>\n&gt; &gt; My dd doesn&#39;t like to be talked about either. It can be construed<br/>\n&gt; as<br/>\n&gt; &gt; disrespect. Not every person feels this way, but I need to honor<br/>\n&gt; *her*<br/>\n&gt; &gt; need for privacy. How I see her will be different from how she<br/>\n&gt; sees<br/>\n&gt; &gt; herself, too.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I remember it this way: if my husband was talking about me, in<br/>\n&gt; front<br/>\n&gt; &gt; of me, to others (even if it was loving, with pride or out of<br/>\n&gt; concern)<br/>\n&gt; &gt; I might feel uncomfortable, embarrassed and possibly miffed.<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt; He&#39;s a lot like me<br/>\n&gt; &gt; &gt; actually. I&#39;ve told my mother, etc., that we can&#39;t talk right<br/>\n&gt; now,<br/>\n&gt; &gt; &gt; etc. and<br/>\n&gt; &gt; &gt; how senstive he is to criticism. My parents have done a lot of<br/>\n&gt; &gt; &gt; comparing<br/>\n&gt; &gt; &gt; him to my niece, who is his age, re: his fears for TV shows, etc.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I&#39;ve found it was important to protect my daughter from those<br/>\n&gt; &gt; comparisons by not over-emphasizing her differences, nor<br/>\n&gt; entertaining<br/>\n&gt; &gt; much discussion with grandparents about it. All kids have their<br/>\n&gt; own<br/>\n&gt; &gt; timelines, quirks, and fears, some more apparent than others.<br/>\n&gt; &gt; Explaining too much can sound like defensiveness. Being a child&#39;s<br/>\n&gt; &gt; advocate sometimes means diverting attention.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I notice there are many situations and explanations throughout<br/>\n&gt; your<br/>\n&gt; &gt; post. Then you ask how you can heal the relationship without<br/>\n&gt; really<br/>\n&gt; &gt; telling us what you think your relationship is with your son. If<br/>\n&gt; you<br/>\n&gt; &gt; can think about that, then tell us what you believe is missing or<br/>\n&gt; &gt; needs repair, that will help clarify, both for you and the list<br/>\n&gt; members.<br/>\n&gt; &gt;<br/>\n&gt; &gt; There may be some value to journalling about these things. Getting<br/>\n&gt; &gt; your thoughts down on paper, the stream-of-conscious ness stuff,<br/>\n&gt; can<br/>\n&gt; &gt; help to shed some light on what seems daunting at first.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Robin B.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":217951851,"authorName":"Christie Craigie-Carter","from":"&quot;Christie Craigie-Carter&quot; &lt;craigiecarter@...&gt;","profile":"c3_2323","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh","postDate":"1231156996","msgId":37577,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyNGM0ZDBhMDkwMTA1MDQwM3M1YWQ0MDQxZGdiNTdmZmFkOTMzOGY2MDE3QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDczODQ5NC4xNjgwOC5xbUB3ZWI4MTUwMi5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDczODQ5NC4xNjgwOC5xbUB3ZWI4MTUwMi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":37576,"nextInTopic":37578,"prevInTime":37576,"nextInTime":37578,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"Thanks Alex and Latha!  I will look into both of those.  Latha, I have a salve that was originally intended for my bout with Thrust (awful stuff, truly), I","messageBody":"<div id=\"ygrps-yiv-633011254\">Thanks Alex and Latha!  I will look into both of those.  Latha, I have a<br/>\nsalve that was originally intended for my bout with Thrust (awful stuff,<br/>\ntruly), I wonder if that would work.  I think it&#39;s called &quot;Kelly&#39;s miracle<br/>\nsalve&quot; and iirc, it was intended for the peeling.<br/>\n<br/>\nThanks again!<br/>\n<br/>\nChristie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":217951851,"authorName":"Christie Craigie-Carter","from":"&quot;Christie Craigie-Carter&quot; &lt;craigiecarter@...&gt;","profile":"c3_2323","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh","postDate":"1231156847","msgId":37576,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyNGM0ZDBhMDkwMTA1MDQwMHgxNTM1MzJiN3YyMDY4NjdjNjE1ZGM1Y2E1QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEVEOTk2NkE4LUIyOUMtNDU1OS05ODBGLUMwMUVFQkVFMzhCM0Bjb21jYXN0Lm5ldD4=","referencesHeader":"PDkyNGM0ZDBhMDkwMTAzMDgzNnczZGNmNzNlZHg3NjdjYjM4NzFhYmY0MjFhQG1haWwuZ21haWwuY29tPgkgPEVEOTk2NkE4LUIyOUMtNDU1OS05ODBGLUMwMUVFQkVFMzhCM0Bjb21jYXN0Lm5ldD4="},"prevInTopic":37570,"nextInTopic":37577,"prevInTime":37575,"nextInTime":37577,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"... Of course, like I said, I recognize that for sure. ... Absolutely. ... Oh, researching ahead isn t my problem ;-)  Unfortunately, I m pretty confident that","messageBody":"<div id=\"ygrps-yiv-1400089731\">On Sun, Jan 4, 2009 at 12:59 AM, Robin Bentley &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robin.bentley@...\">robin.bentley@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   &gt;<br/>\n&gt; &gt; I had a very stressful day yesterday;<br/>\n&gt;<br/>\n&gt; &lt;snip&gt;<br/>\n&gt;<br/>\n&gt; Whenever I start justifying my less-than-ideal parenting, it really is<br/>\n&gt; a clue to me that I need to look at things differently.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Of course, like I said, I recognize that for sure.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; At this point though, I&#39;m correcting myself after the fact and really<br/>\n&gt; &gt; hopeful that I get to the point of catching myself before, which I&#39;ve<br/>\n&gt; &gt; certainly done, but not near enough.<br/>\n&gt;<br/>\n&gt; Being aware is the first step towards changing how you react, of<br/>\n&gt; course. So, when you notice a trigger, have a plan. Breathe. Breathe<br/>\n&gt; some more. Remove yourself from the situation for a minute to stop<br/>\n&gt; whatever cycle you are beginning to enter. Exhaustion is common when<br/>\n&gt; you have small children and you have three. It will not be like this<br/>\n&gt; forever! But giving your kids the gift of a frustrated-less-often<br/>\n&gt; mother will help your relationships.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Absolutely.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; &gt; At any rate, I&#39;m sad to see my son<br/>\n&gt; &gt; respond the way he does. He&#39;s very quick to offer an apology for<br/>\n&gt; &gt; upsetting<br/>\n&gt; &gt; me, when really he was just being a kid. He&#39;ll preface things by<br/>\n&gt; &gt; saying &quot;I<br/>\n&gt; &gt; don&#39;t want to upset you, but&quot;, etc. It has really gotten my<br/>\n&gt; &gt; attention as to<br/>\n&gt; &gt; how it feels for him. The other day, I noticed how bad the bottom<br/>\n&gt; &gt; of his<br/>\n&gt; &gt; foot has gotten (they peel, and he picks at it, and now it is really<br/>\n&gt; &gt; red and<br/>\n&gt; &gt; raw with a couple of deep fissures that make me nervous about<br/>\n&gt; &gt; infection).<br/>\n&gt; &gt; Anyway, I asked to look at them more closely, and mentioned that it<br/>\n&gt; &gt; might be<br/>\n&gt; &gt; time to go to the doctor to see if she has any ideas. He totally<br/>\n&gt; &gt; flipped,<br/>\n&gt; &gt; poor guy. He was cowering in the corner of my bed, shaking.<br/>\n&gt;<br/>\n&gt; So, you know that he has fear around doctor&#39;s visits. Maybe, before<br/>\n&gt; you mention that likelihood to him, research the possibilities for<br/>\n&gt; healing his foot without going to the doctor. There are naturopaths<br/>\n&gt; and homeopaths who don&#39;t use needles and have success with such<br/>\n&gt; ongoing issues. But, you could inform yourself first.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Oh, researching ahead isn&#39;t my problem ;-)  Unfortunately, I&#39;m pretty<br/>\nconfident that he would perceive the naturopath the same way he perceives<br/>\nour FP doc.  If you knew her, you&#39;d know that they don&#39;t get any more gentle<br/>\nand caring then she.  That and the fact that she totally respects our<br/>\ndecisions about our health, and she&#39;s a rare gem (how sad is that?).  I will<br/>\nlook into this though.  And forgive the rant, but much as I love my<br/>\nnaturopath, she charges about $100/hr. which is really rough.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; See, he&#39;s had this paranoia about going to the doctor meaning having<br/>\n&gt; &gt; shots.<br/>\n&gt; &gt; We actually stopped vaxing several years ago, when he had a scary<br/>\n&gt; &gt; reaction<br/>\n&gt; &gt; to the DTaP, and the only thing &quot;shot-like&quot; that he&#39;s had since then<br/>\n&gt; &gt; has<br/>\n&gt; &gt; been bloodwork to evaluate for allergies which run in my family.<br/>\n&gt; &gt; Don&#39;t even<br/>\n&gt; &gt; get me started about that decision--he turned up positive to three<br/>\n&gt; &gt; foods,<br/>\n&gt; &gt; only to have the allergist say that it was such a weak positive,<br/>\n&gt; &gt; that it<br/>\n&gt; &gt; could be ignored, and then imply in his notes that I pushed for the<br/>\n&gt; &gt; testing,<br/>\n&gt; &gt; when I never would have done it w/o his insistence. I&#39;ve learned a<br/>\n&gt; &gt; lot<br/>\n&gt; &gt; about standing up to doctors the last few years.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Anyway, I told him that the only thing I could anticipate him<br/>\n&gt; &gt; getting shots<br/>\n&gt; &gt; for would be if he got bitten by an animal somehow (course doesn&#39;t<br/>\n&gt; &gt; our dog<br/>\n&gt; &gt; go and accidentally bite him and break the skin the very next day,<br/>\n&gt; &gt; but it&#39;s<br/>\n&gt; &gt; okay.<br/>\n&gt;<br/>\n&gt; I&#39;m not sure I would even bring this up to my daughter, who has a lot<br/>\n&gt; of fear around doctors, dentists and needles. It would set up another<br/>\n&gt; fear in her mind about being bitten by a dog and what would happen<br/>\n&gt; after that.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>You know, I&#39;ve struggled with this a lot.  His fears seem to snowball, and<br/>\nany time I&#39;ve given information like this, it&#39;s been in an attempt to stop<br/>\nthe snowballing.  See, I understand anxiety all too well.  One thing I do<br/>\nneed to examine is my commitment to being totally honest with my kids, which<br/>\nis definitely part of the motivation in giving him an example; I wouldn&#39;t<br/>\never want him to feel that I lied to him.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; &gt; I ran it by the doc and they said just to watch it for infection. It<br/>\n&gt; &gt; was also another opportunity to assure him that I know and Dr. V.<br/>\n&gt; &gt; knows how<br/>\n&gt; &gt; much he doesn&#39;t want shots and we are doing our best to honor<br/>\n&gt; &gt; that). I said<br/>\n&gt; &gt; this in an effort to help him feel more relaxed about going to the<br/>\n&gt; &gt; doctor,<br/>\n&gt; &gt; which though we don&#39;t do it often, there are times when it is<br/>\n&gt; &gt; prudent (like<br/>\n&gt; &gt; with his foot and when he had Lyme&#39;s Disease for the 2nd time).<br/>\n&gt;<br/>\n&gt; So, it might be better not to try to help him feel more relaxed. Go<br/>\n&gt; when you really need to go and help him *right then* with his fears.<br/>\n&gt; Don&#39;t talk about what may or may not happen, because that can be<br/>\n&gt; stressful. I used to do just this kind of thing with my very<br/>\n&gt; sensitive, reactive, and imaginative daughter and it would just set<br/>\n&gt; her up for too much worrying about the future. I thought I was helping<br/>\n&gt; by &quot;preparing&quot; her. It didn&#39;t help much at all, especially if I went<br/>\n&gt; into detail or talked about it more than once.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I have to think about it more, but I&#39;m nearly positive that we only discuss<br/>\nit when he brings it up and it&#39;s so hard to know if springing it on him<br/>\nwould damage trust.  How did you determine that?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; At any rate, he says to me while balled up on my bed after I asked<br/>\n&gt; &gt; to see<br/>\n&gt; &gt; his foot &quot;but I&#39;m just different like the guy with Tourette&#39;s&quot; (we<br/>\n&gt; &gt; just<br/>\n&gt; &gt; watched a movie about a man living with Tourette&#39;s). It actually<br/>\n&gt; &gt; was a<br/>\n&gt; &gt; really nice opportunity to heal, I think. I just assured him that I<br/>\n&gt; &gt; would<br/>\n&gt; &gt; never intend to make fun of him, that I&#39;m really sorry that&#39;s what he<br/>\n&gt; &gt; thought, that it&#39;s totally okay to be who he is, and how much I love<br/>\n&gt; &gt; him for<br/>\n&gt; &gt; who he is, etc. I&#39;m very aware that I need to be cautious about<br/>\n&gt; &gt; talking<br/>\n&gt; &gt; about him to others, as even though I&#39;m always doing so lovingly and<br/>\n&gt; &gt; out of<br/>\n&gt; &gt; concern, or pride, he doesn&#39;t hear it that way.<br/>\n&gt;<br/>\n&gt; My dd doesn&#39;t like to be talked about either. It can be construed as<br/>\n&gt; disrespect. Not every person feels this way, but I need to honor *her*<br/>\n&gt; need for privacy. How I see her will be different from how she sees<br/>\n&gt; herself, too.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Absolutely.  I&#39;ve gotten the hint.  I wonder what you all think about<br/>\nthis--it would be my preference for many reasons to limit our time with my<br/>\nfamily.  They are much more authoritarian in their views and, in their<br/>\neffort to &quot;fix&quot; him, they often make suggestions that he feels are<br/>\ncriticism.  Still, he wants to go over there frequently.  I talk with him<br/>\nabout how he feels about those things, and he usually just shrugs and says<br/>\nhe still wants to go over.  So, I follow his lead.  What makes me nervous,<br/>\nand something that I don&#39;t think many here would agree with, is I don&#39;t feel<br/>\nlike children can always weigh multi-factorial decisons like that.<br/>\nCertainly he knows that he enjoys going over there, and right now, the<br/>\nbenefits outweigh the costs, but I admit I&#39;m concerned about damage they may<br/>\ncause.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; I remember it this way: if my husband was talking about me, in front<br/>\n&gt; of me, to others (even if it was loving, with pride or out of concern)<br/>\n&gt; I might feel uncomfortable, embarrassed and possibly miffed.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Of course.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; &gt; He&#39;s a lot like me<br/>\n&gt; &gt; actually. I&#39;ve told my mother, etc., that we can&#39;t talk right now,<br/>\n&gt; &gt; etc. and<br/>\n&gt; &gt; how senstive he is to criticism. My parents have done a lot of<br/>\n&gt; &gt; comparing<br/>\n&gt; &gt; him to my niece, who is his age, re: his fears for TV shows, etc.<br/>\n&gt;<br/>\n&gt; I&#39;ve found it was important to protect my daughter from those<br/>\n&gt; comparisons by not over-emphasizing her differences, nor entertaining<br/>\n&gt; much discussion with grandparents about it. All kids have their own<br/>\n&gt; timelines, quirks, and fears, some more apparent than others.<br/>\n&gt; Explaining too much can sound like defensiveness. Being a child&#39;s<br/>\n&gt; advocate sometimes means diverting attention.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Yep, that&#39;s what I&#39;m trying to do, either by avoiding being there as often<br/>\n(again, for many reasons), or by letting them know that I&#39;d appreciate them<br/>\nkeeping their comments to themselves (not said quite like that, as that<br/>\nmight trigger their &quot;You don&#39;t respect your parents&quot; point).  Unfortunately,<br/>\nthis can often end with them concluding that he&#39;s just &quot;too sensitive&quot; like<br/>\nme.  Ugh.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; I notice there are many situations and explanations throughout your<br/>\n&gt; post. Then you ask how you can heal the relationship without really<br/>\n&gt; telling us what you think your relationship is with your son. If you<br/>\n&gt; can think about that, then tell us what you believe is missing or<br/>\n&gt; needs repair, that will help clarify, both for you and the list members.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>What I think is missing is him knowing, totally and completely, how much we<br/>\nlove him.  I can tell that he doubts it, even as it blows my mind that he<br/>\ncould ever doubt it.  But his feelings are real, as much as mine are.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; There may be some value to journalling about these things. Getting<br/>\n&gt; your thoughts down on paper, the stream-of-consciousness stuff, can<br/>\n&gt; help to shed some light on what seems daunting at first.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Great idea, thanks for the suggestion.  I just found my journal as luck<br/>\nwould have it, so this is very timely.<br/>\n<br/>\nThanks so much!<br/>\n<br/>\nChristie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":64267811,"authorName":"pclatha","from":"&quot;pclatha&quot; &lt;pclatha@...&gt;","profile":"pclatha","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Moving toward more peaceful parenting and help with dh","postDate":"1231102241","msgId":37570,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdqcjdmMSsyZGlmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDczODQ5NC4xNjgwOC5xbUB3ZWI4MTUwMi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":37569,"nextInTopic":37576,"prevInTime":37569,"nextInTime":37571,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"You did not mention if it was stress related or something topical, have you tried the miracle salve? I have found it to be useful for a multitude of things.","messageBody":"<div id=\"ygrps-yiv-160786590\">You did not mention if it was stress related or something topical, <br/>\nhave you tried the miracle salve? I have found it to be useful for a <br/>\nmultitude of things. Here is the link.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.kerrysherbals.com/herbalsalves.shtml\">http://www.kerrysherbals.com/herbalsalves.shtml</a><br/>\n<br/>\nI also find that topical application of coconut oil helps heal most <br/>\nskin issues. <br/>\n<br/>\nCan you also offer him a pedicure? or teach him to do it himself and <br/>\napply a foot cream (I love bodyshop products for feet) before he <br/>\nwears socks and/or at nights with socks? <br/>\n<br/>\nSorry you are having a tough time. <br/>\n<br/>\n<br/>\nLatha<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, BRIAN POLIKOWSKY <br/>\n&lt;polykowholsteins@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; The other day, I noticed how bad the bottom <br/>\n&gt; &gt; of his<br/>\n&gt; &gt; foot has gotten (they peel, and he picks at it, and now it is <br/>\n </span></blockquote>really <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; red and<br/>\n&gt; &gt; raw with a couple of deep fissures that make me nervous about <br/>\n&gt; &gt; infection).<br/>\n&gt; -=-=-=-=-=-=-<br/>\n&gt; <br/>\n&gt; Just a note here. My sister used to have that and she found out <br/>\n </span></blockquote>that every time she had shoes that were synthetic her feet would get <br/>\nworse.<br/>\n<blockquote><span title=\"ireply\"> &gt; she can only wear natural fibers and leather. No plastic or rubber.<br/>\n&gt; She also added omega oils to her  diet and it helped heal a lot <br/>\n </span></blockquote>faster.<br/>\n<blockquote><span title=\"ireply\"> &gt;  <br/>\n&gt; Alex Polikowsky<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ________________________________<br/>\n&gt; From: Robin Bentley &lt;robin.bentley@...&gt;<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n&gt; Sent: Saturday, January 3, 2009 11:59:40 PM<br/>\n&gt; Subject: Re: [unschoolingbasics] Moving toward more peaceful <br/>\n </span></blockquote>parenting and help with dh<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; &gt;<br/>\n&gt; &gt; I had a very stressful day yesterday;<br/>\n&gt; <br/>\n&gt; &lt;snip&gt;<br/>\n&gt; <br/>\n&gt; Whenever I start justifying my less-than-ideal parenting, it <br/>\n </span></blockquote>really is <br/>\n<blockquote><span title=\"ireply\"> &gt; a clue to me that I need to look at things differently.<br/>\n&gt; &gt;<br/>\n&gt; &gt; At this point though, I&#39;m correcting myself after the fact and <br/>\n </span></blockquote>really<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; hopeful that I get to the point of catching myself before, which <br/>\n </span></blockquote>I&#39;ve<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; certainly done, but not near enough.<br/>\n&gt; <br/>\n&gt; Being aware is the first step towards changing how you react, of <br/>\n&gt; course. So, when you notice a trigger, have a plan. Breathe. <br/>\n </span></blockquote>Breathe <br/>\n<blockquote><span title=\"ireply\"> &gt; some more. Remove yourself from the situation for a minute to stop <br/>\n&gt; whatever cycle you are beginning to enter. Exhaustion is common <br/>\n </span></blockquote>when <br/>\n<blockquote><span title=\"ireply\"> &gt; you have small children and you have three. It will not be like <br/>\n </span></blockquote>this <br/>\n<blockquote><span title=\"ireply\"> &gt; forever! But giving your kids the gift of a frustrated-less- often <br/>\n&gt; mother will help your relationships.<br/>\n&gt; <br/>\n&gt; &gt; At any rate, I&#39;m sad to see my son<br/>\n&gt; &gt; respond the way he does. He&#39;s very quick to offer an apology for <br/>\n&gt; &gt; upsetting<br/>\n&gt; &gt; me, when really he was just being a kid. He&#39;ll preface things by <br/>\n&gt; &gt; saying &quot;I<br/>\n&gt; &gt; don&#39;t want to upset you, but&quot;, etc. It has really gotten my <br/>\n&gt; &gt; attention as to<br/>\n&gt; &gt; how it feels for him. The other day, I noticed how bad the <br/>\n </span></blockquote>bottom <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; of his<br/>\n&gt; &gt; foot has gotten (they peel, and he picks at it, and now it is <br/>\n </span></blockquote>really <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; red and<br/>\n&gt; &gt; raw with a couple of deep fissures that make me nervous about <br/>\n&gt; &gt; infection).<br/>\n&gt; &gt; Anyway, I asked to look at them more closely, and mentioned that <br/>\n </span></blockquote>it <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; might be<br/>\n&gt; &gt; time to go to the doctor to see if she has any ideas. He totally <br/>\n&gt; &gt; flipped,<br/>\n&gt; &gt; poor guy. He was cowering in the corner of my bed, shaking.<br/>\n&gt; <br/>\n&gt; So, you know that he has fear around doctor&#39;s visits. Maybe, <br/>\n </span></blockquote>before <br/>\n<blockquote><span title=\"ireply\"> &gt; you mention that likelihood to him, research the possibilities for <br/>\n&gt; healing his foot without going to the doctor. There are <br/>\n </span></blockquote>naturopaths <br/>\n<blockquote><span title=\"ireply\"> &gt; and homeopaths who don&#39;t use needles and have success with such <br/>\n&gt; ongoing issues. But, you could inform yourself first.<br/>\n&gt; &gt;<br/>\n&gt; &gt; See, he&#39;s had this paranoia about going to the doctor meaning <br/>\n </span></blockquote>having <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; shots.<br/>\n&gt; &gt; We actually stopped vaxing several years ago, when he had a <br/>\n </span></blockquote>scary <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; reaction<br/>\n&gt; &gt; to the DTaP, and the only thing &quot;shot-like&quot; that he&#39;s had since <br/>\n </span></blockquote>then <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; has<br/>\n&gt; &gt; been bloodwork to evaluate for allergies which run in my family. <br/>\n&gt; &gt; Don&#39;t even<br/>\n&gt; &gt; get me started about that decision--he turned up positive to <br/>\n </span></blockquote>three <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; foods,<br/>\n&gt; &gt; only to have the allergist say that it was such a weak positive, <br/>\n&gt; &gt; that it<br/>\n&gt; &gt; could be ignored, and then imply in his notes that I pushed for <br/>\n </span></blockquote>the <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; testing,<br/>\n&gt; &gt; when I never would have done it w/o his insistence. I&#39;ve learned <br/>\n </span></blockquote>a <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; lot<br/>\n&gt; &gt; about standing up to doctors the last few years.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Anyway, I told him that the only thing I could anticipate him <br/>\n&gt; &gt; getting shots<br/>\n&gt; &gt; for would be if he got bitten by an animal somehow (course <br/>\n </span></blockquote>doesn&#39;t <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; our dog<br/>\n&gt; &gt; go and accidentally bite him and break the skin the very next <br/>\n </span></blockquote>day, <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; but it&#39;s<br/>\n&gt; &gt; okay.<br/>\n&gt; <br/>\n&gt; I&#39;m not sure I would even bring this up to my daughter, who has a <br/>\n </span></blockquote>lot <br/>\n<blockquote><span title=\"ireply\"> &gt; of fear around doctors, dentists and needles. It would set up <br/>\n </span></blockquote>another <br/>\n<blockquote><span title=\"ireply\"> &gt; fear in her mind about being bitten by a dog and what would happen <br/>\n&gt; after that.<br/>\n&gt; <br/>\n&gt; &gt; I ran it by the doc and they said just to watch it for <br/>\n </span></blockquote>infection. It<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; was also another opportunity to assure him that I know and Dr. <br/>\n </span></blockquote>V. <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; knows how<br/>\n&gt; &gt; much he doesn&#39;t want shots and we are doing our best to honor <br/>\n&gt; &gt; that). I said<br/>\n&gt; &gt; this in an effort to help him feel more relaxed about going to <br/>\n </span></blockquote>the <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; doctor,<br/>\n&gt; &gt; which though we don&#39;t do it often, there are times when it is <br/>\n&gt; &gt; prudent (like<br/>\n&gt; &gt; with his foot and when he had Lyme&#39;s Disease for the 2nd time).<br/>\n&gt; <br/>\n&gt; So, it might be better not to try to help him feel more relaxed. <br/>\n </span></blockquote>Go <br/>\n<blockquote><span title=\"ireply\"> &gt; when you really need to go and help him *right then* with his <br/>\n </span></blockquote>fears. <br/>\n<blockquote><span title=\"ireply\"> &gt; Don&#39;t talk about what may or may not happen, because that can be <br/>\n&gt; stressful. I used to do just this kind of thing with my very <br/>\n&gt; sensitive, reactive, and imaginative daughter and it would just <br/>\n </span></blockquote>set <br/>\n<blockquote><span title=\"ireply\"> &gt; her up for too much worrying about the future. I thought I was <br/>\n </span></blockquote>helping <br/>\n<blockquote><span title=\"ireply\"> &gt; by &quot;preparing&quot; her. It didn&#39;t help much at all, especially if I <br/>\n </span></blockquote>went <br/>\n<blockquote><span title=\"ireply\"> &gt; into detail or talked about it more than once.<br/>\n&gt; &gt;<br/>\n&gt; &gt; At any rate, he says to me while balled up on my bed after I <br/>\n </span></blockquote>asked <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; to see<br/>\n&gt; &gt; his foot &quot;but I&#39;m just different like the guy with Tourette&#39;s&quot; <br/>\n </span></blockquote>(we <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; just<br/>\n&gt; &gt; watched a movie about a man living with Tourette&#39;s). It actually <br/>\n&gt; &gt; was a<br/>\n&gt; &gt; really nice opportunity to heal, I think. I just assured him <br/>\n </span></blockquote>that I <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; would<br/>\n&gt; &gt; never intend to make fun of him, that I&#39;m really sorry that&#39;s <br/>\n </span></blockquote>what he<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; thought, that it&#39;s totally okay to be who he is, and how much I <br/>\n </span></blockquote>love <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; him for<br/>\n&gt; &gt; who he is, etc. I&#39;m very aware that I need to be cautious about <br/>\n&gt; &gt; talking<br/>\n&gt; &gt; about him to others, as even though I&#39;m always doing so lovingly <br/>\n </span></blockquote>and <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; out of<br/>\n&gt; &gt; concern, or pride, he doesn&#39;t hear it that way.<br/>\n&gt; <br/>\n&gt; My dd doesn&#39;t like to be talked about either. It can be construed <br/>\n </span></blockquote>as <br/>\n<blockquote><span title=\"ireply\"> &gt; disrespect. Not every person feels this way, but I need to honor <br/>\n </span></blockquote>*her* <br/>\n<blockquote><span title=\"ireply\"> &gt; need for privacy. How I see her will be different from how she <br/>\n </span></blockquote>sees <br/>\n<blockquote><span title=\"ireply\"> &gt; herself, too.<br/>\n&gt; <br/>\n&gt; I remember it this way: if my husband was talking about me, in <br/>\n </span></blockquote>front <br/>\n<blockquote><span title=\"ireply\"> &gt; of me, to others (even if it was loving, with pride or out of <br/>\n </span></blockquote>concern) <br/>\n<blockquote><span title=\"ireply\"> &gt; I might feel uncomfortable, embarrassed and possibly miffed.<br/>\n&gt; <br/>\n&gt; &gt; He&#39;s a lot like me<br/>\n&gt; &gt; actually. I&#39;ve told my mother, etc., that we can&#39;t talk right <br/>\n </span></blockquote>now, <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; etc. and<br/>\n&gt; &gt; how senstive he is to criticism. My parents have done a lot of <br/>\n&gt; &gt; comparing<br/>\n&gt; &gt; him to my niece, who is his age, re: his fears for TV shows, etc.<br/>\n&gt; <br/>\n&gt; I&#39;ve found it was important to protect my daughter from those <br/>\n&gt; comparisons by not over-emphasizing her differences, nor <br/>\n </span></blockquote>entertaining <br/>\n<blockquote><span title=\"ireply\"> &gt; much discussion with grandparents about it. All kids have their <br/>\n </span></blockquote>own <br/>\n<blockquote><span title=\"ireply\"> &gt; timelines, quirks, and fears, some more apparent than others. <br/>\n&gt; Explaining too much can sound like defensiveness. Being a child&#39;s <br/>\n&gt; advocate sometimes means diverting attention.<br/>\n&gt; <br/>\n&gt; I notice there are many situations and explanations throughout <br/>\n </span></blockquote>your <br/>\n<blockquote><span title=\"ireply\"> &gt; post. Then you ask how you can heal the relationship without <br/>\n </span></blockquote>really <br/>\n<blockquote><span title=\"ireply\"> &gt; telling us what you think your relationship is with your son. If <br/>\n </span></blockquote>you <br/>\n<blockquote><span title=\"ireply\"> &gt; can think about that, then tell us what you believe is missing or <br/>\n&gt; needs repair, that will help clarify, both for you and the list <br/>\n </span></blockquote>members.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; There may be some value to journalling about these things. Getting <br/>\n&gt; your thoughts down on paper, the stream-of-conscious ness stuff, <br/>\n </span></blockquote>can <br/>\n<blockquote><span title=\"qreply\"> &gt; help to shed some light on what seems daunting at first.<br/>\n&gt; <br/>\n&gt; Robin B.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh","postDate":"1231091462","msgId":37569,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczODQ5NC4xNjgwOC5xbUB3ZWI4MTUwMi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":37568,"nextInTopic":37570,"prevInTime":37568,"nextInTime":37570,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"The other day, I noticed how bad the bottom ... -=-=-=-=-=-=- Just a note here. My sister used to have that and she found out that every time she had shoes","messageBody":"<div id=\"ygrps-yiv-1234740620\">The other day, I noticed how bad the bottom <br/>\n<blockquote><span title=\"ireply\"> &gt; of his<br/>\n&gt; foot has gotten (they peel, and he picks at it, and now it is really <br/>\n&gt; red and<br/>\n&gt; raw with a couple of deep fissures that make me nervous about <br/>\n&gt; infection).<br/>\n </span></blockquote>-=-=-=-=-=-=-<br/>\n<br/>\nJust a note here. My sister used to have that and she found out that every time she had shoes that were synthetic her feet would get worse.<br/>\nshe can only wear natural fibers and leather. No plastic or rubber.<br/>\nShe also added omega oils to her  diet and it helped heal a lot faster.<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Robin Bentley &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robin.bentley@...\">robin.bentley@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Saturday, January 3, 2009 11:59:40 PM<br/>\nSubject: Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I had a very stressful day yesterday;<br/>\n<br/>\n </span></blockquote>&lt;snip&gt;<br/>\n<br/>\nWhenever I start justifying my less-than-ideal parenting, it really is <br/>\na clue to me that I need to look at things differently.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; At this point though, I&#39;m correcting myself after the fact and really<br/>\n&gt; hopeful that I get to the point of catching myself before, which I&#39;ve<br/>\n&gt; certainly done, but not near enough.<br/>\n<br/>\n </span></blockquote>Being aware is the first step towards changing how you react, of <br/>\ncourse. So, when you notice a trigger, have a plan. Breathe. Breathe <br/>\nsome more. Remove yourself from the situation for a minute to stop <br/>\nwhatever cycle you are beginning to enter. Exhaustion is common when <br/>\nyou have small children and you have three. It will not be like this <br/>\nforever! But giving your kids the gift of a frustrated-less- often <br/>\nmother will help your relationships.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; At any rate, I&#39;m sad to see my son<br/>\n&gt; respond the way he does. He&#39;s very quick to offer an apology for <br/>\n&gt; upsetting<br/>\n&gt; me, when really he was just being a kid. He&#39;ll preface things by <br/>\n&gt; saying &quot;I<br/>\n&gt; don&#39;t want to upset you, but&quot;, etc. It has really gotten my <br/>\n&gt; attention as to<br/>\n&gt; how it feels for him. The other day, I noticed how bad the bottom <br/>\n&gt; of his<br/>\n&gt; foot has gotten (they peel, and he picks at it, and now it is really <br/>\n&gt; red and<br/>\n&gt; raw with a couple of deep fissures that make me nervous about <br/>\n&gt; infection).<br/>\n&gt; Anyway, I asked to look at them more closely, and mentioned that it <br/>\n&gt; might be<br/>\n&gt; time to go to the doctor to see if she has any ideas. He totally <br/>\n&gt; flipped,<br/>\n&gt; poor guy. He was cowering in the corner of my bed, shaking.<br/>\n<br/>\n </span></blockquote>So, you know that he has fear around doctor&#39;s visits. Maybe, before <br/>\nyou mention that likelihood to him, research the possibilities for <br/>\nhealing his foot without going to the doctor. There are naturopaths <br/>\nand homeopaths who don&#39;t use needles and have success with such <br/>\nongoing issues. But, you could inform yourself first.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; See, he&#39;s had this paranoia about going to the doctor meaning having <br/>\n&gt; shots.<br/>\n&gt; We actually stopped vaxing several years ago, when he had a scary <br/>\n&gt; reaction<br/>\n&gt; to the DTaP, and the only thing &quot;shot-like&quot; that he&#39;s had since then <br/>\n&gt; has<br/>\n&gt; been bloodwork to evaluate for allergies which run in my family. <br/>\n&gt; Don&#39;t even<br/>\n&gt; get me started about that decision--he turned up positive to three <br/>\n&gt; foods,<br/>\n&gt; only to have the allergist say that it was such a weak positive, <br/>\n&gt; that it<br/>\n&gt; could be ignored, and then imply in his notes that I pushed for the <br/>\n&gt; testing,<br/>\n&gt; when I never would have done it w/o his insistence. I&#39;ve learned a <br/>\n&gt; lot<br/>\n&gt; about standing up to doctors the last few years.<br/>\n&gt;<br/>\n&gt; Anyway, I told him that the only thing I could anticipate him <br/>\n&gt; getting shots<br/>\n&gt; for would be if he got bitten by an animal somehow (course doesn&#39;t <br/>\n&gt; our dog<br/>\n&gt; go and accidentally bite him and break the skin the very next day, <br/>\n&gt; but it&#39;s<br/>\n&gt; okay.<br/>\n<br/>\n </span></blockquote>I&#39;m not sure I would even bring this up to my daughter, who has a lot <br/>\nof fear around doctors, dentists and needles. It would set up another <br/>\nfear in her mind about being bitten by a dog and what would happen <br/>\nafter that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I ran it by the doc and they said just to watch it for infection. It<br/>\n&gt; was also another opportunity to assure him that I know and Dr. V. <br/>\n&gt; knows how<br/>\n&gt; much he doesn&#39;t want shots and we are doing our best to honor <br/>\n&gt; that). I said<br/>\n&gt; this in an effort to help him feel more relaxed about going to the <br/>\n&gt; doctor,<br/>\n&gt; which though we don&#39;t do it often, there are times when it is <br/>\n&gt; prudent (like<br/>\n&gt; with his foot and when he had Lyme&#39;s Disease for the 2nd time).<br/>\n<br/>\n </span></blockquote>So, it might be better not to try to help him feel more relaxed. Go <br/>\nwhen you really need to go and help him *right then* with his fears. <br/>\nDon&#39;t talk about what may or may not happen, because that can be <br/>\nstressful. I used to do just this kind of thing with my very <br/>\nsensitive, reactive, and imaginative daughter and it would just set <br/>\nher up for too much worrying about the future. I thought I was helping <br/>\nby &quot;preparing&quot; her. It didn&#39;t help much at all, especially if I went <br/>\ninto detail or talked about it more than once.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; At any rate, he says to me while balled up on my bed after I asked <br/>\n&gt; to see<br/>\n&gt; his foot &quot;but I&#39;m just different like the guy with Tourette&#39;s&quot; (we <br/>\n&gt; just<br/>\n&gt; watched a movie about a man living with Tourette&#39;s). It actually <br/>\n&gt; was a<br/>\n&gt; really nice opportunity to heal, I think. I just assured him that I <br/>\n&gt; would<br/>\n&gt; never intend to make fun of him, that I&#39;m really sorry that&#39;s what he<br/>\n&gt; thought, that it&#39;s totally okay to be who he is, and how much I love <br/>\n&gt; him for<br/>\n&gt; who he is, etc. I&#39;m very aware that I need to be cautious about <br/>\n&gt; talking<br/>\n&gt; about him to others, as even though I&#39;m always doing so lovingly and <br/>\n&gt; out of<br/>\n&gt; concern, or pride, he doesn&#39;t hear it that way.<br/>\n<br/>\n </span></blockquote>My dd doesn&#39;t like to be talked about either. It can be construed as <br/>\ndisrespect. Not every person feels this way, but I need to honor *her* <br/>\nneed for privacy. How I see her will be different from how she sees <br/>\nherself, too.<br/>\n<br/>\nI remember it this way: if my husband was talking about me, in front <br/>\nof me, to others (even if it was loving, with pride or out of concern) <br/>\nI might feel uncomfortable, embarrassed and possibly miffed.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He&#39;s a lot like me<br/>\n&gt; actually. I&#39;ve told my mother, etc., that we can&#39;t talk right now, <br/>\n&gt; etc. and<br/>\n&gt; how senstive he is to criticism. My parents have done a lot of <br/>\n&gt; comparing<br/>\n&gt; him to my niece, who is his age, re: his fears for TV shows, etc.<br/>\n<br/>\n </span></blockquote>I&#39;ve found it was important to protect my daughter from those <br/>\ncomparisons by not over-emphasizing her differences, nor entertaining <br/>\nmuch discussion with grandparents about it. All kids have their own <br/>\ntimelines, quirks, and fears, some more apparent than others. <br/>\nExplaining too much can sound like defensiveness. Being a child&#39;s <br/>\nadvocate sometimes means diverting attention.<br/>\n<br/>\nI notice there are many situations and explanations throughout your <br/>\npost. Then you ask how you can heal the relationship without really <br/>\ntelling us what you think your relationship is with your son. If you <br/>\ncan think about that, then tell us what you believe is missing or <br/>\nneeds repair, that will help clarify, both for you and the list members.<br/>\n<br/>\nThere may be some value to journalling about these things. Getting <br/>\nyour thoughts down on paper, the stream-of-conscious ness stuff, can <br/>\nhelp to shed some light on what seems daunting at first.<br/>\n<br/>\nRobin B.<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":217951851,"authorName":"Christie Craigie-Carter","from":"&quot;Christie Craigie-Carter&quot; &lt;craigiecarter@...&gt;","profile":"c3_2323","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh","postDate":"1231076174","msgId":37568,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyNGM0ZDBhMDkwMTA0MDUzNnk0N2YxODNmYXFjY2VlYjU5M2RhNWUwMjFlQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEVGNzkyQjlFLUQ0RTUtNDEwOC04OUM1LTY0QjI4QkNENTdDMUBjb21jYXN0Lm5ldD4=","referencesHeader":"PDkyNGM0ZDBhMDkwMTAzMDgzNnczZGNmNzNlZHg3NjdjYjM4NzFhYmY0MjFhQG1haWwuZ21haWwuY29tPgkgPEVGNzkyQjlFLUQ0RTUtNDEwOC04OUM1LTY0QjI4QkNENTdDMUBjb21jYXN0Lm5ldD4="},"prevInTopic":37567,"nextInTopic":37569,"prevInTime":37567,"nextInTime":37569,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"... Yes, sorry.  The relationship with my son.  He doesn t trust us, of that I m sure.  And I could easily get defensive and say that it is ridiculous because","messageBody":"<div id=\"ygrps-yiv-2065221348\">On Sat, Jan 3, 2009 at 11:32 PM, Robin Bentley &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robin.bentley@...\">robin.bentley@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   &gt;<br/>\n&gt; &gt; I&#39;d love suggestions about continuing to help us heal that<br/>\n&gt; &gt; relationship.<br/>\n&gt;<br/>\n&gt; The relationship between you and your son? There are a lot of people<br/>\n&gt; in the previous few paragraphs, so just checking....<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Yes, sorry.  The relationship with my son.  He doesn&#39;t trust us, of that I&#39;m<br/>\nsure.  And I could easily get defensive and say that it is ridiculous<br/>\nbecause of course we love him, etc., but none of that matters.  What matters<br/>\nis that he feels the way he does and it&#39;s our job to help him feel better.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; If you haven&#39;t read Pam Sorooshian&#39;s writing on the subject of<br/>\n&gt; &quot;becoming the parent you want to be&quot;, take a look:<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com/peace/becoming.html\">http://www.sandradodd.com/peace/becoming.html</a><br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;ve got to bookmark this!  Another challenge has been that I&#39;m not on the<br/>\ncomputer as often, so I end up starring suggestions of links to go to, only<br/>\nto be too overwhelmed and not know where to start when I finally get a<br/>\nchance to go back and look at them, lol.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; It&#39;s been very helpful to me over the years.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Thanks so much!!!!<br/>\n<br/>\nChristie<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh","postDate":"1231049831","msgId":37567,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI4OTZDMkRBLTNGRTctNDkzMS1CMURELTJGQUMwQkUxMjlEOUBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDkyNGM0ZDBhMDkwMTAzMDgzNnczZGNmNzNlZHg3NjdjYjM4NzFhYmY0MjFhQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDkyNGM0ZDBhMDkwMTAzMDgzNnczZGNmNzNlZHg3NjdjYjM4NzFhYmY0MjFhQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":37566,"nextInTopic":37568,"prevInTime":37566,"nextInTime":37568,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"... Hey, we don t even know him . Here s a page on Sandra s site about spouses and how unschooling can make relationships better - it s really good. ","messageBody":"<div id=\"ygrps-yiv-2003462696\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; Now on to another challenge---dh!  First off, no one needs to tell  <br/>\n&gt; me how<br/>\n&gt; great he is.<br/>\n<br/>\n </span></blockquote>Hey, we don&#39;t even know him &lt;g&gt;.<br/>\n<br/>\nHere&#39;s a page on Sandra&#39;s site about spouses and how unschooling can  <br/>\nmake relationships better - it&#39;s really good.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/spouses\">http://sandradodd.com/spouses</a><br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh","postDate":"1231048780","msgId":37566,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVEOTk2NkE4LUIyOUMtNDU1OS05ODBGLUMwMUVFQkVFMzhCM0Bjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDkyNGM0ZDBhMDkwMTAzMDgzNnczZGNmNzNlZHg3NjdjYjM4NzFhYmY0MjFhQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDkyNGM0ZDBhMDkwMTAzMDgzNnczZGNmNzNlZHg3NjdjYjM4NzFhYmY0MjFhQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":37565,"nextInTopic":37567,"prevInTime":37565,"nextInTime":37567,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"...  Whenever I start justifying my less-than-ideal parenting, it really is a clue to me that I need to look at things differently. ... Being aware is","messageBody":"<div id=\"ygrps-yiv-1460961595\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; I had a very stressful day yesterday;<br/>\n<br/>\n </span></blockquote>&lt;snip&gt;<br/>\n<br/>\nWhenever I start justifying my less-than-ideal parenting, it really is  <br/>\na clue to me that I need to look at things differently.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; At this point though, I&#39;m correcting myself after the fact and really<br/>\n&gt; hopeful that I get to the point of catching myself before, which I&#39;ve<br/>\n&gt; certainly done, but not near enough.<br/>\n<br/>\n </span></blockquote>Being aware is the first step towards changing how you react, of  <br/>\ncourse. So, when you notice a trigger, have a plan. Breathe. Breathe  <br/>\nsome more. Remove yourself from the situation for a minute to stop  <br/>\nwhatever cycle you are beginning to enter. Exhaustion is common when  <br/>\nyou have small children and you have three. It will not be like this  <br/>\nforever! But giving your kids the gift of a frustrated-less-often  <br/>\nmother will help your relationships.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; At any rate, I&#39;m sad to see my son<br/>\n&gt; respond the way he does.  He&#39;s very quick to offer an apology for  <br/>\n&gt; upsetting<br/>\n&gt; me, when really he was just being a kid.  He&#39;ll preface things by  <br/>\n&gt; saying &quot;I<br/>\n&gt; don&#39;t want to upset you, but&quot;, etc.  It has really gotten my  <br/>\n&gt; attention as to<br/>\n&gt; how it feels for him.  The other day, I noticed how bad the bottom  <br/>\n&gt; of his<br/>\n&gt; foot has gotten (they peel, and he picks at it, and now it is really  <br/>\n&gt; red and<br/>\n&gt; raw with a couple of deep fissures that make me nervous about  <br/>\n&gt; infection).<br/>\n&gt; Anyway, I asked to look at them more closely, and mentioned that it  <br/>\n&gt; might be<br/>\n&gt; time to go to the doctor to see if she has any ideas. He totally  <br/>\n&gt; flipped,<br/>\n&gt; poor guy.  He was cowering in the corner of my bed, shaking.<br/>\n<br/>\n </span></blockquote>So, you know that he has fear around doctor&#39;s visits. Maybe, before  <br/>\nyou mention that likelihood to him, research the possibilities for  <br/>\nhealing his foot without going to the doctor. There are naturopaths  <br/>\nand homeopaths who don&#39;t use needles and have success with such  <br/>\nongoing issues. But, you could inform yourself first.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; See, he&#39;s had this paranoia about going to the doctor meaning having  <br/>\n&gt; shots.<br/>\n&gt; We actually stopped vaxing several years ago, when he had a scary  <br/>\n&gt; reaction<br/>\n&gt; to the DTaP, and the only thing &quot;shot-like&quot; that he&#39;s had since then  <br/>\n&gt; has<br/>\n&gt; been bloodwork to evaluate for allergies which run in my family.   <br/>\n&gt; Don&#39;t even<br/>\n&gt; get me started about that decision--he turned up positive to three  <br/>\n&gt; foods,<br/>\n&gt; only to have the allergist say that it was such a weak positive,  <br/>\n&gt; that it<br/>\n&gt; could be ignored, and then imply in his notes that I pushed for the  <br/>\n&gt; testing,<br/>\n&gt; when I never would have done it w/o his insistence.  I&#39;ve learned a  <br/>\n&gt; lot<br/>\n&gt; about standing up to doctors the last few years.<br/>\n&gt;<br/>\n&gt; Anyway, I told him that the only thing I could anticipate him  <br/>\n&gt; getting shots<br/>\n&gt; for would be if he got bitten by an animal somehow (course doesn&#39;t  <br/>\n&gt; our dog<br/>\n&gt; go and accidentally bite him and break the skin the very next day,  <br/>\n&gt; but it&#39;s<br/>\n&gt; okay.<br/>\n<br/>\n </span></blockquote>I&#39;m not sure I would even bring this up to my daughter, who has a lot  <br/>\nof fear around doctors, dentists and needles. It would set up another  <br/>\nfear in her mind about being bitten by a dog and what would happen  <br/>\nafter that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I ran it by the doc and they said just to watch it for infection.  It<br/>\n&gt; was also another opportunity to assure him that I know and Dr. V.  <br/>\n&gt; knows how<br/>\n&gt; much he doesn&#39;t want shots and we are doing our best to honor  <br/>\n&gt; that).  I said<br/>\n&gt; this in an effort to help him feel more relaxed about going to the  <br/>\n&gt; doctor,<br/>\n&gt; which though we don&#39;t do it often, there are times when it is  <br/>\n&gt; prudent (like<br/>\n&gt; with his foot and when he had Lyme&#39;s Disease for the 2nd time).<br/>\n<br/>\n </span></blockquote>So, it might be better not to try to help him feel more relaxed. Go  <br/>\nwhen you really need to go and help him *right then* with his fears.  <br/>\nDon&#39;t talk about what may or may not happen, because that can be  <br/>\nstressful. I used to do just this kind of thing with my very  <br/>\nsensitive, reactive, and imaginative daughter and it would just set  <br/>\nher up for too much worrying about the future. I thought I was helping  <br/>\nby &quot;preparing&quot; her. It didn&#39;t help much at all, especially if I went  <br/>\ninto detail or talked about it more than once.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; At any rate, he says to me while balled up on my bed after I asked  <br/>\n&gt; to see<br/>\n&gt; his foot &quot;but I&#39;m just different like the guy with Tourette&#39;s&quot; (we  <br/>\n&gt; just<br/>\n&gt; watched a movie about a man living with Tourette&#39;s).  It actually  <br/>\n&gt; was a<br/>\n&gt; really nice opportunity to heal, I think.  I just assured him that I  <br/>\n&gt; would<br/>\n&gt; never intend to make fun of him, that I&#39;m really sorry that&#39;s what he<br/>\n&gt; thought, that it&#39;s totally okay to be who he is, and how much I love  <br/>\n&gt; him for<br/>\n&gt; who he is, etc.  I&#39;m very aware that I need to be cautious about  <br/>\n&gt; talking<br/>\n&gt; about him to others, as even though I&#39;m always doing so lovingly and  <br/>\n&gt; out of<br/>\n&gt; concern, or pride, he doesn&#39;t hear it that way.<br/>\n<br/>\n </span></blockquote>My dd doesn&#39;t like to be talked about either. It can be construed as  <br/>\ndisrespect. Not every person feels this way, but I need to honor *her*  <br/>\nneed for privacy. How I see her will be different from how she sees  <br/>\nherself, too.<br/>\n<br/>\nI remember it this way: if my husband was talking about me, in front  <br/>\nof me, to others (even if it was loving, with pride or out of concern)  <br/>\nI might feel uncomfortable, embarrassed and possibly miffed.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He&#39;s a lot like me<br/>\n&gt; actually.  I&#39;ve told my mother, etc., that we can&#39;t talk right now,  <br/>\n&gt; etc. and<br/>\n&gt; how senstive he is to criticism.  My parents have done a lot of  <br/>\n&gt; comparing<br/>\n&gt; him to my niece, who is his age, re: his fears for TV shows, etc.<br/>\n<br/>\n </span></blockquote>I&#39;ve found it was important to protect my daughter from those  <br/>\ncomparisons by not over-emphasizing her differences, nor entertaining  <br/>\nmuch discussion with grandparents about it. All kids have their own  <br/>\ntimelines, quirks, and fears, some more apparent than others.  <br/>\nExplaining too much can sound like defensiveness. Being a child&#39;s  <br/>\nadvocate sometimes means diverting attention.<br/>\n<br/>\nI notice there are many situations and explanations throughout your  <br/>\npost. Then you ask how you can heal the relationship without really  <br/>\ntelling us what you think your relationship is with your son. If you  <br/>\ncan think about that, then tell us what you believe is missing or  <br/>\nneeds repair, that will help clarify, both for you and the list members.<br/>\n<br/>\nThere may be some value to journalling about these things. Getting  <br/>\nyour thoughts down on paper, the stream-of-consciousness stuff, can  <br/>\nhelp to shed some light on what seems daunting at first.<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Moving toward more peaceful parenting and help with dh","postDate":"1231043526","msgId":37565,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVGNzkyQjlFLUQ0RTUtNDEwOC04OUM1LTY0QjI4QkNENTdDMUBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDkyNGM0ZDBhMDkwMTAzMDgzNnczZGNmNzNlZHg3NjdjYjM4NzFhYmY0MjFhQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDkyNGM0ZDBhMDkwMTAzMDgzNnczZGNmNzNlZHg3NjdjYjM4NzFhYmY0MjFhQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":37563,"nextInTopic":37566,"prevInTime":37564,"nextInTime":37566,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"... The relationship between you and your son? There are a lot of people in the previous few paragraphs, so just checking.... If you haven t read Pam","messageBody":"<div id=\"ygrps-yiv-91434611\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; I&#39;d love suggestions about continuing to help us heal that  <br/>\n&gt; relationship.<br/>\n<br/>\n </span></blockquote>The relationship between you and your son? There are a lot of people  <br/>\nin the previous few paragraphs, so just checking....<br/>\n<br/>\nIf you haven&#39;t read Pam Sorooshian&#39;s writing on the subject of  <br/>\n&quot;becoming the parent you want to be&quot;, take a look:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com/peace/becoming.html\">http://www.sandradodd.com/peace/becoming.html</a><br/>\n<br/>\nIt&#39;s been very helpful to me over the years.<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":217951851,"authorName":"Christie Craigie-Carter","from":"&quot;Christie Craigie-Carter&quot; &lt;craigiecarter@...&gt;","profile":"c3_2323","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Moving toward more peaceful parenting and help with dh","postDate":"1231000607","msgId":37563,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyNGM0ZDBhMDkwMTAzMDgzNnczZGNmNzNlZHg3NjdjYjM4NzFhYmY0MjFhQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":37565,"prevInTime":37562,"nextInTime":37564,"topicId":37563,"numMessagesInTopic":0,"msgSnippet":"Hi all, I have to admit, I don a bit of armor when I post here, but I also know change doesn t happen unless you take risks, so here I go.  I m not sure ","messageBody":"<div id=\"ygrps-yiv-805404392\">Hi all,<br/>\n<br/>\nI have to admit, I don a bit of armor when I post here, but I also know<br/>\nchange doesn&#39;t happen unless you take risks, so here I go.  I&#39;m not sure<br/>\nwhether we&#39;ll ever be totally radical unschoolers, but I do like the changes<br/>\nI&#39;m seeing in the short time since I made a commitment toward change.  Now,<br/>\nI&#39;m about to take several risks in posting this here, so please keep in mind<br/>\nthat if I didn&#39;t recognize the need for change, and wasn&#39;t willing, I<br/>\nwouldn&#39;t be posting, and that I&#39;m in a vulnerable place atm (fighting back<br/>\nagainst some depression that&#39;s cropping up atm), when you reply to me.  I<br/>\nhope that&#39;s not perceived as rude, but this list seems to appreciate<br/>\ndirectness.<br/>\n<br/>\nI had a very stressful day yesterday; my sleep apnea is horrid from my<br/>\nall-night bout with the stomach bug earlier in the week and exhaustion is<br/>\nprolly the number one trigger for my less-than ideal parenting choices<br/>\n(mostly barking at the kids for being kids), I also notice that I get most<br/>\nfrustrated when trying to complete a task that requires any level of<br/>\nconcentration (already a challenge when exhausted), and the volume level<br/>\ngets really high.  I&#39;m working on that, but the first step was noticing what<br/>\nthe triggers are.  I absolutely love the posts that were put on here a<br/>\ncouple of days ago.<br/>\n<br/>\nAt this point though, I&#39;m correcting myself after the fact and really<br/>\nhopeful that I get to the point of catching myself before, which I&#39;ve<br/>\ncertainly done, but not near enough.  At any rate, I&#39;m sad to see my son<br/>\nrespond the way he does.  He&#39;s very quick to offer an apology for upsetting<br/>\nme, when really he was just being a kid.  He&#39;ll preface things by saying &quot;I<br/>\ndon&#39;t want to upset you, but&quot;, etc.  It has really gotten my attention as to<br/>\nhow it feels for him.  The other day, I noticed how bad the bottom of his<br/>\nfoot has gotten (they peel, and he picks at it, and now it is really red and<br/>\nraw with a couple of deep fissures that make me nervous about infection).<br/>\nAnyway, I asked to look at them more closely, and mentioned that it might be<br/>\ntime to go to the doctor to see if she has any ideas.  He totally flipped,<br/>\npoor guy.  He was cowering in the corner of my bed, shaking.<br/>\n<br/>\nSee, he&#39;s had this paranoia about going to the doctor meaning having shots.<br/>\nWe actually stopped vaxing several years ago, when he had a scary reaction<br/>\nto the DTaP, and the only thing &quot;shot-like&quot; that he&#39;s had since then has<br/>\nbeen bloodwork to evaluate for allergies which run in my family.  Don&#39;t even<br/>\nget me started about that decision--he turned up positive to three foods,<br/>\nonly to have the allergist say that it was such a weak positive, that it<br/>\ncould be ignored, and then imply in his notes that I pushed for the testing,<br/>\nwhen I never would have done it w/o his insistence.  I&#39;ve learned a lot<br/>\nabout standing up to doctors the last few years.<br/>\n<br/>\nAnyway, I told him that the only thing I could anticipate him getting shots<br/>\nfor would be if he got bitten by an animal somehow (course doesn&#39;t our dog<br/>\ngo and accidentally bite him and break the skin the very next day, but it&#39;s<br/>\nokay.  I ran it by the doc and they said just to watch it for infection.  It<br/>\nwas also another opportunity to assure him that I know and Dr. V. knows how<br/>\nmuch he doesn&#39;t want shots and we are doing our best to honor that).  I said<br/>\nthis in an effort to help him feel more relaxed about going to the doctor,<br/>\nwhich though we don&#39;t do it often, there are times when it is prudent (like<br/>\nwith his foot and when he had Lyme&#39;s Disease for the 2nd time).<br/>\n<br/>\nAt any rate, he says to me while balled up on my bed after I asked to see<br/>\nhis foot &quot;but I&#39;m just different like the guy with Tourette&#39;s&quot; (we just<br/>\nwatched a movie about a man living with Tourette&#39;s).  It actually was a<br/>\nreally nice opportunity to heal, I think.  I just assured him that I would<br/>\nnever intend to make fun of him, that I&#39;m really sorry that&#39;s what he<br/>\nthought, that it&#39;s totally okay to be who he is, and how much I love him for<br/>\nwho he is, etc.  I&#39;m very aware that I need to be cautious about talking<br/>\nabout him to others, as even though I&#39;m always doing so lovingly and out of<br/>\nconcern, or pride, he doesn&#39;t hear it that way.  He&#39;s a lot like me<br/>\nactually.  I&#39;ve told my mother, etc., that we can&#39;t talk right now, etc. and<br/>\nhow senstive he is to criticism.  My parents have done a lot of comparing<br/>\nhim to my niece, who is his age, re: his fears for TV shows, etc.<br/>\n<br/>\nI&#39;d love suggestions about continuing to help us heal that relationship.<br/>\n<br/>\nNow on to another challenge---dh!  First off, no one needs to tell me how<br/>\ngreat he is.  I know it.  He&#39;s a phenomenal man, and I love and adore him<br/>\nimmensely.  He loves his kids dearly, although he admits that 3 is stressful<br/>\nto him (me too at times).  He comes from a very traditional parenting<br/>\nbackground, as do most of us, and really is of the belief that kids need to<br/>\nrespect and listen to their parents just b/c.  I have to admit to fighting<br/>\nthat mindset for myself at times.  At any rate, I&#39;ve been broaching small<br/>\nthings with him, w/o saying I heard about it here, b/c he dismisses it then,<br/>\nlike the wish list board idea, and was going to bring up allowance when he<br/>\nhopefully gets a small raise in March (no guarantee with the economy, of<br/>\ncourse).  Well, he brings up allowance himself the other day and I was<br/>\nencouraged.<br/>\n<br/>\nThen, he mentions having it tied to chores (kinda laid back, but, still).<br/>\nUnfortunately, I kind of jumped on him, in that I was so taken aback, that I<br/>\nsaid &quot;No&quot;, rather firmly.  Which I apologized for later, and explained (I<br/>\nwas trying to nurse my youngest to sleep, so that was another reason that I<br/>\nwas more abrupt).  I explained to him that having chores tied to allowance<br/>\nwas just setting us all up to fail.  I don&#39;t think he buys it.  Honestly,<br/>\nwe&#39;re both overwhelmed with how often they all drop things on the ground and<br/>\njust leave them there.  I don&#39;t have high standards, by any means, but I&#39;m<br/>\nvery clumsy, and have often hurt myself b/c of things left on the floor.  I<br/>\nreally worry when I am carrying the 2 yr old, and can&#39;t see obstacles as<br/>\nwell.<br/>\n<br/>\nAt any rate, how do I go about making the positive changes I&#39;m trying to<br/>\nmake, while feeling like I&#39;m causing tension in my relationship?  More<br/>\nimportantly, how can I respect my husband&#39;s concerns and still make changes<br/>\nthat I truly believe are necessary for my children&#39;s well-being?  He has<br/>\nnever been a fan of my decision to homeschool, not to mention unschool, and<br/>\nthis and deciding to have a 3rd child have really been the only times we&#39;ve<br/>\ndisagreed (in any major way) in 17 yrs of knowing each other.  I think he&#39;s<br/>\nmore comfortable with homeschooling, as he&#39;s been able to admit that Josh<br/>\nreally is motivated to learn on his own (which he highly doubted in the<br/>\npast), but he still thinks Josh would benefit from ideas from someone other<br/>\nthan me, from teachers&#39; years of experience, and that it is more work than<br/>\nit is worth (i.e. school doesn&#39;t damage kids).  So, it&#39;s challenging for<br/>\nsure.<br/>\n<br/>\nOkay, I&#39;ve rambled on more than I intended.  I know I brought up several<br/>\nissues, and maybe it would have been better to do it in separate posts,<br/>\nbut....I&#39;m nervous, but also looking forward to your responses.<br/>\n<br/>\nWarmly,<br/>\n<br/>\nChristie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":37548,"nextTopicId":37727}}