{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":466539614,"authorName":"Mahara Ashlie","from":"Mahara Ashlie &lt;mahara@...&gt;","profile":"maharaashlie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: back to school??!","postDate":"1348937884","msgId":49120,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUxMjBBRkFCLUQ2QjEtNEQ4Qy1CRjhGLTVEQkJDNjM3RUNCRkBjb21jYXN0Lm5ldD4="},"prevInTopic":49015,"nextInTopic":0,"prevInTime":49119,"nextInTime":49121,"topicId":49009,"numMessagesInTopic":0,"msgSnippet":"I just wanted to get back to everyone on this- some time has gone by and we have had a chance to work this through. We discussed it with our daughter and told","messageBody":"<div id=\"ygrps-yiv-1607780403\">I just wanted to get back to everyone on this- some time has gone by and we have had a chance to work this through. <br/>\n<br/>\nWe discussed it with our daughter and told her to give it a few days to decide if this is what she wants. Meanwhile we talked about how we can make un schooling and being home better for her. After several days she let us know she did not want to go back to school, but may decide to at some point. I have changed my business hours at home to give us more freedom and arranged for weekly outdoor activity with other children. The homeschool library group has also since started back up. and- We are now going to the local UU church and she is having fun connecting with more kids. <br/>\n<br/>\nSo- thank you for the feedback. It did help us to prioritize and life is good again!</div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: back to school??!","postDate":"1347136645","msgId":49015,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGsyZ2FhNStvanAwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGsyZDMxais2M2RyQGVHcm91cHMuY29tPg=="},"prevInTopic":49014,"nextInTopic":49120,"prevInTime":49014,"nextInTime":49016,"topicId":49009,"numMessagesInTopic":0,"msgSnippet":"What, if anything, has your daughter been doing with other kids, for the past couple of years? Any homeschool classes, clubs, sports, other types of group","messageBody":"<div id=\"ygrps-yiv-2044653216\">What, if anything, has your daughter been doing with other kids, for the past couple of years? Any homeschool classes, clubs, sports, other types of group activities, kids in the neighborhood she can play with after school and on weekends, etc? If none of these, do any of these opportunities for socializing exist near you? If organized classes, activities, or sports are unaffordable, could you run a group from your home? Is there a Girl Scout troop or Campfire Kids group she could join? <br/>\n<br/>\nHow far are you from the nearest unschooling or casual/relaxed, open-minded homeschoolers with kids in the same general age range? What would be involved in getting the kids together?<br/>\n<br/>\nWhat does your daughter typically spend her time doing? What would she like to do with her time, if anything, other than going to school?<br/>\n<br/>\nWould having a homeschool group meet at your home (or a nearby library or rec center) several times a week be an option? You could bring in outside teachers - people who are experts in some skill or topic, and just want to share what they love with a group of kids. Unschoolers in my area typically enjoy going to classes with other homeschoolers, especially when those classes are NOT taught in school-ish ways, and are taught by someone who is teaching because s/he loves the subject. My kids took all kinds of classes with other homeschoolers, including art, dance, sports, acting, woodworking, pottery/clay sculpting, creative writing, medieval history (taught by a woman who is a member of the &quot;Society for Creative Anachronism&quot;, in a very creative, activity-based way), Famous Supreme Court Cases - a class called &quot;You Decide&quot; - where the kids heard the cases and then discussed them in small groups and told the larger group how they would have ruled, if they had been the judge. Art-based geometry. Rocket science. <br/>\n<br/>\nOther unschoolers and creative homeschoolers whom we know have played on hockey teams, gone bowling every week, gotten very involved in children&#39;s theater groups or bands or dance companies, met weekly for Pokemon games, participated in First Lego League, enjoyed literature-and-movie discussion groups, participated in weekly classes at local nature centers, had adventures with scout groups, participated in science clubs, and more. Even if your family is the only unschooling family nearby, perhaps there are more school-ish homeschoolers who would jump at the opportunity to bring their kids to some enrichment classes or activities of you can arrange them?<br/>\n<br/>\nIf it turns out that school is the ONLY option for her, to have a social life, is private school an option? If so, are there any progressive/alternative schools near you?<br/>\n<br/>\nIf public school is the only option, is there anything you can do to make school life easier for her? Can you give her the choice, at home, of opting out of homework, and do something to prevent the teachers from punishing her for not getting homework done? Get permission for her to read what she wants, when she wants, in class, as long as she doesn&#39;t disrupt the others? Write a letter to the principal and all of her teachers letting them know that you are still really &quot;homeschooling&quot;, and only enrolling her for the social aspect?<br/>\n<br/>\nIs enrolling in school part-time an option?<br/>\n<br/>\nBefore I ask any more questions, I should ask - are you in the U.S.? Some of the suggestions I have made (or could make) might not apply at all in other countries. Even Meredith&#39;s comment about the level of instruction in U.S. public schools, and the fact that your daughter could probably catch up easily, which I would tend to agree with, would not necessarily apply to schools in other countries.<br/>\n<br/>\nLinda<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Mahara Ashlie&quot; &lt;mahara@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; My 9 year old woke up this morning with a breakdown... she cried and cried and insists she wants to go back to school. She has been out of school for two years. We took her out 3 months into 2nd grade. She was miserable and mean. She hated school and begged to leave school. It took over a year to detox her from her school experience. We have been unschooling now for over a year. Prior to that we tried public school at home with K12 and then a more relaxed home school method. Neither &quot;worked&quot;. She is an only child and we have a home based business. We do not have any local unschool friends. She is feeling isolated and alone. She misses her school friends and connection with other kids. She is begging us to let her go back to school... I am tempted to let her try it again, but I do not want to set her up for more misery and a feeling of failure... or worse I don&#39;t want her to feel &quot;stupid&quot; since I know she will be out of the loop with what the other kids are currently doing for math, etc. HELP! what should we do??<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: back to school??!","postDate":"1347129109","msgId":49014,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGsyZzJ1bCs1aHVuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGsyZjRvbis4aDBwQGVHcm91cHMuY29tPg=="},"prevInTopic":49013,"nextInTopic":49015,"prevInTime":49013,"nextInTime":49015,"topicId":49009,"numMessagesInTopic":0,"msgSnippet":"... ************** He could catch up once he s in school, though - it s an unnecessary constraint to insist that he homeschool if he wants to go to school.","messageBody":"<div id=\"ygrps-yiv-1182837461\">&quot;jeremieweldin&quot; &lt;jweldin@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; (We also touched on the issue that we were allowing him to learn at his own pace and that if he wanted to return to public school, then he would need to start opting for a more standardized curriculum and schedule in order to be at the same level in all subjects that his peers would be at. He understands that if he wants to return to school, there is a bit of effort on his part that we expect to happen first.)<br/>\n </span></blockquote>**************<br/>\n<br/>\nHe could catch up once he&#39;s in school, though - it&#39;s an unnecessary constraint to insist that he homeschool if he wants to go to school. Unschoolers and eclectic homeschoolers who try school generally have little trouble catching on - don&#39;t forget, one of the down sides of the assembly-line education is that &quot;progress&quot; is actually very slow and accomplished with endless rehashing of the same material. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":213330454,"authorName":"jeremieweldin","from":"&quot;jeremieweldin&quot; &lt;jweldin@...&gt;","profile":"jeremieweldin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: back to school??!","postDate":"1347098199","msgId":49013,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGsyZjRvbis4aDBwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGsyZDMxais2M2RyQGVHcm91cHMuY29tPg=="},"prevInTopic":49012,"nextInTopic":49014,"prevInTime":49012,"nextInTime":49014,"topicId":49009,"numMessagesInTopic":0,"msgSnippet":"We had the same issue a few days ago with our 9 y/o son. His issue was the friends thing as well. We discussed the pros and cons of going back and he agreed","messageBody":"<div id=\"ygrps-yiv-694855682\">We had the same issue a few days ago with our 9 y/o son.<br/>\n<br/>\nHis issue was the friends thing as well. <br/>\n<br/>\nWe discussed the pros and cons of going back and he agreed that the problem was that we didn&#39;t have enough social activities going on for his liking. <br/>\n<br/>\n(We also touched on the issue that we were allowing him to learn at his own pace and that if he wanted to return to public school, then he would need to start opting for a more standardized curriculum and schedule in order to be at the same level in all subjects that his peers would be at. He understands that if he wants to return to school, there is a bit of effort on his part that we expect to happen first.)<br/>\n<br/>\nSince then, soccer has started up and he seems more content knowing that he will have &quot;friends&quot; again, but soccer is only 2 hours a week. We are looking into more sports/team activities for him to be involved in.<br/>\n<br/>\nThe hardest part of unschooling for us has definitely been the friends issue. We are a non-religious, non-military family living in the midst of what seems like all baptist military families. It can be hard for us to find families that share our values enough for our children to play together without concern from either side. My boys lost two good friends this year when their parents realized that my religious views were Atheistic. <br/>\n<br/>\nI do freelance software development from home and my wife is a full-time mother, so we are around to interact with our kids when they want, but playing legos or Minecraft with dad or mom is just not the same as playing with kids their age. <br/>\n<br/>\nI don&#39;t have a solution for you, but I can at least offer you an &quot;I hear ya&quot; or &quot;you&#39;re not alone&quot; for whatever that might be worth. :/<br/>\n<br/>\n-Jeremie Weldin<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Mahara Ashlie&quot; &lt;mahara@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; My 9 year old woke up this morning with a breakdown... she cried and cried and insists she wants to go back to school. She has been out of school for two years. We took her out 3 months into 2nd grade. She was miserable and mean. She hated school and begged to leave school. It took over a year to detox her from her school experience. We have been unschooling now for over a year. Prior to that we tried public school at home with K12 and then a more relaxed home school method. Neither &quot;worked&quot;. She is an only child and we have a home based business. We do not have any local unschool friends. She is feeling isolated and alone. She misses her school friends and connection with other kids. She is begging us to let her go back to school... I am tempted to let her try it again, but I do not want to set her up for more misery and a feeling of failure... or worse I don&#39;t want her to feel &quot;stupid&quot; since I know she will be out of the loop with what the other kids are currently doing for math, etc. HELP! what should we do??<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"wideaware","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] back to school??!","postDate":"1347041086","msgId":49012,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBK0pjUUhneVJhc0NyK0ZpN2oyMzZZWG5YK2JIaUNEM25kdFNiaVVuQlJWcExPcHlxZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGsyZDMxais2M2RyQGVHcm91cHMuY29tPg==","referencesHeader":"PGsyZDMxais2M2RyQGVHcm91cHMuY29tPg=="},"prevInTopic":49011,"nextInTopic":49013,"prevInTime":49011,"nextInTime":49013,"topicId":49009,"numMessagesInTopic":0,"msgSnippet":"By detox, I assume you mean deschool. Doesn t sound like that has happened though I am no authority, never having sent son to school. school has stopped, but","messageBody":"<div id=\"ygrps-yiv-901193581\">By detox, I assume you mean deschool.<br/>\n<br/>\nDoesn&#39;t sound like that has happened though I am no authority, never having<br/>\nsent son to school. school has stopped, but new patterns seem to be<br/>\nmissing. Limbo.<br/>\n<br/>\nTo me it sounds like she is lonely and not quite sure what to do about it<br/>\nnow that school is not an option.<br/>\n<br/>\nFor a 9yo to not have company to do stuff with can be harsh. Maybe that&#39;s<br/>\nthe appeal of school, though it is best you ask when she brings it up.<br/>\n<br/>\nCompany can be any age. If there aren&#39;t kids around, can you weave her into<br/>\nyour day somehow? As in fun stuff, not child labor :p Other<br/>\nemployee/co-workers can bring over kids? friends, relatives, kids in<br/>\nlocality? But enough she can count on, not meeting kids on and off.<br/>\nRoutines, access, maybe phone numbers.<br/>\n<br/>\nAlso worth considering if absolutely no company is possible for her....<br/>\nthen think of sending her to school - as her wish.<br/>\n<br/>\nIt isn&#39;t unschooling to deprive a kid of school when they are thirsting for<br/>\nit. Let her go, meet people, form bonds she needs - as long as she wants,<br/>\nkeep building options.<br/>\n<br/>\nVidyut<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: back to school??!","postDate":"1347039138","msgId":49011,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGsyZGIzMitpZWtmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGsyZDMxais2M2RyQGVHcm91cHMuY29tPg=="},"prevInTopic":49010,"nextInTopic":49012,"prevInTime":49010,"nextInTime":49012,"topicId":49009,"numMessagesInTopic":0,"msgSnippet":"... ***************** Those sound like good reasons for her to want to go back - home isn t meeting her needs. It may be that being able to choose school will","messageBody":"<div id=\"ygrps-yiv-537298596\">&quot;Mahara Ashlie&quot; &lt;mahara@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;She is an only child and we have a home based business. We do not have any local unschool friends. She is feeling isolated and alone. She misses her school friends and connection with other kids.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nThose sound like good reasons for her to want to go back - home isn&#39;t meeting her needs. It may be that being able to choose school will make it a better experience for her, especially if she knows she has the option of leaving again. She&#39;s actively choosing the better option - that makes a big difference in a person&#39;s experience!<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/schoolchoice\">http://sandradodd.com/schoolchoice</a><br/>\n<br/>\nI&#39;m guessing from the way that quote (above) is worded that your home-based business takes up a lot of time and energy. That&#39;s one of the downsides of working for yourself - it can take you away from your kids and make unschooling harder. If you can find ways to cut back on your involvement with your business so that you can do more fun, interesting things with your kid, get her out and help her meet people, then you may be able to provide something as good or better than school. If you&#39;re willing to do that, let her know and ask for a second chance. Admit that you screwed up and want to make things better - and then do it. <br/>\n<br/>\nSometimes people think a home business or farm is an ideal environment for unschooling, and it can be for some families. But it can also suck up the resources which would otherwise go to building better family relationships and drive a wedge between parents and kids. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] back to school??!","postDate":"1347039118","msgId":49010,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3NTJCOTg4LUNCRTMtNDIyRi04QjIyLTA3RUI0OENDM0Y5NkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGsyZDMxais2M2RyQGVHcm91cHMuY29tPg==","referencesHeader":"PGsyZDMxais2M2RyQGVHcm91cHMuY29tPg=="},"prevInTopic":49009,"nextInTopic":49011,"prevInTime":49009,"nextInTime":49011,"topicId":49009,"numMessagesInTopic":0,"msgSnippet":"On Sep 7, 2012, at 11:14 AM, Mahara Ashlie wrote: It sound like if this ... is her problem. and this ... is the solution to it you ve managed so far, it","messageBody":"<div id=\"ygrps-yiv-1714033883\"><blockquote><span title=\"qreply\">On Sep 7, 2012, at 11:14 AM, Mahara Ashlie wrote:<br/>\n<br/>\nIt sound like if this<br/>\n<br/>\n&gt; She is feeling isolated and alone. She misses her school friends and connection with other kids<br/>\n<br/>\nis her problem. and this<br/>\n<br/>\n&gt; She is an only child and we have a home based business. We do not have any local unschool friends.<br/>\n<br/>\nis the solution to it you&#39;ve managed so far, it shouldn&#39;t be surprising that she&#39;s grasping at the one solution to her problem that she&#39;s familiar with.<br/>\n<br/>\nYour post focuses on your daughter&#39;s solution, not on her problem. So the question you should really be asking is how to get her together with other kids. You need some out of the box solutions.<br/>\n<br/>\nObviously having a home based business will make it more difficult but if the business becomes an obstacle in solving her problem then you&#39;re basically prioritizing the business over her and you might as well let her go back to school. If you want unschooling to succeed, then the relationships in your family and your daughter&#39;s needs need to be your first priority and then everything else will need to fit around those.<br/>\n<br/>\nWhile you&#39;re waiting for ideas, &quot;finding friends&quot; might help you pull up some threads from the archives of the list.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":466539614,"authorName":"Mahara Ashlie","from":"&quot;Mahara Ashlie&quot; &lt;mahara@...&gt;","profile":"maharaashlie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"back to school??!","postDate":"1347030899","msgId":49009,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGsyZDMxais2M2RyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":49010,"prevInTime":49008,"nextInTime":49010,"topicId":49009,"numMessagesInTopic":0,"msgSnippet":"My 9 year old woke up this morning with a breakdown... she cried and cried and insists she wants to go back to school. She has been out of school for two","messageBody":"<div id=\"ygrps-yiv-297831837\">My 9 year old woke up this morning with a breakdown... she cried and cried and insists she wants to go back to school. She has been out of school for two years. We took her out 3 months into 2nd grade. She was miserable and mean. She hated school and begged to leave school. It took over a year to detox her from her school experience. We have been unschooling now for over a year. Prior to that we tried public school at home with K12 and then a more relaxed home school method. Neither &quot;worked&quot;. She is an only child and we have a home based business. We do not have any local unschool friends. She is feeling isolated and alone. She misses her school friends and connection with other kids. She is begging us to let her go back to school... I am tempted to let her try it again, but I do not want to set her up for more misery and a feeling of failure... or worse I don&#39;t want her to feel &quot;stupid&quot; since I know she will be out of the loop with what the other kids are currently doing for math, etc. HELP! what should we do??</div>","specialLinks":[]}],"prevTopicId":49084,"nextTopicId":49048}}