{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":105977377,"authorName":"Alison Broadbent","from":"Alison Broadbent &lt;abzb@...&gt;","profile":"tttrrrsz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: Perfecting our relationships instead of our children","postDate":"1094834562","msgId":3101,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZGMUU4MTNGLTAzNDgtMTFEOS05QzgzLTAwMEQ5MzUyNDIxQUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDEwOTQ4MTA4NzIuMTcwLjE0ODY2Lm0xMkB5YWhvb2dyb3Vwcy5jb20+","referencesHeader":"PDEwOTQ4MTA4NzIuMTcwLjE0ODY2Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":3094,"nextInTopic":0,"prevInTime":3100,"nextInTime":3102,"topicId":3068,"numMessagesInTopic":0,"msgSnippet":"... Yes yes!  There have been so many challenges.  I think about a year went by before my ds 4 1/2, would let me wash his hair.  He hated water on his head or","messageBody":"<div id=\"ygrps-yiv-840968942\">On Sep 10, 2004, at 3:07 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt;&lt;&quot;Stop trying to perfect your child, but keep trying to perfect your<br/>\n&gt; relationship with him.&quot; Dr. Henker&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Yes yes!  There have been so many challenges.  I think about a year <br/>\nwent by before my ds 4 1/2, would let me wash his hair.  He hated water <br/>\non his head or face and I just had to let it go.  I certainly didn&#39;t <br/>\nthink it would be THAT long.  When we would go out and people would ask <br/>\nabout the color of his hair my DS and I would joke that we really <br/>\ndidn&#39;t know what color it was since it could be all the elements <br/>\ncoating the hair.<br/>\n<br/>\nOne thing that was a huge moment, in difficulty and in revelation <br/>\nhappened when he was just turing 3.  We had had his b&#39;day party before <br/>\nthanksgiving, then came Hanukkah and his real b&#39;day and then came xmas. <br/>\n  LOTS and LOTS of presents.  If he got soemthing he didn&#39;t particularly <br/>\nlike he&#39;d ask if there was another present and then start crying for <br/>\nanother present while the present giver was right there.  This happened <br/>\nlots.  I tried talking aobut how a present was given from love and how <br/>\nif it&#39;s not the present he wanted we still thanked the person.  I had <br/>\nall these thoughts about not wanting an ungrateful child.  It was then <br/>\nthat I started reading &quot;How to Talk so your kids will listen...: and I <br/>\nrealized these were all my issues.  One reason I realized this was so <br/>\ndifficult for me was that growing up I never felt I got presents that <br/>\nspoke to who i was and felt deprived growing up.  After I realized <br/>\nthat, the next time this came up, I just looked at him and said gently, <br/>\n&quot;you just want more, don&#39;t you&quot;  And his tension lifted, he fell into <br/>\nmy arms and cried saying yeessss.  And then he moved on.<br/>\n<br/>\nI could have gone on and on lecturing him about the beauty of giving <br/>\nand receiving blah blah.  And all true but that wasn&#39;t what was going <br/>\non. I saw how if I can get behind what&#39;s going on and speak to that he <br/>\ncan feel at peace and move on.<br/>\n<br/>\nAlison</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Perfecting our relationships instead of our children","postDate":"1094796558","msgId":3094,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PEhJRVBLT09FRUlBSUJISFBKRUJQR0VKRURBQUEuc2FsZ2Vub3Zlc2VAd29ybGRuZXQuYXR0Lm5ldD4="},"prevInTopic":3083,"nextInTopic":3101,"prevInTime":3093,"nextInTime":3095,"topicId":3068,"numMessagesInTopic":0,"msgSnippet":" ","messageBody":"<div id=\"ygrps-yiv-1938159774\">&lt;&lt;&lt;&quot;Stop trying to perfect your child, but keep trying to perfect your<br/>\nrelationship with him.&quot; Dr. Henker&gt;&gt;&gt;<br/>\n<br/>\n&lt;&lt;&lt;&lt;Anyone else have any challenges to share that this quote inspires, or<br/>\nany hallmark moments with your child where you changed from trying to<br/>\nperfect your child to trying to perfect your relationship?  How did it go?<br/>\nI&#39;d love to be inspired by you and your child...&gt;&gt;&gt;&gt;<br/>\n<br/>\nThanks for reminding me of this quote and idea. I&#39;m going to think on it<br/>\nfurther.<br/>\n<br/>\nActually the person who seems to be really good at keeping this notion to<br/>\nthe forefront is dh, James. He has a great way of saying to other people who<br/>\nmight be critical, &quot;That&#39;s just where she is right now&quot;. He has become much<br/>\nmore relaxed about Jayn&#39;s toe and finger nail biting after reading the<br/>\nadvice sent from Unschoolers about that. It applies to me in letting go of<br/>\nJayn&#39;s hair tangle issue. She won&#39;t brush it and that&#39;s OK. <br/>\n<br/>\nI guess my &quot;problem&quot; ;) is that most of the time I already think with<br/>\nbewildered wonder that Jayn is just about perfect, especially in her<br/>\ndealings with other people. I want to remember to see her challenging<br/>\nbehaviors towards me and James, as being our problem not hers. We have not<br/>\nfound the cause, or met the need, so she gets frustrated and overwhelmed.<br/>\nThat&#39;s what the quote reminds me to do.<br/>\n<br/>\nIn passing I might add that replacing the word &quot;child&quot; with &quot;spouse&quot; would<br/>\nalso result in a positive life-concept.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.752 / Virus Database: 503 - Release Date: 9/3/2004</div>","specialLinks":[]},{"userId":92643757,"authorName":"Leslie530@aol.com","from":"Leslie530@...","profile":"lescather","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Perfecting our relationships instead of our children","postDate":"1094759229","msgId":3083,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkNS4yYWMyOGY3My4yZTcyMGQzZEBhb2wuY29tPg=="},"prevInTopic":3080,"nextInTopic":3094,"prevInTime":3082,"nextInTime":3084,"topicId":3068,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/9/2004 8:39:40 AM Eastern Daylight Time, salgenovese@worldnet.att.net writes: Anyone  else have any challenges to share that this quote","messageBody":"<div id=\"ygrps-yiv-872164397\">In a message dated 9/9/2004 8:39:40 AM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:salgenovese@...\">salgenovese@...</a> writes:<br/>\n<br/>\nAnyone  else have any challenges to share that this quote inspires, or any<br/>\nhallmark  moments with your child where you changed from trying to perfect<br/>\nyour child  to trying to perfect your relationship?  How did it go?  I&#39;d  love<br/>\nto be inspired by you and your  child...<br/>\n<br/>\nJoan<br/>\n<br/>\n<br/>\n<br/>\nJoan, I put that quote from Valerie&#39;s book on my fridge!<br/>\n <br/>\nI have a nearly 8YO who was a hitter when he was your child&#39;s age.  I  have <br/>\nno quick answers, but he rarely hits now...so something went right!<br/>\n <br/>\nI will say, in the spirit of the &quot;perfecting our relationships, not our  <br/>\nchildren&quot; quote, when I find my kids are not getting along with each other or  us, <br/>\nthat is always the time to really work on perfecting our relationship.   For <br/>\nus, perhaps taking an afternoon away from home in a quiet park where I will  <br/>\nplay with them however they like.  I&#39;ll take a bag full of books or toys,  <br/>\nperhaps something we haven&#39;t done in awhile.  If one child is having a hard  time, <br/>\nwe&#39;ll go to a favorite restaurant or the store to pick out a new  toy.  <br/>\nSometimes I join them in something they usually do without me. It all  sounds like <br/>\nunschooling, but I see it as I time to really refocus myself on my  child <br/>\nwithout the other demands of my life getting in the way.  The dishes  and phone <br/>\ncalls are put on hold for awhile.  <br/>\n <br/>\nI usually find that it is me that needs to change, not the child or the  <br/>\nbehavior that needs to be fixed.  And unfortunately it usually takes me a  couple <br/>\nof days to catch on!!  But I know that when the relationship is the  focus, <br/>\nlife is much more joyful for everyone involved and the behaviors that are  hard <br/>\nto live with tend to disappear.  The hard part for me is retaining  that focus <br/>\nas much as I would like (without the dishes piling up).<br/>\n <br/>\nThanks for that quote, Valerie!<br/>\n <br/>\nLeslie<br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78615010,"authorName":"mamaaj2000","from":"&quot;mamaaj2000&quot; &lt;mamaaj2000@...&gt;","profile":"mamaaj2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Perfecting our relationships instead of our children","postDate":"1094756897","msgId":3080,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNocTluMSt0ZDRrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEhJRVBLT09FRUlBSUJISFBKRUJQR0VKRURBQUEuc2FsZ2Vub3Zlc2VAd29ybGRuZXQuYXR0Lm5ldD4="},"prevInTopic":3068,"nextInTopic":3083,"prevInTime":3079,"nextInTime":3081,"topicId":3068,"numMessagesInTopic":0,"msgSnippet":"... Genovese  wrote: Due to the wonderful suggestions in The ... diminished, he has ... hitting ... Joan, I m so glad to hear this! ... Me","messageBody":"<div id=\"ygrps-yiv-798371824\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Joan Labbe & Salvatore <br/>\nGenovese&quot; &lt;salgenovese@w...&gt; wrote:<br/>\n Due to the wonderful suggestions in &quot;The<br/>\n<blockquote><span title=\"ireply\"> &gt; Explosive Child&quot; that I have done, his rages have greatly <br/>\n </span></blockquote>diminished, he has<br/>\n<blockquote><span title=\"ireply\"> &gt; hardly any right now, but he is doing more lately of sort of casual <br/>\n </span></blockquote>hitting<br/>\n<blockquote><span title=\"ireply\"> &gt; of his sister in particular and me. <br/>\n<br/>\n </span></blockquote>Joan, I&#39;m so glad to hear this!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;It&#39;s hard for me not to approach the situation from a &quot;fix it&quot;<br/>\n&gt; and &quot;fix the behavior&quot; perspective.<br/>\n<br/>\n </span></blockquote>Me too. I am an only child and have always been horrified by how <br/>\nsiblings treat each other and how parents LET THEM. I used to <br/>\ncompletely over-react. I&#39;m learning to chill. I think it was on the <br/>\nAP-Discipline list that I learned the phrase &quot;gentle words, gentle <br/>\ntouch&quot; which have helped me a lot. I sound darn silly yelling that, <br/>\nso it helps me calm down and reminds me to go over and model it. If <br/>\nI&#39;m not getting upset or mad, I can listen to what the child is upset <br/>\nabout and help. <br/>\n<br/>\nI&#39;ve been really stressed about having near zero energy and how <br/>\nlittle the kids have been doing, etc. etc. While there have been <br/>\ntimes where they were bored and unhappy, I&#39;m learning to see that <br/>\nactually, those times are rare. While they would prefer we were out <br/>\nand about more, they are doing fine. Instead of worrying about _what_ <br/>\nwe are doing, I&#39;m looking to connect first and worry later!<br/>\n<br/>\n--aj</div>","specialLinks":[]},{"userId":31945013,"authorName":"Joan Labbe & Salvatore Genovese","from":"&quot;Joan Labbe & Salvatore Genovese&quot; &lt;salgenovese@...&gt;","profile":"jrl01760","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Perfecting our relationships instead of our children","postDate":"1094730640","msgId":3068,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEhJRVBLT09FRUlBSUJISFBKRUJQR0VKRURBQUEuc2FsZ2Vub3Zlc2VAd29ybGRuZXQuYXR0Lm5ldD4=","inReplyToHeader":""},"prevInTopic":0,"nextInTopic":3080,"prevInTime":3067,"nextInTime":3069,"topicId":3068,"numMessagesInTopic":0,"msgSnippet":"Hi all, Lately I ve been reading Valerie s book The Unprocessed Child (and really enjoying it, Valerie!)  She has a quote at the beginning of one of her ","messageBody":"<div id=\"ygrps-yiv-1859078078\">Hi all,<br/>\n<br/>\nLately I&#39;ve been reading Valerie&#39;s book &quot;The Unprocessed Child&quot; (and really<br/>\nenjoying it, Valerie!)  She has a quote at the beginning of one of her<br/>\nchapters that I&#39;d like to post and invite stories about.  It spoke volumes<br/>\nto me about what I strive (not always so well in ALL areas) to do with my<br/>\nchildren, and it feels particularly important in reference to the children<br/>\nwho are different from the norm and whom world is telling us to &quot;fix&quot; and<br/>\nworry about ... Not too surprisingly this quote starts Valerie&#39;s chapter<br/>\nentitled &quot;Acceptance&quot; and it is:<br/>\n<br/>\n&quot;Stop trying to perfect your child, but keep trying to perfect your<br/>\nrelationship with him.&quot; Dr. Henker<br/>\n<br/>\nI know for me right now my son (3.7 yrs), who fits the inflexble-explosive<br/>\nmodel has been very challenging.  Due to the wonderful suggestions in &quot;The<br/>\nExplosive Child&quot; that I have done, his rages have greatly diminished, he has<br/>\nhardly any right now, but he is doing more lately of sort of casual hitting<br/>\nof his sister in particular and me.  Obviously physical safety is important<br/>\nfor all of us and for me it is something of a hot button issue as I came<br/>\nfrom an abusive childhood environment so it&#39;s hard for me to remain calm<br/>\nabout it.  It&#39;s hard for me not to approach the situation from a &quot;fix it&quot;<br/>\nand &quot;fix the behavior&quot; perspective.  Obviously yes, I am going to prevent<br/>\nand stop the hurtful behavior, but I have come to ponder on the fact that my<br/>\nson always has the choice to make of doing it again and the only thing<br/>\nthat&#39;s going to get us both to a better place of understanding about the<br/>\nneeds of each other (his need behind hitting, my need in having everyone be<br/>\nsafe) is if I stop thinking about it from a &quot;fixing&quot; and &quot;perfecting him&quot;<br/>\nperspective and focus on making my relationship with him better.  That means<br/>\nunderstanding better what triggers him, trying to better understand it from<br/>\nhis point of view, and calming myself down enough to do that.<br/>\n<br/>\nAnyone else have any challenges to share that this quote inspires, or any<br/>\nhallmark moments with your child where you changed from trying to perfect<br/>\nyour child to trying to perfect your relationship?  How did it go?  I&#39;d love<br/>\nto be inspired by you and your child...<br/>\n<br/>\nJoan<br/>\n<br/>\n************************<br/>\n&quot;I would rather live in a world where my life is surrounded by mystery than<br/>\nlive in a world so small that my mind could comprehend it.&quot;  ... Harry<br/>\nEmerson Fosdick</div>","specialLinks":[]}],"prevTopicId":3095,"nextTopicId":3062}}