{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":332102660,"authorName":"Katie","from":"&quot;Katie&quot; &lt;paigekitten@...&gt;","profile":"paigekitten86","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: no financial foundation - are we nuts to keep unschooling?","postDate":"1351290863","msgId":49216,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2ZjM1Zitsc2wzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs2Y2cxZSs2YjM1QGVHcm91cHMuY29tPg=="},"prevInTopic":49215,"nextInTopic":0,"prevInTime":49215,"nextInTime":49217,"topicId":49195,"numMessagesInTopic":0,"msgSnippet":"I just wanted to chime and say how much I appreciate this conversation.  I have wondered the same things at times as well.  We are lucky if we make $15,000 a","messageBody":"<div id=\"ygrps-yiv-1392384804\">I just wanted to chime and say how much I appreciate this conversation.  I have wondered the same things at times as well.  We are lucky if we make $15,000 a year these last few years, and I wonder if I am able to provide the kinds of learning experiences my kids need with no budget. <br/>\n<br/>\nPart of me being okay with this in my own little family is that I grew up in a family with no financial stability either, but we were close knit, and our FAMILY was stable.  Even when it seemed the world was falling down around us we had each other and that was what mattered.  I want my children to have that same security. <br/>\n<br/>\nAlso, creativity goes a long way.  My mother watched other kids so she could stay home and homeschool us, we bartered for music lessons, we went to a lot of free museum days (carpooling with friends when our car wasn&#39;t running).  She approached the school board and got a homeschool program set up so that the homeschoolers in our city could attend extra-curricular activities like band, theater, and art or just a couple of classes at a time.  Because I grew up having to be creative and make do I feel like I will be able to find a way to make the important things happen for my kids as well.<br/>\n<br/>\nThat said, we have been without an emergency fund since last year and I am NOT comfortable with that and my husband and I are selling our things and looking around for other income sources to make up the difference.  We sold DH&#39;s wedding ring last month to pay the mortgage because one of us being home with the girls, and us keeping our house was more important to US then physical possessions.</div>","specialLinks":[]},{"userId":357126582,"authorName":"Joy","from":"&quot;Joy&quot; &lt;joy_bakker@...&gt;","profile":"joy_bakker","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: no financial foundation - are we nuts to keep unschooling?","postDate":"1351289353","msgId":49215,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2ZjFtOSs5OTg4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs2Y3BkYStzbW5uQGVHcm91cHMuY29tPg=="},"prevInTopic":49211,"nextInTopic":49216,"prevInTime":49214,"nextInTime":49216,"topicId":49195,"numMessagesInTopic":0,"msgSnippet":"Hi everyone, thanks for all of your replies. Hearing everyone s stories, I am realizing that our situation is not as bad as it could be. And we could for sure","messageBody":"<div id=\"ygrps-yiv-1174106333\">Hi everyone, thanks for all of your replies.<br/>\n<br/>\nHearing everyone&#39;s stories, I am realizing that our situation is not as bad as it could be.<br/>\n<br/>\nAnd we could for sure do more to save money and be more frugal.<br/>\n<br/>\nLots to think about. Thanks so much, everyone.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;lindaguitar&quot; &lt;lindaguitar@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Joy,<br/>\n&gt; <br/>\n&gt; My family has never had the kind of financial security you&#39;re talking about. For most of our lives, since having kids, we have not had health or dental insurance. <br/>\n&gt; <br/>\n&gt; We were a one-car family for a long time, and had to make all kinds of arrangements to go anywhere while my husband was at work.<br/>\n&gt; <br/>\n&gt; When we started homeschooling, we lived in an apartment, and did not own a home. <br/>\n&gt; <br/>\n&gt; I have been working p/t as a babysitter and guitar teacher for many years. I babysat at our home when my kids were younger, and then started babysitting after school at other people&#39;s homes when my kids were teens and could stay home alone. (My daughter used to come with me a lot when she was in her early teens.)<br/>\n&gt; <br/>\n&gt; My husband has been laid off 4 times in the past 5 years, and has been unemployed and unable to find work for more time than he has been employed during those years. (He is a home-designer, and the homebuilding industry has basically evaporated in this country.)<br/>\n&gt; <br/>\n&gt; So - no you&#39;re not crazy for unschooling without being financially stable.<br/>\n&gt; <br/>\n&gt; Let me tell you about my daughter&#39;s best friend, Rachel.<br/>\n&gt; <br/>\n&gt; When we met Rachel&#39;s family, they were a family of 6 - a mom and dad, and 4 kids, then ranging in age from 6 to 14. They had had a successful family-owned business that had fallen apart when the dad&#39;s brother died. They were all living in one motel room when we met them. They didn&#39;t have a car - and they lived in an area with very limited bus access. The dad worked p/t at a nearby home-and-garden-supplies store (he couldn&#39;t find a f/t job), and the mom was staying &quot;home&quot; with the kids. And they were homeschooling! It was extremely stressful for all of them, living in one room, and yet they made the best of their bad situation and the kids learned in a fairly eclectic manner, through library books, websites, video games, and real life. (They regularly walked 3 miles each way to the library!) <br/>\n&gt; <br/>\n&gt; When my daughter became friends with their daughter (and I became friends with the mom), we got Rachel to join the venture scout group that my kids were in, and I started picking her up every week and taking her to and from the scout meetings. Until that point, Rachel and her siblings had virtually no social life outside their family. The parents were embarrassed about their situation, and also had no practical/affordable way to get to and from homeschool group activities.<br/>\n&gt; <br/>\n&gt; That family&#39;s situation got even worse for a while - the dad got laid off and they ended up having to split the family up and stay with different people. (The 2 oldest girls stayed with us.) <br/>\n&gt; <br/>\n&gt; Then, finally, their mom got a job (janitorial work at the airport), they got an apartment, and the dad started staying home with the kids. The mom is extremely intelligent and knowledgeable, although she never finished college, and it was obvious to people she met at work that she was capable of a lot more than janitorial work. She got a much better job at the airport, and the family was able to move from a one-bedroom apartment to a 3-br. in a really nice apartment complex. (It&#39;s the one we used to live in, before we got a house. It&#39;s not expensive, not luxury by any means - just really nice grounds with a lake, and large apartments.) They now have a car, too. And a dog. :-)<br/>\n&gt; <br/>\n&gt; At this point, Rachel goes to the same college that my daughter goes to. <br/>\n&gt; The next oldest sibling is the equivalent of a senior in high school, doing online courses at home. She is also an avid gardener, and has made friends with some older ladies in nearby apartments, who are also avid gardeners. She is also a very talented artist.  <br/>\n&gt; The next kid, age 15, chose to go to public high school this year - and was moved into honors history after two weeks. He and his siblings learned a LOT about history by playing history-based video games, and watching the History Channel. (And reading a lot of library books.) He is doing well in high school and is happy there. And the youngest kid, now age 12, who also has a lot of Asperger&#39;s traits - including the beneficial traits, such as a photographic memory - but has never been labeled by anyone or even had it suggested to her that she might have a &quot;condition&quot; - is doing online (virtual school) courses at home. She and I played a great game of Scrabble last time I was over there, and I have finally found another Scrabble-playing friend in her! :-)<br/>\n&gt; <br/>\n&gt; So - even the most impoverished family can successfully homeschool or unschool, if they are really into it!<br/>\n&gt; <br/>\n&gt; Linda<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Joy&quot; &lt;joy_bakker@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; Hi all, I don&#39;t post often but do read the forum a lot.<br/>\n&gt; &gt; <br/>\n&gt; &gt; I am just curious, how many of you feel that being very financially secure is a necessity to homeschooling?<br/>\n&gt; &gt; <br/>\n&gt; &gt; I&#39;m just wondering because lately we have been meeting a lot of families (not unschoolers though as there aren&#39;t many in our area) who typically have one working parent who earns enough to support the family well, they have a stable job, benefits, etc and it seems that this working parent also has good job security.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Well, this is not our case at all. In order to unschool we had to make a lot of choices that went against the above grain.<br/>\n&gt; &gt; <br/>\n&gt; &gt; First, when we started our family 6 years ago, we both just graduated from school and I stayed at home and hubby started to gain experience in entry level jobs. Then he decided he wants to be a bigger part of homeschooling so he has been freelancing from home and I am slowly starting to do the same (though it is much slower for me since I am still the main care giving/home educating parent).<br/>\n&gt; &gt; <br/>\n&gt; &gt; So long story short, we by no means have any sort of solid financial stability and foundation.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Working from home has proved challenging as sometimes, in between contracts and clients we&#39;ve depleted some of our savings and accumulated some debt.<br/>\n&gt; &gt; <br/>\n&gt; &gt; And by no means can we afford right now to be picture perfect home schooling parents that provide their kids will all the little extras like the loads of extra-curricular activities we see other home schooling parents providing for their kids.<br/>\n&gt; &gt; <br/>\n&gt; &gt; And at this point, we don&#39;t even have a basic foundation for emergencies and all of our necessities, should emergencies arise (like emergency dental work or money for a new car if we needed it, major home repairs, etc if we needed it).<br/>\n&gt; &gt; <br/>\n&gt; &gt; So I am kind of wondering, are we in the minority - do majority of homeschooling families have that solid financial base.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Are we fooling ourselves since we are only now trying to build some sort of financial base by starting up several home businesses?<br/>\n&gt; &gt; <br/>\n&gt; &gt; A part of me thinks that maybe experiencing these challenges is good as it is motivating us to work through these problems and build that solid foundation but I also wonder if maybe we are risking too much by not being in the space right now where we have money for emergencies. Are we just risking too much to unschool?<br/>\n&gt; &gt; <br/>\n&gt; &gt; I totally agree with people when they say that you need to look at priorities and that the time with your kids is so much more than the material things or fancy vacations you can give them, but what about emergency money for our home, medical, dental care, food, etc.<br/>\n&gt; &gt; <br/>\n&gt; &gt; It makes me weary that we don&#39;t have that, and I am wondering, are we the only ones in this tricky financial situation? Are the only people who end up homeschooling the ones that do have the financial bases covered for things like emergencies?<br/>\n&gt; &gt; <br/>\n&gt; &gt; I consider us at least fortunate that we at the very least have our own house and are actually able to find the means to earn money from home but it will still take many years to get to the point where we have that solid base.<br/>\n&gt; &gt; <br/>\n&gt; &gt; So a part of me is feeling guilty, like we are being irresponsible by pushing on with this without that base when technically we would already have that base if we both had jobs outside the home.<br/>\n&gt; &gt; <br/>\n&gt; &gt; I don&#39;t mind that we are risk takers but there are risks you take yourself, like say, putting your own medical bills on hold and then there are risks that maybe aren&#39;t ok to take for your kids, like knowing that if your kids need emergency dental work the money is not there or the fact that we don&#39;t always know where our next pay cheque will come from.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Are we just crazy to take all this risk in order to unschool?<br/>\n&gt; &gt; <br/>\n&gt; &gt; Or do a lot of unschooling families end up taking on a lot of risk too and they pull through it and it turns out all ok??<br/>\n&gt; &gt; <br/>\n&gt; &gt; Kinda just wondering if we are just nuts to keep doing this now or if this is sometimes the normal (whatever normal is) process when you go against the grain and build an alternative life style?<br/>\n&gt; &gt; <br/>\n&gt; &gt; Thanks so much for your thoughts,<br/>\n&gt; &gt; <br/>\n&gt; &gt; Joy<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":543805045,"authorName":"Dena Morrison","from":"Dena Morrison &lt;morrjoy2012@...&gt;","profile":"djoyb2007","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] no financial foundation - are we nuts to keep unschooling?","postDate":"1351270614","msgId":49211,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRkZuREs1Zit4N0h4WmhHb3RYVW1wdzNHZ2V4b185SFdWRUVzaUwzTzY0bi0xVjZPUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDEzNTExODU4OTEuNjgzMjMuWWFob29NYWlsUkNAd2ViMTgxMzAzLm1haWwubmUxLnlhaG9vLmNvbT4=","referencesHeader":"PGs2Ym1xMis2ODh0QGVHcm91cHMuY29tPgk8MTM1MTE4NTg5MS42ODMyMy5ZYWhvb01haWxSQ0B3ZWIxODEzMDMubWFpbC5uZTEueWFob28uY29tPg=="},"prevInTopic":49207,"nextInTopic":49215,"prevInTime":49210,"nextInTime":49212,"topicId":49195,"numMessagesInTopic":0,"msgSnippet":"Amen, Katherine! We have children on both ends of the age spectrum, from 23 to 5.  My older 3 (with my late husband) went to traditional school, even though I","messageBody":"<div id=\"ygrps-yiv-1212167188\">Amen, Katherine!<br/>\n<br/>\nWe have children on both ends of the age spectrum,<br/>\nfrom 23 to 5.  My older 3 (with my late husband) went to traditional school,<br/>\neven though I wanted to homeschool I had no foundation, knowledge<br/>\nor support of how to achieve that exactly, and in the end chickened out<br/>\nafraid I wouldn&#39;t be able to teach what they needed to learn.  Throughout<br/>\ntheir lives, we&#39;ve struggled financially, emotionally and eventually in<br/>\ngrief<br/>\nwhen their daddy was killed.  I was a mess, and MISSED SO MUCH<br/>\nwith them, on so many levels, its a sorrow I live with.  Even now with them<br/>\nall in college, my heart yearns to NOT MISS one special moment.<br/>\nIt just GOES BY WAY TOO FAST!<br/>\nNow with my 5 year old, and my husband in full agreement with what we<br/>\ninitially thought would be homeschool for sure, but now our views are<br/>\nmoving much more heavily toward unschooling...already having learned this<br/>\nlesson of time flying...I am determined to share every available moment<br/>\nwith him.  We haven&#39;t rushed him out of our family bed, or to spend the<br/>\nnight<br/>\nanyplace, or to go on playdates without us.<br/>\nWe also struggle financially, as so many here are discussing, living<br/>\nprimarily<br/>\non self-employment income, without benefits or insurance too, but we work<br/>\ntogether on our company to build it one day at a time.  Our little one knows<br/>\nhe&#39;s a part of this company too, and even gets to have &quot;work days with dad&quot;<br/>\non certain job sites, when it&#39;s appropriate.<br/>\nI work part time for a local church, and he goes to a 4/5 year old class,<br/>\n3 mornings a week while I work, which he enjoys.  He&#39;s made a few friends<br/>\nlast year, which was a great bonus for us, since we don&#39;t have many around<br/>\nhis age to play with.<br/>\nI guess I just want to encourage the thinking that the children are only<br/>\nyoung<br/>\nonce, and even though we get caught up in the daily struggles of life,<br/>\nIF you have the chance to be with them, and it works for your family, IMO<br/>\nit is WORTH every penny you might have to struggle over, because there is<br/>\nthe TIME is priceless.<br/>\n<br/>\nDena</div>","specialLinks":[]},{"userId":333113705,"authorName":"delilah park","from":"delilah park &lt;delilahiris@...&gt;","profile":"delilahiris","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] no financial foundation - are we nuts to keep unschooling?","postDate":"1351220121","msgId":49207,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTEyMjAxMjEuNTkxMDIuWWFob29NYWlsTmVvQHdlYjExMDUwOS5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PDQxMDFCQ0NCLTNFOTUtNDM3MC04M0IyLTYwQjdGRDc1RDc3OEBzbG93Z2xvd2luZy5jb20+","referencesHeader":"PGs2Ym1xMis2ODh0QGVHcm91cHMuY29tPiA8NDEwMUJDQ0ItM0U5NS00MzcwLTgzQjItNjBCN0ZENzVENzc4QHNsb3dnbG93aW5nLmNvbT4="},"prevInTopic":49205,"nextInTopic":49211,"prevInTime":49206,"nextInTime":49208,"topicId":49195,"numMessagesInTopic":0,"msgSnippet":"Joy, You are definitely not alone. We are by no means financially secure. I work freelance from home and my husband is unemployed (has been for 4 years.","messageBody":"<div id=\"ygrps-yiv-450826007\">Joy,<br/>\nYou are definitely not alone. We are by no means financially secure. I work freelance from home and my husband is unemployed (has been for 4 years. Unemployment ran out and all). It&#39;s pretty rough at times but we pull through. I have felt the same as you do at times seeing many of our peers have several activities they go to throughout the week, as well as outings and whatnot.<br/>\nI take it on as a challenge to find things that are free or really inexpensive to do with my kids (and close by to save on gas). <br/>\n<br/>\nWe are working towards getting out of debt to free up more money to eventually be able to provide more activities for our lil&#39; ones. We&#39;re even saving up to do the tiny house/natural building route as to eliminate having a mortgage payment. <br/>\n<br/>\nIt may seem crazy to some, but nothing could take the place or importance of being able to spend each and every day with my kids. And I know given the choice they would choose having my husband and I with them every day over money, any day of the week. If they need emergency dental work I&#39;ll just take out a payment plan with the dentist. ;-)<br/>\n<br/>\nDelilah<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n From: regan &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:regan@...\">regan@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSent: Thursday, October 25, 2012 1:13 PM<br/>\nSubject: Re: [unschoolingbasics] no financial foundation - are we nuts to keep unschooling?<br/>\n <br/>\n<br/>\n  <br/>\nHi there,<br/>\n<br/>\nOur family is not too financially secure.  We have one income, but it&#39;s a freelancer&#39;s income and doesn&#39;t incl ude benefits.  We don&#39;t own any property and do carry debt.<br/>\nFor us, being able to continue to exist as a family is very important -- for this reason, we absolutely carry self-pay health insurance and life insurance.  Before our child was born and I was working on our will, the part that really gave me pause was the part where you have to choose who will raise your child(ren) if something were to befall you.  So I try to minimize the impact of stuff befalling us! <br/>\n<br/>\nFor our family, the other important value is really being able to learn.  I grew up in a poor one-income family, where we had no resources whatsoever.  I hoarded my one box of crayons!<br/>\nGranted, I was in school, so my parents figured that I didn&#39;t need any at-home enrichment.  But I felt the lack, and spent many years trying to catch up and learn the things I wanted to -- like art, which my school didn&#39;t have.<br/>\nSo, we strive for our income to be enough to keep learning on a day-to-day basis, go places, etc. <br/>\n<br/>\ncheers,<br/>\nRegan<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Oct 25, 2012, at 11:45 AM, &quot;Joy&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:joy_bakker@...\">joy_bakker@...</a>&gt; wrote:<br/>\n<br/>\n&gt; Hi all, I don&#39;t post often but do read the forum a lot.<br/>\n&gt; <br/>\n&gt; I am just curious, how many of you feel that being very financially secure is a necessity to homeschooling?<br/>\n&gt; <br/>\n&gt; I&#39;m just wondering because lately we have been meeting a lot of families (not unschoolers though as there aren&#39;t many in our area) who typically have one working parent who earns enough to support the family well, they have a stable job, benefits, etc and it seems that this working parent also has good job security.<br/>\n&gt; <br/>\n&gt; Well, this is not our case at all. In order to unschool we had to make a lot of choices that went against the above grain.<br/>\n&gt; <br/>\n&gt; First, when we started our family 6 years ago, we both just graduated from school and I stayed at home and hubby started to gain experience in entry level jobs. Then he decided he wants to be a bigger part of homeschooling so he has been freelancing from home and I am slowly starting to do the same (though it is much slower for me since I am still the main care giving/home educating parent).<br/>\n&gt; <br/>\n&gt; So long story short, we by no means have any sort of solid financial stability and foundation.<br/>\n&gt; <br/>\n&gt; Working from home has proved challenging as sometimes, in between contracts and clients we&#39;ve depleted some of our savings and accumulated some debt.<br/>\n&gt; <br/>\n&gt; And by no means can we afford right now to be picture perfect home schooling parents that provide their kids will all the little extras like the loads of extra-curricular activities we see other home schooling parents providing for their kids.<br/>\n&gt; <br/>\n&gt; And at this point, we don&#39;t even have a basic foundation for emergencies and all of our necessities, should emergencies arise (like emergency dental work or money for a new car if we needed it, major home repairs, etc if we needed it).<br/>\n&gt; <br/>\n&gt; So I am kind of wondering, are we in the minority - do majority of homeschooling families have that solid financial base.<br/>\n&gt; <br/>\n&gt; Are we fooling ourselves since we are only now trying to build some sort of financial base by starting up several home businesses?<br/>\n&gt; <br/>\n&gt; A part of me thinks that maybe experiencing these challenges is good as it is motivating us to work through these problems and build that solid foundation but I also wonder if maybe we are risking too much by not being in the space right now where we have money for emergencies. Are we just risking too much to unschool?<br/>\n&gt; <br/>\n&gt; I totally agree with people when they say that you need to look at priorities and that the time with your kids is so much more than the material things or fancy vacations you can give them, but what about emergency money for our home, medical, dental care, food, etc.<br/>\n&gt; <br/>\n&gt; It makes me weary that we don&#39;t have that, and I am wondering, are we the only ones in this tricky financial situation? Are the only people who end up homeschooling the ones that do have the financial bases covered for things like emergencies?<br/>\n&gt; <br/>\n&gt; I consider us at least fortunate that we at the very least have our own house and are actually able to find the means to earn money from home but it will still take many years to get to the point where we have that solid base.<br/>\n&gt; <br/>\n&gt; So a part of me is feeling guilty, like we are being irresponsible by pushing on with this without that base when technically we would already have that base if we both had jobs outside the home.<br/>\n&gt; <br/>\n&gt; I don&#39;t mind that we are risk takers but there are risks you take yourself, like say, putting your own medical bills on hold and then there are risks that maybe aren&#39;t ok to take for your kids, like knowing that if your kids need emergency dental work the money is not there or the fact that we don&#39;t always know where our next pay cheque will come from.<br/>\n&gt; <br/>\n&gt; Are we just crazy to take all this risk in order to unschool?<br/>\n&gt; <br/>\n&gt; Or do a lot of unschooling families end up taking on a lot of risk too and they pull through it and it turns out all ok??<br/>\n&gt; <br/>\n&gt; Kinda just wondering if we are just nuts to keep doing this now or if this is sometimes the normal (whatever normal is) process when you go against the grain and build an alternative life style?<br/>\n&gt; <br/>\n&gt; Thanks so much for your thoughts,<br/>\n&gt; <br/>\n&gt; Joy<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: no financial foundation - are we nuts to keep unschooling?","postDate":"1351215338","msgId":49205,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2Y3BkYStzbW5uQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs2Ym1xMis2ODh0QGVHcm91cHMuY29tPg=="},"prevInTopic":49203,"nextInTopic":49207,"prevInTime":49204,"nextInTime":49206,"topicId":49195,"numMessagesInTopic":0,"msgSnippet":"Joy, My family has never had the kind of financial security you re talking about. For most of our lives, since having kids, we have not had health or dental","messageBody":"<div id=\"ygrps-yiv-1578011052\">Joy,<br/>\n<br/>\nMy family has never had the kind of financial security you&#39;re talking about. For most of our lives, since having kids, we have not had health or dental insurance. <br/>\n<br/>\nWe were a one-car family for a long time, and had to make all kinds of arrangements to go anywhere while my husband was at work.<br/>\n<br/>\nWhen we started homeschooling, we lived in an apartment, and did not own a home. <br/>\n<br/>\nI have been working p/t as a babysitter and guitar teacher for many years. I babysat at our home when my kids were younger, and then started babysitting after school at other people&#39;s homes when my kids were teens and could stay home alone. (My daughter used to come with me a lot when she was in her early teens.)<br/>\n<br/>\nMy husband has been laid off 4 times in the past 5 years, and has been unemployed and unable to find work for more time than he has been employed during those years. (He is a home-designer, and the homebuilding industry has basically evaporated in this country.)<br/>\n<br/>\nSo - no you&#39;re not crazy for unschooling without being financially stable.<br/>\n<br/>\nLet me tell you about my daughter&#39;s best friend, Rachel.<br/>\n<br/>\nWhen we met Rachel&#39;s family, they were a family of 6 - a mom and dad, and 4 kids, then ranging in age from 6 to 14. They had had a successful family-owned business that had fallen apart when the dad&#39;s brother died. They were all living in one motel room when we met them. They didn&#39;t have a car - and they lived in an area with very limited bus access. The dad worked p/t at a nearby home-and-garden-supplies store (he couldn&#39;t find a f/t job), and the mom was staying &quot;home&quot; with the kids. And they were homeschooling! It was extremely stressful for all of them, living in one room, and yet they made the best of their bad situation and the kids learned in a fairly eclectic manner, through library books, websites, video games, and real life. (They regularly walked 3 miles each way to the library!) <br/>\n<br/>\nWhen my daughter became friends with their daughter (and I became friends with the mom), we got Rachel to join the venture scout group that my kids were in, and I started picking her up every week and taking her to and from the scout meetings. Until that point, Rachel and her siblings had virtually no social life outside their family. The parents were embarrassed about their situation, and also had no practical/affordable way to get to and from homeschool group activities.<br/>\n<br/>\nThat family&#39;s situation got even worse for a while - the dad got laid off and they ended up having to split the family up and stay with different people. (The 2 oldest girls stayed with us.) <br/>\n<br/>\nThen, finally, their mom got a job (janitorial work at the airport), they got an apartment, and the dad started staying home with the kids. The mom is extremely intelligent and knowledgeable, although she never finished college, and it was obvious to people she met at work that she was capable of a lot more than janitorial work. She got a much better job at the airport, and the family was able to move from a one-bedroom apartment to a 3-br. in a really nice apartment complex. (It&#39;s the one we used to live in, before we got a house. It&#39;s not expensive, not luxury by any means - just really nice grounds with a lake, and large apartments.) They now have a car, too. And a dog. :-)<br/>\n<br/>\nAt this point, Rachel goes to the same college that my daughter goes to. <br/>\nThe next oldest sibling is the equivalent of a senior in high school, doing online courses at home. She is also an avid gardener, and has made friends with some older ladies in nearby apartments, who are also avid gardeners. She is also a very talented artist.  <br/>\nThe next kid, age 15, chose to go to public high school this year - and was moved into honors history after two weeks. He and his siblings learned a LOT about history by playing history-based video games, and watching the History Channel. (And reading a lot of library books.) He is doing well in high school and is happy there. And the youngest kid, now age 12, who also has a lot of Asperger&#39;s traits - including the beneficial traits, such as a photographic memory - but has never been labeled by anyone or even had it suggested to her that she might have a &quot;condition&quot; - is doing online (virtual school) courses at home. She and I played a great game of Scrabble last time I was over there, and I have finally found another Scrabble-playing friend in her! :-)<br/>\n<br/>\nSo - even the most impoverished family can successfully homeschool or unschool, if they are really into it!<br/>\n<br/>\nLinda<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Joy&quot; &lt;joy_bakker@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi all, I don&#39;t post often but do read the forum a lot.<br/>\n&gt; <br/>\n&gt; I am just curious, how many of you feel that being very financially secure is a necessity to homeschooling?<br/>\n&gt; <br/>\n&gt; I&#39;m just wondering because lately we have been meeting a lot of families (not unschoolers though as there aren&#39;t many in our area) who typically have one working parent who earns enough to support the family well, they have a stable job, benefits, etc and it seems that this working parent also has good job security.<br/>\n&gt; <br/>\n&gt; Well, this is not our case at all. In order to unschool we had to make a lot of choices that went against the above grain.<br/>\n&gt; <br/>\n&gt; First, when we started our family 6 years ago, we both just graduated from school and I stayed at home and hubby started to gain experience in entry level jobs. Then he decided he wants to be a bigger part of homeschooling so he has been freelancing from home and I am slowly starting to do the same (though it is much slower for me since I am still the main care giving/home educating parent).<br/>\n&gt; <br/>\n&gt; So long story short, we by no means have any sort of solid financial stability and foundation.<br/>\n&gt; <br/>\n&gt; Working from home has proved challenging as sometimes, in between contracts and clients we&#39;ve depleted some of our savings and accumulated some debt.<br/>\n&gt; <br/>\n&gt; And by no means can we afford right now to be picture perfect home schooling parents that provide their kids will all the little extras like the loads of extra-curricular activities we see other home schooling parents providing for their kids.<br/>\n&gt; <br/>\n&gt; And at this point, we don&#39;t even have a basic foundation for emergencies and all of our necessities, should emergencies arise (like emergency dental work or money for a new car if we needed it, major home repairs, etc if we needed it).<br/>\n&gt; <br/>\n&gt; So I am kind of wondering, are we in the minority - do majority of homeschooling families have that solid financial base.<br/>\n&gt; <br/>\n&gt; Are we fooling ourselves since we are only now trying to build some sort of financial base by starting up several home businesses?<br/>\n&gt; <br/>\n&gt; A part of me thinks that maybe experiencing these challenges is good as it is motivating us to work through these problems and build that solid foundation but I also wonder if maybe we are risking too much by not being in the space right now where we have money for emergencies. Are we just risking too much to unschool?<br/>\n&gt; <br/>\n&gt; I totally agree with people when they say that you need to look at priorities and that the time with your kids is so much more than the material things or fancy vacations you can give them, but what about emergency money for our home, medical, dental care, food, etc.<br/>\n&gt; <br/>\n&gt; It makes me weary that we don&#39;t have that, and I am wondering, are we the only ones in this tricky financial situation? Are the only people who end up homeschooling the ones that do have the financial bases covered for things like emergencies?<br/>\n&gt; <br/>\n&gt; I consider us at least fortunate that we at the very least have our own house and are actually able to find the means to earn money from home but it will still take many years to get to the point where we have that solid base.<br/>\n&gt; <br/>\n&gt; So a part of me is feeling guilty, like we are being irresponsible by pushing on with this without that base when technically we would already have that base if we both had jobs outside the home.<br/>\n&gt; <br/>\n&gt; I don&#39;t mind that we are risk takers but there are risks you take yourself, like say, putting your own medical bills on hold and then there are risks that maybe aren&#39;t ok to take for your kids, like knowing that if your kids need emergency dental work the money is not there or the fact that we don&#39;t always know where our next pay cheque will come from.<br/>\n&gt; <br/>\n&gt; Are we just crazy to take all this risk in order to unschool?<br/>\n&gt; <br/>\n&gt; Or do a lot of unschooling families end up taking on a lot of risk too and they pull through it and it turns out all ok??<br/>\n&gt; <br/>\n&gt; Kinda just wondering if we are just nuts to keep doing this now or if this is sometimes the normal (whatever normal is) process when you go against the grain and build an alternative life style?<br/>\n&gt; <br/>\n&gt; Thanks so much for your thoughts,<br/>\n&gt; <br/>\n&gt; Joy<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: no financial foundation - are we nuts to keep unschooling?","postDate":"1351205742","msgId":49203,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2Y2cxZSs2YjM1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs2Ym1xMis2ODh0QGVHcm91cHMuY29tPg=="},"prevInTopic":49200,"nextInTopic":49205,"prevInTime":49202,"nextInTime":49204,"topicId":49195,"numMessagesInTopic":0,"msgSnippet":"... ***************** Those are some pretty stringent criteria! I don t know many families period who are very financially secure - and I know several who","messageBody":"<div id=\"ygrps-yiv-1992665322\">&quot;Joy&quot; &lt;joy_bakker@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I am just curious, how many of you feel that being very financially secure is a necessity to homeschooling?<br/>\n </span></blockquote>*****************<br/>\n<br/>\nThose are some pretty stringent criteria! I don&#39;t know many families period who are &quot;very financially secure&quot; - and I know several who went from &quot;reasonably secure&quot; to &quot;struggling&quot; in a flash due to unforeseen circumstances like a longtime employer folding or an injury or illness in the family - mine among them.<br/>\n<br/>\nIt takes some resources to unschool, but it&#39;s tricky to nail down Which resources because those depend a lot on individual needs. You can do without a lot of financial resources if you&#39;re creative and... er... resourceful ;) If you&#39;re good at finding free and cheap alternatives and thinking outside the box, there are often more options than what all the neighbors are doing. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; A part of me thinks that maybe experiencing these challenges is good as it is motivating us to work through these problems and build that solid foundation but I also wonder if maybe we are risking too much by not being in the space right now where we have money for emergencies. Are we just risking too much to unschool?<br/>\n </span></blockquote>*******************<br/>\n<br/>\nI&#39;m sort of baffled by the question - my life doesn&#39;t revolve around unschooling. I&#39;d have the same job tomorrow, the same financial challenges tomorrow, if my daughter was in school... but my family wouldn&#39;t be as happy and peaceful. I have certainly made job decisions which make it easier to unschool - decisions which set me up to make less money... but if I had a kid in school, relatively happy with her school and friends I&#39;d have made the same choices. They&#39;re choices which support my family As a family. They&#39;re kind of odd choices in some respects, but I know other people with more conventional families than mine who have made the same kinds of choices. I don&#39;t choose to put my family and personal happiness first because I&#39;m an unschooler - I find unschooling fits comfortably within the values I already have.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":357126582,"authorName":"Joy","from":"&quot;Joy&quot; &lt;joy_bakker@...&gt;","profile":"joy_bakker","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: no financial foundation - are we nuts to keep unschooling?","postDate":"1351189734","msgId":49200,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2YzBkNithZzV1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQxMDFCQ0NCLTNFOTUtNDM3MC04M0IyLTYwQjdGRDc1RDc3OEBzbG93Z2xvd2luZy5jb20+"},"prevInTopic":49199,"nextInTopic":49203,"prevInTime":49199,"nextInTime":49201,"topicId":49195,"numMessagesInTopic":0,"msgSnippet":"HI Regan, well so do we, but I still have guild feelings. Like for example, right now, not much money to buy new furniture. We really need a new bed as the one","messageBody":"<div id=\"ygrps-yiv-788925178\">HI Regan, well so do we, but I still have guild feelings.<br/>\n<br/>\nLike for example, right now, not much money to buy new furniture. We really need a new bed as the one we have is too soft now for my back and I am waking up with pain everyday.<br/>\n<br/>\nWe were going to buy one this week but then decided against it when we found out that the contract my hubby currently has might not be renewed (we&#39;ve also had sporadic freelance income, and contract work, so no health or dental benefits).<br/>\n<br/>\nWe do mostly holistic health and I find that making tinctures and such out of dried herbs is fairly inexpensive.<br/>\n<br/>\nFor the most part we are very healthy but I do have guilt feelings about my son&#39;s teeth. <br/>\n<br/>\nHe&#39;s at the age where he is starting to lose his teeth but it has been a challenge trying to guide him towards making better food choices and get better dental hygiene and right now he has two molar cavities (2nd molar so dentist told us he would keep that tooth until about 9 - so another 3 years).<br/>\n<br/>\nWe opted to go the holistic route for now to treat the tooth but it is hard because he doesn&#39;t yet understand. About 6 months ago we had some savings to get his teeth done but then I was told that he would need a baby root canal (pulpotomy) and after talking to a lot of parents on Alternative Kids teeth and doing some research of my own, including interrogating my sister&#39;s boyfriend who is a dentist, we decided to opt against it, since it would kill the tooth and an infection might form (vs now tooth has no infection, no pain).<br/>\n<br/>\nBut I worry every day almost the what if - life what if he needs to get the tooth extracted in a month and we don&#39;t have the cash for it, what would we do??<br/>\n<br/>\nI am trying so hard to work on my freelance writing so I can start earning more money and I even did a doula course but that is going slowly too because no money for marketing now.<br/>\n<br/>\nI would LOVE to trust that when the time comes that he needs dental work beyond what we can heal at home that we&#39;ll have money for it, but I am worried.<br/>\n<br/>\nMy hubby also has some small cavities that we are postponing too, and 2 years ago I finally got some dental work done that was 6 years over due - no major big deal, I mean, I just got the cavities filled when I could and treated it holistically in the mean time.<br/>\n<br/>\nBut still, now I feel so much guilt, like if I worked we&#39;d have money for car repairs, all the dental work (even though with my son&#39;s molar we&#39;d still likely wait as I find the pulpotomy to be too risky).<br/>\n<br/>\nBut yes, we always manage to have some money for food, our mortgage, clothing, some toys, some books, and a little bit of extra-curricular where we can manage it, plus some day trips and stuff but I find it is always a tough choice - like save $$ for emergencies or sign up for some activity or do some trip or something. <br/>\n<br/>\nAnd if we do end up having an emergency, so far we have been able to pay cash for it but then we end up being really tight several months after and we can&#39;t do anything but go to the park or play dates, etc.<br/>\n<br/>\nI feel  like I am depriving my kids of learning opportunities since any activity we do has to be carefully thought out, and taken into consideration and sometimes we can&#39;t do it.<br/>\n<br/>\nThen when I ask my kids (who are 4 and 6) if they&#39;d prefer to go to school so we had more money for holidays, or toys, or activities, etc or if they want me to be with them, then they always say they would prefer I be with them, but...<br/>\n<br/>\nThen I think, well all that is fine but what if it is not a choice anymore, like my son does need the dental work done ASAP and I would need to get a job within a week or two?<br/>\n<br/>\nLiving like this is just stressing me out. I am fine with being frugal,  but it makes me so nervous not knowing if we&#39;ll have money for emergencies. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, regan &lt;regan@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi there,<br/>\n&gt; <br/>\n&gt; Our family is not too financially secure.  We have one income, but it&#39;s a freelancer&#39;s income and doesn&#39;t include benefits.  We don&#39;t own any property and do carry debt.<br/>\n&gt; For us, being able to continue to exist as a family is very important -- for this reason, we absolutely carry self-pay health insurance and life insurance.  Before our child was born and I was working on our will, the part that really gave me pause was the part where you have to choose who will raise your child(ren) if something were to befall you.  So I try to minimize the impact of stuff befalling us!  <br/>\n&gt; <br/>\n&gt; For our family, the other important value is really being able to learn.  I grew up in a poor one-income family, where we had no resources whatsoever.  I hoarded my one box of crayons!<br/>\n&gt; Granted, I was in school, so my parents figured that I didn&#39;t need any at-home enrichment.  But I felt the lack, and spent many years trying to catch up and learn the things I wanted to -- like art, which my school didn&#39;t have.<br/>\n&gt; So, we strive for our income to be enough to keep learning on a day-to-day basis, go places, etc. <br/>\n&gt; <br/>\n&gt; cheers,<br/>\n&gt; Regan<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; On Oct 25, 2012, at 11:45 AM, &quot;Joy&quot; &lt;joy_bakker@...&gt; wrote:<br/>\n&gt; <br/>\n&gt; &gt; Hi all, I don&#39;t post often but do read the forum a lot.<br/>\n&gt; &gt; <br/>\n&gt; &gt; I am just curious, how many of you feel that being very financially secure is a necessity to homeschooling?<br/>\n&gt; &gt; <br/>\n&gt; &gt; I&#39;m just wondering because lately we have been meeting a lot of families (not unschoolers though as there aren&#39;t many in our area) who typically have one working parent who earns enough to support the family well, they have a stable job, benefits, etc and it seems that this working parent also has good job security.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Well, this is not our case at all. In order to unschool we had to make a lot of choices that went against the above grain.<br/>\n&gt; &gt; <br/>\n&gt; &gt; First, when we started our family 6 years ago, we both just graduated from school and I stayed at home and hubby started to gain experience in entry level jobs. Then he decided he wants to be a bigger part of homeschooling so he has been freelancing from home and I am slowly starting to do the same (though it is much slower for me since I am still the main care giving/home educating parent).<br/>\n&gt; &gt; <br/>\n&gt; &gt; So long story short, we by no means have any sort of solid financial stability and foundation.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Working from home has proved challenging as sometimes, in between contracts and clients we&#39;ve depleted some of our savings and accumulated some debt.<br/>\n&gt; &gt; <br/>\n&gt; &gt; And by no means can we afford right now to be picture perfect home schooling parents that provide their kids will all the little extras like the loads of extra-curricular activities we see other home schooling parents providing for their kids.<br/>\n&gt; &gt; <br/>\n&gt; &gt; And at this point, we don&#39;t even have a basic foundation for emergencies and all of our necessities, should emergencies arise (like emergency dental work or money for a new car if we needed it, major home repairs, etc if we needed it).<br/>\n&gt; &gt; <br/>\n&gt; &gt; So I am kind of wondering, are we in the minority - do majority of homeschooling families have that solid financial base.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Are we fooling ourselves since we are only now trying to build some sort of financial base by starting up several home businesses?<br/>\n&gt; &gt; <br/>\n&gt; &gt; A part of me thinks that maybe experiencing these challenges is good as it is motivating us to work through these problems and build that solid foundation but I also wonder if maybe we are risking too much by not being in the space right now where we have money for emergencies. Are we just risking too much to unschool?<br/>\n&gt; &gt; <br/>\n&gt; &gt; I totally agree with people when they say that you need to look at priorities and that the time with your kids is so much more than the material things or fancy vacations you can give them, but what about emergency money for our home, medical, dental care, food, etc.<br/>\n&gt; &gt; <br/>\n&gt; &gt; It makes me weary that we don&#39;t have that, and I am wondering, are we the only ones in this tricky financial situation? Are the only people who end up homeschooling the ones that do have the financial bases covered for things like emergencies?<br/>\n&gt; &gt; <br/>\n&gt; &gt; I consider us at least fortunate that we at the very least have our own house and are actually able to find the means to earn money from home but it will still take many years to get to the point where we have that solid base.<br/>\n&gt; &gt; <br/>\n&gt; &gt; So a part of me is feeling guilty, like we are being irresponsible by pushing on with this without that base when technically we would already have that base if we both had jobs outside the home.<br/>\n&gt; &gt; <br/>\n&gt; &gt; I don&#39;t mind that we are risk takers but there are risks you take yourself, like say, putting your own medical bills on hold and then there are risks that maybe aren&#39;t ok to take for your kids, like knowing that if your kids need emergency dental work the money is not there or the fact that we don&#39;t always know where our next pay cheque will come from.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Are we just crazy to take all this risk in order to unschool?<br/>\n&gt; &gt; <br/>\n&gt; &gt; Or do a lot of unschooling families end up taking on a lot of risk too and they pull through it and it turns out all ok??<br/>\n&gt; &gt; <br/>\n&gt; &gt; Kinda just wondering if we are just nuts to keep doing this now or if this is sometimes the normal (whatever normal is) process when you go against the grain and build an alternative life style?<br/>\n&gt; &gt; <br/>\n&gt; &gt; Thanks so much for your thoughts,<br/>\n&gt; &gt; <br/>\n&gt; &gt; Joy<br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":174155498,"authorName":"Carrie","from":"&quot;Carrie&quot; &lt;frazzledhetumom@...&gt;","profile":"frazzledhetumom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: no financial foundation - are we nuts to keep unschooling?","postDate":"1351187273","msgId":49199,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2YnUwOSs1cG1mQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs2Ym1xMis2ODh0QGVHcm91cHMuY29tPg=="},"prevInTopic":49198,"nextInTopic":49200,"prevInTime":49198,"nextInTime":49200,"topicId":49195,"numMessagesInTopic":0,"msgSnippet":"Joy, While I have several blogs, I would like to point you to my financial one at http://poortorichadayatatime.blogspot.com/ YOU ARE NOT ALONE! Prior to 2008","messageBody":"<div id=\"ygrps-yiv-1255696789\">Joy,<br/>\n<br/>\nWhile I have several blogs, I would like to point you to my financial one at <a rel=\"nofollow\" target=\"_blank\" href=\"http://poortorichadayatatime.blogspot.com/\">http://poortorichadayatatime.blogspot.com/</a><br/>\n<br/>\nYOU ARE NOT ALONE!<br/>\n<br/>\nPrior to 2008 hubby had a decent job but led to 2 heart attacks by age 38 which prompted me to make a drastic choice of packing up our things and moving down south for a year as he was on his way to a third heart attack any day.<br/>\nThat year in the south, we could find no work as the economy crumbled around us and lived the entire year off of growin our own food and scrap metaling to pay rent and utilities.<br/>\n<br/>\nWe moved back to michigan after a year in the south and since then hubby has a full time job but it is only minimum wage.<br/>\n<br/>\nFor 3 years we have managed on $14,000 a year for a family of 5.<br/>\n<br/>\nMy health has has issues this past year so I did have to accept help from food  stamps recently until I can find help medically to get checked. Otherwise I would of taken up a part time job to help.<br/>\n<br/>\nI still chose unschooling throughout it all.........it just has a different level of learning.<br/>\n<br/>\nWhat I mean by that is that we do not have money that I would like to to take advantage of some opportunities that crop up yet there is a whole world of learning still going on through some very difficult financial struggles.<br/>\n<br/>\nLast year our car broke down, we had no money to replace it so me and hubby biked every single day for 3 months 5 miles to town and 5 miles back. For him it was work, for me it was laundry and groceries to keep the kids fed. <br/>\n<br/>\nWe do take advantage of getting interesting materials at garage sales when we can and after 3 years things are finally looking up a little for us.<br/>\n<br/>\nYet through this the kids have learned I have frugality down to a science ( after all for 3 years I fed the family really well on $250 a month or less!)<br/>\n<br/>\nWe discuss openly the economy, frugality, consumerism, how advertisements are made with subliminal messages and imagery to get you to buy, how Monsanto monopolizes industry and hurts the small farmer, we dream big as a family and work together on how we can make it reality.  They know about reading electric meters, reducing costs, minimalist living and a whole array of other things that some may never think to learn if never faced with financial difficulties.<br/>\n<br/>\nWe have learned how to have a lot of free fun and when it does involve spending some money it has come to be extremly cherished and appreciated.<br/>\n<br/>\nWe even have a plan most think of as crazy for hubby to &quot;retire&quot; in 3 years, most think it to be an impossible feat with us living at 150% poverty level....... yet I know it will work, I have a plan that most would never dream of making.....and me and hubby are good with that decision.<br/>\n<br/>\nWhile it is not easy nor is it something I would recommend for most, I am just sharing with you to  show it is still possible, you are not crazy and you are most certainly not alone. I could share much more but it would take up a whole book :)<br/>\n<br/>\nCarrie<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Joy&quot; &lt;joy_bakker@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi all, I don&#39;t post often but do read the forum a lot.<br/>\n&gt; <br/>\n&gt; I am just curious, how many of you feel that being very financially secure is a necessity to homeschooling?<br/>\n&gt; <br/>\n&gt; I&#39;m just wondering because lately we have been meeting a lot of families (not unschoolers though as there aren&#39;t many in our area) who typically have one working parent who earns enough to support the family well, they have a stable job, benefits, etc and it seems that this working parent also has good job security.<br/>\n&gt; <br/>\n&gt; Well, this is not our case at all. In order to unschool we had to make a lot of choices that went against the above grain.<br/>\n&gt; <br/>\n&gt; First, when we started our family 6 years ago, we both just graduated from school and I stayed at home and hubby started to gain experience in entry level jobs. Then he decided he wants to be a bigger part of homeschooling so he has been freelancing from home and I am slowly starting to do the same (though it is much slower for me since I am still the main care giving/home educating parent).<br/>\n&gt; <br/>\n&gt; So long story short, we by no means have any sort of solid financial stability and foundation.<br/>\n&gt; <br/>\n&gt; Working from home has proved challenging as sometimes, in between contracts and clients we&#39;ve depleted some of our savings and accumulated some debt.<br/>\n&gt; <br/>\n&gt; And by no means can we afford right now to be picture perfect home schooling parents that provide their kids will all the little extras like the loads of extra-curricular activities we see other home schooling parents providing for their kids.<br/>\n&gt; <br/>\n&gt; And at this point, we don&#39;t even have a basic foundation for emergencies and all of our necessities, should emergencies arise (like emergency dental work or money for a new car if we needed it, major home repairs, etc if we needed it).<br/>\n&gt; <br/>\n&gt; So I am kind of wondering, are we in the minority - do majority of homeschooling families have that solid financial base.<br/>\n&gt; <br/>\n&gt; Are we fooling ourselves since we are only now trying to build some sort of financial base by starting up several home businesses?<br/>\n&gt; <br/>\n&gt; A part of me thinks that maybe experiencing these challenges is good as it is motivating us to work through these problems and build that solid foundation but I also wonder if maybe we are risking too much by not being in the space right now where we have money for emergencies. Are we just risking too much to unschool?<br/>\n&gt; <br/>\n&gt; I totally agree with people when they say that you need to look at priorities and that the time with your kids is so much more than the material things or fancy vacations you can give them, but what about emergency money for our home, medical, dental care, food, etc.<br/>\n&gt; <br/>\n&gt; It makes me weary that we don&#39;t have that, and I am wondering, are we the only ones in this tricky financial situation? Are the only people who end up homeschooling the ones that do have the financial bases covered for things like emergencies?<br/>\n&gt; <br/>\n&gt; I consider us at least fortunate that we at the very least have our own house and are actually able to find the means to earn money from home but it will still take many years to get to the point where we have that solid base.<br/>\n&gt; <br/>\n&gt; So a part of me is feeling guilty, like we are being irresponsible by pushing on with this without that base when technically we would already have that base if we both had jobs outside the home.<br/>\n&gt; <br/>\n&gt; I don&#39;t mind that we are risk takers but there are risks you take yourself, like say, putting your own medical bills on hold and then there are risks that maybe aren&#39;t ok to take for your kids, like knowing that if your kids need emergency dental work the money is not there or the fact that we don&#39;t always know where our next pay cheque will come from.<br/>\n&gt; <br/>\n&gt; Are we just crazy to take all this risk in order to unschool?<br/>\n&gt; <br/>\n&gt; Or do a lot of unschooling families end up taking on a lot of risk too and they pull through it and it turns out all ok??<br/>\n&gt; <br/>\n&gt; Kinda just wondering if we are just nuts to keep doing this now or if this is sometimes the normal (whatever normal is) process when you go against the grain and build an alternative life style?<br/>\n&gt; <br/>\n&gt; Thanks so much for your thoughts,<br/>\n&gt; <br/>\n&gt; Joy<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":418152252,"authorName":"Katherine Havener","from":"Katherine Havener &lt;kchavener@...&gt;","profile":"kchavener@att.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"1"},"subject":"Re: [unschoolingbasics] no financial foundation - are we nuts to keep unschooling?","postDate":"1351185891","msgId":49198,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTExODU4OTEuNjgzMjMuWWFob29NYWlsUkNAd2ViMTgxMzAzLm1haWwubmUxLnlhaG9vLmNvbT4=","inReplyToHeader":"PGs2Ym1xMis2ODh0QGVHcm91cHMuY29tPg==","referencesHeader":"PGs2Ym1xMis2ODh0QGVHcm91cHMuY29tPg=="},"prevInTopic":49197,"nextInTopic":49199,"prevInTime":49197,"nextInTime":49199,"topicId":49195,"numMessagesInTopic":0,"msgSnippet":"You are not alone.  We have accrued significant debt and have even filed bankruptcy due to our choice to have me at home with our children all these years.","messageBody":"<div id=\"ygrps-yiv-942101284\">You are not alone.  We have accrued significant debt and have even filed <br/>\nbankruptcy due to our choice to have me at home with our children all these <br/>\nyears.   (I have a law degree and the huge student loans that come along with <br/>\nthat, but no legal job to pay towards the loans).  We have not been able to buy <br/>\ntons of things, or go tons of places either.  And you know what? I don&#39;t regret <br/>\nit one bit.  IMO, we have one chance to enjoy our children&#39;s childhood - one <br/>\nchance to give them the foundation of love, attachment, respect - that they <br/>\ndeserve.  By having them home with me, I get to enjoy every single day being <br/>\naround them.  And they enjoy it too - they can&#39;t imagine any other way of life.  <br/>\nMy husband always says - that money is just numbers.. we can attach the <br/>\nimportance to those numbers that we want.  I choose not to think of the debt as <br/>\na failure, or as lack, but right now, as in investment in the great lives of our <br/>\nchildren.<br/>\n<br/>\n Katherine in California<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":482623530,"authorName":"Lesley Cross","from":"Lesley Cross &lt;lesleycross@...&gt;","profile":"decldc1992","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] no financial foundation - are we nuts to keep unschooling?","postDate":"1351185539","msgId":49196,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM2MUQ2RUQxLTU2Q0ItNEVBNy05MjlCLUE3MjJCQTNFNUVDOUBhdHQubmV0Pg==","inReplyToHeader":"PGs2Ym1xMis2ODh0QGVHcm91cHMuY29tPg==","referencesHeader":"PGs2Ym1xMis2ODh0QGVHcm91cHMuY29tPg=="},"prevInTopic":49195,"nextInTopic":49197,"prevInTime":49195,"nextInTime":49197,"topicId":49195,"numMessagesInTopic":0,"msgSnippet":"Hey Joy, This really isn t about what anyone else does.  It s about your level of comfort, what works or doesn t work for you and your kids.  There are PLENTY","messageBody":"<div id=\"ygrps-yiv-780606891\">Hey Joy,<br/>\nThis really isn&#39;t about what anyone else does.  It&#39;s about your level of comfort, what works or doesn&#39;t work for you and your kids.  There are PLENTY of unschoolers in a similar situation to yours.  My own family is somewhere in the middle.  Whether any of us would *recommend* that?  I don&#39;t know.  I&#39;ve been thinking that establishing a firm financial foundation BEFORE having kids would have been a better idea.  Of course then I wouldn&#39;t have the kids I have.  But it&#39;s a suggestion I&#39;ve made to them....fact is though, there is never a &quot;perfect time&quot; to have kids.  And our plans have changed many times over our parenthood journey.  When my oldest was young, both of us worked full time, different shifts.  I was considering future career prospects as my second left babyhood....then had another baby.  We&#39;ve always unschooled, not really counting the year or so my oldest was in part-time daycare...he was 4.  <br/>\n<br/>\nHere we weigh out the options we can see (I know there are many more than that) vs. where we are.  When it comes down to it, for us, my kids need me home and need unschooling lives to thrive.  That&#39;s our baseline.  We also know we need to deal with the finances... we&#39;ve had prosperous and lean times....now we&#39;re lean heading to prosperous (some big debt will soon be paid off) and have learned a lot from the past.  Not that you asked for advice, but I speak from experience when I say don&#39;t use credit.  The &quot;someday&quot; when you can pay it off does not come nearly as quickly and easily as you might plan for.  Life happens.  Remember that every time you buy something on credit, it&#39;s like paying double.  Save whenever you can until you CAN cover emergencies.  If you have credit card debt, negotiate lower rates, even if it means messing up your credit for a while by not paying...you don&#39;t want to use it anyway.  Get financial counseling from your local credit union because they can help you   Find ways, when there&#39;s need, to make enough money to cover the need.  I&#39;ve worked for friends, taken one time jobs (not really temp work...but it&#39;s a possibility), babysat.  I do some tutoring now that&#39;s kept us fed a few times in the last few months.  <br/>\n<br/>\nAs our kids get older and need me less, I&#39;m working more.  Right now I&#39;m experimenting with nearly full-time hours to build my business.  I&#39;ve worked part time out of the home, when my dh was home.  I went to school for a while because at the time I saw that as a good solution to several things...finances being one...but also a career that interested me with flexible hours (my plan was to become a holistic nurse practitioner...not that I won&#39;t do it eventually, I might, but the timing didn&#39;t work out with my family&#39;s needs).  My dh does have a good career....what seems to happen just as I&#39;m about to pick up the financial slack is that his career advances.  That&#39;s been nice.<br/>\n<br/>\nBut like I said, it&#39;s about YOUR comfort zones and what works for your kids.  Some unschooled kids spend time in school because it&#39;s convenient free daycare and they aren&#39;t opposed to it.  If your children can do well in that environment, why not, temporarily?  I LOVED school my first few years.  You can always change things as you need to...in fact change is a given.    <br/>\n<br/>\nPlenty of folks live without a financial foundation and their kids are IN school.  One does not necessarily have to do with the other. It&#39;s really about the other choices you make and priorities you set.  <br/>\n<br/>\nLesley <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://euphorialifedesignstudio.com\">http://euphorialifedesignstudio.com</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":382612893,"authorName":"regan","from":"regan &lt;regan@...&gt;","profile":"reganzzzz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] no financial foundation - are we nuts to keep unschooling?","postDate":"1351185239","msgId":49197,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMDFCQ0NCLTNFOTUtNDM3MC04M0IyLTYwQjdGRDc1RDc3OEBzbG93Z2xvd2luZy5jb20+","inReplyToHeader":"PGs2Ym1xMis2ODh0QGVHcm91cHMuY29tPg==","referencesHeader":"PGs2Ym1xMis2ODh0QGVHcm91cHMuY29tPg=="},"prevInTopic":49196,"nextInTopic":49198,"prevInTime":49196,"nextInTime":49198,"topicId":49195,"numMessagesInTopic":0,"msgSnippet":"Hi there, Our family is not too financially secure.  We have one income, but it s a freelancer s income and doesn t include benefits.  We don t own any","messageBody":"<div id=\"ygrps-yiv-1159219413\">Hi there,<br/>\n<br/>\nOur family is not too financially secure.  We have one income, but it&#39;s a freelancer&#39;s income and doesn&#39;t include benefits.  We don&#39;t own any property and do carry debt.<br/>\nFor us, being able to continue to exist as a family is very important -- for this reason, we absolutely carry self-pay health insurance and life insurance.  Before our child was born and I was working on our will, the part that really gave me pause was the part where you have to choose who will raise your child(ren) if something were to befall you.  So I try to minimize the impact of stuff befalling us!  <br/>\n<br/>\nFor our family, the other important value is really being able to learn.  I grew up in a poor one-income family, where we had no resources whatsoever.  I hoarded my one box of crayons!<br/>\nGranted, I was in school, so my parents figured that I didn&#39;t need any at-home enrichment.  But I felt the lack, and spent many years trying to catch up and learn the things I wanted to -- like art, which my school didn&#39;t have.<br/>\nSo, we strive for our income to be enough to keep learning on a day-to-day basis, go places, etc. <br/>\n<br/>\ncheers,<br/>\nRegan<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Oct 25, 2012, at 11:45 AM, &quot;Joy&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:joy_bakker@...\">joy_bakker@...</a>&gt; wrote:<br/>\n<br/>\n&gt; Hi all, I don&#39;t post often but do read the forum a lot.<br/>\n&gt; <br/>\n&gt; I am just curious, how many of you feel that being very financially secure is a necessity to homeschooling?<br/>\n&gt; <br/>\n&gt; I&#39;m just wondering because lately we have been meeting a lot of families (not unschoolers though as there aren&#39;t many in our area) who typically have one working parent who earns enough to support the family well, they have a stable job, benefits, etc and it seems that this working parent also has good job security.<br/>\n&gt; <br/>\n&gt; Well, this is not our case at all. In order to unschool we had to make a lot of choices that went against the above grain.<br/>\n&gt; <br/>\n&gt; First, when we started our family 6 years ago, we both just graduated from school and I stayed at home and hubby started to gain experience in entry level jobs. Then he decided he wants to be a bigger part of homeschooling so he has been freelancing from home and I am slowly starting to do the same (though it is much slower for me since I am still the main care giving/home educating parent).<br/>\n&gt; <br/>\n&gt; So long story short, we by no means have any sort of solid financial stability and foundation.<br/>\n&gt; <br/>\n&gt; Working from home has proved challenging as sometimes, in between contracts and clients we&#39;ve depleted some of our savings and accumulated some debt.<br/>\n&gt; <br/>\n&gt; And by no means can we afford right now to be picture perfect home schooling parents that provide their kids will all the little extras like the loads of extra-curricular activities we see other home schooling parents providing for their kids.<br/>\n&gt; <br/>\n&gt; And at this point, we don&#39;t even have a basic foundation for emergencies and all of our necessities, should emergencies arise (like emergency dental work or money for a new car if we needed it, major home repairs, etc if we needed it).<br/>\n&gt; <br/>\n&gt; So I am kind of wondering, are we in the minority - do majority of homeschooling families have that solid financial base.<br/>\n&gt; <br/>\n&gt; Are we fooling ourselves since we are only now trying to build some sort of financial base by starting up several home businesses?<br/>\n&gt; <br/>\n&gt; A part of me thinks that maybe experiencing these challenges is good as it is motivating us to work through these problems and build that solid foundation but I also wonder if maybe we are risking too much by not being in the space right now where we have money for emergencies. Are we just risking too much to unschool?<br/>\n&gt; <br/>\n&gt; I totally agree with people when they say that you need to look at priorities and that the time with your kids is so much more than the material things or fancy vacations you can give them, but what about emergency money for our home, medical, dental care, food, etc.<br/>\n&gt; <br/>\n&gt; It makes me weary that we don&#39;t have that, and I am wondering, are we the only ones in this tricky financial situation? Are the only people who end up homeschooling the ones that do have the financial bases covered for things like emergencies?<br/>\n&gt; <br/>\n&gt; I consider us at least fortunate that we at the very least have our own house and are actually able to find the means to earn money from home but it will still take many years to get to the point where we have that solid base.<br/>\n&gt; <br/>\n&gt; So a part of me is feeling guilty, like we are being irresponsible by pushing on with this without that base when technically we would already have that base if we both had jobs outside the home.<br/>\n&gt; <br/>\n&gt; I don&#39;t mind that we are risk takers but there are risks you take yourself, like say, putting your own medical bills on hold and then there are risks that maybe aren&#39;t ok to take for your kids, like knowing that if your kids need emergency dental work the money is not there or the fact that we don&#39;t always know where our next pay cheque will come from.<br/>\n&gt; <br/>\n&gt; Are we just crazy to take all this risk in order to unschool?<br/>\n&gt; <br/>\n&gt; Or do a lot of unschooling families end up taking on a lot of risk too and they pull through it and it turns out all ok??<br/>\n&gt; <br/>\n&gt; Kinda just wondering if we are just nuts to keep doing this now or if this is sometimes the normal (whatever normal is) process when you go against the grain and build an alternative life style?<br/>\n&gt; <br/>\n&gt; Thanks so much for your thoughts,<br/>\n&gt; <br/>\n&gt; Joy<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":357126582,"authorName":"Joy","from":"&quot;Joy&quot; &lt;joy_bakker@...&gt;","profile":"joy_bakker","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"no financial foundation - are we nuts to keep unschooling?","postDate":"1351179906","msgId":49195,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2Ym1xMis2ODh0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":49196,"prevInTime":49194,"nextInTime":49196,"topicId":49195,"numMessagesInTopic":0,"msgSnippet":"Hi all, I don t post often but do read the forum a lot. I am just curious, how many of you feel that being very financially secure is a necessity to","messageBody":"<div id=\"ygrps-yiv-1894866935\">Hi all, I don&#39;t post often but do read the forum a lot.<br/>\n<br/>\nI am just curious, how many of you feel that being very financially secure is a necessity to homeschooling?<br/>\n<br/>\nI&#39;m just wondering because lately we have been meeting a lot of families (not unschoolers though as there aren&#39;t many in our area) who typically have one working parent who earns enough to support the family well, they have a stable job, benefits, etc and it seems that this working parent also has good job security.<br/>\n<br/>\nWell, this is not our case at all. In order to unschool we had to make a lot of choices that went against the above grain.<br/>\n<br/>\nFirst, when we started our family 6 years ago, we both just graduated from school and I stayed at home and hubby started to gain experience in entry level jobs. Then he decided he wants to be a bigger part of homeschooling so he has been freelancing from home and I am slowly starting to do the same (though it is much slower for me since I am still the main care giving/home educating parent).<br/>\n<br/>\nSo long story short, we by no means have any sort of solid financial stability and foundation.<br/>\n<br/>\nWorking from home has proved challenging as sometimes, in between contracts and clients we&#39;ve depleted some of our savings and accumulated some debt.<br/>\n<br/>\nAnd by no means can we afford right now to be picture perfect home schooling parents that provide their kids will all the little extras like the loads of extra-curricular activities we see other home schooling parents providing for their kids.<br/>\n<br/>\nAnd at this point, we don&#39;t even have a basic foundation for emergencies and all of our necessities, should emergencies arise (like emergency dental work or money for a new car if we needed it, major home repairs, etc if we needed it).<br/>\n<br/>\nSo I am kind of wondering, are we in the minority - do majority of homeschooling families have that solid financial base.<br/>\n<br/>\nAre we fooling ourselves since we are only now trying to build some sort of financial base by starting up several home businesses?<br/>\n<br/>\nA part of me thinks that maybe experiencing these challenges is good as it is motivating us to work through these problems and build that solid foundation but I also wonder if maybe we are risking too much by not being in the space right now where we have money for emergencies. Are we just risking too much to unschool?<br/>\n<br/>\nI totally agree with people when they say that you need to look at priorities and that the time with your kids is so much more than the material things or fancy vacations you can give them, but what about emergency money for our home, medical, dental care, food, etc.<br/>\n<br/>\nIt makes me weary that we don&#39;t have that, and I am wondering, are we the only ones in this tricky financial situation? Are the only people who end up homeschooling the ones that do have the financial bases covered for things like emergencies?<br/>\n<br/>\nI consider us at least fortunate that we at the very least have our own house and are actually able to find the means to earn money from home but it will still take many years to get to the point where we have that solid base.<br/>\n<br/>\nSo a part of me is feeling guilty, like we are being irresponsible by pushing on with this without that base when technically we would already have that base if we both had jobs outside the home.<br/>\n<br/>\nI don&#39;t mind that we are risk takers but there are risks you take yourself, like say, putting your own medical bills on hold and then there are risks that maybe aren&#39;t ok to take for your kids, like knowing that if your kids need emergency dental work the money is not there or the fact that we don&#39;t always know where our next pay cheque will come from.<br/>\n<br/>\nAre we just crazy to take all this risk in order to unschool?<br/>\n<br/>\nOr do a lot of unschooling families end up taking on a lot of risk too and they pull through it and it turns out all ok??<br/>\n<br/>\nKinda just wondering if we are just nuts to keep doing this now or if this is sometimes the normal (whatever normal is) process when you go against the grain and build an alternative life style?<br/>\n<br/>\nThanks so much for your thoughts,<br/>\n<br/>\nJoy</div>","specialLinks":[]}],"prevTopicId":49176,"nextTopicId":49217}}