{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":299286442,"authorName":"Cameron Parham","from":"Cameron Parham &lt;acsp2205@...&gt;","profile":"acsp2205","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] advice with 7 y/o son","postDate":"1183522001","msgId":24841,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwOTUwMS42MDEyNS5xbUB3ZWI1OTIwMy5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":24833,"nextInTopic":0,"prevInTime":24840,"nextInTime":24842,"topicId":24832,"numMessagesInTopic":0,"msgSnippet":"Anyone else who feels like their remaining engaged just ramps things up? My family (parents) and my sitter both feel that my emotional engagement fuels the","messageBody":"<div id=\"ygrps-yiv-1210511763\">Anyone else who feels like their remaining engaged just ramps things up? <br/>\nMy family (parents) and my sitter both feel that my emotional engagement fuels the flames of my 3 kids&#39; emotional traumas. I think, though, that if we must err, we are better to over-validate than dismiss. And you are doing a great job, I can tell! But I do believe that our intuition is very valuable, and if you wonder whether you&#39;re somehow &#39;ramping him up&#39; or if you need space I&#39;d listen to your heart.  If many of his episodes are predictable, can you prepare him ahead? (I realize that you may have tried this already.) <br/>\nFor example: &quot;Your brother really needs his goggles to enjoy the water.  I am thinking we might need to replace them. What do you think?&quot;  If he says &quot;No, that&#39;s not fair, I&#39;d want something new.&quot;  You could say, &quot;Well, if you lost yours I&#39;ll bet that you&#39;d really hope that we could replace them. How do you think we could solve this problem?&quot;  He may generate solutions, or use it as a chance to process feelings ahead, or to put himself in his brothers&#39; place (empathic skills, problem solving skills, etc)--all of which may be easier when the &#39;unfair&#39; new goggles haven&#39;t been bought yet.  You could make a plan with his input--even best, use his plan--then help him remember the plan as the challenge occurs.  You could also have a dialogue about how space/solitude/quiet time can help people get perspective on a disagreeable situation.  Such as, &quot;You know, sometimes I find that when I am upset over something, after I have talked about it, a quiet or private time can help me.  It<br/>\n isn&#39;t about getting away from someone, it&#39;s really about getting my self quiet. Maybe just to rest or think. Have you ever felt like that?&quot;  If he is interested, you could propose a plan, such that either of you could say, &quot;I think that I would like some quiet time now.&quot;  Or whatever works for you.  The important things for our family are mainly 2 issues:  that both people involved like the plan, and that it is discussed before it is a heated-up acute event.  Now in a way this begs the original question of whether our empathic involvement can ramp-up a difficult time for a child.  But these are ways that I try to dilute some of the predictable melt-downs and explore solutions with the child. Feedback?<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Deb","from":"&quot;Deb&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: advice with 7 y/o son","postDate":"1183496405","msgId":24833,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY2ZWRjbCs0NDAxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY2ZThtaSs5Z3MwQGVHcm91cHMuY29tPg=="},"prevInTopic":24832,"nextInTopic":24841,"prevInTime":24832,"nextInTime":24834,"topicId":24832,"numMessagesInTopic":0,"msgSnippet":"Sometimes there needs to be space for the feelings to come out without any other words from anyone else. Sometimes, I ll just sit and LISTEN, not say a word,","messageBody":"<div id=\"ygrps-yiv-1101284676\">Sometimes there needs to be space for the feelings to come out <br/>\nwithout any other words from anyone else. Sometimes, I&#39;ll just sit <br/>\nand LISTEN, not say a word, not validate, not offer thoughts, ideas, <br/>\nsuggestions, just sit quietly, open body language (no crossing arms <br/>\nor legs or whatever, just relaxed, comfortable, breathing). Until <br/>\nthe feelings can come out, DS can&#39;t hear anything else. Once it&#39;s <br/>\nall out, THEN I can validate, suggest, ask questions, etc. Talking <br/>\ntoo soon just fuels another go-round. It&#39;s a fine balance but one <br/>\nthat we&#39;re getting better at over time.<br/>\n<br/>\nAlso, sometimes the immediate focus is NOT the issue. It&#39;s just the <br/>\nlast drop in the bucket that causes it to overflow. For example, it <br/>\nmight not be the goggles themselves but something else going on that <br/>\nday (too much busyness, an ongoing issue with sibling getting lots <br/>\nof mom&#39;s time, hunger, etc). The goggles just hit at the wrong time <br/>\nand the bucket overflows. Then, in all good intention, you start <br/>\ntalking - validating, suggesting, helping. BUT it&#39;s too much - <br/>\nyou&#39;re pouring more water into an overflowing bucket. Gotta let the <br/>\nflow of water die down first then start talking.<br/>\n<br/>\nMost of the time, DS will go stomp up the stairs (wood floors so the <br/>\nstairs make a great lot of noise) and slam his door (sometimes <br/>\nrepeatedly). Eventually, he comes down and can talk again (or he&#39;ll <br/>\nask me to come up to talk). If he heads in the direction of <br/>\nphysically hurting someone (me usually), I&#39;ll head him off and <br/>\nsuggest he go stomp because intentionally hurting someone is right <br/>\nout. He can go stomp, he can yell, he can hit pillows, he cannot do <br/>\ninjury. How and where he chooses to vent is up to him. If he wants, <br/>\nI&#39;ll go with him or stay with him and just wait it out, quietly.<br/>\n<br/>\nhth<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":251728791,"authorName":"Chris","from":"&quot;Chris&quot; &lt;chris1962@...&gt;","profile":"chriscb2262","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"advice with 7 y/o son","postDate":"1183491602","msgId":24832,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY2ZThtaSs5Z3MwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":24833,"prevInTime":24831,"nextInTime":24833,"topicId":24832,"numMessagesInTopic":0,"msgSnippet":"Hi all-- I would like some suggestions for dealing with my 7 y/o son. He is a sensitive child and often gets extremely upset about things that many others","messageBody":"<div id=\"ygrps-yiv-760896870\">Hi all--<br/>\n<br/>\nI would like some suggestions for dealing with my 7 y/o son. He is a <br/>\nsensitive child and often gets extremely upset about things that <br/>\nmany others would not. I can often predict what these things will be-<br/>\n-and sometimes I&#39;m caught totally off-guard. An example that is <br/>\nhappening right now is this: my younger son (4) lost his swimming <br/>\ngoggles and so today I bought him a new pair similar to the others <br/>\nbut not exactly the same--the former looked like tropical fish <br/>\naround the outside of the eye and the new ones look like sharks. I <br/>\ncame home and gave them to my younger son and it immediately set off <br/>\nmy older one. <br/>\n<br/>\nHe sees it as unfair that his brother got new goggles and sees it as <br/>\nhis brother getting something new and his being left out vs. it <br/>\nbeing fair b/c they both have goggles. Now, I understand that it is <br/>\nhard to see your brother get something new even if its a <br/>\nreplacement. <br/>\n<br/>\nAnyway, what happens is that I validate, listen,--hard not to get <br/>\nsomething new at the same time, feels unfair to you, you really wish <br/>\nyou could get a new pair too, etc. But it seems to go on forever. <br/>\nThere&#39;s crying and stomping out of the room, re-engagement and more <br/>\ncrying, he won&#39;t come up with solutions and rejects what I offer. <br/>\nAnd it seems to go on and on. Sometimes I feel like my presence just <br/>\nkeeps him going and if I could politely disappear for a bit, it <br/>\nwould die down. It sometimes seems that just my presence adds fuel <br/>\nto the fire because it takes two to tango. <br/>\n<br/>\nSo, any suggestions regarding what I could do, what I&#39;m not doing? <br/>\nMaybe I&#39;m wishing too hard for the sitution to resolve and not <br/>\ngiving it time? And thoughts to the two of us having some space in a <br/>\nway that doesn&#39;t make him feel rejected? Anyone else who feels like <br/>\ntheir remaining engaged just ramps things up? <br/>\n<br/>\nThanks,<br/>\n<br/>\nChris</div>","specialLinks":[]}],"prevTopicId":24818,"nextTopicId":24840}}