{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: math anxiety WAS graphic novels","postDate":"1236610145","msgId":38824,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxMTA4OS40MTQ2MC5xbUB3ZWI1MzgwNC5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":38823,"nextInTime":38825,"topicId":38824,"numMessagesInTopic":0,"msgSnippet":"If people with math anxiety could talk dispassionately about it, maybe that would be fine. But they imbue these kinds of comments with negative emotion and","messageBody":"<div id=\"ygrps-yiv-1044552943\">If people with math anxiety could talk dispassionately about it, maybe that would be fine. But they imbue these kinds of comments with negative emotion and also perpetuate certain common myths when they say things like, &quot;I&#39;m just not a math person,&quot; &quot;I don&#39;t have a math brain,&quot; &quot;You&#39;re like your mom, no math genes,&quot; &quot;Well, its okay, you&#39;re artistic.&quot; And so <br/>\n<br/>\non.<br/>\n<br/>\n*****<br/>\nAs a child, I learned what I call &#39;math as parlor tricks&#39; at home.  My Dad was always throwing out math problems, and we did math in our heads.  He also enjoyed word games, spelling out words with the same letter groups, but different sounds (cough vs through).  As a result, none of us (three kids) were much good at higher math on paper.  That kind of thing  catches up to you when you hit algebra, because the sheer volume of info is more than most of us can juggle in our heads.  <br/>\n<br/>\nI&#39;ve always acknowledged to my kids that I do math differently from the way it&#39;s taught in textbooks.  We talk about math and number as lot -- as it comes up naturally in our lives and they often do math for entertainment.  No math on paper, tho.   A couple of years ago, Andy wanted to do some math worksheets (a leftover from a summer with his grandma in our eclectic schooling days).  The novelty last a week or two, and it gave me an opportunity to show them both how math is done on paper.  <br/>\n<br/>\nMy oldest son doesn&#39;t think/understand math in textbook terms either. But his way of understanding math is different from mine, too.  It caused some anxiety for him when he started community college because I&#39;d not been much help to him given our difference in math styles.  He&#39;s been very pleased to find the (remedial) college math courses he&#39;s taken so far to be not as bad as he&#39;d feared.  He usually scores 90% or better on tests and homework.  <br/>\n<br/>\nWe&#39;ve found it helpful to share all our learning differences with the kids, without any anxiety.  They find it funny that we&#39;re both grammar geeks, but dh has no interest (or retention) of history, and that I can&#39;t wrap my head around how radio waves work or why plans stay up in the air. I&#39;m very concrete, where dh is more abstract, and neither of us is good at textbook math.<br/>\n<br/>\nI also recently bought a copy of a book Pam recommended a while back, &#39;All The Math You&#39;ll Ever Need&#39; by Steve Slavin.  I&#39;ve read thru it and it seems very understandable.<br/>\n<br/>\nSyl<br/>\n<br/>\nfamily blog<br/>\n<br/>\n  my blog<br/>\n<br/>\nphoto blog               <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":38808,"nextTopicId":38829}}