{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"family relations was Re: unschooling in an intentional community (the dark side)","postDate":"1269685577","msgId":43513,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI1MjIyOC43MzM3MS5xbUB3ZWI4NjIwNi5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":43512,"nextInTime":43514,"topicId":43513,"numMessagesInTopic":0,"msgSnippet":"When we stay with David s parents things are hard. They are very set in their daily activities and we throw them for a loop every single time. We are this huge","messageBody":"<div id=\"ygrps-yiv-75749076\">When we stay with David&#39;s parents things are hard. They are very set in their daily activities and we throw them for a loop every single time. We are this huge ball of chaos that challenges all of their notions. And we are loud and we want things to do. We try to get out a lot, we try not to live heavily at their house and David and I talk to Simon and Linnaea about how hard it is for his parents to deal with the kind of fun we want to have. Simon and Linnaea seem to be fine with the limitations in their house. Simon will take a portable dvd player and a bunch of dvds and go and sit and watch them in our bedroom. Linnaea will hang out and go explore the outside and look for sugar cane and go swimming in their pool and be happy when we go out somewhere for the day. It seems that it&#39;s always me who gets in trouble. <br/>\n<br/>\nBecause we are such a loud, and large ball of chaos they get tense and snappy. David&#39;s mom is particularly good at finding fault and it can grate on my nerves. So, when she talks about things, minor things, I can find myself getting tense just at the sound of her voice. Invariably I blow up at this old woman and I feel awful. It doesn&#39;t help anything. I apologize quickly and tiptoe around. I think I&#39;m protecting Simon and Linnaea, because it&#39;s in response to some complaint or another that she&#39;s making at the kids, but they don&#39;t want me to yell at their grandma. We haven&#39;t been to Australia to see them in almost 3 years, I don&#39;t think it&#39;s because I&#39;m so difficult, although it could be. I&#39;m hoping this next time I&#39;ll manage to stay calmer and not let my own expectations of how a family should be come in the way of how this family actually is. <br/>\n<br/>\nFor me there is this background of hope that led to resentment that may colour my vision of the family dynamics. I wanted David&#39;s parents to like me. I would write letters and I would send pictures and I worked to make it this happy, happy, joy, joy of in-law life. But when we got together, they were distant and cold and it was hard for me to be around their nagging as play relationship. It helped for me to remember who they are, they are children of a depression and of a war. She is the step-child of a step-father who forced her to do the dinner dishes when she was 4 years old, and who left school to raise her 3 half-siblings when she was 12. He is the child of a mother who left him and his father when he was 4 or 5 to go and live with her sisters. He was in boarding school from 6 and was sent away from London to live with strangers during the war. These are not people for whom close relationships come easily. So, seeing them as these little children in<br/>\n adult bodies can temper my temper and change my expectations of what is possible. <br/>\n<br/>\nIn your situation I would totally change what your expectations are. Your sister-in-law may not have offered an age appropriate game, but see the offering of a game as a kind of reaching for a connection. Maybe your husband could have played with your sister-in-law and brother-in-law while you played the game with your kids. Maybe two games would have been better than one. Maybe she offered the more adult game because she&#39;s feeling isolated by her baby and she&#39;s craving more adult time. Maybe her negative responses to your children have nothing to do with your children and everything to do with her life right now. And in a moment those things are hard to remember. Breathing is a really good thing. Thinking about nice moments, thinking about nice things she did, like refilling a glass when a child asked for a refill or complimenting something you wore. Anything, any small gesture of kindness. Look for those moments so that you can pull them out when you<br/>\n begin to feel tense about how she&#39;s treating your children. Oh, and when they say things like &quot;eat everything on your plate&quot; simply say something like that&#39;s not how we parent them and move on. Don&#39;t let it build up in tension. Oh, and try and keep an emotional distance. My problem with my in-laws is that I want them to like me. But that&#39;s a silly and not realistic end goal. Getting through a visit without clashing is a more reasonable goal. Letting go of my desire for a loving relationship could let me move toward a more peaceful one. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nSchuyler, Meredith and everyone,<br/>\n<br/>\nI&#39;ve been wanting to post about this but it seems to fit in this discussion so I&#39;ll drop in!<br/>\n<br/>\nA few weeks ago we went to my husbands Moms for a birthday lunch for him. Relationships were estranged for years but come round to some civility now but not very deep. His sister I just about tolerate as she has put our family through a lot.<br/>\n<br/>\nSo after dinner she brought out games to play and started with a card game that said 13+ my oldest is near 14 and all the way down to 3yo wanting to play. She really wanted to play herself and wasn&#39;t thinking of the kids so after listening blankly to the rules I spoke up to say lets try a different game.<br/>\n<br/>\nWe set up Guillotine, a fun card game, but she harassed all my kids, including a very strategic 12yo who wanted to think deeply about his possible moves, to hurry up and go, she was stressed that her only baby would wake up and she would have to leave the game. We have six kids and our 10mnth old was also asleep on the sofa. I managed to say I felt a bit harassed.<br/>\n<br/>\nThen my 6yo wanted to join in and got up on her husbands knee. Come her turn he made her move for her with no discussion adn moved on. She said &quot;What happened&quot; and &quot;That was no fun&quot;. When I said she would like to make her own turn he said &quot;But she is just a minor&quot; So I took her cards, read them with her and helped her understand her options amid lots of eye rolling from SIL. DD decided to take a high score card away from my BIL, he then put her OFF his knee and said &quot;Now you can sit somewhere else&quot;. She was astounded, as was I and all I could do was get her a chair and set her up beside me.<br/>\n<br/>\nI feel I should have said or done something different! Do we just steer away from games in the future, should I say something after the fact, their ideas about children are SO far from mine I think it would not help. But every time wa are there something they say makes me want to throttle them!! &quot;Eat everything on your plate&quot;, &quot;Don&#39;t have a fit if you don&#39;t like your present&quot;, <br/>\n<br/>\nWe don&#39;t have contact with people who talk to kids that way, except for them. Do I make a stand and damage relations again or deal with it another way?<br/>\n<br/>\n<br/>\nCara<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":43510,"nextTopicId":43515}}