{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":26,"messages":[{"userId":337793367,"authorName":"lunadanus","from":"&quot;lunadanus&quot; &lt;lunadanus@...&gt;","profile":"lunadanus","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: naomi aldort, tv & junk food. help!","postDate":"1271417084","msgId":43687,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxOWhkcyt2bTRrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhxN2EzditwbTF1QGVHcm91cHMuY29tPg=="},"prevInTopic":43682,"nextInTopic":0,"prevInTime":43686,"nextInTime":43688,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"Hi Sarabeth... Thank you so much for your thoughtFUL post. I really appreciate the return to *source* ( for lack of a better word here). I mean that sometimes","messageBody":"<div id=\"ygrps-yiv-1280069310\">Hi Sarabeth...<br/>\n<br/>\nThank you so much for your thoughtFUL post. I really appreciate the return to *source* ( for lack of a better word here). I mean that sometimes this journey is so LOADED --- with ideals, mystery and therefore doubt ( for me,anyway) that the underlying reason why we choose to live and grow this way can get lost or at least fractured. Thank you for the simple reminder and clarity.<br/>\n<br/>\n---Nina<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Sarabeth&quot; &lt;sara@...&gt; wrote:<br/>\n<br/>\n&gt; And I think our common ground as unschoolers is this, in the support we give our kids, in the way we&#39;re exploring the world together, not in opposition to each other rather than in the details. What we&#39;re hoping for is the chance to be with our kids as we all grow up, have fun, get sick, try to figure out our personal needs, get healthy, learn from all that our lives encompass, which isn&#39;t everything, or nearly everything, that anyone else&#39;s life does.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: naomi aldort, tv & junk food. help!","postDate":"1271366429","msgId":43682,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxN3Z1dCs2NG1nQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhxN2EzditwbTF1QGVHcm91cHMuY29tPg=="},"prevInTopic":43678,"nextInTopic":43687,"prevInTime":43681,"nextInTime":43683,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"... ************************* Exactly! And yet for some reason every time long time unschoolers say things like its not necessary to limit xyz... its read as","messageBody":"<div id=\"ygrps-yiv-68959831\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Sarabeth&quot; &lt;sara@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; If we say that in order to be a Good Unschooler, all homes MUST contain a television, lots of computer games, and sugary treats, it would be as arbitrary as saying that we all NEED to read Shakespeare, spend 1.7 hours outdoors each day, and learn algebra in order to be Educated. <br/>\n </span></blockquote>*************************<br/>\n<br/>\nExactly! And yet for some reason every time long time unschoolers say things like &quot;its not necessary to limit xyz...&quot; its read as &quot;you Must have xyz in your home.&quot; In the same way people read &quot;its good to say yes more&quot; as &quot;never say no&quot;. <br/>\n<br/>\nRadical unschooling revolves around an understanding that human nature is enough for a person to learn what he or she needs to know, in the company of other caring, engaged human beings, without the imposition of a learning agenda. That&#39;s it. The trouble is, the vast majority of us are raised with a whole slew of learning agendas, and the vast majority of the parents we know have learning agendas - so it can be challenging for people to figure out how to live without them. The purpose of this list is to give people a window into how to do that. <br/>\n<br/>\nTelling our stories is one way - its a great way! It was sooooo reassuring for me, when I was still figuring out unschooling, to read stories of other families, other lives, and get some ideas about what that could look like. It was scary to me to envision a life in which my kids made decisions that I disagreed with - what would I do? Could I stop them? Should I even try? It also helped me to have a place to bounce my fears off people who didn&#39;t share those fears, or had gotten past them. <br/>\n<br/>\nIts hard to give a clear picture of what radical unschooling looks like because every unschooling family is different. I&#39;ve visited several irl, now, and have yet to find a single &quot;unschooling lifestyle&quot; ;) That&#39;s why general questions and comments aren&#39;t particularly useful - they give a general impression that isn&#39;t always helpful for individuals. Threads like this Spread the illusion that some people think there&#39;s only one way to unschool. That&#39;s hogwash. There are ideas and strategies that can help people have better relationships with their kids, and there are things that can get in the way. There&#39;s no need to turn any of those into rules or absolutes. &quot;You don&#39;t have to&quot; does not mean &quot;you must&quot;. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":121897367,"authorName":"Sarabeth","from":"&quot;Sarabeth&quot; &lt;sara@...&gt;","profile":"unschooling_5ara","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: naomi aldort, tv & junk food. help!","postDate":"1271344063","msgId":43678,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxN2EzditwbTF1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhxMDl0dSt2bmwwQGVHcm91cHMuY29tPg=="},"prevInTopic":43668,"nextInTopic":43682,"prevInTime":43677,"nextInTime":43679,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"I have some thoughts on the Media/Sugary Food thread. As background: I am a Real Live Grown one--my two boys (6 and 2.5) have always unschooled, and so have I,","messageBody":"<div id=\"ygrps-yiv-1590353322\">I have some thoughts on the Media/Sugary Food thread. As background: I am a Real Live Grown one--my two boys (6 and 2.5) have always unschooled, and so have I, except for one day when I was 13 and decided to go to school for a day to see what it was like. I wrote my first fumbling essay way back in 1993, for &quot;Growing Without Schooling&quot; magazine on the topic of &quot;an unschooler goes to school for a day.&quot; I recently dug up that article, and many more, and have posted them on my website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lifeisapalindrome.com\">http://www.lifeisapalindrome.com</a> .<br/>\n<br/>\nEven now, at age 30, unschooling continues to define my life, which is an extraordinarily rich and free and adventure-filled one, in my unbiased opinion! :)<br/>\n<br/>\n----<br/>\n<br/>\nI grew up in a household with no TV (until my brother bought his own, for video-watching, when he was a teenager), few processed foods purchased with family money, and no computer games (there weren&#39;t any!). BUT, my parents placed no restrictions on my or my four younger siblings personal spending money, or on foods we ate outside the home, and we all talked--a lot--about health and personal desires and &quot;voting with our dollars.&quot;<br/>\n<br/>\nTo make a long story short, I grew up, and met my True Love, Jeff, and we got married and created a home and lived together in our little nest for several years. Which means that by the time we birthed our first baby, we had two lifetimes of our personal choices reflected in the contents of our home environment. We didn&#39;t keep much sugar in our house. We didn&#39;t have a television. We didn&#39;t often play computer games. These things were/are personal preferences - kind of like how we like the toilet paper unrolling from the top, and don&#39;t like curtains, and how I enjoy sauerkraut, and how my husband and I have chosen a lifestyle where we have more time than money, and always look for things secondhand. <br/>\n<br/>\nNobody&#39;s going to argue that I should either strengthen or disregard my preference for no curtains in order to enhance my relationship with my newborn. A baby just doesn&#39;t care about such things! And yet, sooner or later my kid will say, &quot;Other people have curtains! Why don&#39;t we?&quot; Or maybe, &quot;What is it like to have curtains? Can we have some for a while, to try them out?&quot; Or maybe, &quot;What is money? How can I get some, so I can get curtains of my own?&quot; <br/>\n<br/>\nIn other words: my husband&#39;s and my decision NOT to stock a television, video games, or processed food, were our personal choices. We weren&#39;t saying, &quot;Hey, Baby! Here&#39;s your new home, and you will never have curtains, watch television, play video games, or eat processed food, Not over my Dead Body!&quot; We simply got pregnant, continued with our lives, and then baby joined our circle.<br/>\n<br/>\nInteracting with and respecting a tiny child feels qualitatively different than the way I interact with my spouse, who was my equal, developmentally, from the start. A baby isn&#39;t born asking for sugary snacks, or NOT asking for sugary snacks. We don&#39;t ask a newborn whether he or she is okay with our possession or lack of a television. We respect their likes and dislikes, certainly, but many of those preferences will become clear in later years but are, at the beginning, NOT THERE YET. A pregnant woman is supported--encouraged and expected, even--to make the choices that she thinks are right to support the health of herself and her baby. Same when she&#39;s given birth, and is holding a tiny infant in her arms. The challenge/joy is, that tiny baby grows, and is, sooner or later, going to have different needs and wants and preferences as her parents. But why should we give up our own values and preferences, for ourselves?? What if not wanting sugary snacks available is more to thwart our own sweet tooth than our children&#39;s? We&#39;ll have to cross that bridge when we get to it.<br/>\n<br/>\nKids have needs and desires, and so do parents. Both are important, and worth considering. If I have a desire to keep certain items out of my home, and spend money in certain ways, this doesn&#39;t have to mean that I&#39;m trying to control my kids, that we&#39;re not going to discuss my personal preferences someday (or tomorrow), or that my particular want/need/desire is unimportant enough to give up, for ME.<br/>\n<br/>\nIf we say that in order to be a Good Unschooler, all homes MUST contain a television, lots of computer games, and sugary treats, it would be as arbitrary as saying that we all NEED to read Shakespeare, spend 1.7 hours outdoors each day, and learn algebra in order to be Educated. <br/>\n<br/>\nI&#39;m curious why some people take TV, computer games, and junk food as a given, and assume that they exist in all radical unschoolers&#39; homes. There&#39;s a difference between &quot;limiting&quot; a child&#39;s life experience, and choosing carefully a young child&#39;s home environment. We ALL &quot;limit&quot; our children, especially when they&#39;re babies, whether it&#39;s on purpose or not. Some of us live in the country, and can offer the wild woods and open space. Some of us, in the city, can offer the urban advantages that don&#39;t exist in a rural environment. Some of us have interests that translate into lots of income potential, which translates into more money to spend on the things our kids want. But nobody says that poor unschoolers should go out and get a better job, even if the money situation in their household presents &quot;limits.&quot; Nobody says that people who live in the country should necessarily move to the city, or vice versa.<br/>\n<br/>\nEvery family&#39;s combination of needs and desires is different, and I am pretty sure that present company is already a select crew--we all have, or have frequent access to, computers and an internet connection. And yet we&#39;re all unique, and our different family situations are part of our awesome reality, as FREE people.<br/>\n<br/>\n<br/>\nI am SO incredibly grateful to my parents for my incredibly free childhood and teenage years. This gratitude has kept me going as a parent, even when being a mama to high-needs, low-sleep children sends me spiraling into the depths of depression and despair, and I wonder how my life will ever feel free and happy (read: non-exhausted, with time enough to pursue all my passions) ever again.<br/>\n<br/>\nBut NOBODY, not even unschoolers, have a market on a universally guaranteed method of producing happy, healthy children who turn into healthy, happy adults. We all have ideas, and we have personal preferences, and we all choose the ways we relate to our children and families.<br/>\n<br/>\nSo this, I think, is key: we&#39;re confusing two different issues. Issue #1 is Personal Preferences. Some unschooling parents can&#39;t live without chocolate; some of us love backpacking; some of us are movie buffs, or love War of Warcraft; some of us are obsessed with fermentation and eat lots of meat; some of us are vegan; some of us hate to cook, and know that processed foods are a gift from the great beyond; some of us believe in a God; some of us are born again atheists. We could argue about whether or not food is bad, or cars are bad, or guns are bad, or God exists--but the point is, different ADULTS have different preferences, just as kids do. In an enlightened state of mind, this is something to celebrate.<br/>\n<br/>\nIssue #2 is, How do we interact with our children, and respect and honor their individual needs and desires as PEOPLE, no matter how young, and no matter whether (and especially when) those needs and desires are different from our own? We unschool for the tangible ways it enriches our lives, right now, in the present moment. But we can&#39;t possibly know that unschooling in any form will prevent depression, diabetes, or addiction. It certainly may reduce the odds, I think, but then again we&#39;re not in it for the statistical likelihood, are we? Yes, my children ask questions about our lifestyle. Yes, they want to know how other people live, and why they go to school and eat candy and believe in God. Soon enough, probably tomorrow, they will start wanting some of the things that we currently don&#39;t have in our house, since they are out in the real world every day with real people who have real preferences all their own. Just as your children will, if you unschool and watch television and eat lots of candy or play lots of computer games. ALL of our kids will want to explore farther afield, and learn more than we offer at the beginning--that&#39;s the beauty of it! <br/>\n<br/>\nAnd I think our common ground as unschoolers is this, in the support we give our kids, in the way we&#39;re exploring the world together, not in opposition to each other rather than in the details. What we&#39;re hoping for is the chance to be with our kids as we all grow up, have fun, get sick, try to figure out our personal needs, get healthy, learn from all that our lives encompass, which isn&#39;t everything, or nearly everything, that anyone else&#39;s life does.</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: naomi aldort, tv & junk food. help!","postDate":"1271194463","msgId":43668,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZFMkIzMTEyLTdDQTItNDg0My1BODAwLTk5MzM3M0MwOTlDOEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDUwMDUwLjc2LjIzNC4xNTQuMTYyLjEyNzExMDU5MDMuc3F1aXJyZWxAd3d3Lmh2Z3JlZW5zLm9yZz4=","referencesHeader":"PDQ5Mzk2Ljc2LjIzNC4xNTQuMTYyLjEyNzEwODIyMjAuc3F1aXJyZWxAd3d3Lmh2Z3JlZW5zLm9yZz4gPGhwdnJ2aytnYXFjQGVHcm91cHMuY29tPiA8NTAwNTAuNzYuMjM0LjE1NC4xNjIuMTI3MTEwNTkwMy5zcXVpcnJlbEB3d3cuaHZncmVlbnMub3JnPg=="},"prevInTopic":43666,"nextInTopic":43678,"prevInTime":43667,"nextInTime":43669,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"... Parents love their kids so much that they grasp at the comforting idea they can have a list of what to protect their kids from to keep them safe and","messageBody":"<div id=\"ygrps-yiv-536696214\">On Apr 12, 2010, at 4:58 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:alsmith@...\">alsmith@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They get it from a combination of pre and post gestational toxic<br/>\n&gt; exposure coupled with various diet and lifestyle factors that impair  <br/>\n&gt; the<br/>\n&gt; bodies particular innate ability to deal with toxins.<br/>\n<br/>\n </span></blockquote>Parents love their kids so much that they grasp at the comforting idea  <br/>\nthey can have a list of what to protect their kids from to keep them  <br/>\nsafe and healthy.<br/>\n<br/>\nThe majority of American kids are consuming high fructose corn syrup.  <br/>\nThe majority of American kids are not getting cancer. That doesn&#39;t  <br/>\ndisprove a connection. It does suggest being skeptical, eg,  <br/>\nrecognizing there isn&#39;t enough data to draw a definitive conclusion.  <br/>\nIf there is a connection between high fructose corn syrup and cancer,  <br/>\nthe numbers suggest the connection is less than the threat of being  <br/>\nstruck by lightning than being hit by a car while riding a bike.<br/>\n<br/>\nBut isn&#39;t it good, someone might ask, to protect them from what we can  <br/>\n*because* there are so many things we can&#39;t protect them from?<br/>\n<br/>\nThe more we protect them from dangers that aren&#39;t definitive, then the  <br/>\nmore we endanger their trust in us, the more we compromise their free  <br/>\nexploration. And the more likely the relationship between parents and  <br/>\nkids will resemble the strained relationship conventional parents have  <br/>\nwith their kids than what unschoolers have. Is it worth it? You get to  <br/>\ndecide.<br/>\n<br/>\nYou certainly could keep your kids from HFCs. It&#39;s easy when they&#39;re  <br/>\nyoung. What happens when they&#39;re older and start asking to try foods  <br/>\nwith corn syrup? For a while they may accept that HFCs aren&#39;t good for  <br/>\ntheir bodies, but after a while it will be obvious there are lots of  <br/>\nkids eating what you&#39;re denying them and those kids appear healthy.  <br/>\nThen what? Do you think you have the ability to make your kids accept  <br/>\nyour wisdom that has eluded parents for millennia? If you do and can  <br/>\npass that ability on to other parents, you should write a book! You&#39;ll  <br/>\nmake oodles of money! ;-)<br/>\n<br/>\nThe truth is our kids aren&#39;t us. If parents set themselves up as  <br/>\nexperts on what are the best choices a child can make, it puts as much  <br/>\nstrain on the relationship as if your husband tried to protect you  <br/>\nfrom dangers he believed in but you didn&#39;t agree with.<br/>\n<br/>\nThat doesn&#39;t mean there&#39;s nothing you can do. You can provide healthy  <br/>\nfood for them while allowing them to explore what they want beyond it.  <br/>\nIf you create an artificial limit you&#39;ll create a greater need. That&#39;s  <br/>\njust human nature. It happens to adults as well as kids.<br/>\n<br/>\nThough this is about TV, it applies to anything limited:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com/t/economics.html\">http://www.sandradodd.com/t/economics.html</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Once parents decide<br/>\n&gt; something is dangerous, even if it is accepted in mainstream  <br/>\n&gt; society, how<br/>\n&gt; do we restrict/protect as respectfully as possible? My daughters are<br/>\n&gt; currently 4 and 1 years old.<br/>\n<br/>\n </span></blockquote>You can&#39;t. How could your husband restrict you from something you  <br/>\nwanted to try but he thought was dangerous? If you agree it&#39;s  <br/>\ndangerous, no problem. If you don&#39;t, how would you feel about it and  <br/>\nabout him?<br/>\n<br/>\nMaybe you&#39;ll be lucky and your kids won&#39;t want much beyond what you  <br/>\nwant to give them and will be compliant and accepting of the rest of  <br/>\nthe limitations. If they aren&#39;t, being a roadblock *will* strain your  <br/>\nrelationship. They will seek a way through or around the roadblock.<br/>\n<br/>\nIt makes kids more convenient if they go along with what we tell them,  <br/>\nbut is that the type of adult you want to raise? Do you want them to  <br/>\nbelieve because someone else tells them what to believe? Do you want  <br/>\nthem to accept no to what they desire because someone else says they  <br/>\ncan&#39;t?<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: naomi aldort, tv & junk food. help!","postDate":"1271178744","msgId":43666,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3NDVEMzlELUQyQ0MtNDRFMi1BMUE3LTZFOEE4MDdFQzc3NUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDUwMDUwLjc2LjIzNC4xNTQuMTYyLjEyNzExMDU5MDMuc3F1aXJyZWxAd3d3Lmh2Z3JlZW5zLm9yZz4=","referencesHeader":"PDQ5Mzk2Ljc2LjIzNC4xNTQuMTYyLjEyNzEwODIyMjAuc3F1aXJyZWxAd3d3Lmh2Z3JlZW5zLm9yZz4gPGhwdnJ2aytnYXFjQGVHcm91cHMuY29tPiA8NTAwNTAuNzYuMjM0LjE1NC4xNjIuMTI3MTEwNTkwMy5zcXVpcnJlbEB3d3cuaHZncmVlbnMub3JnPg=="},"prevInTopic":43664,"nextInTopic":43668,"prevInTime":43665,"nextInTime":43667,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"... Trust her *interest*. Don t trust her understanding of the world! She s interested in the balloons. Be with her while she explores so you can make the","messageBody":"<div id=\"ygrps-yiv-1977059105\">On Apr 12, 2010, at 4:58 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:alsmith@...\">alsmith@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My 17 mos old loves<br/>\n&gt; balloons. Do I trust her to manage them?<br/>\n<br/>\n </span></blockquote>Trust her *interest*. Don&#39;t trust her understanding of the world!<br/>\n<br/>\nShe&#39;s interested in the balloons. Be with her while she explores so  <br/>\nyou can make the exploration safe for her. You don&#39;t need to make it  <br/>\nsafe for the generic every child who is likely to do everything that  <br/>\ncould possibly endanger a child ;-) Just make it reasonably safe based  <br/>\non your knowledge of her and be with her.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: naomi aldort, tv & junk food. help!","postDate":"1271155905","msgId":43664,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxMWljMStkZHAzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDUwMDUwLjc2LjIzNC4xNTQuMTYyLjEyNzExMDU5MDMuc3F1aXJyZWxAd3d3Lmh2Z3JlZW5zLm9yZz4="},"prevInTopic":43662,"nextInTopic":43666,"prevInTime":43663,"nextInTime":43665,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"... I m coming back to this bc its useful, from an unschooling perspective, to think about why people do choose to do things they consider less than perfect","messageBody":"<div id=\"ygrps-yiv-1705177170\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, alsmith@... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; BTW, If *everyone* believes that sugar is bad for children, then either<br/>\n&gt; my area is different or people act counter to their beliefs nearly all the<br/>\n&gt; time - snacks at playgroup, birthdays, holidays, grandparents, other well<br/>\n&gt; meaning adult friends, etc.<br/>\n<br/>\n </span></blockquote>I&#39;m coming back to this bc its useful, from an unschooling perspective, to think about why people do choose to do things they consider less than perfect choices. One big reason is to feel in control. In the case above, adults dole out sweets so that they can feel in control of children&#39;s eating habits, with the added &quot;benefit&quot; that doing so makes sweets more desirable and therefore useful as rewards - control begetting more tools for control. The trouble is, you can&#39;t ever really control anyone but yourself. <br/>\n<br/>\nAs someone who moves between both the extremes of the alternative community and the extremes of the mainstream (home and work) I&#39;ve gotten to see in a really striking way how much prejudice there is in the alternative community toward mainstream people and attitudes, when there is really very little difference in the values the two groups impose on their children. That sounds harsh, perhaps, but its less harsh than looking down on people for being different from yourself. Many people turn to alternative lifestyles because we&#39;ve had that happen to us, and yet turn around and do the same thing, en masse, in contradication of our very own value system. Its worth thinking about that, if you value seeing all people as people.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":151979431,"authorName":"Rebecca M.","from":"&quot;Rebecca M.&quot; &lt;ackirebecci@...&gt;","profile":"ackirebecci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: naomi aldort, tv & junk food. help!","postDate":"1271114494","msgId":43662,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxMDl0dSt2bmwwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhwdm5kYyt0anNlQGVHcm91cHMuY29tPg=="},"prevInTopic":43661,"nextInTopic":43664,"prevInTime":43661,"nextInTime":43663,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"... Amanda, you didn t cross-post. Clara did. It s just that your post showed up at the same time her posts did on the other lists, so it looked a bit odd (as","messageBody":"<div id=\"ygrps-yiv-1177466794\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;AmandaE&quot; &lt;amanda@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I did not post here as a &quot;friend&quot;. I posted as a fellow unschooling mom who needed help navigating this touchy terrain within my very mixed local homeschool group. <br/>\n&gt; <br/>\n&gt; I have great respect for all of you...I was not aware that I was cross posting so please forgive me.<br/>\n<br/>\n </span></blockquote>Amanda, you didn&#39;t cross-post. Clara did. It&#39;s just that your post showed up at the same time her posts did on the other lists, so it looked a bit odd (as your post was very like hers as  you quoted directly from her post... which is exactly what was posted on other RU lists).<br/>\n<br/>\nNaomi Aldort has lovely things to say about respectful parenting. She&#39;s not my cup of tea, though, for a few reasons I don&#39;t have to get into here. Suffice it to say, I am wary of &quot;experts&quot; who think that what they&#39;ve learned from their parenting experiences generalizes readily to everyone else&#39;s family situations.<br/>\n<br/>\nIf you have specific things in the article that you want to discuss because they don&#39;t fit for you and your understanding of unschooling or how you want to parent your child, then it might be helpful to bring those pieces forward as specific questions rather than a global discussion about Naomi and her opinions.<br/>\n<br/>\nI know I&#39;d appreciate/prefer that, personally.<br/>\n<br/>\nThere are likely many of us still sorting out things like sugar and TV.<br/>\n<br/>\nKindly,<br/>\nRebecca</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: naomi aldort, tv & junk food. help!","postDate":"1271113675","msgId":43661,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxMDk0Yis2YnViQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhxMDYxcys3azQ2QGVHcm91cHMuY29tPg=="},"prevInTopic":43660,"nextInTopic":43662,"prevInTime":43660,"nextInTime":43662,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"... ***************** Right, lots of wonderful options! One of the things that struck me when I first got on facebook, in particular, was how well the","messageBody":"<div id=\"ygrps-yiv-9419256\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;foehn_jye&quot; &lt;foehn_jye@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I generally buy organic, and we have lots of whole grains, legumes, pastas, nuts, cheeses, etc.  We have a variety of snacks such as dried fruits, granola bars, crackers, etc.  We buy cookies and ice cream on occasion, and there is often a good supply of chocolate available. <br/>\n </span></blockquote>*****************<br/>\n<br/>\nRight, lots of wonderful options! One of the things that struck me when I first got on facebook, in particular, was how well the unschoolers I know eat. Gosh, what great things people are serving up all over the place! Its so spectacular. I didn&#39;t know that when I first started reading about unschooling - I just assumed that these crazy unschoolers must have attrocious diets! I learned differently, but it was still Amazing to me to actually start to have that peek into others&#39; lives in a format different from lists like this. <br/>\n<br/>\nSo if you want a picture of how unschoolers eat, try to make some friends on facebook (if you&#39;re on). I don&#39;t tend to post food notes, but plenty do, and its pretty inspiring.  <br/>\n<br/>\nSomething that can conflate the issue of &quot;sweets&quot; btw, is presentation and convenience. Kids are busy people, they often like to grab a snack quickly - so convenience foods can *seem* preferable if the other option is having to wait for a home-made snack. Kids also like pretty things! and that can make commercial snacks more appealing. When Mo was younger, and didn&#39;t like to stop playing to eat, it helped to make foods that had lots of color, even serve them up as parts of toys so that food was part of the fun, and attractive, and readily available. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: naomi aldort, tv & junk food. help!","postDate":"1271112447","msgId":43659,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxMDd0dis0dG50QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDUwMDUwLjc2LjIzNC4xNTQuMTYyLjEyNzExMDU5MDMuc3F1aXJyZWxAd3d3Lmh2Z3JlZW5zLm9yZz4="},"prevInTopic":43658,"nextInTopic":43660,"prevInTime":43658,"nextInTime":43660,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"... I appologize. Dealing with the same non-question on muliple lists is getting under my skin. It honestly doesn t help to have big general questions asked","messageBody":"<div id=\"ygrps-yiv-319897183\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, alsmith@... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I guess I am a little taken aback at your defensiveness.<br/>\n<br/>\n </span></blockquote>I appologize. Dealing with the same non-question on muliple lists is getting under my skin. It honestly doesn&#39;t help to have big general questions asked when it comes to understanding unschooling because there aren&#39;t any good or useful answers. How do you protect children from danger? By being engaged parents. See what I mean? Its too vague a question. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; &gt; Little kids, including two I know, *do* get cancer.  How do they get it? <br/>\n </span></blockquote>***************<br/>\n<br/>\nOne of the things that helps a whoooooole lot in terms of enjoying your real children right now is stepping away from self-dialog that&#39;s enmeshed in horror stories. Right now, my real life 8yo is out riding her bike. At any moment she could be bitten by a poisonous snake or rabid animal, run over by a neighbor&#39;s car, or fall off the bridge into the creek and break her neck on the rocks. But it doesn&#39;t help either me or her for me to hold those thoughts in my mind - it takes me away from seeing the real joy of a real child riding her bike on a lovely spring day. <br/>\n<br/>\nI&#39;m high-risk for breast cancer. There&#39;s a genetic factor involved. I have a pretty decent lifestyle in terms of minimizing risk factors, but it doesn&#39;t help me to think about that more than occasionally. Thinking about it makes me worry and stress, and stress isn&#39;t healthy either. More than that, it distracts me from living. If I&#39;m going to die young (if... can&#39;t possibly know, my mother did, but not from cancer) I don&#39;t want to be distracted from One Minute of living by worrying about my death. I want to live as fully and joyfully as I may.<br/>\n<br/>\nThat&#39;s the core of unschooling, right there, living fully and joyfully with children. Putting up roadblocks based on fear doesn&#39;t tend to help people do that. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I do strap my toddler in her high<br/>\n&gt; chair so she won&#39;t fall out.<br/>\n<br/>\n </span></blockquote>If she&#39;s okay with that, then that&#39;s not a problem. The issue is only if she&#39;s not okay with it. That&#39;s often a point of confusion in these big, generalize threads, since there aren&#39;t specific examples to work from - everyone can just imagine whatever. I&#39;m imagining Ray strapped in a high chair, thrashing hard enough to tip it over - totally Not a safe solution. Obviously, you have a different experience ;)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;We gate her from certain rooms.<br/>\n<br/>\n </span></blockquote>And again, if she&#39;s okay with that, its a non-issue. She&#39;s not piling toys to climb over the gate (my brother broke his arm that way) or slamming her little body into the gate to break through (that would be Ray) or figuring out how to get her hand through the mesh and getting stuck (Mo). <br/>\n<br/>\nRight there, those three examples from my life, are a good picture of the problem with depending on limits or restraints. They work if the person you&#39;re restraining agrees to go along with them. <br/>\n<br/>\nVery young children - up to about 4ish - are generally happy to choose from whatever foods are already in the house. They don&#39;t Want all the choices in the world yet, they want to choose when to eat and how much. So its not dismissive of them to buy only the foods you feel good about for toddlers. <br/>\n<br/>\nSometime around 4ish, though, kids start being interested in some of the other things they see in the world, and that&#39;s when things can get sticky. Some of that depends on personality - some kids are just fine with &quot;this is how We do things&quot;. Ray always replied to statements like that with &quot;well, this is how *I* do things.&quot; <br/>\n<br/>\nOne of the strategies that can help parents feel good about saying Yes more is to have Lots of options. Your child wants a soft drink? Provide some options. Make some of your own with juice and soda water, buy some commercial soft drinks, maybe try some fancy &quot;health food&quot; soft drinks. That way you open up the world rather than confine it, you turn something that could be an issue into an adventure.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;My 17 mos old loves<br/>\n&gt; balloons.   Do I trust her to manage them?<br/>\n<br/>\n </span></blockquote>What is your concern, specifically? Choking on a popped balloon fragment? Does she Only love the rubber kind? I bet she likes the foil kind, too. How &quot;oral&quot; is she? Does she put everything she touches in her mouth? Not all little ones do, and that&#39;s a factor to consider. What about putting a nylon stocking over a balloon? Or hanging some up to look at but not play with? Depending on the child, there might be a lot of ways for her to play with balloons safely - and if not, the foil ones are pretty darned attractive to little people.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Or how about trust her<br/>\n&gt; with plastic bags <br/>\n<br/>\n </span></blockquote>Doing What with plastic bags? With or without your company? I didn&#39;t leave my kids alone very much at 17mos, they seemed to like me ;) Crinkling it in her hands, exploring the texture and sound it makes? Tasting it a little? Even putting one over her head isn&#39;t a big deal if you&#39;re right there to pull it off, make a game of peek-a-boo out of the matter, maybe. Its not a matter of keeping the bags away &quot;for her safety&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; does that get at a fear we might agree on the<br/>\n&gt; reasonableness of?<br/>\n  <br/>\n </span></blockquote>It sounds like you&#39;re trying to frame things in terms of possible disasters, and as I said before, I don&#39;t find that helps me enjoy my life or helps my kids enjoy theirs. Too much &quot;be careful&quot; gets tuned out, at best, or becomes a reason to experiment with danger once kids are a little older. That&#39;s not &quot;keeping them safe&quot;! And that&#39;s exactly what I mean by looking around you. Its Normal for kids to sneak and lie and rebel to get around their parents &quot;reasonable restrictions&quot; (like sweets only for special occasions, and after you eat). I don&#39;t want to be that kind of obstacle in my kids&#39; lives. Happily, I don&#39;t have to be. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":240358028,"authorName":"foehn_jye","from":"&quot;foehn_jye&quot; &lt;foehn_jye@...&gt;","profile":"foehn_jye","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: naomi aldort, tv & junk food. help!","postDate":"1271110524","msgId":43658,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhxMDYxcys3azQ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDUwMDUwLjc2LjIzNC4xNTQuMTYyLjEyNzExMDU5MDMuc3F1aXJyZWxAd3d3Lmh2Z3JlZW5zLm9yZz4="},"prevInTopic":43657,"nextInTopic":43659,"prevInTime":43657,"nextInTime":43659,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"... Out of curiosity, I did a basic Google search for corn syrup and Cancer  I found this interesting article:","messageBody":"<div id=\"ygrps-yiv-1193637884\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt;&gt;Just because I believe that the scientific evidence supports that sugar is harmful (and that corn syrup has been found to be often contaminated with mercury, a heavy metal toxin) doesn&#39;t mean I wish to send my child to school, ground her, guilt her, bribe her or demean her in other ways that &quot;conventional wisdom&quot; is comfortable with.  I feel you have missed my point.&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Out of curiosity, I did a basic Google search for &quot;corn syrup and Cancer&quot;  I found this interesting article: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.healthobservatory.org/library.cfm?refid=105026\">http://www.healthobservatory.org/library.cfm?refid=105026</a><br/>\nwhich discusses actual samples taken of popular brand name foods and the mercury content found within.  The food sample with the highest levels of mercury in it was Quaker Oatmeal&#39;s &quot;Oatmeal to Go&quot; which contains corn syrup, and the level was 350 parts per trillion. The EPA recently suggested that pregnant women should not consume more than 0.1 ppm of methylmercury a day (often found in tuna).  To compare 0.1 ppm equals 100,000 parts per trillion.<br/>\n<br/>\nInterestingly, none of the soft drinks tested contained mercury. But lots of other foods did like Nutrigrain snack bars, salad dressings, yogurts, etc.  Things that some people might consider to be on the healthier end of the spectrum, and not &quot;junk food&quot;.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;Little kids, including two I know, *do* get cancer.  How do they get it? Magic? Fate?  They get it from a combination of pre and post gestational toxic exposure coupled with various diet and lifestyle factors that impair the bodies particular innate ability to deal with toxins.&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>It&#39;s always a tragedy when children get cancer, and it&#39;s a tragedy for anyone to get cancer.  But I think it&#39;s a far stretch to assume that consumption of HFCS is going to cause cancer. Even people who&#39;ve studied the causes of cancer for a lifetime do not know all the causes of cancer.  Some people get cancer because they worked with specific chemicals for many years, and many others with seemingly perfect diets get cancer.  Athletes get cancer, sedentary people get cancer.  It is too difficult to draw conclusions given all the things our bodies are exposed to in utero and out of utero.  We live in a chemical society.  Limiting HFCS is not a &quot;magical&quot; key to preventing cancer in our children.<br/>\n<br/>\nInstead of making blanket statements about how unhealthy sugar and HCFS are, it is better to look to your child and discover what they like and what they don&#39;t like.  Keep  your pantry stocked with a variety of nutritious foods, offer all sorts of foods to your kids--the more they are exposed to the broader their ability for discovering what they like and don&#39;t like. Worrying about the levels of mercury in their food will not promote happiness.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;I am not clear about *how* people protect kids from<br/>\n&gt; things that they feel *are* dangerous.&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>My husband and I are rock and ice climbers.  We take our children climbing and we have to navigate cliffs, narrow trails, blocks, rattlesnakes, etc. on our way to a climbing area.  We protect our kids by talking about the trail on the way down. Asking them if they have secure footing, holding their hands, and carrying them if necessary, across certain areas. When we climb, we ensure their harness is secure and configured correctly, we tie them in and ensure the knot is correct. We talk about the way climbers communicate so that the climber knows the belayer is aware and paying attention.  We are protecting our kids while doing a dangerous activity.  <br/>\n<br/>\nNavigating food choices may be a little more complex than rock climbing, but it&#39;s not much different.  My children are still young (4 and 7) and as such they still rely on me to ensure that the cabinets are stocked with lots of different foods.  I generally buy organic, and we have lots of whole grains, legumes, pastas, nuts, cheeses, etc.  We have a variety of snacks such as dried fruits, granola bars, crackers, etc.  We buy cookies and ice cream on occasion, and there is often a good supply of chocolate available.  <br/>\n<br/>\nFor some remarkable reason that I still haven&#39;t figured out given my own upbringing, I&#39;ve never felt the need to &quot;control&quot; or &quot;limit&quot; certain foods with my kids.  But that doesn&#39;t mean that my pantry is stocked with nothing but HFCS-containing products and my fridge is filled with soda and that is all my kids eat.  They eat a HUGE variety of foods, their favorites currently being Japanese stir-fry and spicy tacos.  Sure they ask for ice cream, but not all day every day. I think it&#39;s really important that we look at what is really happening in our lives instead of assuming that no limits on certain foods mean that kids are over-consuming such foods.  Most likely they are not.   <br/>\n<br/>\nKristi B.</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: naomi aldort, tv & junk food. help!","postDate":"1271109815","msgId":43657,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzMjU0OC4xMzAwMC5xbUB3ZWI4NjIwNS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDUwMDUwLjc2LjIzNC4xNTQuMTYyLjEyNzExMDU5MDMuc3F1aXJyZWxAd3d3Lmh2Z3JlZW5zLm9yZz4=","referencesHeader":"PDQ5Mzk2Ljc2LjIzNC4xNTQuMTYyLjEyNzEwODIyMjAuc3F1aXJyZWxAd3d3Lmh2Z3JlZW5zLm9yZz4gICAgPGhwdnJ2aytnYXFjQGVHcm91cHMuY29tPiA8NTAwNTAuNzYuMjM0LjE1NC4xNjIuMTI3MTEwNTkwMy5zcXVpcnJlbEB3d3cuaHZncmVlbnMub3JnPg=="},"prevInTopic":43656,"nextInTopic":43658,"prevInTime":43656,"nextInTime":43658,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"There is a lot of scientific evidence out there, I can spin you all the way towards lots of cool stuff on how food choice is important, particularly for girls,","messageBody":"<div id=\"ygrps-yiv-190515918\">There is a lot of scientific evidence out there, I can spin you all the way towards lots of cool stuff on how food choice is important, particularly for girls, and really examine how cancer happens. I don&#39;t think that will help as much as examining why you are here on this list, though. If your goal is limiting your children&#39;s exposure to things that may possibly make them sick, this list isn&#39;t going to work that well for you. If your goal is an system of education that is about enrichment and exploration and trust and being together and extending that to working to make your relationship with your children a relationship built on trust and extending out towards joy, this list is fantastic. <br/>\n<br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: naomi aldort, tv & junk food. help!","postDate":"1271108091","msgId":43656,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NTU5Ny40OTU5MS5xbUB3ZWI4NjIwOC5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDUwMDUwLjc2LjIzNC4xNTQuMTYyLjEyNzExMDU5MDMuc3F1aXJyZWxAd3d3Lmh2Z3JlZW5zLm9yZz4=","referencesHeader":"PDQ5Mzk2Ljc2LjIzNC4xNTQuMTYyLjEyNzEwODIyMjAuc3F1aXJyZWxAd3d3Lmh2Z3JlZW5zLm9yZz4gICAgPGhwdnJ2aytnYXFjQGVHcm91cHMuY29tPiA8NTAwNTAuNzYuMjM0LjE1NC4xNjIuMTI3MTEwNTkwMy5zcXVpcnJlbEB3d3cuaHZncmVlbnMub3JnPg=="},"prevInTopic":43655,"nextInTopic":43657,"prevInTime":43655,"nextInTime":43657,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"How about we seek an example where we agree.  My 17 mos old loves balloons.  Do I trust her to manage them?  Or how about trust her with plastic bags - does","messageBody":"<div id=\"ygrps-yiv-1849411195\">How about we seek an example where we agree.  My 17 mos old loves<br/>\nballoons.  Do I trust her to manage them?  Or how about trust her<br/>\nwith plastic bags - does that get at a fear we might agree on the<br/>\nreasonableness <br/>\nof?<br/>\n<br/>\nIf your 17 month old loves anything do you just give it to her and walk away? No, you hang out and play with stuff. Balloons are the same, you get balloons and you play with them with your daughter. No one here is suggesting that you set up your child and then walk away from them. Unschooling is so incredibly hands on. It isn&#39;t at all a clockwork universe of education. No one winds it up and lets a child go. Same deal with plastic bags. If she really likes plastic bags, play with plastic bags with her, but don&#39;t leave her be with a big pile of plastic bags. No one is aiming for a Family Guy parenting moment: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=qEIRbUSsUjs&feature=related.\">http://www.youtube.com/watch?v=qEIRbUSsUjs&feature=related.</a> <br/>\n<br/>\nIt may help you a lot to read more about unschooling. I don&#39;t know what you think it looks like, but a 17 month old with a bunch of balloons sitting by herself isn&#39;t part of it. Read at sandradodd.com/unschooling and at joyfullyrejoycing.com. Both have randomizers, so you could just go with a less linear exploration. Or you could try <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/typical\">http://sandradodd.com/typical</a> and look at what unschooling can look like in people&#39;s homes. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/qEIRbUSsUjs?wmode=opaque","type":"VIDEO"}]},{"userId":274479650,"authorName":"alsmith@hvgreens.org","from":"alsmith@...","profile":"rdblkgrnwht","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: naomi aldort, tv & junk food. help!","postDate":"1271105903","msgId":43655,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwMDUwLjc2LjIzNC4xNTQuMTYyLjEyNzExMDU5MDMuc3F1aXJyZWxAd3d3Lmh2Z3JlZW5zLm9yZz4=","inReplyToHeader":"PGhwdnJ2aytnYXFjQGVHcm91cHMuY29tPg==","referencesHeader":"PDQ5Mzk2Ljc2LjIzNC4xNTQuMTYyLjEyNzEwODIyMjAuc3F1aXJyZWxAd3d3Lmh2Z3JlZW5zLm9yZz4gICAgPGhwdnJ2aytnYXFjQGVHcm91cHMuY29tPg=="},"prevInTopic":43654,"nextInTopic":43656,"prevInTime":43654,"nextInTime":43656,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"... If I weren t looking for alternatives, I wouldn t have bothered to join and carefully read - not skim - this list.  Just because I believe that the ","messageBody":"<div id=\"ygrps-yiv-555237468\"><blockquote><span title=\"ireply\">&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, alsmith@... wrote:<br/>\n&gt;&gt;&gt; I am not out to convince others on this list about the risks associated<br/>\n&gt;&gt; with a diet high in sugar, but, once parents come to agreement that<br/>\n&gt;&gt; something is dangerous to their children as my husband and I have in<br/>\n&gt;&gt; the case of sugar, even if it is pervasive in society, what do people<br/>\n&gt;&gt; recommend?<br/>\n&gt;<br/>\n&gt; I recommend thinking about what *really* works in terms of parenting.<br/>\n&gt; There&#39;s a lot of &quot;parenting wisdom&quot; that is nothing of the sort - its same<br/>\n&gt; old same old what everyone knows and the crux of all of that is that<br/>\n&gt; children &quot;need&quot; limits and rules and constraints, that having those solves<br/>\n&gt; the problem of &quot;dangers&quot;. And yet that&#39;s not true. Look around you.<br/>\n<br/>\n </span></blockquote>If I weren&#39;t looking for alternatives, I wouldn&#39;t have bothered to join and<br/>\ncarefully read - not skim - this list.  Just because I believe that the<br/>\nscientific<br/>\nevidence supports that sugar is harmful (and that corn syrup has been found<br/>\nto be often contaminated with mercury, a heavy metal toxin) doesn&#39;t mean I<br/>\nwish<br/>\nto send my child to school, ground her, guilt her, bribe her or demean her<br/>\nin other ways that &quot;conventional wisdom&quot; is comfortable with.  I feel you<br/>\nhave missed my point.<br/>\n<br/>\nLittle kids, including two I know, *do* get cancer.  How do they get it? <br/>\nMagic?<br/>\nFate?  They get it from a combination of pre and post gestational toxic<br/>\nexposure coupled with various diet and lifestyle factors that impair the<br/>\nbodies particular innate ability to deal with toxins.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Here&#39;s something else to think about - do you think unschoolers are lying<br/>\n&gt; about what their families look like? That we&#39;re telling tall tales to get<br/>\n&gt; you to join our club? If not, then why is it that our kids aren&#39;t falling<br/>\n&gt; prey to these so-called dangers? Some of us have teens and young adults -<br/>\n&gt; we&#39;re Not Guessing here, we&#39;ve actually Seen the effects of this kind of<br/>\n&gt; parenting.<br/>\n<br/>\n </span></blockquote>I guess I am a little taken aback at your defensiveness.  As I said, I am new<br/>\nto unschooling, so I am not clear about *how* people protect kids from<br/>\nthings that they feel *are* dangerous.  I do strap my toddler in her high<br/>\nchair so she won&#39;t fall out.  We gate her from certain rooms.  I don&#39;t let<br/>\nmy four year old go out beyond where I can see her outside since our<br/>\nneighborhood has a lot of foot and car traffic.  I try to be as permissive as<br/>\nI feel is safe and I try to find alternatives or replacements when we are<br/>\nnot confident that a toy or food is safe, for example.<br/>\n<br/>\nBTW, If *everyone* believes that sugar is bad for children, then either<br/>\nmy area is different or people act counter to their beliefs nearly all the<br/>\ntime - snacks at playgroup, birthdays, holidays, grandparents, other well<br/>\nmeaning adult friends, etc.<br/>\n<br/>\nFurther, have you or anyone else done a controlled study on cancer in<br/>\nRU kids vs a mainstream population?  If you think I really want this info,<br/>\nyou are again missing my point.  My point is to illustrate how silly your<br/>\nresponse sounds.  I take it for granted that each of us have taken<br/>\nthe responsibility to parent as best we can and we are obligated to do<br/>\nit to the best of our ability.  If you feel the concern of cancer is<br/>\nremote or overblown, fine, but that doesn&#39;t mean you are &quot;right&quot; and<br/>\nI am &quot;wrong.&quot;  Just that we have a different view on this.<br/>\n<br/>\nHow about we seek an example where we agree.  My 17 mos old loves<br/>\nballoons.   Do I trust her to manage them?  Or how about trust her<br/>\nwith plastic bags - does that get at a fear we might agree on the<br/>\nreasonableness of?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I&#39;m not saying you &quot;Have to&quot; deregulate everything all the time. What I&#39;m<br/>\n&gt; saying is you Don&#39;t have to regulate your kids experiences to keep them<br/>\n&gt; safe. There are more options than making rules or throwing up your hands.<br/>\n<br/>\n </span></blockquote>Certainly, but you have offered none in this case.<br/>\n<br/>\nAimee Smith</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] naomi aldort, tv & junk food. help!","postDate":"1271103939","msgId":43654,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2OTkyLjU3OTk3LnFtQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":43653,"nextInTopic":43655,"prevInTime":43653,"nextInTime":43655,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"I m fully aware of the fears. I bet you every person on this list knows all of the reasons to be afraid of all the stuff you are convinced are fearful and","messageBody":"<div id=\"ygrps-yiv-642939965\">I&#39;m fully aware of the fears. I bet you every person on this list knows all of the reasons to be afraid of all the stuff you are convinced are fearful and wrong.  And yet, somehow, we are willing to move away from those fears to a  trust of our children and our lives to be full enough and good enough  for the boogeyman of sugar not to steal their hearts and bodies. I love that you are so invested in the fear that you dismiss the notion of children having different food needs to adults. I can tell you that over the course of my menstrual cycle my food needs are in flux, when I was pregnant they were totally different to what they are without the burden of a growing fetus inside of me, and nursing again changed my dietary needs and preferences. I have the experience, as I bet you do too, that demonstrates what you deny. <br/>\n<br/>\n&quot;I am not out to convince others on this list about the risks  associated<br/>\nwith a diet high in sugar, but, once parents come to  agreement that<br/>\nsomething is dangerous to their children as my husband  and I have in<br/>\nthe case of sugar, even if it is pervasive in society,  what do people<br/>\nrecommend?<br/>\n<br/>\nI think reasonable people can  disagree on whether something in particular<br/>\nis harmful or not (such  as vaccines/meat/dairy/etc.)  Once  parents decide<br/>\nsomething is  dangerous, even if it is accepted in mainstream society, how<br/>\ndo we  restrict/protect as respectfully as possible?  My daughters are<br/>\ncurrently  4 and 1 years old.&quot;<br/>\n<br/>\nYou don&#39;t. Restricting something because you think it has greater power over someone than their own ability to judge isn&#39;t respectful. When a child is little it is easy to keep them restricted without them feeling any kind of limitation. You are the active designer of their environment. You are the manipulator of their world. Soon though they will move away from you, they will gain greater independence and will make decisions on their own about things with or without your input. If you&#39;ve told them about all of your fears, all of your boogeymen and they see others engaging with the world, safely, using the things you say are fearful and awful and wrong, their trust of you will erode. If what you are denying them is something they want, something they value, than they&#39;ll overcome the obstacles you&#39;ve created and obtain or do the thing. That may mean sneaking, that may mean outright, in your face rebellion, it may mean that they do things with guilt and<br/>\n shame that they could have chosen to do or not to do freely without your limits. <br/>\n<br/>\nIt is amazing to see Simon and Linnaea growing without limits. They are so capable of making their own judgements about things. And they listen to David and I and even seek out our advice on things. But they make their decisions. I figure the more I entrusted them with decisions about food and engagement and learning when they were little the more they grew in ability to make decisions. There are decisions and issues that I faced when I was 16 and 17 and 18 that I wasn&#39;t very good at dealing with. I didn&#39;t have a family that stood behind me, supporting me, helping me to achieve what I wanted when I wanted. I had limits and obstacles and hurdles and I snuck and lied and did as I thought I most wanted. I don&#39;t know what it will be like when Simon is 16 or 17 or 18, but I trust that he will make decisions with the same levelheadedness, the same thoughtfulness, the same measured reason and trust of his own self that he has done for so long. I will trust him,<br/>\n and if he needs me, if things are too much, are too big, he will trust me right back. And that&#39;s better than being so afraid of something that I&#39;ve worked to keep him from having to deal with it on his own terms. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: naomi aldort, tv & junk food. help!","postDate":"1271100212","msgId":43653,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhwdnJ2aytnYXFjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ5Mzk2Ljc2LjIzNC4xNTQuMTYyLjEyNzEwODIyMjAuc3F1aXJyZWxAd3d3Lmh2Z3JlZW5zLm9yZz4="},"prevInTopic":43651,"nextInTopic":43654,"prevInTime":43652,"nextInTime":43654,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"... I recommend thinking about what *really* works in terms of parenting. There s a lot of parenting wisdom that is nothing of the sort - its same old same","messageBody":"<div id=\"ygrps-yiv-545343489\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, alsmith@... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I am not out to convince others on this list about the risks associated<br/>\n&gt; with a diet high in sugar, but, once parents come to agreement that<br/>\n&gt; something is dangerous to their children as my husband and I have in<br/>\n&gt; the case of sugar, even if it is pervasive in society, what do people<br/>\n&gt; recommend?<br/>\n<br/>\n </span></blockquote>I recommend thinking about what *really* works in terms of parenting. There&#39;s a lot of &quot;parenting wisdom&quot; that is nothing of the sort - its same old same old what everyone knows and the crux of all of that is that children &quot;need&quot; limits and rules and constraints, that having those solves the problem of &quot;dangers&quot;. And yet that&#39;s not true. Look around you. <br/>\n<br/>\nHere&#39;s something else to think about - do you think unschoolers are lying about what their families look like? That we&#39;re telling tall tales to get you to join our club? If not, then why is it that our kids aren&#39;t falling prey to these so-called dangers? Some of us have teens and young adults - we&#39;re Not Guessing here, we&#39;ve actually Seen the effects of this kind of parenting. <br/>\n<br/>\nI&#39;m not saying you &quot;Have to&quot; deregulate everything all the time. What I&#39;m saying is you Don&#39;t have to regulate your kids experiences to keep them safe. There are more options than making rules or throwing up your hands. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":341424270,"authorName":"AmandaE","from":"&quot;AmandaE&quot; &lt;amanda@...&gt;","profile":"aenclade","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: naomi aldort, tv & junk food. help!","postDate":"1271095532","msgId":43660,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhwdm5kYyt0anNlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhwdmw2Mys2bWkwQGVHcm91cHMuY29tPg=="},"prevInTopic":43659,"nextInTopic":43661,"prevInTime":43659,"nextInTime":43661,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"I did not post here as a friend . I posted as a fellow unschooling mom who needed help navigating this touchy terrain within my very mixed local homeschool","messageBody":"<div id=\"ygrps-yiv-716775180\">I did not post here as a &quot;friend&quot;. I posted as a fellow unschooling mom who needed help navigating this touchy terrain within my very mixed local homeschool group. <br/>\n<br/>\nI have great respect for all of you...I was not aware that I was cross posting so please forgive me.<br/>\n<br/>\nAmanda <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Yes its cross-posted everywhere, it seems - apparantly here it was done by a &quot;friend&quot; since we&#39;ve just been saying how rude cross posting is. Funny that.<br/>\n&gt; Meredith<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: naomi aldort, tv & junk food. help!","postDate":"1271093432","msgId":43651,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhwdmxibyt1bGx1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDExMTk2NjQuMTExMDM5LjEyNzEwNDM3MTYyMDIuSmF2YU1haWwucm9vdEB2bXMwNzUubWFpbHNydmNzLm5ldD4="},"prevInTopic":43650,"nextInTopic":43653,"prevInTime":43650,"nextInTime":43652,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"... Oh, I hadn t seen that line (I m just skimming this stuff since its everywhere) but I really think its laughable. Everyone Else things tv is bad, sugar is","messageBody":"<div id=\"ygrps-yiv-247650562\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; ***** Why worship being like everyone else? *****<br/>\n<br/>\n </span></blockquote>Oh, I hadn&#39;t seen that line (I&#39;m just skimming this stuff since its everywhere) but I really think its laughable. Everyone Else things tv is bad, sugar is bad, kids need to be controlled, need to be regulated, need someone else to tell them what&#39;s good for them. Everyone. So its just darn Funny to see thinking like everyone else touted as some kind of freedom. Its not. Its just everyone saying what everyone knows, when the only reason everyone knows is because everyone says so. <br/>\nEnd Rant.<br/>\nMeredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: naomi aldort, tv & junk food. help!","postDate":"1271093251","msgId":43650,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhwdmw2Mys2bWkwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEE3Q0E3RjcxNTU1NTQ2MEU4RTQ0MTQ5Q0NEQTMyNjAzQExZTEFMQVAyPg=="},"prevInTopic":43647,"nextInTopic":43651,"prevInTime":43649,"nextInTime":43651,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"Yes its cross-posted everywhere, it seems - apparantly here it was done by a friend since we ve just been saying how rude cross posting is. Funny that. ","messageBody":"<div id=\"ygrps-yiv-467659971\">Yes its cross-posted everywhere, it seems - apparantly here it was done by a &quot;friend&quot; since we&#39;ve just been saying how rude cross posting is. Funny that.<br/>\nMeredith</div>","specialLinks":[]},{"userId":274479650,"authorName":"alsmith@hvgreens.org","from":"alsmith@...","profile":"rdblkgrnwht","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] naomi aldort, tv & junk food. help!","postDate":"1271082220","msgId":43647,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5Mzk2Ljc2LjIzNC4xNTQuMTYyLjEyNzEwODIyMjAuc3F1aXJyZWxAd3d3Lmh2Z3JlZW5zLm9yZz4=","inReplyToHeader":"PDQ5Mjg2Ljc2LjIzNC4xNTQuMTYyLjEyNzEwODE1MjQuc3F1aXJyZWxAd3d3Lmh2Z3JlZW5zLm9yZz4=","referencesHeader":"PDExMTk2NjQuMTExMDM5LjEyNzEwNDM3MTYyMDIuSmF2YU1haWwucm9vdEB2bXMwNzUubWFpbHNydmNzLm5ldD4gICAgPDQ5Mjg2Ljc2LjIzNC4xNTQuMTYyLjEyNzEwODE1MjQuc3F1aXJyZWxAd3d3Lmh2Z3JlZW5zLm9yZz4="},"prevInTopic":43645,"nextInTopic":43650,"prevInTime":43646,"nextInTime":43648,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"Hi, I am new to the list - been reading for a few weeks.  I find it very thought provoking and helpful. I am new to unschooling (read several John Holt books","messageBody":"<div id=\"ygrps-yiv-1587005686\">Hi,<br/>\nI am new to the list - been reading for a few weeks.  I find it very<br/>\nthought provoking and helpful.<br/>\n<br/>\nI am new to unschooling (read several John Holt books at the<br/>\nrecommendation of a friend with similar anarchist/social libertarian<br/>\nleanings.)<br/>\n<br/>\nI am not a biochemist, but I am a material scientist by training.  I am very<br/>\nconcerned about issues relating to health and safety with food, injections,<br/>\ntoys, etc.  And rather aware that, to put it mildly, the predominant<br/>\nstructures in our society are not motivated by concern for the health and<br/>\nsafety of human beings (as schools are a case in point.)<br/>\n<br/>\nI have been very intrigued by a video about sugar called &quot;Sugar: The Bitter<br/>\nTruth.&quot;  I find the presentation very compelling and I do feel it explains<br/>\nthe perhaps not very scientific experiment of Morgan Sperlock in his film<br/>\n&quot;Supersize Me.&quot;  Since chronic illnesses are pervasive in our society, sugar<br/>\nis very concerning to me.<br/>\n<br/>\nI do disagree with the perspective that kids need more sugar than adults<br/>\nor that their craving it means they need it.  I feel that kids as they<br/>\ngrow are developing their ability to be self aware and to know that doing<br/>\ncertain things makes them feel better.  Allowing themselves to get overtired<br/>\nor cold are just two examples.  Granted, this improves over time and yes we<br/>\nwish to encourage them to notice these things and be able to address them.<br/>\nBut I don&#39;t believe humans need fructose as anything other than an<br/>\ninducement to take in large amounts of fiber.  Soda and juice aren&#39;t doing<br/>\nthis. Cereals with refined sugar are not the best way to do this.  I believe<br/>\nchildren do need calories from carbs, protein, and fat - and more in the<br/>\nprotein and fat category than adults.<br/>\n<br/>\nI am not out to convince others on this list about the risks associated<br/>\nwith a diet high in sugar, but, once parents come to agreement that<br/>\nsomething is dangerous to their children as my husband and I have in<br/>\nthe case of sugar, even if it is pervasive in society, what do people<br/>\nrecommend?<br/>\n<br/>\nI think reasonable people can disagree on whether something in particular<br/>\nis harmful or not (such as vaccines/meat/dairy/etc.)  Once  parents decide<br/>\nsomething is dangerous, even if it is accepted in mainstream society, how<br/>\ndo we restrict/protect as respectfully as possible?  My daughters are<br/>\ncurrently 4 and 1 years old.<br/>\n<br/>\nAs far as addiction, that is another matter, but I do believe that<br/>\naddiction is created by lacks in upbringing.  I am intrigued by the writing<br/>\nof Gabor Mate on this topic.  He points out that nothing is addictive in<br/>\nitself unless there is the lack of development that results in addiction. <br/>\nBut<br/>\non the other hand, as per his definition of addiction, nearly *anything* can<br/>\nbe the behavior that the addiction is centered around.  His is shopping for<br/>\nCD&#39;s, for example.  I think part of the reason unhealthy food is addictive<br/>\nto many is due to additives, positive/fraudulent marketing and regulatory<br/>\nneglect *coupled with* emotional needs that leave many open to addiction.<br/>\nSo, a multi-factorial result to be sure.  But at the same time, if the damage<br/>\nof fructose uncoupled to large amounts of fiber (as is found in refined<br/>\nsugar, soda, even juice but not fruit) or gmo foods, or foods grown with<br/>\nthe use of synthetic pesticides and herbicides, or a diet rich in meat and<br/>\ndairy is linked to the epidemics in our society of childhood onset of &quot;adult<br/>\nonset&quot; diabetes, cancer, and other illnesses and the rapid rate in increase<br/>\nof obesity in children, indicating not just the normal spectrum of children&#39;s<br/>\nbody types, (likely indicating disruption to the endocrine system), then we<br/>\nhave a responsibility to protect, in my view.<br/>\n<br/>\nHaving said all of the above, none of these things are in the &quot;never&quot;<br/>\ncategory for us.  That makes finding the right balance a challenge for me,<br/>\nespecially when relatives, other families and holidays are thrown in to<br/>\nthe mix. Thoughts appreciated.  And, in any case, thanks for listening and<br/>\nfor all of your passion for raising your children in a fashion that seeks to<br/>\nresist the many dehumanizing institutions and cultural norms of our sick, i<br/>\nn my view, society.<br/>\n<br/>\nRegards,<br/>\nAimee Smith<br/>\n<br/>\n<br/>\nPS The book that put me over the edge to homeschool rather than look for<br/>\na school for my eldest was co-authored by Mate with Gordon Neufeld.<br/>\nIt is called &quot;Hold on to Your Kids: Why Parents need to matter more than<br/>\npeers.&quot;  I think many of the suggestions will not be readily embraced<br/>\nby many of this list (at least from what I have seen in posts) but I believe<br/>\nthe concerns raised and the social analysis might well.</div>","specialLinks":[]},{"userId":301108410,"authorName":"Marina DeLuca-Howard","from":"Marina DeLuca-Howard &lt;delucahoward@...&gt;","profile":"matedgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] naomi aldort, tv & junk food. help!","postDate":"1271078931","msgId":43645,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGwybTE3NGRmOWRjMTAwNDEyMDYyOGk0YjAyNDdhMnU5YTFjYTdmNzQ2OTQ0NzA0QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDcwOTIzMy4yNDc0Mi5xbUB3ZWI4NjIwOC5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PDExMTk2NjQuMTExMDM5LjEyNzEwNDM3MTYyMDIuSmF2YU1haWwucm9vdEB2bXMwNzUubWFpbHNydmNzLm5ldD4JIDwyNTlFQ0E1OTI0QzQ0QzM4QkJGN0Q3NzY1MEFBRjdGNkBDb25uaWVQQz4JIDw3MDkyMzMuMjQ3NDIucW1Ad2ViODYyMDgubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":43642,"nextInTopic":43647,"prevInTime":43644,"nextInTime":43646,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"I read that article and it sounds persuasive... freedom through restriction . Many parents who follow her line of thinking are unparenting , though, because","messageBody":"<div id=\"ygrps-yiv-1706560253\">I read that article and it sounds persuasive...&quot;freedom through<br/>\nrestriction&quot;. Many parents who follow her line of thinking are<br/>\n&quot;unparenting&quot;, though, because they have created a &quot;safe&quot; environment.  They<br/>\ncan call it unschooling, but I find unschooling requires a deeper level of<br/>\ncommitment and engagement.  In many cases the unparenting parent can do<br/>\ntheir own thing, secure in the knowledge their child isn&#39;t watching tv or<br/>\ngorging on &quot;junkfood&quot;.   They can write, give phone advice, build/repair<br/>\nthings and pursue whatever hobbies they are inclined toward.<br/>\n<br/>\nMy kids spend a lot of time gaming, and watching movies.  I watch, too. I<br/>\nplay with them.  I offer cut up veggies, fruit, sandwiches, and drinks. We<br/>\nbake cookies and cakes.  We buy doughnuts, and specialty pastries, too. They<br/>\nhave access to &quot;junkfood&quot;:  they self-regulate.<br/>\n<br/>\nThis weekend after dinner my 14year old, ten year old and seven year old set<br/>\nup snacks and we played Monopoly.  I asked if anyone was interested in doing<br/>\nsomething after dinner...and voilà, a night with a board game and mom<br/>\nmaterialized as a fun option.  I cleared the table, and put the dishes in<br/>\nthe dishwasher, with lots of unsolicited help:)<br/>\n<br/>\nOn Sunday my husband offered a trip to a museum to our younger sons, and<br/>\ninvited Rowan as an afterthought.  After all he gave up gaming on Saturday<br/>\nevening for family time and his plans with his friends were &quot;set in stone&quot;.<br/>\nMy fourteen year old and his friends were planning to spend the day in his<br/>\nroom on the computer.   Instead, my son elatedly invited his friends to go<br/>\nwith his dad and younger brothers to a museum.  They accepted eagerly. So my<br/>\nhusband was accompanied by our teen, a sixteen year old, and a fifteen year<br/>\nold, along with two younger ones. They had a blast!<br/>\n<br/>\nWe&#39;re flexible, so it seems are the boys and they make real choices.<br/>\nSometimes they choose games, movies, or other activities, but not always and<br/>\nnot predictably.<br/>\n<br/>\nBut I have seen studies that show kids who self regulate, know and<br/>\nunderstand limits are less likely to be obese than kids whose parents<br/>\nregulate food.  I did an internet search last night after I saw the article,<br/>\nand there is no study to prove her right that actively engaged families<br/>\ngiving their kids freedom and choice are creating sugar/tv junkies.  I did<br/>\nfind proof that kids whose food choices were strictly regulated were more<br/>\ninclined to be overweight, rather than kids who self-regulated.  Dr Clara<br/>\nDavis discovered that newly weaned infants who were allowed to choose their<br/>\nown foods self regulated themselves into good health, despite many eating<br/>\ndessert first or going on &quot;food jags&quot;, where they excluded foods<br/>\nconsistently or ate only one thing. This was the 1930&#39;s.<br/>\n<br/>\nDr Spock also discovered kids whose diets were over regulated by parents<br/>\nusing &quot;doctor sanctioned&quot; healthy diets had more health problems.  They were<br/>\neither over or underweight!<br/>\n<br/>\nMarina<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] naomi aldort, tv & junk food. help!","postDate":"1271060329","msgId":43642,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwOTIzMy4yNDc0Mi5xbUB3ZWI4NjIwOC5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDI1OUVDQTU5MjRDNDRDMzhCQkY3RDc3NjUwQUFGN0Y2QENvbm5pZVBDPg==","referencesHeader":"PDExMTk2NjQuMTExMDM5LjEyNzEwNDM3MTYyMDIuSmF2YU1haWwucm9vdEB2bXMwNzUubWFpbHNydmNzLm5ldD4gPDI1OUVDQTU5MjRDNDRDMzhCQkY3RDc3NjUwQUFGN0Y2QENvbm5pZVBDPg=="},"prevInTopic":43641,"nextInTopic":43645,"prevInTime":43641,"nextInTime":43643,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"... So why aren t all radically unschooled kids sugar addicts?","messageBody":"<div id=\"ygrps-yiv-1378283521\">________________________________<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;***** In the formative years, passive external stimulations hinder a child’s freedom to be herself because they become part of what shapes her choices. For example, choosing sugar is shaped by the addictive nature of sugar; it is not a free choice. *****<br/>\n<br/>\n </span></blockquote>So why aren&#39;t all radically unschooled kids sugar addicts?&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nI recently watched the movie &quot;The War on Kids&quot;. One of the facts that was flashed across the screen was: <br/>\n<br/>\n&quot;Studies on rats have shown that given a choice between drugs or food, the animal will choose the drug. Drugs were chosen over food, even to the point of death. It was concluded that we are all at risk to the allure of drugs. This conclusion failed to take in account that these rats were treated poorly and housed in tiny cages. When the experiment was repeated, rats in a space 200 times larger with food and items for play displayed little interest in drugs. Destructive behavior is often a reaction to an abhorrent environment.&quot;<br/>\n<br/>\n<br/>\n<br/>\nThis statement is referring to a study that was conducted in the late 70&#39;s. The study is often referred to as Rat Park. You can see an overview of the study on Wikipedia.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Rat_Park\">http://en.wikipedia.org/wiki/Rat_Park</a> from Wikipedia. I have shared this since people keep referring to the addictive properties of sugar. If a child is treated right and is given choice, he/she will make very different choices than a child that is stressed out and living in a constrictive/controlling/manipulative environment. <br/>\n<br/>\nConnie<br/>\n<br/>\n---------------<br/>\n<br/>\nI love Rat Park. Bruce Alexander stuff is so fantastic. But it may absolutely be part of why what Naomi predicted didn&#39;t happen in her family. She writes:<br/>\n<br/>\n&quot;I have raised my <br/>\nchildren without sugar and junk food, without TV, and with a <br/>\nlimited amount of toys. I exposed them a lot to the arts, nature, and <br/>\nphilosophy. In their late teens, two of our sons tried junk food for a <br/>\nwhile and <br/>\ncame to value healthy eating and lifestyle even more. The youngest is <br/>\nnot <br/>\ninterested in junk food even when away from home. <br/>\n<br/>\n<br/>\n&quot;After a childhood <br/>\nof organic, healthy food, they internalized a sense of <br/>\nself-care that was not shakable by peers and the industry. Same with TV. We have <br/>\nwatched some videos of the arts and good film. When lodging away from <br/>\nhome, we <br/>\nused to turn on the TV. The children would get bored after a while, <br/>\nhaving more <br/>\ninteresting things to do or to talk about. TV has never become an <br/>\nattraction in <br/>\ntheir teen and adult lives.&quot;<br/>\n<br/>\nClearly believing that the buffer that saved her children from the danger of sugar and television were the limitations that she put in place to start, it may instead have been the rest of the environment that they were raised in. <br/>\n<br/>\n<br/>\nSimon and Linnaea are not addicted to sugar or television and they haven&#39;t had the limitations that Naomi believes in, has put her faith in. They do have a rich and engaging and nurturing environment that includes sugar water and that includes chips and candy and, well, yesterday meringues and the most amazing pound cake and imported Mountain Dew and they had vegetarian hot dogs with spaghetti run through them and spinach risotto and Simon carried the box of meringues around with him and I ate more of the cake than anyone else and, well, I&#39;m not afraid of the choices they&#39;ll make when they aren&#39;t in my household filled with only healthy food, &#39;cause my home is filled with food that we are hungry for, be it healthy or otherwise. Food eaten in joy and love, well, that&#39;s the best kind of food. Oh, and we watched Shirley Valentine on television and talked so much about disenchantment in a marriage and, well, that was cool too. I wouldn&#39;t have missed that so<br/>\n my kids could be saved from the evils of the television. I&#39;m not all that sure what those evils are, even.<br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] naomi aldort, tv & junk food. help!","postDate":"1271047329","msgId":43641,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI1OUVDQTU5MjRDNDRDMzhCQkY3RDc3NjUwQUFGN0Y2QENvbm5pZVBDPg==","inReplyToHeader":"PDExMTk2NjQuMTExMDM5LjEyNzEwNDM3MTYyMDIuSmF2YU1haWwucm9vdEB2bXMwNzUubWFpbHNydmNzLm5ldD4=","referencesHeader":"PDExMTk2NjQuMTExMDM5LjEyNzEwNDM3MTYyMDIuSmF2YU1haWwucm9vdEB2bXMwNzUubWFpbHNydmNzLm5ldD4="},"prevInTopic":43640,"nextInTopic":43642,"prevInTime":43640,"nextInTime":43642,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"... So why aren t all radically unschooled kids sugar addicts?","messageBody":"<div id=\"ygrps-yiv-1549647666\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;***** In the formative years, passive external stimulations hinder a child’s freedom to be herself because they become part of what shapes her choices. For example, choosing sugar is shaped by the addictive nature of sugar; it is not a free choice. *****<br/>\n<br/>\n </span></blockquote>So why aren&#39;t all radically unschooled kids sugar addicts?&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nI recently watched the movie &quot;The War on Kids&quot;. One of the facts that was flashed across the screen was: <br/>\n<br/>\n&quot;Studies on rats have shown that given a choice between drugs or food, the animal will choose the drug. Drugs were chosen over food, even to the point of death. It was concluded that we are all at risk to the allure of drugs. This conclusion failed to take in account that these rats were treated poorly and housed in tiny cages. When the experiment was repeated, rats in a space 200 times larger with food and items for play displayed little interest in drugs. Destructive behavior is often a reaction to an abhorrent environment.&quot;<br/>\n<br/>\n <br/>\n<br/>\nThis statement is referring to a study that was conducted in the late 70&#39;s. The study is often referred to as Rat Park. You can see an overview of the study on Wikipedia.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Rat_Park\">http://en.wikipedia.org/wiki/Rat_Park</a> from Wikipedia. I have shared this since people keep referring to the addictive properties of sugar. If a child is treated right and is given choice, he/she will make very different choices than a child that is stressed out and living in a constrictive/controlling/manipulative environment. <br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] naomi aldort, tv & junk food. help!","postDate":"1271044282","msgId":43640,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY1REY0M0JGN0M4OTQwMDE5MzdCNjZEMEUxNjhENjY3QExZTEFMQVAyPg==","inReplyToHeader":"PDExMTk2NjQuMTExMDM5LjEyNzEwNDM3MTYyMDIuSmF2YU1haWwucm9vdEB2bXMwNzUubWFpbHNydmNzLm5ldD4=","referencesHeader":"PDExMTk2NjQuMTExMDM5LjEyNzEwNDM3MTYyMDIuSmF2YU1haWwucm9vdEB2bXMwNzUubWFpbHNydmNzLm5ldD4="},"prevInTopic":43639,"nextInTopic":43641,"prevInTime":43639,"nextInTime":43641,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"ha never mind!  she posted it here too!  thanks joyce, i really *really* enjoyed reading your response to this - so thorough and logical. lyla ... From: Joyce","messageBody":"<div id=\"ygrps-yiv-2139653018\">ha never mind!  she posted it here too!  thanks joyce, i really *really* enjoyed reading your response to this - so thorough and logical.<br/>\n<br/>\nlyla<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Joyce Fetteroll <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Sunday, April 11, 2010 8:41 PM<br/>\n  Subject: Re: [unschoolingbasics] naomi aldort, tv & junk food. help!<br/>\n<br/>\n<br/>\n    <br/>\n  Apr 11, 2010 11:38:32 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> wrote:<br/>\n<br/>\n  ===========================================<br/>\n  we are unschoolers in the LA area. I need help navigating this<br/>\n  social/group issue...a mom in our local un/homeschool group posted this<br/>\n  today:<br/>\n<br/>\n  A few months ago I asked Naomi a few questions re. parental control on<br/>\n  junk food, TV and video games. I was getting confused with the opposite<br/>\n  messages coming from Radical Unschoolers and from unschooling advocates<br/>\n  like Naomi and Gatto (for him, school & TV are the two evils.) Rana<br/>\n  helped me by adding her own questions on the subject, with her<br/>\n  perspective as the mother of a 6 year old. (My son is only 21 months.) <br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.naturallifemagazine.com/1004/ask_naomi_aldort_freedom.htm\">http://www.naturallifemagazine.com/1004/ask_naomi_aldort_freedom.htm</a><br/>\n  any thoughts, opinions, arguments are greatly appreciated<br/>\n  Amanda<br/>\n  ============================================<br/>\n<br/>\n  I&#39;m guessing you mean Clara. She posted on Always Learning. Here&#39;s what I replied to her:<br/>\n<br/>\n  ***** The fact that learning is constant and unknown to us is an argument against media and junk food, rather than for it; it is the reason we want to protect what the child is exposed to until his unique direction emerges from within and he is strong enough to stay rooted in himself. *****<br/>\n<br/>\n  Her whole argument is based on the assumption that &quot;media&quot; and sugar are dangerous and addictive substances that are more powerful than children. She is saying children can&#39;t protect themselves from the (supposed) bad effects until they&#39;re older and more knowledgeable. One reason they can&#39;t protect themselves, she says, is the damage doesn&#39;t show up immediately.<br/>\n<br/>\n  ***** However, a child who “needs” candy or a movie is not free; the experience of candy or TV has created the illusion of a need. That which chooses is manipulated by the choice. The industry does a great job of manufacturing a sense of need. *****<br/>\n<br/>\n  What real life children has she based these assumptions and conclusions on? Unschooled children who have been raised by connected parents who provide a rich supportive environment?<br/>\n<br/>\n  If what she was saying was true, always unschooled children should show far more profound effects of this damage than any other group of children. Have you been to an unschooling conference to see the effects on long time unschooling kids? Have you talked to long time unschoolers about what they&#39;ve actually experienced?<br/>\n<br/>\n  ***** In the formative years, passive external stimulations hinder a child’s freedom to be herself because they become part of what shapes her choices. For example, choosing sugar is shaped by the addictive nature of sugar; it is not a free choice. *****<br/>\n<br/>\n  So why aren&#39;t all radically unschooled kids sugar addicts?<br/>\n<br/>\n  ***** I am sure you have heard parents say, “Oh, come on, just be more loose and let her enjoy the cookies…it won’t kill her,” or, “Some TV is good for him.” Even unschooling parents tend to fall innocently into this habitual school-acquired trend of telling others to bend and fit into a common trend. *****<br/>\n<br/>\n  Have you read any advice here that is merely opinion, that lacks analysis of real life data like the above?<br/>\n<br/>\n  If you think this list is nothing more than a bunch of opinions based on what works for each of us, that there&#39;s no digging into the ideas, no observation of what really happens in families and why, no constant examination and questioning then you should be getting advice elsewhere.<br/>\n<br/>\n  ***** In addition, children are capable of making wise choices when they can witness the results of their actions right away. But they have adult parents to guide and protect them from anything that has a long term harmful impact that they cannot foresee. *****<br/>\n<br/>\n  One of the sticking places in understanding unschooling is expecting kids on their own to make the same decisions the parent would. If mom expects even a long time unschooling child to stop at one piece of candy or watch only the shows she thinks are quality or always prefer organic foods to their conventional counterparts she&#39;s setting herself up for disappointment and her child up for failure.<br/>\n<br/>\n  Unschooling isn&#39;t trusting the child to make mom&#39;s &quot;right&quot; decisions but for kids&#39; understanding of what&#39;s important to them to grow as they make choices and experience life. They will like things parents don&#39;t because their personalities and tastes are different, because their bodies are different, because the negative aspects are worth putting up with (for now) for the positive aspects.<br/>\n<br/>\n  For instance children tend to like sweet cereal when adults don&#39;t not because they haven&#39;t been taught what is best for their bodies (or because sugar is addictive). It&#39;s because they need lots of calories to grow. And they have small stomachs -- and lots of more interesting things to do -- so they need and prefer lots of calories in small packages often. To an adult a child&#39;s choices look poor but the kids are listening to their bodies.<br/>\n<br/>\n  That shouldn&#39;t be interpreted as &quot;Keep the candy bowl full and step back.&quot; It&#39;s a recognition of a biochemical reality. If you ask, people will have lots of ideas of what their kids liked when going through the fast growth stage. There are a lot of ideas on Sandra&#39;s monkey platter page.<br/>\n<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/monkeyplatters\">http://sandradodd.com/monkeyplatters</a><br/>\n<br/>\n  ***** Clara: As a child, I was not allowed to have a Barbie doll and we didn’t have a TV, for which I’m forever grateful to my parents, even though it made me feel different from my peers at the time. *****<br/>\n<br/>\n  Why? What negative effect do you fear Barbies and TV would have had on you? What real life data do you base your fear on? Are they radically unschooled? Or conventionally parented schooled kids?<br/>\n<br/>\n  Do you know of or read first hand accounts of long time unschooled kids who&#39;ve ended up with the effects you fear?<br/>\n<br/>\n  ***** Why worship being like everyone else? *****<br/>\n<br/>\n  Are people worshiping being like everyone else? Her language is emotionally manipulative.<br/>\n<br/>\n  Humans are social creatures. We want connections with each other. Finding others who share interests and experiences is part of connecting. <br/>\n<br/>\n  Schooled kids want connections too but there&#39;s an unhealthy aspect to their need for connection. Part of it is they&#39;ve been pulled from their family support to fend for themselves when they&#39;re not developmentally ready. They spend their childhood years seeking a substitute and for many kids it means taking on the likes and dislikes of a peer group so they&#39;ll be accepted.<br/>\n<br/>\n  But exploring what other people find interesting is part of the process of connecting to others. When we first moved into our house my daughter and the girl across the street, Stephanie, made some attempts at friendship. Kathryn loved pretending with animals and Stephanie loved dolls. For a while Kathryn enjoyed playing dolls with Stephanie and said she liked how Stephanie played with them. (She obviously brought a passion about dolls to their play.) But the friendship fizzled and my daughter went back to her animals and ignored the few dolls she had. It wasn&#39;t a peer pressure thing or a way to be like everyone else. It was an avenue to connect with someone else. But what the avenue connected to wasn&#39;t drawing enough for Kathryn to keep up an interest without Stephanie.<br/>\n<br/>\n  ***** Much TV and junk toys and foods can be the cause of the child’s loss of freedom. *****<br/>\n<br/>\n  Again, what&#39;s the foundation of this statement? What radically unschooled kids is she basing it on?<br/>\n<br/>\n  My daughter isn&#39;t addicted to either TV or sugar even though she&#39;s had free access to both for 18 years. She doesn&#39;t over power a desire to watch TV or eat sugar with knowledge. She chooses what she prefers to do and eat based on personal preferences. Neither TV nor sugar are prominent in her life by her own choice.<br/>\n<br/>\n  ***** I kept our home stocked with only healthy food and natural tools of art, play, and learning, and I stirred our family social connections with awareness. As a result, my children were free to do as they wished and didn’t experience restrictions. *****<br/>\n<br/>\n  That statement doesn&#39;t make logical sense.<br/>\n<br/>\n  Is she saying that if she&#39;d had TV and conventional foods that her kids would have felt restrictions? Or that she would have restricted them?<br/>\n<br/>\n  I&#39;m guessing, based on the above, she&#39;s saying the addictive nature of TV and sugar would have imposed restrictions. But she&#39;s just guessing based on her own fears.<br/>\n<br/>\n  It&#39;s funny that once someone removes the addiction-colored glasses the behavior they saw as addiction becomes engagement and interest.<br/>\n<br/>\n  ***** Oliver, our youngest, has recently reflected on his childhood, saying those were the most happy years he can ever imagine. He said he recalls getting up each morning and feeling overjoyed with anticipation for the day. *****<br/>\n<br/>\n  Is she implying kids who have TV and sugar in their lives can&#39;t say the same? Based on what personal experience?<br/>\n<br/>\n  ***** Clara: Many unschoolers’ view is that banning something tells the child he isn’t as powerful as the thing, so someone must keep it away from him. *****<br/>\n<br/>\n  You left off the rest of discussion. That&#39;s the problem with learning through &quot;sound bites.&quot; The full picture gets lost.<br/>\n<br/>\n  It&#39;s no secret to kids that the world is bigger and more powerful than they are. Naomi implies that unschoolers suggest lying to the child to tell them they&#39;re more powerful when they aren&#39;t. Please show where someone has said that.<br/>\n<br/>\n  What unschoolers have said is to work with the child to tackle the problem and find ways to deal with it. In the process of figuring out how to overcome the obstacles in safe and respectful ways, the child will gain a better understanding of the problem and they&#39;ll also be reassessing whether they really want to tackle it or not.<br/>\n<br/>\n  An example is older kids going to parties where there might be drinking. There are more choices than blithely letting the child go ignoring all the problems that might happen and telling the child no and explaining all the things that could go wrong that the child might not be able to handle. Better is to empower the child. Strategies like letting them know they can always have a ride home no matter what, no questions asked, providing a cell phone, building up a habit of calling home to let the parents know if they&#39;re going somewhere else and so on.<br/>\n<br/>\n  That doesn&#39;t apply to TV and sugar, though. Radically unschooled kids aren&#39;t being overpowered by either.<br/>\n<br/>\n  ***** The child does have the power to face her own weaknesses and to stay away from things – initially with your guidance and, later, on her own. *****<br/>\n<br/>\n  That&#39;s the strategy conventional parents use which often results in rebellious teens.<br/>\n<br/>\n  Is that the attitude you would like your husband to have towards you? How would it make you feel if he did? Yes, you&#39;re an adult and have a different relationship but imagine how you&#39;d feel. Children are just as human and prefer people who want to help them approach an obstacle rather than explain why they can&#39;t. Kids are already aware that they have less power than adults. They&#39;ve lived with that their whole life.<br/>\n<br/>\n  What if you replace the child in the above scenario with a handicapped person? Handicapped people are already to well aware of the obstacles they face. They want to find ways around the obstacles to get what they want.<br/>\n<br/>\n  ***** We can avoid controlling by not exposing in the first place and by providing clear and kind leadership. Children yearn for parental guidance and are powerful enough to not always get their way. *****<br/>\n<br/>\n  Just picture a man giving that advice to another man about how his relationship with his new wife should be.<br/>\n<br/>\n  If you thought that attitude would damage your relationship with a friend or partner, why do you think it would not damage a relationship with a child?<br/>\n<br/>\n  ***** Clara: I’ve heard from unschoolers that kids who aren’t limited treat TV a lot like they treat books: as a resource. Is that really true? *****<br/>\n<br/>\n  Whoa. Why are you asking her if what we&#39;re saying is true? Do you think we&#39;re lying???<br/>\n<br/>\n  ***** As a teenager, one of my sons wanted to play video games. He provided for me pro and con articles, which we both read and discussed for a couple of weeks. We concluded that it was fine for him. He was into these games very part-time for about two years. *****<br/>\n<br/>\n  What if you wanted to try something new like clog dancing and you had to provide pro and con articles and discuss it with your husband for a couple of weeks? Would it be wonderful if all that he agreed it would be fine for you?<br/>\n<br/>\n  ***** In their late teens, two of our sons tried junk food for a while and came to value healthy eating and lifestyle even more. The youngest is not interested in junk food even when away from home. *****<br/>\n<br/>\n  And?? My daughter has had the freedom to eat convenience foods her whole life and prefers to eat the way my husband I eat.<br/>\n<br/>\n  If control worked, every parent would be a genius at parenting. It takes no great skill to limit a child&#39;s world to what they parent believes is best. What&#39;s hard is maintaining the relationship. Some kids are compliant. Some kids may naturally have similar tastes to the parents. Some parents are so great at building the relationship in other ways that the parts that are closed off to them aren&#39;t as big a deal as they are to kids who feel disconnected from their parents. Not sure why it worked for her, but for millions of parents control fails spectacularly.<br/>\n<br/>\n  ***** After a childhood of organic, healthy food, they internalized a sense of self-care that was not shakable by peers and the industry. *****<br/>\n<br/>\n  If a parent provides organic healthy food with love while allowing the child to freely explore, it&#39;s far more likely the child will embrace organic healthy food than if they&#39;ve never had a choice (or a &quot;choice&quot; controlled through persuasion.)<br/>\n<br/>\n  It&#39;s natural to want even more what someone is blocking you from having. You can even get people to want something they weren&#39;t interested in by telling them they can&#39;t have it ;-) <br/>\n<br/>\n  ***** TV has never become an attraction in their teen and adult lives. *****<br/>\n<br/>\n  And? My daughter watches a lot of videos of 80&#39;s rock groups because that&#39;s her passion but she doesn&#39;t watch much regular TV. Not because she doesn&#39;t like it! But because she has so many other things she&#39;s choosing to do first.<br/>\n<br/>\n  The &quot;never become an attraction&quot; attitude bothers me. I think it suggests TV has no redeeming value and the only reason someone would watch it was because of &quot;attraction&quot;, like being manipulated or mesmerized. <br/>\n<br/>\n  What if someone kept books from their child and once grown said &quot;Books have never become an attraction in their teen and adult lives.&quot; Doesn&#39;t something sound off about it?<br/>\n<br/>\n  ***** You will protect him from alcohol, coffee, sugar, gambling, guns, violence, commercial seductions, streets, drugs, ocean waves, crime, certain areas of the city, etc. *****<br/>\n<br/>\n  My daughter has had access to a lot of that and yet she hasn&#39;t embraced any of them at 18. She even works at Starbucks and hasn&#39;t developed a daily coffee habit even though she gets free drinks all day long. Even though we both drink lattes she usually chooses non-caffeinated drinks while she works.<br/>\n<br/>\n  I didn&#39;t need to protect her. I gave her information over the years not to make her make the right choices but for her to use when she made choices. She&#39;s had sips of alcohol and prefers non-alcohol. (I had the same as a kid and also prefer non-alcohol.) Maybe it&#39;s genetics but others have said the same. <br/>\n<br/>\n  ***** You will also insist on him wearing a seat-belt in a car, a helmet on a bike, and other restrictions for his protection, or to accommodate laws or the needs of others. Your own life isn’t without things being off limits either and you are fine. Your son can handle reality and is counting on your management. *****<br/>\n<br/>\n  Her &quot;reality&quot; is that TV and sugar and non-organic foods and video games are dangerous like riding without a seatbelt. But if so the evidence should be glaringly obvious in radically unschooled kids but it isn&#39;t.<br/>\n<br/>\n  ***** When happy with what is, a child does not search for what isn’t. *****<br/>\n<br/>\n  I&#39;m not sure that&#39;s great! Is the goal to create kids who are happy with what the parent has exposed them to? Honestly that sounds like a science fiction scenario to create the perfect society so people are content with what the government gives them.<br/>\n<br/>\n  ***** Happiness and self-reliance have nothing to do with the child getting whatever she wants and everything to do with freedom from commercial manipulation. *****<br/>\n<br/>\n  Again, where&#39;s her data to back up her statement? How does she explain radically unschooled kids who are happy and self-reliant when they&#39;ve had free access to commercial TV and a partner who helps them find ways that are safe and respectful to do what they want?<br/>\n<br/>\n  ***** Clara: I’d be very interested in the language you use when explaining your family’s choice to eat a certain way or to not watch TV at home.<br/>\n<br/>\n  Naomi: I often said nothing and life simply went on. If asked, my language was simple, “This is how we do it based on my knowledge.” Or I engaged in a conversation that responded to a particular inquiry as much as the child wanted. There is no need to protect your child from his family or apologize for being you. It is a burden for a child to get explanations for everything. He need not be the CEO of the family. Give him a break. Let him be a child and play freely in an environment you provide with his aspirations in mind. *****<br/>\n<br/>\n  I can pretty much guarantee that wouldn&#39;t work in most families! It could be her kids were very accepting and liked the security of someone making the decisions. As a child I found comfort in knowing there was a &quot;right&quot; way for life to be so I didn&#39;t push the envelope. I don&#39;t know if my parents realized they just got lucky with my personality or if they thought their &quot;success&quot; with me was because of what they did. So her attitude would probably have worked with me. It wouldn&#39;t have with my daughter though! And I know lots of kids question *everything* and wouldn&#39;t accept &quot;This is how we do it.&quot;<br/>\n<br/>\n  There is no magic formula in what she says. She either doesn&#39;t know what else she was doing that made this &quot;work&quot; for her or her kids were content to go along with life as it was.<br/>\n<br/>\n  Joyce<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] naomi aldort, tv & junk food. help!","postDate":"1271044224","msgId":43639,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE3Q0E3RjcxNTU1NTQ2MEU4RTQ0MTQ5Q0NEQTMyNjAzQExZTEFMQVAyPg==","inReplyToHeader":"PGhwdTQ3YithbW5nQGVHcm91cHMuY29tPg==","referencesHeader":"PGhwdTQ3YithbW5nQGVHcm91cHMuY29tPg=="},"prevInTopic":43638,"nextInTopic":43640,"prevInTime":43638,"nextInTime":43640,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"she posted the same thing on alwayslearning and joyce just gave a very detailed answer that i thought was wonderful, if you are  on that list... lyla ... From:","messageBody":"<div id=\"ygrps-yiv-879132191\">she posted the same thing on alwayslearning and joyce just gave a very detailed answer that i thought was wonderful, if you are  on that list...<br/>\n<br/>\nlyla<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: AmandaE <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Sunday, April 11, 2010 8:31 PM<br/>\n  Subject: [unschoolingbasics] naomi aldort, tv & junk food. help!<br/>\n<br/>\n<br/>\n    <br/>\n  we are unschoolers in the LA area. I need help navigating this<br/>\n  social/group issue...a mom in our local un/homeschool group posted this<br/>\n  today:<br/>\n  A few months ago I asked Naomi a few questions re. parental control on<br/>\n  junk food, TV and video games. I was getting confused with the opposite<br/>\n  messages coming from Radical Unschoolers and from unschooling advocates<br/>\n  like Naomi and Gatto (for him, school & TV are the two evils.) Rana<br/>\n  helped me by adding her own questions on the subject, with her<br/>\n  perspective as the mother of a 6 year old. (My son is only 21 months.) <br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.naturallifemagazine.com/1004/ask_naomi_aldort_freedom.htm\">http://www.naturallifemagazine.com/1004/ask_naomi_aldort_freedom.htm</a><br/>\n  any thoughts, opinions, arguments are greatly appreciated<br/>\n  AmandaE<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] naomi aldort, tv & junk food. help!","postDate":"1271043716","msgId":43638,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExMTk2NjQuMTExMDM5LjEyNzEwNDM3MTYyMDIuSmF2YU1haWwucm9vdEB2bXMwNzUubWFpbHNydmNzLm5ldD4="},"prevInTopic":43637,"nextInTopic":43639,"prevInTime":43637,"nextInTime":43639,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"Apr 11, 2010 11:38:32 PM, unschoolingbasics@yahoogroups.com wrote: =========================================== we are unschoolers in the LA area. I need help","messageBody":"<div id=\"ygrps-yiv-1114367686\">Apr 11, 2010 11:38:32 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> wrote:<br/>\n<br/>\n===========================================<br/>\nwe are unschoolers in the LA area. I need help navigating this<br/>\nsocial/group issue...a mom in our local un/homeschool group posted this<br/>\ntoday:<br/>\n<br/>\nA few months ago I asked Naomi a few questions re. parental control on<br/>\njunk food, TV and video games. I was getting confused with the opposite<br/>\nmessages coming from Radical Unschoolers and from unschooling advocates<br/>\nlike Naomi and Gatto (for him, school & TV are the two evils.) Rana<br/>\nhelped me by adding her own questions on the subject, with her<br/>\nperspective as the mother of a 6 year old. (My son is only 21 months.) <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.naturallifemagazine.com/1004/ask_naomi_aldort_freedom.htm\">http://www.naturallifemagazine.com/1004/ask_naomi_aldort_freedom.htm</a><br/>\nany thoughts, opinions, arguments are greatly appreciated<br/>\nAmanda<br/>\n============================================<br/>\n<br/>\nI&#39;m guessing you mean Clara. She posted on Always Learning. Here&#39;s what I replied to her:<br/>\n<br/>\n***** The fact that learning is constant and unknown to us is an argument against media and junk food, rather than for it; it is the reason we want to protect what the child is exposed to until his unique direction emerges from within and he is strong enough to stay rooted in himself. *****<br/>\n<br/>\nHer whole argument is based on the assumption that &quot;media&quot; and sugar are dangerous and addictive substances that are more powerful than children. She is saying children can&#39;t protect themselves from the (supposed) bad effects until they&#39;re older and more knowledgeable. One reason they can&#39;t protect themselves, she says, is the damage doesn&#39;t show up immediately.<br/>\n<br/>\n***** However, a child who “needs” candy or a movie is not free; the experience of candy or TV has created the illusion of a need. That which chooses is manipulated by the choice. The industry does a great job of manufacturing a sense of need. *****<br/>\n<br/>\nWhat real life children has she based these assumptions and conclusions on? Unschooled children who have been raised by connected parents who provide a rich supportive environment?<br/>\n<br/>\nIf what she was saying was true, always unschooled children should show far more profound effects of this damage than any other group of children. Have you been to an unschooling conference to see the effects on long time unschooling kids? Have you talked to long time unschoolers about what they&#39;ve actually experienced?<br/>\n<br/>\n***** In the formative years, passive external stimulations hinder a child’s freedom to be herself because they become part of what shapes her choices. For example, choosing sugar is shaped by the addictive nature of sugar; it is not a free choice. *****<br/>\n<br/>\nSo why aren&#39;t all radically unschooled kids sugar addicts?<br/>\n<br/>\n***** I am sure you have heard parents say, “Oh, come on, just be more loose and let her enjoy the cookies…it won’t kill her,” or, “Some TV is good for him.” Even unschooling parents tend to fall innocently into this habitual school-acquired trend of telling others to bend and fit into a common trend. *****<br/>\n<br/>\nHave you read any advice here that is merely opinion, that lacks analysis of real life data like the above?<br/>\n<br/>\nIf you think this list is nothing more than a bunch of opinions based on what works for each of us, that there&#39;s no digging into the ideas, no observation of what really happens in families and why, no constant examination and questioning then you should be getting advice elsewhere.<br/>\n<br/>\n***** In addition, children are capable of making wise choices when they can witness the results of their actions right away. But they have adult parents to guide and protect them from anything that has a long term harmful impact that they cannot foresee. *****<br/>\n<br/>\nOne of the sticking places in understanding unschooling is expecting kids on their own to make the same decisions the parent would. If mom expects even a long time unschooling child to stop at one piece of candy or watch only the shows she thinks are quality or always prefer organic foods to their conventional counterparts she&#39;s setting herself up for disappointment and her child up for failure.<br/>\n<br/>\nUnschooling isn&#39;t trusting the child to make mom&#39;s &quot;right&quot; decisions but for kids&#39; understanding of what&#39;s important to them to grow as they make choices and experience life. They will like things parents don&#39;t because their personalities and tastes are different, because their bodies are different, because the negative aspects are worth putting up with (for now) for the positive aspects.<br/>\n<br/>\nFor instance children tend to like sweet cereal when adults don&#39;t not because they haven&#39;t been taught what is best for their bodies (or because sugar is addictive). It&#39;s because they need lots of calories to grow. And they have small stomachs -- and lots of more interesting things to do -- so they need and prefer lots of calories in small packages often. To an adult a child&#39;s choices look poor but the kids are listening to their bodies.<br/>\n<br/>\nThat shouldn&#39;t be interpreted as &quot;Keep the candy bowl full and step back.&quot; It&#39;s a recognition of a biochemical reality. If you ask, people will have lots of ideas of what their kids liked when going through the fast growth stage. There are a lot of ideas on Sandra&#39;s monkey platter page.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/monkeyplatters\">http://sandradodd.com/monkeyplatters</a><br/>\n<br/>\n<br/>\n***** Clara: As a child, I was not allowed to have a Barbie doll and we didn’t have a TV, for which I’m forever grateful to my parents, even though it made me feel different from my peers at the time. *****<br/>\n<br/>\nWhy? What negative effect do you fear Barbies and TV would have had on you? What real life data do you base your fear on? Are they radically unschooled? Or conventionally parented schooled kids?<br/>\n<br/>\nDo you know of or read first hand accounts of long time unschooled kids who&#39;ve ended up with the effects you fear?<br/>\n<br/>\n***** Why worship being like everyone else? *****<br/>\n<br/>\nAre people worshiping being like everyone else? Her language is emotionally manipulative.<br/>\n<br/>\nHumans are social creatures. We want connections with each other. Finding others who share interests and experiences is part of connecting. <br/>\n<br/>\nSchooled kids want connections too but there&#39;s an unhealthy aspect to their need for connection. Part of it is they&#39;ve been pulled from their family support to fend for themselves when they&#39;re not developmentally ready. They spend their childhood years seeking a substitute and for many kids it means taking on the likes and dislikes of a peer group so they&#39;ll be accepted.<br/>\n<br/>\nBut exploring what other people find interesting is part of the process of connecting to others. When we first moved into our house my daughter and the girl across the street, Stephanie, made some attempts at friendship. Kathryn loved pretending with animals and Stephanie loved dolls. For a while Kathryn enjoyed playing dolls with Stephanie and said she liked how Stephanie played with them. (She obviously brought a passion about dolls to their play.) But the friendship fizzled and my daughter went back to her animals and ignored the few dolls she had. It wasn&#39;t a peer pressure thing or a way to be like everyone else. It was an avenue to connect with someone else. But what the avenue connected to wasn&#39;t drawing enough for Kathryn to keep up an interest without Stephanie.<br/>\n<br/>\n***** Much TV and junk toys and foods can be the cause of the child’s loss of freedom. *****<br/>\n<br/>\nAgain, what&#39;s the foundation of this statement? What radically unschooled kids is she basing it on?<br/>\n<br/>\nMy daughter isn&#39;t addicted to either TV or sugar even though she&#39;s had free access to both for 18 years. She doesn&#39;t over power a desire to watch TV or eat sugar with knowledge. She chooses what she prefers to do and eat based on personal preferences. Neither TV nor sugar are prominent in her life by her own choice.<br/>\n<br/>\n***** I kept our home stocked with only healthy food and natural tools of art, play, and learning, and I stirred our family social connections with awareness. As a result, my children were free to do as they wished and didn’t experience restrictions. *****<br/>\n<br/>\nThat statement doesn&#39;t make logical sense.<br/>\n<br/>\nIs she saying that if she&#39;d had TV and conventional foods that her kids would have felt restrictions? Or that she would have restricted them?<br/>\n<br/>\nI&#39;m guessing, based on the above, she&#39;s saying the addictive nature of TV and sugar would have imposed restrictions. But she&#39;s just guessing based on her own fears.<br/>\n<br/>\nIt&#39;s funny that once someone removes the addiction-colored glasses the behavior they saw as addiction becomes engagement and interest.<br/>\n<br/>\n***** Oliver, our youngest, has recently reflected on his childhood, saying those were the most happy years he can ever imagine. He said he recalls getting up each morning and feeling overjoyed with anticipation for the day. *****<br/>\n<br/>\nIs she implying kids who have TV and sugar in their lives can&#39;t say the same? Based on what personal experience?<br/>\n<br/>\n***** Clara: Many unschoolers’ view is that banning something tells the child he isn’t as powerful as the thing, so someone must keep it away from him. *****<br/>\n<br/>\nYou left off the rest of discussion. That&#39;s the problem with learning through &quot;sound bites.&quot;  The full picture gets lost.<br/>\n<br/>\nIt&#39;s no secret to kids that the world is bigger and more powerful than they are. Naomi implies that unschoolers suggest lying to the child to tell them they&#39;re more powerful when they aren&#39;t. Please show where someone has said that.<br/>\n<br/>\nWhat unschoolers have said is to work with the child to tackle the problem and find ways to deal with it. In the process of figuring out how to overcome the obstacles in safe and respectful ways, the child will gain a better understanding of the problem and they&#39;ll also be reassessing whether they really want to tackle it or not.<br/>\n<br/>\nAn example is older kids going to parties where there might be drinking. There are more choices than blithely letting the child go ignoring all the problems that might happen and telling the child no and explaining all the things that could go wrong that the child might not be able to handle. Better is to empower the child. Strategies like letting them know they can always have a ride home no matter what, no questions asked, providing a cell phone, building up a habit of calling home to let the parents know if they&#39;re going somewhere else and so on.<br/>\n<br/>\nThat doesn&#39;t apply to TV and sugar, though. Radically unschooled kids aren&#39;t being overpowered by either.<br/>\n<br/>\n***** The child does have the power to face her own weaknesses and to stay away from things – initially with your guidance and, later, on her own. *****<br/>\n<br/>\nThat&#39;s the strategy conventional parents use which often results in rebellious teens.<br/>\n<br/>\nIs that the attitude you would like your husband to have towards you? How would it make you feel if he did? Yes, you&#39;re an adult and have a different relationship but imagine how you&#39;d feel. Children are just as human and prefer people who want to help them approach an obstacle rather than explain why they can&#39;t. Kids are already aware that they have less power than adults. They&#39;ve lived with that their whole life.<br/>\n<br/>\nWhat if you replace the child in the above scenario with a handicapped person? Handicapped people are already to well aware of the obstacles they face. They want to find ways around the obstacles to get what they want.<br/>\n<br/>\n***** We can avoid controlling by not exposing in the first place and by providing clear and kind leadership. Children yearn for parental guidance and are powerful enough to not always get their way. *****<br/>\n<br/>\nJust picture a man giving that advice to another man about how his relationship with his new wife should be.<br/>\n<br/>\nIf you thought that attitude would damage your relationship with a friend or partner, why do you think it would not damage a relationship with a child?<br/>\n<br/>\n***** Clara: I’ve heard from unschoolers that kids who aren’t limited treat TV a lot like they treat books: as a resource. Is that really true? *****<br/>\n<br/>\nWhoa. Why are you asking her if what we&#39;re saying is true? Do you think we&#39;re lying???<br/>\n<br/>\n***** As a teenager, one of my sons wanted to play video games. He provided for me pro and con articles, which we both read and discussed for a couple of weeks. We concluded that it was fine for him. He was into these games very part-time for about two years. *****<br/>\n<br/>\nWhat if you wanted to try something new like clog dancing and you had to provide pro and con articles and discuss it with your husband for a couple of weeks? Would it be wonderful if all that he agreed it would be fine for you?<br/>\n<br/>\n***** In their late teens, two of our sons tried junk food for a while and came to value healthy eating and lifestyle even more. The youngest is not interested in junk food even when away from home. *****<br/>\n<br/>\nAnd?? My daughter has had the freedom to eat convenience foods her whole life and prefers to eat the way my husband I eat.<br/>\n<br/>\nIf control worked, every parent would be a genius at parenting. It takes no great skill to limit a child&#39;s world to what they parent believes is best. What&#39;s hard is maintaining the relationship. Some kids are compliant. Some kids may naturally have similar tastes to the parents. Some parents are so great at building the relationship in other ways that the parts that are closed off to them aren&#39;t as big a deal as they are to kids who feel disconnected from their parents. Not sure why it worked for her, but for millions of parents control fails spectacularly.<br/>\n<br/>\n***** After a childhood of organic, healthy food, they internalized a sense of self-care that was not shakable by peers and the industry. *****<br/>\n<br/>\nIf a parent provides organic healthy food with love while allowing the child to freely explore, it&#39;s far more likely the child will embrace organic healthy food than if they&#39;ve never had a choice (or a &quot;choice&quot; controlled through persuasion.)<br/>\n<br/>\nIt&#39;s natural to want even more what someone is blocking you from having. You can even get people to want something they weren&#39;t interested in by telling them they can&#39;t have it ;-) <br/>\n<br/>\n***** TV has never become an attraction in their teen and adult lives. *****<br/>\n<br/>\nAnd? My daughter watches a lot of videos of 80&#39;s rock groups because that&#39;s her passion but she doesn&#39;t watch much regular TV. Not because she doesn&#39;t like it! But because she has so many other things she&#39;s choosing to do first.<br/>\n<br/>\nThe &quot;never become an attraction&quot; attitude bothers me. I think it suggests TV has no redeeming value and the only reason someone would watch it was because of &quot;attraction&quot;, like being manipulated or mesmerized. <br/>\n<br/>\nWhat if someone kept books from their child and once grown said &quot;Books have never become an attraction in their teen and adult lives.&quot; Doesn&#39;t something sound off about it?<br/>\n<br/>\n***** You will protect him from alcohol, coffee, sugar, gambling, guns, violence, commercial seductions, streets, drugs, ocean waves, crime, certain areas of the city, etc. *****<br/>\n<br/>\nMy daughter has had access to a lot of that and yet she hasn&#39;t embraced any of them at 18. She even works at Starbucks and hasn&#39;t developed a daily coffee habit even though she gets free drinks all day long. Even though we both drink lattes she usually chooses non-caffeinated drinks while she works.<br/>\n<br/>\nI didn&#39;t need to protect her. I gave her information over the years not to make her make the right choices but for her to use when she made choices. She&#39;s had sips of alcohol and prefers non-alcohol. (I had the same as a kid and also prefer non-alcohol.) Maybe it&#39;s genetics but others have said the same. <br/>\n<br/>\n***** You will also insist on him wearing a seat-belt in a car, a helmet on a bike, and other restrictions for his protection, or to accommodate laws or the needs of others. Your own life isn’t without things being off limits either and you are fine. Your son can handle reality and is counting on your management. *****<br/>\n<br/>\nHer &quot;reality&quot; is that TV and sugar and non-organic foods and video games are dangerous like riding without a seatbelt. But if so the evidence should be glaringly obvious in radically unschooled kids but it isn&#39;t.<br/>\n<br/>\n***** When happy with what is, a child does not search for what isn’t. *****<br/>\n<br/>\nI&#39;m not sure that&#39;s great! Is the goal to create kids who are happy with what the parent has exposed them to? Honestly that sounds like a science fiction scenario to create the perfect society so people are content with what the government gives them.<br/>\n<br/>\n***** Happiness and self-reliance have nothing to do with the child getting whatever she wants and everything to do with freedom from commercial manipulation. *****<br/>\n<br/>\nAgain, where&#39;s her data to back up her statement? How does she explain radically unschooled kids who are happy and self-reliant when they&#39;ve had free access to commercial TV and a partner who helps them find ways that are safe and respectful to do what they want?<br/>\n<br/>\n***** Clara: I’d be very interested in the language you use when explaining your family’s choice to eat a certain way or to not watch TV at home.<br/>\n<br/>\nNaomi: I often said nothing and life simply went on. If asked, my language was simple, “This is how we do it based on my knowledge.” Or I engaged in a conversation that responded to a particular inquiry as much as the child wanted. There is no need to protect your child from his family or apologize for being you. It is a burden for a child to get explanations for everything. He need not be the CEO of the family. Give him a break. Let him be a child and play freely in an environment you provide with his aspirations in mind. *****<br/>\n<br/>\nI can pretty much guarantee that wouldn&#39;t work in most families! It could be her kids were very accepting and liked the security of someone making the decisions. As a child I found comfort in knowing there was a &quot;right&quot; way for life to be so I didn&#39;t push the envelope. I don&#39;t know if my parents realized they just got lucky with my personality or if they thought their &quot;success&quot; with me was because of what they did. So her attitude would probably have worked with me. It wouldn&#39;t have with my daughter though! And I know lots of kids question *everything* and wouldn&#39;t accept &quot;This is how we do it.&quot;<br/>\n<br/>\nThere is no magic formula in what she says. She either doesn&#39;t know what else she was doing that made this &quot;work&quot; for her or her kids were content to go along with life as it was.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":341424270,"authorName":"AmandaE","from":"&quot;AmandaE&quot; &lt;amanda@...&gt;","profile":"aenclade","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"naomi aldort, tv & junk food. help!","postDate":"1271043115","msgId":43637,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhwdTQ3YithbW5nQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":43638,"prevInTime":43636,"nextInTime":43638,"topicId":43637,"numMessagesInTopic":0,"msgSnippet":"we are unschoolers in the LA area. I need help navigating this social/group issue...a mom in our local un/homeschool group posted this today: A few months ago","messageBody":"<div id=\"ygrps-yiv-202104933\">we are unschoolers in the LA area. I need help navigating this<br/>\nsocial/group issue...a mom in our local un/homeschool group posted this<br/>\ntoday:<br/>\nA few months ago I asked Naomi a few questions re. parental control on<br/>\njunk food, TV and video games. I was getting confused with the opposite<br/>\nmessages coming from Radical Unschoolers and from unschooling advocates<br/>\nlike Naomi and Gatto (for him, school & TV are the two evils.) Rana<br/>\nhelped me by adding her own questions on the subject, with her<br/>\nperspective as the mother of a 6 year old. (My son is only 21 months.) <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.naturallifemagazine.com/1004/ask_naomi_aldort_freedom.htm\">http://www.naturallifemagazine.com/1004/ask_naomi_aldort_freedom.htm</a><br/>\nany thoughts, opinions, arguments are greatly appreciated<br/>\nAmandaE<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":43680,"nextTopicId":43648}}