{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":279433414,"authorName":"Carrie Kimball","from":"&quot;Carrie Kimball&quot; &lt;ckmidwife@...&gt;","profile":"lelania1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Why I unschool - WAY long","postDate":"1171063934","msgId":21354,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTQwMWM3NGNhMiQ4ODEwNDhkMCQzNTAwYThjMEBLaW1iYWxsRmFtaWx5Pg=="},"prevInTopic":21296,"nextInTopic":0,"prevInTime":21353,"nextInTime":21355,"topicId":21296,"numMessagesInTopic":0,"msgSnippet":"... language is a problem for you (and others,) then you can probably understand that language that comes across to someone else as you poor baby kind of","messageBody":"<div id=\"ygrps-yiv-1536654608\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;If your point is that language you consider to be &quot;buck up&quot; kind of <br/>\n </span></blockquote>language is a<br/>\nproblem for you (and others,) then you can probably understand that language<br/>\nthat comes across to someone else as &quot;you poor baby&quot; kind of language is<br/>\njust as much of a problem for them. That&#39;s why we urge people NOT to<br/>\nengage in meta discussion. The way other posters think, the language in<br/>\ntheir own brains when they write, is just not anyone else&#39;s to control.<br/>\nIf the majority of the posting members on a list write a certain way then<br/>\nthat list will have a certain feel. It won&#39;t be ideal for everyone.&gt;&gt;&gt;<br/>\n<br/>\nI can definately understand why &quot;you poor baby&quot; kind of language would be a problem for people. It irritates me too. You are talking about &quot;poor baby&quot;, but I am not. I am talking about being kind, having empathy.  This doesn&#39;t by definition involve wallowing in misery, languishing in depression, coercing kids and excusing it, self indulgent pity trips, or any similar places that folks are extrapolating to. And I also agree with your thoughts about meta- posting. I didn&#39;t intend my post to be taken as an indictment of this list. These were thoughts generalized to a larger experience, and several times I said that I had found the tone here a relief from the unecessary drama filled antics that happened on other boards when people had differences of opinion. I don&#39;t feel that a list has to exist for any specific person at all. Nor is it realistic to expect everyone on a list to speak to and for a particular person. I wasn&#39;t suggesting those things either. I am also talking about something that has nothing to do with either tone of the list, or poor baby, which is information processing. And that is a pretty values neutral kind of thing to me. Saying that people process information differently doesn&#39;t imply that you are personally responsible for solving their information problem. Its just saying they might be having trouble processing the information. There are a lot of reasons why we choose unschooling, and among them are a belief that our education system fails a lot of kids by assuming they can all process information the same way, and then labeling the ones who don&#39;t. You brought up Holt, and I am also a fan. He has influenced several parts of my life, including the way I deliver information to clients, and the assumptions I make when people don&#39;t seem to understand things. I looked for a weblink- and yes, I did try Sandras site &gt;G&lt;- because the article I am thinking about deals with the issue of how people make changes in behavior. If anyone knows what I am talking about, it starts by addressing the age old question about childrens behavior and then branches into a discussion about general human nature. I feel like it says it better than I could.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;And that bar is in your imagination. Wherever you think some stranger has<br/>\n </span></blockquote>set some imaginary bar for the attainment of some perceived unschooling<br/>\nnirvana doesn&#39;t matter at all!! How a stranger unschools makes no<br/>\ndifference to your kids. The point is to give our kids a rich, wonderful,<br/>\njoy filled life. If you&#39;re focusing on some goal of unschooling I think<br/>\nyou should redirect your focus to your kids because they&#39;re what matters here, not whether you<br/>\ncan tick off a list of qualifications for unschooling.&gt;&gt;&gt;<br/>\n<br/>\nI don&#39;t label our lifestyle actually. And I didn&#39;t say this was where my focus was personally. What I was referring to is that there is value in the progress people make every step of the way toward a non-coercive way of existing in the world. Each step, however small it might be provides a better life for the kids and the adults. A small segment of my friends think I am nuts, and we mostly don&#39;t talk about things like bedtimes and such. But I HAVE noticed that while they clinged to what they insisted was necessary coercion, they became much more aware of the ways they used force in other areas of their lives. I doubt they would admit it, but engaging in those philosophical discussions has definately led to a difference in how they relate with their kids. I see more yes, more joy time, less control. Sure I wish they would just drop the rest of it, as I am sure people feel about some of my parenting practices. The &quot;bar&quot; for me, is the idea that there is a finish line someplace and your there. Then your done. That feels overwhelming for folks. If you can&#39;t imagine ever being all the way there, it seems like you might as well not try at all.<br/>\n<br/>\n<br/>\n*** Because finding the solution will involve an alternate way of meeting<br/>\nthe need, and you need to know what the need is first.***<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;A mom doesn&#39;t need to figure out and fix all her own hang-ups before she can<br/>\n </span></blockquote>make life better for her kids.&gt;&gt;&gt;<br/>\n<br/>\nYou are going to an extreme again of what I actually said. I am not suggesting that the way humans make changes is by doing lots of therapy while behaving poorly, and when the therapy is over finally starting to change. I think what you are saying is that life is right NOW. Not tomorrow, not when I get a better car, not when my cold ends, or any of the other millions of ways we are taught to live for a future that doesn&#39;t ever happen. And I feel exactly the same way, and part of what I see is people viewing RU as so huge, so big and insurmountable, that to get there is on par with a trip to mars. And its not. It&#39;s just a matter of all the things you listed- smiling more, even if you need to do it on command for a while. Saying yes more than you say no. Asking yourself why the tissue box can&#39;t just be emptied. Really questioning why they can&#39;t draw on the wall, choose their own food.<br/>\nI aknowledge that all of that baggage is what keeps people stuck in the can&#39;t, so that its a chicken and egg problem. When people just decide to do it differently, it often works. And then there are these annoying sticking issues. Everyone has one, and its not that a list needs to play therapist, its that we need to have humility ourselves in realizing that there will a process around some of the aspects for people. I don&#39;t live in a glass house over here, so I&#39;m not going to stone someone for having trouble letting go.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; She just needs to be nicer to her kid the<br/>\n </span></blockquote>very next time she talks to him, sees him walk by, touches him, the very<br/>\nnext time he needs her help because he pooped his pants or spilled his<br/>\njuice. The choice, in the moment, to be kind and patient and helpful is an <br/>\nimprovement that<br/>\nwill make the next moment when kindness and patience is called for easier.&gt;&gt;&gt;<br/>\n<br/>\nBeautifully said. And this kind of being in the world is infectious. It is easier to do this when we change our whole way of relating. If you try and force yourself to speak in a certain way to your kids, like a formula of sorts it isn&#39;t going to be very effective. They&#39;re smart and know when fakeness happens. When you really change the way you interact with everyone by changing your attitude and belief system about the world, then it totally changes how you relate to others and it flows naturally from you. People who aren&#39;t nice to their kids are often not nice to other people either. Usually its not that they don&#39;t want to be nice, they often don&#39;t realize the patterns they are stuck in. If we are having trouble with the kids, it helps to look wholistically at what our relating style looks like everywhere. Once again, I am preaching to the choir with you I realize. I am trying to explain better what I was intending.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; But you brought up the website as an<br/>\n </span></blockquote>example of something that makes you feel like you&#39;re needs aren&#39;t being met.<br/>\nYour whole post was about how neglected and misunderstood some<br/>\npeople feel. You gave a lot of reasons why what might work for many<br/>\npeople can&#39;t or doesn&#39;t work for someone in your situation.&gt;&gt;&gt;<br/>\n<br/>\nThen I communicated poorly because that isn&#39;t what I intended. I don&#39;t have a relationship to any particular site that prompts unmet needs.  And while I did list some barriers I see to meeting peoples needs, I didn&#39;t tell you or anyone else that I thought it was your job to solve them. Context is everything, and what I see now, is that your original post was a response to frustrations about what was happening on this list. What I responded to wasn&#39;t about this list or the particular people on it. And there is a difference between saying that all people can&#39;t get their need for information met in the same place, and saying that they feel neglected and misunderstood. I&#39;m not inserting the whiney and self debasing flavor to the description, your imagining this theoretical person saying it that way. They could just as easily be stating it without that kind of bent.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;It comes from my own observations that commiseration can sometimes help a <br/>\n </span></blockquote>person feel justified<br/>\nin how they feel and in what they&#39;re doing and is not necessarily a catalyst<br/>\nfor change. If lots of sympathy and understanding has and is helping<br/>\nsomeone make positive changes in their parenting and in their life then <br/>\nthat&#39;s GREAT!&lt;g&gt;<br/>\nIf one is not making progress then it makes sense to look for some other <br/>\nideas or tools that<br/>\nmight help more.&gt;&gt;&gt;<br/>\n<br/>\nWell, I guess then we are saying the same thing.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; &quot;I can&#39;t because I don&#39;t have a car and I don&#39;t live near a bus<br/>\n </span></blockquote>and I don&#39;t have any money anyway and I&#39;m tired, and I can&#39;t be with him<br/>\nevery minute, and ten other things are wrong and you don&#39;t understand and <br/>\nalso, you&#39;re mean.&quot;&gt;&gt;&gt;<br/>\n<br/>\nI really do get how irritating that is, and I see what you are talking about. I also see people posting questions that pretty much everyone has when they first start unschooling and hearing &quot;Are you suggesting I&#39;m neglecting my kid?&quot; followed by a  personally attacking rant. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;And by this you seem to be saying that (whatever) reply wasn&#39;t made with <br/>\n </span></blockquote>compassion<br/>\nand empathy. This is why we discourage meta discussion.&gt;&gt;&gt;<br/>\n<br/>\nNo, I wasn&#39;t referring to a specific post at all, but I realize after reading this response from you that you were.  And now I get why this felt personalized to this list for you.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;We don&#39;t get to decide how other people think and write. We get to choose<br/>\n </span></blockquote>how we &quot;hear&quot; it in our own head, and that&#39;s pretty much it.&lt;g&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nYour right. And that applies to all of us.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; Can someone &quot;read all the books,&quot; be interested enough,<br/>\n </span></blockquote>intrigued enough by the ideas that they &quot;read all the books&quot; and still not<br/>\nunderstand the very basic principles? Lists are GREAT for the day to day<br/>\nstuff, that&#39;s what they do best, help with ideas about how to go about<br/>\nmaking changes in the moment, but the internal work of understanding the<br/>\nphilosophy has to happen inside the individual. I wondered how a<br/>\nperson who read Holt and didn&#39;t get the basic premise could be helped to get<br/>\nit by someone like me, who ain&#39;t nearly as articulate and clear as<br/>\nHolt was. &lt;g&gt;&gt;&gt;<br/>\n<br/>\nI love books, and I really get stuff through books. And I love making handouts, resource lists and such. And It never fails that even though I cover every conceivable question about a given topic in these handouts, people still come back and ask me all their questions in person anyways. I really can&#39;t explain that except to say that people must not really &quot;own&quot; a concept through reading alone sometimes. I have heard similar stuff from other people about information conveyance. Talk is part of the synthesis process. As you highlighted, some folks have really irritating needs around processing their journey. Some folks just need that avenue to really get the concept for themselves.<br/>\nI also have had the experience of not getting someones writing style, or oration style. Right now, I am taking a course in which I understand neither the lectures nor the textbook. Since the professor picked the textbook, and it made sense to him, those of us who don&#39;t get him are all struggling with the text too. But it makes sense to about half the class. I wouldn&#39;t extrapolate that the lecturer or materials suck, just that they don&#39;t meet my learning style.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I know people have trouble with the day to day stuff. I think I understand <br/>\n </span></blockquote>pretty well how and why people can get<br/>\nstuck in the details. My concern when I first posted was that a couple of <br/>\noff list exchanges left me worried that some people who seemed to be <br/>\nneglecting their kids thought they understood unschooling.&gt;&gt;&gt;<br/>\n<br/>\nAnd I didn&#39;t get that that was the catalyst and focus of your question. I thought you were looking for ideas to a general kind of a problem you felt.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I&#39;m not afraid of being nice and compassionate, I am nice and compassionate.<br/>\n </span></blockquote>&lt;g&gt; If someone else doesn&#39;t think so, I&#39;m not afraid of that either. ; )&gt;&gt;&gt;<br/>\n<br/>\nI meant with respect to encouraging self pity.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;The &quot;why&quot; doesn&#39;t matter to other people. The *how not<br/>\n </span></blockquote>to* can vary. Not poking others is the important part.&lt;g&gt;&gt;&gt;&gt;<br/>\n<br/>\nThe why doesn&#39;t matter *to you* in how you go about helping someone. But when you meet that resistance, when the strategies aren&#39;t working, thats where I think rather than than write them off as a lost cause, it helps to explore other questions about how they process information, what barriers they have that might not be apparent and so on. People are rarely lacking in concrete information, but knowing how to change and make that lasting change is the bigger hurdle.<br/>\ncarrie<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Why I unschool - WAY long","postDate":"1170986161","msgId":21296,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZmYwMWM3NGJlZCQ3M2M1NzA0MCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":0,"nextInTopic":21354,"prevInTime":21295,"nextInTime":21297,"topicId":21296,"numMessagesInTopic":0,"msgSnippet":"***I have been online for over 6 years, and on different kinds of lists and they were discussion lists where people were polite to one another, sensitive to","messageBody":"<div id=\"ygrps-yiv-460551953\">***I have been online for over 6 years, and on different kinds of lists and<br/>\nthey were discussion lists where people were polite to one another,<br/>\nsensitive to the real human on the other end and still productive. ***<br/>\n<br/>\nMaybe you want specific kinds of sympathetic language?    Not every one<br/>\nneeds or wants sympathetic language.  Some people want the shortest route<br/>\nover their hurdles.   But regardless of that, I believe there is support and<br/>\nsympathy on discussion lists.<br/>\n<br/>\nAnd this comes close to meta discussion.   No matter what kind of language<br/>\none wants from a list, one has no control over how other people write or<br/>\nwhat language they use in their own head while they think.   It&#39;s really,<br/>\nreally just best for people who need a gentle, sympathetic kind of<br/>\ninteraction to find the lists where the majority of the posting members<br/>\nprovide that.<br/>\n<br/>\nIf your point is that language you consider to be  &quot;buck up&quot; kind of <br/>\nlanguage is a<br/>\nproblem for you (and others,) then you can probably understand that language<br/>\nthat comes across to someone else as &quot;you poor baby&quot; kind of language is<br/>\njust as much of a problem for them.     That&#39;s why we urge people NOT to<br/>\nengage in meta discussion.  The way other posters think, the language in<br/>\ntheir own brains when they write, is just not anyone else&#39;s to control.<br/>\nIf the majority of the posting members on a list write a certain way then<br/>\nthat list will have a certain feel.  It won&#39;t be ideal for everyone.<br/>\n<br/>\n*** Your view seemed to be that if people are having a hard time with it,<br/>\nthen maybe they shouldn&#39;t be unschooling.***<br/>\n<br/>\nNo, that&#39;s not my view.  I believe there are people who shouldn&#39;t unschool,<br/>\nbut I don&#39;t believe that includes everyone who&#39;s having a hard time.<br/>\nIf a parent can&#39;t put her kids first, can&#39;t provide an interesting life for<br/>\nher kids, *at least* more interesting than school, if a parent has lots of<br/>\nreasons why making those kinds of changes can&#39;t happen for a long time or<br/>\nwouldn&#39;t work anyway, if a parent is too depressed or unhappy and<br/>\nhas lots of reasons why that isn&#39;t changing, if kids are unhappy or<br/>\nunhealthy as a result of their mom&#39;s mental state,  then I think school <br/>\nmight be a better option<br/>\nfor the kids.  In one case that recently sparked my concern a mom threw back<br/>\nevery single suggestion for expanding her kid&#39;s world, saying it wasn&#39;t<br/>\npossible.  The kid was stressed and unhealthy and essentially<br/>\nstuck at home with a mom who seemed utterly unwilling to consider any<br/>\npossibilities other than her personal misery, and yet seemed to expect other<br/>\npeople to find some way to change the reality her life.<br/>\n<br/>\nMany unschoolers have had or are having a hard time.   That<br/>\ndoesn&#39;t make unschooling impossible.  But the mom&#39;s mental state, attitude<br/>\nand lack of flexibility and adaptability just might.<br/>\n<br/>\n*** I also found your description of depression as a &quot;comfort&quot; really<br/>\nbizarre and disturbing. ***<br/>\n<br/>\nI think in the midst of depression our belief that life sucks is confirmed<br/>\nfor us and that can be strangely comforting and satisfying.  My ideas about<br/>\ndepression are much less bizarre and disturbing than depression itself. &lt;g&gt;<br/>\n<br/>\n***It sucks when that gets translated into a belief that its all anyone else<br/>\nshould need to arrive at the same place. ***<br/>\n<br/>\nDifferent people will find different things help them, but in order to<br/>\nchange ones thinking in ways that benefit unschooling,  one needs to want to<br/>\nchange and to have some idea what to change and some idea about what one<br/>\nwants instead.   That&#39;s not the same as &quot;my way works for everyone.&quot;<br/>\n<br/>\n***All kinds of people are making unschooling a success, but whether or not<br/>\nthey would be considered really radical unschoolers at their current point<br/>\nin their journey is up for debate because the very definition of success has<br/>\nset the bar so high as to be unreached for many.***<br/>\n<br/>\nAnd that bar is in your imagination.  Wherever you think some stranger has<br/>\nset some imaginary bar for the attainment of some perceived unschooling<br/>\nnirvana doesn&#39;t matter at all!!   How a stranger unschools makes no<br/>\ndifference to your kids.    The point is to give our kids a rich, wonderful,<br/>\njoy filled life.    If you&#39;re focusing on some goal of unschooling I think<br/>\nyou should redirect<br/>\nyour focus to your kids because they&#39;re what matters here, not whether you<br/>\ncan tick off a list of qualifications for unschooling.<br/>\n<br/>\nPeople talk about radical unschooling because they love it, it&#39;s made life<br/>\nwonderful and beautiful for their kids and because they&#39;re happy to share<br/>\nthat with anyone else who&#39;d like to try for the same kid of radical<br/>\nunschooling life.   Our sharing that doesn&#39;t mean anyone else has to do it!<br/>\n<br/>\n***It is that simple to stop behavior in the moment. It isn&#39;t to keep it<br/>\nfrom coming back***<br/>\n<br/>\nThat&#39;s why advice on these lists is often to focus on the next moment with<br/>\nour kids.  If we can focus on making a game of  stacking blocks really fun<br/>\nand joyful for our kids then it gets easier to make fixing snacks really<br/>\njoyful.  If we have two beautiful moments with our kids, playing a game,<br/>\neating together, it gets easier to make helping them go potty more fun and<br/>\npeaceful or helping them get their pj&#39;s on.   When we have a day we can look<br/>\nback on where our choices led us to four or five really sweet moments with<br/>\nour kids it&#39;s easier to get up the next day and make a choice to make the<br/>\nnext moment really sweet too.  One moment at a time.<br/>\n<br/>\n***If someone is hooked on being coercive around a particular part of their<br/>\nkids life, it DOES matter why that is.***<br/>\n<br/>\nIt matters to the mom, because she might find tricks for letting go of it<br/>\nif she can identify it.   It doesn&#39;t matter to her kid why she&#39;s being <br/>\ncoercive.  What matters to her kid is that she stops.<br/>\n If a mom is forcing a child to clean his plate and<br/>\nthen comes here, frustrated that dinnertime is always such a hassle, giving<br/>\nher ideas other than &quot;clean your plate&quot; can help her kid *right now.*   Yes,<br/>\nit&#39;s cool if she figures out what her issues are that led to the<br/>\nclean-your-plate mentality, but she doesn&#39;t have to figure that out *before*<br/>\nshe can be nicer to her kid.  She can just be nicer.  Right there in that<br/>\nmoment when she wants to say, &quot;clean your plate&quot; she can instead say, &quot;are<br/>\nyou  finished, honey?&quot; and, &quot;If you get hungry later I&#39;ll make you a snack.&quot;<br/>\nIt can be done.  Hundreds of mom have done it.  Lots of moms do it dozens of<br/>\ntimes a day, make one better choice at a time.<br/>\n<br/>\n*** Because finding the solution will involve an alternate way of meeting<br/>\nthe need, and you need to know what the need is first.***<br/>\n<br/>\nA mom doesn&#39;t need to figure out and fix all her own hang-ups before she can<br/>\nmake life better for her kids.  She just needs to be nicer to her kid the<br/>\nvery next time she talks to him, sees him walk by, touches him, the very<br/>\nnext time he needs her help because he pooped his pants or spilled his<br/>\njuice. The choice, in the moment, to be kind and patient and helpful is an <br/>\nimprovement that<br/>\nwill make the next moment when kindness and patience is called for easier.<br/>\n<br/>\n***And I don&#39;t think I said at any point that Sandra Dodd was the cause of<br/>\nmy personal problems.***<br/>\n<br/>\nNo, you didn&#39;t use those words.  But you brought up the website as an<br/>\nexample of something that makes you feel like you&#39;re needs aren&#39;t being met.<br/>\nYour whole post was about how neglected and misunderstood some<br/>\npeople feel.    You  gave a lot of reasons why what might work for many<br/>\npeople can&#39;t or doesn&#39;t work for someone in your situation.   And you&#39;ve <br/>\nmentioned some imaginary<br/>\nbar of unschooling that you feel you fail to meet and it seems a little<br/>\nlike you&#39;re blaming the rest of us for either setting the bar or meeting the<br/>\nbar.  There&#39;s no bar.  The only standard that makes any difference to our<br/>\nkids is our own personal standard.   If you&#39;re feeling stressed because<br/>\nthere are people who are unschooling in a way you&#39;re not, I implore you to<br/>\nchange your focus from what other people are doing, to your own kids.  Do<br/>\nsomething really nice with your kids, make every day really sweet.  Forget <br/>\nabout calling what you&#39;re trying to do &quot;unschooling.&quot;<br/>\nCall it parenting and then be as kind and patient and respectful with your <br/>\nkids as you want people to be with you.<br/>\n<br/>\nThere is a real, beautiful change that happens in life when parents live in<br/>\nthe way radical unschooling is talked about on some of these lists.   It&#39;s<br/>\nnot a standard set by anyone else.  It comes about only because a parent<br/>\nwants it and lives in a way that makes it happen.  It&#39;s really that simple.<br/>\nIt&#39;s nothing anyone else can give you.  And you don&#39;t ever have to do it.<br/>\nYou can live any kind of life you want.<br/>\n<br/>\n***I really really want to know where this philosphical tenet comes from.***<br/>\n<br/>\nIt&#39;s not a philosophical tenet, it was just a caution.<br/>\nIt comes from my own observations that commiseration can sometimes help a <br/>\nperson feel justified<br/>\nin how they feel and in what they&#39;re doing and is not necessarily a catalyst<br/>\nfor change.   If lots of sympathy and understanding has and is helping<br/>\nsomeone make positive changes in their parenting and in their life then <br/>\nthat&#39;s GREAT!&lt;g&gt;<br/>\nIf one is not making progress then it makes sense to look for some other <br/>\nideas or tools that<br/>\nmight help more.<br/>\n<br/>\n***Why do we encourage parents to empathise with children? ***<br/>\n<br/>\nIn part to help kids be emotionally healthy, to not grow up needy and so<br/>\nthey don&#39;t have to look to others for emotional fulfillment.<br/>\nAdults on an unschooling list can&#39;t fix the emotional needs of adults who<br/>\ndidn&#39;t get filled up emotionally in their childhood.  They can offer ideas<br/>\nthat helped if they had a similar experience.  Adults who seem to be looking<br/>\nto strangers on a list for emotional fulfillment, need a kind of help that<br/>\nan unschooling list is not designed to give.<br/>\n<br/>\n***... some people appear really thick about all this, but what&#39;s really<br/>\ngoing on is that they are struggling to make this work in their life and<br/>\nhitting a lot of hurdles and asking for help.***<br/>\n<br/>\nRight.  No one is hurdle free, as far as I know.&lt;g&gt;   But sometimes the<br/>\nhurdles really are in attitude.  Sometimes when lots of different people <br/>\noffer lots of different advice<br/>\nthe reply is &quot;I can&#39;t because I don&#39;t have a car and I don&#39;t live near a bus<br/>\nand I don&#39;t have any money anyway and I&#39;m tired, and I can&#39;t be with him<br/>\nevery minute, and ten other things are wrong and you don&#39;t understand and <br/>\nalso, you&#39;re<br/>\nmean.&quot;<br/>\n<br/>\nThe truth is no one else needs to understand how hard we have it for us to<br/>\nchange how we are with our kids right now.<br/>\n<br/>\nThe car, the bus, the money, the energy level will vary from home to home<br/>\nand even from day to day and we all know that.  But anyone can make choices<br/>\nto be more respectful and kinder and more patient with their kids and if<br/>\nthey really can&#39;t for some reason then they need some kind of counseling or<br/>\nhelp other than what an unschooling list can give them.<br/>\n<br/>\nWhen a person posts they can try to be really clear about what they&#39;ve tried<br/>\nand what they feel they want to change and then the ideas they are<br/>\noffered might be more finely tuned to their particular situation.  But when <br/>\noffers of help<br/>\nand ideas are repeatedly met with &quot;Can&#39;t, won&#39;t work, not possible,&quot; then it<br/>\ngets difficult.  We can maybe help people who want help but we can&#39;t help<br/>\npeople who won&#39;t consider other possibilities.  And if a situation is really <br/>\nso<br/>\ncomplex that none of several dozen ideas can possibly help, then that isn&#39;t<br/>\nthe fault of the people who were offering ideas and it doesn&#39;t mean the<br/>\nideas won&#39;t be useful to someone else and it doesn&#39;t mean a list is failing <br/>\nin it&#39;s attempt to provide useable advice to<br/>\nsome number of people.<br/>\n<br/>\n***what works is to bring compassion and empathy into your reply.***<br/>\n<br/>\nAnd by this you seem to be saying that (whatever)  reply wasn&#39;t made with <br/>\ncompassion<br/>\nand empathy.  This is why we discourage meta discussion.   People who offer <br/>\nideas on<br/>\nthese lists ARE compassionate and empathetic or they wouldn&#39;t<br/>\nbe working to help other people get the information.  They&#39;d be out clubbing<br/>\nbunnies or something.  The reader supplies the tone in her own head<br/>\nand based on her own psychology and it&#39;s not realistic to think that the<br/>\nwriter can or should have that same psychology, or has a responsibility to<br/>\nassess the psychology of the reader.   One persons&#39; &quot;nice&quot; is another&#39;s <br/>\n&quot;useless.&quot;  One person&#39;s &quot;mean&quot; is another&#39;s &quot;perfect.&quot;<br/>\n<br/>\nWe don&#39;t get to decide how other people think and write.  We get to choose<br/>\nhow we &quot;hear&quot; it in our own head, and that&#39;s pretty much it.&lt;g&gt;<br/>\n<br/>\nIf a person thinks a list could use more sympathetic, compassionate words<br/>\nthen<br/>\nthey should supply them.  I can&#39;t stress this enough.   Meet the need.<br/>\nBecause the<br/>\ntruth is that many of the lists that typically get categorized as &quot;hostile&quot;<br/>\nare the most active, vibrant lists, full of the best information.  Those so<br/>\ncalled &quot;hostile&quot; posters are the ones taking the time to get information<br/>\ntogether and pass it around and offer it up to anyone who wants it.<br/>\nIf there&#39;s a need for another kind of list then whoever believes that can<br/>\nput the time and energy into<br/>\nmaking it and maintaining it that those uncaring, hostile people on the<br/>\nother lists<br/>\nhave done, and fill the need. &lt;g&gt;<br/>\n<br/>\n***.I have, ironically, wondered the same about the vocal members of these <br/>\nforums in explination of folks agressiveness. I have thought it might <br/>\nreflect defensiveness, or a lack of confidence in their own parenting or <br/>\ndecisions.***<br/>\n<br/>\nYou&#39;re referring to people as aggressive, defensive, lacking confidence,<br/>\nimpatient, not compassionate, unsympathetic, and you&#39;re trying to convince<br/>\nus that some of us need to be nicer?   ; )  &lt;g&gt;<br/>\n<br/>\n***All I can suggest is to keep a copy of the pat reply to the most common<br/>\nquestions and send it out with any additions you have that are specific. ***<br/>\n<br/>\n I think most folks try to answer each post they have<br/>\ntime to answer with consideration for what that poster has just<br/>\nwritten.   I don&#39;t think I have ever seen someone just write,<br/>\n&quot;Yeah, yeah, go read here and don&#39;t bother me with this.&quot; &lt;g&gt;<br/>\n<br/>\n***It was people may appear to be &quot;not getting it&quot; when actually they aren&#39;t<br/>\ngetting how to apply solutions described for other people to their personal<br/>\nsituation. ***<br/>\n<br/>\nI asked how people could &quot; read all the books&quot;  (Every John Holt book?<br/>\nReally?) Valerie&#39;s book?  Sandra Dodd&#39;s, Rue Kream&#39;s, Win and Bill Sweet&#39;s?<br/>\nAll the rest?   Can someone &quot;read all the books,&quot; be interested enough,<br/>\nintrigued enough by the ideas that they &quot;read all the books&quot; and still not<br/>\nunderstand the very basic principles?    Lists are GREAT for the day to day<br/>\nstuff, that&#39;s what they do best,  help with ideas about how to go about<br/>\nmaking changes in the moment, but the internal work of understanding the<br/>\nphilosophy has to happen inside the individual.    I wondered how a<br/>\nperson who read Holt and didn&#39;t get the basic premise could be helped to get<br/>\nit by someone like me, who ain&#39;t nearly as articulate and clear as<br/>\nHolt was. &lt;g&gt;<br/>\n<br/>\nI know people have trouble with the day to day stuff.  I think I understand <br/>\npretty well how and why people can get<br/>\nstuck in the details.  My concern when I first posted was that a couple of <br/>\noff list exchanges left me worried that some people who seemed to be <br/>\nneglecting their kids thought they understood unschooling.<br/>\n<br/>\n***I don&#39;t feel we need to be responding from a place of fears about what<br/>\nmight happen if we are too nice, too compassionate etc...***<br/>\n<br/>\nI&#39;m not afraid of being nice and compassionate, I am nice and compassionate.<br/>\n&lt;g&gt;  If someone else doesn&#39;t think so, I&#39;m not afraid of that either.  ; )<br/>\n<br/>\n***And when someone comes here seeming all wedded to their coercive<br/>\npractices, you don&#39;t know how far they&#39;ve already come in their journey.***<br/>\n<br/>\nHow far they&#39;ve come isn&#39;t the issue to strangers on an unschooling list!<br/>\nWhere they want to go is the issue on an unschooling list.   We don&#39;t need<br/>\nto tell people they&#39;ve made progress because they already know that.  We<br/>\nhonestly don&#39;t need to know where an individual has come from.  That<br/>\nindividual needs to know where she wants to go.  Lists can help with<br/>\nstrategies and ideas.<br/>\n<br/>\nI have a weird thing (no, not my kid, a different weird thing&lt;g&gt;)  When<br/>\nI was little I had this terrible case of hives.  They were huge, big around<br/>\nas tennis balls.  I had them all over including the bottoms of my feet.  My<br/>\nmom forbid me to scratch them for some freaky reason only my paranoid mom<br/>\nknew.  She taped my hands and put socks over them so I couldn&#39;t scratch.<br/>\nShe watched me like a hawk when I wasn&#39;t taped up.  I learned to take any<br/>\nbrief moment I had and jab the worst of the itchy spots hard with my<br/>\nfingernail before I got swatted.  That episode in my life lasted three or<br/>\nfour days, at most.<br/>\n*To this day* I want to poke any bump<br/>\nI see.  I want to reach out and poke a mosquito bite on the arm of a total<br/>\nstranger in the checkout line at the grocery store.   But no one really<br/>\nneeds to know *how* I got my weirdness.  They just need me to NOT be weird<br/>\non them.  Knowing why I want to poke isn&#39;t nearly as important as just not<br/>\npoking.&lt;g&gt;  And in order not to poke unsuspecting strangers I bite my own<br/>\nfinger, or jam my finger into the palm of my opposite hand or otherwise give<br/>\nmy finger something else to do. (up the nose!)<br/>\nThe &quot;why&quot; doesn&#39;t matter to other people.  The *how not<br/>\nto* can vary.  Not poking others is the important part.&lt;g&gt;<br/>\n<br/>\nIf someone is coercive with her kid, why she&#39;s coercive isn&#39;t as<br/>\nimportant to the kid as just stopping.<br/>\n<br/>\nDeb Lewis, who freakishly enjoys hives and mosquito bites because she can<br/>\nscratch big holes in them now and no one slaps her.&lt;beg&gt;</div>","specialLinks":[]}],"prevTopicId":21338,"nextTopicId":21248}}