{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":442033011,"authorName":"Gwen Montoya","from":"Gwen Montoya &lt;lifeisjustthis@...&gt;","profile":"willow_selene","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: question about x box and turn taking","postDate":"1297993858","msgId":46165,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrQTRZTDJxMnFXdG9aNnk3d3RvSENrUFZQcVF6X1NwVDlVPXVzNUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGlqanEybytzMms0QGVHcm91cHMuY29tPg==","referencesHeader":"PEFBTkxrVGlrMjNyQ1ZQUDJfaUt6MWVYTTBhYWR5LWtEMjBMaENXSkctWWlGZkBtYWlsLmdtYWlsLmNvbT4JPGlqanEybytzMms0QGVHcm91cHMuY29tPg=="},"prevInTopic":46157,"nextInTopic":0,"prevInTime":46164,"nextInTime":46166,"topicId":46153,"numMessagesInTopic":0,"msgSnippet":"Can you brainstorm on games they can play together? Many games are two player and some are up to four player. Maybe if two take their turn at the same time,","messageBody":"<div id=\"ygrps-yiv-551337667\">Can you brainstorm on games they can play together? Many games are two<br/>\nplayer and some are up to four player. Maybe if two take their turn at the<br/>\nsame time, that would free up some more time for your 14 year old?<br/>\n<br/>\nGwen<br/>\n<br/>\nOn Thu, Feb 17, 2011 at 10:40 AM, plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a><br/>\n<blockquote><span title=\"ireply\"> &gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; mari teaches &lt;mari.teaches@...&gt; wrote:<br/>\n&gt; &gt;&gt; the video games have never ever been limited, so i still do not<br/>\n&gt; understand<br/>\n&gt; &gt; why is my 14 y/o acting this way, he is the only one acting that way.<br/>\n&gt; **************<br/>\n&gt;<br/>\n&gt; &quot;Having to&quot; share can have the same effect as limiting, though, which is<br/>\n&gt; why many unschoolers have multiple game systems ;) Since its probably not<br/>\n&gt; possible to get another xbox right away, brainstorm some ideas with your<br/>\n&gt; guys for right now. Given the situation, it might be helpful for the 14yo to<br/>\n&gt; have &quot;turns&quot; that last a whole day or even a whole week! That might sound<br/>\n&gt; like a lot, but it could be worth it to the other kids if you put lots of<br/>\n&gt; energy into helping them find other things to do in the interim.<br/>\n&gt;<br/>\n&gt; If the overheating thing turns out not to be a problem (and I have No<br/>\n&gt; idea), see if the 14yo will switch to a different sleep/wake cycle than the<br/>\n&gt; rest of the family so that he can have big chuncks of time when everyone<br/>\n&gt; else is asleep. That was, esentially our solution when Ray was 14 - he took<br/>\n&gt; the vampire shift, as it were, and could play games as long as he wanted<br/>\n&gt; that way.<br/>\n&gt;<br/>\n&gt; ---Meredith<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: question about x box and turn taking","postDate":"1297968024","msgId":46157,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqanEybytzMms0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGlrMjNyQ1ZQUDJfaUt6MWVYTTBhYWR5LWtEMjBMaENXSkctWWlGZkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":46156,"nextInTopic":46165,"prevInTime":46156,"nextInTime":46158,"topicId":46153,"numMessagesInTopic":0,"msgSnippet":"... ************** Having to share can have the same effect as limiting, though, which is why many unschoolers have multiple game systems ;) Since its","messageBody":"<div id=\"ygrps-yiv-1075679981\">mari teaches &lt;mari.teaches@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; the video games have never ever been limited, so i still do not understand<br/>\n&gt; why is my 14 y/o acting this way, he is the only one acting that way.<br/>\n </span></blockquote>**************<br/>\n<br/>\n&quot;Having to&quot; share can have the same effect as limiting, though, which is why many unschoolers have multiple game systems ;) Since its probably not possible to get another xbox right away, brainstorm some ideas with your guys for right now. Given the situation, it might be helpful for the 14yo to have &quot;turns&quot; that last a whole day or even a whole week! That might sound like a lot, but it could be worth it to the other kids if you put lots of energy into helping them find other things to do in the interim.<br/>\n<br/>\nIf the overheating thing turns out not to be a problem (and I have No idea), see if the 14yo will switch to a different sleep/wake cycle than the rest of the family so that he can have big chuncks of time when everyone else is asleep. That was, esentially our solution when Ray was 14 - he took the vampire shift, as it were, and could play games as long as he wanted that way. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] question about x box and turn taking","postDate":"1297933165","msgId":46155,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0NzMwMi4zMDgyMC5xbUB3ZWI4NjIwMi5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PEFBTkxrVGlrMjNyQ1ZQUDJfaUt6MWVYTTBhYWR5LWtEMjBMaENXSkctWWlGZkBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrMjNyQ1ZQUDJfaUt6MWVYTTBhYWR5LWtEMjBMaENXSkctWWlGZkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":46154,"nextInTopic":46156,"prevInTime":46154,"nextInTime":46156,"topicId":46153,"numMessagesInTopic":0,"msgSnippet":"The newer xboxes have a better cooling system. We ve not had a problem with either of the two that we have no matter how long they are left on. We don t have","messageBody":"<div id=\"ygrps-yiv-2137103134\">The newer xboxes have a better cooling system. We&#39;ve not had a problem with <br/>\neither of the two that we have no matter how long they are left on. We don&#39;t <br/>\nhave the newest xbox, the kinect system, but our two older models seem to be <br/>\nfine with high use.I would relax about it. Here&#39;s an article about xboxes <br/>\nfreezing that might help you to figure out the problem: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.gxpblog.com/technical-support/does-your-xbox-360-keep-freezing/.\">http://www.gxpblog.com/technical-support/does-your-xbox-360-keep-freezing/.</a> I <br/>\nwould absolutely not have that be part of your worry. Step back from that aspect <br/>\nof the xbox and just work to deal with how they can all play together or <br/>\nalternately without coming to blows. <br/>\n<br/>\n<br/>\nIts a new thing, its a new and very, very cool thing. Come up with ways so that <br/>\nyour oldest son gets to play as much as he wants to. Talk to him about times <br/>\nwhen he can play without being pushed off by the younger two. Sit in the room <br/>\nwith them, if you can, and be the calmer, the distracter, the one who can help <br/>\nto smooth over rougher moments. Be very, very present. It is this really, really <br/>\ndesirable new thing. Everybody wants time on it, everybody wants to explore the <br/>\nxbox. Negotiating that will be a difficult process. <br/>\n<br/>\n<br/>\nWe have two xboxes and two children. It was 2 years before Simon and Linnaea <br/>\ndecided that they really wanted a second one. They&#39;d discussed it before, but it <br/>\ntook 2 years for them to decide that they wanted a second one enough for it to <br/>\nhappen. With your three, maybe a second xbox is a more pressing need. Maybe as <br/>\npart of your move you can see if you can come up with the $300.00 dollars it <br/>\nwould take to get a second xbox--without kinect or with a smaller hard <br/>\ndrive--and set it up on one of the televisions with a ps3 on it. That way there <br/>\nare more options then waiting for a turn that never feels long enough. <br/>\n<br/>\n<br/>\nHaving a park day where your eldest gets to stay home and play without <br/>\ninterruption is fabulous. When you come home it will help a lot if rather than <br/>\nhaving the younger two quickly come bouncing in asking for a turn, if you all do <br/>\nsomething else and let your eldest disengage from what he&#39;s doing at a much <br/>\nslower pace. It may also help if you call him and tell him when you are on your <br/>\nway home so that he can at least be kind of braced for the intrusion into his <br/>\nabsorption. <br/>\n<br/>\n<br/>\nAre there games for the PS3 that any one of your guys have been wanting to get? <br/>\nIf you got that could it pull away at least one person&#39;s interest in the xbox? <br/>\nAre there special things that one of them likes to do with you? Can you offer to <br/>\ndo that while someone else is having a go on the xbox? Protect each persons <br/>\nengagement with the xbox by offering other engagements with you or with other <br/>\ncool things. Swooping in and taking the two younger boys out so that the older <br/>\nboy can have time on the xbox is a really good thing to do. Go out and get ice <br/>\ncream somewhere, or go for a walk or a play with someone else. And work it so <br/>\nthat the younger two can have time on the xbox each as well. Talk to the eldest <br/>\nabout a game he&#39;d like to play on the PS3 or about doing something else for <br/>\nlittle while so that his brothers also get time to explore the new and cool <br/>\nthing without being nudged.<br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":196677035,"authorName":"Tina Tarbutton","from":"Tina Tarbutton &lt;tina.tarbutton@...&gt;","profile":"dravensmomhome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] question about x box and turn taking","postDate":"1297909532","msgId":46156,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluUW5aPU5uaGF4d0E9S3FfcXNMcGpmaU9OYk8yQkw0MGlzNz16MEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEFBTkxrVGlrMjNyQ1ZQUDJfaUt6MWVYTTBhYWR5LWtEMjBMaENXSkctWWlGZkBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrMjNyQ1ZQUDJfaUt6MWVYTTBhYWR5LWtEMjBMaENXSkctWWlGZkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":46155,"nextInTopic":46157,"prevInTime":46155,"nextInTime":46157,"topicId":46153,"numMessagesInTopic":0,"msgSnippet":"I can t help with the sharing issue, because I only have 1 child, however I do not believe the overheating issue is as much of an issue anymore, at least not","messageBody":"<div id=\"ygrps-yiv-1759347335\">I can&#39;t help with the sharing issue, because I only have 1 child, however I<br/>\ndo not believe the overheating issue is as much of an issue anymore, at<br/>\nleast not in my house.  Draven turns it on when he wakes up, and falls<br/>\nasleep to it (on netflix) at night.  It turns itself off 3 hours after he<br/>\nstops using the controller which is the only reason it&#39;s not on 24 hours a<br/>\nday.<br/>\n<br/>\nIt was originally my mothers system, and didn&#39;t get played often, however<br/>\nhe&#39;s had it since mid December and with the exception of a few days it&#39;s<br/>\nbeen on for 18+ hours a day every day.  We&#39;ve never had a problem.<br/>\n<br/>\nConsidering that you have not only the warranty that came with the system,<br/>\nbut also it sounds like you bought the extended warranty, I would just let<br/>\nthat issue go.  If it does overheat (which I doubt) then they&#39;ll be without<br/>\nit for a few days while it&#39;s repaired/replaced.  Possibly warn them of that<br/>\nonce up front, then let that issue go.<br/>\n<br/>\nHope someone else can help you with the sharing issue.<br/>\n<br/>\nTina</div>","specialLinks":[]},{"userId":187853867,"authorName":"aldq75","from":"&quot;aldq75&quot; &lt;aldq75@...&gt;","profile":"aldq75","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: question about x box and turn taking","postDate":"1297907859","msgId":46154,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqaHZhaitrYjR2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGlrMjNyQ1ZQUDJfaUt6MWVYTTBhYWR5LWtEMjBMaENXSkctWWlGZkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":46153,"nextInTopic":46155,"prevInTime":46153,"nextInTime":46155,"topicId":46153,"numMessagesInTopic":0,"msgSnippet":"The newer Xbox units are supposed to shut themselves off when they start to get too hot. We have had a Kinect system since the end of November. Some days, it","messageBody":"<div id=\"ygrps-yiv-903278568\">The newer Xbox units are supposed to shut themselves off when they start to get too hot. We have had a Kinect system since the end of November. Some days, it is on for 18 hours and we haven&#39;t had any overheating issues.<br/>\n<br/>\nCould there be something else bothering your 14 yo?<br/>\n<br/>\n<br/>\nAndrea Q <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, mari teaches &lt;mari.teaches@...&gt; wrote:<br/>\n&gt; and how can i make peace between the brothers with the<br/>\n&gt; game systems issue, and alfredo&#39;s aggression towrds his his brothers over<br/>\n&gt; the games systems, when theres plenty for him to do?<br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":416719225,"authorName":"mari teaches","from":"mari teaches &lt;mari.teaches@...&gt;","profile":"mari.teaches@ymail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"question about x box and turn taking","postDate":"1297892871","msgId":46153,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrMjNyQ1ZQUDJfaUt6MWVYTTBhYWR5LWtEMjBMaENXSkctWWlGZkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":46154,"prevInTime":46152,"nextInTime":46154,"topicId":46153,"numMessagesInTopic":0,"msgSnippet":"Hello, first I want to say I am bad at english, my written english is better than voice english, which i am extremely happy you guys can t hear. if i say ","messageBody":"<div id=\"ygrps-yiv-591122372\">Hello, first I want to say I am bad at english, my written english is better<br/>\nthan voice english, which i am extremely happy you guys can&#39;t hear. if i say<br/>\nsomething please don&#39;t assume, please ask. I know what i mean and want to<br/>\nsay but how it comes out is different. i write here because i have had a 3<br/>\nday break of headaches and migraines and dont want to post to regular hs<br/>\ngroups and get stressed and argue about why its horrible to limit what<br/>\nchildren want. because i do not limit my boys game play.  so here goes.<br/>\n<br/>\nSo we are new x-boxers we have had ps3 well 2 of them for many years since<br/>\nthey came out. and we ust got back our taxes and we decided that we would<br/>\nbuy a whole new system and even though we dont need a new tv because we have<br/>\nmany in back home we were not going to buy another tv. but ok so here is the<br/>\nthing, this weekend we went and got the x box and a new tv and a surround<br/>\nsystem for it, thats just how we do things lol. and a few games, anyways we<br/>\nspent wow alot.<br/>\n<br/>\nmy question is I seen others i think here whom that have the xbox and since<br/>\nthis is my first x box system and last time when i worked at circuit city I<br/>\nhave known them for the ring of death when over heated? so anyways when we<br/>\ncame home with the surprise for the boys who thought we went food shopping<br/>\nafter the initial shocked and awwed, I explained that the x box needs times<br/>\nof off time because they over heat and its a $400 unit, though with warrenty<br/>\nand boughten warrenty i dont want the unit to die. of course they said ok<br/>\nand we have way too many other things to entertain us and we will share and<br/>\ngive it off times too.<br/>\n<br/>\nok here is the thing, we have had the unit 3 days, 3 boys trying  to share<br/>\nit which is very hard for them. my 14 year old is starting to fight with the<br/>\nyoungers and manipulate them and takes up all the time and then the system<br/>\nis getting really hot, needs to be turned off and then after an hour or two<br/>\nthe next child can go on, but with my 14 year old hovering over their back<br/>\nand trying to force them off or deliberately makes them loose.<br/>\n<br/>\ni try to continue to do as always getting my 14 year old to engage in other<br/>\nthings with me or the ps3 or his air soft guns or the dog, he wants no part<br/>\nof it. i know the x box is very new to them as they have not had the x box,<br/>\nbut they are certainly not new to video games, we have 2 ps3&#39;s 1 psp, had<br/>\nthe wii(until it was stolen), and had the game cube.<br/>\n<br/>\nthe video games have never ever been limited, so i still do not understand<br/>\nwhy is my 14 y/o acting this way, he is the only one acting that way. also i<br/>\nam  very worried about the system being on for so long, especially between<br/>\nthe 3 boys and then when dad is on on sundays as thats his only time to play<br/>\nfor a few hours.   last night the system already froze. after spending a<br/>\nhefty $1200 for the whole system and games and such i dont want the unit to<br/>\nbreak. its not like the ps3 where as that thing in our house the boys plays<br/>\nit all the time, it maybe is off for 2-5 hours per 24 hours.<br/>\n<br/>\ni don&#39;t know what to do because i asked them nicely today before i went to<br/>\nmy physical therapy to please turn off the x box and use the ps3 and other<br/>\ngame systems and other entertainments and let the x box rest it was on for 5<br/>\nhours straight already. they turned it off right before i left, when i came<br/>\nback lol, they had the ac on high blast freezing house poor baby bearded<br/>\ndragons were cold even with their lights, fan on the x box and were playing<br/>\nit. i asked them when it was turned on, they said as soon as the garage<br/>\ndoors closed behind me. i said well, please turn off the ac and help me get<br/>\nthe dragons warm, they were so cold they were hudled on top of eachother.<br/>\n<br/>\ni do not want to limit the x box because i have never limited any games,<br/>\nwhat message would that send to them? but at the same time i want to protect<br/>\nour very costly investment and not have to depend on having to deal with the<br/>\nover heating issues and such. its just hard because i dont limit anything of<br/>\nmy boys so i dont feel comfortable already but how can i also protect the<br/>\nunit and our money.<br/>\n<br/>\ndad is flying back home sunday,  to finish getting the rest of our stuff to<br/>\nhopefully finish this crazy move, so that we can finally hook back up the<br/>\n2nd ps3, that way there will be again the 2 ps3&#39;s usable and now the xbox<br/>\ntoo all on different tv&#39;s, but it still seems they argue over who gets to<br/>\nplay when and for how long. mainly my 14 y/o argues, and if i am not there<br/>\nto make sure he isnt physically hurting his brothers and he will do anything<br/>\nat all cost to them to get what he wants no matter what, even if he has<br/>\nfreely access to 100 things 24/7. so it becomes an issue, now today he is<br/>\ntelling me im stupid and i dont know anything about game system because i<br/>\ndont &quot;play&quot; them. i do, lol if i got the chance, but they are just on the<br/>\nsystems so much and i cerainly am not the energizer bunny to wait out my<br/>\nturn, so i gave up video games and stick with the computer. he said this<br/>\nbecause i said the x box needs a break, there is the ps3 to use until the x<br/>\nbox cools down inside, even after the blasting ac iced house and the fan in<br/>\nit this morning, it was still warm and not cooling down. though im worried<br/>\nfor the baby dragons? i will have to see how to increase their heat i guess?<br/>\n<br/>\nany help i can do nicely for them, tomorrow is supposed to be park day,<br/>\nwhich the boys really look forward to and ask for, i doubt my 14 y/o will<br/>\nwant to go. which is fine, but i just dont know about the x box and how all<br/>\nthis game constant play may make it break because its not getting enough<br/>\ncool down time? i wish it was like the ps3 lol, then i would not have to<br/>\ndeal with that issue, just the taking turns ordeal. i am not sure if we will<br/>\nbe getting another x box anytime soon. we only had 2 ps3&#39;s because my boys<br/>\ndad helped someone sell his car and he got a brand new $600 ps3 out of it<br/>\nwith a few games lol, and the other we bought. if we do, it will not be<br/>\nuntil x mas, we certainly are not rocker feller.<br/>\n<br/>\nearly this afternoon he almost yanked my 10 y/o out of the room, just about<br/>\nhitting his head off the door, off the x box while he was playing the kinect<br/>\npart saying he wants to play and he didnt want to wait any longer. he was on<br/>\nit right before my 10 y/o got on . he actually gets the longest play time<br/>\nthan the other boys do, because of his constant nagging at them, argueing at<br/>\nthem, and disruppting them, they get tired of it and just get off. i dont<br/>\nwant that to happen either how can they all have their wanted time on the x<br/>\nbox? i just dont understand, seriously i do not limit games at all, and they<br/>\nhave free access to them when they want. yet my oldest acts like he has<br/>\nnever seen one, getts aggresive, and i want them to be respectful or at<br/>\nmindful or eachtohers wants and needs. sorry this is extremely long<br/>\n<br/>\nany help from other people with x boxes about the heating issue and please<br/>\ninform me of them? and how can i make peace between the brothers with the<br/>\ngame systems issue, and alfredo&#39;s aggression towrds his his brothers over<br/>\nthe games systems, when theres plenty for him to do?<br/>\n<br/>\n-- <br/>\nWould you like your blog spot-lighted for FREE? email<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mari@...\">mari@...</a><br/>\n<br/>\nMari<br/>\nPresident~ <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ihn-brevard.com\">http://www.ihn-brevard.com</a><br/>\nIndependent Homeschoolers Network<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sprinkle-of-fun.blogspot.com\">http://www.sprinkle-of-fun.blogspot.com</a> facebook/twitter on blog.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.childworkboxes.blogspot.com\">http://www.childworkboxes.blogspot.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":46145,"nextTopicId":46163}}