{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":101,"messages":[{"userId":414490706,"authorName":"sarahrandom78","from":"&quot;sarahrandom78&quot; &lt;bdb1978@...&gt;","profile":"sarahrandom78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: demonstrating vs communicating","postDate":"1311962626","msgId":47074,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowdXNtMit2a3Y1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGowdDE3cCthbDk1QGVHcm91cHMuY29tPg=="},"prevInTopic":47073,"nextInTopic":47075,"prevInTime":47073,"nextInTime":47075,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"I think the main problem here is wording. You have shown in your letter that you simply are using different words than I do. That s fine. Demonstration","messageBody":"<div id=\"ygrps-yiv-1866289237\">I think the main problem here is wording. You have shown in your letter that you simply are using different words than I do. That&#39;s fine. Demonstration obviously doesn&#39;t mean the same thing to you as it does to me. I love my kids, so I bring them food when I notice they haven&#39;t been eating much because they&#39;ve been really engaged in an activity. TO ME (in my head) I think of it as a loving gesture. TO THEM, they are probably just thinking &quot;oh, hey, I am hungry&quot; All I was doing is saying that these are the sorts of things I do that IN MY MIND are loving gestures, and the ways that I show love. I didn&#39;t realize that demonstration was the wrong word to use. It&#39;s also a way that, in my mind, shows love when I help my son, who at this point in time and with this one thing, has been unable to come up with a solution for. So instead of watching him break down into tears and screaming, I try to engage with him during his short breaks. I&#39;m not sure where everyone got the idea that he&#39;s opposed to this, maybe they are confusing me with another poster. Yes he&#39;s opposed to taking BREAKS, maybe because he thinks BREAKS are too long. <br/>\n<br/>\nThe part about me responding to my daughters drawings wasn&#39;t a complete picture. She asks, almost every time she shows me a picture &quot;Do you think I&#39;m getting better?&quot; Or &quot;Do you think this is good?&quot; So I feel like I need to give her something more than just &quot;mmmhmmm&quot; A lot of time I think the pictures look exactly the same. I took many classes over the years in art, and am pretty good at making drawings look realistic, so this is why she asks my opinion &lt;--- she has told me this, I&#39;m not assuming it. Sometimes I&#39;m not sure how I should respond at all. If I&#39;m honest and say, &quot;It could use a little more work&quot; she gets her feelings hurt and says she&#39;s never going to be a good artist. This is completely not true, she shows a lot of natural talent. However if it really isn&#39;t very good (sometimes I have mistaken a wolf for a cat and vice versa) what should I say? If I&#39;m truthful, I hurt her feelings, If I&#39;m not truthful, well that is what you are telling me not to be. How would you deal with this situation? <br/>\n<br/>\n&quot;Okay, so for you, &quot;demonstrate love&quot; has a different connotation because you didn&#39;t get the attention you wanted. You&#39;d have been happy with even a demonstration - you think. What you&#39;re not seeing is that it is entirely possible that from your Mom&#39;s perspective she was working her tail off demonstrating her love by doing the housework. That&#39;s the difference between demonstraing love and communicating love - your mom was so busy demonstrating she failed to actually communicate and as a result you felt unloved.&quot;<br/>\n<br/>\nNo I actually know, from conversations with my mom, that she just felt compelled to have a clean house. I know she now wishes she would have come outside and watched me, ride my bike, shoot hoops, have a picnic with me, but at the time she was WAY more focused on having a clean house.  Again, my wording is apparently off. If my mom would have come outside and watched me do these things, I would have felt loved. Her and my dad came to all of my games when I was on the Pom Squad, and I remember at 16 thinking, this can&#39;t be fun for them, but I FELT loved because even though I thought that they weren&#39;t having fun, it meant a lot to have them there supporting me. I guess to me, seeing my parents sacrifice their time equaled love to me. Now that I&#39;m older my mom has shared with me that those were the best times, coming to my games. Demonstrating and communicating are synonyms in my mind, I guess my grasp of English needs help ;) <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n&gt;<br/>\n&gt;  &quot;sarahrandom78&quot; &lt;bdb1978@&gt; wrote:<br/>\n&gt; &gt;I simply time my conversation for when there are gaps in his game, I&#39;m excited to hear about what he&#39;s doing, but it also helps give his eyes a quick break.<br/>\n&gt; *******************<br/>\n&gt; <br/>\n&gt; There&#39;s a good point in that statement which is running the risk of getting lost, here, and its that simply engaging with your child in a warm, friendly, supportive sort of way already does the work of giving a child&#39;s eyes a break. Its not the sort of thing that needs to be planned or even sought after - although parents do sometimes need to learn the special courtesy of games involving waiting and looking for the pauses. <br/>\n&gt; <br/>\n&gt; &gt; You are not understanding me correctly. I&#39;m not going in there with food saying &quot;Look at how Mother-of-the-year I am today, this is nurturing, can we spell nurturing?&quot; My God, I&#39;m simply saying that it is a demonstration of love when I bring him food.<br/>\n&gt; *************************<br/>\n&gt; <br/>\n&gt; But why &quot;a demonstration&quot;? It&#39;s not an attack, its an opportunity to think about how words can shape your assumptions and underlying expectations. You don&#39;t have to participate ;) It&#39;s not a one-on-one conversation - there are over two thousand list members, after all.<br/>\n&gt; <br/>\n&gt; So why not say &quot;its loving and kind to bring food&quot;? Why go for a word like &quot;demonstrate&quot; which implies that you expect your child to notice something in particular? That might be an important question - parents often fall into the trap of expecting kids to notice something specific and then experience a specific reaction, like gratitude. <br/>\n&gt; <br/>\n&gt; Here&#39;s an example - some people say &quot;I love you&quot; as a demonstration of love and expect a reply of &quot;I love you, too&quot;. Adult relationships can get ugly when one person is seeing &quot;I love you&quot; as a demonstration and the other isn&#39;t. Parent-child relationships can get ugly when parents feel like they&#39;re doing a lot of demonstrating and kids aren&#39;t responding in ways they expect. <br/>\n&gt; <br/>\n&gt; &gt;&gt;I am diverting his focus for a few seconds because I love him. The idea that that would build mistrust in a relationship is silly.<br/>\n&gt; ********************<br/>\n&gt; <br/>\n&gt; It&#39;s not silly, its a possible (and common) gap in parental expecations and as such its worth discussing. <br/>\n&gt; <br/>\n&gt;  Maybe you&#39;re just engaging with your kid and one of the side effects is that it helps him rest his eyes. But that&#39;s not the way you&#39;ve phrased it - you&#39;ve made it sound like engaging with him is secondary to the agenda of getting him to do something you want him to do - and That can build mistrust in a relationship just as surely as someone regularly saying &quot;I love you&quot; in order to get the reply.<br/>\n&gt; <br/>\n&gt; &gt;&gt;&gt;&gt; &quot;You&#39;re &quot;showing him&quot; you&#39;re interested rather than being interested. And it isn&#39;t honest interest. It isn&#39;t spontaneous interest.&lt;&lt;&lt;&lt;&lt;&lt;&lt; <br/>\n&gt; <br/>\n&gt; &gt; I gotta be honest here, this just pissed me off and here&#39;s why. When I was little I would want my mom to come outside and watch me shoot hoops, but 9 times out of 10 she was too busy with housework. I would have rather had her come out and &quot;showed interest&quot; regardless if she was &quot;honestly interested&quot; or not. <br/>\n&gt; *************************<br/>\n&gt; <br/>\n&gt; Okay, so for you, &quot;demonstrate love&quot; has a different connotation because you didn&#39;t get the attention you wanted. You&#39;d have been happy with even a demonstration - you think. What you&#39;re not seeing is that it is entirely possible that from your Mom&#39;s perspective she was working her tail off demonstrating her love by doing the housework. That&#39;s the difference between demonstraing love and communicating love - your mom was so busy demonstrating she failed to actually communicate and as a result you felt unloved. <br/>\n&gt; <br/>\n&gt; That&#39;s the exact distinction Joyce is making, the difference is that as far as you know, you&#39;re communicating affection and care to your son - and if he&#39;s responding with warmth and happiness that&#39;s probably true. The thing is, unschooling isn&#39;t the sort of thing that works by simply replicating what one parent does in another family. It&#39;s important to pull apart Why something works to see the underlying priciples. <br/>\n&gt; <br/>\n&gt; &gt;&gt; My 12yo draws about 25 (literally) pictures of wolves, cats and dogs a day. Am I honestly interested? Probably not. I think it would be cruel however to say &quot;Yep, another wolf drawing, so what&quot; I prefer to take note of details and comment on them &quot;Wow, I can see that your drawings are getting more realistic&quot; <br/>\n&gt; *************************<br/>\n&gt; <br/>\n&gt; So, here&#39;s a good example of how what works in terms of engaging and communicating with one person wouldn&#39;t work with another - my 10yo would tell me &quot;you can stop talking now&quot; after more than a brief comment. But I *do* want to connect with her, share her joys and delight in her interests so I smile and nod when she shows me her stacks of daily drawings and paintings. I find ways to express my pleasure in her company in small, unobtrusive ways. What&#39;s working in either case is that mom is taking some time to value what is important to her child - even if its not the most exciting or important thing in the world to mom. <br/>\n&gt; <br/>\n&gt; &gt;&gt;Now what am I supposed to do when he breaks down crying because he can&#39;t get a higher score<br/>\n&gt; *****************<br/>\n&gt; <br/>\n&gt; Mo does this from time to time. It reminds me of the fact that I wasn&#39;t allowed to cry over much of anything as a child - I&#39;m glad she knows she can cry in front of me. <br/>\n&gt; <br/>\n&gt; If engaging with your son during natural game pauses also helps him have more stamina for his games, that&#39;s a good thing twice over! At the same time, I don&#39;t want to leave other parents with the idea that getting a child to take breaks will automatically result in more stamina and less tears. Mo is very good at taking breaks, for instance, and yet she does fall apart from time to time when a game gets tough. She doesn&#39;t want reassurance or comfort or suggestions at those times, she wants to have a good cry.<br/>\n&gt; <br/>\n&gt; &gt; My son is not typical, he&#39;s HIGHLY emotional.<br/>\n&gt; <br/>\n&gt; Sometimes the word &quot;emotional&quot; can have negative connotations - it does for me, for sure, with my not-allowed-to-cry stop-being-so-emotional baggage. So it helps me to think of Mo (and myself for that matter) as being very whole-hearted. Somehow that has a more positive connotation for me. <br/>\n&gt; <br/>\n&gt; ---Meredith<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":482623530,"authorName":"Lesley Cross","from":"Lesley Cross &lt;lesleycross@...&gt;","profile":"decldc1992","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Playing Wii- Help!!","postDate":"1311960461","msgId":47073,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIyMEQwMjc3LUMwNzctNDIwQy04REQ2LUYxMzdGODQ2QUQ2NUBhdHQubmV0Pg==","inReplyToHeader":"PGowdXA2bStxOWpoQGVHcm91cHMuY29tPg==","referencesHeader":"PGowdXA2bStxOWpoQGVHcm91cHMuY29tPg=="},"prevInTopic":47072,"nextInTopic":47074,"prevInTime":47072,"nextInTime":47074,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"You seem to be believing that your son should not scream and cry at the game, or that if he does you should not be present with him.  What if you simply let","messageBody":"<div id=\"ygrps-yiv-2084974158\">You seem to be believing that your son should not scream and cry at the game, or that if he does you should not be present with him.  What if you simply let him feel the feelings he&#39;s feeling- of course blocking any physical violence to yourself or your daughter- and validate them, being present with him throughout - yes, he&#39;s angry and frustrated and doesn&#39;t know what to do to create a different outcome.  That&#39;s hard and I think we all know what it&#39;s like to need to blow off some steam.  Then perhaps he&#39;ll be open to another activity or food or maybe even a snuggle and a brainstorming session about possible ways to get a higher score.  <br/>\n<br/>\nThere&#39;s also this idea of an idea &quot;working&quot;- what does that mean to you?  Does it mean that your child does not scream, cry or get upset?  Does it mean that he doesn&#39;t require your intervention and attention?  The ideas in The Explosive Child, from an unschooling perspective, are about helping the child understand what&#39;s happening in their mind, not in the moment, but after and before those times, as well as helping us as parents understand what is going on in our child&#39;s mind and the thought processes that create the explosive results.  So that we can choose not to push against the way our children&#39;s brains work when we don&#39;t have to (and as unschoolers, that&#39;s a lot more often than with children who don&#39;t have as much freedom) and understand when there are times we can&#39;t resolve the issue and help our children understand what&#39;s happening to them.  I know my daughter finds it very frightening when her thoughts get &quot;stuck&quot; that way and she begins to feel really hopeless- until it passes.  Talking about it in between has allowed her to gradually learn to cope with those feelings and begin to internalize that she won&#39;t really feel that way forever.  <br/>\n<br/>\nI so often see parents saying &quot;unschooling isn&#39;t working&quot;  when it&#39;s really their own thought processes that haven&#39;t quite caught up.  We hold a lot of default ideas in our minds that are simply untrue and keep us from seeing all the options.... sometimes just asking yourself what you&#39;re assuming here and whether or not it is true can be very helpful, then look for an alternative thought that opens things up.  <br/>\n<br/>\nLesley <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lesleyreidcross.wordpress.com\">http://www.lesleyreidcross.wordpress.com</a></div>","specialLinks":[]},{"userId":414490706,"authorName":"sarahrandom78","from":"&quot;sarahrandom78&quot; &lt;bdb1978@...&gt;","profile":"sarahrandom78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Playing Wii- Help!!","postDate":"1311959062","msgId":47072,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowdXA2bStxOWpoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEE2OUQyOUFFLUE3RjQtNEY0Qi1BMzM4LTg5OEVGRURBQjZEMkB2ZXJpem9uLm5ldD4="},"prevInTopic":47070,"nextInTopic":47073,"prevInTime":47071,"nextInTime":47073,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"That s why I put the question out there, so hopefully I could get ideas. I need suggestions besides Offer to do something fun That doesn t work, he insists","messageBody":"<div id=\"ygrps-yiv-336770966\">That&#39;s why I put the question out there, so hopefully I could get ideas. I need suggestions besides &quot;Offer to do something fun&quot; That doesn&#39;t work, he insists on continuing to play. Offering food doesn&#39;t work, he wants to continue playing. Continuing to let him play doesn&#39;t seem like a great option because he just gets more and more frustrated until he&#39;s screaming at the game and crying. I&#39;ve tried leaving him alone to his fit, but that upsets his little sister, who doesn&#39;t like to see him like that, mainly because it causes him to lash out at everyone around him. I&#39;ve tried physically removing him to different room until he can calm down, which he does after about 2 minutes, but seems like it goes against what unschooling stands for. Maybe I should just throw the idea of unschooling out the window with my son, as it just doesn&#39;t seem to work with him. It&#39;s beginning to seem like what&#39;s most helpful to him doesn&#39;t look like unschooling at all. I have read the explosive child, great book, lot&#39;s of great suggestions, but not many that have really worked for us unfortunately.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; On Jul 28, 2011, at 7:34 PM, sarahrandom78 wrote:<br/>\n&gt; <br/>\n&gt; &gt; OK, great! Now what am I supposed to do when he breaks down crying  <br/>\n&gt; &gt; because he can&#39;t get a higher score in Wii bowling, and none of my  <br/>\n&gt; &gt; suggestions are anything he would like to do?<br/>\n&gt; <br/>\n&gt; You could ask here on the list for how unschoolers who are well used  <br/>\n&gt; to putting the philosophy into practice might handle it. It&#39;s what the  <br/>\n&gt; list is for.<br/>\n&gt; <br/>\n&gt; The purpose of the list is to offer a viewpoint and ideas directed at  <br/>\n&gt; a problem that put respect for the child (in action and in thought)  <br/>\n&gt; foremost.<br/>\n&gt; <br/>\n&gt; No one needs to feel limited to the ideas offered here. But the list  <br/>\n&gt; is a place to see what solutions that are based on the radical  <br/>\n&gt; unschooling philosophy look like. Members should expect to be immersed  <br/>\n&gt; in unschooling thought whenever they read on the list -- because  <br/>\n&gt; that&#39;s what the list promises to offer.<br/>\n&gt; <br/>\n&gt; I once likened lists like this to a Zen center where someone might go  <br/>\n&gt; to immerse herself in Zen practice. It would be irritating and time  <br/>\n&gt; wasting if someone *expected* immersion and people were tossing out  <br/>\n&gt; conventional non-Zen ideas.<br/>\n&gt; <br/>\n&gt; The list promises offer thought and ideas that are grounded in the  <br/>\n&gt; radical unschooling philosophy, ideas that focus on growing respectful  <br/>\n&gt; relationships and living and learning joyfully. The list promises to  <br/>\n&gt; analyze any ideas offered on the list in that light.<br/>\n&gt; <br/>\n&gt; Members are free to gather ideas from any and all sources they want.  <br/>\n&gt; But if they want Zen ideas, the Zen center promises to focus on those.  <br/>\n&gt; And if they want radical unschooling ideas, this list promises not to  <br/>\n&gt; waste people&#39;s time with anything else.<br/>\n&gt; <br/>\n&gt; Joyce<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] demonstrating vs communicating","postDate":"1311908500","msgId":47070,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExMDUyRkRGLTdCRkItNEQwNC05QjM5LUZBRTFDN0FFNzI3RUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGowdDE3cCthbDk1QGVHcm91cHMuY29tPg==","referencesHeader":"PGowdDE3cCthbDk1QGVHcm91cHMuY29tPg=="},"prevInTopic":47069,"nextInTopic":47072,"prevInTime":47069,"nextInTime":47071,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"... Another good one! That s what I was trying to get at. Giving your honest interest and attention to your child because they have something that s important","messageBody":"<div id=\"ygrps-yiv-893463803\">On Jul 28, 2011, at 9:09 PM, plaidpanties666 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; that mom is taking some time to value what is important to her child  <br/>\n&gt; - even if its not the most exciting or important thing in the world  <br/>\n&gt; to mom.<br/>\n<br/>\n </span></blockquote>Another good one! That&#39;s what I was trying to get at.<br/>\n<br/>\nGiving your honest interest and attention to your child because they  <br/>\nhave something that&#39;s important to them they want to share with you,  <br/>\neven if what they&#39;re showing you isn&#39;t as interesting to you as to  <br/>\nyour child.<br/>\n<br/>\nMy daughter can literally talk for hours about metal music and the  <br/>\npersonalities surrounding it. I give her my honest attention. I ask  <br/>\nquestions and listen because I&#39;m interested in what she thinks and how  <br/>\nshe sees the world. I&#39;m also interested in the subject but not to the  <br/>\nextent she is. But by listening to her, being interested in her, my  <br/>\nknowledge and understanding has grown. And so has my interest.<br/>\n<br/>\nBut calling that faking interest will muddy the idea. The goal of  <br/>\nfaking it is to give someone an impression you feel something you  <br/>\nreally don&#39;t. And that&#39;s not a good recipe for growing relationships.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] demonstrating vs communicating","postDate":"1311908491","msgId":47069,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMzQ0ZDNTlBLTA2OTQtNEQxNC05MDA5LUQ0MEMwOUJFNUM4NUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGowdDE3cCthbDk1QGVHcm91cHMuY29tPg==","referencesHeader":"PGowdDE3cCthbDk1QGVHcm91cHMuY29tPg=="},"prevInTopic":47068,"nextInTopic":47070,"prevInTime":47068,"nextInTime":47070,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"... This is a great point. Many moms do hours and hours of work for their families. Cooking, cleaning, schlepping. From the mom s point of view she s setting","messageBody":"<div id=\"ygrps-yiv-442725805\">On Jul 28, 2011, at 9:09 PM, plaidpanties666 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; from your Mom&#39;s perspective she was working her tail off  <br/>\n&gt; demonstrating her love by doing the housework.<br/>\n<br/>\n </span></blockquote>This is a great point.<br/>\n<br/>\nMany moms do hours and hours of work for their families. Cooking,  <br/>\ncleaning, schlepping. From the mom&#39;s point of view she&#39;s setting aside  <br/>\ndoing things for herself for them because she loves them.<br/>\n<br/>\n From her kids point of view she&#39;s choosing to do those things rather  <br/>\nthan spend time with them. To them it doesn&#39;t feel like love at all.  <br/>\nTo them it feels like she loves all those things more than she loves  <br/>\nthem since she&#39;s giving those things loads of her time and attention!<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Playing Wii- Help!!","postDate":"1311906782","msgId":47067,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJGNUQxOUZCLUI1QTQtNENGNy1BMTkyLTQ3NDJFRkFDRUMzNEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGowc3JsYytqMDRuQGVHcm91cHMuY29tPg==","referencesHeader":"PGowc3JsYytqMDRuQGVHcm91cHMuY29tPg=="},"prevInTopic":47066,"nextInTopic":47068,"prevInTime":47066,"nextInTime":47068,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"... He won t. Nor did he know how to walk when he was born. But he was given the freedom and loads of time (I hope!) to try things out. He also won t die from","messageBody":"<div id=\"ygrps-yiv-313685603\">On Jul 28, 2011, at 7:34 PM, sarahrandom78 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If my son is getting headaches and eye strain, do you think, at 5  <br/>\n&gt; years old he is just going to know that he needs to take a break?<br/>\n<br/>\n </span></blockquote>He won&#39;t. Nor did he know how to walk when he was born. But he was  <br/>\ngiven the freedom and loads of time (I hope!) to try things out.<br/>\n<br/>\nHe also won&#39;t die from eye strain. You have time to allow him to  <br/>\nexplore his feelings about it, to give him opportunities for breaks.<br/>\n<br/>\nIf it is bothering him, you can talk with him at a time removed from  <br/>\nthe game playing and let him talk about his experience and *listen* to  <br/>\nhim.<br/>\n<br/>\nBut it helps enormously to drop your idea as the solution he needs to  <br/>\naccept. Not because your idea is wrong but because you&#39;re turning him  <br/>\nnot embracing your idea voluntarily into the problem you&#39;re trying to  <br/>\nsolve. And that won&#39;t feel to him like you care. It will feel like you  <br/>\ncare about him doing this thing more than you care about him and his  <br/>\nfeelings.<br/>\n<br/>\nThat&#39;s just an aspect of human psychology whether one is 5 or 105.  <br/>\nPeople are generally receptive to help when they have a problem they  <br/>\nwant solved *and* want some help with it. They will generally fight  <br/>\nagainst someone deciding they have a problem and any imposed solution.<br/>\n<br/>\nIf you put your need to fix a problem you see in him ahead of his  <br/>\nfeelings about solutions being imposed on him he&#39;s bound to resist.  <br/>\nAnd he&#39;s likely to feel you&#39;re more on your team than you are on his.<br/>\n<br/>\nWhen problems are not lifethreatening, there&#39;s time to allow them to  <br/>\nexplore options and feelings.<br/>\n<br/>\nBut ask on the list for some practical ideas that others have tried.  <br/>\n(I tend to be more of the philosophy person to help people get at the  <br/>\nwhy they might want to try more indirect paths than direct.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If you want to put it out there like I&#39;m &quot;tricking&quot; him, by having  <br/>\n&gt; conversation<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;m suggesting that&#39;s how he will likely feel at some point.  <br/>\nEventually he&#39;ll see a pattern in the timing of these requests and  <br/>\nwhat you&#39;re asking him to do. (Pattern noticing is what humans do!  <br/>\nIt&#39;s what we&#39;re wired to pay attention to.) And when he does notice  <br/>\nhe&#39;ll feel a little bit betrayed. He&#39;ll realize he believed you were  <br/>\nmaking fun and honest suggestions but were really tricking him into  <br/>\ndoing what you wanted him to.<br/>\n<br/>\nThe point isn&#39;t my thoughts but your son&#39;s thoughts and feelings and  <br/>\nwhat it might do to his relationship with you.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You are not understanding me correctly. I&#39;m not going in there with  <br/>\n&gt; food saying &quot;Look at how Mother-of-the-year I am today<br/>\n<br/>\n<br/>\n </span></blockquote>I can read your words. I can&#39;t look into your mind.<br/>\n<br/>\nI can see patterns in your words that may be revealing more than you  <br/>\nrealize about how you&#39;re thinking about things. I can point those  <br/>\npatterns out.<br/>\n<br/>\nIt&#39;s up to you to think about why you twice suggested show rather than  <br/>\ndo or be. You might think it&#39;s just word choice but it reveals  <br/>\nsomething about how you&#39;re organizing thoughts and categorizing them.<br/>\n<br/>\nI&#39;m not pointing out truth inside you.. I can&#39;t possibly know that. I  <br/>\ncan point out a truth that there&#39;s a pattern. A pattern that if you  <br/>\nthink about why it might be there might help you make choices that are  <br/>\nmore relationship building, more joyful. It&#39;s the type of help this  <br/>\nlist provides. It&#39;s up to readers to decide whether or not to turn it  <br/>\nover, whether or not it might be a truth for them.<br/>\n<br/>\nBut explaining what you intended to say doesn&#39;t make the pattern you  <br/>\nalready spontaneously wrote go away.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He doesn&#39;t &quot;like&quot; having a headache, so I am diverting his focus for  <br/>\n&gt; a few seconds because I love him. The idea that that would build  <br/>\n&gt; mistrust in a relationship is silly.<br/>\n<br/>\n<br/>\n </span></blockquote>That might not. But if the idea that your son needs you to fix his  <br/>\nproblems for him because he&#39;s only 5 is acted on more than a very few  <br/>\ntimes, it will whittle away at it. Every time you do will be another  <br/>\nwhittle. Those whittles add up.<br/>\n<br/>\nThe list exists to help members weed out thought processes that are  <br/>\ncausing them to whittle at relationships -- supposedly to get  <br/>\nsomething else for their child&#39;s own good. It exists to help them find  <br/>\nsolutions that not only don&#39;t whittle but help with the problem *and*  <br/>\ngrow relationships.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And comparing something my husband does to annoy me, to me trying to  <br/>\n&gt; help my son is ridiculous<br/>\n<br/>\n<br/>\n </span></blockquote>It&#39;s not ridiculous to your son if he feels annoyed when you try to  <br/>\nhelp him.<br/>\n<br/>\nRegardless of a mom&#39;s good intent, if her child feels annoyed by what  <br/>\nshe&#39;s doing, it&#39;s no different in effect on the child than if she were  <br/>\ndeliberately annoying him.<br/>\n<br/>\nThat&#39;s a huge important mental shift for unschooling: to realize that  <br/>\nour help, love and respect might not feel that way to the child.  <br/>\nIntent counts for nothing! That it might feel the total opposite. It  <br/>\nmight be damaging the child&#39;s trust that we&#39;re on his team to help him  <br/>\nwith *his* problems. And then finding ways for *the child* to feel  <br/>\nhelped and loved and respected.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This is exactly the same thing I&#39;m doing with my son. He&#39;s not  <br/>\n&gt; irritated because of it, so why is it a problem? You seem to think  <br/>\n&gt; he&#39;s stated that he doesn&#39;t like me interrupting his game and I  <br/>\n&gt; continue on doing it.<br/>\n<br/>\n </span></blockquote>If he wanted to rest his eyes then he wouldn&#39;t have &quot;not received  <br/>\nwell&quot; your suggestion to do that.<br/>\n<br/>\nSo you&#39;re tricking him into resting his eyes.<br/>\n<br/>\nYou can help him take breaks to do something fun. He will notice a  <br/>\npattern if the breaks *also* help him feel better. It won&#39;t be right  <br/>\naway.<br/>\n<br/>\nBut others will have even better ideas, better ways of putting the  <br/>\nphilosophy into practice.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When I was little I would want my mom to come outside and watch me  <br/>\n&gt; shoot hoops, but 9 times out of 10 she was too busy with housework.  <br/>\n&gt; I would have rather had her come out and &quot;showed interest&quot;  <br/>\n&gt; regardless if she was &quot;honestly interested&quot; or not.<br/>\n<br/>\n<br/>\n </span></blockquote>Perhaps this will piss you off more. But I bet it will help someone  <br/>\nelse who can read and think about the ideas objectively.<br/>\n<br/>\nIs that the height of the bar you want for your son&#39;s mother? To be a  <br/>\nnotch above not good? Honest, solid relationship deserve more than  <br/>\npretending interest.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My 12yo draws about 25 (literally) pictures of wolves, cats and dogs  <br/>\n&gt; a day. Am I honestly interested? Probably not. I think it would be  <br/>\n&gt; cruel however to say &quot;Yep, another wolf drawing, so what&quot;<br/>\n<br/>\n<br/>\n </span></blockquote>Why are you only allowing yourself two choices: &quot;So what?&quot; and pretend  <br/>\ninterest?<br/>\n<br/>\nThink about the difference between believing someone is honestly  <br/>\ninterested in something you love and then finding out they&#39;d been  <br/>\npretending.<br/>\n<br/>\nThere&#39;s a bond created between people when they share the same  <br/>\ninterests. It&#39;s great big huge whittle to find out that bond wasn&#39;t  <br/>\nreal.<br/>\n<br/>\nYes, of course, most of us will at times find we need to work at being  <br/>\ninterested because our kids need someone to share with. But it should  <br/>\nbe seen as not an optimal idea for radical unschooling. And faking  <br/>\ninterest shouldn&#39;t be offered here as a good idea to deliberately,  <br/>\nconsciously employ.<br/>\n<br/>\nBetter for unschooling, better for relationships, is realizing faking  <br/>\nisn&#39;t as good as real and working at being better than faking it.  <br/>\nAllow a child&#39;s delight to infect you. Get interested in your child  <br/>\nand your child&#39;s enthusiasm. That can help grow honest attention.<br/>\n<br/>\nKids will *know* from our questions and responses our level of  <br/>\ninterest. And they&#39;ll know if the questions are fake to &quot;show&quot;  <br/>\ninterest or honest because you enjoy their joy.<br/>\n<br/>\nThe differences between what you&#39;re doing and what I&#39;m saying may be  <br/>\nsubtle. The biggest difference is in the why not in the what. If  <br/>\nyou&#39;re showing interest because your mother showed little to none,  <br/>\nthat&#39;s setting the bar at doing better than was done to you. If you  <br/>\nset the bar at always taking a step closer to better and better  <br/>\nrelationships and greater and greater joy in learning, you&#39;ll be able  <br/>\nto offer honest interest in *them* rather than pretended interest in  <br/>\nwhat they&#39;re  showing you.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know how it feels to be on the receiving end of no interest, so  <br/>\n&gt; whether it&#39;s &quot;real&quot; or not I&#39;m going to continue acting like I&#39;m  <br/>\n&gt; interested.<br/>\n<br/>\n<br/>\n </span></blockquote>Faked love is better than cold disinterest from someone you expect  <br/>\nlove from, maybe, but I&#39;d prefer to spend time with someone who really  <br/>\nloved me rather than someone who fakes it.<br/>\n<br/>\nFaking it as part of an active process of moving towards really  <br/>\nfeeling it can work. Suggesting that faking it is a good stopping  <br/>\npoint for unschooling won&#39;t help people move towards unschooling.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My son is not typical, he&#39;s HIGHLY emotional.<br/>\n<br/>\n<br/>\n </span></blockquote>Have you read Ross Greene&#39;s The Explosive Child? He has lots of good  <br/>\nideas.<br/>\n<br/>\nIf you bring some of the incidents here, people can offer radical  <br/>\nunschooling approaches. If you&#39;d rather hold onto your own ideas  <br/>\nbecause you fear we&#39;re saying do nothing at all, it will make it more  <br/>\ndifficult for you to find ways that work even better without the  <br/>\npotential pitfalls you&#39;re willing to risk.<br/>\n<br/>\nTo fill a basket with new ideas you need to empty it first.<br/>\n<br/>\nIf you don&#39;t want new ideas, that&#39;s fine. But people are here reading  <br/>\nto get new ideas and new ways of viewing situations, not to grasp why  <br/>\nyou want to hold onto what you&#39;ve got.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Playing Wii- Help!!","postDate":"1311906779","msgId":47068,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2OUQyOUFFLUE3RjQtNEY0Qi1BMzM4LTg5OEVGRURBQjZEMkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGowc3JsYytqMDRuQGVHcm91cHMuY29tPg==","referencesHeader":"PGowc3JsYytqMDRuQGVHcm91cHMuY29tPg=="},"prevInTopic":47067,"nextInTopic":47069,"prevInTime":47067,"nextInTime":47069,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"... You could ask here on the list for how unschoolers who are well used to putting the philosophy into practice might handle it. It s what the list is for. ","messageBody":"<div id=\"ygrps-yiv-1285420456\">On Jul 28, 2011, at 7:34 PM, sarahrandom78 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; OK, great! Now what am I supposed to do when he breaks down crying  <br/>\n&gt; because he can&#39;t get a higher score in Wii bowling, and none of my  <br/>\n&gt; suggestions are anything he would like to do?<br/>\n<br/>\n </span></blockquote>You could ask here on the list for how unschoolers who are well used  <br/>\nto putting the philosophy into practice might handle it. It&#39;s what the  <br/>\nlist is for.<br/>\n<br/>\nThe purpose of the list is to offer a viewpoint and ideas directed at  <br/>\na problem that put respect for the child (in action and in thought)  <br/>\nforemost.<br/>\n<br/>\nNo one needs to feel limited to the ideas offered here. But the list  <br/>\nis a place to see what solutions that are based on the radical  <br/>\nunschooling philosophy look like. Members should expect to be immersed  <br/>\nin unschooling thought whenever they read on the list -- because  <br/>\nthat&#39;s what the list promises to offer.<br/>\n<br/>\nI once likened lists like this to a Zen center where someone might go  <br/>\nto immerse herself in Zen practice. It would be irritating and time  <br/>\nwasting if someone *expected* immersion and people were tossing out  <br/>\nconventional non-Zen ideas.<br/>\n<br/>\nThe list promises offer thought and ideas that are grounded in the  <br/>\nradical unschooling philosophy, ideas that focus on growing respectful  <br/>\nrelationships and living and learning joyfully. The list promises to  <br/>\nanalyze any ideas offered on the list in that light.<br/>\n<br/>\nMembers are free to gather ideas from any and all sources they want.  <br/>\nBut if they want Zen ideas, the Zen center promises to focus on those.  <br/>\nAnd if they want radical unschooling ideas, this list promises not to  <br/>\nwaste people&#39;s time with anything else.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"demonstrating vs communicating","postDate":"1311901753","msgId":47066,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowdDE3cCthbDk1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGowc3JsYytqMDRuQGVHcm91cHMuY29tPg=="},"prevInTopic":47065,"nextInTopic":47067,"prevInTime":47065,"nextInTime":47067,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"... ******************* There s a good point in that statement which is running the risk of getting lost, here, and its that simply engaging with your child in","messageBody":"<div id=\"ygrps-yiv-48104006\">&quot;sarahrandom78&quot; &lt;bdb1978@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I simply time my conversation for when there are gaps in his game, I&#39;m excited to hear about what he&#39;s doing, but it also helps give his eyes a quick break.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nThere&#39;s a good point in that statement which is running the risk of getting lost, here, and its that simply engaging with your child in a warm, friendly, supportive sort of way already does the work of giving a child&#39;s eyes a break. Its not the sort of thing that needs to be planned or even sought after - although parents do sometimes need to learn the special courtesy of games involving waiting and looking for the pauses. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You are not understanding me correctly. I&#39;m not going in there with food saying &quot;Look at how Mother-of-the-year I am today, this is nurturing, can we spell nurturing?&quot; My God, I&#39;m simply saying that it is a demonstration of love when I bring him food.<br/>\n </span></blockquote>*************************<br/>\n<br/>\nBut why &quot;a demonstration&quot;? It&#39;s not an attack, its an opportunity to think about how words can shape your assumptions and underlying expectations. You don&#39;t have to participate ;) It&#39;s not a one-on-one conversation - there are over two thousand list members, after all.<br/>\n<br/>\nSo why not say &quot;its loving and kind to bring food&quot;? Why go for a word like &quot;demonstrate&quot; which implies that you expect your child to notice something in particular? That might be an important question - parents often fall into the trap of expecting kids to notice something specific and then experience a specific reaction, like gratitude. <br/>\n<br/>\nHere&#39;s an example - some people say &quot;I love you&quot; as a demonstration of love and expect a reply of &quot;I love you, too&quot;. Adult relationships can get ugly when one person is seeing &quot;I love you&quot; as a demonstration and the other isn&#39;t. Parent-child relationships can get ugly when parents feel like they&#39;re doing a lot of demonstrating and kids aren&#39;t responding in ways they expect. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I am diverting his focus for a few seconds because I love him. The idea that that would build mistrust in a relationship is silly.<br/>\n </span></blockquote>********************<br/>\n<br/>\nIt&#39;s not silly, its a possible (and common) gap in parental expecations and as such its worth discussing. <br/>\n<br/>\n Maybe you&#39;re just engaging with your kid and one of the side effects is that it helps him rest his eyes. But that&#39;s not the way you&#39;ve phrased it - you&#39;ve made it sound like engaging with him is secondary to the agenda of getting him to do something you want him to do - and That can build mistrust in a relationship just as surely as someone regularly saying &quot;I love you&quot; in order to get the reply.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt; &quot;You&#39;re &quot;showing him&quot; you&#39;re interested rather than being interested. And it isn&#39;t honest interest. It isn&#39;t spontaneous interest.&lt;&lt;&lt;&lt;&lt;&lt;&lt; <br/>\n<br/>\n&gt; I gotta be honest here, this just pissed me off and here&#39;s why. When I was little I would want my mom to come outside and watch me shoot hoops, but 9 times out of 10 she was too busy with housework. I would have rather had her come out and &quot;showed interest&quot; regardless if she was &quot;honestly interested&quot; or not. <br/>\n </span></blockquote>*************************<br/>\n<br/>\nOkay, so for you, &quot;demonstrate love&quot; has a different connotation because you didn&#39;t get the attention you wanted. You&#39;d have been happy with even a demonstration - you think. What you&#39;re not seeing is that it is entirely possible that from your Mom&#39;s perspective she was working her tail off demonstrating her love by doing the housework. That&#39;s the difference between demonstraing love and communicating love - your mom was so busy demonstrating she failed to actually communicate and as a result you felt unloved. <br/>\n<br/>\nThat&#39;s the exact distinction Joyce is making, the difference is that as far as you know, you&#39;re communicating affection and care to your son - and if he&#39;s responding with warmth and happiness that&#39;s probably true. The thing is, unschooling isn&#39;t the sort of thing that works by simply replicating what one parent does in another family. It&#39;s important to pull apart Why something works to see the underlying priciples. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; My 12yo draws about 25 (literally) pictures of wolves, cats and dogs a day. Am I honestly interested? Probably not. I think it would be cruel however to say &quot;Yep, another wolf drawing, so what&quot; I prefer to take note of details and comment on them &quot;Wow, I can see that your drawings are getting more realistic&quot; <br/>\n </span></blockquote>*************************<br/>\n<br/>\nSo, here&#39;s a good example of how what works in terms of engaging and communicating with one person wouldn&#39;t work with another - my 10yo would tell me &quot;you can stop talking now&quot; after more than a brief comment. But I *do* want to connect with her, share her joys and delight in her interests so I smile and nod when she shows me her stacks of daily drawings and paintings. I find ways to express my pleasure in her company in small, unobtrusive ways. What&#39;s working in either case is that mom is taking some time to value what is important to her child - even if its not the most exciting or important thing in the world to mom. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Now what am I supposed to do when he breaks down crying because he can&#39;t get a higher score<br/>\n </span></blockquote>*****************<br/>\n<br/>\nMo does this from time to time. It reminds me of the fact that I wasn&#39;t allowed to cry over much of anything as a child - I&#39;m glad she knows she can cry in front of me. <br/>\n<br/>\nIf engaging with your son during natural game pauses also helps him have more stamina for his games, that&#39;s a good thing twice over! At the same time, I don&#39;t want to leave other parents with the idea that getting a child to take breaks will automatically result in more stamina and less tears. Mo is very good at taking breaks, for instance, and yet she does fall apart from time to time when a game gets tough. She doesn&#39;t want reassurance or comfort or suggestions at those times, she wants to have a good cry.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My son is not typical, he&#39;s HIGHLY emotional.<br/>\n<br/>\n </span></blockquote>Sometimes the word &quot;emotional&quot; can have negative connotations - it does for me, for sure, with my not-allowed-to-cry stop-being-so-emotional baggage. So it helps me to think of Mo (and myself for that matter) as being very whole-hearted. Somehow that has a more positive connotation for me. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"unschoolingbasics-owner@yahoogroups.com","from":"unschoolingbasics-owner@yahoogroups.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Playing Wii- Help!!","postDate":"1311897945","msgId":47065,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowc3RncCthdTE5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGowc3JsYytqMDRuQGVHcm91cHMuY29tPg=="},"prevInTopic":47064,"nextInTopic":47066,"prevInTime":47064,"nextInTime":47066,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"Sarah, you seem to be taking the discussion points generated by your comments very personally when they aren t really aimed at you . Words you ve used and","messageBody":"<div id=\"ygrps-yiv-653728239\">Sarah, you seem to be taking the discussion points generated by your comments very personally when they aren&#39;t really aimed at &quot;you&quot;. Words you&#39;ve used and implications that others have read into those words have been pulled out for discussion, its not a personal attack. <br/>\n<br/>\nLists like this are challenging because the topic is something dear to our hearts. It can be easy to read a post pulling apart ideas as a kind of attack when its more of a thought experiment, a chance to think about intentions and meanings. It might not be relevant to your life at all! But chances are someone else could read that same reply and think &quot;ohhhhhhh, that clarifies something.&quot; That&#39;s how lists like this work. A very very few people write in while many others read and connect with the concepts. <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;sarahrandom78&quot; &lt;bdb1978@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; &quot;The point is that something that makes sense to the mom doesn&#39;t<br/>\n&gt; translate to making sense to the child.&quot;<br/>\n&gt; <br/>\n&gt; Of course it doesn&#39;t, he&#39;s 5! If my son is getting headaches and eye strain, do you think, at 5 years old he is just going to know that he needs to take a break? Am I just supposed to say to him &quot;Well what would YOU like to do about it?&quot; He NEVER wants to take a break, and then guess who has to deal with the fallout from his overtired, hungry, eye-strained self? Everyone around him, him included. It seems very inconsiderate to me, at his age, to EXPECT him to know what he should do to avoid eye strain. Instead of leaving it up to him, I feel we have come to a great conclusion. If you want to put it out there like I&#39;m &quot;tricking&quot; him, by having conversation, well whatever. I simply time my conversation for when there are gaps in his game, I&#39;m excited to hear about what he&#39;s doing, but it also helps give his eyes a quick break.<br/>\n&gt; <br/>\n&gt; &quot;Why would you show your child how nurturing you are? Does he need a demo? Do things that nurture him that he likes. Do things he likes because you love him.&quot;<br/>\n&gt; <br/>\n&gt; You are not understanding me correctly. I&#39;m not going in there with food saying &quot;Look at how Mother-of-the-year I am today, this is nurturing, can we spell nurturing?&quot; My God, I&#39;m simply saying that it is a demonstration of love when I bring him food. It is also a demonstration of love when I show him that I&#39;m interested in his game and what he has to say about it. Do I need to give him a demo? Um, I&#39;m not really sure what you mean by that, as I already stated it&#39;s showing I love him, I&#39;m not saying &quot;Notice that I love you&quot; He doesn&#39;t &quot;like&quot; having a headache, so I am diverting his focus for a few seconds because I love him. The idea that that would build mistrust in a relationship is silly. And comparing something my husband does to annoy me, to me trying to help my son is ridiculous and is akin to comparing apples to oranges. I don&#39;t &quot;want&quot; my husband to remind me to drink water, I want to be able to remember it on my own, however I appreciate that since I&#39;m apparently unable to remember to do it, I have someone who takes notice and helps me. This is exactly the same thing I&#39;m doing with my son. He&#39;s not irritated because of it, so why is it a problem? You seem to think he&#39;s stated that he doesn&#39;t like me interrupting his game and I continue on doing it.<br/>\n&gt; <br/>\n&gt; &quot;You&#39;re &quot;showing him&quot; you&#39;re interested rather than being interested. And it isn&#39;t honest interest. It isn&#39;t spontaneous interest. <br/>\n&gt; <br/>\n&gt; I gotta be honest here, this just pissed me off and here&#39;s why. When I was little I would want my mom to come outside and watch me shoot hoops, but 9 times out of 10 she was too busy with housework. I would have rather had her come out and &quot;showed interest&quot; regardless if she was &quot;honestly interested&quot; or not. My 12yo draws about 25 (literally) pictures of wolves, cats and dogs a day. Am I honestly interested? Probably not. I think it would be cruel however to say &quot;Yep, another wolf drawing, so what&quot; I prefer to take note of details and comment on them &quot;Wow, I can see that your drawings are getting more realistic&quot; I can&#39;t help that day after day I don&#39;t get excited about every new drawing, but I can help how I react. I know how it feels to be on the receiving end of no interest, so whether it&#39;s &quot;real&quot; or not I&#39;m going to continue acting like I&#39;m interested. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &quot;For unschooling purposes, I&#39;d suggest being aware of his comfort. If  he seems antsy *offer* breaks to do something fun. Say &quot;Hey, let&#39;s go get a snack,&quot; or &quot;Would you like to help me fold laundry?&quot; or anything he might enjoy.&quot;<br/>\n&gt; <br/>\n&gt; OK, great! Now what am I supposed to do when he breaks down crying because he can&#39;t get a higher score in Wii bowling, and none of my suggestions are anything he would like to do? And just so I cover all bases here, he also can&#39;t come up with anything himself? This has been a repeated thing. My son is not typical, he&#39;s HIGHLY emotional. As I was sitting here typing this there was a complete meltdown over a laundry hamper of all things, because his sister was playing in it, and he decided HE wanted it, NOW!<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":414490706,"authorName":"sarahrandom78","from":"&quot;sarahrandom78&quot; &lt;bdb1978@...&gt;","profile":"sarahrandom78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Playing Wii- Help!!","postDate":"1311896044","msgId":47064,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowc3JsYytqMDRuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBQkRCRUEyLUI5NDUtNDRCMC1BQjE3LTI2RTlDMjhDNURFREB2ZXJpem9uLm5ldD4="},"prevInTopic":47060,"nextInTopic":47065,"prevInTime":47063,"nextInTime":47065,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"The point is that something that makes sense to the mom doesn t translate to making sense to the child. Of course it doesn t, he s 5! If my son is getting","messageBody":"<div id=\"ygrps-yiv-726777673\">&quot;The point is that something that makes sense to the mom doesn&#39;t<br/>\ntranslate to making sense to the child.&quot;<br/>\n<br/>\nOf course it doesn&#39;t, he&#39;s 5! If my son is getting headaches and eye strain, do you think, at 5 years old he is just going to know that he needs to take a break? Am I just supposed to say to him &quot;Well what would YOU like to do about it?&quot; He NEVER wants to take a break, and then guess who has to deal with the fallout from his overtired, hungry, eye-strained self? Everyone around him, him included. It seems very inconsiderate to me, at his age, to EXPECT him to know what he should do to avoid eye strain. Instead of leaving it up to him, I feel we have come to a great conclusion. If you want to put it out there like I&#39;m &quot;tricking&quot; him, by having conversation, well whatever. I simply time my conversation for when there are gaps in his game, I&#39;m excited to hear about what he&#39;s doing, but it also helps give his eyes a quick break.<br/>\n<br/>\n&quot;Why would you show your child how nurturing you are? Does he need a demo? Do things that nurture him that he likes. Do things he likes because you love him.&quot;<br/>\n<br/>\nYou are not understanding me correctly. I&#39;m not going in there with food saying &quot;Look at how Mother-of-the-year I am today, this is nurturing, can we spell nurturing?&quot; My God, I&#39;m simply saying that it is a demonstration of love when I bring him food. It is also a demonstration of love when I show him that I&#39;m interested in his game and what he has to say about it. Do I need to give him a demo? Um, I&#39;m not really sure what you mean by that, as I already stated it&#39;s showing I love him, I&#39;m not saying &quot;Notice that I love you&quot; He doesn&#39;t &quot;like&quot; having a headache, so I am diverting his focus for a few seconds because I love him. The idea that that would build mistrust in a relationship is silly. And comparing something my husband does to annoy me, to me trying to help my son is ridiculous and is akin to comparing apples to oranges. I don&#39;t &quot;want&quot; my husband to remind me to drink water, I want to be able to remember it on my own, however I appreciate that since I&#39;m apparently unable to remember to do it, I have someone who takes notice and helps me. This is exactly the same thing I&#39;m doing with my son. He&#39;s not irritated because of it, so why is it a problem? You seem to think he&#39;s stated that he doesn&#39;t like me interrupting his game and I continue on doing it.<br/>\n<br/>\n&quot;You&#39;re &quot;showing him&quot; you&#39;re interested rather than being interested. And it isn&#39;t honest interest. It isn&#39;t spontaneous interest. <br/>\n<br/>\nI gotta be honest here, this just pissed me off and here&#39;s why. When I was little I would want my mom to come outside and watch me shoot hoops, but 9 times out of 10 she was too busy with housework. I would have rather had her come out and &quot;showed interest&quot; regardless if she was &quot;honestly interested&quot; or not. My 12yo draws about 25 (literally) pictures of wolves, cats and dogs a day. Am I honestly interested? Probably not. I think it would be cruel however to say &quot;Yep, another wolf drawing, so what&quot; I prefer to take note of details and comment on them &quot;Wow, I can see that your drawings are getting more realistic&quot; I can&#39;t help that day after day I don&#39;t get excited about every new drawing, but I can help how I react. I know how it feels to be on the receiving end of no interest, so whether it&#39;s &quot;real&quot; or not I&#39;m going to continue acting like I&#39;m interested. <br/>\n<br/>\n<br/>\n&quot;For unschooling purposes, I&#39;d suggest being aware of his comfort. If  he seems antsy *offer* breaks to do something fun. Say &quot;Hey, let&#39;s go get a snack,&quot; or &quot;Would you like to help me fold laundry?&quot; or anything he might enjoy.&quot;<br/>\n<br/>\nOK, great! Now what am I supposed to do when he breaks down crying because he can&#39;t get a higher score in Wii bowling, and none of my suggestions are anything he would like to do? And just so I cover all bases here, he also can&#39;t come up with anything himself? This has been a repeated thing. My son is not typical, he&#39;s HIGHLY emotional. As I was sitting here typing this there was a complete meltdown over a laundry hamper of all things, because his sister was playing in it, and he decided HE wanted it, NOW!</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Playing Wii- Help!!","postDate":"1311819796","msgId":47060,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBQkRCRUEyLUI5NDUtNDRCMC1BQjE3LTI2RTlDMjhDNURFREB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGowcGptMStnNnZvQGVHcm91cHMuY29tPg==","referencesHeader":"PGowcGptMStnNnZvQGVHcm91cHMuY29tPg=="},"prevInTopic":47059,"nextInTopic":47064,"prevInTime":47059,"nextInTime":47061,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"... You missed the important part of the scenario! You *want* your husband to remind you to do something that you *want* to do. What I said was: for a reason ","messageBody":"<div id=\"ygrps-yiv-430029076\">On Jul 27, 2011, at 1:59 PM, sarahrandom78 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I LOVE when my husband reminds me to drink water.<br/>\n<br/>\n </span></blockquote>You missed the important part of the scenario! You *want* your husband  <br/>\nto remind you to do something that you *want* to do. What I said was:<br/>\n<br/>\n&quot;for a reason<br/>\nthat seemed excessive and tied more to what he feared might happen<br/>\nthan to what was actually happening&quot;<br/>\n<br/>\nThe point is that something that makes sense to the mom doesn&#39;t  <br/>\ntranslate to making sense to the child. So the sensible thing a mom is  <br/>\nasking her child to do -- that to her feels helpful and nurturing --  <br/>\ncan feel like annoying interference, even nagging, if the child  <br/>\ndoesn&#39;t agree with the level of importance and hasn&#39;t asked to be  <br/>\nreminded.<br/>\n<br/>\nSo picture your husband reminding you about something that you don&#39;t  <br/>\nfeel is important but he does, something that you don&#39;t want to be  <br/>\nreminded about several times a day. To understand why someone would be  <br/>\nannoyed by something you need to get into their head and see what the  <br/>\nsituation looks and feels like to them. You have to let go of your  <br/>\nview of the thing, let go of how sensible and easy you think it is.<br/>\n<br/>\n From that point of view your son&#39;s reaction makes total sense.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Yet you say we should offer things like monkey platters to show how  <br/>\n&gt; nurturing we are in providing for their needs<br/>\n<br/>\n<br/>\n </span></blockquote>Why would you show your child how nurturing you are? Does he need a  <br/>\ndemo?<br/>\n<br/>\nDo things that nurture him that he likes. Do things he likes because  <br/>\nyou love him.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This is just another way of providing, IMHO.<br/>\n<br/>\n </span></blockquote>If he didn&#39;t like monkey platters and &quot;didn&#39;t receive them well&quot; then  <br/>\nthat wouldn&#39;t be nurturing.<br/>\n<br/>\nWhat if your husband gave you books of a genre that you didn&#39;t like  <br/>\nbut he thought would be good for you? (If you say you like all books,  <br/>\nfill in something you don&#39;t like!) What if he kept giving them despite  <br/>\nyour stronger and stronger hints that it wasn&#39;t really your thing?<br/>\n<br/>\nWould his giving feel nurturing? Or might it feel like he was ignoring  <br/>\nyour feelings to impose his own agenda for you on you?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; when I have simply said to him &quot;Landon, while the next round is  <br/>\n&gt; loading why don&#39;t you look at the clock and count the seconds it  <br/>\n&gt; takes?&quot; it hasn&#39;t even been met with resistance.<br/>\n<br/>\n<br/>\n </span></blockquote>Because you&#39;re suggesting something that sounds interesting to him.<br/>\n<br/>\nWhat happens when it isn&#39;t interesting to him? Will you come up with  <br/>\nmore tricks? Eventually he&#39;s going to catch on that you&#39;re  <br/>\nmanipulating him into resting his eyes.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You don&#39;t have to make it a chore, or something that&#39;s interrupting  <br/>\n&gt; his fun.<br/>\n<br/>\n </span></blockquote>I think what you&#39;re getting from what people are writing is that  <br/>\ntelling a child to look away is annoy so don&#39;t do anything at all.<br/>\n<br/>\nThe point of helping people understand what something feels like and  <br/>\nlooks like from the child&#39;s point of view is to help them come up with  <br/>\nsolutions that feel like mom&#39;s trying to help them do what they want  <br/>\nrather than making the child do what the mom wants.<br/>\n<br/>\n*If* the child&#39;s eyes are bothering him right now, sure offer  <br/>\nsuggestions. As long as you&#39;re focused on the *child&#39;s* problem -- not  <br/>\nthe problem that you perceive which might be very different! -- he&#39;s  <br/>\nlikely to be receptive. Or he might want to solve it himself. Or it  <br/>\nmight not be as big of a deal as you imagine it must be. *Listen* to  <br/>\nhim.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Or I will just try to talk to him when he has a few seconds between  <br/>\n&gt; the next part of the game loading, then he is focusing his eyes away  <br/>\n&gt; from the TV as well, plus I&#39;m showing him that I&#39;m interested in  <br/>\n&gt; what he&#39;s doing.<br/>\n<br/>\n </span></blockquote>Phrased this way it feels like finding some sneaky way of getting him  <br/>\nto do what you believe is best for him. Like those recipes that sneak  <br/>\nspinach into muffins. You&#39;re &quot;showing him&quot; you&#39;re interested rather  <br/>\nthan being interested. And it isn&#39;t honest interest. It isn&#39;t  <br/>\nspontaneous interest. Your goal is to give his eyes a break. Be  <br/>\ninterested in what he&#39;s doing because you&#39;re interested, not because  <br/>\nyou want to trick him into resting his eyes.<br/>\n<br/>\nFor unschooling purposes, I&#39;d suggest being aware of his comfort. If  <br/>\nhe seems antsy *offer* breaks to do something fun. Say &quot;Hey, let&#39;s go  <br/>\nget a snack,&quot; or &quot;Would you like to help me fold laundry?&quot; or anything  <br/>\nhe might enjoy. Don&#39;t focus on getting him to do what you think he  <br/>\nshould do. Trust that he&#39;s a thinking being. Trust he can make  <br/>\nthoughtful decisions. He won&#39;t right now necessarily make the best  <br/>\ndecisions. He&#39;s trying things out, seeing what happens. He may be  <br/>\npushing his eyes as far as he can right now to test his limits.<br/>\n<br/>\nUnfortunately, I suspect it reads the same as what you do but it will  <br/>\nfeel very different -- especially to your sone -- when you shift from  <br/>\ntrying to find some way to get you child to do what you want to  <br/>\nhelping your child do what he wants.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":414490706,"authorName":"sarahrandom78","from":"&quot;sarahrandom78&quot; &lt;bdb1978@...&gt;","profile":"sarahrandom78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Playing Wii- Help!!","postDate":"1311789569","msgId":47059,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowcGptMStnNnZvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEE2RDY0OUFFLTQ0RjctNDNBNS1BNTNBLUQ5QzlEOTk4MzE0QkB2ZXJpem9uLm5ldD4="},"prevInTopic":47058,"nextInTopic":47060,"prevInTime":47058,"nextInTime":47060,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"If your husband were worried about you getting dehydrated for a reason that seemed excessive and tied more to what he feared might happen than to what was","messageBody":"<div id=\"ygrps-yiv-1438460163\">&quot;If your husband were worried about you getting dehydrated for a reason that seemed excessive and tied more to what he feared might happen than to what was actually happening, and told you you needed to drink a glass of water every 2 hours or whenever he&#39;d show up, how would that feel?&quot;<br/>\n<br/>\nI LOVE when my husband reminds me to drink water. I tend to forget about it and then wonder why I get headaches. He probably asks me 3 times a day &quot;how much water have you had today?&quot; I don&#39;t take it as being condescending, just a loving reminder to remember to drink water. He knows I don&#39;t like being sidelined from headaches so he has taken the time to remind me to drink up, sometimes he will even text me during the day while he&#39;s at work. I have ADHD, so I tend to get a little hyperfocused at times, so I really appreciate that someone would take the time to help me remember something that is so basic to other people. It&#39;s silly to me that someone would be annoyed by you taking a simple suggestion of focusing away from the TV for 5 seconds and be annoyed by it. Yet you say we should offer things like monkey platters to show how nurturing we are in providing for their needs. This is just another way of providing, IMHO. I know my son gets eye strain, which makes him grouchy and gives him headaches. If I say he needs to take a break from the TV, that&#39;s not received well, but when I have simply said to him &quot;Landon, while the next round is loading why don&#39;t you look at the clock and count the seconds it takes?&quot; it hasn&#39;t even been met with resistance. Or I will just try to talk to him when he has a few seconds between the next part of the game loading, then he is focusing his eyes away from the TV as well, plus I&#39;m showing him that I&#39;m interested in what he&#39;s doing. You don&#39;t have to make it a chore, or something that&#39;s interrupting his fun.<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; On Jul 25, 2011, at 9:44 PM, jax_dunn wrote:<br/>\n&gt; <br/>\n&gt; &gt; I&#39;ve started that with him now, he knows when he gets watery eyes he  <br/>\n&gt; &gt; needs to do it, and or in between when I pop in. Seems so obvious  <br/>\n&gt; &gt; now eh! Great advice, cheers!<br/>\n&gt; <br/>\n&gt; Needs to?<br/>\n&gt; <br/>\n&gt; If your husband were worried about you getting dehydrated for a reason  <br/>\n&gt; that seemed excessive and tied more to what he feared might happen  <br/>\n&gt; than to what was actually happening, and told you you needed to drink  <br/>\n&gt; a glass of water every 2 hours or whenever he&#39;d show up, how would  <br/>\n&gt; that feel? How would you feel about him being so focused on your  <br/>\n&gt; hydration? Don&#39;t you think that each time you heard him approach you  <br/>\n&gt; might not be thinking happy thoughts of getting to enjoy his company  <br/>\n&gt; and be thinking, &quot;Oh, crap, he&#39;s going to say something about my water.&quot;<br/>\n&gt; <br/>\n&gt; Trust that kids don&#39;t want to hurt! Or at least not more than  <br/>\n&gt; something he&#39;s doing is worth. ;-) If he gets watery eyes and they  <br/>\n&gt; bother him, give him suggestions of what he could do. Give him  <br/>\n&gt; information for *him* to turn over and perhaps give a try. But then  <br/>\n&gt; let it go. Trust that he&#39;s a thinking being and will tend to it when  <br/>\n&gt; it&#39;s important to him.<br/>\n&gt; <br/>\n&gt; But when the mom&#39;s agenda shifts from helping the child do what he  <br/>\n&gt; wants to do to helping the child do what the mom thinks is best for  <br/>\n&gt; him, she&#39;s moved off his team and is trying to pull him onto her team.  <br/>\n&gt; And that will tear at the partnership, making the two of you  <br/>\n&gt; adversaries.<br/>\n&gt; <br/>\n&gt;  From *your* point of view, it seems like your on his team when you  <br/>\n&gt; want what&#39;s best for him. But from his point of view, your not. You&#39;re  <br/>\n&gt; saying &quot;I don&#39;t care about what&#39;s most important to you right now. I  <br/>\n&gt; care about this idea and getting you to do it.&quot;<br/>\n&gt; <br/>\n&gt; The more you do that, the less he&#39;ll trust your ideas are about  <br/>\n&gt; helping him and the more he&#39;ll trust your ideas are about your agenda  <br/>\n&gt; for him.<br/>\n&gt; <br/>\n&gt; I *know* it seems like not such a big deal to just ask him to shift  <br/>\n&gt; his focus. That it won&#39;t lead to the doom and gloom I&#39;ve suggested ;-)  <br/>\n&gt; And that&#39;s true! But it&#39;s that thought process that makes this -- and  <br/>\n&gt; lots of other &quot;good for him&quot; ideas -- seem right, that thought process  <br/>\n&gt; that will cause you to do hundreds of little things like that that  <br/>\n&gt; will accumulate and tear at the relationship. Cause him to see you as  <br/>\n&gt; not so trustworthy.<br/>\n&gt; <br/>\n&gt; If you can shift your thought process on this thing, it can help you  <br/>\n&gt; shift your thought process on lots of other little &quot;good for him  <br/>\n&gt; things he needs to do&quot;. It&#39;s not easy to let go of the direct approach  <br/>\n&gt; and trust that they&#39;re thinking beings! But it makes it *way* easier  <br/>\n&gt; when they&#39;re teens. It makes it way easier if they&#39;ve had a childhood  <br/>\n&gt; of making decisions about non-life threatening situations, thinking  <br/>\n&gt; about what happened, trying other things.<br/>\n&gt; <br/>\n&gt; Joyce<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Playing Wii- Help!!","postDate":"1311685171","msgId":47058,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk0MEQ2QjA2LTAzRDAtNEM3OC05QUNDLThCMURGNjNBM0MxRkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGowbDV0bitlb2NwQGVHcm91cHMuY29tPg==","referencesHeader":"PGowbDV0bitlb2NwQGVHcm91cHMuY29tPg=="},"prevInTopic":47057,"nextInTopic":47059,"prevInTime":47057,"nextInTime":47059,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"... It s way more helpful for unschooling to ask unschoolers what happens with their kids and draw conclusions from that data. If a study shows one thing but","messageBody":"<div id=\"ygrps-yiv-1007875460\">On Jul 25, 2011, at 9:40 PM, jax_dunn wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **Are there any studies, or is this just the latest gossip - anyone<br/>\n&gt; know?**<br/>\n&gt;<br/>\n&gt; Id be interested in that too...<br/>\n<br/>\n </span></blockquote>It&#39;s way more helpful for unschooling to ask unschoolers what happens  <br/>\nwith their kids and draw conclusions from that data.<br/>\n<br/>\nIf a study shows one thing but unschoolers don&#39;t see that happening in  <br/>\nreal life, what does that mean?<br/>\n<br/>\nI think people are too quick to assume they can&#39;t know enough to draw  <br/>\ngood conclusions. That there are complications that only experts can  <br/>\nunderstand. (And I really do blame school and conventional parenting  <br/>\nfor that. For their entire childhoods kids are treated as being too  <br/>\nignorant to possibly know what they&#39;re doing, that they need experts  <br/>\n(moms, teachers, doctors) to make the decisions for them and tell them  <br/>\nwhat they need to do. It&#39;s a really horrible environment to grow  <br/>\nconfidence in one&#39;s own abilities to understand and make decisions in.)<br/>\n<br/>\nThere are thousands of radical unschoolers who are allowing their kids  <br/>\nto play video games, watch as TV, use the computer as much as they  <br/>\nwant. It&#39;s quite possible unschooled kids spend far more time in front  <br/>\nof screens than any other population of kids. If you feel scientists  <br/>\nknow more either you&#39;re assuming there&#39;s damage that regular people  <br/>\nare too ignorant to see; unschooling parents are really dim witted not  <br/>\nto be able to see something obvious; or they don&#39;t care, perhaps  <br/>\ncaring more about a philosophy than their kids&#39; health.<br/>\n<br/>\nI&#39;m not saying that in a &quot;You&#39;re so mean to think that of us!&quot;  <br/>\nvoice ;-) I&#39;m saying when you step back and look at why expert studies  <br/>\nfeel more comforting and reassuring than what &quot;regular&quot; people say,  <br/>\nthere&#39;s some not so pretty reasons beneath that. Reasons that should  <br/>\nbe dragged into the light and examined so you can feel less frightened  <br/>\nby things you assume only experts can understand.<br/>\n<br/>\nI love science. I have a sciency degree. But I trust more the  <br/>\nobservations of radical unschooling parents who are thoughtful and  <br/>\naware and focused on supporting their kids explorations and thoughtful  <br/>\ndecision making than I do the studies done for reasons that may have  <br/>\nnothing to do with the child. Studies about kids are almost always  <br/>\nfocused on getting kids to do well in school.<br/>\n<br/>\nStudies cost money. Research is often directed at supporting the  <br/>\ntheory of someone who supplies the funding. There&#39;s a great deal of  <br/>\nmoney to be made supporting people&#39;s fears. (They&#39;ll by special  <br/>\nglasses, drugs, programs, hire specialists.) There&#39;s no money to be  <br/>\nmade disproving fears and little money to support that kind of research.<br/>\n<br/>\nSchuyler has posted the Rat Park studies that show that drugs aren&#39;t  <br/>\naddictive. The need for drugs is caused by stressful environments, not  <br/>\nthe drugs themselves.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.walrusmagazine.com/articles/2007.12-health-rat-trap/\">http://www.walrusmagazine.com/articles/2007.12-health-rat-trap/</a><br/>\n<br/>\nI believe I remember reading that he lost funding. There&#39;s *billions*  <br/>\nof dollars being poured into the war on drugs. It&#39;s a huge machine  <br/>\nthat wants better research to make it the war more effective. That  <br/>\nresearch is directed entirely at supporting the idea that drugs are  <br/>\naddictive. There&#39;s zero money available for proving drugs are not  <br/>\naddictive.<br/>\n<br/>\nFor some reason for most people support for fears being real is more  <br/>\ncomforting than evidence the fears aren&#39;t real.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Playing Wii- Help!!","postDate":"1311683673","msgId":47057,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2RDY0OUFFLTQ0RjctNDNBNS1BNTNBLUQ5QzlEOTk4MzE0QkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGowbDY2NCt1N3RxQGVHcm91cHMuY29tPg==","referencesHeader":"PGowbDY2NCt1N3RxQGVHcm91cHMuY29tPg=="},"prevInTopic":47056,"nextInTopic":47058,"prevInTime":47056,"nextInTime":47058,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"... Needs to? If your husband were worried about you getting dehydrated for a reason that seemed excessive and tied more to what he feared might happen than to","messageBody":"<div id=\"ygrps-yiv-970797150\">On Jul 25, 2011, at 9:44 PM, jax_dunn wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve started that with him now, he knows when he gets watery eyes he  <br/>\n&gt; needs to do it, and or in between when I pop in. Seems so obvious  <br/>\n&gt; now eh! Great advice, cheers!<br/>\n<br/>\n </span></blockquote>Needs to?<br/>\n<br/>\nIf your husband were worried about you getting dehydrated for a reason  <br/>\nthat seemed excessive and tied more to what he feared might happen  <br/>\nthan to what was actually happening, and told you you needed to drink  <br/>\na glass of water every 2 hours or whenever he&#39;d show up, how would  <br/>\nthat feel? How would you feel about him being so focused on your  <br/>\nhydration? Don&#39;t you think that each time you heard him approach you  <br/>\nmight not be thinking happy thoughts of getting to enjoy his company  <br/>\nand be thinking, &quot;Oh, crap, he&#39;s going to say something about my water.&quot;<br/>\n<br/>\nTrust that kids don&#39;t want to hurt! Or at least not more than  <br/>\nsomething he&#39;s doing is worth. ;-) If he gets watery eyes and they  <br/>\nbother him, give him suggestions of what he could do. Give him  <br/>\ninformation for *him* to turn over and perhaps give a try. But then  <br/>\nlet it go. Trust that he&#39;s a thinking being and will tend to it when  <br/>\nit&#39;s important to him.<br/>\n<br/>\nBut when the mom&#39;s agenda shifts from helping the child do what he  <br/>\nwants to do to helping the child do what the mom thinks is best for  <br/>\nhim, she&#39;s moved off his team and is trying to pull him onto her team.  <br/>\nAnd that will tear at the partnership, making the two of you  <br/>\nadversaries.<br/>\n<br/>\n From *your* point of view, it seems like your on his team when you  <br/>\nwant what&#39;s best for him. But from his point of view, your not. You&#39;re  <br/>\nsaying &quot;I don&#39;t care about what&#39;s most important to you right now. I  <br/>\ncare about this idea and getting you to do it.&quot;<br/>\n<br/>\nThe more you do that, the less he&#39;ll trust your ideas are about  <br/>\nhelping him and the more he&#39;ll trust your ideas are about your agenda  <br/>\nfor him.<br/>\n<br/>\nI *know* it seems like not such a big deal to just ask him to shift  <br/>\nhis focus. That it won&#39;t lead to the doom and gloom I&#39;ve suggested ;-)  <br/>\nAnd that&#39;s true! But it&#39;s that thought process that makes this -- and  <br/>\nlots of other &quot;good for him&quot; ideas -- seem right, that thought process  <br/>\nthat will cause you to do hundreds of little things like that that  <br/>\nwill accumulate and tear at the relationship. Cause him to see you as  <br/>\nnot so trustworthy.<br/>\n<br/>\nIf you can shift your thought process on this thing, it can help you  <br/>\nshift your thought process on lots of other little &quot;good for him  <br/>\nthings he needs to do&quot;. It&#39;s not easy to let go of the direct approach  <br/>\nand trust that they&#39;re thinking beings! But it makes it *way* easier  <br/>\nwhen they&#39;re teens. It makes it way easier if they&#39;ve had a childhood  <br/>\nof making decisions about non-life threatening situations, thinking  <br/>\nabout what happened, trying other things.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Playing Wii- Help!!","postDate":"1311683363","msgId":47056,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowbWJ2MytzOWFuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGowa210aCtqYzJyQGVHcm91cHMuY29tPg=="},"prevInTopic":47055,"nextInTopic":47057,"prevInTime":47055,"nextInTime":47057,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"... ******************* Any kind of intense focus can result in eye strain - which is what you seem to be describing - and as your husband has learned, there","messageBody":"<div id=\"ygrps-yiv-769235383\">&quot;sarahrandom78&quot; &lt;bdb1978@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;The good thing is that it seems like temporary damage. Since he started with the &quot;focus breaks&quot; his vision is back to almost 20/20. <br/>\n </span></blockquote>*******************<br/>\n<br/>\nAny kind of intense focus can result in eye strain - which is what you seem to be describing - and as your husband has learned, there are ways to correct and prevent it. In terms of kids learning about the world, that means you can relax. If your child has trouble - difficulty focusing and headaches are the most common signs of eye strain - then you can suggest ways for your child to improve the situation. It&#39;s Not something to worry about, though, any more than one should worry about a child learning some other physical skill needing to modify his or her equipment to make it more ergonmic. You can deal with those sorts of issus when they come up, If they ever do. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; As for the TV I&#39;m not so sure. <br/>\n<br/>\n </span></blockquote>I notice if I haven&#39;t been watching tv for awhile I&#39;ll get a headache from watching a movie - so I think about that and make allowances, maybe choose not to watch a movie at a given time because I don&#39;t want the after effects. Given the freedom to choose, kids make the same sorts of decisions - but a child who worries that &quot;tv priviledges&quot; might be taken away if he or she complains of eye-strain will push past discomfort to keep the tv. It&#39;s not something that needs to be dealt with before it happens, though, if it ever happens. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":78282269,"authorName":"scoopmom","from":"&quot;scoopmom&quot; &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Playing Wii- Help!!","postDate":"1311682066","msgId":47055,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowbWFtaStoM2RqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGowa210aCtqYzJyQGVHcm91cHMuY29tPg=="},"prevInTopic":47052,"nextInTopic":47056,"prevInTime":47054,"nextInTime":47056,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"My sister had such good eyesight in high school that she was able to read the Air Force pilot level on the eye chart, really seriously good eyes. By her second","messageBody":"<div id=\"ygrps-yiv-408277796\">My sister had such good eyesight in high school that she was able to read the Air Force pilot level on the eye chart, really seriously good eyes. By her second year of college, she was wearing glasses - and she wasn&#39;t looking at computers all day, she was studying graphic design which meant she was sketching, painting, etc all day. I had great vision despite spending my days reading for hours growing up and on into my adult life, then entering the computer field. It was only in the last couple of years that I&#39;ve needed glasses and that&#39;s mostly the changing shape of my eyes. For that matter, previously I needed to start wearing reading glasses when I was pregnant because that can also change eye shape.<br/>\n<br/>\nThere is no reason one should be craning ones head into an awkward position when working at a computer any more than one would when reading, cooking, or doing any other task. If that is the case, then posture, positioning of desk, monitor, chair, etc all need to be looked at. If I&#39;m not mistaken, a computer monitor should center just below eye level (so your head isn&#39;t bending down or up to see the whole screen, just a relaxed position) and be somewhere around 18 inches away from the end of your nose.<br/>\n<br/>\nTaking breaks from ANY activity can be a good thing - getting up and moving around, looking out the window, etc. It&#39;s not specific to videogames/TV - in fact, just sitting for more than a couple hours without getting up (as in reading, school time, sewing, painting/drawing, etc) has been found to be a risk factor for cardiovascular problems. Even if the study participants weren&#39;t exercising, simply getting up frequently put them at less risk than those who exercised but otherwise were mostly sedentary.<br/>\n<br/>\n--Deb R</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Playing Wii- Help!!","postDate":"1311644708","msgId":47050,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZCMzkwMTgwLTk2NUYtNEU4Qi05QUU5LUM1NzRDOUFGREZCQUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGowa210aCtqYzJyQGVHcm91cHMuY29tPg==","referencesHeader":"PGowa210aCtqYzJyQGVHcm91cHMuY29tPg=="},"prevInTopic":47049,"nextInTopic":47051,"prevInTime":47049,"nextInTime":47051,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"... If it caused eye damage, then nearly everyone who spent that much time in front of a computer would have eye damage. I ve been on computers since 1982. 6","messageBody":"<div id=\"ygrps-yiv-1695631937\">On Jul 25, 2011, at 5:24 PM, sarahrandom78 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; so he is in front of a computer for 8-9 hours a day just at work.  <br/>\n&gt; This DOES cause eye damage.<br/>\n<br/>\n </span></blockquote>If it caused eye damage, then nearly everyone who spent that much time  <br/>\nin front of a computer would have eye damage. I&#39;ve been on computers  <br/>\nsince 1982. 6 hours a day is pretty typical. My eyes haven&#39;t changed  <br/>\nmore than expected over those years. I went to college with nerdy  <br/>\ncomputer people. I worked with nerdy computer people. None of them  <br/>\nwore special glasses.<br/>\n<br/>\nIf hours at the computer is the cause of your husband&#39;s eye strain  <br/>\nit&#39;s because there&#39;s something very usual about his eyes. And  <br/>\nsuggesting others should treat their eyes as if they&#39;re unusual is  <br/>\nlike telling people they shouldn&#39;t eat peanuts because a few people  <br/>\nare allergic.<br/>\n<br/>\nIf someone is one of the rare people who reacts badly to peanuts, then  <br/>\nit can be dealt with.<br/>\n<br/>\nIf someone is one of the rare people whose eyes react badly to long  <br/>\nhours at a screen (*if* this really is so), it can be dealt with.<br/>\n<br/>\nLiving life in &quot;just to be safe&quot; mode doesn&#39;t seem like a good pathway  <br/>\nto joyful living.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":431919266,"authorName":"jax_dunn","from":"&quot;jax_dunn&quot; &lt;jax_dunn@...&gt;","profile":"jax_dunn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Playing Wii- Help!!","postDate":"1311644676","msgId":47052,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowbDY2NCt1N3RxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGowa210aCtqYzJyQGVHcm91cHMuY29tPg=="},"prevInTopic":47051,"nextInTopic":47055,"prevInTime":47051,"nextInTime":47053,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"**That s why I mentioned maybe having them take the same sort of focus breaks. It literally takes just a few seconds of looking away so your eyes can focus on","messageBody":"<div id=\"ygrps-yiv-1882156380\">**That&#39;s why I mentioned maybe having them take the<br/>\nsame sort of focus breaks. It literally takes just a few seconds of looking away<br/>\nso your eyes can focus on something further away.**<br/>\n<br/>\nI&#39;ve started that with him now, he knows when he gets watery eyes he needs to do it, and or in between when I pop in.  Seems so obvious now eh! Great advice, cheers!</div>","specialLinks":[]},{"userId":431919266,"authorName":"jax_dunn","from":"&quot;jax_dunn&quot; &lt;jax_dunn@...&gt;","profile":"jax_dunn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Playing Wii- Help!!","postDate":"1311644407","msgId":47051,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowbDV0bitlb2NwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGl2dm84MSs2dW41QGVHcm91cHMuY29tPg=="},"prevInTopic":47050,"nextInTopic":47052,"prevInTime":47050,"nextInTime":47052,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"**This thread is actually the first I ve heard of video games having any relationship at all with eye *sight* though - I thought the leading worry (with regard","messageBody":"<div id=\"ygrps-yiv-1706654079\">**This thread is actually the first I&#39;ve heard of video games having any<br/>\nrelationship at all with eye *sight* though - I thought the leading worry (with<br/>\nregard to vision) was that it interferred somehow with the ability to see the<br/>\nworld in 3D. Are there any studies, or is this just the latest gossip - anyone<br/>\nknow?**<br/>\n<br/>\nThere is that too! Its just an all round concern, eye sight, perception of the world, sitting around all day, not wanting to go outside, talking a lot in &#39;mario&#39; land, (lol).....<br/>\n<br/>\n**Are there any studies, or is this just the latest gossip - anyone<br/>\nknow?**<br/>\n<br/>\nId be interested in that too...<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n&gt;<br/>\n&gt;  &quot;Sara Uselton&quot; &lt;saralouwho@&gt; wrote:<br/>\n&gt; &gt;&gt; I read once, that the association we have with smart people wearing glasses holds true when the IQ tests are visually based.  In other words, very visual kids, who tend to do well on visually-themed tests, tend to have glasses.  They theorized that they focused near so much with reading, etc., which led to needing glasses.<br/>\n&gt; ********************<br/>\n&gt; <br/>\n&gt; There&#39;s no evidence, though, that close-up reading damages the eyes. Given the inherent biases of IQ tests, its more likely that kids with poorer long-range vision spend more time doing things like puzzles and games and reading as opposed to challenges which take whole-body skills - and as such have learned the skills which are being tested. <br/>\n&gt; <br/>\n&gt; The myth about &quot;bookish&quot; people needing glasses is related to the old myth about sewing and lace-making leading to near-sightedness. If you had poor vision in the days before regular eye correction, what kinds of things *could* you do? Its a case of seeing correlation but misconstruing the causality. <br/>\n&gt; <br/>\n&gt; This thread is actually the first I&#39;ve heard of video games having any relationship at all with eye *sight* though - I thought the leading worry (with regard to vision) was that it interferred somehow with the ability to see the world in 3D. Are there any studies, or is this just the latest gossip - anyone know?<br/>\n&gt; <br/>\n&gt; ---Meredith<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":482623530,"authorName":"Lesley Cross","from":"Lesley Cross &lt;lesleycross@...&gt;","profile":"decldc1992","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Playing Wii- Help!!","postDate":"1311641753","msgId":47049,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxNTFBRDA2LTJCNEMtNDg2MC1BOUM0LUNDOTU5MDE4NDM0MUBhdHQubmV0Pg==","inReplyToHeader":"PGowa210aCtqYzJyQGVHcm91cHMuY29tPg==","referencesHeader":"PGowa210aCtqYzJyQGVHcm91cHMuY29tPg=="},"prevInTopic":47048,"nextInTopic":47050,"prevInTime":47048,"nextInTime":47050,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"My dh is also a network engineer, with no consequences to his vision- he s been doing this for 12+ years and worked as a CADD designer prior to that (drafting","messageBody":"<div id=\"ygrps-yiv-313279192\">My dh is also a network engineer, with no consequences to his vision- he&#39;s been doing this for 12+ years and worked as a CADD designer prior to that (drafting and design on the computer).  His vision actually has improved over the years.  He&#39;s 41 tomorrow.<br/>\n<br/>\nLesley<br/>\n<br/>\nimmerse.emerge.thrive<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lesleyreidcross.wordpress.com\">http://www.lesleyreidcross.wordpress.com</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jul 25, 2011, at 5:24 PM, &quot;sarahrandom78&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bdb1978@...\">bdb1978@...</a>&gt; wrote:<br/>\n<br/>\n&gt; Just wanted to chime in again. My husband is a Network Engineer, so he is in front of a computer for 8-9 hours a day just at work. This DOES cause eye damage. He wears special glasses for people who spend a lot of time in front of the computer (made by Gunnar) and takes regular breaks to focus his eyes on things that are further away. I ask my daughter to do the same thing, and she&#39;s pretty good about it. There may not be long term research, or &quot;proof&quot; but my husband&#39;s vision has deteriorated a lot since he entered this profession. Some may say it&#39;s just part of the aging process, he&#39;s 34. However NO ONE else in his entire family (siblings, parents, grand parents) has any sort of eye problems. The good thing is that it seems like temporary damage. Since he started with the &quot;focus breaks&quot; his vision is back to almost 20/20. He also complains of headaches, not sure that this is eye related though, I think it has more to do with the way you lean your head toward the screen. I can tell my neck gets sore if I&#39;ve spent a lot of time on the computer during the day. <br/>\n&gt; <br/>\n&gt; As for the TV I&#39;m not so sure. That&#39;s why I mentioned maybe having them take the same sort of focus breaks. It literally takes just a few seconds of looking away so your eyes can focus on something further away. Maybe you could put a funny picture on the wall, and anytime there is a slight pause, ask them to look at the picture for a second. Just my two cents :) <br/>\n&gt; <br/>\n&gt; Sarah<br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Jax Dunn &lt;jax_dunn@...&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; Hi Sarah,<br/>\n&gt; &gt; Thanks so much for your reply! I know what you mean by the reading etc that gets <br/>\n&gt; &gt; done during the games, as they need to know what it says to move onto the next <br/>\n&gt; &gt; step etc, eh! He can use the remote and nun-chuck at once, pressing all the <br/>\n&gt; &gt; different buttons, so his perception of things are VERY good...he does learn a <br/>\n&gt; &gt; lot from it, its just becomes a ...&quot;oh no, on the wii again(in my head), lets <br/>\n&gt; &gt; play/learn AWAY from a screen&quot;, lol<br/>\n&gt; &gt; <br/>\n&gt; &gt; He&#39;s now really good at &#39;wii music&#39;..hes done it in the past but was all over <br/>\n&gt; &gt; the place, but since doing it for the past 3 days, he can do all the songs with <br/>\n&gt; &gt; different instruments AND in time...so when I see that, I think WOW, what am I <br/>\n&gt; &gt; worried about?? But the eye strain sits on my shoulder..<br/>\n&gt; &gt; <br/>\n&gt; &gt; All I&#39;ve ever heard of video game playing, is the complaining school kid mums <br/>\n&gt; &gt; that have teenagers that play computer games all afternoon and night after <br/>\n&gt; &gt; school, and they can&#39;t tear them away, so I suppose that must be the lurking <br/>\n&gt; &gt; monster(fears) in the back of my mind..however, TOTALLY not equating the fact <br/>\n&gt; &gt; that my kids aren&#39;t doing it to pull themselves out of &#39;school&#39; mode..<br/>\n&gt; &gt; <br/>\n&gt; &gt; Anyways, it may be something that never really sits ok with me?..so best I just <br/>\n&gt; &gt; take it as it comes eh. If it starts going a bit haywire I just need to know <br/>\n&gt; &gt; and trust that we can/will deal with it..<br/>\n&gt; &gt; <br/>\n&gt; &gt; Thanks again sarah<br/>\n&gt; &gt; <br/>\n&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":414490706,"authorName":"sarahrandom78","from":"&quot;sarahrandom78&quot; &lt;bdb1978@...&gt;","profile":"sarahrandom78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Playing Wii- Help!!","postDate":"1311629041","msgId":47048,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowa210aCtqYzJyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMTA4NzI1ODcuNjY2My5ZYWhvb01haWxSQ0B3ZWIxMTMwMDYubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":47041,"nextInTopic":47049,"prevInTime":47047,"nextInTime":47049,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"Just wanted to chime in again. My husband is a Network Engineer, so he is in front of a computer for 8-9 hours a day just at work. This DOES cause eye damage.","messageBody":"<div id=\"ygrps-yiv-667382454\">Just wanted to chime in again. My husband is a Network Engineer, so he is in front of a computer for 8-9 hours a day just at work. This DOES cause eye damage. He wears special glasses for people who spend a lot of time in front of the computer (made by Gunnar) and takes regular breaks to focus his eyes on things that are further away. I ask my daughter to do the same thing, and she&#39;s pretty good about it. There may not be long term research, or &quot;proof&quot; but my husband&#39;s vision has deteriorated a lot since he entered this profession. Some may say it&#39;s just part of the aging process, he&#39;s 34. However NO ONE else in his entire family (siblings, parents, grand parents) has any sort of eye problems. The good thing is that it seems like temporary damage. Since he started with the &quot;focus breaks&quot; his vision is back to almost 20/20. He also complains of headaches, not sure that this is eye related though, I think it has more to do with the way you lean your head toward the screen. I can tell my neck gets sore if I&#39;ve spent a lot of time on the computer during the day. <br/>\n<br/>\nAs for the TV I&#39;m not so sure. That&#39;s why I mentioned maybe having them take the same sort of focus breaks. It literally takes just a few seconds of looking away so your eyes can focus on something further away. Maybe you could put a funny picture on the wall, and anytime there is a slight pause, ask them to look at the picture for a second. Just my two cents :) <br/>\n<br/>\nSarah<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Jax Dunn &lt;jax_dunn@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi Sarah,<br/>\n&gt; Thanks so much for your reply! I know what you mean by the reading etc that gets <br/>\n&gt; done during the games, as they need to know what it says to move onto the next <br/>\n&gt; step etc, eh! He can use the remote and nun-chuck at once, pressing all the <br/>\n&gt; different buttons, so his perception of things are VERY good...he does learn a <br/>\n&gt; lot from it, its just becomes a ...&quot;oh no, on the wii again(in my head), lets <br/>\n&gt; play/learn AWAY from a screen&quot;, lol<br/>\n&gt; <br/>\n&gt; He&#39;s now really good at &#39;wii music&#39;..hes done it in the past but was all over <br/>\n&gt; the place, but since doing it for the past 3 days, he can do all the songs with <br/>\n&gt; different instruments AND in time...so when I see that, I think WOW, what am I <br/>\n&gt; worried about?? But the eye strain sits on my shoulder..<br/>\n&gt; <br/>\n&gt; All I&#39;ve ever heard of video game playing, is the complaining school kid mums <br/>\n&gt; that have teenagers that play computer games all afternoon and night after <br/>\n&gt; school, and they can&#39;t tear them away, so I suppose that must be the lurking <br/>\n&gt; monster(fears) in the back of my mind..however, TOTALLY not equating the fact <br/>\n&gt; that my kids aren&#39;t doing it to pull themselves out of &#39;school&#39; mode..<br/>\n&gt; <br/>\n&gt; Anyways, it may be something that never really sits ok with me?..so best I just <br/>\n&gt; take it as it comes eh.  If it starts going a bit haywire I just need to know <br/>\n&gt; and trust that we can/will deal with it..<br/>\n&gt; <br/>\n&gt; Thanks again sarah<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":321860186,"authorName":"Sara Uselton","from":"&quot;Sara Uselton&quot; &lt;saralouwho@...&gt;","profile":"reflectionmommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Playing Wii- Help!!","postDate":"1311352819","msgId":47041,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowYzk1ais4ZWRkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGl2dm84MSs2dW41QGVHcm91cHMuY29tPg=="},"prevInTopic":47030,"nextInTopic":47048,"prevInTime":47040,"nextInTime":47042,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"... I hear ya Meredith,  I get frustrated with the frequency that correlation is confused with causation.  Especially when researchers who should know better","messageBody":"<div id=\"ygrps-yiv-1448822718\"><blockquote><span title=\"ireply\">&gt; There&#39;s no evidence, though, that close-up reading damages the eyes. Given the inherent biases of IQ tests, its more likely that kids with poorer long-range vision spend more time doing things like puzzles and games and reading as opposed to challenges which take whole-body skills - and as such have learned the skills which are being tested. <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I hear ya Meredith,  I get frustrated with the frequency that correlation is confused with causation.  Especially when researchers who should know better do it.<br/>\n<br/>\nSara</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Playing Wii- Help!!","postDate":"1310942273","msgId":47030,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGl2dm84MSs2dW41QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGl2djZzNitsNW1tQGVHcm91cHMuY29tPg=="},"prevInTopic":47028,"nextInTopic":47041,"prevInTime":47029,"nextInTime":47031,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"... ******************** There s no evidence, though, that close-up reading damages the eyes. Given the inherent biases of IQ tests, its more likely that kids","messageBody":"<div id=\"ygrps-yiv-822530771\">&quot;Sara Uselton&quot; &lt;saralouwho@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I read once, that the association we have with smart people wearing glasses holds true when the IQ tests are visually based.  In other words, very visual kids, who tend to do well on visually-themed tests, tend to have glasses.  They theorized that they focused near so much with reading, etc., which led to needing glasses.<br/>\n </span></blockquote>********************<br/>\n<br/>\nThere&#39;s no evidence, though, that close-up reading damages the eyes. Given the inherent biases of IQ tests, its more likely that kids with poorer long-range vision spend more time doing things like puzzles and games and reading as opposed to challenges which take whole-body skills - and as such have learned the skills which are being tested. <br/>\n<br/>\nThe myth about &quot;bookish&quot; people needing glasses is related to the old myth about sewing and lace-making leading to near-sightedness. If you had poor vision in the days before regular eye correction, what kinds of things *could* you do? Its a case of seeing correlation but misconstruing the causality. <br/>\n<br/>\nThis thread is actually the first I&#39;ve heard of video games having any relationship at all with eye *sight* though - I thought the leading worry (with regard to vision) was that it interferred somehow with the ability to see the world in 3D. Are there any studies, or is this just the latest gossip - anyone know?<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":321860186,"authorName":"Sara Uselton","from":"&quot;Sara Uselton&quot; &lt;saralouwho@...&gt;","profile":"reflectionmommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Playing Wii- Help!!","postDate":"1310924486","msgId":47028,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGl2djZzNitsNW1tQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMTA1OTU0MDYuMzA2OS5ZYWhvb01haWxSQ0B3ZWIxMTMwMTMubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":47026,"nextInTopic":47030,"prevInTime":47027,"nextInTime":47029,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"My oldest, 6.5 now, went through a time of several months, most of a year, really, playing wii very heavily.  I didn t really worry too much about it, though.","messageBody":"<div id=\"ygrps-yiv-1136972981\">My oldest, 6.5 now, went through a time of several months, most of a year, really, playing wii very heavily.  I didn&#39;t really worry too much about it, though.  I definitely didn&#39;t worry about eye strain.  He moved around a lot while he played, which varied where his eyes were focusing.<br/>\n<br/>\nI read once, that the association we have with smart people wearing glasses holds true when the IQ tests are visually based.  In other words, very visual kids, who tend to do well on visually-themed tests, tend to have glasses.  They theorized that they focused near so much with reading, etc., which led to needing glasses.  <br/>\n<br/>\nI would venture to guess that reading for long periods of time a day, is probably harder on your eyes than playing wii. And I&#39;ve never heard a big outcry, warning us to not let our kids read too much, lest they&#39;ll require glasses.  I think this goes back to our societal prejudice against pixels.  <br/>\n<br/>\nReading &quot;Everything Bad Is Good For You&quot; really helped me let go of all that baggage.  He makes some great points, and I can really see his theories in action when I watch my kids play, or watch TV.  <br/>\n<br/>\nBy the say, I&#39;ve posted here maybe a couple of times, and I&#39;m just realizing that I don&#39;t think I&#39;ve introduced myself.  I&#39;m Sara, 38, mom to Jack 6.5, and Max 4.  We&#39;ve been unschooling since birth, and reading these forums has been absolutely essential for me.  So thank you all!<br/>\n<br/>\nSara      <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Jax Dunn &lt;jax_dunn@...&gt; wrote:<br/>\n<br/>\n<br/>\n  But isn&#39;t there a <br/>\n&gt; genuine issue with the eyes and screen time? Is it healthy to sit in front of a <br/>\n&gt; tv all day and play wii?? </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Playing Wii- Help!!","postDate":"1310899915","msgId":47026,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1MTAzMDAzLUEwNzEtNEQ4Ni1BODRGLTI3REFGMTU2MkQ4NEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEzMTA4NzI1ODcuNjY2My5ZYWhvb01haWxSQ0B3ZWIxMTMwMDYubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PGl2bmRubytqdWlzQGVHcm91cHMuY29tPiA8MTMxMDg3MjU4Ny42NjYzLllhaG9vTWFpbFJDQHdlYjExMzAwNi5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":47025,"nextInTopic":47028,"prevInTime":47025,"nextInTime":47027,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"... Do you know any kids who have permanently damaged their eyes from playing video games? Unschooled kids probably have played more hours than most kids and I","messageBody":"<div id=\"ygrps-yiv-788928961\">On Jul 16, 2011, at 11:16 PM, Jax Dunn wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But the eye strain sits on my shoulder..<br/>\n<br/>\n </span></blockquote>Do you know any kids who have permanently damaged their eyes from  <br/>\nplaying video games?<br/>\n<br/>\nUnschooled kids probably have played more hours than most kids and I  <br/>\ndon&#39;t know of any personally and haven&#39;t heard anyone mention some  <br/>\nkind of damaging eye strain.<br/>\n<br/>\nAll sorts of things in life causes people to strain their eyes for  <br/>\nlong periods. Reading in low light. Microscopes and telescopes. Close  <br/>\nneedle work. Painting miniatures. Has anyone suffered more than  <br/>\ntemporary irritation?<br/>\n<br/>\nI&#39;m thinking monsters under the bed are more real than eye strain from  <br/>\nvideo games.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":431919266,"authorName":"Jax Dunn","from":"Jax Dunn &lt;jax_dunn@...&gt;","profile":"jax_dunn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Playing Wii- Help!!","postDate":"1310872587","msgId":47025,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTA4NzI1ODcuNjY2My5ZYWhvb01haWxSQ0B3ZWIxMTMwMDYubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGl2bmRubytqdWlzQGVHcm91cHMuY29tPg==","referencesHeader":"PGl2bmRubytqdWlzQGVHcm91cHMuY29tPg=="},"prevInTopic":47010,"nextInTopic":47026,"prevInTime":47024,"nextInTime":47026,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"Hi Sarah, Thanks so much for your reply! I know what you mean by the reading etc that gets done during the games, as they need to know what it says to move","messageBody":"<div id=\"ygrps-yiv-1223056893\">Hi Sarah,<br/>\nThanks so much for your reply! I know what you mean by the reading etc that gets <br/>\ndone during the games, as they need to know what it says to move onto the next <br/>\nstep etc, eh! He can use the remote and nun-chuck at once, pressing all the <br/>\ndifferent buttons, so his perception of things are VERY good...he does learn a <br/>\nlot from it, its just becomes a ...&quot;oh no, on the wii again(in my head), lets <br/>\nplay/learn AWAY from a screen&quot;, lol<br/>\n<br/>\nHe&#39;s now really good at &#39;wii music&#39;..hes done it in the past but was all over <br/>\nthe place, but since doing it for the past 3 days, he can do all the songs with <br/>\ndifferent instruments AND in time...so when I see that, I think WOW, what am I <br/>\nworried about?? But the eye strain sits on my shoulder..<br/>\n<br/>\nAll I&#39;ve ever heard of video game playing, is the complaining school kid mums <br/>\nthat have teenagers that play computer games all afternoon and night after <br/>\nschool, and they can&#39;t tear them away, so I suppose that must be the lurking <br/>\nmonster(fears) in the back of my mind..however, TOTALLY not equating the fact <br/>\nthat my kids aren&#39;t doing it to pull themselves out of &#39;school&#39; mode..<br/>\n<br/>\nAnyways, it may be something that never really sits ok with me?..so best I just <br/>\ntake it as it comes eh.  If it starts going a bit haywire I just need to know <br/>\nand trust that we can/will deal with it..<br/>\n<br/>\nThanks again sarah<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":414490706,"authorName":"sarahrandom78","from":"&quot;sarahrandom78&quot; &lt;bdb1978@...&gt;","profile":"sarahrandom78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Playing Wii- Help!!","postDate":"1310669368","msgId":47010,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGl2bmRubytqdWlzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMTA1OTU0MDYuMzA2OS5ZYWhvb01haWxSQ0B3ZWIxMTMwMTMubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":47004,"nextInTopic":47025,"prevInTime":47009,"nextInTime":47011,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"My kids are the same age as yours, and they have gone through months where it seemed that they did hardly anything but play the Wii, especially my son.","messageBody":"<div id=\"ygrps-yiv-439053659\">My kids are the same age as yours, and they have gone through months where it seemed that they did hardly anything but play the Wii, especially my son. Sometimes he has played for 6 straight hours. However he always gets tired of it after a month or so and goes back to his lego&#39;s or trains. I think the thing with the Wii is that it is so much more interactive. What is funny is that my son taught my dad (who is completely computer literate by the way) how to work the Wii controller. At 5 he is also able to figure out other complex things, like our TV remote (our TV is run by our computer, so it&#39;s not your typical remote, it&#39;s more like a big computer with a wireless keyboard). I believe he is so far advanced because of his free use of the Wii. My grandma was visiting and she brought up some objections about how much I let him play it, but I pointed out all the &quot;learning&quot; he&#39;s getting out of it. He taught himself to read a lot of words so he would know what to do. Also the technology has gone on to learn so easily because he&#39;s not &quot;scared&quot; of it. Also, have you really looked at what they are doing on there? Or how long they are really spending? Sometimes when I start panicking over how long they&#39;ve been on the Wii, it helps to step back and just watch for a day. I&#39;ve done that. Sometimes it seems like all day, but if I really watch I see my son taking short breaks to go jump on the trampoline, or go play with his squirt gun, or ride his bike. Very rarely, unless he just got a new game, does he spend the &quot;whole day&quot; just playing a video game. We now have the Kinect for the Xbox which I LOVE!!! It has way more interactive games, with jumping, dancing and other kinds of movement involved so it gets his physical need for energy out. As for the eye damage worries, I&#39;m not an eye doctor so I don&#39;t really know. I tell my daughter to take regular breaks when she&#39;s on the computer (she&#39;s 12) because I was told by our dr that focusing on the monitor for too long can lead to eye damage. From what I understand you need to just turn and look at things further away often. That will also prevent eye strain and headaches. Anyway, hope this helps :)<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Jax Dunn &lt;jax_dunn@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi there,<br/>\n&gt; Im new to posting on here but have been reading all of your posts for 2 years <br/>\n&gt; now, and have gained a lot of insight!<br/>\n&gt; <br/>\n&gt; I know that video gaming has been talked about before, but Im having a real hard <br/>\n&gt; time at the moment getting all that I can remember to &#39;sink in&#39;.<br/>\n&gt; <br/>\n&gt; My 5 yo boy and now 3 yo girl play wii A LOT! Its the first thing they want to <br/>\n&gt; do when they get up and even if they break for a bit to eat or maybe a tad of <br/>\n&gt; lego or drawing, will always go back to wii for most of the day. Im feeling <br/>\n&gt; really uneasy about it. We have arts n crafts about, LOTS of lego (which my boy <br/>\n&gt; also loves), puzzles, dvds, books etc..and I offer to play them with them, and <br/>\n&gt; my daughter usually will, but my son will decline.<br/>\n&gt; <br/>\n&gt; Now I can hear you all saying, if it were &#39;reading or puzzles&#39; he was doing all <br/>\n&gt; day, would I be as worried, and the answer is no, I wouldn&#39;t.  But isn&#39;t there a <br/>\n&gt; genuine issue with the eyes and screen time? Is it healthy to sit in front of a <br/>\n&gt; tv all day and play wii?? <br/>\n&gt; <br/>\n&gt; I know he gains so much from the game, hes better than me at it, and the both of <br/>\n&gt; them together are learning awesome communication & negotiation skills, BUT I <br/>\n&gt; can&#39;t help feeling uneasy about it and if its just me I need to tend to, then <br/>\n&gt; lets DO IT! <br/>\n&gt; <br/>\n&gt; Im not concerned that hes not learning anything, as all on his own accord hes <br/>\n&gt; starting to read, write and is very good with maths...its the &#39;screen time, <br/>\n&gt; sitting all day&#39; issue..and that I feel Im not &#39;doing&#39; enough to stimulate him <br/>\n&gt; otherwise?! <br/>\n&gt; <br/>\n&gt; I just want to feel at ease (or some ease) with this and not feel constant <br/>\n&gt; anxiety about it...<br/>\n&gt; <br/>\n&gt; I appreciate any insights you wish to share<br/>\n&gt; <br/>\n&gt; Thanks so much, <br/>\n&gt; Jax<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Playing Wii- Help!!","postDate":"1310649780","msgId":47004,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGl2bXFqayttdGh1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMTA1OTU0MDYuMzA2OS5ZYWhvb01haWxSQ0B3ZWIxMTMwMTMubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":47002,"nextInTopic":47010,"prevInTime":47003,"nextInTime":47005,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"... Both my kids have gone through periods of playing a lot of video games. Neither has any issues with their eyes or 3D perception, or coordination. I ve yet","messageBody":"<div id=\"ygrps-yiv-2103849448\">Jax Dunn &lt;jax_dunn@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;But isn&#39;t there a <br/>\n&gt; genuine issue with the eyes and screen time? Is it healthy to sit in front of a <br/>\n&gt; tv all day and play wii?? <br/>\n<br/>\n </span></blockquote>Both my kids have gone through periods of playing a lot of video games. Neither has any issues with their eyes or 3D perception, or coordination. I&#39;ve yet to meet any unschooled or homeschooled kids who&#39;ve had problems from playing video games - and the only studies done that claim video games are somehow harmful are done on children confined to a desk much of the time. It&#39;s probably more &quot;harmful&quot; to read or look at still pictures than to play with interactive images ;) <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Playing Wii- Help!!","postDate":"1310645701","msgId":47002,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGl2bW1rNSs2ZDQ3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMTA1OTU0MDYuMzA2OS5ZYWhvb01haWxSQ0B3ZWIxMTMwMTMubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":46990,"nextInTopic":47004,"prevInTime":47001,"nextInTime":47003,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"Is the Wii new? Nance -","messageBody":"<div id=\"ygrps-yiv-1322779663\">Is the Wii new?<br/>\n<br/>\nNance<br/>\n<br/>\n-<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; My 5 yo boy and now 3 yo girl play wii A LOT! Its the first thing they want to <br/>\n&gt; do when they get up and even if they break for a bit to eat or maybe a tad of <br/>\n&gt; lego or drawing, will always go back to wii for most of the day. </span></blockquote></div>","specialLinks":[]},{"userId":431919266,"authorName":"Jax Dunn","from":"Jax Dunn &lt;jax_dunn@...&gt;","profile":"jax_dunn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"1"},"subject":"Playing Wii- Help!!","postDate":"1310595406","msgId":46990,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTA1OTU0MDYuMzA2OS5ZYWhvb01haWxSQ0B3ZWIxMTMwMTMubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":47002,"prevInTime":46989,"nextInTime":46991,"topicId":46990,"numMessagesInTopic":0,"msgSnippet":"Hi there, Im new to posting on here but have been reading all of your posts for 2 years now, and have gained a lot of insight! I know that video gaming has","messageBody":"<div id=\"ygrps-yiv-545493674\">Hi there,<br/>\nIm new to posting on here but have been reading all of your posts for 2 years <br/>\nnow, and have gained a lot of insight!<br/>\n<br/>\nI know that video gaming has been talked about before, but Im having a real hard <br/>\ntime at the moment getting all that I can remember to &#39;sink in&#39;.<br/>\n<br/>\nMy 5 yo boy and now 3 yo girl play wii A LOT! Its the first thing they want to <br/>\ndo when they get up and even if they break for a bit to eat or maybe a tad of <br/>\nlego or drawing, will always go back to wii for most of the day. Im feeling <br/>\nreally uneasy about it. We have arts n crafts about, LOTS of lego (which my boy <br/>\nalso loves), puzzles, dvds, books etc..and I offer to play them with them, and <br/>\nmy daughter usually will, but my son will decline.<br/>\n<br/>\nNow I can hear you all saying, if it were &#39;reading or puzzles&#39; he was doing all <br/>\nday, would I be as worried, and the answer is no, I wouldn&#39;t.  But isn&#39;t there a <br/>\ngenuine issue with the eyes and screen time? Is it healthy to sit in front of a <br/>\ntv all day and play wii?? <br/>\n<br/>\nI know he gains so much from the game, hes better than me at it, and the both of <br/>\nthem together are learning awesome communication & negotiation skills, BUT I <br/>\ncan&#39;t help feeling uneasy about it and if its just me I need to tend to, then <br/>\nlets DO IT! <br/>\n<br/>\nIm not concerned that hes not learning anything, as all on his own accord hes <br/>\nstarting to read, write and is very good with maths...its the &#39;screen time, <br/>\nsitting all day&#39; issue..and that I feel Im not &#39;doing&#39; enough to stimulate him <br/>\notherwise?! <br/>\n<br/>\nI just want to feel at ease (or some ease) with this and not feel constant <br/>\nanxiety about it...<br/>\n<br/>\nI appreciate any insights you wish to share<br/>\n<br/>\nThanks so much, <br/>\nJax<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":47077,"nextTopicId":47155}}