{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Intro with questions about strewing","postDate":"1225406724","msgId":36861,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdlZGRlNCtmMGM0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdlYTNocCt1MHZtQGVHcm91cHMuY29tPg=="},"prevInTopic":36860,"nextInTopic":0,"prevInTime":36860,"nextInTime":36862,"topicId":36815,"numMessagesInTopic":0,"msgSnippet":"... items. ... Going shopping together, or looking through catalogs, is a kind of strewing . Mo and I did that last night - the xmas catalogs are starting to","messageBody":"<div id=\"ygrps-yiv-1728041550\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;lyeping2008&quot; <br/>\n&lt;lyeping2008@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; My idea of strewing is not just limited to visually presented <br/>\n </span></blockquote>items. <br/>\n<blockquote><span title=\"ireply\"> &gt; It can be anything from the songs we listen to, to what we&#39;ll be <br/>\n&gt; watching, to what shall I cook for lunch or dinner. It&#39;s about <br/>\n&gt; making everything accessible. <br/>\n<br/>\n </span></blockquote>Going shopping together, or looking through catalogs, is a kind <br/>\nof &quot;strewing&quot;. Mo and I did that last night - the xmas catalogs are <br/>\nstarting to come out and we looked and looked, talked about this and <br/>\nthat, do you want one? could we make our own? There were some things <br/>\nthat reminded me of when I was a kid, and we talked about that - <br/>\nhey, I had one of those! or my uncle made one of these when he was a <br/>\nteenager... all sorts of fun family stories came up. <br/>\n<br/>\nThe most important thing to remember about strewing is to be open to <br/>\npossibilities. A picture of a tea cup can lead to buying a tea-set, <br/>\nor it could lead to learning about Japanese tea ceremony, or it <br/>\ncould lead to a conversation about ceramics and what&#39;s &quot;bone china&quot; <br/>\nand on to talking about the Great Wall of China and panda bears and <br/>\nmaking a new blanket for Teddy. <br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Intro with questions about strewing","postDate":"1225405871","msgId":36860,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdlZGNqZit2bTE3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNjNjEyMGExMDgxMDI5MTQwOXYzMjRlZGVmY203ZjAxOWJhZDNmYmVlZWI2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":36836,"nextInTopic":36861,"prevInTime":36859,"nextInTime":36861,"topicId":36815,"numMessagesInTopic":0,"msgSnippet":"... days. LOL! That happens here, too. I half-jokingly call it unstrewing. Sometimes just standing all the books back up on the book shelf, or neatly sorting","messageBody":"<div id=\"ygrps-yiv-400896842\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Faith Void&quot; <br/>\n&lt;littlemsvoid@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; My kids also make amazing discoveries when we have &quot;clean out&quot; <br/>\n </span></blockquote>days.<br/>\n<br/>\nLOL! That happens here, too. I half-jokingly call it &quot;unstrewing.&quot; <br/>\n<br/>\nSometimes just standing all the books back up on the book shelf, or <br/>\nneatly sorting the toys back into the bins (Mo loves to use the <br/>\nbins...) has the same effect as getting something entirely new - <br/>\nhey, mom, look at this! Wow! Cool! Oh, you like that? We&#39;ve had it <br/>\nfor five years, y&#39;know.<br/>\n<br/>\nOne of the questions I ask before I get rid of something is how much <br/>\nit interests *me*. Is this something I&#39;d like to read/try if I <br/>\never &quot;find the time&quot;? Those I&#39;ll keep, even if my kids seem to have <br/>\noutgrown them - like making goofy stuff with pipe cleaners. I just <br/>\nknow that One Day I&#39;ll &quot;find the time&quot; to do that! <br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"&quot;Faith Void&quot; &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Intro with questions about strewing","postDate":"1225314574","msgId":36836,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDgxMDI5MTQwOXYzMjRlZGVmY203ZjAxOWJhZDNmYmVlZWI2QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdlN2c5aStudjNsQGVHcm91cHMuY29tPg==","referencesHeader":"PGdlN2c5aStudjNsQGVHcm91cHMuY29tPg=="},"prevInTopic":36831,"nextInTopic":36860,"prevInTime":36835,"nextInTime":36837,"topicId":36815,"numMessagesInTopic":0,"msgSnippet":"... This is a great question. I find myself asking it all the time. I go by how long have we had the object/book/whatnot and how likely I think it may be used.","messageBody":"<div id=\"ygrps-yiv-1282126570\"><blockquote><span title=\"ireply\">&gt; ****How long should I wait and how often should I place these things in<br/>\n&gt; their path before donating or tossing<br/>\n&gt; them?****<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>This is a great question. I find myself asking it all the time. I go by how<br/>\nlong have we had the object/book/whatnot and how likely I think it may be<br/>\nused.<br/>\n<br/>\nFor example, I have some books about science experiments. The kids haven&#39;t<br/>\nlooked at them in months because they have been into other things. But I<br/>\nknow that winter is nearing and the colder weather means more indoor times.<br/>\nThey will likely use them in the next few months. We have the space so I<br/>\nkeep them.<br/>\n<br/>\nAnother example is ds5 was into Power Rangers but now he isn&#39;t. So I<br/>\ngathered up all the PR stuff that hasn&#39;t been touched in months and asked<br/>\nhis thoughts on moving it out. At first he wanted to keep it. So I set the<br/>\nbox aside. A few days later he came and told me that he&#39;d like to give it to<br/>\na friend that loves PR. So we did.<br/>\n<br/>\nOther examples are things I pick up for my kids that just don&#39;t interest<br/>\nthem. I let it hang out for a while, maybe even directly show it to them. If<br/>\nthere is no interest I let it go. I pick up free junk all the time so there<br/>\nis constant flow in our house. And there are 5 humans of various ages and<br/>\ninterests. I try not to form attachments to things *I* think my kids<br/>\n*should* like or be interested in. (like an awesome bird calling tape) If I<br/>\ndidn&#39;t get it for me and they don&#39;t want it, it goes. Freecycle and<br/>\ncraigslist are great place to get rid of things and try things out.<br/>\n<br/>\nAbout placing things in their path; I don&#39;t think that this is something I<br/>\neven think about (until you write it). I just show them cool stuff I find.<br/>\nMore often they are with me and pick up cool stuff along with me. If not<br/>\n(dd11 usually stays home) she greets me to see what cool stuff I have. I<br/>\nhave been finding her amazing clothes lately which makes her super happy.<br/>\nOtherwise our home is laid out to live in. We have books, toys, games, odds<br/>\nand ends, kitchen stuff, water toys, outdoor toys, you name it hanging out<br/>\nto be used in one way or another.<br/>\n<br/>\nMy mother always talks about how much *stuff* we have in our house. She has<br/>\nsuggested we minimize and make it easier to clean etc. But we like it like<br/>\nthis, full of life and creativity. We even have a project room full of weird<br/>\nstuff and art supplies.<br/>\n<br/>\nMy kids also make amazing discoveries when we have &quot;clean out&quot; days. I&#39;ll<br/>\npick out a stack of books that seems like no one wants and ask everyone to<br/>\ngo through them before I donate them. I typically find a human or two<br/>\nsitting and reading soon after. This works for toys as well. It is fun like<br/>\nan adventure in its own. We unearth cool stuff.<br/>\n<br/>\nFaith<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":357843301,"authorName":"lyeping2008","from":"&quot;lyeping2008&quot; &lt;lyeping2008@...&gt;","profile":"lyeping2008","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Intro with questions about strewing","postDate":"1225298297","msgId":36831,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdlYTNocCt1MHZtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdlN2c5aStudjNsQGVHcm91cHMuY29tPg=="},"prevInTopic":36815,"nextInTopic":36836,"prevInTime":36830,"nextInTime":36832,"topicId":36815,"numMessagesInTopic":0,"msgSnippet":"Hi There, My idea of strewing is not just limited to visually presented items. It can be anything from the songs we listen to, to what we ll be watching, to","messageBody":"<div id=\"ygrps-yiv-56516999\">Hi There,<br/>\n<br/>\nMy idea of strewing is not just limited to visually presented items. <br/>\nIt can be anything from the songs we listen to, to what we&#39;ll be <br/>\nwatching, to what shall I cook for lunch or dinner. It&#39;s about <br/>\nmaking everything accessible. <br/>\n<br/>\nIt is discussions like this that can actually triggers off alot of <br/>\nother discussions, research or activities, which can actually lead <br/>\nto picking out a cd/ dvd/ book off the shelf.   <br/>\n<br/>\nWe have books in every corner of our home, on the sofa, on the <br/>\ncoffee table, on the side of the stairs. But they are all mixed up, <br/>\nsome are mine, some my son&#39;s, some hubbies. I don&#39;t separate them. <br/>\nMy son do flick thru some of my picture books. <br/>\n<br/>\nPerhaps you can try mixing everyone&#39;s book into 1 common shelf/ <br/>\narea. This way, everybody is welcome to pick-up any book that <br/>\ncatches thier attention and you don&#39;t have to rotate them. Books <br/>\nshouldn&#39;t have age limitation on them. Anybody can pick up a book, <br/>\nand just enjoy looking thur them. <br/>\n<br/>\nI have toys anywhere and everywhere that&#39;s accessible by any child. <br/>\nThis doesn&#39;t mean they are constantly lying on the floor, tho they <br/>\ncan be most of the times. But my kid&#39;s Lego is on the coffee table <br/>\nthat&#39;s been relegated to the corner of the living room. It&#39;s on the <br/>\ndining table that is no longer in use because we prefer eating on <br/>\nthe sofa, in front of the tv. Infact, he and his little friends has <br/>\nbuilt an entire city out of Lego, on the dining table. <br/>\n<br/>\nHis transformers is in a big plastic crate on the floor in a corner. <br/>\n<br/>\nOn the dining table, we have a globe, we have game boxes stacked up, <br/>\nwe have shoes boxes filled with lots of interesting stuff labelled <br/>\non the side like playdoughs, army sets, batteries, more Lego bricks, <br/>\na vase of paintbrushes, a plastic tube of pens and pencil and <br/>\nanother stack of books with 5 boxes of mini experimental kit on top <br/>\nof it. <br/>\n<br/>\nOn my window sill, I have photographs, a microscope, a bug viewer, <br/>\nan electric motor that son built, some clay model he made, a huge <br/>\nmodel train, more books, chessmen, a vase filled with long drinking <br/>\nstraws, some Lego structures that he built and sold to me (LOL!!),  <br/>\n<br/>\nI find boxes with lids, like shoes boxes, very useful. They can be <br/>\nstacked up in a corner, helping to keep things neat and tidy without <br/>\nhaving to put it away. <br/>\n<br/>\nAnd of course, the tv is always on either on his cartoon channels or <br/>\nmy documentary/ news channels.<br/>\n <br/>\nThis is my strewing. I like evrything to be close at hand, I don&#39;t <br/>\nlike having to climb and take something off the top of the wardrobe <br/>\nor go to the shed for my kid&#39;s bike. This way, we can into alot of <br/>\nthings without any obstacles/ fuss.<br/>\n<br/>\nHope this helps<br/>\n<br/>\nSharonBugs.</div>","specialLinks":[]},{"userId":333811424,"authorName":"aspire4higher2008","from":"&quot;aspire4higher2008&quot; &lt;aspire4higher@...&gt;","profile":"aspire4higher2008","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Intro with questions about strewing","postDate":"1225213042","msgId":36815,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdlN2c5aStudjNsQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":36831,"prevInTime":36814,"nextInTime":36816,"topicId":36815,"numMessagesInTopic":0,"msgSnippet":"I am quite hesitant to post because the other boards I belong to can be quite honest and brutal though I know they mean well.  I am a mother of 4 beautiful,","messageBody":"<div id=\"ygrps-yiv-1915111100\">I am quite hesitant to post because the other boards I belong to can <br/>\nbe quite honest and brutal though I know they mean well.  I am a <br/>\nmother of 4 beautiful, creative, free spirits.  I have not yet made <br/>\nthe &quot;switch&quot; to unschooling though I am slowly adding elements to our <br/>\nlife.  I love the ideology of John Holt and unschooling, and there <br/>\nare many moments in our daily life where I can see how unschooling <br/>\nworks.  I am coming to realize that learning is hard-wired and my dc <br/>\nare naturally inquisitive and fearless.  Unfortunately, I am still <br/>\nway too neurotic to be radical yet, but that is the direction I would <br/>\nlike to take.       <br/>\nMy question is regarding strewing. I have read several posts on it, <br/>\nincluding Sandra Dodd&#39;s website.  I am limited on where I can place <br/>\nthings (we have a very small home,1000sq. ft) Currently, I have a bin <br/>\nof odds and ends on a livingroom table.  I will place bits of puzzles <br/>\nand prized objects on the kid&#39;s bedroom table.  Each child has a <br/>\nraingutter bookshelf near their bed that I will rotate books and <br/>\nsuch.  How often do you change out the old.  I wait and watch and if <br/>\nthe kids are interested and use what is it, I leave it.  If not, I <br/>\nleave it out for awhile (1 -2 weeks) and then switch it around <br/>\nagain.  I am constantly watching and I realize that we have stuff <br/>\nthat never has been used.  How long should I wait and how often <br/>\nshould I place these things in their path before donating or tossing <br/>\nthem?</div>","specialLinks":[]}],"prevTopicId":36859,"nextTopicId":36730}}