{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":117369878,"authorName":"Kelli Traaseth","from":"Kelli Traaseth &lt;kellitraas@...&gt;","profile":"kellitraas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Re: Why is it a positive to not have a  tv? (was: things a 4 y/o ...)","postDate":"1185970037","msgId":25390,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwMzQ4Ny45MTQ3MC5xbUB3ZWI1MTExMC5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":25389,"nextInTopic":0,"prevInTime":25389,"nextInTime":25391,"topicId":25253,"numMessagesInTopic":0,"msgSnippet":"Maybe words from Scott Noelle can address these concerns.  He puts things so well.  I m sure a lot of people here get his e-mails but this one really addressed","messageBody":"<div id=\"ygrps-yiv-1257780061\">Maybe words from Scott Noelle can address these concerns.  He puts things so well.  I&#39;m sure a lot of people here get his e-mails but this one really addressed what I was trying to say as far as TV discomfort.  I think it can be applied to any of our own discomforts though.  Video game playing and TV watching tend to come to mind, I know I used to be there with those things. :)<br/>\n<br/>\n<br/>\nTHE DAILY GROOVE ~ by Scott Noelle<br/>\nwww.enjoyparenting.com/dailygroove<br/>\n<br/>\n:: The Canary In the Coal Mine ::<br/>\n<br/>\nLong ago, miners avoided death by bringing<br/>\n canaries<br/>\ninto the coal mines. The sensitive songbirds<br/>\n would<br/>\nreact to small amounts of toxic gases, thereby<br/>\nalerting the miners to the invisible danger.<br/>\n<br/>\nIn a way, our children provide a similar service.<br/>\nWe&#39;ve been so conditioned to tolerate stress that<br/>\n we<br/>\noften fail to seek relief from it, but our<br/>\n sensitive<br/>\nchildren have no such tolerance. They often feel<br/>\n*our* stress before *we* do!<br/>\n<br/>\nSo when your child seems particularly irritable<br/>\n and<br/>\nreactive, it&#39;s a good idea to ask yourself<br/>\n whether<br/>\ns/he might be reflecting *your* stress. Check in<br/>\nwith your body and emotions, and let yourself<br/>\n *feel*<br/>\nwhat&#39;s there.<br/>\n<br/>\nSeek the fresh air of soothing, stress-free<br/>\nthoughts, and then bless your child for keeping<br/>\n you<br/>\nin touch with your Inner Guidance.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://dailygroove.net/canary\">http://dailygroove.net/canary</a><br/>\n<br/>\n**********************************<br/>\n<br/>\nSo maybe it&#39;s not the TV or the game or the &quot;what-ever&quot;<br/>\n that&#39;s causing the stress?<br/>\n<br/>\nMaybe it&#39;s our own stress over these things?<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  Kelli~<br/>\n<br/>\n   <br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://ourjoyfullife.blogspot.com/\">http://ourjoyfullife.blogspot.com/</a>  <br/>\n<br/>\n&quot;Life shrinks or expands in proportion to one&#39;s courage.&quot;  ~Anais Nin<br/>\n<br/>\n<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nMoody friends. Drama queens. Your life? Nope! - their life, your story.<br/>\n Play Sims Stories at Yahoo! Games. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":117369878,"authorName":"Kelli Traaseth","from":"Kelli Traaseth &lt;kellitraas@...&gt;","profile":"kellitraas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Why is it a positive to not have a  tv? (was: things a 4 y/o ...)","postDate":"1185967577","msgId":25389,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI2NDA5LjY1OTg2LnFtQHdlYjUxMTA4Lm1haWwucmUyLnlhaG9vLmNvbT4="},"prevInTopic":25280,"nextInTopic":25390,"prevInTime":25388,"nextInTime":25390,"topicId":25253,"numMessagesInTopic":0,"msgSnippet":"****So any helpful advice?  Is my unschooling 6 year old sub-par because she hasn t figured this stuff out on her own compared to your unschooling 6 year olds?","messageBody":"<div id=\"ygrps-yiv-1404941537\">****So any helpful advice?  Is my unschooling 6 year old sub-par because <br/>\n she hasn&#39;t figured this stuff out on her own compared to your <br/>\n unschooling 6 year olds? (just kidding, just so you know) What am I <br/>\n doing wrong? Or what aren&#39;t I doing wrong?****<br/>\n<br/>\nI think it&#39;s all in how we react to it.  I used to think my daughter wanted everything she was excited about and I would get this defensive feeling, like..&quot;she wants to buy that too??&quot;  But one time she told me off,  saying, &quot;just because I&#39;m showing you this or talking about it doesn&#39;t mean I have to have it or buy it!&quot;  &lt;g&gt;  She just gets excited seeing new cool things.  I&#39;m the same way.<br/>\n<br/>\nSo maybe you could just share her excitement and joy for things without all your thoughts about what the TV people are doing.  You say you aren&#39;t fearful of it all but what ever feelings you are having, I&#39;m sure they&#39;re still coming across to your daughter.  I know we can&#39;t and don&#39;t want to mask all of our emotions, but to see why she&#39;s interested in those certain things might bring you closer to where she&#39;s at.  It might bring you out of your position and thinking about TV and into sharing her joy.<br/>\n<br/>\n***Of course we gently discuss commercials and obvious <br/>\n advertising, usually by answering her questions rather than <br/>\n initiating it ourselves. That part is easy. But I do struggle with <br/>\n how to talk to her about how consumerism in a larger sense is being <br/>\n relentlessly promoted on tv. ****<br/>\n<br/>\nI think the easy part that you are referring to is what you should continue doing.  And then let her think about it.  She might not agree with you on your opinion.  Even if the TV industry is doing what you say, (I don&#39;t know many people in that industry) I think kids are pretty savvy and your daughter will figure it out too.  Just be available to her and answer her questions. (like you said )  Maybe it will even take a purchase or two to figure it out. ;)  And that&#39;s ok too,  my girls soo wanted &quot; The Original Chocolate Factory&quot;  The ads made this little sauce pan and accessories look so awesome.  So we got it.  They were so excited when they received it in the mail and we had some fun with it.  It probably wasn&#39;t as great as they thought it was going to be but we still had some fun.  They have made some other decisions based on that and other purchases.  It&#39;s all been OK.  I&#39;ve helped pay and they&#39;ve paid,  both options and they are getting more savvy about it all the<br/>\n time.  They are 10 and 12 now.<br/>\n<br/>\nFor us, just looking at TV as another resource seems to go pretty well.  The selling and promoting is going to be everywhere.  There are different radio shows that I wouldn&#39;t want to listen to also that are trying to sell certain ideas.  There are books that are also trying do the same thing.  But we can choose not to read them or turn off the TV or radio.  We can then in turn go back and listen to or watch something that we feel is valuable.  That way it doesn&#39;t have to have this big power over us.<br/>\n<br/>\nIt&#39;s like a big smorgasbord of choices!   That&#39;s why I love this RU life.  :)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  Kelli~<br/>\n<br/>\n   <br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://ourjoyfullife.blogspot.com/\">http://ourjoyfullife.blogspot.com/</a>  <br/>\n<br/>\n&quot;Life shrinks or expands in proportion to one&#39;s courage.&quot;  ~Anais Nin<br/>\n<br/>\n<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nBoardwalk for $500? In 2007? Ha! <br/>\nPlay Monopoly Here and Now (it&#39;s updated for today&#39;s economy) at Yahoo! Games.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"[Bulk] Re: [unschoolingbasics] Re: Why is it a positive to not have a  tv? (was: things a 4 y/o ...)","postDate":"1185806902","msgId":25280,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY4a3RubStlNDZkQGVHcm91cHMuY29tPg=="},"prevInTopic":25270,"nextInTopic":25389,"prevInTime":25279,"nextInTime":25281,"topicId":25253,"numMessagesInTopic":0,"msgSnippet":"... I think you re missing the point that unschooling isn t about education . I m not using tv as an educational tool any more than I am cooking. I don t","messageBody":"<div id=\"ygrps-yiv-474370008\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Emilie &lt;erugard@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; not some unschooling educational panacea<br/>\n<br/>\n </span></blockquote>I think you&#39;re missing the point that unschooling isn&#39;t <br/>\nabout &quot;education&quot;. I&#39;m not using tv as an &quot;educational tool&quot; any <br/>\nmore than I am cooking. I don&#39;t say to my kids &quot;lets turn the tv on <br/>\nand learn something&quot; &lt;gag&gt;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;A lot can be learned from tv too, if you <br/>\n&gt; realize that every programme, be it history, nature, news, drama <br/>\n </span></blockquote>etc. <br/>\n<blockquote><span title=\"ireply\"> &gt; is trying to manipulate the way you think to some corporate <br/>\n&gt; advantage. When kids understand this, they can find out the real <br/>\n&gt; truth, through real research.<br/>\n<br/>\n </span></blockquote>Try coming at this from a different direction... when kids aren&#39;t <br/>\nexpected to swallow adult bs hook-line-and-sinker on a daily basis, <br/>\nthey tend not to blindly accept things at face-value. They form <br/>\ntheir own theories and test them in the real world. Why should my <br/>\nkids believe *anything* they see or hear or read? They have the <br/>\nopportunity to test the trustworthiness of *my* words, after all, <br/>\nand the opportunity to disagree with me, to offer their own <br/>\nattitudes and ideas and have me consider them seriously. They know <br/>\nthat their own words and thoughts are *as* valuble as adult words <br/>\nand thoughts. That makes a big difference in the way they approach <br/>\n*any* kind of information. <br/>\n<br/>\n---Meredith (Mo 5.5, Ray 13)</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Bulk] Re: [unschoolingbasics] Re: Why is it a positive to not have a  tv? (was: things a 4 y/o ...)","postDate":"1185787323","msgId":25270,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY3Qzc3QjJDLTUzRTQtNDI2Ni05REI4LTNFMDEyODlFOUM0M0BlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDcwNzI5MjI1OC4xaWZsc1Exbk4zTmwzNnYwQG14LWhhcnJpcy5hdGwuc2EuZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDY1NzMyMy4yMTYwOS5xbUB3ZWI1MzgxMS5tYWlsLnJlMi55YWhvby5jb20+IDwyMDA3MDcyOTIyNTguMWlmbHNRMW5OM05sMzZ2MEBteC1oYXJyaXMuYXRsLnNhLmVhcnRobGluay5uZXQ+"},"prevInTopic":25258,"nextInTopic":25280,"prevInTime":25269,"nextInTime":25271,"topicId":25253,"numMessagesInTopic":0,"msgSnippet":"... They don t need to know this any more than they need to know that 2+2=4. Like 2+2=4 we can point it out, but it helps learning hugely to *trust* that kids","messageBody":"<div id=\"ygrps-yiv-356669418\">On Jul 29, 2007, at 10:29 PM, Emilie wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Again I<br/>\n&gt; AM NOT ADVOCATING RESTRICTING ACCESS, just pointing out that kids<br/>\n&gt; need to know that EVERYTHING on tv is actually advertising and<br/>\n&gt; propaganda<br/>\n<br/>\n </span></blockquote>They don&#39;t need to know this any more than they need to know that 2+2=4.<br/>\n<br/>\nLike 2+2=4 we can point it out, but it helps learning hugely to  <br/>\n*trust* that kids are intelligent enough to put the pieces together  <br/>\nand will form an understanding.<br/>\n<br/>\nYou&#39;re treating this like brain surgery. It isn&#39;t. It really doesn&#39;t  <br/>\ntake that much brain power to realize that a real brand name  <br/>\nmentioned in a TV show is an ad and not a public endorsement of the  <br/>\nsuperiority of that product.<br/>\n<br/>\nMy daughter even pointed out during a Gilmore Girls episode that the  <br/>\nexpert car guy wouldn&#39;t be showing Lorelei Fords.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; put out by corporations who are trying to manipulate us.<br/>\n<br/>\n </span></blockquote>And what&#39;s the return rate for all their dollars spent?<br/>\n<br/>\nPeople see all the money spent on advertising and think that much  <br/>\nmoney must be powerful. But in truth the spend so much because it  <br/>\ntakes that much just to make any kind of impact.<br/>\n<br/>\nWe had this discussion recently and someone said 2-3% are influenced  <br/>\nto try something.<br/>\n<br/>\nAnd, really, look at what you&#39;re saying. *So what* if they&#39;re trying  <br/>\nto manipulate us? You&#39;re treating it like it is working like a charm  <br/>\nand we turn into creatures who blindly buy what we&#39;re told to buy.<br/>\n<br/>\nIs that true? I honestly don&#39;t know anyone like that. Advertising can  <br/>\n*intrigue* me about a product but it can&#39;t convince me that it&#39;s  <br/>\nsuperior once I&#39;ve tried it. The performance of the product does  <br/>\nthat. It can&#39;t make me turn my brain off and buy what I&#39;m told  <br/>\nwithout regard to quality.<br/>\n<br/>\nHere&#39;s a good example. I probably wouldn&#39;t have tried Fructis shampoo  <br/>\nwithout the ads and that awesome song. (Though the real, full version  <br/>\nof the song is pretty nasty ;-) I have bought more because while it  <br/>\nisn&#39;t better than anything else, it does work -- and it reminds me of  <br/>\nthe song when I see the bottle ;-) What&#39;s wrong with that? Where&#39;s  <br/>\nthe danger? If the product didn&#39;t work, I wouldn&#39;t buy it again. The  <br/>\nadvertising got me to *try* something I wouldn&#39;t have. The product  <br/>\nitself (and the song) encourage me to keep buying it. I haven&#39;t been  <br/>\nduped into believing something that&#39;s inferior is actually superior.  <br/>\nI&#39;m not unaware of why I&#39;m buying it.<br/>\n<br/>\nGive people more credit than that! I&#39;m even a product of school and  <br/>\nconventional parents who never gave me the advertising talk ;-). Even  <br/>\nso I figured out advertising.<br/>\n<br/>\nIf you step back objectively, and look at your own behavior, you are  <br/>\nacting as you fear we are. You&#39;re reading the propaganda of the anti- <br/>\nadvertising people and believing it over what your own eyes see in  <br/>\nyour friends and neighbors. Do you see real people you actually know  <br/>\n-- not the statistics in the propaganda -- who behave as you fear  <br/>\npeople will? I don&#39;t even see *kids* do that. Parents fear kids have  <br/>\nbeen influenced because they ask for what they&#39;ve seen. But that&#39;s  <br/>\nwhat adults do too. But kids aren&#39;t stupid. If something doesn&#39;t work  <br/>\nas advertised, they don&#39;t keep buying the product. They don&#39;t keep on  <br/>\ntrusting that what they see on TV is truth.<br/>\n<br/>\nPlease give kids more credit for intelligence than that. Unschooling  <br/>\ncan&#39;t flourish if you&#39;re so distrusting of children&#39;s intelligence.<br/>\n<br/>\nAnd by trust don&#39;t assume it means stepping back and assuming kids  <br/>\nwill figure out the world on their own! We need to be there for them.  <br/>\nBut truly all it takes is picking out the techniques advertisers use  <br/>\nin a fun way for kids to catch on. It&#39;s a very simple concept.<br/>\n<br/>\n(What *does* though happen with TV is that parents start saying no to  <br/>\nwhat kids ask for because they fear the kids have been influenced and  <br/>\nwant to nip that in the bud. But what&#39;s truly going on is that kids  <br/>\nrealize that if they&#39;re only going to get 1 out of every 10 things  <br/>\nthey ask for, then they need to ask a lot more to get what they want.  <br/>\nThat&#39;s the power of no. It makes advertising feel a lot more  <br/>\neffective than it is! If we just buy what the kids are asking for and  <br/>\ntrust their intelligence (and be there with them for support as they  <br/>\nexplore) they will figure out advertising *much* quicker than kids of  <br/>\nparents who say no.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But we shouldn&#39;t be singing it&#39;s praises to them and claiming<br/>\n&gt; that it is a way to access some great wealth of knowledge either<br/>\n<br/>\n </span></blockquote>Because you fear TV advertising so much, you are reading  <br/>\nunconditional praise because we aren&#39;t including your fears with  <br/>\nevery mention of TV.<br/>\n<br/>\nWe trust kids are intelligent. We are with our kids, not filling them  <br/>\nwith fears, but exploring how the world works.<br/>\n<br/>\nIt isn&#39;t as difficult to understand as you are painting it to be. It  <br/>\ntakes a moment to point out an advertising technique and have fun  <br/>\nexploring that with kids.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":299902014,"authorName":"Emilie","from":"Emilie &lt;erugard@...&gt;","profile":"breathemama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [Bulk] Re: [unschoolingbasics] Re: Why is it a positive to  not have a  tv? (was: things a 4 y/o ...)","postDate":"1185762567","msgId":25258,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDY1NzMyMy4yMTYwOS5xbUB3ZWI1MzgxMS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDY1NzMyMy4yMTYwOS5xbUB3ZWI1MzgxMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":25253,"nextInTopic":25270,"prevInTime":25257,"nextInTime":25259,"topicId":25253,"numMessagesInTopic":0,"msgSnippet":"My point about tv is that it s ALL advertising -even the programmes. We are the product that is being bought whether we buy a something or not. It is like","messageBody":"<div id=\"ygrps-yiv-583048509\">My point about tv is that it&#39;s ALL advertising -even the programmes. <br/>\nWe are the product that is being bought whether we buy a something or <br/>\nnot. It is like buying billboard space in our homes. They are buying <br/>\naccess to us. It is only because advertisers. product placers, and <br/>\ncorporations pay for tv that it even exists. You don&#39;t have to buy <br/>\ntheir stuff to be the product, all you have to do is watch. Again I <br/>\nAM NOT ADVOCATING RESTRICTING ACCESS, just pointing out that kids <br/>\nneed to know that EVERYTHING on tv is actually advertising and <br/>\npropaganda put out by corporations who are trying to manipulate us. <br/>\nKids know this about commercials, but they often don&#39;t know it about <br/>\nthe actual programmes they watch. In the same way that schools <br/>\npretend to educate, tv pretends to educate. I learned a lot in <br/>\nschool, despite the system. A lot can be learned from tv too, if you <br/>\nrealize that every programme, be it history, nature, news, drama etc. <br/>\nis trying to manipulate the way you think to some corporate <br/>\nadvantage. When kids understand this, they can find out the real <br/>\ntruth, through real research.<br/>\nI felt pretty betrayed when I discovered that all the nature shows I <br/>\nwatched when I was a kid were staged and the explanations given for <br/>\nanimal behavior were all grossly incorrect, and often politically <br/>\nmotivated.  20 years later nature shows are still staged and <br/>\ninaccurate.  I am not saying that we should restrict our kids access <br/>\nto tv. But we shouldn&#39;t be singing it&#39;s praises to them and claiming <br/>\nthat it is a way to access some great wealth of knowledge either. A <br/>\nmore neutral stance would serve them better. I fully support the <br/>\nrights of kids to choose when and what to watch. But, the pro -tv <br/>\nstuff I have been reading here lately is pretty over the top. It is <br/>\nnot some unschooling educational panacea, it is how corporations <br/>\naccess people.<br/>\n<br/>\nEmilie<br/>\n<br/>\nAt 09:02 PM 29/07/2007, you wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;It is a corporate device for the delivery of advertising and we the <br/>\n&gt;viewers are the product that the advertisers are buying with their money.<br/>\n&gt;<br/>\n&gt;****<br/>\n&gt;We the viewers are simply the product the advertisers are HOPING to <br/>\n&gt;buy. We can&#39;t be sold without our consent, whether informed or <br/>\n&gt;passive. But just placing the ad does not guarantee the advertisers <br/>\n&gt;that they OWN us.<br/>\n&gt;<br/>\n&gt;****<br/>\n&gt;<br/>\n&gt;Now, I know that everybody thinks they are so media savvy that they <br/>\n&gt;can see right through the ads, but they affect us all, children too <br/>\n&gt;(if not particularly) in ways we don&#39;t understand. The advertisers <br/>\n&gt;are not stupid.... The plots revolve around product placement and <br/>\n&gt;merchandising. My husband works in the business and it is startling <br/>\n&gt;the degree to which this is true, particularly in children&#39;s programming.<br/>\n&gt;<br/>\n&gt;*****<br/>\n&gt;And when our kids see these commercials, they ask all kinds of <br/>\n&gt;questions I couldn&#39;t think to anticipate. Those questions present <br/>\n&gt;learning moments no one could plan into a curriculum.<br/>\n&gt;<br/>\n&gt;Our kids will be bombarded with commercials as adults - and I won&#39;t <br/>\n&gt;be there to explain the nuances, stereotypes and methods of the <br/>\n&gt;pitch. If one buys the argument that commercials on TV are a <br/>\n&gt;potential danger to kids, then I&#39;d much rather we encounter that <br/>\n&gt;danger while they&#39;re still living at home, still looking to me for <br/>\n&gt;my insights. I don&#39;t want that to be an issue they grapple with <br/>\n&gt;after they&#39;ve left home, or shut me out because I showed my lack of <br/>\n&gt;trust in their intelligence by limiting their viewing choices.<br/>\n&gt;<br/>\n&gt;****<br/>\n&gt;We do our kids a disservice if we give them free access to <br/>\n&gt;television with little information about it&#39;s true nature. In this <br/>\n&gt;way, I think tv is similar to school. It has it&#39;s own agenda, and it <br/>\n&gt;is not set up for the benefit the people who use it.<br/>\n&gt;<br/>\n&gt;****<br/>\n&gt;I haven&#39;t seen anyone here advocating that kids be given access to <br/>\n&gt;TV with little info about the true nature of advertising. We&#39;ve all <br/>\n&gt;talked about how TV viewing kicks off conversation about a million <br/>\n&gt;different things -- from truth in advertising, to stereotypes (in <br/>\n&gt;both shows & ads), to historical content as it really happened vs <br/>\n&gt;how it&#39;s presented in schools and popular perceptions, to morals and <br/>\n&gt;why people make the choices they make, and so much more than I can <br/>\n&gt;think of right now.<br/>\n&gt;<br/>\n&gt;Sylvia<br/>\n&gt;<br/>\n&gt;&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ourhapahome.blogspot.com\">http://www.ourhapahome.blogspot.com</a>&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ourhapahome.blogspot.com\">http://www.ourhapahome.blogspot.com</a><br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.myeverydaysacred.blogspot.com\">http://www.myeverydaysacred.blogspot.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;---------------------------------<br/>\n&gt;Yahoo! oneSearch: Finally, mobile search that gives answers, not web links.<br/>\n&gt;<br/>\n&gt;[Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Re: Why is it a positive to not have a  tv? (was: things a 4 y/o ...)","postDate":"1185757355","msgId":25253,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1NzMyMy4yMTYwOS5xbUB3ZWI1MzgxMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":25258,"prevInTime":25252,"nextInTime":25254,"topicId":25253,"numMessagesInTopic":0,"msgSnippet":"It is a corporate device for the delivery of advertising and we the viewers are the product that the advertisers are buying with their money. **** We the","messageBody":"<div id=\"ygrps-yiv-595163764\">It is a corporate device for the delivery of advertising and we the viewers are the product that the advertisers are buying with their money. <br/>\n   <br/>\n  ****<br/>\n  We the viewers are simply the product the advertisers are HOPING to buy.  We can&#39;t be sold without our consent, whether informed or passive.  But just placing the ad does not guarantee the advertisers that they OWN us. <br/>\n   <br/>\n  ****<br/>\n   <br/>\n  Now, I know that everybody thinks they are so media savvy that they can see right through the ads, but they affect us all, children too (if not particularly) in ways we don&#39;t understand. The advertisers are not stupid.... The plots revolve around product placement and merchandising. My husband works in the business and it is startling the degree to which this is true, particularly in children&#39;s programming. <br/>\n   <br/>\n  *****<br/>\n  And when our kids see these commercials, they ask all kinds of questions I couldn&#39;t think to anticipate.  Those questions present learning moments no one could plan into a curriculum.  <br/>\n   <br/>\n  Our kids will be bombarded with commercials as adults - and I won&#39;t be there to explain the nuances, stereotypes and methods of the pitch.  If one buys the argument that commercials on TV are a potential danger to kids, then I&#39;d much rather we encounter that danger while they&#39;re still living at home, still looking to me for my insights.  I don&#39;t want that to be an issue they grapple with after they&#39;ve left home, or shut me out because I showed my lack of trust in their intelligence by limiting their viewing choices. <br/>\n   <br/>\n  ****<br/>\n  We do our kids a disservice if we give them free access to television with little information about it&#39;s true nature. In this way, I think tv is similar to school. It has it&#39;s own agenda, and it is not set up for the benefit the people who use it.<br/>\n<br/>\n****<br/>\n  I haven&#39;t seen anyone here advocating that kids be given access to TV with little info about the true nature of advertising.  We&#39;ve all talked about how TV viewing kicks off conversation about a million different things -- from truth in advertising, to stereotypes (in both shows & ads), to historical content as it really happened vs how it&#39;s presented in schools and popular perceptions, to morals and why people make the choices they make, and so much more than I can think of right now. <br/>\n   <br/>\n  Sylvia<br/>\n   <br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ourhapahome.blogspot.com\">http://www.ourhapahome.blogspot.com</a><br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.myeverydaysacred.blogspot.com\">http://www.myeverydaysacred.blogspot.com</a><br/>\n  <br/>\n <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nYahoo! oneSearch: Finally,  mobile search that gives answers, not web links. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":25375,"nextTopicId":25391}}