{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":220041937,"authorName":"Heather","from":"Heather &lt;hbmccarty@...&gt;","profile":"heathermccarty1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Question about 16 yo dd","postDate":"1244374699","msgId":40414,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBMkJBNkFCLjIwMzAyMDhAdHdjbnkucnIuY29tPg==","inReplyToHeader":"PDFFMDRCMDVGLTRGQkMtNDQ1NS1BNTcyLTAzMjhGQTQ4OTIwMUB2ZXJpem9uLm5ldD4=","referencesHeader":"PDM0NkY3QUI5RTBEMTQ5RDlCMkI3RUVFMzk0MkJDNEJBQHJvYnlQQz4gPDFFMDRCMDVGLTRGQkMtNDQ1NS1BNTcyLTAzMjhGQTQ4OTIwMUB2ZXJpem9uLm5ldD4="},"prevInTopic":40413,"nextInTopic":0,"prevInTime":40413,"nextInTime":40415,"topicId":40394,"numMessagesInTopic":0,"msgSnippet":"We have a teen movie night in our area that has been really successful - it is not just unschooled teens, but homeschooled ones as well. The kids can attend","messageBody":"<div id=\"ygrps-yiv-732214831\">We have a teen movie night in our area that has been really successful - <br/>\nit is not just unschooled teens, but homeschooled ones as well. The kids <br/>\ncan attend and just watch the movie, and that gives them lots of time to <br/>\nobserve and join in when they are comfortable. The family that started <br/>\nit was very peristent though only a few kids showed up to begin with. <br/>\nNow over 20 attend. The kids take turns picking movies, and they order <br/>\npizza.<br/>\n<br/>\nThe kids seem to all enjoy being really silly and physically playful <br/>\ntogether, which could be shallow, I don&#39;t know? My kids, who both take a <br/>\npretty long time to get to know others, really love it. They really <br/>\nthrive and smile so I think that is good though they aren&#39;t neccesarily <br/>\ntalking about serious subjects. Though maybe I just don&#39;t hear that part!<br/>\n<br/>\nIf my kids, who are now 12 and 16, are expressing that they want more <br/>\nfriends, which they do, I will look into all kinds of places they could <br/>\ngo to meet people, both just social events, and things they would be <br/>\ninterested in, and they can decide which works for them. We have also <br/>\nstarted a few events ourselves. This summer we have started a teen park <br/>\nday for homeschoolers, it has met once so far, and will meet weekly, or <br/>\nthat is what we plan. The kids skateboarded, played on a playground, and <br/>\nplayed Apples to Apples. The Apples to Apples club this spring was a <br/>\ngreat success - this is a great group game that encourages talk and <br/>\nlaughing. Also a Cardboard Boat buidling class was a good social event, <br/>\nas the kids worked in groups to build their boats for the Regatta. And I <br/>\nagree - having events that allow space for talking while providing <br/>\nsomething to do work well. I have organized a drawing group and <br/>\nspecifically encourage lots of talking- I really enjoy the silly talk <br/>\nwith the kids as well. Not sure what the other parents think.&lt;g&gt;<br/>\n<br/>\nAlso, relaxing and trusting that the right opportunity is out there can <br/>\nreally help a lot- feeling really desperate for friends is not usually a <br/>\ngood place from which to attract others! So talking through all that, if <br/>\nthe teen is open to it, is really helpful. My son, 16, has some &quot;speech <br/>\ndisfluencies&quot; - where he can not at times say certain words - kind of a <br/>\nstutter - this makes it really difficult to meet new people. Writing out <br/>\nsomething that he wants to say has helped- and  being involved in <br/>\nphysical activities and music works well for him.<br/>\n<br/>\nHeather (in NY)<br/>\n<br/>\n<br/>\n<br/>\nJoyce Fetteroll wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt;<br/>\n&gt; On Jun 5, 2009, at 10:16 PM, &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hunnybunnies5@...\">hunnybunnies5@...</a> <br/>\n&gt; &lt;mailto:hunnybunnies5%40verizon.net&gt;<br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hunnybunnies5@...\">hunnybunnies5@...</a> &lt;mailto:hunnybunnies5%40verizon.net&gt;&gt; wrote:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Have you tried starting a book club or a movie night? Maybe if<br/>\n&gt; someone here has done that, they have some tips about what worked and<br/>\n&gt; what didn&#39;t work. I have a friend who has been doing a movie night<br/>\n&gt; for a couple of years. I could ask her if she might write about it if<br/>\n&gt; you&#39;re interested.<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Question about 16 yo dd","postDate":"1244369621","msgId":40413,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFFMDRCMDVGLTRGQkMtNDQ1NS1BNTcyLTAzMjhGQTQ4OTIwMUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDM0NkY3QUI5RTBEMTQ5RDlCMkI3RUVFMzk0MkJDNEJBQHJvYnlQQz4=","referencesHeader":"PDM0NkY3QUI5RTBEMTQ5RDlCMkI3RUVFMzk0MkJDNEJBQHJvYnlQQz4="},"prevInTopic":40402,"nextInTopic":40414,"prevInTime":40412,"nextInTime":40414,"topicId":40394,"numMessagesInTopic":0,"msgSnippet":"On Jun 5, 2009, at 10:16 PM,  ... Frustrated more than lonely. We did things together, her dad did things with her she loved doing","messageBody":"<div id=\"ygrps-yiv-564207017\">On Jun 5, 2009, at 10:16 PM, &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hunnybunnies5@...\">hunnybunnies5@...</a>&gt;  <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hunnybunnies5@...\">hunnybunnies5@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; did you dd ever feel lonely when she had a hard time finding friends?<br/>\n<br/>\n<br/>\n </span></blockquote>Frustrated more than lonely. We did things together, her dad did  <br/>\nthings with her she loved doing so she wasn&#39;t lonely. But she was  <br/>\nfrustrated that she didn&#39;t have more time with people who liked to do  <br/>\nthe things she did with her best friend.<br/>\n<br/>\nShe has the advantage of being a social introvert so she has lots of  <br/>\nsolitary interests, but she also enjoys spending time with people (on  <br/>\nher schedule ;-).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So is this what unschooling teens normally go through -- they have  <br/>\n&gt; less friendships with peers their age because they are usually more  <br/>\n&gt; mature?<br/>\n<br/>\n<br/>\n </span></blockquote>I would say it&#39;s not unusual but it shouldn&#39;t be surprising to hear  <br/>\nof unschooled teens who do have a tight circle of friends. Some  <br/>\npeople just like being with people of a certain personality so a  <br/>\ndynamic will draw them together.<br/>\n<br/>\nIt can be harder to find people with the same interests, especially  <br/>\nnow when there are way more things to be interested in! ;-)<br/>\n<br/>\nHave you tried starting a book club or a movie night? Maybe if  <br/>\nsomeone here has done that, they have some tips about what worked and  <br/>\nwhat didn&#39;t work. I have a friend who has been doing a movie night  <br/>\nfor a couple of years. I could ask her if she might write about it if  <br/>\nyou&#39;re interested.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; when the main actors are on stage rehearsing, and the rest of the  <br/>\n&gt; cast are just waiting around, she&#39;s always felt left out, while the  <br/>\n&gt; others stick to their little group of friends. She just ends up  <br/>\n&gt; reading a book. It&#39;s probably for the same reason you mentioned  <br/>\n&gt; above -- she finds their talk somewhat shallow. Even though they&#39;re  <br/>\n&gt; homeschoolers.<br/>\n<br/>\n<br/>\n </span></blockquote>There&#39;s a skill to joining into groups that I don&#39;t have. My daughter  <br/>\nfigured it out somehow!<br/>\n<br/>\nAre all the kids drawn into groups? Are all the kids equally engaged  <br/>\nin the groups? Those might be something for her to look for.  For  <br/>\nthose with unsure social skills, a solitary person can look as though  <br/>\nthey want to be alone (as you daughter does when she&#39;s reading but  <br/>\neven sometimes kids just standing and watching) when really they&#39;d  <br/>\nlike to talk. Sometimes kids can join a group just because they want  <br/>\nthe interaction but they may not be enjoying the talk. But it looks  <br/>\nlike the group is tight knit and exclusive. So there might be kids  <br/>\nshe&#39;d enjoy talking who&#39;d enjoy talking to her but they&#39;re not  <br/>\nconnecting because of false social clues and not knowing how to get  <br/>\naround them.<br/>\n<br/>\nIt could be the most overtly social are directing the talk in shallow  <br/>\ndirections because that&#39;s what they like and the rest are just  <br/>\nfollowing along because they want the social connection but don&#39;t  <br/>\nhave the skills to take charge. How to break into that, I have no  <br/>\nclue. But some people have that skill! :-) Maybe you could ask around  <br/>\nif that&#39;s what your daughter wants.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":346820406,"authorName":"hunnybunnies5@verizon.net","from":"&lt;hunnybunnies5@...&gt;","profile":"shelleydaez","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Question about 16 yo dd","postDate":"1244255941","msgId":40402,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4RTVDRjUwRUQ5ODQ4Q0Q4Mjk5NjBCOTc3ODcxQ0JEQHJvYnlQQz4="},"prevInTopic":40401,"nextInTopic":40413,"prevInTime":40401,"nextInTime":40403,"topicId":40394,"numMessagesInTopic":0,"msgSnippet":"Meredith, Thanks, too, for your wonderful advice!  Please see my comments below in BLUE.  ~  Shelley ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Its not","messageBody":"<div id=\"ygrps-yiv-2076509622\">Meredith,<br/>\n<br/>\nThanks, too, for your wonderful advice!  Please see my comments below in BLUE.  ~  Shelley<br/>\n<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\n<br/>\n<br/>\nIts not abnormal. Ray doesn&#39;t have much of anything in common with kids his age<br/>\nunless they are unschoolers or pretty laid-back homeschoolers. <br/>\n<br/>\n***  Thank you for sharing this.  Since we unschool, it&#39;s hard for my dd to make friends even with regular homeschoolers.  This could both be an advantage and a disadvantage -- an advantage in that she dosn&#39;t have to deal with other teens&#39; shallow talk, a disadvantage in that she gets lonesome for someone who shares her interest and maturity level.<br/>\n<br/>\n<br/>\nHe has better luck making friends with people who have similar interests, and those <br/>\ntend to be adults. High school kids have a pretty narrow range of interests, social skills,<br/>\nand emotional skills too - they can&#39;t help that, they live pretty confined lives.<br/>\n<br/>\n***  Yes, as I mentioned in my earlier post to Joyce, she&#39;s mostly with adults or little kids, whom she adores.<br/>\n<br/>\nI love Montessori in general, but I think its really important not to get too<br/>\nlocked into the idea of stages of development. Not that I don&#39;t think there are<br/>\nsuch things, but they&#39;re really very fluid and complex and dependent on other<br/>\nfactors (personality, temperament, environment) besides. <br/>\n<br/>\n***  Oh, I love the word fluid.  You&#39;re right, I shouldn&#39;t have the one-size-fits-all mentality when it comes to theories and stages of development.<br/>\n<br/>\nIts normal for teens to<br/>\ngo through a stage of being more introspective and less social in general, for<br/>\ninstance. Its also normal for people in their teens to be craving relationships<br/>\nwith adults - not in the sense of &quot;adult role models&quot; but in the sense of<br/>\nwanting real, adult relationships. It can be hard to find other teens who are<br/>\nready for the kinds of relationships unschoolers are ready for.<br/>\n<br/>\n***  That is so true.  Thanks for pointing this out!  Does your son get lonesome for these kinds of relationships?  Or is it different for boys, since girls always have that need for connection?<br/>\n<br/>\nHave y&#39;all been to any unschooling conferences or camp-outs? Those can be good<br/>\nplaces to connect with other teens.<br/>\n<br/>\n***  No, unfortunately, we haven&#39;t.  But I hope to bring my family to one when there is one that is nearer to us.  We live in VA.<br/>\n<br/>\nClose friendships can take a lot of time to build. What are your friendships<br/>\nlike? How long have you known your closest friends? I make aquaintances easily<br/>\nbut friends slowly - months or years of connection; shared work, shared<br/>\ninterests. <br/>\n<br/>\n***  Yes, that&#39;s true.<br/>\n<br/>\nIf your dd is concerned, it might be helpful for her to think about<br/>\ndifferent kinds of personalities and needs - what sorts of things allow<br/>\ndifferent people to connect with one another? For instance, I mentioned &quot;shared<br/>\nwork&quot; as one of the ways I connect - that&#39;s a biggie for me. Others connect<br/>\nlargely through shared conversation, exchange of ideas. If you&#39;re dd is more the<br/>\nlatter, all these activities might not be what she needs. As fun as they are,<br/>\nits possible they&#39;re too &quot;busy&quot; for her to actually feel a sense of connection<br/>\nthat&#39;s more than superficial. She might do better with some kind of study or<br/>\ndiscussion group as a way to connect on a more personal level.<br/>\n<br/>\n***  I think you&#39;ve hit the nail on the head, Meredith!  You&#39;re right -- the activities she goes to are too &quot;busy.&quot;  There&#39;s not much time for the kids to develop friendships.  When she did join a book club a few years ago, she was able to make a couple of friends.  Unfortunately, the family had to move.  But I will make sure she joins a study or discussion group at our co-op in the Fall.  I think this would really help.<br/>\n<br/>\nThanks for taking the time to share your thoughts with me, and thanks for your wise suggestions!<br/>\n<br/>\nShelley<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":346820406,"authorName":"hunnybunnies5@verizon.net","from":"&lt;hunnybunnies5@...&gt;","profile":"shelleydaez","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Question about 16 yo dd","postDate":"1244254560","msgId":40401,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0NkY3QUI5RTBEMTQ5RDlCMkI3RUVFMzk0MkJDNEJBQHJvYnlQQz4="},"prevInTopic":40399,"nextInTopic":40402,"prevInTime":40400,"nextInTime":40402,"topicId":40394,"numMessagesInTopic":0,"msgSnippet":"Joyce, Thank you for your wonderful advice.  Please see my comments below in BLUE.  ~  Shelley ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Kathryn (now 17)","messageBody":"<div id=\"ygrps-yiv-753038967\">Joyce,<br/>\n<br/>\nThank you for your wonderful advice.  Please see my comments below in BLUE.  ~  Shelley<br/>\n<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\n<br/>\n<br/>\nKathryn (now 17) has always related through her interests <br/>\nrather than to ages. <br/>\n<br/>\n***  This is interesting, much healthier, and I think, a result of the unschooling lifestyle.  You&#39;re right -- looking for friends my dd&#39;s age is from my conventional school mentality.  I&#39;m the one who&#39;s concerned about it, and viewing the situation this way without even realizing it.  (I&#39;m still in need of more deschooling.)  Though I do worry when she gets lonely.<br/>\n<br/>\nShe had a hard time finding friends when she was younger because she<br/>\nwanted to be around kids who loved what she loved but other than one<br/>\nschooled girl she saw as often as we could (they live 45 minutes<br/>\naway) she never really clicked with anyone.<br/>\n<br/>\n***  Thanks for sharing!  It&#39;s a relief to know that it isn&#39;t just my dd experiencing this.  It&#39;s true, dd does prefer to have friends who have the same interest as she does.  But they&#39;re not easy to find because she seems to be more mature than kids her age.  Did you dd ever feel lonely when she had a hard time finding friends?<br/>\n<br/>\nShe took a few art classes at the high school for 2 years but by the<br/>\nend she was conscious of how shallow the relationships were. It was<br/>\nall about &quot;being social&quot;, just getting together and talking about ...<br/>\nstuff. She grew tired of it and decided it was a waste of time. (Her<br/>\nopinion of most kids her age is not high ;-)<br/>\n<br/>\n***  Thank you -- I feel so much better because that&#39;s how my dd feels about the teens she knows, even the homeschooled ones!  (Of course, most of them are from families who do school-at-home .)  So is this what unschooling teens normally go through -- they have less friendships with peers their age because they are usually more mature?  <br/>\n<br/>\nShe has met a lot of people through her interests -- which have<br/>\nalways be very esoteric -- on the internet so they&#39;re scattered<br/>\nthroughout the world ;-) That&#39;s been great for her, because despite<br/>\npeople&#39;s fears, they really get to know each other even better than<br/>\nkids who start face to face. <br/>\n<br/>\n***  This is actually a better way to make friends -- through interests.  As a result, my dd spends more time with either adults (both young and old) or the little children she helps in a class, where she volunteers as a teacher&#39;s aide.<br/>\n <br/>\nSo I don&#39;t really have an answer for you other than it sounds like<br/>\nshe&#39;s going out to meet friends rather than going out to explore her<br/>\ninterests. <br/>\n<br/>\n***  Well, most of the time, she does what interests her.  It&#39;s just that she still can&#39;t seem to make friends within that interest.  Like for example, she was in an Acting Shakespeare class in our homeschool co-op, which she enjoys.  But when the main actors are on stage rehearsing, and the rest of the cast are just waiting around, she&#39;s always felt left out, while the others stick to their little group of friends.  She just ends up reading a book.  It&#39;s probably for the same reason you mentioned above -- she finds their talk somewhat shallow.  Even though they&#39;re homeschoolers.<br/>\n<br/>\nThe friendships Kathryn has found have been a side effect<br/>\nof things she&#39;s doing. <br/>\n<br/>\n***  I think this is the way it should be.  Interests should come first, then friendships as a kind of fringe benefit.  <br/>\n<br/>\nThere are lots and lots of stories of people<br/>\nwho were searching for someone to marry and didn&#39;t find someone until<br/>\nthey gave up and just started enjoying life ;-)<br/>\n<br/>\n***  Love this!  Thanks, Joyce, for making me see this whole situation in a better light!<br/>\n<br/>\nShelley<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Question about 16 yo dd","postDate":"1244209342","msgId":40399,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgwYjdidSthajQ3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEEyNTZFNUM3MkE3RjQ4MUFBNTU4QkZDRDBBNzY2NUNGQHJvYnlQQz4="},"prevInTopic":40397,"nextInTopic":40401,"prevInTime":40398,"nextInTime":40400,"topicId":40394,"numMessagesInTopic":0,"msgSnippet":"... **************************** Its not abnormal. Ray doesn t have much of anything in common with kids his age unless they are unschoolers or pretty","messageBody":"<div id=\"ygrps-yiv-842163043\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &lt;hunnybunnies5@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; My question is, is this normal?  Should I hone her up on conversation / social skills?  What would any of you do if your dd were in this situation?<br/>\n </span></blockquote>****************************<br/>\n<br/>\nIts not abnormal. Ray doesn&#39;t have much of anything in common with kids his age unless they are unschoolers or pretty laid-back homeschoolers. He has better luck making friends with people who have similar interests, and those tend to be adults. High school kids have a pretty narrow range of interests, social skills, and emotional skills too - they can&#39;t help that, they live pretty confined lives.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I remember attending a talk by a Montessori expert some years ago, who said that kids 12-15 prefer to be with good adult models rather than peers their age.  So during that period, I didn&#39;t really worry about it.... But now that she&#39;s 16, I&#39;m wondering if she will ever outgrow the 12-15 stage and develop friends again.<br/>\n </span></blockquote>**************************<br/>\n<br/>\nI love Montessori in general, but I think its really important not to get too locked into the idea of stages of development. Not that I don&#39;t think there are such things, but they&#39;re really very fluid and complex and dependent on other factors (personality, temperament, environment) besides. Its normal for teens to go through a stage of being more introspective and less social in general, for instance. Its also normal for people in their teens to be craving relationships with adults - not in the sense of &quot;adult role models&quot; but in the sense of wanting real, adult relationships. It can be hard to find other teens who are ready for the kinds of relationships unschoolers are ready for.<br/>\n<br/>\nHave y&#39;all been to any unschooling conferences or camp-outs? Those can be good places to connect with other teens.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She&#39;s been trying to make friends, at our co-op, and our other local homeschool support group, in church youth activities, extracurricular activities (of which we have a lot), etc.  She&#39;s an extrovert and enjoys going to these activities.  But somehow, she hasn&#39;t been able to develop any close friends her age, just acquaintances.<br/>\n </span></blockquote>*************************<br/>\n<br/>\nClose friendships can take a lot of time to build. What are your friendships like? How long have you known your closest friends? I make aquaintances easily but friends slowly - months or years of connection; shared work, shared interests. If your dd is concerned, it might be helpful for her to think about different kinds of personalities and needs - what sorts of things allow different people to connect with one another? For instance, I mentioned &quot;shared work&quot; as one of the ways I connect - that&#39;s a biggie for me. Others connect largely through shared conversation, exchange of ideas. If you&#39;re dd is more the latter, all these activities might not be what she needs. As fun as they are, its possible they&#39;re too &quot;busy&quot; for her to actually feel a sense of connection that&#39;s more than superficial. She might do better with some kind of study or discussion group as a way to connect on a more personal level.<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Question about 16 yo dd","postDate":"1244204602","msgId":40397,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2ODIxMDBGLUE4MEQtNDA2RC1CNTMwLTE4NTMzNUFERjc2MkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEEyNTZFNUM3MkE3RjQ4MUFBNTU4QkZDRDBBNzY2NUNGQHJvYnlQQz4=","referencesHeader":"PEEyNTZFNUM3MkE3RjQ4MUFBNTU4QkZDRDBBNzY2NUNGQHJvYnlQQz4="},"prevInTopic":40394,"nextInTopic":40399,"prevInTime":40396,"nextInTime":40398,"topicId":40394,"numMessagesInTopic":0,"msgSnippet":"On Jun 4, 2009, at 6:55 PM,  ... Kathryn (now 17) has always related through her interests rather than to ages. When she s doing a","messageBody":"<div id=\"ygrps-yiv-396185336\">On Jun 4, 2009, at 6:55 PM, &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hunnybunnies5@...\">hunnybunnies5@...</a>&gt;  <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hunnybunnies5@...\">hunnybunnies5@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She&#39;s been trying to make friends, at our co-op, and our other  <br/>\n&gt; local homeschool support group, in church youth activities,  <br/>\n&gt; extracurricular activities (of which we have a lot), etc. She&#39;s an  <br/>\n&gt; extrovert and enjoys going to these activities. But somehow, she  <br/>\n&gt; hasn&#39;t been able to develop any close friends her age, just  <br/>\n&gt; acquaintances.<br/>\n<br/>\n </span></blockquote>Kathryn (now 17) has always related through her interests rather than  <br/>\nto ages. When she&#39;s doing a road race she strikes up conversations  <br/>\nwith anyone who seems chatty who&#39;s going at her pace. They&#39;re all  <br/>\nolder than she is. She even exchanges real paper letters with a woman  <br/>\nwho runs in the Senior Olympics who is in her 80s or 90s.<br/>\n<br/>\nShe had a hard time finding friends when she was younger because she  <br/>\nwanted to be around kids who loved what she loved but other than one  <br/>\nschooled girl she saw as often as we could (they live 45 minutes  <br/>\naway) she never really clicked with anyone.<br/>\n<br/>\nShe took a few art classes at the high school for 2 years but by the  <br/>\nend she was conscious of how shallow the relationships were. It was  <br/>\nall about &quot;being social&quot;, just getting together and talking about ...  <br/>\nstuff. She grew tired of it and decided it was a waste of time. (Her  <br/>\nopinion of most kids her age is not high ;-)<br/>\n<br/>\nShe has met a lot of people through her interests -- which have  <br/>\nalways be very esoteric -- on the internet so they&#39;re scattered  <br/>\nthroughout the world ;-) That&#39;s been great for her, because despite  <br/>\npeople&#39;s fears, they really get to know each other even better than  <br/>\nkids who start face to face. (Thank goodness for phones with  <br/>\nunlimited minutes ;-) So far she&#39;s met in person 3 through Deviantart  <br/>\nwhere they share drawings (of rock groups they all like) and is  <br/>\nmeeting a 4th this weekend.<br/>\n<br/>\nSo I don&#39;t really have an answer for you other than it sounds like  <br/>\nshe&#39;s going out to meet friends rather than going out to explore her  <br/>\ninterests. The friendships Kathryn has found have been a side effect  <br/>\nof things she&#39;s doing. There are lots and lots of stories of people  <br/>\nwho were searching for someone to marry and didn&#39;t find someone until  <br/>\nthey gave up and just started enjoying life ;-)<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":346820406,"authorName":"hunnybunnies5@verizon.net","from":"&lt;hunnybunnies5@...&gt;","profile":"shelleydaez","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Question about 16 yo dd","postDate":"1244156146","msgId":40394,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEyNTZFNUM3MkE3RjQ4MUFBNTU4QkZDRDBBNzY2NUNGQHJvYnlQQz4="},"prevInTopic":0,"nextInTopic":40397,"prevInTime":40393,"nextInTime":40395,"topicId":40394,"numMessagesInTopic":0,"msgSnippet":"Hello all, I think the last time I posted was about my ds s intense interest in military history.  Now, I wanted to ask a question about my 16 yo dd.  We have","messageBody":"<div id=\"ygrps-yiv-2127001794\">Hello all,<br/>\n<br/>\nI think the last time I posted was about my ds&#39;s intense interest in military history.  Now, I wanted to ask a question about my 16 yo dd.  We have practiced attachment parenting with her, and she has a healthy attachment to me abd our family in general.  She&#39;s a good, sweet-natured kid who loves learning, but I&#39;m a bit concerned that she doesn&#39;t have any friends at all at this stage of her life.<br/>\n<br/>\nShe gets along great with adults (they usually love her), her 2 younger brothers (who love her, too), and she loves babies & little children (they love her, too).  It&#39;s just kids her age with whom she doesn&#39;t have much to say.  She experiences a lot of awkward moments with them (even in our weekly homeschool co-op and other youth activities) and hasn&#39;t been able to make a close friend.  So sometimes, she gets lonely.<br/>\n<br/>\nShe had 2 very close friends when she was younger.  They were friends since age 2, grew up together till both the other girls went to school, while we chose to homeschool when she was 6.  We kept in contact with them throughout the elementary years, since our families were close.  And then the girls just naturally grew apart once they started highschool.  So now she has no close friends.<br/>\n<br/>\nShe&#39;s been trying to make friends, at our co-op, and our other local homeschool support group, in church youth activities, extracurricular activities (of which we have a lot), etc.  She&#39;s an extrovert and enjoys going to these activities.  But somehow, she hasn&#39;t been able to develop any close friends her age, just acquaintances.<br/>\n<br/>\nMy question is, is this normal?  Should I hone her up on conversation / social skills?  What would any of you do if your dd were in this situation?<br/>\n<br/>\nI remember attending a talk by a Montessori expert some years ago, who said that kids 12-15 prefer to be with good adult models rather than peers their age.  So during that period, I didn&#39;t really worry about it.  She didn&#39;t have friends, but she had good adult models to emulate.  (According to the Montessorian, it&#39;s when they&#39;re in the ages of 6-12 that they love being in groups and having friends, which she did.)  But now that she&#39;s 16, I&#39;m wondering if she will ever outgrow the 12-15 stage and develop friends again.<br/>\n<br/>\nWould appreciate any advice.<br/>\n<br/>\nThanks,<br/>\n<br/>\nShelley<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":40389,"nextTopicId":40289}}