{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Breaking news: doubt rears it&#39;s ugly head in CT","postDate":"1151429818","msgId":14989,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY1MzU4M0ZDLTA0NjktNDhEQy05QzMzLTM4Q0RDRTBBMzQ1QkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDhDODY4MDQxQUNCRjI3Ny0xODk0LTYwQzRAbWJsay1kMjguc3lzb3BzLmFvbC5jb20+","referencesHeader":"PDM4MC0yMjAwNjYyMjc5NDcyODEwOUBlYXJ0aGxpbmsubmV0PiA8OEM4NjgwNDFBQ0JGMjc3LTE4OTQtNjBDNEBtYmxrLWQyOC5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":14985,"nextInTopic":0,"prevInTime":14988,"nextInTime":14990,"topicId":14957,"numMessagesInTopic":0,"msgSnippet":"... Both. For sure. Oh wait - was wacky nut-job supposed to be a bad thing?  -pam Unschooling shirts, cups, bumper stickers, bags... Live Love Learn ","messageBody":"<div id=\"ygrps-yiv-1091034619\">On Jun 27, 2006, at 6:24 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   We could be the wacky nut-jobs or the really cool moms.<br/>\n<br/>\n </span></blockquote>Both. For sure.<br/>\n<br/>\nOh wait - was &quot;wacky nut-job&quot; supposed to be a bad thing? &lt;G&gt;<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\nUnschooling shirts, cups, bumper stickers, bags...<br/>\nLive Love Learn<br/>\nUNSCHOOL!<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cafepress.com/livelovelearn\">http://www.cafepress.com/livelovelearn</a>&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2346607,"authorName":"ohpurple1@aol.com","from":"ohpurple1@...","profile":"openmindedfamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Breaking news: doubt rears it&#39;s ugly head in CT","postDate":"1151419850","msgId":14985,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0My5jMDYxMjQuMzFkMjlmY2FAYW9sLmNvbT4="},"prevInTopic":14974,"nextInTopic":14989,"prevInTime":14984,"nextInTime":14986,"topicId":14957,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/26/2006 10:08:53 PM Eastern Standard Time, starsuncloud@comcast.net writes: Keep reading, keep trusting and always, always hug your","messageBody":"<div id=\"ygrps-yiv-458941178\">In a message dated 6/26/2006 10:08:53 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a> writes:<br/>\nKeep<br/>\nreading, keep trusting and always, always hug your children when<br/>\nyou&#39;re pissed off. It works.<br/>\n<br/>\n<br/>\nSometimes these posts come at the most amazing moments.  I just tried it, <br/>\nhugging my daughter who just spoke to me in a way that tore my heart out - <br/>\nminutes after reading this post.  It worked and the hurt is gone and we grew <br/>\ntogether instead of pushing each other away.  Instead of me walking away which I <br/>\nusually do, thinking she&#39;ll eventually get the fact that it hurts my feelings when <br/>\nshe is nasty to me.  Acting like the hurt child rather than the mom.  That <br/>\nmethod has never worked and usually feeds the hurt and anger.  We resolved the <br/>\nproblem with love and we all feel good, immediately, rather than letting <br/>\nnegative feelings erode our relationship.  Wow!  Such joy and I only changed myself, <br/>\nmy own response.  This is good and so much easier than being upset with each <br/>\nother.  <br/>\n<br/>\nThank you, Ren, for the therapy...<br/>\n<br/>\nWarmly,<br/>\nRobin and sweet Melissa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Breaking news: doubt rears it&#39;s ugly head in CT","postDate":"1151414648","msgId":14974,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDODY4MDQxQUNCRjI3Ny0xODk0LTYwQzRAbWJsay1kMjguc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PDM4MC0yMjAwNjYyMjc5NDcyODEwOUBlYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PDM4MC0yMjAwNjYyMjc5NDcyODEwOUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":14968,"nextInTopic":14985,"prevInTime":14973,"nextInTime":14975,"topicId":14957,"numMessagesInTopic":0,"msgSnippet":"... From: Aimee & Paul Bogush  **** I spent my off time with my kids and DH who didn t register (to save money), but spent time","messageBody":"<div id=\"ygrps-yiv-1130936623\">-----Original Message-----<br/>\n From: Aimee & Paul Bogush &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:shaggyhill@...\">shaggyhill@...</a>&gt;&#92;<br/>\n<br/>\n<br/>\n  **** I spent my off time with my kids and DH who didn&#39;t register (to <br/>\nsave<br/>\n  money), but spent time swimming and such. I felt really bombarded with <br/>\ninfo and<br/>\n  needed to crawl away to safety, so to speak lol, after the workshops <br/>\nto process<br/>\n  what I was hearing. In the halls and such I was getting the <br/>\n&quot;unschooling means<br/>\n  doing whatever you want, regardless&quot; message, because I saw kids <br/>\nrunning around<br/>\n  the hotel which seemed inappropriate to me-- in fact I was crashed <br/>\ninto with<br/>\n  full-on speed in the lobby (and apologized to, I should note, by the <br/>\nrunner who<br/>\n  then ran off to continue the chase &lt;g&gt;). I would say to my kids had <br/>\nthey been<br/>\n  running &quot;we are in a hotel, sharing space with other people, it is not <br/>\nsafe or<br/>\n  polite to run around inside, I&#39;ll take you outside so you can run if <br/>\nyou&#39;d<br/>\n like.&quot;<br/>\n -=-=-=-=-<br/>\n<br/>\n  I would have stopped the child and told him to NOT run in the hotel <br/>\nbecause he could run into someone---like ME! &lt;g&gt;<br/>\n<br/>\n  I appreciate the apology, but at the same time, there&#39;s a time and a <br/>\nplace...<br/>\n<br/>\n  There was a little boy---4-5-ish? running along the seats in the <br/>\nrestaurant---while people were eating. That&#39;s outside my comfort level. <br/>\nI scooped him up and deposited him with his mom, who was just outside <br/>\nthe restaurant chatting. It&#39;s hard to say what she knew about his <br/>\nwhereabouts, but *I* think she should have been paying more attention.<br/>\n<br/>\n  There were a few kids in the courtyard doing some serious damage to <br/>\nthe gorgeous peonies and trying to tip the birdbath. On several <br/>\noccasions, one of us (Beth, Ren, Kathryn, Elissa?, and I) went out to <br/>\nstop it---it just wasn&#39;t OK.<br/>\n<br/>\n  As a conference coordinator, I may be a little more sensitive to it <br/>\nthan most---it IS *my* name on the contract with the hotel! &lt;g&gt; (not in <br/>\nPeabody) But I&#39;d like to see a little more awareness on the parts of <br/>\nthe parents---especially in public places.<br/>\n<br/>\n  I want unschoolers to NOT seem like wild animals. And I think <br/>\ngenerally they are wonderful. It seems that the ones who are out of <br/>\ncontrol at the conferences are usually the ones who are new to this <br/>\nlifestyle---they&#39;ve been given too much freedom too quickly.<br/>\n<br/>\n  I think it&#39;s easy at the conference to just &quot;let the kids go&quot;---but <br/>\nthe ones newer to this aren&#39;t quite ready for the freedom. Their <br/>\nparents need to be closer and more aware.<br/>\n<br/>\n  We&#39;ve told both our boys that (to paraphrase Spiderman) &quot;with great <br/>\nfreedom comes great responsibility.&quot; We DO expect more from those with <br/>\nso much freedom. Children who aren&#39;t comfortable enough to know how to <br/>\nact in these public situations need more guidance and more parental <br/>\nsupervision. They need to be made aware---in advance and during---of <br/>\nhow their actions can effect others. They should be aware of personal <br/>\nand public boundaries. If they aren&#39;t, a parent needs to be close by.<br/>\n<br/>\n  The conferences are a *very* safe environment to talk about these <br/>\nthings and to give the children the freedom to find boundaries, but I <br/>\nstill expect some serious parental guidance.<br/>\n<br/>\n -=-=--=-<br/>\n<br/>\n I also saw the craft room and felt my chest seize up at the mess (and<br/>\n  yes, it felt like destruction, lol) but I heard from a good source <br/>\nwith whom I<br/>\n  shared this concern, that it was cleaned up, spic and span before the <br/>\nconference<br/>\n  cleared out of the hotel. That level of creative mess is out of my <br/>\ncomfort zone<br/>\n  right now (especially when I&#39;m the one cleaning it up around here-- I <br/>\nreally<br/>\n  have to work on the &quot;slave attitude&quot; I can slip into). Had my kids <br/>\nused the<br/>\n  craft room and left messes, I&#39;d have said, &quot;I&#39;m concerned that you are <br/>\nusing the<br/>\n  craft room and leaving it a mess when you are done, this is a space <br/>\nshared by<br/>\n  many people and it doesn&#39;t feel right to me to leave it this way for <br/>\nthe next<br/>\n person, would you like me to help you clean up?&quot;<br/>\n<br/>\n -=-=-=-=-<br/>\n<br/>\n  Regarding the conference craft room: it&#39;s a *bit* different at <br/>\nunschooling conferences. I think it&#39;s almost expected---some of that <br/>\ncrafty chaos! &lt;g&gt; And the room only took 10-15 minutes to be cleaned <br/>\nwhen we had 20 people helping---THAT was a cool thing to see too! Can <br/>\nyou imagine how long that would have taken with just *one* person <br/>\ncleaning up?<br/>\n<br/>\n  (I used to mention that when my crowd was all working together on <br/>\ncleaning a room or picking up outside: One child might say, &quot;That <br/>\ndidn&#39;t take long.&quot; Or &quot;That was easy!&quot; I&#39;d say: &quot;This took the four of <br/>\nus only 20 minutes. Had one of us had to do it all alone, it would have <br/>\ntaken over an hour!&quot;)<br/>\n<br/>\n  When I first saw all the cool stuff Rue had collected for the craft <br/>\nroom, I was trying to figure out how to do the same in Albuquerque. <br/>\nAfter I saw the depth of the disaster &lt;g&gt;, I decided I&#39;d find something <br/>\nelse! &lt;bwg&gt; *Certainly* no styrofoam! &lt;G&gt; It was *great* room, and I <br/>\nbet the kids had a really, really good time. I saw one child absolutely <br/>\ndelighted to be tearing up styrofoam into teeny, tiny pieces---he was <br/>\nin some kind of zone. &lt;g&gt;<br/>\n<br/>\n  But it was all clean-uppable. No harm done. And the fun outweighed the <br/>\nmess.<br/>\n<br/>\n -=-=-=-=-<br/>\n<br/>\n I really like the idea of<br/>\n  leaving a place better than when you found it (and yes, darn it, I&#39;d <br/>\nlike it if<br/>\n  everyone else did so too, eek!) ...is this compatible with <br/>\nunschooling? Do I<br/>\n  look at it as MY idea and go about implementing it joyfully and let go <br/>\nof trying<br/>\n to &#39;make&#39; my kids or anyone else adhere to it....that&#39;s what makes it<br/>\n  unschooling...right?...and then maybe, with all that modeling my kids <br/>\nwill<br/>\n  either agree and decide they too like leaving a place better than they <br/>\nfound it<br/>\n  or they&#39;ll tell stories when I&#39;m dead about their crazy mother who <br/>\ntried to<br/>\n  leave places better...but in any event, if I choose to follow that <br/>\nprincipal<br/>\n  then it&#39;s just that, MY principal and if my kids choose not to follow <br/>\nit, that&#39;s<br/>\n  their prerogative? (Wooops, I stopped breathing <br/>\ndeeply...there....geez.)<br/>\n<br/>\n -=-=--<br/>\n<br/>\n yeah---it&#39;s hard to know exactly *what* they&#39;ll think of us! &lt;G&gt;<br/>\n<br/>\n  We could be the wacky nut-jobs or the really cool moms. Right now I&#39;m <br/>\nconsidered a really cool mom. That could change, I guess! &lt;g&gt;<br/>\n<br/>\n  Maybe look at it this way: We *did* leave it clean---maybe not cleaner <br/>\nthan we found it, but many of the kids saw the disaster AND they saw <br/>\nthe clean room. Several of the kids helped with clean-up---it was NOT <br/>\nan adults-only event! &lt;g&gt;<br/>\n<br/>\n  And I can almost guarantee that we left the hotel cleaner than many <br/>\nweddings and Lions&#39; Club (all adult) events!<br/>\n<br/>\n  If it makes you feel any better, I also had to stop and take a deep <br/>\nbreath the first time I peeked in to the room after it was trashed. And <br/>\nthen I took another when I stepped out! &lt;g&gt; But it was fine. Really.<br/>\n<br/>\n -=-=-=-=-=<br/>\n<br/>\n Thanks to you and everyone who has responded. I really appreciate your<br/>\n  guidance! I&#39;m overwhelmed at how much support is available and humbled <br/>\nto<br/>\n realize it means nothing until I&#39;m ready for it ;-)<br/>\n<br/>\n -=-=-=-<br/>\n<br/>\n Ain&#39;t that something? &lt;g&gt; Only when we&#39;re ready!<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\n Kelly Lovejoy<br/>\n Conference Coordinator<br/>\n Live and Learn Unschooling Conference<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n<br/>\n  &quot;The hardest problem for the brain is not learning, but forgetting. No <br/>\nmatter how hard we try, we can&#39;t deliberately forget something we have <br/>\nlearned, and that is catastrophic if we learn that we can&#39;t learn.&quot; <br/>\n~Frank Smith<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nCheck out AOL.com today. Breaking news, video search, pictures, email <br/>\nand IM. All on demand. Always Free.</div>","specialLinks":[]},{"userId":31919568,"authorName":"Aimee & Paul Bogush","from":"&quot;Aimee & Paul Bogush&quot; &lt;shaggyhill@...&gt;","profile":"shaggyhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Breaking news: doubt rears it&#39;s ugly head in CT","postDate":"1151401648","msgId":14968,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4MC0yMjAwNjYyMjc5NDcyODEwOUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":14967,"nextInTopic":14974,"prevInTime":14967,"nextInTime":14969,"topicId":14957,"numMessagesInTopic":0,"msgSnippet":"Well, yes and no. I believe in responding kindly to all of the above, but not necessarily allowing it to continue!! I am perfectly comfortable with saying No,","messageBody":"<div id=\"ygrps-yiv-688086624\">Well, yes and no.<br/>\nI believe in responding kindly to all of the above, but not<br/>\nnecessarily allowing it to continue!! I am perfectly comfortable with<br/>\nsaying &quot;No, you can&#39;t treat me that way&quot; or &quot;STOP!&quot; or &quot;Let&#39;s find a<br/>\ndifferent way to solve this problem.&quot;<br/>\n<br/>\nI don&#39;t let people hurt me or destroy my stuff! But I DO understand<br/>\nthat my children are learning and growing and deserve a parent that is<br/>\ncentered and kind and gentle when saying &quot;NO&quot;.<br/>\n<br/>\n***Hmmmm, maybe I had that part right because that&#39;s generally what I was/am doing.  So the unschooling part for me is dropping the arbitrary no&#39;s and the pure parental convenience no&#39;s...which I have been dabbling in, much to the delight of all involved ;-)  (They ate hot dogs in the bath yesterday!)  I was getting confused and slipping into letting anything go, but knowing it didn&#39;t feel right.  I think I&#39;m working in the grey area here, tweaking what I&#39;ve been doing, rather than tossing something completely out.  Dang it...I do so love the black and white, all or nothing!  Thanks for the reminder.  I need examples, lots of examples of the dialogue that takes place... I&#39;m seeking them out in places like the rejoycing site.<br/>\n*******<br/>\nWhat do you say when they&#39;re truly rude? Or destructive? Sometimes<br/>\ncreativity looks destructive and we just need to help them find a<br/>\nbetter outlet. Physical aggression needs to be channeled away from<br/>\npeople! <br/>\n***I wrote that and then spent the rest of the evening feeling badly about it.  I&#39;d look at them as they were being their delightful, amazing, curious, light-filled selves and started to realize that in many of those moments I feel they are rude and destructive it really can be just a matter of perspective...a slight shift in thinking reframes it all.  It&#39;s much easier to see that in hind vision and I need to work on being in the moment with that kind of thinking.  The physical aggression is coming from frustration and not feeling one is being listened to on top of a cough and cold which just makes every thing harder for a 3 year old.  Last night though, she got pissed off because she thought DH and DD8 weren&#39;t going to use the paper plates DD3 left out....following her recent pattern, she would have hit DD8, thrown the plates, and maybe even knocked down something else in the room...BUT, instead she yelped, walked off into my room, and laid on my bed... a few minutes later she came to me (in my room at the computer reading unschooling stuff, lol) and said, &quot;Daddy and Emma aren&#39;t using the special plates I set out.&quot;  I said, &quot;is there a way I can help you?&quot;  She said, &quot;could you tell Daddy and Emma about I want to use the special plates.&quot;  So, we walk out there and they&#39;re actually using them...except for dad who is cutting lamb chops.  It went on that we explained Annie&#39;s concern and dad explained he can&#39;t cut on that plate, but once he&#39;s done cutting he&#39;ll switch to the special plate, all happy...dinner continues blissfully.  So, I noted that as a major step in the right direction.  And, I articulated for Annie (and DH, lol) how effective it was for her to go to a safe place to feel her feeling, collect herself and then find the help she needed.  I could take a lesson from the kid -- she modeled for all of us!<br/>\n<br/>\nLet&#39;s say Annie demands the ketchup at the table (a recent example), really demands it with an I WANT THE KETCHUP (no way to indicate the tone, but think of grumpy face, mean sounding voice)...this moment is wrought with questions for me right now (forget world peace, I&#39;m worried about ketchup!): do I just kindly hand her the ketchup and say nothing  or   do I kindly hand her the ketchup and say, &quot;I prefer to be spoken to kindly, is there something bothering you?&quot;   I get that what I&#39;m NOT doing is saying &quot;if you&#39;ll ask nicely I&#39;ll give you the ketchup&quot; or &quot;get it yourself&quot;  or throwing up my hands and saying this unschooling thing ain&#39;t working, look...she&#39;s rude.  Eeek!<br/>\n*******<br/>\nI think you&#39;re on the right track....breathe deep and hang in there.<br/>\nThere will be some ups and downs as you transition. My best advice is<br/>\ntake it nice and sloooowwww. Slow as in saying &quot;yes&quot; more, not making<br/>\nsome grand announcement that things are changing. <br/>\n<br/>\n*****Oh, but I so love grand announcements!  I have been trying so hard to resist that, lol.  Yes, more deep breaths and taking it slow...I hear you....there I took a breath just right then...and another one...<br/>\n*******<br/>\nSandra and I did a &quot;Peaceful Parenting&quot; talk last year, you can buy<br/>\nthe CD from Kelly if that sounds like it might be helpful. Keep<br/>\nreading, keep trusting and always, always hug your children when<br/>\nyou&#39;re pissed off. It works.<br/>\n***Ok, thanks!*******<br/>\nYou met a ton of unschooled kids if you were up at Peabody! Did they<br/>\nseem interesting, joyful and creative or &quot;spoiled&quot;?? I saw a lot of<br/>\ncreative joy swirling through that hotel!:)<br/>\n**** I spent my off time with my kids and DH who didn&#39;t register (to save money), but spent time swimming and such.  I felt really bombarded with info and needed to crawl away to safety, so to speak lol, after the workshops to process what I was hearing.  In the halls and such I was getting the &quot;unschooling means doing whatever you want, regardless&quot; message, because I saw kids running around the hotel which seemed inappropriate to me-- in fact I was crashed into with full-on speed in the lobby (and apologized to, I should note, by the runner who then ran off to continue the chase &lt;g&gt;).  I would say to my kids had they been running &quot;we are in a hotel, sharing space with other people, it is not safe or polite to run around inside, I&#39;ll take you outside so you can run if you&#39;d like.&quot;  I also saw the craft room and felt my chest seize up at the mess (and yes, it felt like destruction, lol) but I heard from a good source with whom I shared this concern, that it was cleaned up, spic and span before the conference cleared out of the hotel.  That level of creative mess is out of my comfort zone right now (especially when I&#39;m the one cleaning it up around here-- I really have to work on the &quot;slave attitude&quot; I can slip into).  Had my kids used the craft room and left messes, I&#39;d have said, &quot;I&#39;m concerned that you are using the craft room and leaving it a mess when you are done, this is a space shared by many people and it doesn&#39;t feel right to me to leave it this way for the next person, would you like me to help you clean up?&quot;  I really like the idea of leaving a place better than when you found it (and yes, darn it, I&#39;d like it if everyone else did so too, eek!)  ...is this compatible with unschooling?  Do I look at it as MY idea and go about implementing it joyfully and let go of trying to &#39;make&#39; my kids or anyone else adhere to it....that&#39;s what makes it unschooling...right?...and then maybe, with all that modeling my kids will either agree and decide they too like leaving a place better than they found it or they&#39;ll tell stories when I&#39;m dead about their crazy mother who tried to leave places better...but in any event, if I choose to follow that principal then it&#39;s just that, MY principal and if my kids choose not to follow it, that&#39;s their prerogative?  (Wooops, I stopped breathing deeply...there....geez.)<br/>\n<br/>\nThanks to you and everyone who has responded.  I really appreciate your guidance!  I&#39;m overwhelmed at how much support is available and humbled to realize it means nothing until I&#39;m ready for it ;-)<br/>\n<br/>\nAimee<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":58204288,"authorName":"mooosey3","from":"&quot;mooosey3&quot; &lt;hongslo@...&gt;","profile":"mooosey3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Breaking news: doubt rears it&#39;s ugly head in CT","postDate":"1151386257","msgId":14967,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU3cWZxaCtpNjJxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU3cTNwNSt0bmZoQGVHcm91cHMuY29tPg=="},"prevInTopic":14957,"nextInTopic":14968,"prevInTime":14966,"nextInTime":14968,"topicId":14957,"numMessagesInTopic":0,"msgSnippet":"... Just tonight my boys have been having an experience with all of the above rudeness, physical aggression and destruction ....They have friends over who are","messageBody":"<div id=\"ygrps-yiv-1089574843\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; ~Are you sure??? Really???? Is it true???<br/>\n&gt; Responding to rudeness, destruction, physical aggression, etc. with<br/>\n&gt; kindess really, really, really will turn out OK? ~<br/>\n&gt;<br/>\n&gt; Well, yes and no.<br/>\n&gt; I believe in responding kindly to all of the above, but not<br/>\n&gt; necessarily allowing it to continue!! I am perfectly comfortable with<br/>\n&gt; saying &quot;No, you can&#39;t treat me that way&quot; or &quot;STOP!&quot; or &quot;Let&#39;s find a<br/>\n&gt; different way to solve this problem.&quot;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Just tonight my boys have been having an experience with all of the<br/>\nabove rudeness, physical aggression and destruction ....They have<br/>\nfriends over who are also brothers and for some reason they are all not<br/>\ngetting along.   The aggression:  someone has gotten hurt a few times<br/>\nbecause of rowdiness and frustrations.    The destruction: slamming<br/>\nbedroom doors over and over again.  The  rudeness:  Not respecting other<br/>\npeople in the house (ME and Haley) by not slamming the doors and by<br/>\ngoing in my bedroom when I have nicely asked them to stay out of that<br/>\nroom... and the yelling and fighting that is going on that is causing us<br/>\nstress.   First time the doors were being slammed and yelling going on I<br/>\ntold all the boys to not slam the doors nicely and calmly.  2nd time<br/>\nnicely.  3rd time I told them this has to stop I don&#39;t want them<br/>\ndestroying the house or the doors.   4th time (just a little while ago<br/>\nand also catching someone locked in my room for the second time)  I got<br/>\nangry and had to go and talk with my boys alone.  First off I told them,<br/>\nwhat was going on wasn&#39;t right that they weren&#39;t being respectful to the<br/>\nhouse or others in it.   They said they couldn&#39;t make the other boys<br/>\nlisten to them to not slam the doors and to not fight.  I asked them<br/>\nwhat should we do...Should they go home for the night??  Oh No!  The<br/>\nboys didn&#39;t want their friends to leave.  So we agreed that everyone<br/>\nneeded to try and get along, to not slam the doors and to be respectful<br/>\nof others.<br/>\n<br/>\nThere are times like tonight I have to say,&quot;no!&quot;  or &quot;stop!&quot;  But I also<br/>\nknow I need to carefully look at the whole situation.  I have to ask<br/>\nmyself,&quot; Is there something causing them to be upset and to act out?&quot;  <br/>\nLike the boys who are here right now.  They are split between their<br/>\nDad&#39;s house and their mom&#39;s house.  Their mom has 2 new kids with her<br/>\nnew husband, their Dad 3 new kids with his new wife.  Maybe that is the<br/>\nunderlying cause of all this fighting...maybe not.  But I am aware of<br/>\nit.  I also know it is totally unlike my boys to do so much fighting<br/>\nwith each other and with friends, so in a situation like this they<br/>\nreally need me to stay call and to direct them.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I don&#39;t let people hurt me or destroy my stuff! But I DO understand<br/>\n&gt; that my children are learning and growing and deserve a parent that is<br/>\n&gt; centered and kind and gentle when saying &quot;NO&quot;.<br/>\n<br/>\n </span></blockquote>Absolutely.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My best advice is<br/>\n&gt; take it nice and sloooowwww. Slow as in saying &quot;yes&quot; more, not making<br/>\n&gt; some grand announcement that things are changing.<br/>\n<br/>\n </span></blockquote>Yep.  Sloooowwww.<br/>\n<br/>\n   I have been doing alot of reading lately from all sorts of unschooling<br/>\nwebsites.  One thing that really struck a cord with me is to only worry<br/>\nabout the moment you are in right now.  To make this moment count, to<br/>\nput your best effort in this one moment with your kids.  And then when<br/>\nthe next moment happens, you put your best into that...not worrying<br/>\nabout later moments in the day or tomorrow or years from now.  When you<br/>\nstart focusing on the &quot;right now&quot; and incorporating it in your life, it<br/>\nwill slowly become how you are.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; and always, always hug your children when<br/>\n&gt; you&#39;re pissed off. It works.<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I love that.  How cool.  That philosophy should be in ALL parenting<br/>\nbooks.  Wouldn&#39;t the world be a more beautiful place???<br/>\n<br/>\nHeather</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Breaking news: doubt rears it&#39;s ugly head in CT","postDate":"1151373925","msgId":14957,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU3cTNwNSt0bmZoQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":14967,"prevInTime":14956,"nextInTime":14958,"topicId":14957,"numMessagesInTopic":0,"msgSnippet":"~Are you sure??? Really???? Is it true??? Responding to rudeness, destruction, physical aggression, etc. with kindess really, really, really will turn out OK?","messageBody":"<div id=\"ygrps-yiv-1492709591\">~Are you sure??? Really???? Is it true???<br/>\nResponding to rudeness, destruction, physical aggression, etc. with<br/>\nkindess really, really, really will turn out OK? ~<br/>\n<br/>\nWell, yes and no.<br/>\nI believe in responding kindly to all of the above, but not<br/>\nnecessarily allowing it to continue!! I am perfectly comfortable with<br/>\nsaying &quot;No, you can&#39;t treat me that way&quot; or &quot;STOP!&quot; or &quot;Let&#39;s find a<br/>\ndifferent way to solve this problem.&quot;<br/>\n<br/>\nI don&#39;t let people hurt me or destroy my stuff! But I DO understand<br/>\nthat my children are learning and growing and deserve a parent that is<br/>\ncentered and kind and gentle when saying &quot;NO&quot;.<br/>\n<br/>\nWhat do you say when they&#39;re truly rude? Or destructive? Sometimes<br/>\ncreativity looks destructive and we just need to help them find a<br/>\nbetter outlet. Physical aggression needs to be channeled away from<br/>\npeople! <br/>\n<br/>\nI think you&#39;re on the right track....breathe deep and hang in there.<br/>\nThere will be some ups and downs as you transition. My best advice is<br/>\ntake it nice and sloooowwww. Slow as in saying &quot;yes&quot; more, not making<br/>\nsome grand announcement that things are changing.  <br/>\n<br/>\nSandra and I did a &quot;Peaceful Parenting&quot; talk last year, you can buy<br/>\nthe CD from Kelly if that sounds like it might be helpful.  Keep<br/>\nreading, keep trusting and always, always hug your children when<br/>\nyou&#39;re pissed off. It works.<br/>\n<br/>\nYou met a ton of unschooled kids if you were up at Peabody! Did they<br/>\nseem interesting, joyful and creative or &quot;spoiled&quot;??  I saw a lot of<br/>\ncreative joy swirling through that hotel!:)<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]}],"prevTopicId":14947,"nextTopicId":14981}}