{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":58929735,"authorName":"Schafer Vanessa","from":"Schafer Vanessa &lt;psychomom95@...&gt;","profile":"psychomom95","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Just sharing a day","postDate":"1158668960","msgId":17377,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwOTE5MTIyOTIwLjUwOTEyLnFtYWlsQHdlYjYwODExLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDJmYi42MzJhNGE0LjMyNDBjMzAzQGFvbC5jb20+"},"prevInTopic":17374,"nextInTopic":0,"prevInTime":17376,"nextInTime":17378,"topicId":17370,"numMessagesInTopic":0,"msgSnippet":"Chrissy, Ah, I know this all to well.  My daughter Alex-9, would be at school and I would get calls to come and get her, because her stomach hurt, and she","messageBody":"<div id=\"ygrps-yiv-1838507322\">Chrissy,<br/>\n<br/>\nAh, I know this all to well.  My daughter Alex-9,<br/>\nwould be at school and I would get calls to come and<br/>\nget her, because her stomach hurt, and she looked<br/>\nreally pale.  Well to make a long story short, she is<br/>\npale, because she has my fair skin, and her tummy<br/>\nwould hurt, because of test anxiety, which I told them<br/>\nshe gets all the time.  So I would go and get her,<br/>\nbring her home, she would eat lunch, and then she<br/>\nwould be just fine.  I would ask her why her tummy<br/>\nhurt, and she would tell me that she had a time test<br/>\nin math, or some other kind of test going on.  So, she<br/>\nwould either lay down, or we would watch a movie, or<br/>\nplay a game.  <br/>\n<br/>\nNow we are homeschoolers -(unschoolers), and my kids<br/>\nare the happiest they have ever been.  No more stomach<br/>\naches, or anything like that.  Just pure joy, and<br/>\nhappiness.  I sit here on the computer, listening to<br/>\nthe bus go buy, and kids walking on the sidewalks to<br/>\ngo to the bus, and know that my kids are peacefully<br/>\nsleeping in bed.  What a nice change this is.  It is<br/>\nsuch a better life for them.  I love the fact that I<br/>\nno longer have to deal with school problems, horrible<br/>\nteachers (I&#39;m sure we&#39;ve all had our share of them),<br/>\nand mean kids.  I know that they are safe, and can be<br/>\nanything they want, and learn about anything they<br/>\nwant.  They are learning the natural way, without<br/>\nthings being shoved down their throats, that they have<br/>\nno interest in learning about.<br/>\n<br/>\nThanks for reminding me.<br/>\n<br/>\n<br/>\n---Vanessa<br/>\n<br/>\n--- <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Homeschlfor2@...\">Homeschlfor2@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know there are some new members that have asked<br/>\n&gt; for a typical day and  well <br/>\n&gt; after blogging I just wanted to share this with more<br/>\n&gt; viewers....  its  such <br/>\n&gt; an awesome transformation and feels so great to<br/>\n&gt; realize how  good this  area of <br/>\n&gt; our lives has become.<br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt; I have to share another wow moment that happened way<br/>\n&gt; early this  morning.  I <br/>\n&gt; had to use the bathroom  ok so thats not so wow.  <br/>\n&gt; Anyhow it was about 6am  <br/>\n&gt; came downstairs did my business stood at the  bottom<br/>\n&gt; of the steps and thought do <br/>\n&gt; I want to stay up or go back to bed...not too  much<br/>\n&gt; thought there of course I <br/>\n&gt; went up to bed.  It wasnt really light out,  yet as<br/>\n&gt; I layed there I started <br/>\n&gt; thinking  if we were in school id be waking  the<br/>\n&gt; kids up about now for <br/>\n&gt; breakfast... if we were in school my day would be <br/>\n&gt; crazy right about now.  Instead I <br/>\n&gt; flipped over and closed my eyes   just has I was<br/>\n&gt; drifting back to sleep I hear <br/>\n&gt; the school bus going by wow its  7am  kids are up <br/>\n&gt; kids are dressed have eaten <br/>\n&gt; and are on the  bus...  smiling to myself wondering<br/>\n&gt; when my kids will get <br/>\n&gt; up.... For those  that wonder or care  Jake was up<br/>\n&gt; about 9 and Bethy 11, who <br/>\n&gt; awoke with a  headache.  Which made me think of all<br/>\n&gt; the kids that awoke this am at <br/>\n&gt;  6  not feeling good yet not sick who were made to<br/>\n&gt; get on the bus and go to  <br/>\n&gt; school.  How great is my life  I got to hug my 9 yr<br/>\n&gt; old ask if she  wanted <br/>\n&gt; some tylonel be told nah nothing is going on this am<br/>\n&gt; that I really wanted  to do <br/>\n&gt; so im just going to lie on the couch til this<br/>\n&gt; passes.  By about noon  she was <br/>\n&gt; writing words that popped into her head and then<br/>\n&gt; wanting to go outside.  But <br/>\n&gt; what could have been if 6am was our start<br/>\n&gt; time...........<br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt; Chrissy<br/>\n&gt;  <br/>\n&gt; www.homeschoolblogger.com/chrissyland<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been<br/>\n&gt; removed]<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>   Vanessa  <br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":178533147,"authorName":"Su","from":"&quot;Su&quot; &lt;ikylilgrl@...&gt;","profile":"veganmamma3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Just sharing a day","postDate":"1158647667","msgId":17374,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVlbzMxaitucnZkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDJmYi42MzJhNGE0LjMyNDBjMzAzQGFvbC5jb20+"},"prevInTopic":17370,"nextInTopic":17377,"prevInTime":17373,"nextInTime":17375,"topicId":17370,"numMessagesInTopic":0,"msgSnippet":"Chrissy, I think about this a lot. So does my 9 yr old girl who has always been a late sleeper. She goes to bed at the same time my 4.5 yr old boy does but she","messageBody":"<div id=\"ygrps-yiv-1904179043\">Chrissy, I think about this a lot. So does my 9 yr old girl who has<br/>\nalways been a late sleeper. She goes to bed at the same time my 4.5 yr<br/>\nold boy does but she wakes up 2-3 hours later. Once about a week ago<br/>\nshe woke up with my husband 5:30am and woke me up. The girls who live<br/>\nacross the street were standing on the sidewalk waiting for their<br/>\nride. So my daughter went over there and waited with them, said good<br/>\nbye, came back inside and slept for 4 hours. Both the girls say they<br/>\nwant to homeschool and have asked me if I would homeschool them. They<br/>\nhave very little time to spend with their parents. They don&#39;t see<br/>\ntheir father during the week because they are already in bed when he<br/>\ngets home and weekends are dance, soccer, music, church. My kids think<br/>\ntheir life is so sad. Our kids love us and can&#39;t understand why other<br/>\nkids parents send them away to school. I try to explain nicely, I<br/>\ndon&#39;t want them to be anti-school, well I do, there is very little<br/>\nchance that my kids would ever have to go to school. My sister-in-law<br/>\nstarted unschooling her highschool kids a couple of years ago and we<br/>\nhave asked them to take our kids in the &quot;unlikely event&quot; something<br/>\nwere to happen. And that decision came about because Brian(dh) and I<br/>\nthought about who would actually respect our kids and they were the<br/>\nonly ones we could think of in both families. <br/>\n<br/>\nNone of our days are typical. But here goes.<br/>\nds age 1.5 gets up around 6am and wants to play *by himself* in other<br/>\nwords I am not invited. Sometimes he will bring something over to<br/>\nshare but I am not even allowed to watch. (must be a product of being<br/>\nthe 4th child) So this is the time I try to clean up from the night<br/>\nbefore or get some breakfast or call some early ppl.<br/>\nds age 4.5 wakes about 7-8am and he wants cuddle time and books and<br/>\nlots of hugs, the girls ages 9 and 7 usually wake up while we are<br/>\nreading. We read some more then 7 yr old usually likes to make<br/>\nbreakfast for everyone. Sprouted bread toast with a Lot of jelly. And<br/>\nthen they either watch a movie or go outside, it is funny that they<br/>\nusually do everything in 3s, they never watch a movie alone, rarely go<br/>\noutside alone. They like to be together. Ocea, the littlest, kind of<br/>\nfollows them around. <br/>\nThen we have certain days we go to the library and certain days we see<br/>\nfriends. I am the Attachment Parenting leader for Nashville, (not<br/>\nwillingly) so we have a playgroup once a week and my kids love the<br/>\nbabies so we go so Miyana 9yr old, can hold all her little friends.<br/>\nThe babies follow her around like she is the pied piper. We try to hit<br/>\nthe thrift store, my kids like to feel rich, they can&#39;t feel rich in<br/>\nTarget, Walmart or the mall most of the time. But at the thrift store<br/>\nthey feel like treasure hunters. Then we head over to our favorite<br/>\npark, Dragon Park there is a HUGE mosaic dragon that goes in and out<br/>\nof the ground and the kids can climb all over it. Today we played<br/>\nthere in the rain for 3 hours. Then they usually either decide what we<br/>\nare eating for dinner or leave it to me and they play or look at books<br/>\nor watch a movie. In the evening we work on bills, daddy skateboards<br/>\nwith them, and reads books and everyone falls asleep except me. <br/>\nSuzanne<br/>\nmamma to Miyana girl 9, Aeyah girl 7, Khai boy 4.5, Ocea boy 1.5<br/>\n<br/>\nChrissy wrote--  Which made me think of all the kids that awoke this<br/>\nam at <br/>\n<blockquote><span title=\"ireply\"> &gt;  6  not feeling good yet not sick who were made to get on the bus<br/>\n </span></blockquote>and go to  <br/>\n<blockquote><span title=\"qreply\"> &gt; school. </span></blockquote></div>","specialLinks":[]},{"userId":233219230,"authorName":"Homeschlfor2@aol.com","from":"Homeschlfor2@...","profile":"chrissysspoiled","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Just sharing a day","postDate":"1158637827","msgId":17370,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJmYi42MzJhNGE0LjMyNDBjMzAzQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":17374,"prevInTime":17369,"nextInTime":17371,"topicId":17370,"numMessagesInTopic":0,"msgSnippet":"I know there are some new members that have asked for a typical day and  well after blogging I just wanted to share this with more viewers....  its  such an","messageBody":"<div id=\"ygrps-yiv-2086033921\">I know there are some new members that have asked for a typical day and  well <br/>\nafter blogging I just wanted to share this with more viewers....  its  such <br/>\nan awesome transformation and feels so great to realize how  good this  area of <br/>\nour lives has become.<br/>\n <br/>\n <br/>\n <br/>\n <br/>\nI have to share another wow moment that happened way early this  morning.  I <br/>\nhad to use the bathroom  ok so thats not so wow.   Anyhow it was about 6am  <br/>\ncame downstairs did my business stood at the  bottom of the steps and thought do <br/>\nI want to stay up or go back to bed...not too  much thought there of course I <br/>\nwent up to bed.  It wasnt really light out,  yet as I layed there I started <br/>\nthinking  if we were in school id be waking  the kids up about now for <br/>\nbreakfast... if we were in school my day would be  crazy right about now.  Instead I <br/>\nflipped over and closed my eyes   just has I was drifting back to sleep I hear <br/>\nthe school bus going by wow its  7am  kids are up  kids are dressed have eaten <br/>\nand are on the  bus...  smiling to myself wondering when my kids will get <br/>\nup.... For those  that wonder or care  Jake was up about 9 and Bethy 11, who <br/>\nawoke with a  headache.  Which made me think of all the kids that awoke this am at <br/>\n 6  not feeling good yet not sick who were made to get on the bus and go to  <br/>\nschool.  How great is my life  I got to hug my 9 yr old ask if she  wanted <br/>\nsome tylonel be told nah nothing is going on this am that I really wanted  to do <br/>\nso im just going to lie on the couch til this passes.  By about noon  she was <br/>\nwriting words that popped into her head and then wanting to go outside.  But <br/>\nwhat could have been if 6am was our start time...........<br/>\n <br/>\n <br/>\n <br/>\nChrissy<br/>\n <br/>\nwww.homeschoolblogger.com/chrissyland<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":17277,"nextTopicId":17310}}