{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":41,"messages":[{"userId":113565718,"authorName":"mamafirst111","from":"&quot;mamafirst111&quot; &lt;Pam_Moran@...&gt;","profile":"mamafirst111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unacceptable behavior","postDate":"1278997424","msgId":44522,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkxZ3MzZysyYWtxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkxYW9kOStwajU3QGVHcm91cHMuY29tPg=="},"prevInTopic":44520,"nextInTopic":44523,"prevInTime":44521,"nextInTime":44523,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"Hi, I don t usually post anything. I joined this group when I started unschooling my daughter, Makaela, 7 years, in March.  She previously attended a Sudsbury","messageBody":"<div id=\"ygrps-yiv-373305790\">Hi, I don&#39;t usually post anything. I joined this group when I started unschooling my daughter, Makaela, 7 years, in March.  She previously attended a Sudsbury Vally Free/Democratic school.  I had some thoughts that I wanted to share.  I am a therapist and specialize in attachment and bonding, stress, trauma and severe behaviors.  I am also a huge supporter of unschooling.  There are others although, there are few and far... but they are out there.  I wanted to suggest a great model, developed by Dr. Bryan Post www.postinstitute.com    I think most of the people on this list will feel very comfortable with his paradigm of being with children and his treatment methods.  He uses an unconditional love- based of parenting and is highly respectful of the child and family system.  He has worked with some of the most difficult behaviors and with families who have children that have been extremely traumatized.  He is worth checking out.  I have been training with him for over 5 years now.  Feel free to check out my website as well, at www.attachmentandhealing.com  I am in central pa.<br/>\nAlso, regarding school, I often suggest to parents raising <br/>\nAlso, I often consult with schools and with parents regarding school.  I OFTEN recommend that when kids and that highly stressed that they are raging, that they homeschool b.c. school just creates more stress.  I think the best thing for the child regarding school would be to not go and to practice unschooling.... to not even deal with educational issues... their emotional health must be a priority.  when there is healing, education will follow on its own.  In consulting with schools, I have not found many school staff that are willing or able to BE with the child in a way that is going to support them.  More often, the way they deal with the child, makes everything worse... thus, just take them out!    <br/>\nI am somewhat familiar with Greene&#39;s work too. I will have to check it out further!  Best to you.  Don&#39;t forget to breathe and to concentrate on being with the child where he is... there is a reason for his raging, maybe you are the safe person for him.  He needs you to go there with him, not go into your own fears.  It is hard but will make a huge difference.  Pam  <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;elguthaus&quot; &lt;eguthaus@...&gt; wrote:<br/>\n&gt;<br/>\n&gt;  &quot;Again, I&#39;m just imagining how I might handle the situation as I&#39;ve never  had a child try to hit me.&quot;<br/>\n&gt; &gt; <br/>\n&gt; <br/>\n&gt; ******<br/>\n&gt; <br/>\n&gt; And until you have had your own flesh and blood, whom you loving nurture and encourage, go after you in attack mode, or go after one of your other children relentlessly, all the imagining in the world can&#39;t prepare you for the level of despair that it can send you in.<br/>\n&gt; <br/>\n&gt; I could honestly have written the OP&#39;s post today.  We just started therapy and psych testing to try and get to the bottom of my DD&#39;s rages (she&#39;s 4.5) despite being second guessed by well meaning people in our lives.  We have known there was something going on for about 2 years, but we are just now pursuing things for 2 reasons:<br/>\n&gt; <br/>\n&gt; 1.  SHE expresses frustration with not knowing why she gets so angry as well as not wanting to feel that way.<br/>\n&gt; <br/>\n&gt; and<br/>\n&gt; <br/>\n&gt; 2.  Her rages and impulsiveness are something that we&#39;ve exhausted our personal knowledge on in terms of giving her the tools she needs to better handle herself and the situation.<br/>\n&gt; <br/>\n&gt; I think these 2 reasons echo what other posters have said in that it&#39;s not about controlling the rage (it&#39;s counterproductive in kids like this).  It is, however, about getting to the root of things and working together to acquire the necessary tools to make things flow for EVERYONE (parent, child, siblings etc) involved.<br/>\n&gt; <br/>\n&gt; Medication isn&#39;t the devil that it&#39;s made out to be *IF* it&#39;s used in combination with therapy, caring adults and with the child&#39;s input.<br/>\n&gt; <br/>\n&gt; ********<br/>\n&gt; &quot;I can&#39;t live in fear of attack&quot;<br/>\n&gt; ********<br/>\n&gt; Outside of anything unschooling related, the fact that the OP is fearful of her child is quite indicative of her needing some outside support in some capacity.<br/>\n&gt; <br/>\n&gt; ********<br/>\n&gt; &quot;And finally, is it possible to<br/>\n&gt; find therapists who are sympathetic to radical unschooling? &quot;<br/>\n&gt; ********<br/>\n&gt; <br/>\n&gt; I think as long as you walk as a strong advocate for your child, it doesn&#39;t become an issue of unschooling or not.  For us right now, the &#39;well meaning&#39; people in our life think that all of our troubles would be greatly reduced, if not disappear, if we would just send DD to public school in the fall.  DH and I feel that we couldn&#39;t do much worse of a thing *than* send her to school!  The majority of people in the therapy/assistance world aren&#39;t going to *get* or sympathize with unschooling, or even eclectic homeschooling for that matter.  However, if they&#39;re good at they&#39;re job, they *will* respect your parenting choices, respect the fact that you know your child and most importantly find a way to make things work for everyone.<br/>\n&gt; <br/>\n&gt; Hang in there mama!  You are heading in the right direction!<br/>\n&gt; <br/>\n&gt; Grace!<br/>\n&gt; <br/>\n&gt; Erica<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":302010303,"authorName":"sharon","from":"&quot;sharon&quot; &lt;1drflmthr@...&gt;","profile":"sharonjemerson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unacceptable behavior","postDate":"1278975771","msgId":44520,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkxZzZ1citkbGN1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE5QTQ5RTg0LTFEMzgtNEM2RS04MUE5LTU0QTk0QzU5M0VDMEBnbWFpbC5jb20+"},"prevInTopic":44519,"nextInTopic":44522,"prevInTime":44519,"nextInTime":44521,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"Stephanie wrote: What are you feeling? He said something like, I m very frustrated because this isn t working and nothing ever works and it never will--","messageBody":"<div id=\"ygrps-yiv-824210252\">Stephanie wrote:<br/>\n&quot;What are you feeling?&quot; He said<br/>\nsomething like, &quot;I&#39;m very frustrated because this isn&#39;t working and<br/>\nnothing ever works and it never will--&quot; and then he smashed his Lego<br/>\ncreation. I responded, &quot;You&#39;re frustrated because the Lego thing<br/>\nisn&#39;t working and suddenly the Lego project seems bigger than<br/>\nanything...&quot; or something like that........ and then I started<br/>\ndevising a solution to his Lego dilemma until he got caught up trying<br/>\nto prove why my solution wouldn&#39;t work and his would (of course he was<br/>\nright) but even more to the point for me, the situation was diffused,<br/>\nand I had gained an insight......<br/>\n<br/>\nLove the way you handled this. Some of this is actually a technique used for active listening in the therapeutic technique called &quot;Imago Therapy&quot; by Harville Hendrix in his couple&#39;s book called &quot;Getting the Love You Want.&quot; Repeating back to someone what exactly what you heard them say is very validating and helps the other person know that they have been heard. When I remember, this has always had positive results for my son when he gets frustrated/upset/angry.<br/>\nFor example this is what happened on a day that my dtr went out with her friends and his friends were not available: <br/>\nSon: &quot;I want to go with my friends!&quot;<br/>\nMe: &quot;You want to go with your friends.&quot;<br/>\nSon: &quot;Yeah, Abigail gets to go with her friends and I want to go with my friends!&quot; <br/>\nMe: &quot;Abigail gets to go with her friends and you want to go with your friends.&quot;<br/>\nSon: &quot;Yeah. How come she gets to go with her friends? I want to go with my friends!&quot;<br/>\nMe: &quot;She gets to go with her friends and you want to go with your friends.&quot;<br/>\nSometimes this might go on for 15 minutes. If I can just stay present, be there to witness his feelings, and allow him to vent while I let him know that he is being heard, he is able to move on. He feels validated and I feel good about not getting frustrated. <br/>\nGetting into explanations and reasoning often just feeds the frustration and adds fuel to his anger. Sometimes all we need as adults and children is just to be heard.<br/>\nBest,<br/>\nSharon</div>","specialLinks":[]},{"userId":300129699,"authorName":"Stephanie Kimball","from":"Stephanie Kimball &lt;kimball.stephanie@...&gt;","profile":"sksundancer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Unacceptable behavior","postDate":"1278971973","msgId":44519,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0NkJDMjUxLUJDM0EtNEMwQi04RTNGLUI0RjU4NjM1RTU4Q0BnbWFpbC5jb20+","inReplyToHeader":"PGkxZnYwbSs3NmhkQGVHcm91cHMuY29tPg==","referencesHeader":"PGkxZnYwbSs3NmhkQGVHcm91cHMuY29tPg=="},"prevInTopic":44518,"nextInTopic":44520,"prevInTime":44518,"nextInTime":44520,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"Wow, that is beautiful; congratulations to you both, and thank you for sharing this!! Onward......... stephanie ... [Non-text portions of this message have","messageBody":"<div id=\"ygrps-yiv-709736686\">Wow, that is beautiful; congratulations to you both, and thank you for  <br/>\nsharing this!!<br/>\n<br/>\nOnward.........<br/>\n<br/>\nstephanie<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jul 12, 2010, at 4:47 PM, meadowgirl11 wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;meadowgirl11&quot;  <br/>\n&gt; &lt;tamithameadow@...&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Anyway, this is a bit of a ramble, but I am writing in bits while  <br/>\n&gt; I do other things.<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; Umm, oops, bad editing on that post.<br/>\n&gt;<br/>\n&gt; I just wanted to add a sweet little moment that just happened. My  <br/>\n&gt; son, who used to get so furious that he regularly had one or more  <br/>\n&gt; hour long meltdowns over things like burnt toast, just told me, in  <br/>\n&gt; the most calm and even tone &quot;I am so angry right now mom, I am  <br/>\n&gt; really, really angry&quot; because he thought I was making him lunch and  <br/>\n&gt; I was busy writing a post (lunch was promptly made, all is well  <br/>\n&gt; now). I responded that he didn&#39;t sound angry and he replied that he  <br/>\n&gt; was restraining himself. I asked him how and he said, &quot;I don&#39;t know,  <br/>\n&gt; I just decided to&quot;.<br/>\n&gt;<br/>\n&gt; This might sound like no big deal, but I know those of you with  <br/>\n&gt; experience will understand how absolutely huge that is for us. Just  <br/>\n&gt; wanted to share - I never imagined my life could get so crazy and  <br/>\n&gt; once it did, I never imagined it could get so much better, but  <br/>\n&gt; thanks to all of you, it has, better than I thought was possible.  <br/>\n&gt; You have no idea how grateful I am for everyone&#39;s amazing sharing  <br/>\n&gt; and the time you all put into helping people like me. Our kids may  <br/>\n&gt; never know how much they owe their childhood happiness to you.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":370007365,"authorName":"meadowgirl11","from":"&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt;","profile":"meadowgirl11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unacceptable behavior","postDate":"1278967638","msgId":44518,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkxZnYwbSs3NmhkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkxZmM1dStqcmw3QGVHcm91cHMuY29tPg=="},"prevInTopic":44517,"nextInTopic":44519,"prevInTime":44517,"nextInTime":44519,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"... Umm, oops, bad editing on that post. I just wanted to add a sweet little moment that just happened. My son, who used to get so furious that he regularly","messageBody":"<div id=\"ygrps-yiv-504996264\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;meadowgirl11&quot; &lt;tamithameadow@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; Anyway, this is a bit of a ramble, but I am writing in bits while I do other things.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Umm, oops, bad editing on that post. <br/>\n<br/>\nI just wanted to add a sweet little moment that just happened. My son, who used to get so furious that he regularly had one or more hour long meltdowns over things like burnt toast, just told me, in the most calm and even tone &quot;I am so angry right now mom, I am really, really angry&quot; because he thought I was making him lunch and I was busy writing a post (lunch was promptly made, all is well now). I responded that he didn&#39;t sound angry and he replied that he was restraining himself. I asked him how and he said, &quot;I don&#39;t know, I just decided to&quot;. <br/>\n<br/>\nThis might sound like no big deal, but I know those of you with experience will understand how absolutely huge that is for us. Just wanted to share - I never imagined my life could get so crazy and once it did, I never imagined it could get so much better, but thanks to all of you, it has, better than I thought was possible. You have no idea how grateful I am for everyone&#39;s amazing sharing and the time you all put into helping people like me. Our kids may never know how much they owe their childhood happiness to you.</div>","specialLinks":[]},{"userId":370007365,"authorName":"meadowgirl11","from":"&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt;","profile":"meadowgirl11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unacceptable behavior","postDate":"1278966558","msgId":44517,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkxZnR1dStpc3VtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkxYWN2bSs5bnIxQGVHcm91cHMuY29tPg=="},"prevInTopic":44516,"nextInTopic":44518,"prevInTime":44516,"nextInTime":44518,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"... When we first started unschooling it was partly because of ds having huge violent explosions about attending school. We had been trying all kinds of","messageBody":"<div id=\"ygrps-yiv-416791857\"><blockquote><span title=\"ireply\">&gt; Stephanie Kimball &lt;kimball.stephanie@&gt; wrote:<br/>\n&gt; &gt;I have  <br/>\n&gt; &gt; decided that I/we do need professional help<br/>\n&gt; <br/>\n&gt; is it possible to<br/>\n&gt; find therapists who are sympathetic to radical unschooling? I dread<br/>\n&gt; shelling out money and time dragging my kid to therapy only to be told<br/>\n&gt; to do whatever is the 10-yr-old version of &quot;let him cry&quot;............&lt;&lt;<br/>\n<br/>\n </span></blockquote>When we first started unschooling it was partly because of ds having huge violent explosions about attending school. We had been trying all kinds of behaviour modification approaches for years with no success and all kinds of damage to the relationship, added to early attachment issues already present. I had a new baby with my new partner who was NOT understanding or attached to ds, though he had the best intentions. I was overwhelmed and horrified. This was NOT what I thought parenting would be like. <br/>\n<br/>\nThen I learned about (really stumbled across) radical unschooling while trying to see if he could homeschool. I started reading Ross Greene, Mary Sheedy Kurchinka, Thomas Gordon (P.E.T.), Alfie Kohn and about everything I could find on unschooling. I wanted to apply this way of being in our lives, but was so used to seeing his &quot;behaviour&quot; in a certain way and being triggered by it. I felt I needed more support myself, for my son and to get other people like my husband on board with my &quot;crazy ideas&quot;. A friend recommended the therapists at our local child and youth mental health agency as being really amazing for the kids, so I decided to give them a try. <br/>\n<br/>\nI am a trained social worker and a lot of our training was about how labeling is detrimental, so I went in with a clear intention to get support not a label. I was prepared to walk if they offered me behaviour mod approaches and started questioning my choices. I was also armed with tons of knowledge, research and a very firm belief in collaborative problem solving and peaceful parenting. In other words, I was able to be a strong advocate for my son and myself and not feel like the therapist was an authority figure that had more power or knowledge than me. That is REALLY important!<br/>\n<br/>\nWhen I actually went to see the therapist, I asked a lot of questions and only gave necessary information. I didn&#39;t use the word unschooling, I talked about natural learning and trust and following his lead, learning what he was excited about. When I went to the info session prior to the appointment, I was given materials from Ross Greene so I knew that I could use that language and be understood. I talked about collaborative problem solving approaches and attachment theory, which is very popular with children and family therapists. Like Meredith said, I used language that they would understand and I was clear about what kind of help I wanted. <br/>\n<br/>\nThe therapist agreed to work on attachment issues and help my son with new strategies for dealing with his anger. She used mainly play therapy with some little quizzes and activities and he really liked her. He had been in therapeutic situations before and it had always been a good experience for him, lots of positive encouragement, play and art and a special person who is fun and likes him for who he is, so it was a good set up for him and he was happy to go.  <br/>\n<br/>\nThe experiences prior to unschooling weren&#39;t all that helpful in terms of &quot;results&quot; because they were matched with me getting advice about behaviour mod that I tried to follow which just made things worse. The experience post unschooling, it is hard to say. His violent outbursts decreased, but that also coincided with me learning (slowly and painfully) how to parent respectfully, removing a whole lot of stressors from his life, like school, bedtimes, etc. and his having increased access to video games, including ones that I had previously forbid as too violent. These seem to be a great outlet for his aggression and also have really increased his frustration tolerance which was really low and led to a lot of blow ups. There was also a big focus on rebuilding attachment with him, which was mainly about time and attention just for him, mommy and son dates and reading alone together, etc. He says he doesn&#39;t think any of the therapy stuff is what helped, but I am sure some of the calming strategies started there, as well as a shift in him seeing me as a resource, seeing me as being on his side, which I clearly wasn&#39;t before. I know he and the therapist talked about that quite a bit, how he was lucky to have a mom who wanted to help him and was willing to &quot;homeschool&quot; him and make things better for him.  <br/>\n<br/>\nThere were also some unfortunate things that happened. One was that, after a really great first session with me where the therapist seemed to agree and understand the need to use the CPS approach and focus on improving attachment, I brought my husband in for a session. At that session she seemed to completely flip flop and suggested using a 1-2-3 Magic video (a really terrible controlling behaviour mod approach that we had already used in the past and that my husband liked because it gave him a sense of power and control when things felt out of control). She also gave some interpretations of things my son had said or done in his sessions which gave the impression that I was being overprotective, which added fuel to my husband&#39;s belief that I was &quot;letting him get away with it&quot; by changing to this approach. I ended up having to do damage control with dh after that and it set us back quite a bit in him accepting and getting on board with unschooling/peaceful parenting (which he is now for the most part, 1.5 years later). <br/>\n<br/>\nAll in all, if I was paying for it, I don&#39;t know that I would have gotten my money&#39;s worth, but it was mostly positive. I think if I had been less clear and less good at interacting with &quot;authority&quot;, more vulnerable or more lost, it would have gone differently, with more interventions, possibly insistence on making a return to school the goal (as it usually is with school refusal). All in all, it was risky in retrospect. If they think there is risk to the child, that they are being neglected, which we know unschooling can be misinterpreted as, they legally have to report and that can get a whole other mess started. Reflecting on it now, it might not have been the best choice at the time, although it thankfully turned out fine. <br/>\n<br/>\nUltimately my advice is &quot;use extreme caution&quot;, go with the intention to work with your child, not to &quot;fix&quot; him and listen to your gut. Here is a quote from Ren Allen&#39;s article about the topic:<br/>\n<br/>\n&quot;Everything we did was geared towards support, geared towards helping him function in a world that is a difficult for him to navigate.<br/>\n<br/>\nAnd this is the difference between your average mainstream reaction to &quot;atypical&quot; children and the unschooling approach. In most circles the child is discussed as someone with a &quot;disability&quot; or &quot;disorder&quot;. They are broken. Therapy is there to make them fit in to mainstream society. Those children often become stunted versions of themselves in order to fit in.<br/>\n<br/>\nUnschooling families learn about therapy (or use it) in order to better support the child. The changes are being made within ourselves. I learned about the labels so that I could be a better parent, not to alter who-he-is. The motivation is to understand and connect, to support and embrace.&quot; <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://radicalunschooling.blogspot.com/2009_10_01_archive.html)\">http://radicalunschooling.blogspot.com/2009_10_01_archive.html)</a><br/>\n<br/>\n <br/>\n<br/>\nGood luck!<br/>\nTammy</div>","specialLinks":[]},{"userId":300129699,"authorName":"Stephanie Kimball","from":"Stephanie Kimball &lt;kimball.stephanie@...&gt;","profile":"sksundancer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Unacceptable behavior","postDate":"1278962500","msgId":44516,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5QTQ5RTg0LTFEMzgtNEM2RS04MUE5LTU0QTk0QzU5M0VDMEBnbWFpbC5jb20+","inReplyToHeader":"PGkxZmM1dStqcmw3QGVHcm91cHMuY29tPg==","referencesHeader":"PGkxZmM1dStqcmw3QGVHcm91cHMuY29tPg=="},"prevInTopic":44514,"nextInTopic":44517,"prevInTime":44515,"nextInTime":44517,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"I know these threads can get confusing so, for the record, I am the OP on this topic.  Thanks so much to everyone for sharing the wealth of your experiences","messageBody":"<div id=\"ygrps-yiv-872951762\">I know these threads can get confusing so, for the record, I am the OP  <br/>\non this topic.  Thanks so much to everyone for sharing the wealth of  <br/>\nyour experiences and resources.<br/>\n<br/>\nI haven&#39;t yet followed all the links suggested but I will;  I just  <br/>\nwanted to respond generally to what&#39;s been said so far before that  <br/>\ntask gets any more overwhelming!<br/>\n<br/>\nFirst, to those who wrote about your own experiences with family  <br/>\nmembers and rages, thank you so much.  The look of shock and horror on  <br/>\nfaces of the uninitiated when I tell what sometimes goes on here can  <br/>\nbe almost as frightening as the incidents themselves; knowing I&#39;m not  <br/>\nthe only one who&#39;s had to deal with this is inexplicably reassuring.<br/>\n<br/>\nSecond, I have read Ross Greene&#39;s book, Explosive Child.  That was  <br/>\nenormously helpful to me a couple years ago, when I realized how much  <br/>\nI could ease the tensions in my household simply by letting go of  <br/>\nunimportant things.  I worked hard to make DS&#39;s life as stress-free as  <br/>\npossible.  The problem for me was, and is, that there are always SOME  <br/>\nthings that I can not change -- In winter I can&#39;t stop the snow from  <br/>\nmelting when he wants to sled, I can&#39;t make him meet the height  <br/>\nrequirements at the Fair if he is too big or too small for a ride he  <br/>\nwants to go on.....  And yes,  I CAN come up with alternate activities  <br/>\nbesides sledding and the particular offending ride, but in most cases  <br/>\nthere is no time for that -- the situation arises and instantly he&#39;s  <br/>\nacross the line, unable to control himself, or to reason, calm down,  <br/>\nhear me, etc., no matter what I do or say.  Then, as someone pointed  <br/>\nout, it&#39;s a matter of finding a way to ride it out safely, or as  <br/>\nsafely as possible.  Since DS is now about my size, safety is becoming  <br/>\nharder to maintain, for myself, my daughter, and our house/ <br/>\npossessions.  Which is probably why I&#39;ve begun to feel desperate.<br/>\n<br/>\nThird, thanks for the suggestions regarding finding a compatible  <br/>\ntherapist.  That is exactly the kind of information I was looking for   <br/>\n(ie. vocabulary to use and to watch for, books to read, approaches to  <br/>\nask about).  I&#39;m actually putting the brakes on the therapy route for  <br/>\nnow, unless DS requests that sort of help, in favor of trying one more  <br/>\navenue first (see below!)<br/>\n<br/>\nFourth, even though I wasn&#39;t asking for help dealing with the actual  <br/>\nrage situations, some of you offered it  and, in fact, I&#39;m incredibly  <br/>\ngrateful.  Mulling over all your thoughts and suggestions put me in a  <br/>\nframe of mind to respond rather differently to outbursts in the last  <br/>\ncouple days; only time will tell, but right now it seems the results  <br/>\nare significant.  What follows is kind of long, so if you&#39;re jumping  <br/>\noff here that&#39;s fine -- ;)   but in case anyone else on the list might  <br/>\nbe dealing with issues similar to mine, I offer you this:<br/>\n<br/>\n<br/>\n<br/>\nA couple days ago when my kids and I were playing with Lego, DS  <br/>\nstarted to lose it as soon as his project seemed not to work the way  <br/>\nhe&#39;d planned.  In a flash of inspiration, right at that moment when I  <br/>\ncould see him switching from sweet, happy, creative boy to The Angry  <br/>\nMonster,  I skipped making my usual worthless attempt to calm him, and  <br/>\ninstead simply asked him quietly,   &quot;What are you feeling?&quot;   He said  <br/>\nsomething like,  &quot;I&#39;m very frustrated because this isn&#39;t working and  <br/>\nnothing ever works and it never will--&quot;  and then he smashed his Lego  <br/>\ncreation.  I responded,  &quot;You&#39;re frustrated because the Lego thing  <br/>\nisn&#39;t working and suddenly the Lego project seems bigger than  <br/>\nanything...&quot;  or something like that........ and then I started  <br/>\ndevising a solution to his Lego dilemma until he got caught up trying  <br/>\nto prove why my solution wouldn&#39;t work and his would (of course he was  <br/>\nright)  but even more to the point for me, the situation was diffused,  <br/>\nand I had gained an insight......<br/>\n<br/>\nSo yesterday when he got frustrated again with the Lego I distracted  <br/>\nhim momentarily with a comment about fuses -- how some people have  <br/>\nlonger ones, and their frustration grows gradually, so that they have  <br/>\ntime to make choices, like walk away and do something else for a  <br/>\nwhile, or try a different solution to the frustrating challenge; but  <br/>\nhe seems to have a very short fuse, so that a seemingly small  <br/>\nfrustration is suddenly a big explosion........ and that it might help  <br/>\nfor us to figure out some ways to lengthen his fuse.   Then I dropped  <br/>\nthe theoretical stuff and helped him deal with the concrete thing that  <br/>\nwas causing his frustration, and soon he drifted off to do something  <br/>\nelse nearby, which I realize now with astonishment may have been a  <br/>\ndeliberate attempt on his part to take my suggestion  re/ removing  <br/>\nhimself from the frustrating situation!!   (Funny, at the time when I  <br/>\nrealized he was off fiddling with his keyboard and I was sitting there  <br/>\nmuddling with his Lego, I was tempted for a moment to say, Hey!  Get  <br/>\nback here, this is YOUR Lego thing not mine, why am I building it?   <br/>\nbut fortunately I caught myself in time to realize it was better for  <br/>\nhim to have a break -- in fact, that&#39;s what I&#39;d HOPE he will learn to  <br/>\ndo, and only realized later that perhaps he HAD done it on purpose in  <br/>\nan attempt to calm down!!!)<br/>\n<br/>\nAnyway I say all that to say this:  when I was tucking him into bed  <br/>\nthat night and all was calm, peaceful and loving between us, I asked  <br/>\nhim what he thought about what I&#39;d said earlier about fuses.  He said   <br/>\n&quot;Good,&quot;  and asked,  &quot;but how do you change that?&quot;  I answered,  &quot;I&#39;m  <br/>\nnot sure, but I think between the two of us we can figure it out.  If  <br/>\nyou want to.  Do you want to try?&quot;   And he said,  &quot;Yes.&quot;<br/>\n<br/>\nI realize this might not seem like much and I apologize for the  <br/>\nexcruciating detail, but for me this is huge.  I tear up every time I  <br/>\ntry to write this.  He&#39;s never before accepted, let alone asked for  <br/>\nhelp in this matter.  And suddenly it seems that we both (!?!) might  <br/>\nhave caught a glimpse of what it is that&#39;s going on with him -- a  <br/>\nsmall frustration is immediately attached to every frustration and  <br/>\ndisappointment he&#39;s ever experienced, leading to the sense that the  <br/>\nwhole world is against him, and sparking his rage in response.  I,  <br/>\nmeanwhile, react with indignation at his out-of-proportion reaction to  <br/>\nthe situation at hand, and he then turns on me, enraged that I would  <br/>\nbe so unfeeling about the fact (in his view) that the whole world is  <br/>\nagainst him.  If he can learn to recognize the early feeling of  <br/>\nfrustration, and train himself to use an alternate strategy (walking  <br/>\naway from the frustrating situation, asking for help, taking deep  <br/>\nbreaths, etc.), he could possibly, in effect, buy himself some time to  <br/>\nprocess, put the situation in perspective, and choose to do something  <br/>\nother than beat up his mother.  This (lengthening the fuse) to me is  <br/>\nan enormously different task than trying to figure out how to control  <br/>\nthe beast once it&#39;s out of its cage; asking DS to control himself when  <br/>\nhe&#39;s out of control never made sense to me, nor does it make sense for  <br/>\nme to try to control him then, either physically or by raising the  <br/>\nstakes with punishments, ultimatums, threats, etc.  What could really  <br/>\nhelp is understanding why and how he so easily gets to a point of rage  <br/>\nthat most people might not reach in a lifetime (but probably could, in  <br/>\nthe right circumstances -- I have felt my own rage, for instance, when  <br/>\nI&#39;ve seen DS turn on his sister, or put us all in danger by throwing  <br/>\nfits in the car; similarly I can imagine being utterly ruthless  <br/>\nagainst anyone who would harm either of my children.....  it&#39;s just  <br/>\nthat DS gets to that point when he burns his toast or gets his kite  <br/>\nstuck in a tree!)<br/>\n<br/>\nWe have a huge mountain to climb but it is an unbelievable relief to  <br/>\nhave, at least, the first foothold in view, even knowing that we may  <br/>\nneed to change course several times before we reach the safety of the  <br/>\ntop.  (Ok, the metaphor doesn&#39;t quite work but maybe you know what I  <br/>\nmean. :)<br/>\n<br/>\nIf you&#39;re still reading, thanks for listening!  I am SO THANKFUL for  <br/>\nthis list and for the wonderful people who take the time to share  <br/>\ntheir journeys here.<br/>\n<br/>\nPeace,<br/>\nstephanie<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":302010303,"authorName":"sharon","from":"&quot;sharon&quot; &lt;1drflmthr@...&gt;","profile":"sharonjemerson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unacceptable behavior","postDate":"1278951748","msgId":44514,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkxZmZnNCtkc2MyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg2OThFMjAxMzA2RDRCMTI5QzU1NkU3MjAxQjJDNTlCQENvbm5pZVBDPg=="},"prevInTopic":44513,"nextInTopic":44516,"prevInTime":44513,"nextInTime":44515,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"Why would somebody go see a Licensed Clinical Social Worker? In my area, social workers are typically thought of in terms of government agencies. Connie I","messageBody":"<div id=\"ygrps-yiv-1141237571\">&quot;Why would somebody go see a Licensed Clinical Social Worker? In my area, social workers are typically thought of in terms of government agencies.&quot; Connie<br/>\n<br/>\nI happen to be an LCSW and your info about them being gov&#39;t workers is wrong. Most LCSW&#39;s I know are in private practice. Most gov&#39;t workers in social service positions are not LCSW and don&#39;t even have a degree in Social Work! This is such false information. It is like stereo- typing all homeschoolers as religious fanatics who sit their kids at the kitchen table and have no social skills.<br/>\nTheir are some excellent LCSW&#39;s and some not so excellent ones just like any profession. Some may support your position and some may not. <br/>\nSharon Emerson, LCSW</div>","specialLinks":[]},{"userId":370007365,"authorName":"meadowgirl11","from":"&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt;","profile":"meadowgirl11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unacceptable behavior","postDate":"1278948350","msgId":44513,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkxZmM1dStqcmw3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3MTMyMDgzMEFCODQwRUZCMTJFRjhFQjU4OTkzM0U5QEx5bGFQQz4="},"prevInTopic":44509,"nextInTopic":44514,"prevInTime":44512,"nextInTime":44514,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"I totally agree with Joyce and Lyla, especially with Lyla s suggestion about finding a therapist who is trained in or at least familiar with Ross Greene s","messageBody":"<div id=\"ygrps-yiv-175667453\">I totally agree with Joyce and Lyla, especially with Lyla&#39;s suggestion about finding a therapist who is trained in or at least familiar with Ross Greene&#39;s collaborative problem solving approach. Your post really took me back to that feeling of being afraid of my son&#39;s rages, not so long ago. I know it feels so terrifying and confusing, especially when you are doing everything you can think of to make things work for him and it still isn&#39;t enough.<br/>\n<br/>\nWhat I would say helped me the most was to realize and really accept that it wasn&#39;t something he could control in the moment and it wasn&#39;t personal. I had to stop thinking in terms of behaviour at all, to start thinking in terms of how I could support him, help him, be there for him and, especially, not get triggered. (I often use Danielle Conger&#39;s analogy of &quot;being a mountain&quot;). What I found was that it was usually me not being able to handle his anger, getting triggered and trying to stop or control his outburst that escalated things to the point of violence. It wasn&#39;t like he just noticed that we didn&#39;t have any ____ or whatever it was that set him off and started punching me out. There was almost always an escalation that I played a key role in, often with me trying to make him calm down, minimize his concern and/or physically move or restrain him, which I would NOT recommend in the case of violence unless *absolutely* necessary, despite some of the suggestions made here. He could hurt me and himself at 7, at 10 he is nearly my size and weight and there is no way I could restrain him without someone getting hurt.  <br/>\n<br/>\nI am NOT saying it is the mom&#39;s fault here, not at all, but I am saying in my very personal experience, there was almost always some version of me saying &quot;this is not acceptable, you have to stop&quot;,  basically some version of no. In my experience, and Ross Greene&#39;s work back&#39;s me up here, kids like this just can&#39;t deal with or accept no and what has worked best has been to find whatever way I can to get on his side, sometimes more successfully than others.  <br/>\n<br/>\nAnyway, the OP seems to not want anymore advice on how to handle things, and I can understand that. I really felt like I needed an expert when I was dealing with the worst of this too. In retrospect though, it was the advice I got on here and other unschooling sites and lists, mixed with my own reading and research, that really got me past the worst of it, so maybe someone else reading this thread is looking for that as well. I am not sure if you have read Danielle Conger&#39;s writing about this <a rel=\"nofollow\" target=\"_blank\" href=\"http://danielleconger.organiclearning.org/spirited.html\">http://danielleconger.organiclearning.org/spirited.html</a><br/>\nor Ren Allen <a rel=\"nofollow\" target=\"_blank\" href=\"http://radicalunschooling.blogspot.com/2009_10_01_archive.html\">http://radicalunschooling.blogspot.com/2009_10_01_archive.html</a> (scroll down for the article about not seeking labels/diagnoses). I found both of these hugely helpful when I was in the thick of it. <br/>\n<br/>\nAre you getting the sense that things are much less intense now? Good, because they are, hugely. Not that there aren&#39;t still rages, but there is no more physical violence, at least not toward anything animate for the most part. I attribute alot of the improvement to me totally rethinking my expectations of his &quot;behaviour&quot; and accepting that he is going to have *BIG* reactions to what seem like small problems to me, being way more understanding of how important these &quot;little&quot; things are to him. The rest I attribute to maturity, much improved attachment (there were some really big attachment issues) and his learning some new strategies for calming himself down. I asked him what helps him to not get physical and he says video games, going to his room to read on his own, and me letting him pound on a pillow sometimes. I used to use time outs as punishment before unschooling, so it took him awhile to see going to his own space to chill out as something he could choose to do to help himself feel better, but he does it regularly now and it really helps. Sometimes I guide him in that direction with a reminder &quot;maybe you might want to go to your room to chill out a bit?&quot;, but always with the element of choice. <br/>\n<br/>\nI am going to write another post about therapy because we have gone that route as well. Hope some of this is helpful. <br/>\n<br/>\ngood luck!<br/>\nTammy <br/>\n<br/>\nAnyway, this is a bit of a ramble, but I am writing in bits while I do other things.</div>","specialLinks":[]},{"userId":185586397,"authorName":"lylaw","from":"&quot;lylaw&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Unacceptable behavior","postDate":"1278873949","msgId":44509,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJBQ0RCMkMyQjM3NDRFODVBMEREQzRGQjNDQTQxRUMyQEx5bGFQQz4=","inReplyToHeader":"PGkxYW9kOStwajU3QGVHcm91cHMuY29tPg==","referencesHeader":"PGkxYW9kOStwajU3QGVHcm91cHMuY29tPg=="},"prevInTopic":44508,"nextInTopic":44513,"prevInTime":44508,"nextInTime":44510,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1209159451\">&lt;&lt;Medication isn&#39;t the devil that it&#39;s made out to be *IF* it&#39;s used in combination with therapy, caring adults and with the child&#39;s input.<br/>\n***<br/>\n<br/>\nalso, sometimes medication is what&#39;s needed to help a child&#39;s brain chemistry equilibrate to a degree that they can be *themselves* and grow and mature toward more balance, and therapy is not necessary or desired.    if a child resists therapy, or isn&#39;t helped by it, or if their issues are primarily or purely chemical and not psychological, then therapy isn&#39;t going to help  - especially if they don&#39;t want to go!    <br/>\n<br/>\nlyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Unacceptable behavior","postDate":"1278869194","msgId":44508,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2NEZCMjlBRDg4NjQwNDc5RkYzM0IyMzI0NERBQUYyQENvbm5pZVBDPg==","inReplyToHeader":"PGkxYW9kOStwajU3QGVHcm91cHMuY29tPg==","referencesHeader":"PGkxYW9kOStwajU3QGVHcm91cHMuY29tPg=="},"prevInTopic":44507,"nextInTopic":44509,"prevInTime":44507,"nextInTime":44509,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"... It is impossible to imagine what a full blown rage looks like. I grew up in a house where I had a sibling that had rages. It is very scary because you","messageBody":"<div id=\"ygrps-yiv-1251001212\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;And until you have had your own flesh and blood, whom you loving nurture and encourage, go after you in attack mode, or go after one of your other children relentlessly, all the imagining in the world can&#39;t prepare you for the level of despair that it can send you in.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>It is impossible to imagine what a full blown rage looks like. I grew up in a house where I had a sibling that had rages. It is very scary because you never know when something will set them off. There were times that we lived in fear. I wish my mother had done more to protect the rest of us from these rages. As an adult, this sibling was diagnosed with bipolar disorder. Because things were not dealt with, he is now in prison. My parents never included my sibling or any of the rest of us when they discussed how to handle his rages. It pretty much became an atmosphere where everybody catered to the sibling to keep him from having rages. That is no way for anybody to live.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I think these 2 reasons echo what other posters have said in that it&#39;s not about controlling the rage (it&#39;s counterproductive in kids like this).&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Once a rage has started, there is no controlling it. It becomes a matter of riding it out safely. One of the books that I read mentioned creating a safe place for a kid to go when they feel a rage coming on; a place where they can tear something up, kick, scream, or yell until the rage passes. Help them redirect the aggression to inanimate objects rather than people. Sometimes, that is the best that can be hoped for until things can be sorted out.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;For us right now, the &#39;well meaning&#39; people in our life think that all of our troubles would be greatly reduced, if not disappear, if we would just send DD to public school in the fall. DH and I feel that we couldn&#39;t do much worse of a thing *than* send her to school!&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I know several people that went to school and it didn&#39;t help their troubles. There are some things that are outside the scope of parenting or schooling. In my experience, schools aggravate some troubles because of all of the added stress. When my spirited child gets stressed, she acts out so the key is to keep stress levels really low and that is almost impossible in a public school environment. <br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":441747317,"authorName":"elguthaus","from":"&quot;elguthaus&quot; &lt;eguthaus@...&gt;","profile":"elguthaus","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unacceptable behavior","postDate":"1278797033","msgId":44507,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkxYW9kOStwajU3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkxYWx1cyt2c2NyQGVHcm91cHMuY29tPg=="},"prevInTopic":44506,"nextInTopic":44508,"prevInTime":44506,"nextInTime":44508,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"Again, I m just imagining how I might handle the situation as I ve never  had a child try to hit me. ... ****** And until you have had your own flesh and","messageBody":"<div id=\"ygrps-yiv-1797881914\">&quot;Again, I&#39;m just imagining how I might handle the situation as I&#39;ve never  had a child try to hit me.&quot;<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n </span></blockquote>******<br/>\n<br/>\nAnd until you have had your own flesh and blood, whom you loving nurture and encourage, go after you in attack mode, or go after one of your other children relentlessly, all the imagining in the world can&#39;t prepare you for the level of despair that it can send you in.<br/>\n<br/>\nI could honestly have written the OP&#39;s post today.  We just started therapy and psych testing to try and get to the bottom of my DD&#39;s rages (she&#39;s 4.5) despite being second guessed by well meaning people in our lives.  We have known there was something going on for about 2 years, but we are just now pursuing things for 2 reasons:<br/>\n<br/>\n1.  SHE expresses frustration with not knowing why she gets so angry as well as not wanting to feel that way.<br/>\n<br/>\nand<br/>\n<br/>\n2.  Her rages and impulsiveness are something that we&#39;ve exhausted our personal knowledge on in terms of giving her the tools she needs to better handle herself and the situation.<br/>\n<br/>\nI think these 2 reasons echo what other posters have said in that it&#39;s not about controlling the rage (it&#39;s counterproductive in kids like this).  It is, however, about getting to the root of things and working together to acquire the necessary tools to make things flow for EVERYONE (parent, child, siblings etc) involved.<br/>\n<br/>\nMedication isn&#39;t the devil that it&#39;s made out to be *IF* it&#39;s used in combination with therapy, caring adults and with the child&#39;s input.<br/>\n<br/>\n********<br/>\n&quot;I can&#39;t live in fear of attack&quot;<br/>\n********<br/>\nOutside of anything unschooling related, the fact that the OP is fearful of her child is quite indicative of her needing some outside support in some capacity.<br/>\n<br/>\n********<br/>\n&quot;And finally, is it possible to<br/>\nfind therapists who are sympathetic to radical unschooling? &quot;<br/>\n********<br/>\n<br/>\nI think as long as you walk as a strong advocate for your child, it doesn&#39;t become an issue of unschooling or not.  For us right now, the &#39;well meaning&#39; people in our life think that all of our troubles would be greatly reduced, if not disappear, if we would just send DD to public school in the fall.  DH and I feel that we couldn&#39;t do much worse of a thing *than* send her to school!  The majority of people in the therapy/assistance world aren&#39;t going to *get* or sympathize with unschooling, or even eclectic homeschooling for that matter.  However, if they&#39;re good at they&#39;re job, they *will* respect your parenting choices, respect the fact that you know your child and most importantly find a way to make things work for everyone.<br/>\n<br/>\nHang in there mama!  You are heading in the right direction!<br/>\n<br/>\nGrace!<br/>\n<br/>\nErica</div>","specialLinks":[]},{"userId":160276266,"authorName":"Amanda&#39;s Shoebox","from":"&quot;Amanda&#39;s Shoebox&quot; &lt;amandasshoebox@...&gt;","profile":"amandasshoebox","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unacceptable behavior","postDate":"1278796146","msgId":44506,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkxYW5oaStnNGxmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGluTlhFTW15T3FiZ2o0OEZiTGFHd1NFdy10cjZ6XzNUcnZVVkxjQ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":44505,"nextInTopic":44507,"prevInTime":44505,"nextInTime":44507,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"... #################################################################### Great website! I just read this article: ","messageBody":"<div id=\"ygrps-yiv-1612413690\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Amber Wadley &lt;amberwadley@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Have you heard of Heather T. Forbes?  If you can&#39;t find anyone in your area<br/>\n&gt; that is compatible with your unschooling lifestyle, you could try contacting<br/>\n&gt; her.   She is amazing. <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.beyondconsequences.com/\">http://www.beyondconsequences.com/</a><br/>\n </span></blockquote>####################################################################<br/>\n<br/>\nGreat website! I just read this article:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.beyondconsequences.com/feelings.pdf\">http://www.beyondconsequences.com/feelings.pdf</a><br/>\n<br/>\n... very good article!<br/>\n<br/>\n~ Amanda</div>","specialLinks":[]},{"userId":160276266,"authorName":"Amanda&#39;s Shoebox","from":"&quot;Amanda&#39;s Shoebox&quot; &lt;amandasshoebox@...&gt;","profile":"amandasshoebox","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unacceptable behavior","postDate":"1278794524","msgId":44505,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkxYWx1cyt2c2NyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEQ5NjczQzFCLUVGNTYtNEJENy05NDA4LTlFREM3MTBCNTAxNUBnbWFpbC5jb20+"},"prevInTopic":44504,"nextInTopic":44506,"prevInTime":44504,"nextInTime":44506,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"... That s funny. I was just posting about this. I imagine I would restrain them, get away from them or do whatever I needed to do to avoid being beaten up .","messageBody":"<div id=\"ygrps-yiv-1380231171\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Faith Void Taintor &lt;littlemsvoid@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; *** I don&#39;t imagine I would allow it to happen again. ***<br/>\n&gt; &gt;<br/>\n&gt; <br/>\n&gt; If your child continued to chose to hit because they lacked to skills  <br/>\n&gt; necissary to chose another coping mechanism then how would you not  <br/>\n&gt; &#39;allow&#39; them to hit?<br/>\n&gt; <br/>\n&gt; We encourage our children to find healthier ways to get their needs  <br/>\n&gt; met or cope with anger besides using physical force.<br/>\n&gt; <br/>\n&gt; Faith<br/>\n<br/>\n </span></blockquote>That&#39;s funny. I was just posting about this. I imagine I would restrain them, get away from them or do whatever I needed to do to avoid being &quot;beaten up&quot;. Then, when things had calmed down, we would discuss how better to handle whatever led to that in the first place like we usually do. Again, I&#39;m just imagining how I might handle the situation as I&#39;ve never  had a child try to hit me.<br/>\n<br/>\n~ Amanda<br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Unacceptable behavior","postDate":"1278794387","msgId":44503,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU5QjQxREYxMTI2QzRFN0U4OEYwMzdDQjdBREQyNDI5QENvbm5pZVBDPg==","inReplyToHeader":"PEMzQjQzOEQ1LTgzNDktNDM2NS04NDk0LUQwN0E4NkQ5QjJFN0B2ZXJpem9uLm5ldD4=","referencesHeader":"PDQ5NEZEODUyLUREQUMtNEEzNC1BNDNDLUFCNDAzRTYzRkUxMUBnbWFpbC5jb20+IDxCQVkxMTktVzUxMjVDN0JCOTY5Rjk0QzNFNjYyNTZCQkI2MEBwaHguZ2JsPiA8QzNCNDM4RDUtODM0OS00MzY1LTg0OTQtRDA3QTg2RDlCMkU3QHZlcml6b24ubmV0Pg=="},"prevInTopic":44502,"nextInTopic":44504,"prevInTime":44502,"nextInTime":44504,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"... I still have negative feelings towards my mother for forcing me to go to counseling as a child. It would have been really nice if I had been given the","messageBody":"<div id=\"ygrps-yiv-1487971079\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Forcing someone to do something that ultimately alleviates a problem doesn&#39;t justify the force. Force damages relationships. Force damages a person&#39;s trust in her own judgement about what&#39;s right for herself.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I still have negative feelings towards my mother for forcing me to go to counseling as a child. It would have been really nice if I had been given the option of going. It would have been really nice if I had been told what to expect or even if I had been part of the decision making process. My mother chose to take us all to family counseling. Ultimately, it made us all feel worse because it turned into a session about what was wrong with us and what was wrong with her. I have only been to one counselor in my entire life that was good. What made her good was the fact that her focus was on problem solving rather than trying to fix me. I wasn&#39;t broke and didn&#39;t need fixed. I just needed some more tools to deal with the world.<br/>\n<br/>\nWhenever my 9 year old has a problem whether it is a health problem or something else, we talk about it and we decide together. There is no reason for a kid not to be included in deciding whether or not they want to go to a therapist, counselor, MD, or other health care professional. <br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":160276266,"authorName":"Amanda&#39;s Shoebox","from":"&quot;Amanda&#39;s Shoebox&quot; &lt;amandasshoebox@...&gt;","profile":"amandasshoebox","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unacceptable behavior","postDate":"1278794332","msgId":44504,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkxYWxvcytubnVlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkxYWk3bit0aDA2QGVHcm91cHMuY29tPg=="},"prevInTopic":44503,"nextInTopic":44505,"prevInTime":44503,"nextInTime":44505,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"Just wanted to clear up 2 things in my previous post. I didn t explain how we handled things lying around . Sometimes I pick their things up, if that s what","messageBody":"<div id=\"ygrps-yiv-490292093\">Just wanted to clear up 2 things in my previous post. <br/>\n<br/>\nI didn&#39;t explain how we handled &quot;things lying around&quot;. Sometimes I pick their things up, if that&#39;s what I&#39;m doing... or I might say, &quot;when your finished playing that game, please come rinse off your plate and put it in the dishwasher.&quot; <br/>\n<br/>\nAlso, when I mentioned self-defense classes, I was thinking about something like Brazilian Jiu-Jitsu. Our daughters take a BJJ class, and they mostly teach how to restrain someone who is trying to hurt you. I wasn&#39;t suggesting you learn how to &quot;fight&quot; your son. :)<br/>\n<br/>\n~ Amanda</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void Taintor","from":"Faith Void Taintor &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Unacceptable behavior","postDate":"1278793874","msgId":44502,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ5NjczQzFCLUVGNTYtNEJENy05NDA4LTlFREM3MTBCNTAxNUBnbWFpbC5jb20+"},"prevInTopic":44501,"nextInTopic":44503,"prevInTime":44501,"nextInTime":44503,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"... If your child continued to chose to hit because they lacked to skills necissary to chose another coping mechanism then how would you not allow them to","messageBody":"<div id=\"ygrps-yiv-68159512\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; *** I don&#39;t imagine I would allow it to happen again. ***<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>If your child continued to chose to hit because they lacked to skills  <br/>\nnecissary to chose another coping mechanism then how would you not  <br/>\n&#39;allow&#39; them to hit?<br/>\n<br/>\nWe encourage our children to find healthier ways to get their needs  <br/>\nmet or cope with anger besides using physical force.<br/>\n<br/>\nFaith</div>","specialLinks":[]},{"userId":160276266,"authorName":"Amanda&#39;s Shoebox","from":"&quot;Amanda&#39;s Shoebox&quot; &lt;amandasshoebox@...&gt;","profile":"amandasshoebox","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unacceptable behavior","postDate":"1278790711","msgId":44501,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkxYWk3bit0aDA2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ5NEZEODUyLUREQUMtNEEzNC1BNDNDLUFCNDAzRTYzRkUxMUBnbWFpbC5jb20+"},"prevInTopic":44500,"nextInTopic":44502,"prevInTime":44500,"nextInTime":44502,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"##################################################################### [Stephanie]What I d really like is a sense of how other unschoolers handle truly","messageBody":"<div id=\"ygrps-yiv-1341351832\">#####################################################################<br/>\n[Stephanie]What I&#39;d really like is a sense of how other unschoolers handle truly unacceptable behavior from their children. (I know that we all define  &quot;unacceptable behaviors&quot;  in different ways, and maybe that makes this an unanswerable question, but I doubt anyone would argue that a child beating up his mom is acceptable. :)[snip]So....... what sorts of things do you all do when a child&#39;s behavior  crosses a line, in particular when re-drawing the line is not an option? <br/>\n#####################################################################<br/>\nWe display the type of behavior we want from our children. In our house, shouting, hitting, and leaving stuff laying around is unacceptable. So, we don&#39;t shout, hit, or leave stuff around. If our children shout or hit, we separate the children and talk with them about other ways to solve whatever started the issue. We have 3 girls and have these discussions probably twice a month. Our children have never hit us, so I can&#39;t honestly say for sure what exactly I would do in that situation, but I don&#39;t imagine I would allow it to happen again. If your son is big enough to be physically dangerous to you, you might consider some self defense training. But at 10, I imagine you are probably able to restrain him and prevent him from hitting you.<br/>\n<br/>\nIt also helps to put someone else in the position of your child. What would you do if your husband or a friend were acting the way your son is/was? You can&#39;t put your husband in time out. So what would you do?<br/>\n<br/>\nRecently I&#39;ve been reading the book &quot;Switch: How to change things when change is hard&quot;. It is an excellent book that talks about how to change not only yourself, but how to encourage others and make changes in your family, workplace and society. I really think you would find the book helpful. It&#39;s about doing small things emotionally, mentally, and/or environmentally that can effect the biggest change.<br/>\n<br/>\n#####################################################################<br/>\n[Stephanie] How do you answer to people who tell you that kids need  <br/>\nlimits and controls? <br/>\n#####################################################################<br/>\nIt depends on my mood. Usually I just smile, but occasionally I might discuss it with them. It depends on my mood and the person.  <br/>\n<br/>\n#####################################################################<br/>\n[Stephanie] Do people ever tell you that your desire to meet your kids&#39; needs is somehow a psychological defect in you, or suggest that you put too much importance on pleasing others? <br/>\n#####################################################################<br/>\nI have been told by both a psychologist and a psychiatrist that I should be more assertive with my husband, and my husband has said I should be more assertive with our kids, lol. No one else has ever said this to me, however. When I have heard this, though, I have taken the time to evaluate whether that may be true or not. Sometimes when you think you are pleasing someone, it&#39;s really more about you and not them. This is something I have had to ask myself many times. At times, I have found that I was telling myself it was about them, but it was really about me.<br/>\n<br/>\n#####################################################################<br/>\nWhat do you say to people who equate respectful parenting with being a pushover or other negative spins?  <br/>\n#####################################################################<br/>\nI have found that most people who say this either don&#39;t have kids or don&#39;t like their kids very much, so it doesn&#39;t really affect me.<br/>\n<br/>\n#####################################################################<br/>\nAnd finally, is it possible to find therapists who are sympathetic to radical unschooling?<br/>\n#####################################################################<br/>\nMy mom is married to a counselor and they unschool his daughter, so it is definitely possible. When scheduling the first appointment, you should explain that you are looking for ways to improve your situation while continuing unschooling. Also, the book I recommended above, talks about how to find therapists who do solutions-based therapy, where you can effect change quickly, as opposed to traditional therapy where you talk about your past for 3 years and may or may not actually make any changes in your life. <br/>\n<br/>\n~ Amanda</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Unacceptable behavior","postDate":"1278790260","msgId":44500,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMzQjQzOEQ1LTgzNDktNDM2NS04NDk0LUQwN0E4NkQ5QjJFN0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEJBWTExOS1XNTEyNUM3QkI5NjlGOTRDM0U2NjI1NkJCQjYwQHBoeC5nYmw+","referencesHeader":"PDQ5NEZEODUyLUREQUMtNEEzNC1BNDNDLUFCNDAzRTYzRkUxMUBnbWFpbC5jb20+IDxCQVkxMTktVzUxMjVDN0JCOTY5Rjk0QzNFNjYyNTZCQkI2MEBwaHguZ2JsPg=="},"prevInTopic":44499,"nextInTopic":44501,"prevInTime":44499,"nextInTime":44501,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"... Did her daughter want to be on a gluten free diet? That s not a question to answer here, but an important idea for unschooling relationships. Forcing","messageBody":"<div id=\"ygrps-yiv-861332284\">On Jul 10, 2010, at 8:48 AM, Shell K. wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When one friend put her kids on 100% gluten free diet, her oldest 14  <br/>\n&gt; year old stopped bed wetting after years of trying everything.<br/>\n<br/>\n </span></blockquote>Did her daughter want to be on a gluten free diet?<br/>\n<br/>\nThat&#39;s not a question to answer here, but an important idea for  <br/>\nunschooling relationships.<br/>\n<br/>\nForcing someone to do something that ultimately alleviates a problem  <br/>\ndoesn&#39;t justify the force. Force damages relationships. Force damages  <br/>\na person&#39;s trust in her own judgement about what&#39;s right for herself.  <br/>\nIf the diet hadn&#39;t done anything and the daughter hadn&#39;t wanted to be  <br/>\non it in the first place, she would trust her mother way less next  <br/>\ntime and hold tightly to her own ideas perhaps against reason for fear  <br/>\nof them being ripped from her.<br/>\n<br/>\nBetter for unschooling is working with lots of ideas, being flexible,  <br/>\ntrying things out, being the child&#39;s partner rather than being on the  <br/>\nside of a particular pathway the mother is certain leads to health for  <br/>\nthe child. The mother *thinks* that&#39;s the same as being on the child&#39;s  <br/>\nside, but it doesn&#39;t feel like it at all. It feels like a war for who  <br/>\ngets to control someone&#39;s body. Being adversaries is not good for  <br/>\nunschooling.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We follow a low-fat raw vegan organic diet with 2 of my kids not  <br/>\n&gt; 100% raw. I notice all tempers going calm and stable when on all low- <br/>\n&gt; fat raw.<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>And energetic kids put on ADHD medication are calmer and can perform  <br/>\nbetter in school. Does the outcome mean the solution and reasoning are  <br/>\nsound?<br/>\n<br/>\nKids should not be on low fat diets. They need fat. They also need  <br/>\nfood that gives them quick energy. Just because Americans as a whole  <br/>\nhave a diet that&#39;s too high in fat doesn&#39;t make a low fat diet the  <br/>\nproper response.<br/>\n<br/>\nThere&#39;s a reason kids are drawn to foods that are higher in fat and  <br/>\nsugar than adults (eg, Cap&#39;n Crunch ;-) It&#39;s the type of calories they  <br/>\nneed. That doesn&#39;t mean we should hand them buttered sugar! (Though if  <br/>\nyou add some flour and a few other things it can be cookies! :-) There  <br/>\nare lots of healthful offerings with quality fat and carbohydrates  <br/>\nthat parents can have as a foundation in their home for kids to choose  <br/>\nfrom (and add to.)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"Karen Swanay &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Unacceptable behavior","postDate":"1278786793","msgId":44499,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlsRExBYzBlMktobDRKQ0xJS0NaNWdxVkF2V3F0a0lfY3RGeXg2d0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGkxYWN2bSs5bnIxQGVHcm91cHMuY29tPg==","referencesHeader":"PDQ5NEZEODUyLUREQUMtNEEzNC1BNDNDLUFCNDAzRTYzRkUxMUBnbWFpbC5jb20+IAk8aTFhY3ZtKzlucjFAZUdyb3Vwcy5jb20+"},"prevInTopic":44498,"nextInTopic":44500,"prevInTime":44498,"nextInTime":44500,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"... Meredith gave some great advice but I thought I d add this..(which was the topic of a recent conversation somewhere else)  Not all questions have to be ","messageBody":"<div id=\"ygrps-yiv-1069723687\">Stephanie Kimball &lt;kimball.stephanie@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I have<br/>\n&gt; decided that I/we do need professional help<br/>\n<br/>\n </span></blockquote>Meredith gave some great advice but I thought I&#39;d add this..(which was the<br/>\ntopic of a recent conversation somewhere else)  Not all questions have to be<br/>\nanswered.  Now, in the context of therapy, not answering will cause trouble,<br/>\nbut there is no reason why you can&#39;t be measured in your responses to<br/>\nquestions about bedtimes etc...take a minute to organize your thoughts<br/>\nbefore answering.  You&#39;d need to do this for the whole of the therapy for<br/>\nthe therapist to think it&#39;s just the way you are but also you can lie.<br/>\n*GASP*!!!<br/>\n<br/>\nSeriously.  I am in school to be a therapist and see one whenever life gets<br/>\noverwhelming to me, so I&#39;m pro therapy. But sometimes there are questions<br/>\nasked which don&#39;t need to be answered honestly.  If I&#39;m bitching about the<br/>\npre-teen hormone swings of my 12 yr old getting to me, and the therapist<br/>\nasks me about bedtimes, I just say &quot;Oh he gets about 12 hours of sleep a<br/>\nnight.&quot;  Which is true.  If the follow-up question is &quot;But when is his<br/>\nbedtime?&quot;  Rather than defend the no bedtime thing to the therapist because<br/>\nthe issue is mine not Liam&#39;s, I would just say 10pm.  No harm done.<br/>\nNOW....Liam is not also seeing this person and giving a different answer so<br/>\nthat&#39;s important to keep in mind.  But I learned early on that this<br/>\ntherapist who is WONDERFUL for ME does not approve of my Unschooling so it<br/>\nwas best not to get into it.  Actually now I&#39;m less inclined to even bring<br/>\nup the kids to steer away from it altogether but he knows I have kids and so<br/>\nsometimes he asks.<br/>\n<br/>\nIssues with your son though, make me think you would want a developmental<br/>\nped for him first.  There are lots of things that can cause this kind of<br/>\naggression including thyroid issues.  Thyroid issues not addressed can cause<br/>\nheart damage and all the therapy in the world won&#39;t help him if his thyroid<br/>\nis causing these swings of rage.  A simple supplement of hormone will.  (Of<br/>\ncourse if you are against allopathic meds this won&#39;t be in line with what<br/>\nyou want.)  Other things like early on-set bi-polar and childhood<br/>\nschizophrenia can&#39;t be &quot;talked out&quot; or made to go away with a diet change.<br/>\n(I&#39;M NOT SAYING HE HAS THESE THEY ARE EXCEPTIONALLY RARE!!)  But a<br/>\ndevelopmental ped can provide the starting point for you and might be a good<br/>\nway to deal with it.  Because as I said if his thyroid is low, there is no<br/>\nreason to suffer an unschooly un-friendly therapist for a year while things<br/>\ndon&#39;t improve.<br/>\n<br/>\nGood luck to you.  This isn&#39;t an easy road to walk.  (I have a daughter with<br/>\nattachment issues.)  We are all here for you!<br/>\n<br/>\nKaren<br/>\n<br/>\n<br/>\n&quot;Because I was a Jew I found myself free from many prejudices that hampered<br/>\nothers in the use of their intellects; and as a Jew, I was prepared to take<br/>\nmy place on the side of the opposition and renounce being on good terms with<br/>\nthe &#39;compact majority&#39;.&quot; ~Sigmund Freud<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unacceptable behavior","postDate":"1278785334","msgId":44498,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkxYWN2bSs5bnIxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ5NEZEODUyLUREQUMtNEEzNC1BNDNDLUFCNDAzRTYzRkUxMUBnbWFpbC5jb20+"},"prevInTopic":44497,"nextInTopic":44499,"prevInTime":44497,"nextInTime":44499,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"... Sometimes outside/professional help can be a marvelous resource, a way over and around the challenges life throws parents and kids. There are problems too","messageBody":"<div id=\"ygrps-yiv-774464729\">Stephanie Kimball &lt;kimball.stephanie@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I have  <br/>\n&gt; decided that I/we do need professional help<br/>\n<br/>\n </span></blockquote>Sometimes outside/professional help can be a marvelous resource, a way over and around the challenges life throws parents and kids. There are problems too big for one family to solve on their own, for sure, and biological issues, whether dietary or otherwise, can take some extra help to figure out. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m not really asking for advice on handling his outbursts now...  What I&#39;d really like is a sense of how other unschoolers  <br/>\n&gt; handle truly unacceptable behavior from their children.<br/>\n<br/>\n </span></blockquote>Have you asked your son how he feels about these &quot;outbursts&quot;? That seems like a good place to start. It will help you, whether you get outside help or not - have a sense of what your son wants and needs. If he&#39;s feeling scared and out of control, that&#39;s important information! If he doesn&#39;t see a problem, or sees his &quot;outbursts&quot; very differently than you do, that&#39;s important too. Does he have a sense of how he feels before and after his meltdowns? A sense of build-up? A sense that something&#39;s not right? That&#39;s something else to know. <br/>\n<br/>\nIf you *are* going to try to get him some kind of therapy, he needs to be willing to go along with that - not &quot;just&quot; from an unschooling standpoint but because otherwise your options become really really limited. If he&#39;s not willing to see a therapist or psychiatrist, then its really important to be thoughtful about his reasons for that. Getting medication won&#39;t help if he throws it away, after all, and getting therapy won&#39;t help if he lies to the therapist - I&#39;ve done both, btw, in my teens. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  What do  <br/>\n&gt; you say to people who equate respectful parenting with being a  <br/>\n&gt; pushover or other negative spins? <br/>\n<br/>\n </span></blockquote>I say &quot;thank you for the information&quot; and change the subject. <br/>\n<br/>\nBack when we were homeschooling Ray, there was a time when George and I wanted to get a diagnosis for him. I found it helped a whooooole lot to find ways to talk about my rather quirkly lifestyle that made sense to the professionals, but also not give them any &quot;grounds&quot; for questioning that lifestyle. So questions about &quot;schedules&quot; were met with answers about routines and regularity, how Ray handled predictable vs unpredictable situations, how he handled transitions. Questions about chores and homework were met with answers about courtesy and helpfulness, his ability to lead and follow, his ability to plan and follow through, his ability to focus. It also helped me to have a really clear message to convey: that Sometimes Ray was just fine, friendly, cooperative, etc, and Other Times he was a basket case. That helped narrow down the parameters a little - what was it about those other times? <br/>\n<br/>\nUltimately, we didn&#39;t get a diagnosis for Ray, and didn&#39;t need one, because in the process of all this we figured out what was generating those Other Times (and I&#39;m sorry, I can&#39;t tell you, there are confidentiality issues) and were able to come up with solutions that helped. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;is it possible to  <br/>\n&gt; find therapists who are sympathetic to radical unschooling?   I dread  <br/>\n&gt; shelling out money and time dragging my kid to therapy only to be told  <br/>\n&gt; to do whatever is the 10-yr-old version of  &quot;let him cry&quot;............<br/>\n<br/>\n </span></blockquote>It depends a whole lot on your expectations and needs - sometimes conventional therapists can be fine if there&#39;s a really clear &quot;issue&quot; to &quot;work on&quot;. When there isn&#39;t, the First place they&#39;re going to look is parenting because most parents change their own behavior Last of all. If you&#39;re looking for a diagnosis, it&#39;s better to do some research on your own and look for patterns that fit. That gives &quot;the professionals&quot; a place to start other than your parenting. <br/>\n<br/>\nIt may also help to start with a psychiatrist rather than a therapist or social worker, especially if your research points you in the direction of a biological imbalance. Check your insurance (if applicable) to see what the process is for that - you may need to see a regular doctor first, for example. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":185586397,"authorName":"lylaw","from":"&quot;lylaw&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unacceptable behavior","postDate":"1278784240","msgId":44497,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3MTMyMDgzMEFCODQwRUZCMTJFRjhFQjU4OTkzM0U5QEx5bGFQQz4=","inReplyToHeader":"PDQ5NEZEODUyLUREQUMtNEEzNC1BNDNDLUFCNDAzRTYzRkUxMUBnbWFpbC5jb20+","referencesHeader":"PDQ5NEZEODUyLUREQUMtNEEzNC1BNDNDLUFCNDAzRTYzRkUxMUBnbWFpbC5jb20+"},"prevInTopic":44496,"nextInTopic":44498,"prevInTime":44496,"nextInTime":44498,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"I agree with joyce s post, completely, and I would add that if your son does want help in the form of a therapist, search for a therapist who knows about and","messageBody":"<div id=\"ygrps-yiv-786775062\">I agree with joyce&#39;s post, completely, and I would add that if your son does want help in the form of a therapist, search for a therapist who knows about and believes in (and maybe even is trained in) &quot;Collaborative Problem Solving&quot; - the process outlined in &quot;The Explosive Child&quot;, by Dr. Ross Greene, you will be much more likely to find someone who understands and accepts your approach - they won&#39;t get unschooling, necessarily, but you can talk about how you want to help your son be able to live with &quot;plan b&quot; (collaborative problem solving) and not have to resort to plan c (seen by traditional parents and professionals as no rules/permissive parenting - but under this approach, seen more as a last resort of letting everything go to avoid explosions.)  they don&#39;t have to &quot;get&quot; that not having a bedtime or not controlling food is not basket c - that it&#39;s your choice.  <br/>\n<br/>\nif you haven&#39;t read the book, or seen the dvd:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Calming-Tempest-Helping-Explosive-Child/dp/B00021LL0A/ref=sr_1_3?ie=UTF8&s=dvd&qid=1278782031&sr=8-3,\">http://www.amazon.com/Calming-Tempest-Helping-Explosive-Child/dp/B00021LL0A/ref=sr_1_3?ie=UTF8&s=dvd&qid=1278782031&sr=8-3,</a> (or there&#39;s a more expensive one, longer if it&#39;;s available in the library, not sure how they compare)  I highly highly recommend at least on or the other.  I also have a list of articles and resources I created for an &quot;unschooling with the atypical child&quot; circle chat I hosted at a recent unschooling conference, if you&#39;d like, I can email it to you.  <br/>\n<br/>\na developmental pediatrician (as opposed to a pysch or a therapist) would also do assessments that can help determine what, if any, actual chemical or organic/physical issues might be going on that might be preventing him from learning the skills joyce was talking about, not limited to psychiatric issues.  medications aren&#39;t the only approach to building those skills, neurofeedback can help, some sensory-motor exercises, probably meditation, and lots of other modalities, depending on the person, the issue, and what might sound best to  your son.  <br/>\n<br/>\nI have a lot of personal experience with this topic, as I think I wrote on the old thread, and would be happy to talk to you more off list.<br/>\n<br/>\nI am not sure what you mean when you ask how unschoolers &quot;handle&quot; unacceptable behavior?  it might help you to revisit the issue in your mind from the perspective that your son is the one struggling the most, and so exploring it with him, supporting him, helping him identify what might be going on for him, internally, and really, really listening, as opposed to focusing on how to stop the problems from the outside. <br/>\n<br/>\nI also, personally, found I needed to &quot;pull inward&quot; and not talk to or be around anyone who wasn&#39;t supportive of our general lifestyle, and who didn&#39;t care about and understand that it wasn&#39;t unschooling that was causing the challenges we were facing.  <br/>\n<br/>\nwarmly, lyla<br/>\n<br/>\nwarmly, lyla Switch to: Text-Only, Daily Digest . Unsubscribe . Terms of Use.<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unacceptable behavior","postDate":"1278778665","msgId":44494,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIyMDBGNDJBREZENjRDRTY5ODlCNDUxNTlENTdGRThDQENvbm5pZVBDPg==","inReplyToHeader":"PDg2OThFMjAxMzA2RDRCMTI5QzU1NkU3MjAxQjJDNTlCQENvbm5pZVBDPg==","referencesHeader":"PDQ5NEZEODUyLUREQUMtNEEzNC1BNDNDLUFCNDAzRTYzRkUxMUBnbWFpbC5jb20+IDw5ODNGQTJFNDk5QTQ0MEExQTk1RjI0MTc2QzRFNzI2N0BDb25uaWVQQz4gPEFBTkxrVGluMFpBOWFhWlFUMzB1RDd1c05zVG8xTFg3cG5oSG4zUGJwb0xDS0BtYWlsLmdtYWlsLmNvbT4gPDg2OThFMjAxMzA2RDRCMTI5QzU1NkU3MjAxQjJDNTlCQENvbm5pZVBDPg=="},"prevInTopic":44493,"nextInTopic":44495,"prevInTime":44493,"nextInTime":44495,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"Oops, forgot the links: http://helpguide.org/mental/psychotherapy_therapist_counseling.htm http://bpd.about.com/od/howtofindhel1/a/typesofther.htm From:","messageBody":"<div id=\"ygrps-yiv-842619324\">Oops, forgot the links: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://helpguide.org/mental/psychotherapy_therapist_counseling.htm\">http://helpguide.org/mental/psychotherapy_therapist_counseling.htm</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://bpd.about.com/od/howtofindhel1/a/typesofther.htm\">http://bpd.about.com/od/howtofindhel1/a/typesofther.htm</a><br/>\n<br/>\n<br/>\nFrom: otherstar <br/>\nSent: Saturday, July 10, 2010 10:49 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSubject: Re: [unschoolingbasics] Unacceptable behavior<br/>\n<br/>\n<br/>\n  <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Unless you are in a few states, and are seeing a Psy.D, therapists are unable to prescribe meds. Psychiatrists can, but they are hard to get into see and do very little family intervention. More likely you get referred to a Psych from your therapist. But there isn&#39;t a LCSW anywhere that can RX meds and I seriously doubt that in this case that would be something anyone without an MD would want to get involved in since so many drugs are dangerous in little bodies. Our medical system, our mental health system, is risk averse. I don&#39;t see that happening, but it&#39;s always good to know more than less. Reading isn&#39;t a bad thing. But I wouldn&#39;t worry that an LCSW will be whipping out the RX pad...it&#39;s illegal.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Why would somebody go see a Licensed Clinical Social Worker? In my area, social workers are typically thought of in terms of government agencies. That is why it is important to ask around locally. Here is a link that discusses the different types of therapists and the various qualifications. While only a few of them can actually prescribe medication, it is not uncommon for a counselor to refer a kid to somebody else if they think that medication might be indicated. As somebody that has a family history of bipolar and other mental illness, I have seen the push for drugs all too often.<br/>\n<br/>\nI am not trying to create fear. I am simply bringing awareness to the fact that the medical system in the US really likes prescribing or recommending the use of prescriptions to control children. I have known people that have been caught off guard by counselors that have tried to push children into the system. <br/>\n<br/>\nConnie <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\n<br/>\nNo virus found in this incoming message.<br/>\nChecked by AVG - www.avg.com <br/>\nVersion: 9.0.830 / Virus Database: 271.1.1/2993 - Release Date: 07/10/10 01:36:00<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"Karen Swanay &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Unacceptable behavior","postDate":"1278777856","msgId":44493,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlsM25yd0tiLTZLdURHcWZ0V2tIMVBlWkJFRDl5VnZOY2doS0RPa0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDg2OThFMjAxMzA2RDRCMTI5QzU1NkU3MjAxQjJDNTlCQENvbm5pZVBDPg==","referencesHeader":"PDQ5NEZEODUyLUREQUMtNEEzNC1BNDNDLUFCNDAzRTYzRkUxMUBnbWFpbC5jb20+IAk8OTgzRkEyRTQ5OUE0NDBBMUE5NUYyNDE3NkM0RTcyNjdAQ29ubmllUEM+IDxBQU5Ma1RpbjBaQTlhYVpRVDMwdUQ3dXNOc1RvMUxYN3BuaEhuM1BicG9MQ0tAbWFpbC5nbWFpbC5jb20+IAk8ODY5OEUyMDEzMDZENEIxMjlDNTU2RTcyMDFCMkM1OUJAQ29ubmllUEM+"},"prevInTopic":44492,"nextInTopic":44494,"prevInTime":44492,"nextInTime":44494,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"In many states LCSW do a bulk of the therapy.  Depending on insurance and how it s set up, this might be who is referred.  (Because they are cheaper than a","messageBody":"<div id=\"ygrps-yiv-1611769411\">In many states LCSW do a bulk of the therapy.  Depending on insurance and<br/>\nhow it&#39;s set up, this might be who is referred.  (Because they are cheaper<br/>\nthan a Psy.D)  But it&#39;s perfectly legit for a LCSW to do marriage and family<br/>\ntherapy in all states I believe.  (all of them I&#39;ve lived in and looked at<br/>\nanyway)<br/>\n<br/>\nI&#39;m wasn&#39;t saying you were trying to create fear...it&#39;s good to be prepared<br/>\nbut I just wanted to clarify that meds wouldn&#39;t be the first step and there<br/>\nare some therapists who are unschooling friendly you just have to find them.<br/>\n<br/>\nKaren<br/>\n<br/>\n<br/>\n&quot;Because I was a Jew I found myself free from many prejudices that hampered<br/>\nothers in the use of their intellects; and as a Jew, I was prepared to take<br/>\nmy place on the side of the opposition and renounce being on good terms with<br/>\nthe &#39;compact majority&#39;.&quot; ~Sigmund Freud<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Jul 10, 2010 at 10:49 AM, otherstar &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:otherstar@...\">otherstar@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt;&gt;&gt;Unless you are in a few states, and are seeing a Psy.D, therapists are<br/>\n&gt; unable to prescribe meds. Psychiatrists can, but they are hard to get into<br/>\n&gt; see and do very little family intervention. More likely you get referred to<br/>\n&gt; a Psych from your therapist. But there isn&#39;t a LCSW anywhere that can RX<br/>\n&gt; meds and I seriously doubt that in this case that would be something anyone<br/>\n&gt; without an MD would want to get involved in since so many drugs are<br/>\n&gt; dangerous in little bodies. Our medical system, our mental health system, is<br/>\n&gt; risk averse. I don&#39;t see that happening, but it&#39;s always good to know more<br/>\n&gt; than less. Reading isn&#39;t a bad thing. But I wouldn&#39;t worry that an LCSW will<br/>\n&gt; be whipping out the RX pad...it&#39;s illegal.&lt;&lt;&lt;<br/>\n&gt;<br/>\n&gt; Why would somebody go see a Licensed Clinical Social Worker? In my area,<br/>\n&gt; social workers are typically thought of in terms of government agencies.<br/>\n&gt; That is why it is important to ask around locally. Here is a link that<br/>\n&gt; discusses the different types of therapists and the various qualifications.<br/>\n&gt; While only a few of them can actually prescribe medication, it is not<br/>\n&gt; uncommon for a counselor to refer a kid to somebody else if they think that<br/>\n&gt; medication might be indicated. As somebody that has a family history of<br/>\n&gt; bipolar and other mental illness, I have seen the push for drugs all too<br/>\n&gt; often.<br/>\n&gt;<br/>\n&gt; I am not trying to create fear. I am simply bringing awareness to the fact<br/>\n&gt; that the medical system in the US really likes prescribing or recommending<br/>\n&gt; the use of prescriptions to control children. I have known people that have<br/>\n&gt; been caught off guard by counselors that have tried to push children into<br/>\n&gt; the system.<br/>\n&gt;<br/>\n&gt; Connie<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unacceptable behavior","postDate":"1278776996","msgId":44492,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2OThFMjAxMzA2RDRCMTI5QzU1NkU3MjAxQjJDNTlCQENvbm5pZVBDPg==","inReplyToHeader":"PEFBTkxrVGluMFpBOWFhWlFUMzB1RDd1c05zVG8xTFg3cG5oSG4zUGJwb0xDS0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDQ5NEZEODUyLUREQUMtNEEzNC1BNDNDLUFCNDAzRTYzRkUxMUBnbWFpbC5jb20+IDw5ODNGQTJFNDk5QTQ0MEExQTk1RjI0MTc2QzRFNzI2N0BDb25uaWVQQz4gPEFBTkxrVGluMFpBOWFhWlFUMzB1RDd1c05zVG8xTFg3cG5oSG4zUGJwb0xDS0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":44491,"nextInTopic":44493,"prevInTime":44491,"nextInTime":44493,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"... Why would somebody go see a Licensed Clinical Social Worker? In my area, social workers are typically thought of in terms of government agencies. That is","messageBody":"<div id=\"ygrps-yiv-1063448253\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Unless you are in a few states, and are seeing a Psy.D, therapists are unable to prescribe meds. Psychiatrists can, but they are hard to get into see and do very little family intervention. More likely you get referred to a Psych from your therapist. But there isn&#39;t a LCSW anywhere that can RX meds and I seriously doubt that in this case that would be something anyone without an MD would want to get involved in since so many drugs are dangerous in little bodies. Our medical system, our mental health system, is risk averse. I don&#39;t see that happening, but it&#39;s always good to know more than less. Reading isn&#39;t a bad thing. But I wouldn&#39;t worry that an LCSW will be whipping out the RX pad...it&#39;s illegal.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Why would somebody go see a Licensed Clinical Social Worker? In my area, social workers are typically thought of in terms of government agencies. That is why it is important to ask around locally. Here is a link that discusses the different types of therapists and the various qualifications. While only a few of them can actually prescribe medication, it is not uncommon for a counselor to refer a kid to somebody else if they think that medication might be indicated. As somebody that has a family history of bipolar and other mental illness, I have seen the push for drugs all too often.<br/>\n<br/>\nI am not trying to create fear. I am simply bringing awareness to the fact that the medical system in the US really likes prescribing or recommending the use of prescriptions to control children. I have known people that have been caught off guard by counselors that have tried to push children into the system. <br/>\n<br/>\nConnie <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"Karen Swanay &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unacceptable behavior","postDate":"1278775748","msgId":44491,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluMFpBOWFhWlFUMzB1RDd1c05zVG8xTFg3cG5oSG4zUGJwb0xDS0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDk4M0ZBMkU0OTlBNDQwQTFBOTVGMjQxNzZDNEU3MjY3QENvbm5pZVBDPg==","referencesHeader":"PDQ5NEZEODUyLUREQUMtNEEzNC1BNDNDLUFCNDAzRTYzRkUxMUBnbWFpbC5jb20+IAk8OTgzRkEyRTQ5OUE0NDBBMUE5NUYyNDE3NkM0RTcyNjdAQ29ubmllUEM+"},"prevInTopic":44490,"nextInTopic":44492,"prevInTime":44490,"nextInTime":44492,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"Unless you are in a few states, and are seeing a Psy.D, therapists are unable to prescribe meds.  Psychiatrists can, but they are hard to get into see and do","messageBody":"<div id=\"ygrps-yiv-1806562617\">Unless you are in a few states, and are seeing a Psy.D, therapists are<br/>\nunable to prescribe meds.  Psychiatrists can, but they are hard to get into<br/>\nsee and do very little family intervention.  More likely you get referred to<br/>\na Psych from your therapist.  But there isn&#39;t a LCSW anywhere that can RX<br/>\nmeds and I seriously doubt that in this case that would be something anyone<br/>\nwithout an MD would want to get involved in since so many drugs are<br/>\ndangerous in little bodies.  Our medical system, our mental health system,<br/>\nis risk averse.  I don&#39;t see that happening, but it&#39;s always good to know<br/>\nmore than less.  Reading isn&#39;t a bad thing.  But I wouldn&#39;t worry that an<br/>\nLCSW will be whipping out the RX pad...it&#39;s illegal.<br/>\n<br/>\nKaren<br/>\n<br/>\n&quot;Because I was a Jew I found myself free from many prejudices that hampered<br/>\nothers in the use of their intellects; and as a Jew, I was prepared to take<br/>\nmy place on the side of the opposition and renounce being on good terms with<br/>\nthe &#39;compact majority&#39;.&quot; ~Sigmund Freud<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Jul 10, 2010 at 10:14 AM, otherstar &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:otherstar@...\">otherstar@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt;&gt;&gt;I dread shelling out money and time dragging my kid to therapy only to<br/>\n&gt; be told to do whatever is the 10-yr-old version of &quot;let him<br/>\n&gt; cry&quot;............&lt;&lt;&lt;<br/>\n&gt;<br/>\n&gt; I would recommend doing lots and lots of reading before going to a<br/>\n&gt; therapist. If they start making suggestions on how to &quot;control&quot; your child,<br/>\n&gt; start asking for book/reading recommendations. You can respond with<br/>\n&gt; something simple like, &quot;Hmmm, interesting. I have been reading about this a<br/>\n&gt; lot and haven&#39;t read that perspective yet. Do you have any suggestions about<br/>\n&gt; other things that I can read?&quot; My bigger concern with therapists is the<br/>\n&gt; tendency to prescribe medicine before getting all of the information. That&#39;s<br/>\n&gt; where local recommendations will be invaluable.<br/>\n&gt;<br/>\n&gt; Connie<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unacceptable behavior","postDate":"1278774881","msgId":44490,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk4M0ZBMkU0OTlBNDQwQTFBOTVGMjQxNzZDNEU3MjY3QENvbm5pZVBDPg==","inReplyToHeader":"PDQ5NEZEODUyLUREQUMtNEEzNC1BNDNDLUFCNDAzRTYzRkUxMUBnbWFpbC5jb20+","referencesHeader":"PDQ5NEZEODUyLUREQUMtNEEzNC1BNDNDLUFCNDAzRTYzRkUxMUBnbWFpbC5jb20+"},"prevInTopic":44489,"nextInTopic":44491,"prevInTime":44489,"nextInTime":44491,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"... affectionate, sometimes helpful, gets along well with his 7y.o. sister, etc.","messageBody":"<div id=\"ygrps-yiv-523646417\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;When he gets angry he seems to loose his ability to reason, often breaks things, and lately has begun doing things that hurt/injure me. When he&#39;s not in the midst of one of these fits he&#39;s extremely loving, <br/>\n </span></blockquote>affectionate, sometimes helpful, gets along well with his 7y.o. sister, etc.&lt;&lt;&lt;&lt;<br/>\n<br/>\nYou might try reading &quot;The Bipolar Child&quot;. There are some good strategies in there for keeping stress levels down and dealing with out of control situations. There might also be some other tidbits of information that might be helpful. I read it because there is a history of bipolar in my family and I wanted to know what to look for and how to prevent things if at all possible. It&#39;s been a while since I read it but I seem to recall that it addresses how to keep an out of control bipolar child safe. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;What I&#39;d really like is a sense of how other unschoolers handle truly unacceptable behavior from their children.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>If somebody is getting hurt, I physically intervene. Every situation is different and there is no one size fits all explanation. I take all of the situational factors into consideration before I do anything. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I dread shelling out money and time dragging my kid to therapy only to be told to do whatever is the 10-yr-old version of &quot;let him cry&quot;............&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I would recommend doing lots and lots of reading before going to a therapist. If they start making suggestions on how to &quot;control&quot; your child, start asking for book/reading recommendations. You can respond with something simple like, &quot;Hmmm, interesting. I have been reading about this a lot and haven&#39;t read that perspective yet. Do you have any suggestions about other things that I can read?&quot; My bigger concern with therapists is the tendency to prescribe medicine before getting all of the information. That&#39;s where local recommendations will be invaluable. <br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":439256712,"authorName":"Amber Wadley","from":"Amber Wadley &lt;amberwadley@...&gt;","profile":"reineckea","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Unacceptable behavior","postDate":"1278774796","msgId":44496,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluTlhFTW15T3FiZ2o0OEZiTGFHd1NFdy10cjZ6XzNUcnZVVkxjQ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEIxODZBNTNCLTQ3QzItNEVFMC05NkRCLTYxREY2REMwQzg3QUB2ZXJpem9uLm5ldD4=","referencesHeader":"PDQ5NEZEODUyLUREQUMtNEEzNC1BNDNDLUFCNDAzRTYzRkUxMUBnbWFpbC5jb20+CTxCMTg2QTUzQi00N0MyLTRFRTAtOTZEQi02MURGNkRDMEM4N0FAdmVyaXpvbi5uZXQ+"},"prevInTopic":44495,"nextInTopic":44497,"prevInTime":44495,"nextInTime":44497,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"Have you heard of Heather T. Forbes?  If you can t find anyone in your area that is compatible with your unschooling lifestyle, you could try contacting her.","messageBody":"<div id=\"ygrps-yiv-167398768\">Have you heard of Heather T. Forbes?  If you can&#39;t find anyone in your area<br/>\nthat is compatible with your unschooling lifestyle, you could try contacting<br/>\nher.   She is amazing. <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.beyondconsequences.com/\">http://www.beyondconsequences.com/</a><br/>\nRecently a woman set up a practice in my area that concentrates on<br/>\nattachment and relationship enrichment.   I am so glad that we finally have<br/>\nsomeone local that doesn&#39;t just focus on behavior modification.  You might<br/>\ntry to find therapists that understand about attachment disorders.  IMO they<br/>\nseem to have far better methods of treatment, like theraplay.   Here is a<br/>\ndescription of theraplay<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.care-counseling.com/attachment_treatment.php\">http://www.care-counseling.com/attachment_treatment.php</a><br/>\nHope this helps,<br/>\n-Amber</div>","specialLinks":[]},{"userId":93561159,"authorName":"Shell K.","from":"Shell K. &lt;HGEFREE@...&gt;","profile":"imagine7generations","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Unacceptable behavior","postDate":"1278766121","msgId":44495,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExOS1XNTEyNUM3QkI5NjlGOTRDM0U2NjI1NkJCQjYwQHBoeC5nYmw+","inReplyToHeader":"PDQ5NEZEODUyLUREQUMtNEEzNC1BNDNDLUFCNDAzRTYzRkUxMUBnbWFpbC5jb20+","referencesHeader":"PDQ5NEZEODUyLUREQUMtNEEzNC1BNDNDLUFCNDAzRTYzRkUxMUBnbWFpbC5jb20+"},"prevInTopic":44494,"nextInTopic":44496,"prevInTime":44494,"nextInTime":44496,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"I stay away from Doctors and Therapists if at all possible myself.  I have found food intake has a significant impact on my kids behavior and heard the same","messageBody":"<div id=\"ygrps-yiv-1840397206\">I stay away from Doctors and Therapists if at all possible myself.  I have found food intake has a significant impact on my kids behavior and heard the same from friends.  When one friend put her kids on 100% gluten free diet, her oldest 14 year old stopped bed wetting after years of trying everything.  She also noticed behavioral changes, they became calmer, happier, more stable mood.  We follow a low-fat raw vegan organic diet with 2 of my kids not 100% raw.  I notice all tempers going calm and stable when on all low-fat raw.  I don&#39;t know if it&#39;s the increased oxygen, better nutrition, deeper sleep, ease of digestion, steady blood sugar, lack of opiates or a combo of everything but I am sure diet makes a huge difference.  I&#39;m sure you&#39;ll find a lot on the subjects of both gluten and low-fat raw on the web.  Here is one article I found.     <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.dietarysupport.com/essentialdiet(\">http://www.dietarysupport.com/essentialdiet(</a>art).html<br/>\nHope this helps,Shell</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unacceptable behavior","postDate":"1278760462","msgId":44489,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIxODZBNTNCLTQ3QzItNEVFMC05NkRCLTYxREY2REMwQzg3QUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDQ5NEZEODUyLUREQUMtNEEzNC1BNDNDLUFCNDAzRTYzRkUxMUBnbWFpbC5jb20+","referencesHeader":"PDQ5NEZEODUyLUREQUMtNEEzNC1BNDNDLUFCNDAzRTYzRkUxMUBnbWFpbC5jb20+"},"prevInTopic":44488,"nextInTopic":44490,"prevInTime":44488,"nextInTime":44490,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"... If a child ends up in a situation that s more than they can handle (I m thinking emotionally, like fighting), either they can (later, away from the","messageBody":"<div id=\"ygrps-yiv-562711261\">On Jul 9, 2010, at 10:01 PM, Stephanie Kimball wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So....... what sorts of things do you all do when a child&#39;s behavior<br/>\n&gt; crosses a line, in particular when re-drawing the line is not an<br/>\n&gt; option?<br/>\n<br/>\n </span></blockquote>If a child ends up in a situation that&#39;s more than they can handle  <br/>\n(I&#39;m thinking emotionally, like fighting), either they can (later,  <br/>\naway from the emotions) see where they should have made a different  <br/>\nchoice (walked away, not let their emotions speak, etc.) or they  <br/>\ncan&#39;t. That&#39;s pretty simplistic ;-) but sometimes people have the  <br/>\nskills -- have demonstrated they can handle similar situations in the  <br/>\npast -- but they misjudge, end up in a situation they realize they  <br/>\ncould have avoided by a different choice and from the consequences  <br/>\nthey learn more about themselves and what are better choices for next  <br/>\ntime.<br/>\n<br/>\nBut sometimes kids don&#39;t have the skills. Even looking back they can&#39;t  <br/>\nsee what they could have done differently to avoid what happened.<br/>\n<br/>\nGenerally speaking, both involve getting the kid out of the situation,  <br/>\neither physically picking them up, giving them an exit strategy,  <br/>\ndefusing the situation, having a code word in advance that helps them  <br/>\nget off that track. (The assumption is that kids don&#39;t want to hurt  <br/>\nothers and they&#39;ve just gotten onto a path they can&#39;t handle.)<br/>\n<br/>\nIt sounds like your son is of the second type. He can&#39;t control  <br/>\nhimself until *he* wants to *and* has the tools to do it with.<br/>\n<br/>\nYou&#39;ve talked a lot about what you want from him, but what about him?  <br/>\nWhat does he have to say?<br/>\n<br/>\nI suspect, as most parents would, your discussions with him have been  <br/>\nabout what he&#39;s doing wrong and what he can do right instead. But what  <br/>\ndoes *he* feel? What does he want? You can&#39;t help him get what he  <br/>\nwants unless you know what he wants. Otherwise all you doing is trying  <br/>\nto change him. Do you see the difference? He probably wants what you  <br/>\nwant: to not be out of control, to not hurt people, but until you work  <br/>\nwith him on *his* goals, everything you say to him is about changing  <br/>\nhim to reach your goals for him.<br/>\n<br/>\nWhat does it feel like before he goes into a rage? Is there a build  <br/>\nup? Can he feel it coming on? What does the rage feel like once he&#39;s  <br/>\nin it? What does it feel like after?<br/>\n<br/>\nRather than telling him what he should do instead -- as if you knew!  <br/>\n-- help him try out strategies. If it helps you, think of this as  <br/>\nsomething new that you don&#39;t know anything about.<br/>\n<br/>\nYou can suggest or ask him for suggestions. (My daughter preferred  <br/>\nsuggestions. I remember feeling as a child that social situations were  <br/>\ntoo complex for me to think about clearly.) And talk about what part  <br/>\nof the strategy worked and what didn&#39;t. What was hard? What was easy?  <br/>\nOr, more overview oriented, did that feel any better? (He may not be  <br/>\nable to verbalize what&#39;s going on. Some people can&#39;t. So don&#39;t  <br/>\npressure him. Let him just get a feeling for it.)<br/>\n<br/>\n(Have you read The Explosive Child or Parenting your Spirited Child?  <br/>\nThere should be strategies to suggest in there.)<br/>\n<br/>\nPerhaps he has a sensitivity to food. Rather than scouring the  <br/>\ninternet on what could trigger it -- since it could be anything and  <br/>\nit&#39;s sensless to torture him with weird diets eliminating things that  <br/>\naren&#39;t it -- suggest the theory and *if he&#39;d like to try* be  <br/>\nscientists together. The conventional parenting approach is to reach a  <br/>\nconclusion that it&#39;s x food that&#39;s causing it, eliminate it from the  <br/>\nchild&#39;s diet and basically make the child prove you right or wrong.  <br/>\nDon&#39;t do that. Be his partner in *his* investigation.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How do you answer to people who tell you that kids need<br/>\n&gt; limits and controls?<br/>\n<br/>\n<br/>\n </span></blockquote>To that and all the others, &quot;I&#39;ll think about that.&quot;  It&#39;s really all  <br/>\nthey want to hear! ;-) Give it two seconds of thought and dismiss it  <br/>\nand it&#39;s not a lie.<br/>\n<br/>\nIf the advice is unsolicited, follow it with some version of &quot;Pass the  <br/>\nbean dip.&quot; In other words, change the subject.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And finally, is it possible to<br/>\n&gt; find therapists who are sympathetic to radical unschooling? I dread<br/>\n&gt; shelling out money and time dragging my kid to therapy only to be told<br/>\n&gt; to do whatever is the 10-yr-old version of &quot;let him cry&quot;............<br/>\n<br/>\n </span></blockquote>It will be hard anywhere but could be really hard in some areas of the  <br/>\ncountry.<br/>\n<br/>\nThat&#39;s a question for a local unschooling list. Ask if anyone knows of  <br/>\na therapist who is radically unschooling friendly. Most counselors  <br/>\nwill have a free consultation where you can ask questions. They don&#39;t  <br/>\nwant mismatched patients and parents any more than you want a  <br/>\nmismatched therapist!<br/>\n<br/>\n*But* all the therapy in the world won&#39;t help unless it&#39;s his choice  <br/>\nto change for his own reasons. Help him help himself rather than  <br/>\ntrying to change him.<br/>\n<br/>\nI was just reading about Robert Downey Jr and his 30 year struggle  <br/>\nwith drug addiction. (His drug addict father gave him drugs when he  <br/>\nwas 8 :-( ) He was in mandatory therapy and jail several times. As is  <br/>\nthe story of so many people struggling with addictions, nothing worked  <br/>\nuntil *he* decided that *he* wanted to change for *his* reasons.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":300129699,"authorName":"Stephanie Kimball","from":"Stephanie Kimball &lt;kimball.stephanie@...&gt;","profile":"sksundancer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Unacceptable behavior","postDate":"1278727270","msgId":44488,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5NEZEODUyLUREQUMtNEEzNC1BNDNDLUFCNDAzRTYzRkUxMUBnbWFpbC5jb20+"},"prevInTopic":0,"nextInTopic":44489,"prevInTime":44486,"nextInTime":44489,"topicId":44488,"numMessagesInTopic":0,"msgSnippet":"Hi folks.  This list has been quiet lately so I m hoping someone out there will have  a moment to share some thoughts with me.  I wrote in a while back looking","messageBody":"<div id=\"ygrps-yiv-1040169694\">Hi folks.  This list has been quiet lately so I&#39;m hoping someone out  <br/>\nthere will have  a moment to share some thoughts with me.  I wrote in  <br/>\na while back looking for advice on dealing with violent behavior from  <br/>\nmy son, and received some wonderful, thoughtful, helpful responses.   <br/>\n(Thank you again for that!)<br/>\n<br/>\nI&#39;m writing now with a different question about the same situation.    <br/>\nIn the last few weeks things have escalated with my son, and I have  <br/>\ndecided that I/we do need professional help; I can&#39;t live in fear of  <br/>\nattack, and I can&#39;t allow my son to continue on a path that could land  <br/>\nhim in some serious trouble. By way of background:  DS is 10 yrs old,  <br/>\nvery intelligent, described by others as friendly, happy,  <br/>\ncommunicative -- but he can get out-of-control angry at seemingly  <br/>\nsmall things, like a broken toy, or  being out of avocados...    When  <br/>\nhe gets angry he seems to loose his ability to reason, often breaks  <br/>\nthings, and lately has begun doing things that hurt/injure me.   When  <br/>\nhe&#39;s not in the midst of one of these fits he&#39;s extremely loving,  <br/>\naffectionate, sometimes helpful, gets along well with his 7y.o.  <br/>\nsister, etc.<br/>\n<br/>\nI&#39;m not really asking for advice on handling his outbursts now,  <br/>\nthough, as it would require a really long post for me to adequately  <br/>\ndescribe the situation, how it developed, what I&#39;ve tried, what didn&#39;t  <br/>\nwork, etc.  What I&#39;d really like is a sense of how other unschoolers  <br/>\nhandle truly unacceptable behavior from their children.  (I know that  <br/>\nwe all define  &quot;unacceptable behaviors&quot;  in different ways, and maybe  <br/>\nthat makes this an unanswerable question, but I doubt anyone would  <br/>\nargue that a child beating up his mom is acceptable. :)<br/>\n<br/>\nHere&#39;s where I&#39;m coming from:  I&#39;ve begun talking to therapists and to  <br/>\nfriends in search of recommendations for therapists, and as I describe  <br/>\nsome of what&#39;s going on in my home I&#39;m starting to see some  <br/>\npredictable responses:  &quot;he has too much control&quot;   ....  &quot;kids like/ <br/>\nneed limits&quot; .....  &quot;you think you&#39;re being nice to give him choices  <br/>\nbut really he needs you to be in charge&quot; ......  &quot;he needs to be told   <br/>\n&#39;no&#39;&quot;...    Well, clearly he needs SOME boundaries/limits -- hurting  <br/>\nother people is not ok!  But where these well-meaning friends and  <br/>\ntherapists are headed is that my style of parenting is, across the  <br/>\nboard, too permissive.   Does he have a set bedtime?  no.  Does he  <br/>\nhave chores or household responsibilities?  no.  Are there set  <br/>\nconsequences for  &quot;bad&quot;  behavior?  no.  Does he do his daily  <br/>\nschoolwork without a fuss, or does he fight about that too?  uh, he  <br/>\ndoesn&#39;t have daily schoolwork.<br/>\n<br/>\nI truly don&#39;t believe that my son&#39;s problems stem from me not   <br/>\n&quot;exerting control&quot;  over his bedtime, eating habits, learning, or  <br/>\nanything else.  In fact, over the years I tried having bedtimes,  <br/>\nlimiting sweets, and requiring a small amount of   &quot;school&quot;  each day;  <br/>\nI also tried  &quot;time outs&quot;,  loss of  &quot;privileges&quot;, and rewards for  <br/>\npositive behavior.  None of those approaches worked, so I dropped them  <br/>\nall, gradually.  What I see now is a sweet, smart, loving child with  <br/>\nsome huge, unmet need that I have yet to identify, let alone fill.  Or  <br/>\nmaybe he has a medical problem, or some sort of chemical imbalance.  I  <br/>\ndon&#39;t know; that&#39;s what I want professional help figuring out.  But I  <br/>\nfeel that  the  &quot;professionals&quot;  are going to get stuck on my  <br/>\nunwillingness to attempt to exert control over my son, calling that an  <br/>\nexplanation for why my son has no apparent control over himself at  <br/>\ntimes.  Yet I have to admit that my faith in flexibility, honesty,  <br/>\ncommunication, freedom, choice, and love  has not panned out, at least  <br/>\nnot with this child.  (DD is a different story!)<br/>\n<br/>\nSo....... what sorts of things do you all do when a child&#39;s behavior  <br/>\ncrosses a line, in particular when re-drawing the line is not an  <br/>\noption?  How do you answer to people who tell you that kids need  <br/>\nlimits and controls?   Do people ever tell you that your desire to  <br/>\nmeet your kids&#39; needs is somehow a psychological defect in you, or  <br/>\nsuggest that you put too much importance on pleasing others?   What do  <br/>\nyou say to people who equate respectful parenting with being a  <br/>\npushover or other negative spins?   And finally, is it possible to  <br/>\nfind therapists who are sympathetic to radical unschooling?   I dread  <br/>\nshelling out money and time dragging my kid to therapy only to be told  <br/>\nto do whatever is the 10-yr-old version of  &quot;let him cry&quot;............<br/>\n<br/>\nThanks in advance for your thoughts!<br/>\n<br/>\nstephanie</div>","specialLinks":[]}],"prevTopicId":44538,"nextTopicId":44555}}