{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Re:Coersion","postDate":"1088207786","msgId":1065,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDg0LjJjZDY2NTlmLjJlMGRkZjMxQGFvbC5jb20+"},"prevInTopic":1058,"nextInTopic":0,"prevInTime":1064,"nextInTime":1066,"topicId":1055,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-690273396\">&lt;&lt;&lt;When we began unschooling, we realized we couldn&#39;t &quot;Unschool Julian.&quot; We <br/>\nrealized that the thing that drew us to this was that we all really valued <br/>\nlearning and empowering one another. We became an Unschooling Family, and<br/>\nthe adults spend as much time being learning and doing things we love as<br/>\nJulian does. We try to make decisions that will strengthen all of us,<br/>\nindividually and together. Julian supports and empowers me and Beth as much<br/>\nas we do him.&gt;&gt;&gt;<br/>\n<br/>\nI love this! It is not just Jayn who is being liberated by Unschooling, but<br/>\nour entire family. <br/>\n<br/>\nThere is always further to go, and more realizations to have. Thanks.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.707 / Virus Database: 463 - Release Date: 6/15/2004</div>","specialLinks":[]},{"userId":31945013,"authorName":"Joan Labbe & Salvatore Genovese","from":"&quot;Joan Labbe & Salvatore Genovese&quot; &lt;salgenovese@...&gt;","profile":"jrl01760","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Re:Coersion","postDate":"1088196658","msgId":1058,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEhJRVBLT09FRUlBSUJISFBKRUJQQ0VDTkNOQUEuc2FsZ2Vub3Zlc2VAd29ybGRuZXQuYXR0Lm5ldD4=","inReplyToHeader":"PDg0LjJjZDY2NTlmLjJlMGRkZjMxQGFvbC5jb20+"},"prevInTopic":1055,"nextInTopic":1065,"prevInTime":1057,"nextInTime":1059,"topicId":1055,"numMessagesInTopic":0,"msgSnippet":"I really don t know about the coersion thing at all. I can tell you he s never disobeyed, because we don t tend to give orders. He doesn t always make the","messageBody":"<div id=\"ygrps-yiv-882687509\">&quot;I really don&#39;t know about the coersion thing at all. I can tell you he&#39;s<br/>\nnever &quot;disobeyed,&quot; because we don&#39;t tend to give orders. He doesn&#39;t always<br/>\nmake<br/>\nthe choices I would make, or even the ones I would prefer he make.<br/>\n<br/>\nI bet that was clear as mud ;)<br/>\n<br/>\nKathryn&quot;<br/>\n<br/>\n<br/>\nI have been enjoying these posts so much, they are really making me think<br/>\nhard about some of these issues.  I guess what matters to me in my house is<br/>\nthat we do what feels good for all of us, no matter what &quot;label&quot; someone<br/>\nelse wants to apply to it.  In regards to &quot;Coersion&quot;, the way I view it is<br/>\nthat something coersive is something that is a demand, something forced.<br/>\nSomething non-coersive is a request - and my request or my children&#39;s<br/>\nrequest to me can certainly carry with it explanation and persuasion and<br/>\npersistance.  If I have a request that is really important to me and that I<br/>\nfeel is vital, I&#39;m going to say so, I&#39;m going to say it loudly, I&#39;m going to<br/>\nsay it often, I&#39;m going to express how important it is to me and how my mood<br/>\nand willingness to help out as part of the family are affected if that need<br/>\ndoesn&#39;t find a way to get met.  My kids do the same to me and that helps me<br/>\nknow how important something is to them and why which often shifts me from<br/>\nfeeling too tired to help them with something tonight to choosing to put my<br/>\ntiredness aside and do it because it&#39;s THAT important.  Just like my kids<br/>\ndo, I feel it is important to push hard sometimes, to indicate how important<br/>\nthis is to mom, so that my needs can get met.  We can be creative and fun<br/>\nabout it, I always want to incorporate their needs - whatever works for that<br/>\nsituation.  My going into a discussion or a request with a specific goal in<br/>\nmind doesn&#39;t make it a demand to me.  It just means I have a focus.  I&#39;m<br/>\nopen to getting my need met differently than I may have in mind originally<br/>\nif that helps all our needs get met.<br/>\n<br/>\nThere may be a thin line at times between what is persuasion and what is<br/>\ncoersion.  I have only my own gut instinct and the reactions of my children<br/>\nto tell me if I&#39;ve crossed the line.  I know in my own self I have a pretty<br/>\ngood sense of when someone has persuaded me - that is someone has explained<br/>\nthemselves and their needs to me and the importance of those needs so<br/>\nclearly that I sense a shift in my own willingness to do something.  They<br/>\nhave persuaded me - that means I understand them better, I care about them<br/>\nand I make a choice to change my position and help them willingly.  It feels<br/>\npretty clear to me when I feel forced or coerced or not given much of a real<br/>\nchoice to make.  I feel trapped and angry.  I think it&#39;s the same for my<br/>\nkids and so I go by how their reactions as to whether I need a new tack on<br/>\nhow I&#39;m doing something.<br/>\n<br/>\nSo I don&#39;t view Pam&#39;s situation as coersive the way she described it, but<br/>\neven if she wants to call it coersive, I have done the same in my house and<br/>\nnot felt it to be forcing - and my children have not responded with feelings<br/>\nof being forced.<br/>\n<br/>\nNot sure if that makes the mud clearer, but those are my thoughts...<br/>\n<br/>\nJoan</div>","specialLinks":[]},{"userId":779600,"authorName":"KathrynJB@aol.com","from":"KathrynJB@...","profile":"kathrynbeth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:Coersion","postDate":"1088193841","msgId":1055,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg0LjJjZDY2NTlmLjJlMGRkZjMxQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":1058,"prevInTime":1054,"nextInTime":1056,"topicId":1055,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/25/2004 12:26:53 PM Eastern Standard Time, unschoolingbasics@yahoogroups.com writes: I m about to go get my kids out of bed and coerce","messageBody":"<div id=\"ygrps-yiv-1625147715\">In a message dated 6/25/2004 12:26:53 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> writes:<br/>\nI&#39;m about to go get my kids out of bed and coerce them. I see it as <br/>\ncoercion and am not denying it because it is what I&#39;m going to do.<br/>\n<br/>\nMy kids are generally cooperative and even take initiative in helping <br/>\naround the house - and will wash the dishes or do laundry once in a <br/>\nwhile just because they notice it needs doing. They&#39;re also extremely <br/>\nmessy - leave stuff all over - trash, dirty dishes, toys, dirty <br/>\nclothes, books, etc. A LOT of clutter everywhere - a LOT LOT!!<br/>\n<br/>\nBut today I&#39;m going to get them up and insist that we all do housework <br/>\ntogether for an hour.<br/>\n<br/>\nThen we&#39;re going off to the beach with lots of friends and we&#39;ll be <br/>\nthere for TEN hours - campfire, etc.<br/>\n<br/>\nIf they don&#39;t help and the house isn&#39;t straightened up and cleaned up <br/>\nsignificantly, I really don&#39;t want to go to spend the whole day and <br/>\nevening at the beach, I want to stay home and clean the house. I have <br/>\nVERY low standards and we&#39;ve fallen below my low standards - dirty <br/>\nsmelly dishes, no clean clothes, a thick layer of dust, grubby <br/>\nbathroom, and so much clutter everywhere that we can&#39;t walk safely <br/>\nthrough the house. We have been very busy - out of the house all day <br/>\nand evening for days in a row. (You&#39;d think the house would not get so <br/>\nmessy when we&#39;re so seldom home, huh?)<br/>\n<br/>\nI think they&#39;ll just do it when I ask - so maybe I won&#39;t have to feel <br/>\nlike I&#39;m coercing them. They see the need and will want it done, too. <br/>\nThey&#39;ll comply with my request.<br/>\n<br/>\nSo maybe it isn&#39;t coercion - but, truth is, I intend for them to do it.<br/>\n<br/>\nSo - we haven&#39;t fully come around to no coercion in the housework area.<br/>\n<br/>\nI LOVE the stuff people post about it - and it has helped me <br/>\ntremendously to get perspective.<br/>\n<br/>\nIf my kids were littler, if I was starting earlier, I&#39;d change the way <br/>\nwe&#39;ve dealt with housework.<br/>\n<br/>\nBut, right now, I just want to go to the beach and have fun and then <br/>\nNOT come home to a stinky, messy, gross house.<br/>\n<br/>\nUnschooling and NonCoercive Parenting are not one and the same thing. <br/>\n******************************<br/>\nI&#39;ve been reading this stuff, trying to figure out whether we use or have <br/>\nused coersion regularly (I&#39;m certain we have non-intentionally over the years.)<br/>\n<br/>\nWe don&#39;t have bedtimes, and haven&#39;t for most of Julian&#39;s life (since we began <br/>\nhomeschooling.) We don&#39;t have assigned chores. <br/>\n<br/>\nBut there HAVE been times we suggest strongly that he go to sleep, because <br/>\nhe&#39;s getting cranky and resisting it after too many days of short sleep. And he <br/>\nalways agrees.  We ask him to do stuff around the house, and he has never <br/>\nrefused. Sometimes it&#39;s not immediate, and sometimes he doesn&#39;t feel like it, but <br/>\nhe recognizes that we all hate it, and he never refuses. When he was little <br/>\nnever questioned bedtimes or toothbrushing or was a difficult eater. <br/>\n<br/>\nMaybe we&#39;re subtly coersive. Maybe he&#39;s just remarkably compliant. Or maybe <br/>\nwe just work as a team and he trusts us enough to just do the things we ask him <br/>\nto do, knowing that we&#39;ll always do the same for him.<br/>\n<br/>\nWhen we began unschooling, we realized we couldn&#39;t &quot;Unschool Julian.&quot; We <br/>\nrealized that the thing that drew us to this was that we all really valued <br/>\nlearning and empowering one another. We became an Unschooling Family, and the adults <br/>\nspend as much time being learning and doing things we love as Julian does. We <br/>\ntry to make decisions that will strengthen all of us, individually and <br/>\ntogether. Julian supports and empowers me and Beth as much as we do him.<br/>\n<br/>\nToday I was wrestling with an issue for the conference, and chatted with <br/>\nJulian about it. He gave me an amazing idea I was missing entirely. Smart kid. <br/>\nGood ideas.<br/>\n<br/>\nI really don&#39;t know about the coersion thing at all. I can tell you he&#39;s <br/>\nnever &quot;disobeyed,&quot; because we don&#39;t tend to give orders. He doesn&#39;t always make <br/>\nthe choices I would make, or even the ones I would prefer he make.<br/>\n<br/>\nI bet that was clear as mud ;)<br/>\n<br/>\nKathryn<br/>\n<br/>\n<br/>\nCome to the Live and Learn Unschooling Conference August 27-29 in Peabody, MA!<br/>\nFor more information, go to www.LiveandLearnConference.org<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":1062,"nextTopicId":1067}}