{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":145604420,"authorName":"Luckiebyrd@aol.com","from":"Luckiebyrd@...","profile":"luckiebyrd2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Limits and preschool driver","postDate":"1087073368","msgId":670,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhhLmQ0MDZlYzcuMmRmY2M2NThAYW9sLmNvbT4="},"prevInTopic":539,"nextInTopic":0,"prevInTime":669,"nextInTime":671,"topicId":530,"numMessagesInTopic":0,"msgSnippet":"Thanks Joan That does help alot.  You gave me alot of good ideas.  Using the  timer for phone calls could be a godsend. ","messageBody":"<div id=\"ygrps-yiv-1270651980\">Thanks Joan<br/>\n <br/>\nThat does help alot.  You gave me alot of good ideas.  Using the  timer for <br/>\nphone calls could be a godsend.<br/>\n <br/>\n&lt;&lt;No matter what your choice of what&#39;s important and what&#39;s not is at  any <br/>\ngiven point in<br/>\ntime, the way in which you communicate that to your child  and taking time<br/>\nand patience to include and balance their needs with yours  will make all the<br/>\ndifference.&gt;&gt; <br/>\n <br/>\nThat is going on my fridge in big letters.  <br/>\n <br/>\nThank you again Joan and everyone for your thoughtful responses.<br/>\n <br/>\nCheryl<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":31945013,"authorName":"Joan Labbe & Salvatore Genovese","from":"&quot;Joan Labbe & Salvatore Genovese&quot; &lt;salgenovese@...&gt;","profile":"jrl01760","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Limits and preschool driver","postDate":"1086882646","msgId":539,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEhJRVBLT09FRUlBSUJISFBKRUJQQUVLQkNNQUEuc2FsZ2Vub3Zlc2VAd29ybGRuZXQuYXR0Lm5ldD4=","inReplyToHeader":"PDNiLjQ4OGRhYmZmLjJkZjlkMjlmQGFvbC5jb20+"},"prevInTopic":530,"nextInTopic":670,"prevInTime":538,"nextInTime":540,"topicId":530,"numMessagesInTopic":0,"msgSnippet":"... From: Luckiebyrd@aol.com [mailto:Luckiebyrd@aol.com] Sent: Thursday, June 10, 2004 11:05 AM To: unschoolingbasics@yahoogroups.com Subject:","messageBody":"<div id=\"ygrps-yiv-282812175\">-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Luckiebyrd@...\">Luckiebyrd@...</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Luckiebyrd@...\">Luckiebyrd@...</a>]<br/>\nSent: Thursday, June 10, 2004 11:05 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: [unschoolingbasics] Limits and preschool driver<br/>\n<br/>\n<br/>\n**You made groceries more important than your baby.  That sounds harsh  but<br/>\nI hope you can think about this in a new way. What if you had to go by  more<br/>\nmilk?  The price of milk is not greater<br/>\nthan your sons comfort and  happiness.**<br/>\n<br/>\n&quot;I am trying to think about this in a new way, and nothing is more<br/>\nimportant<br/>\nthan my baby. But he&#39;s actually 3.5, almost 4 now, and does  gentle<br/>\nparneting<br/>\nnot allow you to say, *I love you and you are important to me,  but we need<br/>\nto<br/>\ngo home and put away our groceries before they spoil.*  If  he understands<br/>\nthat, great. But if he doesn&#39;t, we still need to be able to do  things that<br/>\nhe<br/>\ndoesn&#39;t yet understand sometimes.  In my family right now  every penny<br/>\ncounts,<br/>\ntwice:)  Every time we waste money, I have to be away  from my family more<br/>\nas<br/>\nI am the *primary breadwinner*  for a little while  longer.  I actually went<br/>\nto the grocery store before picking him up so that  I wouldn&#39;t have to take<br/>\na<br/>\ntired child in the grocery store, I actually was  thinking about what was<br/>\nbest<br/>\nfor him well in advance.&quot;<br/>\n<br/>\nHi, Cheryl,<br/>\n<br/>\nYou don&#39;t sound super defensive to me, just like you are trying to figure<br/>\nthis all out, and I give you loads of credit for asking your questions,<br/>\nlistening to answers that may be hard to hear, and trying to work out<br/>\nsomething new.  I am really a big advocate of &quot;answers that feel like they<br/>\nwork for all of you&quot;.  The bottom line to me in this situation would be that<br/>\nmy son not only hear he is important to me by my saying those word but feel<br/>\nthat too.  If I force him into his carseat he will not feel this.  Part of<br/>\nit is knowing by trial and error what might work with your particular kid to<br/>\npossibly work something out.  With mine I might try something like &quot;I hear<br/>\nhow much you really want to drive the car right now and not wait.  And it<br/>\ndoes sound like fun!  Mommy would really like to get the milk home so it&#39;s<br/>\nnot yucky and we don&#39;t have to throw it out.  How about if I get you one of<br/>\nthose [insert name of something you bought at the store he might like to<br/>\nhave] we bought at the store to eat in your carseat for now, and then when<br/>\nwe get home in the driveway, you can sit with me and help me drive up to the<br/>\nfront door?  Then you could practice your pretend driving while Mommy gets<br/>\nthe groceries inside?&quot;  This might or might not fly depending on his mood,<br/>\nhow much he would like a popsicle and how open to compromise he feels.  I<br/>\nwould spend some time trying other ideas (sing a special song, hey, after<br/>\nyou drive us up the driveway we could do our fun races you like).  Bottom<br/>\nline, I&#39;ve found he feels more like meeting me halfway if he feels his needs<br/>\nare heard or he finds a fun alternative that feels okay.  If none of my<br/>\nideas made it, and it really came down a choice of forcing him into the seat<br/>\nor losing the milk, even on a tight budget (which is true of us also), I&#39;d<br/>\nchaulk the milk up to a loss this one time and likely try to arrange not to<br/>\nget perishible items with my son in tow until he is older and you could<br/>\nperhaps make a deal he could both understand and stick to (which certainly<br/>\nmy 3 1/2 yr old couldn&#39;t do at this age yet) ahead of time to get the<br/>\nperishible items home quickly.  Maybe your husband could pick up perishibles<br/>\non the way home from work instead - or you could work out some other kind of<br/>\narrangement.  That&#39;s not as convenient, but it honors both your needs.<br/>\n<br/>\nTo speak to Nance&#39;s post, which makes lots of sense to me, weighing and<br/>\nmeasuring the importance of things is an ongoing challenge and I think<br/>\nquestioning what Ren called our &quot;knee jerk reactions&quot; is really important<br/>\npart of that.  I&#39;ve found my own sense of &quot;what seems more important and<br/>\nwhat doesn&#39;t seem mroe important&quot; to have changed a lot.  No matter what<br/>\nyour choice of what&#39;s important and what&#39;s not is at any given point in<br/>\ntime, the way in which you communicate that to your child and taking time<br/>\nand patience to include and balance their needs with yours will make all the<br/>\ndifference.  My kids have a lot of difficulty with me being on the phone.<br/>\nIt is a need I have to be on it sometimes, and not always when they are<br/>\ncompletely distracted.  I&#39;ve found with my daughter that the issue is &quot;it<br/>\nfeels endless&quot;.  So if I commit to a certain amount of time and set the<br/>\ntimer she feels okay giving me space to have my call knowing that the timer<br/>\nwill go off and I&#39;ll respect her need for me to get off.  The particulars of<br/>\nhow you work it out are not that important, but what feels important to me<br/>\nis finding the patience and being tenacious and caring enough of my children<br/>\nto include their needs.<br/>\n<br/>\nHope that helps...<br/>\n<br/>\nJoan</div>","specialLinks":[]},{"userId":145604420,"authorName":"Luckiebyrd@aol.com","from":"Luckiebyrd@...","profile":"luckiebyrd2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[unschoolingbasics] Limits and preschool driver","postDate":"1086879903","msgId":530,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNiLjQ4OGRhYmZmLjJkZjlkMjlmQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":539,"prevInTime":529,"nextInTime":531,"topicId":530,"numMessagesInTopic":0,"msgSnippet":"I hope no one minds if I combine threads.  I m trying to reconcile reasonable limits and gentle parenting. In a message dated 6/10/2004 8:24:44 AM Eastern","messageBody":"<div id=\"ygrps-yiv-1458575767\">I hope no one minds if I combine threads.  I&#39;m trying to reconcile  <br/>\nreasonable limits and gentle parenting.<br/>\n <br/>\nIn a message dated 6/10/2004 8:24:44 AM Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marbleface@...\">marbleface@...</a> writes:<br/>\n<br/>\n**If I&#39;m  on the phone, and a kid comes up to me to talk (which always seems <br/>\nto  <br/>\nhappen) I point at the phone and say it is important, or somesuch, if it  is <br/>\n-- <br/>\nsometimes phone calls are more important than &quot;Hey, Mom, look at  this cool <br/>\nthing I drew.&quot; If the house was on fire or the kid was injured,  the phone <br/>\ncall <br/>\nwould not be as important. <br/>\n<br/>\nJust life, imo. Which  has limits but doesn&#39;t have to have more than <br/>\nnecessary.  **<br/>\n<br/>\n<br/>\n<br/>\nThis just sounds really down to earth.  I think I was beginning to  feel <br/>\nguilty if there was ANYTHING that seemed more important than what  my kids are <br/>\ndoing RIGHT NOW.  Maybe that was just a swing a  little to far from the <br/>\ncontrolling/disciplining type of parenting.   Yes, my kids are very important and so is <br/>\nwhat they think/make/do, but sometimes  I have something on the stove, or I&#39;m <br/>\non the phone (not just chatting, but  taking care of family business or <br/>\nwhatever).<br/>\n <br/>\n**You made groceries more important than your baby.  That sounds harsh  but<br/>\nI hope you can think about this in a new way. What if you had to go by  more <br/>\nmilk?  The price of milk is not greater<br/>\nthan your sons comfort and  happiness.** <br/>\n <br/>\nI am trying to think about this in a new way, and nothing is more  important <br/>\nthan my baby. But he&#39;s actually 3.5, almost 4 now, and does  gentle parneting <br/>\nnot allow you to say, *I love you and you are important to me,  but we need to <br/>\ngo home and put away our groceries before they spoil.*  If  he understands <br/>\nthat, great. But if he doesn&#39;t, we still need to be able to do  things that he <br/>\ndoesn&#39;t yet understand sometimes.  In my family right now  every penny counts, <br/>\ntwice:)  Every time we waste money, I have to be away  from my family more as <br/>\nI am the *primary breadwinner*  for a little while  longer.  I actually went <br/>\nto the grocery store before picking him up so that  I wouldn&#39;t have to take a <br/>\ntired child in the grocery store, I actually was  thinking about what was best <br/>\nfor him well in advance.<br/>\n<br/>\n**Surely you&#39;ve &quot;wasted&quot; a few dollars on something that would  brighten<br/>\nyour day, a new lipstick or nail polish or something.**<br/>\n <br/>\nNot in a long time.  And I don&#39;t resent that.  Actually my  weakness would be <br/>\nmusic or toys for the kids.  But my husband has been in  school fulltime for <br/>\ntwo years as part of a career change.  He has been out  of the house six days <br/>\na week, mostly twelve hours days, so that he can have a  more stable long term <br/>\njob and take over the bread winner position.  We are  all really looking <br/>\nforward to that.<br/>\n <br/>\nI hope that doesn&#39;t sound ultra defensive and I REALLY DO take all the  <br/>\nadvice seriously.  I appreciate everone for taking the time to read, think  about <br/>\nand respond to other peoples problems and questions.<br/>\n <br/>\nCheryl<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":666,"nextTopicId":586}}