{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":237471585,"authorName":"sistergoddesselli","from":"&quot;sistergoddesselli&quot; &lt;elinorsparks@...&gt;","profile":"sistergoddesselli","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I think I am getting this...","postDate":"1238160819","msgId":39151,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdxaWtqaitsbGZnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdxaDZpbStmNjc0QGVHcm91cHMuY29tPg=="},"prevInTopic":39137,"nextInTopic":0,"prevInTime":39150,"nextInTime":39152,"topicId":39118,"numMessagesInTopic":0,"msgSnippet":"Yup, Mo, I mean sincere appreciation. I am very clear with myself and specific with him about what need I am getting met when he compromises.  Peter, when you","messageBody":"<div id=\"ygrps-yiv-383818177\">Yup, Mo, I mean sincere appreciation.  <br/>\n<br/>\nI am very clear with myself and specific with him about what need I am getting met when he compromises.  &quot;Peter, when you went along yesterday, even though you really wanted to stay home and watch TV, I got to see my friends.  I love seeing my friends because it makes me feel relaxed and supported.  Thank you.&quot;  <br/>\n<br/>\nI am not talking about &quot;Good Boy&quot; kinda praise. <br/>\n<br/>\nI am reading &quot;Non-violent Communication&quot; by Marshall Rosenberg, which is helping me a lot too. <br/>\n<br/>\nLove,<br/>\n<br/>\nElli<br/>\n(Sophia 11, Peter 8)</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I think I am getting this...","postDate":"1238113686","msgId":39137,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdxaDZpbStmNjc0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdxZnYxbiszdDJzQGVHcm91cHMuY29tPg=="},"prevInTopic":39118,"nextInTopic":39151,"prevInTime":39136,"nextInTime":39138,"topicId":39118,"numMessagesInTopic":0,"msgSnippet":"... ********************************** By sincere praise, do you mean you re expressing sincere appreciation? That helps to foster a sense of mutual respect","messageBody":"<div id=\"ygrps-yiv-741350647\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;sistergoddesselli&quot; &lt;elinorsparks@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; And, I&#39;ve been praising him very sincerely when he or his sister has had to tag along to something they didn&#39;t want to do and we couldn&#39;t find an alternative that would allow them to stay home.  I think he really feels RESPECTED now!!<br/>\n </span></blockquote>**********************************<br/>\n<br/>\nBy sincere praise, do you mean you&#39;re expressing sincere appreciation? That helps to foster a sense of mutual respect and support for sure. Praise, per se, is a behavior modification trick: Good boy. You&#39;re so good for coming along. You&#39;re so helpful. Mommy loves her thoughtful little boy. Those are all examples of praise and they don&#39;t build a sense of respect at all. Praise can break relationships down the same way punishment can - its the flip side of the punishment coin. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;And, when someone&#39;s needs are[n&#39;t] being met, they usually take it out on the other person regardless of whether the other one is involved in the issue.  Like a big knotty tangle, this one will require some slippery oil or lots of conditioner before I can comb it out.<br/>\n </span></blockquote>*******************************<br/>\n<br/>\nYes, learning to meet kids&#39; needs proactively is one of the biggest, hardest skills for many many parents to learn. All our backgrounds and environment are full of &quot;reactive parenting&quot; - we don&#39;t even Think to think ahead, plan ahead, set our kids up for success on a daily basis at first. Its something to work on. <br/>\n<br/>\nSomething that helped me was to look for patterns - when Ray was little I noticed that he got cranky every couple hours unless he ate. Aha! So I made sure to offer him food at closer intervals. Happily for me, Ray was one of those kids who would eat anything anytime, so it was a simple matter of me handing him food every time he paused for breath :)<br/>\n<br/>\nMo is often cranky first thing in the morning, until she eats (food is a good place to start looking for patterns), but if she waits too long, she&#39;ll only eat something really really sweet - like frosting. So its important to offer her food within half an hour of her waking up.<br/>\n<br/>\nDo you know the acronym HALT? I forget what parenting guru thought that one up, but it stands for: Hungry, Angry, Lonely, Tired. Those are all good places to start looking for needs, both in the moment and proactively. <br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":237471585,"authorName":"sistergoddesselli","from":"&quot;sistergoddesselli&quot; &lt;elinorsparks@...&gt;","profile":"sistergoddesselli","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"I think I am getting this...","postDate":"1238073207","msgId":39118,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdxZnYxbiszdDJzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":39137,"prevInTime":39117,"nextInTime":39119,"topicId":39118,"numMessagesInTopic":0,"msgSnippet":"Hello everyone - Thank you!!  For all of your wisdom and your willingness to share.  Since mine were little, I ve been looking for an unlimited and","messageBody":"<div id=\"ygrps-yiv-1904764680\">Hello everyone - <br/>\n<br/>\nThank you!!  For all of your wisdom and your willingness to share.  Since mine were little, I&#39;ve been looking for an unlimited and unconditional source of motherly advice and experience that fits with my philosophy of life and gives me ideas about practical implementation.  And, Unschooling Basics is it for me right now!!<br/>\n<br/>\nNew to home-schooling and un-schooling as of February this year, the things that I am trying, thanks to the ideas I get from you are starting to work, are starting to heal us and soothe my heart.  I think I am getting this... <br/>\n<br/>\nTV - We&#39;ve gone from highly restricted to unlimited.  The biggest learning curve for me has been to SLOW down and watch it with them.  There are actually some interesting things on the big box!!  And, I can tell my kids like it when I spend time doing something with them that they like.<br/>\n<br/>\nRespect - mine for them!!!  I love what I am reading from y&#39;all about being respectful.  It can still be hard to stop myself from slipping into trying to guilt trip them or manipulate them, but I am more aware of the discomfort that gives me and so I am stopping sooner.  <br/>\n<br/>\nAnd, I am really treating them with respect... how do I know?  Last night, when I got home from teaching my dance class, my sweet son offered ALL KINDS of help around the house.  &quot;Mom, what can I do to make it easier for you?&quot;  He actually said that!!  Which is what I have been saying while he watches TV, &quot;How can I make you more comfortable?&quot;  <br/>\n<br/>\nAnd, I&#39;ve been praising him very sincerely when he or his sister has had to tag along to something they didn&#39;t want to do and we couldn&#39;t find an alternative that would allow them to stay home.  I think he really feels RESPECTED now!!<br/>\n<br/>\nStrewing - I am working on this one, and it will become easier for the kids to respond, I think, as the healing around TV progresses, but I did pick up a flier about a seminar on the ancient ways of birth, and asked my son, who connects with the Divine Feminine, if he would like to go with me.  He talked about what it might look like, how long it might be and decided the experience would probably be a good match for him.  He also starting thinking about all of the ways he is learning and he shared his thoughts with me.  &quot;Mom, I day dream.  I think of all of the different tanks I can make.  I&#39;ve got hundreds in my mind...&quot;  What a beautiful moment with my Goddess-loving, tank-building-in-his-daydreams guy!<br/>\n<br/>\nSibling - Oh, this is the big challenge for me.  Stopping, talking, addressing feelings and needs when it comes up between siblings.  But, I think I did a great job yesterday after the remote control flew across the room and hit my sweet son on the head and then he threw rice back at his darling big sister.  I spoke to each of them separately.  We talked about their feelings and needs.  And, we talked about the other kid and what they might need or feel.  Digging through the layers helped.  They actually express a lot of affection for each other during the week.  And, when someone&#39;s needs are being met, they usually take it out on the other person regardless of whether the other one is involved in the issue.  Like a big knotty tangle, this one will require some slippery oil or lots of conditioner before I can comb it out.  But, I know that reading this group&#39;s postings and responses will help  me along the way!!<br/>\n<br/>\nI will stop there, but please hear my shouts of appreciation to this group and to my local un-schooling friends!!<br/>\n<br/>\nTHANK YOU!!<br/>\n<br/>\nlove,<br/>\n<br/>\nElli</div>","specialLinks":[]}],"prevTopicId":39150,"nextTopicId":39120}}