{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":351836297,"authorName":"Amanda Mayan","from":"&quot;Amanda Mayan&quot; &lt;amanda@...&gt;","profile":"amandabpearl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Going out and other perspectives...","postDate":"1256997111","msgId":41981,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWYwMWNhNWEzMSQ0ZDMyYzI3MCRlNzk4NDc1MCRAdXM+"},"prevInTopic":41973,"nextInTopic":0,"prevInTime":41980,"nextInTime":41982,"topicId":41967,"numMessagesInTopic":0,"msgSnippet":"Regarding how other people see/ discuss your child.I remind grandparents and others who REALLY care that my daughter (3 y.o.) is not defiant and ","messageBody":"<div id=\"ygrps-yiv-1888194827\">Regarding how other people see/ discuss your child.I remind grandparents and<br/>\nothers who REALLY care that my daughter (3 y.o.) is not &quot;defiant&quot; and<br/>\n&quot;stubborn&quot;.she&#39;s &quot;strong-willed&quot; and &quot;clear in what she wants/ needs&quot;.. I&#39;ve<br/>\nbeen repeating this for about a year now, and it has definitely helped them<br/>\nto experience a paradigm shift with regards to how they relate to her<br/>\npersonality. As far as people not so close to us, I just ignore the comments<br/>\nand make sure that they are not made in front if my daughter..sometimes this<br/>\nmeans changing who/ how we socialize.a small price to pay (in my opinion)<br/>\nfor a really cool 3 y o who really has a distinct and interesting<br/>\npersonality.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Going out and other perspectives...","postDate":"1256924098","msgId":41973,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhjZjg0Mit1Z2I5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhjZXZpaCtxcG9tQGVHcm91cHMuY29tPg=="},"prevInTopic":41971,"nextInTopic":41981,"prevInTime":41972,"nextInTime":41974,"topicId":41967,"numMessagesInTopic":0,"msgSnippet":"... *********************** How is he about going other places? Going for a walk? Going to the park? There are two different issues coliding - going out and","messageBody":"<div id=\"ygrps-yiv-123407680\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;kazglc&quot; &lt;kazzarat@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I usually go to one home ed event a week or some other activity that would involve other kids.  He&#39;s not really that interested in playing with other kids<br/>\n </span></blockquote>***********************<br/>\n<br/>\nHow is he about going other places? Going for a walk? Going to the park? There are two different issues coliding - going out and socializing. If socializing is the issue, consider going other places, instead. For a long time Mo wanted to go to the store or playground, but not spend much time with other children. You can meet one need without the other. <br/>\n<br/>\nAlso, what kinds of expectations does he face around others? Is he expected to interact? For a time, we&#39;d bring a portable dvd player along so Mo could watch movies any time we went out. We&#39;d &quot;shoo&quot; others away from her so she could be close to the action, but not have to interact. Generally, she&#39;d take some time to get aclimated, then join in whatever fun. But she needed that time to warm up and get a sense of the people and the scene first - when she had that, her social skills were much better. <br/>\n<br/>\nEven home playdates I look for ways for Mo to be able to have some down time. She often needs time right when someone shows up, which is awkward, if its a kid wanting to play! So I have to be ready to play and let her have her time until she&#39;s ready to take over. Her social skills can be night and day different. If she&#39;s feeling overwhelmed, she&#39;s likely to be really rude, or even melt down. Once she&#39;s ready to socialize, though, she&#39;s very gracious and easy to get along with - its startling just how differently she&#39;ll behave with fifteen minutes of &quot;down time&quot;. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Going out and other perspectives...","postDate":"1256916793","msgId":41971,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENCMjk4NEIwNzhFRjRCQzU5NkIyQkVGRTQxQTAyOTFCQExZTEFMQVAyPg==","inReplyToHeader":"PGhjZXZpaCtxcG9tQGVHcm91cHMuY29tPg==","referencesHeader":"PGhjZXZpaCtxcG9tQGVHcm91cHMuY29tPg=="},"prevInTopic":41967,"nextInTopic":41973,"prevInTime":41970,"nextInTime":41972,"topicId":41967,"numMessagesInTopic":0,"msgSnippet":"my son was *exactly* the same way and i feel one of my biggest mistakes was pushing him too much to be around other people.  the negative feedback about *who","messageBody":"<div id=\"ygrps-yiv-1363270821\">my son was *exactly* the same way and i feel one of my biggest mistakes was pushing him too much to be around other people.  the negative feedback about *who he is*, and how he reacts when stressed and stretched, was damaging to his self concept, and he&#39;d have been much better off being allowed to take the lead on what he was ready for.<br/>\n<br/>\nso - since your son does better getting out to the house once in a while, i&#39;d focus on getting out  of the house - but NOT to be around other people, or at least other people with kids his age.  what about just with you?  on little adventures or explorations.  what about JUST to the dollar store and the park?  or what about adult friends or friends with babies or teens?  <br/>\ni&#39;d  encourage you to get creative about how to expand his world without making him fit into a traditional peer setting like playdates or birthday parties.<br/>\n<br/>\nwarmly, lyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269037874,"authorName":"kazglc","from":"&quot;kazglc&quot; &lt;kazzarat@...&gt;","profile":"kazglc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Going out and other perspectives...","postDate":"1256915345","msgId":41967,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhjZXZpaCtxcG9tQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":41971,"prevInTime":41966,"nextInTime":41968,"topicId":41967,"numMessagesInTopic":0,"msgSnippet":"I have 2 boys age 4 and 16mths.  The older one very rarely, when asked, wants to go anywhere.  We spend a lot of time at home and i am ok with that but i m","messageBody":"<div id=\"ygrps-yiv-1955152079\">I have 2 boys age 4 and 16mths.  The older one very rarely, when asked, wants to go anywhere.  We spend a lot of time at home and i am ok with that but i&#39;m also not sure how far to &#39;encourage&#39; outings.  Just would appreciate some thoughts on this<br/>\n<br/>\nI usually go to one home ed event a week or some other activity that would involve other kids.  He&#39;s not really that interested in playing with other kids and quickly gets grumpy with them cos they, understandably, dont want to follow his precise instructions in play, like me or my husband or his grandparents would do. <br/>\n<br/>\n I find it kind of embarrassing and upsetting cos he comes across like unpleasant i suppose and i am always trying to keep things upbeat and smooth over the goings on to try and put him in a good light.  Friends and relatives have often called him demanding in a negative way and to be honest i can tell a lot of people dont like him - my cousin shed light on it for me once by saying how she got all choked up and was nearly crying once when she was at my house at the way my son was talking to me and treating me.   I dont think i really notice it just seems normal - the demandingness and &#39;bossing&#39; me about and telling me to shut up etc...<br/>\n<br/>\n He is very easily offended by others and reacts negatively easily.   He just basically comes across really badly a lot - he doesnt do well with people - he&#39;s a one on one person (bit like me really!).   I avoid people a lot due to how he is and keep his life as easy as i can with just me or his dad or grandparents (dhs parents) who adore him and get to see his good side too.  I worry though that by doing this i am not giving him enough opportunity to branch out and potentially meet new people he would be able to get on with.<br/>\n<br/>\nWhich kinda leads me onto how i manage to get him out to things - i often will say that we can go buy a toy from the £1 shop on the way - it kind of gives him the incentive to go out and also gives us a toy to focus on when we are in a social gatherings and will attract other kids too which is usually good! I dont always have the money to do this but i also worry that i am just bribing him and that it is somehow wrong?<br/>\n<br/>\n  Also whenever we do go out he usually ends up enjoying it and is more &#39;settled&#39; when we get home - if he&#39;s getting really bad with the baby (he is mean to him a lot) its usually when we have just been home for 3 days - like he&#39;s getting a bit of cabin fever but will still insist that he doesnt want to go out at which point i pull out all the stops to get us all somewhere.  I dont think its an excercise thing cos he is constantly moving when we are home and jumping about and we do abstacle courses all the time in the living room and all that - it just seems to be a &#39;getting out of the house&#39; thing.<br/>\n<br/>\nI could go on but this is too long really already!<br/>\n<br/>\nKaren</div>","specialLinks":[]}],"prevTopicId":41957,"nextTopicId":41882}}