{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: The Unschooling Confernece","postDate":"1198901484","msgId":28671,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2ODQ3NS40OTk3My5xbUB3ZWI4MTUwMi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":28670,"nextInTopic":0,"prevInTime":28670,"nextInTime":28672,"topicId":28657,"numMessagesInTopic":0,"msgSnippet":"Another option would be to do it like the Conference they had in Minneapolis ( Sandra was the main speaker) in the end of last September where they did not","messageBody":"<div id=\"ygrps-yiv-1300428941\">Another option would be to do it like the Conference they had in Minneapolis ( Sandra was the main speaker) in the end of last September where they did not allow kids either but the venue was adjacent to a big park ( indoor with things for all ages),<br/>\nThat way you could bring someone to be with your kids playing but you are right there if they need you.<br/>\nMadison is a great town and people there are extremely friendly.<br/>\nDowntown right next to the Capitol Building ( that is absolutely a must to go visit) there are at leat 3 museums including the Children&#39;s Museum, several hotels, great little shops and places to eat all within walking distance ( really close).<br/>\nThat may be an option so to them. I know that I have stayed in a hotel right there when dd whas 9 months old and ds 4 and we had a blast walking everywhere. They did have Conference rooms there. I should go ahead and send them an e-mail....<br/>\nAlex ( who really just wish she could go but also wished her kids go have fun with other unschoolers too!)<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"&quot;diana jenner&quot; &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: The Unschooling Confernece","postDate":"1198890456","msgId":28670,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDcxMjI4MTcwN203ZTkyODQwYWdhZWRiZTIwNzY4ZDEzYzkwQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGZsNDQ2Nys5MG1wQGVHcm91cHMuY29tPg==","referencesHeader":"PGM3NS4yMmFiZDM4Yi4zNGE2NjhkYUBhb2wuY29tPiA8Zmw0NDY3KzkwbXBAZUdyb3Vwcy5jb20+"},"prevInTopic":28669,"nextInTopic":28671,"prevInTime":28669,"nextInTime":28671,"topicId":28657,"numMessagesInTopic":0,"msgSnippet":"~~Also if the conference doesn t fit your needs you can organize something yourself in your area, it doesn t even have to have speakers like a conference, but","messageBody":"<div id=\"ygrps-yiv-1326404958\">~~Also if the conference doesn&#39;t fit your needs you can organize something<br/>\nyourself in your area, it doesn&#39;t even have to have speakers like a<br/>\nconference, but could be as simple as unschoolers getting together to<br/>\ntalk about different issues, in a more casual setting. There are many ways<br/>\nto get different needs met.~~<br/>\n<br/>\nI know the conference folks are aware of the quandary of kids attending, I&#39;m<br/>\ncertain there are folks in Madison (and in a Madison driving range) who<br/>\nwould jump at the chance to have a kid friendly gathering to share their<br/>\nunschooling journeys. Non-Con gatherings are amazing! Ask Mary Gold: If you<br/>\nPlan it We will Come -- SO true :D We&#39;ve had two in Corvallis, we&#39;re<br/>\nplanning another near Seattle for Marti Gras, probably one in Canada this<br/>\nsummer (that&#39;s in addition to having LIFE is Good in between :D)... just<br/>\ngatherings of families, opportunities to witness and support and play and<br/>\nchase and laugh and sing and share and hug and all of that wonderful Tribal<br/>\nGathering schtuff we miss so much when we don&#39;t get enough. Have you thought<br/>\nabout possibly driving to the one in Ohio next month? It&#39;s at a waterpark :D<br/>\n<br/>\nAnd for anyone who has yet to gather with unschoolers, check out my blog for<br/>\nnon-con posts (and links to other blogs, too) We had such a great time! We<br/>\n*HAVE* such a great time every time we meet, it is a stretching, learning,<br/>\njoyous experience for us all.<br/>\n-- <br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: The Unschooling Confernece","postDate":"1198887943","msgId":28669,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZsNDQ2Nys5MG1wQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGM3NS4yMmFiZDM4Yi4zNGE2NjhkYUBhb2wuY29tPg=="},"prevInTopic":28665,"nextInTopic":28670,"prevInTime":28668,"nextInTime":28670,"topicId":28657,"numMessagesInTopic":0,"msgSnippet":"~~ Also if the conference doesn t fit your needs you can organize something yourself in your area, it doesn t even have to have speakers like a confernece, but","messageBody":"<div id=\"ygrps-yiv-830332295\">~~<br/>\nAlso if the conference doesn&#39;t fit your needs you can organize something<br/>\nyourself in your area, it doesn&#39;t even have to have speakers like a<br/>\nconfernece, but could be as simple as unschoolers getting together to<br/>\ntalk about different issues, in a more casual setting. There are many<br/>\nways to get different needs met.~~<br/>\n<br/>\nThe recent ARGH gathering here in Eastern TN waas just that. We had a<br/>\ngathering where we all shared various interests, discussed unschooling<br/>\nand played. It was small and opened a lot of doors for future<br/>\ngatherings, new ideas and new friendships. We&#39;ll be hosting it twice<br/>\nper year now and it&#39;s very exciting to be a part of something new.<br/>\n<br/>\nI see the benefits of attending events for adults only, I truly do<br/>\n(because I can focus on what *I* need and not worry about anyone<br/>\nelse). But I really think that in unschooling circles you will hugely<br/>\nlimit your attendee base if you don&#39;t host something geared for all ages.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":7644358,"authorName":"Kidgie@aol.com","from":"Kidgie@...","profile":"mama_de_julian_y_julia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] The Unschooling Confernece","postDate":"1198872539","msgId":28665,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ2MC4xYTNiNDk2Yi4zNGE2YjFkYkBhb2wuY29tPg=="},"prevInTopic":28661,"nextInTopic":28669,"prevInTime":28664,"nextInTime":28666,"topicId":28657,"numMessagesInTopic":0,"msgSnippet":"... ________________________________ I agree, and I m really, really not trying to hurt feelings at ALL. I know how it feels when it SEEMS as if you are being","messageBody":"<div id=\"ygrps-yiv-312719553\">In a message dated 12/28/07 6:58:14 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Genant2@...\">Genant2@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also I have  nothing to do<br/>\n&gt; with this conference, but I can say how discouraging it is to read  negative<br/>\n&gt; statements like that. <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>________________________________<br/>\n<br/>\nI agree, and I&#39;m really, really not trying to hurt feelings at ALL. I know <br/>\nhow it feels when it SEEMS as if you are being left out. I&#39;m 38 and have been a <br/>\nmom for over 20 years. I&#39;ve been &quot;left out&quot; of many, many things due to having <br/>\nthe kids and not having childcare (single parenting, workaholic DHs, no <br/>\nmoney) and it feels awful. But I&#39;ve seen that sometimes, it feels like a personal <br/>\naffront, but in actuality, it fits the needs of a larger group. An intense <br/>\nsingle day conference might really be one of those ways that we as moms (and for <br/>\nthe most part, SAHMs) can care for ourselves and talk *about* our children and <br/>\nhow we have opted to raise them.   I bet most of us don&#39;t talk ABOUT them with <br/>\nthem in the room - we include them. But all adults? And adults that are along <br/>\nthe same lines as we are re: education, school and life? Were we might get a <br/>\nchance to discuss our fears in person (emails are great, but not the same) and <br/>\nalso our wonderful times, too. I see both &quot;sides&quot; here, but are needed. And <br/>\nits easy for me to disccuss it since I have NO possibility of going - with or <br/>\nwithout the kids. <br/>\n<br/>\nI hope all is resolved however, I really do. I love this lost and hope the <br/>\ndiscord is all over soon.<br/>\n<br/>\nKaren <br/>\n<br/>\n<br/>\n**************************************<br/>\nSee AOL&#39;s top rated recipes <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://food.aol.com/top-rated-recipes?NCID=aoltop00030000000004)\">http://food.aol.com/top-rated-recipes?NCID=aoltop00030000000004)</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] The Unschooling Confernece","postDate":"1198864036","msgId":28661,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5NTkxOC45ODIxNC5xbUB3ZWI4MTUxMC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":28657,"nextInTopic":28665,"prevInTime":28660,"nextInTime":28662,"topicId":28657,"numMessagesInTopic":0,"msgSnippet":"Sure Psm I agree with many of the things you are saying. I am not here to bash the Conference. My point is that I really wanted to go. Last year was the first","messageBody":"<div id=\"ygrps-yiv-425269030\">Sure Psm I agree with many of the things you are saying. I am not here to bash the Conference.<br/>\nMy point is that I really wanted to go.<br/>\nLast year was the first year and their venue did not allow ( size wise) to have kids.<br/>\nThey have this new venue this year and one was really hoping that they could have a room for the kids. I am not asking for them to baby sit my kids. But they are not allowed this year again and I cannot help and feel.<br/>\nsad I cannot make it. There is a group of unschoolers that get together about one hour and a half from me.<br/>\nI wanted to connect with more unschoolers and  well, maybe I just wanted me and my kids to feel the way we did at your Conference ( L and L).<br/>\nIt was so nice to be there that my 5 year old keeps asking when we are going to go back almost every week.<br/>\nAnd as I said. I hope they can find a way to allow kids next year but I cannot help that I am sad I will not be able to go this year.<br/>\nThe funny part is that apparently most people going to the Conference last year would rather stay this way as someone posted earlier.<br/>\nSo it seems that I am a minority that wants to have her kids with her.<br/>\nAnd again Pam Thank you for all the work you guys do at L and L. It was really appreciated.<br/>\nAlex<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: &quot;Genant2@...&quot; &lt;Genant2@...&gt;<br/>\nTo: unschoolingbasics@yahoogroups.com<br/>\nSent: Friday, December 28, 2007 8:57:30 AM<br/>\nSubject: Re: [unschoolingbasics] The Unschooling Confernece<br/>\n<br/>\nIn a message dated 12/28/2007 8:52:37 AM Eastern Standard Time, <br/>\nunschoolingbasics@ yahoogroups. com writes:<br/>\n<br/>\nBut what happens is that not allowing children makes it impossible for <br/>\nsomeone like me ( coming 4 hours from Minnesota) to do come to the Conference.<br/>\nI am lookomng for connecting with unschoolers. &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt; &lt;<br/>\n<br/>\nJust another perspective maybe, and maybe I am stepping into the fire <br/>\nbut,....I just want to mention how difficult, time consuming and much work putting <br/>\non a conference of any type is. I have been there myself several times. And <br/>\nwhile I can totally understand not wanting to be separated from your <br/>\nchildren, it is very difficult to meet everyone&#39;s needs. Also I have nothing to do <br/>\nwith this conference, but I can say how discouraging it is to read negative <br/>\nstatements like that. A more productive path might be to write the conference <br/>\ncoordinators in person. Maybe ask if there is any way you could help out so <br/>\nthat it might be possible to even have just one room or area with toddler <br/>\ntoys. Reading negative statements about &quot;your baby&quot; is so discouraging and <br/>\nmakes you wonder if maybe it isn&#39;t worth it, all the time and energy. Having <br/>\nchildren at a confernece is a whole other ball game, a different set of <br/>\nconcerns and dynamics, not with the children even but with facilities. It may be <br/>\nthat there are just one or two moms who are just starting out with this <br/>\nconference and this might be their first time.<br/>\n<br/>\nAlso if the conference doesn&#39;t fit your needs you can organize something <br/>\nyourself in your area, it doesn&#39;t even have to have speakers like a confernece, <br/>\nbut could be as simple as unschoolers getting together to talk about different <br/>\nissues, in a more casual setting. There are many ways to get different <br/>\nneeds met. <br/>\n<br/>\nI applaud anyone who wants to take on something like that. It is difficult, <br/>\nmaybe in the future as the confernece grows children will be considered more <br/>\nin the equation. Maybe with more volunteers that might be possible. It is <br/>\nso wonderful to see more conferences and gatherings and get togethers for <br/>\nunschoolers popping up all over. I know for me it was so wonderful to step foot <br/>\ninto that first unschooling conference Kelly put on in SC. To not feel <br/>\nalone. And if this is filling a need somewhere... more power to her/them/him. <br/>\nWrite, e mail, call, volunteer... .get involved in the process. <br/>\n<br/>\nJust a couple thoughts,<br/>\nPam G<br/>\n<br/>\n<br/>\n<br/>\n************ ********* ********* ********See AOL&#39;s top rated recipes <br/>\n(http://food. aol.com/top- rated-recipes? NCID=aoltop00030 000000004)<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78134331,"authorName":"Genant2@aol.com","from":"Genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] The Unschooling Confernece","postDate":"1198853850","msgId":28657,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM3NS4yMmFiZDM4Yi4zNGE2NjhkYUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":28661,"prevInTime":28656,"nextInTime":28658,"topicId":28657,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/28/2007 8:52:37 AM Eastern Standard Time, unschoolingbasics@yahoogroups.com writes: But  what happens is that not allowing children makes","messageBody":"<div id=\"ygrps-yiv-897759816\">In a message dated 12/28/2007 8:52:37 AM Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> writes:<br/>\n<br/>\nBut  what happens is that not allowing children makes it impossible for <br/>\nsomeone  like me ( coming 4 hours from Minnesota) to do come to the Conference.<br/>\nI am  lookomng for connecting with  unschoolers.&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\nJust another perspective maybe, and maybe I am stepping into the fire  <br/>\nbut,....I just want to mention how difficult, time consuming and much work  putting <br/>\non a conference of any type is.  I have been there myself several  times.  And <br/>\nwhile I can totally understand not wanting to be separated from  your <br/>\nchildren, it is very difficult to meet everyone&#39;s needs.  Also I have  nothing to do <br/>\nwith this conference, but I can say how discouraging it is to read  negative <br/>\nstatements like that.  A more productive path might be to write  the conference <br/>\ncoordinators in person.  Maybe ask if there is any way you  could help out so <br/>\nthat it might be possible to even have just one room or area  with toddler <br/>\ntoys.  Reading negative statements about &quot;your baby&quot; is so  discouraging and <br/>\nmakes you wonder if maybe it isn&#39;t worth it, all the time and  energy.  Having <br/>\nchildren at a confernece is a whole other ball game, a  different set of <br/>\nconcerns and dynamics, not with the children even but with  facilities.  It may be <br/>\nthat there are just one or two moms who are just  starting out with this <br/>\nconference and this might be their first time.<br/>\n <br/>\nAlso if the conference doesn&#39;t fit your needs you can organize something  <br/>\nyourself in your area, it doesn&#39;t even have to have speakers like a confernece,  <br/>\nbut could be as simple as unschoolers getting together to talk about different <br/>\n issues, in a more casual setting.  There are many ways to get  different <br/>\nneeds met.  <br/>\n <br/>\nI applaud anyone who wants to take on something like that.  It is  difficult, <br/>\nmaybe in the future as the confernece grows children will be  considered more <br/>\nin the equation.  Maybe with more volunteers that might be  possible.  It is <br/>\nso wonderful to see more conferences and gatherings and  get togethers for <br/>\nunschoolers popping up all over.  I know for me it was so  wonderful to step foot <br/>\ninto that first unschooling conference Kelly put on in  SC.  To not feel <br/>\nalone.  And if this is filling a need  somewhere...more power to her/them/him.  <br/>\nWrite, e mail, call,  volunteer....get involved in the process.  <br/>\n <br/>\nJust a couple thoughts,<br/>\nPam G<br/>\n <br/>\n <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n**************************************See AOL&#39;s top rated recipes <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://food.aol.com/top-rated-recipes?NCID=aoltop00030000000004)\">http://food.aol.com/top-rated-recipes?NCID=aoltop00030000000004)</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":28649,"nextTopicId":28660}}