{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":150527288,"authorName":"Ren","from":"&quot;Ren&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Not responsible for others feelings","postDate":"1089589401","msgId":1844,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNzExLjE2NDMzMC4yNDIyLjI2NTE0MEB3ZWJtYWlsMTAubnljLnVudGQuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":1843,"nextInTime":1845,"topicId":1844,"numMessagesInTopic":0,"msgSnippet":" It does not shock me though, many here have said something to the effect of kicking out a single mother and her 4 year old son with no place to go regardless","messageBody":"<div id=\"ygrps-yiv-611923847\">&quot; It does not shock me though, many here have said something to the <br/>\neffect of kicking out a single mother and her 4 year old son with no <br/>\nplace to go regardless of the situation because it is negativly <br/>\neffecting my childs emotions.&quot;<br/>\n<br/>\nFor someone that has admitted to some very unhealthy dynamics and a lot of stress in the home, you&#39;re being pretty quick to judge the advice that&#39;s been given.<br/>\nIf you come to the list with a long list of unhappy problems, and we point out some ways you could reduce that load, you  might want to at least consider where the advice is coming from.<br/>\n<br/>\nYou&#39;re talking to folks that HAVE found a happy balance, that have very respectful, happy kids that AREN&#39;T being selfish. You&#39;re talking to people that don&#39;t have problems setting boundaries and keeping their family safe, yes, even from single parents that need help.<br/>\nDo  you want to ask why? Why are these families that advocate freedom, raising up such incredibly kind, empathetic, helpful individuals?<br/>\nHow can their advice help others do the same?<br/>\n<br/>\nYou&#39;ve described a woman in your home that is using you, wrecking havoc with you and your family&#39;s emotions, yet you&#39;re upset because we&#39;re telling you your family is MORE important than her? Ok.<br/>\nThere are ways to try and help folks, without endangering the health of your own child and family. That is unacceptable to me. The things she&#39;s done to you and your family would be unacceptable in our home. I love myself too much to let someone hurt me, or anyone I love that way.<br/>\n<br/>\nAs far as being responsible for other people&#39;s feelings....<br/>\nWhat is being advocated, is treating people with utmost respect and kindness, creating in your home EVERY possibility for happiness and joy, that is the part you CAN control.<br/>\nWe are responsible to control that which we CAN. So we do.<br/>\nThe part we CAN NOT control, is how other people feel. You and I are not responsible for other people&#39;s feelings, we ARE however, responsible to try and create the best possible atmosphere for a happy outcome.<br/>\nCan you not see the difference?<br/>\n<br/>\nYour poor child feels responsible for making Daddy angry. That was HIS choice, she&#39;s just being a four year old. In my book, HE should be the one making her a nice apology card for overreacting and treating her like she&#39;s stupid when she made a mistake. He is the adult, being angry as a choice when it was no big deal. She is a FOUR year old for crying out loud, why should SHE be the one trying to fix things?<br/>\n<br/>\nIf you want an environment that best supports a happy, calm, joyful family...you might want to at least sift throught advice from folks that have exactly that...rather than dismiss it in such a disdainful manner.<br/>\n<br/>\nRen<br/>\n<br/>\nLearn about unschooling at:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a></div>","specialLinks":[]}],"prevTopicId":1653,"nextTopicId":1863}}