{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] What is &quot;well rounded&quot; anyway?","postDate":"1107470239","msgId":4848,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDAwODYwMWM1MGEwNyQ4MTU3ZjA0MCQ5NTVmMTY0M0BhZ3N0bWUuYWRlbHBoaWEubmV0Pg=="},"prevInTopic":4843,"nextInTopic":0,"prevInTime":4847,"nextInTime":4849,"topicId":4837,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1444627066\">&lt;&lt;&lt;&lt;&lt;&lt; Specifically, how would you veteran unschoolers handle a child who,<br/>\nwhen given total freedom to direct their own learning, will choose to plop<br/>\ndown in front of the television set or their Gameboy every day, rather than<br/>\ngo outdoors to inspect nature, or read a book, or do a baking or science<br/>\nproject, or do any physical activity, etc.? &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nI&#39;d assume that&#39;s what the child wanted and needed that day. <br/>\n<br/>\nI&#39;d not hassle them with expressed judgments (even if I felt any) about<br/>\nother activities being better, which will only enhance the child&#39;s desire<br/>\nfor the tv and gameboys, and could make the child feel bad about liking<br/>\nthese things. Although I do, as others have suggested, look around at what<br/>\nelse is going on and try to keep plenty of other stuff available.<br/>\n<br/>\nIs the kid still deschooling? I ask this because you use the possibly<br/>\nschooly phrase &quot;science project&quot;. Last week Jayn (5) and I created a bunch<br/>\nof different herbal decoctions. She had been experimenting with mixing<br/>\ndifferent spices and herbs in flour to &quot;make pies&quot;, and we both got<br/>\ninterested in the aromas. I suggested making some perfume using some alcohol<br/>\nand then Jayn wanted to keep making more and more. So it kinda turned into a<br/>\nbig project of putting various combinations - all her devising - into<br/>\ndifferent liquids. Now we have some amazing flavored honey, fragrant dish<br/>\nsoap, strongly flavored vinegar, alcohol rub, and aromatic massage oil.<br/>\nWater just went icky - as I warned Jayn that it probably would. <br/>\n<br/>\nNone of this was in the nature of a &quot;school project&quot; or with the idea that<br/>\nshe &quot;should&quot; learn some science (how could she not?), but just because it<br/>\nwas fun, and because initially *I* got excited about the lovely fragrance<br/>\nshe was creating with her mixtures and wanted to preserve it somehow.<br/>\n<br/>\nJayn watches a varying amount of tv or dvd&#39;s every day. Usually she watches<br/>\nin conjunction with playing other games. She also uses tv as a segue into<br/>\nher day in the morning, and late at night when I am just too pooped to play<br/>\non. She doesn&#39;t seem to care for Gameboy - I think she prefers better<br/>\ngraphics than that tiny screen can render. She plays various computer games,<br/>\nand will request dh or I to play particular X-box games for her, while she<br/>\nwatches avidly and comments and makes suggestions. I usually watch her shows<br/>\nwith her or nearby, especially attentive if they are new to me.<br/>\n<br/>\nOTOH at this moment she is in the bedroom watching a dvd alone. It will only<br/>\nbe a few more minutes before she calls to me to join her I&#39;m sure. Today my<br/>\nplans include cleaning out the fridge and general tidying. Jayn wants to hit<br/>\nthe park later on, and invite our neighbor to play for a while. I expect<br/>\nthere will be plenty of tv/dvd in the background, and some reading later on.<br/>\nI have taken to reading to Jayn while she is in her tub, if she wants me to.<br/>\nNow how to get a tv into the bathroom......;)<br/>\n<br/>\n&lt;&lt;&lt;&lt;I realize television can be educational, but what if that was all the<br/>\nchild ever wanted to do?  OK, I can see an obvious answer - get rid of the<br/>\ntelevision!&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nI CAN see that you are joking, however this is often (not here but in other<br/>\nplaces) put forward as a serious and genuine answer. In case anyone gets the<br/>\nidea that this is a good idea, I would discourage anyone to do this in this<br/>\nsituation, because I feel very strongly that the child could not help but<br/>\nsee it as punitive. What next? The Gameboy goes if it is played &quot;too much&quot;?<br/>\nPerhaps the child would immediately learn the usefulness of subterfuge and a<br/>\nneed to keep their interests hidden from Mom in case that was the next thing<br/>\nremoved. <br/>\n<br/>\n&lt;&lt;&lt;&lt; LOL, but seriously, even if there is no TV in your home, how would you<br/>\nhandle a child who is lazy about anything to do with education, such as<br/>\nwriting or reading something now and then, etc.? &gt;&gt;&gt;&gt;<br/>\n<br/>\nI try not to use this kind of damning negative language about my child -<br/>\neven in my own mind. I don&#39;t try to handle *her*, but only my own reactions<br/>\nand language. It gets easier, or at least I have found it so, the more I<br/>\npractice acceptance of where she is at. There it is really - a conscious<br/>\nchoice to a practice acceptance and use positive (or neutral) words.<br/>\n<br/>\nWhile ever you keep dividing real life into sanctioned educational and<br/>\n&quot;other than&quot;, you will find it tough to get to Unschooling. While ever you<br/>\nkeep the idea that &quot;laziness&quot;, rather than say &quot;lack of interest at the<br/>\nmoment&quot; or &quot;prefers other activities&quot;, as your expressed view of your child<br/>\nyou will find it harder to get to Unschooling with joy.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nThe concern expressed was basically &quot;if I don&#39;t force my kids<br/>\nto learn certain things, they will not be &#39;well rounded&#39;&quot; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n---<br/>\nIncoming mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.852 / Virus Database: 580 - Release Date: 1/31/2005<br/>\n <br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.852 / Virus Database: 580 - Release Date: 1/31/2005</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] What is &quot;well rounded&quot; anyway?","postDate":"1107448000","msgId":4843,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJFMjdCQUYwLjMwQ0U0JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwODYwMWM1MGEwNyQ4MTU3ZjA0MCQ5NTVmMTY0M0BhZ3N0bWUuYWRlbHBoaWEubmV0Pg=="},"prevInTopic":4840,"nextInTopic":4848,"prevInTime":4842,"nextInTime":4844,"topicId":4837,"numMessagesInTopic":0,"msgSnippet":"... How old is he? And how long has every day been going on? How would you handle a child who spent all day outdoors and never read a book? How would you","messageBody":"<div id=\"ygrps-yiv-1861366971\">on 2/3/05 10:46 AM, Debbie at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:onehundredacrewood@...\">onehundredacrewood@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Specifically, how would you veteran unschoolers handle a child who, when given<br/>\n&gt; total freedom to direct their own learning, will choose to plop down in front<br/>\n&gt; of the television set or their Gameboy every day, rather than go outdoors to<br/>\n&gt; inspect nature, or read a book, or do a baking or science project, or do any<br/>\n&gt; physical activity, etc.?<br/>\n<br/>\n </span></blockquote>How old is he? And how long has &quot;every day&quot; been going on?<br/>\n<br/>\nHow would you handle a child who spent all day outdoors and never read a<br/>\nbook?<br/>\n<br/>\nHow would you handle a child who spent all day reading and never watched TV?<br/>\n<br/>\nThose sound like ridiculous questions but you can help yourself see real<br/>\nlearning by first seeing that TV and GameBoy and nature and books are all<br/>\nlegitimate ways of exploring the world.<br/>\n<br/>\nAnd then second get involved with your child. Find out what he loves about<br/>\nwhat he&#39;s doing.<br/>\n<br/>\nAnd make sure he&#39;s happy. Is he choosing TV and GameBoy because the other<br/>\noptions aren&#39;t as engaging *to him*? Is there something else in his life and<br/>\nTV and GameBoya are an escape. Taking away the TV and GameBoy doesn&#39;t solve<br/>\nwhy it&#39;s happening. That will still be there. (And add stress to both your<br/>\nlives on top of it.)<br/>\n<br/>\nAnd then make sure he has opportunities that *he* likes just as well as TV<br/>\nand GameBoy available regularly. It&#39;s your responsiblity to strew<br/>\nopportunites not your responsibility to make him try them! ;-) But if your<br/>\nstrewing is falling flat it might be that you&#39;re too focused on things that<br/>\nare &quot;good for him&quot; and not as atuned to what he loves as you could be. Or it<br/>\ncould be that he&#39;s going through a period of needed to do exactly what he&#39;s<br/>\ndoing.<br/>\n<br/>\nIf you focus on the negative of getting him to stop doing what he&#39;s doing,<br/>\nhe&#39;ll sense that and cling to it because it will feel like it&#39;s on the verge<br/>\nof becoming limited or forbidden and he&#39;ll need to get as much as possible.<br/>\n<br/>\nIf you focus on the positive of strewing his life with things he enjoys, the<br/>\ncalmer he&#39;ll be about leaving the TV and GameBoy.<br/>\n<br/>\nGaming magazines? Game reviews (and perhaps writing them) at Amazon?<br/>\nConventions? Selling old games on eBay? Trivia games on the internet?<br/>\nChecklists and episode descriptions of his favorite TV shows.<br/>\n<br/>\nOne thing that helped my daughter was getting TiVo. I think it&#39;s easy to<br/>\nfeel a slave to the programming schedule. Kids can feel like they have to be<br/>\nthere to watch or they&#39;ll miss something. TiVo can record favorite shows on<br/>\nits hard drive automatically (you just key in the name of the show and get a<br/>\n&quot;Season Pass&quot; to it -- you don&#39;t need to know when it&#39;s on or what channel).<br/>\n(The hard drives hold 30-100 or so hours of programs but you can transfer<br/>\nthem to video tape if he likes watching the same episodes again.) That way<br/>\nthe shows can be available whenever a child feels like watching rather than<br/>\nonly when the programmers decide to put it on.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":177160750,"authorName":"Debbie","from":"&quot;Debbie&quot; &lt;onehundredacrewood@...&gt;","profile":"homeschoolpanda","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] What is &quot;well rounded&quot; anyway?","postDate":"1107445579","msgId":4840,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwODYwMWM1MGEwNyQ4MTU3ZjA0MCQ5NTVmMTY0M0BhZ3N0bWUuYWRlbHBoaWEubmV0Pg==","referencesHeader":"PE5IQkJLT1BDS0xHR0NQQUlOREpET0VNR0dMQUEuYWJtb3JyaXMyM0Bjb21jYXN0Lm5ldD4="},"prevInTopic":4837,"nextInTopic":4843,"prevInTime":4839,"nextInTime":4841,"topicId":4837,"numMessagesInTopic":0,"msgSnippet":"I have been wondering something along these lines too. Specifically, how would you veteran unschoolers handle a child who, when given total freedom to direct","messageBody":"<div id=\"ygrps-yiv-1670488340\">I have been wondering something along these lines too.<br/>\nSpecifically, how would you veteran unschoolers handle a child who, when given total freedom to direct their own learning, will choose to plop down in front of the television set or their Gameboy every day, rather than go outdoors to inspect nature, or read a book, or do a baking or science project, or do any physical activity, etc.?   I realize television can be educational, but what if that was all the child ever wanted to do?  OK, I can see an obvious answer - get rid of the television! LOL, but seriously, even if there is no TV in your home, how would you handle a child who is lazy about anything to do with education, such as writing or reading something now and then, etc.? <br/>\nDebbie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nThe concern expressed was basically &quot;if I don&#39;t force my kids<br/>\nto learn certain things, they will not be &#39;well rounded&#39;&quot; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":119145590,"authorName":"April M","from":"&quot;April M&quot; &lt;abmorris23@...&gt;","profile":"klkb624","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"What is &quot;well rounded&quot; anyway?","postDate":"1107368225","msgId":4837,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5IQkJLT1BDS0xHR0NQQUlOREpET0VNR0dMQUEuYWJtb3JyaXMyM0Bjb21jYXN0Lm5ldD4="},"prevInTopic":0,"nextInTopic":4840,"prevInTime":4836,"nextInTime":4838,"topicId":4837,"numMessagesInTopic":0,"msgSnippet":"This is interesting that this has come up. I recently was part of an on-line conversation on a non-unschooling homeschool list about unschooling. It was ","messageBody":"<div id=\"ygrps-yiv-157430885\">This is interesting that this has come up. I recently was part of an on-line<br/>\nconversation on a non-unschooling homeschool list about unschooling. It was<br/>\nbrought up because of an article I was part of in the local paper about<br/>\nunschooling. The conversation was very respectful which isn&#39;t always the<br/>\ncase on non-unschooling lists...anyway, being &quot;well rounded&quot; was brought up<br/>\nand discussed. It&#39;s the first time I&#39;ve run into that concern in regards to<br/>\nunschooling.  The concern expressed was basically &quot;if I don&#39;t force my kids<br/>\nto learn certain things, they will not be &#39;well rounded&#39;&quot; We discussed the<br/>\ndefinition of &#39;well rounded&#39; which of course, had different meanings to<br/>\ndifferent people so defining our meanings cleared up a lot. It seems to me<br/>\nthat in this day and age it is impossible to know &#39;a little about<br/>\neverything&#39; (one of the definitions that was used) and being exposed to<br/>\ndifferent things, places, people, etc is going to be limited to some degree<br/>\nby one&#39;s income, location, interests, etc. regardless of how one is<br/>\neducated. I&#39;m not particularly worried about my kids being &#39;well rounded&#39;.<br/>\nMy kids have areas of interest they pursue...but because of friends, my own<br/>\ninterests, activities they&#39;re involved in, they become exposed to things<br/>\nthey wouldn&#39;t on their own.  They are more &#39;well rounded&#39; than some, less<br/>\nthan others....but what seems right for us at this time.  So though I&#39;m not<br/>\nworried about it, I find it an interesting topic of conversation and<br/>\nthought. <br/>\n<br/>\n~April<br/>\nMom to Kate-18, Lisa-15, Karl-13, & Ben-9. <br/>\n*REACH Homeschool Group, an inclusive group meeting throughout Oakland<br/>\nCounty.. <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.homeschoolingonashoestring.com/REACH_home.html\">http://www.homeschoolingonashoestring.com/REACH_home.html</a><br/>\n*Michigan Youth Theater...Acting On Our Dreams...<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.michiganyouththeater.org/\">http://www.michiganyouththeater.org/</a>&gt;<br/>\n&quot;What one knows is, in youth, of little moment; they know enough who know<br/>\nhow to learn.&quot;<br/>\nHenry Brooks Adams (1838-1918)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":4846,"nextTopicId":4839}}