{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Going to school","postDate":"1373076388","msgId":49844,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtyN3UzNCs5Y2ViQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtyMzJ2dSsxMGZrMkBlR3JvdXBzLmNvbT4="},"prevInTopic":49841,"nextInTopic":0,"prevInTime":49843,"nextInTime":49845,"topicId":49840,"numMessagesInTopic":0,"msgSnippet":"Santhy, What are the negative aspects of her being in a preschool, if it s her choice to attend? I would have asked some of the same questions Meredith asked,","messageBody":"<div id=\"ygrps-yiv-1452101565\">Santhy,<br/>\n<br/>\nWhat are the negative aspects of her being in a preschool, if it&#39;s her choice to attend?<br/>\n<br/>\nI would have asked some of the same questions Meredith asked, about cost, and whether it will be difficult or too expensive to withdraw her from the school once she has started.<br/>\n<br/>\nA lot of kids actually love preschool. And some kids actually ARE ready to learn to read and write at age three. (I learned to read at age three.) If your daughter is anything like my son was at that age, she may crave the companionship of a large group of age-peers. If she has the option of choosing to leave school and go back to being at home, just knowing that it&#39;s her choice may make her feel comfortable choosing to stay in preschool, for this year, at least. Would that be a bad thing, for her or your family?<br/>\n<br/>\nIn the U.S. nowadays, preschool is still mostly about games, art/crafts, music, and socializing, with some introduction to letters, whole words, numbers, and science, but not in a stressful way, in most preschools. School becomes more stressful and unpleasant for Kindergarten children (age 5). In K, the kids start getting homework and tests, and being expected to sit still and pay attention for too long, and to develop skills (such as reading and writing) that many 5-year-olds are simply not ready for. But there are always a few for whom that environment is not unpleasant or stressful.<br/>\n<br/>\nIf it were my decision, and if it were affordable, I would enroll my child in preschool, if she really wanted to attend, after visiting, as long as I had the option to withdraw her from school if it started to affect her badly.<br/>\n<br/>\nI suspect that most kids start hating school in Kindergarten, now that K is what 1st grade used to be (but worse - 1st grade wasn&#39;t stressful when I was a kid, and we didn&#39;t get homework in 1st OR 2nd grade! And we had a LOT more recess time, back then.)<br/>\n<br/>\nI don&#39;t suppose the preschool near you has a two or three day per week option, do they? (I used to teach in a preschool that had a 3-day option for 2 and 3 year olds. But that was about 16 years ago.)<br/>\n<br/>\nAre there any Democratic/Sudbury type schools in your area? If you are unfamiliar with Sudbury schools, they are schools that allow the kids (ages 4-18) complete freedom to choose their activities, learn what and when they want, and freely mix/socialize with the other students, regardless of age. The students run the schools, set policy/establish rules, set the budget, etc, through Democratically run school meetings, and pursue their own goals, with the help of the adult staff. It is basically an &quot;unschooling school&quot;. (Obviously the older kids and teens participate most in the managing of the schools, but the little kids are free to be as involved in the process as they want to be.)<br/>\nSee sudval.org, for more information.<br/>\nI mention the Sudbury schools because, if your daughter likes the social aspect of school, but wants the freedom of unschooling, when she&#39;s a little older, and IF there&#39;s a similar sort of school in your area, that may turn out to be a good compromise for your family between unschooling and the mainstream school system. There was a family from India at the Sudbury school in my city, and the mom spoke about a Democratic &quot;Ashram&quot; school that was founded by Ghandi, that she had been involved with, and mentioned other Democratic schools in India, but I don&#39;t know what part of India her family was from.<br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Going to school","postDate":"1372982695","msgId":49841,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtyNTJqNys5MTU2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtyMzJ2dSsxMGZrMkBlR3JvdXBzLmNvbT4="},"prevInTopic":49840,"nextInTopic":49844,"prevInTime":49840,"nextInTime":49842,"topicId":49840,"numMessagesInTopic":0,"msgSnippet":"... ************* If she s having a good time and wants to go, I wouldn t dissuade her. She s trying something new - that s not a bad thing, and it s normal","messageBody":"<div id=\"ygrps-yiv-504647257\">&quot;Santhy&quot; &lt;suprisha@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Should I continue to send her to daycare, should I try to dissuade her from going?<br/>\n </span></blockquote>*************<br/>\n<br/>\nIf she&#39;s having a good time and wants to go, I wouldn&#39;t dissuade her. She&#39;s trying something new - that&#39;s not a bad thing, and it&#39;s normal for a young child who has &quot;mastered&quot; her home environment and feels ready to start exploring a larger world. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;m also wondering if it&#39;s because she didn&#39;t have enough exciting things at home that she wanted to go.<br/>\n </span></blockquote>***********<br/>\n<br/>\nIt wouldn&#39;t hurt to look at what she enjoys doing at daycare and see if there are ways for her to do similar sorts of things at home - see the experience as a chance for you to gather up some ideas and build some resources. You won&#39;t be able to provide everything in the whole wide world... but school can&#39;t do that either.  <br/>\n<br/>\nAt the same time, don&#39;t beat yourself up! She&#39;s having an adventure. Adventures aren&#39;t always something parents can provide - sometimes we can, but sometimes a big part of the excitement is doing something Without mom. That&#39;s not a criticism of you - your kid feel safe going away, knowing Mom will be there when she gets back. (It&#39;s also not a criticism if a child would rather be home! Different kids have different personalities and are ready for different things at different times.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If I  enroll her in the preschool they&#39;ll start off with reading and writing, and I  don&#39;t want that. But some selfish part of me says maybe then she won&#39;t want to go, as it won&#39;t be as &#39;no pressure&#39; as daycare.<br/>\n </span></blockquote>************<br/>\n<br/>\nPlay it by ear for now. If she&#39;s enjoying daycare, leave her in daycare - that may be enough &quot;school&quot; for her! If she wants to try preschool, check out your options and find out what you lose if you withdraw her - I don&#39;t know what preschools are like in India, do you lose a whole year&#39;s tuition? There are preschools like that in the US, so that can be a concern - are you likely to pressure her to stay in school if you&#39;ve paid a bunch of money and can&#39;t get it back? Sometimes money can mess up your decision-making like that, so be sure you&#39;re not setting yourself up to turn into an ogre!<br/>\n<br/>\nAre there other classes she can take? Art classes? Dance classes? Sometimes kids are happy having just one class. Sometimes they want to be able to say &quot;my teacher&quot; or &quot;I learned in class/school&quot; just like all the other kids, or to answer the kinds of questions adults ask like &quot;what are you learning in school?&quot;. It&#39;s natural to want to fit in, and it may be possible to give her Enough of school so she feels like she fits in without the whole rigmarole of actual school. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":272992574,"authorName":"Santhy","from":"&quot;Santhy&quot; &lt;suprisha@...&gt;","profile":"suprisha","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Going to school","postDate":"1372917566","msgId":49840,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtyMzJ2dSsxMGZrMkBlR3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":49841,"prevInTime":49839,"nextInTime":49841,"topicId":49840,"numMessagesInTopic":0,"msgSnippet":"My three year old  has been asking to go to school for a while now. Here in India most kids are in school by 2.5 or 3 yrs, so she sees all her neighbourhood","messageBody":"<div id=\"ygrps-yiv-1126032970\">My three year old  has been asking to go to school for a while now. Here in India most kids are in school by 2.5 or 3 yrs, so she sees all her neighbourhood friends go every day. We got her a bag and pencil box and stuff and she would play going to school, but she still asked to go. Her older sister tried to dissuade her (she had gone for a few years before we discovered unschooling), but she wouldn&#39;t let up. So we thought we&#39;d take her to the preschool nearby which has a day care attached, and see how she likes it. She&#39;s always been very shy with strangers and we figured there&#39;s no way she would agree to separate from me. And we thought once she sees that, unlike what she thought, her mother and sister won&#39;t be with her in school, she would refuse to be dropped off. Well, we took her today and to our shock she held that preschool lady&#39;s hand and walked off, like she&#39;d been doing it everyday. I told the lady to keep her in daycare and to call me if she seems unhappy in any way. I was expecting a call immediately, but that was an hour back, and she just called to say she&#39;s happy and playing with some toys, don&#39;t worry. We are stunned, to say the least. I admit I hadn&#39;t thought this through and now I&#39;m wondering if I did the right thing. I&#39;m also wondering if it&#39;s because she didn&#39;t have enough exciting things at home that she wanted to go. I feel so confused and upset right now. If I  enroll her in the preschool they&#39;ll start off with reading and writing, and I  don&#39;t want that. But some selfish part of me says maybe then she won&#39;t want to go, as it won&#39;t be as &#39;no pressure&#39; as daycare. Also, all the kids her age are in preschool there, not daycare. Should I continue to send her to daycare, should I try to dissuade her from going? Any insight will be appreciated. <br/>\n<br/>\nSanthy</div>","specialLinks":[]}],"prevTopicId":49807,"nextTopicId":49838}}