{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"newbie with of course questions","postDate":"1134486498","msgId":8293,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRubW81MitqaDFqQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":8292,"nextInTime":8294,"topicId":8293,"numMessagesInTopic":0,"msgSnippet":"Oh, and Kelly would say go to the Live and Learn Conference next year . :) In the meantime, pick up some of those great CD s.  They re priced very fairly","messageBody":"<div id=\"ygrps-yiv-1202323762\">&quot;Oh, and Kelly would say &quot;go to the Live and Learn Conference next <br/>\nyear&quot;. :)&quot;<br/>\n<br/>\nIn the meantime, pick up some of those great CD&#39;s.  They&#39;re priced <br/>\nvery fairly ($10-15), and an MP3 of the entire conference can be had <br/>\nfor just $75, a virtual STEAL!!  You can listen to encouragement any <br/>\ntime of day, over and over if needed.:)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org/resources.html\">http://liveandlearnconference.org/resources.html</a><br/>\n <br/>\n<br/>\nHere&#39;s a full listing of the CD&#39;s available:<br/>\n<br/>\n---------------------------------------------------------------------<br/>\n-----------<br/>\n2005 Conference CDs <br/>\n&quot;Oh the Places I&#39;ve Been!&quot; - Roya Sorooshian $10 <br/>\nAn up close and personal talk about Roya&#39;s experiences as a &quot;growing-<br/>\nup&quot; unschooler. <br/>\n<br/>\n&quot;Mother and Daughter: Our Unschooled Life Together&quot; - Pam Sorooshian <br/>\nand Roya Sorooshian (Double CD set) $15 <br/>\nMother and daughter &quot;compare notes&quot; on what it was like growing up <br/>\nunschooled. What did mom think she was doing? How did daughter <br/>\nexperience it? What do they wish had been different? What was the <br/>\nbest part? <br/>\n<br/>\nAnne Ohman - In Search of Riverglass & So that ALL Children May <br/>\nShine <br/>\n(2 in 1 CD) $15 <br/>\n<br/>\n&quot;In Search of Riverglass...Finding Unschooling&quot; - Anne Ohman<br/>\nAn unschooling essay from the place where my mind is free to think <br/>\nits best thoughts ~ our simple cabin on the beautiful upper Delaware <br/>\nRiver. <br/>\n<br/>\n&quot;Unschooling: So that ALL Children May Shine!&quot; - Anne and Jake Ohman <br/>\n$10 <br/>\nJoin Anne and her always unschooled son, Jake (15) as they talk <br/>\nabout their journey to unschooling and how they believe that <br/>\nunschooling allows all non-typical (as well as more typical! ;-) <br/>\nchildren (Highly Sensitive, Out of Sync) to Shine by Honoring and <br/>\nCelebrating Who They Are. These are the sensitive spirits who would <br/>\nbe quickly destroyed in a schooled environment, and who would most <br/>\nlikely be labeled and sent on a path of being *fixed*. When we talk <br/>\nabout *Shining* with unschooling, we are talking about the gift that <br/>\nthis glorious unschooling path offers to our children...the gift of <br/>\nbeing able to follow their own hearts, their own passions and share <br/>\ntheir gifts with the world. This is how all children should Shine. <br/>\n<br/>\n&quot;This is where unschooling lives...&quot; - Anne Ohman $10 <br/>\nJoin Anne for a day in the life of her unschooling family and all <br/>\nthe connections that just one, simple day can bring, as well as <br/>\nfurther thoughts about how her family came to live in this space <br/>\n(and how you can, too!) where infinite possibilities exist...this <br/>\nglorious place called unschooling. <br/>\n<br/>\n&quot;Unschooling a Tribe&quot; - Ren Allen $10 <br/>\nHow do age differences among children play into unschooling? How do <br/>\nparents effectively meet the needs of several ages in one family? <br/>\nWe&#39;ll explore the unique challenge that face larger families and <br/>\ndifferent ways unschooling parents have met these challenges. <br/>\n<br/>\n&quot;Mindful Parenting&quot; - Ren Allen with Sandra Dodd $10 <br/>\nHow does parenting style and choice affect unschooling? Why does <br/>\nmindful parenting play such an important role in the way unschooling <br/>\ndevelops? Sandra and Ren came to unschooling and mindful parenting <br/>\nalong different paths, but now find the same philosophies to be of <br/>\nultimate importance. <br/>\nSaying &quot;yes&quot; more often, respecting children&#39;s choices and letting <br/>\ngo of arbitrary rules will be discussed, and how they affect the way <br/>\nlearning unfolds. <br/>\n<br/>\n&quot;Unforeseen Benefits of Unschooling&quot; - Sandra Dodd $10 <br/>\nWhen my oldest was five, I could see the potential of unschooling. I <br/>\nknew unschooling families and was familiar with alternative <br/>\neducation. I had no doubt things would work out well. There were <br/>\nunexpected outcomes, though, and they continue to arise. <br/>\n<br/>\n&quot;Connections&quot; - Sandra Dodd $10 <br/>\nWhere does learning happen, and how? Unschooling can provide time, <br/>\nspace and opportunity for wonderful things to unfold. <br/>\n<br/>\n&quot;The Early Years&quot; - Robyn Coburn $10<br/>\nOnce you take out any academic pressures with these younger-than-<br/>\nschool-age folk what is left is the Radical or whole life part of <br/>\nRU  I will talk about how I have found that &quot;to trust&quot; is an action <br/>\nas well as an emotion and how Trust is the foundation of parenting <br/>\ninto a life of Unschooling with Joy. <br/>\n<br/>\n&quot;Whole Life Unschooling &quot; - Danielle Conger $10 <br/>\nWhy do some AP parents lose trust that children will learn all they <br/>\nneed about the world in their own way and own time when given <br/>\nfreedom and opportunity to explore? What is it that changes in <br/>\nparents (because the children don&#39;t change) that we stop trusting <br/>\nour children and reveling in the wonder and awe we felt as they took <br/>\ntheir first steps? As AP parents, we rejected the experts who tell <br/>\nus to train our babies: what makes us reluctant to reject the <br/>\nexperts that tell us to train our children? <br/>\n<br/>\nBy exploring the connections between Attachment Parenting and Whole <br/>\nLife Unschooling, we&#39;ll discover how to continue living joyfully <br/>\nwith our children in amazement and wonder by giving them the freedom <br/>\nand trust to continue learning about the world around them as they <br/>\nhave *always done*. We&#39;ll look at the ways in which Whole Life <br/>\nUnschooling can be a simple continuation of the ideals and <br/>\nprinciples of AP and how parents of young children can hold onto <br/>\nthat amazement, wonder and trust as they begin their journey into <br/>\nWhole Life Unschooling. <br/>\n<br/>\n&quot;Out of School and Into the Real World&quot; & &quot;How Music Breaks the <br/>\nRules&quot; - Kelly & Ben Lovejoy (2 in 1 CD) $15 <br/>\n<br/>\n&quot;Out of School and Into the Real World&quot; - Kelly Lovejoy $10<br/>\nMany unschooling families start from the beginning---family bed, <br/>\nextended nursing, no bedtimes, no school... But what if you don&#39;t <br/>\neven learn about unschooling until after the damage of school has <br/>\nbeen done? <br/>\n<br/>\nKelly will talk about how she and her husband started unschooling <br/>\nafter eight years of pushing their son in private school. She&#39;ll <br/>\ndescribe the difficult deschooling and the eventual blossoming of <br/>\ntheir son into a radical unschooler. <br/>\n<br/>\n&quot;How Music Breaks the Rules&quot; - Ben Lovejoy $10<br/>\nI hope to show how the music from my lifetime has transcended time <br/>\nand found its way into my sons&#39; lives and the connections that have <br/>\nformed as a result. I will also explore how those connections have <br/>\ncome full circle, and I have connected with their music as well. <br/>\n<br/>\n&quot;Traits for Success&quot; - Wes Beach $10<br/>\nI&#39;ve watched many hundreds of teens move on successfully to college, <br/>\nemployment, and many other endeavors with little or no academic <br/>\npreparation, traditional or otherwise, at the high school  level.  I <br/>\nhave come to believe that it&#39;s not academic preparation that&#39;s <br/>\nfoundational; what matters are personal traits.  I&#39;ll discuss these <br/>\ntraits in general and in the lives of students I&#39;ve worked with. <br/>\n<br/>\n<br/>\n---------------------------------------------------------------------<br/>\n-----------</div>","specialLinks":[]}],"prevTopicId":8285,"nextTopicId":8238}}