{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":14,"messages":[{"userId":326327257,"authorName":"Amy","from":"&quot;Amy&quot; &lt;amyj@...&gt;","profile":"amyjohnson392","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: new members from oklahoma","postDate":"1197947821","msgId":28581,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZrN2UzZCsyN2E5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDVFN0UxQjY0LThEMEItNEE5Qi1CNjJGLUE3NDVGRDdDQ0E0QkBjb3gubmV0Pg=="},"prevInTopic":28571,"nextInTopic":0,"prevInTime":28580,"nextInTime":28582,"topicId":28485,"numMessagesInTopic":0,"msgSnippet":"Melissa, We were in OKC the first of Novemeber.  We took a field trip to the Oklahoma History Center across from the Capital building.  We only stayed one","messageBody":"<div id=\"ygrps-yiv-1857857169\">Melissa,  <br/>\nWe were in OKC the first of Novemeber.  We took a field trip to the <br/>\nOklahoma History Center across from the Capital building.  We only <br/>\nstayed one night in OKC this time, but in the past it has been common <br/>\nfor us to spend a week over the time most public schools are out for <br/>\nspring break.  We like the Omniplex, Zoo and Capital building.  We also <br/>\nhave been to the Oklahoma Museum of Natural History a couple of times.  <br/>\nThere is also a Super 8 with a heated pool the kids really like.    <br/>\nI was thinking that we might join a group in OKC, even if we only got <br/>\nto get together every few months it would be nice to be with others <br/>\nlike us.  I&#39;ll check out the FYI.  Thanks for the info.<br/>\nAmy</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"Melissa &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] new members from oklahoma","postDate":"1197865783","msgId":28571,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVFN0UxQjY0LThEMEItNEE5Qi1CNjJGLUE3NDVGRDdDQ0E0QkBjb3gubmV0Pg==","inReplyToHeader":"PGZrNHBxdStrcDFnQGVHcm91cHMuY29tPg==","referencesHeader":"PGZrNHBxdStrcDFnQGVHcm91cHMuY29tPg=="},"prevInTopic":28568,"nextInTopic":28581,"prevInTime":28570,"nextInTime":28572,"topicId":28485,"numMessagesInTopic":0,"msgSnippet":"Two emails...passing in the night lol! about pryor area? dang that s far. We are in the OKC metro, although I m in Norman, a few in Edmond, Mustang, and I","messageBody":"<div id=\"ygrps-yiv-649193225\">Two emails...passing in the night lol!<br/>\nabout pryor area? dang that&#39;s far. We are in the OKC metro, although  <br/>\nI&#39;m in Norman, a few in Edmond, Mustang, and I think Yukon, and I  <br/>\nknow we have a few members who live in Ardmore and Lawton. They don&#39;t  <br/>\nattend often but try to...and we have an active online group.  <br/>\nEveryone comes to our not back to school party, and our summer fun  <br/>\nparty, and the mom&#39;s try to come for mom&#39;s retreat (which is once a  <br/>\nmonth)<br/>\nI don&#39;t have personal experience with these, but you might try  <br/>\n&#39;greencountryhsers&#39; or &#39;holistic-hs&#39; as far as yahoo groups go. I am  <br/>\na Christian but we have never fit in well with even the Christian  <br/>\nunschoolers because they tend to be more rigid in expectations, if  <br/>\nyou kwim.<br/>\nthe yahoo group for us is FYI-OKC. Email the list owner and see what  <br/>\nshe says.<br/>\nMelissa<br/>\nMom to Josh (12), Breanna (10), Emily (9), Rachel (7), Sam (6), Dan  <br/>\n(4), and Avari Rose (2)<br/>\n<br/>\nshare our lives at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://360.yahoo.com/multimomma\">http://360.yahoo.com/multimomma</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Dec 16, 2007, at 9:18 PM, Amy wrote:<br/>\n<br/>\n&gt; Melissa,<br/>\n&gt; Great to know we aren&#39;t alone in Oklahoma. We live in Northeastern<br/>\n&gt; Oklahoma; Mayes County area. Where abouts are you guys? Have you<br/>\n&gt; always unschooled? I wish I had known about unschooling when I first<br/>\n&gt; became a parent. Do you belong to any unschooling groups? If so how<br/>\n&gt; different are they from traditional groups? We belong to PACHA, Pryor<br/>\n&gt; Area Christian Homeschoolers. We have been members for two years now<br/>\n&gt; and we have come to realize that we dont do things the way everyone<br/>\n&gt; else in the group does. Also it&#39;s not popular or good to be<br/>\n&gt; different. We also have discovered we don&#39;t completely believe in<br/>\n&gt; their statement of faith but that would be a disaster to say anything.<br/>\n&gt; Our kids have made friends and it would be hard on them to have to  <br/>\n&gt; quit<br/>\n&gt; the group.<br/>\n&gt; Amy<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":326327257,"authorName":"Amy","from":"&quot;Amy&quot; &lt;amyj@...&gt;","profile":"amyjohnson392","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"new members from oklahoma","postDate":"1197861534","msgId":28568,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZrNHBxdStrcDFnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU2MEMyMDg2LTEyM0YtNEIwMC1BOTc4LUE0NkYxRjEzOTdERkBjb3gubmV0Pg=="},"prevInTopic":28567,"nextInTopic":28571,"prevInTime":28567,"nextInTime":28569,"topicId":28485,"numMessagesInTopic":0,"msgSnippet":"Melissa, Great to know we aren t alone in Oklahoma.  We live in Northeastern Oklahoma; Mayes County area.  Where abouts are you guys?  Have you always","messageBody":"<div id=\"ygrps-yiv-1786358231\">Melissa,<br/>\nGreat to know we aren&#39;t alone in Oklahoma.  We live in Northeastern <br/>\nOklahoma; Mayes County area.  Where abouts are you guys?  Have you <br/>\nalways unschooled?  I wish I had known about unschooling when I first <br/>\nbecame a parent. Do you belong to any unschooling groups?  If so how <br/>\ndifferent are they from traditional groups?  We belong to PACHA, Pryor <br/>\nArea Christian Homeschoolers.  We have been members for two years now <br/>\nand we have come to realize that we dont do things the way everyone <br/>\nelse in the group does.  Also it&#39;s not popular or good to be <br/>\ndifferent.  We also have discovered we don&#39;t completely believe in <br/>\ntheir statement of faith but that would be a disaster to say anything.  <br/>\nOur kids have made friends and it would be hard on them to have to quit <br/>\nthe group.          <br/>\nAmy</div>","specialLinks":[]},{"userId":215778715,"authorName":"Jodi Bezzola","from":"Jodi Bezzola &lt;jodibezzola@...&gt;","profile":"jodibezzola","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Hello from a new member","postDate":"1197861383","msgId":28567,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1NDQ0NC4xNzU1MC5xbUB3ZWI1NDEwOC5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDExODIyNS40MzA1MC5xbUB3ZWI4NjIwNy5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":28560,"nextInTopic":28568,"prevInTime":28566,"nextInTime":28568,"topicId":28485,"numMessagesInTopic":0,"msgSnippet":"Thanks so much Schuyler for the tip about the blogs - I ll definitely wander through some of those :o) Jodi ENSEMBLE S-WAYNFORTH ","messageBody":"<div id=\"ygrps-yiv-133631976\">Thanks so much Schuyler for the tip about the blogs - I&#39;ll definitely wander through some of those :o)<br/>\n  Jodi<br/>\n<br/>\nENSEMBLE S-WAYNFORTH &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt; wrote:<br/>\n          =================<br/>\nI&#39;m not sure where most of the members are from on this list, but we <br/>\nlive in Calgary, Alberta.<br/>\n=================<br/>\nWhile I&#39;m not most of the members on this list, I live in a small village in Norfolk County in the UK. So, really not neighbors, but the same Queen. Although I am a U.S. citizen, so I can look down my nose at all of the strange pomp and ceremony of monarchy.<br/>\n<br/>\n==============<br/>\n<br/>\nIf you want to share what you&#39;re doing in your families, I would <br/>\nabsolutely love to hear all about it, so let the replies pour in <br/>\nplease!<br/>\n==============<br/>\n<br/>\nYesterday we had friends round for lunch and to pick up their children who had spent the night. Before everyone came, while David and I were getting the food ready, I had music going. So there was a lot of dancing in the kitchen with Linnaea and her friend joining in while Simon and his friend played The Simpson&#39;s Game in the adjacent room. When everyone arrived there was a lot of playing with kittens and video gaming and some Scooby Doo watching and food and conversation and World of Warcrafting and, well, lots of things. After everyone left and all was more quiet and more calm we watched some Family Guy all cuddled up in bed together and had popcorn with soy sauce and talked and laughed and than Simon and Linnaea played World of Warcraft together and used Skype to call a friend and played with her on WoW for a while. When David and I grew tired we set up things for Simon and Linnaea, they wanted to watch Family Guy and lie on the sofa bed in it&#39;s bed<br/>\nposture while the kittens bounced over and around them. David and I watched Charley Boorman and Ewan McGregor prepare for their round the world motorcycle trip. Linnaea joined us after a little while and snuggled up and we talked a bit about why Charley Boorman was swearing so much, and why they didn&#39;t always bleep out his swearing. She fell asleep in my arms and David moved her to her bed that is next to ours. <br/>\n<br/>\nIn the moments of David and I lying in bed together we talked about how engaging our house is. There are interesting moments waiting to happen in every room. Even the bathroom has comic books and the funny pages from the U.S. that my mom sends to Linnaea&#39;s great enjoyment in it waiting for someone to entertain. I think that is an important aspect of unschooling, lots of interest traps, lots of thing to capture the eye and the mind. It doesn&#39;t need to be chaotic, and I don&#39;t feel like our house is chaotic, but it is so wonderful to wander through a room filled with ideas, with books and DVDs and art supplies and toys and activities and to pick what it is that appeals to you in that moment. But the house doesn&#39;t rest on its own laurels, I will often introduce something that I think Simon or Linnaea will enjoy. That may be something as simple as a kitten doing something cute or silly or funny or a television show or a webpage or a trip to a museum that I<br/>\nthink they&#39;ll like or a video game that I read about that seemed likely to entertain. <br/>\n<br/>\nTo see what people&#39;s days look like in greater detail I would recommend cruising the world of unschooling blogs. <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ringsurf.com/netring?action=info&ring=Unschooling_Blogs\">http://www.ringsurf.com/netring?action=info&ring=Unschooling_Blogs</a> is the blog ring site for the Unschooling blog ring. <a rel=\"nofollow\" target=\"_blank\" href=\"http://anunschoolinglife.blogspot.com/2007/01/unschooling-voices-main-page.html\">http://anunschoolinglife.blogspot.com/2007/01/unschooling-voices-main-page.html</a> is the main page for Unschooling Voices, an unschooling carnival which has blog posts submitted to it based loosely on a topic. From both of those sites you can wander merrily for many an hour through family after family and see the many faces of unschooling. <br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n                         <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nBe a better friend, newshound, and know-it-all with Yahoo! Mobile.  Try it now.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"Melissa &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Hello from a new member","postDate":"1197827238","msgId":28560,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU2MEMyMDg2LTEyM0YtNEIwMC1BOTc4LUE0NkYxRjEzOTdERkBjb3gubmV0Pg==","inReplyToHeader":"PGZqdGdjdCt1Nm84QGVHcm91cHMuY29tPg==","referencesHeader":"PGZqdGdjdCt1Nm84QGVHcm91cHMuY29tPg=="},"prevInTopic":28553,"nextInTopic":28567,"prevInTime":28559,"nextInTime":28561,"topicId":28485,"numMessagesInTopic":0,"msgSnippet":"Amy, Where are you located? I m in Oklahoma, and there is a great unschooling group in the OKC metro. I also have to stay away from most school-at-homers...as","messageBody":"<div id=\"ygrps-yiv-1542608617\">Amy,<br/>\nWhere are you located? I&#39;m in Oklahoma, and there is a great  <br/>\nunschooling group in the OKC metro.<br/>\nI also have to stay away from most school-at-homers...as well as  <br/>\nmainstream parents because of the<br/>\ntalk about curriculum, discipline, etc etc.<br/>\nAnyway, welcome to the group.<br/>\nMelissa<br/>\nMom to Josh (12), Breanna (10), Emily (9), Rachel (7), Sam (6), Dan  <br/>\n(4), and Avari Rose (2)<br/>\n<br/>\nshare our lives at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://360.yahoo.com/multimomma\">http://360.yahoo.com/multimomma</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Dec 14, 2007, at 2:54 AM, Amy wrote:<br/>\n<br/>\n&gt; Hi, I&#39;m new also. My name is Amy and I have 4 kids, but only 3 at<br/>\n&gt; home. My oldest daughter,Mandi/20yrs. is getting married Saturday.<br/>\n&gt; The 3 at home are Holli/15yrs.(on 12-23), Anthony/13yrs. and<br/>\n&gt; Ginger/10yrs. We are from Oklahoma. We have homeschooled for 3<br/>\n&gt; yrs. We have gone from public school at home to relaxed eclectic<br/>\n&gt; homeschooling. I&#39;m trying really hard to deprogram myself and be<br/>\n&gt; relaxed with natural learning. I do fine as long as I stay away from<br/>\n&gt; traditional homeschoolers. I guess you could call me a closet,<br/>\n&gt; unschooler want to be. I tried it out at the end of the last &quot;school<br/>\n&gt; year&quot;. I told my homeschool friends...that was a mistake! Anyway, I<br/>\n&gt; encourage my kids to read and let them pick their own books. I ask<br/>\n&gt; them to write a little everday, but they have choices in that too.<br/>\n&gt; The big unschooling no no would be Math, the kids use Teaching<br/>\n&gt; Textbooks a computer based math curriculium. Holli and Ginger love<br/>\n&gt; to do it, Anthony just does it. My husband and I take turns reading<br/>\n&gt; to the kids in the evenings. The last book I read to them<br/>\n&gt; was &quot;Across Five Aprils&quot; and the book Jeff is reading to us now<br/>\n&gt; is &quot;Robinson Curusoe&quot;. We picked these books because we spent time<br/>\n&gt; in IL over the summer. While there we visited Abraham Lincoln&#39;s Home<br/>\n&gt; and other places that had to do with Lincoln. During this reading<br/>\n&gt; time we sit where ever we want and do what we want. I knit while<br/>\n&gt; holli works on a craft, Anthony plays with his Star Wars Legos and<br/>\n&gt; Ginger plays with playdoh or draws. We don&#39;t spend more than two<br/>\n&gt; hours a day on this stuff so the rest of the day is theirs to do with<br/>\n&gt; as they please. Which from what I can see is a whole lot of natural<br/>\n&gt; learning. I think I&#39;ve come along way, but I know I still have a<br/>\n&gt; ways to go. I&#39;m open to any suggestions or coments.<br/>\n&gt; You can see us in &quot;Amy&#39;s Family Photos&quot;.<br/>\n&gt; Learning to let go and Unschool,<br/>\n&gt; Amy<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"&quot;Melissa&quot; &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Hello from a new member","postDate":"1197820183","msgId":28553,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZrM2hlbitzZGZzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZqcnZoNytjazRhQGVHcm91cHMuY29tPg=="},"prevInTopic":28548,"nextInTopic":28560,"prevInTime":28552,"nextInTime":28554,"topicId":28485,"numMessagesInTopic":0,"msgSnippet":"Hi Jody, I m Melissa, mom to seven in Oklahoma. They are 12,10,8,7,6,4 and 2, and this last week has been a doozy BUT...in sense of learning and wonder and","messageBody":"<div id=\"ygrps-yiv-1998979321\">Hi Jody,<br/>\nI&#39;m Melissa, mom to seven in Oklahoma. They are 12,10,8,7,6,4 and 2, and this last week <br/>\nhas been a doozy BUT...in sense of learning and wonder and character and all that, it&#39;s <br/>\nvery wonderful.<br/>\n<br/>\nWe lost power last Saturday due to an ice storm, and went without power for six full days. <br/>\nOur whole (summarized) adventure is on my blog (www.360.yahoo.com/multimomma) but <br/>\nI now have proof that kids can learn college level physics with unschooling. We were able <br/>\nto get a generator on day four, and three of the older kids were figuring out wattage from <br/>\nthe volt listings on the backs of appliances, adding up load, figuring diminishing power <br/>\nfrom the generator (appr 10%) *I* learned things in a way that was never meaningful when <br/>\nI took E&M in school. <br/>\n<br/>\nBut beyond that, we spent a great deal of time entertaining each other, being <br/>\ncompassionate for my oldest, who self-identifies as a gamer/computer geek. He was in <br/>\npain missing his electronics! The middle girls worked hard to entertain him as well as their <br/>\nbaby sister, and we all learned that there is value in having a tidy floor during a blackout <br/>\n(teehee)<br/>\n<br/>\nWe had fun cooking in the fireplace, and the kids&#39; compassion grew for those without food <br/>\nor home either one. We learned that when power goes out, neighbors grow closer, for <br/>\neven without electricity, we all leaned on each other and shared what we did have (being <br/>\nfirewood lol!) We spent a lot of time out in the community, exploring new stores that had <br/>\npower. At the insistance of my six year old, we went for long walks and helped neighbors <br/>\nmove branches off their cars and homes, out of driveways and sidewalks. <br/>\n<br/>\nThe older kids would sympathetically ask people about how they were doing, listen to the <br/>\nstories of adults talking about this storm or that twenty years ago. The girls wrote comic <br/>\nbooks illustrating the stories and read them to the littles, and then would sing for the <br/>\noldest his favorite songs from video games or online websites. <br/>\n<br/>\nNow that the electricity is back on, last night we had an &#39;electricity party&#39;. Our 8yo, when <br/>\nshe had had enough, stamped her foot and said, &#39;When the electricity comes back, I&#39;m <br/>\nhaving a party and you can ONLY do things that require electricity...I&#39;m going to cook this <br/>\nand that, and Josh can play video games and we can watch YouTube and have all the lights <br/>\non,&#39; So we invited our friends over for that. some of the kids had spent a few nights with <br/>\nfriends during that week. Today the girls and I are dressing up and taking tea before we <br/>\ngo see the Nutcracker. Tomorrow we&#39;ll be shopping around for a chainsaw to take care of <br/>\nsome of the trees that are down in our backyard. We discovered a great deal about <br/>\nchainsaws over the life of our electric limbtrimmer, and so everyone has been reading <br/>\nconsumer reports the past 36 hours to make sure we get a sturdy one that is inexpensive.<br/>\n<br/>\nWe&#39;re part of a local unschooling group, and we also have this week kitchen creations and <br/>\nexperiment day. Last week was craft day, and we skpped park day because of the weather.<br/>\nAnyway, my blog has about 18 months worth of nearly daily posts (ok, in the beginning) <br/>\nabout unschooling, so you are welcome to check that out (posted above)<br/>\n<br/>\nMelissa<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;jodibezzola&quot; &lt;jodibezzola@...&gt; wrote:<br/>\n&gt; If you want to share what you&#39;re doing in your families, I would <br/>\n&gt; absolutely love to hear all about it, so let the replies pour in <br/>\n&gt; please! </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"ENSEMBLE S-WAYNFORTH","from":"ENSEMBLE S-WAYNFORTH &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Hello from a new member","postDate":"1197804555","msgId":28548,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExODIyNS40MzA1MC5xbUB3ZWI4NjIwNy5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":28519,"nextInTopic":28553,"prevInTime":28547,"nextInTime":28549,"topicId":28485,"numMessagesInTopic":0,"msgSnippet":"================= I m not sure where most of the members are from on this list, but we live in Calgary, Alberta. ================= While I m not most of the","messageBody":"<div id=\"ygrps-yiv-1989405582\">=================<br/>\nI&#39;m not sure where most of the members are from on this list, but we <br/>\nlive in Calgary, Alberta.<br/>\n=================<br/>\nWhile I&#39;m not most of the members on this list, I live in a small village in Norfolk County in the UK. So, really not neighbors, but the same Queen. Although I am a U.S. citizen, so I can look down my nose at all of the strange pomp and ceremony of monarchy.<br/>\n<br/>\n==============<br/>\n<br/>\nIf you want to share what you&#39;re doing in your families, I would <br/>\nabsolutely love to hear all about it, so let the replies pour in <br/>\nplease!<br/>\n==============<br/>\n<br/>\nYesterday we had friends round for lunch and to pick up their children who had spent the night. Before everyone came, while David and I were getting the food ready, I had music going. So there was a lot of dancing in the kitchen with Linnaea and her friend joining in while Simon and his friend played The Simpson&#39;s Game in the adjacent room. When everyone arrived there was a lot of playing with kittens and video gaming and some Scooby Doo watching and food and conversation and World of Warcrafting and, well, lots of things. After everyone left and all was more quiet and more calm we watched some Family Guy all cuddled up in bed together and had popcorn with soy sauce and talked and laughed and than Simon and Linnaea played World of Warcraft together and used Skype to call a friend and played with her on WoW for a while. When David and I grew tired we set up things for Simon and Linnaea, they wanted to watch Family Guy and lie on the sofa bed in it&#39;s bed<br/>\n posture while the kittens bounced over and around them. David and I watched Charley Boorman and Ewan McGregor prepare for their round the world motorcycle trip. Linnaea joined us after a little while and snuggled up and we talked a bit about why Charley Boorman was swearing so much, and why they didn&#39;t always bleep out his swearing. She fell asleep in my arms and David moved her to her bed that is next to ours. <br/>\n<br/>\nIn the moments of David and I lying in bed together we talked about how engaging our house is. There are interesting moments waiting to happen in every room. Even the bathroom has comic books and the funny pages from the U.S. that my mom sends to Linnaea&#39;s great enjoyment in it waiting for someone to entertain. I think that is an important aspect of unschooling, lots of interest traps, lots of thing to capture the eye and the mind. It doesn&#39;t need to be chaotic, and I don&#39;t feel like our house is chaotic, but it is so wonderful to wander through a room filled with ideas, with books and DVDs and art supplies and toys and activities and to pick what it is that appeals to you in that moment. But the house doesn&#39;t rest on its own laurels, I will often introduce something that I think Simon or Linnaea will enjoy. That may be something as simple as a kitten doing something cute or silly or funny or a television show or a webpage or a trip to a museum that I<br/>\n think they&#39;ll like or a video game that I read about that seemed likely to entertain. <br/>\n<br/>\nTo see what people&#39;s days look like in greater detail I would recommend cruising the world of unschooling blogs. <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ringsurf.com/netring?action=info&ring=Unschooling_Blogs\">http://www.ringsurf.com/netring?action=info&ring=Unschooling_Blogs</a> is the blog ring site for the Unschooling blog ring. <a rel=\"nofollow\" target=\"_blank\" href=\"http://anunschoolinglife.blogspot.com/2007/01/unschooling-voices-main-page.html\">http://anunschoolinglife.blogspot.com/2007/01/unschooling-voices-main-page.html</a> is the main page for Unschooling Voices, an unschooling carnival which has blog posts submitted to it based loosely on a topic. From both of those sites you can wander merrily for many an hour through family after family and see the many faces of unschooling. <br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":275711945,"authorName":"Michelle Turnbow","from":"Michelle Turnbow &lt;ellenbow@...&gt;","profile":"chacanmic","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Hello from a new member","postDate":"1197649545","msgId":28519,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3MjAwOC4zMjQ0My5xbUB3ZWI4MTQwNy5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGMzMC4yMDBjOWJkZS4zNDkzNjA3Y0Bhb2wuY29tPg=="},"prevInTopic":28514,"nextInTopic":28548,"prevInTime":28518,"nextInTime":28520,"topicId":28485,"numMessagesInTopic":0,"msgSnippet":"ok, good point, thanks! :) Kidgie@aol.com wrote: In a message dated 12/13/2007 7:29:05 P.M. Pacific Standard Time, SusanYvonne@gmail.com writes: Right now,","messageBody":"<div id=\"ygrps-yiv-1328766553\">ok, good point, thanks! :)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Kidgie@...\">Kidgie@...</a> wrote:          <br/>\nIn a message dated 12/13/2007 7:29:05 P.M. Pacific Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SusanYvonne@...\">SusanYvonne@...</a> writes:<br/>\n<br/>\nRight now, stop thinking of it as practice - there is<br/>\nonly *doing*. Unschooling is a life philosophy, a way of living and being in<br/>\nthe world. You can&#39;t practice life.<br/>\n<br/>\n__________________________<br/>\n<br/>\nReminds me of the famous and oh, so true quote from Jedi Master Yoda, &quot;Do or <br/>\ndo not. There is no try.&quot; Also very Zen-like, which I needed to hear. <br/>\n<br/>\nKaren <br/>\n<br/>\n**************************************See AOL&#39;s top rated recipes <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://food.aol.com/top-rated-recipes?NCID=aoltop00030000000004)\">http://food.aol.com/top-rated-recipes?NCID=aoltop00030000000004)</a><br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n                         <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":326327257,"authorName":"Amy","from":"&quot;Amy&quot; &lt;amyj@...&gt;","profile":"amyjohnson392","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Hello from a new member","postDate":"1197622493","msgId":28514,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZqdGdjdCt1Nm84QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDkzNjM5OS40MDU5NS5xbUB3ZWI4MTQxMy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":28507,"nextInTopic":28519,"prevInTime":28513,"nextInTime":28515,"topicId":28485,"numMessagesInTopic":0,"msgSnippet":"Hi, I m new also.  My name is Amy and I have 4 kids, but only 3 at home.  My oldest daughter,Mandi/20yrs. is getting married Saturday. The 3 at home are","messageBody":"<div id=\"ygrps-yiv-1393163984\">Hi, I&#39;m new also.  My name is Amy and I have 4 kids, but only 3 at <br/>\nhome.  My oldest daughter,Mandi/20yrs. is getting married Saturday.  <br/>\nThe 3 at home are Holli/15yrs.(on 12-23), Anthony/13yrs. and <br/>\nGinger/10yrs.  We are from Oklahoma.  We have homeschooled for 3 <br/>\nyrs.  We have gone from public school at home to relaxed eclectic <br/>\nhomeschooling.  I&#39;m trying really hard to deprogram myself and be <br/>\nrelaxed with natural learning.  I do fine as long as I stay away from <br/>\ntraditional homeschoolers.  I guess you could call me a closet, <br/>\nunschooler want to be.  I tried it out at the end of the last &quot;school <br/>\nyear&quot;.  I told my homeschool friends...that was a mistake!  Anyway, I <br/>\nencourage my kids to read and let them pick their own books.  I ask <br/>\nthem to write a little everday, but they have choices in that too.  <br/>\nThe big unschooling no no would be Math, the kids use Teaching <br/>\nTextbooks a computer based math curriculium.  Holli and Ginger love <br/>\nto do it, Anthony just does it.  My husband and I take turns reading <br/>\nto the kids in the evenings.  The last book I read to them <br/>\nwas &quot;Across Five Aprils&quot; and the book Jeff is reading to us now <br/>\nis &quot;Robinson Curusoe&quot;.  We picked these books because we spent time <br/>\nin IL over the summer.  While there we visited Abraham Lincoln&#39;s Home <br/>\nand other places that had to do with Lincoln.  During this reading <br/>\ntime we sit where ever we want and do what we want.  I knit while <br/>\nholli works on a craft, Anthony plays with his Star Wars Legos and <br/>\nGinger plays with playdoh or draws.  We don&#39;t spend more than two <br/>\nhours a day on this stuff so the rest of the day is theirs to do with <br/>\nas they please. Which from what I can see is a whole lot of natural <br/>\nlearning.  I think I&#39;ve come along way, but I know I still have a <br/>\nways to go.  I&#39;m open to any suggestions or coments.   <br/>\nYou can see us in &quot;Amy&#39;s Family Photos&quot;.<br/>\nLearning to let go and Unschool, <br/>\nAmy</div>","specialLinks":[]},{"userId":7644358,"authorName":"Kidgie@aol.com","from":"Kidgie@...","profile":"mama_de_julian_y_julia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Hello from a new member","postDate":"1197606524","msgId":28507,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMzMC4yMDBjOWJkZS4zNDkzNjA3Y0Bhb2wuY29tPg=="},"prevInTopic":28506,"nextInTopic":28514,"prevInTime":28506,"nextInTime":28508,"topicId":28485,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/13/2007 7:29:05 P.M. Pacific Standard Time, SusanYvonne@gmail.com writes: Right  now, stop thinking of it as practice - there is only","messageBody":"<div id=\"ygrps-yiv-1994933133\">In a message dated 12/13/2007 7:29:05 P.M. Pacific Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SusanYvonne@...\">SusanYvonne@...</a> writes:<br/>\n<br/>\nRight  now, stop thinking of it as practice - there is<br/>\nonly *doing*. Unschooling  is a life philosophy, a way of living and being in<br/>\nthe world. You can&#39;t  practice life.<br/>\n<br/>\n<br/>\n<br/>\n__________________________<br/>\n <br/>\nReminds me of the famous and oh, so true quote from Jedi Master Yoda, &quot;Do  or <br/>\ndo not. There is no try.&quot; Also very Zen-like, which I needed to hear. <br/>\n <br/>\nKaren <br/>\n<br/>\n<br/>\n<br/>\n**************************************See AOL&#39;s top rated recipes <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://food.aol.com/top-rated-recipes?NCID=aoltop00030000000004)\">http://food.aol.com/top-rated-recipes?NCID=aoltop00030000000004)</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210335840,"authorName":"Susan","from":"Susan &lt;SusanYvonne@...&gt;","profile":"taodesuki","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Hello from a new member","postDate":"1197602923","msgId":28506,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3Y2Q5MGUyMDcxMjEzMTkyOHYzMWM2MTc1MXJkYzkwZjNhNmVkOTUzZmE4QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDkzNjM5OS40MDU5NS5xbUB3ZWI4MTQxMy5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PGZqcnZoNytjazRhQGVHcm91cHMuY29tPgkgPDkzNjM5OS40MDU5NS5xbUB3ZWI4MTQxMy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":28505,"nextInTopic":28507,"prevInTime":28505,"nextInTime":28507,"topicId":28485,"numMessagesInTopic":0,"msgSnippet":"-=- i have a 4yr. old daughter that i m wanting to start unschooling next fall -=- Start now. There is no reason to wait until she reaches school age. ","messageBody":"<div id=\"ygrps-yiv-626907293\">-=- i have a 4yr. old daughter that i&#39;m wanting to start unschooling next<br/>\nfall -=-<br/>\n<br/>\nStart now. There is no reason to wait until she reaches school age.<br/>\nUnschooling doesn&#39;t require a child to turn five. There is no magical<br/>\npassport to unschooling handed out in the fall when all the other kids are<br/>\nenrolled in their classes. You&#39;re thinking in terms of school but<br/>\nunschooling has very little, if anything, to do with such concepts.<br/>\n<br/>\n-=- we&#39;re just practicing now -=-<br/>\n<br/>\nIs it really possible to practice unschooling? There is no point at which<br/>\nyou will suddenly become eligible to unschool because you practiced.<br/>\nFamilies will naturally fall along a continuum of where they&#39;re &quot;at&quot; in<br/>\nregards to living unschooling principals - and there will always be room for<br/>\nimprovement, always. Right now, stop thinking of it as practice - there is<br/>\nonly *doing*. Unschooling is a life philosophy, a way of living and being in<br/>\nthe world. You can&#39;t practice life.<br/>\n<br/>\n~ Susan<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":275711945,"authorName":"Michelle Turnbow","from":"Michelle Turnbow &lt;ellenbow@...&gt;","profile":"chacanmic","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Hello from a new member","postDate":"1197598685","msgId":28505,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkzNjM5OS40MDU5NS5xbUB3ZWI4MTQxMy5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGZqcnZoNytjazRhQGVHcm91cHMuY29tPg=="},"prevInTopic":28493,"nextInTopic":28506,"prevInTime":28504,"nextInTime":28506,"topicId":28485,"numMessagesInTopic":0,"msgSnippet":"hi jodi, i m a newbie too. from tx. i have a 4yr. old daughter that i m wanting to start unschooling next fall. we re just practicing now. i m familiar w/","messageBody":"<div id=\"ygrps-yiv-1730625322\">hi jodi, i&#39;m a newbie too. from tx. i have a 4yr. old daughter that i&#39;m wanting to start unschooling next fall. we&#39;re just practicing now. i&#39;m familiar w/ HOMEschooling but am just now researching the idea of UNschooling. I am also reading john holt. it&#39;s fascinating! happy learning! mich<br/>\n<br/>\njodibezzola &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jodibezzola@...\">jodibezzola@...</a>&gt; wrote:          Hi everyone,<br/>\nI&#39;m not sure where most of the members are from on this list, but we <br/>\nlive in Calgary, Alberta.<br/>\nWe have 3 year old twin girls and are planning to unschool. While we <br/>\nreally are certain this is the right choice for us, I have absolutely <br/>\nno idea what will be involved! I&#39;ve read lots of John Holt and lots <br/>\nof others recently, and love all that I&#39;ve read.<br/>\nWhat&#39;s missing so far for me is talking to and hearing from people who <br/>\nare actually doing it already! I joined another Yahoo group in my <br/>\ncity, but it seems that most there are homeschooling quite <br/>\ntraditionally, and most of what they have to talk about doesn&#39;t appeal <br/>\nto me.<br/>\nIf you want to share what you&#39;re doing in your families, I would <br/>\nabsolutely love to hear all about it, so let the replies pour in <br/>\nplease!<br/>\nThank you :o)<br/>\nJodi<br/>\nMom to Jade and Skye, 3 years old tomorrow!<br/>\n<br/>\n<br/>\n<br/>\n                         <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":195592821,"authorName":"Robert Saxon","from":"&quot;Robert Saxon&quot; &lt;TheSaxons@...&gt;","profile":"rob_saxon_2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Hello from a new member","postDate":"1197582466","msgId":28493,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1MzUwYTJjMDcxMjEzMTM0N2gyNTZjYzRkNHliOWZhMWEzMDk0ZGFhMmY1QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGZqcnZoNytjazRhQGVHcm91cHMuY29tPg==","referencesHeader":"PGZqcnZoNytjazRhQGVHcm91cHMuY29tPg=="},"prevInTopic":28485,"nextInTopic":28505,"prevInTime":28492,"nextInTime":28494,"topicId":28485,"numMessagesInTopic":0,"msgSnippet":"Jodi, One great way to learn about stuff is to go to the group homepage and search the message archives on the topic of your choice.  LIke respect and ","messageBody":"<div id=\"ygrps-yiv-28944628\">Jodi,<br/>\n<br/>\nOne great way to learn about stuff is to go to the group homepage and search<br/>\nthe message archives on the topic of your choice.  LIke &quot;respect&quot; and<br/>\n&quot;cleaning,&quot; to name a couple.<br/>\n<br/>\nIs there anything in particular you&#39;re interested in knowing about?<br/>\n<br/>\n--Rob Saxon<br/>\nDH to Seana for (almost!) 11 years<br/>\n&quot;Daddy!&quot; to Genevieve (6!) and Elissa (4 7/12)<br/>\nDallas, Texas area (aka A Long Way from Calgary)<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Dec 13, 2007 1:00 PM, jodibezzola &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jodibezzola@...\">jodibezzola@...</a>&gt; wrote:<br/>\n<br/>\n&gt;   Hi everyone,<br/>\n&gt; I&#39;m not sure where most of the members are from on this list, but we<br/>\n&gt; live in Calgary, Alberta.<br/>\n&gt; We have 3 year old twin girls and are planning to unschool. While we<br/>\n&gt; really are certain this is the right choice for us, I have absolutely<br/>\n&gt; no idea what will be involved! I&#39;ve read lots of John Holt and lots<br/>\n&gt; of others recently, and love all that I&#39;ve read.<br/>\n&gt; What&#39;s missing so far for me is talking to and hearing from people who<br/>\n&gt; are actually doing it already! I joined another Yahoo group in my<br/>\n&gt; city, but it seems that most there are homeschooling quite<br/>\n&gt; traditionally, and most of what they have to talk about doesn&#39;t appeal<br/>\n&gt; to me.<br/>\n&gt; If you want to share what you&#39;re doing in your families, I would<br/>\n&gt; absolutely love to hear all about it, so let the replies pour in<br/>\n&gt; please!<br/>\n&gt; Thank you :o)<br/>\n&gt; Jodi<br/>\n&gt; Mom to Jade and Skye, 3 years old tomorrow!<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":215778715,"authorName":"jodibezzola","from":"&quot;jodibezzola&quot; &lt;jodibezzola@...&gt;","profile":"jodibezzola","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Hello from a new member","postDate":"1197572455","msgId":28485,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZqcnZoNytjazRhQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":28493,"prevInTime":28484,"nextInTime":28486,"topicId":28485,"numMessagesInTopic":0,"msgSnippet":"Hi everyone, I m not sure where most of the members are from on this list, but we live in Calgary, Alberta. We have 3 year old twin girls and are planning to","messageBody":"<div id=\"ygrps-yiv-686112880\">Hi everyone,<br/>\nI&#39;m not sure where most of the members are from on this list, but we <br/>\nlive in Calgary, Alberta.<br/>\nWe have 3 year old twin girls and are planning to unschool.  While we <br/>\nreally are certain this is the right choice for us, I have absolutely <br/>\nno idea what will be involved!  I&#39;ve read lots of John Holt and lots <br/>\nof others recently, and love all that I&#39;ve read.<br/>\nWhat&#39;s missing so far for me is talking to and hearing from people who <br/>\nare actually doing it already!  I joined another Yahoo group in my <br/>\ncity, but it seems that most there are homeschooling quite <br/>\ntraditionally, and most of what they have to talk about doesn&#39;t appeal <br/>\nto me.<br/>\nIf you want to share what you&#39;re doing in your families, I would <br/>\nabsolutely love to hear all about it, so let the replies pour in <br/>\nplease!<br/>\nThank you :o)<br/>\nJodi<br/>\nMom to Jade and Skye, 3 years old tomorrow!</div>","specialLinks":[]}],"prevTopicId":28482,"nextTopicId":28494}}