{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":136334171,"authorName":"Marcia Coakley","from":"&quot;Marcia Coakley&quot; &lt;m.coakley@...&gt;","profile":"coakley4m","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: TV and relationships","postDate":"1086882362","msgId":537,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5GQkJLTUdPRE9EUE5LSUNJS0VLSUVORUREQUEubS5jb2FrbGV5QHZlcml6b24ubmV0Pg==","inReplyToHeader":"PDEwODY4NTY3MzMuNDk3Ljg1MTI4Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":536,"nextInTime":538,"topicId":537,"numMessagesInTopic":0,"msgSnippet":"I wanted to comment about TV and visual stimulation. We have pretty minimal TV reception and my husband and I rarely watch (except for particular events on","messageBody":"<div id=\"ygrps-yiv-1029716454\">I wanted to comment about TV and visual stimulation.<br/>\n<br/>\nWe have pretty minimal TV reception and my husband and I rarely watch<br/>\n(except for particular events on occasion).  I know that I would get hooked<br/>\non some cable channels (history, nature, A&E etc) but I prefer reading.  A<br/>\nquiet night together with my husband (if we don&#39;t go<br/>\ndancing....contras/square, swing, or vintage ballroom)...is usually a nice<br/>\nbeverage and a book that I read out loud (we&#39;ve been through JRR Tolkien, JK<br/>\nRowling, B. Jacques, R. Jordan...and the kids get in on it whenever we&#39;re<br/>\nall together...car rides and such...I read out loud to them all the time,<br/>\ntoo)...we would rather get on with our book than turn on TV.<br/>\n<br/>\nSo, the kids are not usually much interested...except for movies and games.<br/>\n<br/>\nI am not a &quot;movie person&quot; (I do love some, but they can be hard on me...I<br/>\nhave to be very selective), and my son is like me...where he must be careful<br/>\nabout visual images that he sees and that linger with him.  We are both<br/>\nstill &quot;haunted&quot; by some things watched (TV and movies).<br/>\n<br/>\nAnd then there is ocular lock...where the brain cross-hemispheric<br/>\nfunctioning becomes limited and the brain&#39;s function is rerouted<br/>\nhomolaterally (only one side) with any flat screen visual stimulation.  It&#39;s<br/>\nnot that it&#39;s all bad...it&#39;s just only one kind and limiting.  It is better<br/>\nto have a variety of activities over the course of the day.<br/>\n<br/>\nIt&#39;s the same in everything...variety...food* over the course of a day (or<br/>\nweek...doesn&#39;t matter what order it goes in!), exercise, play, stimulation.<br/>\nEvery hour or so (the timing is more critical for certain peoples&#39; brains)<br/>\nit is good to &quot;look&quot; and interact with something different for<br/>\nawhile...longer view (outdoors) after close up work, moving around when<br/>\nhaving stared at (any kind of) a screen for a period of time....and most<br/>\nimportantly...the physical activity, cross-hemispheric integration and whole<br/>\nbody function aspect of the human learning and growing experience (also for<br/>\none&#39;s whole life).  This is the work of Brain Gym, martial arts, yoga,<br/>\ndance, Nia, and so many other understandings of the broader meaning of<br/>\nlearning, and health!<br/>\n<br/>\n*I was reminded again about making sure that it (food) does go in<br/>\nregularly...my son&#39;s mood really goes haywire if he gets so deeply<br/>\ninterested in something when we&#39;re out somewhere else, that makes him seem<br/>\nto need to be grasp it more tightly (de-schooling still in process), says<br/>\nhe&#39;s not hungry and is dragging his feet to eat...and waits too long.  I<br/>\nstill must keep that schedule in mind when planning any outside activities<br/>\nhe wants to do...(this is huge stressor even though he wants some of it),<br/>\nand he is 11.  At home this is not a problem...I leave food ready for him,<br/>\nor he chooses something on his own...trusting himself to manage it and I<br/>\nstay out of it!.  Outside things are still more stressful (another reason<br/>\nleaving school was a blessing) and his awareness (of his own feelings and<br/>\nthings around him) is less grounded and clear yet.<br/>\n<br/>\nI believe (based on so many people&#39;s work and research...and much personal<br/>\nexperience) that much learning is hindered by limited types of<br/>\ninput/experience of the world around us.  We have a culture of human beings<br/>\nwho know little about the range (of motion AND understanding) for which<br/>\ntheir bodies have potential.  Not (necessarily) for the purpose of<br/>\ncomparison or competition...but for the joy of what it means to be human and<br/>\nin the world.....and how using the body is a path to so many things...rhythm<br/>\nand music, perception, relationship, joy, beauty and self acceptance.  This<br/>\nis the way to much high self esteem, key to successful relationships and<br/>\nhappier people.<br/>\n<br/>\nSo my concern remains...that although there is so much wondrous information<br/>\nand opportunity on (cable) TV nowadays....there is a less emphasis on<br/>\nparticipation when there is so much access to the world vicariously and<br/>\nvisually.  We need both...and I bring this as part of the bigger discussion<br/>\nin our family culture.  It is harder to find acceptance and joy in our<br/>\nbodies if we don&#39;t know them or trust what they can learn and do.  The<br/>\nlong-term health concerns of bodies long unstimulated are manifest in the<br/>\nworld around us.  The joy some adults find later through the myriad<br/>\npossibilities (sports, dance, yoga, anything) invariably are accompanied by<br/>\nthe wishes that they had been able to do it all their lives, and injury<br/>\nfree...rather than be afraid of &quot;looking weird&quot; or thinking &quot;I can&#39;t&quot; etc.<br/>\nLet&#39;s have this be the norm...the joy from childhood we never lose!   Be a<br/>\nrole model for those around you!<br/>\n<br/>\nMarcia C.<br/>\nMedway, MA<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.701 / Virus Database: 458 - Release Date: 06/07/2004</div>","specialLinks":[]}],"prevTopicId":467,"nextTopicId":528}}