{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":268622920,"authorName":"Amy Mason","from":"Amy Mason &lt;doodlemakers@...&gt;","profile":"doodlemakers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Dreams come true, they really do","postDate":"1162431956","msgId":18725,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1NDk0REQ0LjIwNjAyMDFAYWRlbHBoaWEubmV0Pg==","inReplyToHeader":"PDAwNTQwMWM2ZmRlYyQxNmQxYjg3MCQ2NDAxYThjMEBuZXdsYXA+","referencesHeader":"PDAwNTQwMWM2ZmRlYyQxNmQxYjg3MCQ2NDAxYThjMEBuZXdsYXA+"},"prevInTopic":18724,"nextInTopic":0,"prevInTime":18724,"nextInTime":18726,"topicId":18720,"numMessagesInTopic":0,"msgSnippet":"Wow...very comforting and reassuring to read...thanks! (from a 3 month old unschooling newbie!) Amy in WV","messageBody":"<div id=\"ygrps-yiv-1123622244\">Wow...very comforting and reassuring to read...thanks!<br/>\n<br/>\n(from a 3 month old unschooling newbie!)<br/>\nAmy in WV</div>","specialLinks":[]},{"userId":58929735,"authorName":"Schafer Vanessa","from":"Schafer Vanessa &lt;psychomom95@...&gt;","profile":"psychomom95","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Dreams come true, they really do","postDate":"1162426311","msgId":18724,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYxMTAyMDAxMTUxLjk5OTgxLnFtYWlsQHdlYjYwODIwLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDAwNTQwMWM2ZmRlYyQxNmQxYjg3MCQ2NDAxYThjMEBuZXdsYXA+"},"prevInTopic":18720,"nextInTopic":18725,"prevInTime":18723,"nextInTime":18725,"topicId":18720,"numMessagesInTopic":0,"msgSnippet":"Carol, Thanks for sharing your story.  It s really neat to see how well unschooling works with other families. Our family is new to this, so we are still ","messageBody":"<div id=\"ygrps-yiv-1900078833\">Carol,<br/>\n<br/>\nThanks for sharing your story.  It&#39;s really neat to<br/>\nsee how well unschooling works with other families. <br/>\nOur family is new to this, so we are still<br/>\ndeschooling.  My dd had just finished 3rd grade when<br/>\nwe pulled her out, and my ds had just finished 4th<br/>\ngrade.  We have only been doing this since the<br/>\nbeginning of September, and I have already noticed a<br/>\nchange for the better in both of my kids.  Public<br/>\nschools killed their love of learning, and hopefully<br/>\nsomeday they will get it back.  I know it all takes<br/>\ntime, and I myself also need to deschool.  I know we<br/>\nmade the right choice, and listening to your story,<br/>\nhas helped in a huge way.  Thanks again!!!!<br/>\n<br/>\n<br/>\n----Vanessa<br/>\n<br/>\n--- camden &lt;ccoutlaw@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This  is for all the newbies & all the people who<br/>\n&gt; have reached their dream & in turn are helping us<br/>\n&gt; realize our dream.  We&#39;ve come along way baby ;)<br/>\n&gt; <br/>\n&gt; When I came to this list ( and another local list )<br/>\n&gt; over a year ago, boy was I stuck.  I was stuck in my<br/>\n&gt; way of thinking but also determined enough to change<br/>\n&gt; our lives for the better.  I was the picture of<br/>\n&gt; &quot;school at home&quot;. We had schedules, grades, you name<br/>\n&gt; it we did it.  Slowly I began to go &quot;eclectic&quot;.  Not<br/>\n&gt; much different ~ same tears~ mine & theirs. Then<br/>\n&gt; came this unconventional idea UNSCHOOLING !<br/>\n&gt; <br/>\n&gt; At that point our lives began to change.  We<br/>\n&gt; deschooled big time. Actually I think some of us are<br/>\n&gt; still deschooling (me especially). When your done<br/>\n&gt; you&#39;ll know it, for some its really  quick and for<br/>\n&gt; others it may take years.<br/>\n&gt; <br/>\n&gt; Control was a big issue in our family.  For example<br/>\n&gt; food !  My mom was a member of the clean your plate<br/>\n&gt; club.  The membership was passed down to me (my butt<br/>\n&gt; can attest to that ;). Over a year ago we would have<br/>\n&gt; had rules about the amount of Halloween candy they<br/>\n&gt; could eat all at once. We let go of that and<br/>\n&gt; although at first they ate &quot;junk  food&quot; like crazy,<br/>\n&gt; last night we had a huge bowl of candy & other<br/>\n&gt; goodies we had made and they didn&#39;t even hardly<br/>\n&gt; touch it.  They ate very little today.  They now<br/>\n&gt; realize it will be there when they want it & if they<br/>\n&gt; want a piece or a bowlful ~ its okay !  We also have<br/>\n&gt; moved past the &quot;junk food&quot; label and kids can make<br/>\n&gt; great choices in what they eat.  It may not be the<br/>\n&gt; same thing their dad or I eat but they definitely do<br/>\n&gt; not sit around eating nothing but candy either. <br/>\n&gt; Trust ~ what a concept !!!<br/>\n&gt; <br/>\n&gt; My dh is very understanding. He does support us. He<br/>\n&gt; still has his doubts at times but he only voices<br/>\n&gt; them to me now.  This is a major step for him but it<br/>\n&gt; took over a year for this to happen.<br/>\n&gt; <br/>\n&gt; For all the people out here wondering if their kids<br/>\n&gt; will &quot;ever do anything&quot;.  They do !!! When they are<br/>\n&gt; ready.  Even when you are deschooling they are still<br/>\n&gt; learning & doing something.   My ds (13 - who has<br/>\n&gt; some developmental delays) hadn&#39;t really picked up a<br/>\n&gt; pen for almost a year is now in the process of<br/>\n&gt; writing a story about squirrels. He is doing<br/>\n&gt; research on the computer  and writing rough drafts<br/>\n&gt; for me to read. He wants to make sure is spelling is<br/>\n&gt; right before he writes it in the journal he picked<br/>\n&gt; out.<br/>\n&gt; <br/>\n&gt; It is so amazing to see him doing something like<br/>\n&gt; this. Public school & I squashed his love of<br/>\n&gt; learning in the beginning.  Now  he loves doing this<br/>\n&gt; because its what he is interested in, not what I or<br/>\n&gt; the school pushed on him.<br/>\n&gt; <br/>\n&gt; And he is not the only one, my dd (10) has a dozen<br/>\n&gt; stories she&#39;s working on.  She is very creative & I<br/>\n&gt; now see that side of her, didn&#39;t before as we were<br/>\n&gt; so worried about keeping up with the other kids -<br/>\n&gt; not just public school either.  Some homeschool kids<br/>\n&gt; & parents can get pretty aggressively competitive.<br/>\n&gt; <br/>\n&gt; My 15 yr ds, took guitar lessons when he was about 7<br/>\n&gt; and hated it. Of course at the time , I said the old<br/>\n&gt; &quot; you wanted to do this for music, you have to<br/>\n&gt; finish the year&quot;.   Did he learn to play the guitar<br/>\n&gt; ?  Duh, no !  What does he do every night now?  He&#39;s<br/>\n&gt; teaching himself to play the guitar ! I&#39;m off<br/>\n&gt; Thursday to buy him a new one !<br/>\n&gt; <br/>\n&gt; As for the younger kids ~ don&#39;t worry. Our youngest<br/>\n&gt; is 7. He has never been made to do anything<br/>\n&gt; &quot;schoolish&quot;.  No he is not an avid reader, but he<br/>\n&gt; picks stuff up from us reading to him, using the<br/>\n&gt; computer & video games.  There are days he pulls out<br/>\n&gt; a workbook that&#39;s in the closet & does tons of<br/>\n&gt; pages, but only because he wants to.  There are<br/>\n&gt; weeks that go by that he doesn&#39;t want to do anything<br/>\n&gt; like that and its okay.  There are days I spend<br/>\n&gt; hours spelling things for him, as he wants to make a<br/>\n&gt; list of things.<br/>\n&gt; <br/>\n&gt; Our two youngest have never been to public school<br/>\n&gt; and their perceptions of learning are so different<br/>\n&gt; then the rest of the family.  Learning is something<br/>\n&gt; they just DO ;)  They don&#39;t separate it from life.<br/>\n&gt; <br/>\n&gt; I am learning to do this. But after 15 years of<br/>\n&gt; schooling it&#39;s taking me a bit to get my stuff<br/>\n&gt; together.  I just last week discovered I love jazz &<br/>\n&gt; blues music.  The kids and I went to the music store<br/>\n&gt; & bought all kinds of different music.  It was<br/>\n&gt; great. Why did it take me so long? I couldn&#39;t let go<br/>\n&gt; of the path I had been on for so long.  I was stuck<br/>\n&gt; with my wheels just spinning.<br/>\n&gt; <br/>\n&gt; Thanks for all the advice. Thanks for making me<br/>\n&gt; question myself again & again. Thanks for not<br/>\n&gt; &quot;babying&quot; me when that&#39;s what I wanted but not what<br/>\n&gt; I needed. And most of all thanks for all the<br/>\n&gt; patience !!<br/>\n&gt; <br/>\n&gt; So have faith in yourself & your children !  Life is<br/>\n&gt; amazing when you let it be.<br/>\n&gt; <br/>\n&gt; Carol <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been<br/>\n&gt; removed]<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n <br/>\n </span></blockquote>____________________________________________________________________________________<br/>\nCheap Talk? Check out Yahoo! Messenger&#39;s low PC-to-Phone call rates <br/>\n(http://voice.yahoo.com)</div>","specialLinks":[]},{"userId":263883708,"authorName":"camden","from":"&quot;camden&quot; &lt;ccoutlaw@...&gt;","profile":"ccoutlaw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Dreams come true, they really do","postDate":"1162409371","msgId":18720,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNTQwMWM2ZmRlYyQxNmQxYjg3MCQ2NDAxYThjMEBuZXdsYXA+"},"prevInTopic":0,"nextInTopic":18724,"prevInTime":18719,"nextInTime":18721,"topicId":18720,"numMessagesInTopic":0,"msgSnippet":"This  is for all the newbies & all the people who have reached their dream & in turn are helping us realize our dream.  We ve come along way baby ;) When I","messageBody":"<div id=\"ygrps-yiv-606748369\">This  is for all the newbies & all the people who have reached their dream & in turn are helping us realize our dream.  We&#39;ve come along way baby ;)<br/>\n<br/>\nWhen I came to this list ( and another local list ) over a year ago, boy was I stuck.  I was stuck in my way of thinking but also determined enough to change our lives for the better.  I was the picture of &quot;school at home&quot;. We had schedules, grades, you name it we did it.  Slowly I began to go &quot;eclectic&quot;.  Not much different ~ same tears~ mine & theirs. Then came this unconventional idea UNSCHOOLING !<br/>\n<br/>\nAt that point our lives began to change.  We deschooled big time. Actually I think some of us are still deschooling (me especially). When your done you&#39;ll know it, for some its really  quick and for others it may take years.<br/>\n<br/>\nControl was a big issue in our family.  For example food !  My mom was a member of the clean your plate club.  The membership was passed down to me (my butt can attest to that ;). Over a year ago we would have had rules about the amount of Halloween candy they could eat all at once. We let go of that and although at first they ate &quot;junk  food&quot; like crazy, last night we had a huge bowl of candy & other goodies we had made and they didn&#39;t even hardly touch it.  They ate very little today.  They now realize it will be there when they want it & if they want a piece or a bowlful ~ its okay !  We also have moved past the &quot;junk food&quot; label and kids can make great choices in what they eat.  It may not be the same thing their dad or I eat but they definitely do not sit around eating nothing but candy either.  Trust ~ what a concept !!!<br/>\n<br/>\nMy dh is very understanding. He does support us. He still has his doubts at times but he only voices them to me now.  This is a major step for him but it took over a year for this to happen.<br/>\n<br/>\nFor all the people out here wondering if their kids will &quot;ever do anything&quot;.  They do !!! When they are ready.  Even when you are deschooling they are still learning & doing something.   My ds (13 - who has some developmental delays) hadn&#39;t really picked up a pen for almost a year is now in the process of writing a story about squirrels. He is doing research on the computer  and writing rough drafts for me to read. He wants to make sure is spelling is right before he writes it in the journal he picked out.<br/>\n<br/>\nIt is so amazing to see him doing something like this. Public school & I squashed his love of learning in the beginning.  Now  he loves doing this because its what he is interested in, not what I or the school pushed on him.<br/>\n<br/>\nAnd he is not the only one, my dd (10) has a dozen stories she&#39;s working on.  She is very creative & I now see that side of her, didn&#39;t before as we were so worried about keeping up with the other kids - not just public school either.  Some homeschool kids & parents can get pretty aggressively competitive.<br/>\n<br/>\nMy 15 yr ds, took guitar lessons when he was about 7 and hated it. Of course at the time , I said the old &quot; you wanted to do this for music, you have to finish the year&quot;.   Did he learn to play the guitar ?  Duh, no !  What does he do every night now?  He&#39;s teaching himself to play the guitar ! I&#39;m off Thursday to buy him a new one !<br/>\n<br/>\nAs for the younger kids ~ don&#39;t worry. Our youngest is 7. He has never been made to do anything &quot;schoolish&quot;.  No he is not an avid reader, but he picks stuff up from us reading to him, using the computer & video games.  There are days he pulls out a workbook that&#39;s in the closet & does tons of pages, but only because he wants to.  There are weeks that go by that he doesn&#39;t want to do anything like that and its okay.  There are days I spend hours spelling things for him, as he wants to make a list of things.<br/>\n<br/>\nOur two youngest have never been to public school and their perceptions of learning are so different then the rest of the family.  Learning is something they just DO ;)  They don&#39;t separate it from life.<br/>\n<br/>\nI am learning to do this. But after 15 years of schooling it&#39;s taking me a bit to get my stuff together.  I just last week discovered I love jazz & blues music.  The kids and I went to the music store & bought all kinds of different music.  It was great. Why did it take me so long? I couldn&#39;t let go of the path I had been on for so long.  I was stuck with my wheels just spinning.<br/>\n<br/>\nThanks for all the advice. Thanks for making me question myself again & again. Thanks for not &quot;babying&quot; me when that&#39;s what I wanted but not what I needed. And most of all thanks for all the patience !!<br/>\n<br/>\nSo have faith in yourself & your children !  Life is amazing when you let it be.<br/>\n<br/>\nCarol <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":18709,"nextTopicId":18728}}