{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":69,"messages":[{"userId":205483142,"authorName":"Melissa","from":"&quot;Melissa&quot; &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Why I unschool","postDate":"1170815711","msgId":21224,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVxYmRzditjOHRkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMzcwMWM3NGE1YiQxZGI0YjU1MCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":21223,"nextInTopic":21225,"prevInTime":21223,"nextInTime":21225,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"Deb, Deb, Deb...thanks for the perfect wording for me. We ve been here for a bit, but just didn t know how to say it. I think I ll cross stitch it in a big","messageBody":"<div id=\"ygrps-yiv-907011506\">Deb, Deb, Deb...thanks for the perfect wording for me. We&#39;ve been here for a bit, but just <br/>\ndidn&#39;t know how to say it. I think I&#39;ll cross stitch it in a big sampler to go over the fireplace <br/>\n:-)<br/>\n<br/>\nOn to the post, I just wrote  a blog (that I think is in the unschooling voices) about how for <br/>\nme it was difficult to deschool because I was so caught up in the idea of proving myself to <br/>\nother unschoolers that I was as unschoolie as they were. Thank heavens I got past that, <br/>\nbecause it is a terrible self-burden that decreases your ability to have fun. <br/>\n<br/>\nNo one has a perfect life, but what you&#39;ll find is that those who are able to focus on the <br/>\npositive usually have a happier life. Those who aren&#39;t trying to find answers everywhere <br/>\nbut from within find answers that fit their family. <br/>\n<br/>\nWe&#39;re unschooling seven children, several with disabilities. It&#39;s very hard. Sometimes I was <br/>\nan only parent, when dh was TDY with the air force...thankfully that&#39;s over, but there are <br/>\nstill days when he&#39;s gone more than he&#39;s here. I&#39;m tired, I&#39;m bruised from a meltdown, it&#39;s <br/>\nhard work. But I don&#39;t want to focus on those things because once that happens, then <br/>\n(how did someone put it) the seductive draw of depression? can exponentially suck you <br/>\ndown!<br/>\n<br/>\nNow it&#39;s too late and I don&#39;t know if I&#39;m making sense. We were expecting a baby but she <br/>\nwas born on Sunday afternoon, far too early to survive. We had turned down a really <br/>\nimportant placement (possible adoption) with two girls because of the pregnancy, so now I <br/>\nfeel like I&#39;ve lost three girls in less than a month. But I think of Diana, and the Jenner <br/>\nfamily, and know that we&#39;ve learned so much from her wisdom and grace. While we&#39;re sad, <br/>\nwe were able to rejoice in her role in our lives...and celebrate it. Off topic from the post, I <br/>\nknow, but kind of just throwing it in. <br/>\n<br/>\nMuch love<br/>\nMelissa<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Deb Lewis&quot; &lt;d.lewis@...&gt; wrote:<br/>\n&gt;<br/>\nBut we still found ways to have fun, to stay focused on what was important<br/>\nand to be joyful.   It&#39;s not how good you have it, it&#39;s how good you make<br/>\nit. </span></blockquote></div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Why I unschool","postDate":"1170813359","msgId":21223,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzcwMWM3NGE1YiQxZGI0YjU1MCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":21222,"nextInTopic":21224,"prevInTime":21222,"nextInTime":21224,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"***First, its apparent to me that the majority of people who are movers and shakers in the online unschooling comunity lead relatively speaking, picturesque","messageBody":"<div id=\"ygrps-yiv-1264841588\">***First, its apparent to me that the majority of people who are movers and<br/>\nshakers in the online unschooling comunity lead relatively speaking,<br/>\npicturesque lives. ***<br/>\n<br/>\nThis is a false assumption.   Diana Jenner, who is active on several lists<br/>\nincluding Always Learning and Unschooling Discussion, and who will be<br/>\nspeaking at the Life Is Good NW. Unschooling Conference in Corvallis, OR. in<br/>\nApril, has lost a husband and a child and is unschooling her young son.<br/>\n<br/>\nWhile I&#39;m not a mover or a shaker I have taken care of two family members at<br/>\nhome during their final illness - my father when Dylan was eight and my<br/>\nfather in law when Dylan was nine,  we continue to help my mother in law <br/>\nduring her ongoing battle with<br/>\ndepression and anxiety, and for the last year I have been taking care of my <br/>\nmother who has Alzheimer&#39;s disease, while my<br/>\nhusband works away from home.  I have a job, two cats who have serious <br/>\nmedical<br/>\nconditions (read: astronomical vet bills and worry)  and a kid who has<br/>\narthritis.<br/>\n<br/>\nWe have been so broke that we ate beans and rice for months, disconnected<br/>\nour cable TV, set the thermostat as low as we could stand it, sold off <br/>\nbeloved furniture I inherited from a Great Aunt<br/>\nand scrounged in other ways to make ends meet when they couldn&#39;t possibly <br/>\nmeet.<br/>\n<br/>\nBut we still found ways to have fun, to stay focused on what was important<br/>\nand to be joyful.   It&#39;s not how good you have it, it&#39;s how good you make<br/>\nit.<br/>\n<br/>\nEveryone can choose to live in a way that builds a better<br/>\nrelationship between parent and child.  But a person has to want that more<br/>\nthan they want to find excuses why it isn&#39;t happening or won&#39;t work.  It&#39;s <br/>\nnot easy to pull oneself out of the seductive comfort of depression but it&#39;s <br/>\npossible and it&#39;s necessary if kids are going to be happy and unschooling is <br/>\ngoing to have a chance of working.<br/>\n<br/>\nOn these lists we give examples of what works to keep a family together, to<br/>\nmake life joyful in spite of our challenges and to move us in a positive<br/>\ndirection.<br/>\n<br/>\nI think it&#39;s a cop out, frankly, to say &quot;yeah, well, you don&#39;t know how hard<br/>\nI have it.&quot;   If I had to bet, I&#39;d say very few unschoolers have a stress<br/>\nfree, problem free life.   The difference between the people who make<br/>\nunschooling a success and the people who flounder is not perfect life<br/>\nconditions, it&#39;s attitude.<br/>\n<br/>\n***Many parents are negotiating repeatedly with a non- custodial coparent<br/>\nwhere finding middle ground that won&#39;t mean perfect unschooling is<br/>\nneeded.***<br/>\n<br/>\nPerfect unschooling shouldn&#39;t be the priority.  The best life for the child<br/>\nshould be.  What makes the most sense and will provide the most stability<br/>\nand safety and happiness for the child?   Sometimes people can&#39;t unschool.<br/>\nBut parents can still live sweetly with children, still live and interact in<br/>\nways that build the relationship and a stable happy home life.<br/>\n<br/>\n***Parenting two year olds is freaking hard. And doing it non-coercively has <br/>\nme drinking alcoholically at night.***<br/>\n<br/>\nI know it&#39;s hard.  I&#39;m sorry you&#39;re struggling.  If I was your neighbor I&#39;d <br/>\ncome get your kids so you could sleep.  But it&#39;s just pure bullshit to claim <br/>\nthat trying to be a good parent makes you drink.<br/>\n<br/>\n***There seem to be a plethora of folks with one child who is like 7-10 on<br/>\nthe boards ***<br/>\n<br/>\nMost people who have a seven or ten year old also had a two year old.  Most<br/>\nparents lived through those years of little sleep, no time alone, no time<br/>\nwithout a child attached to them in one way or another, money problems,<br/>\nrelationship problems...<br/>\n<br/>\nWhen you write to the lists or boards you might clearly state your<br/>\nsituation - Single, coping with uncooperative co parent, two little kids, <br/>\nlimited energy,  money<br/>\nproblems, stress.  There are families who have lived through<br/>\nsimilar situations.  And even if a parent of one ten year old hasn&#39;t lived <br/>\nyour exact situation she may have good ideas for you,<br/>\nbut you won&#39;t see them if you can&#39;t change your focus.<br/>\n<br/>\n***It&#39;s all Sandra Dodd all the time. Literally, it is the ONLY link anyone <br/>\nevery offers up. ***<br/>\n<br/>\nI&#39;ve seen other links offered.   Joyce Fetteroll&#39;s site, Ren Allen&#39;s, <br/>\nDanielle Conger&#39;s, links to the message boards, to other lists.   Sandra&#39;s <br/>\nsite is offered a lot because Sandra has spent years writing about <br/>\nunschooling and collecting the writings of others and has taken the time to <br/>\nbuild a site.   Anyone can do that, collect writings or links they think are <br/>\nhelpful and put them in one place.<br/>\n<br/>\nThe unschooling blogs are wonderful because you really get a sense of family <br/>\nlife for lots of unschoolers and clearly, many people struggle with some of <br/>\nthe same issues you&#39;re having.<br/>\n<br/>\nAnd ultimately, the success of and responsibility for any individual&#39;s <br/>\nunschooling life is up to them.  Sandra Dodd&#39;s happy and successful life is <br/>\na little glimpse of what anyone might find if they choose that.   Her <br/>\nhappiness isn&#39;t causing your unhappiness.<br/>\n<br/>\n***For some reason, the unschooling online culture has evolved to be a <br/>\nlargely volatile and verbally abusive one.***<br/>\n<br/>\nThere are hundreds of lists and they are as active or as interesting as the <br/>\nposting members make them.   I don&#39;t personally find frank or blunt <br/>\nquestions or advice to be abusive, but I&#39;ve read that others do think so. <br/>\nMy feeling is that any adult coming to a discussion list has the ability to <br/>\nread the archives and see what the discussions are typically like - before <br/>\nthey ever post - in order to see if the list is a good fit for them .   Not <br/>\neveryone appreciates straightforward kinds of discussion.  Some people are <br/>\nlooking for a gentle support list, but the responsibility of finding the <br/>\nright list lies with the individual.   It&#39;s not the job of any particular <br/>\nlist to become what each listmember needs the most at any given time.   I <br/>\ndon&#39;t know how to address this problem except to say, keep looking, or as <br/>\nSchuyler suggested, start a list for single, struggling moms with younger <br/>\nchildren.   I would be happy to look for lists for you and send you the <br/>\nlinks.<br/>\n<br/>\n***But some people do get it, theoretically, but they are having concrete <br/>\nissues in their families where the paradigm isn&#39;t flowing beautifully and <br/>\nthey need help. I see this especially with the total lifestyle aspects of <br/>\nunschooling. The non- academic stuff like bedtimes, communication, food, <br/>\nmedia. ***<br/>\n<br/>\nI think this is where the lists are most helpful, when people understand the <br/>\nconcept but aren&#39;t sure how to implement it or need ideas for coping.<br/>\n<br/>\n***But I also am of the opinion that parental stress reduction and coping <br/>\ngets a bad rap. To my mind, considering my need for sleep, food, exercise <br/>\netc... is essential to my kids wellbeing and happiness. Combining this with <br/>\nthe fact of my being the only parent, broke and so on means that how I <br/>\nachieve those goals will sometimes look like a deviation from &quot;real&quot; <br/>\nunschooling. And it means that I won&#39;t always figure out the win/win before <br/>\nI give up and do what I need to do. So I just try again, think that scenario <br/>\nahead and look for a better solution.  But this process I am describing <br/>\ndoesn&#39;t really get talked about in this online world except to judge it as <br/>\nbeing wrong.***<br/>\n<br/>\nI think when it&#39;s discussed it&#39;s often presented as a parent vs. kid kind of <br/>\nthing.  Some mom will say &quot;I need to take care of myself FIRST&quot; and others <br/>\nsay, &quot;You have a kid who can&#39;t wait.&quot;   It is possible to meet our own needs <br/>\nand the needs of our kids simultaneously.   Kids really should not have to <br/>\nwait for parents to be emotionally ready.  Parents really do need to get it <br/>\ntogether for their kids sake.  We don&#39;t have a lot of time.   But I also see <br/>\nthat it&#39;s talked about superficially sometimes and I think that&#39;s because <br/>\nmost people who have some time to write to lists don&#39;t really have as much <br/>\ntime as it would take, or aren&#39;t really sure how to coach a stranger through <br/>\nemotional difficulties.  This is often beyond what a list can do.<br/>\n<br/>\nI have seen some really good advice though, and so maybe sometimes it&#39;s that <br/>\nthe advice a mom under stress needs isn&#39;t coming as fast or in the <br/>\nquantities she could use it.  What can be done about that?   Maybe we can <br/>\nset up a resource page and link to writings by specific topic.  &quot;How can a <br/>\nsingle mom of little kids recharge her batteries and still be connected to <br/>\nher kids?&quot;<br/>\n<br/>\nI had a partner who would bounce the baby while I sank into a tub for twenty <br/>\nminutes, or went for a run, or just sat and stared into space if that&#39;s what <br/>\nI needed.  Can you call a friend over a few times a week so you could do the <br/>\nsame?   Can you ask someone from your church?  Can you make a room with <br/>\nmattresses on the floor and blankets and a TV so you could close the door <br/>\nand keep your little kids close by, watching a favorite movie while you nap?<br/>\n<br/>\nI still live on four hours sleep a night, the amount I got (finally) <br/>\nstraight through when Dylan was little.  I was sick recently and surprised <br/>\nmyself by sleeping ten hours, something I haven&#39;t done since I was teen <br/>\naged.   I remember those days with a demanding baby and thinking I might <br/>\nreally die from exhaustion.  I&#39;d nap if he fell asleep while nursing but <br/>\nthat wouldn&#39;t have been an option if I had another little one toddling <br/>\naround.   What are your sleep needs?  What are your self care needs?   A <br/>\nfriend of mine who was a single mom in college when her kids were small <br/>\nslept on the sofa in small snatches of time,  with her legs over the legs of <br/>\nher little kids while they watched a video.  That way she usually felt if <br/>\none of them got down.<br/>\n<br/>\nIt&#39;s better your life look like a happy place for kids than look like &quot;real <br/>\nunschooling.&quot;  Really.  If you&#39;re agonizing that you might not be meeting <br/>\nsome standard of unschooling then stop that. &lt;g&gt;   Be the best mom to your <br/>\nkids.  Make your home joyful and sweet.  With little kids you don&#39;t have to <br/>\nbe thinking about what &quot;real&quot; unschooling is anyway, but thinking about what <br/>\nmakes life really safe and lovely for your kids and what builds your <br/>\nrelationship with them.<br/>\n<br/>\nPart of why I believe so strongly in unschooling is that I believe parents <br/>\nhave a moral responsibility to make the absolute best life possible for <br/>\ntheir children before anything else.  So my advice will probably always be <br/>\nto take care of children first.<br/>\n<br/>\n ***I have considered starting a new list called something like &quot;unschooling <br/>\nfor freaks&quot;***<br/>\n<br/>\nYeah, I&#39;d use a different name.&lt;g&gt;  I encourage you to start a list for <br/>\nsingle struggling moms, yes.   But I caution that sometimes, as comforting <br/>\nas a support list might be, it has the potential to become one more excuse <br/>\nfor not making real changes in ourselves and in our lives that will move us <br/>\nin a positive direction.  There&#39;s danger in commiseration in that it often <br/>\ncloses the door on progress toward something better.  Sometimes, as much as <br/>\nwe want to hear someone confirm that life sucks, it&#39;s better for our kids to <br/>\nhave someone say to us, &quot;GET UP and DO something about it.&quot;<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":279433414,"authorName":"lelania1","from":"&quot;lelania1&quot; &lt;ckmidwife@...&gt;","profile":"lelania1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Why I unschool","postDate":"1170811998","msgId":21227,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVxYmE4dSt0cDZxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwNWEwMWM3NGE0NyQyMmQxM2Q2MCQ0MDAxYThjMEBEYXZpZD4="},"prevInTopic":21226,"nextInTopic":21228,"prevInTime":21226,"nextInTime":21228,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"Hi Schuyler- ... household ... scenario, where ... agreements, I ... without ... doesn t ... It can be hard, and even ugly. But negotiation goes a long way.","messageBody":"<div id=\"ygrps-yiv-949306539\">Hi Schuyler-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; I don&#39;t <br/>\n&gt; know how possible it is to unschool when you are negotiating with a <br/>\n&gt; non-custodial parent. It isn&#39;t really possible to unschool in an <br/>\n </span></blockquote>household <br/>\n<blockquote><span title=\"ireply\"> &gt; with two parents if one parent doesn&#39;t agree. And having the added <br/>\n&gt; limitation of whatever tensions there are in a post-divorce <br/>\n </span></blockquote>scenario, where <br/>\n<blockquote><span title=\"ireply\"> &gt; custody may be an issue or where there may be shared custody <br/>\n </span></blockquote>agreements, I <br/>\n<blockquote><span title=\"ireply\"> &gt; can only imagine how difficult a tightwire performance it must be <br/>\n </span></blockquote>without <br/>\n<blockquote><span title=\"ireply\"> &gt; throwing the difficulty of demonstrating learning to someone who <br/>\n </span></blockquote>doesn&#39;t <br/>\n<blockquote><span title=\"ireply\"> &gt; even approve of homeschooling.&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>It can be hard, and even ugly. But negotiation goes a long way. You <br/>\nare probably right that complete RU can&#39;t be realized in the above <br/>\nscenarios, but all is not lost. I like to see this journey as a <br/>\ncontinuum. There are places where some of us are having to compromise <br/>\nwhat we would ideally like, but it doesn&#39;t make us &quot;schooling&quot;, and <br/>\nit doesn&#39;t mean that in a few days, weeks or months things can&#39;t be <br/>\ndifferent. Even when someone is really far from an RU life, I still <br/>\nthink there is benefit to this exposure for their interactions with <br/>\ntheir kids. It doesn&#39;t need to be all or nothing to be positive. <br/>\n<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; rather than have us give you sympathy about how hard having a 2 <br/>\n </span></blockquote>year old is <br/>\n<blockquote><span title=\"ireply\"> &gt; so that you can feel justified in either your coercive responses or <br/>\n </span></blockquote>in your <br/>\n<blockquote><span title=\"ireply\"> &gt; alcoholic tendencies, surely helping you to be find ways to be a <br/>\n </span></blockquote>calmer and <br/>\n<blockquote><span title=\"ireply\"> &gt; more patient parent would be more useful. And I think this list is <br/>\n </span></blockquote>rich with <br/>\n<blockquote><span title=\"ireply\"> &gt; empathy.&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>I still don&#39;t get why its an either/or. If kids communication needs <br/>\nare best met in an environment of empathy and support, why wouldn&#39;t <br/>\nthat be true for an adult? Being supportive and empathetic doesn&#39;t <br/>\nrequire you to let go of your beliefs. But it might require people to <br/>\nbe more creative in imagining WHY a person is using parenting <br/>\napproaches that are coercive and authoritative.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;But Sandra has put together such an amazing resource it <br/>\n&gt; would be a shame to ignore it. And it would serve no purpose to <br/>\n </span></blockquote>ignore it.&gt;&gt;&gt;<br/>\n<br/>\nAnd I  said as much myself. But it doesn&#39;t change the fact that its <br/>\none person, with one perspective and as a statement of fact, that <br/>\nlimits its application to a diverse group of people.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; Than do it. Create a list. I&#39;m sure you could invite people to <br/>\n </span></blockquote>join on this <br/>\n<blockquote><span title=\"ireply\"> &gt; list and on other lists. There isn&#39;t any loyalty card for staying <br/>\n </span></blockquote>with the <br/>\n<blockquote><span title=\"ireply\"> &gt; already established lists. For me though, the reason why these <br/>\n </span></blockquote>lists work is <br/>\n<blockquote><span title=\"ireply\"> &gt; because they aren&#39;t there to support you at this stage, they are <br/>\n </span></blockquote>there to <br/>\n<blockquote><span title=\"ireply\"> &gt; help you see ways to get to the next stage.<br/>\n<br/>\n </span></blockquote>No one can ever be anywhere but where they are. It might be <br/>\nfrustrating to see people here all the way at chapter one when you <br/>\nsee yourself at the endnotes, but telling them to read faster doesn&#39;t <br/>\nreally help. When people get support and empathy, they learn faster <br/>\nand they make progress. Seeing ways to get to the next stage was what <br/>\nthis discussion was about for me. I tried to suggest alternate <br/>\nreasons why some people coming to RU new feel so stuck, or like they <br/>\ndon&#39;t get it. Clearly those thoughts didn&#39;t resonate with your <br/>\nexperiences. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;So a list that told me that in the face <br/>\n&gt; of whatever difficulties I found myself using coercion to get my <br/>\n </span></blockquote>children to <br/>\n<blockquote><span title=\"ireply\"> &gt; do what I wanted was justified wouldn&#39;t work for me.&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>This is the black and white thinking I was referring to. If we use <br/>\ntough love, people will unschool. If we show understanding for the <br/>\ndiversity of peoples lives and the challenges people have <br/>\nimplementing what we are talking about then that means we are <br/>\njustifying coercion.<br/>\nI have a different philosophy about what helps people make changes. I <br/>\nhaven&#39;t seen people make changes because they are shamed, ridiculed, <br/>\nbullied, threatened or isolated. I have seen people make changes <br/>\ngenerally pretty slowly. And often with a lot of &quot;I can&#39;t&quot; along the <br/>\nway. And the &quot;I can&#39;t&quot; is real for them. I accept where people are <br/>\nbecause I choose only to accept and believe what is reality. I meet <br/>\npeople where they are. That doesn&#39;t mean wherever someone is is OK. <br/>\nIt doesn&#39;t mean where they are is where they will always be. IT just <br/>\nmeans they are there. I realize that people often need to make <br/>\nchanges in stages, and do so within their own comfort zone. That&#39;s <br/>\nprobably how most people went into RU. They tried things out where <br/>\nthey could, and gained confidence to change more. Their kids also got <br/>\nolder and stuff changed in their practical day to day coping. It&#39;s <br/>\nfrustrating watching other people make changes when you feel like <br/>\nyour on the other side. Maybe your process was easy. There are <br/>\npractical reasons why its going to be more of a struggle for some <br/>\npeople. That doesn&#39;t mean they shouldn&#39;t try and keep trying.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;If I want justification <br/>\n&gt; for timeouts or for putting limits on my children I can find them <br/>\n&gt; everywhere.<br/>\n<br/>\n </span></blockquote>And by people who sound very understanding and empathetic which is <br/>\nwhy so many parents go that route. They feel like they are understood <br/>\nand heard, and therefore this person must have the answer. People are <br/>\nlooking for things that work. And sometimes there aren&#39;t really <br/>\nthings that work. There is doing the best you can, and knowing <br/>\ntomorrow is another day. I agree with what you said in a  different <br/>\npost about recognizing that childhood isn&#39;t forever. I would add that <br/>\nwe have to balance that with believeing that every shortcoming is the <br/>\nend of our childrens chance at an emotionally healthy future. You <br/>\ndidn&#39;t say that it was, I am refering more genrally to RU forums.<br/>\ncarrie</div>","specialLinks":[]},{"userId":279433414,"authorName":"lelania1","from":"&quot;lelania1&quot; &lt;ckmidwife@...&gt;","profile":"lelania1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Why I unschool","postDate":"1170804806","msgId":21226,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVxYjM4NitqZ240QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDcwMjA2MjE0NTQ4LjI5MDI3LnFtYWlsQHdlYjU0NDA1Lm1haWwueWFob28uY29tPg=="},"prevInTopic":21225,"nextInTopic":21227,"prevInTime":21225,"nextInTime":21227,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"... I find most do state this upfront. But it isn t always easy to think up solutions to problems you don t have yourself and I can understand that. I tend to","messageBody":"<div id=\"ygrps-yiv-2015803284\"><blockquote><span title=\"ireply\">&gt; Most people on this list are writing about their own<br/>\n&gt; experiences. Since most of us do live in two adult<br/>\n&gt; households, most of the solutions that we present are<br/>\n&gt; going to involve that scenario. If you as a single<br/>\n&gt; parent have an actual problem that you&#39;re looking for<br/>\n&gt; suggestions for, you need to state that fact upfront,<br/>\n&gt; so people can brainstorm about possible solutions that<br/>\n&gt; may work for you.<br/>\n<br/>\n </span></blockquote>I find most do state this upfront. But it isn&#39;t always easy to think <br/>\nup solutions to problems you don&#39;t have yourself and I can understand <br/>\nthat. I tend to respond to those posts, but offlist because I have <br/>\nbeen attacked for sharing thoughts that don&#39;t make the RU bar. By the <br/>\nway, are you sure most people here are two parent families? Or just <br/>\nthe people who are vocal? I don&#39;t know, personally, but it seems like <br/>\non every list the number of people who post is a fraction of the <br/>\ntotal volume subscribed. Maybe there are more diverse family <br/>\nstructures than you&#39;re imagining. <br/>\nIn any event, you are right that people post from their own <br/>\nexperiences, and in the RU world it does seem to be largely two <br/>\nparent families. But the fact remains, those experiences may not meet <br/>\nthe needs of every family thus my point that the frustration some <br/>\nfolks have with people who &quot;don&#39;t get it&quot; could be due to difficulty <br/>\nunderstanding those different needs. Sometimes people DO get it, <br/>\nbut &quot;it&quot; isn&#39;t easily working in their household. Unschooling can <br/>\nwork for all kinds of people, and it helps for all of us to have an <br/>\nideal out there to be working toward. But process is just as <br/>\nimportant.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Parenting<br/>\n&gt; &gt; two year olds is freaking hard. And doing it<br/>\n&gt; &gt; non-coercively has me drinking alcoholically at<br/>\n&gt; &gt; night. <br/>\n&gt; I hope you&#39;re exaggerating here to make point. If not,<br/>\n&gt; you&#39;ve bigger problems than an uncshooling list can<br/>\n&gt; solve.<br/>\n<br/>\n </span></blockquote>My post didn&#39;t ask you to solve any problem for me, but yes I was <br/>\nmaking a joke. Truth be told, many of my mommy friends HAVE taken to <br/>\ndrinking at night which concerns me sometimes. But I can also <br/>\nunderstand it. personally, I don&#39;t drink because both my parents are <br/>\naddicted. But I have very seriously wanted to at the end of 16 hour <br/>\ndays with my kids. I doubt this makes me someone with a serious <br/>\nproblem, more likely it gets me membership in a really huge club.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; But honestly, I read your message<br/>\n&gt; twice and could not tell whether you were just<br/>\n&gt; bringing up examples of different issues that other<br/>\n&gt; people had or you personally had any of those<br/>\n&gt; problems.<br/>\n<br/>\n </span></blockquote>I am on several lists, and read several boards and was referring to <br/>\nsome of the themes of miscommunication that I see repeatedly on all <br/>\nof them. I see a gap in problem solving for parents with really young <br/>\nkids, among some other gaps. The post I was responding to asked a <br/>\nquestion about how we as a community could be better addressing the <br/>\npeople coming to unschooling and looking for information. I don&#39;t <br/>\nhave an expectation that individuals be able to address the needs of <br/>\nevery person. One suggestion I DO have is that the environments be <br/>\nmore welcoming, empathetic and flexible to allow for different <br/>\ndemographics and the ways those folks are trying to live an <br/>\nunschooling life. You can do that without actually compromising the <br/>\npremise of what you believe. And when the environment feels more <br/>\nunderstanding then people feel freer to post about their solutions <br/>\nand problems.<br/>\nI did say, but let me repeat, that in general I find this list to be <br/>\none of the less combative more pleasant experiences.<br/>\ncarrie</div>","specialLinks":[]},{"userId":280852700,"authorName":"Schuyler","from":"&quot;Schuyler&quot; &lt;s.waynforth@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Why I unschool","postDate":"1170804778","msgId":21222,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNWEwMWM3NGE0NyQyMmQxM2Q2MCQ0MDAxYThjMEBEYXZpZD4=","referencesHeader":"PDAwMTEwMWM3NGExOCQwNjNhNDBlMCQzNTAwYThjMEBLaW1iYWxsRmFtaWx5Pg=="},"prevInTopic":21220,"nextInTopic":21223,"prevInTime":21221,"nextInTime":21223,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"... I am a member of a two adult household. I can t respond to you from a single parent perspective, but I could, and others could, offer solutions to specific","messageBody":"<div id=\"ygrps-yiv-1334645425\"><blockquote><span title=\"ireply\">&gt; Here are some examples: Repeatedly, solutions presented would work only <br/>\n&gt; for two adult households. I probably only notice this because I am a <br/>\n&gt; single parent. &gt;Adaptive strategies are going to be different if its all <br/>\n&gt; you all the time. Responses assume that there are two parents and they <br/>\n&gt; both work together even when there &gt;are differences of opinion. Many <br/>\n&gt; parents are negotiating repeatedly with a non- custodial coparent where <br/>\n&gt; finding middle ground that won&#39;t mean perfect &gt;unschooling is needed.<br/>\n<br/>\n </span></blockquote>I am a member of a two adult household. I can&#39;t respond to you from a single <br/>\nparent perspective, but I could, and others could, offer solutions to <br/>\nspecific issues recognizing the limitations of being solo parent. I don&#39;t <br/>\nknow how possible it is to unschool when you are negotiating with a <br/>\nnon-custodial parent. It isn&#39;t really possible to unschool in an household <br/>\nwith two parents if one parent doesn&#39;t agree. And having the added <br/>\nlimitation of whatever tensions there are in a post-divorce scenario, where <br/>\ncustody may be an issue or where there may be shared custody agreements, I <br/>\ncan only imagine how difficult a tightwire performance it must be without <br/>\nthrowing the difficulty of demonstrating learning to someone who doesn&#39;t <br/>\neven approve of homeschooling.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;There is also a syndrome of forgetfullness around very tiny children. <br/>\n&gt;Parenting two year olds is freaking hard. And &gt;doing it non-coercively has <br/>\n&gt;me drinking &gt;alcoholically at night. Trying to non- coercively balance the <br/>\n&gt;conflicting needs of two very young children one of whom &gt;communicates by <br/>\n&gt;screaming and hitting &gt;primarily is hard. There seem to be a plethora of <br/>\n&gt;folks with one child who is like 7-10 on the boards and such blasting the <br/>\n&gt; &gt;newcomers with multiple very little &gt;kids for being too coercive and <br/>\n&gt;violent. It helps to get empathy along with the advice that is hard to hear <br/>\n&gt;or stern.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I have two children. My eldest is 9 and my youngest is 6. They will be 7 and <br/>\n10 in the next two months. Part of why posting for me is easier now than it <br/>\nwas when they were 2 and 5 is because they aren&#39;t 2 and 5 anymore. Parenting <br/>\n2 year olds can be hard as 2 year olds require a lot of a parent&#39;s time, but <br/>\nrather than have us give you sympathy about how hard having a 2 year old is <br/>\nso that you can feel justified in either your coercive responses or in your <br/>\nalcoholic tendencies, surely helping you to be find ways to be a calmer and <br/>\nmore patient parent would be more useful. And I think this list is rich with <br/>\nempathy.<br/>\n<br/>\nParenting is a different kind of thing to being a Bongo van owner. My <br/>\nhusband is on a list for Bongo van owners and he doesn&#39;t have to worry <br/>\nnearly so much about how he writes things, about how things are going to be <br/>\ntaken as does someone posting parenting advice. It is really easy to feel <br/>\ncritized when someone says something about your parenting than it is when <br/>\nsomeone says that you might need to change the oil on your van. It helps if <br/>\nyou try and imagine the person writing is saying it in the nicest possible <br/>\nvoice. The amount of thought and consideration and generousity which the <br/>\npeople on this list put into their posts is incredible, it is like nothing <br/>\nelse I know.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In general, it feels very all or nothing on the boards and lists. You are <br/>\n&gt; either doing it this way, or you aren&#39;t succeeding and REALLY unschooling. <br/>\n&gt; I think many of &gt;us also find it problematic that there aren&#39;t more <br/>\n&gt; diverse resources.<br/>\n<br/>\n </span></blockquote>Than make them. Make a <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.joyfullyrejoycing.com/\">http://www.joyfullyrejoycing.com/</a> site or an <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.info/\">http://www.unschooling.info/</a> site or <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling\">http://sandradodd.com/unschooling</a> or <br/>\nmake an e-zine like <a rel=\"nofollow\" target=\"_blank\" href=\"http://connections.organiclearning.org/\">http://connections.organiclearning.org/</a> and when people <br/>\nask for help offer up your site. If there are many of you it should be easy <br/>\nto put together the resources, instead of looking these gift horses in the <br/>\nmouth and saying it isn&#39;t enough.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s all Sandra Dodd all the time. Literally, it is the ONLY link anyone <br/>\n&gt; every offers up.<br/>\n<br/>\n </span></blockquote>I bet you that isn&#39;t true. I know I&#39;ve linked other sites. And, often, when <br/>\nyou follow the links to Sandra&#39;s site you will find someone other than <br/>\nSandra writing. But Sandra has put together such an amazing resource it <br/>\nwould be a shame to ignore it. And it would serve no purpose to ignore it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I have considered starting a new list called something like &quot;unschooling <br/>\n&gt; for freaks&quot; or &quot;unschooling for the dysfunctional family&quot;. And the first <br/>\n&gt; rule would be &gt;everyone has to be nice, because no one who cares for <br/>\n&gt; children has the emotional energy to be treated abusively. And we could <br/>\n&gt; all talk about the ways we are &gt;trying like hell to be unschooling <br/>\n&gt; families, and find creative solutions to the barriers we have, but also <br/>\n&gt; aknowledge that we screw it up sometimes, and we might &gt;even discover that <br/>\n&gt; we need to be coercive to survive sometimes and so forth. But that is <br/>\n&gt; always only true for that moment and we can look for better ways.  Life <br/>\n&gt;  &gt;is a process, and our kids learn from seeing us struggle through figuring <br/>\n&gt; things out. We don&#39;t all have to be &quot;there&quot; at the same time to help each <br/>\n&gt; other through.<br/>\n<br/>\n </span></blockquote>Than do it. Create a list. I&#39;m sure you could invite people to join on this <br/>\nlist and on other lists. There isn&#39;t any loyalty card for staying with the <br/>\nalready established lists. For me though, the reason why these lists work is <br/>\nbecause they aren&#39;t there to support you at this stage, they are there to <br/>\nhelp you see ways to get to the next stage. I wouldn&#39;t have made the changes <br/>\nthat I&#39;ve made in my own life if it weren&#39;t for people posting about better <br/>\nways to be and what trusting your children can look like and what it can <br/>\nmake. And even more than that, if it weren&#39;t for people talking honestly <br/>\nabout focusing their lives on being the best parent they could be meant <br/>\noften being the best spouse/partner they could be, I wouldn&#39;t be as happily <br/>\nmarried as I am. I think life can be bleak, but for me wallowing in its <br/>\nbleakness has never made it better. So a list that told me that in the face <br/>\nof whatever difficulties I found myself using coercion to get my children to <br/>\ndo what I wanted was justified wouldn&#39;t work for me. If I want justification <br/>\nfor timeouts or for putting limits on my children I can find them <br/>\neverywhere.<br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com</div>","specialLinks":[]},{"userId":8667530,"authorName":"Manisha Kher","from":"Manisha Kher &lt;m_kher@...&gt;","profile":"m_kher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Why I unschool","postDate":"1170798348","msgId":21220,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwMjA2MjE0NTQ4LjI5MDI3LnFtYWlsQHdlYjU0NDA1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDAwMTEwMWM3NGExOCQwNjNhNDBlMCQzNTAwYThjMEBLaW1iYWxsRmFtaWx5Pg=="},"prevInTopic":21219,"nextInTopic":21222,"prevInTime":21219,"nextInTime":21221,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"... Most people on this list are writing about their own experiences. Since most of us do live in two adult households, most of the solutions that we present","messageBody":"<div id=\"ygrps-yiv-1010301146\">--- Carrie Kimball &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ckmidwife@...\">ckmidwife@...</a>&gt; wrote:<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; Here are some examples: Repeatedly, solutions<br/>\n&gt; presented would work only for two adult households.<br/>\n<br/>\n </span></blockquote>Most people on this list are writing about their own<br/>\nexperiences. Since most of us do live in two adult<br/>\nhouseholds, most of the solutions that we present are<br/>\ngoing to involve that scenario. If you as a single<br/>\nparent have an actual problem that you&#39;re looking for<br/>\nsuggestions for, you need to state that fact upfront,<br/>\nso people can brainstorm about possible solutions that<br/>\nmay work for you.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Parenting<br/>\n&gt; two year olds is freaking hard. And doing it<br/>\n&gt; non-coercively has me drinking alcoholically at<br/>\n&gt; night. <br/>\n </span></blockquote>I hope you&#39;re exaggerating here to make point. If not,<br/>\nyou&#39;ve bigger problems than an uncshooling list can<br/>\nsolve.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Trying to non- coercively balance the<br/>\n&gt; conflicting needs of two very young children one of<br/>\n&gt; whom communicates by screaming and hitting primarily<br/>\n&gt; is hard.<br/>\n </span></blockquote>This topic comes up periodically and is being<br/>\ndiscussed right now on UnschoolingDiscussion. That&#39;s a<br/>\ngoogle group and I believe you can read all the<br/>\ndiscussions without becoming a member. If this is the<br/>\nproblem you&#39;re facing right now, you can bring it up<br/>\nhere for discussion. But honestly, I read your message<br/>\ntwice and could not tell whether you were just<br/>\nbringing up examples of different issues that other<br/>\npeople had or you personally had any of those<br/>\nproblems.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There seem to be a plethora of folks with<br/>\n&gt; one child who is like 7-10 on the boards and such<br/>\n<br/>\n </span></blockquote>This is so NOT TRUE of this list that I don&#39;t know<br/>\nwhich boards you&#39;re talking about. Without thinking<br/>\ntoo hard, I managed to name 3 people with one child<br/>\neach and many more with multiples including one who<br/>\nhas 7.<br/>\n<br/>\nManisha<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\nWe won&#39;t tell. Get more on shows you hate to love <br/>\n(and love to hate): Yahoo! TV&#39;s Guilty Pleasures list.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tv.yahoo.com/collections/265\">http://tv.yahoo.com/collections/265</a></div>","specialLinks":[]},{"userId":294867049,"authorName":"whome22@adelphia.net","from":"&lt;whome22@...&gt;","profile":"whome122002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] re: unschooling w/a reading disability","postDate":"1170797181","msgId":21225,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExNjE1MjU1LjExNzA3OTcxODE0NDIuSmF2YU1haWwucm9vdEB3ZWIyNz4="},"prevInTopic":21224,"nextInTopic":21226,"prevInTime":21224,"nextInTime":21226,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"... my son is just 11 now and getting the hang of reading ... unfortunatly my son was in school  we pulled him out part way through last year because they","messageBody":"<div id=\"ygrps-yiv-2016945083\">---- Katharine Wise &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:katharinewise@...\">katharinewise@...</a>&gt; wrote: <br/>\n<blockquote><span title=\"ireply\"> &gt; My oldest son was almost 10 when he learned how to read, and the lack of shame was one of the most awesome features of unschooling him.  <br/>\n<br/>\n </span></blockquote>my son is just 11 now and getting the hang of reading<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I&#39;m sure that if he&#39;d been in school he&#39;d have been diagnosed with a learning disability because,<br/>\n <br/>\n </span></blockquote>unfortunatly my son was in school  we pulled him out part way through last year because they decided he had a learning disability that clearly was not there yes he had trouble reading we let them test him and he was above his class in math and science but yet they wanted to put him in &quot;special classes &quot; for all of his subjects.<br/>\n<br/>\n in his case, it was clear to me that it wasn&#39;t simply lack of interest but lack of certain &quot;pre-reading&quot; skills.  He didn&#39;t get the concept of rhyming or any sense of phonetic connection until shortly before he taught himself to read.  For instance, he enjoyed playing I Spy but we had to stick to visual clues, &quot;I spy something red (or round).&quot;  I couldn&#39;t say, &quot;I spy something that begins with the letter &#39;B&#39; (or the sound /b/).&quot;  He also had some speech delays.<br/>\n<br/>\nsounds so much like my son except the speech delays , but because he was in school<br/>\nhe was put under a lot of pressure by the staff  he would come home from school and just kind of explode. Every day there was school my son had mental meltdown  he was so frustrated and being that we taught him respect of elders and authority  he would keep all the frustration in until he got home and would pretty much just bit his sisters heads off if they looked at him wrong (keep in mind he was 9 years old)<br/>\nit was awful. but i knew and had been telling the school there is nothing wrong with him he will read when he is ready. well by fourth grade they decided to test him and tell me if i did not put him in special classes he would not be able to do the work in school  he would fail and that he possibly had asburgers syndrome(a form of autism i looked into it and talked with our family doc). (my turn to explode) I told them they were just looking for extra funding and to give the help to children who really needed it  and  I colleced his things that very day from his desk and we have not looked back since.<br/>\n<br/>\nMy proudest day, my proof if you will  that i did the right thing came just a few days ago my son who hates to read and fights every page (i have him read one a least a day) said to me (we were reading a book) &quot; i want to read some more mom the story is to good to stop here.&quot; (I almost cried) He still finds it very hard t o read but he is starting to put it together and now he wants to!<br/>\nnow I know what homeschooling is for :)<br/>\n<br/>\n<br/>\nmarlene<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; However, not being in school or &quot;schooled&quot;, he just asked when he needed to know what something said or how to write something.  He had no sense of self-consciousness about it, even when we were in public.  (I have to confess, however, that I sometimes had to squelch my own self-consciousness!)  The summer my oldest was 9 he went to karate camp.  It never occurred to me that he&#39;d have any reason to read or write there, but I was a little early picking him up on the 3rd or 4th day and saw the instructor handing out journals to the students and telling them what he wanted them to write about.  (They were more evaluations for the dojo&#39;s use than journals, really, as he wanted them to write what their favorite activities were.)  I felt awful that I had put ds in that situation without letting the teacher know.  But my son raised his hand, and since this was the 3rd or 4th day they already knew what he needed, and one of the junior black-belts went over and spelled out each word<br/>\n&gt;  for him.  I casually asked my son about it later, and he said that on the first day he just asked for help spelling the words.  It was clear it hadn&#39;t bothered him at all.<br/>\n&gt; <br/>\n&gt; Katharine<br/>\n&gt; <br/>\n&gt; ----- Original Message ----<br/>\n&gt; <br/>\n&gt;   But I try to be as patient as possible and he is <br/>\n&gt; <br/>\n&gt; reading without frustration (well, sometimes a little) and without <br/>\n&gt; <br/>\n&gt; shame from the school system because oh my gosh!!, he is so old to <br/>\n&gt; <br/>\n&gt; just be learning how to read!<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; ____________________________________________________________________________________<br/>\n&gt; Don&#39;t pick lemons.<br/>\n&gt; See all the new 2007 cars at Yahoo! Autos.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://autos.yahoo.com/new_cars.html\">http://autos.yahoo.com/new_cars.html</a> <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":280852700,"authorName":"Schuyler","from":"&quot;Schuyler&quot; &lt;s.waynforth@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Why I unschool - fighting homework","postDate":"1170789892","msgId":21218,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2EwMWM3NGEyNCQ3YTdhZTE2MCQ0MDAxYThjMEBEYXZpZD4=","referencesHeader":"PGVxYTBndCtodjY3QGVHcm91cHMuY29tPg=="},"prevInTopic":21217,"nextInTopic":21219,"prevInTime":21217,"nextInTime":21219,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"... How much time do you want? It isn t an infinite thing childhood. ... So you ve got 5 years between now and unschooling isn t possible anymore. ... If you","messageBody":"<div id=\"ygrps-yiv-2099556704\"><blockquote><span title=\"ireply\">&gt; We began hs&#39;ing a year ago.  We have a definite slant towards<br/>\n&gt; unschooling, but aren&#39;t true unschoolers (yet - give us time).<br/>\n<br/>\n </span></blockquote>How much time do you want? It isn&#39;t an infinite thing childhood.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Our ds is 13 and was in 7th grade.<br/>\n<br/>\n </span></blockquote>So you&#39;ve got 5 years between now and unschooling isn&#39;t possible anymore.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;We struggled with him every single<br/>\n&gt; year to do his homework.<br/>\n&gt; It took some time to deschool, but he does not fight us anymore.<br/>\n<br/>\n </span></blockquote>If you were unschooling he wouldn&#39;t have anything to fight about.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;It<br/>\n&gt; wouldn&#39;t be fair to say we don&#39;t ever have to remind him, but because<br/>\n&gt; he no longer feels so stressed (hours of school + hours of homework +<br/>\n&gt; life), because he isn&#39;t doing ANYTHING he already knows how to do<br/>\n&gt; (aka busywork), and because he sees the point again in learning,<br/>\n&gt; that&#39;s all it usually is: a reminder... a gentle nudge.<br/>\n<br/>\n </span></blockquote>Structured schoolwork isn&#39;t required for learning. My two, who have never <br/>\nbeen schooled, see the point in learning all the time and have never had to <br/>\nrelearn the joy of learning. In the car on the way into town today we talked <br/>\nabout how one of  my ancestors (I&#39;m American and can, apparently, date some <br/>\nof my family back to some of the earliest European settlers in the U.S.) was <br/>\nmarried in the town of Hingham in Norfolk, UK in 1600 and something -- where <br/>\nwe got lost driving a little bit just before Christmas (my dad just sent me <br/>\na letter with an extensive family tree enclosed). David (who is British and <br/>\nwhose ancestors were Normans) had brewers in the family who lived in <br/>\nNorfolk. Which led to a conversation about the relatedness of all humans and <br/>\nevolution, and ultimately to a discussion about how all living things share <br/>\na common ancestor. From that came a conversation about marrying cousins, <br/>\nwhich had Simpsons references thrown in, and a study done in Newcastle and <br/>\nmentions of major histocompatibility complex (MHC) and how someone&#39;s smell <br/>\ncan change whether you find them sexually attractive or not. And there was a <br/>\nsecondary conversation about where the word dog comes from (a quick search <br/>\non google states that although it has a French origin, there isn&#39;t a clear <br/>\nunderstanding of where the word comes from). Linnaea thinks it is from dig, <br/>\n&#39;cause dogs dig. Linnaea is 6 and Simon is 9 and both were actively involved <br/>\nin the conversation. Actually, Linnaea started it.<br/>\n<br/>\nThe problem with schoolwork is that by supporting the structure and the form <br/>\nyou are arguing that learning doesn&#39;t occur outside of the realm of <br/>\nscholastic endeavors. And thus you are devaluing anything else in his life. <br/>\nYou are also arguing that learning takes some effort on your son&#39;s part. I <br/>\ndefinitely think there are learned things that take effort (I was trying to <br/>\nmoonwalk this morning, and while I think I was improving, I definitely don&#39;t <br/>\nhave the move yet) I think it is nigh on impossible not to learn from life <br/>\nall the time. Believing that understanding history, for example, comes from <br/>\nreading textbooks that quote &quot;facts&quot; at you is just false. Yesterday we went <br/>\nto a Cathedral ruins <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.edp24.co.uk/Content/HiddenNorfolk/asp/2002/08/020824Cathdral1.asp)\">http://www.edp24.co.uk/Content/HiddenNorfolk/asp/2002/08/020824Cathdral1.asp)</a> <br/>\njust up the road from us to have a sword fight. History is all around us. <br/>\nAnd not just in the UK, in Santa Fe, where we would go for occasional nights <br/>\nout when we lived in Albuquerque, is the oldest church in the U.S. There is <br/>\na lot of history there. And there is Sandia Man in the mountains behind <br/>\nAlbuquerque dating to habitation some 10,000 years ago. Or there were the <br/>\ntombs near our apartment in  Kyoto, Japan where we saw the most amazing <br/>\ninsects I&#39;ve ever seen in the flashlight beam as we peered around this cold <br/>\nand dark cave with our neighbors. Evidence of some royal burial in the hills <br/>\nbehind Kyoto from centuries ago. Or, heck, trying to figure out where the <br/>\nword dog comes from, or why my ancestor, who married in Hingham, Norfolk, <br/>\ndied in Stow, Massachusetts.<br/>\n<br/>\nLearning is everywhere and you are doing your son no favors to move slowly <br/>\nfrom school to unschooling. Take the step forward that means no more <br/>\nnudging. Look at how much he can discover just by being a part of life with <br/>\nyou as his partner.<br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com</div>","specialLinks":[]},{"userId":279433414,"authorName":"Carrie Kimball","from":"&quot;Carrie Kimball&quot; &lt;ckmidwife@...&gt;","profile":"lelania1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Why I unschool","postDate":"1170784540","msgId":21219,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTEwMWM3NGExOCQwNjNhNDBlMCQzNTAwYThjMEBLaW1iYWxsRmFtaWx5Pg=="},"prevInTopic":21218,"nextInTopic":21220,"prevInTime":21218,"nextInTime":21220,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"Hi Deb, Thanks for writing this all down. I feel like you spoke to many thoughts I have had in the last few months I have been online around unschooling though","messageBody":"<div id=\"ygrps-yiv-56763749\">Hi Deb,<br/>\n    Thanks for writing this all down. I feel like you spoke to many thoughts I have had in the last few months I have been online around unschooling though our experiences of them are probably different.<br/>\n<br/>\nYou wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Some large percentage of people coming to these lists get it, and live it, <br/>\n </span></blockquote>and unschooling will blossom for them. Because I&#39;ve had two personal emails <br/>\nin the last week from people who seem so very much NOT to get it, in spite <br/>\nof claiming to have &quot;read all the books&quot; I am wondering whether there are <br/>\nsome things we need to address more often on the list. I wonder whether it <br/>\nis so natural to those of us who&#39;ve been living it for years that we not <br/>\npaying enough attention to the fact it&#39;s not at all natural to someone who&#39;s <br/>\njust pulling an unhappy kid out of school and wondering &quot;what next?&quot;&gt;&gt;&gt;&gt;<br/>\n<br/>\nAnd you also wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;The flow of &quot;What is&quot; for some people is depressed mom, disinterested mom,<br/>\n </span></blockquote>burned out mom, not providing opportunities or activities for kids.<br/>\nThe &quot;flow&quot; in a home where a mom is stressed or burned out is not<br/>\nnecessarily a healthy flow leading to joy and happy exploration. While I <br/>\ndon&#39;t know of any way we can or even should,<br/>\n(or have any responsibility to) assess the mental or emotional health of a <br/>\nmom coming to unschooling I<br/>\nbelieve some people are not understanding what really is involved in<br/>\nunschooling .&gt;&gt;&gt;<br/>\n<br/>\nI think these two issues are related. First, its apparent to me that the majority of people who are movers and shakers in the online unschooling comunity lead relatively speaking, picturesque lives. That&#39;s really great and self selecting since being online contributing like this involves a lot of time and effort. And it also means that the majority of parents, whose lives involve major stressors of one kind or another, won&#39;t be well understood as they struggle to piece together a life that includes unschooling. Statsitically, a large number of parents struggle with depression.  Their questions will seem ridiculous, their adaptive strategies problematic. <br/>\n<br/>\nHere are some examples: Repeatedly, solutions presented would work only for two adult households. I probably only notice this because I am a single parent. Adaptive strategies are going to be different if its all you all the time. Responses assume that there are two parents and they both work together even when there are differences of opinion. Many parents are negotiating repeatedly with a non- custodial coparent where finding middle ground that won&#39;t mean perfect unschooling is needed. Many solutions presented are financial ones. Many families don&#39;t have the financial resources, or maybe the financial creativity, to figure their way into the life often described by the people who post most often. There is also a syndrome of forgetfullness around very tiny children. Parenting two year olds is freaking hard. And doing it non-coercively has me drinking alcoholically at night. Trying to non- coercively balance the conflicting needs of two very young children one of whom communicates by screaming and hitting primarily is hard. There seem to be a plethora of folks with one child who is like 7-10 on the boards and such blasting the newcomers with multiple very little kids for being too coercive and violent. It helps to get empathy along with the advice that is hard to hear or stern.<br/>\n<br/>\nIn general, it feels very all or nothing on the boards and lists. You are either doing it this way, or you aren&#39;t succeeding and REALLY unschooling. I think many of us also find it problematic that there aren&#39;t more diverse resources. It&#39;s all Sandra Dodd all the time. Literally, it is the ONLY link anyone every offers up. And thus, what has become the standard of RU is whatever Sandra Dodd says it is. I like a lot of what is on her site. I really do. I have found a good deal of helpful solutions there. But I also feel left out as a parent because it really doesn&#39;t reflect the reality of my life. I feel invisible as an actual person because there isn&#39;t any representation for my life, and how unschooling intersects with it in the online world. And I know others feel similarly because I spend more time talking offlist to people who email me their questions out of fear of posting them and being bashed, than I do posting online right now. For some reason, the unschooling online culture has evolved to be a largely volatile and verbally abusive one. Which is ironic given how much time is devoted to non- violent communication with children. I like this list best personally, because people can ask hard questions and not be asked if they are sure they respect or love their kids. The boards can be the worst.<br/>\n<br/>\nThe response has, in my observation, often been to state that people &quot;aren&#39;t getting it&quot;, or to say that &quot;This doesn&#39;t apply to unschooling families&quot; which is just so limiting and naive really. The examples you gave (multiplication tables) really do reflect not getting it on some level. But some people do get it, theoretically, but they are having concrete issues in their families where the paradigm isn&#39;t flowing beautifully and they need help. I see this especially with the total lifestyle aspects of unschooling. The non- academic stuff like bedtimes, communication, food, media. <br/>\n<br/>\nI agree wholeheartedly with your concerns about the parent who comes to this out of laziness, though I am apt to suspect those parents rarely put the effort into being on a list. But I also am of the opinion that parental stress reduction and coping gets a bad rap. To my mind, considering my need for sleep, food, exercise etc... is essential to my kids wellbeing and happiness. Combining this with the fact of my being the only parent, broke and so on means that how I achieve those goals will sometimes look like a deviation from &quot;real&quot; unschooling. And it means that I won&#39;t always figure out the win/win before I give up and do what I need to do. So I just try again, think that scenario ahead and look for a better solution.  But this process I am describing doesn&#39;t really get talked about in this online world except to judge it as being wrong.<br/>\n<br/>\nI have considered starting a new list called something like &quot;unschooling for freaks&quot; or &quot;unschooling for the dysfunctional family&quot;. And the first rule would be everyone has to be nice, because no one who cares for children has the emotional energy to be treated abusively. And we could all talk about the ways we are trying like hell to be unschooling families, and find creative solutions to the barriers we have, but also aknowledge that we screw it up sometimes, and we might even discover that we need to be coercive to survive sometimes and so forth. But that is always only true for that moment and we can look for better ways.  Life is a process, and our kids learn from seeing us struggle through figuring things out. We don&#39;t all have to be &quot;there&quot; at the same time to help each other through.<br/>\nJust random thoughts,<br/>\ncarrie<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185550057,"authorName":"Joanne","from":"&quot;Joanne&quot; &lt;billyandjoanne@...&gt;","profile":"billyandjoanne","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Why I unschool","postDate":"1170776819","msgId":21217,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVxYTd0ais4MThvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PERBN0U5QzE3LTBDRUEtNDA2MS05NDBDLUQwQURBQjA3NDA1RkBvcHRvbmxpbmUubmV0Pg=="},"prevInTopic":21216,"nextInTopic":21218,"prevInTime":21216,"nextInTime":21218,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"Hello and welcome. Here s some links to get you started. http://sandradodd.com/unschooling http://www.unschooling.info/articles.htm ","messageBody":"<div id=\"ygrps-yiv-645742651\">Hello and welcome. <br/>\n<br/>\nHere&#39;s some links to get you started. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling\">http://sandradodd.com/unschooling</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.info/articles.htm\">http://www.unschooling.info/articles.htm</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.foreverparents.com/UnschoolingVoices.html\">http://www.foreverparents.com/UnschoolingVoices.html</a><br/>\n<br/>\n~ Joanne ~<br/>\nMom to Jacqueline (8), Shawna (11) & Cimion (14)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://anunschoolinglife.blogspot.com/\">http://anunschoolinglife.blogspot.com/</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Shellini Spencer <br/>\n&lt;shellini@...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; Hi<br/>\n&gt; <br/>\n&gt; I am new to this group. Can someone please explain exactly what  <br/>\n&gt; unschooling is or means?<br/>\n&gt; <br/>\n&gt; Thank you!<br/>\n&gt; <br/>\n&gt; Shellini<br/>\n&gt; <br/>\n&gt; Mothers hold their children&#39;s hands for a short while, but their  <br/>\n&gt; hearts forever.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:subtitles (was: Re: unschooling w/a reading disability)","postDate":"1170770391","msgId":21215,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1MjYzMTQyQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":21214,"nextInTopic":21216,"prevInTime":21214,"nextInTime":21216,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"... if people are talking really fast or have accents. We usually turn on the captioning if we re watching anything British - sometimes the accent makes it","messageBody":"<div id=\"ygrps-yiv-222480304\"><blockquote><span title=\"ireply\">&gt;However, it does help her follow what&#39;s going on sometimes, especially<br/>\n </span></blockquote>if people are talking really fast or have accents.<br/>\n <br/>\nWe usually turn on the captioning if we&#39;re watching anything British -<br/>\nsometimes the accent makes it really hard to catch everything as it<br/>\nwhizzes by. And we do NOT want to miss a bit of Dr. Who!<br/>\n <br/>\nDeb <br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":178286015,"authorName":"rshoulla","from":"&quot;rshoulla&quot; &lt;rshoulla@...&gt;","profile":"rshoulla","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Why I unschool - fighting homework","postDate":"1170769245","msgId":21214,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVxYTBndCtodjY3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ1QzdFMDNELjYwMTA2MDFAZ21haWwuY29tPg=="},"prevInTopic":21213,"nextInTopic":21215,"prevInTime":21213,"nextInTime":21215,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"... because he sees how she fights doing homework. I think that not having to spend 6hrs a day in school, then come home to a ton of homework at night, will","messageBody":"<div id=\"ygrps-yiv-1595132550\"><blockquote><span title=\"ireply\">&gt;&gt;My dh is sceptical that I can teach her,<br/>\n </span></blockquote>because he sees how she fights doing homework. I think that not <br/>\nhaving to<br/>\nspend 6hrs a day in school, then come home to a ton of homework at <br/>\nnight,<br/>\nwill create a completely different situation. &lt;&lt;<br/>\n<br/>\nThis sounded familiar, so here&#39;s my two cents.<br/>\n<br/>\nWe began hs&#39;ing a year ago.  We have a definite slant towards <br/>\nunschooling, but aren&#39;t true unschoolers (yet - give us time).  Our <br/>\nds is 13 and was in 7th grade.  We struggled with him every single <br/>\nyear to do his homework.  <br/>\nIt took some time to deschool, but he does not fight us anymore.  It <br/>\nwouldn&#39;t be fair to say we don&#39;t ever have to remind him, but because <br/>\nhe no longer feels so stressed (hours of school + hours of homework + <br/>\nlife), because he isn&#39;t doing ANYTHING he already knows how to do <br/>\n(aka busywork), and because he sees the point again in learning, <br/>\nthat&#39;s all it usually is: a reminder... a gentle nudge.  <br/>\n<br/>\nWhat a difference it&#39;s made for his happiness, for our happiness and <br/>\nfor keeping the peace in our family!<br/>\n<br/>\nMy take: if she&#39;s fighting doing homework it&#39;s most likely a symptom <br/>\nof unproductive schooling.<br/>\n<br/>\nRobin</div>","specialLinks":[]},{"userId":292658207,"authorName":"Shellini Spencer","from":"Shellini Spencer &lt;shellini@...&gt;","profile":"shellinispencer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Why I unschool","postDate":"1170768087","msgId":21216,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERBN0U5QzE3LTBDRUEtNDA2MS05NDBDLUQwQURBQjA3NDA1RkBvcHRvbmxpbmUubmV0Pg=="},"prevInTopic":21215,"nextInTopic":21217,"prevInTime":21215,"nextInTime":21217,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"Hi I am new to this group. Can someone please explain exactly what unschooling is or means? Thank you! Shellini Mothers hold their children s hands for a short","messageBody":"<div id=\"ygrps-yiv-474022509\">Hi<br/>\n<br/>\nI am new to this group. Can someone please explain exactly what  <br/>\nunschooling is or means?<br/>\n<br/>\nThank you!<br/>\n<br/>\nShellini<br/>\n<br/>\nMothers hold their children&#39;s hands for a short while, but their  <br/>\nhearts forever.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":11220207,"authorName":"amcarlson@mindspring.com","from":"amcarlson@...","profile":"gunnar333us","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Why I unschool","postDate":"1170765357","msgId":21213,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0MjM5MTM1LjExNzA3NjUzNTgxODQuSmF2YU1haWwucm9vdEBtc3dhbXVpLWNlZGFyLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":21212,"nextInTopic":21214,"prevInTime":21212,"nextInTime":21214,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"A mom who watches a child gain unhealthy amounts of weight, fifty or sixty pounds, and can attribute it to stress in the home and inactivity, and THEN wonders","messageBody":"<div id=\"ygrps-yiv-798728985\">&quot;A mom who watches a child gain unhealthy amounts of weight,<br/>\nfifty or sixty pounds, and can attribute it to stress in the home and<br/>\ninactivity, and THEN wonders what she can possibly do, does not understand<br/>\nunschooling. A flow like that is a sucking undertow and not anything like<br/>\nthe beautiful, natural happiness many of us know unschooling to be.&quot;<br/>\n<br/>\n Deb, this touched a nerve with me.  I woke up early this morning really concerned about my deep understanding of and my abilities to really live the life of an unschooling parent.   There have been  some wonderful moments and experiences for our family over the past two years of unschooling.  Intellectually and ideologically I agree with unschooling and I can feel my inner spirit so longs for the principles of it.  And,  I feel I need to assess if this is really working -- and I mean working from the stand point of each individual family member experiencing a deep happiness, satisfaction and support for what they want to do, or be or have. <br/>\n<br/>\n I feel I find myself much like the parent you describe -- as if  I have over the last year sat by as one of my boys has gained alot of weight, slept alot, and been extremely inactive.  I admit I have been, and feel now, at a loss.  I have mostly worked to keep the focus off the weight per se, provide a wide variety of food choices in the house; make outings available,  support his interests, and desires (which are mostly sedentary right now - video games, TV, movies, reading books) and make life as rich and interesting as possible.  I do feel there is an undertow of stress in our home that I&#39;m not sure how to address -- things with my partner aren&#39;t great/there&#39;s significant financial stress these days.  We&#39;re living in small quarters, working to move but it&#39;s going very slowly. . . . and I feel imbalanced with my work and my availability to my kids.  I don&#39;t want to &quot;beat myself up&quot;, but I do want to assess if I&#39;m really qualified for the job of unschooling parent; or for today,  how can I do it better.   That&#39;ll be my focus today; to the best of my ability contribute to this home environment as much peace and joy, curiousity and &quot;all is well&quot; faith that I can . . . I&#39;ll trust that the stressors,etc. that need to be addressed will present themselves and be addressed in this calm and trusting environment.  But/And, I don&#39;t want stuff to get swept under the rug only to be held onto or taken in by this sweet, sensitive young man who I know feels everthing so deeply, and profoundly.  Feedback welcome.  <br/>\n<br/>\n-Ann.<br/>\n(mom to twin DS age 13, DD age 12)</div>","specialLinks":[]},{"userId":229237531,"authorName":"Danielle Conger","from":"Danielle Conger &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Why I unschool","postDate":"1170726973","msgId":21212,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1QzdFMDNELjYwMTA2MDFAZ21haWwuY29tPg==","inReplyToHeader":"PDAwMzYwMWM3NDk4YiQzZGEwODQwMCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4=","referencesHeader":"PDAwMzYwMWM3NDk4YiQzZGEwODQwMCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":21211,"nextInTopic":21213,"prevInTime":21211,"nextInTime":21213,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"... I read here pretty regularly, though I don t always keep up with the threads. Interestingly, I d written an article a couple months back about the whole","messageBody":"<div id=\"ygrps-yiv-2044302840\">Deb Lewis wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I would not have been able to bear the kind of life we could have <br/>\n&gt; chosen by<br/>\n&gt; sending Dylan to school ten years ago. I could not bear to fight with him<br/>\n&gt; over bed time and waking up time and dinner time and homework time and<br/>\n&gt; grades the way I&#39;ve seen other family members and friends fight with their<br/>\n&gt; kids. I wouldn&#39;t have had the energy or heart for that. Unschooling has<br/>\n&gt; been easy for us but not because I left Dylan alone to fend for himself<br/>\n&gt; while I did what I wanted. It&#39;s been easy because I believed he wanted an<br/>\n&gt; interesting life and I helped him. I believed that&#39;s how people should<br/>\n&gt; live - finding and doing what interests them and helping other family<br/>\n&gt; members do the same.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I read here pretty regularly, though I don&#39;t always keep up with the <br/>\nthreads. Interestingly, I&#39;d written an article a couple months back <br/>\nabout the whole &quot;authoritative&quot; vs. &quot;authoritarian&quot; parenting labels; <br/>\nthen came along a similar thread here at UB, so I followed that one <br/>\npretty closely.<br/>\n<br/>\nThis post really sparked for me a realization of what might be meant by <br/>\nthe whole &quot;permissive&quot; label and why it gets such a bad rap.<br/>\n<br/>\nAs I was reading Deb&#39;s post, I had this &quot;aha&quot; moment of that&#39;s what <br/>\n&quot;permissive&quot; parents are--those who can&#39;t bear to do all of that, but <br/>\nfeel like there isn&#39;t any choice. So, they go about enforcing all of <br/>\nthose things half-heartedly without any real buy-in, which explains why <br/>\nit looks so bad from a mainstream p.o.v.  Of course, the kids, then, <br/>\npick up on those mixed messages, so no one&#39;s really sure what to do <br/>\nbecause they&#39;re living a life that feels wrong with someone outside them <br/>\nall pulling the puppet strings.<br/>\n<br/>\n-- <br/>\n~~Danielle<br/>\nEmily (9), Julia (8), Sam (6)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.organiclearning.blogspot.com\">http://www.organiclearning.blogspot.com</a><br/>\n<br/>\n~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*<br/>\n<br/>\nConnections: ezine of unschooling and mindful parenting<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://connections.organiclearning.org\">http://connections.organiclearning.org</a></div>","specialLinks":[]},{"userId":145246818,"authorName":"Christy Mahoney","from":"&quot;Christy Mahoney&quot; &lt;unschooling1@...&gt;","profile":"unschooling1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"subtitles (was: Re: unschooling w/a reading disability)","postDate":"1170726908","msgId":21211,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVxOG41cytrY203QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc2ODIzMy40ODIzMy5xbUB3ZWI1MzAwNi5tYWlsLnlhaG9vLmNvbT4="},"prevInTopic":21210,"nextInTopic":21212,"prevInTime":21210,"nextInTime":21212,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"She has very good hearing.  However, it does help her follow what s going on sometimes, especially if people are talking really fast or have accents.  She also","messageBody":"<div id=\"ygrps-yiv-1125764076\">She has very good hearing.  However, it does help her follow what&#39;s <br/>\ngoing on sometimes, especially if people are talking really fast or <br/>\nhave accents.  She also loves musicals, and I must admit it&#39;s really <br/>\nnice to have the lyrics on the screen.  Even with good hearing it <br/>\ncan be hard to understand a lot of what is said on TV.  Maybe not <br/>\nkids&#39; shows, but dh and I like &quot;Scrubs&quot; and sometimes they talk <br/>\nREALLY fast.<br/>\n<br/>\n-Christy M.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s probably nothing, but it could be that she has a mild hearing<br/>\n&gt; problem? I&#39;d ask her whether she just happens to like to read the<br/>\n&gt; captions, or whether it makes it easier for her to follow what <br/>\n </span></blockquote>they&#39;re<br/>\n<blockquote><span title=\"ireply\"> &gt; saying on TV.<br/>\n&gt; <br/>\n&gt; Marieke, who at last checkup (at 15yo) scored at the average <br/>\n </span></blockquote>hearing<br/>\n<blockquote><span title=\"ireply\"> &gt; level of a 75yo... just not bad enough to do something about, other<br/>\n&gt; than turn the subtitles on when watching movies.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n </span></blockquote>_____________________________________________________________________<br/>\n_______________<br/>\n<blockquote><span title=\"qreply\"> &gt; Don&#39;t pick lemons.<br/>\n&gt; See all the new 2007 cars at Yahoo! Autos.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://autos.yahoo.com/new_cars.html\">http://autos.yahoo.com/new_cars.html</a><br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Why I unschool","postDate":"1170724078","msgId":21207,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzYwMWM3NDk4YiQzZGEwODQwMCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":21206,"nextInTopic":21208,"prevInTime":21206,"nextInTime":21208,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"***I think unschooling is very Zen-like that way....it s all about going with the flow of what IS, rather than trying to create what you think should be . ***","messageBody":"<div id=\"ygrps-yiv-105150908\">***I think unschooling is very Zen-like that way....it&#39;s all about going<br/>\nwith the flow of what IS, rather than trying to create what you think<br/>\n&quot;should be&quot;. ***<br/>\n<br/>\nThat&#39;s wonderful for people who are Zen like. &lt;g&gt; That&#39;s true for<br/>\npeople who have some understanding of unschooling.  But there are people who<br/>\nthink unschooling will free up their time to do what they want while their<br/>\nkids somehow &quot;educate&quot; themselves.    The mom who said she didn&#39;t feel that<br/>\nunschooling parents need to be able to provide a life for their kids that<br/>\nwas *at least* as interesting as school worries me.<br/>\n<br/>\nThe flow of &quot;What is&quot; for some people is depressed mom, disinterested mom,<br/>\nburned out mom, not providing opportunities or activities for kids.<br/>\nThe &quot;flow&quot; in a home where a mom is stressed  or burned out is not<br/>\nnecessarily a healthy flow leading to joy and happy exploration.  While I <br/>\ndon&#39;t know of any way we can or even should,<br/>\n(or have any responsibility to) assess the mental or emotional health of a <br/>\nmom coming to unschooling I<br/>\nbelieve some people are not understanding what really is involved in<br/>\nunschooling .    A mom who watches a child gain unhealthy amounts of weight,<br/>\nfifty or sixty pounds, and can attribute it to stress in the home and<br/>\ninactivity, and THEN wonders what she can possibly do, does not understand<br/>\nunschooling.   A flow like that is a sucking undertow and not anything like<br/>\nthe beautiful, natural happiness many of us know unschooling to be.<br/>\n<br/>\nI would not have been able to bear the kind of life we could have chosen by<br/>\nsending Dylan to school ten years ago.  I could not bear to fight with him<br/>\nover bed time and waking up time and dinner time and homework time and<br/>\ngrades the way I&#39;ve seen other family members and friends fight with their<br/>\nkids.  I wouldn&#39;t have had the energy or heart for that.   Unschooling has<br/>\nbeen easy for us but not because I left Dylan alone to fend for himself<br/>\nwhile I did what I wanted.  It&#39;s been easy because I believed he wanted an<br/>\ninteresting life and I helped him.   I believed that&#39;s how people should<br/>\nlive - finding and doing what interests them and helping other family<br/>\nmembers do the same.   In a healthy home where parents understand<br/>\nunschooling it does seem easy and natural.   But people from healthy <br/>\nsituations<br/>\naren&#39;t the only ones coming to unschooling.<br/>\n<br/>\nBeing involved with a kid who has chosen to do a thing he loves, helping him <br/>\nin the pursuit of an interest, is not stressful in the way that being <br/>\ninvolved with a kid who has no choice about what a teacher and/or parent is <br/>\nforcing on him is, but both require our time and energy and unschooling <br/>\nmaybe more so because there&#39;s no school, or teacher, or special ed class, to <br/>\ntake up the slack, or to blame if we give up, or flake out, and let the kid <br/>\nflounder.<br/>\n<br/>\nI think the question &quot;Am I taking the lazy way out?&quot; is a really good<br/>\nquestion for parents to ask themselves.  If they don&#39;t understand that<br/>\nunschooling will mean their active involvement, time, energy, money in<br/>\nhelping their kids do what they want, then they need more and better<br/>\ninformation about unschooling.  If they think unschooling will mean an<br/>\neasier life for themselves while their kids are essentially left on their<br/>\nown then they need more information.  Because really, if the answer is, &quot;I <br/>\ndon&#39;t want to be bothered much by kids,&quot;  or &quot;I want time to do my own <br/>\nthing,&quot; then unschooling is not a good choice.<br/>\n<br/>\nI think most people who&#39;ve been on these lists awhile have seen new people<br/>\ncome and write something like...: &quot;I&#39;ve read all the books and looked at all<br/>\nthe websites and I love the idea of unschooling but how will they learn<br/>\ntheir multiplication tables?&quot;    I am wondering what we might do better to<br/>\nhelp new people understand the foundation.   We&#39;re good at helping<br/>\nthem implement unschooling ideas in specific real life situations.   I still<br/>\nsometimes feel we&#39;re missing something big.   If someone seriously read all<br/>\nthe books, read all the John Holt books, and STILL doesn&#39;t understand that<br/>\nmemorizing multiplication tables is a construct of school and has NO bearing<br/>\non whether a person will be able to multiply or divide when he needs to, <br/>\nthen<br/>\nI&#39;m not sure if what we&#39;re writing can get into their heads in a way that <br/>\nmakes sense.  If someone has read all the information at<br/>\nsay, Sandra Dodd&#39;s site, and still doesn&#39;t know that a stress filled home<br/>\nwith little or no activities and stress induced ill health is not<br/>\nunschooling - - what then?<br/>\n<br/>\nSome large percentage of people coming to these lists get it, and live it, <br/>\nand unschooling will blossom for them.  Because I&#39;ve had two personal emails <br/>\nin the last week from people who seem so very much NOT to get it, in spite <br/>\nof claiming to have &quot;read all the books&quot; I am wondering whether there are <br/>\nsome things we need to address more often on the list.   I wonder whether it <br/>\nis so natural to those of us who&#39;ve been living it for years that we not <br/>\npaying enough attention to the fact it&#39;s not at all natural to someone who&#39;s <br/>\njust pulling an unhappy kid out of school and wondering &quot;what next?&quot;<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"&quot;Melissa&quot; &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling w/a reading disability","postDate":"1170714065","msgId":21206,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVxOGFraCtxcTRwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFORUNKUEJBTUNER0VLQ0ZGR0JPTUVGSU9DQUEuSmxhenp0b29AY29tY2FzdC5uZXQ+"},"prevInTopic":21205,"nextInTopic":21207,"prevInTime":21205,"nextInTime":21207,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"Jackie, I just wanted to let you know that you are on the right track. We re unschooling our gang, and my biggest fear was my (at the time 8yo) daughter who","messageBody":"<div id=\"ygrps-yiv-558296335\">Jackie,<br/>\nI just wanted to let you know that you are on the right track. We&#39;re unschooling our gang, <br/>\nand my biggest fear was my (at the time 8yo) daughter who has autism. I was worried <br/>\nabout routine, about learning since there is a difficulty in learning from the environment <br/>\nwith this disability. In fact, that&#39;s why we started with a school at home approach (which <br/>\nwas okay, but certainly not fun)<br/>\n<br/>\nBut the truth is that the freedom has allowed her the ability to cope with all the learning <br/>\ntroubles, and learn IN HER WAY. She&#39;s functionally nonverbal, we didn&#39;t know how she <br/>\nunderstood things. She didn&#39;t have trouble learning, what she had trouble with was <br/>\nlearning in a manner that suited everyone else. WIth unschooling, she went from not <br/>\nreading to reading and answering questions in books that she loves. She&#39;s adding money, <br/>\nwhich is complicated math, decimals and percentages for taxes etc. <br/>\n<br/>\nI couldn&#39;t possibly tell you how to help your dh. I was very lucky in that we came to <br/>\nunschooling through me being on bedrest with the baby. SO we thought we&#39;d take a few <br/>\nmonths off from home &#39;schooling&#39;, and lo and behold, everyone was happier and we could <br/>\nsee them learning. It was like watching the quicktime version of a flower blooming, just <br/>\nright before our eyes. there was no incentive to turn back!! Josh and Bre (my two auties) <br/>\nwere a little slower to deschool, but they did it and our life is great.<br/>\n<br/>\nI hope this helps encourage you, even if it only answers half of the questions you asked ;-) <br/>\nThe short question even!<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Jackie Lazzaro&quot; &lt;jlazztoo@...&gt; wrote:<br/>\n  Am I on the right<br/>\n&gt; track?  And if so, can you give me any suggestions I can use to help dh<br/>\n&gt; understand why this would be a good choice to make.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":197731387,"authorName":"Marieke Willis","from":"Marieke Willis &lt;luuknam@...&gt;","profile":"luuknam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] subtitles (was: Re: unschooling w/a reading disability)","postDate":"1170712856","msgId":21210,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc2ODIzMy40ODIzMy5xbUB3ZWI1MzAwNi5tYWlsLnlhaG9vLmNvbT4=","inReplyToHeader":"PGVxODFiZitsZjk3QGVHcm91cHMuY29tPg=="},"prevInTopic":21209,"nextInTopic":21211,"prevInTime":21209,"nextInTime":21211,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"... It s probably nothing, but it could be that she has a mild hearing problem? I d ask her whether she just happens to like to read the captions, or whether","messageBody":"<div id=\"ygrps-yiv-2092787856\">--- Christy Mahoney &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschooling1@...\">unschooling1@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; My oldest daughter discovered closed captioning on the TV years ago <br/>\n&gt; and has always loved to have it on ever since. <br/>\n<br/>\n </span></blockquote>It&#39;s probably nothing, but it could be that she has a mild hearing<br/>\nproblem? I&#39;d ask her whether she just happens to like to read the<br/>\ncaptions, or whether it makes it easier for her to follow what they&#39;re<br/>\nsaying on TV.<br/>\n<br/>\nMarieke, who at last checkup (at 15yo) scored at the average hearing<br/>\nlevel of a 75yo... just not bad enough to do something about, other<br/>\nthan turn the subtitles on when watching movies.<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\nDon&#39;t pick lemons.<br/>\nSee all the new 2007 cars at Yahoo! Autos.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://autos.yahoo.com/new_cars.html\">http://autos.yahoo.com/new_cars.html</a></div>","specialLinks":[]},{"userId":96057767,"authorName":"Katharine Wise","from":"Katharine Wise &lt;katharinewise@...&gt;","profile":"katharinewise","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] re: unschooling w/a reading disability","postDate":"1170712047","msgId":21208,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyMjcyNy40MjI5Ny5xbUB3ZWI2MDMxMS5tYWlsLnlhaG9vLmNvbT4="},"prevInTopic":21207,"nextInTopic":21209,"prevInTime":21207,"nextInTime":21209,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"My oldest son was almost 10 when he learned how to read, and the lack of shame was one of the most awesome features of unschooling him. I m sure that if he d","messageBody":"<div id=\"ygrps-yiv-726942078\">My oldest son was almost 10 when he learned how to read, and the lack of shame was one of the most awesome features of unschooling him.  <br/>\n<br/>\nI&#39;m sure that if he&#39;d been in school he&#39;d have been diagnosed with a learning disability because, in his case, it was clear to me that it wasn&#39;t simply lack of interest but lack of certain &quot;pre-reading&quot; skills.  He didn&#39;t get the concept of rhyming or any sense of phonetic connection until shortly before he taught himself to read.  For instance, he enjoyed playing I Spy but we had to stick to visual clues, &quot;I spy something red (or round).&quot;  I couldn&#39;t say, &quot;I spy something that begins with the letter &#39;B&#39; (or the sound /b/).&quot;  He also had some speech delays.<br/>\n<br/>\nHowever, not being in school or &quot;schooled&quot;, he just asked when he needed to know what something said or how to write something.  He had no sense of self-consciousness about it, even when we were in public.  (I have to confess, however, that I sometimes had to squelch my own self-consciousness!)  The summer my oldest was 9 he went to karate camp.  It never occurred to me that he&#39;d have any reason to read or write there, but I was a little early picking him up on the 3rd or 4th day and saw the instructor handing out journals to the students and telling them what he wanted them to write about.  (They were more evaluations for the dojo&#39;s use than journals, really, as he wanted them to write what their favorite activities were.)  I felt awful that I had put ds in that situation without letting the teacher know.  But my son raised his hand, and since this was the 3rd or 4th day they already knew what he needed, and one of the junior black-belts went over and spelled out each word<br/>\n for him.  I casually asked my son about it later, and he said that on the first day he just asked for help spelling the words.  It was clear it hadn&#39;t bothered him at all.<br/>\n<br/>\nKatharine<br/>\n<br/>\n----- Original Message ----<br/>\n<br/>\n  But I try to be as patient as possible and he is <br/>\n<br/>\nreading without frustration (well, sometimes a little) and without <br/>\n<br/>\nshame from the school system because oh my gosh!!, he is so old to <br/>\n<br/>\njust be learning how to read!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\nDon&#39;t pick lemons.<br/>\nSee all the new 2007 cars at Yahoo! Autos.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://autos.yahoo.com/new_cars.html\">http://autos.yahoo.com/new_cars.html</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":261066351,"authorName":"Kimberly Hays Grow","from":"&quot;Kimberly Hays Grow&quot; &lt;khaysgrow@...&gt;","profile":"khaysgrow","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Why I unschool","postDate":"1170709893","msgId":21209,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExOS1EQVYxNEY4NkIyMzU1RkNGRjIyNjNGNUE0QTA5ODBAcGh4LmdibD4=","referencesHeader":"PGVxN3FqNSszaDNvQGVHcm91cHMuY29tPg=="},"prevInTopic":21208,"nextInTopic":21210,"prevInTime":21208,"nextInTime":21210,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"... Thanks for the great idea.  We will definitely be trying that.  Eventually he will get a real board for him.  He really wants to get the parts so that he","messageBody":"<div id=\"ygrps-yiv-436024329\"><blockquote><span title=\"ireply\">&gt;One thing I&#39;ve been doing with my stepson is helping him make stencils <br/>\n&gt;for spray-painting different designs on his boards.<br/>\n<br/>\n </span></blockquote>Thanks for the great idea.  We will definitely be trying that.  Eventually he will get a real board for him.  He really wants to get the parts so that he can design his own.  he is trying to figure out how to get a piece of wood to turn up at the ends so he can make that into a skateboard.  He is very inventive.  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":236897304,"authorName":"frozenandcold","from":"&quot;frozenandcold&quot; &lt;fivefreebirds@...&gt;","profile":"frozenandcold","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"re: unschooling w/a reading disability","postDate":"1170706323","msgId":21205,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVxODMyaisycnQ2QGVHcm91cHMuY29tPg=="},"prevInTopic":21204,"nextInTopic":21206,"prevInTime":21204,"nextInTime":21206,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":" My ds is 11 1/2 and just","messageBody":"<div id=\"ygrps-yiv-1371825389\">&lt;&lt;&lt;&lt;Has anyone been<br/>\nsuccessful w/unschooling in this situation? If so, can you tell me <br/>\nhow you<br/>\napproached it with the child?&gt;&gt;&gt;&gt;<br/>\n<br/>\nMy ds is 11 1/2 and just barely reading.  We chose to step back and <br/>\nlet it naturally happen.  I had an advantage in that my sister, <br/>\nRen&#39;s, son didn&#39;t learn to read until 12 and you wouldn&#39;t know now <br/>\nthat he didn&#39;t learn at 6.  He is 13.  My son learned how to read <br/>\n(and is still learning harder words) by playing Runescape, World of <br/>\nWarcraft, and other games.  I sit with him by the hours and read the <br/>\ncaptions to him and just in the last month he is reading them on his <br/>\nown.  Through the process he asks what letters make which sounds, <br/>\nwhich combinations, words that aren&#39;t phonetic at all that he has to <br/>\njust memorize, etc.  It has been amazing watching the process.  Yes, <br/>\nit is exhausting to me at times, when I am in the middle of <br/>\nsomething and every five minutes I hear, &quot;Mom, will you read this?  <br/>\nHurry, it disappears if you wait too long.  Hurry, my character is <br/>\ngoing to die!!&quot;  But I try to be as patient as possible and he is <br/>\nreading without frustration (well, sometimes a little) and without <br/>\nshame from the school system because oh my gosh!!, he is so old to <br/>\njust be learning how to read!<br/>\n<br/>\n<br/>\nHeidi</div>","specialLinks":[]},{"userId":145246818,"authorName":"Christy Mahoney","from":"&quot;Christy Mahoney&quot; &lt;unschooling1@...&gt;","profile":"unschooling1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling w/a reading disability","postDate":"1170704559","msgId":21204,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVxODFiZitsZjk3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFORUNKUEJBTUNER0VLQ0ZGR0JPTUVGSU9DQUEuSmxhenp0b29AY29tY2FzdC5uZXQ+"},"prevInTopic":21203,"nextInTopic":21205,"prevInTime":21203,"nextInTime":21205,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"Jackie, to answer your question quickly - yes.  Yes, I have 2 daughters who have both learned to read without my teaching them.  I don t know how familiar you","messageBody":"<div id=\"ygrps-yiv-1188118485\">Jackie, to answer your question quickly - yes.  Yes, I have 2 <br/>\ndaughters who have both learned to read without my teaching them.  I <br/>\ndon&#39;t know how familiar you are with unschooling, but this is the <br/>\nessence - kids learn without being taught.  If you check out any of <br/>\nthe links on this site, I would highly recommend Sandra Dodd&#39;s site <br/>\nand the Joyfully Rejoycing site for loads of anecdotes about <br/>\nlearning to read.  <br/>\n<br/>\nAs far as how I approached it, I just answered their questions and <br/>\nread to them, whether it was books or video games or signs or stuff <br/>\non the computer or board game boxes or DVD cases or names on the <br/>\nglobe or food packages or cleaning products - you get the idea.  My <br/>\noldest daughter discovered closed captioning on the TV years ago and <br/>\nhas always loved to have it on ever since.  That helped my younger <br/>\ndaughter learn to read as well. <br/>\n<br/>\nI can&#39;t tell you what your daughter&#39;s learning to read will look <br/>\nlike, but if she is fighting homework and sees learning to read as <br/>\nsomething to resist, it will likely be more difficult.  My daughters <br/>\nhave never had homework to fight about, and learning to read was an <br/>\nentirely natural and enjoyable process that happened because they <br/>\nwanted to know what things said.  <br/>\n<br/>\n-Christy M.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Now that I have been hs&#39;g my older dd, I am beginning to think  <br/>\n </span></blockquote>that I could<br/>\n<blockquote><span title=\"ireply\"> &gt; do a fine job of helping my younger dd learn to read.  Has anyone <br/>\n </span></blockquote>been<br/>\n<blockquote><span title=\"ireply\"> &gt; successful w/unschooling in this situation?  If so, can you tell <br/>\n </span></blockquote>me how you<br/>\n<blockquote><span title=\"ireply\"> &gt; approached it with the child?  My dh is sceptical that I can teach <br/>\n </span></blockquote>her,<br/>\n<blockquote><span title=\"ireply\"> &gt; because he sees how she fights doing homework.  I think that not <br/>\n </span></blockquote>having to<br/>\n<blockquote><span title=\"ireply\"> &gt; spend 6hrs a day in school, then come home to a ton of homework at <br/>\n </span></blockquote>night,<br/>\n<blockquote><span title=\"ireply\"> &gt; will create a completely different situation.  One where she can <br/>\n </span></blockquote>sit and<br/>\n<blockquote><span title=\"ireply\"> &gt; read the books she wants.  If she asks me why something is spelled <br/>\n </span></blockquote>that way,<br/>\n<blockquote><span title=\"ireply\"> &gt; or written that way, etc, we can investigate it together.  Am I on <br/>\n </span></blockquote>the right<br/>\n<blockquote><span title=\"ireply\"> &gt; track?  And if so, can you give me any suggestions I can use to <br/>\n </span></blockquote>help dh<br/>\n<blockquote><span title=\"qreply\"> &gt; understand why this would be a good choice to make.<br/>\n&gt; <br/>\n&gt; TIA.<br/>\n&gt; <br/>\n&gt; :-)<br/>\n&gt; <br/>\n&gt; Jackie<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Why I unschool","postDate":"1170697637","msgId":21202,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVxN3FqNSszaDNvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTExOS1EQVYyODMyNjAzNjIwNDZEODIwM0UzQzdBMDk4MEBwaHguZ2JsPg=="},"prevInTopic":21201,"nextInTopic":21203,"prevInTime":21201,"nextInTime":21203,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"... too. One thing I ve been doing with my stepson is helping him make stencils for spray-painting different designs on his boards. That s fun for both of us.","messageBody":"<div id=\"ygrps-yiv-2018786672\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Kimberly Hays Grow&quot; <br/>\n&lt;khaysgrow@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I am pretty crafty, maybe I can make a skateboard out of cardboard <br/>\n </span></blockquote>too.<br/>\n<br/>\nOne thing I&#39;ve been doing with my stepson is helping him make stencils <br/>\nfor spray-painting different designs on his boards. That&#39;s fun for <br/>\nboth of us. Its pretty simple to make stencils with posterboard. About <br/>\na week ago we image-searched &quot;skull&quot; and variations on that theme and <br/>\nfound some basic designs we could work from. Lots of fun, and it gave <br/>\nus a chance to talk about intellectual property rights and copyright <br/>\ninfringement. And we got to see some Great tatoos ;)<br/>\n<br/>\n---Meredith (Mo 5, Ray 13)</div>","specialLinks":[]},{"userId":156499635,"authorName":"Jackie Lazzaro","from":"&quot;Jackie Lazzaro&quot; &lt;jlazztoo@...&gt;","profile":"lazzarji","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling w/a reading disability","postDate":"1170694725","msgId":21203,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFORUNKUEJBTUNER0VLQ0ZGR0JPTUVGSU9DQUEuSmxhenp0b29AY29tY2FzdC5uZXQ+","inReplyToHeader":"PEFORUNKUEJBTUNER0VLQ0ZGR0JPQ0VGRk9DQUEuSmxhenp0b29AY29tY2FzdC5uZXQ+"},"prevInTopic":21202,"nextInTopic":21204,"prevInTime":21202,"nextInTime":21204,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"I started hs g my 10 yo at the beg of the year.  She is a self motivated person, so I never questioned her ability to find things that interested her and learn","messageBody":"<div id=\"ygrps-yiv-1544481508\">I started hs&#39;g my 10 yo at the beg of the year.  She is a self motivated<br/>\nperson, so I never questioned her ability to find things that interested her<br/>\nand learn more about them.  She already had a clear list of interests -<br/>\nnatural disasters, weather, astronomy to name a few.  My dh was totally on<br/>\nboard w/teaching her at home, since it would give her so much more freedom<br/>\nin choose what to study and at what level.<br/>\n<br/>\nOn to my 8yo.  The school wanted her to repeat 1st grade because her reading<br/>\nlevel didn&#39;t change much from the beginning to the end of 1st grade.<br/>\nInstead, we had her tested and were told that she has a reading disability.<br/>\nShe needed a &quot;multi-sensory&quot; approach to reading.  We went back to the<br/>\nschool, told them we would put her into a private reading program and that<br/>\nthey needed to put her into 2nd grade.  Turned out to be far and away the<br/>\nright decision.  Now she is in 3rd.  She is still taking the private reading<br/>\nclasses (it&#39;s like a sylvan center), and is getting a&#39;s and b&#39;s in reading.<br/>\n<br/>\nNow that I have been hs&#39;g my older dd, I am beginning to think  that I could<br/>\ndo a fine job of helping my younger dd learn to read.  Has anyone been<br/>\nsuccessful w/unschooling in this situation?  If so, can you tell me how you<br/>\napproached it with the child?  My dh is sceptical that I can teach her,<br/>\nbecause he sees how she fights doing homework.  I think that not having to<br/>\nspend 6hrs a day in school, then come home to a ton of homework at night,<br/>\nwill create a completely different situation.  One where she can sit and<br/>\nread the books she wants.  If she asks me why something is spelled that way,<br/>\nor written that way, etc, we can investigate it together.  Am I on the right<br/>\ntrack?  And if so, can you give me any suggestions I can use to help dh<br/>\nunderstand why this would be a good choice to make.<br/>\n<br/>\nTIA.<br/>\n<br/>\n:-)<br/>\n<br/>\nJackie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":156499635,"authorName":"Jackie Lazzaro","from":"&quot;Jackie Lazzaro&quot; &lt;jlazztoo@...&gt;","profile":"lazzarji","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Interest in baby animals","postDate":"1170693414","msgId":21201,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFORUNKUEJBTUNER0VLQ0ZGR0JPQ0VGRk9DQUEuSmxhenp0b29AY29tY2FzdC5uZXQ+","inReplyToHeader":"PGVxN2gzbSs1YnBoQGVHcm91cHMuY29tPg=="},"prevInTopic":21200,"nextInTopic":21202,"prevInTime":21200,"nextInTime":21202,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"My 8yo asked me this morning if she could see newborn kittens and puppies. We have cats, but we ve always gotten them at 8 wks or so.  My cats are fixed, so we","messageBody":"<div id=\"ygrps-yiv-304585055\">My 8yo asked me this morning if she could see newborn kittens and puppies.<br/>\nWe have cats, but we&#39;ve always gotten them at 8 wks or so.  My cats are<br/>\nfixed, so we won&#39;t be having any litters here.  lol!<br/>\n<br/>\nI would like to take her somewhere so she could see cats or dogs having<br/>\ntheir litters, but I have no idea where to go to do something like this.<br/>\nHas anyone here done anything like this, or have any suggestions?<br/>\n<br/>\nThx!<br/>\n<br/>\n:-)<br/>\n<br/>\nJackie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Why I unschool","postDate":"1170687926","msgId":21200,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVxN2gzbSs1YnBoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVxNXNsaStwdnAxQGVHcm91cHMuY29tPg=="},"prevInTopic":21199,"nextInTopic":21201,"prevInTime":21199,"nextInTime":21201,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"~~ I am sometimes afraid that people who are just so burned out by the stress  of schooling and parenting and other of life s challenges, come to unschooling","messageBody":"<div id=\"ygrps-yiv-1518452655\">~~&gt;I am sometimes afraid that people who are just so burned out by the<br/>\nstress  of schooling and parenting and other of life&#39;s challenges,<br/>\ncome to unschooling because they believe they won&#39;t have to do as much.~~<br/>\n<br/>\n<br/>\nWell, you definitely do a LOT some days (others not-so-much) when<br/>\nunschooling.....but I think realizing that schooling doesn&#39;t work is a<br/>\ngreat place to begin unschooling!! Burned out people suddenly<br/>\nrealizing that they don&#39;t have to create all that stress in order for<br/>\ntheir children to learn is GREAT.<br/>\n<br/>\nI DO think unschooling is easier. It&#39;s a LOT easier to go with the<br/>\nflow of nature than to cause constant friction over schoolwork. Just<br/>\nlike it&#39;s easier to garden with native species and permaculture in<br/>\nmind, it&#39;s easier to grow kids naturally!;)<br/>\n<br/>\nI think unschooling is very Zen-like that way....it&#39;s all about going<br/>\nwith the flow of what IS, rather than trying to create what you think<br/>\n&quot;should be&quot;. That&#39;s a helluva lot easier and more peaceful than the<br/>\nother options. But it doesn&#39;t mean you can kick back and ignore your<br/>\nkids (that&#39;s not really going with the flow either is it?).<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":261066351,"authorName":"Kimberly Hays Grow","from":"&quot;Kimberly Hays Grow&quot; &lt;khaysgrow@...&gt;","profile":"khaysgrow","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Why I unschool","postDate":"1170636984","msgId":21199,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExOS1EQVYyODMyNjAzNjIwNDZEODIwM0UzQzdBMDk4MEBwaHguZ2JsPg==","referencesHeader":"PGVxNXNsaStwdnAxQGVHcm91cHMuY29tPg=="},"prevInTopic":21197,"nextInTopic":21200,"prevInTime":21198,"nextInTime":21200,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"... Meredith, What you are saying makes so much sense!  My son is really into skateboarding and plays a skateboarding game on X-Box, on gameboy and even makes","messageBody":"<div id=\"ygrps-yiv-342133363\"><blockquote><span title=\"ireply\">&gt;I have a different perspective, on reading your post, which is that <br/>\n&gt;your girls are not &quot;learning on their own&quot; but learning and <br/>\n&gt;exploring along *with* you. The trouble is, you don&#39;t have the same <br/>\n&gt;sorts of things in common with your guy, so you&#39;re floundering.<br/>\n<br/>\n </span></blockquote>Meredith,<br/>\n<br/>\nWhat you are saying makes so much sense!  My son is really into skateboarding and plays a skateboarding game on X-Box, on gameboy and even makes his own skateboards and accessories out of cardboard.  We have to go to the store once a week or so to find this kid some cardboard.  I try to take an interest in it and I always ask what he is up to and the like.  I just don&#39;t get it.  He likes to play on his own, I&#39;m not sure he would even let me play with him.  I will definitely give that a try tomorrow.  I am pretty crafty, maybe I can make a skateboard out of cardboard too. LOL  Whenever I am out somewhere I always try to find him something skateboard related.  I got him a magazine and he loved that.  We will probably get a subscription.  I also got him a book from the library that he enjoyed a lot.  He spends time on the computer researching it.  I guess he will learn a lot from all of that somehow.  Just because he isn&#39;t doing something that &quot;I&quot; think is educational, doesn&#39;t mean it isn&#39;t valid to him.  This is why I love unschooling!  He is free to be himself.  Now if I can just get it too!<br/>\n<br/>\nThanks for all the feedback.  It really helps!<br/>\n<br/>\nKimberly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Why I unschool","postDate":"1170634226","msgId":21197,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVxNXNsaStwdnAxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTExOS1EQVYxNENCQURCMzVBOTBGODUzMUQ5MkFBMDk5MEBwaHguZ2JsPg=="},"prevInTopic":21194,"nextInTopic":21199,"prevInTime":21196,"nextInTime":21198,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"... I have a different perspective, on reading your post, which is that your girls are not learning on their own but learning and exploring along *with* you.","messageBody":"<div id=\"ygrps-yiv-677243378\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Kimberly Hays Grow&quot; <br/>\n&lt;khaysgrow@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; however, my son never joins us on our adventures and playing with <br/>\n&gt;the family.  I worry about him a lot.  I am having a much harder <br/>\n&gt;time trusting that he will learn anything on his own.  I would <br/>\n&gt;welcome any and all advice that you good people could offer.  I am <br/>\n&gt;always anxious to figure out how to do life better.<br/>\n<br/>\n </span></blockquote>I have a different perspective, on reading your post, which is that <br/>\nyour girls are not &quot;learning on their own&quot; but learning and <br/>\nexploring along *with* you. The trouble is, you don&#39;t have the same <br/>\nsorts of things in common with your guy, so you&#39;re floundering. I <br/>\ncan relate to that, to an extent. My stepson and I don&#39;t have a lot <br/>\nof interests in common, and some days that&#39;s frustrating. I feel <br/>\nlike I have to work a Lot harder to connect with him than I do with <br/>\nmy dd. <br/>\n<br/>\nThat&#39;s something I&#39;ve been working on, though. I mean really making <br/>\na concious effort to *see* his interests and value them *as* his <br/>\ninterests. And then look for ways to connect. We talk about that a <br/>\nLot, too. I ask him questions about things he&#39;s doing and then go do <br/>\nsome online research to find out more - how can I help facilitate <br/>\nthis interest. How can I at least have more meaningful conversations <br/>\non the subject, rather than always saying &quot;okay, what&#39;s that, again?&quot;<br/>\n<br/>\nWikipedia is great for this - it even has the plots and characters <br/>\nof tv shows and descriptions of games! Its soooooo cool! It&#39;s been <br/>\nreally helpful for me.<br/>\n<br/>\nTake the time to learn to play at least one of his games. Sit and <br/>\nwatch enough of all of them to get an idea which *you* would most <br/>\nenjoy. Go online and read about all of them - there will be things <br/>\nyou miss, so go do some research so you can ask him meaningful <br/>\nquestions. Get an idea of the different *kinds* of games out there <br/>\nso you can help him find more that he likes - and more that you <br/>\nlike, too. <br/>\n<br/>\nIf your girls wanted you to read a story to them that you didn&#39;t <br/>\nreally like, would you read it? If they enjoyed a board game that <br/>\nyou didn&#39;t, would you play it? If they wanted to identify animals by <br/>\ntheir scat, instead of tracks, would you carry the baggies? <br/>\n<br/>\nDon&#39;t cut your son out of your life just because he has different <br/>\ninterests. Expand your own mind and life to make room for him.<br/>\n<br/>\n---Meredith (Mo 5, Ray 13)</div>","specialLinks":[]},{"userId":261066351,"authorName":"Kimberly Hays Grow","from":"&quot;Kimberly Hays Grow&quot; &lt;khaysgrow@...&gt;","profile":"khaysgrow","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Why I unschool...(was A Concerned Therapist)","postDate":"1170612732","msgId":21194,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExOS1EQVYxNENCQURCMzVBOTBGODUzMUQ5MkFBMDk5MEBwaHguZ2JsPg==","referencesHeader":"PDAwNjcwMWM3NDg4MSRkYmQwOTcxMCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":0,"nextInTopic":21197,"prevInTime":21193,"nextInTime":21195,"topicId":21194,"numMessagesInTopic":0,"msgSnippet":"... This was a hard one for me.  I had to really put my thinking cap on.  When I first started with unschooling, I really thought that it would be easier, for","messageBody":"<div id=\"ygrps-yiv-1774245619\"><blockquote><span title=\"ireply\">&gt;Why do you want to be an unschooler? <br/>\n<br/>\n&gt;I am sometimes afraid that people who are just so burned out by the stress <br/>\n&gt;of schooling and parenting and other of life&#39;s challenges, come to <br/>\n&gt;unschooling because they believe they won&#39;t have to do as much.<br/>\n<br/>\n </span></blockquote>This was a hard one for me.  I had to really put my thinking cap on.  When I first started with unschooling, I really thought that it would be easier, for myself and my kids.  Probably why I thought that I was taking the lazy way out.  Now that I have been doing it about a month or so, I have learned more about unschooling, from groups like this and reading a lot of books and articles about unschooling.  I really and truly believe that children will learn more and have a better education if they are left to their own devices.  If I try to push it on them they resist and don&#39;t learn.  I still have concerns especially about my son.  He never leaves the house except to go to the neighbors once in a while.  He won&#39;t go to the library or any of the other places that we (my daughter&#39;s and I) go.  They seem so much more open to the concept and I feel that they are learning all kinds of things.  Left to pick out the books that they want to look at instead of the ones that I think are important has opened up a whole new world for them.  I am becoming so much more involved, and I thought that I was involved before.  We have been without a car for the last week or so and we have walked to the library and the post office several times, along the way my daughter discovered animal tracks in the snow, so we have been having fun learning about the different kinds of tracks that can be found in town (where we live) versus out in the country (where grandma lives).  I have been reading to them every day and I we are spending so much time playing board games.  however, my son never joins us on our adventures and playing with the family.  I worry about him a lot.  I am having a much harder time trusting that he will learn anything on his own.  I would welcome any and all advice that you good people could offer.  I am always anxious to figure out how to do life better.<br/>\n<br/>\nThanks,<br/>\nKimberly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":21031,"nextTopicId":21321}}