{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Any thoughts?","postDate":"1182178354","msgId":24519,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1NjY3aSt0MG1xQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY0dDZsdSszN2Y5QGVHcm91cHMuY29tPg=="},"prevInTopic":24492,"nextInTopic":0,"prevInTime":24518,"nextInTime":24520,"topicId":24486,"numMessagesInTopic":0,"msgSnippet":"... my daughter anxious ... her to make decisions ... too young an age. I do think its possible to push a child to be more independent than she is","messageBody":"<div id=\"ygrps-yiv-1115572857\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;sylvia057&quot; <br/>\n&lt;sylvia057@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Finally someone recently commented to me that I might be making <br/>\n </span></blockquote>my daughter anxious <br/>\n<blockquote><span title=\"ireply\"> &gt; by giving her too much freedom at too early an age.  That inviting <br/>\n </span></blockquote>her to make decisions <br/>\n<blockquote><span title=\"ireply\"> &gt; might leave her feeling like she has too much responsibility at <br/>\n </span></blockquote>too young an age.<br/>\n<br/>\nI do think its possible to &quot;push&quot; a child to be more independent <br/>\nthan she is emotionally ready for, but that&#39;s not something that&#39;s <br/>\ndependent on age. There are ways my 5yo is more independent than my <br/>\n13yo, just bc of differences in personality. It would be useful to <br/>\ndo a little self-check and see if you are saying things like &quot;oh, <br/>\nyou can do that&quot; (or even just sighing in exasperation) when your <br/>\n3yo is asking for help. <br/>\n<br/>\nAt the same time, I think its possible to do too many things *for* a <br/>\nchild when a child really wants to explore and experiment - <br/>\nespecially during the transition from &quot;toddler&quot; to &quot;little kid&quot;. <br/>\nSome kids want to try *everything* and need lots of opportunities <br/>\nand facilitation - and that does make a lot more work for parents. <br/>\n<br/>\nWith Morgan (my &quot;always unschooled&quot; kid) I&#39;ve seen a sort of ebb and <br/>\nflow in the area of independence. She has gone through phases of <br/>\nwanting to do everything herself and phases of wanting me or George <br/>\nto do everything for her - even things she&#39;s already &quot;mastered&quot;.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I want our relationship to be peaceful <br/>\n&gt; but some days she screams &quot;Mommy you&#39;re not answering me!&quot; when <br/>\n </span></blockquote>all I was trying to do <br/>\n<blockquote><span title=\"ireply\"> &gt; was to figure out how to answer her question.<br/>\n<br/>\n </span></blockquote>Maybe you could say something like &quot;I&#39;m thinking&quot; or make some <br/>\nreally clear &quot;listening&quot; sounds and gestures so she can connect more <br/>\nwith your process. After all, it can be hard to tell the difference <br/>\nbetween &quot;mommy thinking&quot; and &quot;mommy getting distracted&quot;. I usually <br/>\nfind that when Morgan is doing a lot of yelling at *me* its bc I&#39;ve <br/>\nbeen getting distracted frequently. <br/>\n<br/>\n---Meredith (Mo 5.5, Ray 13)</div>","specialLinks":[]},{"userId":7644358,"authorName":"Kidgie@aol.com","from":"Kidgie@...","profile":"mama_de_julian_y_julia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Any thoughts?","postDate":"1182015868","msgId":24492,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ2MS5hZGIxZmE3LjMzYTU3YjdjQGFvbC5jb20+"},"prevInTopic":24486,"nextInTopic":24519,"prevInTime":24491,"nextInTime":24493,"topicId":24486,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/15/2007 5:02:31 A.M. Pacific Daylight Time, sylvia057@yahoo.com writes: Finally  someone recently commented to me that I might be making","messageBody":"<div id=\"ygrps-yiv-1486188059\">In a message dated 6/15/2007 5:02:31 A.M. Pacific Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sylvia057@...\">sylvia057@...</a> writes:<br/>\n<br/>\nFinally  someone recently commented to me that I might be making my daughter <br/>\nanxious  <br/>\nby giving her too much freedom at too early an age.  That inviting  her to <br/>\nmake decisions <br/>\nmight leave her feeling like she has too much  responsibility at too young an <br/>\nage.  Writing <br/>\nit now it sounds like  baloney but at the time I felt a distinct Uh-Oh <br/>\nsensation in my  gut.<br/>\n<br/>\n<br/>\n<br/>\nYou know, I think that people who are not in the know about unschooling,  <br/>\nthink that we run willy-nilly, lol, and that our kids have no idea of any limits  <br/>\nor anything. Or that we don&#39;t pay attention or don&#39;t care and they seem  to <br/>\nassume the kids are coloring all over the walls, throwing food, lol,  making <br/>\ndisasters wherever they go while we look, smile and say, &quot;Oh, isn&#39;t he  just <br/>\nGREAT?!&quot; lol! Which is of course, totally untrue. We guide, we help, we  support, <br/>\nwe show by doing, we do all KINDS of things that help our children  learn <br/>\nthemselves, (learn who they are is what I mean there) - at least *I*  think *I* <br/>\ndo, lol. I guide more than some parents I think. I do say &quot;no&quot;  sometimes, <br/>\nthough I try not to, and I almost always (because I&#39;m human, I err,  and I&#39;ve been <br/>\nknown to crack under my own perceived pressure and ...yell...lol)  give a <br/>\nreason why I am saying no to something. But here, with us, I have areas  in which <br/>\nthe kids have total freedom of choice, and there are some areas I&#39;m not  that <br/>\nopen about. For example, at Target - I won&#39;t buy the Minute Maid Lemonade  <br/>\njuice boxes...there is high fructose corn syrup in it, so we get Trader Joe&#39;s  <br/>\nversion - regular sugar. Julian (age 4, nearing 5) asks, I say no, I remind  <br/>\nhim why and also let him know when we are going to TJs, and that we will get  <br/>\nthem there. That&#39;s fine with him, it all works out. I am getting more relaxed  <br/>\nwith food, but I&#39;m not &quot;there&quot; all the way yet, but am better. I know that  <br/>\nJulian will ignore his hunger when he is focused on other things, then he  <br/>\nbecomes ravenous and moody as a result - so I make meals for him, remind him to  <br/>\neat...I don&#39;t force contents down his mouth and I let him eat where he is  <br/>\nusually and it&#39;s working out well, lol...<br/>\n <br/>\nI don&#39;t know what I&#39;m saying, lol...I guess it&#39;s this: You know  your child, <br/>\nmaybe there are some areas that you can loosen up in and maybe there  are some <br/>\nareas that more structure is wanted. She is learning, so are you. Its a  <br/>\nprocess. Maybe you can give her options and choices in areas that she is already  <br/>\nreally strong in, and gently help her to make more choices on her own in the  <br/>\nareas in which it&#39;s still too much for her.You mentioned that she screams at  <br/>\nyou, saying you&#39;re not listening. Can you try to avoid that situation by <br/>\nsaying  right off, &quot;What you said is important, and I want to respond to you the <br/>\nbest I  can. I need a minute to think about that.&quot;? Would that be helpful at all <br/>\nto you? <br/>\n <br/>\nI wanted to mention that horrid &quot;please&quot; issue too. Gee, why do people DO  <br/>\nthat?! An insincere &quot;please&quot; is yucky, in my opinion. Asking nicely is just as  <br/>\ngood I feel. I don&#39;t like it if my kids yell at someone to get them something, <br/>\n or say things in a really demanding way - and they super rarely hardly ever <br/>\ndo  that :) lol..I don&#39;t demand please and thank you. They model me - I say <br/>\nit, so  do they. I don&#39;t demand in a nasty tone of voice, I speak in a decent <br/>\ntone of  voice, but don&#39;t ALWAYS say please. What person does, child or adult? <br/>\nThere is a  difference between &quot;Get me some juice!!&quot; and &quot;Could you pour me <br/>\nsome juice?&quot; I  try to model the first example and have even reminded other <br/>\nadults that  something said in a &quot;nice tone of voice&quot; is, actually, a way of saying <br/>\nplease. I  have done this at stores, with adults, you name it. <br/>\n <br/>\nAnyway, I have no idea if that helped you or not, or if you even really  <br/>\nneeded any help really - because you sound so loving and so sensitive to your  <br/>\nchildren&#39;s needs and wants, I bet you&#39;re moving along just fine in this issue. <br/>\n <br/>\nTake care,<br/>\nKaren <br/>\n<br/>\n<br/>\n<br/>\n************************************** See what&#39;s free at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com\">http://www.aol.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":128053142,"authorName":"sylvia057","from":"&quot;sylvia057&quot; &lt;sylvia057@...&gt;","profile":"sylvia057","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Any thoughts?","postDate":"1181883902","msgId":24486,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0dDZsdSszN2Y5QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":24492,"prevInTime":24485,"nextInTime":24487,"topicId":24486,"numMessagesInTopic":0,"msgSnippet":"Greetings wise parents!  I am new to the list and have been lurking for a while but much of the discussion has motivated me to post my concern about my","messageBody":"<div id=\"ygrps-yiv-1716648449\">Greetings wise parents!  I am new to the list and have been lurking for a while but much of <br/>\nthe discussion has motivated me to post my concern about my relationship with my DD, <br/>\nwho just turned 3.<br/>\n<br/>\nI&#39;m worried about my relationship her I want her to know that I love her unconditionally <br/>\nbut I fear that she believes that my love is indeed conditional.  I try as much as possible to <br/>\nsay yes at every turn and put the relationship first, however I also have a one year old son.  <br/>\nNeedless to say sleep deprivation is a way of life for me.  Also both kids really need me - <br/>\nto nurse, to change diapers, to eat, to explain why.  I want our relationship to be peaceful <br/>\nbut some days she screams &quot;Mommy you&#39;re not answering me!&quot; when all I was trying to do <br/>\nwas to figure out how to answer her question.  How do you juggle two young people who <br/>\nhave very big needs?<br/>\n<br/>\nI want to just go with her flow but I also have to consider the needs of her brother too.  <br/>\n<br/>\nAlso she is at an age where every adult feels they have to drill the please and thank you <br/>\nthing into her.  It seems really inhumane the giant adult holding the sippy cup over the <br/>\nhead of the thirsty child saying &quot;what&#39;s the magic word?&quot;  And much to my horror I have <br/>\nbeen that person.  It is very hard not to get sucked in to conventional parenting when on a <br/>\nplaydate or what not.  <br/>\n<br/>\nFinally someone recently commented to me that I might be making my daughter anxious <br/>\nby giving her too much freedom at too early an age.  That inviting her to make decisions <br/>\nmight leave her feeling like she has too much responsibility at too young an age.  Writing <br/>\nit now it sounds like baloney but at the time I felt a distinct Uh-Oh sensation in my gut.<br/>\n<br/>\nThanks for the thought provoking posts.<br/>\n<br/>\nSylvia</div>","specialLinks":[]}],"prevTopicId":24322,"nextTopicId":24524}}