{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: older child hitting/pushing younger child","postDate":"1363798899","msgId":49749,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtpY3ExaisxMDFtdEBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PGtpY2NoMitpbHZkQGVHcm91cHMuY29tPg=="},"prevInTopic":49748,"nextInTopic":0,"prevInTime":49748,"nextInTime":49750,"topicId":49682,"numMessagesInTopic":0,"msgSnippet":"... Little kids aren t very good at asking for what they want, or remembering the other person has feelings, too, or thinking before they act - so they snatch","messageBody":"<div id=\"ygrps-yiv-1362467369\">&quot;vapurohit&quot; &lt;vandana.purohit@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; i&#39;m curious what you guys think about snatching. <br/>\n<br/>\n </span></blockquote>Little kids aren&#39;t very good at asking for what they want, or remembering the other person has feelings, too, or thinking before they act - so they snatch things. It&#39;s the sort of thing you play by ear - often very young children don&#39;t mind moving on to something else, but as your younger child gets older &quot;snatching&quot; could turn into tug-of-war and fighting - so it&#39;s important to stay close and help them figure things out. There&#39;s no one right way to do that! It depends on what&#39;s going on in the moment, and what&#39;s been going on for the past few minutes, the time of day, moods, who&#39;s hungry or tired or wants some attention...<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":204615647,"authorName":"vapurohit","from":"&quot;vapurohit&quot; &lt;vandana.purohit@...&gt;","profile":"vapurohit","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: older child hitting/pushing younger child","postDate":"1363785058","msgId":49748,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtpY2NoMitpbHZkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtoZHUwaitrdDA0QGVHcm91cHMuY29tPg=="},"prevInTopic":49723,"nextInTopic":49749,"prevInTime":49746,"nextInTime":49749,"topicId":49682,"numMessagesInTopic":0,"msgSnippet":"thanks for all the feedback from everyone. It was very helpful. overall i ve gotten quicker at intervening..getting in between.  i am pretty relaxed in my","messageBody":"<div id=\"ygrps-yiv-2124434935\">thanks for all the feedback from everyone. It was very helpful. overall i&#39;ve gotten quicker at intervening..getting in between.  i am pretty relaxed in my demanor but really the hitting and throwing things keeps me on my toes because i really dont seem to be able to tell when it&#39;s going to happen. really working my reflexes :) i often tell my son to give the other child love right after and he does by gently caressing him. but mostly i get inbetween and redirect.<br/>\n<br/>\nThe reason i sometimes told my son to hit the sofa was just because that was the idea i thought of at the moment..maybe becaue he was more after the other child and i wanted to break the pattern. the message is that this can be hit, it doesn&#39;t hurt, but &quot;he&quot; can&#39;t be hit because it hurts. i say something to that affect in hindi, which is the language i talk to my son. just another thing that works temporarily. <br/>\n<br/>\ni&#39;m curious what you guys think about snatching. i left that part out. my son often snatches things from the younger child.  so for that, again, i do different things, but i would say most of the time i dont do anything, since the other child quickly moves on, and often i see him holding that same toy moments later. <br/>\n<br/>\nsometimes the other child snatches from my son and again i dont do anything if he just whines a little and moves on. <br/>\n<br/>\nbut overall my son is doing more of the snatching, and every now and then the other child protests and i know he really wanted what he was playing with so i calmly tell my son to give it back, which he does.<br/>\n<br/>\nin the few cases where they really both want same thing i just find another thing and tell my son to give one of them to the other child or give it myself.  <br/>\n<br/>\nwould love feedback on this and what others do.  thanks. <br/>\n<br/>\ni&#39;m also seeing my son give things back on his own to the other child, or help the other child.  or he help me when i&#39;m helping the other child, like fetching his diaper, etc. it&#39;s all very sweet, the good and the bad.  reading your posts i feel more at peace with all of this, knowing that the loving and peaceful way i am with both of them will make an impact. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Meredith&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n&gt;<br/>\n&gt;  &quot;vapurohit&quot; &lt;vandana.purohit@&gt; wrote:<br/>\n&gt; &gt;&gt; but my son seem to have discovered he&#39;s quicker and faster and can do more than his little friend, and so sometimes he tries to overpower him, by running after him to push him, or he&#39;ll hit him, kick him, or throw things at him.  he never seems to be angry..but just being playful and mischievous. of course for the other child it is uncomfortable and stressful, and i too am concerned for other child. <br/>\n&gt; **************<br/>\n&gt; <br/>\n&gt; Most 2yos don&#39;t have a lot of empathy - it&#39;s something your son will grow into in time, especially if his emotions are supported overall, but in the interim he depends on you to make sure no-one gets hurt as he&#39;s learning about other people. That&#39;s what parents are for. Don&#39;t expect such young children to be able to play together without an adult right there with them to make sure things run smoothly. <br/>\n&gt; <br/>\n&gt; If your son isn&#39;t angry or otherwise upset, it&#39;s possible he&#39;s trying to play... the way a big dog tries to play when it knocks you down. In a very real way he &quot;doesn&#39;t know his own strength&quot; and, as a very young child, he has a particular blind spot where if something doesn&#39;t hurt Him, it &quot;doesn&#39;t hurt&quot; in his understanding of the world. That&#39;s part of the lack of empathy and it&#39;s not something you can teach him - in a way, it&#39;s not even something he learns so much as discovers, if you see what I mean? <br/>\n&gt; <br/>\n&gt; &gt; so these are various things i am doing, and they work for a while.<br/>\n&gt; <br/>\n&gt; Trying lots of different things and realizing different options are better for different scenarios is good. Staying close to the kids so you can intervene early is important. Looking for patterns is a good idea - notice if there are ups and downs, cycles of intensity and restfulness. Some of those will be due to things you can effect - like hunger, or even just tiredness. If you know they play well for half an hour, you know to plan a diversion for twenty minutes into the fun ;)<br/>\n&gt; <br/>\n&gt; &gt;&gt;sometimes i&#39;ll have my son kick or hit the couch instead. or throw things in the other direction.<br/>\n&gt; ************<br/>\n&gt; <br/>\n&gt; Why? I&#39;m not saying it&#39;s the wrong thing to do, but if your goal is to diffuse anger... well that doesn&#39;t work if he&#39;s not angry, for one, and there&#39;s a lot of dispute over whether that kind of activity actually diffuses anything or if it &quot;amps up&quot; intense feelings. But if your goal is to help him find a better way to play, a way to be rough-and-tumble where no-one gets hurt, that could be a good solution. It could also help to find a bigger, more mature friend for your son to roughhouse with - he may be looking for more than mere physicality, but actual intense physical Interaction. Do you wrestle and roughhouse with him? That&#39;s a blind spot for a lot of moms (not so much dads, but some men have a strong aversion to rough physical play). Make sure your kid is getting enough hard, physical interaction so he&#39;s not depending on a smaller, younger child for that. <br/>\n&gt; <br/>\n&gt; Depending on your son, it might be good to do something really physical right before the other child arrives so he&#39;s tired and ready to do less physical things. Or playing hard might rev him up and he&#39;d be all over the other kid the moment he walked in the door! That&#39;s one of those &quot;know the child&quot; things - try it without a hapless toddler as a potential victim ;)<br/>\n&gt; <br/>\n&gt; It may be helpful to have more of the time the other child is over planned, rather than &quot;free play&quot; - have specific movies, activities, games, etc all lined up ahead of time. It doesn&#39;t have to be set in stone! Think of it this way - if you have a weekly gathering of adults, there would likely be some reason... cards, music, movie night, dinner. There would be a degree of planning and expectations and as a good hostess you&#39;d do some set-up before hand to make sure everything went smoothly. Having kid-friends over can be like that - don&#39;t assume &quot;just hanging out&quot; is enough to keep things on an even keel (relatively speaking, since they Are little kids). <br/>\n&gt; <br/>\n&gt; ---Meredith<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] older child hitting/pushing younger child","postDate":"1362843540","msgId":49723,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY3RkE1MENBLTlEMTEtNEUzMi1CNDc2LTYxRjBGNEY5NjM1OEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGtoZmR1OStvOGFtQGVHcm91cHMuY29tPg==","referencesHeader":"PGtoZmR1OStvOGFtQGVHcm91cHMuY29tPg=="},"prevInTopic":49722,"nextInTopic":49748,"prevInTime":49722,"nextInTime":49724,"topicId":49682,"numMessagesInTopic":0,"msgSnippet":"... And I think it s helpful to realize that it s not that they don t understand that hurting someone is wrong. The concept is pretty easy! It s that: 1) Until","messageBody":"<div id=\"ygrps-yiv-1066815972\">On Mar 9, 2013, at 8:37 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marbleface@...\">marbleface@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They can start to understand not hurting the other one<br/>\n<br/>\n </span></blockquote>And I think it&#39;s helpful to realize that it&#39;s not that they don&#39;t understand that hurting someone is wrong. The concept is pretty easy! It&#39;s that:<br/>\n<br/>\n1) Until they&#39;re developmentally ready, they can&#39;t grasp that what they&#39;re doing is hurting someone else. They don&#39;t feel the pain so it just doesn&#39;t make sense that someone else can be in pain. Yes, even if they&#39;re crying!<br/>\n<br/>\n2) Kids are trying to meet a need. The direct route is easy to understand: grab the toy, hit the other kid to make them stop, etc. The indirect route that adds in kindness, politeness, safety, and so on, is hugely complex. And for little kids, often doesn&#39;t work! It often needs an adult there -- someone who has the power to enforce their decisions even if they don&#39;t use that power -- to negotiate.<br/>\n<br/>\nSo be there to live your values. Create a peaceful place for them. Use your greater understanding of the world to use tools such as peacefulness, kindness, safety, patience and so on to help them meet their needs. They&#39;ll need to experience the environment you create as one that can meet their needs. They need to see you using those tools in ways that benefit them lots and lots for them to even begin to grasp how to use them. And it will be *years* before they&#39;re proficient.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: older child hitting/pushing younger child","postDate":"1362836233","msgId":49722,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtoZmR1OStvOGFtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtoZGNpOStybDc2QGVHcm91cHMuY29tPg=="},"prevInTopic":49721,"nextInTopic":49723,"prevInTime":49721,"nextInTime":49723,"topicId":49682,"numMessagesInTopic":0,"msgSnippet":"his little friend ?  Not really. More like the little intruder. And two years old is too young to really get it. They can start to understand not hurting","messageBody":"<div id=\"ygrps-yiv-1229819104\">&quot;his little friend&quot;?  Not really. More like &quot;the little intruder.&quot; And two years old is too young to really get it. They can start to understand not hurting the other one and your examples are good ones. But don&#39;t expect much improvement. Do expect a lot of work just being there, in between the two babies, giving everyone all of your attention. <br/>\n<br/>\nNance<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;vapurohit&quot; &lt;vandana.purohit@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; i have a 24 month old son and recently started babysitting an 18 month old boy. Up till now i have not seen my son hit or push other kids, or throw things at them. he has been on the other end a few times. <br/>\n&gt; <br/>\n&gt; but my son seem to have discovered he&#39;s quicker and faster and can do more than his little friend, and so sometimes he tries to overpower him, by running after him to push him, or he&#39;ll hit him, kick him, or throw things at him.  he never seems to be angry..but just being playful and mischievous. of course for the other child it is uncomfortable and stressful, and i too am concerned for other child. <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; i&#39;d love suggestions on how to handle the situation. i do different things based on the situation. sometimes i&#39;ll have my son kick or hit the couch instead. or throw things in the other direction. other times i&#39;ll distract him by taking them both to look out the window. or i&#39;ll put music on and we all start dancing. or i&#39;ll show him something. sometimes i&#39;ll pick up the other child for a bit and carry on working or whatever i&#39;m doing. most of the time i&#39;ll touch the other child gently..and say &quot;it hurts.&quot; sometimes i bring my son close to me and just look at him and hold him close.  <br/>\n&gt; <br/>\n&gt; so these are various things i am doing, and they work for a while. any other ideas?  i just had a thought of offering my son to nurse. normally offering to nurse him seemed counterintuitive for me as he always comes to me when he wants to nurse..and he nurses a lot. but maybe this is a time where i could offer. nursing does seem to calm him down and he seems happier. so i plan to try it next time.   any thoughts?   <br/>\n&gt; <br/>\n&gt; thanks for any ideas. <br/>\n&gt; <br/>\n&gt; vandana<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: older child hitting/pushing younger child","postDate":"1362787155","msgId":49721,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtoZHUwaitrdDA0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtoZGNpOStybDc2QGVHcm91cHMuY29tPg=="},"prevInTopic":49720,"nextInTopic":49722,"prevInTime":49720,"nextInTime":49722,"topicId":49682,"numMessagesInTopic":0,"msgSnippet":"... ************** Most 2yos don t have a lot of empathy - it s something your son will grow into in time, especially if his emotions are supported overall,","messageBody":"<div id=\"ygrps-yiv-451128801\">&quot;vapurohit&quot; &lt;vandana.purohit@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; but my son seem to have discovered he&#39;s quicker and faster and can do more than his little friend, and so sometimes he tries to overpower him, by running after him to push him, or he&#39;ll hit him, kick him, or throw things at him.  he never seems to be angry..but just being playful and mischievous. of course for the other child it is uncomfortable and stressful, and i too am concerned for other child. <br/>\n </span></blockquote>**************<br/>\n<br/>\nMost 2yos don&#39;t have a lot of empathy - it&#39;s something your son will grow into in time, especially if his emotions are supported overall, but in the interim he depends on you to make sure no-one gets hurt as he&#39;s learning about other people. That&#39;s what parents are for. Don&#39;t expect such young children to be able to play together without an adult right there with them to make sure things run smoothly. <br/>\n<br/>\nIf your son isn&#39;t angry or otherwise upset, it&#39;s possible he&#39;s trying to play... the way a big dog tries to play when it knocks you down. In a very real way he &quot;doesn&#39;t know his own strength&quot; and, as a very young child, he has a particular blind spot where if something doesn&#39;t hurt Him, it &quot;doesn&#39;t hurt&quot; in his understanding of the world. That&#39;s part of the lack of empathy and it&#39;s not something you can teach him - in a way, it&#39;s not even something he learns so much as discovers, if you see what I mean? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; so these are various things i am doing, and they work for a while.<br/>\n<br/>\n </span></blockquote>Trying lots of different things and realizing different options are better for different scenarios is good. Staying close to the kids so you can intervene early is important. Looking for patterns is a good idea - notice if there are ups and downs, cycles of intensity and restfulness. Some of those will be due to things you can effect - like hunger, or even just tiredness. If you know they play well for half an hour, you know to plan a diversion for twenty minutes into the fun ;)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;sometimes i&#39;ll have my son kick or hit the couch instead. or throw things in the other direction.<br/>\n </span></blockquote>************<br/>\n<br/>\nWhy? I&#39;m not saying it&#39;s the wrong thing to do, but if your goal is to diffuse anger... well that doesn&#39;t work if he&#39;s not angry, for one, and there&#39;s a lot of dispute over whether that kind of activity actually diffuses anything or if it &quot;amps up&quot; intense feelings. But if your goal is to help him find a better way to play, a way to be rough-and-tumble where no-one gets hurt, that could be a good solution. It could also help to find a bigger, more mature friend for your son to roughhouse with - he may be looking for more than mere physicality, but actual intense physical Interaction. Do you wrestle and roughhouse with him? That&#39;s a blind spot for a lot of moms (not so much dads, but some men have a strong aversion to rough physical play). Make sure your kid is getting enough hard, physical interaction so he&#39;s not depending on a smaller, younger child for that. <br/>\n<br/>\nDepending on your son, it might be good to do something really physical right before the other child arrives so he&#39;s tired and ready to do less physical things. Or playing hard might rev him up and he&#39;d be all over the other kid the moment he walked in the door! That&#39;s one of those &quot;know the child&quot; things - try it without a hapless toddler as a potential victim ;)<br/>\n<br/>\nIt may be helpful to have more of the time the other child is over planned, rather than &quot;free play&quot; - have specific movies, activities, games, etc all lined up ahead of time. It doesn&#39;t have to be set in stone! Think of it this way - if you have a weekly gathering of adults, there would likely be some reason... cards, music, movie night, dinner. There would be a degree of planning and expectations and as a good hostess you&#39;d do some set-up before hand to make sure everything went smoothly. Having kid-friends over can be like that - don&#39;t assume &quot;just hanging out&quot; is enough to keep things on an even keel (relatively speaking, since they Are little kids). <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] older child hitting/pushing younger child","postDate":"1362785379","msgId":49720,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0NzVEMTQ2LTZCQzQtNDdEMC1CMEQyLUUyOUQ2RDMxOEU5NUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGtoZGNpOStybDc2QGVHcm91cHMuY29tPg==","referencesHeader":"PGtoZGNpOStybDc2QGVHcm91cHMuY29tPg=="},"prevInTopic":49719,"nextInTopic":49721,"prevInTime":49719,"nextInTime":49721,"topicId":49682,"numMessagesInTopic":0,"msgSnippet":"... Be more present. You may need to insert yourself between them. If you feel the mood changing, change things up. Do something different. Bring food. If you","messageBody":"<div id=\"ygrps-yiv-234924597\">On Mar 8, 2013, at 2:01 PM, vapurohit wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; sometimes he tries to overpower him, by running after him to<br/>\n&gt; push him, or he&#39;ll hit him, kick him, or throw things at him<br/>\n<br/>\n </span></blockquote>Be more present. You may need to insert yourself between them. If you feel the mood changing, change things up. Do something different. Bring food. If you need to leave, like to go to the bathroom or get a snack for them, take one with you.<br/>\n<br/>\nYour son has been bottom of the power totem pole for 2 years. Now he&#39;s not. He&#39;s got someone he can over power. And it feels pretty cool.<br/>\n<br/>\nObviously you need different ways for him to feel powerful! Maybe help him think up and do nice things for his friend. (And you do nice things for your son :-) Ask him if he thinks his friend needs something.<br/>\n<br/>\nDon&#39;t expect him to control his impulses. He&#39;s 2. And don&#39;t think he&#39;s doing this because he wants to hurt the other boy. He isn&#39;t developmentally able, yet, to understand that someone else can hurt if he&#39;s not feeling pain. It seems obvious that all you need do is tell him, but right now he can&#39;t yet grasp it. It&#39;s your responsibility to keep both kids safe. Don&#39;t pass it off onto him. Assume he&#39;s doing his best. He&#39;s showing you he can&#39;t not respond to his impulses yet.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":204615647,"authorName":"vapurohit","from":"&quot;vapurohit&quot; &lt;vandana.purohit@...&gt;","profile":"vapurohit","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"older child hitting/pushing younger child","postDate":"1362769289","msgId":49719,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtoZGNpOStybDc2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBRSt0bzdDTWFrY3BwS1R4WDFhTnRaYzRENW1BZkZhLVl4WXZ1Y1N0aERmZkIyZFZKQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49688,"nextInTopic":49720,"prevInTime":49718,"nextInTime":49720,"topicId":49682,"numMessagesInTopic":0,"msgSnippet":"i have a 24 month old son and recently started babysitting an 18 month old boy. Up till now i have not seen my son hit or push other kids, or throw things at","messageBody":"<div id=\"ygrps-yiv-560747938\">i have a 24 month old son and recently started babysitting an 18 month old boy. Up till now i have not seen my son hit or push other kids, or throw things at them. he has been on the other end a few times. <br/>\n<br/>\nbut my son seem to have discovered he&#39;s quicker and faster and can do more than his little friend, and so sometimes he tries to overpower him, by running after him to push him, or he&#39;ll hit him, kick him, or throw things at him.  he never seems to be angry..but just being playful and mischievous. of course for the other child it is uncomfortable and stressful, and i too am concerned for other child. <br/>\n <br/>\n<br/>\ni&#39;d love suggestions on how to handle the situation. i do different things based on the situation. sometimes i&#39;ll have my son kick or hit the couch instead. or throw things in the other direction. other times i&#39;ll distract him by taking them both to look out the window. or i&#39;ll put music on and we all start dancing. or i&#39;ll show him something. sometimes i&#39;ll pick up the other child for a bit and carry on working or whatever i&#39;m doing. most of the time i&#39;ll touch the other child gently..and say &quot;it hurts.&quot; sometimes i bring my son close to me and just look at him and hold him close.  <br/>\n<br/>\nso these are various things i am doing, and they work for a while. any other ideas?  i just had a thought of offering my son to nurse. normally offering to nurse him seemed counterintuitive for me as he always comes to me when he wants to nurse..and he nurses a lot. but maybe this is a time where i could offer. nursing does seem to calm him down and he seems happier. so i plan to try it next time.   any thoughts?   <br/>\n<br/>\nthanks for any ideas. <br/>\n<br/>\nvandana</div>","specialLinks":[]},{"userId":269399205,"authorName":"Alex Polikowsky","from":"Alex Polikowsky &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Aspiring entrepreneurs at home - what to do?","postDate":"1362010427","msgId":49688,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM2QTY5NkQ4LTJGMUEtNDhGMC1CNjQ3LThCMzhGMjgzNTUyNEB5YWhvby5jb20+","inReplyToHeader":"PGtnbTNwZis4Zjg5QGVHcm91cHMuY29tPg==","referencesHeader":"PGtnbTNwZis4Zjg5QGVHcm91cHMuY29tPg=="},"prevInTopic":49686,"nextInTopic":49719,"prevInTime":49687,"nextInTime":49689,"topicId":49682,"numMessagesInTopic":0,"msgSnippet":"And at those places like Meredith mentioned and park days he can do a sit down massage in a chaos like they offer in many places. Alex Polikowsky Sent from my","messageBody":"<div id=\"ygrps-yiv-1634066428\">And at those places like Meredith mentioned and park days he can do a sit down massage in a chaos like they offer in many places.<br/>\n<br/>\nAlex Polikowsky <br/>\n<br/>\nSent from my iPhone<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Feb 27, 2013, at 5:10 PM, &quot;Meredith&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt; wrote:<br/>\n<br/>\n&gt; Could you get a massage table and he<br/>\n&gt; &gt; could take it to park days and give short massages for a dollar or two?<br/>\n&gt; **************<br/>\n&gt; <br/>\n&gt; You might also look into farmers markets and local flea markets - maybe not for massage, but maybe for you kid who likes the restaurant idea. The two together could set up a &quot;relaxation station&quot; (or something&quot; with one serving herbal teas and the other give five minute massages. <br/>\n&gt; <br/>\n&gt; You could also check with the sorts of organizations which run pancake breakfasts or weekly fish fry days - usually they&#39;re some sort of fundraising deal, like the local volunteer fire department. They may have ways to use an extra server - or be willing to set up a massage table and split the &quot;take&quot;. <br/>\n&gt; <br/>\n&gt; ---Meredith<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Aspiring entrepreneurs at home - what to do?","postDate":"1362006639","msgId":49686,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtnbTNwZis4Zjg5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBT09UYVhOR0VRbnVwK3d1N3ZaQ0ZqajhLPWZGWnZ1cEJPK1hFU25kS1ltK3p2Y0hqUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49684,"nextInTopic":49688,"prevInTime":49685,"nextInTime":49687,"topicId":49682,"numMessagesInTopic":0,"msgSnippet":"Could you get a massage table and he ... ************** You might also look into farmers markets and local flea markets - maybe not for massage, but maybe for","messageBody":"<div id=\"ygrps-yiv-46672760\">Could you get a massage table and he<br/>\n<blockquote><span title=\"ireply\"> &gt; could take it to park days and give short massages for a dollar or two?<br/>\n </span></blockquote>**************<br/>\n<br/>\nYou might also look into farmers markets and local flea markets - maybe not for massage, but maybe for you kid who likes the restaurant idea. The two together could set up a &quot;relaxation station&quot; (or something&quot; with one serving herbal teas and the other give five minute massages. <br/>\n<br/>\nYou could also check with the sorts of organizations which run pancake breakfasts or weekly fish fry days - usually they&#39;re some sort of fundraising deal, like the local volunteer fire department. They may have ways to use an extra server - or be willing to set up a massage table and split the &quot;take&quot;. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Aspiring entrepreneurs at home - what to do?","postDate":"1362001497","msgId":49684,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRkUzNEFEMTUxN0IzQi0xNzQwLTg4N0I0QHdlYm1haWwtZDIwOS5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PENBRSt0bzdDTWFrY3BwS1R4WDFhTnRaYzRENW1BZkZhLVl4WXZ1Y1N0aERmZkIyZFZKQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBRSt0bzdDTWFrY3BwS1R4WDFhTnRaYzRENW1BZkZhLVl4WXZ1Y1N0aERmZkIyZFZKQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49683,"nextInTopic":49686,"prevInTime":49683,"nextInTime":49685,"topicId":49682,"numMessagesInTopic":0,"msgSnippet":"When Dunc (17 on Friday) was 3, he was mostly naked. And he liked delivering pizzas. So we d call him on the phone and order a pizza. Then we d make and bake","messageBody":"<div id=\"ygrps-yiv-1660913621\">When Dunc (17 on Friday) was 3, he was mostly naked. And he liked delivering pizzas. So we&#39;d call him on the phone and order a pizza. Then we&#39;d make and bake the pizza, put it in an old pizza box (save those boxes!), send him out the back door around to the front door where he&#39;d ring the bell and deliver the pizza. And he&#39;d get to &quot;pocket&quot; $3!  &quot;Naked PizzaMan Delivery&quot; Ta-DAH!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nRule # 1 for ANY endeavor: Get the best tools you can afford.<br/>\n<br/>\n<br/>\nI would absolutely consider buying a nice, used massage table. They&#39;re available all the time on Craigslist. TONS of them! Buy/sew some nice sheets, and order different oils and creams. Experiment with aroma therapy. Make flyers.<br/>\n<br/>\n<br/>\nI&#39;m sure he hasn&#39;t the strength to do any damage, so I&#39;d let him enjoy giving massages. (And I&#39;d be willing to come receive one! ;-)<br/>\n<br/>\n<br/>\nI doubt he can take any class due to age, but I&#39;m sure you can talk to a massage therapist in your town who can show him a few tips/techniques. I&#39;d ask around. Most therapist would want the parent in the room with a child, but I&#39;d work to try to let him receive a professional massage or two. (Not all will work on children.)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nAs for the restauranteur: same deal. Make sure he has high end tools. A reservation book, fabric napkins, serving platter. Learn snazzy napkin folds, learn how to set a casual as well as a fancy dinner party place setting. Learn what different forks, spoons, and glasses look like and their purposes (I have the goofiest set of sterling SPORKS you can imagine! According to my mother, *technically* they are ice cream/fruit dessert spoons. In reality? Sporks. Sterling silver sporks. Good grief!  ;-) ) <br/>\n<br/>\n<br/>\nLearn how to dress a table. Experiment with colors and combinations. Lighting/flowers/mirrors.<br/>\n<br/>\n<br/>\nLearn from which side to serve and which to clear. Learn how to properly open bottles of wine, champagne, beer.<br/>\n<br/>\n<br/>\nYou can also look up some &quot;tableside service&quot; ideas---things that are made/finished at the table (as opposed to being made in the kitchen)---like Cherries Jubilee & Bananas Foster (both involve fire, so be aware!) or Guacamole, Caesar Salad, or turkey/roast beef carving.<br/>\n<br/>\n<br/>\nCertainly go to a high end restaurant (fancy five-star hotels&#39; restaurants are THE best!!!), and ask to speak to the maitre d&#39; or the head waiter. Stop by mid-afternoon/very early evening and talk directly to the guy in charge, Tell him your child&#39;s aspirations. Ask to make an appointment during their down time. I&#39;m sure he&#39;d be delighted to share tips/techniques with him. Be sure to offer to pay for his time (he&#39;ll probably not charge, but it IS his time!). <br/>\n<br/>\n<br/>\nSome cities have waiter competitions. Our head waiter won the honor at the one here in Columbia in the 80s. Some are simply fun, some are about speed; others, precision; still others are a HUGE honor and about the full package (no speed or &quot;precision&quot;---just excellent service!). But you can contact local restaurants and ask whether anyone hosts one that you can watch. If not, google.<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=Tu13jTrBiew\">http://www.youtube.com/watch?v=Tu13jTrBiew</a>  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=1O6AN5apASM\">http://www.youtube.com/watch?v=1O6AN5apASM</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://threeriversfestival.org/index.php/events/waiter-waitress-contest\">http://threeriversfestival.org/index.php/events/waiter-waitress-contest</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.wine-searcher.com/m/2012/11/top-waiters-compete-for-world-honours\">http://www.wine-searcher.com/m/2012/11/top-waiters-compete-for-world-honours</a><br/>\n<br/>\n<br/>\nIf your kids are interested in something *you* aren&#39;t, there ARE those out there JUST as passionate as your child. Just look/ask around. Most people who are passionate about something are THRILLED to share their knowledge with a novice just as passionate, often for free.<br/>\n<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Marieke Hensel &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marieke@...\">marieke@...</a>&gt;<br/>\n<br/>\nWe have just started out last summer unschooling, and my kids are now<br/>\ngetting to the phase where they really want to explore their passions.<br/>\nProblem is, their ideas are so grand, I want to create an environment for<br/>\nthem to flourish, but I&#39;m not sure how to pull it off. :-)<br/>\n<br/>\nMy 9yo loves to give massages to family members, and now wants to start his<br/>\nown massage business. He wants to get a massage table, set up a space at<br/>\nour home and open his business. But he wants to learn also how to give<br/>\nmassages better, and would love to enroll in a class to learn different<br/>\nskills.<br/>\n<br/>\nMy other son wants to open his own restaurant. He is 7yo, he is moderately<br/>\ninterested in making food, but very passionate about serving people, which<br/>\nis why he loves to open a restaurant. He already rents himself out as<br/>\n&#39;slave&#39; to his brother to make money, but we have upgraded that term to<br/>\nbutler. :-) That sounds a lot better, don&#39;t you think?!<br/>\n<br/>\nNow, how can I offer our kids the environment to work on their dreams. My<br/>\n7yo would love to start a restaurant at our office and bring in food and<br/>\nserve people.<br/>\n<br/>\nI would love to hear stories about your kids, their entrepreneurial<br/>\nambitions and how to make it happen.<br/>\n<br/>\nIt&#39;s kindof funny, I am an entrepreneur myself and have built many<br/>\nbusinesses, so I don&#39;t want to take the let&#39;s do it right approach. I want<br/>\nit to be a place that they can develop themselves, doing their business as<br/>\na way of play, instead of developing business &#39;the adult way&#39;, at the same<br/>\ntime I hear they are asking for that. And I am not sure how to help them<br/>\ngive them what they want.<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/Tu13jTrBiew?wmode=opaque","type":"VIDEO"},{"url":"http://www.youtube.com/embed/1O6AN5apASM?wmode=opaque","type":"VIDEO"}]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Aspiring entrepreneurs at home - what to do?","postDate":"1361997808","msgId":49683,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhOR0VRbnVwK3d1N3ZaQ0ZqajhLPWZGWnZ1cEJPK1hFU25kS1ltK3p2Y0hqUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PENBRSt0bzdDTWFrY3BwS1R4WDFhTnRaYzRENW1BZkZhLVl4WXZ1Y1N0aERmZkIyZFZKQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBRSt0bzdDTWFrY3BwS1R4WDFhTnRaYzRENW1BZkZhLVl4WXZ1Y1N0aERmZkIyZFZKQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49682,"nextInTopic":49684,"prevInTime":49682,"nextInTime":49684,"topicId":49682,"numMessagesInTopic":0,"msgSnippet":"... Do you have enough friends and family members that he could do massages and charge just a bit, a few dollars? Could you get a massage table and he could","messageBody":"<div id=\"ygrps-yiv-1762526586\">On Wed, Feb 27, 2013 at 11:41 AM, Marieke Hensel &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marieke@...\">marieke@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s kindof funny, I am an entrepreneur myself and have built many<br/>\n&gt; businesses, so I don&#39;t want to take the let&#39;s do it right approach. I<br/>\n&gt; want&gt;&gt;<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Do you have enough friends and family members that he could do massages and<br/>\ncharge just a bit, a few dollars? Could you get a massage table and he<br/>\ncould take it to park days and give short massages for a dollar or two? (I<br/>\nknow a park day where I&#39;m sure this would be very welcome!! hint hint)<br/>\n<br/>\nAny friends who are or know massage therapists who would give him some<br/>\nguidance? Youtube videos to learn from?<br/>\n<br/>\nPark day is another good place to sell homemade food items. Ours had an<br/>\nannual entrepreneur day where kids sell all kinds of things, but he could<br/>\nset up a table at any park day. He could also take orders. If it is the<br/>\n&quot;serving&quot; that he is into - maybe have an in-home once-a-month brunch or<br/>\ntea or something and pay him to be the maitre d&#39;.<br/>\n<br/>\nI can really imagine him doing it AT a park day. Set up a little table and<br/>\na couple of chairs and serve a selection of tea and cupcakes or something.<br/>\nLet people make reservations and he can run a little one-table park day<br/>\ncafe.<br/>\n<br/>\nJust be sure to charge very little and people will participate to support<br/>\nhim.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":66989399,"authorName":"Marieke Hensel","from":"Marieke Hensel &lt;marieke@...&gt;","profile":"mhvdgraaf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Aspiring entrepreneurs at home - what to do?","postDate":"1361994076","msgId":49682,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRSt0bzdDTWFrY3BwS1R4WDFhTnRaYzRENW1BZkZhLVl4WXZ1Y1N0aERmZkIyZFZKQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":49683,"prevInTime":49681,"nextInTime":49683,"topicId":49682,"numMessagesInTopic":0,"msgSnippet":"Hi, We have just started out last summer unschooling, and my kids are now getting to the phase where they really want to explore their passions. Problem is,","messageBody":"<div id=\"ygrps-yiv-1134967287\">Hi,<br/>\n<br/>\nWe have just started out last summer unschooling, and my kids are now<br/>\ngetting to the phase where they really want to explore their passions.<br/>\nProblem is, their ideas are so grand, I want to create an environment for<br/>\nthem to flourish, but I&#39;m not sure how to pull it off. :-)<br/>\n<br/>\nMy 9yo loves to give massages to family members, and now wants to start his<br/>\nown massage business. He wants to get a massage table, set up a space at<br/>\nour home and open his business. But he wants to learn also how to give<br/>\nmassages better, and would love to enroll in a class to learn different<br/>\nskills.<br/>\n<br/>\nMy other son wants to open his own restaurant. He is 7yo, he is moderately<br/>\ninterested in making food, but very passionate about serving people, which<br/>\nis why he loves to open a restaurant. He already rents himself out as<br/>\n&#39;slave&#39; to his brother to make money, but we have upgraded that term to<br/>\nbutler. :-) That sounds a lot better, don&#39;t you think?!<br/>\n<br/>\nNow, how can I offer our kids the environment to work on their dreams. My<br/>\n7yo would love to start a restaurant at our office and bring in food and<br/>\nserve people.<br/>\n<br/>\nI would love to hear stories about your kids, their entrepreneurial<br/>\nambitions and how to make it happen.<br/>\n<br/>\nIt&#39;s kindof funny, I am an entrepreneur myself and have built many<br/>\nbusinesses, so I don&#39;t want to take the let&#39;s do it right approach. I want<br/>\nit to be a place that they can develop themselves, doing their business as<br/>\na way of play, instead of developing business &#39;the adult way&#39;, at the same<br/>\ntime I hear they are asking for that. And I am not sure how to help them<br/>\ngive them what they want.<br/>\n<br/>\nLove any and all of your feedback!<br/>\n<br/>\n:-)<br/>\nMarieke<br/>\n-- <br/>\nMarieke Hensel<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://twitter.com/hensel\">http://twitter.com/hensel</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.coworkingfullerton.com\">http://www.coworkingfullerton.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":49724,"nextTopicId":49750}}