{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Explaining unschooling to my kids","postDate":"1315493225","msgId":47220,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0YWtoOSt0N2Q1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEYxNEZBNEExLThFOTctNEI4NC1BN0RFLTA5NjkwQzc0NTNDMUB5YWhvby5jb20+"},"prevInTopic":47210,"nextInTopic":0,"prevInTime":47219,"nextInTime":47221,"topicId":47203,"numMessagesInTopic":0,"msgSnippet":"... *************** Plenty of adults dislike reading and don t know their times tables. Most adults, especially women, have so much math phobia they avoid","messageBody":"<div id=\"ygrps-yiv-494145162\">Tpizarro &lt;richstar16@...&gt; wrote:  <br/>\n<blockquote><span title=\"ireply\"> &gt; But what about things like, my daughter who will be 13 who absolutely hates reading and doesn&#39;t know all her times tables?!<br/>\n </span></blockquote>***************<br/>\n<br/>\nPlenty of adults dislike reading and don&#39;t know their times tables. Most adults, especially women, have so much math phobia they avoid doing any kind of computation. If your daughter is like that then she is no worse off than most high school graduates!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; How do I encourage her or get her to be a better reader??<br/>\n<br/>\n </span></blockquote>You don&#39;t. First of all, reading requires a curious kind of &quot;readiness&quot; which is entirely biological and some people aren&#39;t ready to read until puberty. So a 13yo who isn&#39;t reading yet may not be ready yet.<br/>\n<br/>\nThere&#39;s another problem, though, which is that you&#39;ve been saturated with the propaganda that reading Should Be some kind of pleasant activity when its just a useful skill, like driving a car. I drive a car almost every day but I don&#39;t enjoy it and I&#39;m not a great driver. I avoid driving when I can. It&#39;s okay to have that kind of relationship with reading! It Is a useful skill - but because its a useful skill your daughter will learn to read what is important for her to read. It doesn&#39;t matter if she doesn&#39;t read Anything other than what is necessary to her. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; When I take her to the library...<br/>\n<br/>\n </span></blockquote>Don&#39;t take her to the library. Part of the &quot;reading is fun&quot; propaganda is that reading is about reading books, and that&#39;s nonsense. Books are just one source of printed information. Does she read signs? Can she find the breakfast cereal and canned tomatoes in the grocery store? Find a show she wants to watch on tv? Is she on the internet at all? That may be enough for her - Let it be enough. Don&#39;t impose your educational agenda on top of what&#39;s important to her, it won&#39;t help. It will undermine her confidence in her own abilities and That&#39;s more devastating than any other factor where learning is concerned. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; she always picks up books that are meant for much younger kids.  She has a difficult time pronouncing some words.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nThis makes me think she&#39;s gotten the idea that reading is about &quot;sounding out&quot; and that&#39;s potentially a serious problem in terms of her learning how to read. About a third of all people don&#39;t really &quot;get&quot; letter-sound correspondences until After they&#39;ve already learned to read, and that&#39;s especially true of people who don&#39;t learn to read until puberty. So if she&#39;s not much of a reader at 13, the last thing you want to do is encourage her to read aloud. If she wants, read to her. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Words that my son knows that she doesn&#39;t and he&#39;s younger than her.<br/>\n<br/>\n </span></blockquote>He&#39;s not her and doesn&#39;t learn the same way she does. My kids are really different in the way they learn, too - especially the way they learned to read. Mo enjoyed &quot;cracking the code&quot; at 4, while Ray didn&#39;t start learning to read until he was nearly 7 and found letter-sound correspondences baffling until he could read whole books. It doesn&#39;t help to compare the ways your kids learn, its kind of like comparing dogs to cats - sure the dog can shake hands and the cat can&#39;t, but the dog can&#39;t sleep on top of the fridge, either. The trouble is, its easy to value shaking hands above sleeping on top of the fridge - or with your kids, to value the fact that one can read while ignoring the skills the other has because you don&#39;t value them. That&#39;s doing a disservice to your children. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Originally our household was on the strict side of things and now we are going in the complete opposite direction. Im afraid they&#39;ll be confused. <br/>\n </span></blockquote>*****************<br/>\n<br/>\nThey may be at first but that&#39;s not a terrible thing. The most important thing right now is to spend time with them, doing what they want to do, enjoying their company. You&#39;ve spent too much time valuing what they can do and its important to focus on who they are for awhile. Get to know them. At first they may just need to chill out and decompress a bit! So relax with them and spend some time learning about learning and learning about them as people. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Explaining unschooling to my kids","postDate":"1315405637","msgId":47210,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTU0MDU2MzcuNTgwNTUuWWFob29NYWlsTmVvQHdlYjgxNTA1Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PEYxNEZBNEExLThFOTctNEI4NC1BN0RFLTA5NjkwQzc0NTNDMUB5YWhvby5jb20+","referencesHeader":"PEYxNEZBNEExLThFOTctNEI4NC1BN0RFLTA5NjkwQzc0NTNDMUB5YWhvby5jb20+"},"prevInTopic":47209,"nextInTopic":47220,"prevInTime":47209,"nextInTime":47211,"topicId":47203,"numMessagesInTopic":0,"msgSnippet":"   Why does she need to","messageBody":"<div id=\"ygrps-yiv-988812856\"> <br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&quot;But what about things like, my daughter who will be 13 who absolutely hates reading and doesn&#39;t know all her times tables?!&quot;&gt;&gt;&gt;<br/>\n<br/>\nWhy does she need to know the time table at 13? I don&#39;t think that I do at 45 and I have a Law Degree and I speak 4 languages. I just never memorized it in school. I know probably 95 to 98%  but there are a few that I need to think about. It has made NO difference in my life.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&quot;How do I encourage her or get her to be a better reader??<br/>\n<br/>\nWhen I take her to the library she always picks up books that are meant for much younger kids.&quot;&gt;&gt;&gt;&gt;<br/>\n<br/>\nI learned to read before school thought me, I have been an avid reader all my life. I like all kinds of books and reading . I read a  lot of youth books for kids 8 to 14. One of my favorite series is Deltoras Quest. It is for kids around 11. I also love Young Adult novels sometimes even more than adult ones. I read  about 4 books a month and that is with a very busy life. Trust me I read well and fast, always did. Does liking kids books makes me less of a reader??<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  &lt;&lt;&lt;&quot;She has a difficult time pronouncing some words. Words that my son knows that she doesn&#39;t and he&#39;s younger than her. I know I&#39;m going off the original subject but these are thing that run thru my head as I watch them watch TV. &quot;&gt;&gt;&gt;<br/>\n<br/>\nDo not compare her to your son or anyone. People read because they want information and/or because they enjoy. If she is enjoying and understanding what she reads she is fine.  Many kids her age at school are reading just like her or even less, some even do not read!!<br/>\nWhy are you having trouble when they watch TV?<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&quot;I&#39;m still very uneasy about somethings.  This has been difficult for me to cope with. Has anyone&#39;s transition been difficult like this? Originally our household was on the strict side of things and now we are going in the complete opposite direction. Im afraid they&#39;ll be confused.  I really want this to work for my kids sake. And for the family as a whole.  Help!&quot;&gt;&gt;&gt;&gt;<br/>\n<br/>\nHere are some link that may help you. You need to understand why you are doing things the way you are :<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/help%c2%a0\">http://sandradodd.com/help%c2%a0</a> ( follow all the links in this page to lost of great reading that will help you)<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://snadradodd.com/tv\">http://snadradodd.com/tv</a><br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Explaining unschooling to my kids","postDate":"1315394628","msgId":47209,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTUzOTQ2MjguMjk4OTIuWWFob29NYWlsUkNAd2ViODczMTgubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PEYxNEZBNEExLThFOTctNEI4NC1BN0RFLTA5NjkwQzc0NTNDMUB5YWhvby5jb20+","referencesHeader":"PEYxNEZBNEExLThFOTctNEI4NC1BN0RFLTA5NjkwQzc0NTNDMUB5YWhvby5jb20+"},"prevInTopic":47208,"nextInTopic":47210,"prevInTime":47208,"nextInTime":47210,"topicId":47203,"numMessagesInTopic":0,"msgSnippet":"You know too much that she absolutely hates reading. If she absolutely hates reading she s been being pressed her too hard. My son, who is 14, is no where near","messageBody":"<div id=\"ygrps-yiv-153653756\">You know too much that she absolutely hates reading. If she absolutely hates <br/>\nreading she&#39;s been being pressed her too hard. My son, who is 14, is no where <br/>\nnear as easy a reader as my daughter, who is 11. But he doesn&#39;t hate reading. He <br/>\ndoesn&#39;t writhe and moan and vent whenever reading is a part of something he&#39;s <br/>\ndoing. He reads. Or he asks someone else to read it, or he figures out how much <br/>\nhe can do without reading.<br/>\n<br/>\nReading is a tool. Just like the times tables. My dad once told me about how <br/>\nmuch he used his times tables when he balanced his checkbook. He talked about <br/>\nlearning them in school, going over and over the times tables until they were <br/>\nalmost innate and how each time he ran through his checkbook he was reminded of <br/>\nthose moments in school. He felt that it was really important that Simon learn <br/>\nhis. I turned to Simon and asked him to solve some equation or another, it was a <br/>\ntime when Simon was playing a lot with numbers, and he did it without really <br/>\nskipping a beat. And we moved on. <br/>\n<br/>\n<br/>\nI don&#39;t think he knows his times table. I don&#39;t think he or Linnaea do math that <br/>\nway. I think they are more like their dad, who adds instead of multiplies to get <br/>\nto larger numbers. I multiply and divide. I&#39;m slow, but I don&#39;t need to be fast. <br/>\nIf I needed to be fast I&#39;d use a calculator, or a slide rule. It&#39;s all a tool to <br/>\nget at other things, math, unless you are doing really amazing beautiful math <br/>\n(this kind: <a rel=\"nofollow\" target=\"_blank\" href=\"http://xkcd.com/435/)\">http://xkcd.com/435/)</a>, then it&#39;s math for math&#39;s sake. Maybe you <br/>\ncould think about math in brighter lights: <a rel=\"nofollow\" target=\"_blank\" href=\"http://vihart.com/doodling/\">http://vihart.com/doodling/</a> is a <br/>\nwonderful site. Linnaea spent a lot of time playing with Vi Hart&#39;s ideas. And <br/>\nthen started reading the Little Prince because of the snake who swallowed an <br/>\nelephant image. <br/>\n<br/>\n<br/>\nLots of stuff happens on the way to thinking about reading or about times <br/>\ntables. Linnaea and I just watched a Vi Hart video and it was cool and got me <br/>\nthinking about doodling out of boredom. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Tpizarro &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:richstar16@...\">richstar16@...</a>&gt;<br/>\nTo: &quot;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nSent: Wednesday, 7 September, 2011 4:33:42<br/>\nSubject: [unschoolingbasics] Re: Explaining unschooling to my kids<br/>\n<br/>\nThank you Meredith<br/>\n<br/>\nBut what about things like, my daughter who will be 13 who absolutely hates <br/>\nreading and doesn&#39;t know all her times tables?!  How do I encourage her or get <br/>\nher to be a better reader?? When I take her to the library she always picks up <br/>\nbooks that are meant for much younger kids.  She has a difficult time <br/>\npronouncing some words. Words that my son knows that she doesn&#39;t and he&#39;s <br/>\nyounger than her. I know I&#39;m going off the original subject but these are thing <br/>\nthat run thru my head as I watch them watch TV.  I&#39;m still very uneasy about <br/>\nsomethings.  This has been difficult for me to cope with. Has anyone&#39;s <br/>\ntransition been difficult like this? Originally our household was on the strict <br/>\nside of things and now we are going in the complete opposite direction. Im <br/>\nafraid they&#39;ll be confused.  I really want this to work for my kids sake. And <br/>\nfor the family as a whole.  Help!<br/>\n<br/>\nT. Pizarro<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":432616271,"authorName":"Tpizarro","from":"Tpizarro &lt;richstar16@...&gt;","profile":"richstar16","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Explaining unschooling to my kids","postDate":"1315366422","msgId":47208,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxNEZBNEExLThFOTctNEI4NC1BN0RFLTA5NjkwQzc0NTNDMUB5YWhvby5jb20+"},"prevInTopic":47204,"nextInTopic":47209,"prevInTime":47207,"nextInTime":47209,"topicId":47203,"numMessagesInTopic":0,"msgSnippet":"Thank you Meredith But what about things like, my daughter who will be 13 who absolutely hates reading and doesn t know all her times tables?!  How do I","messageBody":"<div id=\"ygrps-yiv-1157816315\">Thank you Meredith<br/>\n <br/>\nBut what about things like, my daughter who will be 13 who absolutely hates reading and doesn&#39;t know all her times tables?!  How do I encourage her or get her to be a better reader?? When I take her to the library she always picks up books that are meant for much younger kids.  She has a difficult time pronouncing some words. Words that my son knows that she doesn&#39;t and he&#39;s younger than her. I know I&#39;m going off the original subject but these are thing that run thru my head as I watch them watch TV.  I&#39;m still very uneasy about somethings.  This has been difficult for me to cope with. Has anyone&#39;s transition been difficult like this? Originally our household was on the strict side of things and now we are going in the complete opposite direction. Im afraid they&#39;ll be confused.  I really want this to work for my kids sake. And for the family as a whole.  Help!<br/>\n<br/>\nT. Pizarro</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Explaining unschooling to my kids","postDate":"1315237212","msgId":47204,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0MnFncytlbmU1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo0MnBmZSs1Ym5uQGVHcm91cHMuY29tPg=="},"prevInTopic":47203,"nextInTopic":47208,"prevInTime":47203,"nextInTime":47205,"topicId":47203,"numMessagesInTopic":0,"msgSnippet":"... *************** Your son did a pretty good job of explaining it to you ;) If they ask, tell them y all are taking a break from anything schoolish - and","messageBody":"<div id=\"ygrps-yiv-1028103367\">&quot;Tania&quot; &lt;richstar16@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;My son actually said &quot;it&#39;s gonna be like summer never ended.&quot; I said yeah something like that <br/>\n </span></blockquote>***************<br/>\n<br/>\nYour son did a pretty good job of explaining it to you ;)<br/>\nIf they ask, tell them y&#39;all are taking a break from anything schoolish - and then do that. Stay away from things that are &quot;educational&quot; unless its something the kids are really excited about. Hang out with them, do fun things with them - including low-key fun things like watch tv. Spend time enjoying one another&#39;s company and getting used to being together. There&#39;s a kind of lifestyle shift that accompanies having the kids home rather than in school, and it will take awhile to get used to that. <br/>\n<br/>\nAt the same time you can do some more reading about unschooling and start to shift your own expectations. Learning in real life doesn&#39;t look like school, and it can take awhile to wrap your mind around that. It&#39;s entirely possible that by the time you&#39;ve been deschooling for six months you won&#39;t have to explain anything.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":432616271,"authorName":"Tania","from":"&quot;Tania&quot; &lt;richstar16@...&gt;","profile":"richstar16","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Explaining unschooling to my kids","postDate":"1315236142","msgId":47203,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0MnBmZSs1Ym5uQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":47204,"prevInTime":47202,"nextInTime":47204,"topicId":47203,"numMessagesInTopic":0,"msgSnippet":"It s my first year unschooling my kids. They ve always attended public school. My daughter is 12 & my son 11. How do I explain to them that they are being","messageBody":"<div id=\"ygrps-yiv-61436505\">It&#39;s my first year unschooling my kids. They&#39;ve always attended public school. My daughter is 12 & my son 11. How do I explain to them that they are being unschooled? I don&#39;t want to say to them &quot;you could do whatever you want&quot;. I&#39;ve said to them that we&#39;ll learn whatever interest them.  But they still are having a hard time with &quot;what are we gonna do all day?&quot; My son actually said &quot;it&#39;s gonna be like summer never ended.&quot; I said yeah something like that lol. Ive heard about deschooling and how long it takes.  One month for every year they&#39;ve been in school. I just needed some guidance on how to begin.  Thank you in advance!</div>","specialLinks":[]}],"prevTopicId":47198,"nextTopicId":47207}}