{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":254934996,"authorName":"duckgirl01","from":"&quot;duckgirl01&quot; &lt;hippytrish@...&gt;","profile":"duckgirl01","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: More on Lightening Rod Child","postDate":"1258376238","msgId":42082,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhkcmk3ZSszMDczQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEIyNTc0MDcwLTZCMkYtNDQxQi05MDIxLUM3QUMzMjA1MzJENEBnbWFpbC5jb20+"},"prevInTopic":42074,"nextInTopic":0,"prevInTime":42081,"nextInTime":42083,"topicId":42064,"numMessagesInTopic":0,"msgSnippet":"... I love this idea. When my DS was 3, I still had no trouble carrying him on my back in my Ergo (he was average-sized). Maybe if you carry her around a bit","messageBody":"<div id=\"ygrps-yiv-1807147193\"><blockquote><span title=\"ireply\">&gt; It might help to anticipate things. Don&#39;t carry huge armloads. Take a  <br/>\n&gt; few smaller trips. Invite her for a ride. Get a sling or back pack for  <br/>\n&gt; the baby to free up your arms. <br/>\n<br/>\n </span></blockquote>I love this idea. When my DS was 3, I still had no trouble carrying him on my back in my Ergo (he was average-sized). Maybe if you carry her around a bit during the day, talking to her as you do things, it will make the times you have to spent doing other stuff, or with the baby, more tolerable. It&#39;s also possible that the rocking motion of being carried might help to soothe her - just like we talk about with babies.<br/>\n<br/>\nTrish</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: More on Lightening Rod Child","postDate":"1258318067","msgId":42074,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhkcHBkaisyZDZwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhkcDR0aytiNDB2QGVHcm91cHMuY29tPg=="},"prevInTopic":42073,"nextInTopic":42082,"prevInTime":42073,"nextInTime":42075,"topicId":42064,"numMessagesInTopic":0,"msgSnippet":"... Punishing her for her needs won t make them go away, or smaller, or less inconvenient, won t allow anyone in the family to love her more. Most likely,","messageBody":"<div id=\"ygrps-yiv-1314861642\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;AllisonR&quot; &lt;earlyhiker@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Can anyone give me some perspective.  <br/>\n<br/>\n </span></blockquote>Punishing her for her needs won&#39;t make them go away, or smaller, or less inconvenient, won&#39;t allow anyone in the family to love her more. Most likely, she&#39;ll be the child who is &quot;always in trouble&quot;. She&#39;ll still be seen as the kid who always ruins everything, the monster. Punishment Isn&#39;t the answer, won&#39;t get you anywhere close to a better life. I promise.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;He wants to address the behaviour with time outs and quick, &#39;gentle&#39; verbal reprimands.<br/>\n </span></blockquote>***************<br/>\n<br/>\nIf she screams now, what will she do when reprimanded? Do you really think it will help anything? If she stays in time out but screams continually, is that better? If she doesn&#39;t stay in time out, what then? Do you hold her down? Lock her in? Spank her? <br/>\n<br/>\nAsk your dh those questions - get him to think it alllll the way through. Kids with big emotions will withstand higher levels of &quot;discipline&quot; than others because their emotions are so strong! So people who discipline those children regularly find that they end up increasing the level of discipline in order to stay on top of the situation. Does your husband realize this? Has he talked to people with intense children who also use discipline and gotten the whole story? The whole story is a litany of methods that work for awhile, and then don&#39;t and the parent &quot;has to&quot; amp up the discipline more and more and more or else throw up their hands in defeat. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Can one child be &#39;allowed&#39; to hog all the attention with unpleasant behaviors...<br/>\n </span></blockquote>************************<br/>\n<br/>\nIf she were disabled, would it be okay for her to need more? <br/>\n<br/>\nHonestly, what about a diagnosis? It doesn&#39;t matter what, just something for everyone to point to other than her, the person. A disability. It may be what you need in order to prioritize her needs - a &quot;reason&quot; why they are so big.<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":221315529,"authorName":"Ronnie","from":"&quot;Ronnie&quot; &lt;hmsdragonfly@...&gt;","profile":"hmsdragonfly","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: More on Lightening Rod Child","postDate":"1258314263","msgId":42072,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhkcGxtbis5dWl2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQxNzQ1MS4xMjI0Ni5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":42070,"nextInTopic":42073,"prevInTime":42071,"nextInTime":42073,"topicId":42064,"numMessagesInTopic":0,"msgSnippet":"... Yes. Well said, Alex.","messageBody":"<div id=\"ygrps-yiv-2050409601\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; If her needs are bigger than the rest of the family than she should <br/>\n&gt; get more and not equal attention.<br/>\n<br/>\n </span></blockquote>Yes. Well said, Alex.</div>","specialLinks":[]},{"userId":221315529,"authorName":"Ronnie","from":"&quot;Ronnie&quot; &lt;hmsdragonfly@...&gt;","profile":"hmsdragonfly","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: More on Lightening Rod Child","postDate":"1258314151","msgId":42073,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhkcGxqNys2ZjM5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhkcDR0aytiNDB2QGVHcm91cHMuY29tPg=="},"prevInTopic":42072,"nextInTopic":42074,"prevInTime":42072,"nextInTime":42074,"topicId":42064,"numMessagesInTopic":0,"msgSnippet":"Could it be that she s more physical than you or your husband? It kind of sounds like she s a kid that needs to wrestle. I have a little friend who thrives on","messageBody":"<div id=\"ygrps-yiv-1810714971\">Could it be that she&#39;s more physical than you or your husband? It kind of sounds like she&#39;s a kid that needs to wrestle. I have a little friend who thrives on rough-and-tumble, physical play. Without an outlet for that, he is not happy. Period. His mom and dad are gentle people, so they&#39;ve really had to adjust and make an effort to provide the wrestling he craves.<br/>\n<br/>\nOther than that, I have a couple suggestions:<br/>\n- When she asks for your time or to be held, lead with an enthusiastic YES! For example, &quot;Yes, I would LOVE to hold you! Let me put down the baby.&quot; Even when you can&#39;t be enthusiastic, make &quot;Yes&quot; the first word of your response.<br/>\n<br/>\n- Arrange time every day when she gets to be with just you. She needs one-on-one time with each of her parents. It&#39;s vital to her! <br/>\n<br/>\nTake care,<br/>\nRonnie<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sites.google.com/site/dragonflykaizen/\">http://sites.google.com/site/dragonflykaizen/</a></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] More on Lightening Rod Child","postDate":"1258301602","msgId":42070,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxNzQ1MS4xMjI0Ni5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGhkcDR0aytiNDB2QGVHcm91cHMuY29tPg==","referencesHeader":"PGhkcDR0aytiNDB2QGVHcm91cHMuY29tPg=="},"prevInTopic":42069,"nextInTopic":42072,"prevInTime":42069,"nextInTime":42071,"topicId":42064,"numMessagesInTopic":0,"msgSnippet":"If her needs are bigger than the rest of the family than she should get more and not equal attention. She is very young and still a baby. My 3.5 years old","messageBody":"<div id=\"ygrps-yiv-1708724245\">If her needs are bigger than the rest of the family than she should get more and not equal attention.<br/>\nShe is very young and still a baby. My 3.5 years old gets more attention than my 7 year old because she needs more attention. When her cup is full it is easy to go pay give total attention to my son, their dad and the household.<br/>\nYou say you have a baby. Seems like she was not ready to share you  yet. <br/>\nCan you give us more examples so maybe people can give you some more ideas to help?<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar@earthlink.net","from":"&lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] More on Lightening Rod Child","postDate":"1258300654","msgId":42069,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5GRURLREZBR0lPQ0RCQ01HUEhPTUVMUERCQUEub3RoZXJzdGFyQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGhkcDR0aytiNDB2QGVHcm91cHMuY29tPg=="},"prevInTopic":42068,"nextInTopic":42070,"prevInTime":42068,"nextInTime":42070,"topicId":42064,"numMessagesInTopic":0,"msgSnippet":"... have posted about her before. I have been reading and thinking and feeling so much about how to add respect and joy and love into the relationship. Baby","messageBody":"<div id=\"ygrps-yiv-491694568\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; I have a daughter(3.5) who is a lightening rod for me and<br/>\n </span></blockquote>have posted about her before. I have been reading and thinking and feeling<br/>\nso much about how to add respect and joy and love into the relationship.<br/>\nBaby steps getting better... &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n  I have a daughter that is very much like you describe. She is now 5. We<br/>\nhave come to realize that she feels things much more deeply than the rest of<br/>\nus. So, imagine how upset you get when things go a certain way. Then,<br/>\nmultiply it times 1000 and you will understand why she whines and fights.<br/>\n<br/>\n<blockquote><span title=\"ireply\">    &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; My husband is DONE with her whining and fighting. I am<br/>\n </span></blockquote>trying to see her whining and fighting and teasing as unmet needs and<br/>\nrespond to her understandable frustration with respect and love. But he sees<br/>\nit as a behavior that impacts the whole family and tends to RUIN family time<br/>\ntogether. And it does. He wants to address the behaviour with time outs and<br/>\nquick, &#39;gentle&#39; verbal reprimands. &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n  The dynamic has been set up so that everyone expects these things. Even if<br/>\nshe were to try to change something, it seems like it would not work because<br/>\neveryone is already expecting her to behave a certain way. It sounds like<br/>\nshe needs to be engaged a lot. Perhaps she needs more physical activities.<br/>\nMy daughter seems to have very conflicting needs. She doesn&#39;t do transitions<br/>\nwell. If we start something new without giving her fair warning, then there<br/>\nis a fight and whininess. She needs predictability. If we are going to do a<br/>\nfamily activity, we give her fair warning. Also, it sounds like you guys<br/>\nneed to lighten up a bit. We have started turning the teasing into a game.<br/>\nAs long as nobody is getting their feelings hurt, then I don&#39;t see any harm<br/>\nin it. Have you read anything on playful parenting? Sometimes getting<br/>\nplayful is a really good way to diffuse situations.<br/>\n<br/>\n<blockquote><span title=\"ireply\">    &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; The whole family is in a pattern that paints her as the bad<br/>\n </span></blockquote>guy...or at least incredibly annoying. She picks fights, she teases,<br/>\nimmediately whines and gets upset when she anticipates frustration of any<br/>\namount. &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n  My husband had this dynamic with our daughter until he read &quot;The Strong<br/>\nWilled Child or Dreamer&quot; It really helped him to see that her motivations<br/>\nare not bad. She just lives in her own little world and just doesn&#39;t realize<br/>\nthat there is a world that exists outside of her. She is a very creative and<br/>\nsweet person when she is not being forced to do things that may or may not<br/>\ninterest her. A 3.5 year old is not very old. There is a lot of the world<br/>\nthat they just do not understand. My daughter has become a lot easier now<br/>\nthat she is 5 but we have to let her know what is going on. They are never<br/>\nto young to explain what to expect. There are times that we just have to<br/>\naccept that she just does not want to be a part of family time. Perhaps you<br/>\ncould let her pick something to do from time to time and make everyone else<br/>\ndo what she wants since it seems like everyone gets a say in what goes on<br/>\nbut her. How old are the siblings? It sounds like a lot of people are<br/>\nexpecting a 3.5 year old to act much older. Everything that you describe is<br/>\nvery typical for a child that age.<br/>\n<br/>\n<blockquote><span title=\"ireply\">    &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; I am halfway down the stairs, holding a bundle of laundry in<br/>\n </span></blockquote>one arm and a coffe cup with the baby on my other hip and she wants me to<br/>\npick her up. I can&#39;t in that moment. I use words (she is not a very verbal<br/>\nchild, so any ideas on that one...?) to explain that I will pick her up as<br/>\nsoon as I can. &quot;Let me put XX down.&quot; &quot;Come sit by the fire and we will<br/>\ncuddle.&quot; She just cries and screams. I put my XX down and come back for her.<br/>\nWe sit down to snuggle. She then will push and nudge and whine and tap and<br/>\nsmack and interrrupt until it is so unpleasant for everyone that it<br/>\nessentially ends reading time or snuggle time or family time. &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n  Perhaps she doesn&#39;t need to cuddle and snuggle. Perhaps she needs to be<br/>\nchased around the yard or given rides in the laundry basket. She may need<br/>\nfamily wild time. Some kids need to get loud and wild. Whenever we see our<br/>\ndaughter get into that phase, we abandon the whole quiet time and we get<br/>\nwild. After getting wild for a while, then we calm down and go about our<br/>\nbusiness.<br/>\n<br/>\n<blockquote><span title=\"ireply\">    &gt;&gt;&gt;&gt; So, it seems her &#39;unmet needs&#39; are not leaving &#39;room&#39; for my other<br/>\n </span></blockquote>children&#39;s or husband&#39;s needs. I feel like by responding to her all the<br/>\ntime, I am &#39;dropping&#39; them, somehow. Can anyone give me some perspective.<br/>\n&lt;&lt;&lt;&lt;<br/>\n<br/>\n  Why does it have to be an either or proposition? Why can&#39;t you give her<br/>\nattention before she needs it? If you know you are going to have family<br/>\nquiet time or do something else as a family, fill her up with attention so<br/>\nshe will be full by the time you go to do the other stuff. Perhaps you need<br/>\nto leave the room with her. Expecting a 3.5 year old to leave the room seems<br/>\nkind of mean. Why can&#39;t you explain things to everyone? She is 3.5 and has<br/>\nneeds just like they do. It almost sounds like her needs are being<br/>\ncompletely forgotten or put on the back burner because everyone else&#39;s needs<br/>\nare more important than hers. She senses that and that is why she constantly<br/>\ninterupts. That is the only way that she can get her needs met.<br/>\n<br/>\n<blockquote><span title=\"ireply\">    &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; Can one child be &#39;allowed&#39; to hog all the attention with<br/>\n </span></blockquote>unpleasant behaviors...that just seems so disrepectful and my older chilren<br/>\nare beginning to resent her and avoid her and me with her. I miss my older<br/>\nboys and I am very uncomfortable with how her &#39;story&#39; is being framed. She<br/>\nis NOT the bad guy, but family (myself included at times) is beginning to<br/>\nreally see her that way.  &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n  That is a very negative statement. She is not trying to hog all of the<br/>\nattention. She is just trying to get her needs met. What are the unpleasant<br/>\nbehaviors? If it is teasing, then turn it into something silly. If it is<br/>\nsomething physical, then turn it into something silly with the tickly<br/>\nmonster or something. Do your older boys ever play with her? My little ones<br/>\nget really annoying to my older ones. I explain to them that the little ones<br/>\nare just trying to ge their attention because they really love them and look<br/>\nup to them. My 2 year old drives her sisters nuts because she will get in<br/>\ntheir space and follow them around and generally disrupt things. I explain<br/>\nto the older ones that she is not doing those things to annoy them or piss<br/>\nthem off. She looks up to them and just wants to be with them. So, I<br/>\nencourage them to play together. I also try to make sure that they have<br/>\nample sister free time. Explain to your husband and other children that she<br/>\nis doing those things because she thinks they are awesome people and wants<br/>\nto be with them. It sounds like you are the only one trying to meet her<br/>\nneeds when what she needs is positive attention from your husband and her<br/>\nsiblings. I have had to tell my older ones that if they play with the little<br/>\nones and give them some attention they will go away after a while. The more<br/>\nthey push the little ones away, the more annoying the little ones get. It<br/>\nreally has to be a balance where everyone gets to be with everyone else on<br/>\ntheir terms. The little one sounds like she gets dismissed a lot so that<br/>\nwhen everyone is gathered together she kicks it up a notch because she has a<br/>\ncaptive audience.<br/>\n<br/>\n  Another thought is to give your 3.5 year old some space too. My 5 year old<br/>\nis very unpredictable. There have been times that we just let her cry<br/>\nbecause there is nothing else that we can do. We don&#39;t remove her from the<br/>\nroom. We don&#39;t shame her. I just tell her that she can sit there and let it<br/>\nall out. When she is done, we are here for her. After getting out her<br/>\nfeelings, she is ready to come be a part of things. Last weekend, we had an<br/>\nincident where we came home to a &quot;suprise&quot; party. My 5 year old was very<br/>\nupset and mad. She threw a huge fit because she didn&#39;t like everyone being<br/>\nthere. One of my sisters kept trying to push the issue. The more she pushed<br/>\nthings, the worse my daughter got. My sister finally got frustrated and<br/>\nleft. It would be real easy for me to blame my daughter for ruining a<br/>\nsuprise party. I blame my sister for not respecting my daughter&#39;s space. If<br/>\nshe had shut up and left my daughter alone, then my daughter could have<br/>\ntaken the time to calm down and adjust to the idea that the day was not<br/>\ngoing to be like she thought it was. After she calmed down, we went on to<br/>\nhave an awesome day. She just needed to get those intense feelings out.<br/>\n<br/>\n  Connie<br/>\n  <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void Taintor","from":"Faith Void Taintor &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] More on Lightening Rod Child","postDate":"1258298771","msgId":42068,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUzN0VGOUY4LTEyRjUtNDlGNS04OTlELTNEMUFCMUMwQTFCRkBnbWFpbC5jb20+","inReplyToHeader":"PGhkcDR0aytiNDB2QGVHcm91cHMuY29tPg==","referencesHeader":"PGhkcDR0aytiNDB2QGVHcm91cHMuY29tPg=="},"prevInTopic":42067,"nextInTopic":42069,"prevInTime":42067,"nextInTime":42069,"topicId":42064,"numMessagesInTopic":0,"msgSnippet":"Ok trying to nurse and type...part two! Come sit by the fire and we will cuddle. ****Perhaps ask her what she needs and invite her rather than tell her. ","messageBody":"<div id=\"ygrps-yiv-197673998\">Ok trying to nurse and type...part two!<br/>\n<br/>\n<br/>\n&quot;Come sit by the fire and we will cuddle.&quot;<br/>\n<br/>\n****Perhaps ask her what she needs and invite her rather than tell her.<br/>\n==============<br/>\n<br/>\n  She just cries and screams. I put my XX down and come back for her.  <br/>\nWe sit down to snuggle.<br/>\n<br/>\n*****This is a good start. Eventually she will understand if you  <br/>\nconsistently meet her needs.<br/>\n================<br/>\n<br/>\nShe then will push and nudge and whine and tap and smack<br/>\n<br/>\n*****It seems like she is telling you she doesn&#39;t want quiet snuggled  <br/>\nor sitting on your lap. She may need more active attention.<br/>\n<br/>\nCan you think of things that are more stmulating? Ds loved to be  <br/>\nrolled up like a burrito and flung around. Or covered completely on  <br/>\nstuffed animals or pillows. Perhaps wrestling about a little.<br/>\n<br/>\nOr finger rhymes and play acting songs. Head, shoulders, knees and  <br/>\ntoes. Ring around the rosies. Etc.<br/>\n============<br/>\n<br/>\nand interrrupt until it is so unpleasant for everyone that it  <br/>\nessentially ends reading time or snuggle time or family time.<br/>\n<br/>\n*****if you are snuggling with her what is she interupting?<br/>\n<br/>\nMy kids like to bounce, run, play, roll,etc while being read to.  <br/>\nSometimes an on the lap snuggle was needed but more often just me  <br/>\nreading while they played was what they needed.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; So, it seems her &#39;unmet needs&#39; are not leaving &#39;room&#39; for my other  <br/>\n&gt; children&#39;s or husband&#39;s needs. I feel like by responding to her all  <br/>\n&gt; the time, I am &#39;dropping&#39; them, somehow. Can anyone give me some  <br/>\n&gt; perspective.<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>You are responding to her cries for help. She needs you to anticipate  <br/>\nand be proactive. Give her more than you think she needs. Wait until  <br/>\nshe tells you she has had enough.<br/>\n<br/>\nSometimes when one of mine is out of sorts. I play this game where I  <br/>\nget stuck to their cheek. I pretend that I a stuck kissing them  <br/>\nforever. I don&#39;t stop until they are done. Or I&#39;ll kiss them over  <br/>\ntheir body until they are done. Lots of laughter! Once my oldest  <br/>\nneeded over a hundred kisses. She was feeling replaced by the new  <br/>\nbaby. She loved and ador<br/>\n==================<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Can one child be &#39;allowed&#39; to hog all the attention with unpleasant  <br/>\n&gt; behaviors...that just seems so disrepectful and my older chilren are  <br/>\n&gt; beginning to resent her and avoid her and me with her. I miss my  <br/>\n&gt; older boys and I am very uncomfortable with how her &#39;story&#39; is being  <br/>\n&gt; framed. She is NOT the bad guy, but family (myself included at  <br/>\n&gt; times) is beginning to really see her that way.<br/>\n&gt; Danke.<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void Taintor","from":"Faith Void Taintor &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] More on Lightening Rod Child","postDate":"1258298070","msgId":42067,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIyNTc0MDcwLTZCMkYtNDQxQi05MDIxLUM3QUMzMjA1MzJENEBnbWFpbC5jb20+","inReplyToHeader":"PGhkcDR0aytiNDB2QGVHcm91cHMuY29tPg==","referencesHeader":"PGhkcDR0aytiNDB2QGVHcm91cHMuY29tPg=="},"prevInTopic":42064,"nextInTopic":42068,"prevInTime":42066,"nextInTime":42068,"topicId":42064,"numMessagesInTopic":0,"msgSnippet":"Sent from my iPhone ... You say in the begining that you are trying to see her unmet needs. What do you think they might be? Later on you say she is ruining","messageBody":"<div id=\"ygrps-yiv-441987234\">Sent from my iPhone<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Nov 15, 2009, at 9:57 AM, &quot;AllisonR&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:earlyhiker@...\">earlyhiker@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; My husband is DONE with her whining and fighting. I am trying to see  <br/>\n&gt; her whining and fighting and teasing as unmet needs and respond to  <br/>\n&gt; her understandable frustration with respect and love. But he sees it  <br/>\n&gt; as a behavior that impacts the whole family and tends to RUIN family  <br/>\n&gt; time together. And it does. He wants to address the behaviour with  <br/>\n&gt; time outs and quick, &#39;gentle&#39; verbal reprimands.<br/>\n&gt;<br/>\n<br/>\nYou say in the begining that you are trying to see her unmet needs.  <br/>\nWhat do you think they might be?<br/>\n<br/>\nLater on you say she is ruining family time. That doesn&#39;t sound open  <br/>\nto helping her. It paints her in a very harsh light.<br/>\n&gt;<br/>\n&gt; The whole family is in a pattern that paints her as the bad guy...or  <br/>\n&gt; at least incredibly annoying. She picks fights, she teases,  <br/>\n&gt; immediately whines and gets upset when she anticipates frustration  <br/>\n&gt; of any amount.<br/>\n&gt;<br/>\n<br/>\nAre there other ways you could see her? It sounds like she is  <br/>\ncompletely unable to handle frustration right now. That&#39;s ok and  <br/>\nnormal for a 3 yo. You say you have a baby. 3 is still very small,  <br/>\ndependant and needy. 3 can&#39;t wait long. Perhaps from her perspective  <br/>\nshe is always waiting, always second or third or....last!<br/>\n<br/>\nShe can&#39;t pick fights unless someone is willing to fight with her.<br/>\n&gt;<br/>\n&gt; I am halfway down the stairs, holding a bundle of laundry in one arm  <br/>\n&gt; and a coffe cup with the baby on my other hip and she wants me to  <br/>\n&gt; pick her up. I can&#39;t in that moment. I use words (she is not a very  <br/>\n&gt; verbal child, so any ideas on that one...?) to explain that I will  <br/>\n&gt; pick her up as soon as I can. &quot;Let me put XX down.&quot; &quot;Come sit by the  <br/>\n&gt; fire and we will cuddle.&quot;<br/>\n&gt;<br/>\nIt might help to anticipate things. Don&#39;t carry huge armloads. Take a  <br/>\nfew smaller trips. Invite her for a ride. Get a sling or back pack for  <br/>\nthe baby to free up your arms. Sometimes I put my ds6 on my back and  <br/>\nhold dd2 on top of the laundry. This isn&#39;t typical but a fun time.  <br/>\nWhen dd2 needs something we try to give it happily right away. She  <br/>\nfrequently can&#39;t wait. And when she does need to wait I acknowledge  <br/>\nthat and thank her. Not in an empty praisy way but in a genuine I see  <br/>\nhow hard that was way.<br/>\n<br/>\n&gt; She just cries and screams. I put my XX down and come back for her.  <br/>\n&gt; We sit down to snuggle. She then will push and nudge and whine and  <br/>\n&gt; tap and smack and interrrupt until it is so unpleasant for everyone  <br/>\n&gt; that it essentially ends reading time or snuggle time or family time.<br/>\n&gt;<br/>\n<br/>\n<br/>\n&gt;<br/>\n&gt; So, it seems her &#39;unmet needs&#39; are not leaving &#39;room&#39; for my other  <br/>\n&gt; children&#39;s or husband&#39;s needs. I feel like by responding to her all  <br/>\n&gt; the time, I am &#39;dropping&#39; them, somehow. Can anyone give me some  <br/>\n&gt; perspective.<br/>\n&gt;<br/>\n&gt; Can one child be &#39;allowed&#39; to hog all the attention with unpleasant  <br/>\n&gt; behaviors...that just seems so disrepectful and my older chilren are  <br/>\n&gt; beginning to resent her and avoid her and me with her. I miss my  <br/>\n&gt; older boys and I am very uncomfortable with how her &#39;story&#39; is being  <br/>\n&gt; framed. She is NOT the bad guy, but family (myself included at  <br/>\n&gt; times) is beginning to really see her that way.<br/>\n&gt; Danke.<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":359907606,"authorName":"AllisonR","from":"&quot;AllisonR&quot; &lt;earlyhiker@...&gt;","profile":"earlyhiker","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"More on Lightening Rod Child","postDate":"1258297076","msgId":42064,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhkcDR0aytiNDB2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":42067,"prevInTime":42063,"nextInTime":42065,"topicId":42064,"numMessagesInTopic":0,"msgSnippet":"I have a daughter(3.5) who is a lightening rod for me and have posted about her before.  I have been reading and thinking and feeling so much about how to add","messageBody":"<div id=\"ygrps-yiv-1107239509\">I have a daughter(3.5) who is a lightening rod for me and have posted about her before.  I have been reading and thinking and feeling so much about how to add respect and joy and love into the relationship. Baby steps getting better...<br/>\n<br/>\nMy husband is DONE with her whining and fighting.  I am trying to see her whining and fighting and teasing as unmet needs and respond to her understandable frustration with respect and love.  But he sees it as a behavior that impacts the whole family and tends to RUIN family time together.  And it does.  He wants to address the behaviour with time outs and quick, &#39;gentle&#39; verbal reprimands.<br/>\n<br/>\nThe whole family is in a pattern that paints her as the bad guy...or at least incredibly annoying.  She picks fights, she teases, immediately whines and gets upset when she anticipates frustration of any amount.<br/>\n<br/>\nI am halfway down the stairs, holding a bundle of laundry in one arm and a coffe cup with the baby on my other hip and she wants me to pick her up.  I can&#39;t in that moment.  I use words (she is not a very verbal child, so any ideas on that one...?) to explain that I will pick her up as soon as I can.  &quot;Let me put XX down.&quot;  &quot;Come sit by the fire and we will cuddle.&quot;  She just cries and screams.  I put my XX down and come back for her.  We sit down to snuggle.  She then will push and nudge and whine and tap and smack and interrrupt until it is so unpleasant for everyone that it essentially ends reading time or snuggle time or family time.<br/>\n<br/>\nSo, it seems her &#39;unmet needs&#39; are not leaving &#39;room&#39; for my other children&#39;s or husband&#39;s needs.  I feel like by responding to her all the time, I am &#39;dropping&#39; them, somehow.  Can anyone give me some perspective.  <br/>\n<br/>\nCan one child be &#39;allowed&#39; to hog all the attention with unpleasant behaviors...that just seems so disrepectful and my older chilren are beginning to resent her and avoid her and me with her.  I miss my older boys and I am very uncomfortable with how her &#39;story&#39; is being framed.  She is NOT the bad guy, but family (myself included at times) is beginning to really see her that way.  <br/>\nDanke.</div>","specialLinks":[]}],"prevTopicId":42041,"nextTopicId":42089}}