{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":78282269,"authorName":"Deb","from":"&quot;Deb&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: question about a non unschooled child visiting a unschooling home","postDate":"1186169988","msgId":25461,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5MDBhNCs1cjc0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY4dmlhaytqOGtzQGVHcm91cHMuY29tPg=="},"prevInTopic":25458,"nextInTopic":0,"prevInTime":25460,"nextInTime":25462,"topicId":25428,"numMessagesInTopic":0,"msgSnippet":"... Would it be within acceptable for the situation for her to have something at hand to keep her hands occupied? I know that my DH needs to have his hands","messageBody":"<div id=\"ygrps-yiv-1110599181\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Lisa&quot; &lt;jlblock01@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;   She said she did like it<br/>\n&gt; alot and wanted to continue but falling asleep is a habit that <br/>\n&gt;started<br/>\n&gt; in school so it&#39;s hard for her to sit quietly while someone is<br/>\n&gt; speaking and stay awake. <br/>\n<br/>\n </span></blockquote>Would it be within &#39;acceptable&#39; for the situation for her to have <br/>\nsomething at hand to keep her hands occupied? I know that my DH needs <br/>\nto have his hands occupied in order to actually hear what someone is <br/>\nsaying in a lecture situation. So, he keeps paper and pen to doodle or <br/>\npaper to fold or paperclips to bend or whatever - quiet, small, <br/>\nportable, cheap. If he gets into a lecture situation without being <br/>\nable to do something with his hands, sitting still and quiet takes all <br/>\nhis energy and he hears/retains little of the talking.<br/>\n<br/>\nDon&#39;t know if this&#39;ll help at all but it might be worth discussing.<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":238795563,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;jlblock01@...&gt;","profile":"jlblock01","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: question about a non unschooled child visiting a unschooling home","postDate":"1186155668","msgId":25458,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY4dmlhaytqOGtzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY4dHY0cytraDZzQGVHcm91cHMuY29tPg=="},"prevInTopic":25455,"nextInTopic":25461,"prevInTime":25457,"nextInTime":25459,"topicId":25428,"numMessagesInTopic":0,"msgSnippet":"Thanks so much for your very thoughtful response.... this is how we proceeded the day after my post... I talked to the camp director and expressed Anna s","messageBody":"<div id=\"ygrps-yiv-730783655\">Thanks so much for your very thoughtful response....<br/>\nthis is how we proceeded the day after my post... I talked to the camp<br/>\ndirector and expressed Anna&#39;s concerns about B sleeping during the<br/>\npresentations at the camp and that she felt responsible.  The director<br/>\nsaid they had discussed the previous day in a staff meeting their<br/>\nconcerns about B and wondered if she wanted to be there or was being<br/>\nforced... I explained that the entire camp has been her idea (Anna was<br/>\nalready signed up without B knowing when B asked if Anna was<br/>\ninterested etc). She offered to sit with them during that time so that<br/>\nAnna wouldn&#39;t feel responsible.  Also I explained to B that I was<br/>\nconcerned that she was falling asleep alot even when it seemed they<br/>\nwere going to bed at a somewhat reasonable time... I do know she is a<br/>\n night owl but so are my kids and they typically make their choices<br/>\ndepending on what they want to do and what time it starts etc.   The<br/>\ncamp is quite a far drive so reasonably she really needs to go when<br/>\nAnna goes and be picked up at the same time etc.   I asked her<br/>\nstraight out if the camp was what she expected, if she was enjoying it<br/>\n, if she wanted to continue or not etc.   She said she did like it<br/>\nalot and wanted to continue but falling asleep is a habit that started<br/>\nin school so it&#39;s hard for her to sit quietly while someone is<br/>\nspeaking and stay awake.  <br/>\nMy biggest concern with this child is really that she seems to want to<br/>\nrebel against all adults ....she&#39;s always loved it at my house and<br/>\nliked the freedom she has ... I explained to her that I loved having<br/>\nher here but that she had to become a more willing participant in the<br/>\ncommunity of my home if she wanted to be trusted to be here.   She<br/>\ntold me that honestly at her house unless she makes herself a complete<br/>\npain in the ass no one notices she is alive.   Makes me wonder<br/>\nsometimes if the sleeping is just depression!?   Each time she visits<br/>\nI see a decline in her enjoyability level ... this summer with the<br/>\nexception of about 2 weeks she&#39;s been at a camp, our house,<br/>\ngrandparents house etc. Her mother is a teacher and has the summer off<br/>\nand has every summer of this child&#39;s life sent her anywhere she could<br/>\nfor as much of the summer as  possible, I think she may just be<br/>\nexhausted from her busy summer.   I enjoy being a safe nurturing place<br/>\nfor her and do want her to continue to visit.   Usually when she<br/>\nvisits I try to keep it low key so she can rest and do her own thing<br/>\netc.   Some of the noise issues I think are just the fact that she<br/>\nisn&#39;t used to sharing a room with anyone...she was an only child for<br/>\n12 years until her mom remarried a man with 2 daughters.   I also<br/>\nthink some of it is a &quot;look at me look at me&quot; type of mentality that<br/>\nalot of traditionally schooled kids have... constant competition for<br/>\nattention.   I have found that talking with her quietly seems to<br/>\nreally calm her and bring her level way down.   I have in the past few<br/>\nnights told them we were settling down upstairs and would like them to<br/>\nkeep the noise level down (I just say good night to mine normally and<br/>\nthey figure out the rest unless they are really loud and wild down<br/>\nthere and need the additional reminding)  Again too B is one of those<br/>\nkids with a loud voice that carries... some kids just have a louder<br/>\nvoice or a voice that carries differently so mostly it&#39;s not an<br/>\nintentional disruption but just her voice.   Frankly most of the time<br/>\nI enjoy hearing her sound happy and excited about things because I<br/>\nknow she&#39;s not very happy at home.   I think because I have given her<br/>\nsome very specific things I need from her over the past few days she<br/>\nwill understand.   Her step sister has already been banned from my<br/>\nhouse for lying and endangering the reputation of another child so she<br/>\nknows that I will stop her from coming.   <br/>\n<br/>\nOh yeah we also talked about the book... her mother was going nuts<br/>\nbecause she told her mom she had read &quot;a couple of pages&quot;  when she&#39;s<br/>\nread more than half of it!   Her reasoning was that her mom was going<br/>\nto nag and complain no matter what so she gets to at least have a<br/>\nlittle fun with her this way!   <br/>\n<br/>\nAnyway thanks for the responses... I was  feeling like a failure that<br/>\nI was giving freedom to this kid and she was sort of flinging it back<br/>\nat me!  I know now how others feel when they first begin to give their<br/>\nkids freedom and wonder if they will ever go to bed, get up in the<br/>\nmorning or stop playing video games! HA!<br/>\nLisa Blocker</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: question about a non unschooled child visiting a unschooling home","postDate":"1186152084","msgId":25455,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY4dmVxays2YW45QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU5NjEyNS43MTM2NC5xbUB3ZWIzNTkxMy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":25450,"nextInTopic":25458,"prevInTime":25454,"nextInTime":25456,"topicId":25428,"numMessagesInTopic":0,"msgSnippet":"... unschooled kid that doesn t know how to be respected and how to self regulate?  I mean if she was here ALL summer she would figure it out and she does when","messageBody":"<div id=\"ygrps-yiv-998030102\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Lisa Blocker <br/>\n&lt;jlblock01@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; So how do you guys handle it when you have a visiting non-<br/>\n </span></blockquote>unschooled kid that doesn&#39;t know how to be respected and how to self <br/>\nregulate?  I mean if she was here ALL summer she would figure it out <br/>\nand she does when she comes and stays for a longer period of time <br/>\nshe does start to calm down <br/>\n*******************<br/>\n<br/>\nI think its important to keep in mind - and maybe also talk about - <br/>\nthe fact that there isn&#39;t the usual cushion of time for <br/>\ntransitioning from one environment to the other. Transitions are <br/>\nhard for everyone, and if she&#39;s only there for a short time right <br/>\nnow, y&#39;all are kind of stuck in a non-stop transition.<br/>\n<br/>\nThis is something we used to deal with quite a bit when Ray was <br/>\ngoing back and forth between our house and his mom&#39;s. There was one <br/>\nperiod of time in particular when it seemed like he needed two days <br/>\nto transition to &quot;being here&quot; and another day at the end to <br/>\ntransition to &quot;going there&quot; - in a five day span. Yikes. Being aware <br/>\nof the different sorts of energy and interactions that happened <br/>\nduring transitional phases was pretty important. Although we <br/>\ncouldn&#39;t really change how Ray would act, we could change our <br/>\nexpectations and talk with him about how it felt to be &quot;in <br/>\ntransition&quot; vs &quot;here&quot;. It helped alot.<br/>\n<br/>\n---Meredith (Mo 6, Ray 13)</div>","specialLinks":[]},{"userId":287472904,"authorName":"wuweimama","from":"&quot;wuweimama&quot; &lt;wuweimama@...&gt;","profile":"wuweimama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: question about a non unschooled child visiting a unschooling home","postDate":"1186103260","msgId":25450,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY4dHY0cytraDZzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU5NjEyNS43MTM2NC5xbUB3ZWIzNTkxMy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":25449,"nextInTopic":25455,"prevInTime":25449,"nextInTime":25451,"topicId":25428,"numMessagesInTopic":0,"msgSnippet":"... texts her friends(if she would go elsewhere and not disturb others)... What is the reason she doesn t agree to moving to a less disturbing location? Is","messageBody":"<div id=\"ygrps-yiv-1979899663\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Lisa Blocker &lt;jlblock01@...&gt;<br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Mostly I don&#39;t care that she stays up on her phone or that she<br/>\n </span></blockquote>texts her friends(if she would go elsewhere and not disturb others)...&gt;&gt;<br/>\n<br/>\nWhat is the reason she doesn&#39;t agree to moving to a less disturbing<br/>\nlocation? Is there some location which isn&#39;t &quot;alone/scary&quot;, perhaps?<br/>\nCould you discuss the issues during the day about how you prefer<br/>\neveryone&#39;s needs to be honored and work with her to find solutions? Is<br/>\nit possible that she needs more time to wind down in the evening?<br/>\nPerhaps she is a night owl? I find that connecting with the needs<br/>\nhelps to create possibilities. Children are incredibly creative<br/>\nproblem solvers, ime.<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;my problem comes in that when it&#39;s time to get up she can barely<br/>\nget up, during camp she is falling asleep when they have speakers or<br/>\ndo any type of sit down quietly and listen type thing. &gt;&gt;<br/>\n<br/>\nIs she wanting to go to camp? Or just wanting to get away from her<br/>\nparents for the time? Is there a way that she could go in later? Part<br/>\nof the day? Leave early? If she is there with your facilitation, I&#39;d<br/>\ndo the same as with my own child: problem solve to meet their needs.<br/>\n<br/>\n&lt;&lt; Anna is feeling like B is being disrespectful of the people putting<br/>\non the camp and the speakers coming into speak and somewhat like the<br/>\nstaff expect her to poke B and wake her up. &gt;&gt;<br/>\n<br/>\nI would listen and validate Anna&#39;s concerns and see how she would like<br/>\nto address it with B, or with the counselors. Or perhaps, she would<br/>\nlike you to speak up on her behalf that Anna isn&#39;t responsible for her<br/>\nfriend&#39;s behavior. Could you facilitate Anna discussing her feelings<br/>\nwith B regarding how she would like to be treated? I believe that<br/>\nempowering Anna would be my focus.<br/>\n<br/>\n<br/>\n<br/>\n &lt;&lt;  She is&gt;  frustrated ... I am not sure how to make her feel better<br/>\n... we have talked about how B never gets to make any decisions and is<br/>\njust testing the limits so to speak and not sure what to do when there<br/>\nare no limits.&gt;&gt;<br/>\n<br/>\nThis does sound like useful information to share with her about how it<br/>\nis difficult and different at B&#39;s house. Perhaps, having a discussion<br/>\nwhich validates B&#39;s difficulties would create more connection with<br/>\nyour concerns. I find that nurturing connection is the most effective<br/>\nway to have our connection nurtured in return. <br/>\n<br/>\n   <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I do NOT want to tell this kid to go to bed or to take her phone<br/>\n </span></blockquote>away because I wouldn&#39;t want to be treated that way but I am unsure<br/>\nwhat to do.   Each night I always tell them good night and remind them<br/>\nthat everyone upstairs is going to sleep (I can never hear my girls<br/>\n...their bedroom and tv room is in our basement but when B is here I<br/>\ncan always hear her, she is one of those kids with a voice and laugh<br/>\nthat really carry)  and ask them to please try to keep it down so they<br/>\ndon&#39;t wake the littles up.&gt;&gt;<br/>\n<br/>\nCould you create an outside area for loud conversations which is well<br/>\nlighted, visible and not as noisy? Assuming you are still up? Or is it<br/>\nreally not comfortable for you to have guests outside because you need<br/>\nto get to bed also? I would certainly discuss my needs for sleep with<br/>\nany guests and explain we want for us each to be able to get what we<br/>\nneed in our family. Ask for her input with troubleshooting<br/>\npossibilities. Perhaps, a bathroom with the shower running could<br/>\nprovide her the opportunity to be up without disturbing others.<br/>\nAnother possibility is to have more white noise, such as a fan or<br/>\nmusic to lessen the loudness factor. Close doors? <br/>\n<br/>\n<br/>\n &lt;&lt;&lt;  I also remind them they have to get up early and ask what they<br/>\nwant for their lunchboxes the next day.   <br/>\n<blockquote><span title=\"ireply\"> &gt; My kids usually take this as a cue to gear down for the night...<br/>\n </span></blockquote>they either go to bed shortly thereafter or snuggle down in their room<br/>\nwith a book.&gt;&gt;&gt;<br/>\n<br/>\nThis sounds like you might not be making specific requests? I know<br/>\nwhen we have kids over, they don&#39;t inherently know our family&#39;s<br/>\nconcerns and routines. For instance, we have areas of the yard with<br/>\npoison ivy, ds never goes there. I am not surprised if kids do, if I<br/>\ndon&#39;t discuss the concerns I have about it.<br/>\n<br/>\n<br/>\n &lt;&lt;  Oh jeez this is the other thing... B has a summer reading<br/>\nassignment with her ... her mother calls her every night to ask if she<br/>\nis reading and threatens to take away her phone etc if she doesn&#39;t get<br/>\nit done AND wants ME to POLICE her about this book!!!  UGH! &gt;&gt;<br/>\n<br/>\nI would ask how B would like to handle the reading, if you&#39;d like to<br/>\nbe involved in facilitating her, and she is agreeable. Perhaps, she<br/>\nwould like to plan some quiet time away from everyone in order to<br/>\nread, perhaps not. However, I&#39;d discuss with the mom that B is<br/>\nresponsible for the reading, and that you aren&#39;t able to &quot;police&quot; her.<br/>\nThe mother is certainly able to concern herself if she desires. I<br/>\nwould also let B know that her mother may make returning contingent<br/>\nupon the reading getting done. Not as a threat, but as a reminder of<br/>\nthis in order to facilitate B getting whatever is her priority.  <br/>\n<br/>\n     <br/>\n&lt;&lt;&lt;   I guess I feel frustrated because this is such a cool kid and if<br/>\nshe could just spend more time being respected and honored and treated<br/>\ngently she could really shine.   I just can&#39;t being myself to heap any<br/>\nnegative energy on her head when she already gets so much at home!&gt;&gt;<br/>\n<br/>\nI would tell her this in a heartfelt manner, during a non-pressured<br/>\ntime, so that she understands your concern. <br/>\n<br/>\nBest wishes, Pat</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] question about a non unschooled child visiting a unschooling home","postDate":"1186097431","msgId":25449,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOUEzNzQ0MDNBN0E4RC05NzQtMUMwRkBGV00tRDA4LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PDU5NjEyNS43MTM2NC5xbUB3ZWIzNTkxMy5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDU5NjEyNS43MTM2NC5xbUB3ZWIzNTkxMy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":25428,"nextInTopic":25450,"prevInTime":25448,"nextInTime":25450,"topicId":25428,"numMessagesInTopic":0,"msgSnippet":"... From: Lisa Blocker  So how do you guys handle it when you have a visiting non-unschooled kid that doesn t know how to be respected and","messageBody":"<div id=\"ygrps-yiv-502814886\">-----Original Message-----<br/>\nFrom: Lisa Blocker &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jlblock01@...\">jlblock01@...</a>&gt;<br/>\n<br/>\nSo how do you guys handle it when you have a visiting non-unschooled <br/>\nkid that<br/>\ndoesn&#39;t know how to be respected and how to self regulate?<br/>\n<br/>\n-=-=-=-=-=-=-<br/>\n<br/>\nI have had to do this too many times to mention. All of Cameron&#39;s <br/>\nfriends were schooled.<br/>\n<br/>\nI take them in another room and gently, but *FIRMLY* tell them that I <br/>\nwill NOT allow that in my home. That their presence in my house is a <br/>\nprivilege. That I can *quickly* have their butts in the car and be on <br/>\nmy way to their own homes. That I will be happy to remind them when <br/>\nthey are being asses, but that I will not tolerate it one more miinute.<br/>\n<br/>\nIf they are willing to accept my terms, they are most welcome to stay <br/>\nin my home. If they are not, we can leave right this minute.<br/>\n<br/>\nMost have never been treated so well, so they make the decision then <br/>\nand there to start acting like a responsible, respectable human. A <br/>\ncouple needed a few reminders. Only one asked to go home. He came back <br/>\nand apologized a week later and asked to be allowed back our home.<br/>\n<br/>\nI can&#39;t imagine letting it go so long. I won&#39;t have my home an uhappy <br/>\nplace for my family. It&#39;s the only place I *can* control.<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nAOL now offers free email to everyone.  Find out more about what&#39;s free <br/>\nfrom AOL at AOL.com.</div>","specialLinks":[]},{"userId":238795563,"authorName":"Lisa Blocker","from":"Lisa Blocker &lt;jlblock01@...&gt;","profile":"jlblock01","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"question about a non unschooled child visiting a unschooling home","postDate":"1186020049","msgId":25428,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5NjEyNS43MTM2NC5xbUB3ZWIzNTkxMy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":25449,"prevInTime":25427,"nextInTime":25429,"topicId":25428,"numMessagesInTopic":0,"msgSnippet":"How s that for a subject line???  Ok this is my situation... I have posted here before about our friend B who visits our home very often.    We have always had","messageBody":"<div id=\"ygrps-yiv-1147187036\">How&#39;s that for a subject line???  Ok this is my situation... I have posted here before about our friend B who visits our home very often.    We have always had pleasant visits until this summer there have been several issues when she&#39;s visited.  Basically this is a child of a school teacher ... at home she has no freedom... she is told what to do every minute of the day.   Her mother constantly threatens her with taking her phone away, shutting down her My Space page etc ... never any follow through so this kid knows her mother can&#39;t be bothered.   This mother even has a thing on their computer that requires her to log the kids on and then they have only 1 1/2 hrs a day in summer and less in school time of computer time a day.... in 30 minute increments...it even counts down and cuts them off when the time is gone!!!   That would just piss me off!   <br/>\n<br/>\nAnyway ... this week B is here with Anna going to the zookeeper camp that they had to reschedule because Anna was sick when they were scheduled earlier in the summer.    Each night when my girls try to settle down and go to sleep B is still up talking on her cell phone and texting a boy she met at another  camp this summer... when they ask her to please shut down for the night she continues to text (which still makes a noise and is disturbing).  Mostly I don&#39;t care that she stays up on her phone or that she texts her friends(if she would go elsewhere and not disturb others)... my problem comes in that when it&#39;s time to get up she can barely get up, during camp she is falling asleep when they have speakers or do any type of sit down quietly and listen type thing.  Anna is feeling like B is being disrespectful of the people putting on the camp and the speakers coming into speak and somewhat like the staff expect her to poke B and wake her up.    She is<br/>\n frustrated ... I am not sure how to make her feel better ... we have talked about how B never gets to make any decisions and is just testing the limits so to speak and not sure what to do when there are no limits.   <br/>\n<br/>\nI do NOT want to tell this kid to go to bed or to take her phone away because I wouldn&#39;t want to be treated that way but I am unsure what to do.   Each night I always tell them good night and remind them that everyone upstairs is going to sleep (I can never hear my girls ...their bedroom and tv room is in our basement but when B is here I can always hear her, she is one of those kids with a voice and laugh that really carry)  and ask them to please try to keep it down so they don&#39;t wake the littles up.   I also remind them they have to get up early and ask what they want for their lunchboxes the next day.   <br/>\nMy kids usually take this as a cue to gear down for the night... they either go to bed shortly thereafter or snuggle down in their room with a book.   Oh jeez this is the other thing... B has a summer reading assignment with her ... her mother calls her every night to ask if she is reading and threatens to take away her phone etc if she doesn&#39;t get it done AND wants ME to POLICE her about this book!!!  UGH!      <br/>\n<br/>\nSo how do you guys handle it when you have a visiting non-unschooled kid that doesn&#39;t know how to be respected and how to self regulate?  I mean if she was here ALL summer she would figure it out and she does when she comes and stays for a longer period of time she does start to calm down and figure out that no one is going to force her to go to bed or make her eat, or limit her eating (the chemical laden food her mother brought for her to have for her lunches is a whole OTHER conversation!  what developing body needs drinks full of artificial sweeteners?? even her water has Splenda!) .    I have had alot of good conversations with this child but she&#39;s very different this year... she seems bent on rebelling and just basically being difficult.. it worries me about her future.   I know she feels untrusted at home, that she feels penned in and squashed so I don&#39;t want to make my home a place that doesn&#39;t respect her either!    At the same time I am unhappy<br/>\n about her behavior at the camp because it just isn&#39;t respectful, now I will say that no one at the camp has complained... they are very laid back and great with the kids.    Perhaps I am just making too much of it!    I guess I feel frustrated because this is such a cool kid and if she could just spend more time being respected and honored and treated gently she could really shine.   I just can&#39;t being myself to heap any negative energy on her head when she already gets so much at home!<br/>\nLisa Blocker <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      ____________________________________________________________________________________<br/>\nPark yourself in front of a world of choices in alternative vehicles. Visit the Yahoo! Auto Green Center.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://autos.yahoo.com/green_center/\">http://autos.yahoo.com/green_center/</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":25438,"nextTopicId":25435}}