{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":15,"messages":[{"userId":91826185,"authorName":"Naturally Organic","from":"Naturally Organic &lt;naturallyorganic@...&gt;","profile":"naturallyorganic","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] unschooling special needs children - long","postDate":"1089998023","msgId":2159,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNzE2MTcxMzQzLjkxMDcyLnFtYWlsQHdlYjIwOTI3Lm1haWwueWFob28uY29tPg=="},"prevInTopic":2148,"nextInTopic":0,"prevInTime":2158,"nextInTime":2160,"topicId":2082,"numMessagesInTopic":0,"msgSnippet":"My suggestion to you is to find a local inclusive homeschool support group that has park days, or start one. That s where we were. Park day. not really super","messageBody":"<div id=\"ygrps-yiv-164375142\">My suggestion to you is to find a local inclusive homeschool support <br/>\ngroup<br/>\nthat has park days, or start one.&gt;&gt;<br/>\n<br/>\nThat&#39;s where we were. Park day. not really super organized, but a friend knows a friend who also has a friend who homeschool (I do mean homeschool lol). There was another group there that day as well, a church mom and me group. I have no idea of those kids were part of that group or not. I just felt like, well, damn. I don&#39;t have enough eyes for all of this!! <br/>\n<br/>\nTanya <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":779600,"authorName":"KathrynJB@aol.com","from":"KathrynJB@...","profile":"kathrynbeth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:unschooling special needs children - long","postDate":"1089988649","msgId":2148,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlMy4yNTQ1OTU3YS4yZTI5NDIyOUBhb2wuY29tPg=="},"prevInTopic":2119,"nextInTopic":2159,"prevInTime":2147,"nextInTime":2149,"topicId":2082,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/15/2004 6:03:02 PM Eastern Standard Time, unschoolingbasics@yahoogroups.com writes: AnneO is great, isn t she?  I ve been fighting with","messageBody":"<div id=\"ygrps-yiv-1776733850\">In a message dated 7/15/2004 6:03:02 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> writes:<br/>\nAnneO is great, isn&#39;t she?  I&#39;ve been fighting with people not to <br/>\nchange my daughter for so long and AnneO comes along and just says <br/>\nin a calm and soothing voice that your children should be honored <br/>\nfor who they are.  When she says that, who could ever want their <br/>\nchildren to change?<br/>\n*******************************<br/>\nAnne IS fabulous, and she&#39;s even more fabulous in person! Come to the Live <br/>\nand Learn Unschooling Conference and you can hear her speak in person (and ask <br/>\nall kinds of questions in person!).<br/>\n<br/>\nKathryn<br/>\n<br/>\n<br/>\nCome to the Live and Learn Unschooling Conference August 27-29 in Peabody, MA!<br/>\nFor more information, go to www.LiveandLearnConference.org<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] unschooling special needs children - long","postDate":"1089942534","msgId":2119,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDIwMDQwNzE1MjIwMDU1LjQxNjk5LnFtYWlsQHdlYjUwNzA1Lm1haWwueWFob28uY29tPg=="},"prevInTopic":2114,"nextInTopic":2148,"prevInTime":2118,"nextInTime":2120,"topicId":2082,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1221205586\">&lt;&lt;&lt;second: we were at the park yesterday, and it seems to me that some<br/>\nchildren can really pick out the ones that &quot;aren&#39;t like them&quot;, and treat<br/>\nthem accordingly. Jordie&#39;s idea of making friends is to walk up to somebody<br/>\nand say Hi. See my toy? When he did this yesterday, several young boys began<br/>\ntaunting him, and then poking him and one actually slapped him. I was/am<br/>\nappalled and disheartened that I have yet another thing to watch out for.<br/>\nIt&#39;s enough to make a gal want to buy five acres in the middle of nowhere<br/>\nand just live. &gt;&gt;&gt;<br/>\n<br/>\nThis is outrageous. Unfortunately this kind of thing happens more than it<br/>\nshould, when the Lord of the Flies mentality takes over a group of kids -<br/>\nespecially when the parents are usually over-controlling and then turn away<br/>\nfor some reason.<br/>\n<br/>\nMy suggestion to you is to find a local inclusive homeschool support group<br/>\nthat has park days, or start one. My experience of the kids in my local<br/>\ngroup is much greater acceptance of difference and a fluidity in who is<br/>\nplaying with whom each week, as well as some long term games. What happens<br/>\nin our group is that the parents maintain an awareness of what is happening<br/>\nwithout constantly bossing and mediating the kids&#39; interactions, but are<br/>\nright there to address any conflicts. Most of the time the children come up<br/>\nand express that they need help with some accident or conflict of goals.<br/>\n<br/>\nBTW in our group we rotate through several parks each month, and<br/>\ndeliberately choose parks that are not frequented by hordes of nannies or<br/>\nday camps in summer. This is to avoid crowds on the equipment, and to allow<br/>\nour children to enhance their relationships with each other rather than<br/>\nrandom strangers. In Jayn&#39;s case, we have been going to the main park day<br/>\nless regularly, because that latter function especially is being fulfilled<br/>\nby our attendance at an informal park day after dance class, that is<br/>\nattended by nearly all her homeschooler friends.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.717 / Virus Database: 473 - Release Date: 7/8/2004</div>","specialLinks":[]},{"userId":153142310,"authorName":"the_clevengers","from":"&quot;the_clevengers&quot; &lt;tri_mom@...&gt;","profile":"the_clevengers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling special needs children - long","postDate":"1089940347","msgId":2114,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNkN2ExcittMWlsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNkNXNvais0MWxtQGVHcm91cHMuY29tPg=="},"prevInTopic":2107,"nextInTopic":2119,"prevInTime":2113,"nextInTime":2115,"topicId":2082,"numMessagesInTopic":0,"msgSnippet":"... Hi Susan, My son (7) doesn t have any spectrum issues, but had severe SDI (sensory integration dysfunction) and the attendant motor delays and visual","messageBody":"<div id=\"ygrps-yiv-428126363\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Susan&quot; <br/>\n&lt;susanandgrace@y...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I guess what I am asking is this: is there anyone on this list that <br/>\n&gt; has a child with significant learning/developmental issues that is <br/>\n&gt; unschooling? I am looking for a concrete experience: this is how it <br/>\n&gt; went for us..... As I said, I loved Annie&#39;s writings, but they are <br/>\n&gt; vague in her child&#39;s challenges and how he is working with <br/>\n&gt; unschooling. Sorry to sound desperate, but I am, a little. Thanks.<br/>\n&gt; <br/>\n&gt; Susan<br/>\n<br/>\n<br/>\n </span></blockquote>Hi Susan,<br/>\nMy son (7) doesn&#39;t have any spectrum issues, but had severe SDI <br/>\n(sensory integration dysfunction) and the attendant motor delays and <br/>\nvisual delays. He also had severe food allergies, and a few other <br/>\nissues. He has gone through several courses of therapy over the <br/>\nyears - OT for the SDI and Visual Therapy, as well as NAET for the <br/>\nallergies. Since we&#39;ve always known we wanted to usnchool, it has <br/>\nbeen hard at times to reconcile the unschooling philosophy with the <br/>\nability to help my child through things that do come naturally to <br/>\nmost kids. Most kids can dress themselves. Most kids eyes work <br/>\ntogether. Most kids can cross their hands over the center line of <br/>\ntheir body when they are writing or drawing. They don&#39;t cover their <br/>\nears or worry about things brushing their skin. I just had yet <br/>\nanother sunscreen problem today on a homeschool group bike ride. <br/>\nWe&#39;ve tried everything over the years to deal with the sun issue - <br/>\nfor a kid who doesn&#39;t like clothes or sunscreen touching their skin, <br/>\nhow do you go outdoors in the summer? Things have improved greatly <br/>\nover the years and with the therapy, but there are still daily issues.<br/>\n<br/>\nI&#39;ve come to this conclusion: as unschoolers, we try as best we can <br/>\nto  help our kids to learn/do the things they want to do. That might <br/>\nmean telling them how to spell a word, looking up something on the <br/>\ninternet, driving them to the library, etc. For us, the therapies he <br/>\nhas gone through have helped him do things (&quot;normal&quot; things) that he <br/>\nhas wanted to do - things like dress himself, see a movie in a <br/>\ntheatre, or draw something he wants to draw. Just helping him remove <br/>\nthe roadblocks in his life is, I think, still compatible with <br/>\nunschooling, although there are those who will dismiss any therapy <br/>\nas &quot;unneeded&quot; and as opposed to unschooling. Also, we look for <br/>\ntherapies that are compatible with our unschooling lifestyle, and <br/>\ntherapists who will not start pushing school agendas. So far, it has <br/>\nworked out okay.<br/>\n<br/>\nBest of luck to you. There is no easy road when parenting a kid with <br/>\nchallenging issues, but I think unschooling is a real gift for these <br/>\nkids who often struggle so hard, both academically and socially if <br/>\nthey are in schools. Just having the time to progress in their own <br/>\nway and pace, and the time with patient and loving parents is, IMHO, <br/>\na godsend.<br/>\n<br/>\nBlue Skies,<br/>\n-Robin-</div>","specialLinks":[]},{"userId":183606874,"authorName":"Susan Harrison","from":"Susan Harrison &lt;susanandgrace@...&gt;","profile":"susanandgrace","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] unschooling special needs children - long","postDate":"1089928855","msgId":2107,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNzE1MjIwMDU1LjQxNjk5LnFtYWlsQHdlYjUwNzA1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDIwMDQwNzE1MTc0MzA3LjEyNTI2LnFtYWlsQHdlYjIwOTI4Lm1haWwueWFob28uY29tPg=="},"prevInTopic":2106,"nextInTopic":2114,"prevInTime":2106,"nextInTime":2108,"topicId":2082,"numMessagesInTopic":0,"msgSnippet":"Tanya, We are having very similar struggles and my heart goes out to you. I think the fact that we are both here on this unschooling site is a sign that we","messageBody":"<div id=\"ygrps-yiv-1931814781\">Tanya,<br/>\n <br/>\nWe are having very similar struggles and my heart goes out to you. I think the fact that we are both here on this unschooling site is a sign that we honor our children and are looking for the best for them. I love that the members here are always accepting of their children and where they are. I want to get there too! Susan<br/>\n<br/>\nNaturally Organic &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:naturallyorganic@...\">naturallyorganic@...</a>&gt; wrote:<br/>\nI love the idea of unschooling with her, but I am having a hard time <br/>\nletting go of the idea that I need to insist that she learn certain <br/>\nthings at certain times. When you have a child who has aspergers <br/>\nthe &quot;professionals&quot; really try to drum it in to you that you need to <br/>\ndrill, drill, drill and impose yourself on your child and rip them <br/>\nout of their isolated world.&gt;&gt;<br/>\n<br/>\nThis is one I mull over frequently. I have a 6 yo with autism. He was non verbal until around the age of four. We have done work with biomeds, and have seen progress. However, his speech is still largely unintelligible. He needs speech and language therapy, among other things. A lot of things, before his diagnosis, were &quot;just jordie&quot;. It&#39;s a challenge to continue to look at it that way, ever since the label was applied. OTOH, it was liberating to get that label, to find out that these things weren&#39;t MY fault (and yes, for some things I really did think it was!). He went to school for three months of last year. He will be going again next year, to an autism specific program in our district. Part of the reason is that I am at a loss. At a loss on how to help him. Hopefully as we continue biomed treatments, we will see more improvements, more self control, and less aggression. I too, am right along with you in questioning the drill drill drill aspect. His teacher from last year says<br/>\nthat the only way he may be able to learn his &quot;basics&quot; is by rote. Me, I&#39;m wondering - what will happen if we sit back and wait two to three years, to see how he does on his own? OTOH, there is a really good chance with his lack of understanding of anything sequential that by rote may be the only way. Waiting will mean we have lost all that time. Coming from an unschooled and at the least, delayed academic perspective, this is all puzzling to me. To me, basics means tying your shoe, buttoning your own pants, and other daily living and social skills, not counting to ten and saying your ABC&#39;s. Thankfully, the TEACCH program is a combination of both. <br/>\n<br/>\nTwo side notes: he was completely undiagnosed and no interventions (save for the biomeds - I didn&#39;t know until later what I was doing was what a lot of parents of autism kids were doing) until the age of five and a half. Everyone remarked upon his entry to school at almost age six how well he did. I can only surmise that part of that is b/c he hasn&#39;t been forced since the age of 3 (like a lot of the kids in early intervention). <br/>\n<br/>\nsecond: we were at the park yesterday, and it seems to me that some children can really pick out the ones that &quot;aren&#39;t like them&quot;, and treat them accordingly. Jordie&#39;s idea of making friends is to walk up to somebody and say Hi. See my toy? When he did this yesterday, several young boys began taunting him, and then poking him and one actually slapped him. I was/am appalled and disheartened that I have yet another thing to watch out for. It&#39;s enough to make a gal want to buy five acres in the middle of nowhere and just live. <br/>\n<br/>\nI realize that by admitting on a list like this that I may be seen as a not unschooler. I&#39;m okay with that.  Living with a child like Jordie is an extreme challenge. Sometimes I think, so what? Leave him alone, there&#39;s nothing &quot;wrong&quot;! Other times I want to yell at people that he can&#39;t help it, he doesn&#39;t know, he doesn&#39;t understand. So for the OP, I&#39;m sorry. I have no answers. I only have more questions. I understand exactly how you feel. <br/>\n<br/>\nTanya <br/>\nmom of five, all special and unique<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\nYahoo! Groups SponsorADVERTISEMENT<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nYahoo! Groups Links<br/>\n<br/>\n   To visit your group on the web, go to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n  <br/>\n   To unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n  <br/>\n   Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nNew and Improved Yahoo! Mail - Send 10MB messages!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":183606874,"authorName":"Susan Harrison","from":"Susan Harrison &lt;susanandgrace@...&gt;","profile":"susanandgrace","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: unschooling special needs children","postDate":"1089928522","msgId":2106,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNzE1MjE1NTIyLjczOTI1LnFtYWlsQHdlYjUwNzAzLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDE0OS4yZTBiODEwYy4yZTI4MWY1OEBhb2wuY29tPg=="},"prevInTopic":2100,"nextInTopic":2107,"prevInTime":2105,"nextInTime":2107,"topicId":2082,"numMessagesInTopic":0,"msgSnippet":"Kelly, I think that it might be a combination of both, but after a sensory OT session she is so relaxed, you can see it on her face and hear it in her voice. I","messageBody":"<div id=\"ygrps-yiv-1630629014\">Kelly,<br/>\n <br/>\nI think that it might be a combination of both, but after a sensory OT session she is so relaxed, you can see it on her face and hear it in her voice. I think of it as someone getting a massage or something  - it is very comforting to her and she loves it. She is normally kind of tense. One thing I can say is that she had her fingers in her ears consistently from age 2 to 5. We did one session of auditory therapy and THAT AFTERNOON she took her fingers out of her ears and swam and rode her bike for the first time and hasn&#39;t put them in since. It was a pretty obvious connection that time.<br/>\n <br/>\nI&#39;ve learned alot from the OT about making sure she gets a steady diet of swinging, running, climbing, crunchy foods, slimy toys, etc. that she would not normally go for and I wouldn&#39;t have pushed it otherwise.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> wrote:<br/>\n<br/>\nIn a message dated 7/15/2004 12:56:05 PM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:susanandgrace@...\">susanandgrace@...</a> writes:<br/>\n<br/>\nGrace  had so many sensory issues that we felt we had to do something - she <br/>\nwould  hardly touch anything! She wasn&#39;t comfortable in her own skin until very <br/>\nrecently.<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;<br/>\n<br/>\nDo you think that her new comfort is a result of the intense therapy?  Or <br/>\nmaybe the result of being another year older and better able to handle  things? <br/>\n<br/>\nThat could make a difference.<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\nYahoo! Groups SponsorADVERTISEMENT<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nYahoo! Groups Links<br/>\n<br/>\n   To visit your group on the web, go to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n  <br/>\n   To unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n  <br/>\n   Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nNew and Improved Yahoo! Mail - 100MB free storage!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":172216154,"authorName":"Mark Shields","from":"Mark Shields &lt;shields@...&gt;","profile":"kulahawaii","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] unschooling special needs children","postDate":"1089919814","msgId":2100,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxQzQ2QTY3LjdCMkM2N0UwLnNoaWVsZHNAb2xkc2hvZXByZXNzLmNvbT4="},"prevInTopic":2099,"nextInTopic":2106,"prevInTime":2099,"nextInTime":2101,"topicId":2082,"numMessagesInTopic":0,"msgSnippet":"Yes, Ren I have read Anne s writings.  I love them, but like Susan I have felt they are not as helpful (for me) because her son doesn t have the learning","messageBody":"<div id=\"ygrps-yiv-2056111502\">Yes, Ren I have read Anne&#39;s writings.  I love them, but like Susan I have <br/>\nfelt they are not as helpful (for me) because her son doesn&#39;t have the <br/>\nlearning challenges that Ryan has.  For instance, you know the homeschool <br/>\nsaying (something like this), &quot;children learn to talk without instruction, <br/>\nit&#39;s the same for everything else.&quot;  Well, my son has needed extensive <br/>\ninstruction just to be intelligible and it&#39;s still going on.  That&#39;s one <br/>\nthing that makes it scarier.  I am truly not so worried about the reading, <br/>\nI guess that&#39;s what I was trying to emphasize.  I do wish he could do some <br/>\nreally basic arithmetic simply because it would be easier to reason with <br/>\nhim.  He just can&#39;t understand why, when he has $5.00 in his pocket he <br/>\ncan&#39;t buy the $50.00 toy.  It&#39;s exhausting to do any shopping with him so I <br/>\ntend to avoid taking him.  When he does come to the store with me, <br/>\nregardless of the store he wants to buy everything.  So there is a real <br/>\nreason to want him to have a basic understanding of math.  Also, while I <br/>\ndon&#39;t expect him to be reading War and Peace some day, I do hope that he <br/>\ncan read the things that make him happy because he absolutely loves books. <br/>\n Like me and his sister he can spend hours in a bookstore just browsing!<br/>\nKristin<br/>\n<br/>\n-----Original Message-----<br/>\nFrom:\tRen Allen [SMTP:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>]<br/>\n<br/>\n&quot;So here we are at age 9 and 10 months: he is not a reader&quot;<br/>\n<br/>\nI have a 10 y.o. (11 in August) that is a very beginning reader<br/>\nwithout a hint of autism! So not reading at 9 or 10 isn&#39;t<br/>\nproblematic, except in school.<br/>\nDon&#39;t let that scare you a bit.:)<br/>\n<br/>\nI&#39;ve read enough about kids with special challenges, like autism,<br/>\nthat thrive in an unschooling environment. I think the best thing a<br/>\nparent can do, is learn as much as they can about their child&#39;s<br/>\nchallenges and figure out how to best help that child navigate life<br/>\nin their own way. Just like we&#39;d do with any child, it just takes<br/>\nmore patience and research with those bigger challenges.<br/>\n<br/>\nRote learning produces nothing but frustration when it&#39;s forced...I<br/>\ndon&#39;t believe those children are truly gaining in the long run by<br/>\nhaving that method crammed down their throats.<br/>\nIf they&#39;re never great readers, that&#39;s OK! I think like any child,<br/>\nwe need to focus on strengths and let them be who they are. Forcing<br/>\nthe basics is not going to help them be more functional adults in<br/>\nthe long run.<br/>\n<br/>\nI&#39;m assuming all of you have read Anne Ohman&#39;s article &quot;I Am What I<br/>\nAm&quot; ??<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":172216154,"authorName":"kulahawaii","from":"&quot;kulahawaii&quot; &lt;shields@...&gt;","profile":"kulahawaii","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling special needs children - long","postDate":"1089918972","msgId":2099,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNkNmw1cytlcXRmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAxQzQ2QTYyLkMxQTBCMkQwLnNoaWVsZHNAb2xkc2hvZXByZXNzLmNvbT4="},"prevInTopic":2098,"nextInTopic":2100,"prevInTime":2098,"nextInTime":2100,"topicId":2082,"numMessagesInTopic":0,"msgSnippet":"I just wanted to mention that there is a yahoo group called asyoulikeit@yahoogroups.com.  Here is the blurb: AS You Like It is a secular list for parents who","messageBody":"<div id=\"ygrps-yiv-180011380\">I just wanted to mention that there is a yahoo group called <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:asyoulikeit@yahoogroups.com\">asyoulikeit@yahoogroups.com</a>.  Here is the blurb:<br/>\n<br/>\nAS You Like It is a secular list for parents who homeschool, or who <br/>\nare thinking about homeschooling, children with Aspergers Syndrome, <br/>\nHFA, or PDD.<br/>\n<br/>\nThere are several unschoolers on the list and they would welcome any <br/>\nquestions you have also.<br/>\nKristin</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling special needs children","postDate":"1089918798","msgId":2098,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNkNmwwZStlbXZsQGVHcm91cHMuY29tPg=="},"prevInTopic":2096,"nextInTopic":2099,"prevInTime":2097,"nextInTime":2099,"topicId":2082,"numMessagesInTopic":0,"msgSnippet":"So here we are at age 9 and 10 months: he is not a reader I have a 10 y.o. (11 in August) that is a very beginning reader without a hint of autism! So not","messageBody":"<div id=\"ygrps-yiv-1557832597\">&quot;So here we are at age 9 and 10 months: he is not a reader&quot;<br/>\n<br/>\nI have a 10 y.o. (11 in August) that is a very beginning reader <br/>\nwithout a hint of autism! So not reading at 9 or 10 isn&#39;t <br/>\nproblematic, except in school.<br/>\nDon&#39;t let that scare you a bit.:)<br/>\n<br/>\nI&#39;ve read enough about kids with special challenges, like autism, <br/>\nthat thrive in an unschooling environment. I think the best thing a <br/>\nparent can do, is learn as much as they can about their child&#39;s <br/>\nchallenges and figure out how to best help that child navigate life <br/>\nin their own way. Just like we&#39;d do with any child, it just takes <br/>\nmore patience and research with those bigger challenges.<br/>\n<br/>\nRote learning produces nothing but frustration when it&#39;s forced...I <br/>\ndon&#39;t believe those children are truly gaining in the long run by <br/>\nhaving that method crammed down their throats.<br/>\nIf they&#39;re never great readers, that&#39;s OK! I think like any child, <br/>\nwe need to focus on strengths and let them be who they are. Forcing <br/>\nthe basics is not going to help them be more functional adults in <br/>\nthe long run.<br/>\n<br/>\nI&#39;m assuming all of you have read Anne Ohman&#39;s article &quot;I Am What I <br/>\nAm&quot; ??<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":172216154,"authorName":"Mark Shields","from":"Mark Shields &lt;shields@...&gt;","profile":"kulahawaii","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] unschooling special needs children - long","postDate":"1089917785","msgId":2096,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxQzQ2QTYyLkMxQTBCMkQwLnNoaWVsZHNAb2xkc2hvZXByZXNzLmNvbT4="},"prevInTopic":2094,"nextInTopic":2098,"prevInTime":2095,"nextInTime":2097,"topicId":2082,"numMessagesInTopic":0,"msgSnippet":"Hi Susan and others, I also have a child with autism, specifically PDD-NOS.  He is 9 now (almost 10) and was dx at age 6.  He was at home until the dx (no","messageBody":"<div id=\"ygrps-yiv-1778214784\">Hi Susan and others,<br/>\nI also have a child with autism, specifically PDD-NOS.  He is 9 now (almost <br/>\n10) and was dx at age 6.  He was at home until the dx (no preschool), but <br/>\ndue to moderate communication and motor control issues had speech and OT <br/>\nsince the age of 3.  After the dx we went through a couple of months not <br/>\nknowing what to do.  We also have an 11 yo daughter who has always <br/>\nunschooled and we had planned to unschool him also.  However, after the dx <br/>\nI got really scared (the so-called professionals will do that to you) and <br/>\nwe put him in public school.<br/>\n<br/>\nAfter three years of school we started unschooling again last summer.  He <br/>\nnever did learn to read in school.  Though they were working on it and said <br/>\nhe was starting to read.  I could see at home it was a false assumption. <br/>\n He also hated the reading practice we were supposed to be doing though he <br/>\nhas loved books and being read to since the age of 5.  I really worried he <br/>\nwould come to hate books and reading if he stayed in school.  He also still <br/>\ncan&#39;t count more than about 5 objects without assistance.  They were making <br/>\nhim do math worksheets for homework and I was basically giving him the <br/>\nanswers.  I knew that it was ridiculous to expect him to do these things <br/>\nwhen he wasn&#39;t developmentally ready.  Anyway, I hated the schedule, the <br/>\nhomework and the way he was so angry every afternoon.<br/>\n<br/>\nLast summer we moved and decided to do some extensive traveling.  He <br/>\nlearned more in those 5 months than in the whole previous three years and <br/>\nalso had no therapy at all during that time.  What he did have was his <br/>\nfamily around him at all times and tons of time riding in the RV to play <br/>\nand talk with his sister.  That was invaluable!  His pretend play and <br/>\nconversations skills really took off.  Well, we are settled in a new home, <br/>\nnew state now and getting back into regular routines.  I have started <br/>\ntherapy again, because as he talks more we see all sorts of grammar <br/>\nmistakes.  His new therapist is wonderful and supports homeschooling.  She <br/>\nis working on real life skills that he just doesn&#39;t seem to be getting even <br/>\nwith our help.  She also pointed out things he can&#39;t do that we didn&#39;t even <br/>\nrealize.   So I do think there is a place for therapy, though I think the <br/>\nbreak from therapy was just as valuable.<br/>\n<br/>\nI am not doing any reading practice or any schooly types of things with <br/>\nhim, but I read to him everyday.  Ryan&#39;s obsessions mainly center around <br/>\nmechanical things, trains, constructions vehicles, vaccuums, all home and <br/>\nyard appliances.  So we get lots of books from the library about these <br/>\ntypes of things.  We watch shows that interest him and I take him places <br/>\nwhere they have cool mechanical things like the science museum and the <br/>\nlogging museum.<br/>\n<br/>\nHe does have some social deficits, but can start a conversation with <br/>\nanyone, it&#39;s keeping it going that he has trouble with.  He actually seems <br/>\nto be more outgoing than my daughter at places like the park where he&#39;ll <br/>\nplay with almost anyone.  However, he does not have a best friend, partly <br/>\ndue to the move but also because he has trouble developing deep <br/>\nrelationships.  The other kids sometimes reject him due to a weird movement <br/>\nor sentence.  He does best with little kids actually.<br/>\n<br/>\nSo here we are at age 9 and 10 months: he is not a reader, he can&#39;t do any <br/>\nmath at all, he doesn&#39;t understand the value of money, he can write only <br/>\nhis name.  It can be really scary!  I am trying to keep my trust in him and <br/>\nkeep reminding myself that lots of unschooled kids can&#39;t read at age 10.  I <br/>\nfeel that being able to read is something he is capable of and will take a <br/>\nfew more years.  I can&#39;t wait til it happens so I can write an encouraging <br/>\narticle about it!  The math seems more worrisome to me actually, though <br/>\nI&#39;ve read that math can be a real challenge for many autistic kids.   He <br/>\nhas just started to get an allowance and I am hoping this will help him <br/>\nlearn about money and spending.<br/>\n<br/>\nTo Tanya who has the 6 year old with autism.  Ryan sounds similar to your <br/>\nson.  He didn&#39;t have any words until after age 3 and then only a few until <br/>\nhe was at least 4.  He was very unintelligible for years.  He has made tons <br/>\nof progress in the last few years with speech, self control and dealing <br/>\nwith frustration/aggression.   Things will get better.<br/>\n<br/>\nKristin</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: unschooling special needs children","postDate":"1089914200","msgId":2094,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0OS4yZTBiODEwYy4yZTI4MWY1OEBhb2wuY29tPg=="},"prevInTopic":2093,"nextInTopic":2096,"prevInTime":2093,"nextInTime":2095,"topicId":2082,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/15/2004 12:56:05 PM Eastern Daylight Time, susanandgrace@yahoo.com writes: Grace  had so many sensory issues that we felt we had to do","messageBody":"<div id=\"ygrps-yiv-811541309\">In a message dated 7/15/2004 12:56:05 PM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:susanandgrace@...\">susanandgrace@...</a> writes:<br/>\n<br/>\nGrace  had so many sensory issues that we felt we had to do something - she <br/>\nwould  hardly touch anything! She wasn&#39;t comfortable in her own skin until very <br/>\n recently.<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;<br/>\n <br/>\nDo you think that her new comfort is a result of the intense therapy?  Or <br/>\nmaybe the result of being another year older and better able to handle  things? <br/>\n <br/>\nThat could make a difference.<br/>\n <br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":91826185,"authorName":"Naturally Organic","from":"Naturally Organic &lt;naturallyorganic@...&gt;","profile":"naturallyorganic","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] unschooling special needs children - long","postDate":"1089913387","msgId":2093,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNzE1MTc0MzA3LjEyNTI2LnFtYWlsQHdlYjIwOTI4Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGNkNXNvais0MWxtQGVHcm91cHMuY29tPg=="},"prevInTopic":2091,"nextInTopic":2094,"prevInTime":2092,"nextInTime":2094,"topicId":2082,"numMessagesInTopic":0,"msgSnippet":"I love the idea of unschooling with her, but I am having a hard time letting go of the idea that I need to insist that she learn certain things at certain","messageBody":"<div id=\"ygrps-yiv-1791496907\">I love the idea of unschooling with her, but I am having a hard time <br/>\nletting go of the idea that I need to insist that she learn certain <br/>\nthings at certain times. When you have a child who has aspergers <br/>\nthe &quot;professionals&quot; really try to drum it in to you that you need to <br/>\ndrill, drill, drill and impose yourself on your child and rip them <br/>\nout of their isolated world.&gt;&gt;<br/>\n <br/>\nThis is one I mull over frequently. I have a 6 yo with autism. He was non verbal until around the age of four. We have done work with biomeds, and have seen progress. However, his speech is still largely unintelligible. He needs speech and language therapy, among other things. A lot of things, before his diagnosis, were &quot;just jordie&quot;. It&#39;s a challenge to continue to look at it that way, ever since the label was applied. OTOH, it was liberating to get that label, to find out that these things weren&#39;t MY fault (and yes, for some things I really did think it was!). He went to school for three months of last year. He will be going again next year, to an autism specific program in our district. Part of the reason is that I am at a loss. At a loss on how to help him. Hopefully as we continue biomed treatments, we will see more improvements, more self control, and less aggression. I too, am right along with you in questioning the drill drill drill aspect. His teacher from last year says<br/>\n that the only way he may be able to learn his &quot;basics&quot; is by rote. Me, I&#39;m wondering - what will happen if we sit back and wait two to three years, to see how he does on his own? OTOH, there is a really good chance with his lack of understanding of anything sequential that by rote may be the only way. Waiting will mean we have lost all that time. Coming from an unschooled and at the least, delayed academic perspective, this is all puzzling to me. To me, basics means tying your shoe, buttoning your own pants, and other daily living and social skills, not counting to ten and saying your ABC&#39;s. Thankfully, the TEACCH program is a combination of both. <br/>\n <br/>\nTwo side notes: he was completely undiagnosed and no interventions (save for the biomeds - I didn&#39;t know until later what I was doing was what a lot of parents of autism kids were doing) until the age of five and a half. Everyone remarked upon his entry to school at almost age six how well he did. I can only surmise that part of that is b/c he hasn&#39;t been forced since the age of 3 (like a lot of the kids in early intervention). <br/>\n <br/>\nsecond: we were at the park yesterday, and it seems to me that some children can really pick out the ones that &quot;aren&#39;t like them&quot;, and treat them accordingly. Jordie&#39;s idea of making friends is to walk up to somebody and say Hi. See my toy? When he did this yesterday, several young boys began taunting him, and then poking him and one actually slapped him. I was/am appalled and disheartened that I have yet another thing to watch out for. It&#39;s enough to make a gal want to buy five acres in the middle of nowhere and just live. <br/>\n <br/>\nI realize that by admitting on a list like this that I may be seen as a not unschooler. I&#39;m okay with that.  Living with a child like Jordie is an extreme challenge. Sometimes I think, so what? Leave him alone, there&#39;s nothing &quot;wrong&quot;! Other times I want to yell at people that he can&#39;t help it, he doesn&#39;t know, he doesn&#39;t understand. So for the OP, I&#39;m sorry. I have no answers. I only have more questions. I understand exactly how you feel. <br/>\n <br/>\nTanya <br/>\nmom of five, all special and unique<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":183606874,"authorName":"Susan Harrison","from":"Susan Harrison &lt;susanandgrace@...&gt;","profile":"susanandgrace","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: unschooling special needs children","postDate":"1089910198","msgId":2091,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNzE1MTY0OTU4LjIzODMxLnFtYWlsQHdlYjUwNzAyLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGNkNjF1MitqNmRmQGVHcm91cHMuY29tPg=="},"prevInTopic":2085,"nextInTopic":2093,"prevInTime":2090,"nextInTime":2092,"topicId":2082,"numMessagesInTopic":0,"msgSnippet":"Crystal, It does help - tons. Do you or did you do speech or OT services with your daughter?  How do unschoolers feel about getting theraputic help? It seems","messageBody":"<div id=\"ygrps-yiv-1386828019\">Crystal,<br/>\n <br/>\nIt does help - tons. Do you or did you do speech or OT services with your daughter?  How do unschoolers feel about getting theraputic help? It seems to go against the philosophy but then again if your child is having major issues you have to do something!<br/>\n <br/>\nGrace had so many sensory issues that we felt we had to do something - she would hardly touch anything! She wasn&#39;t comfortable in her own skin until very recently.<br/>\n <br/>\nCrystal &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:crystal.pina@...\">crystal.pina@...</a>&gt; wrote:<br/>\n<br/>\nI hope this helps you a little until others come along.<br/>\n<br/>\nCrystal<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! Mail - Helps protect you from nasty viruses.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154033277,"authorName":"Crystal","from":"&quot;Crystal&quot; &lt;crystal.pina@...&gt;","profile":"crystalinma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling special needs children - long","postDate":"1089899266","msgId":2085,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNkNjF1MitqNmRmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNkNXNvais0MWxtQGVHcm91cHMuY29tPg=="},"prevInTopic":2082,"nextInTopic":2091,"prevInTime":2084,"nextInTime":2086,"topicId":2082,"numMessagesInTopic":0,"msgSnippet":"Hi Susan, you are not alone.  My daughter is also an Aspie.  She s 14.  I ve found that unschooling is the only way for her.  She could never have sat down","messageBody":"<div id=\"ygrps-yiv-535713376\">Hi Susan, you are not alone.  My daughter is also an Aspie.  She&#39;s <br/>\n14.  I&#39;ve found that unschooling is the only way for her.  She could <br/>\nnever have sat down with lessons!  Her latest obsession is online <br/>\nrole playing.  Role playing is basically acting out a story that the <br/>\nkids make up as they go along--they get into character and play a <br/>\nrole.  I&#39;m figuring this helps her with her social skills as she can <br/>\nact things out.  She has major social skills issues.  Before this <br/>\nobsession, her obsession was poetry.  She made friends online with <br/>\nwriters and she is having three of her poems published in a book.  <br/>\n<br/>\nThe other subjects will come when they are ready.  For example, if <br/>\nmy daughter wants to burn CD&#39;s she has to figure out how much space <br/>\nshe has and how many songs will fit on the CD based on their <br/>\nlength.  She also knows how to check unit prices to figure out what <br/>\nis cheapest.  <br/>\n<br/>\nAnneO is great, isn&#39;t she?  I&#39;ve been fighting with people not to <br/>\nchange my daughter for so long and AnneO comes along and just says <br/>\nin a calm and soothing voice that your children should be honored <br/>\nfor who they are.  When she says that, who could ever want their <br/>\nchildren to change?<br/>\n<br/>\n***She is verbal, and actually has a great vocabulary but uses <br/>\nlanguage differently.***<br/>\n<br/>\nSusan, I&#39;ve recently heard about Hyperplexia.  Have you heard of <br/>\nit?  It&#39;s basically what you said about language and it is often <br/>\nseen with Asperger&#39;s.  I&#39;m thinking my daughter might have it too, <br/>\nbut to a lesser degree since my daughter didn&#39;t read until she was <br/>\n12.  She could read the most complex word, but she had no clue what <br/>\nit meant when you put it in a sentence.  She had little <br/>\ncomprehension.  Now that she&#39;s been unschooling and allowed time to <br/>\nfigure out the world of the written word for herself, she is so far <br/>\nadvanced in Language and Grammar skills.  <br/>\n<br/>\nI did sit with her for a little bit and help her figure out the <br/>\naction in a sentence and who was doing the action.  Once she got <br/>\nover that hurdle, her comprehension just took off.  If your daughter <br/>\nwanted to knit a scarf, you&#39;d show her how, then you&#39;d let her make <br/>\nher scarf herself, right?  It&#39;s the same with learning anything.  <br/>\nYou observe and listen to what your child is interested in, even if <br/>\nit&#39;s snacks and the zoo.  If you see your child struggling, you <br/>\noffer help.  Don&#39;t believe that your daughter needs things drilled <br/>\ninto her.  It will only frustrate the both of you.  <br/>\n<br/>\nI could sit and discuss this subject all day but I have to run.  I <br/>\nhope this helps you a little until others come along.<br/>\n<br/>\nCrystal</div>","specialLinks":[]},{"userId":183606874,"authorName":"Susan","from":"&quot;Susan&quot; &lt;susanandgrace@...&gt;","profile":"susanandgrace","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling special needs children - long","postDate":"1089893971","msgId":2082,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNkNXNvais0MWxtQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":2085,"prevInTime":2081,"nextInTime":2083,"topicId":2082,"numMessagesInTopic":0,"msgSnippet":"HI, I have been reading the emails for a couple of months now, evening posting a couple of times. I love reading the posts, although I can find very few that I","messageBody":"<div id=\"ygrps-yiv-1118791975\">HI, I have been reading the emails for a couple of months now, <br/>\nevening posting a couple of times. I love reading the posts, although <br/>\nI can find very few that I can relate to in my situation. I have <br/>\nchecked out Annie O&#39;s writings and find them wonderful. But I am <br/>\nlooking for some concrete experiences.<br/>\n<br/>\nI am homeschooling my wonderful seven year old daughter with <br/>\nasperger&#39;s syndrome. (For those of you who are not familiar with this <br/>\nit is basically high functioning autism. She has the social and <br/>\nlanguage issues of autism but to a lesser degree. She is verbal, and <br/>\nactually has a great vocabulary but uses language differently. She is <br/>\nsmart, but processes information in a way that I haven&#39;t actually <br/>\ngotten the hang of. She obsesses over a few things to the exclusion <br/>\nof what is going on around her. She is currently obsessing over <br/>\nsweets and the zoo. And sweets at the zoo. This is all she is <br/>\ninterested in at the moment.)<br/>\n<br/>\nI love the idea of unschooling with her, but I am having a hard time <br/>\nletting go of the idea that I need to insist that she learn certain <br/>\nthings at certain times. When you have a child who has aspergers <br/>\nthe &quot;professionals&quot; really try to drum it in to you that you need to <br/>\ndrill, drill, drill and impose yourself on your child and rip them <br/>\nout of their isolated world. WE HAVE NOT DONE THIS SO FAR at home - <br/>\nshe does get speech therapy and sensory ot - she has many sensory <br/>\nissues, but I am getting a little less confident as time goes on that <br/>\nshe doesn&#39;t need the more traditional approach. Truthfully, I cannot <br/>\ntell what she is learning.<br/>\n<br/>\nI guess what I am asking is this: is there anyone on this list that <br/>\nhas a child with significant learning/developmental issues that is <br/>\nunschooling? I am looking for a concrete experience: this is how it <br/>\nwent for us..... As I said, I loved Annie&#39;s writings, but they are <br/>\nvague in her child&#39;s challenges and how he is working with <br/>\nunschooling. Sorry to sound desperate, but I am, a little. Thanks.<br/>\n<br/>\nSusan</div>","specialLinks":[]}],"prevTopicId":2013,"nextTopicId":2161}}