{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":44,"messages":[{"userId":267954153,"authorName":"Brian & Alexandra Polikowsky","from":"&quot;Brian & Alexandra Polikowsky&quot; &lt;polykow@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"2"},"subject":"Re: [unschoolingbasics] Our Fears","postDate":"1182007600","msgId":23695,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNjEwMWM3YjAyYSRiY2I2NTc1MCQ2NDU4YThjMEBPZmZpY2U+","referencesHeader":"PGNmNi4xMDNhZTI0MS4zMzdjNTU0M0Bhb2wuY29tPg=="},"prevInTopic":23689,"nextInTopic":23697,"prevInTime":23694,"nextInTime":23696,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"Robin I am so sorry for your dd. As someone how has worked with dogs I get so mad when things like that happen. I am sure you must have but have you sat down","messageBody":"<div id=\"ygrps-yiv-447601671\">Robin I am so sorry for your dd. As someone how has worked with dogs I get so mad when things like that happen.<br/>\nI am sure you must have but have you sat down gently with her and talked about how this medication can help her feel better?<br/>\nIs it possible to add a flavor she likes to the medication? How long does she have to take this one and if it is long can you get another antibiotic that can be used shorter duration?<br/>\nI have been bitten by dogs and cats and it can really get infected ( not always thou I would say 10% to 20%of the times only) and the infection is really painful.<br/>\nIs it already painful now? It really gets painful right away about 12 hours from the bite.<br/>\nIf it has not it may not get infected at all.<br/>\nI have taken antibiotics for it half the time.<br/>\nOf the times it I took it and It got infected it seemed that it took the same amount of time to heal and for the infection to go away with or without the antibiotic.<br/>\nMy only worry is that it is in her face. I would try to really talk to her without scarring her and also try calling the pharmacy for adding flavors to the meds, etc<br/>\nAgain I ask if she is in intense pain and I will say again that is it is to get infected it would happen in the first 12-24 hours( but I don&#39;t know if the antibiotic she took at the hospital would change that) as infected dog or cat bites are extremely painful.<br/>\nBest wishes<br/>\nAlex<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":275660928,"authorName":"lydia walker","from":"lydia walker &lt;lydia_walker@...&gt;","profile":"wlkr_lyd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] unschooling and domestic violence","postDate":"1179738868","msgId":23873,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2NTE2MkY0LjQwMTAyMDJAY29tY2FzdC5uZXQ+","inReplyToHeader":"PDAwNGUwMWM3OTlmMiQwY2FkN2M2MCQ0MDAxYThjMEBEYXZpZD4=","referencesHeader":"PGQ2MC44MjM1MzRkLjMzN2M5NWRhQGFvbC5jb20+IDwwMTJkMDFjNzk3ZGYkMjIwZjU1YzAkNDAwMWE4YzBARGF2aWQ+IDwxMTc5MzY1MTU0LjY5NzMuMjYuY2FtZWxAbHlkaWEtZGVza3RvcD4gPDhDOTY3RDNGMjQ2NzE3MC01MUMtNTZENkBGV00tUjE0LnN5c29wcy5hb2wuY29tPiA8MTE3OTU0NzY1Ny4yODg0OS4xOC5jYW1lbEBseWRpYS1kZXNrdG9wPiA8MDA0ZTAxYzc5OWYyJDBjYWQ3YzYwJDQwMDFhOGMwQERhdmlkPg=="},"prevInTopic":23870,"nextInTopic":23874,"prevInTime":23872,"nextInTime":23874,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"I had a talk with the 6yo yesterday. The reason he doesn t want to leave out of the house is because he is scared it will be gone when we return and we will","messageBody":"<div id=\"ygrps-yiv-190553194\">I had a talk with the 6yo yesterday. The reason he doesn&#39;t want to leave <br/>\nout of the house is because he is scared it will be gone when we return <br/>\nand we will have to go back &quot;home&quot;. As for the other behavior all he <br/>\nsaid was that he is sad and that is what he does when he is sad.<br/>\nI left it at that, and offered my reassurance that we would not be <br/>\nreturning &quot;home&quot;, that this is our home now.  Yes I will have to check <br/>\nout food delivery prices and if I can squeeze it into the budget. I am <br/>\nlooking into ways for them to release some anger, thinking of punching <br/>\nbags, etc.  Whenever they are ready to travel again we will get out to <br/>\nthe park and stuff more.<br/>\nYes , Kristen if it weren&#39;t for the behavior issues I would not be <br/>\ntrying to set rules. I believe it is the fear that if I don&#39;t do <br/>\nsomething to &quot;control&quot; the anger the boys esp. will end up like their <br/>\nfather. I do recognize  that me being stressed is not helping the <br/>\nsituation.  That too  is fear  of not knowing  whether or not we can <br/>\nmake it alone. Guilt, yes I feel guilty that I put them through all of <br/>\nthis. I am going to try and take it day by day and whenever possible try <br/>\nand take a breather to regroup. Slowly but surely.  I think being able <br/>\nto vent has put me in a better state of mind to deal with the situation.</div>","specialLinks":[]},{"userId":214857126,"authorName":"kristenhendricks55","from":"&quot;kristenhendricks55&quot; &lt;kristenhendricks55@...&gt;","profile":"kristenhendricks55","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling and domestic violence","postDate":"1179713569","msgId":23870,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYycXY3MStnczh0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDOTY3RDNGMjQ2NzE3MC01MUMtNTZENkBGV00tUjE0LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":23823,"nextInTopic":23873,"prevInTime":23869,"nextInTime":23871,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"I have been in your situation, and although my DH has been through counseling and is different now, I can relate to what youre saying. If your kids didnt have","messageBody":"<div id=\"ygrps-yiv-2053860701\">I have been in your situation, and although my DH has been through <br/>\ncounseling and is different now, I can relate to what youre saying.  <br/>\n<br/>\nIf your kids didnt have behavioral issues, would you feel the need to <br/>\nset rules? Probably not.<br/>\n<br/>\nWhy do your kids have these issues? Probably through learned behavior <br/>\nfrom your husband.<br/>\n<br/>\nWhat will you achieve by setting rules because of their behavior? (In <br/>\ntheir eyes...) Punishment for doing the same thing that they were <br/>\ntaught.<br/>\n<br/>\n<br/>\nMy advice is to talk to them. Tell them why it hurts you when they <br/>\nact that way. Explain to them what happened between you and your <br/>\nhusband and how much it hurt you. Explain that you want things to be <br/>\ndiffernt and you want things to be fun and exciting. The more FUN you <br/>\nmake the day, the less the kids object. The less objections- the less <br/>\ntantrums. The less tantrums... the less stress. Its a big cycle.<br/>\n<br/>\nWhy not take them to the park and play tag or kickball and yell and <br/>\nscream and just let it all out. Or turning on some crazy dance video <br/>\nand really letting off some steam jumping around??<br/>\n<br/>\nI bet they would feel much better and be less stressed if you werent <br/>\nas stressed as you are. And because I have been there... I know that <br/>\nyou are stressed. And kids sense that. Try to work on you first... <br/>\nthe rest will unfold over time :)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, kbcdlovejo@... wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; -----Original Message-----<br/>\n&gt; From: lydia_walker@...<br/>\n&gt; <br/>\n&gt;     I am new to unschooling. My younger children are 6,4,4,2 I now <br/>\nhave <br/>\n&gt; full<br/>\n&gt; custody of them.We left their father 18 months ago stayed at a D.V<br/>\n&gt; shelter for 6 month and for the last year have been on are own. I <br/>\nwas<br/>\n&gt; wondering if anyone else has been in this situation and if so how <br/>\ndo you<br/>\n&gt; deal with it. I am trying to let my kids be free to learn and <br/>\nexplore I<br/>\n&gt; try to follow their interest as much as I can. I have come to see <br/>\nthat<br/>\n&gt; unschooling is also a lifestyle not just an educational choice. I am<br/>\n&gt; conflicted on how to deal with the children&#39;s behavioral issues I <br/>\nknow<br/>\n&gt; most of it is learned behavior. Whenever I ask them to do things the<br/>\n&gt; answer is no usually followed by tantrums that involve some form of<br/>\n&gt; destruction to property or myself. They refuse to eat at the table, <br/>\nthey<br/>\n&gt; talk back and are rude, to the point on being hurtful. I can&#39;t take <br/>\nthem<br/>\n&gt; out without total chaos. I am I wrong to assume that it would be<br/>\n&gt; inappropriate to set rules. We have been in counseling since before <br/>\nI<br/>\n&gt; left home. I am just confused in how to handle things. The therapist<br/>\n&gt; suggested time-outs and loss of privileges. I however don&#39;t want to <br/>\ndo<br/>\n&gt; that. I think that we all have been through too much I don&#39;t want to<br/>\n&gt; live that way they deserve to be kids and have choices. I know <br/>\nthere has<br/>\n&gt; to be another way. Thanks for listening, any suggestion would be<br/>\n&gt; welcome.<br/>\n&gt; <br/>\n&gt; -=-=-=-=<br/>\n&gt; <br/>\n&gt; I realize that you&#39;re going through a really tough time, but they <br/>\nare <br/>\n&gt; all still soooo little! I can only imagine what they&#39;ve been <br/>\nthrough al <br/>\n&gt; ready in such short lives.<br/>\n&gt; <br/>\n&gt; I think they are simply doing the best they can under the <br/>\n&gt; circumstances. They don&#39;t have many tools to tell you how they feel <br/>\nor <br/>\n&gt; what they need.<br/>\n&gt; <br/>\n&gt; I certainly don&#39;t think they need time-outs or loss of <br/>\n*anything*!!! <br/>\n&gt; They need to be held and cuddled and allowed to express their <br/>\nfeelings <br/>\n&gt; (which must be huge and complicated!).<br/>\n&gt; <br/>\n&gt; What kinds of things are you asking them to do? May they not <br/>\nsay &quot;no&quot;? <br/>\n&gt; Is it really that you are *asking*? Or are you simply telling them <br/>\nwhat <br/>\n&gt; to do in the form of a question? Why must they eat at the table? <br/>\nCan&#39;t <br/>\n&gt; you serve a picnic on the living room floor?<br/>\n&gt; <br/>\n&gt; Life must be *incredibly* hard for them right now.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ~Kelly<br/>\n&gt; <br/>\n&gt; Kelly Lovejoy<br/>\n&gt; Conference Coordinator<br/>\n&gt; Live and Learn Unschooling Conference<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n______________________________________________________________________<br/>\n__<br/>\n&gt; AOL now offers free email to everyone.  Find out more about what&#39;s <br/>\nfree <br/>\n&gt; from AOL at AOL.com.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":280852700,"authorName":"Schuyler","from":"&quot;Schuyler&quot; &lt;s.waynforth@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] unschooling and domestic violence","postDate":"1179564323","msgId":23823,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNGUwMWM3OTlmMiQwY2FkN2M2MCQ0MDAxYThjMEBEYXZpZD4=","referencesHeader":"PGQ2MC44MjM1MzRkLjMzN2M5NWRhQGFvbC5jb20+IDwwMTJkMDFjNzk3ZGYkMjIwZjU1YzAkNDAwMWE4YzBARGF2aWQ+IDwxMTc5MzY1MTU0LjY5NzMuMjYuY2FtZWxAbHlkaWEtZGVza3RvcD4gPDhDOTY3RDNGMjQ2NzE3MC01MUMtNTZENkBGV00tUjE0LnN5c29wcy5hb2wuY29tPiA8MTE3OTU0NzY1Ny4yODg0OS4xOC5jYW1lbEBseWRpYS1kZXNrdG9wPg=="},"prevInTopic":23822,"nextInTopic":23870,"prevInTime":23822,"nextInTime":23824,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"Little things might make a huge difference. Can you get your food delivered? Does a grocery store near you let you shop on-line and bring the food in? If not,","messageBody":"<div id=\"ygrps-yiv-1205211977\">Little things might make a huge difference. Can you get your food delivered? <br/>\nDoes a grocery store near you let you shop on-line and bring the food in? If <br/>\nnot, can going to the grocery store always include other trips like going to <br/>\nthe park or going to get ice cream or going to a toy store and getting <br/>\nsomething special. Can you get a couple of plastic mats to put on the floor <br/>\nunder where they want to eat? We have this great picnic mat that we got when <br/>\nwe collected enough stamps at Mr. Donut in Kyoto that I used to put out <br/>\nwhenever the kids wanted to eat in front of the television when they were <br/>\nlittle. We don&#39;t ever eat at the dinner table anymore, but they are older, <br/>\nand the carpet in this house is really not in any kind of shape to be <br/>\nanything but improved by having things spilled on it &lt;g&gt;.<br/>\n<br/>\nIs the destruction part of what they are enjoying? Or are they creating <br/>\nsomething that you just aren&#39;t able to see because it involves writing on <br/>\nwalls? If they are enjoying destruction, can you find things for them to <br/>\ndestroy? So when you see them writing on the walls in the house, give them <br/>\nwater washable fingerpaints and put them in the bath and let them paint all <br/>\nover the tiles in the bath? Get some sidewalk chalk and go outside and draw <br/>\nall over the sidewalk? Maybe try a bunch of different crayons and chalks on <br/>\na small, hidden section of the wall and see which can be removed most easily <br/>\nand talk to them about only drawing on the walls with those? Or draw with <br/>\nthem on the walls using the things that are safe to use? Or when they are <br/>\nbreaking something that you want to keep, find something that they can <br/>\nbreak, look for things that are already broken and use those. Get a punching <br/>\nbag and let them beat up on that. Simon used to, when he got really <br/>\nfrustrated, go beat up a punching bag he got at a car boot sale (the UKs <br/>\nversion of a garage sale).<br/>\n<br/>\nGiven what your lives has been for however long, they must feel so utterly <br/>\nconfused and unsure of themselves and the world they live in. It seems to me <br/>\nthat the best thing you can do for them is meet them where they are. Try and <br/>\nsay yes always. Try and find ways to say yes to them. Let them know that <br/>\nthey are safe and loved and sure of themselves with you. Punishing them and <br/>\ngiving them time outs will just push them back into a world where they feel <br/>\nlike they have no control over their outcomes. Maybe it would be easier for <br/>\nyou if you imagined how lovely it would feel if someone were to love you for <br/>\nexactly who you are and to support you in being that person. Maybe if <br/>\neverytime you said yes to your children you could see it as saying yes to <br/>\nyourself you could help yourself to feel more powerful, more embiggened. <br/>\nSaying yes is a pretty powerful thing, when your children come to you, or <br/>\nyou come to them and you can fill their world with all the things they dream <br/>\nof, including drawing on the walls, there is nothing more amazing, more <br/>\npowerful than that! And as time goes by they will come to the point where <br/>\nthey will help you find ways, not only to say yes to them, but to help you <br/>\nfind ways to say yes to you and to your dreams.<br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;lydia walker&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lydia_walker@...\">lydia_walker@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nSent: Saturday, May 19, 2007 5:07 AM<br/>\nSubject: Re: [unschoolingbasics] unschooling and domestic violence<br/>\n<br/>\n<br/>\n&gt;I am usually asking them things like could you help me get you dressed<br/>\n&gt; so I can go to the store, doctor, park etc. I don&#39;t know what to do when<br/>\n&gt; they say no, esp for the doctor my boy twin has neurology appts. twice a<br/>\n&gt; month. If I ask them to please not write on the walls or to stop<br/>\n&gt; throwing their shoes it doesn&#39;t matter everything is no.<br/>\n&gt; As for them saying no I am conflicted, we have to function and I can&#39;t<br/>\n&gt; leave them at home so I can go get groceries, etc. I don&#39;t think they<br/>\n&gt; should be allowed to be destructive but I don&#39;t know how to stop it.<br/>\n&gt; They don&#39;t have bed times and between them not going to bed until 2am or<br/>\n&gt; so and the behavioral issues I am exhausted.<br/>\n&gt; Yes they can eat on the floor, but I prefer the table because when they<br/>\n&gt; throw fits it is easier to clean on the had floor and it is not my<br/>\n&gt; carpet to destroy.<br/>\n&gt; I don&#39;t know what to say or do anymore. I don&#39;t want to give up on them,<br/>\n&gt; but I feel so helpless.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":275660928,"authorName":"lydia walker","from":"lydia walker &lt;lydia_walker@...&gt;","profile":"wlkr_lyd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] unschooling and domestic violence","postDate":"1179547657","msgId":23822,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExNzk1NDc2NTcuMjg4NDkuMTguY2FtZWxAbHlkaWEtZGVza3RvcD4=","inReplyToHeader":"PDhDOTY3RDNGMjQ2NzE3MC01MUMtNTZENkBGV00tUjE0LnN5c29wcy5hb2wuY29tPg==","referencesHeader":"PGQ2MC44MjM1MzRkLjMzN2M5NWRhQGFvbC5jb20+CSA8MDEyZDAxYzc5N2RmJDIyMGY1NWMwJDQwMDFhOGMwQERhdmlkPgkgPDExNzkzNjUxNTQuNjk3My4yNi5jYW1lbEBseWRpYS1kZXNrdG9wPgkgPDhDOTY3RDNGMjQ2NzE3MC01MUMtNTZENkBGV00tUjE0LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":23813,"nextInTopic":23823,"prevInTime":23821,"nextInTime":23823,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"I am usually asking them things like could you help me get you dressed so I can go to the store, doctor, park etc. I don t know what to do when they say no,","messageBody":"<div id=\"ygrps-yiv-1291335934\">I am usually asking them things like could you help me get you dressed<br/>\nso I can go to the store, doctor, park etc. I don&#39;t know what to do when<br/>\nthey say no, esp for the doctor my boy twin has neurology appts. twice a<br/>\nmonth. If I ask them to please not write on the walls or to stop<br/>\nthrowing their shoes it doesn&#39;t matter everything is no.<br/>\nAs for them saying no I am conflicted, we have to function and I can&#39;t<br/>\nleave them at home so I can go get groceries, etc. I don&#39;t think they<br/>\nshould be allowed to be destructive but I don&#39;t know how to stop it.<br/>\nThey don&#39;t have bed times and between them not going to bed until 2am or<br/>\nso and the behavioral issues I am exhausted. <br/>\nYes they can eat on the floor, but I prefer the table because when they<br/>\nthrow fits it is easier to clean on the had floor and it is not my<br/>\ncarpet to destroy.<br/>\nI don&#39;t know what to say or do anymore. I don&#39;t want to give up on them,<br/>\nbut I feel so helpless.</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] unschooling and domestic violence","postDate":"1179541462","msgId":23813,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOTY3RDNGMjQ2NzE3MC01MUMtNTZENkBGV00tUjE0LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PDExNzkzNjUxNTQuNjk3My4yNi5jYW1lbEBseWRpYS1kZXNrdG9wPg==","referencesHeader":"PGQ2MC44MjM1MzRkLjMzN2M5NWRhQGFvbC5jb20+CSA8MDEyZDAxYzc5N2RmJDIyMGY1NWMwJDQwMDFhOGMwQERhdmlkPiA8MTE3OTM2NTE1NC42OTczLjI2LmNhbWVsQGx5ZGlhLWRlc2t0b3A+"},"prevInTopic":23765,"nextInTopic":23822,"prevInTime":23812,"nextInTime":23814,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"... From: lydia_walker@comcast.net I am new to unschooling. My younger children are 6,4,4,2 I now have full custody of them.We left their father 18 months ago","messageBody":"<div id=\"ygrps-yiv-1738120954\">-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lydia_walker@...\">lydia_walker@...</a><br/>\n<br/>\n    I am new to unschooling. My younger children are 6,4,4,2 I now have <br/>\nfull<br/>\ncustody of them.We left their father 18 months ago stayed at a D.V<br/>\nshelter for 6 month and for the last year have been on are own. I was<br/>\nwondering if anyone else has been in this situation and if so how do you<br/>\ndeal with it. I am trying to let my kids be free to learn and explore I<br/>\ntry to follow their interest as much as I can. I have come to see that<br/>\nunschooling is also a lifestyle not just an educational choice. I am<br/>\nconflicted on how to deal with the children&#39;s behavioral issues I know<br/>\nmost of it is learned behavior. Whenever I ask them to do things the<br/>\nanswer is no usually followed by tantrums that involve some form of<br/>\ndestruction to property or myself. They refuse to eat at the table, they<br/>\ntalk back and are rude, to the point on being hurtful. I can&#39;t take them<br/>\nout without total chaos. I am I wrong to assume that it would be<br/>\ninappropriate to set rules. We have been in counseling since before I<br/>\nleft home. I am just confused in how to handle things. The therapist<br/>\nsuggested time-outs and loss of privileges. I however don&#39;t want to do<br/>\nthat. I think that we all have been through too much I don&#39;t want to<br/>\nlive that way they deserve to be kids and have choices. I know there has<br/>\nto be another way. Thanks for listening, any suggestion would be<br/>\nwelcome.<br/>\n<br/>\n-=-=-=-=<br/>\n<br/>\nI realize that you&#39;re going through a really tough time, but they are <br/>\nall still soooo little! I can only imagine what they&#39;ve been through al <br/>\nready in such short lives.<br/>\n<br/>\nI think they are simply doing the best they can under the <br/>\ncircumstances. They don&#39;t have many tools to tell you how they feel or <br/>\nwhat they need.<br/>\n<br/>\nI certainly don&#39;t think they need time-outs or loss of *anything*!!! <br/>\nThey need to be held and cuddled and allowed to express their feelings <br/>\n(which must be huge and complicated!).<br/>\n<br/>\nWhat kinds of things are you asking them to do? May they not say &quot;no&quot;? <br/>\nIs it really that you are *asking*? Or are you simply telling them what <br/>\nto do in the form of a question? Why must they eat at the table? Can&#39;t <br/>\nyou serve a picnic on the living room floor?<br/>\n<br/>\nLife must be *incredibly* hard for them right now.<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nAOL now offers free email to everyone.  Find out more about what&#39;s free <br/>\nfrom AOL at AOL.com.</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Our Fears","postDate":"1179405534","msgId":23765,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1MjYzNzJFQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":23753,"nextInTopic":23813,"prevInTime":23764,"nextInTime":23766,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"... swing by for a blast ice cream treat on our way home. Go ahead and rub it in for all of us who long for Sonic but would have to travel for days to find","messageBody":"<div id=\"ygrps-yiv-230284726\"><blockquote><span title=\"ireply\">&gt;Good news is the dentist is across the street from a Sonic -- we&#39;ll<br/>\n </span></blockquote>swing by for a blast ice cream treat on our way home.<br/>\n<br/>\nGo ahead and rub it in for all of us who long for Sonic but would have<br/>\nto travel for days to find one... &lt;grin&gt;<br/>\n <br/>\nDeb <br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":295439124,"authorName":"Julie Hampton","from":"&quot;Julie Hampton&quot; &lt;wisdom1133@...&gt;","profile":"hammy454","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] unschooling and domestic violence","postDate":"1179376815","msgId":23753,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEyMC1EQVYxMTYyREY2NjgxN0E1NDc0NjRFQTkxQzQzMzBAcGh4LmdibD4=","referencesHeader":"PGQ2MC44MjM1MzRkLjMzN2M5NWRhQGFvbC5jb20+IDwwMTJkMDFjNzk3ZGYkMjIwZjU1YzAkNDAwMWE4YzBARGF2aWQ+IDwxMTc5MzY1MTU0LjY5NzMuMjYuY2FtZWxAbHlkaWEtZGVza3RvcD4="},"prevInTopic":23743,"nextInTopic":23765,"prevInTime":23752,"nextInTime":23754,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"Try involving them in the rules/limits where do they want to eat, sleep, do.Talk talk talk to them- sounds like they and you have been through trauma that they","messageBody":"<div id=\"ygrps-yiv-23147134\">Try involving them in the rules/limits where do they want to eat, sleep, do.Talk talk talk to them- sounds like they and you have been through trauma that they do not know how to express let alone cope with. Let them help you make a list of things that are acceptable to your family. Things like listening to each other, no hurting with words or hands or property. It will prob be chaotic for a while while you learn to function as a family. Deep breath- pick your battles- a good book for me was- The explosive child- you can find it from the library.  Julie H  <br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: lydia walker&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lydia_walker@...\">lydia_walker@...</a>&gt; <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt; <br/>\n  Sent: Wednesday, May 16, 2007 7:25 PM<br/>\n  Subject: [unschoolingbasics] unschooling and domestic violence<br/>\n<br/>\n<br/>\n  I am new to unschooling. My younger children are 6,4,4,2 I now have full<br/>\n  custody of them.We left their father 18 months ago stayed at a D.V<br/>\n  shelter for 6 month and for the last year have been on are own. I was<br/>\n  wondering if anyone else has been in this situation and if so how do you<br/>\n  deal with it. I am trying to let my kids be free to learn and explore I<br/>\n  try to follow their interest as much as I can. I have come to see that<br/>\n  unschooling is also a lifestyle not just an educational choice. I am<br/>\n  conflicted on how to deal with the children&#39;s behavioral issues I know<br/>\n  most of it is learned behavior. Whenever I ask them to do things the<br/>\n  answer is no usually followed by tantrums that involve some form of<br/>\n  destruction to property or myself. They refuse to eat at the table, they<br/>\n  talk back and are rude, to the point on being hurtful. I can&#39;t take them<br/>\n  out without total chaos. I am I wrong to assume that it would be<br/>\n  inappropriate to set rules. We have been in counseling since before I<br/>\n  left home. I am just confused in how to handle things. The therapist<br/>\n  suggested time-outs and loss of privileges. I however don&#39;t want to do<br/>\n  that. I think that we all have been through too much I don&#39;t want to<br/>\n  live that way they deserve to be kids and have choices. I know there has<br/>\n  to be another way. Thanks for listening, any suggestion would be<br/>\n  welcome.<br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":285628717,"authorName":"thehomeopathicway","from":"&quot;thehomeopathicway&quot; &lt;thehomeopathicway@...&gt;","profile":"thehomeopathicway","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Our Fears","postDate":"1179365983","msgId":23740,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYyZ2JvditjajgxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDcwNTE2MTcxNy5sNEdISElMSzAyNTc3MkBvbXI1Lm5ldHdvcmtzb2x1dGlvbnNlbWFpbC5jb20+"},"prevInTopic":23727,"nextInTopic":23743,"prevInTime":23739,"nextInTime":23741,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"Just need to clear up the fact that raw garlic and goldenseal are not homeopathic remedies.  All remedies are tastless and are added to very small sugar pills","messageBody":"<div id=\"ygrps-yiv-1007538809\">Just need to clear up the fact that raw garlic and goldenseal are not <br/>\nhomeopathic remedies.  All remedies are tastless and are added to <br/>\nvery small sugar pills which disolve under the tounge or remedies are <br/>\nliquid and added to water with no taste at all.  Also, if classical <br/>\nhomeopathy was used to treat lyme, only one remedy would have been <br/>\nneeded, not a combination.  <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, marji &lt;marji@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; When Liam was really young (about 3, I guess),  he had Lyme <br/>\n&gt; disease.  His dad also, coincidentally, had Lyme at the same time <br/>\nand <br/>\n&gt; he was treating it (ultimately, successfully) with alternative <br/>\n&gt; medicine.  The doc I was using could have treated Liam <br/>\n&gt; homeopathically or allopathically, the choice was ours to <br/>\n&gt; make.  Jimmy was having to take a ton of nasty-tasting remedies <br/>\neight <br/>\n&gt; times a day, including raw garlic and goldenseal, and he was also <br/>\n&gt; enduring second-stage Lyme, which was very painful.  Because Liam&#39;s <br/>\n&gt; titers were so high, the doc strongly recommended the allopathic <br/>\n&gt; route (antibiotics) with complementary homeopathic therapy to <br/>\nsupport <br/>\n&gt; him through it.<br/>\n&gt; <br/>\n&gt; At that time, Liam had never had refined sugar in his young life, <br/>\nand <br/>\n&gt; he really balked at the amoxicillin, which he had to take for three <br/>\n&gt; weeks.  Although he didn&#39;t like it at all for about the first week <br/>\n&gt; and a half, I was honest with him about the alternatives for <br/>\ntreating <br/>\n&gt; it (I didn&#39;t scare him or make it seem like it was gloom or doom; I <br/>\n&gt; presented the medication to him as a choice he could make, along <br/>\nwith <br/>\n&gt; other choices, such as treating it the way Jimmy was doing it, and <br/>\n&gt; not treating it at all, and what the various outcomes would likely <br/>\n&gt; be).  He opted, as I hoped he would, for the meds, and for the <br/>\nfirst <br/>\n&gt; week and a half, he hated the amox, but then (unfortunately) it <br/>\ngrew <br/>\n&gt; on him.  He also took the complementary stuff (including the <br/>\n&gt; probiotic), and he did great!<br/>\n&gt; <br/>\n&gt; He got Lyme again about two years later, and he was cool with the <br/>\n&gt; whole thing (even drawing the blood, which he regarded with <br/>\n&gt; curiosity; the phlebotomist allowed Liam to sit on me both times, <br/>\nand <br/>\n&gt; Liam had always accompanied me to donate blood, so it wasn&#39;t too <br/>\n&gt; strange to him).  But, his doc was really great and always spoke to <br/>\n&gt; Liam with the same respect he would to me.  I think that feeling <br/>\nthat <br/>\n&gt; kind of respect  from his doc and from us made all the difference <br/>\nfor Liam.<br/>\n&gt; <br/>\n&gt; I hope that helps a little, and I wish you guys all the best!!<br/>\n&gt; <br/>\n&gt; ~Marji<br/>\n&gt; <br/>\n&gt; At 12:40 5/16/2007, you wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt;In a message dated 5/16/2007 9:50:18 AM Eastern Standard Time,<br/>\n&gt; &gt;sylgt04@... writes:<br/>\n&gt; &gt;<br/>\n&gt; &gt;About the meds -- they gave you pills for a 3yo? Would she take a <br/>\nliquid med?<br/>\n&gt; &gt;I remember that augmentin can be mixed into almost any flavor. <br/>\nAnother option<br/>\n&gt; &gt;might be IV antiobiotix at home, or even IM (intra-muscular) shots <br/>\n&gt; &gt;at home. ...<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":275660928,"authorName":"lydia walker","from":"lydia walker &lt;lydia_walker@...&gt;","profile":"wlkr_lyd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling and domestic violence","postDate":"1179365154","msgId":23743,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExNzkzNjUxNTQuNjk3My4yNi5jYW1lbEBseWRpYS1kZXNrdG9wPg==","inReplyToHeader":"PDAxMmQwMWM3OTdkZiQyMjBmNTVjMCQ0MDAxYThjMEBEYXZpZD4=","referencesHeader":"PGQ2MC44MjM1MzRkLjMzN2M5NWRhQGFvbC5jb20+CSA8MDEyZDAxYzc5N2RmJDIyMGY1NWMwJDQwMDFhOGMwQERhdmlkPg=="},"prevInTopic":23740,"nextInTopic":23753,"prevInTime":23742,"nextInTime":23744,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"I am new to unschooling. My younger children are 6,4,4,2 I now have full custody of them.We left their father 18 months ago stayed at a D.V shelter for 6 month","messageBody":"<div id=\"ygrps-yiv-984691141\">I am new to unschooling. My younger children are 6,4,4,2 I now have full<br/>\ncustody of them.We left their father 18 months ago stayed at a D.V<br/>\nshelter for 6 month and for the last year have been on are own. I was<br/>\nwondering if anyone else has been in this situation and if so how do you<br/>\ndeal with it. I am trying to let my kids be free to learn and explore I<br/>\ntry to follow their interest as much as I can. I have come to see that<br/>\nunschooling is also a lifestyle not just an educational choice. I am<br/>\nconflicted on how to deal with the children&#39;s behavioral issues I know<br/>\nmost of it is learned behavior. Whenever I ask them to do things the<br/>\nanswer is no usually followed by tantrums that involve some form of<br/>\ndestruction to property or myself. They refuse to eat at the table, they<br/>\ntalk back and are rude, to the point on being hurtful. I can&#39;t take them<br/>\nout without total chaos. I am I wrong to assume that it would be<br/>\ninappropriate to set rules. We have been in counseling since before I<br/>\nleft home. I am just confused in how to handle things. The therapist<br/>\nsuggested time-outs and loss of privileges. I however don&#39;t want to do<br/>\nthat. I think that we all have been through too much I don&#39;t want to<br/>\nlive that way they deserve to be kids and have choices. I know there has<br/>\nto be another way. Thanks for listening, any suggestion would be<br/>\nwelcome.</div>","specialLinks":[]},{"userId":299286442,"authorName":"Cameron Parham","from":"Cameron Parham &lt;acsp2205@...&gt;","profile":"acsp2205","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Our Fears","postDate":"1179344674","msgId":23724,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwNzk3Ny4xMTc2Mi5xbUB3ZWI1OTIxMy5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":23716,"nextInTopic":23727,"prevInTime":23723,"nextInTime":23725,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"I think that in this kind of time emotions run so high that it is hard to think clearly. I have seen bites from a pit bull and am so sorry. I would guess your","messageBody":"<div id=\"ygrps-yiv-1405746674\">I think that in this kind of time emotions run so high that it is hard to think clearly. I have seen bites from a pit bull and am so sorry. I would guess your dd is emotionally traumatized and if you force her strenuously she could feel assaulted again. Is she able to reason at all? Can you become her ally to reach an outcome which she is invested in and desires?  Can the antibiotics be seen as one of her tools to get where she wants to be (healthy and as unscarred in every way as possible)?  Cameron<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":103804653,"authorName":"rn9302000","from":"&quot;rn9302000&quot; &lt;rn930@...&gt;","profile":"rn9302000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Our Fears","postDate":"1179338448","msgId":23727,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYyZmdzZytqaHFnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE1NzU3Ni45NzYyOC5xbUB3ZWI1MzgwNi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":23724,"nextInTopic":23740,"prevInTime":23726,"nextInTime":23728,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"This is the nurse in me speaking also. I would do everything possible to get the meds in her. can you get the liquid reflavored into something of her choice? ","messageBody":"<div id=\"ygrps-yiv-994436451\">This is the nurse in me speaking also. I would do everything possible<br/>\nto get the meds in her. <br/>\ncan you get the liquid reflavored into something of her choice?<br/>\nhow about smoothie drinks, does she like those? you could put the med<br/>\ninto the smoothie.....or any special sweet drink she likes?<br/>\nhow about ice cream?<br/>\ngood luck!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Sylvia Toyama &lt;sylgt04@...&gt;<br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; My 3.5 year old was attacked by a pit bull on Monday night. She is<br/>\n </span></blockquote>refusing <br/>\n<blockquote><span title=\"ireply\"> &gt; all medication, antibiotics, motrin, etc. She has been taking arnica<br/>\n </span></blockquote>and has <br/>\n<blockquote><span title=\"ireply\"> &gt; let us put calendula cream on her stitches but she is clearly in<br/>\n </span></blockquote>pain -- <br/>\n<blockquote><span title=\"ireply\"> &gt; throwing things, slamming things, extremely cranky and violent, etc.<br/>\n </span></blockquote>She is <br/>\n<blockquote><span title=\"ireply\"> &gt; usually a gentle angel. I just spoke with her ped who informed me<br/>\n </span></blockquote>that the risk of <br/>\n<blockquote><span title=\"ireply\"> &gt; infection is great and that we &quot;MUST get antibiotics into her body <br/>\n&gt; immediately. &quot; Yesterday I made Augmentin popsicles, mixed crushed<br/>\n </span></blockquote>tablets into ice <br/>\n<blockquote><span title=\"ireply\"> &gt; cream, pudding, jello, etc. I&#39;ve reduced myself to threatening to<br/>\n </span></blockquote>hold her down <br/>\n<blockquote><span title=\"ireply\"> &gt; (due to my own fears) in order to get the Augmentin in her body but<br/>\n </span></blockquote>haven&#39;t gone <br/>\n<blockquote><span title=\"ireply\"> &gt; there.<br/>\n&gt;    <br/>\n&gt;   *****<br/>\n&gt;    <br/>\n&gt;   What an ordeal for all of you!  I can understand why she&#39;d be<br/>\n </span></blockquote>cranky and violent -- more than just the physical pain, is the sheer<br/>\nterror she must have felt with the attack.  I&#39;d expect the crankies to<br/>\ncontinue for some time.  <br/>\n<blockquote><span title=\"ireply\"> &gt;    <br/>\n&gt;   Given the severity of her injuries and the infection risk at<br/>\n </span></blockquote>hospital ER&#39;s and also once she&#39;s home, along with the dog germies,<br/>\nI&#39;d definitely do all I could to get the meds into her.<br/>\n<blockquote><span title=\"ireply\"> &gt;    <br/>\n&gt;   About the meds --  they gave you pills for a 3yo?  Would she take<br/>\n </span></blockquote>a liquid med?  I remember that augmentin can be mixed into almost any<br/>\nflavor.  Another option might be IV antiobiotix at home, or even IM<br/>\n(intra-muscular) shots at home.  When Andy came home from the hospital<br/>\nas a newborn, he was on IV anti-bios.  The hospital wanted to train me<br/>\nto do his meds thru a heparin port, but I insisted they send a home<br/>\nnurse out to do it for us.  Poor little guy had had so many IV&#39;s in<br/>\nhis first four days that most of his veins were unusable for more<br/>\nports.  On his second day at home, the &#39;last vein option&#39; for homecare<br/>\ncollapsed, and the docs wanted him back in NICU. The home nurse (an<br/>\nabsolute angel, that woman) argued with the doctor that Andy would do<br/>\nbetter at home where he could still nurse on demand, getting IM shots<br/>\nthan going back to NICU.  She came by twice a day and did the shots<br/>\nfor him, which meant he stayed home.  <br/>\n<blockquote><span title=\"ireply\"> &gt;    <br/>\n&gt;   I&#39;d ask about IV meds you (or a nurse) could administer at home,<br/>\n </span></blockquote>or shots, even if that meant daily trips to the doctor&#39;s office or<br/>\nhome visits by a nurse. <br/>\n<blockquote><span title=\"ireply\"> &gt;    <br/>\n&gt;   Sylvia<br/>\n&gt;     <br/>\n&gt;    <br/>\n&gt;    <br/>\n&gt; <br/>\n&gt;        <br/>\n&gt; ---------------------------------<br/>\n&gt; Boardwalk for $500? In 2007? Ha! <br/>\n&gt; Play Monopoly Here and Now (it&#39;s updated for today&#39;s economy) at<br/>\n </span></blockquote>Yahoo! Games.<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Our Fears","postDate":"1179337821","msgId":23716,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxOTg1Ny40NjM5MS5xbUB3ZWI1MzgxMi5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGM1ZS4xNTA0ODI5ZS4zMzdjOTk2YUBhb2wuY29tPg=="},"prevInTopic":23715,"nextInTopic":23724,"prevInTime":23715,"nextInTime":23717,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"After all that stress, sweet Madison walked in and said: Okay, I ll take it one time. She gulped down the liquid and then ate a handful of m & m s and topped","messageBody":"<div id=\"ygrps-yiv-100231176\">After all that stress, sweet Madison walked in and said: Okay, I&#39;ll take it <br/>\none time. She gulped down the liquid and then ate a handful of m & m&#39;s and <br/>\ntopped those off with a can of whipped cream. <br/>\n<br/>\n****<br/>\n  Way to go, Madison!  Just keep a big supply of chocolate and whipped cream on hand.  I like Kelly&#39;s skittles idea, too.    <br/>\n   <br/>\n  I should pop out now and get some whipped cream for Dan -- he just called me from an overnight at a friend&#39;s house to say he&#39;d lost a crown (again!).  I called the dentist and we&#39;ll go by at 4 to have it put back on/in.  Last time this happened, putting it back on was a real ordeal and he needed some sweet treat after to make it more survivable.  Good news is the dentist is across the street from a Sonic -- we&#39;ll swing by for a blast ice cream treat on our way home.<br/>\n   <br/>\n  Dan has five crowns total, and overall he&#39;s been a trooper about it, but man this sucks.<br/>\n   <br/>\n  Sylvia<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nBe a better Heartthrob. Get better relationship answers from someone who knows.<br/>\nYahoo! Answers - Check it out. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Our Fears","postDate":"1179337099","msgId":23715,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcyMTg1MC4zNTcxNy5xbUB3ZWI1MzgwNC5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGNjNi4xMTlkNGRiYS4zMzdjOTFhM0Bhb2wuY29tPg=="},"prevInTopic":23713,"nextInTopic":23716,"prevInTime":23714,"nextInTime":23716,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"I have considered whether my desire to have the antibiotics in her body is coming from my fear or where but the truth is -- the wounds look like they could","messageBody":"<div id=\"ygrps-yiv-1956529351\">I have considered whether my desire to have the antibiotics in her body <br/>\nis coming from my fear or where but the truth is -- the wounds look like they <br/>\ncould become infected. Her face is a mess and I feel like she needs to avoid <br/>\nfurther physical problems at this point by preventing infection. <br/>\n<br/>\nAny ideas on how to kindly help her understand why we want her to take the <br/>\nmeds without talking about all the scary horrors and my fears? I tried the <br/>\n&quot;have to&quot; suggestion and her response was that she doesn&#39;t have to. <br/>\n<br/>\n****<br/>\n  Something else to consider -- not to add to your stress -- but because bites are generally documented by the authorities, and your daughter is now being &#39;tracked&#39; by a doctor -- you could find yourself in danger of being reported for neglect if you choose not to force the meds into her, or if by repecting her autonomy the docs feel you&#39;re not being responsible enough as a parent.<br/>\n   <br/>\n  Sylvia  <br/>\n<br/>\n <br/>\n---------------------------------<br/>\nFinding fabulous fares is fun.<br/>\nLet Yahoo! FareChase search your favorite travel sites to find flight and hotel bargains.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2346607,"authorName":"ohpurple1@aol.com","from":"ohpurple1@...","profile":"openmindedfamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Our Fears","postDate":"1179336554","msgId":23713,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM1ZS4xNTA0ODI5ZS4zMzdjOTk2YUBhb2wuY29tPg=="},"prevInTopic":23712,"nextInTopic":23715,"prevInTime":23712,"nextInTime":23714,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"After all that stress, sweet Madison walked in and said:  Okay, I ll take it one time.  She gulped down the liquid and then ate a handful of m & m s and topped","messageBody":"<div id=\"ygrps-yiv-222349177\">After all that stress, sweet Madison walked in and said:  Okay, I&#39;ll take it <br/>\none time.  She gulped down the liquid and then ate a handful of m & m&#39;s and <br/>\ntopped those off with a can of whipped cream.  <br/>\n <br/>\n*I* feel so much better!  I guess she just needed time to process all the <br/>\ninformation we shared with her.  <br/>\n <br/>\nMarji,<br/>\n <br/>\nI&#39;d love more info on what alternative treatments were successful in treating <br/>\nthe Lyme.  Will you please e-mail me off list?  <br/>\n <br/>\nThanks,<br/>\nRobin<br/>\n<br/>\n<br/>\n<br/>\n************************************** See what&#39;s free at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com\">http://www.aol.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":280852700,"authorName":"Schuyler","from":"&quot;Schuyler&quot; &lt;s.waynforth@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] RE: Our Fears","postDate":"1179336298","msgId":23712,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMmQwMWM3OTdkZiQyMjBmNTVjMCQ0MDAxYThjMEBEYXZpZD4=","referencesHeader":"PGQ2MC44MjM1MzRkLjMzN2M5NWRhQGFvbC5jb20+"},"prevInTopic":23711,"nextInTopic":23713,"prevInTime":23711,"nextInTime":23713,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"Simon had an ear infection once that he was given antibiotics for. I remember building an advent calendar for the different doses of antibiotics. David went to","messageBody":"<div id=\"ygrps-yiv-400755006\">Simon had an ear infection once that he was given antibiotics for. I <br/>\nremember building an advent calendar for the different doses of antibiotics. <br/>\nDavid went to the dollar store and stocked the calendar full. It was clearly <br/>\nbribery, but I was then, and would still be now, fine with bribing him. He <br/>\ngot to open a door whenever it was time for a dose. Maybe you could do <br/>\nstraight out trades with your daughter?<br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ohpurple1@...\">ohpurple1@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nSent: Wednesday, May 16, 2007 6:14 PM<br/>\nSubject: [unschoolingbasics] RE: Our Fears<br/>\n<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; In a message dated 5/16/2007 11:43:58 AM Eastern Standard Time, debra<br/>\n&gt; .<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rossing@...\">rossing@...</a> writes:<br/>\n&gt;<br/>\n&gt; One thing I might do, in addition to the arnica she&#39;s taking, is try<br/>\n&gt; something like Rescue Remedy or one/a couple of the more specific Bach<br/>\n&gt; essences that are for trauma, anxiety, etc<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ~~~~~~<br/>\n&gt;<br/>\n&gt; That&#39;s brilliant!  I have a collection of Bach remedies; I&#39;ll go research<br/>\n&gt; which ones are recommended for this type of situation and we both just <br/>\n&gt; took some<br/>\n&gt; rescue remedy.  Thanks for the reminder!<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; In a message dated 5/16/2007 11:48:55 AM Eastern Standard Time,<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:thehomeopathicway@...\">thehomeopathicway@...</a> writes:<br/>\n&gt;<br/>\n&gt; First, perhaps your homeopath (who I<br/>\n&gt; assume has taken your dd&#39;s case) can give her something to calm<br/>\n&gt; down.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ~~~~~~<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Our homeopath recommended arnica and calendula for Madison.  She is <br/>\n&gt; treating<br/>\n&gt; her huge, swollen face and said that the arnica would also help with the<br/>\n&gt; traumatic effects and help alleviate her pain.  I&#39;ll run the other ideas <br/>\n&gt; by her and<br/>\n&gt; ask her about what might help me.<br/>\n&gt;<br/>\n&gt; Thanks!<br/>\n&gt;<br/>\n&gt; Robin, soothed by the reminder that all is well.  I know it is but I <br/>\n&gt; forgot<br/>\n&gt; for a brief moment and got caught up in the fears and urgency presented by <br/>\n&gt; the<br/>\n&gt; on call pediatrician this morning.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ************************************** See what&#39;s free at <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com\">http://www.aol.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":96545052,"authorName":"marji","from":"marji &lt;marji@...&gt;","profile":"gaia10921","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Our Fears","postDate":"1179335694","msgId":23711,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwNTE2MTcxNy5sNEdISElMSzAyNTc3MkBvbXI1Lm5ldHdvcmtzb2x1dGlvbnNlbWFpbC5jb20+","inReplyToHeader":"PGM3ZS45Y2I4MTE5LjMzN2M4ZGVjQGFvbC5jb20+","referencesHeader":"PGM3ZS45Y2I4MTE5LjMzN2M4ZGVjQGFvbC5jb20+"},"prevInTopic":23709,"nextInTopic":23712,"prevInTime":23710,"nextInTime":23712,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"When Liam was really young (about 3, I guess),  he had Lyme disease.  His dad also, coincidentally, had Lyme at the same time and he was treating it","messageBody":"<div id=\"ygrps-yiv-1421807019\">When Liam was really young (about 3, I guess),  he had Lyme <br/>\ndisease.  His dad also, coincidentally, had Lyme at the same time and <br/>\nhe was treating it (ultimately, successfully) with alternative <br/>\nmedicine.  The doc I was using could have treated Liam <br/>\nhomeopathically or allopathically, the choice was ours to <br/>\nmake.  Jimmy was having to take a ton of nasty-tasting remedies eight <br/>\ntimes a day, including raw garlic and goldenseal, and he was also <br/>\nenduring second-stage Lyme, which was very painful.  Because Liam&#39;s <br/>\ntiters were so high, the doc strongly recommended the allopathic <br/>\nroute (antibiotics) with complementary homeopathic therapy to support <br/>\nhim through it.<br/>\n<br/>\nAt that time, Liam had never had refined sugar in his young life, and <br/>\nhe really balked at the amoxicillin, which he had to take for three <br/>\nweeks.  Although he didn&#39;t like it at all for about the first week <br/>\nand a half, I was honest with him about the alternatives for treating <br/>\nit (I didn&#39;t scare him or make it seem like it was gloom or doom; I <br/>\npresented the medication to him as a choice he could make, along with <br/>\nother choices, such as treating it the way Jimmy was doing it, and <br/>\nnot treating it at all, and what the various outcomes would likely <br/>\nbe).  He opted, as I hoped he would, for the meds, and for the first <br/>\nweek and a half, he hated the amox, but then (unfortunately) it grew <br/>\non him.  He also took the complementary stuff (including the <br/>\nprobiotic), and he did great!<br/>\n<br/>\nHe got Lyme again about two years later, and he was cool with the <br/>\nwhole thing (even drawing the blood, which he regarded with <br/>\ncuriosity; the phlebotomist allowed Liam to sit on me both times, and <br/>\nLiam had always accompanied me to donate blood, so it wasn&#39;t too <br/>\nstrange to him).  But, his doc was really great and always spoke to <br/>\nLiam with the same respect he would to me.  I think that feeling that <br/>\nkind of respect  from his doc and from us made all the difference for Liam.<br/>\n<br/>\nI hope that helps a little, and I wish you guys all the best!!<br/>\n<br/>\n~Marji<br/>\n<br/>\nAt 12:40 5/16/2007, you wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;In a message dated 5/16/2007 9:50:18 AM Eastern Standard Time,<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sylgt04@...\">sylgt04@...</a> writes:<br/>\n&gt;<br/>\n&gt;About the meds -- they gave you pills for a 3yo? Would she take a liquid med?<br/>\n&gt;I remember that augmentin can be mixed into almost any flavor. Another option<br/>\n&gt;might be IV antiobiotix at home, or even IM (intra-muscular) shots <br/>\n&gt;at home. ...<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2346607,"authorName":"ohpurple1@aol.com","from":"ohpurple1@...","profile":"openmindedfamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"RE: Our Fears","postDate":"1179335642","msgId":23709,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ2MC44MjM1MzRkLjMzN2M5NWRhQGFvbC5jb20+"},"prevInTopic":23708,"nextInTopic":23711,"prevInTime":23708,"nextInTime":23710,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/16/2007 11:43:58 AM Eastern Standard Time, debra .rossing@mastercam.com writes: One thing I might do, in addition to the arnica she s","messageBody":"<div id=\"ygrps-yiv-2136512990\">In a message dated 5/16/2007 11:43:58 AM Eastern Standard Time, debra<br/>\n.<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rossing@...\">rossing@...</a> writes:<br/>\n<br/>\nOne thing I might do, in addition to the arnica she&#39;s taking, is try<br/>\nsomething like Rescue Remedy or one/a couple of the more specific Bach<br/>\nessences that are for trauma, anxiety, etc<br/>\n<br/>\n<br/>\n <br/>\n <br/>\n <br/>\n~~~~~~<br/>\n <br/>\nThat&#39;s brilliant!  I have a collection of Bach remedies; I&#39;ll go research <br/>\nwhich ones are recommended for this type of situation and we both just took some <br/>\nrescue remedy.  Thanks for the reminder!<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\nIn a message dated 5/16/2007 11:48:55 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:thehomeopathicway@...\">thehomeopathicway@...</a> writes:<br/>\n<br/>\nFirst, perhaps your homeopath (who I <br/>\nassume has taken your dd&#39;s case) can give her something to calm <br/>\ndown. <br/>\n <br/>\n <br/>\n~~~~~~<br/>\n <br/>\n <br/>\nOur homeopath recommended arnica and calendula for Madison.  She is treating <br/>\nher huge, swollen face and said that the arnica would also help with the <br/>\ntraumatic effects and help alleviate her pain.  I&#39;ll run the other ideas by her and <br/>\nask her about what might help me.<br/>\n <br/>\nThanks!<br/>\n <br/>\nRobin, soothed by the reminder that all is well.  I know it is but I forgot <br/>\nfor a brief moment and got caught up in the fears and urgency presented by the <br/>\non call pediatrician this morning.<br/>\n<br/>\n<br/>\n<br/>\n************************************** See what&#39;s free at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com\">http://www.aol.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":198317027,"authorName":"Becca","from":"Becca &lt;angel_eyes_becca_and_hannah@...&gt;","profile":"angeleyesgroup","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Our Fears","postDate":"1179335575","msgId":23708,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzNDkyNS4yMTU2OC5xbUB3ZWIzMTQwMi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGNjNi4xMTlkNGRiYS4zMzdjOTFhM0Bhb2wuY29tPg=="},"prevInTopic":23706,"nextInTopic":23709,"prevInTime":23707,"nextInTime":23709,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"This is the Nurse in me talking.    I agree with how bad you are explanning the wounds she deffiently needs the antibiotics.....  Personally if she wont take","messageBody":"<div id=\"ygrps-yiv-654664787\">This is the Nurse in me talking.    I agree with how bad you are explanning the wounds she deffiently needs the antibiotics.....  Personally if she wont take the meds by mouth some antibiotics can be given rectally I know its not something that is wanted to be done but to get the meds in her if it was the only way then I would personally do it.  Infections like that can turn deathly I hate to say.  I had my best friend recently die from a broken foot that turned into staff infection.  Not only is that one bad but you also have MRSA out there too not good infections to take a chance on.  No Im not trying to scare you at all just giving my personal Nursing advice.<br/>\n  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ohpurple1@...\">ohpurple1@...</a> wrote:<br/>\n          <br/>\nIn a message dated 5/16/2007 11:01:58 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wisdom1133@...\">wisdom1133@...</a> writes:<br/>\n<br/>\nIf she does not have an infection then the antibotics are just in case. <br/>\n<br/>\nExactly and in the past, we&#39;ve always gone the watch and wait route but this <br/>\ntime my instincts are screaming to me otherwise. She was at a party when this <br/>\nhappened. The kids had all been playing near a dead rat that the cat had <br/>\nbrought home. The dog had been batting the rat around, too. Madison&#39;s face was <br/>\nfilthy, the wounds are deep and the dog tore the skin off her cheek so that is <br/>\nnot only deep but is rather large as well. She has several other wounds as <br/>\nwell, stitches in three places and two deep puncture wounds. The hospital was <br/>\nfilthy and full of sick and injured children. The staff was repeatedly <br/>\ncareless with regard to universal precautions, etc. My gut tells me that she needs <br/>\nthe antibiotics so I&#39;m looking for respectful ways to help us get them into her <br/>\nbody. I have considered whether my desire to have the antibiotics in her body <br/>\nis coming from my fear or where but the truth is -- the wounds look like they <br/>\ncould become infected. Her face is a mess and I feel like she needs to avoid <br/>\nfurther physical problems at this point by preventing infection. <br/>\n<br/>\nAny ideas on how to kindly help her understand why we want her to take the <br/>\nmeds without talking about all the scary horrors and my fears? I tried the <br/>\n&quot;have to&quot; suggestion and her response was that she doesn&#39;t have to. <br/>\n<br/>\n************************************** See what&#39;s free at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com\">http://www.aol.com</a><br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n         <br/>\n<br/>\n <br/>\n---------------------------------<br/>\nBe a PS3 game guru.<br/>\nGet your game face on with the latest PS3 news and previews at Yahoo! Games.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"&quot;Melissa&quot; &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Our Fears","postDate":"1179335043","msgId":23706,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYyZmRpMytnaDgyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNmNi4xMDNhZTI0MS4zMzdjNTU0M0Bhb2wuY29tPg=="},"prevInTopic":23705,"nextInTopic":23708,"prevInTime":23705,"nextInTime":23707,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"First of all, I m sorry for all the trauma your whole family is going through. I m sure your daughter is twice as shocked, esp reading follow up posts where","messageBody":"<div id=\"ygrps-yiv-2053577390\">First of all, I&#39;m sorry for all the trauma your whole family is going through. I&#39;m sure your <br/>\ndaughter is twice as shocked, esp reading follow up posts where she has never been <br/>\nforced to do anything against her will, and a dog biting you against your will is pretty <br/>\nmuch the ultimate insult.<br/>\nNext, i would ask why you assume that informing your daughter of the possibility of <br/>\ninfection as &#39;passing on fears&#39;? It is probable that this will happen, to some extent. I would <br/>\nsay it&#39;s far more respectful to tell her and let her make an educated choice, Wounds of this <br/>\ntype are prone to infection, an infection is the body&#39;s way of fighting germs that don&#39;t <br/>\nbelong there. Those germs came from the dog, and probably some from the other sick <br/>\npeople at the hospital. If there are too many infection causing germs, it could make you <br/>\nmuch more sick and it would hurt worse than it does now. <br/>\nOf course, how you phrase it depends on your daughter&#39;s understanding, but we&#39;ve kind of <br/>\nalways presented it as a choice. I just don&#39;t see it as passing on fear, it&#39;s not unreasonable, <br/>\nit&#39;s realistic. What are you going to do when she doesn&#39;t want the IV either? <br/>\nMy daughter was seven last year, so a bit older, but something similar. A spider bite <br/>\nallowed for the introduction of staph bacteria, and she wound up with an abcess behind <br/>\nher knee, with MRSA. There was one way that the doctor wanted to handle it, straight to <br/>\nsurgery to pull back skin and muscle, flush the entire wound and restitch. *I* personally <br/>\ndid not want that for her, but after talking to the dr there were some alternatives. She <br/>\nchose to have it drained in the office, without painkillers because it would be the quickest <br/>\nway to handle it. She also chose to take the antibiotics because the dr explained that it <br/>\nwas very unlikely that it would heal without surgery. She wanted to take the antibiotics, <br/>\nand she chose a rather painful course, having the abcess drained, and several days at <br/>\nhome of draining, because she was educated to the alternatives, and she was able to <br/>\nchoose.<br/>\nI think i&#39;d say quite reasonably, here are the choices and some possible outcomes. I know <br/>\nthey all suck, but we need to pick one pretty soon before an infection sets in and gets out <br/>\nof hand.<br/>\nMelissa<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, ohpurple1@... wrote:<br/>\n&gt; How have other unschoolers handled this in a respectful way?  I don&#39;t want to <br/>\n&gt; pass my own fears onto her (I&#39;m sure I already am, though) by explaining <br/>\n&gt; infection and the possibility of us having to stay at the hospital, but these <br/>\n&gt; thoughts are running rampant in my head.  Her face is a mess and the Hasbro <br/>\n&gt; Children&#39;s Hospital where she was stitched was a filthy, disgusting place so I know <br/>\n&gt; she was exposed to germs and crap during our 10 hours there.  I am truly <br/>\n&gt; terrified for her and I would feel much better if she had the antibiotics in her <br/>\n&gt; little body.  Any ideas would be greatly appreciated.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":2346607,"authorName":"ohpurple1@aol.com","from":"ohpurple1@...","profile":"openmindedfamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Our Fears","postDate":"1179334563","msgId":23705,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNi4xMTlkNGRiYS4zMzdjOTFhM0Bhb2wuY29tPg=="},"prevInTopic":23703,"nextInTopic":23706,"prevInTime":23704,"nextInTime":23706,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/16/2007 11:01:58 AM Eastern Standard Time, wisdom1133@hotmail.com writes: If she does not have an infection then the antibotics are just","messageBody":"<div id=\"ygrps-yiv-489145976\">In a message dated 5/16/2007 11:01:58 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wisdom1133@...\">wisdom1133@...</a> writes:<br/>\n<br/>\nIf she does not have an infection then the antibotics are just in case. <br/>\n<br/>\n <br/>\n <br/>\n <br/>\nExactly and in the past, we&#39;ve always gone the watch and wait route but this <br/>\ntime my instincts are screaming to me otherwise.  She was at a party when this <br/>\nhappened.  The kids had all been playing near a dead rat that the cat had <br/>\nbrought home.  The dog had been batting the rat around, too.  Madison&#39;s face was <br/>\nfilthy, the wounds are deep and the dog tore the skin off her cheek so that is <br/>\nnot only deep but is rather large as well.  She has several other wounds as <br/>\nwell, stitches in three places and two deep puncture wounds. The hospital was <br/>\nfilthy and full of sick and injured children.  The staff was repeatedly <br/>\ncareless with regard to universal precautions, etc. My gut tells me that she needs <br/>\nthe antibiotics so I&#39;m looking for respectful ways to help us get them into her <br/>\nbody.  I have considered whether my desire to have the antibiotics in her body <br/>\nis coming from my fear or where but the truth is -- the wounds look like they <br/>\ncould become infected.  Her face is a mess and I feel like she needs to avoid <br/>\nfurther physical problems at this point by preventing infection.  <br/>\n <br/>\nAny ideas on how to kindly help her understand why we want her to take the <br/>\nmeds without talking about all the scary horrors and my fears?  I tried the <br/>\n&quot;have to&quot; suggestion and her response was that she doesn&#39;t have to. <br/>\n<br/>\n<br/>\n<br/>\n************************************** See what&#39;s free at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com\">http://www.aol.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":285628717,"authorName":"thehomeopathicway","from":"&quot;thehomeopathicway&quot; &lt;thehomeopathicway@...&gt;","profile":"thehomeopathicway","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Our Fears","postDate":"1179334006","msgId":23703,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYyZmNobSs0ZGExQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNmNi4xMDNhZTI0MS4zMzdjNTU0M0Bhb2wuY29tPg=="},"prevInTopic":23702,"nextInTopic":23705,"prevInTime":23702,"nextInTime":23704,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"Hi Robyn, I am a homeopath in California.  I won t tell you that homeopathy can or cant prevent infection.  It would depend on too many variables. Some","messageBody":"<div id=\"ygrps-yiv-1938983002\">Hi Robyn,<br/>\n<br/>\nI am a homeopath in California.  I won&#39;t tell you that homeopathy can <br/>\nor cant prevent infection.  It would depend on too many variables.  <br/>\nSome possible suggestions are:  First, perhaps your homeopath (who I <br/>\nassume has taken your dd&#39;s case) can give her something to calm <br/>\ndown.  Perhaps she needs ledum (for puncture wounds), or Lys. (rabies <br/>\nfor anger caused by the whole experience) or aconite (for shock and <br/>\nfear).  I would also recommend that you talk to your homeopath about <br/>\ntreating you for shock and fear.  <br/>\nIf all else fails, perhaps you and her could take rescue remedy and <br/>\nthen try to get her to take the antibiotics after a few doses.<br/>\n<br/>\nI am sending you lots of good energy and knowing that all is well.<br/>\n<br/>\nin peace,<br/>\nDianna Glick, CHom <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, ohpurple1@... wrote:<br/>\n&gt;<br/>\n&gt; My 3.5 year old was attacked by a pit bull on Monday night.  She is <br/>\nrefusing <br/>\n&gt; all medication, antibiotics, motrin, etc.  She has been taking <br/>\narnica and has <br/>\n&gt; let us put calendula cream on her stitches but she is clearly in <br/>\npain -- <br/>\n&gt; throwing things, slamming things, extremely cranky and violent, <br/>\netc.  She is <br/>\n&gt; usually a gentle angel.  I just spoke with her ped who informed me <br/>\nthat the risk of <br/>\n&gt; infection is great and that we &quot;MUST get antibiotics into her body <br/>\n&gt; immediately.&quot;  Yesterday I made Augmentin popsicles, mixed crushed <br/>\ntablets into ice <br/>\n&gt; cream, pudding, jello, etc.  I&#39;ve reduced myself to threatening to <br/>\nhold her down <br/>\n&gt; (due to my own fears) in order to get the Augmentin in her body but <br/>\nhaven&#39;t gone <br/>\n&gt; there.  I was concerned yesterday but because she had had IV <br/>\nAugmentin in the <br/>\n&gt; ER on Monday night I thought she was covered for 24 hours so <br/>\nalthough we <br/>\n&gt; tried all day to get her to take it, we didn&#39;t push it. The Dr. <br/>\nsaid that IV <br/>\n&gt; Augmentin is not a 24 hour drug and that she is at great risk for <br/>\ninfection and <br/>\n&gt; that there is NO choice but to take her to the hospital and get <br/>\nthem in <br/>\n&gt; intravenously.  Madison has about 30 stitches in her face, lips and <br/>\neye and has two <br/>\n&gt; deep puncture wounds above her eye and in her bottom lip that are <br/>\nareas of real <br/>\n&gt; concern.  I&#39;ve had differing opinions from two homeopaths, one who <br/>\nsaid that no <br/>\n&gt; homeopathic remedy will prevent infection and another who said that <br/>\ngunpowder <br/>\n&gt; remedy has helped prevent infection in similar wounds but there is <br/>\nstill a <br/>\n&gt; risk.<br/>\n&gt;  <br/>\n&gt; How have other unschoolers handled this in a respectful way?  I <br/>\ndon&#39;t want to <br/>\n&gt; pass my own fears onto her (I&#39;m sure I already am, though) by <br/>\nexplaining <br/>\n&gt; infection and the possibility of us having to stay at the hospital, <br/>\nbut these <br/>\n&gt; thoughts are running rampant in my head.  Her face is a mess and <br/>\nthe Hasbro <br/>\n&gt; Children&#39;s Hospital where she was stitched was a filthy, disgusting <br/>\nplace so I know <br/>\n&gt; she was exposed to germs and crap during our 10 hours there.  I am <br/>\ntruly <br/>\n&gt; terrified for her and I would feel much better if she had the <br/>\nantibiotics in her <br/>\n&gt; little body.  Any ideas would be greatly appreciated.<br/>\n&gt;  <br/>\n&gt; Thanks,<br/>\n&gt; Robin in MA<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ************************************** See what&#39;s free at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com\">http://www.aol.com</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":8667530,"authorName":"Manisha Kher","from":"Manisha Kher &lt;m_kher@...&gt;","profile":"m_kher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Our Fears","postDate":"1179333974","msgId":23702,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3NTkwOS4zNTgzMy5xbUB3ZWI1NDQwNy5tYWlsLnlhaG9vLmNvbT4=","inReplyToHeader":"PGNmNi4xMDNhZTI0MS4zMzdjNTU0M0Bhb2wuY29tPg=="},"prevInTopic":23701,"nextInTopic":23703,"prevInTime":23701,"nextInTime":23703,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"... I forgot to add earlier - augmentin comes in a bubble gum flavor that my son loves. Also chocolate syrup is a pretty strong flavor and I can get him to","messageBody":"<div id=\"ygrps-yiv-2036374479\">--- <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ohpurple1@...\">ohpurple1@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Yesterday I made Augmentin popsicles,<br/>\n&gt; mixed crushed tablets into ice <br/>\n&gt; cream, pudding, jello, etc. <br/>\n </span></blockquote>I forgot to add earlier - augmentin comes in a bubble<br/>\ngum flavor that my son loves. Also chocolate syrup is<br/>\na pretty strong flavor and I can get him to take a<br/>\nmedicine he doesn&#39;t like in just a couple of teaspoons<br/>\nof the syrup.<br/>\n<br/>\nManisha<br/>\n<br/>\n<br/>\n<br/>\n       <br/>\n____________________________________________________________________________________Pinpoint customers who are looking for what you sell. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://searchmarketing.yahoo.com/\">http://searchmarketing.yahoo.com/</a></div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Our Fears","postDate":"1179333778","msgId":23701,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1MjYzNzFGQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":23699,"nextInTopic":23702,"prevInTime":23700,"nextInTime":23702,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"Augmentin is the ONLY antibiotic DS can take (basic stuff does nothing and he s allergic to sulfas). Yes, it is available as a liquid - one that can be mixed","messageBody":"<div id=\"ygrps-yiv-2142326540\">Augmentin is the ONLY antibiotic DS can take (basic stuff does nothing<br/>\nand he&#39;s allergic to sulfas). Yes, it is available as a liquid - one<br/>\nthat can be mixed into a variety of flavors. Also, FWIW, the first dose<br/>\nalways comes back out again with DS - whether it&#39;s with food or not,<br/>\nwithin 2 hours it comes back up, repeated vomiting about once an hour<br/>\nfor 2 or 3 hours then he&#39;s okay and his system tolerates it (which is<br/>\nwhy we try to avoid the whole thing whenever possible). It&#39;s just a<br/>\nreally -strong- thing for his system on that first &quot;hit&quot;. Come to think<br/>\nof it, it&#39;s been quite a long time since we&#39;ve seen any need for it<br/>\n(even the dr we see isn&#39;t big on jumping right into an Rx - not a<br/>\npediatrician, a GP, he&#39;s a basic family doctor who tends to look a bit<br/>\nmore holistically at the situation than some doctors I&#39;ve known and is<br/>\nwilling to let the body try to heal itself first before intervening, and<br/>\nrelies heavily on my input and DS&#39; in regard to how he&#39;s feeling and<br/>\nwhat action to take).<br/>\n <br/>\nDefinitely need to get the meds in given the nature of the injuries.<br/>\nBut, I can also see how that would seem like an additional invasion of<br/>\nher person right now while all of her defenses are still on high alert.<br/>\nOne thing I might do, in addition to the arnica she&#39;s taking, is try<br/>\nsomething like Rescue Remedy or one/a couple of the more specific Bach<br/>\nessences that are for trauma, anxiety, etc. That might bring the<br/>\nresidual stress level down enough that she&#39;d be willing to take a liquid<br/>\nantibiotic.Good heavens, my almost 9 yr old still prefers liquid meds<br/>\nand my 39 yr old hubby probably would too - swallowing pills is not<br/>\nsomething he likes (but at least I don&#39;t have to crush stuff up for him!<br/>\nlol)<br/>\n <br/>\nDeb <br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2346607,"authorName":"ohpurple1@aol.com","from":"ohpurple1@...","profile":"openmindedfamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Our Fears","postDate":"1179333612","msgId":23699,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM3ZS45Y2I4MTE5LjMzN2M4ZGVjQGFvbC5jb20+"},"prevInTopic":23697,"nextInTopic":23701,"prevInTime":23698,"nextInTime":23700,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/16/2007 9:50:18 AM Eastern Standard Time, sylgt04@yahoo.com writes: About the meds -- they gave you pills for a 3yo? Would she take a","messageBody":"<div id=\"ygrps-yiv-1056795452\">In a message dated 5/16/2007 9:50:18 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sylgt04@...\">sylgt04@...</a> writes:<br/>\n<br/>\nAbout the meds -- they gave you pills for a 3yo? Would she take a liquid med? <br/>\nI remember that augmentin can be mixed into almost any flavor. Another option <br/>\nmight be IV antiobiotix at home, or even IM (intra-muscular) shots at home. <br/>\n<br/>\n <br/>\n <br/>\n <br/>\nThey gave us the liquid at first.  We took it to our pharmacy yesterday and <br/>\nhad it re-flavored to grape and they also added an anti-bitter agent but she <br/>\nstill refuses it.  Her issues with taking it is that it tastes &quot;really bad.&quot;  <br/>\nWe&#39;ve all tried it to show her it&#39;s not *that bad*  and we all made yummy noises <br/>\netc.  Her response to that was that if we like, then we can eat it.  I also <br/>\nhave the augmentin in tablet form and have crushed that into every possible <br/>\nfood/candy/frozen treat we could come up with and we also have it in chewable <br/>\ntablet form but they are bigger and taste worse than the adult unflavored <br/>\nversion.  I must admit, it tastes like poison -- she&#39;s right.  I put the grape <br/>\nflavored stuff in a concentrated version of kool-aid and in grape jello and other <br/>\npurple stuff I thought would hide the taste but nothing can hide the horrible <br/>\ntaste.<br/>\n <br/>\nI&#39;m weary about taking her to the ER for an IV because I know she&#39;d hate that <br/>\nmore than being held down.  I&#39;m going to call the doctor and ask about home <br/>\nIV/IM shots.  That seems so much easier.  This is my third child and she has <br/>\nbeen unschooled all her life and she expects and insists that everyone treat her <br/>\nwell and would be devastated if we ever held her down.  I&#39;m amazed at how <br/>\neasily the doctors and pharmacists suggest it as a solution.  When I threatened <br/>\nto hold her and force her yesterday she laughed at me (and I was in a very <br/>\nserious state) and *knew* I must be joking.  She trusts us not to do that to her.  <br/>\nMy older kids took me seriously, though and started coming up with other <br/>\nsolutions to help avoid that route.  I was hoping that someone on this list would <br/>\nhave some magic words or brilliant ideas for helping her understand the <br/>\nimportance of taking the meds that I hadn&#39;t considered.  So????<br/>\n <br/>\nThanks,<br/>\nRobin, still fretting and trying to administer the meds but taking a breather <br/>\nto reconsider all our options.  The 3 year old is playing joyfully and has no <br/>\nworries.  Childhood is so precious and wonderful!<br/>\n<br/>\n<br/>\n<br/>\n************************************** See what&#39;s free at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com\">http://www.aol.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":295439124,"authorName":"Julie Hampton","from":"&quot;Julie Hampton&quot; &lt;wisdom1133@...&gt;","profile":"hammy454","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Our Fears","postDate":"1179327423","msgId":23697,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEyMC1EQVYzODlBMDZCQjQ0MzM5M0FCODAzMEVDNDNDMEBwaHguZ2JsPg==","referencesHeader":"PGNmNi4xMDNhZTI0MS4zMzdjNTU0M0Bhb2wuY29tPg=="},"prevInTopic":23695,"nextInTopic":23699,"prevInTime":23696,"nextInTime":23698,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"If she does not have an infection then the antibotics are just in case. Do you know anything about the dog? has it had shots and what not. My son was also bit","messageBody":"<div id=\"ygrps-yiv-1619546618\">If she does not have an infection then the antibotics are just in case. Do you know anything about the dog? has it had shots and what not. My son was also bit in the lip and did not get an infection it was a watch it to see and then we would have to treat that but they did not automatically put him on one. If you do not want to go to the hospital is there somewhere else you can take her- instant care- urgent care? If you do not want the hospital involved then I would suggest watching for infection that right now is not there. Try to get a liquid medicine that is flavored. why does she not want to take anything?<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: ohpurple1@...&lt;mailto:ohpurple1@...&gt; <br/>\n  To: unschoolingbasics@yahoogroups.com&lt;mailto:unschoolingbasics@yahoogroups.com&gt; <br/>\n  Sent: Wednesday, May 16, 2007 6:38 AM<br/>\n  Subject: [unschoolingbasics] Our Fears<br/>\n<br/>\n<br/>\n  My 3.5 year old was attacked by a pit bull on Monday night. She is refusing <br/>\n  all medication, antibiotics, motrin, etc. She has been taking arnica and has <br/>\n  let us put calendula cream on her stitches but she is clearly in pain -- <br/>\n  throwing things, slamming things, extremely cranky and violent, etc. She is <br/>\n  usually a gentle angel. I just spoke with her ped who informed me that the risk of <br/>\n  infection is great and that we &quot;MUST get antibiotics into her body <br/>\n  immediately.&quot; Yesterday I made Augmentin popsicles, mixed crushed tablets into ice <br/>\n  cream, pudding, jello, etc. I&#39;ve reduced myself to threatening to hold her down <br/>\n  (due to my own fears) in order to get the Augmentin in her body but haven&#39;t gone <br/>\n  there. I was concerned yesterday but because she had had IV Augmentin in the <br/>\n  ER on Monday night I thought she was covered for 24 hours so although we <br/>\n  tried all day to get her to take it, we didn&#39;t push it. The Dr. said that IV <br/>\n  Augmentin is not a 24 hour drug and that she is at great risk for infection and <br/>\n  that there is NO choice but to take her to the hospital and get them in <br/>\n  intravenously. Madison has about 30 stitches in her face, lips and eye and has two <br/>\n  deep puncture wounds above her eye and in her bottom lip that are areas of real <br/>\n  concern. I&#39;ve had differing opinions from two homeopaths, one who said that no <br/>\n  homeopathic remedy will prevent infection and another who said that gunpowder <br/>\n  remedy has helped prevent infection in similar wounds but there is still a <br/>\n  risk.<br/>\n<br/>\n  How have other unschoolers handled this in a respectful way? I don&#39;t want to <br/>\n  pass my own fears onto her (I&#39;m sure I already am, though) by explaining <br/>\n  infection and the possibility of us having to stay at the hospital, but these <br/>\n  thoughts are running rampant in my head. Her face is a mess and the Hasbro <br/>\n  Children&#39;s Hospital where she was stitched was a filthy, disgusting place so I know <br/>\n  she was exposed to germs and crap during our 10 hours there. I am truly <br/>\n  terrified for her and I would feel much better if she had the antibiotics in her <br/>\n  little body. Any ideas would be greatly appreciated.<br/>\n<br/>\n  Thanks,<br/>\n  Robin in MA<br/>\n<br/>\n  ************************************** See what&#39;s free at http://www.aol.com.&lt;http://www.aol.com./&gt;<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Our Fears","postDate":"1179326874","msgId":23689,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NzU3Ni45NzYyOC5xbUB3ZWI1MzgwNi5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGNmNi4xMDNhZTI0MS4zMzdjNTU0M0Bhb2wuY29tPg=="},"prevInTopic":23687,"nextInTopic":23695,"prevInTime":23688,"nextInTime":23690,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"My 3.5 year old was attacked by a pit bull on Monday night. She is refusing all medication, antibiotics, motrin, etc. She has been taking arnica and has let us","messageBody":"<div id=\"ygrps-yiv-1144501815\">My 3.5 year old was attacked by a pit bull on Monday night. She is refusing <br/>\nall medication, antibiotics, motrin, etc. She has been taking arnica and has <br/>\nlet us put calendula cream on her stitches but she is clearly in pain -- <br/>\nthrowing things, slamming things, extremely cranky and violent, etc. She is <br/>\nusually a gentle angel. I just spoke with her ped who informed me that the risk of <br/>\ninfection is great and that we &quot;MUST get antibiotics into her body <br/>\nimmediately. &quot; Yesterday I made Augmentin popsicles, mixed crushed tablets into ice <br/>\ncream, pudding, jello, etc. I&#39;ve reduced myself to threatening to hold her down <br/>\n(due to my own fears) in order to get the Augmentin in her body but haven&#39;t gone <br/>\nthere.<br/>\n   <br/>\n  *****<br/>\n   <br/>\n  What an ordeal for all of you!  I can understand why she&#39;d be cranky and violent -- more than just the physical pain, is the sheer terror she must have felt with the attack.  I&#39;d expect the crankies to continue for some time.  <br/>\n   <br/>\n  Given the severity of her injuries and the infection risk at hospital ER&#39;s and also once she&#39;s home, along with the dog germies, I&#39;d definitely do all I could to get the meds into her.<br/>\n   <br/>\n  About the meds --  they gave you pills for a 3yo?  Would she take a liquid med?  I remember that augmentin can be mixed into almost any flavor.  Another option might be IV antiobiotix at home, or even IM (intra-muscular) shots at home.  When Andy came home from the hospital as a newborn, he was on IV anti-bios.  The hospital wanted to train me to do his meds thru a heparin port, but I insisted they send a home nurse out to do it for us.  Poor little guy had had so many IV&#39;s in his first four days that most of his veins were unusable for more ports.  On his second day at home, the &#39;last vein option&#39; for homecare collapsed, and the docs wanted him back in NICU. The home nurse (an absolute angel, that woman) argued with the doctor that Andy would do better at home where he could still nurse on demand, getting IM shots than going back to NICU.  She came by twice a day and did the shots for him, which meant he stayed home.  <br/>\n   <br/>\n  I&#39;d ask about IV meds you (or a nurse) could administer at home, or shots, even if that meant daily trips to the doctor&#39;s office or home visits by a nurse. <br/>\n   <br/>\n  Sylvia<br/>\n    <br/>\n   <br/>\n   <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nBoardwalk for $500? In 2007? Ha! <br/>\nPlay Monopoly Here and Now (it&#39;s updated for today&#39;s economy) at Yahoo! Games.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Our Fears","postDate":"1179326184","msgId":23687,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTMwMWM3OTdjNyQ5NDRiYTUyMCQwMjAxYThjMEBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":23686,"nextInTopic":23689,"prevInTime":23686,"nextInTime":23688,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"***My 3.5 year old was attacked by a pit bull on Monday night. *** Robin, what a stressful situation.  I m so sorry for your little girl.  You must all be","messageBody":"<div id=\"ygrps-yiv-1099113954\">***My 3.5 year old was attacked by a pit bull on Monday night. ***<br/>\n<br/>\nRobin, what a stressful situation.  I&#39;m so sorry for your little girl.  You <br/>\nmust all be feeling so tired and overwhelmed.<br/>\n<br/>\n How does the antibiotic taste?  If it&#39;s awful can you ask for another kind?<br/>\n<br/>\nWould she take it if you took it too?  Would she take it herself if you let <br/>\nher be in charge? (with your help)<br/>\n<br/>\nIs she afraid taking it will hurt?  Can you get a liquid version in a <br/>\ndropper?    Would she take it in a spoon or cup?<br/>\n<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":8667530,"authorName":"Manisha Kher","from":"Manisha Kher &lt;m_kher@...&gt;","profile":"m_kher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Our Fears","postDate":"1179326056","msgId":23686,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyOTg3MS4yODgwMi5xbUB3ZWI1NDQwOC5tYWlsLnlhaG9vLmNvbT4=","inReplyToHeader":"PGNmNi4xMDNhZTI0MS4zMzdjNTU0M0Bhb2wuY29tPg=="},"prevInTopic":23675,"nextInTopic":23687,"prevInTime":23685,"nextInTime":23687,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"Ouch! That sounds awful. There was a long posting on AlwaysUnschooled by Robyn about a similar situation. If I remember right Jayn had an infected tooth and","messageBody":"<div id=\"ygrps-yiv-124999466\">Ouch! That sounds awful.<br/>\n<br/>\nThere was a long posting on AlwaysUnschooled by Robyn<br/>\nabout a similar situation. If I remember right Jayn<br/>\nhad an infected tooth and needed antibiotics. Maybe<br/>\nsomeone with a better memory can find it and post a<br/>\nlink to it.<br/>\n<br/>\nManisha<br/>\n<br/>\n--- <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ohpurple1@...\">ohpurple1@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; How have other unschoolers handled this in a<br/>\n&gt; respectful way?  I don&#39;t want to <br/>\n&gt; pass my own fears onto her (I&#39;m sure I already am,<br/>\n&gt; though) by explaining <br/>\n&gt; infection and the possibility of us having to stay<br/>\n&gt; at the hospital, but these <br/>\n&gt; thoughts are running rampant in my head.  <br/>\n<br/>\n<br/>\n       <br/>\n </span></blockquote>____________________________________________________________________________________Take the Internet to Go: Yahoo!Go puts the Internet in your pocket: mail, news, photos & more. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mobile.yahoo.com/go?refer=1GNXIC\">http://mobile.yahoo.com/go?refer=1GNXIC</a></div>","specialLinks":[]},{"userId":2346607,"authorName":"ohpurple1@aol.com","from":"ohpurple1@...","profile":"openmindedfamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Our Fears","postDate":"1179319107","msgId":23675,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNmNi4xMDNhZTI0MS4zMzdjNTU0M0Bhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":23686,"prevInTime":23674,"nextInTime":23676,"topicId":23675,"numMessagesInTopic":0,"msgSnippet":"My 3.5 year old was attacked by a pit bull on Monday night.  She is refusing all medication, antibiotics, motrin, etc.  She has been taking arnica and has let","messageBody":"<div id=\"ygrps-yiv-185413204\">My 3.5 year old was attacked by a pit bull on Monday night.  She is refusing <br/>\nall medication, antibiotics, motrin, etc.  She has been taking arnica and has <br/>\nlet us put calendula cream on her stitches but she is clearly in pain -- <br/>\nthrowing things, slamming things, extremely cranky and violent, etc.  She is <br/>\nusually a gentle angel.  I just spoke with her ped who informed me that the risk of <br/>\ninfection is great and that we &quot;MUST get antibiotics into her body <br/>\nimmediately.&quot;  Yesterday I made Augmentin popsicles, mixed crushed tablets into ice <br/>\ncream, pudding, jello, etc.  I&#39;ve reduced myself to threatening to hold her down <br/>\n(due to my own fears) in order to get the Augmentin in her body but haven&#39;t gone <br/>\nthere.  I was concerned yesterday but because she had had IV Augmentin in the <br/>\nER on Monday night I thought she was covered for 24 hours so although we <br/>\ntried all day to get her to take it, we didn&#39;t push it. The Dr. said that IV <br/>\nAugmentin is not a 24 hour drug and that she is at great risk for infection and <br/>\nthat there is NO choice but to take her to the hospital and get them in <br/>\nintravenously.  Madison has about 30 stitches in her face, lips and eye and has two <br/>\ndeep puncture wounds above her eye and in her bottom lip that are areas of real <br/>\nconcern.  I&#39;ve had differing opinions from two homeopaths, one who said that no <br/>\nhomeopathic remedy will prevent infection and another who said that gunpowder <br/>\nremedy has helped prevent infection in similar wounds but there is still a <br/>\nrisk.<br/>\n <br/>\nHow have other unschoolers handled this in a respectful way?  I don&#39;t want to <br/>\npass my own fears onto her (I&#39;m sure I already am, though) by explaining <br/>\ninfection and the possibility of us having to stay at the hospital, but these <br/>\nthoughts are running rampant in my head.  Her face is a mess and the Hasbro <br/>\nChildren&#39;s Hospital where she was stitched was a filthy, disgusting place so I know <br/>\nshe was exposed to germs and crap during our 10 hours there.  I am truly <br/>\nterrified for her and I would feel much better if she had the antibiotics in her <br/>\nlittle body.  Any ideas would be greatly appreciated.<br/>\n <br/>\nThanks,<br/>\nRobin in MA<br/>\n<br/>\n<br/>\n<br/>\n************************************** See what&#39;s free at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com\">http://www.aol.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":23745,"nextTopicId":23958}}