{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":13,"messages":[{"userId":274026229,"authorName":"Logan Porter","from":"Logan Porter &lt;logan_rose_porter@...&gt;","profile":"logan_rose_porter","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] When / How do you tell...","postDate":"1236234920","msgId":38783,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0MTIxMC4yMDE0MC5xbUB3ZWIzNjcwNi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":38660,"nextInTopic":0,"prevInTime":38782,"nextInTime":38784,"topicId":38518,"numMessagesInTopic":0,"msgSnippet":"My DS is not quite two, and I told him as soon as the test confirmed that I had a baby in my tummy. He is young enough that the concept needs time to grow and","messageBody":"<div id=\"ygrps-yiv-1170597771\">My DS is not quite two, and I told him as soon as the test confirmed that I had a baby in my tummy. He is young enough that the concept needs time to grow and old enough to grasp it in small doses. We make it a huge game. By the time the baby comes (still 4 or so months) he should have a pretty good understanding, and since he will be at the homebirth (though possibly not awake, who knows) I want him to understand as much as possible. <br/>\n<br/>\nI am glad I told him early. It certainly helped a LOT with explaining the morning sickness and my milk drying up to him. And he LOVES the baby so much already. He blows raspberries and kisses my tummy. He likes to feel it kick (very small kicks still but definitely able to feel them!) We play a lot of games about what the birth will be like so he wont get scared. We also play games and stories in fun ways about what a newborn is like. He just loves it and I feel he already has a bond to the baby. <br/>\n<br/>\nSome things take a little explaining, like how pushing food through the bellybutton &#39;hole&#39; wont work for feeding the baby hehe, Ive explained that the baby steals the food from my tummy after I eat it. He thinks this is hilarious and simple concepts like this work the best at his age. Your daughter will probably have a lot more understanding. <br/>\n<br/>\nWe didnt have the issue of family accidentally finding out. I called everyone as soon as I knew as it had been a long time coming and everyone was hoping for us :) <br/>\n<br/>\n<br/>\n      Stay connected to the people that matter most with a smarter inbox. Take a look <a rel=\"nofollow\" target=\"_blank\" href=\"http://au.docs.yahoo.com/mail/smarterinbox\">http://au.docs.yahoo.com/mail/smarterinbox</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":368287055,"authorName":"Angie Fette","from":"&quot;Angie Fette&quot; &lt;angiefette@...&gt;","profile":"fetteangel","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: When / How do you tell...","postDate":"1235972588","msgId":38660,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5QUI3MUU4LjAwMDAxQy4wMzM4NEBBTkdJRS1QQz4=","referencesHeader":"PGdvZmVmdSsycmJ0QGVHcm91cHMuY29tPiA8MDYwMDhDOUItODJFNS00MTlDLUExRUQtQ0IzNEMzQzlCQThCQGdtYWlsLmNvbT4="},"prevInTopic":38639,"nextInTopic":38783,"prevInTime":38659,"nextInTime":38661,"topicId":38518,"numMessagesInTopic":0,"msgSnippet":"Thank you Melissa, No I don t expect anyone to withhold the joy and happiness for very long.  I was strictly speaking in regards to telling your children as","messageBody":"<div id=\"ygrps-yiv-159015442\">Thank you Melissa, No I don&#39;t expect anyone to withhold the &quot;joy and<br/>\nhappiness&quot; for very long.  I was strictly speaking in regards to telling<br/>\nyour children as soon as you find out that you are pregnant, if you find out<br/>\nearly in your first trimester.  As I tried to elude to, I know you have no<br/>\ncontrol over what happens, and obviously when you begin to show, you&#39;re not<br/>\ngoing to be able to hide it from anyone.  I only meant that I could have<br/>\nsheltered them from more un-necessary pain by waiting until I was out of the<br/>\nmore &quot;dangerous window&quot; where most miscarriages happen.  You know, when it<br/>\nwasn&#39;t a viable pregnancy or it becomes identified as a tubal pregnancy?  <br/>\n<br/>\n<br/>\n<br/>\nBasically what I mean is, I believe in seeing the Doctor for your pregnancy<br/>\nvisits as soon as they will see you, and I am referring to not telling the<br/>\nchildren before having even seen the doctor to see if anything can be<br/>\nidentified as &quot;wrong&quot; with the pregnancy.  In my opinion, why not wait just<br/>\na few weeks to make sure it is going to be as normal of a pregnancy as can<br/>\nbe detected by a physicians checkup and early testing; before telling the<br/>\nchildren so that you can avoid the pain that an early miscarriage would<br/>\ncause them.  I don&#39;t see why it&#39;s necessary to put them through that if it<br/>\ncan be avoided.  I see nothing wrong with telling them once you&#39;ve been to<br/>\nthe doctor, been checked out, and from what he/she can tell everything looks<br/>\ngood and normal.  After that, I think it&#39;s fine to tell them.  Obviously<br/>\nthere&#39;s still a risk of something going terribly wrong.  There&#39;s a risk of<br/>\nsomething going terribly wrong even after you deliver a seemingly healthy<br/>\nbaby. Nothing is guaranteed.  But it is medically known that the first<br/>\ntrimester is a dangerous time and when critical development does or does not<br/>\nhappen that will affect the rest of the pregnancy, and it can be a riskier<br/>\ntime for miscarriages.  So I was just saying that until you know whether it<br/>\nseems ok or not, consider holding off on telling them.<br/>\n<br/>\n<br/>\n<br/>\nMy obstetrician will not see you right away if you had 2 over the counter<br/>\npregnancy tests come back positive, she says you are probably pregnant, and<br/>\nthen schedules your first visit for several weeks out.  In that time, I was<br/>\nso excited that I told the kids anyway.  I then miscarried before I even got<br/>\nto the doctor to be physically examined.  I just think that if I had waited<br/>\nuntil seeing her, she may have been able to identify that something was<br/>\nwrong and the fetus was not growing, no heartbeat, or what not, and I could<br/>\nve had the chance to deal with it on my own, without having to tell the<br/>\nchildren.  The emergency doctor that I saw told me that my obstetrician<br/>\nmight have been able to tell me whether or not the pregnancy was a &quot;normal&quot;<br/>\nor &quot;high risk&quot; one at my first visit, if I had made it to that date. <br/>\n<br/>\n<br/>\n<br/>\nSo I definitely agree with you that you should not keep it from your kids<br/>\nfor a long time, or deprive them from the joy of knowing.  I just recommend,<br/>\nbased on what I went through with my personal experience, waiting until<br/>\nafter the first doctor visit or end of the first trimester; when you are out<br/>\nof the first danger zone. Even though I know there are many dangerous zones<br/>\nalong the way, at least by that point you know whether the fetus has<br/>\ndeveloped or not, and if it is probably strong enough to have a better<br/>\nchance at surviving through the later dangers that it encounters.  I am<br/>\nsorry for your losses Melissa.  It&#39;s never easy, no matter how it happens,<br/>\nbut I couldn&#39;t imagine having carried the baby later and losing it.  It was<br/>\nbad enough after the short time that I had carried.  I had already grown<br/>\nvery attached to him/her and the idea of being the little angels mommy.<br/>\n<br/>\n<br/>\n<br/>\nSincerely,<br/>\n<br/>\n<br/>\n<br/>\nAngie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-------Original Message-------<br/>\n<br/>\n <br/>\n<br/>\nFrom: Melissa Gray<br/>\n<br/>\nDate: 3/1/2009 11:46:59 PM<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n<br/>\nSubject: Re: [unschoolingbasics] Re: When / How do you tell...<br/>\n<br/>\n <br/>\n<br/>\nAngie, I feel your pain. But see, my story is different, because our <br/>\n<br/>\nlosses were all way after the typical time period, three miscarriages <br/>\n<br/>\nbetween 16 and 18 weeks. And what about people who lose children at <br/>\n<br/>\nbirth? Should one erase the joy of six months, to ensure that no one <br/>\n<br/>\nfeels hurt at the loss of a newborn? Or if the child is three, and <br/>\n<br/>\nhas leukemia?<br/>\n<br/>\n<br/>\n<br/>\nMy feeling is that you can&#39;t guarantee anything, and the joy and <br/>\n<br/>\nhappiness that my children had in expectation was worth the sorrow. <br/>\n<br/>\nThe sorrow they felt was authentic, and while they hurt, they learned <br/>\n<br/>\nso much. I just blogged about this, a little bit. I never had to be <br/>\n<br/>\nstrong for them, by showing my sorrow, I validated their own. And by <br/>\n<br/>\nshowing my healing process, I modeled for them that while bad things <br/>\n<br/>\nhappen, how we live with them and grow is the most important part.<br/>\n<br/>\n<br/>\n<br/>\neh, had to dig but here&#39;s my blog entry, from last week, about the <br/>\n<br/>\nsame thing<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives.blogspot.com/2009/02/hamy-lost-blog-entry.html\">http://startlinglives.blogspot.com/2009/02/hamy-lost-blog-entry.html</a><br/>\n<br/>\n<br/>\n<br/>\nFor the OP, we tell when we need to. If I have horrible morning <br/>\n<br/>\nsickness, it&#39;s fair to tell kids mom needs a break because she&#39;s <br/>\n<br/>\npuking her guts up ;-) Knowledge is power, kwim? If my bump is <br/>\n<br/>\ngetting big (which after so many pregnancies is about...oh, <br/>\n<br/>\nconception) they see it and should know.<br/>\n<br/>\nMelissa<br/>\n<br/>\nMom to Joshua, Breanna, Emily, Rachel, Samuel, Daniel and Avari<br/>\n<br/>\nWife to Zane<br/>\n<br/>\n<br/>\n<br/>\nblog me at<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives.blogspot.com/\">http://startlinglives.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives365.blogspot.com\">http://startlinglives365.blogspot.com</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mar 1, 2009, at 7:58 PM, fetteangel wrote:<br/>\n<br/>\n<br/>\n<br/>\n&gt; I love all of your replies, and I wish I could be as positive as they<br/>\n<br/>\n&gt; were, but honestly I have a different story.<br/>\n<br/>\n&gt;<br/>\n<br/>\n&gt; I feel like I made a mistake sharing with my children that I was<br/>\n<br/>\n&gt; pregnant with my 3rd baby as soon as I found out. I was so excited<br/>\n<br/>\n&gt; that I couldn&#39;t wait to tell them.<br/>\n<br/>\n&gt;<br/>\n<br/>\n&gt; My son was about 10 and my daughter was about 5. I thought that they<br/>\n<br/>\n&gt; were both old enough to know right away and understand what was going<br/>\n<br/>\n&gt; on, well enough anyway. They both became very excited and started<br/>\n<br/>\n&gt; telling everyone that they could; including our family and friends.<br/>\n<br/>\n&gt; Unfortunately I miscarried at around 6 weeks. I was devastated. I<br/>\n<br/>\n&gt; will never forget how much I dreaded and feared telling them that they<br/>\n<br/>\n&gt; weren&#39;t going to be a big brother or big sister. It actually made<br/>\n<br/>\n&gt; dealing with my miscarriage harder for me. Not only did I have to<br/>\n<br/>\n&gt; mourn for what I had lost, but so did they, and now I had to worry<br/>\n<br/>\n&gt; about them even more. There were so many questions that we didn&#39;t<br/>\n<br/>\n&gt; have the answers to, and if I couldn&#39;t understand it, how possibly<br/>\n<br/>\n&gt; could they? So not only did I have to worry about myself getting<br/>\n<br/>\n&gt; through it, but I had to try to concentrate on them and being strong,<br/>\n<br/>\n&gt; instead of just being able to do it in my own natural time.<br/>\n<br/>\n&gt;<br/>\n<br/>\n&gt; I, personally feel like having told them made it harder on all of us.<br/>\n<br/>\n&gt; I think that if I hadn&#39;t told them about the pregnancy, I would have<br/>\n<br/>\n&gt; eventually told them about the miscarriage when they were a little<br/>\n<br/>\n&gt; older, but I feel like I put them through unnecessary pain and<br/>\n<br/>\n&gt; suffering. They really took it hard. Both of them, to this day<br/>\n<br/>\n&gt; (almost 5 years later) still mention that they wish their baby hadn&#39;t<br/>\n<br/>\n&gt; died. Now I realize how much they hurt from it, and the doctor had<br/>\n<br/>\n&gt; told me that he wasn&#39;t even sure if the pregnancy had actually even<br/>\n<br/>\n&gt; been viable. By the time he saw the ultrasound there was the remains<br/>\n<br/>\n&gt; of the sack, but no sign of the fetus. So I don&#39;t know what happened,<br/>\n<br/>\n&gt; but I now know that I probably won&#39;t be able to have any more children<br/>\n<br/>\n&gt; and I feel like I got their hopes up about having a new baby that now<br/>\n<br/>\n&gt; may never happen. Now they always think about it and want another<br/>\n<br/>\n&gt; baby. I think it&#39;s possible that if they never knew that I had been<br/>\n<br/>\n&gt; pregnant, they wouldn&#39;t think quite so much about having another baby,<br/>\n<br/>\n&gt; because they wouldn&#39;t know what they had lost.<br/>\n<br/>\n&gt;<br/>\n<br/>\n&gt; I feel like if I had just waited until I had cleared my first<br/>\n<br/>\n&gt; trimester, we would have had a better idea if it was a normal, healthy<br/>\n<br/>\n&gt; pregnancy. I honestly think that if I ever had the chance to do it<br/>\n<br/>\n&gt; again, or if I do get pregnant again, with the risk of miscarriage,<br/>\n<br/>\n&gt; the possibility of it being a tubal pregnancy, or anything else being<br/>\n<br/>\n&gt; wrong, I would wait to tell the kids and even our family and friends.<br/>\n<br/>\n&gt; I personally feel that if I can prevent my loved ones, especially my<br/>\n<br/>\n&gt; children, from having to endure the pain of a tragic loss of a loved<br/>\n<br/>\n&gt; one, why wouldn&#39;t I do that? It&#39;s bad enough that my husband and I<br/>\n<br/>\n&gt; would have to go through it. Why make them?<br/>\n<br/>\n&gt;<br/>\n<br/>\n&gt; My mother had a miscarriage when I was very young, and she did not<br/>\n<br/>\n&gt; tell me about it until I was an older teenager. When I heard about it<br/>\n<br/>\n&gt; I was sad for her, but I did not feel a personal sense of loss or<br/>\n<br/>\n&gt; mourning about it. I didn&#39;t feel pain from hearing about it, just a<br/>\n<br/>\n&gt; sadness for what she must have went through. I wish now that I could<br/>\n<br/>\n&gt; have done that for my children.<br/>\n<br/>\n&gt;<br/>\n<br/>\n&gt; That&#39;s just my personal thoughts, having been through it. I know<br/>\n<br/>\n&gt; everyone has to do what is right for their family, but if you asked me<br/>\n<br/>\n&gt; what I think, I now feel very strongly about this. Knowing the pain<br/>\n<br/>\n&gt; that I felt from the loss and then having to watch my children cry and<br/>\n<br/>\n&gt; ask, &quot;Why?&quot; and knowing the pain they were having to feel, I just<br/>\n<br/>\n&gt; wouldn&#39;t ever want that for anyone else.<br/>\n<br/>\n&gt;<br/>\n<br/>\n&gt; It&#39;s so easy to get excited and impatient in wanting to share the<br/>\n<br/>\n&gt; wonderful news with your little ones. Believe me, I&#39;m all for being<br/>\n<br/>\n&gt; positive and hopeful that everything will be fine with the pregnancy,<br/>\n<br/>\n&gt; but you have to be prepared for the fact that it&#39;s out of your hands,<br/>\n<br/>\n&gt; and you better be prepared to explain to your children if something<br/>\n<br/>\n&gt; goes wrong. So that is what I would recommend. If you are eager to<br/>\n<br/>\n&gt; tell them about it, ask yourself if you are prepared to tell them if<br/>\n<br/>\n&gt; something goes wrong. I know that no one can be completely prepared<br/>\n<br/>\n&gt; for tragedy, but we as adults are somewhat prepared because we know<br/>\n<br/>\n&gt; that there is always the possibility that something can go wrong. But<br/>\n<br/>\n&gt; our children, especially if they&#39;re younger, have no sense of this.<br/>\n<br/>\n&gt; When you tell them that they are going to have a baby brother or<br/>\n<br/>\n&gt; sister, they truly believe that this is really going to happen. They<br/>\n<br/>\n&gt; don&#39;t stop to think that it may not. So if you decide to tell them,<br/>\n<br/>\n&gt; try to prepare yourself as much as possible with what you may want to<br/>\n<br/>\n&gt; tell them, no matter what happens. Just in case....<br/>\n<br/>\n&gt;<br/>\n<br/>\n&gt;<br/>\n<br/>\n&gt; I will pray for you that you make the decision that is best for you<br/>\n<br/>\n&gt; and your family, and that everything will go wonderfully with the<br/>\n<br/>\n&gt; baby. Congratulations, and best wishes!<br/>\n<br/>\n&gt;<br/>\n<br/>\n&gt; Angie<br/>\n<br/>\n&gt;<br/>\n<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Debbie S.&quot; &lt;Glasswitch@...&gt;<br/>\n<br/>\n&gt; wrote:<br/>\n<br/>\n&gt; &gt;<br/>\n<br/>\n&gt; &gt; Thank you all for sharing your stories! Although we&#39;ve told a few<br/>\n<br/>\n&gt; friends,<br/>\n<br/>\n&gt; &gt; we aren&#39;t planning to make the family announcement until I&#39;m in my<br/>\n<br/>\n&gt; second<br/>\n<br/>\n&gt; &gt; trimester. I have my first midwife appointment next week, and I<br/>\n<br/>\n&gt; think I&#39;ll<br/>\n<br/>\n&gt; &gt; have her daddy watch her for this one. After that, she will be<br/>\n<br/>\n&gt; welcome to<br/>\n<br/>\n&gt; &gt; attend all appointments. We did have a miscarriage last summer at 9<br/>\n<br/>\n&gt; weeks,<br/>\n<br/>\n&gt; &gt; and we talked about it a bit, but she was still young enough that<br/>\n<br/>\n&gt; she really<br/>\n<br/>\n&gt; &gt; didn&#39;t grasp the concepts. We also know that we can&#39;t tell her<br/>\n<br/>\n&gt; until we&#39;re<br/>\n<br/>\n&gt; &gt; ready for the entire world to know, because she will be very excited<br/>\n<br/>\n&gt; to tell<br/>\n<br/>\n&gt; &gt; everyone! :)<br/>\n<br/>\n&gt; &gt;<br/>\n<br/>\n&gt; &gt; I have many chilbirth videos including water birth and unassisted<br/>\n<br/>\n&gt; birth, so<br/>\n<br/>\n&gt; &gt; when we&#39;re closed and she&#39;s ready, we can watch those together. I<br/>\n<br/>\n&gt; love the<br/>\n<br/>\n&gt; &gt; idea of having a weekly e-mail updating what&#39;s going on with baby!<br/>\n<br/>\n&gt; &gt;<br/>\n<br/>\n&gt; &gt; Again, thank you for your stories! It&#39;s great to have the <br/>\n<br/>\n&gt; opinions of<br/>\n<br/>\n&gt; &gt; families that honor their children as part of the whole.<br/>\n<br/>\n&gt; &gt;<br/>\n<br/>\n&gt; &gt; Hugs,<br/>\n<br/>\n&gt; &gt; Deb. S.<br/>\n<br/>\n&gt; &gt;<br/>\n<br/>\n&gt;<br/>\n<br/>\n&gt;<br/>\n<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: When / How do you tell...","postDate":"1235969491","msgId":38639,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdvZm9rais1ZTJxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA2MDA4QzlCLTgyRTUtNDE5Qy1BMUVELUNCMzRDM0M5QkE4QkBnbWFpbC5jb20+"},"prevInTopic":38637,"nextInTopic":38660,"prevInTime":38638,"nextInTime":38640,"topicId":38518,"numMessagesInTopic":0,"msgSnippet":"~~And what about people who lose children at birth? Should one erase the joy of six months, to ensure that no one feels hurt at the loss of a newborn? Or if","messageBody":"<div id=\"ygrps-yiv-862213438\">~~And what about people who lose children at<br/>\nbirth? Should one erase the joy of six months, to ensure that no one<br/>\nfeels hurt at the loss of a newborn? Or if the child is three, and<br/>\nhas leukemia?~~<br/>\n<br/>\nI totally agree.<br/>\nChildren can easily sense when things are &quot;off&quot; and not knowing why is<br/>\nso much worse than sharing in the pain and sadness that a family would<br/>\nnaturally experience. <br/>\n<br/>\nLife has zero guarantees. I believe sharing in the joy and sadness and<br/>\nmess and pain of life is all part of unschooling.<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":367169565,"authorName":"Melissa Gray","from":"Melissa Gray &lt;melissagr8@...&gt;","profile":"graymamacita","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: When / How do you tell...","postDate":"1235969043","msgId":38637,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2MDA4QzlCLTgyRTUtNDE5Qy1BMUVELUNCMzRDM0M5QkE4QkBnbWFpbC5jb20+","inReplyToHeader":"PGdvZmVmdSsycmJ0QGVHcm91cHMuY29tPg==","referencesHeader":"PGdvZmVmdSsycmJ0QGVHcm91cHMuY29tPg=="},"prevInTopic":38634,"nextInTopic":38639,"prevInTime":38636,"nextInTime":38638,"topicId":38518,"numMessagesInTopic":0,"msgSnippet":"Angie, I feel your pain. But see, my story is different, because our losses were all way after the typical time period, three miscarriages between 16 and 18","messageBody":"<div id=\"ygrps-yiv-1092858582\">Angie, I feel your pain. But see, my story is different, because our  <br/>\nlosses were all way after the typical time period, three miscarriages  <br/>\nbetween 16 and 18 weeks. And what about people who lose children at  <br/>\nbirth? Should one erase the joy of six months, to ensure that no one  <br/>\nfeels hurt at the loss of a newborn? Or if the child is three, and  <br/>\nhas leukemia?<br/>\n<br/>\nMy feeling is that you can&#39;t guarantee anything, and the joy and  <br/>\nhappiness that my children had in expectation was worth the sorrow.  <br/>\nThe sorrow they felt was authentic, and while they hurt, they learned  <br/>\nso much. I just blogged about this, a little bit. I never had to be  <br/>\nstrong for them, by showing my sorrow, I validated their own. And by  <br/>\nshowing my healing process, I modeled for them that while bad things  <br/>\nhappen, how we live with them and grow is the most important part.<br/>\n<br/>\neh, had to dig but here&#39;s my blog entry, from last week, about the  <br/>\nsame thing<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives.blogspot.com/2009/02/hamy-lost-blog-entry.html\">http://startlinglives.blogspot.com/2009/02/hamy-lost-blog-entry.html</a><br/>\n<br/>\nFor the OP, we tell when we need to. If I have horrible morning  <br/>\nsickness, it&#39;s fair to tell kids mom needs a break because she&#39;s  <br/>\npuking her guts up ;-) Knowledge is power, kwim? If my bump is  <br/>\ngetting big (which after so many pregnancies is about...oh,  <br/>\nconception) they see it and should know.<br/>\nMelissa<br/>\nMom to Joshua, Breanna, Emily, Rachel, Samuel, Daniel and Avari<br/>\nWife to Zane<br/>\n<br/>\nblog me at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives.blogspot.com/\">http://startlinglives.blogspot.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives365.blogspot.com\">http://startlinglives365.blogspot.com</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mar 1, 2009, at 7:58 PM, fetteangel wrote:<br/>\n<br/>\n&gt; I love all of your replies, and I wish I could be as positive as they<br/>\n&gt; were, but honestly I have a different story.<br/>\n&gt;<br/>\n&gt; I feel like I made a mistake sharing with my children that I was<br/>\n&gt; pregnant with my 3rd baby as soon as I found out. I was so excited<br/>\n&gt; that I couldn&#39;t wait to tell them.<br/>\n&gt;<br/>\n&gt; My son was about 10 and my daughter was about 5. I thought that they<br/>\n&gt; were both old enough to know right away and understand what was going<br/>\n&gt; on, well enough anyway. They both became very excited and started<br/>\n&gt; telling everyone that they could; including our family and friends.<br/>\n&gt; Unfortunately I miscarried at around 6 weeks. I was devastated. I<br/>\n&gt; will never forget how much I dreaded and feared telling them that they<br/>\n&gt; weren&#39;t going to be a big brother or big sister. It actually made<br/>\n&gt; dealing with my miscarriage harder for me. Not only did I have to<br/>\n&gt; mourn for what I had lost, but so did they, and now I had to worry<br/>\n&gt; about them even more. There were so many questions that we didn&#39;t<br/>\n&gt; have the answers to, and if I couldn&#39;t understand it, how possibly<br/>\n&gt; could they? So not only did I have to worry about myself getting<br/>\n&gt; through it, but I had to try to concentrate on them and being strong,<br/>\n&gt; instead of just being able to do it in my own natural time.<br/>\n&gt;<br/>\n&gt; I, personally feel like having told them made it harder on all of us.<br/>\n&gt; I think that if I hadn&#39;t told them about the pregnancy, I would have<br/>\n&gt; eventually told them about the miscarriage when they were a little<br/>\n&gt; older, but I feel like I put them through unnecessary pain and<br/>\n&gt; suffering. They really took it hard. Both of them, to this day<br/>\n&gt; (almost 5 years later) still mention that they wish their baby hadn&#39;t<br/>\n&gt; died. Now I realize how much they hurt from it, and the doctor had<br/>\n&gt; told me that he wasn&#39;t even sure if the pregnancy had actually even<br/>\n&gt; been viable. By the time he saw the ultrasound there was the remains<br/>\n&gt; of the sack, but no sign of the fetus. So I don&#39;t know what happened,<br/>\n&gt; but I now know that I probably won&#39;t be able to have any more children<br/>\n&gt; and I feel like I got their hopes up about having a new baby that now<br/>\n&gt; may never happen. Now they always think about it and want another<br/>\n&gt; baby. I think it&#39;s possible that if they never knew that I had been<br/>\n&gt; pregnant, they wouldn&#39;t think quite so much about having another baby,<br/>\n&gt; because they wouldn&#39;t know what they had lost.<br/>\n&gt;<br/>\n&gt; I feel like if I had just waited until I had cleared my first<br/>\n&gt; trimester, we would have had a better idea if it was a normal, healthy<br/>\n&gt; pregnancy. I honestly think that if I ever had the chance to do it<br/>\n&gt; again, or if I do get pregnant again, with the risk of miscarriage,<br/>\n&gt; the possibility of it being a tubal pregnancy, or anything else being<br/>\n&gt; wrong, I would wait to tell the kids and even our family and friends.<br/>\n&gt; I personally feel that if I can prevent my loved ones, especially my<br/>\n&gt; children, from having to endure the pain of a tragic loss of a loved<br/>\n&gt; one, why wouldn&#39;t I do that? It&#39;s bad enough that my husband and I<br/>\n&gt; would have to go through it. Why make them?<br/>\n&gt;<br/>\n&gt; My mother had a miscarriage when I was very young, and she did not<br/>\n&gt; tell me about it until I was an older teenager. When I heard about it<br/>\n&gt; I was sad for her, but I did not feel a personal sense of loss or<br/>\n&gt; mourning about it. I didn&#39;t feel pain from hearing about it, just a<br/>\n&gt; sadness for what she must have went through. I wish now that I could<br/>\n&gt; have done that for my children.<br/>\n&gt;<br/>\n&gt; That&#39;s just my personal thoughts, having been through it. I know<br/>\n&gt; everyone has to do what is right for their family, but if you asked me<br/>\n&gt; what I think, I now feel very strongly about this. Knowing the pain<br/>\n&gt; that I felt from the loss and then having to watch my children cry and<br/>\n&gt; ask, &quot;Why?&quot; and knowing the pain they were having to feel, I just<br/>\n&gt; wouldn&#39;t ever want that for anyone else.<br/>\n&gt;<br/>\n&gt; It&#39;s so easy to get excited and impatient in wanting to share the<br/>\n&gt; wonderful news with your little ones. Believe me, I&#39;m all for being<br/>\n&gt; positive and hopeful that everything will be fine with the pregnancy,<br/>\n&gt; but you have to be prepared for the fact that it&#39;s out of your hands,<br/>\n&gt; and you better be prepared to explain to your children if something<br/>\n&gt; goes wrong. So that is what I would recommend. If you are eager to<br/>\n&gt; tell them about it, ask yourself if you are prepared to tell them if<br/>\n&gt; something goes wrong. I know that no one can be completely prepared<br/>\n&gt; for tragedy, but we as adults are somewhat prepared because we know<br/>\n&gt; that there is always the possibility that something can go wrong. But<br/>\n&gt; our children, especially if they&#39;re younger, have no sense of this.<br/>\n&gt; When you tell them that they are going to have a baby brother or<br/>\n&gt; sister, they truly believe that this is really going to happen. They<br/>\n&gt; don&#39;t stop to think that it may not. So if you decide to tell them,<br/>\n&gt; try to prepare yourself as much as possible with what you may want to<br/>\n&gt; tell them, no matter what happens. Just in case....<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I will pray for you that you make the decision that is best for you<br/>\n&gt; and your family, and that everything will go wonderfully with the<br/>\n&gt; baby. Congratulations, and best wishes!<br/>\n&gt;<br/>\n&gt; Angie<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Debbie S.&quot; &lt;Glasswitch@...&gt;<br/>\n&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; Thank you all for sharing your stories! Although we&#39;ve told a few<br/>\n&gt; friends,<br/>\n&gt; &gt; we aren&#39;t planning to make the family announcement until I&#39;m in my<br/>\n&gt; second<br/>\n&gt; &gt; trimester. I have my first midwife appointment next week, and I<br/>\n&gt; think I&#39;ll<br/>\n&gt; &gt; have her daddy watch her for this one. After that, she will be<br/>\n&gt; welcome to<br/>\n&gt; &gt; attend all appointments. We did have a miscarriage last summer at 9<br/>\n&gt; weeks,<br/>\n&gt; &gt; and we talked about it a bit, but she was still young enough that<br/>\n&gt; she really<br/>\n&gt; &gt; didn&#39;t grasp the concepts. We also know that we can&#39;t tell her<br/>\n&gt; until we&#39;re<br/>\n&gt; &gt; ready for the entire world to know, because she will be very excited<br/>\n&gt; to tell<br/>\n&gt; &gt; everyone! :)<br/>\n&gt; &gt;<br/>\n&gt; &gt; I have many chilbirth videos including water birth and unassisted<br/>\n&gt; birth, so<br/>\n&gt; &gt; when we&#39;re closed and she&#39;s ready, we can watch those together. I<br/>\n&gt; love the<br/>\n&gt; &gt; idea of having a weekly e-mail updating what&#39;s going on with baby!<br/>\n&gt; &gt;<br/>\n&gt; &gt; Again, thank you for your stories! It&#39;s great to have the  <br/>\n&gt; opinions of<br/>\n&gt; &gt; families that honor their children as part of the whole.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Hugs,<br/>\n&gt; &gt; Deb. S.<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":368287055,"authorName":"fetteangel","from":"&quot;fetteangel&quot; &lt;angiefette@...&gt;","profile":"fetteangel","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When / How do you tell...","postDate":"1235959102","msgId":38634,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdvZmVmdSsycmJ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAyMTMwMWM5OWE3OCQyZTVkNzZjMCQzZGRjZjgwNEB5b3VyeGh0cjhodmM0cD4="},"prevInTopic":38615,"nextInTopic":38637,"prevInTime":38633,"nextInTime":38635,"topicId":38518,"numMessagesInTopic":0,"msgSnippet":"I love all of your replies, and I wish I could be as positive as they were, but honestly I have a different story. I feel like I made a mistake sharing with my","messageBody":"<div id=\"ygrps-yiv-763914027\">I love all of your replies, and I wish I could be as positive as they<br/>\nwere, but honestly I have a different story.<br/>\n<br/>\nI feel like I made a mistake sharing with my children that I was<br/>\npregnant with my 3rd baby as soon as I found out.  I was so excited<br/>\nthat I couldn&#39;t wait to tell them.  <br/>\n<br/>\nMy son was about 10 and my daughter was about 5. I thought that they<br/>\nwere both old enough to know right away and understand what was going<br/>\non, well enough anyway. They both became very excited and started<br/>\ntelling everyone that they could; including our family and friends. <br/>\nUnfortunately I miscarried at around 6 weeks.  I was devastated.  I<br/>\nwill never forget how much I dreaded and feared telling them that they<br/>\nweren&#39;t going to be a big brother or big sister.  It actually made<br/>\ndealing with my miscarriage harder for me.  Not only did I have to<br/>\nmourn for what I had lost, but so did they, and now I had to worry<br/>\nabout them even more.  There were so many questions that we didn&#39;t<br/>\nhave the answers to, and if I couldn&#39;t understand it, how possibly<br/>\ncould they?  So not only did I have to worry about myself getting<br/>\nthrough it, but I had to try to concentrate on them and being strong,<br/>\ninstead of just being able to do it in my own natural time.  <br/>\n<br/>\nI, personally feel like having told them made it harder on all of us.<br/>\nI think that if I hadn&#39;t told them about the pregnancy, I would have<br/>\neventually told them about the miscarriage when they were a little<br/>\nolder, but I feel like I put them through unnecessary pain and<br/>\nsuffering.  They really took it hard.  Both of them, to this day<br/>\n(almost 5 years later) still mention that they wish their baby hadn&#39;t<br/>\ndied.  Now I realize how much they hurt from it, and the doctor had<br/>\ntold me that he wasn&#39;t even sure if the pregnancy had actually even<br/>\nbeen viable.  By the time he saw the ultrasound there was the remains<br/>\nof the sack, but no sign of the fetus.  So I don&#39;t know what happened,<br/>\nbut I now know that I probably won&#39;t be able to have any more children<br/>\nand I feel like I got their hopes up about having a new baby that now<br/>\nmay never happen. Now they always think about it and want another<br/>\nbaby.  I think it&#39;s possible that if they never knew that I had been<br/>\npregnant, they wouldn&#39;t think quite so much about having another baby,<br/>\nbecause they wouldn&#39;t know what they had lost. <br/>\n<br/>\nI feel like if I had just waited until I had cleared my first<br/>\ntrimester, we would have had a better idea if it was a normal, healthy<br/>\npregnancy. I honestly think that if I ever had the chance to do it<br/>\nagain, or if I do get pregnant again, with the risk of miscarriage,<br/>\nthe possibility of it being a tubal pregnancy, or anything else being<br/>\nwrong, I would wait to tell the kids and even our family and friends.<br/>\n  I personally feel that if I can prevent my loved ones, especially my<br/>\nchildren, from having to endure the pain of a tragic loss of a loved<br/>\none, why wouldn&#39;t I do that?  It&#39;s bad enough that my husband and I<br/>\nwould have to go through it.  Why make them?<br/>\n<br/>\nMy mother had a miscarriage when I was very young, and she did not<br/>\ntell me about it until I was an older teenager.  When I heard about it<br/>\nI was sad for her, but I did not feel a personal sense of loss or<br/>\nmourning about it.  I didn&#39;t feel pain from hearing about it, just a<br/>\nsadness for what she must have went through.  I wish now that I could<br/>\nhave done that for my children.<br/>\n<br/>\nThat&#39;s just my personal thoughts, having been through it.  I know<br/>\neveryone has to do what is right for their family, but if you asked me<br/>\nwhat I think, I now feel very strongly about this.  Knowing the pain<br/>\nthat I felt from the loss and then having to watch my children cry and<br/>\nask, &quot;Why?&quot; and knowing the pain they were having to feel, I just<br/>\nwouldn&#39;t ever want that for anyone else.<br/>\n<br/>\nIt&#39;s so easy to get excited and impatient in wanting to share the<br/>\nwonderful news with your little ones.  Believe me, I&#39;m all for being<br/>\npositive and hopeful that everything will be fine with the pregnancy,<br/>\nbut you have to be prepared for the fact that it&#39;s out of your hands,<br/>\nand you better be prepared to explain to your children if something<br/>\ngoes wrong. So that is what I would recommend.  If you are eager to<br/>\ntell them about it, ask yourself if you are prepared to tell them if<br/>\nsomething goes wrong.  I know that no one can be completely prepared<br/>\nfor tragedy, but we as adults are somewhat prepared because we know<br/>\nthat there is always the possibility that something can go wrong.  But<br/>\nour children, especially if they&#39;re younger, have no sense of this. <br/>\nWhen you tell them that they are going to have a baby brother or<br/>\nsister, they truly believe that this is really going to happen.  They<br/>\ndon&#39;t stop to think that it may not.  So if you decide to tell them,<br/>\ntry to prepare yourself as much as possible with what you may want to<br/>\ntell them, no matter what happens. Just in case....<br/>\n <br/>\n<br/>\nI will pray for you that you make the decision that is best for you<br/>\nand your family, and that everything will go wonderfully with the<br/>\nbaby.  Congratulations, and best wishes!<br/>\n<br/>\nAngie<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Debbie S.&quot; &lt;Glasswitch@...&gt;<br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Thank you all for sharing your stories!  Although we&#39;ve told a few<br/>\n </span></blockquote>friends, <br/>\n<blockquote><span title=\"ireply\"> &gt; we aren&#39;t planning to make the family announcement until I&#39;m in my<br/>\n </span></blockquote>second <br/>\n<blockquote><span title=\"ireply\"> &gt; trimester.  I have my first midwife appointment next week, and I<br/>\n </span></blockquote>think I&#39;ll <br/>\n<blockquote><span title=\"ireply\"> &gt; have her daddy watch her for this one.  After that, she will be<br/>\n </span></blockquote>welcome to <br/>\n<blockquote><span title=\"ireply\"> &gt; attend all appointments.  We did have a miscarriage last summer at 9<br/>\n </span></blockquote>weeks, <br/>\n<blockquote><span title=\"ireply\"> &gt; and we talked about it a bit, but she was still young enough that<br/>\n </span></blockquote>she really <br/>\n<blockquote><span title=\"ireply\"> &gt; didn&#39;t grasp the concepts.  We also know that we can&#39;t tell her<br/>\n </span></blockquote>until we&#39;re <br/>\n<blockquote><span title=\"ireply\"> &gt; ready for the entire world to know, because she will be very excited<br/>\n </span></blockquote>to tell <br/>\n<blockquote><span title=\"ireply\"> &gt; everyone! :)<br/>\n&gt; <br/>\n&gt; I have many chilbirth videos including water birth and unassisted<br/>\n </span></blockquote>birth, so <br/>\n<blockquote><span title=\"ireply\"> &gt; when we&#39;re closed and she&#39;s ready, we can watch those together.  I<br/>\n </span></blockquote>love the <br/>\n<blockquote><span title=\"qreply\"> &gt; idea of having a weekly e-mail updating what&#39;s going on with baby!<br/>\n&gt; <br/>\n&gt; Again, thank you for your stories!  It&#39;s great to have the opinions of <br/>\n&gt; families that honor their children as part of the whole.<br/>\n&gt; <br/>\n&gt; Hugs,<br/>\n&gt; Deb. S.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":76973347,"authorName":"Debbie S.","from":"&quot;Debbie S.&quot; &lt;Glasswitch@...&gt;","profile":"glasswitch13","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] When / How do you tell...","postDate":"1235916930","msgId":38615,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyMTMwMWM5OWE3OCQyZTVkNzZjMCQzZGRjZjgwNEB5b3VyeGh0cjhodmM0cD4=","referencesHeader":"PDAyNTcwMWM5OTgxOCQ2MzRjOTQ5MCRlYWQ5ZjgwNEB5b3VyeGh0cjhodmM0cD4gPGNjNjEyMGExMDkwMjI4MjM1OHQ2NzUyNGU4MnUyM2E3N2E4NGJhOGM4MTMyQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":38613,"nextInTopic":38634,"prevInTime":38614,"nextInTime":38616,"topicId":38518,"numMessagesInTopic":0,"msgSnippet":"Thank you all for sharing your stories!  Although we ve told a few friends, we aren t planning to make the family announcement until I m in my second ","messageBody":"<div id=\"ygrps-yiv-1585661104\">Thank you all for sharing your stories!  Although we&#39;ve told a few friends, <br/>\nwe aren&#39;t planning to make the family announcement until I&#39;m in my second <br/>\ntrimester.  I have my first midwife appointment next week, and I think I&#39;ll <br/>\nhave her daddy watch her for this one.  After that, she will be welcome to <br/>\nattend all appointments.  We did have a miscarriage last summer at 9 weeks, <br/>\nand we talked about it a bit, but she was still young enough that she really <br/>\ndidn&#39;t grasp the concepts.  We also know that we can&#39;t tell her until we&#39;re <br/>\nready for the entire world to know, because she will be very excited to tell <br/>\neveryone! :)<br/>\n<br/>\nI have many chilbirth videos including water birth and unassisted birth, so <br/>\nwhen we&#39;re closed and she&#39;s ready, we can watch those together.  I love the <br/>\nidea of having a weekly e-mail updating what&#39;s going on with baby!<br/>\n<br/>\nAgain, thank you for your stories!  It&#39;s great to have the opinions of <br/>\nfamilies that honor their children as part of the whole.<br/>\n<br/>\nHugs,<br/>\nDeb. S.</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] When / How do you tell...","postDate":"1235894283","msgId":38613,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkwMjI4MjM1OHQ2NzUyNGU4MnUyM2E3N2E4NGJhOGM4MTMyQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDAyNTcwMWM5OTgxOCQ2MzRjOTQ5MCRlYWQ5ZjgwNEB5b3VyeGh0cjhodmM0cD4=","referencesHeader":"PDAyNTcwMWM5OTgxOCQ2MzRjOTQ5MCRlYWQ5ZjgwNEB5b3VyeGh0cjhodmM0cD4="},"prevInTopic":38563,"nextInTopic":38615,"prevInTime":38612,"nextInTime":38614,"topicId":38518,"numMessagesInTopic":0,"msgSnippet":"It is a long time for a small child. When do you plan on telling others? That would be a good time to let her know. I made a baby calendar to help my then 4","messageBody":"<div id=\"ygrps-yiv-521292737\">It is a long time for a small child. When do you plan on telling others?<br/>\nThat would be a good time to let her know. I made a baby calendar to help my<br/>\nthen 4 y/o see and understand the time flow better.<br/>\n<br/>\nMy kids were all as much or as little a part of the pregnancies as they<br/>\nwanted. Max was 5 when I was preg with Easy and she was right there in the<br/>\nthink of everything. She would help my midwife check my bp or measure my<br/>\nfundus. She wanted to read my urine sticks. I would have brought her to<br/>\nbirth class if I would have found one. She was fully prepared to be at the<br/>\nbirth. Ironically, I had a fast labor and she missed it. Her g&#39;ma took her<br/>\nto the movies. I was not in labor when they went in. And I managed to have<br/>\nEasy before the movie was over, lol. But she would have been there.<br/>\n<br/>\nFaith<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Feb 26, 2009 at 8:44 AM, Debbie S. &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Glasswitch@...\">Glasswitch@...</a>&gt;wrote:<br/>\n<br/>\n&gt;   a little one that they are going to be a big sister / brother ? Our dd<br/>\n&gt; will be 3 in May and will become a big sister sometime in October. She&#39;s<br/>\n&gt; very interested in babies already and we have a niece who is due an moment<br/>\n&gt; now, so the whole pregnancy thing is already part of her life. Our concern<br/>\n&gt; is that it&#39;s a long time between now & October. The baby will be born at<br/>\n&gt; home, as she was, so she&#39;ll get to be as involved, or not, as she wants.<br/>\n&gt;<br/>\n&gt; Any ideas / suggestions?<br/>\n&gt;<br/>\n&gt; Thank you!<br/>\n&gt;<br/>\n&gt; Deb. S.<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":317857527,"authorName":"Tamara Griesel","from":"Tamara Griesel &lt;griesellists@...&gt;","profile":"griesellists","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: When / How do you tell...","postDate":"1235766154","msgId":38560,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1NjI3OC45MDc1Mi5xbUB3ZWI2MzEwOC5tYWlsLnJlMS55YWhvby5jb20+","inReplyToHeader":"PGdvOGRicCs4cGw4QGVHcm91cHMuY29tPg=="},"prevInTopic":38545,"nextInTopic":38563,"prevInTime":38559,"nextInTime":38561,"topicId":38518,"numMessagesInTopic":0,"msgSnippet":"So did we, with our son, who was four at the time.  We also shared the loss of our middle child a few weeks later...I can t imagine having tried to hide","messageBody":"<div id=\"ygrps-yiv-581000040\">So did we, with our son, who was four at the time.  We also shared the loss of our &quot;middle child&quot; a few weeks later...I can&#39;t imagine having tried to hide that painful time from him...he&#39;d have know something was up, and the imagination can be much worse than the truth.<br/>\n <br/>\nHe told me I was pregnant a month after we lost Skittle...(He said I was acting pregnant) and the test confirmed.  We all sat together to catch a first glimpse of his sister on the sonogram screen, then when his sister was born, I was able to hear this exchange between him and the midwife.<br/>\n <br/>\n&quot;I see a hand!&quot;<br/>\n&quot;No sweetie, that&#39;s an ear I think.&quot;<br/>\n&quot;Uh uh, there&#39;s fingers on it.&quot;<br/>\n <br/>\nAnd lo and behold, out popped my daughter with one hand on her forehead and the other on her cheek.  <br/>\n <br/>\nSmart kid.<br/>\n <br/>\nTamara<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Fri, 2/27/09, cindybablitz &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cindybablitz@...\">cindybablitz@...</a>&gt; wrote:<br/>\n<br/>\nFrom: cindybablitz &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cindybablitz@...\">cindybablitz@...</a>&gt;<br/>\nSubject: [unschoolingbasics] Re: When / How do you tell...<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Friday, February 27, 2009, 4:56 AM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&gt; a little one that they are going to be a big sister / brother ? <br/>\n<br/>\nWe told our boys when we knew. <br/>\n<br/>\ncindy<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":12252351,"authorName":"Gwen","from":"Gwen &lt;willow_selene@...&gt;","profile":"willow_selene","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: When / How do you tell...","postDate":"1235729379","msgId":38563,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI2MjU5LjM1NTYwLnFtQHdlYjUwNDA4Lm1haWwucmUyLnlhaG9vLmNvbT4=","inReplyToHeader":"PGdvOGRicCs4cGw4QGVHcm91cHMuY29tPg=="},"prevInTopic":38560,"nextInTopic":38613,"prevInTime":38562,"nextInTime":38564,"topicId":38518,"numMessagesInTopic":0,"msgSnippet":"Megan was four when I realized I was pregnant.  She went with me to the doctor to confirm the pregnancy.  She went with me to every ultrasound and midwife","messageBody":"<div id=\"ygrps-yiv-2128866705\">Megan was four when I realized I was pregnant.  She went with me to the doctor to confirm the pregnancy.  She went with me to every ultrasound and midwife appointment.  I didn&#39;t have anyone to stay with her, so she came with me.  There was no way to hide if from her because she&#39;s Megan.  She sees all, hears all, and she demands answers :-)<br/>\n<br/>\nIt was a really awesome thing for us as a family (my husband took skipped lunches and went in early so he could be at as many appointments as possible).<br/>\n<br/>\nI had almost 24 hour morning sickness for the first five months and Megan was very patient with me.  We took a trip to Disneyland in the fifth month and had a blast (and the morning sickness was gone!  I felt amazing).  Now we look at pictures of us at Disneyland and point to Megan outside and Zoe inside.<br/>\n<br/>\nWe looked at lots of fetal development books (human and animal).  I signed up for a weekly email notice that said what the baby was doing each week.  Megan got to feel the baby kick and she was there for the first several hours of labor.  <br/>\n<br/>\nGwen<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":236481874,"authorName":"cindybablitz","from":"&quot;cindybablitz&quot; &lt;cindybablitz@...&gt;","profile":"cindybablitz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: When / How do you tell...","postDate":"1235728569","msgId":38545,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdvOGRicCs4cGw4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAyNTcwMWM5OTgxOCQ2MzRjOTQ5MCRlYWQ5ZjgwNEB5b3VyeGh0cjhodmM0cD4="},"prevInTopic":38526,"nextInTopic":38560,"prevInTime":38544,"nextInTime":38546,"topicId":38518,"numMessagesInTopic":0,"msgSnippet":"... We told our boys when we knew. cindy","messageBody":"<div id=\"ygrps-yiv-929908933\"><blockquote><span title=\"ireply\">&gt; a little one that they are going to be a big sister / brother ?  <br/>\n<br/>\n </span></blockquote>We told our boys when we knew.  <br/>\n<br/>\ncindy</div>","specialLinks":[]},{"userId":76973347,"authorName":"Debbie S.","from":"&quot;Debbie S.&quot; &lt;Glasswitch@...&gt;","profile":"glasswitch13","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] When / How do you tell...","postDate":"1235681996","msgId":38526,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyZGMwMWM5OTg1NSQyZThjMDQ2MCRlYWQ5ZjgwNEB5b3VyeGh0cjhodmM0cD4=","referencesHeader":"PDAyNTcwMWM5OTgxOCQ2MzRjOTQ5MCRlYWQ5ZjgwNEB5b3VyeGh0cjhodmM0cD4gPDQ5YTZiNzZmLjFlMDQ4ZTBhLjM4ZTQuNGIxMEBteC5nb29nbGUuY29tPg=="},"prevInTopic":38520,"nextInTopic":38545,"prevInTime":38525,"nextInTime":38527,"topicId":38518,"numMessagesInTopic":0,"msgSnippet":"Thank You Brad! Your story brought tears to my eyes :).  What an amazing gift your son will be to his future partner.  The one thing that had impressed me the","messageBody":"<div id=\"ygrps-yiv-1398707316\">Thank You Brad!<br/>\n    Your story brought tears to my eyes :).  What an amazing gift your son <br/>\nwill be to his future partner.  The one thing that had impressed me the most <br/>\nabout living the unschooling lifestyle is the way that every moment is <br/>\ntreasured and treated as special.  It&#39;s such a different outlook from the <br/>\nmainstream where certain moments are given more &quot;weight&quot; than others.  We <br/>\nwill have a midwife for the birth because my hubby is still a bit nervous <br/>\nabout going completely unassisted, even though our daughter was born 20 <br/>\nminutes before the midwife arrived :).<br/>\n    It&#39;s an amazing blessing to have this list and all of you on here <br/>\nhelping to guide us newbies!<br/>\n<br/>\nDeb. S.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Brad Holcomb&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:list.brad@...\">list.brad@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nSent: Thursday, February 26, 2009 10:38 AM<br/>\nSubject: RE: [unschoolingbasics] When / How do you tell...<br/>\n<br/>\n<br/>\n&gt; Our 2nd child arrived in September.  My son was 3 during the pregnancy and<br/>\n&gt; birth.<br/>\n&gt;<br/>\n&gt; I don&#39;t think we mentioned it until a few months in, probably right before<br/>\n&gt; mommy&#39;s belly started to grow perceptibly.  And we didn&#39;t make it a heavy<br/>\n&gt; Announcement.  My son is very bouncy and physical, so I think the first <br/>\n&gt; time<br/>\n&gt; we said &quot;we&#39;re having a baby&quot; was when he was jumping on the couch<br/>\n&gt; near/around/over her one day, and she said something like, &quot;Hey, guess <br/>\n&gt; what?<br/>\n&gt; I have a baby growing in my belly, so I want you to be more gentle now and<br/>\n&gt; not jump on my belly.  Jumping on my belly could hurt me, or hurt the <br/>\n&gt; baby.&quot;<br/>\n&gt;<br/>\n&gt; I don&#39;t think he had very many questions for a few hours.  He just <br/>\n&gt; marinated<br/>\n&gt; in the idea a bit, then came back with questions, which we answered.  As<br/>\n&gt; mommy&#39;s belly grew, he would announce to everyone we met that there was a<br/>\n&gt; baby inside of there.  :)  And he asked the exact same questions many <br/>\n&gt; times,<br/>\n&gt; and we answered them every time.<br/>\n&gt;<br/>\n&gt; We mainly talked about the birth process itself.  My wife births <br/>\n&gt; unassisted,<br/>\n&gt; so we gave him lots of details about the types of breathing and<br/>\n&gt; vocalizations she was likely to do, the blood and other fluids he would <br/>\n&gt; see,<br/>\n&gt; how much privacy she might want, etc.  Also showed him pictures of his own<br/>\n&gt; unassisted birth including pictures of his placenta.  A month or so before<br/>\n&gt; the birth, I shared some videos with him from<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://unassistedchildbirth.com\">http://unassistedchildbirth.com</a> and he watched them over and over for a <br/>\n&gt; few<br/>\n&gt; days.  Also found some youtube vids of animals birthing.<br/>\n&gt;<br/>\n&gt; The birth itself was fun.  He and I were in and out of the bedroom a few<br/>\n&gt; times, but mainly he hung out in another part of the house watching TV and <br/>\n&gt; I<br/>\n&gt; was back and forth helping each as needed.  And when mommy said, &quot;come <br/>\n&gt; here,<br/>\n&gt; baby&#39;s coming&quot;, he dashed down the hall with me to see mommy on one knee <br/>\n&gt; and<br/>\n&gt; the head coming out.  He saw baby flip in my hands to un-wrap her cord.<br/>\n&gt; While I wrapped her in a towel, I asked him to grab me a different <br/>\n&gt; blanket,<br/>\n&gt; 10 feet across the room, and he got it wordlessly.  A few minutes later <br/>\n&gt; when<br/>\n&gt; mommy was ready, he helped me unwrap baby to put against mommy, and helped<br/>\n&gt; mommy check whether or not baby had a penis and watched the first<br/>\n&gt; breastfeeding.  Then he helped keep baby warm while mommy birthed the<br/>\n&gt; placenta.  He was right there the whole time soaking it all in, and <br/>\n&gt; nothing<br/>\n&gt; seemed to upset him.  He did get excited a few times, but was very <br/>\n&gt; receptive<br/>\n&gt; to me gently &quot;shushing&quot; (usually just a finger to the lips, no sound) <br/>\n&gt; since<br/>\n&gt; the noise was pulling her out of her birthing bubble at times, so he&#39;d<br/>\n&gt; whisper his questions and comments into my ear.  Mostly he was asking how<br/>\n&gt; similar/different this was from his own birth.  It was an extremely fun <br/>\n&gt; day.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.flickr.com/photos/holcomb/sets/72157607286447827/\">http://www.flickr.com/photos/holcomb/sets/72157607286447827/</a><br/>\n&gt;<br/>\n&gt; I think he got a real sense of belonging and connection from the whole<br/>\n&gt; process.  We&#39;ve had no rivalry issues at all.  He dotes on his little <br/>\n&gt; sister<br/>\n&gt; constantly.<br/>\n&gt; -=b.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; --<br/>\n&gt; Brad in Boulder, CO<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://holcombs.org\">http://holcombs.org</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":291997784,"authorName":"Brad Holcomb","from":"&quot;Brad Holcomb&quot; &lt;list.brad@...&gt;","profile":"bholcomb48","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] When / How do you tell...","postDate":"1235662700","msgId":38520,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5YTZiNzZmLjFlMDQ4ZTBhLjM4ZTQuNGIxMEBteC5nb29nbGUuY29tPg==","inReplyToHeader":"PDAyNTcwMWM5OTgxOCQ2MzRjOTQ5MCRlYWQ5ZjgwNEB5b3VyeGh0cjhodmM0cD4=","referencesHeader":"PDAyNTcwMWM5OTgxOCQ2MzRjOTQ5MCRlYWQ5ZjgwNEB5b3VyeGh0cjhodmM0cD4="},"prevInTopic":38518,"nextInTopic":38526,"prevInTime":38519,"nextInTime":38521,"topicId":38518,"numMessagesInTopic":0,"msgSnippet":"Our 2nd child arrived in September.  My son was 3 during the pregnancy and birth. I don t think we mentioned it until a few months in, probably right before ","messageBody":"<div id=\"ygrps-yiv-1515689362\">Our 2nd child arrived in September.  My son was 3 during the pregnancy and<br/>\nbirth.<br/>\n<br/>\nI don&#39;t think we mentioned it until a few months in, probably right before<br/>\nmommy&#39;s belly started to grow perceptibly.  And we didn&#39;t make it a heavy<br/>\nAnnouncement.  My son is very bouncy and physical, so I think the first time<br/>\nwe said &quot;we&#39;re having a baby&quot; was when he was jumping on the couch<br/>\nnear/around/over her one day, and she said something like, &quot;Hey, guess what?<br/>\nI have a baby growing in my belly, so I want you to be more gentle now and<br/>\nnot jump on my belly.  Jumping on my belly could hurt me, or hurt the baby.&quot;<br/>\n<br/>\nI don&#39;t think he had very many questions for a few hours.  He just marinated<br/>\nin the idea a bit, then came back with questions, which we answered.  As<br/>\nmommy&#39;s belly grew, he would announce to everyone we met that there was a<br/>\nbaby inside of there.  :)  And he asked the exact same questions many times,<br/>\nand we answered them every time.<br/>\n<br/>\nWe mainly talked about the birth process itself.  My wife births unassisted,<br/>\nso we gave him lots of details about the types of breathing and<br/>\nvocalizations she was likely to do, the blood and other fluids he would see,<br/>\nhow much privacy she might want, etc.  Also showed him pictures of his own<br/>\nunassisted birth including pictures of his placenta.  A month or so before<br/>\nthe birth, I shared some videos with him from<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://unassistedchildbirth.com\">http://unassistedchildbirth.com</a> and he watched them over and over for a few<br/>\ndays.  Also found some youtube vids of animals birthing.<br/>\n<br/>\nThe birth itself was fun.  He and I were in and out of the bedroom a few<br/>\ntimes, but mainly he hung out in another part of the house watching TV and I<br/>\nwas back and forth helping each as needed.  And when mommy said, &quot;come here,<br/>\nbaby&#39;s coming&quot;, he dashed down the hall with me to see mommy on one knee and<br/>\nthe head coming out.  He saw baby flip in my hands to un-wrap her cord.<br/>\nWhile I wrapped her in a towel, I asked him to grab me a different blanket,<br/>\n10 feet across the room, and he got it wordlessly.  A few minutes later when<br/>\nmommy was ready, he helped me unwrap baby to put against mommy, and helped<br/>\nmommy check whether or not baby had a penis and watched the first<br/>\nbreastfeeding.  Then he helped keep baby warm while mommy birthed the<br/>\nplacenta.  He was right there the whole time soaking it all in, and nothing<br/>\nseemed to upset him.  He did get excited a few times, but was very receptive<br/>\nto me gently &quot;shushing&quot; (usually just a finger to the lips, no sound) since<br/>\nthe noise was pulling her out of her birthing bubble at times, so he&#39;d<br/>\nwhisper his questions and comments into my ear.  Mostly he was asking how<br/>\nsimilar/different this was from his own birth.  It was an extremely fun day.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.flickr.com/photos/holcomb/sets/72157607286447827/\">http://www.flickr.com/photos/holcomb/sets/72157607286447827/</a><br/>\n<br/>\nI think he got a real sense of belonging and connection from the whole<br/>\nprocess.  We&#39;ve had no rivalry issues at all.  He dotes on his little sister<br/>\nconstantly.<br/>\n-=b.<br/>\n<br/>\n<br/>\n--<br/>\nBrad in Boulder, CO<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://holcombs.org\">http://holcombs.org</a></div>","specialLinks":[]},{"userId":76973347,"authorName":"Debbie S.","from":"&quot;Debbie S.&quot; &lt;Glasswitch@...&gt;","profile":"glasswitch13","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"When / How do you tell...","postDate":"1235655885","msgId":38518,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyNTcwMWM5OTgxOCQ2MzRjOTQ5MCRlYWQ5ZjgwNEB5b3VyeGh0cjhodmM0cD4="},"prevInTopic":0,"nextInTopic":38520,"prevInTime":38517,"nextInTime":38519,"topicId":38518,"numMessagesInTopic":0,"msgSnippet":"a little one that they are going to be a big sister / brother ?  Our dd will be 3 in May and will become a big sister sometime in October.  She s very","messageBody":"<div id=\"ygrps-yiv-1824976003\">a little one that they are going to be a big sister / brother ?  Our dd will be 3 in May and will become a big sister sometime in October.  She&#39;s very interested in babies already and we have a niece who is due an moment now, so the whole pregnancy thing is already part of her life.  Our concern is that it&#39;s a long time between now & October.  The baby will be born at home, as she was, so she&#39;ll get to be as involved, or not, as she wants.<br/>\n<br/>\nAny ideas / suggestions?<br/>\n<br/>\nThank you!<br/>\n<br/>\nDeb. S.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":38727,"nextTopicId":38638}}