{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":15,"messages":[{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Re: Intro and ???Manners","postDate":"1093463329","msgId":2971,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGNnaTYxYitwZGRlQGVHcm91cHMuY29tPg=="},"prevInTopic":2961,"nextInTopic":0,"prevInTime":2970,"nextInTime":2972,"topicId":2914,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-204422611\">&lt;&lt;&lt;&lt;The MAJOR thing I did get out of it which was NOT specifically <br/>\naddressed in the other two, was being genuine about your own <br/>\nfeelings in a compassionate way. They go into such detail in the <br/>\nother two about helping your kids recognize their feelings and <br/>\naccepting that there are no &quot;bad&quot; or &quot;wrong&quot; feelings, just <br/>\ninapropriate ways of expressing them. I was left still acting like a <br/>\nmartyr while I tried to meet all their needs and wound up neglecting <br/>\nmy own. &gt;&gt;&gt;<br/>\n<br/>\nWhat has happened to me since being on UnschoolingDiscussion for so long (it<br/>\nmust be getting close to 2.5 -3 years), is that the above issues have come<br/>\naround in a cyclic manner repeatedly. It seems like almost every larger<br/>\nparenting issue has come around in this way. So from that I feel like I have<br/>\nalready received most of the information in parenting books - only skewed to<br/>\nUnschooling, which is where I want to go.<br/>\n<br/>\nI felt this way about &quot;The Unschooling Handbook&quot; which is often recommended<br/>\nto new Unschoolers - who would certainly get the most benefit from it.<br/>\nHowever, by the time I got hold of a copy I had heard everything in it, for<br/>\nfree, on line, in many cases from the same writers.<br/>\n<br/>\nAs you say, these books can be a good starting point. However my<br/>\nrecommendation is usually &quot;The Unprocessed Child&quot;, just because it deals<br/>\nwith these type of issues definitely from an Unschooling perspective.<br/>\n<br/>\n&lt;&lt;&lt;&lt;Truly, how long can you wait to go to the bathroom because <br/>\nyour kids &quot;need&quot; you? When Jacob was a baby, it pained me so much to <br/>\nmake him wait, that I would honestly take him to the bathroom with <br/>\nme, still latched on and nursing and try to undress, pee, and <br/>\nredress with the hand not supporting him, LOL. After reading that <br/>\nchapter, a lightbulb went off and I was able to kindly tell my kids <br/>\nif I needed them to wait, or that we could do what they wanted on a <br/>\ndifferent day because the timing wasn&#39;t good, or whatever as the <br/>\nneed arose. I began to treat MYSELF with the respect I deserved too. <br/>\nThat can only be good for them to see, in my opinion.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nI&#39;m seeing what you mean about not being a martyr. However any book that<br/>\nsuggests, or can be taken as suggesting, that parents&#39; needs are more<br/>\nimportant than (rather than somewhat equal to) the child&#39;s needs, is going<br/>\nto raise red flags to me.<br/>\n<br/>\nI read about you taking your nursing baby into the bathroom and don&#39;t see<br/>\nthe story of a mom unreasonably being a martyr. I see a mom doing exactly as<br/>\nshe should! Both of you getting your needs met to a degree - and nursing<br/>\ntoddler outweighs comfort for mom. (Out*weighs* - one hand - get it? Heh,<br/>\nheh.)<br/>\n<br/>\nSeriously though - it is so temporary, the tiny neediness and inability to<br/>\nempathize. I&#39;ve been exactly there - sometimes Jayn still comes into the<br/>\nbathroom to sit on my lap, if I&#39;m ...stuck there for a while. (Gross images<br/>\nfree for the taking).<br/>\n<br/>\n&lt;&lt;&lt;&lt;I do however think they are a great starting point as they explain <br/>\nwhy techniques such as hitting, shaming, and the ever popular &quot;time <br/>\nout&quot; are poor choices. It is amazing how many people swear by these <br/>\nmethods while their children are tiny and then can&#39;t seem to figure <br/>\nout what &quot;happened&quot; when their children get bigger, resent the power <br/>\nplay, and act up.&gt;&gt;&gt;&gt;<br/>\n<br/>\nI guess one reason I prefer &quot;How to Talk...&quot; is because it clearly and<br/>\nsuccinctly offers a course of action. Accepting that these dopey old ways<br/>\ncan be discarded is easier for people if they have an alternative in front<br/>\nof them - less fear.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.740 / Virus Database: 494 - Release Date: 8/16/2004</div>","specialLinks":[]},{"userId":150688296,"authorName":"Kiersten Pasciak","from":"&quot;Kiersten Pasciak&quot; &lt;kjl8@...&gt;","profile":"kierstenpasciak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Intro and ???Manners","postDate":"1093442411","msgId":2961,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNnaTYxYitwZGRlQGVHcm91cHMuY29tPg=="},"prevInTopic":2957,"nextInTopic":2971,"prevInTime":2960,"nextInTime":2962,"topicId":2914,"numMessagesInTopic":0,"msgSnippet":"... the Liberated Parents.... one. (Haven t read Sibling Rivalry so no comment).","messageBody":"<div id=\"ygrps-yiv-907748025\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt; I would recommend &quot;How to Talk...&quot; but I can&#39;t second <br/>\n </span></blockquote>the &quot;Liberated Parents....&quot; one. (Haven&#39;t read &quot;Sibling Rivalry&quot; so <br/>\nno comment).&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;I recently finished &quot;Liberated Parents&quot; and it would seem <br/>\n </span></blockquote>definitely to be an early work. The format was somewhat irritating, <br/>\nbut it was the content that fell short.&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nI agree it fell short in several areas.<br/>\nThe MAJOR thing I did get out of it which was NOT specifically <br/>\naddressed in the other two, was being genuine about your own <br/>\nfeelings in a compassionate way. They go into such detail in the <br/>\nother two about helping your kids recognize their feelings and <br/>\naccepting that there are no &quot;bad&quot; or &quot;wrong&quot; feelings, just <br/>\ninapropriate ways of expressing them. I was left still acting like a <br/>\nmartyr while I tried to meet all their needs and wound up neglecting <br/>\nmy own. Truly, how long can you wait to go to the bathroom because <br/>\nyour kids &quot;need&quot; you? When Jacob was a baby, it pained me so much to <br/>\nmake him wait, that I would honestly take him to the bathroom with <br/>\nme, still latched on and nursing and try to undress, pee, and <br/>\nredress with the hand not supporting him, LOL. After reading that <br/>\nchapter, a lightbulb went off and I was able to kindly tell my kids <br/>\nif I needed them to wait, or that we could do what they wanted on a <br/>\ndifferent day because the timing wasn&#39;t good, or whatever as the <br/>\nneed arose. I began to treat MYSELF with the respect I deserved too. <br/>\nThat can only be good for them to see, in my opinion.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;There was a lot that seemed like manipulation, rather than <br/>\n </span></blockquote>genuine freedom of choice. It just didn&#39;t wash. There is way too <br/>\nmuch compensating for the emotional damage of school, without the <br/>\nchoice to not go to school ever mentioned. That made it seem <br/>\nirrelevant to me. &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nI agree much of their work IS manipulation. Offering your kid 2 <br/>\nchoices and if they don&#39;t pick, you do! We started with this and <br/>\nthen moved to helping figure out more choices if the first 2 or3 <br/>\nwere unacceptable.<br/>\n<br/>\nI do however think they are a great starting point as they explain <br/>\nwhy techniques such as hitting, shaming, and the ever popular &quot;time <br/>\nout&quot; are poor choices. It is amazing how many people swear by these <br/>\nmethods while their children are tiny and then can&#39;t seem to figure <br/>\nout what &quot;happened&quot; when their children get bigger, resent the power <br/>\nplay, and act up.<br/>\n<br/>\nKiersten</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Re: Intro and ???Manners","postDate":"1093429253","msgId":2957,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGNnZjYyYStoYnViQGVHcm91cHMuY29tPg=="},"prevInTopic":2944,"nextInTopic":2961,"prevInTime":2956,"nextInTime":2958,"topicId":2914,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-2139366891\">&lt;&lt;&lt;&lt;I would recommend the books by Faber and Mazlish...&quot;Sibling Rivalry&quot; <br/>\n(even if you only have one), &quot;Liberated Parents...&quot; and &quot;How to Talk <br/>\nso Kids Will Listen & Listen so Kids Will Talk&quot;. They really helped <br/>\nme to see, the need for ME to be genuine with my kids about my <br/>\nfeelings.&gt;&gt;&gt; <br/>\n<br/>\nI would recommend &quot;How to Talk...&quot; but I can&#39;t second the &quot;Liberated<br/>\nParents....&quot; one. (Haven&#39;t read &quot;Sibling Rivalry&quot; so no comment).<br/>\n<br/>\nI recently finished &quot;Liberated Parents&quot; and it would seem definitely to be<br/>\nan early work. The format was somewhat irritating, but it was the content<br/>\nthat fell short. What I find increasingly with many of these child<br/>\ndevelopment type books is that they just don&#39;t go as far into the realm of<br/>\nrespect and compassion for kids as Unschoolers do. I get better, more<br/>\nrigorous suggestions from the lists - for free. <br/>\n<br/>\nIn this book, after 5 years or more of attending the parent workshop (a<br/>\nconstruct of the book) the main characters, or their spouses, were still<br/>\npunishing, yelling and even spanking in some cases! There was a lot that<br/>\nseemed like manipulation, rather than genuine freedom of choice. It just<br/>\ndidn&#39;t wash. There is way too much compensating for the emotional damage of<br/>\nschool, without the choice to not go to school ever mentioned. That made it<br/>\nseem irrelevant to me. <br/>\n<br/>\n&quot;How to Talk..&quot; seems to be much more general in that a lot of the problems<br/>\nused as examples are not school related. It seems to be close to NVC, which<br/>\ncould be another concept to look at.<br/>\n<br/>\nThere is some good stuff about dealing with children&#39;s emotions at<br/>\nwww.naturalchild.org   especially Jan Hunt and Naomi Aldort.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.740 / Virus Database: 494 - Release Date: 8/16/2004</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Intro and ???Manners","postDate":"1093380123","msgId":2944,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGNnZDI5YSsxZG92QGVHcm91cHMuY29tPg=="},"prevInTopic":2940,"nextInTopic":2957,"prevInTime":2943,"nextInTime":2945,"topicId":2914,"numMessagesInTopic":0,"msgSnippet":" It s modeling. It s treating them how you","messageBody":"<div id=\"ygrps-yiv-325296595\">&lt;&lt;&lt;I am having a hard time grasping how you <br/>\nraise your kids into polite, respectful adults without any control.&gt;&gt;&gt;<br/>\n<br/>\nIt&#39;s modeling.<br/>\n<br/>\nIt&#39;s treating them how you would wish them to be - with respect and<br/>\npoliteness and kindness.<br/>\n<br/>\nIt&#39;s not punishing a child for being childish in behavior or abilities.<br/>\n<br/>\nIt&#39;s living and enjoying the present moment as much as possible and trusting<br/>\nthe future to take care of itself.<br/>\n<br/>\nBe aware that young kids living in freedom sometimes seem &quot;wild&quot; and<br/>\n&quot;uncontrolled&quot; in comparison to kids who living with punishments and rules<br/>\nwill seem &quot;compliant&quot;. Our kids are honest, expressive, and have no fear of<br/>\nus. When they are older they are still open, connected with their parents<br/>\nand charming. (come to the Live and Learn Conference - see for yourself.)<br/>\n<br/>\nOur little kids will initiate conversations with adults. They will express<br/>\ntheir opposing opinions and stand up for themselves strongly. Other people<br/>\nmight call that &quot;talking back&quot;; we call it &quot;having a conversation&quot;.  <br/>\n<br/>\n&lt;&lt;&lt;My question is...  how would you teach them to say please and thank <br/>\nyou?&gt;&gt;&gt;<br/>\n<br/>\nWe don&#39;t &quot;teach&quot; them any of things you mention. That is the whole point of<br/>\nUnschooling. We lead by example towards them, spouses to each other, towards<br/>\nour friends and neighbors. <br/>\n<br/>\nSince your child is so young you might get a lot out of www.naturalchild.org<br/>\nThis is an Attachment Parenting Uber-site.<br/>\n<br/>\n&lt;&lt;&lt;&lt;It&#39;s just so vastly different <br/>\nthan our entire society has been trained to think.&gt;&gt;&gt;<br/>\n<br/>\nThat is precisely why Ren and Kelly have set up this list, and the sister<br/>\nlists exist - because Unschooling is living in a way that is different from<br/>\nthe rest of society, and the thinking behind every decision and action comes<br/>\nfrom different priorities than mainstream society, and mainstream parenting.<br/>\nChanging our thinking is the toughest challenge for many. This list helps<br/>\npeople to do that.<br/>\n<br/>\n &lt;&lt;&lt;&lt; I&#39;d like to know <br/>\nhow you give them structure in this type of environment.  I know I <br/>\nneeded structure growing up.  I needed daily routines and rituals.  <br/>\nI loved that we ate dinner together at almost the same time every <br/>\nnight.  I loved that my dad tucked me into bed and said the same <br/>\nprayers to me.  I think stability is important too.  I&#39;m wondering <br/>\nhow you set all this up while still letting your children be free.&gt;&gt;&gt;&gt;<br/>\n<br/>\nYou may have believed you needed structure because you were not Unschooled<br/>\n(or some other reason). Unschooling does not mean you have to throw out<br/>\nevery pleasant memory of your childhood, but it may make you question why<br/>\nyou enjoyed certain things. Please don&#39;t become emotionally attached to the<br/>\nidea that your child will necessarily need and enjoy the same things you<br/>\ndid, although she may. She may want something different. <br/>\n<br/>\n&quot;Structure&quot; is not something that is either laudable OR reprehensible in<br/>\nitself. Try thinking of routines and structures as an organizational tool<br/>\nthat you can take or leave, depending on your child&#39;s needs, and in any<br/>\ngiven situation, and that can change over time. Rigid and uncompromising are<br/>\ntwo characteristics to avoid.<br/>\n<br/>\nFor many traditional families nightly dinner is the ONLY time the family can<br/>\nget together due to work and school and homework. If you find your family<br/>\nenjoys dinners together every night, or once a week, or prefers that family<br/>\nmeal to be breakfast, or prefers to eat in different places, you are free to<br/>\ncreate your own traditions that fill the needs of all the members of your<br/>\nfamily.<br/>\n<br/>\nSome children ask for routines - then help them create them. Understand that<br/>\na routine should only be followed while it is useful and helpful. Routines<br/>\nshould never supersede the needs of the child.<br/>\n<br/>\n&lt;&lt;&lt;Are there any family rules?  Any rules at all?  For example, do you <br/>\nlet your kid go out of the house in the snow without a coat or <br/>\nsweater just cause they feel like it? &gt;&gt;&gt;<br/>\n<br/>\nOne of the things to think about is what you are depriving your child of<br/>\nevery time you force some rule on them, or make a decision for them. <br/>\n<br/>\nYou are depriving them of the chance to use their ability to make a<br/>\ndecision. You are depriving them of the opportunity to feel competent and<br/>\nconfident. You are depriving them of a parent who is thinking logically and<br/>\nliving in the present the moment. You are depriving them of the chance to<br/>\ndiscover something new to them about the world. <br/>\n<br/>\nYou are depriving yourself of the chance to make a lifelong memory of some<br/>\nwonderful, unlikely, imaginative solution to the problem before you that<br/>\nyour child will come up with. When they are given the chance to do so, they<br/>\nreally do come up with some wild, different, creative ideas in any<br/>\nsituation.<br/>\n<br/>\nChildren are not stupid or willful or deliberately manipulating. This &quot;coat<br/>\nin the snow&quot; example drives me nuts - being so trivial. People can tell if<br/>\nthey are cold or not. Just bring along the coat without comment, and she<br/>\nwill ask for it when she&#39;s ready. If however you have set up a power<br/>\nstruggle, or say &quot;I told you so&quot; in words or attitude, she will likely act<br/>\non her emotional needs for self determination, instead of her body&#39;s cues,<br/>\nand refuse to put the coat for on long after she would have.<br/>\n<br/>\nRules are made to be broken, or gotten around, or &quot;let&#39;s find the loophole&quot;,<br/>\nor &quot;let&#39;s test them and see if disaster really will ensue&quot;. You have a lot<br/>\nof reading ahead of you on Principles vs Rules. <br/>\n<br/>\nTry www.sandradodd.com<br/>\n<br/>\nWelcome to the journey.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.740 / Virus Database: 494 - Release Date: 8/16/2004</div>","specialLinks":[]},{"userId":153200361,"authorName":"Tracy Austin","from":"&quot;Tracy Austin&quot; &lt;webinfusion@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Intro and ???Manners","postDate":"1093369484","msgId":2940,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwOTgwMWM0OGEwMiQwYWMyNzNlMCQ2YTMxZGExOEBMb0ZyZXF1ZW5jeT4=","referencesHeader":"PGNnZDI5YSsxZG92QGVHcm91cHMuY29tPg=="},"prevInTopic":2938,"nextInTopic":2944,"prevInTime":2939,"nextInTime":2941,"topicId":2914,"numMessagesInTopic":0,"msgSnippet":"Hi Katie, ... I wanted to say that my dh and I have only ever modeled this to our dd, 2.5. And she is so polite, and almost always says , please, thank you, &","messageBody":"<div id=\"ygrps-yiv-227583651\">Hi Katie,<br/>\n<br/>\nAmong other things you asked:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;My question is...  how would you teach them to say please and thank you?&lt;&lt;<br/>\n<br/>\n </span></blockquote>I wanted to say that my dh and I have only ever modeled this to our dd, 2.5. And she is so polite, and almost always says , please, thank you, & you&#39;re welcome.<br/>\n<br/>\nShe is our first, and this was something that I felt was the right way to &quot;teach&quot; her manners, when I heard it, thought I did have doubts anyway! (PS taught me well to doubt myself, lol!!)<br/>\n<br/>\nWe are polite to each other and her, and now she behaves the same way. It works beautifully, and just wanted to reassure you.<br/>\n<br/>\nWarmly,<br/>\nTracy<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":100027905,"authorName":"TreeGoddess","from":"TreeGoddess &lt;treegoddess@...&gt;","profile":"odrade7","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Intro and ???Manners","postDate":"1093365544","msgId":2938,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFDOTQ4NkM4LUY1RUMtMTFEOC04NUY1LTAwMDM5M0E1REE2NkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGNnZDI5YSsxZG92QGVHcm91cHMuY29tPg==","referencesHeader":"PGNnZDI5YSsxZG92QGVHcm91cHMuY29tPg=="},"prevInTopic":2933,"nextInTopic":2940,"prevInTime":2937,"nextInTime":2939,"topicId":2914,"numMessagesInTopic":0,"msgSnippet":"... More likely than not, Katie,  you are very capable of unschooling your DD.  :)  I m going to give you some links to read that might help you as much as","messageBody":"<div id=\"ygrps-yiv-1733455697\">On Aug 23, 2004, at 11:25 AM, Katie wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; [I am in the process of figuring out whether I have<br/>\n&gt; what it takes to homeschool.]<br/>\n<br/>\n </span></blockquote>More likely than not, Katie,  you are very capable of unschooling your <br/>\nDD.  :)  I&#39;m going to give you some links to read that might help you <br/>\nas much as they helped me.  Start off by getting your &quot;Certificate of <br/>\nEmpowerment&quot; at <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/empowerment\">http://sandradodd.com/empowerment</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; [This whole philosophy of unschooling is very new to me.<br/>\n&gt; It sounds very interesting and effective.  I have to constantly<br/>\n&gt; remind myself of my own reactions to being forced to do things<br/>\n&gt; and how that has created a resistance to this day.]<br/>\n<br/>\n </span></blockquote>Here&#39;s the next part.  It&#39;s a lot easier to unschool ourselves and give <br/>\nour children the freedom to unschool if we can first DEschool <br/>\nourselves.  For &quot;Deschooling for Parents&quot; go to<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<br/>\n(Very helpful site in general so go back and read the rest of Sandra&#39;s <br/>\nsite at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.SandraDodd.com/unschooling\">http://www.SandraDodd.com/unschooling</a> when you get a chance.  <br/>\nBookmark it so you can come back to it too.  :&#39;)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; [I am having a hard time grasping how you raise your kids into<br/>\n&gt; polite, respectful adults without any control.  My question is...<br/>\n&gt; how would you teach them to say please and thank you?]<br/>\n<br/>\n </span></blockquote>I read a great article by Naomi Aldort a year or so ago that really <br/>\nspoke to me about manners and modeling.  I had already had these <br/>\nthoughts, but this was the first time that I learned that others might <br/>\nfeel the same way.  &quot;How Children Learn Manners&quot; is linked at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.naturalchild.org/naomi_aldort/manners.html\">http://www.naturalchild.org/naomi_aldort/manners.html</a>    That whole web <br/>\nsite is great too!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; [Or to clear their plate and help out when a guest at someone&#39;s<br/>\n&gt; home?  How do you teach them to help around the house?  Will they<br/>\n&gt; naturally wish to do these things?]<br/>\n<br/>\n </span></blockquote>Again, as others have mentioned, modeling is the most likely way that <br/>\nthey will pick that up.  Forcing compliance doesn&#39;t make them *want* to <br/>\ndo anything.  ;)  I&#39;m going to refer you back to Sandra Dodd&#39;s site to <br/>\nher page on &quot;chores&quot; at <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores\">http://sandradodd.com/chores</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; [I&#39;d like to know how you give them structure in this type of <br/>\n&gt; environment.<br/>\n&gt; I know I needed structure growing up.  I needed daily routines and <br/>\n&gt; rituals.]<br/>\n<br/>\n </span></blockquote>Did you?  How would you have known any different?  It&#39;s kind of easy to <br/>\njust assume that you must have &quot;needed&quot; something because that&#39;s the <br/>\nway you were raised, but if we really look hard and break things down <br/>\nsometimes things aren&#39;t what they seem.  Not suggesting that this bears <br/>\ntrue for you, but I&#39;ve heard some people (usually male) state that they <br/>\n&quot;needed&quot; to be spanked as a child and that getting spanked helped to <br/>\nkeep them good.  Yikes!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; [I loved that we ate dinner together at almost the same time every<br/>\n&gt; night.  I loved that my dad tucked me into bed and said the same<br/>\n&gt; prayers to me.  I think stability is important too.  I&#39;m wondering<br/>\n&gt; how you set all this up while still letting your children be free.]<br/>\n<br/>\n </span></blockquote>I enjoy eating meals together often also, but my children don&#39;t care <br/>\neither way.  They&#39;re just as happy to grab their plate and take it with <br/>\nthem to watch a movie (or I&#39;ll bring it to them) or work on a craft <br/>\nproject, or leave it at the table and run up to grab a bite or two <br/>\nbefore scampering off to whatever they&#39;re interests are taking them.  <br/>\nThey&#39;re free to choose if they want to participate in a family dinner <br/>\nand oftentimes they do sit and eat with us, but if they didn&#39;t want to <br/>\nI certainly wouldn&#39;t insist on it.  An upset or crying child isn&#39;t <br/>\ngoing to be making any happy memories of family dinners nor is it <br/>\nlikely that the rest of the diners are going to enjoy their dinner <br/>\nwhile one person is obviously upset and unhappy.  KWIM?  I hope that <br/>\nmakes sense.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; [Are there any family rules?  Any rules at all?]<br/>\n<br/>\n </span></blockquote>Hmmmm... more like &quot;principles&quot; rather than &quot;rules&quot;.  Big things like <br/>\nnot hurting each other is, I guess, closer to a rule in our home, but <br/>\nthat&#39;s about it.  Once more, back to Sandra&#39;s wonderful site for <br/>\nprinciples vs. rules at <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; [For example, do you let your kid go out of the house in the snow<br/>\n&gt; without a coat or sweater just cause they feel like it?]<br/>\n<br/>\n </span></blockquote>Sure!  It&#39;s likely that they won&#39;t stay out there for very long if it&#39;s <br/>\nreally cold, and if/when they do come in I make a point of *not* saying <br/>\nor acting like &quot;I told you so&quot;.  Just happily help them with their coat <br/>\n(if they need/want your help).  You might even offer to make hot <br/>\nchocolate for them when they&#39;re done outside.  Or warm up soup.  Or <br/>\nhave warm, dry clothing ready for them to change into once their coats <br/>\nand boots are off.  Comfort.  Love.  Warmth.   These are the things I <br/>\nwant my children to remember about me.  Take that into the rest of your <br/>\nMothering and you can&#39;t go wrong.  ;)<br/>\n<br/>\nHTH<br/>\n-Tracy-</div>","specialLinks":[]},{"userId":150688296,"authorName":"Kiersten Pasciak","from":"&quot;Kiersten Pasciak&quot; &lt;kjl8@...&gt;","profile":"kierstenpasciak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Intro and ???Manners","postDate":"1093345471","msgId":2933,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNnZjdiditzdHVlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNnZjYyYStoYnViQGVHcm91cHMuY29tPg=="},"prevInTopic":2932,"nextInTopic":2938,"prevInTime":2932,"nextInTime":2934,"topicId":2914,"numMessagesInTopic":0,"msgSnippet":"Katie, I also parctice using the royal we and us a lot!!! As in Let s clean up and then singing a song about cleaning up while I do it. Usually they will","messageBody":"<div id=\"ygrps-yiv-1589386641\">Katie, <br/>\nI also parctice using the royal &quot;we&quot; and &quot;us&quot; a lot!!!<br/>\nAs in &quot;Let&#39;s clean up&quot; and then singing a song about cleaning up <br/>\nwhile I do it. Usually they will join in. If not, fine. <br/>\n<br/>\nI hate to see kids who are told that they made the mess, so they <br/>\nhave to clean it up. This makes it seem like such a chore! If <br/>\ncleaning is not such a big deal (in our attitude and actions) then I <br/>\nfeel it will be less of a struggle for our kids.<br/>\nSo far, my 2 both love to help clean. It is just a game.<br/>\n<br/>\nKiersten</div>","specialLinks":[]},{"userId":150688296,"authorName":"Kiersten Pasciak","from":"&quot;Kiersten Pasciak&quot; &lt;kjl8@...&gt;","profile":"kierstenpasciak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Intro and ???Manners","postDate":"1093344138","msgId":2932,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNnZjYyYStoYnViQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNnZDI5YSsxZG92QGVHcm91cHMuY29tPg=="},"prevInTopic":2931,"nextInTopic":2933,"prevInTime":2931,"nextInTime":2933,"topicId":2914,"numMessagesInTopic":0,"msgSnippet":"... is 7 months.  We are fully an AP family.  We live in Denver, Colorado. (if anyone else is close by, :o))  Mabel is very active and started crawling","messageBody":"<div id=\"ygrps-yiv-431222620\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt; Hi, My name is Katie and I am a stay at home mama to Mabel who <br/>\n </span></blockquote>is 7 months.  We are fully an AP family.  We live in Denver, <br/>\nColorado. (if anyone else is close by, :o))  Mabel is very active <br/>\nand started crawling backwards at 5 months and forward at 6.  Sounds <br/>\nlike Emma. &gt;&gt;&gt;&gt;&gt; <br/>\n<br/>\nHi Katie! This is Kiersten, mom to Jacob and Emma. Get yourself <br/>\nready for a crazy ride, LOL. my advice is to treat her with the <br/>\nrespect you would show a friend. Even when my kids were very small, <br/>\nwe didn&#39;t shout at them to do something. If they touched something <br/>\nthat could hurt them, for instance pulling on a plug, we would <br/>\nsay &quot;no hands please, that&#39;s not a toy&quot; while gently removing their <br/>\nhands. Usually, I would then direct their attention to something <br/>\nelse. After a few times, they would listen and stop the action. <br/>\nWarning, there was a small period where each kid decided to &quot;test&quot; <br/>\nthis and would grin right at me while actively reaching. They also <br/>\ndid and still do this with the &quot;come here please&quot; or &quot;time for a <br/>\nclean diaper&quot; requests. Eventually, as they gained motor skills, we <br/>\ncarefully showed them &quot;how&quot; to do an action in a safe manner and let <br/>\nthem have at it. One day , we let Jacob play with daddy&#39;s amplifier <br/>\nand he pluggeg it in and unplugged it for over an hour! Then he gave <br/>\nup playing with cords...seems he had learned what he wanted for the <br/>\ntime being :)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am already seeing her start to stay up later and later cause she <br/>\n&gt; wants to practice standing up.  I am glad I am here to learn about <br/>\n&gt; how to accept these challenges as they arise. <br/>\n<br/>\n </span></blockquote>Hope you can handle the sleep issue better than I have. It has been <br/>\nvery frustrating. Being on this list and reading the unschooling <br/>\nbooks, even for just a week, has really changed my attitude and I am <br/>\nwatching what she chooses to play with when she is staying up. It is <br/>\npretty fascinating!<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My question is...  how would you teach them to say please and <br/>\n </span></blockquote>thank <br/>\n<blockquote><span title=\"ireply\"> &gt; you?  Or to clear their plate and help out when a guest at <br/>\n </span></blockquote>someone&#39;s <br/>\n<blockquote><span title=\"ireply\"> &gt; home?  How do you teach them to help around the house?  Will they <br/>\n&gt; naturally wish to do these things?  <br/>\n<br/>\n </span></blockquote>Jacob learned to be polite by example. Sometimes, if he asks <br/>\nsomething in a tone or manner I don&#39;t personally like, I will just <br/>\ntell him &quot;I don&#39;t like to be asked like that. When you ask politely, <br/>\nit makes we more willing to help you&quot;. Same with behaving in a <br/>\nstore. When he behaves in an easy manner, I tell him &quot;I really <br/>\nenjoyed coming here with you today. That makes me want to bring you <br/>\nhere again&quot; He loves this. Even if he is unhappy to leave a place, <br/>\nlike McDonald&#39;s playland, I tell him &quot;I know you had a lot of fun <br/>\ntoday, we will come back again&quot;, while putting his shoes on. He will <br/>\nask &quot;Can we come again?&quot; to which I can easily say &quot;Yes, I had I <br/>\ngreat time, I would love to bring you here again ANOTHER DAY, It&#39;s <br/>\ntime to go&quot;<br/>\n<br/>\nI would recommend the books by Faber and Mazlish...&quot;Sibling Rivalry&quot; <br/>\n(even if you only have one), &quot;Liberated Parents...&quot; and &quot;How to Talk <br/>\nso Kids Will Listen & Listen so Kids Will Talk&quot;. They really helped <br/>\nme to see, the need for ME to be genuine with my kids about my <br/>\nfeelings. If I constantly do what they ask me, ignoring my own <br/>\nfeelings and needs, I will get grumpy and we will have a tough time. <br/>\nI have learned to say &quot;yes&quot; as often as I am TRULY happy to do so, <br/>\nto say &quot;yes, you can do that later, tomorrow, when daddy gets home, <br/>\netc.&quot; whenever I am not quite ready. Or &quot;I will think about it&quot; if I <br/>\nam unsure. When I get frustrated I tell them. &quot;I am getting <br/>\nfrustrated, grrrrrrrr&quot; (roaring sound you hear) We work a lot on <br/>\nidentifying feelings and expressing them in non-destructive ways.<br/>\n<br/>\nI also look for acceptable outlets for unacceptable behavior.<br/>\nIf Jacob tries to kick Emma, I will tell him &quot;Kicking can hurt, we <br/>\ndon&#39;t kick people. You MAY kick the ball, the pillow, etc. Let&#39;s go <br/>\nget it&quot; For climbing up stuff, &quot;Tables are not for climbing, you can <br/>\nclimb on the slide, couch, etc.&quot;. &quot;Crayons go on paper&quot; was popular <br/>\nbefore I found Mr Clean Magic Erasers. Now I don&#39;t care and the <br/>\ncrayons pretty much stay on the paper. Even with Emma. Whenever <br/>\na &quot;new&quot; challenge pops up, I look for a response I can use that I <br/>\nwon&#39;t mind hearing them say to me or to another child because they <br/>\nWILL repeat it!<br/>\n<br/>\n&quot;I can&#39;t see the TV, Can you please move&quot; is SO much easier to hear <br/>\nthan &quot;Get out of my way&quot;. This came home when our niece (6) stayed <br/>\nover the other night. She said things to my kids in the cruelest <br/>\nways and I was very bothered to know she must be hearing it <br/>\nsomewhere or at least not being asked to stop speaking that way if <br/>\nit was of her own design. I told her that we treat people kindly in <br/>\nour house and I would appreciate it if she could do the same while <br/>\nshe stayed with us. Then I tried to &quot;feed&quot; her polite ways to say <br/>\nthings as the need came up.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt; I needed structure growing up.  I needed daily routines and <br/>\n </span></blockquote>rituals.  <br/>\n<blockquote><span title=\"ireply\"> &gt; I loved that we ate dinner together at almost the same time every <br/>\n&gt; night.  I loved that my dad tucked me into bed and said the same <br/>\n&gt; prayers to me.  I think stability is important too. &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt; <br/>\n<br/>\n </span></blockquote>I am with you on the need for some routines, although I was NOT <br/>\nraised with very many. I have found FlyLady.net and the book &quot;Sink <br/>\nReflections&quot; to be incredibly helpful! The point is to set up <br/>\nroutines that make sense and make you happy. The kids will follow <br/>\nalong. Eating together may take more work, we don&#39;t have that one <br/>\ndown yet, but my kids are little and don&#39;t eat as late as my husband <br/>\ngets home. They may never. Maybe our time playing games, reading <br/>\nbooks, and hanging out outside together is just as good. We are <br/>\nstill talking and hanging out together! <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;Do you let your kid go out of the house in the snow without a <br/>\n </span></blockquote>coat or sweater just cause they feel like it?  &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nAbsolutely!!!<br/>\nThey will learn more from natural consequences than you could ever <br/>\nteach them with a lecture!<br/>\nAnd they get the feeling of power from making their own choices!<br/>\nJsut DON&#39;T give then the standard &quot;I told you so&quot;, when they are <br/>\ndone and freezing, LOL<br/>\n<br/>\n<br/>\nKiersten</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Intro and ???Manners","postDate":"1093318325","msgId":2931,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODI0MDMzMjA1LjQ2MjY4LnFtYWlsQHdlYjUzODA5Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGNnZHJvYit2NDJ2QGVHcm91cHMuY29tPg=="},"prevInTopic":2924,"nextInTopic":2932,"prevInTime":2930,"nextInTime":2932,"topicId":2914,"numMessagesInTopic":0,"msgSnippet":"This is, of course, in hopes that she goes outdoors (only temporary, I don t mean it to come across as letting her play for an hour without one! ) anyway, in","messageBody":"<div id=\"ygrps-yiv-762421719\">This is, of course, in hopes that she goes outdoors (only temporary, I don&#39;t mean it to come across as letting her play for an hour without one! ) anyway, in hopes that she goes <br/>\nout and feels the cold air and thinks to herself, I need a coat.  <br/>\n <br/>\n*****<br/>\n <br/>\nOr maybe she won&#39;t feel the need for a coat, and will play for more than hour without one!  As long as she&#39;s comfortable, that&#39;s not a problem either.  I have pictures of Andy at 6yo, running on a playground in the sleet (on Dec 21) wearing a coat -- over his shorts and flip-flops (year-round footwear for Andy), having a ball!  Colds and illness aren&#39;t caused by cold weather, or even getting cold -- they&#39;re caused by a virus.  Comfort is the issue, and some people are less sensitive to cold (or heat) than others.  <br/>\n <br/>\nMy theory has always been that my kids are aware enough to know when they&#39;re cold, and to ask for a coat/sweater accordingly.  I remember when Will (19 now) was small and my Mom would get upset with me for letting him play outside without a coat.  I told her I&#39;ve wondered if maybe the reason we were always so sensitive to cold was that she bundled us up so.  She was always the &#39;put on a sweater -- I&#39;m cold&#39; kind of Mom.  I was determined to let my kids find their own comfort level with the weather.  As it turns out, they&#39;re all much more tolerant of both cold and heat than I am.  For me, heat&#39;s not a big problem, but I get chilled quickly.  At sundown, they and their Dad are still out in shorts and t-shirts, while I&#39;ve pulled on a sweatshirt. <br/>\n <br/>\nSyl <br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":95670547,"authorName":"Sherri-Lee Pressman","from":"Sherri-Lee Pressman &lt;sherri--lee@...&gt;","profile":"sherrileepr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Intro and ???Manners","postDate":"1093307878","msgId":2924,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBJMlgwMDUwNERSRTI5QGwtZGFlbW9uPg==","inReplyToHeader":"PGNnZDI5YSsxZG92QGVHcm91cHMuY29tPg=="},"prevInTopic":2923,"nextInTopic":2931,"prevInTime":2923,"nextInTime":2925,"topicId":2914,"numMessagesInTopic":0,"msgSnippet":"Hi Katie, Some here might be chuckling at me jumping in with advice (although I would hesitate to call it that) since I am also new to this, but here is my ","messageBody":"<div id=\"ygrps-yiv-771645241\">Hi Katie,<br/>\n<br/>\n <br/>\n<br/>\nSome here might be chuckling at me jumping in with &quot;advice&quot; (although I<br/>\nwould hesitate to call it that) since I am also new to this, but here is my<br/>\ntake:<br/>\n<br/>\n <br/>\n<br/>\nThe biggest challenge for me is to delete everything I was told by my<br/>\nparents about what my abilities were as a child. Because they have coloured<br/>\nmy belief in myself as an adult and my beliefs in my kids (I can say kids<br/>\nnow as I am less than 2 months from having the second:-)). So I started (and<br/>\nstill do) by questioning every single &quot;no&quot; I wanted to say to my daughter. I<br/>\nwas trying to find the source and motivation for that answer. Once I know<br/>\nthat then it helps me to know if my answer is respectful (would it feel that<br/>\nway to me or not) and will it have the desired effect. Now I know my<br/>\ndaughter and she like to do opposite of what ever I tell her, and has a hard<br/>\ntime distinguishing between suggestions and orders, so it has been a bit of<br/>\nwork that is for sure. But that was my start. I totally believe that you get<br/>\nwhat you give in this world, especially with kids. And so if you act<br/>\nrespectful you will get respect (maybe not in that minute, but hey then it<br/>\ndidn&#39;t take me a minute to learn it either). And I see it. When I am tired<br/>\nand short and impatient and snap at my daughter that is exactly what I get<br/>\nback and then for some reason I find *her* tone of voice to be less than<br/>\nrespectful. What about mine?<br/>\n<br/>\n <br/>\n<br/>\nTwo examples that come to mind: My dh is really having a hard time with our<br/>\ndd interrupting us when we are talking. I swear she has some sort of beacon<br/>\non that says &quot;oh they are talking, now I have to interrupt&quot;, even though she<br/>\nactually often doesn&#39;t have anything to say. What I noticed though, is how<br/>\noften HE interrupts her! He thinks she is done, or has gone on for too long,<br/>\nor is not listening or what ever and just starts talking over her. Well<br/>\nwhere did she learn this? Today I told him to have faith she will learn this<br/>\nand he said &quot;maybe!&quot; and I said &quot;yup you are right, you never learned it so<br/>\nmaybe she won&#39;t either&quot;. So I can see that I have to start doing the same<br/>\nwith both of them and setting the example and remind them both to not<br/>\ninterrupt. The other is my SIL who complains all the time that her two boys<br/>\ndon&#39;t respect her but she never shows them any respect and she gets right<br/>\nback what she gives. She thinks this is some hookey new age parenting and<br/>\nthat she should get respect just because she is the parent, I say she is in<br/>\nfor a rude awakening:-)<br/>\n<br/>\n <br/>\n<br/>\nOn to the other things in your post:<br/>\n<br/>\n <br/>\n<br/>\nPlease and thank you. My dd, is the most polite kid I know. and we have<br/>\nnever forced it. We remind sometimes, although I don&#39;t even like doing that,<br/>\nbut she uses please and thank you a lot. Why? Because we modeled it to her.<br/>\nMy dh always thanks me for dinner and then gets up and cleans up afterwards.<br/>\nSo she thanks me for dinner each night now too.<br/>\n<br/>\n <br/>\n<br/>\nBy clear their plate, I think you mean moving it to the sink? Well I ask her<br/>\nto bring me her plate. She does sometimes. she doesn&#39;t others times. The<br/>\ntimes she does I thank her for her help the times she doesn&#39;t I go get it<br/>\nand that is it.<br/>\n<br/>\n <br/>\n<br/>\nShe loves housecleaning (don&#39;t ask me where she gets this from) but I find<br/>\nher in her little apron with her duster in the living room tsk tsking<br/>\nbecause it is dusty. LOL. so I follow her lead and help HER do the cleaning<br/>\nthat day. We plan days when we are going to do it. We have cleaners in once<br/>\na month or so, she grabs her tools and wonders around the house helping them<br/>\nout. Some kids want to, I bet some don&#39;t. Not sure that forcing them will<br/>\ncause them to be cleaner/tidier people when they live on their own. They<br/>\nwill be how they be and then when they find the motivator to change they<br/>\nwill. But motivation has to come from and internal source, not external.<br/>\n(wow my college diploma just came in handy!)<br/>\n<br/>\n <br/>\n<br/>\nOh the coat thing. what we do is take one along &quot;just in case&quot;, she never<br/>\nhas to wear it but it is there. Often now she will ask me to bring along a<br/>\ncoat or shoes &quot;just in case&quot;. Yesterday we headed out to our local<br/>\nexhibition for the day. Left in the afternoon and knew we would be away into<br/>\nthe evening. So even though she had a long sleeve sweater on, I suggested a<br/>\ncoat, just in case. She said no. Ok... we didn&#39;t take one for her. By 9, she<br/>\nwanted something on her, well I had a blanket so she bundled in the stroller<br/>\nin that. Then as she was going onto the ferris wheel with her dad I said to<br/>\ntake the blanket as it would be cool up there. He was surprised at the<br/>\nsuggestion and I said, well we don&#39;t have a coat for her. She said next time<br/>\nshe would bring a coat that she was sorry she didn&#39;t let me bring a &quot;just in<br/>\ncase coat&quot;. In this instance, I didn&#39;t force her to take along the coat, but<br/>\nhad something else for her I assumed one of us would need. AND at the end of<br/>\nit, she realized that she might want one when she is going to be gone for a<br/>\nlong time without me having to force a rule down her throat or any sacrifice<br/>\nof herself. All good:-)<br/>\n<br/>\n <br/>\n<br/>\nA lot of people confuse structure. We don&#39;t have a lot of rules anymore. but<br/>\nwe offer lots of structure in our every day life. We get up every morning<br/>\nand eat breakfast. We talk about the day and plan what we are going to do.<br/>\nSome days we are home some days we are out. My dh works from home so he is<br/>\nhere lots and that can cause plans to change. We always eat lunch and dinner<br/>\nis most always together (this will differ from others here, but it isn&#39;t a<br/>\nbattle for us and we love it), then we have bed time and it is over. So I<br/>\nthink we have routine and Hannah gets her structure in knowing she is in a<br/>\nsafe, secure loving family. Now my SIL as an example, has A LOT of rules, so<br/>\nsome would assume lots of structure. But does not have the same peaceful<br/>\nliving environment that we experience in my opinion. She spends a lot of<br/>\ntime chasing down people including her dh to reprimand them for not doing<br/>\nsomething, not doing it right or doing something or whatever.<br/>\n<br/>\n <br/>\n<br/>\nI am not sure if I am rambling or making any sense anymore, so will end<br/>\nhere, <br/>\n<br/>\n <br/>\n<br/>\nI hope something in this helped,<br/>\n<br/>\n <br/>\n<br/>\nSherri-Lee<br/>\n<br/>\n <br/>\n<br/>\n  _____  <br/>\n<br/>\nFrom: Katie [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kattilily@...\">kattilily@...</a>] <br/>\nSent: Monday, August 23, 2004 8:26 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: [unschoolingbasics] Intro and ???Manners<br/>\n<br/>\n <br/>\n<br/>\nHi, My name is Katie and I am a stay at home mama to Mabel who is 7 <br/>\nmonths.  We are fully an AP family.  We live in Denver, Colorado. <br/>\n(if anyone else is close by, :o))  Mabel is very active and started <br/>\ncrawling backwards at 5 months and forward at 6.  Sounds like Emma.  <br/>\nI am already seeing her start to stay up later and later cause she <br/>\nwants to practice standing up.  I am glad I am here to learn about <br/>\nhow to accept these challenges as they arise.  I am in the process <br/>\nof figuring out whether I have what it takes to homeschool.  This <br/>\nwhole philosophy of unschooling is very new to me.  It sounds very <br/>\ninteresting and effective.  I have to constantly remind myself of my <br/>\nown reactions to being forced to do things and how that has created <br/>\na resistance to this day.  I am having a hard time grasping how you <br/>\nraise your kids into polite, respectful adults without any control.  <br/>\n<br/>\nMy question is...  how would you teach them to say please and thank <br/>\nyou?  Or to clear their plate and help out when a guest at someone&#39;s <br/>\nhome?  How do you teach them to help around the house?  Will they <br/>\nnaturally wish to do these things?  I know kids are eager to <br/>\nparticipate and have a huge amount of desire to do nice things on <br/>\ntheir own, so maybe that is the idea.  It&#39;s just so vastly different <br/>\nthan our entire society has been trained to think.  I&#39;d like to know <br/>\nhow you give them structure in this type of environment.  I know I <br/>\nneeded structure growing up.  I needed daily routines and rituals.  <br/>\nI loved that we ate dinner together at almost the same time every <br/>\nnight.  I loved that my dad tucked me into bed and said the same <br/>\nprayers to me.  I think stability is important too.  I&#39;m wondering <br/>\nhow you set all this up while still letting your children be free.  <br/>\nAre there any family rules?  Any rules at all?  For example, do you <br/>\nlet your kid go out of the house in the snow without a coat or <br/>\nsweater just cause they feel like it?    <br/>\n<br/>\nI really do think this sounds like an awesome way to parent and am <br/>\nso eager to learn more.  Thanks in advance for taking the time to <br/>\nexplain it to me.<br/>\n<br/>\nWarmly,<br/>\nKatie <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Sponsor<br/>\n<br/>\n<br/>\n<br/>\nADVERTISEMENT<br/>\n <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.ard.yahoo.com/SIG=129m5g1r3/M=298184.5285298.6392945.3001176/D=gr\">http://us.ard.yahoo.com/SIG=129m5g1r3/M=298184.5285298.6392945.3001176/D=gr</a><br/>\noups/S=1705081972:HM/EXP=1093364250/A=2319501/R=0/SIG=11tq0u909/*http:/www.n<br/>\netflix.com/Default?mqso=60185353&partid=5285298&gt; click here<br/>\n<br/>\n<br/>\n <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.adserver.yahoo.com/l?M=298184.5285298.6392945.3001176/D=groups/S=\">http://us.adserver.yahoo.com/l?M=298184.5285298.6392945.3001176/D=groups/S=</a><br/>\n:HM/A=2319501/rand=620295872&gt; <br/>\n<br/>\n <br/>\n<br/>\n  _____  <br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n*\tTo visit your group on the web, go to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n  <br/>\n*\tTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a>?subject=Unsubscribe&gt; <br/>\n  <br/>\n*\tYour use of Yahoo! Groups is subject to the Yahoo!<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;  Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":35875473,"authorName":"heather mclean","from":"heather mclean &lt;heather@...&gt;","profile":"heather_200115","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] kids cold weather attire","postDate":"1093304340","msgId":2923,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODIzMjMzOTAwLjE3MzEyLnFtYWlsQHdlYjQwNzEzLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGNnZDI5YSsxZG92QGVHcm91cHMuY29tPg=="},"prevInTopic":2919,"nextInTopic":2924,"prevInTime":2922,"nextInTime":2924,"topicId":2914,"numMessagesInTopic":0,"msgSnippet":"Hi Katie,  Well. this doesn t come","messageBody":"<div id=\"ygrps-yiv-794533971\">Hi Katie,<br/>\n<br/>\n&lt; For example, do you let your kid go out of the house<br/>\nin the snow without a coat or sweater just cause they<br/>\nfeel like it?&gt;<br/>\n<br/>\nWell. this doesn&#39;t come up too often since we live in<br/>\nTucson Arizona LOL, but we did go play in the snow<br/>\nwhile on vacation when my dd, Sierra, was younger. <br/>\nMaybe she was 3?  She played in the snow without<br/>\nshoes.  My parents (as usual) were horrified.  I<br/>\ncringed, thinking about how I would feel in the snow<br/>\nwithout shoes.  But Sierra had a blast.  <br/>\n<br/>\nShe does occasionally wear shoes now.  But is barefoot<br/>\nmost of the time.  Yes, even in the desert!  Often at<br/>\nthe park, other kids want to take off their shoes when<br/>\nthey see her barefoot, but the parents usually say NO<br/>\n- it&#39;s too hot, you&#39;ll step on a thorn, glass, ant,<br/>\nsnake, ...[fill in the blank].  It helped me to find a<br/>\nwebsite encouraging barefoot children -<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unshod.org/pfbc/\">http://www.unshod.org/pfbc/</a><br/>\n<br/>\nheather<br/>\ntucson</div>","specialLinks":[]},{"userId":165889631,"authorName":"Syndi","from":"&quot;Syndi&quot; &lt;justlikemama@...&gt;","profile":"justlikemama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Intro and ???Manners","postDate":"1093300811","msgId":2919,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNnZHJvYit2NDJ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNnZDI5YSsxZG92QGVHcm91cHMuY29tPg=="},"prevInTopic":2917,"nextInTopic":2923,"prevInTime":2918,"nextInTime":2920,"topicId":2914,"numMessagesInTopic":0,"msgSnippet":"Hi Katie! An answer to one of your questions: For example, do you ... There is going to be some point in Mabels life when she is going to think for herself,","messageBody":"<div id=\"ygrps-yiv-2146410999\">Hi Katie! An answer to one of your questions:<br/>\n<br/>\nFor example, do you <br/>\n<blockquote><span title=\"ireply\"> &gt; let your kid go out of the house in the snow without a coat or <br/>\n&gt; sweater just cause they feel like it?  <br/>\n<br/>\n </span></blockquote>There is going to be some point in Mabels life when she is going to <br/>\nthink for herself, and she is going to think that she CAN go out in <br/>\nthe snow without her coat!  This usually happens around the age of 2 <br/>\n&lt;g&gt;<br/>\nAnyway, you could handle the situation with, no, you HAVE to wear a <br/>\ncoat and your daughter is going to think, but i&#39;m a big girl now(cuz <br/>\nshe&#39;s 2!) and I DON&#39;T HAVE to wear a coat!  Or, you could let her <br/>\nknow its snowing and very cold and that it would be a good idea to <br/>\nwear one,that you are wearing one to keep warm and be comfortable and <br/>\nsafe, and let her decide.  This is, of course, in hopes that she goes <br/>\nout doors (only temporary, I don&#39;t mean it to come across as letting <br/>\nher play for an hour without one! ) anyway, in hopes that she goes <br/>\nout and feels the cold air and thinks to herself, I need a coat.  Of <br/>\ncourse it might not ever go as easy as it is said, but you get the <br/>\nidea?  Kinda like defusing the power struggle before it even starts.  <br/>\nShe&#39;ll learn that she can think for herself which will just spill <br/>\nover into all the other aspects of her life!<br/>\n  As for manners.  My boys, 6 and 11, have been unschooled now for <br/>\none year.  They were in public school before this.  And when they <br/>\nwere in school, there was stress.  When we went to the grocery store <br/>\ntogether, there was MAJOR stress.  Now, things are SO much more <br/>\nrelaxed, and at the grocery store, they get complimented on being <br/>\nsuch good helpers or for helping me so much!  And to think i&#39;m not <br/>\neven carrying a switch thru the store with me making them be that <br/>\nway, thats just the way they are!!!!  They are being raised around <br/>\nadults with manners instead of a room full of kids that may or may <br/>\nnot have manners.  They get treated with respect, which in turn  has <br/>\ntaught them to treat mom  and dad and others with respect.  It is <br/>\nabsolutly wonderful!  We have no rules here, I don&#39;t think.  We <br/>\ndefinatly have no set sceduale, but we do watch movies every saturday <br/>\nnight with each other with lots of popcorn, and we do read every <br/>\nsingle night before bed, becuz thats what they want to do.  I think <br/>\nand I know I&#39;ve read on Sandra&#39;s writings that stress can really <br/>\ncause alot of problems in kids.  So I just try to keep their life as <br/>\nstress free for now as possible.  <br/>\nSyndi---I was reading some pages of sandras today that i had never <br/>\nfound before, i&#39;ll get them and post asap.  You&#39;ll really enjoy them <br/>\nI think and it will help put all your questions into perspective! <br/>\n(just in case i didnt ;)</div>","specialLinks":[]},{"userId":173427227,"authorName":"Vijay Berry Owens","from":"Vijay Berry Owens &lt;vijayowens@...&gt;","profile":"vijay_berry_owens","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Intro and ???Manners","postDate":"1093285914","msgId":2917,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI1MTdFNDdDLUY1MzItMTFEOC04MTBDLTAwMzA2NTdERTQxOEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGNnZDI5YSsxZG92QGVHcm91cHMuY29tPg=="},"prevInTopic":2916,"nextInTopic":2919,"prevInTime":2916,"nextInTime":2918,"topicId":2914,"numMessagesInTopic":0,"msgSnippet":"Hi Katie. Welcome. I m fairly new here too. I do wish I had all the answers, but all I  can share is what I plan to do, and what I hope the results will be,","messageBody":"<div id=\"ygrps-yiv-608747505\">Hi Katie. Welcome. I&#39;m fairly new here too.<br/>\n<br/>\nI do wish I had all the answers, but all I  can share is what I plan to <br/>\ndo, and what I hope the results will be, because my DD is only 15 months <br/>\nold.<br/>\n<br/>\nManners are very important to me. It&#39;s important to me that my daughter <br/>\ntreat people respectfully and politely. But I do not like the ways in <br/>\nwhich other families I know teach manners. Too coercive and punitive for <br/>\nmy taste. I feel that if DD sees that DH and I always say please and <br/>\nthank you to each other, that she will just &quot;absorb&quot; that this is the <br/>\nway things are done.<br/>\n<br/>\nI think my FIL&#39;s way of teaching her manners is confusing because when <br/>\nhe gives her something he coaches her to say thank you. So why is HE <br/>\nsaying thank you when he is the one giving her something? I would much <br/>\nrather he just give her things and not say anything. If she were to give <br/>\nHIM something, then it would make sense for him to say thank you. KWIM? <br/>\nShe already says, &quot;TUH!&quot; loudly and happily sometimes when I give her <br/>\nsomething that she wants. Maybe she&#39;s trying to say thank you already? <br/>\nWishful thinking on my part? &lt;g&gt;<br/>\n<br/>\nDD is very interested already in sharing and helping. I just lucked out. <br/>\nShe is VERY young for exhibiting these sorts of behavior and I cannot <br/>\ntake any credit for it. It&#39;s just how she is. If I open the refrigerator <br/>\nor dishwasher she is over there like a shot to help me close them up <br/>\nagain. After she has helped me push them closed I always thank her. She <br/>\nLOVES to help, and I am going to try to nurture that in her. Kids are <br/>\nlike dogs in some ways (please don&#39;t flame me, hear me out!) in that <br/>\nthey love to have a job, and all they need as a reward IMO is to be told <br/>\nthat they did a good job, they don&#39;t need food or a toy as a reward. <br/>\nJust my opinion.<br/>\n<br/>\nIf she is eating something, she will occasionally feed me some. <br/>\nSometimes this means that she is full and doesn&#39;t want to eat any more, <br/>\nbut not always. I always eat whatever it is (goldfish cracker, grape, <br/>\nwhat have you) and say thank you. Or if I REALLY don&#39;t want to eat it, <br/>\nlol, I still take it from her and thank her.<br/>\n<br/>\nAs far as helping goes, I can&#39;t stand the way some parents (my own <br/>\nincluded) do EVERYTHING for their child, like cooking, laundry, <br/>\ncleaning, etc. and then at 18 they shove them out into the world and <br/>\nexpect them to know what to do. I would much rather have been included <br/>\nin those activities when I was younger than have to figure it out in <br/>\ncollege, lol. I bet my mom could have used the help too, but she just <br/>\ncouldn&#39;t get over that initial stage where I wasn&#39;t doing things right <br/>\nyet. Short fuse I guess.<br/>\n<br/>\nI plan to let DD make messes and do the best she can without making a <br/>\nbig deal about it. She&#39;ll learn by doing instead of being told, &quot;You&#39;re <br/>\nnot doing it right, give it to me, I&#39;ll do it.&quot;<br/>\n<br/>\nSo it&#39;s still an experiment for us, we&#39;ll keep everyone posted on how it <br/>\ngoes. I&#39;m sure you&#39;ll get some great advice from moms of older kids here.<br/>\n<br/>\nBest,<br/>\n<br/>\n-Vijay Berry Owens<br/>\nSAHM to Charlotte, 15 months<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Monday, August 23, 2004, at 11:25 AM, Katie wrote:<br/>\n<br/>\n&gt; Hi, My name is Katie and I am a stay at home mama to Mabel who is 7<br/>\n&gt; months.<br/>\n<br/>\n&gt; My question is... how would you teach them to say please and thank<br/>\n&gt; you? Or to clear their plate and help out when a guest at someone&#39;s<br/>\n&gt; home? How do you teach them to help around the house?<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":57650593,"authorName":"Anne","from":"Anne &lt;texascathouse@...&gt;","profile":"texascathouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Intro and ???Manners","postDate":"1093279704","msgId":2916,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODIzMTY0ODI0LjExMDEucW1haWxAd2ViNTE3MTAubWFpbC55YWhvby5jb20+","inReplyToHeader":"PGNnZDI5YSsxZG92QGVHcm91cHMuY29tPg=="},"prevInTopic":2914,"nextInTopic":2917,"prevInTime":2915,"nextInTime":2917,"topicId":2914,"numMessagesInTopic":0,"msgSnippet":"Hi, Katie! Nice to *meet* you ... I have four children -- Jessica is married to a soldier, a junior at Baylor and 21, Michael 18, David 15, Robert 13. The BEST","messageBody":"<div id=\"ygrps-yiv-1149032620\">Hi, Katie!  <br/>\n <br/>\nNice to *meet* you ... I have four children -- Jessica is married to a soldier, a junior at Baylor and 21, Michael 18, David 15, Robert 13.  <br/>\n <br/>\nThe BEST way to teach them anything, especially at younger ages, was to model the behaviors I wanted -- and very actively encouraging them to do the same!  My kids were assuredly not the best behaved at home, but I always heard from others -- whether the kids were guests at another home, or interacting at volunteer events, or otherwise in public setting -- how well-mannered, polite and helpful they were.<br/>\n <br/>\nLiving where I do -- Waco -- I struggle daiy with *adult* attitudes that kids are not worth respect -- and have, in fact, had some awesome battles with one administrator in particular, and a few teachers, over treating kids as they, the teachers, expect to be treated -- with respect!  And no, they don&#39;t need to say *ma&#39;am* and *sir* to be respectful to adults, not by a long shot, and I refuse to make them!  Which does little to endear me to some folks, but ... when my kids meet MY expectations, and I hear so much good feedback, I know I&#39;m doing the right thing.<br/>\n <br/>\nAs for learning chores, that&#39;s something else I modelled -- we did them together at first, and then I&#39;d ask them to chose from a short list ... and the key I think is not being too fussy over perfection!  They will do their best, and that improves with time and practice, and I would always be there to help if a chore got too overwhelming, so they learned that sometimes things just need to be done, but we can work together to accomplish a task.  We also swap chores, too -- even today -- so no one gets stuck with a *nasty* one all the time, and I even let them negotiate with each other.  My daughter despised doing the kitchen floor, so she&#39;s often trade with one of her brothers, or would even pay one of them!  As long as they both agreed, no problem.<br/>\n <br/>\nTheir &quot;structure&quot; is the security and love you provide -- knowing you are there, and you love them, and that you are interested in them.  That&#39;s all it&#39;s taken in our house, and I am SO proud of how mine are turning out.  Of course, there ARE rules, but where possible, I look for the *yes* rather than the *no* in a given situation ... for example, a kid who refused to get dressed for kindergarten ... well, when told he HAD to go, he chose to go in his pj&#39;s ... no problem for me, but HE didn&#39;t like being the center of attention that day, and it didn&#39;t happen again.  <br/>\n <br/>\nYou KNOW what&#39;s best for your child -- trust your instincts.  And ask for help ... something important to learn and do -- it&#39;s never wrong to ask for feedback or suggestions, as long as you treat that info as such, and use what is helpful.<br/>\n <br/>\nBest to you and yours,<br/>\nAnne<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n~  Not all who wander are lost .... ~<br/>\n <br/>\nWell-behaved women rarely make history.<br/>\n <br/>\n&quot;There are more things in heaven and earth, Horatio, Than are dreamt of in your philosophy.&quot; <br/>\n<br/>\n--From Hamlet (I, v, 166-167)<br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! Mail is new and improved - Check it out!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":186674637,"authorName":"Katie","from":"&quot;Katie&quot; &lt;kattilily@...&gt;","profile":"mammicherie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Intro and ???Manners","postDate":"1093274730","msgId":2914,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNnZDI5YSsxZG92QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":2916,"prevInTime":2913,"nextInTime":2915,"topicId":2914,"numMessagesInTopic":0,"msgSnippet":"Hi, My name is Katie and I am a stay at home mama to Mabel who is 7 months.  We are fully an AP family.  We live in Denver, Colorado. (if anyone else is close","messageBody":"<div id=\"ygrps-yiv-2123749828\">Hi, My name is Katie and I am a stay at home mama to Mabel who is 7 <br/>\nmonths.  We are fully an AP family.  We live in Denver, Colorado. <br/>\n(if anyone else is close by, :o))  Mabel is very active and started <br/>\ncrawling backwards at 5 months and forward at 6.  Sounds like Emma.  <br/>\nI am already seeing her start to stay up later and later cause she <br/>\nwants to practice standing up.  I am glad I am here to learn about <br/>\nhow to accept these challenges as they arise.  I am in the process <br/>\nof figuring out whether I have what it takes to homeschool.  This <br/>\nwhole philosophy of unschooling is very new to me.  It sounds very <br/>\ninteresting and effective.  I have to constantly remind myself of my <br/>\nown reactions to being forced to do things and how that has created <br/>\na resistance to this day.  I am having a hard time grasping how you <br/>\nraise your kids into polite, respectful adults without any control.  <br/>\n<br/>\nMy question is...  how would you teach them to say please and thank <br/>\nyou?  Or to clear their plate and help out when a guest at someone&#39;s <br/>\nhome?  How do you teach them to help around the house?  Will they <br/>\nnaturally wish to do these things?  I know kids are eager to <br/>\nparticipate and have a huge amount of desire to do nice things on <br/>\ntheir own, so maybe that is the idea.  It&#39;s just so vastly different <br/>\nthan our entire society has been trained to think.  I&#39;d like to know <br/>\nhow you give them structure in this type of environment.  I know I <br/>\nneeded structure growing up.  I needed daily routines and rituals.  <br/>\nI loved that we ate dinner together at almost the same time every <br/>\nnight.  I loved that my dad tucked me into bed and said the same <br/>\nprayers to me.  I think stability is important too.  I&#39;m wondering <br/>\nhow you set all this up while still letting your children be free.  <br/>\nAre there any family rules?  Any rules at all?  For example, do you <br/>\nlet your kid go out of the house in the snow without a coat or <br/>\nsweater just cause they feel like it?    <br/>\n<br/>\nI really do think this sounds like an awesome way to parent and am <br/>\nso eager to learn more.  Thanks in advance for taking the time to <br/>\nexplain it to me.<br/>\n<br/>\nWarmly,<br/>\nKatie</div>","specialLinks":[]}],"prevTopicId":2968,"nextTopicId":2975}}