{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":16,"messages":[{"userId":779600,"authorName":"KathrynJB@aol.com","from":"KathrynJB@...","profile":"kathrynbeth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Re: questions:)","postDate":"1105114426","msgId":4592,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ1LjFmMTIyOWQwLjJmMTAwZjNhQGFvbC5jb20+"},"prevInTopic":4588,"nextInTopic":0,"prevInTime":4591,"nextInTime":4593,"topicId":4489,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/7/2005 10:25:57 AM Eastern Standard Time, unschoolingbasics@yahoogroups.com writes: So  if  anyone know of a way I could help her (and","messageBody":"<div id=\"ygrps-yiv-779765195\">In a message dated 1/7/2005 10:25:57 AM Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> writes:<br/>\n<br/>\nSo  if  anyone know of a way I could help her (and myself) with the spelling  <br/>\nand maybe  if anyone knows of any software programs about  architecture <br/>\nplease <br/>\nlet me know  ASAP.<br/>\nThe Sims would be my best  bet for  your daughter to start off with.  You can <br/>\ndesign the  floorplans, then  choose from different kinds of walls, windows,  <br/>\nappliances, furniture,  accessories, colors, landscaping...and then  you get <br/>\nto <br/>\nput the people into  the environments and create lives for  them.  They have <br/>\nfamilies  and jobs, get fired or promoted, and  your kid has to figure out <br/>\nhow <br/>\nthey&#39;ll  deal with all  that.<br/>\n<br/>\n<br/>\n<br/>\n************************************<br/>\nOh, get The Sims 2!!!  Not that the Sims isn&#39;t wonderful, but the  <br/>\narchitectural design stuff in Sims 2 is even better!<br/>\n <br/>\nKathryn, an Addict <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":128601079,"authorName":"iamjill4ever@wmconnect.com","from":"iamjill4ever@...","profile":"creeksidemom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] questions:)","postDate":"1105072115","msgId":4588,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQuM2IwYmZjNDYuMmYwZjY5ZjNAd21jb25uZWN0LmNvbT4="},"prevInTopic":4584,"nextInTopic":4592,"prevInTime":4587,"nextInTime":4589,"topicId":4489,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/6/2005 11:56:09 AM Eastern Standard Time, ... Does she read a lot?  My experience has been that the more they read, the better they get at","messageBody":"<div id=\"ygrps-yiv-861715236\">In a message dated 1/6/2005 11:56:09 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kleincrew@...\">kleincrew@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So if anyone know of a way I could help her (and myself) with the spelling<br/>\n<br/>\n </span></blockquote>Does she read a lot?  My experience has been that the more they read, the <br/>\nbetter they get at spelling, but it comes at a much slower pace.  It takes more <br/>\nyears to grasp the spelling than to read the words.  <br/>\n<br/>\nAlso, is she able to use a spell checker on the computer?  That helps if they <br/>\nare using the computer.  <br/>\nJill in sc<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":198915868,"authorName":"JHarris866@aol.com","from":"JHarris866@...","profile":"quister1789","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] questions:)","postDate":"1105039700","msgId":4584,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQyLjFmYjA3YWRiLjJmMGVlYjU0QGFvbC5jb20+"},"prevInTopic":4583,"nextInTopic":4588,"prevInTime":4583,"nextInTime":4585,"topicId":4489,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/6/2005 10:58:47 A.M. Central Standard Time, kleincrew@power1.com writes: So if  anyone know of a way I could help her (and myself) with","messageBody":"<div id=\"ygrps-yiv-615018996\">In a message dated 1/6/2005 10:58:47 A.M. Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kleincrew@...\">kleincrew@...</a> writes:<br/>\n<br/>\nSo if  anyone know of a way I could help her (and myself) with the spelling <br/>\nand maybe  if anyone knows of any software programs about architecture please <br/>\nlet me know  ASAP.<br/>\nthanks for reading this long letter.<br/>\nhave a great day  all,<br/>\nHeidi<br/>\n<br/>\n<br/>\nHeidi ~<br/>\n <br/>\nMy dd is 14 now, and has been  through ALL that.  I have never given her one <br/>\nspelling test or done any  &quot;spelling classes&quot; at all.  Last night, she came <br/>\ndownstairs, all excited  about &quot;writing,&quot; and wanted to show me what she&#39;d <br/>\nwritten.  I went up to  look, and she&#39;d written the most wonderful paragraph about <br/>\nwhy she wanted to  write (become a writer).  When I got over the thrill & joy <br/>\nof  reading it (it was really insightful), I noticed that there was not one <br/>\nspelling  error!!!!!!  She just spells well because she sees words all the  <br/>\ntime!  She is, like your daughter, very independent, and if I tried to  &quot;teach&quot; <br/>\nher spelling, she would probably spell things wrong on purpose just to  make me <br/>\nstop pushing things at her.  <br/>\n <br/>\nBut, if I observe  her and note her interests...and make resources available <br/>\nto her along those  lines (without pushing anything on her), she will usually <br/>\nembrace  them.<br/>\n <br/>\nYour daughter said she didn&#39;t know  what she wanted to learn about, but <br/>\nyou&#39;ve seen her love to make art...so  there&#39;s your lead!<br/>\n <br/>\nSo, here&#39;s my recommendation for  programs.  They&#39;re not called &quot;Architecture <br/>\n101,&quot; but my daughter made a  3-D design for a log cabin dh & I want to <br/>\nbuild, using this first one:   The Sims.  Just buy it or borrow it - or, if you <br/>\nalready  have it, leave it lying around where she might find it...and don&#39;t <br/>\nmention  &quot;learning,&quot; &#39;cause sometimes they (my dd was in public school for a few  <br/>\nyears) equate that with &quot;schooling.&quot;  My daughter LOVES it.  You  design the <br/>\npeople, their personalities, their jobs, their families, and their  homes.  The <br/>\n3-D architecture might be better in the later versions (Sims  II?), but <br/>\nthey&#39;re all good.  The other ones she likes are the ones where  you design <br/>\ncivilizations - like Age of Mythology, Age  of Empires, etc.  With these, they design & <br/>\nbuild  villages, and they have to control their economies, deal with weather <br/>\ndisasters  & wars, strategy for survival, etc. These are great for learning <br/>\nabout  history, references to literature, economics, strategy, vocabulary, <br/>\nreading,  and, yes....SPELLING!  Plus, I think they&#39;re really good for developing  <br/>\nhigher-level thinking skills.<br/>\n <br/>\nMy dd is diagnosed with ADD (so am  I), which I think is just p.s./society&#39;s <br/>\nway of labeling creative people.   So we can&#39;t focus on boring, repetitive <br/>\nstuff?  What&#39;s wrong with  that? We get bored and our minds wander and imagine <br/>\nand create,  let&#39;s see...art, architecture, songs, plays, scientific <br/>\ndiscoveries, engineering  marvels....what&#39;s wrong with that?  My daughter can hyperfocus <br/>\nfor hours on  these games, because they are so fun and interesting.<br/>\n <br/>\nThe Sims would be my best bet for  your daughter to start off with.  You can <br/>\ndesign the floorplans, then  choose from different kinds of walls, windows, <br/>\nappliances, furniture,  accessories, colors, landscaping...and then you get to <br/>\nput the people into  the environments and create lives for them.  They have <br/>\nfamilies  and jobs, get fired or promoted, and your kid has to figure out how <br/>\nthey&#39;ll  deal with all that.<br/>\n <br/>\nI&#39;ll ask my daughter if she has  anymore recommendations.  See if your <br/>\ndaughter likes these, and, if so,  feel free to email me off-list & maybe we can <br/>\nhook them up on the computer  to discuss their Sims creations...thereby, having <br/>\nto READ eachother&#39;s  emails.<br/>\n <br/>\nPeace & love ~<br/>\n <br/>\nLeslie <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":197929377,"authorName":"Cheyenne Cain","from":"Cheyenne Cain &lt;cherokeecain@...&gt;","profile":"cherokeecain","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Hot tub and a lesson learned","postDate":"1105036096","msgId":4583,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMTA2MTgyODE2LjMxMDE5LnFtYWlsQHdlYjUxNTAyLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGNyaTBlcytjdXFvQGVHcm91cHMuY29tPg=="},"prevInTopic":4581,"nextInTopic":4584,"prevInTime":4582,"nextInTime":4584,"topicId":4489,"numMessagesInTopic":0,"msgSnippet":"Hi Jeanne. I remember your post about the kids in the hot tub.... Well, your not the only one who worries. I do too. My dd, Justice is 10 years old. She spends","messageBody":"<div id=\"ygrps-yiv-570541078\">Hi Jeanne. <br/>\nI remember your post about the kids in the hot tub....<br/>\n <br/>\nWell, your not the only one who worries. I do too. My dd, Justice is 10 years old. She spends most of her days playing around outside, making up dances and loves sports. Hardly &quot;schoolish&quot; to say the least. <br/>\n <br/>\nHowever, I thought I&#39;d give you a brief example of something I&#39;ve discovered about her lately.<br/>\n <br/>\nShe doesn&#39;t like books, infact one day a few monthes ago she informed me she was going to be just like other people we knew (adult and children) who didn&#39;t like books. And she really couldn&#39;t read much more then a hop on pop book. That really scared me. I tried to manipulate by bringing her to the library hoping something would catch her eye....she hated it. She has told me repeatedly she abhors the library. Finally I dropped it. <br/>\n <br/>\nThen I began to notice little things...like she can search the internet by herself to find her favorite music artist. Not bad for not being able to &quot;read.&quot;<br/>\n <br/>\nWe have what people refer to as the family bed. Nighttime is the time we use to really talk or not, sometimes I&#39;ll read and she watches tv until we fall asleep. Sometimes though, she wants me to read to her.The last book she wanted me to read was The Client by John Girshman. We only made it half way then decided to rent the movie. Then last night I picked up another book Winn-Dixie which will be released here soon as a movie. Well my dd takes the book from me and starts reading it. She read amazingly well. Ok, so maybe she only read two pages and missed a few words what I want to know is how she learned to read?? She got words like employee and manager. How?? And without phonics :) To say the least she was quite proud of herself. And so was I.<br/>\n <br/>\nMath I&#39;ve found to be the same way. Everynow and then she&#39;ll pull a math workbook from the shelf and work the problems. Yesterday she brought the book for me to grade...she had mastered &quot;carrying&quot; (when you add).....I don&#39;t remember ever &quot;teaching&quot; her how to do that. Maybe she saw me carrying while adding up the bills or tallying score for a game.  Yes, &quot;school wise&quot; she is behind.....but because she is doing it when she is ready it just clicks in minutes. It&#39;s amazing. I can&#39;t explain it..... <br/>\n <br/>\nMy lesson learned is this......when she is ready she&#39;ll learn it. If it&#39;s important to her she&#39;ll learn it. If she&#39;s curious about it she&#39;ll learn it. And I&#39;ll be there waiting to help her...... <br/>\n <br/>\nCheyenne<br/>\n <br/>\n <br/>\n <br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\n Yahoo! Mail - Find what you need with new enhanced search. Learn more.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":200184763,"authorName":"Heidi Here","from":"&quot;Heidi Here&quot; &lt;kleincrew@...&gt;","profile":"kleincrew","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] questions:)","postDate":"1105019353","msgId":4581,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzcwMWM0ZjNmNiQ4MWMzYmU1MCQwYjAwMDAwYUBNb20+","referencesHeader":"PGNyaHRndCthOHZkQGVHcm91cHMuY29tPiA8MDAwYzAxYzRmM2YyJGFkNGUxZmIwJDAyMDBhOGMwQHlvdXJvMGt3a3c5andjPg=="},"prevInTopic":4580,"nextInTopic":4583,"prevInTime":4580,"nextInTime":4582,"topicId":4489,"numMessagesInTopic":0,"msgSnippet":"WOW, when I read this I thought I wrote it! My dd is 12 also and came to me last night crying and telling me she wanted me to catch her up so she could go to","messageBody":"<div id=\"ygrps-yiv-1158391362\">WOW, when I read this I thought I wrote it! My dd is 12 also and came to me last night crying and telling me she wanted me to &quot;catch&quot; her up so she could go to school for a week or so! She said she felt like she wasn&#39;t learning anything at home and that she was dumb! Now she has her period( just got it for the first time) and is very low/high right now, even though she most times is low/high and always has been.<br/>\nWe had a long long talk and it comes down to that she cant spell so she feels dumb. I told her (like many times before) that she could learn about ANYTHING in the whole world that she wanted to , she just always really never wanted to learn about anything. I tried to work on her spelling through the years , she is the type of learner that wants to do it by herself and if she needs help and I step in she gets very defensive and then rolls her eyes and then gives up. So how do I help her with spelling without being the &quot;teacher&quot; and having her again &quot;give up&quot;?<br/>\nI myself am not a great speller (hate the English language! phone should be fon, darn it! lol !<br/>\nWe talked for awhile about just what &quot;school &quot; is and that&#39;s not what she wants, she wants friends...<br/>\nI asked her what she might want to learn about and she said she didn&#39;t know so she was dumb, break my heart to here her say that ( that&#39;s how I felt). Her older brother is VERY smart and always reading or researching what he is &quot;into&quot; and I know that must make her feel less then him, I am forever telling her how talented she is with her art work and decorating but she sees that as &quot;fun&quot; not being &quot;smart&quot; so we talked all about different jobs she could do with her interests and today she wants to go to the library to get some books on architecture, I told her that&#39;s what she has been doing all along with all the maps she draws of rooms. So I am so pleased with the way last night ended , no more tears and a light at the end of the tunnel which is really something for her, to sit and her me talk to her instead of her closing me out and rolling her eyes thinking she has it all figured out on her own ( again something her brother does easily.<br/>\nSo if anyone know of a way I could help her (and myself) with the spelling and maybe if anyone knows of any software programs about architecture please let me know ASAP.<br/>\nthanks for reading this long letter.<br/>\nhave a great day all,<br/>\nHeidi<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: J. Stauffer <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Thursday, January 06, 2005 8:21 AM<br/>\n  Subject: Re: [unschoolingbasics] questions:)<br/>\n<br/>\n<br/>\n  &lt;&lt;&lt;&lt;she is not what you would call an independant <br/>\n  learner-she lets others boss her.She never reads.<br/>\n  Any advice?&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n  I would suggest doing projects that she enjoys with you working right along beside her.  Perhaps a garden, weaving baskets (a lot of math skills there and if you make a mistake you simply back up and fix it), cooking, sewing, reading to her.<br/>\n<br/>\n  A wonderful resource that we use is 4-H.  We have found most of the kids and parents to be extremely friendly and tolerant of differences.  My 11yo who did a &quot;crash and burn&quot; when in Kindergarten for three months found his niche shooting skeet through 4-H.  We also raise rabbits, goats, train dogs, sew, bake, hold offices in the club, etc..<br/>\n<br/>\n  Julie S.<br/>\n<br/>\n<br/>\n    ----- Original Message ----- <br/>\n    From: cartoontv5 <br/>\n    To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n    Sent: Wednesday, January 05, 2005 5:33 PM<br/>\n    Subject: [unschoolingbasics] questions:)<br/>\n<br/>\n<br/>\n<br/>\n    Thank you Ren and Cheryl.I have a daughter who is 12 .If she were in <br/>\n    public school she would probably be in special or &quot;slow&quot; classes.I <br/>\n    have never had her tested .When she was 5 she went to kindergarten <br/>\n    for about 3 weeks.The teacher met with me and told me she would be <br/>\n    held back that year, needless to say I took her out.It was terrible <br/>\n    for her in school-kids were so mean to her.<br/>\n    I know you all dont believe in grade levels but just for an example <br/>\n    she would probably be  in a 3rd grade level if at school.How do I <br/>\n    help her?<br/>\n    She has a hard time answering questions anyone asks her or figuring <br/>\n    out things for herself, she is not what you would call an independant <br/>\n    learner-she lets others boss her.She never reads.<br/>\n    Any advice?<br/>\n                        Jeanne<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  ------------------------------------------------------------------------------<br/>\n    Yahoo! Groups Links<br/>\n<br/>\n      a.. To visit your group on the web, go to:<br/>\n      <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n        <br/>\n      b.. To unsubscribe from this group, send an email to:<br/>\n      <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n        <br/>\n      c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":196090915,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] questions:)","postDate":"1105017702","msgId":4580,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGMwMWM0ZjNmMiRhZDRlMWZiMCQwMjAwYThjMEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PGNyaHRndCthOHZkQGVHcm91cHMuY29tPg=="},"prevInTopic":4575,"nextInTopic":4581,"prevInTime":4579,"nextInTime":4581,"topicId":4489,"numMessagesInTopic":0,"msgSnippet":" I would suggest doing projects that she","messageBody":"<div id=\"ygrps-yiv-2096662732\">&lt;&lt;&lt;&lt;she is not what you would call an independant <br/>\nlearner-she lets others boss her.She never reads.<br/>\nAny advice?&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nI would suggest doing projects that she enjoys with you working right along beside her.  Perhaps a garden, weaving baskets (a lot of math skills there and if you make a mistake you simply back up and fix it), cooking, sewing, reading to her.<br/>\n<br/>\nA wonderful resource that we use is 4-H.  We have found most of the kids and parents to be extremely friendly and tolerant of differences.  My 11yo who did a &quot;crash and burn&quot; when in Kindergarten for three months found his niche shooting skeet through 4-H.  We also raise rabbits, goats, train dogs, sew, bake, hold offices in the club, etc..<br/>\n<br/>\nJulie S.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: cartoontv5 <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Wednesday, January 05, 2005 5:33 PM<br/>\n  Subject: [unschoolingbasics] questions:)<br/>\n<br/>\n<br/>\n<br/>\n  Thank you Ren and Cheryl.I have a daughter who is 12 .If she were in <br/>\n  public school she would probably be in special or &quot;slow&quot; classes.I <br/>\n  have never had her tested .When she was 5 she went to kindergarten <br/>\n  for about 3 weeks.The teacher met with me and told me she would be <br/>\n  held back that year, needless to say I took her out.It was terrible <br/>\n  for her in school-kids were so mean to her.<br/>\n  I know you all dont believe in grade levels but just for an example <br/>\n  she would probably be  in a 3rd grade level if at school.How do I <br/>\n  help her?<br/>\n  She has a hard time answering questions anyone asks her or figuring <br/>\n  out things for herself, she is not what you would call an independant <br/>\n  learner-she lets others boss her.She never reads.<br/>\n  Any advice?<br/>\n                      Jeanne<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":198915868,"authorName":"JHarris866@aol.com","from":"JHarris866@...","profile":"quister1789","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] questions:)","postDate":"1104975010","msgId":4575,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0NC4zYzg4NzNjYS4yZjBkZWVhMkBhb2wuY29tPg=="},"prevInTopic":4574,"nextInTopic":4580,"prevInTime":4574,"nextInTime":4576,"topicId":4489,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/5/2005 5:40:31 P.M. Central Standard Time, LJeanne28@aol.com writes: She  never reads. Jeanne ~  Just curious...are you sure she never","messageBody":"<div id=\"ygrps-yiv-831692833\">In a message dated 1/5/2005 5:40:31 P.M. Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:LJeanne28@...\">LJeanne28@...</a> writes:<br/>\n<br/>\nShe  never reads.<br/>\n<br/>\n<br/>\nJeanne ~  Just curious...are you sure she never reads?  Or do you  mean, she <br/>\nnever picks up a novel and reads it?  When I took my daughter out  of public <br/>\nschool, she would practically freak if I said the word,  &quot;read.&quot;  She would <br/>\nbalk at anything I suggested she (or  we) read. She said she hated reading...but <br/>\nwhat she really meant was  that she hated school.  Then, she would always be <br/>\n&quot;looking&quot; at books with  pictures....and words.  I had to deschool her and <br/>\nmyself (still working on  that - I was in much longer than she)...and it took <br/>\nabout two years before she  realized that it was schooling she hated - not <br/>\nreading.  Her impetus was  books like &quot;Everything About Cats.&quot;  She loved the <br/>\npictures, but really  wanted to know about the cats, so she would read every detail, <br/>\nand tell me about  every detail.  Then she went on to &quot;Guinness World Book of <br/>\nRecords,&quot; which  she would carry with her everywhere we went in the car, and <br/>\nquiz me.  It&#39;s  an annual celebration at our house when the next year&#39;s copy <br/>\ncomes out.   Then, of course, we had to get every other trivia or record book - <br/>\nlike &quot;Lists  of Historical Records,&quot; in which she quizzed me on such things as <br/>\nwhich  countries had the most casualties in WWII (see...traditional <br/>\n&quot;subjects&quot; CAN be  learned without textbooks).  Then, it was a progression of books <br/>\nuntil she  read her first Harry Potter book...and then said, &quot;I never realized <br/>\nthis, but I  love reading!&quot;<br/>\n <br/>\nThey also read when they play computer games (don&#39;t get me started on  <br/>\nvocabulary, spelling, economics, history, life skills, etc., etc., etc. they  learn <br/>\nfrom some of those...while they think they&#39;re just playing), video games,  <br/>\nlook for goodies in the grocery store.  Reading is just everywhere in  the <br/>\nworld...so if they follow their loves, I really believe they will eventually  end up <br/>\nreading (and enjoying it) to find out more about what THEY want to  know.  It <br/>\njust has to be on their terms and timetable.  I agree  w/what&#39;s been said so <br/>\nfar:  find her loves...and support her in that...and  everything else will <br/>\nfall into place.<br/>\n <br/>\nKeep the faith!<br/>\n <br/>\nPeace & love ~<br/>\n <br/>\nLeslie<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"questions:)","postDate":"1104971270","msgId":4574,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNyaTBtNit0MGNhQGVHcm91cHMuY29tPg=="},"prevInTopic":4573,"nextInTopic":4575,"prevInTime":4573,"nextInTime":4575,"topicId":4489,"numMessagesInTopic":0,"msgSnippet":" Have her tell you her interests and write them down together, then write down the steps it takes to do it and encourage her on her interests. A word of","messageBody":"<div id=\"ygrps-yiv-1970399343\">&quot; Have her tell you her interests and write them<br/>\ndown together, then write down the steps it takes to do it and <br/>\nencourage her on her interests.&quot;<br/>\n<br/>\nA word of caution here.<br/>\nSome kids love lists. For some, this is not a good idea.<br/>\nI especially don&#39;t think a mother, trying to grasp unschooling, <br/>\nshould make lists of a child&#39;s interests, except for themselves.<br/>\n<br/>\nYour child might feel that you will turn the things she tells you <br/>\ninto some kind of lesson, and not be as open as she could be <br/>\notherwise.<br/>\nYou KNOW your child&#39;s interests....look at them playing, listen to <br/>\nthem talk, hear them when they get excited.<br/>\nKeep notes for yourself, to remind you to pick up certain videos or <br/>\ngames or whatever. But try to not turn her interests into some list <br/>\nunless she likes the idea.<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"questions:)","postDate":"1104971036","msgId":4573,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNyaTBlcytjdXFvQGVHcm91cHMuY29tPg=="},"prevInTopic":4572,"nextInTopic":4574,"prevInTime":4572,"nextInTime":4574,"topicId":4489,"numMessagesInTopic":0,"msgSnippet":"How do I help her? She has a hard time answering questions anyone asks her or figuring out things for herself, she is not what you would call an independant ","messageBody":"<div id=\"ygrps-yiv-81652817\">&quot;How do I<br/>\nhelp her?<br/>\nShe has a hard time answering questions anyone asks her or figuring<br/>\nout things for herself, she is not what you would call an independant<br/>\nlearner-she lets others boss her.She never reads.<br/>\nAny advice?&quot;<br/>\n<br/>\nWhy do you feel she needs help? In answering questions? She&#39;s <br/>\nawfully young to have to fend against prying questions...you need to <br/>\nbe her barrier.<br/>\nI speak for my children when they don&#39;t want to speak. You need to <br/>\nbe her buffer against the world until she feels ready to deal with <br/>\nit.<br/>\n<br/>\n&quot;She never reads&quot;.<br/>\nInstead of focusing on what she doesn&#39;t do, focus on what she LOVES. <br/>\nDoes this child connect with nature? Or certain tv shows, or foods <br/>\nor colors or toys? What makes her happy (or as Anne would say &quot;what <br/>\nmakes her SHINE?)<br/>\nSee her as the perfect, whole, wonderful being she IS.<br/>\nIf you see her through eyes of lack, she will sense this, and see <br/>\nherself as lacking somehow.<br/>\nShe is lacking nothing by not reading yet. See her for the unique <br/>\nwonder each human being is. Help her shine by focusing on everything <br/>\nshe loves. Dive into her passions, get excited about the things she <br/>\nloves, see the world through HER eyes, not the very sad eyes of <br/>\nschoolthink.<br/>\nYour child needs you to honor her for exactly where she is today, <br/>\nnot where you think she should be.<br/>\n<br/>\nTell me more about the things she&#39;s good at. Tell me what makes her <br/>\nlaugh or feel happy and serene!! Tell me more about this child that <br/>\nis NOT slow (you got her away from the school, now we need to get <br/>\nthe school away from your mind!!) but BRIGHT.<br/>\n<br/>\nIf you tell us more about her passions and interests, I bet we could <br/>\nall come up with some great ways to honor that interest. She isn&#39;t <br/>\nlacking a thing..please believe that. <br/>\n<br/>\nReading comes when it comes, in the mean time, she doesn&#39;t need to <br/>\nfeel &quot;less than&quot; because she isn&#39;t doing something on somebody elses <br/>\ntime schedule.<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":184232345,"authorName":"CherylWarnke@AOL.com","from":"CherylWarnke@...","profile":"csleaf43","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] questions:)","postDate":"1104970634","msgId":4572,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI3LjRlYTU3NmJmLjJmMGRkZDhhQGFvbC5jb20+"},"prevInTopic":4571,"nextInTopic":4573,"prevInTime":4571,"nextInTime":4573,"topicId":4489,"numMessagesInTopic":0,"msgSnippet":"Hi Jeanne I would read to her, a lot, and get her into things that she is interested in (for instance, if she likes small animals, then get her a hamster, you","messageBody":"<div id=\"ygrps-yiv-1003178964\">Hi Jeanne<br/>\n <br/>\nI would read to her, a lot, and get her into things that she is interested  <br/>\nin (for instance, if she likes small animals, then get her a hamster, you will  <br/>\nfind that she will want to learn everything she can about it).  Kids learn  <br/>\nbest if it is interest-led.  Have her tell you her interests and write them  <br/>\ndown together, then write down the steps it takes to do it and encourage  her on <br/>\nher interests.<br/>\n <br/>\nGood Luck<br/>\nCheryl<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":111733540,"authorName":"cartoontv5","from":"&quot;cartoontv5&quot; &lt;LJeanne28@...&gt;","profile":"cartoontv5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"questions:)","postDate":"1104968029","msgId":4571,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNyaHRndCthOHZkQGVHcm91cHMuY29tPg=="},"prevInTopic":4509,"nextInTopic":4572,"prevInTime":4570,"nextInTime":4572,"topicId":4489,"numMessagesInTopic":0,"msgSnippet":"Thank you Ren and Cheryl.I have a daughter who is 12 .If she were in public school she would probably be in special or slow classes.I have never had her","messageBody":"<div id=\"ygrps-yiv-637975305\">Thank you Ren and Cheryl.I have a daughter who is 12 .If she were in <br/>\npublic school she would probably be in special or &quot;slow&quot; classes.I <br/>\nhave never had her tested .When she was 5 she went to kindergarten <br/>\nfor about 3 weeks.The teacher met with me and told me she would be <br/>\nheld back that year, needless to say I took her out.It was terrible <br/>\nfor her in school-kids were so mean to her.<br/>\nI know you all dont believe in grade levels but just for an example <br/>\nshe would probably be  in a 3rd grade level if at school.How do I <br/>\nhelp her?<br/>\nShe has a hard time answering questions anyone asks her or figuring <br/>\nout things for herself, she is not what you would call an independant <br/>\nlearner-she lets others boss her.She never reads.<br/>\nAny advice?<br/>\n                    Jeanne</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] questions:)","postDate":"1104545848","msgId":4509,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5My4zNjMwYjA3Yi4yZjA3NjIzOEBhb2wuY29tPg=="},"prevInTopic":4493,"nextInTopic":4571,"prevInTime":4508,"nextInTime":4510,"topicId":4489,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/29/2004 9:53:49 P.M. Eastern Standard Time, LJeanne28@aol.com writes: I wonder  though what you do when you have to have your children ","messageBody":"<div id=\"ygrps-yiv-560963444\">In a message dated 12/29/2004 9:53:49 P.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:LJeanne28@...\">LJeanne28@...</a> writes:<br/>\n<br/>\nI wonder  though what you do when you have to have your children  <br/>\ntested&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\nI don&#39;t *have* to have my children tested. Do you? Each state is different.  <br/>\nKnow your state laws. Many people here live in testing states and do different <br/>\n things. Which state are you in?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt; or how you would explain this to others(even other  homeschoolers).&lt;&lt;&lt;&lt;<br/>\n <br/>\n </span></blockquote>Welllll....., you don&#39;t *have* to explain anything! &lt;bwg&gt; <br/>\n <br/>\nInterest-based learning? The open classroom of the 70&#39;s? We simply don&#39;t  <br/>\n*do* school? Learning through living a rich life? Living is learning is  <br/>\nunschooling? Everything is connected: we don&#39;t divide life into  subjects?<br/>\n <br/>\nMost people don&#39;t *really* want to understand unschooling!<br/>\n <br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":196090915,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] questions:)","postDate":"1104412633","msgId":4493,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWEwMWM0ZWU3MSRlMzNkMzE1MCQwMjAwYThjMEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PGI4LjY4ZTNmNTY1LjJmMDU0ODY2QGFvbC5jb20+"},"prevInTopic":4492,"nextInTopic":4509,"prevInTime":4492,"nextInTime":4494,"topicId":4489,"numMessagesInTopic":0,"msgSnippet":" The only 2 cons we have come up against were with dealing with outside forces. One was when the little guys wanted to try","messageBody":"<div id=\"ygrps-yiv-538528186\">&lt;&lt;&lt;&lt;Can you point out one con?&gt;&gt;&gt;&gt;<br/>\n<br/>\nThe only 2 cons we have come up against were with dealing with outside forces.<br/>\n<br/>\nOne was when the little guys wanted to try public school.  Since they had never been in a rigid structure, they had great difficulty with the concept that they didn&#39;t have choices, were expected to finish assignments, etc., to the point that within 6 weeks 2 of the three teachers were requesting Special Education.  I fought it and within another 6 weeks, those same teachers were describing my kids as &quot;model students&quot; and &quot;really bright kids&quot;.  So it was just a transitional con but I had to be willing to stand up full force to the school to make sure they were willing to give the kids the &quot;elbow room&quot; they needed to make the adjustment.<br/>\n<br/>\n(The best part of the above was when the Kindergarten teacher asked me how I taught Danny his numbers so well and I informed her that he taught himself by working the microwave.)<br/>\n<br/>\nThe second con was dealing with friends who follow rigid curriculums and want to quiz the kids about stuff they &quot;should&quot; know.  None of my kids learned their multiplication tables so getting caught at the park with questions of &quot;What is 7x6?&quot; followed by lots of laughing wasn&#39;t fun for the kids.<br/>\n<br/>\nThe good side of it was that when the kids came to me to learn &quot;schooly&quot; types of stuff for whatever reason, it was fun and easy to teach them.<br/>\n<br/>\nMy oldest is 14 and a traditionalist through and through.  She has already scoped out the college she wants to go to and asked for a curriculum to fulfill the requirements (an accredited curriculum is required).  She had never had any type of math training since we pulled her out of school in 2nd grade....Within a month, she is doing &quot;A&quot; level work in 9th grade Algebra.<br/>\n<br/>\nSo again, there was the con of dealing with peers but the advantage was that we got to miss 7 years of me MAKING Adriane &quot;do&quot; math.  She brings her books to me rather than me fighting her to complete assignments.  Huge difference.<br/>\n<br/>\nJulie S.<br/>\n<br/>\nJulie S.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Thursday, December 30, 2004 6:02 AM<br/>\n  Subject: Re: [unschoolingbasics] questions:)<br/>\n<br/>\n<br/>\n  In a message dated 12/29/2004 9:53:49 P.M. Eastern Standard Time,  <br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:LJeanne28@...\">LJeanne28@...</a> writes:<br/>\n<br/>\n  I have  read all about unschooling for years(web sites and unschooling <br/>\n  handbook)  and can see pros and cons and have read about children who <br/>\n  were unhappy  about it and some who love it.&lt;&lt;&lt;<br/>\n<br/>\n  Could you point me to the books/articles you&#39;ve read about children who  were <br/>\n  unhappy about it?<br/>\n<br/>\n  I&#39;ve never seen one.<br/>\n<br/>\n<br/>\n  Can you point out one con?<br/>\n<br/>\n<br/>\n  ~Kelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] questions:)","postDate":"1104408166","msgId":4492,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI4LjY4ZTNmNTY1LjJmMDU0ODY2QGFvbC5jb20+"},"prevInTopic":4490,"nextInTopic":4493,"prevInTime":4491,"nextInTime":4493,"topicId":4489,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/29/2004 9:53:49 P.M. Eastern Standard Time, LJeanne28@aol.com writes: I have  read all about unschooling for years(web sites and","messageBody":"<div id=\"ygrps-yiv-359975409\">In a message dated 12/29/2004 9:53:49 P.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:LJeanne28@...\">LJeanne28@...</a> writes:<br/>\n<br/>\nI have  read all about unschooling for years(web sites and unschooling <br/>\nhandbook)  and can see pros and cons and have read about children who <br/>\nwere unhappy  about it and some who love it.&lt;&lt;&lt;<br/>\n <br/>\nCould you point me to the books/articles you&#39;ve read about children who  were <br/>\nunhappy about it?<br/>\n <br/>\nI&#39;ve never seen one.<br/>\n <br/>\n <br/>\nCan you point out one con?<br/>\n <br/>\n <br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"questions:)","postDate":"1104375383","msgId":4490,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNxdnFvbitibmcwQGVHcm91cHMuY29tPg=="},"prevInTopic":4489,"nextInTopic":4492,"prevInTime":4489,"nextInTime":4491,"topicId":4489,"numMessagesInTopic":0,"msgSnippet":"I wonder though what you do when you have to have your children tested or how you would explain this to others(even other homeschoolers). Well, to the first","messageBody":"<div id=\"ygrps-yiv-543977240\">&quot;I wonder though what you do when you have to have your children <br/>\ntested or how you would explain this to others(even other <br/>\nhomeschoolers).&quot;<br/>\n<br/>\nWell, to the first part, you live in Florida!! You don&#39;t have to <br/>\ntest if you don&#39;t want to....and why would an unschooler want to <br/>\ncompare their children to other children on pointless topics if they <br/>\ndon&#39;t have to?:)<br/>\nAs to the second question; don&#39;t.<br/>\nJust don&#39;t explain anything. A simple &quot;we homeschool&quot; is enough for <br/>\nmost people. If you&#39;re around a homeschooler and you need to clarify <br/>\na bit more, just explain that you do &quot;interest based&quot; learning, <br/>\nor &quot;natural&quot; learning. They won&#39;t get it, but most don&#39;t need to <br/>\nunless they are truly interested.<br/>\n<br/>\nI&#39;m glad you found your way here...keep on asking. I hope we can <br/>\ngive you some confidence to trust your children and escape the <br/>\nschool system if it&#39;s not working out well for them. You have years <br/>\nand years to research stuff, but your kids don&#39;t have years and <br/>\nyears to wait for you to get it. <br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":111733540,"authorName":"cartoontv5","from":"&quot;cartoontv5&quot; &lt;LJeanne28@...&gt;","profile":"cartoontv5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"questions:)","postDate":"1104361867","msgId":4489,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNxdmRpYitvc3U1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":4490,"prevInTime":4488,"nextInTime":4490,"topicId":4489,"numMessagesInTopic":0,"msgSnippet":"I want to thank you all for taking time to answer my questions(which you have probably heard a hundred times before).I am going to get at the web sites you all","messageBody":"<div id=\"ygrps-yiv-546738751\">I want to thank you all for taking time to answer my questions(which <br/>\nyou have probably heard a hundred times before).I am going to get at <br/>\nthe web sites you all recommended and try to find some of the  books <br/>\nalso.<br/>\nI have read all about unschooling for years(web sites and unschooling <br/>\nhandbook) and can see pros and cons and have read about children who <br/>\nwere unhappy about it and some who love it.<br/>\nI wonder though what you do when you have to have your children <br/>\ntested or how you would explain this to others(even other <br/>\nhomeschoolers).Hope to hear from you all again...........<br/>\n                                 Jeanne</div>","specialLinks":[]}],"prevTopicId":4546,"nextTopicId":4595}}