{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":370381503,"authorName":"Latha Poonamallee","from":"Latha Poonamallee &lt;poonamallee@...&gt;","profile":"lathapoonamallee","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: How feasible is it to expect to work from home while Unschooling?","postDate":"1333155068","msgId":48177,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRVRUQjdpd3JTdmJEVEdlUEJCQ0pMbmJhMD1ONzlEdHdHMjBadlpNUj1VTW9LVVFHd0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGpsMTFpbys1cW9kQGVHcm91cHMuY29tPg==","referencesHeader":"PGprdXVmZytmNzIwQGVHcm91cHMuY29tPgk8amwxMWlvKzVxb2RAZUdyb3Vwcy5jb20+"},"prevInTopic":48129,"nextInTopic":0,"prevInTime":48176,"nextInTime":48178,"topicId":48115,"numMessagesInTopic":0,"msgSnippet":"It is quite feasible if you require less sleep or can survive on less sleep for a few years at the least. I am a sole parent and a professional worker. Like","messageBody":"<div id=\"ygrps-yiv-771120675\">It is quite feasible if you require less sleep or can survive on less sleep<br/>\nfor a few years at the least. I am a sole parent and a professional worker.<br/>\nLike you can, I can do most of my work (research) from home. I am required<br/>\nto be on site anywhere between 7 and 10/12 on site. Over the years, my<br/>\nson&#39;s (9) needs have changed. Initially, I needed to be fully present with<br/>\nhim during his play time. Now, he is a lot more independent and considerate<br/>\nof my work time needs. The things that have worked for me:<br/>\n<br/>\n1. Reorganize the workspace.<br/>\n<br/>\nHe and I share our basement for our work/play/his TV watching/computer play<br/>\netc. He has the big desk with the computer and I have a laptop, so can work<br/>\nfrom anywhere. There is also an accompanying mental shift here. Most people<br/>\ntend to believe that they don&#39;t get disturbed at their workplace. From my<br/>\nexperience, I am a lot more productive and efficient with my time at home<br/>\nthan at work/office, where people keep dropping in to chat etc. Again, I<br/>\nhad mine I was a grad student and a sole parent and got used to working<br/>\nwith him on my lap and shoulders.<br/>\n<br/>\n2. Understand my workflow/components and reorganize it.<br/>\n<br/>\nThere are elements in my work that I can do on autopilot without requiring<br/>\nfull focus and attention. I do those when I am with him. Other times (like<br/>\nwriting), I need complete attention and focus and so I work at nights. Of<br/>\nlate, after having hit my 40s, I seem to require more sleep than I did in<br/>\nmy thirties. Fortunately, this has coincided with his burgeoning interests<br/>\nin various activities like fencing, teakwood, music, and art. So when he is<br/>\naway doing stuff, that gives me a few hours of uninterrupted work time.<br/>\nFurther, he is at an age where he doesn&#39;t require me right next to him<br/>\nwhile he is watching TV or doing his own thing. He knows that I am in the<br/>\nhouse and can come to me for anything he needs except when I am taking<br/>\nconference calls (probably 6-10 hours a month max). Which I let him know in<br/>\nadvance. Heck, I have even started to work out an hour a day for the past<br/>\nfew months and he is totally supportive of it. If there are extreme<br/>\ndeadlines for grant or paper submission, I usually I know them well in<br/>\nadvance. During those times, I might take the help of babysitters. What<br/>\nreally helps me is planning my workload, being super efficient with my<br/>\ntime, and more importantly not leaving stuff for the last minute. I am<br/>\nusually a last minute person burning the midnight oil before the deadline<br/>\nbut I have had to change my work patterns so I almost always am on top of<br/>\nit and anything that requires to be done in the last 24-48 hours is<br/>\ntweaking and editing and not the whole production.<br/>\n<br/>\n3. Reliable Social Networks<br/>\n<br/>\nI cannot overstress the importance of finding a reliable, supportive social<br/>\nnetwork for working/homeschooling parents. I am in a small town in the<br/>\nmiddle of nowhere, where there are no unschoolers but quite a thriving<br/>\ngroup of homeschooling families. I have developed a good network with these<br/>\nfamilies and they have continued to provide me with reliable homeschooling<br/>\nteens for babysitters/companions. But I have had to be openminded about<br/>\ntheir philosophical orientations to life and find commonalities that bridge<br/>\nour lives than be picky about who I will socialize with. They all know that<br/>\nmy son is unschooled but the fact that we have all made a choice to home<br/>\neducate our children and put our children&#39;s well-being above every other<br/>\nconcern seems to be a stronger bonding element than our differences. Most<br/>\nof them are traditional, anglo families with a strong conservative,<br/>\nChristian orientation. This may not be true of big cities but is very<br/>\ncommon in smaller, rural areas like where I live. For example, there is a<br/>\ngym day every week at a local universities, I have families that will bring<br/>\nmy son with him thus giving me a couple of hours every week.<br/>\n<br/>\nHope you find it helpful and good luck!<br/>\n<br/>\nLatha<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Mar 29, 2012 at 3:04 AM, lindaguitar &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lindaguitar@...\">lindaguitar@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;unscooldad&quot; &lt;slkirk@...&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; ... I&#39;m curious how feasible is it to expect to work from home while<br/>\n&gt; &gt; unschooling?<br/>\n&gt;<br/>\n&gt; I know some single moms who do it.<br/>\n&gt;<br/>\n&gt; One is a graphic designer. Another runs a day care center in her home.<br/>\n&gt; Another one is a real estate agent.<br/>\n&gt;<br/>\n&gt; I know some parents who work from their homes who earn enough money that<br/>\n&gt; they could easily afford to hire a babysitter if they needed someone to<br/>\n&gt; keep the kids occupied for a while, if they were to decide to<br/>\n&gt; homeschool/unschool. I used to babysit for a couple of public schooled kids<br/>\n&gt; after school every day, while their work-at-home mom finished her work in<br/>\n&gt; her home office. She&#39;s an accountant. She worked until 6:00 PM, so I<br/>\n&gt; babysat from 4-6 every school day.<br/>\n&gt;<br/>\n&gt; So, if your IT job pays reasonably well, you could always hire a<br/>\n&gt; babysitter for a few hours a day, if your kids seem to need more attention<br/>\n&gt; than you can give them while working, or if they need someone to take them<br/>\n&gt; out to a park or museum, etc, when you&#39;re busy.<br/>\n&gt;<br/>\n&gt; Linda<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: How feasible is it to expect to work from home while Unschooling?","postDate":"1333042208","msgId":48129,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsMjY3MCtudGJjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGprdXVmZytmNzIwQGVHcm91cHMuY29tPg=="},"prevInTopic":48122,"nextInTopic":48177,"prevInTime":48128,"nextInTime":48130,"topicId":48115,"numMessagesInTopic":0,"msgSnippet":"... *************** It really depends on your kids and how effectively you can multi-task. If you need big chunks of dedicated time to get work done, and you","messageBody":"<div id=\"ygrps-yiv-668512446\">&quot;unscooldad&quot; &lt;slkirk@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I could work some in the early mornings and evenings to make up time spent with the kids during the day but I&#39;m curious how feasible is it to expect to work from home while unschooling?<br/>\n </span></blockquote>***************<br/>\n<br/>\nIt really depends on your kids and how effectively you can multi-task. If you need big chunks of dedicated time to get work done, and you have kids who need a lot of social interaction, it may be reeeeeaaaallllly tough to try and work from home. <br/>\n<br/>\nThe keys to juggling work and unschooling seem to be flexibility and creativity - figuring out how to manage your time so your kids get all of &quot;you&quot; they need. <br/>\n<br/>\nI&#39;m interested in the fact you&#39;re saying &quot;we&quot; though - does your spouse/partner work also? Or are you thinking both parents need to be home to unschool? If both of you work, then it may help to think creatively as to how to juggle your hours and financial needs so that the kids have a parent home all or most of their waking hours. That can happen in a variety of different ways, and working at home is one of them, but if you need dedicated work time, it&#39;s not helpful to &quot;count&quot; that as &quot;time home with the kids&quot;. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: How feasible is it to expect to work from home while Unschooling?","postDate":"1333004696","msgId":48122,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsMTFpbys1cW9kQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGprdXVmZytmNzIwQGVHcm91cHMuY29tPg=="},"prevInTopic":48115,"nextInTopic":48129,"prevInTime":48121,"nextInTime":48123,"topicId":48115,"numMessagesInTopic":0,"msgSnippet":"... I know some single moms who do it. One is a graphic designer. Another runs a day care center in her home. Another one is a real estate agent. I know some","messageBody":"<div id=\"ygrps-yiv-581067241\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;unscooldad&quot; &lt;slkirk@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; ... I&#39;m curious how feasible is it to expect to work from home while<br/>\n&gt; unschooling?<br/>\n<br/>\n </span></blockquote>I know some single moms who do it.<br/>\n<br/>\nOne is a graphic designer. Another runs a day care center in her home. Another one is a real estate agent.<br/>\n<br/>\nI know some parents who work from their homes who earn enough money that they could easily afford to hire a babysitter if they needed someone to keep the kids occupied for a while, if they were to decide to homeschool/unschool. I used to babysit for a couple of public schooled kids after school every day, while their work-at-home mom finished her work in her home office. She&#39;s an accountant. She worked until 6:00 PM, so I babysat from 4-6 every school day.<br/>\n<br/>\nSo, if your IT job pays reasonably well, you could always hire a babysitter for a few hours a day, if your kids seem to need more attention than you can give them while working, or if they need someone to take them out to a park or museum, etc, when you&#39;re busy.<br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":239759079,"authorName":"unscooldad","from":"&quot;unscooldad&quot; &lt;slkirk@...&gt;","profile":"unscooldad","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"How feasible is it to expect to work from home while Unschooling?","postDate":"1332935984","msgId":48115,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGprdXVmZytmNzIwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":48122,"prevInTime":48114,"nextInTime":48116,"topicId":48115,"numMessagesInTopic":0,"msgSnippet":"We haven t taken the plunge yet but are strongly leaning toward unschooling. We have four children, ages 7, 8, 10 and 11. I (Dad) am a computer programmer and","messageBody":"<div id=\"ygrps-yiv-850065080\">We haven&#39;t taken the plunge yet but are strongly leaning toward unschooling. We have four children, ages 7, 8, 10 and 11. I (Dad) am a computer programmer and as such could work from home. In fact I have done that whenever a child has been sick.<br/>\n<br/>\nI could work some in the early mornings and evenings to make up time spent with the kids during the day but I&#39;m curious how feasible is it to expect to work from home while unschooling?</div>","specialLinks":[]}],"prevTopicId":389,"nextTopicId":48120}}