{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":40,"messages":[{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] list guidelines","postDate":"1330357303","msgId":47971,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyM0EwRDk5LUM2QjMtNDIxNy04MEYyLTBCNjQ1OUYxNDkwRkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGppZzQwNSsyanBoQGVHcm91cHMuY29tPg==","referencesHeader":"PGppZzQwNSsyanBoQGVHcm91cHMuY29tPg=="},"prevInTopic":47970,"nextInTopic":47972,"prevInTime":47970,"nextInTime":47972,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"... *Everyone s* ideas are scrutinized, not just the original posters. Mine too. THIS LIST IS DIFFERENT FROM WHAT MOST PEOPLE ASSUME! The purpose of the list","messageBody":"<div id=\"ygrps-yiv-1547915067\">On Feb 27, 2012, at 9:29 AM, Tova wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I understand the purpose of the boards,<br/>\n<br/>\n </span></blockquote>Not if you&#39;re also writing:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I did not ask for help or analyzation of my words, why is it okay on any<br/>\n&gt; board to get attacked and inundated with &#39;you&#39;re wrong and I&#39;m right&#39; when I reply to a user? <br/>\n<br/>\n </span></blockquote>*Everyone&#39;s* ideas are scrutinized, not just the original posters. Mine too.<br/>\n<br/>\nTHIS LIST IS DIFFERENT FROM WHAT MOST PEOPLE ASSUME! <br/>\n<br/>\nThe purpose of the list is *not* &quot;sharing what works for my family&quot; as people sometimes assume.<br/>\n<br/>\nThe purpose of the list is offer information what will help people steer themselves toward stronger relationship and supported exploration of interests.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It goes away from unschooling ideas to not welcome diversity in thought.<br/>\n<br/>\n </span></blockquote>The list isn&#39;t a place for exploring interests freely. That&#39;s what the internet is for. It&#39;s a tiny little side pocket of information about radical unschooling that anyone can dip into to learn about radical unschooling.<br/>\n<br/>\nPeople expect the page on black holes at Wikipedia to be about black holes not about hyenas. I&#39;m sorry you don&#39;t agree that your posts are steering off the course of radical unschooling but it isn&#39;t your list  and the criteria of what is helpful or not are up to Meredith.<br/>\n<br/>\nIf you&#39;d like a list that has a broader definition of unschooling, and you think everyone here is being held hostage, please do start one! They&#39;re free and easy. You can advertise it here. If you&#39;re right, there will just be a handful of us left here. <br/>\n<br/>\nThe audience of this list is those who want the analysis of ideas. It&#39;s intended to be specialized and if the audience is half a dozen people who love it, that&#39;s fine. Bigger is not better. Useful to the people it&#39;s intended for is better in my opinion.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Every time I post on this board I end up feeling ashamed to be a part of the unschooling community. <br/>\n<br/>\n </span></blockquote>This isn&#39;t a community. It&#39;s closer to a Wikipedia page tightly focused on radical unschooling that also answers questions.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":250057382,"authorName":"Tova","from":"&quot;Tova&quot; &lt;ml_ja@...&gt;","profile":"ml_ja","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: list guidelines","postDate":"1330352965","msgId":47970,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppZzQwNSsyanBoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGppZHFvMytxYm5mQGVHcm91cHMuY29tPg=="},"prevInTopic":47969,"nextInTopic":47971,"prevInTime":47969,"nextInTime":47971,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"I understand the purpose of the boards, but it does not seem that ideas should be so brutally analyzed of people who reply to the original poster, but only of","messageBody":"<div id=\"ygrps-yiv-897988415\">I understand the purpose of the boards, but it does not seem that ideas should be so brutally analyzed of people who reply to the original poster, but only of original posters and people looking for help. I was not the poster, I was obviously NOT looking for help or a lecture for my reply. I did not ask for help or analyzation of my words, why is it okay on any board to get attacked and inundated with &#39;you&#39;re wrong and I&#39;m right&#39; when I reply to a user?<br/>\n<br/>\nYou can not use the purpose of the board as justification to bully someone&#39;s opinion.<br/>\n<br/>\nIt goes away from unschooling ideas to not welcome diversity in thought. How am I supposed to be open to listening to your opinions when you are telling me my opinion is wrong and ridiculous from the get go?<br/>\n<br/>\nEvery time I post on this board I end up feeling ashamed to be a part of the unschooling community.</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Paying children for chores","postDate":"1330281965","msgId":47969,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEREMTQwQURDLTJCMDQtNEIwNy1BQUJCLTgwMEY0RDA2N0ZGN0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEzMzAyNjc5NzguMTQyNzQuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDIubWFpbC5iZjEueWFob28uY29tPg==","referencesHeader":"PDEzMzAyNjc5NzguMTQyNzQuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDIubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":47968,"nextInTopic":47970,"prevInTime":47968,"nextInTime":47970,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"... As Meredith said, she owns the list. I m a moderator. Sandra isn t on this list. It s clarity of ideas that can help others understand radical unschooling","messageBody":"<div id=\"ygrps-yiv-1853442721\">On Feb 26, 2012, at 9:52 AM, Tova wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; As an unschooler for 11 years, I would like to post a reply<br/>\n&gt; on these unschooling boards run by Joyce or Sandra<br/>\n&gt; without my response being torn apart, told that what I feel<br/>\n&gt; is completely wrong,<br/>\n<br/>\n </span></blockquote>As Meredith said, she owns the list. I&#39;m a moderator. Sandra isn&#39;t on this list.<br/>\n<br/>\nIt&#39;s clarity of ideas that can help others understand radical unschooling that counts, not years unschooling. My ideas, Meredith&#39;s, Schuyler&#39;s, they&#39;re all up for dissection. I *expect* my ideas to be scrutinized and pulled apart if they aren&#39;t clear or sound.<br/>\n<br/>\nThat&#39;s what this list promises to do. To not pull ideas apart would be to fail to do what the list promises its members it will do.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Someone wrote to me from one of these boards saying<br/>\n&gt; they were scared to post for these reasons as well. That is sad.<br/>\n<br/>\n<br/>\n </span></blockquote>If this were a social list where the goal was to create a place where all unschoolers felt welcome, that would be sad.<br/>\n<br/>\nBut the purpose of the list is to create a collection of sound information and discussion about how radical unschooling. If someone doesn&#39;t feel confident their ideas can be pulled apart they should read and turn the ideas over, pull them apart for themselves until their understanding grows.<br/>\n<br/>\nIf I join a list to get specialized information I *want* those with more knowledge to be scrutinizing the posts that appear on the list. I want my ideas pulled apart, to be shown where my understanding is off. I&#39;m not going to be able to trust the information otherwise.<br/>\n<br/>\nThere is a difference between working to understand how veganism works and accepting everything written about it as Truth. There is a difference between working to understand how radical unschooling works and accepting what&#39;s written here as Truth. I hope no one here is accepting what is written as Truth for all or even for them. What&#39;s written here is about what helps and hinders radical unschooling (as defined here) and why. That&#39;s all.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There is not only one way to unschool.<br/>\n<br/>\n </span></blockquote>There are many approaches that are labeled unschooling.<br/>\n<br/>\nThis list is for discussing one particular approach called radical unschooling. Sandra Dodd coined the term because some in the AOL homeschooling forum didn&#39;t want to expand the principles of unschooling into parenting. So creating a distinct term provided a way to distinguish the two ideas.<br/>\n<br/>\nUndoubtedly people are labeling a variety of ideas &quot;radical unschooling&quot; but to be clear, what&#39;s being discussed here is what was being discussed on AOL: extending the principles of unschooling into parenting.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Your way is not better or more right than mine.<br/>\n<br/>\n </span></blockquote>No one&#39;s making claims about who is right or better.<br/>\n<br/>\nIf someone wants to discuss Zen Buddhism exclusively, that doesn&#39;t mean it&#39;s the best for everyone. It means they want a place where the focus is on a particular subject without time being wasted on other subjects.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sure discussing things can be good when it&#39;s asked for<br/>\n<br/>\n </span></blockquote>By signing onto the list, when list members post they *are* asking for it. It&#39;s in the list description.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Paying children for chores","postDate":"1330278102","msgId":47968,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzAyNzgxMDIuMzU3MS5ZYWhvb01haWxOZW9Ad2ViODE1MDIubWFpbC5tdWQueWFob28uY29tPg==","inReplyToHeader":"PDEzMzAyNjY0NjUuMTg4ODguWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDEubWFpbC5iZjEueWFob28uY29tPg==","referencesHeader":"PGppY2FpaitrMWg1QGVHcm91cHMuY29tPiA8MTMzMDI2NjQ2NS4xODg4OC5ZYWhvb01haWxDbGFzc2ljQHdlYjE2MTcwMS5tYWlsLmJmMS55YWhvby5jb20+"},"prevInTopic":47967,"nextInTopic":47969,"prevInTime":47967,"nextInTime":47969,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"    That s strictly my work, housework I consider the whole house, not someone s personal space. Is your daughters room/space/things consider her work","messageBody":"<div id=\"ygrps-yiv-1270081054\"> <br/>\n<br/>\n<br/>\n  <br/>\n&quot;&quot;That&#39;s strictly my work, housework I consider the whole house, not someone&#39;s personal space.&#39;&#39;<br/>\n<br/>\n<br/>\nIs your daughters room/space/things consider her work too? Or do you help her clean her &quot;work&quot;?<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"list guidelines","postDate":"1330277955","msgId":47967,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppZHFvMytxYm5mQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMzAyNjc5NzguMTQyNzQuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDIubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":47966,"nextInTopic":47968,"prevInTime":47966,"nextInTime":47968,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"... Joyce doesn t run this one, I do ;) ... ************** I know most people don t bother to read list guidelines when they first go out in that stack of","messageBody":"<div id=\"ygrps-yiv-1821205338\">Tova &lt;ml_ja@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;unschooling boards run by Joyce<br/>\n<br/>\n </span></blockquote>Joyce doesn&#39;t run this one, I do ;) <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I would like to post a reply on these unschooling boards run by Joyce or Sandra without my response being torn apart, told that what I feel is completely wrong, without my feelings and ideas being highly controversial offering a debate for all.<br/>\n </span></blockquote>**************<br/>\n<br/>\nI know most people don&#39;t bother to read list guidelines when they first go out in that stack of welcome messages etc - I&#39;m bad about that, too. But here they are, just to be clear:<br/>\n<br/>\n1.    Please! Only post issues and topics that you are open to having discussed. Because our lifestyles and families are dear to our hearts, you may find you&#39;re sensitive to having others analyze your words. If you&#39;d like to ask a question or start a discussion but would like a little &quot;distance&quot; from the topic so that you don&#39;t feel threatened by the ensuing discussion, moderators are happy to post something for you anonymously. Its generally a good idea to plan to lurk for a couple weeks to get the &quot;feel&quot; of the list  the format may be different from other lists and forums you&#39;ve encountered before and can take some time to get used to. <br/>\n<br/>\n2.      As much as possible, be conscious of the words you choose to express your ideas  in print like this, words are all we have of &quot;you&quot; after all, and no-one likes to be misunderstood&#61516;. Inflammatory language, in particular, doesn&#39;t help to keep the communication lines open. <br/>\n<br/>\n3.      When someone&#39;s post doesn&#39;t seem as graceful, skillful, or clear as it could be, it&#39;s best to assume positive intent. People come here to learn and share information, but not everyone is a great writer or has a style of writing that&#39;s accessible to everyone else. Its generally unhelpful to discuss another&#39;s style or tone. Discussing other posts (as opposed to the topics in those posts) is known as &quot;meta-discussion&quot; and detracts from the focus of the list. <br/>\n<br/>\n4.      This list supports AP styles of parenting, which include no spanking or punitive methods.  If you are interested in learning methods of parenting that do not involve punishment and hitting, this is a wonderful resource. We love helping families find more positive ways of relating.  If you are interested in defending punitive styles, this might not be the best list for you.  Many of us have used these methods in the past and found new and better ways of relating to our children. While you will find support if you&#39;re interested in learning new methods, you will also find some pretty strong opinions if you believe punitive/controlling parenting is best.<br/>\n<br/>\n5.      This is a secular list, meaning that anyone of any religious persuasion (or none at all) is welcome here. We understand that the topic of religion may surface and that is acceptable, but we do not allow preaching or religious debates of any kind. We are a diverse list and we ask all members to simply respect the fact that our list represents many different belief systems. We are all here to discuss unschooling and how it applies in all of our lives.<br/>\n<br/>\n6.      All new members will be moderated in order to prevent spam from reaching the list. We try to remove members from moderated status quickly, but please be patient. It&#39;s also a chance for you to get a feel for the &quot;culture&quot; of the list. Members who continually challenge list guidelines or flood the list with topics irrelevant to unschooling will be returned to moderation as a courtesy to other members. The moderators try to assume positive intent, and know that sometimes people need space to vent and process while also maintaining an awareness of the needs and boundaries of the list as a whole. <br/>\n<br/>\n7.      Please delete old posts attached to your reply. You&#39;ll notice many regular writers to the list will quote sections of posts and respond to specific statements, while others will respond to posts in a more general sense, and both styles can work very well, but it&#39;s a nuisance to read through a stack of previous posts attached to a reply, particularly for people who receive messages in digest form  Trim your posts! Its is also helpful to change the subject line when you alter then topic of the post. This helps other readers in the moment as well as making the archives easier to search. <br/>\n<br/>\n8.     While sending private emails can be a marvelous way to connect with like-minded individuals, we strongly encourage people to use local lists for that purpose whenever possible. Sending unkind messages privately is a violation of personal boundaries, however. If a list member sends you an unkind message, please bring that to the attention of the list moderators.</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Paying children for chores","postDate":"1330276344","msgId":47966,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppZHA1byszYjBiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMzAyMDA3OTUuMTU4NzQuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDEubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":47965,"nextInTopic":47967,"prevInTime":47965,"nextInTime":47967,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"... ******************* You seem to be envisioning a very different scenario than what others are discussing - the difference between a child saying I want to","messageBody":"<div id=\"ygrps-yiv-1543472302\">Tova &lt;ml_ja@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;But isn&#39;t it great when a child has interest in taking the reins over? That means that as parents we can back off, and let the child take over more.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nYou seem to be envisioning a very different scenario than what others are discussing - the difference between a child saying &quot;I want to do this&quot; and a parent saying &quot;You Will do this, and I&#39;ll pay you&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;That means that as parents we can back off, and let the child take over more.<br/>\n </span></blockquote>*************<br/>\n<br/>\nSometimes, slowly, eventually, maybe. But a common mistake is for parents to back off too soon, when a kid still needs support and backup. One of the wonderful things about unschooling is there&#39;s no timetable, no date by which a kid &quot;should&quot; be doing something, whether that &quot;something&quot; is reading or doing his own laundry. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;By not backing off and continuing to give money or whatever, the parent is taking away a valuable fulfilling growing experience from the child.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nIt Is possible for parents to actually prevent kids from doing things they want to do. I&#39;ve seen that with parents of little kids, swooping in to wipe up a spill and not thinking to offer the 2yo a towel to help. I&#39;ve seen it with parents of teens, continuing to micromanage their lives when the kids are itching to make their own decisions. <br/>\n<br/>\nPeople learn best when they have the help and support they need - not a super, smothering abundance, nor so little as to leave them floundering. The catch, is that each individual person needs different amounts of help at different times for different things. So as parents, it makes a big difference to watch and listen to our kids, and to open doors without shoving them through, as it were, and by leaving the door open for when kids realize (as they sometimes do) they&#39;ve gone further than they&#39;re ready for, and need to come back in from the cold for awhile. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;To struggle or work hard to obtain something can be a good thing.<br/>\n<br/>\n </span></blockquote>It can be when it&#39;s something chosen. What makes it &quot;a good thing&quot; is choice. Being made to struggle isn&#39;t so good. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Paying children for chores","postDate":"1330274872","msgId":47965,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzAyNzQ4NzIuNjc0NDYuWWFob29NYWlsTmVvQHdlYjg3MzAxLm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDEzMzAyNjY4OTIuNTA2NzUuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDUubWFpbC5iZjEueWFob28uY29tPg==","referencesHeader":"PEYwMTA1OTNGLUZGNDItNDkzNC1BNkE3LTgzQTA1QUZGREI4RkB2ZXJpem9uLm5ldD4gPDEzMzAyNjY4OTIuNTA2NzUuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDUubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":47964,"nextInTopic":47966,"prevInTime":47964,"nextInTime":47966,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"Carl made some money and invested it and then his investment made money while he went on living his life. The money, technically, did the work. He got paid for","messageBody":"<div id=\"ygrps-yiv-1501798258\">Carl made some money and invested it and then his investment made money while he went on living his life. The money, technically, did the work. He got paid for playing the role of financier. He got paid for taking the financial risk. But that isn&#39;t a work=money truth. That&#39;s a Carl gambled, presumably with some information, and came away with money kind of truth. <br/>\n<br/>\n<br/>\nLots of money making is gambling. David works as hard as he did 2 years ago, but because the value of the pound has gone down due to the Bank of England holding interest rates at an all time low, and because of uncertainity in the European Union, his wage is worth less in real terms. It buys less. Therefore his equation of work=money has an inflationary effect making it a nonlinear relationship. So there are some other bits that need to be thrown into the work=money equation. Ooh, ooh, I know, people with less fluctuating asymmetry make more money for the same work, so looks+work=money. Oh, and woman tend to make less money than men in the same job, or at least they used to so gender+work=money. Oh, and as you&#39;ve already alluded to welfare, for some folks struggling to find jobs, or who are unable to work due to health or other circumstances, having a government that is working to make their citizens lives liveable, not working=money. Oh and being born<br/>\n in the right place and at the right time can make you money in greater amounts than you would if your circumstances were different. Oh and having the right colour skin helps, or the right accent, or the right hair colour. <br/>\n<br/>\n<br/>\nThe problem isn&#39;t this, necessarily. It is more that you are holding on to your vision of the world so tightly, with such a firm and unwavering grasp, that you can&#39;t possibly see what is being suggested. Your daughter probably already knows that money usually comes after paid labour of some sort or another and you don&#39;t need to work to make her see that. And sharing what you can with her, instead of being afraid that she will feel entitled to things if she doesn&#39;t do some work for monetary recompense, isn&#39;t going to hinder her understanding of that reality. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n From: Tova &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ml_ja@...\">ml_ja@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSent: Sunday, 26 February 2012, 14:34<br/>\nSubject: Re: [unschoolingbasics] Paying children for chores<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;We&#39;ve invested in a few stocks that sold for little that are now selling<br/>\n </span></blockquote>for more. There was no work involved in getting that extra money.<br/>\n<br/>\nThere is a lot of work behind having that money available. Work by you when you took time to invest in the stock, and a huge amount of work by everyone who makes that company exist, continue to run, and make the stock available to you. That money didn&#39;t come from nowhere; a lot of work is behind that money.<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Paying children for chores","postDate":"1330274476","msgId":47964,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppZG5iYyt0ZGFwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMzAxOTQ5NzQuMjk0MTEuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDYubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":47963,"nextInTopic":47965,"prevInTime":47963,"nextInTime":47965,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"... *************** In terms of finances, I have very little - and yet I ve found lots of ways to be generous and kind to my kids. And despite popular wisdom","messageBody":"<div id=\"ygrps-yiv-661327296\">Tova &lt;ml_ja@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Giving excessively is not a viable option, for example for families with very little<br/>\n </span></blockquote>***************<br/>\n<br/>\nIn terms of finances, I have very little - and yet I&#39;ve found lots of ways to be generous and kind to my kids. And despite popular wisdom that this will make them greedy, I&#39;ve found they return generosity and kindness to me. From other unschooling families, I know that&#39;s a common effect - kindness begets kindness. <br/>\n<br/>\nThe tricky thing with kids is for adults to step past preconceived notions of what it looks like when a child is helpful. Children are generous and giving in their Own ways from a pretty early age - but if you&#39;re expecting someone to clean the catbox, it won&#39;t look generous when he offers to let you hold his favorite caterpillar ;) As kids get older and their perspectives broaden, they begin to be able to see the world from the viewpoints of others - and the ways in which they are generous reflect that. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;for example for families with very little, so they must require work for money when the want of the person is extravagant or an extra.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nNot &quot;must&quot; -  may choose to. And if I can afford to pay my child to do  work, I can afford to buy whatever it is my child wants, anyway. If we, as a family really don&#39;t have the finances for something, kids doing odd jobs for cash may be one of the options we review in terms of buying that thing, for sure, but that&#39;s a different matter. Paying children for chores is Not about stretching the family budget, it&#39;s an attempt to teach lessons - and the trouble with teaching is you can&#39;t Ever control what is being learned. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Giving excessively may teach children that they are entitled to things without putting in effort or work which is not a good thing to learn. <br/>\n </span></blockquote>****************<br/>\n<br/>\nThat&#39;s the usual theory, but it&#39;s not how things play out in unschooling homes. Instead, when unschoolers create a sense of abundance and generosity, kids reflect that back at us. <br/>\n<br/>\nOutside of unschooling, some of the most mean-spirited, grasping adults I&#39;ve met were raised with the expectation that &quot;there&#39;s no such thing as a free lunch&quot;. <br/>\n<br/>\nI have an 18yo who periodically offers to help pay for things. Almost always, we graciously turn down his very generous offer. Now and then, we&#39;ll agree to split a cost on something or ask him to pay for something on his own, or pay us back - but that&#39;s really a &quot;now and then&quot; thing when we know he has cash on hand. Even more rarely, we&#39;ve hired him to do work, but that&#39;s really rare - we generally can&#39;t afford to hire someone inside the family or out. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"List politics was Paying children for chores","postDate":"1330273007","msgId":47962,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzAyNzMwMDcuMTE3MjAuWWFob29NYWlsTmVvQHdlYjg3MzA2Lm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDEzMzAyNjc5NzguMTQyNzQuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDIubWFpbC5iZjEueWFob28uY29tPg==","referencesHeader":"PEYwMTA1OTNGLUZGNDItNDkzNC1BNkE3LTgzQTA1QUZGREI4RkB2ZXJpem9uLm5ldD4gPDEzMzAyNjc5NzguMTQyNzQuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDIubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":47961,"nextInTopic":47963,"prevInTime":47961,"nextInTime":47963,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"If my goal was to get more people to feel comfortable posting on unschooling lists I am certain that my approach to writing on these lists would be different.","messageBody":"<div id=\"ygrps-yiv-1840687405\">If my goal was to get more people to feel comfortable posting on unschooling lists I am certain that my approach to writing on these lists would be different. But it isn&#39;t. I&#39;m not really interested in helping people to feel confident that whatever they post will be accepted and nurtured and valued. I think there are probably lists that are more about facilitating posters than this list, but I don&#39;t have any of those sorts of lists among the lists I read. I don&#39;t thrive on those lists, I don&#39;t learn well on those lists nor in those kinds of situations in the rest of my life. <br/>\n<br/>\n<br/>\nWhen I post on this list or any other list that I write on about unschooling I&#39;m writing with the goal of helping people to see how unschooling works. I want to write with a clarity of vision that helps people to understand what the principles of unschooling are and how they can be facilitated in their lives. When someone posts something &quot;that works in their home&quot; but isn&#39;t in line with unschooling principles I will write about it, I will examine it in the light of unschooling. I&#39;m interested in unschooling and in keeping this list and the other few that I write on to be focused on unschooling. I am writing with an awareness that there are more people reading than writing and who are looking to learn more about unschooling. <br/>\n<br/>\n<br/>\nIf people feel scared about posting than I hope that they are deriving some good in what they are reading. I don&#39;t post in every discussion, not because I don&#39;t derive some good, but because I don&#39;t have anything that I think is valuable to offer, or because I don&#39;t have the time, or because I don&#39;t really feel like it today, or for whatever reason. I don&#39;t feel compelled to post on many of the lists that I read on. None of that is because I&#39;m scared to post. Although, if I was afraid, I might want to figure out why I continued to find value in the list and what I was so afraid I&#39;d be getting wrong. <br/>\n<br/>\n<br/>\nThis list is a very focused discussion list. It isn&#39;t a particularly social list nor is it a list about comforting people who may feel that they would do better if they were being comforted. That may or not be appropriate for all members on the list. And it may mean that some people feel very uncomfortable with their ideas being discussed as they have a hard time separating who they are from what they think. And, for me, that&#39;s alright. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n <br/>\nAs an unschooler for 11 years, I would like to post a reply on these unschooling boards run by Joyce or Sandra without my response being torn apart, told that what I feel is completely wrong, without my feelings and ideas being highly controversial offering a debate for all. But once again that was not the case, and once again I regret posting my initial thoughts.<br/>\n<br/>\nSomeone wrote to me from one of these boards saying they were scared to post for these reasons as well. That is sad.<br/>\n<br/>\nThere is not only one way to unschool. Your way is not better or more right than mine. Sure discussing things can be good when it&#39;s asked for, but I&#39;d just like to offer a reply to the OP without having my personal thoughts up for debate. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":250057382,"authorName":"Tova","from":"Tova &lt;ml_ja@...&gt;","profile":"ml_ja","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Paying children for chores","postDate":"1330267978","msgId":47961,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzAyNjc5NzguMTQyNzQuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDIubWFpbC5iZjEueWFob28uY29tPg==","inReplyToHeader":"PEYwMTA1OTNGLUZGNDItNDkzNC1BNkE3LTgzQTA1QUZGREI4RkB2ZXJpem9uLm5ldD4="},"prevInTopic":47960,"nextInTopic":47962,"prevInTime":47960,"nextInTime":47962,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"As an unschooler for 11 years, I would like to post a reply on these unschooling boards run by Joyce or Sandra without my response being torn apart, told that","messageBody":"<div id=\"ygrps-yiv-624502050\">As an unschooler for 11 years, I would like to post a reply on these unschooling boards run by Joyce or Sandra without my response being torn apart, told that what I feel is completely wrong, without my feelings and ideas being highly controversial offering a debate for all. But once again that was not the case, and once again I regret posting my initial thoughts.<br/>\n<br/>\nSomeone wrote to me from one of these boards saying they were scared to post for these reasons as well. That is sad.<br/>\n<br/>\nThere is not only one way to unschool. Your way is not better or more right than mine. Sure discussing things can be good when it&#39;s asked for, but I&#39;d just like to offer a reply to the OP without having my personal thoughts up for debate. <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Sun, 2/26/12, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;<br/>\nSubject: Re: [unschoolingbasics] Paying children for chores<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Sunday, February 26, 2012, 8:15 AM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      <br/>\n<br/>\nOn Feb 26, 2012, at 6:56 AM, Schuyler wrote:<br/>\n<br/>\n<br/>\n<br/>\n&gt; Money doesn&#39;t equal work. <br/>\n<br/>\n<br/>\n<br/>\nVery true! And it would be a very limiting view of money to lock kids into.<br/>\n<br/>\n<br/>\n<br/>\nWe&#39;ve invested in a few stocks that sold for little that are now selling for more. There was no work involved in getting that extra money.<br/>\n<br/>\n<br/>\n<br/>\nCarl&#39;s learning from people at work how to sell stock options. The money he makes involves tapping a few computer keys. It&#39;s hardly work at all.<br/>\n<br/>\n<br/>\n<br/>\nWhich is why it&#39;s good for unschoolers to be humble about what you &quot;know&quot; about life. It&#39;s good to phrase what you do as what you understand, what you like and what you believe to be true for you. It&#39;s also much easier when phrased that way for others to take it in and mull it over when ideas are not expressed as truths for all but as the choices you&#39;ve made to reach your goals.<br/>\n<br/>\n<br/>\n<br/>\n(Even here we&#39;re not expressing truths for all, even though people accuse the list of doing that ;-) We&#39;re describing what has shown to help people turn toward radical unschooling, what supports it and what undermines it. We&#39;re passing on information to help people make more informed decisions, not to tell them what to do. If someone has slightly different goals than what radical unschooling is good for, they&#39;ll alter the ideas here to suit their own goals. But what it&#39;s important is to understand why things work as they do so people can make better decisions.)<br/>\n<br/>\n<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":250057382,"authorName":"Tova","from":"Tova &lt;ml_ja@...&gt;","profile":"ml_ja","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Paying children for chores","postDate":"1330266892","msgId":47963,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzAyNjY4OTIuNTA2NzUuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDUubWFpbC5iZjEueWFob28uY29tPg==","inReplyToHeader":"PEYwMTA1OTNGLUZGNDItNDkzNC1BNkE3LTgzQTA1QUZGREI4RkB2ZXJpem9uLm5ldD4="},"prevInTopic":47962,"nextInTopic":47964,"prevInTime":47962,"nextInTime":47964,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"... for more. There was no work involved in getting that extra money. There is a lot of work behind having that money available. Work by you when you took time","messageBody":"<div id=\"ygrps-yiv-646047366\"><blockquote><span title=\"ireply\">&gt;We&#39;ve invested in a few stocks that sold for little that are now selling<br/>\n </span></blockquote> for more. There was no work involved in getting that extra money.<br/>\n<br/>\nThere is a lot of work behind having that money available. Work by you when you took time to invest in the stock, and a huge amount of work by everyone who makes that company exist, continue to run, and make the stock available to you. That money didn&#39;t come from nowhere; a lot of work is behind that money.</div>","specialLinks":[]},{"userId":250057382,"authorName":"Tova","from":"Tova &lt;ml_ja@...&gt;","profile":"ml_ja","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Paying children for chores","postDate":"1330266465","msgId":47960,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzAyNjY0NjUuMTg4ODguWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDEubWFpbC5iZjEueWFob28uY29tPg==","inReplyToHeader":"PGppY2FpaitrMWg1QGVHcm91cHMuY29tPg=="},"prevInTopic":47959,"nextInTopic":47961,"prevInTime":47959,"nextInTime":47961,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"That s strictly my work, housework I consider the whole house, not someone s personal space. ... From: Santhy  Subject:","messageBody":"<div id=\"ygrps-yiv-580639549\">That&#39;s strictly my work, housework I consider the whole house, not someone&#39;s personal space.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Sat, 2/25/12, Santhy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:suprisha@...\">suprisha@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Santhy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:suprisha@...\">suprisha@...</a>&gt;<br/>\nSubject: [unschoolingbasics] Re: Paying children for chores<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Saturday, February 25, 2012, 10:57 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      <br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Tova &lt;ml_ja@...&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n<br/>\n&gt; I&#39;ve never been comfortable paying my daughter for housework or giving a random allowance (money=work period). Instead if she wants money from me she will clean my room or straighten up my computer area. <br/>\n<br/>\n&gt; <br/>\n<br/>\n  <br/>\n<br/>\nI don&#39;t understand. How is that not housework?<br/>\n<br/>\n<br/>\n<br/>\nSanthy     <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":334892198,"authorName":"Ann","from":"&quot;Ann&quot; &lt;auntannies2002@...&gt;","profile":"auntannies2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Paying children for chores","postDate":"1330263621","msgId":47959,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppZGNvNSs5NmwxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMzAxOTg2NDYuODg4NzUuWWFob29NYWlsTmVvQHdlYjg3MzAxLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":47958,"nextInTopic":47960,"prevInTime":47958,"nextInTime":47960,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"I have to agree with Shuyler.  From a very young age I had to work for every penny, for everything I wanted other than food and clothes.  It was very rare for","messageBody":"<div id=\"ygrps-yiv-146130810\">I have to agree with Shuyler.  From a very young age I had to work for every penny, for everything I wanted other than food and clothes.  It was very rare for my parents to buy me something other than Christmas and Birthday.  And both occasions were always disappointing because there was never enough.  With my children I was always much more generous and it definitely reflects in their attitudes towards money.<br/>\n<br/>\nAnn<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Schuyler &lt;s.waynforth@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &lt;&lt;but as parents most share &#39;resources&#39; with their children all the time <br/>\n&gt; so that&#39;s not even an issue! It&#39;s all about a balance. Giving <br/>\n&gt; excessively is not a viable option, for example for families with <br/>\n&gt; very little, so they must require work for money when the want of the <br/>\n&gt; person is extravagant or an extra. &gt;&gt;<br/>\n&gt; <br/>\n&gt; I&#39;ve been giving generously to Simon and Linnaea for much of their lives. I&#39;m not wealthy, I&#39;m not poor. But we, as a household, live on one income that we stretch and balance and juggle and work with to meet everyone&#39;s needs. I&#39;ve sold things to buy different things. I&#39;ve saved to purchase things later. I&#39;ve made lists of things everybody wants and hung them on the fridge and crossed them off when they were finally, after however long, added to the things we have. Some things have fallen by the wayside, with time and changing interests, some things have never been crossed off because they weren&#39;t worth more than the other things we wanted to get, or weren&#39;t worth enough to prioritise them. <br/>\n&gt; <br/>\n&gt; &gt;&gt;Giving excessively may teach children that they are entitled to <br/>\n&gt; things without putting in effort or work which is not a good thing to <br/>\n&gt; learn. It creates a welfare nation. &lt;&lt;<br/>\n&gt; <br/>\n&gt; Fortunately, at this point, I haven&#39;t had to ask the government to help me to make ends meet. I have at different times in my life and I had chores and I had a worked for a wage from the age of 11, babysitting and paper routes become working at a law firm after school and as a janitor at university and lots and lots of temporary jobs that accomodated my school schedule. Needing welfare had nothing to do with my childhood of chores and having to put work in to get goods and services out, it had to do with circumstances that made it difficult for me to make ends meet and being very grateful that there was money available to me during those times. <br/>\n&gt; <br/>\n&gt; My giving generously to Simon and Linnaea has not produced selfish or mean spirited children. They are very measured in what they spend money on. They are generous with their goods, with their money. Both Simon and Linnaea have given money to the other to make up the cost of something that they didn&#39;t quite have the funds to cover. For my birthday they used all of their saved for a few months allowance to buy a lovely ukulele for me, as a surprise, because they wanted to. If I wasn&#39;t generous with them, if David wasn&#39;t generous with them, they wouldn&#39;t know how to be generous. But they do. They know how to be generous. <br/>\n&gt; <br/>\n&gt; They don&#39;t want much. They are incredibly discerning in what they do want. I have gone shopping with them on more than one occasion when I couldn&#39;t convince them to let me get them anything. On their birthdays and holidays they struggle to think of anything that they want. I, who was meted out money based on merit, and whose money could be stopped for whatever lack of effort I showed, wanted for so much. I wanted so much. I wouldn&#39;t refuse a parent offering me anything, no matter if I wanted it or not. I was horribly miserable at Christmas and my birthday as I discovered, each year, that what was under the tree wasn&#39;t enough, didn&#39;t fill whatever it was that I felt needed filling. Rather than truly examining the whole gift giving thing, and my need, I blamed it on the lack of the perfect whatever it was that could have been under the tree. I am frequently amazed at the difference in neediness between Simon and Linnaea and myself at their ages. <br/>\n&gt; <br/>\n&gt; &gt;&gt;Giving excessively may teach children that they are entitled to <br/>\n&gt; things without putting in effort or work which is not a good thing to <br/>\n&gt; learn. &lt;&lt;<br/>\n&gt; <br/>\n&gt; Unfortunately what you think you are teaching may not be what a child is learning. Simon and Linnaea seem to have learned that I love and support them. That I find value in their interests and will work to help them to achieve their goals. I don&#39;t believe that they have learned anything about how the world owes them a living. I don&#39;t believe that your prediction and their perspectives have aligned. Heck, David supports me and I certainly don&#39;t feel entitled to his generosity. I am ever so thankful for all that he does to provide for me and for our children. And I work to help him to know my appreciation. <br/>\n&gt; <br/>\n&gt; &gt;&gt;These are my opinions. &lt;&lt;<br/>\n&gt; <br/>\n&gt; Again, unfortunately, your opinions aren&#39;t going to help you or anyone else radically unschool. They aren&#39;t going to help your relationship with your daughter to grow stronger as you and she work together to make the world what she wants it to be. Your opinions are going to get in the way of her dreams and your radical unschooling. <br/>\n&gt; <br/>\n&gt; Schuyler <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Paying children for chores","postDate":"1330262115","msgId":47958,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYwMTA1OTNGLUZGNDItNDkzNC1BNkE3LTgzQTA1QUZGREI4RkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEzMzAyNTc0MTguNDc3MDMuWWFob29NYWlsTmVvQHdlYjg3MzA2Lm1haWwuaXJkLnlhaG9vLmNvbT4=","referencesHeader":"PDEzMzAyMTI1MjEuMTQwOTYuWWFob29NYWlsTmVvQHdlYjg3MzAxLm1haWwuaXJkLnlhaG9vLmNvbT4gPDEzMzAyMTc0MzAuODYyNzcuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDEubWFpbC5iZjEueWFob28uY29tPiA8MTMzMDI1NzQxOC40NzcwMy5ZYWhvb01haWxOZW9Ad2ViODczMDYubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":47957,"nextInTopic":47959,"prevInTime":47957,"nextInTime":47959,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"... Very true! And it would be a very limiting view of money to lock kids into. We ve invested in a few stocks that sold for little that are now selling for","messageBody":"<div id=\"ygrps-yiv-680890290\">On Feb 26, 2012, at 6:56 AM, Schuyler wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Money doesn&#39;t equal work. <br/>\n<br/>\n </span></blockquote>Very true! And it would be a very limiting view of money to lock kids into.<br/>\n<br/>\nWe&#39;ve invested in a few stocks that sold for little that are now selling for more. There was no work involved in getting that extra money.<br/>\n<br/>\nCarl&#39;s learning from people at work how to sell stock options. The money he makes involves tapping a few computer keys. It&#39;s hardly work at all.<br/>\n<br/>\nWhich is why it&#39;s good for unschoolers to be humble about what you &quot;know&quot; about life. It&#39;s good to phrase what you do as what you understand, what you like and what you believe to be true for you. It&#39;s also much easier when phrased that way for others to take it in and mull it over when ideas are not expressed as truths for all but as the choices you&#39;ve made to reach your goals.<br/>\n<br/>\n(Even here we&#39;re not expressing truths for all, even though people accuse the list of doing that ;-) We&#39;re describing what has shown to help people turn toward radical unschooling, what supports it and what undermines it. We&#39;re passing on information to help people make more informed decisions, not to tell them what to do. If someone has slightly different goals than what radical unschooling is good for, they&#39;ll alter the ideas here to suit their own goals. But what it&#39;s important is to understand why things work as they do so people can make better decisions.)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Paying children for chores","postDate":"1330257418","msgId":47957,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzAyNTc0MTguNDc3MDMuWWFob29NYWlsTmVvQHdlYjg3MzA2Lm1haWwuaXJkLnlhaG9vLmNvbT4=","referencesHeader":"PDEzMzAyMTI1MjEuMTQwOTYuWWFob29NYWlsTmVvQHdlYjg3MzAxLm1haWwuaXJkLnlhaG9vLmNvbT4gPDEzMzAyMTc0MzAuODYyNzcuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDEubWFpbC5iZjEueWFob28uY29tPiA="},"prevInTopic":47955,"nextInTopic":47958,"prevInTime":47956,"nextInTime":47958,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"... You ve written that twice. I don t know that to be true. I don t know that most parents give generously to their children. I hope that s true. But it isn t","messageBody":"<div id=\"ygrps-yiv-417399240\"><blockquote><span title=\"ireply\">&gt;&gt;I do buy many things for my daughter and give generously of my money (as most parents do)&lt;&lt;<br/>\n<br/>\n </span></blockquote>You&#39;ve written that twice. I don&#39;t know that to be true. I don&#39;t know that most parents give<br/>\n generously to their children. I hope that&#39;s true. But it isn&#39;t an assumption that I would make, particularly not after spending time at a toy store with other parents and children than my own. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;but I actually never outright give her much cash unless she&#39;s worked for it because I don&#39;t feel I can financially do this (I also rarely have cash on hand). &lt;&lt;<br/>\n<br/>\n </span></blockquote>If you rarely have cash on hand, how do you pay her when she works for it? You don&#39;t have to answer, but maybe think about the contradictions that you are defending when it comes to the work ethic you believe you need to instill in your daughter. Simon and Linnaea don&#39;t get cash, unless they ask for it, they get an ongoing tally on the calendar. Much of what they buy is on-line so cash isn&#39;t often useful to them. But if they wanted to have their money in cash it isn&#39;t hard for me to get to a cash machine and withdraw what they wanted. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;This has given her incentive to delve into finding ways to make $ independently from me.&lt;&lt;<br/>\n<br/>\n </span></blockquote>Maybe, but maybe the incentive came from other things. Maybe it came from watching you work hard. Maybe it is inherent to her. I had a job from a young age, not<br/>\n because I was forced to work for money by my parents, but because I liked working and it was part of the fabric of my life to do so. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I find nothing wrong with thinking that money=work because it does. That is the nature of money. That is the nature of everything. You need to work to get most things in life, money is no exception. &lt;&lt;<br/>\n<br/>\n </span></blockquote>Money doesn&#39;t equal work. And when it does it isn&#39;t linear. That is the amount of work you do doesn&#39;t equal the amount of money you get. Often the more manual the work that you do the less you are paid for it. Money is a fascinating thing that&#39;s been around for a long time. It&#39;s more interesting than that one needs to work to get most things in life. I live in the UK where tax money goes to support the Queen and her husband and their children. They do diplomatic service work, and I&#39;m sure that royalists have worked to demonstrate how much greater is the value of what they offer than what they are paid. But it is a strange kind of notion to me, paying someone for whose child they are. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;But for now I want my daughter to know that money as well as everything else in this life comes from putting in work in whatever shape or form.&lt;&lt;<br/>\n<br/>\n </span></blockquote>I don&#39;t need to work for my children to understand that. They know that from their efforts they have mastered a number of skills. They know first hand that the skills and the understandings that they have come from time in and experience with whatever it is that they have mastered. And I certainly don&#39;t want them to know that I need them to work for me to help them. I don&#39;t want them to think that if they come to me with needs or wants that I will make sure that if and when those needs or wants are fulfilled they will have learned how much effort it takes to make money or to make a meal or to bake a loaf of bread or to give a massage or to buy and play a video game or whatever it is. Simon and Linnaea don&#39;t have to work for me to be willing to help them out. And they still know what it is to live in a money-based economy. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Paying children for chores","postDate":"1330256340","msgId":47955,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBGMDBCODg5LUVCQ0MtNEE2NS1BOTY4LTgwMzQ5NzBEMjQzM0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEzMzAyMTc0MzAuODYyNzcuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDEubWFpbC5iZjEueWFob28uY29tPg==","referencesHeader":"PDEzMzAyMTc0MzAuODYyNzcuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDEubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":47952,"nextInTopic":47957,"prevInTime":47954,"nextInTime":47956,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"... Do you think that s a difficult idea to grasp? Yes, you did write quite a bit about an idea that is very simple. What you ve written suggests that giving a","messageBody":"<div id=\"ygrps-yiv-1361441507\">On Feb 25, 2012, at 7:50 PM, Tova wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But for now I want my daughter to know that money as well as<br/>\n&gt; everything else in this life comes from putting in work in<br/>\n&gt; whatever shape or form.<br/>\n<br/>\n </span></blockquote>Do you think that&#39;s a difficult idea to grasp? Yes, you did write quite a bit about an idea that is very simple. What you&#39;ve written suggests that giving a child money will negate the more pervasive idea she&#39;s immersed  of money coming from work. Where does she think the money you give her comes from? It&#39;s even easier for her to grasp that it comes from work since you work from home rather than disappearing for 8 hours as most breadwinners do ;-)<br/>\n<br/>\nAs an unschooler you don&#39;t need to make decisions based on what lesson a child will learn from them. You make decisions based on the needs of reality. That&#39;s how kids learn about reality. :-) Seeing real reactions to it. If parents create artificial situations for kids to learn lessons from, the lessons the kids learn are often different from what the parents intend to teach! <br/>\n<br/>\nRead the following as your situation viewed through radical unschooling. It&#39;s not about you. If you want to make choices that move toward a goal other than learning from life in certain areas of life, you get to do that. But this list isn&#39;t a place to present or support those ideas. It&#39;s for viewing life through a radical unschooling lens.<br/>\n<br/>\nIf there are jobs around the house you might pay someone else to do, then it&#39;s perfectly reasonable to pay your daughter to do them if she wants. <br/>\n<br/>\nIf you&#39;re doing chores and you invite her to help, and she wants paid, I&#39;d see two possibilities: she&#39;s exploring the idea of money for work and/or she&#39;s needful of money that she can make decisions about.<br/>\n<br/>\nIf you&#39;re as generous -- with your time, with money, with anything you have that she needs -- as reality will allow, she&#39;ll be generous back when she&#39;s able. She&#39;ll want to help you because she feels you&#39;re generous with your time. And she&#39;ll decide when she&#39;d like paid when she needs money. Not because she has some lesson she wants you to learn ;-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":272992574,"authorName":"Santhy","from":"&quot;Santhy&quot; &lt;suprisha@...&gt;","profile":"suprisha","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Paying children for chores","postDate":"1330229570","msgId":47952,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppY2JnMisyOTFhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMzAyMTc0MzAuODYyNzcuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDEubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":47951,"nextInTopic":47955,"prevInTime":47951,"nextInTime":47953,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"Joyce had posted that TED talk on another list and I had listened to it, and that was part of what I meant by saying that my unease with paying children for","messageBody":"<div id=\"ygrps-yiv-814074520\">Joyce had posted that TED talk on another list and I had listened to it, and that was part of what I meant by saying that my unease with paying children for chores brings to mind the arguments against rewards and praise. Will the &#39;incentive&#39; of money somehow hamper the spontaneous desire to help around the house/watch a sibling? But I think I understand what you are trying to say.<br/>\n<br/>\n----If there was something I was already paying<br/>\nsomeone to do, or planning paying someone to do, I can imagine shifting the<br/>\npayment to Simon or Linnaea instead of just expecting them to do it gratis. If<br/>\nit was something I was going to do anyhow, or if they were just helping out, I&#39;m<br/>\nnot sure that I would be able to justify, in my head, payment for it. I&#39;d just<br/>\ndo what I normally do and help them with money when they need it.----<br/>\n<br/>\n----It depends how needful of money he is. If he feels like he can&#39;t ever get what<br/>\nhe wants, he&#39;s going to be looking for any possible chance to get more money. If<br/>\nhe feels like his needs are seen as important and getting what he wants seems<br/>\npossible, he&#39;ll choose to do what he enjoys because he enjoys it. He will play<br/>\nwith his siblings because he has fun doing it.<br/>\nIf there&#39;s a time mom would hire someone to spend time with the younger one<br/>\nbecause she wants to get something done, and he is willing to do it, then it<br/>\nseems fair to pay him.----<br/>\n<br/>\nThank you, that was really helpful.<br/>\n<br/>\n----and I write things for mostly strangers to read about unschooling.----<br/>\n<br/>\nI am so grateful for that:-)<br/>\n<br/>\nSanthy</div>","specialLinks":[]},{"userId":272992574,"authorName":"Santhy","from":"&quot;Santhy&quot; &lt;suprisha@...&gt;","profile":"suprisha","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Paying children for chores","postDate":"1330228627","msgId":47951,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppY2FpaitrMWg1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMzAxNzU5ODYuMzgwNjIuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDUubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":47949,"nextInTopic":47952,"prevInTime":47949,"nextInTime":47952,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"... I don t understand. How is that not housework? Santhy","messageBody":"<div id=\"ygrps-yiv-642093990\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Tova &lt;ml_ja@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I&#39;ve never been comfortable paying my daughter for housework or giving a random allowance (money=work period). Instead if she wants money from me she will clean my room or straighten up my computer area. <br/>\n&gt; <br/>\n  <br/>\n </span></blockquote>I don&#39;t understand. How is that not housework?<br/>\n<br/>\nSanthy</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Paying children for chores","postDate":"1330212959","msgId":47949,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzAyMTI5NTkuODI1ODguWWFob29NYWlsTmVvQHdlYjg3MzA1Lm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDEzMzAyMTI1MjEuMTQwOTYuWWFob29NYWlsTmVvQHdlYjg3MzAxLm1haWwuaXJkLnlhaG9vLmNvbT4=","referencesHeader":"PEFBMDY0QTdELTVFNkQtNEQ1MC1BN0Q2LUNGNTY2RjcwNkJFQUB2ZXJpem9uLm5ldD4gPDEzMzAyMDMwMzguNTAxMzIuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDEubWFpbC5iZjEueWFob28uY29tPiA8MTMzMDIxMjUyMS4xNDA5Ni5ZYWhvb01haWxOZW9Ad2ViODczMDEubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":47948,"nextInTopic":47951,"prevInTime":47948,"nextInTime":47951,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"Watching the end of the RSA video I was struck by the words money=work period . It seems that it would be easy to turn that around in your head, work=money","messageBody":"<div id=\"ygrps-yiv-1495731201\">Watching the end of the RSA video I was struck by the words &quot;money=work period&quot;. It seems that it would be easy to turn that around in your head, work=money period. I make no money. I haven&#39;t made any money for a long, long time. But I do a fair bit of work. I cook and I clean and I do laundry and I garden a bit and I write things for mostly strangers to read about unschooling. I do childcare and I walk other people&#39;s dogs from time to time. I dance with a Morris side with absolutely no remuneration. I pick up litter on occasion and I always push the carts back and put them all in order in the cart corral at the grocery store. I&#39;m sure I could list more things that would really be difficult to do if I believed that I needed to be paid to do them. I&#39;m glad that I don&#39;t. I&#39;m glad that I simply find joy in the process and the product of my doing. And I&#39;m glad that when Simon and Linnaea chose to join in they don&#39;t have any sense that money=work or that<br/>\n work=money. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Paying children for chores","postDate":"1330212521","msgId":47948,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzAyMTI1MjEuMTQwOTYuWWFob29NYWlsTmVvQHdlYjg3MzAxLm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDEzMzAyMDMwMzguNTAxMzIuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDEubWFpbC5iZjEueWFob28uY29tPg==","referencesHeader":"PEFBMDY0QTdELTVFNkQtNEQ1MC1BN0Q2LUNGNTY2RjcwNkJFQUB2ZXJpem9uLm5ldD4gPDEzMzAyMDMwMzguNTAxMzIuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDEubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":47947,"nextInTopic":47949,"prevInTime":47947,"nextInTime":47949,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"In your first post you wrote money=work period and Instead if she wants money from me she will clean my room or straighten up my computer area. That s at","messageBody":"<div id=\"ygrps-yiv-1948629931\">In your first post you wrote &quot;money=work period&quot; and &quot;Instead if she wants money from me she will clean my room or straighten up my computer area.&quot;That&#39;s at odds with this: &quot;When I don&#39;t have enough money to buy certain wants for my daughter, we <br/>\nsee if we can find it free or inexpensive. If not, I have shown her ways to make the money to save up, and I help her achieve that in any way I <br/>\ncan. We work as a team always.&quot; Presumably if you have the money to pay her to clean your room or straighten up your computer area you could just give it to her without the hurdle. <br/>\n<br/>\n<br/>\nIt doesn&#39;t really matter which is an accurate depiction of what goes on in your home, but if you are giving advice to someone about how to radically unschool it will help if you write with clarity. It will also help if you have a clear picture of how helping your children to achieve their goals doesn&#39;t lead to a parent &quot;taking away a valuable fulfilling growing experience from the child&quot;. <br/>\n<br/>\n&quot;To struggle or work hard to obtain something can be a good thing.&quot; Absolutely. But it is a better thing when the choice to struggle and work hard is coming from within and is not being applied by a parent or an external somebody. I struggle and work hard to obtain lots of things. So do Simon and Linnaea. For all of us the struggles are largely with mastery over some skill or another and rarely over obtaining resources. We each spend a lot of time trying to figure out how to do or how to understand something or how to solve some problem or another.  There is a wonderful video around a lecture by Daniel Pink called Drive: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=u6XAPnuFjJc.\">http://www.youtube.com/watch?v=u6XAPnuFjJc.</a> People struggle and work hard to obtain things for lots of reasons, but seem to do it least with money as the incentive. The video may not be at all related to the idea of making a child work for their pocket money, but it may help to address the fears that a child who isn&#39;t required to work<br/>\n will end up on the dole. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/u6XAPnuFjJc?wmode=opaque","type":"VIDEO"}]},{"userId":250057382,"authorName":"Tova","from":"Tova &lt;ml_ja@...&gt;","profile":"ml_ja","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Paying children for chores","postDate":"1330203038","msgId":47947,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzAyMDMwMzguNTAxMzIuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDEubWFpbC5iZjEueWFob28uY29tPg==","inReplyToHeader":"PEFBMDY0QTdELTVFNkQtNEQ1MC1BN0Q2LUNGNTY2RjcwNkJFQUB2ZXJpem9uLm5ldD4="},"prevInTopic":47946,"nextInTopic":47948,"prevInTime":47946,"nextInTime":47948,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"QUOTEAnd yet families who have very little have found ways to draw the children into decisions about the resources so they don t feel like they re the lowest","messageBody":"<div id=\"ygrps-yiv-293927790\">QUOTEAnd yet families who have very little have found ways to draw the <br/>\nchildren into decisions about the resources so they don&#39;t feel like <br/>\nthey&#39;re the lowest on the rung of priorities. It&#39;s not about mom and dad<br/>\n giving when kids ask but discussing, making plans and saving together.QUOTE<br/>\n <br/>\nI&#39;m all for that. Why wouldn&#39;t I be? Of course! <br/>\n<br/>\nQUOTEWhat gets discussed here is being both realistic and generous. :-) <br/>\nRealistic about how much money there is after the necessities like rent <br/>\nor mortgage. And then working together to help each other with meeting <br/>\nneeds with what&#39;s left over. It can be surprising how generous kids can <br/>\nbe with each other and their parents when they don&#39;t feel like they need<br/>\n to fight to get their piece of the pie.QUOTE<br/>\n<br/>\nTrue. Ido think it&#39;s great to show children how to take things into their own hands and make their own money so they don&#39;t have to &#39;fight to get their piece of the pie&#39; and feel helpless. When I don&#39;t have enough money to buy certain wants for my daughter, we see if we can find it free or inexpensive. If not, I have shown her ways to make the money to save up, and I help her achieve that in any way I can. We work as a team always.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Sat, 2/25/12, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;<br/>\nSubject: Re: [unschoolingbasics] Paying children for chores<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Saturday, February 25, 2012, 3:12 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      <br/>\n<br/>\nOn Feb 25, 2012, at 1:36 PM, Tova wrote:<br/>\n<br/>\n<br/>\n<br/>\n&gt; These are my opinions. <br/>\n<br/>\n<br/>\n<br/>\nBut do your opinions help list members turn toward better relationships and support exploration of interests?<br/>\n<br/>\n<br/>\n<br/>\nThose are some of the questions that ideas are run past on the list.<br/>\n<br/>\n<br/>\n<br/>\n&gt; Giving excessively is not a viable option, for example for families with very little<br/>\n<br/>\n<br/>\n<br/>\nAnd yet families who have very little have found ways to draw the children into decisions about the resources so they don&#39;t feel like they&#39;re the lowest on the rung of priorities. It&#39;s not about mom and dad giving when kids ask but discussing, making plans and saving together.<br/>\n<br/>\n<br/>\n<br/>\n&gt; parents most share &#39;resources&#39; with their children all the time so that&#39;s not even an issue<br/>\n<br/>\n<br/>\n<br/>\nMost parents skim the resources for the bills, then the parents wants and then the requests of the kids that the parents agree with.<br/>\n<br/>\n<br/>\n<br/>\nWhat gets discussed here is being both realistic and generous. :-) Realistic about how much money there is after the necessities like rent or mortgage. And then working together to help each other with meeting needs with what&#39;s left over. It can be surprising how generous kids can be with each other and their parents when they don&#39;t feel like they need to fight to get their piece of the pie.<br/>\n<br/>\n<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":250057382,"authorName":"Tova","from":"Tova &lt;ml_ja@...&gt;","profile":"ml_ja","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Paying children for chores","postDate":"1330200795","msgId":47946,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzAyMDA3OTUuMTU4NzQuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDEubWFpbC5iZjEueWFob28uY29tPg==","inReplyToHeader":"PDEzMzAxOTg2NDYuODg4NzUuWWFob29NYWlsTmVvQHdlYjg3MzAxLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":47945,"nextInTopic":47947,"prevInTime":47945,"nextInTime":47947,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"Schuyler, I think most parents give generously to their children- no one is unique in that. And even moreseo as unschooling families we work side by side with","messageBody":"<div id=\"ygrps-yiv-1084093320\">Schuyler, I think most parents give generously to their children- no one is unique in that. And even moreseo as unschooling families we work side by side with our children and perpetually give our time, money, energy to help our children achieve their dreams and goals. But isn&#39;t it great when a child has interest in taking the reins over? That means that as parents we can back off, and let the child take over more. By not backing off and continuing to give money or whatever, the parent is taking away a valuable fulfilling growing experience from the child. To struggle or work hard to obtain something can be a good thing. <br/>\n<br/>\nHow we do things works very well for my family and I will change nothing. I&#39;m glad to hear that what you do works for your family. Thank you for your opinions.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Sat, 2/25/12, Schuyler &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Schuyler &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt;<br/>\nSubject: Re: [unschoolingbasics] Re: Paying children for chores<br/>\nTo: &quot;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nDate: Saturday, February 25, 2012, 2:37 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      <br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;but as parents most share &#39;resources&#39; with their children all the time <br/>\n<br/>\nso that&#39;s not even an issue! It&#39;s all about a balance. Giving <br/>\n<br/>\nexcessively is not a viable option, for example for families with <br/>\n<br/>\nvery little, so they must require work for money when the want of the <br/>\n<br/>\nperson is extravagant or an extra. &gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\nI&#39;ve been giving generously to Simon and Linnaea for much of their lives. I&#39;m not wealthy, I&#39;m not poor. But we, as a household, live on one income that we stretch and balance and juggle and work with to meet everyone&#39;s needs. I&#39;ve sold things to buy different things. I&#39;ve saved to purchase things later. I&#39;ve made lists of things everybody wants and hung them on the fridge and crossed them off when they were finally, after however long, added to the things we have. Some things have fallen by the wayside, with time and changing interests, some things have never been crossed off because they weren&#39;t worth more than the other things we wanted to get, or weren&#39;t worth enough to prioritise them. <br/>\n<br/>\n<br/>\n<br/>\n&gt;&gt;Giving excessively may teach children that they are entitled to <br/>\n<br/>\nthings without putting in effort or work which is not a good thing to <br/>\n<br/>\nlearn. It creates a welfare nation. &lt;&lt;<br/>\n<br/>\n<br/>\n<br/>\nFortunately, at this point, I haven&#39;t had to ask the government to help me to make ends meet. I have at different times in my life and I had chores and I had a worked for a wage from the age of 11, babysitting and paper routes become working at a law firm after school and as a janitor at university and lots and lots of temporary jobs that accommodated my school schedule. Needing welfare had nothing to do with my childhood of chores and having to put work in to get goods and services out, it had to do with circumstances that made it difficult for me to make ends meet and being very grateful that there was money available to me during those times. <br/>\n<br/>\n<br/>\n<br/>\nMy giving generously to Simon and Linnaea has not produced selfish or mean spirited children. They are very measured in what they spend money on. They are generous with their goods, with their money. Both Simon and Linnaea have given money to the other to make up the cost of something that they didn&#39;t quite have the funds to cover. For my birthday they used all of their saved for a few months allowance to buy a lovely ukulele for me, as a surprise, because they wanted to. If I wasn&#39;t generous with them, if David wasn&#39;t generous with them, they wouldn&#39;t know how to be generous. But they do. They know how to be generous. <br/>\n<br/>\n<br/>\n<br/>\nThey don&#39;t want much. They are incredibly discerning in what they do want. I have gone shopping with them on more than one occasion when I couldn&#39;t convince them to let me get them anything. On their birthdays and holidays they struggle to think of anything that they want. I, who was meted out money based on merit, and whose money could be stopped for whatever lack of effort I showed, wanted for so much. I wanted so much. I wouldn&#39;t refuse a parent offering me anything, no matter if I wanted it or not. I was horribly miserable at Christmas and my birthday as I discovered, each year, that what was under the tree wasn&#39;t enough, didn&#39;t fill whatever it was that I felt needed filling. Rather than truly examining the whole gift giving thing, and my need, I blamed it on the lack of the perfect whatever it was that could have been under the tree. I am frequently amazed at the difference in neediness between Simon and Linnaea and myself at their ages. <br/>\n<br/>\n<br/>\n<br/>\n&gt;&gt;Giving excessively may teach children that they are entitled to <br/>\n<br/>\nthings without putting in effort or work which is not a good thing to <br/>\n<br/>\nlearn. &lt;&lt;<br/>\n<br/>\n<br/>\n<br/>\nUnfortunately what you think you are teaching may not be what a child is learning. Simon and Linnaea seem to have learned that I love and support them. That I find value in their interests and will work to help them to achieve their goals. I don&#39;t believe that they have learned anything about how the world owes them a living. I don&#39;t believe that your prediction and their perspectives have aligned. Heck, David supports me and I certainly don&#39;t feel entitled to his generosity. I am ever so thankful for all that he does to provide for me and for our children. And I work to help him to know my appreciation. <br/>\n<br/>\n<br/>\n<br/>\n&gt;&gt;These are my opinions. &lt;&lt;<br/>\n<br/>\n<br/>\n<br/>\nAgain, unfortunately, your opinions aren&#39;t going to help you or anyone else radically unschool. They aren&#39;t going to help your relationship with your daughter to grow stronger as you and she work together to make the world what she wants it to be. Your opinions are going to get in the way of her dreams and your radical unschooling. <br/>\n<br/>\n<br/>\n<br/>\nSchuyler <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Paying children for chores","postDate":"1330200729","msgId":47945,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBMDY0QTdELTVFNkQtNEQ1MC1BN0Q2LUNGNTY2RjcwNkJFQUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEzMzAxOTQ5NzQuMjk0MTEuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDYubWFpbC5iZjEueWFob28uY29tPg==","referencesHeader":"PDEzMzAxOTQ5NzQuMjk0MTEuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDYubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":47944,"nextInTopic":47946,"prevInTime":47944,"nextInTime":47946,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"... But do your opinions help list members turn toward better relationships and support exploration of interests? Those are some of the questions that ideas","messageBody":"<div id=\"ygrps-yiv-1824791085\">On Feb 25, 2012, at 1:36 PM, Tova wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; These are my opinions. <br/>\n<br/>\n </span></blockquote>But do your opinions help list members turn toward better relationships and support exploration of interests?<br/>\n<br/>\nThose are some of the questions that ideas are run past on the list.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Giving excessively is not a viable option, for example for families with very little<br/>\n<br/>\n<br/>\n </span></blockquote>And yet families who have very little have found ways to draw the children into decisions about the resources so they don&#39;t feel like they&#39;re the lowest on the rung of priorities. It&#39;s not about mom and dad giving when kids ask but discussing, making plans and saving together.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; parents most share &#39;resources&#39; with their children all the time so that&#39;s not even an issue<br/>\n<br/>\n<br/>\n </span></blockquote>Most parents skim the resources for the bills, then the parents wants and then the requests of the kids that the parents agree with.<br/>\n<br/>\nWhat gets discussed here is being both realistic and generous. :-) Realistic about how much money there is after the necessities like rent or mortgage. And then working together to help each other with meeting needs with what&#39;s left over. It can be surprising how generous kids can be with each other and their parents when they don&#39;t feel like they need to fight to get their piece of the pie.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Paying children for chores","postDate":"1330198646","msgId":47944,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzAxOTg2NDYuODg4NzUuWWFob29NYWlsTmVvQHdlYjg3MzAxLm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDEzMzAxOTQ5NzQuMjk0MTEuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDYubWFpbC5iZjEueWFob28uY29tPg==","referencesHeader":"PGppYjNsMitmMzdvQGVHcm91cHMuY29tPiA8MTMzMDE5NDk3NC4yOTQxMS5ZYWhvb01haWxDbGFzc2ljQHdlYjE2MTcwNi5tYWlsLmJmMS55YWhvby5jb20+"},"prevInTopic":47943,"nextInTopic":47945,"prevInTime":47943,"nextInTime":47945,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-497732842\">&lt;&lt;but as parents most share &#39;resources&#39; with their children all the time <br/>\nso that&#39;s not even an issue! It&#39;s all about a balance. Giving <br/>\nexcessively is not a viable option, for example for families with <br/>\nvery little, so they must require work for money when the want of the <br/>\nperson is extravagant or an extra. &gt;&gt;<br/>\n<br/>\nI&#39;ve been giving generously to Simon and Linnaea for much of their lives. I&#39;m not wealthy, I&#39;m not poor. But we, as a household, live on one income that we stretch and balance and juggle and work with to meet everyone&#39;s needs. I&#39;ve sold things to buy different things. I&#39;ve saved to purchase things later. I&#39;ve made lists of things everybody wants and hung them on the fridge and crossed them off when they were finally, after however long, added to the things we have. Some things have fallen by the wayside, with time and changing interests, some things have never been crossed off because they weren&#39;t worth more than the other things we wanted to get, or weren&#39;t worth enough to prioritise them. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Giving excessively may teach children that they are entitled to <br/>\n </span></blockquote>things without putting in effort or work which is not a good thing to <br/>\nlearn. It creates a welfare nation. &lt;&lt;<br/>\n<br/>\nFortunately, at this point, I haven&#39;t had to ask the government to help me to make ends meet. I have at different times in my life and I had chores and I had a worked for a wage from the age of 11, babysitting and paper routes become working at a law firm after school and as a janitor at university and lots and lots of temporary jobs that accomodated my school schedule. Needing welfare had nothing to do with my childhood of chores and having to put work in to get goods and services out, it had to do with circumstances that made it difficult for me to make ends meet and being very grateful that there was money available to me during those times. <br/>\n<br/>\nMy giving generously to Simon and Linnaea has not produced selfish or mean spirited children. They are very measured in what they spend money on. They are generous with their goods, with their money. Both Simon and Linnaea have given money to the other to make up the cost of something that they didn&#39;t quite have the funds to cover. For my birthday they used all of their saved for a few months allowance to buy a lovely ukulele for me, as a surprise, because they wanted to. If I wasn&#39;t generous with them, if David wasn&#39;t generous with them, they wouldn&#39;t know how to be generous. But they do. They know how to be generous. <br/>\n<br/>\nThey don&#39;t want much. They are incredibly discerning in what they do want. I have gone shopping with them on more than one occasion when I couldn&#39;t convince them to let me get them anything. On their birthdays and holidays they struggle to think of anything that they want. I, who was meted out money based on merit, and whose money could be stopped for whatever lack of effort I showed, wanted for so much. I wanted so much. I wouldn&#39;t refuse a parent offering me anything, no matter if I wanted it or not. I was horribly miserable at Christmas and my birthday as I discovered, each year, that what was under the tree wasn&#39;t enough, didn&#39;t fill whatever it was that I felt needed filling. Rather than truly examining the whole gift giving thing, and my need, I blamed it on the lack of the perfect whatever it was that could have been under the tree. I am frequently amazed at the difference in neediness between Simon and Linnaea and myself at their ages. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Giving excessively may teach children that they are entitled to <br/>\n </span></blockquote>things without putting in effort or work which is not a good thing to <br/>\nlearn. &lt;&lt;<br/>\n<br/>\nUnfortunately what you think you are teaching may not be what a child is learning. Simon and Linnaea seem to have learned that I love and support them. That I find value in their interests and will work to help them to achieve their goals. I don&#39;t believe that they have learned anything about how the world owes them a living. I don&#39;t believe that your prediction and their perspectives have aligned. Heck, David supports me and I certainly don&#39;t feel entitled to his generosity. I am ever so thankful for all that he does to provide for me and for our children. And I work to help him to know my appreciation. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;These are my opinions. &lt;&lt;<br/>\n<br/>\n </span></blockquote>Again, unfortunately, your opinions aren&#39;t going to help you or anyone else radically unschool. They aren&#39;t going to help your relationship with your daughter to grow stronger as you and she work together to make the world what she wants it to be. Your opinions are going to get in the way of her dreams and your radical unschooling. <br/>\n<br/>\nSchuyler <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":250057382,"authorName":"Tova","from":"Tova &lt;ml_ja@...&gt;","profile":"ml_ja","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Paying children for chores","postDate":"1330194974","msgId":47943,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzAxOTQ5NzQuMjk0MTEuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDYubWFpbC5iZjEueWFob28uY29tPg==","inReplyToHeader":"PGppYjNsMitmMzdvQGVHcm91cHMuY29tPg=="},"prevInTopic":47942,"nextInTopic":47944,"prevInTime":47942,"nextInTime":47944,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"QUOTE It s worth thinking about why you require work for pay from your child, rather than sharing resources with her. Are you hoping that making money ","messageBody":"<div id=\"ygrps-yiv-1897277792\">QUOTE &quot;It&#39;s worth thinking about why you require work for pay from your child, <br/>\nrather than sharing resources with her. Are you hoping that making money<br/>\n dependent on work will teach her something? Responsibility or work <br/>\nethic perhaps? Just as often, what kids learn from such arrangements is <br/>\nthat care and human worth are conditional, or that work and possessions <br/>\nare more valuable than needs and feelings.-END QUOTE<br/>\n<br/>\nGood points, but as parents most share &#39;resources&#39; with their children all the time so that&#39;s not even an issue! It&#39;s all about a balance. Giving excessively is not a viable option, for example for families with very little, so they must require work for money when the want of the person is extravagant or an extra. Giving excessively may teach children that they are entitled to things without putting in effort or work which is not a good thing to learn. It creates a welfare nation. These are my opinions. <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Sat, 2/25/12, Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt;<br/>\nSubject: [unschoolingbasics] Re: Paying children for chores<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Saturday, February 25, 2012, 11:52 AM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      Tova &lt;ml_ja@...&gt; wrote:<br/>\n<br/>\n&gt;&gt; Because she is at an age (11) were money is becoming more and more valuable, we compiled a list of ways to make money and posted it on the fridge.<br/>\n<br/>\n****************<br/>\n<br/>\n<br/>\n<br/>\nIt&#39;s worth thinking about why you require work for pay from your child, rather than sharing resources with her. Are you hoping that making money dependent on work will teach her something? Responsibility or work ethic perhaps? Just as often, what kids learn from such arrangements is that care and human worth are conditional, or that work and possessions are more valuable than needs and feelings.<br/>\n<br/>\n<br/>\n<br/>\nKids don&#39;t need to have money contingent on labor to grow into responsibility:<br/>\n<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores/\">http://sandradodd.com/chores/</a><br/>\n<br/>\n<br/>\n<br/>\n---Meredith<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Paying children for chores","postDate":"1330188770","msgId":47942,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppYjNsMitmMzdvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMzAxNzU5ODYuMzgwNjIuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDUubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":47940,"nextInTopic":47943,"prevInTime":47941,"nextInTime":47943,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"... **************** It s worth thinking about why you require work for pay from your child, rather than sharing resources with her. Are you hoping that making","messageBody":"<div id=\"ygrps-yiv-961057133\">Tova &lt;ml_ja@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Because she is at an age (11) were money is becoming more and more valuable, we compiled a list of ways to make money and posted it on the fridge.<br/>\n </span></blockquote>****************<br/>\n<br/>\nIt&#39;s worth thinking about why you require work for pay from your child, rather than sharing resources with her. Are you hoping that making money dependent on work will teach her something? Responsibility or work ethic perhaps? Just as often, what kids learn from such arrangements is that care and human worth are conditional, or that work and possessions are more valuable than needs and feelings.<br/>\n<br/>\nKids don&#39;t need to have money contingent on labor to grow into responsibility:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores/\">http://sandradodd.com/chores/</a><br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":250057382,"authorName":"Tova","from":"Tova &lt;ml_ja@...&gt;","profile":"ml_ja","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Paying children for chores","postDate":"1330175986","msgId":47940,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzAxNzU5ODYuMzgwNjIuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDUubWFpbC5iZjEueWFob28uY29tPg==","inReplyToHeader":"PGppYWJhZytrOTV1QGVHcm91cHMuY29tPg=="},"prevInTopic":47939,"nextInTopic":47942,"prevInTime":47939,"nextInTime":47941,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"Santhy I can understand your train of thought. I ve never been comfortable paying my daughter for housework or giving a random allowance (money=work period).","messageBody":"<div id=\"ygrps-yiv-154711021\">Santhy<br/>\nI can understand your train of thought. I&#39;ve never been comfortable paying my daughter for housework or giving a random allowance (money=work period). Instead if she wants money from me she will clean my room or straighten up my computer area. Right now she has also started selling on Ebay, and she just helped out at a camp for younger children for Feb vacation. She also loves to yard sale, and at one point started a thrift shop on our porch. <br/>\nBecause she is at an age (11) were money is becoming more and more valuable, we compiled a list of ways to make money and posted it on the fridge. She goes to it frequently.<br/>\n-Tova<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Sat, 2/25/12, Santhy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:suprisha@...\">suprisha@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Santhy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:suprisha@...\">suprisha@...</a>&gt;<br/>\nSubject: [unschoolingbasics] Paying children for chores<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Saturday, February 25, 2012, 4:57 AM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      A friend of mine told me that her 9 yr old son wanted to earn some money so she offered to pay him for playing with his younger sister. I have come across this scenario earlier and I am not clear in my thinking on this. What makes me uncomfortable could be cultural conditioning more than logical thinking, but I need some help sorting it out. I think my fear is that if we offer money for playing with a sibling, will we in any way be fostering a &#39;what&#39;s in it for me&#39; mentality, where the next time he spontaneously plays with her he thinks he is entitled to payment for it. In my mind it kind of detracts from the joy of playing with a sibling. I know its not his job to babysit, and in that sense its no different from paying a babysitter, but something still makes me uneasy. It brings to mind the case against rewards and praise.<br/>\n<br/>\n<br/>\n<br/>\nI know some parents offer payment for chores around the house and again I&#39;m not sure about that. I have come around to accepting that housework is the parents&#39; responsibility and that children will help as and when they can if we don&#39;t make an issue of it. The internal shift of housework as a gift to your family wasn&#39;t difficult for me but I&#39;m stuck on this payment issue. (Again, in theory, if the work is not their resposibility, then paying them for it shouldn&#39;t be a problem.) Thinking it through while typing this, I&#39;m wondering if I really have made that shift, and whether the problem is that I still believe that family members should help each other without expecting monetary benefit. Well, shouldn&#39;t they? As you can see, I&#39;m rather confused. Would appreciate some clarity on this.<br/>\n<br/>\n<br/>\n<br/>\nSanthy<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Paying children for chores","postDate":"1330173260","msgId":47939,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBNkFBNjBBLTY3NzUtNDgyNS1BN0VBLUEzM0UxQTY0NzE2N0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGppYWJhZytrOTV1QGVHcm91cHMuY29tPg==","referencesHeader":"PGppYWJhZytrOTV1QGVHcm91cHMuY29tPg=="},"prevInTopic":47938,"nextInTopic":47940,"prevInTime":47938,"nextInTime":47940,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"... It depends how needful of money he is. If he feels like he can t ever get what he wants, he s going to be looking for any possible chance to get more","messageBody":"<div id=\"ygrps-yiv-731331544\">On Feb 25, 2012, at 4:57 AM, Santhy wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; if we offer money for playing with a sibling, will we in any way be fostering a<br/>\n&gt; &#39;what&#39;s in it for me&#39; mentality, where the next time he spontaneously plays<br/>\n&gt; with her he thinks he is entitled to payment for it. <br/>\n<br/>\n </span></blockquote>It depends how needful of money he is. If he feels like he can&#39;t ever get what he wants, he&#39;s going to be looking for any possible chance to get more money. If he feels like his needs are seen as important and getting what he wants seems possible, he&#39;ll choose to do what he enjoys because he enjoys it. He will play with his siblings because he has fun doing it.<br/>\n<br/>\nIf there&#39;s a time mom would hire someone to spend time with the younger one because she wants to get something done, and he is willing to do it, then it seems fair to pay him.<br/>\n<br/>\nDaniel PInk&#39;s TED talk on drive is helpful in seeing why people choose to do difficult tasks without being paid for them:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ted.com/talks/dan_pink_on_motivation.html\">http://www.ted.com/talks/dan_pink_on_motivation.html</a><br/>\n<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Paying children for chores","postDate":"1330165425","msgId":47938,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzAxNjU0MjUuMjU3MzkuWWFob29NYWlsTmVvQHdlYjg3MzAzLm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGppYWJhZytrOTV1QGVHcm91cHMuY29tPg==","referencesHeader":"PGppYWJhZytrOTV1QGVHcm91cHMuY29tPg=="},"prevInTopic":47937,"nextInTopic":47939,"prevInTime":47937,"nextInTime":47939,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"I have given both Simon and Linnaea added incentives to do something for me or with me. When Simon was young and didn t want to go out as much as David and I","messageBody":"<div id=\"ygrps-yiv-970410648\">I have given both Simon and Linnaea added incentives to do something for me or with me. When Simon was young and didn&#39;t want to go out as much as David and I wanted to go out we would get him pokemon figures in downtown Kyoto to make it easier for him to come along. That early begun habit of making sure that there was something in it for Simon has continued throughout their lives. I don&#39;t think it&#39;s made them look for what they are getting out of something. They still are comfortable saying no if they don&#39;t want to go or not getting something special, just for them when they do go. <br/>\n <br/>\nWhen Simon or Linnaea have wanted extra money I&#39;ve tried to budget so that I could give them extra money. They get an allowance that gives them pretty decent buying power and I am willing, most of the time, to help to come up with ways to meet their monetary needs if I can. I&#39;ve never felt that they should work to get money. The allowance was instituted so that if I said no to something they had their own way to get it. Sometimes I couldn&#39;t see a way to say yes to a purchase and I didn&#39;t want them to be stuck with me as the arbiter of their choices. Extending that out to thinking about things I&#39;m happy to help them get has made it difficult for me to imagine making them jump through hoops to get financial help from me above and beyond their allowance. <br/>\n <br/>\nWould your friend have paid someone else to come and play with her daughter? Is that a normal job that she hires someone in to do? If not it seems an arbitrary thing to be paying her son to do. If there was something I was already paying someone to do, or planning paying someone to do, I can imagine shifting the payment to Simon or Linnaea instead of just expecting them to do it gratis. If it was something I was going to do anyhow, or if they were just helping out, I&#39;m not sure that I would be able to justify, in my head, payment for it. I&#39;d just do what I normally do and help them with money when they need it. <br/>\n <br/>\nSchuyler<br/>\n <br/>\n   <br/>\n________________________________<br/>\n<br/>\nFrom: Santhy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:suprisha@...\">suprisha@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSent: Saturday, 25 February 2012, 9:57<br/>\nSubject: [unschoolingbasics] Paying children for chores<br/>\n<br/>\n<br/>\nA friend of mine told me that her 9 yr old son wanted to earn some money so she offered to pay him for playing with his younger sister. I have come across this scenario earlier and I am not clear in my thinking on this. What makes me uncomfortable could be cultural conditioning more than logical thinking, but I need some help sorting it out. I think my fear is that if we offer money for playing with a sibling, will we in any way be fostering a &#39;what&#39;s in it for me&#39; mentality, where the next time he spontaneously plays with her he thinks he is entitled to payment for it. In my mind it kind of detracts from the joy of playing with a sibling. I know its not his job to babysit, and in that sense its no different from paying a babysitter, but something still makes me uneasy. It brings to mind the case against rewards and praise.<br/>\n<br/>\nI know some parents offer payment for chores around the house and again I&#39;m not sure about that. I have come around to accepting that housework is the parents&#39; responsibility and that children will help as and when they can if we don&#39;t make an issue of it. The internal shift of housework as a gift to your family wasn&#39;t difficult for me but I&#39;m stuck on this payment issue. (Again, in theory, if the work is not their resposibility, then paying them for it shouldn&#39;t be a problem.) Thinking it through while typing this, I&#39;m wondering if I really have made that shift, and whether the problem is that I still believe that family members should help each other without expecting monetary benefit. Well, shouldn&#39;t they? As you can see, I&#39;m rather confused. Would appreciate some clarity on this.<br/>\n<br/>\nSanthy<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":272992574,"authorName":"Santhy","from":"&quot;Santhy&quot; &lt;suprisha@...&gt;","profile":"suprisha","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Paying children for chores","postDate":"1330163856","msgId":47937,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppYWJhZytrOTV1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":47938,"prevInTime":47936,"nextInTime":47938,"topicId":47937,"numMessagesInTopic":0,"msgSnippet":"A friend of mine told me that her 9 yr old son wanted to earn some money so she offered to pay him for playing with his younger sister. I have come across this","messageBody":"<div id=\"ygrps-yiv-1478213312\">A friend of mine told me that her 9 yr old son wanted to earn some money so she offered to pay him for playing with his younger sister. I have come across this scenario earlier and I am not clear in my thinking on this. What makes me uncomfortable could be cultural conditioning more than logical thinking, but I need some help sorting it out. I think my fear is that if we offer money for playing with a sibling, will we in any way be fostering a &#39;what&#39;s in it for me&#39; mentality, where the next time he spontaneously plays with her he thinks he is entitled to payment for it. In my mind it kind of detracts from the joy of playing with a sibling. I know its not his job to babysit, and in that sense its no different from paying a babysitter, but something still makes me uneasy. It brings to mind the case against rewards and praise.<br/>\n<br/>\nI know some parents offer payment for chores around the house and again I&#39;m not sure about that. I have come around to accepting that housework is the parents&#39; responsibility and that children will help as and when they can if we don&#39;t make an issue of it. The internal shift of housework as a gift to your family wasn&#39;t difficult for me but I&#39;m stuck on this payment issue. (Again, in theory, if the work is not their resposibility, then paying them for it shouldn&#39;t be a problem.) Thinking it through while typing this, I&#39;m wondering if I really have made that shift, and whether the problem is that I still believe that family members should help each other without expecting monetary benefit. Well, shouldn&#39;t they? As you can see, I&#39;m rather confused. Would appreciate some clarity on this.<br/>\n<br/>\nSanthy</div>","specialLinks":[]}],"prevTopicId":47985,"nextTopicId":47982}}