{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":120,"messages":[{"userId":138085708,"authorName":"earthmothergypsy","from":"&quot;earthmothergypsy&quot; &lt;earthmothergypsy@...&gt;","profile":"earthmothergypsy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and behavior","postDate":"1262285356","msgId":42618,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoaXJuYysxN2s2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhoZnQ2ZCtubWw0QGVHcm91cHMuY29tPg=="},"prevInTopic":42617,"nextInTopic":42619,"prevInTime":42617,"nextInTime":42619,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"They ll eventually meet people who are healthy and also eat plenty of white sugar - we re out here! You may be healthy now, but what it does to you in the","messageBody":"<div id=\"ygrps-yiv-277244944\">&quot;They&#39;ll eventually meet people who are healthy and also eat plenty of white sugar - we&#39;re out here!&quot;<br/>\nYou may be healthy now, but what it does to you in the long run is also important.  The health risks are there and are very real.  You may not see the effects right now, but you will in time. THIS Is what is important for our children to know.  Explain to them what diabetes is and how you have to live and what you have to do if you get it is scary and for those that eat too much of the bad sugars (white sugar and high fructose corn syrup) are setting themselves up for this type of health issue.  I want my kids to know and understand that when they are making choices and decisions.  <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;plaidpanties666&quot; &lt;meredith@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, R & N Tomassone &lt;nrgt@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; In our house we use no sugar....instead we use maple syrup, agave nectar, stevia. White sugar is no good for anyone....ever.<br/>\n&gt; ********************<br/>\n&gt; <br/>\n&gt; Foods affect people differently. Some people thrive on wheat, for instance, while it makes hash of others&#39; digestive systems. Some people seem to need a lot of animal protein, in particular, while others struggle with that. Some people are miserable eating whole grains and/or raw foods and thrive on heavily processed foods! There&#39;s no single diet, no single food thats all good or all bad, not even water!<br/>\n&gt; <br/>\n&gt; From a radical unschooling standpoint, empowering kids to know which foods are better for their unique bodies comes from offering choices, having an array of options. Experimenting with other sweeteners than white sugar is a Great way of provide more options, but at some point, when kids want the white sugar in the house too and mom says &quot;no&quot; or gives the stuff so much of a bad rap that kids dare not mention it, that&#39;s disempowering. Its shutting down decision making based on fear. <br/>\n&gt; <br/>\n&gt; &gt;&gt; Yeah it tastes good....but does it taste good enough to wreck your health.<br/>\n&gt; ***************<br/>\n&gt; <br/>\n&gt; That&#39;s misinformation stemming from fear, right there, and your kids will figure that out. They&#39;ll eventually meet people who are healthy and also eat plenty of white sugar - we&#39;re out here! I have a very poor tolerance for additives and those alternate sweeteners, even the natural ones like stevia, don&#39;t sit as well with me. Its not just about taste, sugar works best for me Because its refined, in the same way that asprin is gentler on many stomachs than willow bark Because its refined. Natural isn&#39;t better for everyone. <br/>\n&gt; <br/>\n&gt; Learning that was a struggle for me. I had to move through years of conditioning as to what my mother said was good for me, and more years of conditioning as to what the alternative community said was good for me. Its nice to know I can offer my kids a chance to discover what&#39;s better for them without them having to shed years of fears and baggage to do so. <br/>\n&gt; <br/>\n&gt; ---Meredith (Mo 8, Ray 16)<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":138085708,"authorName":"earthmothergypsy","from":"&quot;earthmothergypsy&quot; &lt;earthmothergypsy@...&gt;","profile":"earthmothergypsy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and behavior","postDate":"1262284232","msgId":42617,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoaXFrOCs0Z29kQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNjE4My43MDY5Ni5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":42616,"nextInTopic":42618,"prevInTime":42616,"nextInTime":42618,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"We use organic evaporated cane juice mostly, honey, maple syrup, molasses, agave nectar and if necessary organic corn syrup.  We don t avoid sweets because if","messageBody":"<div id=\"ygrps-yiv-831132777\">We use organic evaporated cane juice mostly, honey, maple syrup, molasses, agave nectar and if necessary organic corn syrup.  We don&#39;t avoid sweets because if they are kept from the kids or are made forbidden then they will over do it once they have the freedom to get it themselves.  This makes for a really bad set up, imho.  We do avoid all white sugar, high fructose corn syrup and all the like.  They are poisons to our body.  My kids understand what is healthy for them and what is not and of course everything in moderation.  :)<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I trully don&#39;t understand why Stevia ,that is made from a plant, is Ok as a sweetner and Sugar , which is also made from a plant ( sugar cane  or beets) is said to be poison by others!<br/>\n&gt; Really !<br/>\n&gt; <br/>\n&gt; They do process it to get out the sucrose and the sugar you get in the store is the pure sucrose from the sugar cane or beet.<br/>\n&gt; I grew up in Brazil and my grandparents is to plant a  little bit of sugar cane for us to eat.<br/>\n&gt; Its delicious!<br/>\n&gt; <br/>\n&gt;   <br/>\n&gt; Alex Polikowsky<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and behavior","postDate":"1262278559","msgId":42616,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoaWwyditxcHNzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc1MTE1NS42ODcxMS5xbUB3ZWIxODAxMTEubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":42615,"nextInTopic":42617,"prevInTime":42615,"nextInTime":42617,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"... ******************* You could also assume he s learned not to ask and get a cake mix, or a ready made cake for that matter. You can go beyond have to let","messageBody":"<div id=\"ygrps-yiv-1437530940\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, R & N Tomassone &lt;nrgt@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Now I am sitting here thinking about what i would say if Giuseppe wanted to bake with sugar......the conclusion i come to is that i would have to let him.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nYou could also assume he&#39;s learned not to ask and get a cake mix, or a ready made cake for that matter. You can go beyond &quot;have to let him&quot; to helping him explore. <br/>\n<br/>\nHave you read Danielle Conger&#39;s article &quot;Terrariums and Zen Gardens?&quot; <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://connections.organiclearning.org/Issue1/octbalance.html\">http://connections.organiclearning.org/Issue1/octbalance.html</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I AM afraid to wreck our health!!! I truly am. What do I do about that??<br/>\n<br/>\n </span></blockquote>Human instincts are better than you think where food is concerned. There&#39;s a whoooooole lot of popular &quot;wisdom&quot; that certain ingredients override those instincts, but that override depends on limits, including self-imposed limits! Given free choice, as opposed to (self) regulation, even with white sugar and additives like MSG thrown in, people really can tell what foods are better for their bodies. They taste better and feel better. The better foods become the more desirable (but better varies! collard greens are better for my partner and worse for me).<br/>\n<br/>\nMoving into my 40s I have quite a few friends who are older than I, and I&#39;ve seen the way what&#39;s &quot;better&quot; for a person, in terms of diet, changes with age. I&#39;ve seen people switch to vegan diets for their health, for example, and others switch Away from vegan and vegetarian diets, also for their health. Kids&#39; dietary needs can be very very different from adult ones - they often need more fast energy, and can process simple sugars better than adults, with our slower metabolisms, but even kids&#39; needs will vary widely - my two kids have dietary needs that vary widely! <br/>\n<br/>\nTrust you kids&#39; instincts! They&#39;ll need to do some experimentation to discover what those instincts are really &quot;saying&quot; but its well worth it to know that you are eating what you eat By Choice, not because you&#39;re resisting something else. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and behavior","postDate":"1262277102","msgId":42615,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoaWpsZStjYmg3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI5MDI2MC42NDY3Ny5xbUB3ZWIxODAxMTEubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":42614,"nextInTopic":42616,"prevInTime":42614,"nextInTime":42616,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"... ***************** Its really hard to convey tone in this kind of print-only format. Word choice ends up being important on that level. ... ","messageBody":"<div id=\"ygrps-yiv-1165891894\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, R & N Tomassone &lt;nrgt@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Â Â Â  I did not mean to sound so ominous! We do talk about it ....I also use the term evil with a very light tone<br/>\n </span></blockquote>*****************<br/>\n<br/>\nIts really hard to convey tone in this kind of print-only format. Word choice ends up being important on that level. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Its just that i do the cooking in our family and i need to feel i am doing right by them. I need to feel i am providing them with the best most wonderful food possible!! <br/>\n </span></blockquote>*******************<br/>\n<br/>\nOf course you do, that&#39;s part of being a mom to some extent, for better or worse - and there is a &quot;worse&quot; side, in that it puts you in a position to exert alot of control over your family by means of what you &quot;choose&quot; to cook. The biggest taboo left in our culture revolves around the cook choosing the food. Even adults hesitate to turn down food that&#39;s been cooked &quot;for them&quot;. The cultural pressure to eat what&#39;s been cooked for you is massive. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; as much as i can make everything from scratch...because i like to cook.<br/>\n<br/>\n </span></blockquote>It could be that your kids are fine with that. It could just as easily be that they know its not worth the trouble to ask for ready made food bc you&#39;ll shut them down - you may laugh and joke and say &quot;oh, but I can make you something better&quot; but its still shutting them down if you do. <br/>\n<br/>\nFood discussions like this are always challenging because some kids are very easy going where food is concerned. My stepson is like that, he would always eat anything and has always had a big metabolism, so he&#39;d eat a lot of it. That didn&#39;t mean he liked the food, though. It was easy, before we were radical unschoolers, to just give him &quot;good food&quot; and know that he&#39;d eat it. He *seemed* fine with it, at the time, but it was the kind of &quot;fine&quot; that comes from knowing there are no other options, like kids who are &quot;fine&quot; with school, even though its stifling them. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I choose not use use sugar in my cooking but i don&#39;t keep him from experiencing it....i think that is important also<br/>\n </span></blockquote>******************<br/>\n<br/>\nSo you buy it for him, have processed foods in the house, would cook him a cake from a mix or mac&#39;n cheese from a box if he wanted - if you even thought he might like to try it? That&#39;s part of the difference I&#39;m talking about. There&#39;s nothing in the world wrong with wanting to provide the healthiest possbile options, but to learn about the world, kids are drawn explore it, and where food is concerned that means they are drawn to explore a variety of foods, processed foods along with whole foods, white sugar along with other sweeteners. Its easy to pat yourself on the back for &quot;letting&quot; him have what he wants outside the home, but its still a limit, a barrier to communication and to learning itself. <br/>\n<br/>\nIf I see something I think one of my kids would like (and can afford it) I&#39;ll get that thing. A box of blue jello bc Ray loves jello and has never tried the blue before. A box of Li&#39;l Debbies cupcakes with xmas sprinkes bc Mo hasn&#39;t tried that before, and I think she&#39;d get a kick out of it. I buy those things the same way I&#39;d get a set of D&D dice because Mo hasn&#39;t seen those yet or a set of assorted blades for xacto knives bc Ray&#39;s never used some of those funky shapes and might be interested. Food, even whimsical food, is a learning tool just as much as anything else. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and behavior","postDate":"1262269538","msgId":42610,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NkRFOTg4QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":42609,"nextInTopic":42611,"prevInTime":42609,"nextInTime":42611,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"And, as was stated, each person is different. I feel off with stevia - not sure why exactly but it s kind of like that not all there feeling when you ve got","messageBody":"<div id=\"ygrps-yiv-1188293000\">And, as was stated, each person is different. I feel &#39;off&#39; with stevia -<br/>\nnot sure why exactly but it&#39;s kind of like that not all there feeling<br/>\nwhen you&#39;ve got a head cold only I don&#39;t have head cold symptoms, just<br/>\nthat feeling KWIM? We mostly use evaporated cane juice whenever<br/>\npossible. And, we make sure to keep our B vitamin supply up,<br/>\nparticularly around holidays and such when there&#39;s lots of processed<br/>\nsugar going in. That&#39;s one reason, I&#39;ve heard, that honey works better<br/>\nfor many people - honey is a sugar that carries its own B vitamins with<br/>\nit so the body doesn&#39;t deplete its supply when processing the sugar. And<br/>\nB vitamins are critical for emotional stability. We&#39;ve got a chart<br/>\n(greenleafy.org I believe is the site we got it from) that lists veg<br/>\nsources of all sorts of nutrients, so we check out the B grouping and<br/>\nadd in a scoop more of those things.<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":252534693,"authorName":"R & N Tomassone","from":"R & N Tomassone &lt;nrgt@...&gt;","profile":"nrgt@sbcglobal.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Food and behavior","postDate":"1262269252","msgId":42614,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2NzE3NC4xODYyMi5xbUB3ZWIxODAxMDYubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGhoZ3M2YSt1dDAxQGVHcm91cHMuY29tPg=="},"prevInTopic":42613,"nextInTopic":42615,"prevInTime":42613,"nextInTime":42615,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"Hi Laurie - It appears that the last 2 of my posts never made it through....one was the recipe for the cake. So here goes...Olive Oil Chocolate Cake 1 & 1/2","messageBody":"<div id=\"ygrps-yiv-384190567\">Hi Laurie - It appears that the last 2 of my posts never made it through....one was the recipe for the cake. So here goes...Olive Oil Chocolate Cake<br/>\n1 & 1/2 cups of flour<br/>\n1/4 cup of ground flax meal<br/>\n5 tbsp. cocoa<br/>\n1 tsp. baking soda<br/>\n1/4 cup of maple syrup<br/>\n1/2 tsp. salt<br/>\n1 cup of mashed butternut squash or any other root vegetable<br/>\n5 tbsp. olive oil<br/>\n1 tbsn. vinegar<br/>\n1 tspn vanilla<br/>\n2 eggs<br/>\n1 cup of cold water<br/>\nCombine all the dry ingredients together and then seperately combine the wet ingredients.<br/>\nCombine them all together and pour into a greased 9x9x2 inch pan. Bake at 350 for 30 to 40 minutes. It feels like your&#39;re making mud pies. ENJOY!!<br/>\n <br/>\n Hope you like it, Rachel<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Wed, 12/30/09, Bun &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:alohabun@...\">alohabun@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: Bun &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:alohabun@...\">alohabun@...</a>&gt;<br/>\nSubject: [unschoolingbasics] Re: Food and behavior<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Wednesday, December 30, 2009, 7:44 PM<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--- In unschoolingbasics@ yahoogroups. com, R & N Tomassone &lt;nrgt@...&gt; wrote:<br/>\n&gt;we make great chocolate cake with butternut squash!!!!! Hope this helps !1<br/>\n&gt; <br/>\n<br/>\nWould you give the recipe? Laurie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and behavior","postDate":"1262269176","msgId":42609,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NkRFOTg3QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":42608,"nextInTopic":42610,"prevInTime":42608,"nextInTime":42610,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"... a single connection). Setting up a home network would allow everyone access to the internet connection - we have 4 computers all on a network and","messageBody":"<div id=\"ygrps-yiv-1181017561\"><blockquote><span title=\"ireply\">&gt; like the internet (we&#39;re in the middle of nowhere and can only afford<br/>\n </span></blockquote>a single connection). <br/>\nSetting up a home network would allow everyone access to the internet<br/>\nconnection - we have 4 computers all on a network and connecting to the<br/>\nInternet via a cable modem (if you&#39;re still using dial up that&#39;s a whole<br/>\nother matter) - it doesn&#39;t cost any more to have all 4 computers<br/>\nconnected than to have just one connected. Basically needs a router (I<br/>\nthink they run &lt; $100, depending on specifics maybe under $50 even) and<br/>\nyou&#39;re set. We initially set up our home network just so DH and DS could<br/>\nconnect their laptops and play StarCraft way back when DS was 5 or 6.<br/>\nThen we added Internet and now it&#39;s great because they can be playing<br/>\nonline, surfing, etc and I can work from home (high speed internet<br/>\naccess is required in the work at home policies where I work; I work<br/>\nfrom home one day per week).<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and behavior","postDate":"1262268812","msgId":42608,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NkRFOTg2QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":42607,"nextInTopic":42609,"prevInTime":42607,"nextInTime":42609,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"... We invested in both a light weight, air filled punching bag and a real boxing type punching bag (a peanut bag type thing on an adjustable height weight","messageBody":"<div id=\"ygrps-yiv-1248710048\"><blockquote><span title=\"ireply\">&gt; If he&#39;s hitting, find him something else to do with his arms.<br/>\n<br/>\n </span></blockquote>We invested in both a light weight, air filled punching bag and a real<br/>\nboxing type punching bag (a &#39;peanut&#39; bag type thing on an adjustable<br/>\nheight weight base; needs boxing gloves or other hand protection to hit<br/>\nfull on; feels kind of like a football in weight and texture) several<br/>\nyears ago. That way DS can go hit something in a safe way whenever he<br/>\nneeds to. We&#39;re thinking of also getting a set of sparring pads (the<br/>\nkind the boxing trainers put on their hands) so that he can hit and have<br/>\nhuman contact at the same time without anyone getting hurt. He outgrew<br/>\nthe boxing gloves about a year ago and asked recently to get a new pair,<br/>\nso he&#39;s got a brand new bigger pair of boxing gloves and we&#39;ve made a<br/>\nbetter space for the boxing bag to live in for easier access. We&#39;re<br/>\nhoping to clear out the junk room in the basement (finished space that&#39;s<br/>\naccumulated stuff) so we can put the current punching bag in there and<br/>\nmaybe invest in the big kick boxing type bag that suspends from the<br/>\nceiling so we can all kick and hit when needed (and get a good workout<br/>\nin the bargain).<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":370007365,"authorName":"meadowgirl11","from":"&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt;","profile":"meadowgirl11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and behavior","postDate":"1262240637","msgId":42607,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoaGcxdCtjNGtmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk4MDQwOC45MTQyOC5xbUB3ZWI2NTcxMS5tYWlsLmFjNC55YWhvby5jb20+"},"prevInTopic":42606,"nextInTopic":42608,"prevInTime":42606,"nextInTime":42608,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"  This feeling of having plenty works miracles!  If you have previously limited your son to one brownie then he may have to get to the point of believing","messageBody":"<div id=\"ygrps-yiv-388215191\">  This feeling of having plenty works miracles!  If you have previously limited your son to one brownie then he may have to get to the point of believing that he can have as many as he wants whenever he wants them to get past the feeling<br/>\n<blockquote><span title=\"ireply\"> &gt;  of &quot;I have to eat a lot now because they will be all gone later!&quot;  or he may demand because he doesn&#39;t believe he can just ask.  What would happen if you left a plate of brownies (or something else he has been enjoying) on the counter and letting him eat them as he chooses?  If he has to ask, you are still controlling the food. :)  <br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I have to second this in terms of behaviour, the difference it made over the last almost 2 months since I wrote the weight gain post is amazing. This book, that someone in that thread recommended was huge for me <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Preventing-Childhood-Eating-Problems-Practical/dp/0936077255\">http://www.amazon.com/Preventing-Childhood-Eating-Problems-Practical/dp/0936077255</a> , not just for Terran&#39;s eating, but also for my own. I don&#39;t think it gets mentioned enough in the discussions about food freedom but the idea of eating what you want to eat when you are HUNGRY is something so few of us in this culture know how to do, me included. And kids have to trust that they will be allowed to eat what they want, when they want it before they can get to that place. My other daughter who is 18 months has that perfect trust that whatever food she wants she can have as much as she wants. Sometimes that is chocolate, but usually it is avocado, mini oranges or banana.  <br/>\n<br/>\nI mentioned before, a big turning point for me was Terran breaking down into sobs over a bag of chips his stepdad had opened, because he really thought that he wouldn&#39;t be able to get any more chips if he wanted them. So I went and bought more chips than he could possibly eat and put them on a special shelf just for him. Same with gummies, brownies, ramen, a case of kraft dinner. When he asked me for cookies I gave him more cookies than he asked for. I haven&#39;t stopped offering him other foods, but I followed the advice of the list and the book (yes, I am a sucker for the &quot;authority&quot; of a book) and made sure he has a sense of abundance with the foods he wants. What I am doing is asking him if he&#39;s hungry every time, and telling him to eat as much as his body wants. And it has already made a difference in his moods and eating. He has voluntarily decided not to buy huge quantities of cheap ice cream but to have less plentiful, better quality haagen daas because, in his words, it is more satisfying. The sense of empowerment he so clearly has around food now is really wonderful to observe, now that I have gotten the other voices in my head beaten into submission. It sure feels better than where we were two months ago, weight gain or no. <br/>\n<br/>\nGood luck with your son, I am sure you will figure it out, especially with all the great advice here. <br/>\n<br/>\nbless<br/>\nTammy</div>","specialLinks":[]},{"userId":252534693,"authorName":"R & N Tomassone","from":"R & N Tomassone &lt;nrgt@...&gt;","profile":"nrgt@sbcglobal.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Food and behavior","postDate":"1262221564","msgId":42613,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3NDY5NS4xNDIxOS5xbUB3ZWIxODAxMDYubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGhoZ3M2YSt1dDAxQGVHcm91cHMuY29tPg=="},"prevInTopic":42612,"nextInTopic":42614,"prevInTime":42612,"nextInTime":42614,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"Yes! Here it is Laurie -    Olive oil chocolate cake 1 &1/2 cups of flour 1/4 cup of ground flax meal 5 tbsps cocoa 1 tsp. baking soda 1/4 cup of maple","messageBody":"<div id=\"ygrps-yiv-469254788\">Yes! Here it is Laurie -    Olive oil chocolate cake<br/>\n1 &1/2 cups of flour<br/>\n1/4 cup of ground flax meal<br/>\n5 tbsps cocoa<br/>\n1 tsp. baking soda<br/>\n1/4 cup of maple syrup<br/>\n1/2 tsp. salt<br/>\n1 cup mashed butternut squash or any root vegetable<br/>\n5 tbsp. olive oil<br/>\n1 tbsp. vinegar<br/>\n1 tsp. vanilla<br/>\n2 eggs<br/>\n1 cup cold water<br/>\n Combine all the dry ingredients...then combine seperatly all the wet ingredients.<br/>\nMix it all together and put in a greased 9x9x2 inch pan. Bake at 350 for 30 to 40 minutes! You&#39;ll feel like your&#39;e making mud pie.<br/>\n <br/>\n         Have fun, Rachel<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Wed, 12/30/09, Bun &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:alohabun@...\">alohabun@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: Bun &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:alohabun@...\">alohabun@...</a>&gt;<br/>\nSubject: [unschoolingbasics] Re: Food and behavior<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Wednesday, December 30, 2009, 7:44 PM<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--- In unschoolingbasics@ yahoogroups. com, R & N Tomassone &lt;nrgt@...&gt; wrote:<br/>\n&gt;we make great chocolate cake with butternut squash!!!!! Hope this helps !1<br/>\n&gt; <br/>\n<br/>\nWould you give the recipe? Laurie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":252534693,"authorName":"R & N Tomassone","from":"R & N Tomassone &lt;nrgt@...&gt;","profile":"nrgt@sbcglobal.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Food and behavior","postDate":"1262220577","msgId":42612,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1MTE1NS42ODcxMS5xbUB3ZWIxODAxMTEubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGhoZnQ2ZCtubWw0QGVHcm91cHMuY29tPg=="},"prevInTopic":42611,"nextInTopic":42613,"prevInTime":42611,"nextInTime":42613,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"Now I am sitting here thinking about what i would say if Giuseppe wanted to bake with sugar......the conclusion i come to is that i would have to let him. I","messageBody":"<div id=\"ygrps-yiv-620022090\">Now I am sitting here thinking about what i would say if Giuseppe wanted to bake with sugar......the conclusion i come to is that i would have to let him. I would offer up my experience and opinion and then let him go on ahead with it if he wanted to. I guess i don&#39;t want him to be afraid of it.....i do want him to be smart about it. I want to foster that....i want to empower him to make the best choices for HIM!. This has been a great discussion for me!! I know there is no single diet that is best for everyone....we are all different. But I have never heard anything good about sugar and wanted to pass that on to him. I AM afraid to wreck our health!!! I truly am. What do I do about that?? Wow i am more afraid than I thought.....And i certainly don&#39;t want to add any fear and baggage to my son because of my fear!!! I need to look at myself and this further.....thanks for the insight!!,    Rachel<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Wed, 12/30/09, plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:meredith@...\">meredith@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:meredith@...\">meredith@...</a>&gt;<br/>\nSubject: [unschoolingbasics] Re: Food and behavior<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Wednesday, December 30, 2009, 10:55 AM<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n--- In unschoolingbasics@ yahoogroups. com, R & N Tomassone &lt;nrgt@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; In our house we use no sugar....instead we use maple syrup, agave nectar, stevia. White sugar is no good for anyone....ever.<br/>\n************ ********<br/>\n<br/>\nFoods affect people differently. Some people thrive on wheat, for instance, while it makes hash of others&#39; digestive systems. Some people seem to need a lot of animal protein, in particular, while others struggle with that. Some people are miserable eating whole grains and/or raw foods and thrive on heavily processed foods! There&#39;s no single diet, no single food thats all good or all bad, not even water!<br/>\n<br/>\nFrom a radical unschooling standpoint, empowering kids to know which foods are better for their unique bodies comes from offering choices, having an array of options. Experimenting with other sweeteners than white sugar is a Great way of provide more options, but at some point, when kids want the white sugar in the house too and mom says &quot;no&quot; or gives the stuff so much of a bad rap that kids dare not mention it, that&#39;s disempowering. Its shutting down decision making based on fear. <br/>\n<br/>\n&gt;&gt; Yeah it tastes good....but does it taste good enough to wreck your health.<br/>\n************ ***<br/>\n<br/>\nThat&#39;s misinformation stemming from fear, right there, and your kids will figure that out. They&#39;ll eventually meet people who are healthy and also eat plenty of white sugar - we&#39;re out here! I have a very poor tolerance for additives and those alternate sweeteners, even the natural ones like stevia, don&#39;t sit as well with me. Its not just about taste, sugar works best for me Because its refined, in the same way that asprin is gentler on many stomachs than willow bark Because its refined. Natural isn&#39;t better for everyone. <br/>\n<br/>\nLearning that was a struggle for me. I had to move through years of conditioning as to what my mother said was good for me, and more years of conditioning as to what the alternative community said was good for me. Its nice to know I can offer my kids a chance to discover what&#39;s better for them without them having to shed years of fears and baggage to do so. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":124256069,"authorName":"Bun","from":"&quot;Bun&quot; &lt;alohabun@...&gt;","profile":"alohabun","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and behavior","postDate":"1262220298","msgId":42606,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoZ3M2YSt1dDAxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM2NDY4Ny4zMzEwNi5xbUB3ZWIxODAxMTQubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":42604,"nextInTopic":42607,"prevInTime":42605,"nextInTime":42607,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"... Would you give the recipe?  Laurie","messageBody":"<div id=\"ygrps-yiv-122229183\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, R & N Tomassone &lt;nrgt@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;we make great chocolate cake with butternut squash!!!!! Hope this helps !1<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Would you give the recipe?  Laurie</div>","specialLinks":[]},{"userId":252534693,"authorName":"R & N Tomassone","from":"R & N Tomassone &lt;nrgt@...&gt;","profile":"nrgt@sbcglobal.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Food and behavior","postDate":"1262219701","msgId":42611,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5MDI2MC42NDY3Ny5xbUB3ZWIxODAxMTEubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGhoZ2U1bytnNnBsQGVHcm91cHMuY29tPg=="},"prevInTopic":42610,"nextInTopic":42612,"prevInTime":42610,"nextInTime":42612,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"Hey Meredith -     I did not mean to sound so ominous! We do talk about it ....I also use the term evil with a very light tone....my son is allowed to eat","messageBody":"<div id=\"ygrps-yiv-1625813363\">Hey Meredith - <br/>\n    I did not mean to sound so ominous! We do talk about it ....I also use the term evil with a very light tone....my son is allowed to eat whatever he wants....Its just that i do the cooking in our family and i need to feel i am doing right by them. I need to feel i am providing them with the best most wonderful food possible!! We love food!!! we love to grow it cook with it and eat it. Sugar is not the only thing i stay away from...... and we do eat sugar...i just don&#39;t use it in my cooking. I as much as i can make everything from scratch...because i like to cook. He knows how I feel about sugar....if you were to ask him how my mom feels about candy he would tell you &quot;Mimi doesn&#39;t do the candy trick&quot;. It doesn&#39;t bother him. He has choices about everything...much to my parents dismay!!  He gets to have Halloween candy and candy at christmas and even just for fun. But he does not go crazy for it....this past Easter there was an egg hunt....the kids<br/>\n are all running frantically to get these eggs...Giuseppe comes back with his bag all excited....MOM!!! I got 3!!! Yes 3 eggs!! And he was out of his mind happy!!  I hear you totally about the choice thing.....I choose not use use sugar in my cooking but i don&#39;t keep him from experiencing it....i think that is important also.  I have never called him evil....but i have called him a little monster lol....affectionately!! He calls me tinkerbell!!!<br/>\n <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Wed, 12/30/09, plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:meredith@...\">meredith@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:meredith@...\">meredith@...</a>&gt;<br/>\nSubject: [unschoolingbasics] Re: Food and behavior<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Wednesday, December 30, 2009, 3:45 PM<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n--- In unschoolingbasics@ yahoogroups. com, R & N Tomassone &lt;nrgt@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Gosh i didn&#39;t mean to sound so fanatic....its just what seems to work best for us and i thought i would share that.Â  I truly think white sugar is evil stuff ...just my opinion.<br/>\n************ ********* **<br/>\n<br/>\nDividing things up into &quot;good&quot; and &quot;evil&quot; is certainly extreme - and really its not helpful in terms of building open communication with children. It sets up lines and categories that can cause trouble. Think about applying those categories directly to your children - would you call them &quot;evil&quot; people? And yet if you call something else &quot;evil&quot; and its something a child want to experience, the child can&#39;t help but wonder if mom&#39;s going to lay the same mantle on his or her shoulders: &quot;Oh, you evil person, you are wrecking your health (but I still love you, of course).&quot; <br/>\n<br/>\nIf sugar is hard on your body, say that to your kids. If you have fears as to its health effects, or environmental effects or producing it, or whatever, then its okay to talk about those things as affecting Your choices. But if your goal is to empower your kids, rather than brainwash them, its important to be clear that your choices are not theirs. Sugar may or may not be hard on their bodies. They may or may not be convinced of the efficacy of refusing to buy something as a way of controlling its production on a global scale - and those are their choices. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and behavior","postDate":"1262205944","msgId":42604,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoZ2U1bytnNnBsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMzMDMwNi4yMDc3OS5xbUB3ZWIxODAxMTIubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":42603,"nextInTopic":42606,"prevInTime":42603,"nextInTime":42605,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"... *********************** Dividing things up into good and evil is certainly extreme - and really its not helpful in terms of building open communication","messageBody":"<div id=\"ygrps-yiv-735197155\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, R & N Tomassone &lt;nrgt@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Gosh i didn&#39;t mean to sound so fanatic....its just what seems to work best for us and i thought i would share that.Â  I truly think white sugar is evil stuff ...just my opinion.<br/>\n </span></blockquote>***********************<br/>\n<br/>\nDividing things up into &quot;good&quot; and &quot;evil&quot; is certainly extreme - and really its not helpful in terms of building open communication with children. It sets up lines and categories that can cause trouble. Think about applying those categories directly to your children - would you call them &quot;evil&quot; people? And yet if you call something else &quot;evil&quot; and its something a child want to experience, the child can&#39;t help but wonder if mom&#39;s going to lay the same mantle on his or her shoulders: &quot;Oh, you evil person, you are wrecking your health (but I still love you, of course).&quot; <br/>\n<br/>\nIf sugar is hard on your body, say that to your kids. If you have fears as to its health effects, or environmental effects or producing it, or whatever, then its okay to talk about those things as affecting Your choices. But if your goal is to empower your kids, rather than brainwash them, its important to be clear that your choices are not theirs. Sugar may or may not be hard on their bodies. They may or may not be convinced of the efficacy of refusing to buy something as a way of controlling its production on a global scale - and those are their choices. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":252534693,"authorName":"R & N Tomassone","from":"R & N Tomassone &lt;nrgt@...&gt;","profile":"nrgt@sbcglobal.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Food and behavior","postDate":"1262201703","msgId":42603,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzMDMwNi4yMDc3OS5xbUB3ZWIxODAxMTIubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGhoZzducys1OW9mQGVHcm91cHMuY29tPg=="},"prevInTopic":42602,"nextInTopic":42604,"prevInTime":42602,"nextInTime":42604,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"Gosh i didn t mean to sound so fanatic....its just what seems to work best for us and i thought i would share that.  I truly think white sugar is evil stuff","messageBody":"<div id=\"ygrps-yiv-1265627064\">Gosh i didn&#39;t mean to sound so fanatic....its just what seems to work best for us and i thought i would share that.  I truly think white sugar is evil stuff ...just my opinion. Am I still sounding fanatic??? lol  Just wanted to share what we do.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Wed, 12/30/09, gruvystarchild &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: gruvystarchild &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt;<br/>\nSubject: [unschoolingbasics] Re: Food and behavior<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Wednesday, December 30, 2009, 1:55 PM<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n~~&gt; In our house we use no sugar....instead we use maple syrup, agave nectar, stevia. White sugar is no good for anyone....ever. ~~<br/>\n<br/>\nConsidering that your body processes all of those into glucose, that&#39;s a pretty broad brush stroke to paint.<br/>\n<br/>\nThere are plenty of people in the world who will render that last statement untrue by the way they live. Humans are complex creatures. No one diet is best for everyone. I would be seriously ill on a raw foods diet but some seem to do great on it. <br/>\n<br/>\nPeople who get fanatic about what is healthy or not seem to miss the process of discovery... which is so different for every person.My children get the benefit of assistance in discovering what works for them personally.<br/>\n<br/>\nCurrently, under the same roof we have three that really enjoy meat, two who enjoy limited types of meat, two that eat mainly vegetarian one of which eats no dairy (almost vegan). On the sugar topic I could describe wildly differing diets too. I think sharing information is so important (we&#39;ve learned that dyes really affect my youngest and try to help him find alternatives) but to make blanket statements about any food isn&#39;t going to help that discovery process. <br/>\n<br/>\nSugar is fine for most people, in certain amounts and it&#39;s good to remember that even fruit sugars get converted to glucose. Some people process sugars to glucose quite easily, others do not. It&#39;s best to be in tune with your own body and what it can handle.<br/>\n<br/>\nRen<br/>\nradicalunschooling. blogspot. com<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"gruvystarchild","from":"&quot;gruvystarchild&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and behavior","postDate":"1262199658","msgId":42602,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoZzgxYSs4MTRjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNjE4My43MDY5Ni5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":42601,"nextInTopic":42603,"prevInTime":42601,"nextInTime":42603,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"... To be fair, Stevia doesn t cause your body to convert anything to glucose nor does it feed yeasts. It has an entirely different chemical makeup. I agree","messageBody":"<div id=\"ygrps-yiv-1494143458\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I trully don&#39;t understand why Stevia ,that is made from a plant, is Ok as a sweetner and Sugar , which is also made from a plant ( sugar cane  or beets) is said to be poison by others!<br/>\n&gt; Really !<br/>\n<br/>\n </span></blockquote>To be fair, Stevia doesn&#39;t cause your body to convert anything to glucose nor does it feed yeasts. It has an entirely different chemical makeup. <br/>\n<br/>\nI agree that sugar is not some &quot;evil&quot; but the processing and stripping of all the nutrients is probably more to blame. Same with wheat, but I like my homemade white bread anyway! :)<br/>\n<br/>\nI remember sucking on sugar cane in HI too....it tastes so different from the end product of white sugar. <br/>\n<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"gruvystarchild","from":"&quot;gruvystarchild&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and behavior","postDate":"1262199356","msgId":42601,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoZzducys1OW9mQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhoZnQ2ZCtubWw0QGVHcm91cHMuY29tPg=="},"prevInTopic":42600,"nextInTopic":42602,"prevInTime":42600,"nextInTime":42602,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"~~ In our house we use no sugar....instead we use maple syrup, agave nectar, stevia. White sugar is no good for anyone....ever.~~ Considering that your body","messageBody":"<div id=\"ygrps-yiv-246401652\">~~&gt; In our house we use no sugar....instead we use maple syrup, agave nectar, stevia. White sugar is no good for anyone....ever.~~<br/>\n<br/>\n<br/>\nConsidering that your body processes all of those into glucose, that&#39;s a pretty broad brush stroke to paint.<br/>\n<br/>\nThere are plenty of people in the world who will render that last statement untrue by the way they live. Humans are complex creatures. No one diet is best for everyone. I would be seriously ill on a raw foods diet but some seem to do great on it. <br/>\n<br/>\nPeople who get fanatic about what is healthy or not seem to miss the process of discovery...which is so different for every  person.My children get the benefit of assistance in discovering what works for them personally.<br/>\n<br/>\nCurrently, under the same roof we have three that really enjoy meat, two who enjoy limited types of meat, two that eat mainly vegetarian one of which eats no dairy (almost vegan). On the sugar topic I could describe wildly differing diets too. I think sharing information is so important (we&#39;ve learned that dyes really affect my youngest and try to help him find alternatives) but to make blanket statements about any food isn&#39;t going to help that discovery process. <br/>\n<br/>\nSugar is fine for most people, in certain amounts and it&#39;s good to remember that even fruit sugars get converted to glucose. Some people process sugars to glucose quite easily, others do not. It&#39;s best to be in tune with your own body and what it can handle.<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Food and behavior","postDate":"1262195478","msgId":42600,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjE4My43MDY5Ni5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGhoZnQ2ZCtubWw0QGVHcm91cHMuY29tPg==","referencesHeader":"PGhoZnQ2ZCtubWw0QGVHcm91cHMuY29tPg=="},"prevInTopic":42599,"nextInTopic":42601,"prevInTime":42599,"nextInTime":42601,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"I trully don t understand why Stevia ,that is made from a plant, is Ok as a sweetner and Sugar , which is also made from a plant ( sugar cane  or beets) is","messageBody":"<div id=\"ygrps-yiv-1884784264\">I trully don&#39;t understand why Stevia ,that is made from a plant, is Ok as a sweetner and Sugar , which is also made from a plant ( sugar cane  or beets) is said to be poison by others!<br/>\nReally !<br/>\n<br/>\nThey do process it to get out the sucrose and the sugar you get in the store is the pure sucrose from the sugar cane or beet.<br/>\nI grew up in Brazil and my grandparents is to plant a  little bit of sugar cane for us to eat.<br/>\nIts delicious!<br/>\n<br/>\n  <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and behavior","postDate":"1262192116","msgId":42599,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoZzBsaytqbHZiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhoZnY5dCtzb3RwQGVHcm91cHMuY29tPg=="},"prevInTopic":42597,"nextInTopic":42600,"prevInTime":42598,"nextInTime":42600,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"... ******************** I wanted to add to this that its important, too, to keep in mind that some kids need More of all these things than others. That s an","messageBody":"<div id=\"ygrps-yiv-239992391\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;plaidpanties666&quot; &lt;meredith@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; But with younger children, too, wanting the same thing at the same time can be a sign that you need to engage more with the kids, that they need more connection, or more help finding fun things to do.<br/>\n </span></blockquote>********************<br/>\n<br/>\nI wanted to add to this that its important, too, to keep in mind that some kids need More of all these things than others. That&#39;s an individual difference. Each of my kids has very different needs in terms of attention, connection, help getting going on projects. The 16yo has always needed More. Be sure you&#39;re not judging your son&#39;s needs against other kids and saying &quot;but no-one else needs this much attention&quot; - he needs exactly what he needs, not what someone else needs. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and behavior","postDate":"1262190717","msgId":42597,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoZnY5dCtzb3RwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdFQjZGODQ4NEEyNTQ2RTRCMDk5NjdBQTNENUQyREY3QEF1c3RpbkJ1c2luZXNzPg=="},"prevInTopic":42595,"nextInTopic":42599,"prevInTime":42596,"nextInTime":42598,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"...  ... ********************** Sounds like a perfect situation for a young child to have a months-long meltdown! Have you read any of Schuyler s Rat","messageBody":"<div id=\"ygrps-yiv-321573919\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;~*~Tracy Austin&quot; &lt;webinfusion@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;We (dh) started this (not restricting foods anymore) just after Thanksgiving, and everything is always more difficult when we are with family over the holidays:-)<br/>\n </span></blockquote>&lt;snip&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt; Somehow things always shift to more authoritarian around the holidays.<br/>\n </span></blockquote>**********************<br/>\n<br/>\nSounds like a perfect situation for a young child to have a months-long meltdown! Have you read any of Schuyler&#39;s &quot;Rat Pack&quot; studies? I&#39;m hoping she chimes in with the link bc I don&#39;t have it on my new computer. Its a study of the effects of stress on using &quot;addictive substances&quot;. Its worth thinking about in terms of stress and how it affects human behavior. We Know stress messes us up, even damages our physical health. We also know people under stress make poorer choices overall. It&#39;s a better strategy to find ways to reduce the stress in your home to more managable levels, so that your son has a better chance of developing some Good skills for dealing with stress. He won&#39;t learn those if he&#39;s floundering. <br/>\n<br/>\nWith Ray, it helped to reduce the amount of social contact and events overall, but especially during the holiday times. It gave him time to develop a bit more, and to learn to manage his impulses and feelings during times of less stress. That gave him more confidence in himself as a &quot;good guy&quot; and also gave him a sense of self-control. He stopped seeing himself as a maniac waiting for a trigger. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; Right now we say &quot;hitting&#39;s not ok,...<br/>\n<br/>\n </span></blockquote>If he&#39;s hitting, find him something else to do with his arms. Let him run around the yard whacking weeds, even nice plants if you&#39;re short on weeds! with a stick. Find him games that let him swing his arms, find ways for him to climb more. He needs ways to use his big muscles or he&#39;ll have a sense of slowly building tension in those muscles until he finds a way to use them - one way or another! <br/>\n<br/>\nIn the moment, you can say &quot;No, if you need to hit, hit this...&quot; and have something available. It will take some advance planning and attention (and practice) to implement. Also find ways to meet his other needs proactively. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; hands to yourself, <br/>\n<br/>\n </span></blockquote>Yike! Do you mean &quot;don&#39;t poke your sister&quot; or something similar? Find him things that are Okay to do with his hands, things to touch, pinch, poke, and squish. As someone who&#39;s very tactile, I flinch at the expression &quot;hands to yourself&quot;. Some people need to touch things more - some people need to touch people more! Find ways to honor that proactively so he&#39;s not *just* using it as a way to get attention or express frustration (and meet those other needs, too, so he&#39;s getting enough attention and isn&#39;t having so much frustration). <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;if you have unkind words to say, keep them to yourself<br/>\n<br/>\n </span></blockquote>What about creating a &quot;safe space&quot; where he can say ugly things? If he needs a person to say them too, can it be you? Your dh? Sometimes it can help to vent to another person. Have you ever done that? Gone and complained to a friend, ranted and raved and said ugly things, and felt washed clean afterwards? I don&#39;t do it often, but I have friends I know who can listen without taking it personally. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;share the toy with your sister/brother&quot; (or take turns - this is big for us now - huge battles with hurt feelings all around as I feel like they shouldn&#39;t have to share, but what to do when they both want the same thing at the same time??)<br/>\n </span></blockquote>******************************<br/>\n<br/>\nThat&#39;s hard! Depending on the specifics, it might be easier to buy another of whatever it is so that there&#39;s no sense of having to wait or share - that can generate a sense of limitation, which leads to more binging or clamoring for the desirable thing. <br/>\n<br/>\nThat&#39;s an ongoing issue in our home with electronics, since we&#39;re not exactly rolling in cash ;) One of the ways we manage is getting multiples of things when we can - two play stations, for instance, and two computers - to take the pressure off wanting to use other desirable things, like the internet (we&#39;re in the middle of nowhere and can only afford a single connection). <br/>\n<br/>\nBut with younger children, too, wanting the same thing at the same time can be a sign that you need to engage more with the kids, that they need more connection, or more help finding fun things to do. Like most things, that&#39;s best done proactively! As in, its less effective to try to Distract one of the kids who wants the same thing than it is to realize that one kid or another needs some care and a new direction (and maybe a snack) before he&#39;s kicking around, looking for something fun to do.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; Just now I gave ds a (homemade) brownie and he had a fit when he wanted another one immediately after finishing it because I was taking too long to procure it for him (a minute). <br/>\n </span></blockquote>**********************<br/>\n<br/>\nWhy was it taking you so long? Could he not get the brownie himself? Its reeeeaaaaalllly important, in unschooling food, to make foods readily available, especially with younger children. There should Always be food that can be eaten in less than a minute. One of the reasons sweets are often preferred by kids is that they&#39;re convenient - its easier to eat four cookies than make a sandwich - so its just as important to make other foods As convenient. Level the playing field. Monkey plates are a good way to do that, or just having ready-to-eat foods conveniently placed on low shelves. <br/>\n<br/>\nAlso, are you offering food Before he&#39;s hungry? Once kids are hungry, its hard for them to Want anything but a sweet. I know with Mo if I wait until she&#39;s hungry, she&#39;ll want cookies, but if I leave a little plate of chicken nuggets or popcorn or whatever under her elbow while she&#39;s busy, she&#39;s happy to eat those. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;He never does that for any other type of food:-) So it isn&#39;t just additives that impact behavior. Sugar itself is a culprit. <br/>\n </span></blockquote>*********************<br/>\n<br/>\nOnce Mo gets so hungry all she wants is a sweet her temper is shot, and sweets don&#39;t improve it, that&#39;s for sure. I&#39;m not saying different foods don&#39;t have different effects! But there&#39;s more than one thing going on. If your guy is running through his body&#39;s energy stores too fast, then yes, he&#39;s going to be short tempered. The trick is finding ways to help him keep his &quot;fuel cells&quot; topped up before he crashes. More foods that are readily available can help. Dressing home made food up so it looks pretty can also help if he tends to forget to eat - making food eye catching or fun can help it compete with play for attention, and compete with sweets, which are often more elegant, as well as more readily available. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Any suggestions for other high protein sweets to make at home? <br/>\n<br/>\n </span></blockquote>Any baked recipe - substitute nut butter for some or all of the &quot;fat&quot; ingredient. Also make sure you&#39;re using a nutritionally dense fat, like butter or lard (or coconut oil if you&#39;re vegan). It adds more proteins and fats, which kids need, it also adds more flavor, so you can Cut the sugar. No shit! I can consistently cut the sugar in recipes in half when I use a good fat.<br/>\n<br/>\nSimilarly, you can substitute nut meals for part of the dry ingredient. Look for pecan meal and almond meal/almond flour in organic and bulk food sources. You can also make your own in a coffee mill - not a ton, but enough to add to a recipe. I just did chocolate chip cookies with cashew meal. OMG. Oh! and flax seed meal is another possible additive. Again, in addition to adding nutrition, adding sources of protein and fat make foods tastier. Fat, in particular, is what your mouth identifies as &quot;rich&quot; in terms of taste, and protein will make foods more filling, too. It takes my family twice as long to go through a batch of home-made cookies as store bought, and throwing a handful of pecan meal into a cheapo cake mix guarantees the cake will last longer, even though we all like it more.<br/>\n<br/>\nYou could also make pralines, if you had the mind, or chocolate covered nuts or nut brittle. Its not cheating, its a win-win!<br/>\n<br/>\nAlso, does you guy drink milk? Mo, happily, adores milk, and its always a help when she&#39;s eating a lot of sweets. If I keep topping up her milk cup she gets enough fat and protein to balance. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and behavior","postDate":"1262188557","msgId":42595,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoZnQ2ZCtubWw0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM2NDY4Ny4zMzEwNi5xbUB3ZWIxODAxMTQubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":42594,"nextInTopic":42597,"prevInTime":42594,"nextInTime":42596,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"... ******************** Foods affect people differently. Some people thrive on wheat, for instance, while it makes hash of others digestive systems. Some","messageBody":"<div id=\"ygrps-yiv-1850674112\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, R & N Tomassone &lt;nrgt@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; In our house we use no sugar....instead we use maple syrup, agave nectar, stevia. White sugar is no good for anyone....ever.<br/>\n </span></blockquote>********************<br/>\n<br/>\nFoods affect people differently. Some people thrive on wheat, for instance, while it makes hash of others&#39; digestive systems. Some people seem to need a lot of animal protein, in particular, while others struggle with that. Some people are miserable eating whole grains and/or raw foods and thrive on heavily processed foods! There&#39;s no single diet, no single food thats all good or all bad, not even water!<br/>\n<br/>\nFrom a radical unschooling standpoint, empowering kids to know which foods are better for their unique bodies comes from offering choices, having an array of options. Experimenting with other sweeteners than white sugar is a Great way of provide more options, but at some point, when kids want the white sugar in the house too and mom says &quot;no&quot; or gives the stuff so much of a bad rap that kids dare not mention it, that&#39;s disempowering. Its shutting down decision making based on fear. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Yeah it tastes good....but does it taste good enough to wreck your health.<br/>\n </span></blockquote>***************<br/>\n<br/>\nThat&#39;s misinformation stemming from fear, right there, and your kids will figure that out. They&#39;ll eventually meet people who are healthy and also eat plenty of white sugar - we&#39;re out here! I have a very poor tolerance for additives and those alternate sweeteners, even the natural ones like stevia, don&#39;t sit as well with me. Its not just about taste, sugar works best for me Because its refined, in the same way that asprin is gentler on many stomachs than willow bark Because its refined. Natural isn&#39;t better for everyone. <br/>\n<br/>\nLearning that was a struggle for me. I had to move through years of conditioning as to what my mother said was good for me, and more years of conditioning as to what the alternative community said was good for me. Its nice to know I can offer my kids a chance to discover what&#39;s better for them without them having to shed years of fears and baggage to do so. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":46477013,"authorName":"Ulrike Haupt","from":"&quot;Ulrike Haupt&quot; &lt;rica@...&gt;","profile":"ulrikehaupt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Food and behavior","postDate":"1262183617","msgId":42592,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTIwMWNhODk1ZCQxNjM4OTA1MCRkMWEzZmVhOUB1bHJpa2VjNjUwZmMxYj4=","referencesHeader":"PDIxMTI2Mi42MDkwMS5xbUB3ZWI2NTcwMi5tYWlsLmFjNC55YWhvby5jb20+IDw3RUI2Rjg0ODRBMjU0NkU0QjA5OTY3QUEzRDVEMkRGN0BBdXN0aW5CdXNpbmVzcz4="},"prevInTopic":42591,"nextInTopic":42593,"prevInTime":42591,"nextInTime":42593,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"Tracy and all of you Just a couple of days ago I received an awesome article from Rebecca Marina regarding food and emotions. It kind of turns the idea of good","messageBody":"<div id=\"ygrps-yiv-922065531\">Tracy and all of you<br/>\n<br/>\nJust a couple of days ago I received an awesome article from Rebecca Marina regarding food and emotions. It kind of turns the idea of good and bad food a little bit upside down.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://rebeccamarina.com/2009/12/feelings-in-food/\">http://rebeccamarina.com/2009/12/feelings-in-food/</a><br/>\n<br/>\nBlissings<br/>\nUlrike<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141243160,"authorName":"Kathryn","from":"&quot;Kathryn&quot; &lt;kathryndubay@...&gt;","profile":"observeandlearn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and behavior","postDate":"1262173743","msgId":42594,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoZmVuZis5bzNxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEY4RkQ0QTM0M0ZFNjRFODM4QTBDNzBDMUFEOEFBN0MwQExZTEFMQVAyPg=="},"prevInTopic":42593,"nextInTopic":42595,"prevInTime":42593,"nextInTime":42595,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"... are you sure it s from the sugar?  I d say it s more likely from the *absence* of protein. Interesting point -- very true for my little guy, Jude (4). I","messageBody":"<div id=\"ygrps-yiv-807713658\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt; wrote:<br/>\n<br/>\n&quot;are you sure it&#39;s from the sugar?  I&#39;d say it&#39;s more likely from the *absence* of protein.&quot;<br/>\n<br/>\nInteresting point -- very true for my little guy, Jude (4).  <br/>\n<br/>\nI wonder;  if your little one is picky with sweets, is this the way for All foods types?  When defooding, we tend to notice only the behaviour/actions associated with foods once limited/forbidden.  Observing Jude&#39;s reactions to foods (as objectively as possible!), he tends to sniff, nibble, taste test All foods before eating (if he so chooses to).  Sugary foods included.  <br/>\n<br/>\n&quot;. . . what about home baked sweets that also have some protein?&quot;  <br/>\n<br/>\nTo get specific, ground hazelnut, almonds, tahini (sesame seed paste) are real easy to add to a sweet biscuit/cake mix.  Yum.  High in protein.  I also tend to throw in a bit of bee pollen (nutrient dense).  <br/>\n<br/>\nGotta go -- baby awake . . .<br/>\n<br/>\nKathryn D<br/>\n<br/>\nxx </span></blockquote></div>","specialLinks":[]},{"userId":136944076,"authorName":"Jenna Robertson","from":"Jenna Robertson &lt;mamamole@...&gt;","profile":"Mamamole","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Food and behavior","postDate":"1262151021","msgId":42593,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk4MDQwOC45MTQyOC5xbUB3ZWI2NTcxMS5tYWlsLmFjNC55YWhvby5jb20+","inReplyToHeader":"PDdFQjZGODQ4NEEyNTQ2RTRCMDk5NjdBQTNENUQyREY3QEF1c3RpbkJ1c2luZXNzPg=="},"prevInTopic":42592,"nextInTopic":42594,"prevInTime":42592,"nextInTime":42594,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":" how do you handle situations like the below, as in child is wondering what happens if I push or hit or don t share my treat ?   When our children were","messageBody":"<div id=\"ygrps-yiv-311681413\"> how do you handle situations like the below, as in child is wondering &quot;what happens if I push or hit or don&#39;t share my treat&quot;? <br/>\n<br/>\n <br/>\nWhen our children were younger we&#39;d focus our attention first on the injured party to make sure they were o.k.  and then move on towards working through the situation if that was appropriate.  Right now if someone gets hit/pushed/screamed at there&#39;s a pretty good chance that they did something to get that reaction/behavior from their sibling.   example: My oldest is sitting in a chair with her computer.  The youngest starts singing loudly very close to her.  The oldest asks her to stop, the youngest keeps singing.  The oldest gets more and more frustrated but nothing she tries stops the singing.  Finally she shoves her little sister out of her space.  They both could have made different choices.  Most of the time it isn&#39;t clear who is &quot;right&quot; or &quot;wrong&quot; so it&#39;s best not to try and figure that out and lay blame.  It&#39;s generally works better to discuss different choices both the girls could have made.  However, that&#39;s only effective if they<br/>\n are in a space to talk about it, if they aren&#39;t we let it go and get on w/ life.<br/>\n <br/>\nI think that&#39;s it&#39;s important to help kids understand why hitting may not be the best way to get their needs met.  If the kids are in a place where each can express what they are feeling that is great.  (e.g. &quot;How did you feel when your brother hit you?&quot;)  If not a more general explanation can work, &quot;When you hit someone it can hurt them or upset them.  That can make them less interested in playing with with you in the future.&quot;  If you just say &quot;don&#39;t hit&quot; the child is left wondering, &quot;Why not?&quot;  or may continue the behavior to work through the possible out comes. Then again, they may continue the behavior anyway.  It comes back to meeting needs, in the situation and in general.  What needs are they trying to get met?  What needs do they have in the conflict situation that you can help meet?     <br/>\n <br/>\nIt&#39;s very common for siblings to gleefully torment each other.  In many of the family&#39;s I am close to it is often a younger child who uses it as a means of getting attention from older siblings/adults but I think it&#39;s also a way of figuring out human interaction.<br/>\n <br/>\nSharing is tough.  I don&#39;t think kids should have to share their special things.  It&#39;s a choice.  <br/>\nMy girls love a certain kind of instant soup bowl.  Last time we went to the store to stock up they each picked out three.  My youngest still has two, my middle has eaten all of hers.  The middle thinks the youngest should share, but youngest doesn&#39;t want to because those are her soup bowls.  I suggested that she share one since we could go to the store the next day to replace it, but she still didn&#39;t feel like sharing.  My middle was sad but after a few minutes of looking at choices she was able to come up w/ another option she could accept to meet her need to eat something salty.  If my kids don&#39;t want to share, I may offer them reasons why sharing would be beneficial (if you share w/ her this time, she&#39;s more likely to share w/ you next time) but I try to keep it light and accept their final decision.  If you make them share is it really sharing?  <br/>\n <br/>\nJust now I gave ds a (homemade) brownie and he had a fit when he wanted another one immediately after finishing it because I was taking too long to procure it for him (a minute). Screaming &quot;I want it nowwwwww&quot; at the top of his lungs. He never does that for any other type of food:-) So it isn&#39;t just additives that impact behavior. Sugar itself is a culprit. <br/>\n<br/>\n <br/>\nPerhaps the feeling of &quot;lack of&quot; is actually the culprit?  At first my youngest would be very upset if we didn&#39;t have candy in the house.  (yell, demand, &quot;I need candy NOW!&quot;)  When she finally figured out that we&#39;d always get more candy (and we started keeping candy in the house, and made a few special trips just to restock and then started surprising her w/ gifts of candy when we went to the store w/out her) she didn&#39;t have to demand candy.   I find this has been true w/ a variety of foods.  Hawaiian Bagels have become a favorite, as well as the previously mentioned soup bowls.  What ever it is that my girls &quot;need&quot; I try to stock up on - taking the advice of other more experienced people on this list.  This feeling of having plenty works miracles!  If you have previously limited your son to one brownie then he may have to get to the point of believing that he can have as many as he wants whenever he wants them to get past the feeling<br/>\n of &quot;I have to eat a lot now because they will be all gone later!&quot;  or he may demand because he doesn&#39;t believe he can just ask.  What would happen if you left a plate of brownies (or something else he has been enjoying) on the counter and letting him eat them as he chooses?  If he has to ask, you are still controlling the food. :)  <br/>\n <br/>\n <br/>\n:)<br/>\nJenna<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n&quot;What&#39;s the matter with you? All it takes is faith and trust. Oh! And something I forgot. Dust!&quot;......<br/>\n&quot; Yep, just a little bit of pixie dust. Now, think of the happiest things. It&#39;s the same as having wings.&quot;                -  Peter Pan<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":153200361,"authorName":"~*~Tracy Austin","from":"&quot;~*~Tracy Austin&quot; &lt;webinfusion@...&gt;","profile":"tracyaustin30","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Food and behavior","postDate":"1262120173","msgId":42591,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdFQjZGODQ4NEEyNTQ2RTRCMDk5NjdBQTNENUQyREY3QEF1c3RpbkJ1c2luZXNzPg==","inReplyToHeader":"PDIxMTI2Mi42MDkwMS5xbUB3ZWI2NTcwMi5tYWlsLmFjNC55YWhvby5jb20+","referencesHeader":"PDIxMTI2Mi42MDkwMS5xbUB3ZWI2NTcwMi5tYWlsLmFjNC55YWhvby5jb20+"},"prevInTopic":42590,"nextInTopic":42592,"prevInTime":42590,"nextInTime":42592,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"Hi Jenna, to all who commented on commercial sweets, mostly the stuff he eats is homemade as I avoid most things with additives and HFCS, preservatives, ect.","messageBody":"<div id=\"ygrps-yiv-424641371\">Hi Jenna, to all who commented on commercial sweets, mostly the stuff he eats is homemade as I avoid most things with additives and HFCS, preservatives, ect. Unless asked for like marshmallows and Swiss miss hot cocoa.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;  I think that really letting go is important because if you keep holding onto the &quot;food issue&quot; then it can cause them to stay reactive instead of moving into balance.  <br/>\n <br/>\n </span></blockquote>Yes, I &quot;know&quot; this and if it were just me it&#39;d be much easier. We (dh) started this (not restricting foods anymore) just after Thanksgiving, and everything is always more difficult when we are with family over the holidays:-) And dh balked when I said I wanted to stop limiting foods.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Have you eased up on other areas of control?  My girls are older, but as we shifted towards less controlling parenting (and we&#39;ve never been authoritarian) they needed to find out what that looked like in real life.  <br/>\n<br/>\n </span></blockquote>Somehow things always shift to more authoritarian around the holidays. In-laws think we are too lax and need to discipline more. Jenna, how do you handle situations like the below, as in child is wondering &quot;what happens if I push or hit or don&#39;t share my treat&quot;? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;What happens if I choose to stay up and play on the DS?  what happens if I yell at my sister?  what happens if I push or hit or don&#39;t share my treat?  It could be that your son is also gathering information on the cause and effect of behaviors and that&#39;s part of the equation.  <br/>\n<br/>\n </span></blockquote>Right now we say &quot;hitting&#39;s not ok, hands to yourself, if you have unkind words to say, keep them to yourself, share the toy with your sister/brother&quot; (or take turns - this is big for us now - huge battles with hurt feelings all around as I feel like they shouldn&#39;t have to share, but what to do when they both want the same thing at the same time??)<br/>\n<br/>\nMeredith wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;If he&#39;s eating plenty of home-made sweets - load &#39;em up with protein, and see how that effects things. <br/>\n<br/>\n </span></blockquote>All I can think of here is cheese cake, lol (which I am willing and able to make)! Any suggestions for other high protein sweets to make at home? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;He&#39;s old enough to have heard that sweets &quot;make kids crazy&quot; so he could well be using the sweets as an excuse to do exactly that. Ray did that. He felt out of control for other reasons, but it was Great to be able to blame food. Meeting more of his needs helped enormously, but also moving away from looking for something to &quot;blame&quot; and accepting Ray for who he was at the time. <br/>\n<br/>\n </span></blockquote>Yes, he&#39;s heard this... Good advice thank you!<br/>\n<br/>\nYou also mentioned roughhousing, lots of which takes place around here. Not so much with me because the kids like to fling themselves at me and I always end up getting hurt (can you say wimp?). But fortunately dh is way into that sort of thing. He usually has time outdoors everyday, too, but it&#39;s been so cold lately he has been choosing to stay inside and take hot baths instead.<br/>\n<br/>\nJust now I gave ds a (homemade) brownie and he had a fit when he wanted another one immediately after finishing it because I was taking too long to procure it for him (a minute). Screaming &quot;I want it nowwwwww&quot; at the top of his lungs. He never does that for any other type of food:-) So it isn&#39;t just additives that impact behavior. Sugar itself is a culprit. <br/>\n<br/>\nI do believe, based on my readings here, that it will even out eventually, but it&#39;s not a fun journey at this point, lol!<br/>\n<br/>\nTracy <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":252534693,"authorName":"R & N Tomassone","from":"R & N Tomassone &lt;nrgt@...&gt;","profile":"nrgt@sbcglobal.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Food and behavior","postDate":"1262119320","msgId":42590,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2NDY4Ny4zMzEwNi5xbUB3ZWIxODAxMTQubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDIxRDFCMzg1RjJCMDREOTlBMjRBNDZDODBBNzNFQjIxQEF1c3RpbkJ1c2luZXNzPg=="},"prevInTopic":42589,"nextInTopic":42591,"prevInTime":42589,"nextInTime":42591,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"In our house we use no sugar....instead we use maple syrup, agave nectar, stevia. White sugar is no good for anyone....ever. Yeah it tastes good....but does it","messageBody":"<div id=\"ygrps-yiv-969922433\">In our house we use no sugar....instead we use maple syrup, agave nectar, stevia. White sugar is no good for anyone....ever. Yeah it tastes good....but does it taste good enough to wreck your health. I do all the cooking and thats what i use....end of story. My kid acts like a lunatic with dyes and corn syrup...organic chocolate does not seem to be much of a problem. Thae will get a taste for the other sweetners....and it can be fun for them to experiment. Also we place no restrictions on how much.... and i feel okay doing this because it is safer, more nutritious...etc....we make great chocolate cake with butternut squash!!!!! Hope this helps !1<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Mon, 12/28/09, ~*~Tracy Austin &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:webinfusion@...\">webinfusion@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: ~*~Tracy Austin &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:webinfusion@...\">webinfusion@...</a>&gt;<br/>\nSubject: [unschoolingbasics] Food and behavior<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Monday, December 28, 2009, 5:03 PM<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\nHi all,<br/>\n<br/>\nI participated in the weight gain thread awhile back about not limiting foods. I mentioned that my 4 y/o/ ds had a preference for sweets. I have stopped limiting his consumption of them since the, and he&#39;s been choosing to eat lots of sweets and I had been giving them freely anticipating that it would level off. He does eat other foods, but mainly for breakfast because once he starts on the sweets, that&#39;s all he wants.<br/>\n<br/>\nSo what we are noticing is that he gets hyper-active from the sugar. He screams, throws things, picks fights w/ dd (7) and is basically overall, very disagreeable. Although he is often smiling and laughing (in a diabolical way) throughout. <br/>\n<br/>\nSo now I&#39;m not sure what to do! My inclination is to say no to sweets. To have very few if any available. But then I&#39;m back where I started. I have mentioned to him that sweets can lead to these mood swings and feeling yucky, ect. and he even seems to agree, but says he doesn&#39;t care and wants more.<br/>\n<br/>\nOne concern I had in the weight gain thread was addiction and it seems that he is addicted to sweets! At least his behavior which includes not caring that he&#39;s hurting us physically (hitting, scratching, kicking, biting) seems in keeping with addiction.<br/>\n<br/>\nI&#39;m confused and welcome any thoughts. For a bit more background, we&#39;ve always had homemade sweets (I used to bake for a living) and participate in Halloween, Easter and other holidays that involve candy so sweets are not suddenly new. The unlimited aspect is new, and my daughter (7) handles it much better than ds....<br/>\n<br/>\nMany thanks,<br/>\nTracy<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":136944076,"authorName":"Jenna Robertson","from":"Jenna Robertson &lt;mamamole@...&gt;","profile":"Mamamole","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Food and behavior","postDate":"1262113760","msgId":42589,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIxMTI2Mi42MDkwMS5xbUB3ZWI2NTcwMi5tYWlsLmFjNC55YWhvby5jb20+","inReplyToHeader":"PGhoZGcwbys3b2wwQGVHcm91cHMuY29tPg=="},"prevInTopic":42588,"nextInTopic":42590,"prevInTime":42588,"nextInTime":42590,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"We ve always had homemade sweets in the house, but I ve never been a fan of the additives and corn syrup found in store bought candy.  Our kids had small","messageBody":"<div id=\"ygrps-yiv-799164454\">We&#39;ve always had homemade sweets in the house, but I&#39;ve never been a fan of the additives and corn syrup found in store bought candy.  Our kids had small amounts and I would generally give them free choice in eating Halloween candy but I tried to avoid having it in the house most of the time.  This fall we tried to eliminate any controlling behaviors on our part when it came to food.  There are limits because we have been coping w/ unemployment for 6 the past 6 months.  Even on a limited budget we&#39;ve worked very hard to provide the foods the girls were seeking/asking for/choosing.<br/>\n <br/>\nMy 8 year old has always been inclined towards sweets.  For a while this fall she was eating literally a pound of candy a day.  It was hard to let go of that.  However, we did.  We walked to the store together and bought candy almost every day.  After about a month she eased up on the sweets.  She will still eat candy, but not even daily.  I&#39;ve also noticed that she will choose protein on her own.  Yesterday after a day of friends visiting and eating a pile of candy she was hungry and we looked at the food options.  She chose hummus and whole grain crackers and cheese.  I think that really letting go is important because if you keep holding onto the &quot;food issue&quot; then it can cause them to stay reactive instead of moving into balance.  <br/>\n <br/>\n <br/>\nHave you eased up on other areas of control?  My girls are older, but as we shifted towards less controlling parenting (and we&#39;ve never been authoritarian) they needed to find out what that looked like in real life.  What happens if I choose to stay up and play on the DS?  what happens if I yell at my sister?  what happens if I push or hit or don&#39;t share my treat?  It could be that your son is also gathering information on the cause and effect of behaviors and that&#39;s part of the equation.  <br/>\n<br/>\n:)<br/>\nJenna<br/>\n<br/>\n <br/>\n <br/>\n <br/>\n&quot;What&#39;s the matter with you? All it takes is faith and trust. Oh! And something I forgot. Dust!&quot;......<br/>\n&quot; Yep, just a little bit of pixie dust. Now, think of the happiest things. It&#39;s the same as having wings.&quot;                -  Peter Pan<br/>\n <br/>\n <br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and behavior","postDate":"1262109528","msgId":42588,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoZGcwbys3b2wwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIxRDFCMzg1RjJCMDREOTlBMjRBNDZDODBBNzNFQjIxQEF1c3RpbkJ1c2luZXNzPg=="},"prevInTopic":42587,"nextInTopic":42589,"prevInTime":42587,"nextInTime":42589,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"... ****************** To start with, are you sure its sugar? I ask bc what you describe is vastly more commonly a reaction to high fructose corn syrup and/or","messageBody":"<div id=\"ygrps-yiv-384168162\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;~*~Tracy Austin&quot; &lt;webinfusion@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; So what we are noticing is that he gets hyper-active from the sugar.<br/>\n </span></blockquote>******************<br/>\n<br/>\nTo start with, are you sure its sugar? I ask bc what you describe is vastly more commonly a reaction to high fructose corn syrup and/or dyes, both common in commercial sweets - its important to find that out! It creates a different set of options/circumstances. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So what we are noticing is that he gets hyper-active from the sugar. He screams, throws things, picks fights w/ dd (7) and is basically overall, very disagreeable. Although he is often smiling and laughing (in a diabolical way) throughout.<br/>\n </span></blockquote>*******************************<br/>\n<br/>\nThere are a couple other issues mixed in with this. One is his age! The hurting while smiling thing is not uncommon for a 4-5 yo. Its worthwhile to look for some developmental needs that are going unmet. Is he getting plenty of rough-and-tumble fun? Does he have people to rough-house with regularly? That can be sooooo important in terms of diffusing this kind of issue. The way I thought of it when Ray was little (and we tried all sorts of food connections with Ray without ever finding anything) was that the &quot;play&quot; response is very close to the &quot;fight or flight&quot; response at this stage, so he&#39;d go from &quot;play&quot; to &quot;attack&quot; with no warning, once he got worked up. It helped to know when he&#39;d be more likely to get worked up, and find something big and physical for him to do before then. <br/>\n<br/>\nOther developmental needs include having lots of chances to make decisions and chances to develop competence - to feel able and powerful. Some of the hurting stuff comes out of that. When a kid feels less capable, there&#39;s always hurting. Its easy to be good at hurting and/or being annoying. <br/>\n<br/>\nThe other thing I wonder about is this:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;He does eat other foods, but mainly for breakfast because once he starts on the sweets, that&#39;s all he wants.<br/>\n </span></blockquote>**********************<br/>\n<br/>\nWill he eat home-made sweets or is he really focued on commecial? If its the commercial stuff, I&#39;d be aware of the possibility that there&#39;s some residual effects of limiting, still, especially if you&#39;re talking about sweets in relation to behavior. He&#39;s old enough to have heard that sweets &quot;make kids crazy&quot; so he could well be using the sweets as an excuse to do exactly that. Ray did that. He felt out of control for other reasons, but it was Great to be able to blame food. Meeting more of his needs helped enormously, but also moving away from looking for something to &quot;blame&quot; and accepting Ray for who he was at the time. <br/>\n<br/>\nAt the same time, I don&#39;t want to disregard a couple other possibilities! If your guy is into the commercial stuff, check ingredients carefully and start experimenting with candies with no HFCS or dyes. If he&#39;s eating plenty of home-made sweets - load &#39;em up with protein, and see how that effects things. Regular protein or complex carbs were a big deal for Ray. If he was eating something &quot;solid&quot; every couple hours, there were waaaaayyyy less bruises and broken furniture all around. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Food and behavior","postDate":"1262108419","msgId":42587,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY4RkQ0QTM0M0ZFNjRFODM4QTBDNzBDMUFEOEFBN0MwQExZTEFMQVAyPg==","inReplyToHeader":"PDIxRDFCMzg1RjJCMDREOTlBMjRBNDZDODBBNzNFQjIxQEF1c3RpbkJ1c2luZXNzPg==","referencesHeader":"PDIxRDFCMzg1RjJCMDREOTlBMjRBNDZDODBBNzNFQjIxQEF1c3RpbkJ1c2luZXNzPg=="},"prevInTopic":42586,"nextInTopic":42588,"prevInTime":42586,"nextInTime":42588,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"are you sure it s from the sugar?  i d say it s more likely from the *absence* of protein.  have you done monkey platters - with lts of fun and interesting","messageBody":"<div id=\"ygrps-yiv-674253911\">are you sure it&#39;s from the sugar?  i&#39;d say it&#39;s more likely from the *absence* of protein.  have you done monkey platters - with lts of fun and interesting protein and complex carb choices, as well as some sweets?  what about home baked sweets that also have some protein?  if you are baking, eggs and milk, and wheat  germ, etc. can add lots of protein to something that remains very sweet and delicious to someone with a sweet tooth.<br/>\n<br/>\nlyla<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: ~*~Tracy Austin <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Monday, December 28, 2009 2:03 PM<br/>\n  Subject: [unschoolingbasics] Food and behavior<br/>\n<br/>\n<br/>\n    <br/>\n  Hi all,<br/>\n<br/>\n  I participated in the weight gain thread awhile back about not limiting foods. I mentioned that my 4 y/o/ ds had a preference for sweets. I have stopped limiting his consumption of them since the, and he&#39;s been choosing to eat lots of sweets and I had been giving them freely anticipating that it would level off. He does eat other foods, but mainly for breakfast because once he starts on the sweets, that&#39;s all he wants.<br/>\n<br/>\n  So what we are noticing is that he gets hyper-active from the sugar. He screams, throws things, picks fights w/ dd (7) and is basically overall, very disagreeable. Although he is often smiling and laughing (in a diabolical way) throughout. <br/>\n<br/>\n  So now I&#39;m not sure what to do! My inclination is to say no to sweets. To have very few if any available. But then I&#39;m back where I started. I have mentioned to him that sweets can lead to these mood swings and feeling yucky, ect. and he even seems to agree, but says he doesn&#39;t care and wants more.<br/>\n<br/>\n  One concern I had in the weight gain thread was addiction and it seems that he is addicted to sweets! At least his behavior which includes not caring that he&#39;s hurting us physically (hitting, scratching, kicking, biting) seems in keeping with addiction.<br/>\n<br/>\n  I&#39;m confused and welcome any thoughts. For a bit more background, we&#39;ve always had homemade sweets (I used to bake for a living) and participate in Halloween, Easter and other holidays that involve candy so sweets are not suddenly new. The unlimited aspect is new, and my daughter (7) handles it much better than ds....<br/>\n<br/>\n  Many thanks,<br/>\n  Tracy<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":153200361,"authorName":"~*~Tracy Austin","from":"&quot;~*~Tracy Austin&quot; &lt;webinfusion@...&gt;","profile":"tracyaustin30","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Food and behavior","postDate":"1262037808","msgId":42586,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIxRDFCMzg1RjJCMDREOTlBMjRBNDZDODBBNzNFQjIxQEF1c3RpbkJ1c2luZXNzPg=="},"prevInTopic":0,"nextInTopic":42587,"prevInTime":42585,"nextInTime":42587,"topicId":42586,"numMessagesInTopic":0,"msgSnippet":"Hi all, I participated in the weight gain thread awhile back about not limiting foods. I mentioned that my 4 y/o/ ds had a preference for sweets. I have","messageBody":"<div id=\"ygrps-yiv-648413193\">Hi all,<br/>\n<br/>\nI participated in the weight gain thread awhile back about not limiting foods. I mentioned that my 4 y/o/ ds had a preference for sweets. I have stopped limiting his consumption of them since the, and he&#39;s been choosing to eat lots of sweets and I had been giving them freely anticipating that it would level off. He does eat other foods, but mainly for breakfast because once he starts on the sweets, that&#39;s all he wants.<br/>\n<br/>\nSo what we are noticing is that he gets hyper-active from the sugar. He screams, throws things, picks fights w/ dd (7) and is basically overall, very disagreeable. Although he is often smiling and laughing (in a diabolical way) throughout. <br/>\n<br/>\nSo now I&#39;m not sure what to do! My inclination is to say no to sweets. To have very few if any available. But then I&#39;m back where I started. I have mentioned to him that sweets can lead to these mood swings and feeling yucky, ect. and he even seems to agree, but says he doesn&#39;t care and wants more.<br/>\n<br/>\nOne concern I had in the weight gain thread was addiction and it seems that he is addicted to sweets! At least his behavior which includes not caring that he&#39;s hurting us physically (hitting, scratching, kicking, biting) seems in keeping with addiction.<br/>\n<br/>\nI&#39;m confused and welcome any thoughts. For a bit more background, we&#39;ve always had homemade sweets (I used to bake for a living) and participate in Halloween, Easter and other holidays that involve candy so sweets are not suddenly new. The unlimited aspect is new, and my daughter (7) handles it much better than ds....<br/>\n<br/>\nMany thanks,<br/>\nTracy<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":42776,"nextTopicId":42715}}