{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Still feeling lost and confused","postDate":"1149372973","msgId":14026,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1dDFuZCtla2IzQGVHcm91cHMuY29tPg=="},"prevInTopic":14007,"nextInTopic":0,"prevInTime":14025,"nextInTime":14027,"topicId":13926,"numMessagesInTopic":0,"msgSnippet":" What I am seeing is that unschooling helps me focus on my childrens strengths, not their weaknesses..  I m SO glad you mentioned this! One of the really","messageBody":"<div id=\"ygrps-yiv-1409713640\">&quot; What I am seeing is that unschooling helps me<br/>\nfocus on my childrens&#39; strengths, not their weaknesses.. &quot;<br/>\n<br/>\nI&#39;m SO glad you mentioned this!<br/>\nOne of the really interesting Dad&#39;s I chatted with at the conference<br/>\ntold me about Japanese Table Tennis players.  The way they train, is<br/>\nto focus on their strengths and really put energy into that.<br/>\nBy contrast, the American players focus on making their weaknesses<br/>\nbetter, and therefore the Japanese players tend to dominate.<br/>\n<br/>\nImagine that! Focusing on strengths and not worrying about the<br/>\nweaknesses!:) What a great concept. One that unschoolers understand<br/>\nall too well.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":813395,"authorName":"Willa Ryan","from":"&quot;Willa Ryan&quot; &lt;willa@...&gt;","profile":"willary2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Still feeling lost and confused","postDate":"1149351790","msgId":14007,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZjMwMWM2ODcyYSQwMThiNzI1MCQwNzAwMDAwYUBERVNBTEVTPg==","referencesHeader":"PGU1cGg0OCtpdnM0QGVHcm91cHMuY29tPiA8NDk4QjA0RTQtQzJDNS00M0VBLTkwRkUtRDM5QkU1RjdFNDQyQGNveC5uZXQ+"},"prevInTopic":14003,"nextInTopic":14026,"prevInTime":14006,"nextInTime":14008,"topicId":13926,"numMessagesInTopic":0,"msgSnippet":"I have 7 kids, but they range in age from 20 (in college) down to 3 years old, so my situation is a bit different.   I don t have to drag all the kids ","messageBody":"<div id=\"ygrps-yiv-943422922\">I have 7 kids, but they range in age from 20 (in college) down to 3 years <br/>\nold, so my situation is a bit different.   I don&#39;t have to drag all the kids <br/>\neverywhere any more, but I remember when we did.  My daughter in particular <br/>\nreally liked to be out and about, while one of my sons was a very strong <br/>\nintrovert who thrived in a homebound environment.<br/>\n<br/>\nWe did a lot of working-out.  If my sons had to be along for one of my <br/>\ndaughter&#39;s events, I would try to do something to make the trip a little <br/>\nbetter for them -- books on tape, a treat at the store, whatever.    Maybe <br/>\nyou could focus some activities for weekends or evenings; my dh is sometimes <br/>\nwilling to watch the kids at home OR provide the transportation for the more <br/>\nactive ones.   In the long run, this working-out process has been a great <br/>\nlearning thing in itself.   We were all challenged to look for working <br/>\nsolutions, but nothing ever worked perfectly for everyone ALL the time.<br/>\n<br/>\nI have a special needs child -- medically fragile and he had a stroke in <br/>\ninfancy, so he has  global delays.    He just turned seven.  Unschooling is <br/>\nworking GREAT for him.    What I am seeing is that unschooling helps me <br/>\nfocus on my childrens&#39; strengths, not their weaknesses..   Structured <br/>\nschooling expects kids to do certain things at certain times, and BE a <br/>\ncertain way too -- usually extroverted.   When my introverted kids went to <br/>\nschool when they were younger, they were overwhelmed by the environment <br/>\naround them -- classes changing every hour, so many people, even the neat <br/>\npreschool toys and learning projects -- it was just TOO much.   But the <br/>\nattitude was that it was my children who were wrong, or my parenting had <br/>\nbeen inadequate, not that the environment was simply not suitable for them.<br/>\n<br/>\nMy special needs child, though he is extroverted, had a similar reaction to <br/>\nEarly Intervention -- SO much sensory input pouring in, and a focus on <br/>\nworking on his deficits.  Unschooling, I can celebrate his progress and find <br/>\nthings that he will respond to, not expect him to respond to something just <br/>\nbecause other kids do or because the therapist wants him to respond.   So <br/>\nmuch of school, especially for special needs children, seems behavioristic <br/>\nand manipulative to me now.<br/>\n<br/>\nI loved Melissa&#39;s post -- yes, I think the solution varies according to the <br/>\nspecific situations.   Maybe if you asked for advice on a particular <br/>\nsituation.   I find that sometimes I think I see a general problem in my <br/>\nkids -- then when I try to describe it specifically, it breaks down to be <br/>\none somehwat manageable problem.   Or the ideas that work for the one <br/>\nspecific problem sometimes help with the related problems.   What&#39;s helped <br/>\nme most, though, is realizing that all the problems have many, many <br/>\napproaches to solutions, and that tackling it this way -- choices and <br/>\npossibilities -- is a great example for the kids.   I&#39;m still learning this, <br/>\nbut even the little I&#39;ve done has had lots of benefits.<br/>\n<br/>\nWilla<br/>\nmarried to Kevin, children Liam 20, Brendan 18, Clare 16, Sean 13, Kieron <br/>\n10, Aidan 7 and Patrick 3</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"Melissa &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Still feeling lost and confused","postDate":"1149348584","msgId":14003,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5OEIwNEU0LUMyQzUtNDNFQS05MEZFLUQzOUJFNUY3RTQ0MkBjb3gubmV0Pg==","inReplyToHeader":"PGU1cGg0OCtpdnM0QGVHcm91cHMuY29tPg==","referencesHeader":"PGU1cGg0OCtpdnM0QGVHcm91cHMuY29tPg=="},"prevInTopic":13965,"nextInTopic":14007,"prevInTime":14002,"nextInTime":14004,"topicId":13926,"numMessagesInTopic":0,"msgSnippet":"What ages are your children? As you can see in my sig line, I have seven, all fairly young. I think it s hard to tell you what to do, especially when every ","messageBody":"<div id=\"ygrps-yiv-2145094717\">What ages are your children? As you can see in my sig line, I have  <br/>\nseven, all fairly young.<br/>\n<br/>\nI think it&#39;s hard to tell you what to do, especially when every  <br/>\ninstance is so dynamic. If one child wants to do something, what is  <br/>\nit? Is it a once-in-a-lifetime chance, or is it a weekly occurrence,  <br/>\nor is it something that could happen any day? Is it in a place that  <br/>\nis enclosed with no other options (like a classroom where it would be  <br/>\nhard to entertain other kids) or is it at a park where people could  <br/>\nmake choices about what they can do at that time? Is it an event you  <br/>\ncould drop the one child off at while you take the other kids to a  <br/>\nlocal park? Is it an event that takes all day, or just an hour, or is  <br/>\nthe time flexible? Are you willing to negotiate and say, &quot;X would  <br/>\nlike the opportunity to do this, since we&#39;re out, is there anything  <br/>\nsomeone else would like to do?&quot; or maybe &quot;X wanted to go to this  <br/>\nplaygroup, I happened to see a new comic book store over there, maybe  <br/>\nwe could stop there later. Do you want to bring a toy/book/gameboy to  <br/>\nstay entertained while x is doing y?&quot;<br/>\n<br/>\nBut you see how it&#39;s not this or that, it really depends on the  <br/>\nsituation. And obviously if it&#39;s something that lasts an hour at an  <br/>\nart studio you&#39;ll play it differently than something that lasts all  <br/>\nday at the park.<br/>\n<br/>\nOn special needs, I like what someone said about everyone having  <br/>\nspecial needs. I have one with autism, one with aspergers, I have one  <br/>\nwith social anxiety and another with speech impediments and adhd. I  <br/>\nhave two with food allergies. I have a newborn. Unschooling allows me  <br/>\nto address each of their needs. It allows them that they know what  <br/>\nthey are interested in and to have me facilitate one on one, rather  <br/>\nthan be in a public school where it&#39;s legislated and the school has  <br/>\nno idea how to force feed their curriculum to a child it wasn&#39;t  <br/>\ntailored to. We did that already, it was an exercise in frustration  <br/>\nand left my kids angry and confused. What to remember is that  <br/>\nunschooling doesn&#39;t look the same for ANY two kids, whether they have  <br/>\na disability or not. We facilitate a LOT more with Breanna than we  <br/>\nneed to with our other kids, primarily because of her autism. She is  <br/>\nnonverbal and can&#39;t communicate like the other children. She has  <br/>\neating disorders based on sensory information, we work harder at  <br/>\nproviding healthy alternatives in appealing manners. It may look more  <br/>\nhectic, but we do things on her schedule...she has to get up and run  <br/>\nin circles in between her play on boardgames or videogames. She reads  <br/>\nbooks by taking them apart and artzifying them (okay, we made up that  <br/>\nword long before we knew that people embellished books as a hobby).<br/>\n<br/>\nAnd there is a huge difference between my aspie and autie, who were  <br/>\nin school for five years, and my son with adhd, because he&#39;s never  <br/>\nbeen in school. He&#39;s never been labeled on a daily basis, told he is  <br/>\nbad because of his behavior, or never forced to do something that is  <br/>\nagainst his nature. The thought of them forcing him to sit in a seat  <br/>\nfor even 15 minutes made me sick. He&#39;s doing great at home, he&#39;s  <br/>\nlearning how to read, learning how to work, learning how to  <br/>\ncompromise in the real world. Last week we were in a restaurant, and  <br/>\nhe asked to go outside because he knew he couldn&#39;t sit still any  <br/>\nlonger. My dh took him out, they ran up and down the hills outside,  <br/>\nand then came in. He was able to finish the meal, and sit while we  <br/>\nwere finishing. He asked near the end if someone could take him back  <br/>\nout, and I asked him if he could wait just a couple minutes until we  <br/>\npaid, and he said sure. And he did, albeit bouncily.<br/>\n<br/>\nSo see, he&#39;s learning all the time, not just academics, but he&#39;s  <br/>\ngetting real world practice of how to live with a differently abled  <br/>\nbrain. My daughter with autism, in public schools would be forced  <br/>\nalong in academics that don&#39;t matter to her, and as  part of her  <br/>\nautism training, they wanted to teach her to brush her teeth and  <br/>\nhair. When she hit sixteen (some kind of magical age ;-)  ) then they  <br/>\nwould teach her how to shop and clean house. WTH? That&#39;s not cool.  <br/>\nShe wants to go NOW. We take her to mcd&#39;s and she buys her own french  <br/>\nfries. They are amazed. Whatever.<br/>\n<br/>\nand now I&#39;m talking too much. I&#39;m trying to avoid dishes. Just like  <br/>\nthe rest of my family, which makes it even more imperative that I do  <br/>\nit. lol! Long and short of it is, it&#39;s not all black and white with  <br/>\ncompromise, and all families benefit from unschooling. Parents, and  <br/>\nkids of any ability.<br/>\nMelissa<br/>\nMom to Josh (11), Breanna (8), Emily (7), Rachel (6), Sam (4), Dan  <br/>\n(2), and Avari Rose<br/>\n<br/>\nshare our lives at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://360.yahoo.com/multimomma\">http://360.yahoo.com/multimomma</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jun 2, 2006, at 9:14 AM, Janice wrote:<br/>\n&gt;<br/>\n&gt; We have a family of 5 children, most of them too young to be left home<br/>\n&gt; without supervision, so what do you do when 1 child wants to go and do<br/>\n&gt; something and the others hate it?  Also, what about children with<br/>\n&gt; special needs?  Should they be unschooled, should it be exactly the<br/>\n&gt; same for them, or should it just be modified somehow?<br/>\n&gt;<br/>\n&gt; As you can tell, I am still very ignorant of this whole process.  I<br/>\n&gt; did ? </span></blockquote></div>","specialLinks":[]},{"userId":218449772,"authorName":"zenmomma@comcast.net","from":"zenmomma@...","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Still feeling lost and confused","postDate":"1149285082","msgId":13965,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2MDIyMDA2MjE1MS40MTk5LjQ0ODBCMkQ5MDAwQzAwOEIwMDAwMTA2NzIyMDY5OTg0OTkwRTAzMDMwMTAzMDIwQTk2QGNvbWNhc3QubmV0Pg=="},"prevInTopic":13960,"nextInTopic":14003,"prevInTime":13964,"nextInTime":13966,"topicId":13926,"numMessagesInTopic":0,"msgSnippet":"... Here s my take on special needs: http://sandradodd.com/special/mary Unschooling allows each child to develop at their own pace, with their own style and","messageBody":"<div id=\"ygrps-yiv-535905979\"><blockquote><span title=\"ireply\">&gt;&gt;Also,  what about children with special needs?  Should they be unschooled,  should it be exactly the same for them, or should it just be modified  somehow? &gt;&gt;<br/>\n<br/>\n </span></blockquote>Here&#39;s my take on special needs: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/special/mary\">http://sandradodd.com/special/mary</a><br/>\n<br/>\nUnschooling allows each child to develop at their own pace, with their own style and utilizing their own special abilities.<br/>\n<br/>\n--<br/>\n~Mary<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://zenmommasgarden.blogspot.com/\">http://zenmommasgarden.blogspot.com/</a><br/>\n<br/>\n&quot;The miracle is not to walk on water. The miracle is to walk on the<br/>\ngreen earth, dwelling deeply in the present moment and feeling truly<br/>\nalive.&quot;<br/>\n                                   ~Thich Nhat Hanh<br/>\n<br/>\n -------------- Original message ----------------------<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Leslie530@...\">Leslie530@...</a></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Still feeling lost and confused","postDate":"1149285024","msgId":13960,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDODU0QTVCMDQxMDVEOC0xOTU0LTU2NzZAbWJsay1yMjguc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PGU1cGg0OCtpdnM0QGVHcm91cHMuY29tPg==","referencesHeader":"PGU1cGg0OCtpdnM0QGVHcm91cHMuY29tPg=="},"prevInTopic":13941,"nextInTopic":13965,"prevInTime":13959,"nextInTime":13961,"topicId":13926,"numMessagesInTopic":0,"msgSnippet":"... From: Janice  There was actually someone who mentioned that maybe this is NOT the right choice for us, and I am feeling somewhat","messageBody":"<div id=\"ygrps-yiv-1750088494\">-----Original Message-----<br/>\n From: Janice &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wolverton@...\">wolverton@...</a>&gt;<br/>\n<br/>\n There was actually someone who mentioned that maybe this is NOT the<br/>\n right choice for us, and I am feeling somewhat rebuffed in my attempts<br/>\n to get a better understanding of how this is supposed to look and work<br/>\n and feel.<br/>\n<br/>\n -=-=-<br/>\n<br/>\n  It&#39;s not for everyone. And we&#39;re not trying to keep you or anyone else <br/>\naway form unschooling. It&#39;s just *hard*! Not everyone&#39;s up for the <br/>\nbattle.<br/>\n<br/>\n -==--=-<br/>\n<br/>\n We have a family of 5 children, most of them too young to be left home<br/>\n without supervision, so what do you do when 1 child wants to go and do<br/>\n something and the others hate it?<br/>\n -=-=-=-<br/>\n<br/>\n Others will multiple children will chime in here.<br/>\n<br/>\n -=-=-=-=-<br/>\n<br/>\n Also, what about children with<br/>\n special needs? Should they be unschooled, should it be exactly the<br/>\n same for them, or should it just be modified somehow?<br/>\n<br/>\n -=-=-<br/>\n<br/>\n  It&#39;s different for *EVERY* child, Special needs or not. No two are <br/>\nidentical.<br/>\n<br/>\n  But special needs seem to benefit even *more* for being accepted for <br/>\nWho They Are Right Now.<br/>\n<br/>\n -=-=-=-<br/>\n<br/>\n  Please feel free to tell me to just observe if that is the better <br/>\nchoice.<br/>\n<br/>\n -=-=-=-=-<br/>\n<br/>\n  I&#39;d suggest to read at SandraDodd.com and at Joyce Fetteroll&#39;s <br/>\nReJoycing site. Get Rue Kream&#39;s absolutely incredible book, Parenting a <br/>\nFree Child, an Unschooled Life<br/>\n<br/>\n  Read here---daily---and go back and read the archives. Ask questions. <br/>\nThat&#39;s what we&#39;re here for.<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\n Kelly Lovejoy<br/>\n Conference Coordinator<br/>\n Live and Learn Unschooling Conference<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n<br/>\n  &quot;The hardest problem for the brain is not learning, but forgetting. No <br/>\nmatter how hard we try, we can&#39;t deliberately forget something we have <br/>\nlearned, and that is catastrophic if we learn that we can&#39;t learn.&quot; <br/>\n~Frank Smith</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Still feeling lost and confused","postDate":"1149277065","msgId":13941,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDODU0OTMyODNBNTMxMS0xOTU0LTREN0FAbWJsay1yMjguc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PDExNTk0MDExLjExNDkyNzU5MDc3MzcuSmF2YU1haWwuP0BmaDAzMS5kaWEuY3AubmV0Pg==","referencesHeader":"PDExNTk0MDExLjExNDkyNzU5MDc3MzcuSmF2YU1haWwuP0BmaDAzMS5kaWEuY3AubmV0Pg=="},"prevInTopic":13939,"nextInTopic":13960,"prevInTime":13940,"nextInTime":13942,"topicId":13926,"numMessagesInTopic":0,"msgSnippet":"... From: jnjstau@hughes.net  When the kids want to do something, think long and hard before you tell them no.  Is there any possible way","messageBody":"<div id=\"ygrps-yiv-335603784\">-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jnjstau@...\">jnjstau@...</a> &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jnjstau@...\">jnjstau@...</a>&gt;<br/>\n<br/>\nWhen the kids want to do something, think long and hard before you<br/>\ntell them no.  Is there any possible way you can tell them yes<br/>\ninstead?  If you have a strong feeling that you should tell them no,<br/>\nask yourself why.  Is it because they could really get hurt?  Is it<br/>\nbecause someone else or something could really get hurt?  Is it because<br/>\n&quot;that just isn&#39;t what we do&quot;?  Will it really matter in a month?  Will<br/>\nyou even remember?  Unless you can come up with a real, right now<br/>\nproblem with what they want to do, tell them yes.<br/>\n<br/>\nUnderstand that sometimes you DO have to say no, sometimes it just<br/>\nworks out that Joey has to come with you to the store even though he<br/>\ndidn&#39;t want to.  Honor that.  Let him know that you realize it is a<br/>\nbummer, sing a song with him, offer to let him pick the radio station,<br/>\nwhatever.  Don&#39;t blow off his feelings.<br/>\n<br/>\nI would just do those two things for a couple of months....see what<br/>\nhappens.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nThat&#39;s a *really* nice way to start out, Julie!<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n<br/>\n  &quot;The hardest problem for the brain is not learning, but forgetting. No <br/>\nmatter how hard we try, we can&#39;t deliberately forget something we have <br/>\nlearned, and that is catastrophic if we learn that we can&#39;t learn.&quot;  <br/>\n~Frank Smith</div>","specialLinks":[]},{"userId":265647787,"authorName":"jnjstau@hughes.net","from":"&quot;jnjstau@...&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Still feeling lost and confused","postDate":"1149275907","msgId":13939,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExNTk0MDExLjExNDkyNzU5MDc3MzcuSmF2YU1haWwuP0BmaDAzMS5kaWEuY3AubmV0Pg=="},"prevInTopic":13932,"nextInTopic":13941,"prevInTime":13938,"nextInTime":13940,"topicId":13926,"numMessagesInTopic":0,"msgSnippet":"Hi Janice, I have 5 kids as well.  Here is what I would recommend to you starting out. When the kids want to do something, think long and hard before you tell","messageBody":"<div id=\"ygrps-yiv-1032055094\">Hi Janice,<br/>\n<br/>\nI have 5 kids as well.  Here is what I would recommend to you starting <br/>\nout.<br/>\n<br/>\nWhen the kids want to do something, think long and hard before you <br/>\ntell them no.  Is there any possible way you can tell them yes <br/>\ninstead?  If you have a strong feeling that you should tell them no, <br/>\nask yourself why.  Is it because they could really get hurt?  Is it <br/>\nbecause someone else or something could really get hurt?  Is it because <br/>\n&quot;that just isn&#39;t what we do&quot;?  Will it really matter in a month?  Will <br/>\nyou even remember?  Unless you can come up with a real, right now <br/>\nproblem with what they want to do, tell them yes.<br/>\n<br/>\nUnderstand that sometimes you DO have to say no, sometimes it just <br/>\nworks out that Joey has to come with you to the store even though he <br/>\ndidn&#39;t want to.  Honor that.  Let him know that you realize it is a <br/>\nbummer, sing a song with him, offer to let him pick the radio station, <br/>\nwhatever.  Don&#39;t blow off his feelings.<br/>\n<br/>\nI would just do those two things for a couple of months....see what <br/>\nhappens.<br/>\n<br/>\nJulie S.</div>","specialLinks":[]},{"userId":212934673,"authorName":"Michelle/Melbrigða","from":"&quot;=?ISO-8859-1?Q?Michelle/Melbrig=F0a?=&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Still feeling lost and confused","postDate":"1149272342","msgId":13932,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA2MDIxMTE5eDY0MTUyMTFlazg4NjRlZTUyYmFkYTkyOWJAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGU1cGg0OCtpdnM0QGVHcm91cHMuY29tPg==","referencesHeader":"PGU1cGg0OCtpdnM0QGVHcm91cHMuY29tPg=="},"prevInTopic":13931,"nextInTopic":13939,"prevInTime":13931,"nextInTime":13933,"topicId":13926,"numMessagesInTopic":0,"msgSnippet":"... Take them with you and do something else while the one child is engaged in his passions.  I have a friend who has 4 children ages 3-14.  They obviously ","messageBody":"<div id=\"ygrps-yiv-618111821\">On 6/2/06, Janice &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wolverton@...\">wolverton@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; We have a family of 5 children, most of them too young to be left home<br/>\n&gt; without supervision, so what do you do when 1 child wants to go and do<br/>\n&gt; something and the others hate it?<br/>\n<br/>\n<br/>\n </span></blockquote>Take them with you and do something else while the one child is engaged in<br/>\nhis passions.  I have a friend who has 4 children ages 3-14.  They obviously<br/>\nhave different interests and are constantly on the go.  While one child<br/>\ntakes karate the other children go outside and run in the grass or read<br/>\nbooks or draw or she runs them down the street to a park.  She has a<br/>\ntreasure trove of activities in their car (since they are always on the go)<br/>\nfrom books, art supplies (mostly drawing things - crayons, books, paper),<br/>\nand games. It *can* be done.  It just takes a little ingenuity on your<br/>\npart.<br/>\n<br/>\nAlso, what about children with<br/>\n<blockquote><span title=\"ireply\"> &gt; special needs?  Should they be unschooled, should it be exactly the<br/>\n&gt; same for them, or should it just be modified somehow?<br/>\n<br/>\n<br/>\n </span></blockquote>HOw should it be modified?  There is a list called &quot;shine with unschooling&quot;<br/>\non yahoogroups and there are many families on there with children that would<br/>\nbe categorized as having special needs by the public school system who are<br/>\nshining just wonderfully.  I believe that Sandra Dodd has a few articles<br/>\nabout unschooling the child with different needs.  *All* our children have<br/>\nneeds, some just need a little more help, patience and time than others.  My<br/>\nson is high functioning autistic, but it hasn&#39;t stopped us from allowing him<br/>\nto live joyfully!<br/>\n<br/>\nPlease feel free to tell me to just observe if that is the better<br/>\n<blockquote><span title=\"ireply\"> &gt; choice.<br/>\n<br/>\n<br/>\n </span></blockquote>Observe, yes.  Question, please.  Read, always!  And ponder all the things<br/>\nyou read here.  Look at your boys and ask yourself if you are willing to<br/>\ntrust them to learn to trust you.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nMichelle<br/>\naka Melbrigða<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://eventualknitting.blogspot.com\">http://eventualknitting.blogspot.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MedHS@yahoogroups.com\">MedHS@yahoogroups.com</a> - Homeschooling for the Medieval Recreationist<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":92643757,"authorName":"Leslie530@aol.com","from":"Leslie530@...","profile":"lescather","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Still feeling lost and confused","postDate":"1149271913","msgId":13931,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0My4yYmY4YzE1LjMxYjFkOTY5QGFvbC5jb20+"},"prevInTopic":13930,"nextInTopic":13932,"prevInTime":13930,"nextInTime":13932,"topicId":13926,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/2/2006 1:56:36 P.M. Eastern Daylight Time, wolverton@charter.net writes: Also,  what about children with special needs?  Should they be","messageBody":"<div id=\"ygrps-yiv-190750148\">In a message dated 6/2/2006 1:56:36 P.M. Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wolverton@...\">wolverton@...</a> writes:<br/>\n<br/>\nAlso,  what about children with <br/>\nspecial needs?  Should they be unschooled,  should it be exactly the <br/>\nsame for them, or should it just be modified  somehow?  <br/>\n<br/>\n<br/>\n<br/>\n**********<br/>\n <br/>\nI think unschooling each child you have will be a little modified, in a  way. <br/>\n Some children need more of this, a little less of that, and all  need a <br/>\nresponsive parent that understands them!  The principles of  unschooling remain, <br/>\nbut how each day unfolds for each child might be a bit  different.  <br/>\n <br/>\nI find that special needs children just need special parenting.  By  that I <br/>\nmean that I find I spend more time researching and working on my  parenting <br/>\nskills to make sure my special needs child is getting what he needs  from me.  I <br/>\nspend more time bringing the world down to more manageable  pieces for him.  <br/>\nAn example might be some children can watch a scarier  movie by themselves and <br/>\ncome to you later for any discussion they need.   Another child might need mom <br/>\nto preview the movie first, or only see it at home  instead of a big scale <br/>\nscary theater or have mom watch with him and discuss the  scarier parts right <br/>\nthen and there.  So with my special needs child, I need  to be much *more* <br/>\nproactive beforehand and more actively  participate at any given time, experience <br/>\nor situation.<br/>\n <br/>\nBut he is happily unschooling for four years.  :)<br/>\n <br/>\nLeslie in SC<br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Still feeling lost and confused","postDate":"1149271611","msgId":13930,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1cHVucis0M2VsQGVHcm91cHMuY29tPg=="},"prevInTopic":13926,"nextInTopic":13931,"prevInTime":13929,"nextInTime":13931,"topicId":13926,"numMessagesInTopic":0,"msgSnippet":"(((((((((((((Janice))))))))))))))) First of all, just realize that what you re going through is very normal, especially for someone with many young children. ","messageBody":"<div id=\"ygrps-yiv-584996408\">(((((((((((((Janice)))))))))))))))<br/>\n<br/>\nFirst of all, just realize that what you&#39;re going through is very<br/>\nnormal, especially for someone with many young children.<br/>\n<br/>\n&quot;We have a family of 5 children, most of them too young to be left home<br/>\nwithout supervision, so what do you do when 1 child wants to go and do<br/>\nsomething and the others hate it?&quot;<br/>\n<br/>\nFind someone for them to go with? Offer up something the others would<br/>\nlike to do after the activity? There are many, many options and we can<br/>\nthrow a bunch out for you to ponder. The point is to get creative and<br/>\nnot decide that unschooling can&#39;t work just because you have challenges.<br/>\nI have four children, and we use a lot of compromise and negotiation!:)<br/>\nThese days, it&#39;s a lot easier becasue most of my children CAN be left<br/>\nat home if they don&#39;t feel like going. Kids get older, it gets easier.<br/>\n<br/>\n&quot;Also, what about children with<br/>\nspecial needs?  Should they be unschooled, should it be exactly the<br/>\nsame for them, or should it just be modified somehow?&quot;<br/>\n<br/>\nWe ALL have special needs.:)<br/>\nWe ALL need unschooling/life to be modified for each of us. That&#39;s the<br/>\nwhole point.  Unschooling is about meeting the child&#39;s needs and<br/>\nhelping them get the most out of life in their own way. It works for<br/>\nevery child in the same way philisophically...but how that plays out<br/>\nin your home is going to look very different from mine. The philosophy<br/>\nof trust and respect is the same. HOW trust and respect are put into<br/>\npractice looks different from person to person.<br/>\n<br/>\n<br/>\n&quot;As you can tell, I am still very ignorant of this whole process.&quot;<br/>\n<br/>\nIgnorance isn&#39;t such a bad thing!:) Unwillingness to learn is<br/>\ndownright evil. lol<br/>\n<br/>\n&quot;Please feel free to tell me to just observe if that is the better<br/>\nchoice.&quot;<br/>\n<br/>\nSome of us learn best by questioning and interacting with others. I<br/>\nknow it helps me. Your questions are really useful things to ponder<br/>\nand I&#39;m sure they&#39;ll help others that aren&#39;t willing to post. Keep on<br/>\nasking...this is the good stuff!!<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":71209375,"authorName":"Janice","from":"&quot;Janice&quot; &lt;wolverton@...&gt;","profile":"ljmwhinmass","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Still feeling lost and confused","postDate":"1149257672","msgId":13926,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1cGg0OCtpdnM0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":13930,"prevInTime":13925,"nextInTime":13927,"topicId":13926,"numMessagesInTopic":0,"msgSnippet":"Hi All, I know it has been several days since I posted about my concerns regarding unschooling, but I do not get a chance to check the computer everyday.  I","messageBody":"<div id=\"ygrps-yiv-1875817299\">Hi All, <br/>\n<br/>\nI know it has been several days since I posted about my concerns <br/>\nregarding unschooling, but I do not get a chance to check the computer <br/>\neveryday.  I would like to thank everyone who responded to my <br/>\npostings, but I am still feeling very lost, confused and overwhelmed.  <br/>\n<br/>\nThere was actually someone who mentioned that maybe this is NOT the <br/>\nright choice for us, and I am feeling somewhat rebuffed in my attempts <br/>\nto get a better understanding of how this is supposed to look and work <br/>\nand feel.  <br/>\n<br/>\nWe have a family of 5 children, most of them too young to be left home <br/>\nwithout supervision, so what do you do when 1 child wants to go and do <br/>\nsomething and the others hate it?  Also, what about children with <br/>\nspecial needs?  Should they be unschooled, should it be exactly the <br/>\nsame for them, or should it just be modified somehow?  <br/>\n<br/>\nAs you can tell, I am still very ignorant of this whole process.  I <br/>\ndid ?<br/>\n<br/>\nPlease feel free to tell me to just observe if that is the better <br/>\nchoice.<br/>\n<br/>\nThanks.<br/>\nJanice W.<br/>\nMom to 5 boys</div>","specialLinks":[]}],"prevTopicId":14025,"nextTopicId":14001}}