{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":53,"messages":[{"userId":163621138,"authorName":"odiniella","from":"&quot;odiniella&quot; &lt;hgaimari@...&gt;","profile":"odiniella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: question about tv","postDate":"1302195732","msgId":46465,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlua3FtaytvbmxqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDYyNUIxRjk2RUNEQzQ1MTY4N0UzQ0VGOTgzMThEMTYyQENvbm5pZVBDPg=="},"prevInTopic":46464,"nextInTopic":46466,"prevInTime":46464,"nextInTime":46466,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"... bread on the table are. Some of them are happy but there are a lot of them that aren t. I m not sure what you re trying to say here, sorry. ****We have a","messageBody":"<div id=\"ygrps-yiv-2095468225\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;otherstar&quot; &lt;otherstar@...&gt;<br/>\nwrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Think about how happy all of those people that have jobs just to put<br/>\n </span></blockquote>bread on the table are. Some of them are happy but there are a lot of<br/>\nthem that aren&#39;t.<br/>\nI&#39;m not sure what you&#39;re trying to say here, sorry.<br/>\n****We have a friend that is wheel chair bound. We had him over this<br/>\npast weekend and one of the things that came up was that if you love<br/>\nwhat you do, you will never work a day in your life. Doing what you love<br/>\nwill put bread on the table just as quick as doing what you hate will.<br/>\nThe only difference is that you might accidently be happy if you get to<br/>\ndo what you love.<br/>\nIn my experience that&#39;s not necessarily true.  In my experience doing<br/>\nwhat you love offers immediate gratification, often at the expense of<br/>\nlong term satisfaction.  If I could make a living smoking pot and<br/>\nplaying armchair psychoanalyst for various people I encounter online I<br/>\nwouldn&#39;t lack for anything.  Except maybe money to pay the bills and buy<br/>\nfood.  In other words, it&#39;s a nice idea, just do what you like and it<br/>\nwill all come together for the good, but I don&#39;t think it&#39;s quite that<br/>\nsimple.  At least, I&#39;ve yet to find it work out that conveniently. <br/>\nInstead, I&#39;m trying to analyze what it is about unschooling that works<br/>\nbecause, again in my experience, the effects are more rewarding than<br/>\nconventional school. However, I don&#39;t have the experience with<br/>\nunschooling as I do with conventional education, and I simply cannot<br/>\nabide by well-meaning advice that suggests I just trust someone because<br/>\nthey say so.  I don&#39;t vote that way, I don&#39;t explore spiritual beliefs<br/>\nthat way, I don&#39;t raise my children that way.  I&#39;m curious as to the<br/>\n&quot;mechanics&quot; if you will, of unschooling.  I want to know *how* it &quot;all<br/>\nworks out in the end.&quot;  I want to know what box am I comfortably sitting<br/>\nin that I don&#39;t know about and how can I learn to recognize it so my<br/>\nchildren need not be squished in here with me if they don&#39;t choose. <br/>\nGathering more information is my goal, not judging anyone.<br/>\n  In asking about tv, I&#39;m learning so much more than tv limitations or<br/>\nlack of limitations.  This has been a rewarding exploration for me in<br/>\njust this one question.  My mind is grabbing all kinds of examples of<br/>\nall kinds of events and I&#39;m learning to reinterpret things in a new (and<br/>\nhopefully) more accurate way.  For example, I&#39;m learning to watch my<br/>\nkids&#39; tv habits in hopes of finding out what roll it serves for them. <br/>\nI&#39;m finding they watch it during the day but by the evening, they&#39;ve got<br/>\ntoo many ideas to explore to be cooped up on the couch.  I&#39;m spending my<br/>\ntime thinking about what they watch and what it might offer them, and<br/>\nI&#39;m looking around my area to see if there are any other resources that<br/>\nmight be inspiring and satisfying for them in the same general area of<br/>\ninterest.  I&#39;m learning what my kids&#39; needs are beyond educational<br/>\npreparation for college and I&#39;m learning that I don&#39;t need to give up<br/>\nthe idea of college for the enjoyment of having a nice relationship with<br/>\nthem now.  I&#39;m learning that exploration of ideas leads to seeking out<br/>\nmentors in those fields and this is a natural developmental evolution<br/>\nfor children/young adults.  I&#39;m learning *why* I can let go of the idea<br/>\nthat professional teachers are better equipped to tend to the needs of<br/>\nmy children seeking mentors, not because someone tells me so, but<br/>\nbecause it makes sense when I look at the details.  I recognize my<br/>\nquestions are going to be frustrating to those who have btdt more times<br/>\nthan they care to recall, but at the same time, it&#39;s helpful *for me*<br/>\nand I assume for others reading, as well.  I&#39;ve not btdt.  I appreciate<br/>\nall the insight and concrete idea&#39;s that have been shared with me.<br/>\n<br/>\n****Practical is good but I would like to give my kids the time to enjoy<br/>\nlife and not worry about being practical. I want them to enjoy being a<br/>\nkid.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Connie<br/>\n<br/>\n </span></blockquote>So do I.  However, I will not set them up for failure if I can help it,<br/>\nand I think not having practical skills would be setting them up for<br/>\nfailure.  I&#39;m exploring how unschooling works so I can discover for<br/>\nmyself if indeed they will be denied those practical skills, and I&#39;m<br/>\nfinding evidence to suggest those skills can be met in other ways.  I&#39;m<br/>\nalso finding these skills, when naturally developed, are stronger than<br/>\nwhen taught as from a lesson.  I find that very intriguing and want to<br/>\nlearn more.  I hope that makes sense.<br/>\nHelen<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163621138,"authorName":"odiniella","from":"&quot;odiniella&quot; &lt;hgaimari@...&gt;","profile":"odiniella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: question about tv","postDate":"1302187752","msgId":46464,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlua2l0OCt2YXBuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg2NjIyNy45ODk2Ny5xbUB3ZWI4NjIwNi5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":46463,"nextInTopic":46465,"prevInTime":46463,"nextInTime":46465,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"... Simon s and ... and filled ... fear lead my ... at the ... know must ... interesting. ... Thank you for this (all of it, but especially the bold).  I can","messageBody":"<div id=\"ygrps-yiv-1020880278\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Schuyler &lt;s.waynforth@...&gt;<br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; So rather than be afraid of sugar or video games or processed foods or<br/>\n&gt; television or heroin or cigarettes or alcohol I have worked to make<br/>\n </span></blockquote>Simon&#39;s and<br/>\n<blockquote><span title=\"ireply\"> &gt; Linnaea&#39;s and David&#39;s and my life good and engaging and interesting<br/>\n </span></blockquote>and filled<br/>\n<blockquote><span title=\"ireply\"> &gt; with the things that each of us want and like to do. I haven&#39;t let<br/>\n </span></blockquote>fear lead my<br/>\n<blockquote><span title=\"ireply\"> &gt; hand or my mind on my parenting and instead have looked, with trust,<br/>\n </span></blockquote>at the<br/>\n<blockquote><span title=\"ireply\"> &gt; things that interest Simon and Linnaea and David for the beauty that I<br/>\n </span></blockquote>know must<br/>\n<blockquote><span title=\"ireply\"> &gt; be there if they found it. And each time I have found something<br/>\n </span></blockquote>interesting.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Schuyler<br/>\n<br/>\n </span></blockquote>Thank you for this (all of it, but especially the bold).  I can see this<br/>\nis where I need to focus my attention - learning how to do this by<br/>\nlearning how to think outside my own box.<br/>\nHelen<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: question about tv","postDate":"1302178617","msgId":46463,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZBRTA3RUIyLUZCNUUtNDg3OS1BMDEyLUI4NDM2MDM5QUZGMEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGluaXY3MitmbDc2QGVHcm91cHMuY29tPg==","referencesHeader":"PGluaXY3MitmbDc2QGVHcm91cHMuY29tPg=="},"prevInTopic":46462,"nextInTopic":46464,"prevInTime":46462,"nextInTime":46464,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"... It s a dim view of human nature! If humanity s default were entertain me then how did all the things that surround you ever get created? And a huge","messageBody":"<div id=\"ygrps-yiv-1536350608\">On Apr 6, 2011, at 8:06 PM, odiniella wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I do recognize unschooling can accomplish that, I&#39;m curious as to<br/>\n&gt; how something like unlimited tv might not hinder that because I just<br/>\n&gt; assume unlimited tv would create a habit of desiring to being<br/>\n&gt; entertained, watching others live life in creative and imaginative  <br/>\n&gt; ways.<br/>\n<br/>\n </span></blockquote>It&#39;s a dim view of human nature! If humanity&#39;s default were &quot;entertain  <br/>\nme&quot; then how did all the things that surround you ever get created?  <br/>\nAnd a huge number of them were created after TV was common place in  <br/>\nhomes in the late 1950s, early 1960s.<br/>\n<br/>\nWe *do* want to be happy :-) And part of becoming happy is relieving  <br/>\nstress. A lot of evening TV watching is stress relief from work and  <br/>\nschool. Without the stress of school and with a job someone really  <br/>\nlikes, the need for stress relief goes way down.<br/>\n<br/>\nA big thing that encourages people to bear stress rather than find  <br/>\nways to take charge and change what they&#39;re doing is school. Kids  <br/>\nspend their childhoods learning to sit down, shut up, take in what  <br/>\nadult experts think is good for you even if you don&#39;t like it, and  <br/>\nthere&#39;s nothing you can do about it so put up with it.<br/>\n<br/>\nDoesn&#39;t *that* sound like training for &quot;get a job you don&#39;t like,  <br/>\nrelieve the stress at night, and repeat until retirement&quot;?<br/>\n<br/>\nHere&#39;s a great talk -- with engaging visuals :-) by Daniel Pink. It&#39;s  <br/>\nabout what drives us. It&#39;s really great for unschooling (without being  <br/>\nabout unschooling.)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=u6XAPnuFjJc\">http://www.youtube.com/watch?v=u6XAPnuFjJc</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/u6XAPnuFjJc?wmode=opaque","type":"VIDEO"}]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: question about tv","postDate":"1302177124","msgId":46462,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc2Q0E3NzkxLUVBMTctNEE5RS05MDg5LTZGMTBERUE2ODE4OEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGluaWo1cStiM2hsQGVHcm91cHMuY29tPg==","referencesHeader":"PGluaWo1cStiM2hsQGVHcm91cHMuY29tPg=="},"prevInTopic":46461,"nextInTopic":46463,"prevInTime":46461,"nextInTime":46463,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"... How do they do that, though? If it s the traditional family structures, then it would work for every family. Every family would be close. But they aren t,","messageBody":"<div id=\"ygrps-yiv-290273490\">On Apr 6, 2011, at 4:41 PM, odiniella wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know this can be accomplished in a variety of ways, as evidenced by<br/>\n&gt; those who come from traditional family structures and maintain close<br/>\n&gt; ties for a lifetime.<br/>\n<br/>\n </span></blockquote>How do they do that, though? If it&#39;s the traditional family  <br/>\nstructures, then it would work for every family. Every family would be  <br/>\nclose.<br/>\n<br/>\nBut they aren&#39;t, are they?<br/>\n<br/>\nSo what is it that creates close families?<br/>\n<br/>\nIt isn&#39;t a crap shoot! Most people think it is. Most people think you  <br/>\ndo your best and the dice roll.<br/>\n<br/>\nBut the key is building strong relationships. And the way to build  <br/>\nstrong relationships is by respecting people for who they are not some  <br/>\nimage of who you believe they could be.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; From the outside, the idea of watching tv all day<br/>\n&gt; doesn&#39;t correspond to the skills needed for independence in adulthood,<br/>\n<br/>\n </span></blockquote>But why would a child spend his entire childhood doing nothing more  <br/>\nthan watching TV? You&#39;re treating that as a real possibility but where  <br/>\nare the *unschooled* kids who are doing that? There are periods of  <br/>\ntime where kids will watch more and play more video games than at  <br/>\nother periods. It can look like the beginning of a downward slide into  <br/>\ncouch potatohood, but if any of the long time radical unschoolers have  <br/>\n18 yo kids who are parked in front of the TV with big supply of Coke  <br/>\nand Cheetos, then we&#39;d all better shut up and stop passing on  <br/>\ninformation that isn&#39;t working!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m<br/>\n&gt; finding the formal education plan has flaws inherent in the system but<br/>\n&gt; ultimately I want my kids to feel their lives are not lacking in<br/>\n&gt; satisfaction for them, and that means giving them the skills they&#39;ll<br/>\n&gt; need to do what interests them as adults.<br/>\n<br/>\n </span></blockquote>Can you make a future life satisfactory by making the present life  <br/>\nunsatisfactory, eg, filled with learning the skills they&#39;ll supposedly  <br/>\nneed?<br/>\n<br/>\nI think you&#39;re stuck in seeing kids as not curious or self driven.  <br/>\nMaybe it&#39;s hard to see while they&#39;re deschooling.<br/>\n<br/>\nIt would also be hard to see someone walking one day if they&#39;re  <br/>\nsitting on the couch with a broken leg if you&#39;re projecting what they  <br/>\nneed to heal into the rest of their lives.<br/>\n<br/>\nIt will help to read about unschooling kids. Not to make your kids  <br/>\nlook like couch potatoes! But to see that respecting their choices,  <br/>\ncreating a rich environment for them to explore, supporting their  <br/>\ninterests, does create kids who are eager to tackle life :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How does unschooling (would<br/>\n&gt; this be considered radical unschooling?) prepare them to this end?<br/>\n<br/>\n </span></blockquote>My daughter spent loads of time in the preteen years watching TV and  <br/>\nplaying video games in with other activities. Pokemon pretty much  <br/>\nshaped her life. :-) She played Pokemon. She collected Pokemon. She  <br/>\ndrew and sculpted Pokemon. She created databases of Pokemon. She  <br/>\ncreated her own Pokemon like creatures and drew comics and other  <br/>\nstories about them. Writing that all out makes it sound very active  <br/>\nand creative but it looked like playing. It didn&#39;t look like it was  <br/>\nleading to anything useful for her adult self.<br/>\n<br/>\nAt 14 she decided to take the college statistics class her dad  <br/>\nteaches. And she was at the top of the class against kids who had been  <br/>\nthrough 12+ years of formal math. She did it because it was fun for  <br/>\nher. No pressure. No requirements. And all the prep for the class she  <br/>\nhad was living life. Most of it picked up through video games. And  <br/>\nusing math in real ways to answer questions she had (about money,  <br/>\ndinosaurs, Pokemon :-) Carl would occasionally bring up an interesting  <br/>\nmath topic like Fibonacci numbers but that was minutes of what others  <br/>\nwould recognize as math over her 14 years compared to the hours and  <br/>\nhours of formal math shoved at the other kids. (Obviously there is  <br/>\ngenetics at work since both Carl and I are mathy people but her the  <br/>\namount of formal math she&#39;d done before the class was minimal.)<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: question about tv","postDate":"1302175382","msgId":46461,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2NjIyNy45ODk2Ny5xbUB3ZWI4NjIwNi5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGluaXY3MitmbDc2QGVHcm91cHMuY29tPg==","referencesHeader":"PGluaXY3MitmbDc2QGVHcm91cHMuY29tPg=="},"prevInTopic":46460,"nextInTopic":46462,"prevInTime":46460,"nextInTime":46462,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"Although I do recognize this (my son has an autistic spectrum disorder - things didn t work out the way we planned), I also suspect that to play the odds,","messageBody":"<div id=\"ygrps-yiv-1815668422\">Although I do recognize this (my son has an autistic spectrum disorder -<br/>\nthings didn&#39;t work out the way we planned), I also suspect that to play<br/>\nthe odds, preparing to be self-sufficient as an adult is not a useless<br/>\ngoal.  I do recognize unschooling can accomplish that, I&#39;m curious as to<br/>\nhow something like unlimited tv might not hinder that because I just<br/>\nassume unlimited tv would create a habit of desiring to being<br/>\nentertained, watching others live life in creative and imaginative ways.<br/>\n--------------------<br/>\n<br/>\nTelevision is a wonderful thing. Try and imagine any other resource that brings <br/>\nthe level of entertainment and engagement and information with seemingly so <br/>\nlittle effort. There is only the internet that I can think of. And that, too, is <br/>\na wonderful thing. However it has been labelled and maligned by lots of folks in <br/>\nlots of ways. And, so, to err on the side of caution parents create boundaries <br/>\nand rules to try and limit access to this amazing and fabulous thing. So what&#39;s <br/>\nwrong with that? Well, I can tell you that one of the things that you fail to do <br/>\nif you limit access to something that your children find enjoyable, interesting, <br/>\nstimulating, engaging is that you don&#39;t trust them to recognise value. And from <br/>\nan unschooling perspective, that&#39;s a pretty big failure. <br/>\n<br/>\n<br/>\nThis morning I thought about addiction. I don&#39;t really buy into the idea of <br/>\naddiction. I know there are substances that have addictive properties, the <br/>\nlonger you ingest them the more you need to maintain the same response, <br/>\nsubstances that cross the blood-brain barrier and change (if only temporarily) <br/>\nthe chemistry of the brain. But, I am a Bruce Alexander <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.walrusmagazine.com/articles/2007.12-health-rat-trap/)\">http://www.walrusmagazine.com/articles/2007.12-health-rat-trap/)</a> believer. I <br/>\nbelieve that environment is the key factor in addiction and not the substance. <br/>\nWe have lots of things in our home that others might find addictive, but none of <br/>\nus do. We have recently unsubscribed from satellite television because nobody <br/>\nwas watching it and we chose, instead, to put the money into buying series or <br/>\nmovies that we wanted to watch on dvd. And I am not using the word &quot;we&quot; <br/>\nincorrectly. There were discussions and it was unanimous, not with me leading. I <br/>\nam still fully willing to resubscribe to satellite television; it wasn&#39;t ever <br/>\nwrit in stone. <br/>\n<br/>\n<br/>\nSo rather than be afraid of sugar or video games or processed foods or <br/>\ntelevision or heroin or cigarettes or alcohol I have worked to make Simon&#39;s and <br/>\nLinnaea&#39;s and David&#39;s and my life good and engaging and interesting and filled <br/>\nwith the things that each of us want and like to do. I haven&#39;t let fear lead my <br/>\nhand or my mind on my parenting and instead have looked, with trust, at the <br/>\nthings that interest Simon and Linnaea and David for the beauty that I know must <br/>\nbe there if they found it. And each time I have found something interesting. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: question about tv","postDate":"1302175014","msgId":46460,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBOTFFODczLUVDRkEtNDM5NC04RUQ3LTFBNTEyRUMxRkE1MEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGluaWMyMSs0cTdhQGVHcm91cHMuY29tPg==","referencesHeader":"PGluaWMyMSs0cTdhQGVHcm91cHMuY29tPg=="},"prevInTopic":46459,"nextInTopic":46461,"prevInTime":46459,"nextInTime":46461,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"... Sometimes. Perhaps. Depends on their personality. People pleasers will tend to take on the values of those they want to please. People with a strong sense","messageBody":"<div id=\"ygrps-yiv-1618789704\">On Apr 6, 2011, at 2:40 PM, odiniella wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; as long as I attribute value to the<br/>\n&gt; choices my kids make, they&#39;ll be inspired to respond to MY thoughts<br/>\n&gt; about something rather than develop their own.<br/>\n<br/>\n </span></blockquote>Sometimes. Perhaps. Depends on their personality.<br/>\n<br/>\nPeople pleasers will tend to take on the values of those they want to  <br/>\nplease.<br/>\n<br/>\nPeople with a strong sense of will will feel like you&#39;re in  <br/>\ncompetition with each other over who is right.<br/>\n<br/>\nIf your judgement is wrong for them even if it&#39;s right for you,  <br/>\nthey&#39;ll think less and less of your judgement each time you tell them  <br/>\nwhat&#39;s the right judgement and you turn out wrong for them.<br/>\n<br/>\nOr try to override their opportunities to explore and come to a  <br/>\ndecision on their own. Sometimes, when people feel pressured to make  <br/>\nthe &quot;right&quot; choice, they&#39;ll choose the opposite because they want the  <br/>\nfreedom to do so. (Which is pretty much the story of teen rebellion.)<br/>\n<br/>\nWhat&#39;s important for relationships is when someone is happy that we  <br/>\nhave found something that makes us happy :-) Whether that be watching  <br/>\nTV or gardening or playing video games or drawing things blowing up.<br/>\n<br/>\nJudging is good for ourselves. We *should* be judging what we feel is  <br/>\nright *for us*. But if someone is happy and not hurting others, it  <br/>\nwon&#39;t do the relationship a bit of good to place a value judgement on  <br/>\nwhat they&#39;re doing that&#39;s making them happy.<br/>\n<br/>\nPicture sitting down to read and every time your husband sees you he  <br/>\nmakes some remark about how your could be doing something so much  <br/>\n&quot;better&quot; or tries to get you to do something else. It might not make  <br/>\nyou like reading less, but it would certainly make you like reading  <br/>\naround him less, and probably whittle away at your relationship with  <br/>\nhim.<br/>\n<br/>\nAnd the thing is, he would be doing it for what he believes are very  <br/>\ngood reasons. He would be wanting the best for you and trying to steer  <br/>\nyou in the right direction. But it wouldn&#39;t feel right or good, would  <br/>\nit? No matter how strong his belief is that his values are the right  <br/>\nvalues for everyone.<br/>\n<br/>\nThen picture sitting down to read and your husband brings you a cup of  <br/>\ncoffee, a blanket for your legs and kisses you on the top of your head.<br/>\n<br/>\nWhich is more likely to build a better relationship? :-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: question about tv","postDate":"1302173838","msgId":46459,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERDMDYyMUEzLTRFMTEtNDZCMy1CMDQ0LThFMDc1NjY5NkExM0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGluaWMyOCthcnNvQGVHcm91cHMuY29tPg==","referencesHeader":"PGluaWMyOCthcnNvQGVHcm91cHMuY29tPg=="},"prevInTopic":46458,"nextInTopic":46460,"prevInTime":46458,"nextInTime":46460,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"... It s pretty typical to want our kids to adopt our values. We ve chosen the values because we think they re the best so why wouldn t we think others would","messageBody":"<div id=\"ygrps-yiv-1800431779\">On Apr 6, 2011, at 2:40 PM, odiniella wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  In reality, I want<br/>\n&gt; them to have the same general value system, but not necessarily  <br/>\n&gt; defined<br/>\n&gt; by the same things. &quot;Creativity&quot; may look different to my son because<br/>\n&gt; he thinks differently than I do, but as long as he does pick up on the<br/>\n&gt; values of respect and consideration and compassion, and things like<br/>\n&gt; this, *how* he goes about it can be up to him, free from my own<br/>\n&gt; influence (well, as much as possible).<br/>\n<br/>\n </span></blockquote>It&#39;s pretty typical to want our kids to adopt our values. We&#39;ve chosen  <br/>\nthe values because we think they&#39;re the best so why wouldn&#39;t we think  <br/>\nothers would think so too! :-)<br/>\n<br/>\nBut the best way to foster an appreciation for those values is  <br/>\nindirectly. Rather than getting your kids to follow your values, you  <br/>\nuse your values in your interactions with them. Use them to solve  <br/>\ntheir problems. Use them to solve your problems. (Well, you would  <br/>\nanyway. That&#39;s what values are for! ;-) *Live* your values.<br/>\n<br/>\nIf you would like your kids to be considerate and compassionate and  <br/>\nrespectful and creative *be* considerate and compassionate and  <br/>\nrespectful and creative in your interactions with them. Be considerate  <br/>\nand compassionate and so forth towards your husband. Engage them in  <br/>\nbeing spontaneously thoughtful of others (like making something  <br/>\nspecial that one of the kids or your husband loves.)<br/>\n<br/>\nUse those values to shape the solutions you help them find to their  <br/>\nproblems. Find solutions that adhere to your values. Use them as tools  <br/>\nto *help* them. Use them as ways to connect to your kids and your  <br/>\nhusband. If their experiences with your values are positive and make  <br/>\nthem feel good it&#39;s far more likely they&#39;ll be drawn to them. If your  <br/>\nvalues are used as a barrier between them and what they want -- for  <br/>\ninstance if you value creativity and use that as an excuse to get them  <br/>\naway from the &quot;uncreative&quot; TV -- they&#39;re far more likely to turn away  <br/>\nfrom the values.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] question about tv","postDate":"1302173157","msgId":46458,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEzQ0EzRkVCLTQyQzQtNEEyQy04RDU2LTZBNzBGOUNCMzg0MUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGluaTRyYytnNnZhQGVHcm91cHMuY29tPg==","referencesHeader":"PGluaTRyYytnNnZhQGVHcm91cHMuY29tPg=="},"prevInTopic":46457,"nextInTopic":46459,"prevInTime":46457,"nextInTime":46459,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"... What if you made the time to knit each day because you enjoyed it and your husband said to someone about you She does sit and knit more than I d like. ","messageBody":"<div id=\"ygrps-yiv-457015650\">On Apr 6, 2011, at 12:37 PM, odiniella wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Not all day, but they do sit and watch more than I&#39;d like.<br/>\n<br/>\n </span></blockquote>What if you made the time to knit each day because you enjoyed it and  <br/>\nyour husband said to someone about you &quot;She does sit and knit more  <br/>\nthan I&#39;d like.&quot;<br/>\n<br/>\nFirst it means he&#39;s watching you and judging your choices based on his  <br/>\nown scale of worth. Second it means he has expectations of who he&#39;d  <br/>\nlike you to be and you&#39;re not living up to them.<br/>\n<br/>\nDoesn&#39;t that just feel like a not healthy relationship?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They&#39;ve both<br/>\n&gt; been to traditional brick and mortar school for years (through 5th  <br/>\n&gt; grade<br/>\n&gt; and 3rd grade) and only recently have I stopped schooling at home  <br/>\n&gt; (they<br/>\n&gt; are now 13 and 11).<br/>\n<br/>\n </span></blockquote>The preteen years are a very typical time for kids to be drawn to TV  <br/>\nand video games in a big way. It&#39;s a transition period between kid  <br/>\ninterests and more adult interests. What they&#39;re drawn to often has  <br/>\nmixes of both younger kid humor and more adult themes but that mix  <br/>\ntends to not appeal outside those few years.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I figure this tv habit is part of my kids<br/>\n&gt; deschooling.<br/>\n<br/>\n </span></blockquote>Is eating ice cream after a tonsilectomy while the throat still hurts  <br/>\na habit or is it filling a need?<br/>\n<br/>\nIf they&#39;re recovering from school and school at home, then it&#39;s  <br/>\nrecovery not a habit. It will help loads to look at your children  <br/>\nrather than some image of who you expect your children to be.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m offering other things to do, through co-op classes<br/>\n&gt; and field trips. We&#39;re going to the library often now. They kids are<br/>\n&gt; finding instructions to make things on youtube so I try to accommodate<br/>\n&gt; their needs (getting a few things at Ace or keeping the table free for<br/>\n&gt; Nerf Gun modification).<br/>\n<br/>\n </span></blockquote>That all sounds great. :-) Unschooling is a mix of figuring out for  <br/>\nyour own particular kids when to mix it up and when to step back and  <br/>\nlet them explore.<br/>\n<br/>\nSomeone once suggested that instead of trying to take something away  <br/>\nfrom their lives, add to their lives. If their lives are full of  <br/>\ninteresting opportunities and they&#39;re still choosing TV shows then  <br/>\nthose shows are what they like most at the moment. Same would be true  <br/>\nif they were reading or digging in the dirt or focusing on drawing  <br/>\nevery Pokemon ever created.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: question about tv","postDate":"1302149114","msgId":46457,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyNUIxRjk2RUNEQzQ1MTY4N0UzQ0VGOTgzMThEMTYyQENvbm5pZVBDPg==","inReplyToHeader":"PGluajVnYStndDZqQGVHcm91cHMuY29tPg==","referencesHeader":"PGluajVnYStndDZqQGVHcm91cHMuY29tPg=="},"prevInTopic":46456,"nextInTopic":46458,"prevInTime":46456,"nextInTime":46458,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"From: odiniella Sent: Wednesday, April 06, 2011 8:54 PM To: unschoolingbasics@yahoogroups.com Subject: [unschoolingbasics] Re: question about tv ... There is a","messageBody":"<div id=\"ygrps-yiv-1103118685\">From: odiniella <br/>\nSent: Wednesday, April 06, 2011 8:54 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSubject: [unschoolingbasics] Re: question about tv<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;It&#39;s how I grew up (my parents still watch tv from after dinner until bedtime, like clockwork). Perhaps it&#39;s foolish of me to assume most people spend their days &quot;at work&quot; and come home to sitcoms, but that&#39;s what I&#39;m used to.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>There is a lot of judgment in this statement. To me, there is nothing wrong with somebody working all day and coming home and relaxing in the evenings. Some people come home from work and read. Some people get on the computer. Some people garden. Why is there a problem with doing something that you enjoy from after dinner until bedtime? Your parents were obviously able to work and pay the bills. If you are used to living a life doing what other people tell you to do, then when you get a bit of free time, it is only natural to want to relax and focus your energy on something that you enjoy. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I&#39;m not surrounded by interesting people but that&#39;s only because I&#39;m not surrounded by many people. Until recently, I&#39;ve been rather housebound. Most people I know I&#39;ve met in the last year or two, almost all homeschool from a curriculum and have schedules to maintain.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Interesting is purely subjective. Just because you don&#39;t think those people are interesting doesn&#39;t mean that they aren&#39;t interesting. My husband and I recently had a discussion about the small things. A lot of small things in life can be interesting if you take the time to notice them and see them from a different perspective. A person or thing does not have to big/loud/fancy/spectacular to be considered interesting. I have learned some of the coolest stuff from people that could be considered &quot;boring&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;We&#39;re still new to this. Our family dynamic is different now than it used to be. There are all kinds of things to do and see and be a part of, of which I am completely ignorant, I&#39;m sure.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Instead of sitting around claiming ignorance, start doing some research. Check and see if there is a Chamber of Commerce or visitor&#39;s bureau in your area. They are great sources of things to do locally. I get kind of burned out on the notion that everything has to be big in order for it to count. A family trip to the grocery store can be fun. A family drive through the countryside is always nice. There are tons of things that could be considered boring or mundane that are full of cool and interesting stuff. If your kids like lots of activities, then find them lots of activities. If your kids would rather hang out at home and pursue their interests that way, then give them the time and space to hang out at home. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I was raised to get a degree to have a job. I was raised to learn to type in case I couldn&#39;t find a job I liked, I could still be a secretary. Not fun, but practical and that&#39;s what puts bread on the table, dontchaknow. This is how I was raised......I can&#39;t help but to worry - I&#39;m taking the advice of strangers here when it comes to my kids and I want to make sure I&#39;m not chasing rainbows, kwim?&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Think about how happy all of those people that have jobs just to put bread on the table are. Some of them are happy but there are a lot of them that aren&#39;t. We have a friend that is wheel chair bound. We had him over this past weekend and one of the things that came up was that if you love what you do, you will never work a day in your life. Doing what you love will put bread on the table just as quick as doing what you hate will. The only difference is that you might accidently be happy if you get to do what you love. Practical is good but I would like to give my kids the time to enjoy life and not worry about being practical. I want them to enjoy being a kid. <br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163621138,"authorName":"odiniella","from":"&quot;odiniella&quot; &lt;hgaimari@...&gt;","profile":"odiniella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: question about tv","postDate":"1302144429","msgId":46456,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGluajhqZCsyNzdqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNEQUY4MjRELTE1N0UtNDFDOS1BNzdCLTE0ODU3QjQzN0M3NEB2ZXJpem9uLm5ldD4="},"prevInTopic":46455,"nextInTopic":46457,"prevInTime":46455,"nextInTime":46457,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"... Where s the parents? How are mom and dad engaging the kids? What ... watching..... Unschooling is about supporting kids interests. So even if a parent ","messageBody":"<div id=\"ygrps-yiv-617041539\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joyce Fetteroll<br/>\n&lt;jfetteroll@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n&gt; If a parent was concerned that their child was only choosing TV, I&#39;d<br/>\n&gt; ask the parent to not look at what the child was (or wasn&#39;t) doing but<br/>\n&gt; what she or he was doing with and for the kids. Unschooling isn&#39;t<br/>\n&gt; about sitting back and letting the kids find their own way.<br/>\n&gt; Unschooling is fully engaging with them, being their support system<br/>\n&gt; *and* the one who keeps life swirling in interesting ways. ......&gt;<br/>\n </span></blockquote>Where&#39;s the parents? How are mom and dad engaging the kids? What<br/>\n<blockquote><span title=\"ireply\"> &gt; activities outside the house are they creating.<br/>\n&gt;<br/>\n&gt; If the parents are keeping the kids lives swirling with activity and<br/>\n&gt; other engaging opportunities that the *kids* enjoy, and still the kids<br/>\n&gt; are drawn to the TV then there&#39;s something the kids are really getting<br/>\n&gt; into. And the parents can connect with the kids by being with them,<br/>\n&gt; watching, finding other things that connect to what they&#39;re<br/>\n </span></blockquote>watching.....&gt; Unschooling is about supporting kids&#39; interests. So even<br/>\nif a parent<br/>\n<blockquote><span title=\"ireply\"> &gt; doesn&#39;t like tractor pulls, ATVs, Pokemon, World of Warcraft, horror<br/>\n&gt; movies, frilly pink princesses, snakes, Chinese food, or Simpsons and<br/>\n&gt; one or more of those are things her kids love, the parents are missing<br/>\n&gt; huge opportunities to engage with who the kids are and enter into<br/>\n&gt; their worlds. Unschooling will flow smoothly when parents treat all<br/>\n&gt; their kids&#39; interests with respect, not just the ones the parents<br/>\n&gt; agree are worthy.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Thank you so much for sharing this!<br/>\nAnd thank you for the links - fascinating!<br/>\nHelen<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163621138,"authorName":"odiniella","from":"&quot;odiniella&quot; &lt;hgaimari@...&gt;","profile":"odiniella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: question about tv","postDate":"1302141258","msgId":46455,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGluajVnYStndDZqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwNDQxMC4yMjEyNS5xbUB3ZWI4MTUwOC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":46454,"nextInTopic":46456,"prevInTime":46454,"nextInTime":46456,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"... and would ... interesting life. ... country ... It s how I grew up (my parents still watch tv from after dinner until bedtime, like clockwork).   Perhaps","messageBody":"<div id=\"ygrps-yiv-1454453659\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, BRIAN POLIKOWSKY<br/>\n&lt;polykowholsteins@...&gt; wrote:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do most people you know live like that??? I know very few like that <br/>\n </span></blockquote>and would<br/>\n<blockquote><span title=\"ireply\"> &gt; have to thin k hard<br/>\n&gt; to come up with names, probably because<br/>\n&gt; I surround myself with interesting people. I have had a very<br/>\n </span></blockquote>interesting life.<br/>\n<blockquote><span title=\"ireply\"> &gt; I have done many different things in life and I live in another<br/>\n </span></blockquote>country<br/>\n<blockquote><span title=\"ireply\"> &gt; different than the one I was raised in.<br/>\n<br/>\n </span></blockquote>   It&#39;s how I grew up (my parents still watch tv from after dinner until<br/>\nbedtime, like clockwork).   Perhaps it&#39;s foolish of me to assume most<br/>\npeople spend their days &quot;at work&quot; and come home to sitcoms, but that&#39;s<br/>\nwhat I&#39;m used to.   I&#39;m not surrounded by interesting people but that&#39;s<br/>\nonly because I&#39;m not surrounded by many people.  Until recently, I&#39;ve<br/>\nbeen rather housebound.  Most people I know I&#39;ve met in the last year or<br/>\ntwo, almost all homeschool from a curriculum and have schedules to<br/>\nmaintain.<br/>\n<br/>\n<br/>\n<br/>\n****<br/>\n<blockquote><span title=\"ireply\"> &gt; While most 8 year olds are spending 8 hours  a day in a school with<br/>\n </span></blockquote>kids their<br/>\n<blockquote><span title=\"ireply\"> &gt; own age, my son is<br/>\n&gt; out in the real word everyday. He is with us while we are farming,<br/>\n </span></blockquote>paying bills,<br/>\n<blockquote><span title=\"ireply\"> &gt; shopping, talking to people of<br/>\n&gt; all ages and races. They do not do pretend life like in school. They<br/>\n </span></blockquote>are living<br/>\n<blockquote><span title=\"ireply\"> &gt; it. My son plays online with people<br/>\n&gt; all ages, he is a fully participant on life. I see many kids that know<br/>\n </span></blockquote>nothing<br/>\n<blockquote><span title=\"ireply\"> &gt; else than school life and weekends where they can get away from<br/>\n </span></blockquote>school.<br/>\n<blockquote><span title=\"ireply\"> &gt; Life is a joy for us. It is hard to explain  if you have never known<br/>\n </span></blockquote>anything<br/>\n<blockquote><span title=\"ireply\"> &gt; different.<br/>\n<br/>\n </span></blockquote>We&#39;re still new to this.  Our family dynamic is different now than it<br/>\nused to be.  There are all kinds of things to do and see and be a part<br/>\nof, of which I am completely ignorant, I&#39;m sure.<br/>\n****&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt;&lt;&lt;&lt;Although I do recognize this (my son has an autistic spectrum<br/>\n </span></blockquote>disorder -<br/>\n<blockquote><span title=\"ireply\"> &gt; things didn&#39;t work out the way we planned), &gt;&gt;&gt;&gt;&gt;<br/>\n&gt;<br/>\n&gt; Ouch! I feel for him if you feel disappointed he was not what you<br/>\n </span></blockquote>wanted him to<br/>\n<blockquote><span title=\"ireply\"> &gt; be. Maybe that is not what you meant.<br/>\n<br/>\n </span></blockquote>Not what I meant.  ;)<br/>\n    There&#39;s not one thing about any of my family that disappoints me or<br/>\nfails to measure up to some expectation.  I only meant that I recognize<br/>\nthat planning for the future may very well be modified unexpectedly.<br/>\n<br/>\n****<br/>\n<blockquote><span title=\"ireply\"> &gt; I have met unschooled teens at a Conference I went. I have many<br/>\n </span></blockquote>friends that<br/>\n<blockquote><span title=\"ireply\"> &gt; have unschooled<br/>\n&gt; teens or unschoolers that are now adults. I have unschooled teens who<br/>\n </span></blockquote>are my<br/>\n<blockquote><span title=\"ireply\"> &gt; friends and I<br/>\n&gt; keep in touch on Facebook.<br/>\n&gt; NONE of them  are people who sit in front of the TV only desiring to<br/>\n </span></blockquote>be<br/>\n<blockquote><span title=\"ireply\"> &gt; entertained.<br/>\n&gt;<br/>\n&gt; All of them are super interesting people who do amazing things and are<br/>\n </span></blockquote>super<br/>\n<blockquote><span title=\"ireply\"> &gt; creative.<br/>\n&gt;<br/>\n&gt; Brenna McBroom is in India on a trip with two other unschoolers, she<br/>\n </span></blockquote>is a super<br/>\n<blockquote><span title=\"ireply\"> &gt; talented<br/>\n&gt; potter and her pieces are amazing.<br/>\n&gt; Kirby Dodd love for video games landed him a job with Blizzard who is<br/>\n </span></blockquote>the<br/>\n<blockquote><span title=\"ireply\"> &gt; creator of the<br/>\n&gt; game World of Warcraft, he has been working there for years now.<br/>\n&gt; Cameron Lovejoy has done so many things from internship at organic<br/>\n </span></blockquote>farms to<br/>\n<blockquote><span title=\"ireply\"> &gt; organizing a wonderful conference<br/>\n&gt; geared towards olders unschoolers  and young adults. He also travels<br/>\n&gt; extensively./<br/>\n&gt;  The Sorooshiam girls are all in College and doing what they love and<br/>\n </span></blockquote>not just<br/>\n<blockquote><span title=\"ireply\"> &gt; getting a degree so they could have a job.<br/>\n&gt; There are many more I could name like the Traaseth kids ( I love those<br/>\n </span></blockquote>kids!)<br/>\n<blockquote><span title=\"ireply\"> &gt; and it would take a while.<br/>\n&gt; IF unchooled kids became what you fear your son may become if he has<br/>\n </span></blockquote>unlimited<br/>\n<blockquote><span title=\"ireply\"> &gt; TV but it is quite the contrary.<br/>\n&gt; They are smart, engaged, interesting, creative and driven people.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Alex Polikowsky<br/>\n<br/>\n </span></blockquote>&quot;doing what they love and not just getting a degree so they could have a<br/>\njob.&quot;  I was raised to get a degree to have a job.  I was raised to<br/>\nlearn to type in case I couldn&#39;t find a job I liked, I could still be a<br/>\nsecretary.  Not fun, but practical and that&#39;s what puts bread on the<br/>\ntable, dontchaknow.   This is how I was raised.  This is what I&#39;m<br/>\nlearning is not universal.   Thank you for sharing with me an<br/>\nalternative.  I would far prefer my children to be smart, engaged,<br/>\ninteresting, creative and driven.  I&#39;m just now finding out that it can<br/>\nput bread on the table as well, but I do worry that I would be setting<br/>\nup my kids for failure by not driving them to Get A Degree To Get A Job.<br/>\nDoes that make sense?  I&#39;m not trying to argue with you, just explain<br/>\nwhere I&#39;m coming from in hopes of explaining why it takes so long for<br/>\nthis to sink in.  But I have to admit, it makes so much more sense and<br/>\nI&#39;m seeing it work in my kids in even such a short time since I&#39;ve<br/>\nstopped asking them to do schoolwork.  I can&#39;t help but to worry - I&#39;m<br/>\ntaking the advice of strangers here when it comes to my kids and I want<br/>\nto make sure I&#39;m not chasing rainbows, kwim? <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: question about tv","postDate":"1302138855","msgId":46454,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwNDQxMC4yMjEyNS5xbUB3ZWI4MTUwOC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGluaXY3MitmbDc2QGVHcm91cHMuY29tPg==","referencesHeader":"PGluaXY3MitmbDc2QGVHcm91cHMuY29tPg=="},"prevInTopic":46453,"nextInTopic":46455,"prevInTime":46453,"nextInTime":46455,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1757750428\">&lt;&lt;&lt;&lt;&lt;Old habits die hard and I&#39;ve been trained to prepare my kids for working<br/>\na job that won&#39;t embarrass their grandparents. Okay, that&#39;s a cynical<br/>\nanswer, but in addition to that, I know enough people who do little more<br/>\nthan work a non skilled job to pay the bills and watch tv, waiting for<br/>\n&quot;something&quot; to happen. Granted, their childhoods were spent in school<br/>\nawaiting the next assignment (as I think someone had mentioned to me in<br/>\nan earlier thread), but the image is a strong one and hard to shake<br/>\nwithout examples to the contrary.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nDo most people you know live like that??? I know very few like that and would <br/>\nhave to thin k hard<br/>\nto come up with names, probably because <br/>\nI surround myself with interesting people. I have had a very interesting life.<br/>\nI have done many different things in life and I live in another country <br/>\ndifferent than the one I was raised in.<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&gt; He is living in real life everyday. He knows about so many things kids<br/>\nin school<br/>\n<blockquote><span title=\"ireply\"> &gt; have no idea and I am not<br/>\n&gt; talking about schoolish stuff but real life stuff.<br/>\n </span></blockquote>I appreciate this perspective. I&#39;d love to hear more.&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nWhile most 8 year olds are spending 8 hours a day in a school with kids their <br/>\nown age, my son is<br/>\nout in the real word everyday. He is with us while we are farming, paying bills, <br/>\nshopping, talking to people of<br/>\nall ages and races. They do not do pretend life like in school. They are living <br/>\nit. My son plays online with people<br/>\nall ages, he is a fully participant on life. I see many kids that know nothing <br/>\nelse than school life and weekends where they can get away from school.<br/>\nLife is a joy for us. It is hard to explain if you have never known anything <br/>\ndifferent.<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;Although I do recognize this (my son has an autistic spectrum disorder -<br/>\nthings didn&#39;t work out the way we planned), &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nOuch! I feel for him if you feel disappointed he was not what you wanted him to <br/>\nbe. Maybe that is not what you meant.<br/>\n<br/>\n&lt;&lt;&lt;I also suspect that to play<br/>\nthe odds, preparing to be self-sufficient as an adult is not a useless<br/>\ngoal. I do recognize unschooling can accomplish that, I&#39;m curious as to<br/>\nhow something like unlimited tv might not hinder that because I just<br/>\nassume unlimited tv would create a habit of desiring to being<br/>\nentertained, watching others live life in creative and imaginative ways.&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nI have met unschooled teens at a Conference I went. I have many friends that <br/>\nhave unschooled<br/>\nteens or unschoolers that are now adults. I have unschooled teens who are my <br/>\nfriends and I<br/>\nkeep in touch on Facebook.<br/>\nNONE of them are people who sit in front of the TV only desiring to be <br/>\nentertained. <br/>\n<br/>\nAll of them are super interesting people who do amazing things and are super <br/>\ncreative.<br/>\n<br/>\nBrenna McBroom is in India on a trip with two other unschoolers, she is a super <br/>\ntalented<br/>\npotter and her pieces are amazing.<br/>\nKirby Dodd love for video games landed him a job with Blizzard who is the <br/>\ncreator of the<br/>\ngame World of Warcraft, he has been working there for years now.<br/>\nCameron Lovejoy has done so many things from internship at organic farms to <br/>\norganizing a wonderful conference<br/>\ngeared towards olders unschoolers and young adults. He also travels <br/>\nextensively./<br/>\nThe Sorooshiam girls are all in College and doing what they love and not just <br/>\ngetting a degree so they could have a job.<br/>\nThere are many more I could name like the Traaseth kids ( I love those kids!) <br/>\nand it would take a while.<br/>\nIF unchooled kids became what you fear your son may become if he has unlimited <br/>\nTV but it is quite the contrary.<br/>\nThey are smart, engaged, interesting, creative and driven people.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: question about tv","postDate":"1302137307","msgId":46453,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNEQUY4MjRELTE1N0UtNDFDOS1BNzdCLTE0ODU3QjQzN0M3NEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGluaWhkZCtiNnViQGVHcm91cHMuY29tPg==","referencesHeader":"PGluaWhkZCtiNnViQGVHcm91cHMuY29tPg=="},"prevInTopic":46452,"nextInTopic":46454,"prevInTime":46452,"nextInTime":46454,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"... This is fairly mainstream advice which is why it s a good idea to read for a while to get a feel for the list. What the above says is the kids are choosing","messageBody":"<div id=\"ygrps-yiv-1507587650\">On Apr 6, 2011, at 4:11 PM, Adrian wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  If you&#39;re concerned that your kids are spending too much time in  <br/>\n&gt; front of the TV, I see nothing wrong with encouraging them to find  <br/>\n&gt; something else to do<br/>\n<br/>\n </span></blockquote>This is fairly mainstream advice which is why it&#39;s a good idea to read  <br/>\nfor a while to get a feel for the list.<br/>\n<br/>\nWhat the above says is the kids are choosing wrong and they won&#39;t  <br/>\nchoose better unless mom or dad encourages them. That&#39;s a rather dim  <br/>\n(and unfortunately pervasively conventional) view of kids.<br/>\n<br/>\nIt&#39;s better for relationships, better for unschooling to assume kids  <br/>\nare choosing what&#39;s most interesting to them. If they&#39;re choosing TV  <br/>\n(or reading or building with Legos), then that&#39;s the most interesting  <br/>\nactivity available.<br/>\n<br/>\nIf a parent was concerned that their child was only choosing TV, I&#39;d  <br/>\nask the parent to not look at what the child was (or wasn&#39;t) doing but  <br/>\nwhat she or he was doing with and for the kids. Unschooling isn&#39;t  <br/>\nabout sitting back and letting the kids find their own way.  <br/>\nUnschooling is fully engaging with them, being their support system  <br/>\n*and* the one who keeps life swirling in interesting ways. Sandra Dodd  <br/>\nhas a great page on strewing:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strewing\">http://sandradodd.com/strewing</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  encouraging them to find something else to do, whether it&#39;s read a  <br/>\n&gt; book, go on a bike ride, start a craft project, load the dishwasher,  <br/>\n&gt; whatever.<br/>\n<br/>\n<br/>\n </span></blockquote>If my husband were watching a football game it would be mighty rude of  <br/>\nme to &quot;encourage&quot; him to read a book or load the dishwasher!<br/>\n<br/>\nIf an action might damage a relationship with an adult. then it&#39;s not  <br/>\na good idea to do to a child.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; f it gets to the point where they&#39;re spending most or all of the day  <br/>\n&gt; in front of the tube, I&#39;d have no problem rationing their viewing  <br/>\n&gt; time.<br/>\n<br/>\n </span></blockquote>Again, very conventional view of kids.<br/>\n<br/>\nWhere&#39;s the parents? How are mom and dad engaging the kids? What  <br/>\nactivities outside the house are they creating.<br/>\n<br/>\nIf the parents are keeping the kids lives swirling with activity and  <br/>\nother engaging opportunities that the *kids* enjoy, and still the kids  <br/>\nare drawn to the TV then there&#39;s something the kids are really getting  <br/>\ninto. And the parents can connect with the kids by being with them,  <br/>\nwatching, finding other things that connect to what they&#39;re watching.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I look at TV as a very addictive drug (and scientific studies tend  <br/>\n&gt; to bear this out, in terms of TV&#39;s physical effect on the brain)<br/>\n<br/>\n </span></blockquote>Really really old information that never had sound science behind it.<br/>\n<br/>\nThere&#39;s much better information here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/tv\">http://sandradodd.com/tv</a><br/>\n<br/>\nAnd some discussion of TV and other addictions:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tinyurl.com/yhuwxcx\">http://tinyurl.com/yhuwxcx</a><br/>\n<br/>\nAs well as Arguments against arguments against TV<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tinyurl.com/2kprgh\">http://tinyurl.com/2kprgh</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Bear in mind that I come from a point of view of having little use  <br/>\n&gt; for TV in the first place.<br/>\n<br/>\n<br/>\n </span></blockquote>Unschooling is about supporting kids&#39; interests. So even if a parent  <br/>\ndoesn&#39;t like tractor pulls, ATVs, Pokemon, World of Warcraft, horror  <br/>\nmovies, frilly pink princesses, snakes, Chinese food, or Simpsons and  <br/>\none or more of those are things her kids love, the parents are missing  <br/>\nhuge opportunities to engage with who the kids are and enter into  <br/>\ntheir worlds. Unschooling will flow smoothly when parents treat all  <br/>\ntheir kids&#39; interests with respect, not just the ones the parents  <br/>\nagree are worthy.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s just not worth the $90-a-month cable bill.<br/>\n<br/>\n<br/>\n </span></blockquote>For you. If there are programs on TV your kids love, then it&#39;s no  <br/>\ndifferent than your wife judging which of your hobbies she&#39;ll sneer at  <br/>\nwhen you spend money or time on.<br/>\n<br/>\nThough my husband doesn&#39;t write or draw he&#39;s always been supportive of  <br/>\nme taking classes and and spending all of November writing a novel for  <br/>\nNational Novel Writing Month. His support for something he doesn&#39;t  <br/>\nvalue for himself feels really great. And, in turn, that makes it even  <br/>\neasier to support his interest in competing in triathlons.<br/>\n<br/>\nSupporting someone means supporting who they are and all their  <br/>\ninterests, not just the parts you think are worth your while.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163621138,"authorName":"odiniella","from":"&quot;odiniella&quot; &lt;hgaimari@...&gt;","profile":"odiniella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: question about tv","postDate":"1302135912","msgId":46452,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGluajA5OStmYWNhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGluaXRhYitqbDBlQGVHcm91cHMuY29tPg=="},"prevInTopic":46451,"nextInTopic":46453,"prevInTime":46451,"nextInTime":46453,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"... assumption that independence in adulthood is something that s natural for people to want. You don t have to push the hatchlings out of the nest, when","messageBody":"<div id=\"ygrps-yiv-493990346\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;plaidpanties666&quot;<br/>\n&lt;plaidpanties666@...&gt; wrote:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Something that helps a lot with unschooling is starting from the<br/>\n </span></blockquote>assumption that &quot;independence in adulthood&quot; is something that&#39;s natural<br/>\nfor people to want. You don&#39;t have to push the hatchlings out of the<br/>\nnest, when they&#39;re ready, they&#39;ll go!<br/>\nWow how I have been conditioned.  I recall my children&#39;s first years as<br/>\nall about learning how to do things independently.  They wanted to do<br/>\nwhat they saw others doing without my help thankyouverymuch.  Only when<br/>\nthey had a problem they couldn&#39;t solve did I step in.  How funny to<br/>\nthink this would magically stop between year 4 and 5 of development<br/>\nbecause kindergarten has begun.  I&#39;m seeing glimpses of it in my 13 year<br/>\nold, just tiny little hints.  But then, she&#39;s had a pretty tough time<br/>\nuntil recently and so this is a big deal since she&#39;d really become<br/>\nwithdrawn and suppressed herself for many years - oh, since about<br/>\nkindergarten.  :( &gt;<br/>\n****<br/>\n<blockquote><span title=\"ireply\"> &gt; If creativity is an important idea to you, then think of watching tv<br/>\n </span></blockquote>as soaking up artwork and context. Tv is chock full of audio and visual<br/>\nart and like a lot of art the good stuff is full of context and<br/>\nreferences to other art. Tv is also a wonderful source of information in<br/>\nand of itself - not always accurate, but neither is any one source.<br/>\nInterest in a particular subject leads to cross-checking sources,<br/>\nanyway.<br/>\nThis I can see, too.  A couple weeks ago my daughter was watching yet<br/>\nanother cake decorating show.  My husband made mention of the fact that<br/>\nshe could do this as a career if she wanted, and started to talk about<br/>\nhow to offer her time at a bakery, get a summer job, etc.  I realized<br/>\nthis was just one medium of creativity - not a career path; something to<br/>\nexplore, something to inspire.  I&#39;ve since stopped myself when I think<br/>\nof the practical things she could do with an interest and just encourage<br/>\nmore exploration.  Already I&#39;m starting to see the fruits of this kind<br/>\nof New Way for us but admittedly, I have a lot of conditioning to wade<br/>\nthrough first.<br/>\nThis is really quite a new way of thinking for me, and I really<br/>\nappreciate the patience and advice!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163621138,"authorName":"odiniella","from":"&quot;odiniella&quot; &lt;hgaimari@...&gt;","profile":"odiniella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: question about tv","postDate":"1302135224","msgId":46451,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGluaXZqbytkNDczQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGluaXMwdStoZGM3QGVHcm91cHMuY29tPg=="},"prevInTopic":46450,"nextInTopic":46452,"prevInTime":46450,"nextInTime":46452,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"... can be a source of valuable information. It s knee-jerk criticism that you want to avoid. Jumping to this is stupid will get in your kids way. Noticing","messageBody":"<div id=\"ygrps-yiv-814370055\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;plaidpanties666&quot;<br/>\n&lt;plaidpanties666@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Depends on what you mean by &quot;judgements&quot;. Discernment matters! and it<br/>\n </span></blockquote>can be a source of valuable information. It&#39;s knee-jerk criticism that<br/>\nyou want to avoid. Jumping to &quot;this is stupid&quot; will get in your kids<br/>\nway. Noticing what your kids like about one program and using your<br/>\ncritical thinking skills to find something similar to allow them to<br/>\nexpand their worlds, however, is a fantastic use of judement.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; ---Meredith<br/>\n<br/>\n<br/>\n </span></blockquote>This I can get!  And thank you for the artist analogy.  That was<br/>\nperfect.<br/>\nHelen<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163621138,"authorName":"odiniella","from":"&quot;odiniella&quot; &lt;hgaimari@...&gt;","profile":"odiniella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: question about tv","postDate":"1302135091","msgId":46450,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGluaXZmaisyNzlqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGluaWhkZCtiNnViQGVHcm91cHMuY29tPg=="},"prevInTopic":46449,"nextInTopic":46451,"prevInTime":46449,"nextInTime":46451,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"... other interests and outlets. It sounds like you re doing a great job of that already. Hopefully their interests in these other areas will grow enough that","messageBody":"<div id=\"ygrps-yiv-1563977382\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Adrian&quot; &lt;amrush71@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  If you&#39;re worried about the boredom factor, just help your kids find<br/>\n </span></blockquote>other interests and outlets. It sounds like you&#39;re doing a great job of<br/>\nthat already. Hopefully their interests in these other areas will grow<br/>\nenough that their interest in zoning out in front of the TV will wane<br/>\nall on its own, as they find how much fun it is to engage their bodies<br/>\nand their active, imaginative minds in these other activities.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Good luck.<br/>\n&gt;<br/>\n&gt; Adrian<br/>\n<br/>\n<br/>\n </span></blockquote>Thanks, Adrian!   I think I&#39;m starting to get the hang of unschooling<br/>\nmore and more as I process these questions.  I think this, right here,<br/>\nis where my focus really ought to be.  If my kids are bored, tv isn&#39;t<br/>\nthe problem.  The kids not knowing what to do with their time is<br/>\nprobably the problem.  Sometimes the tv goes on purposefully and I&#39;m<br/>\nokay with that but when it goes on because they don&#39;t know what else to<br/>\ndo with themselves, I feel like it&#39;s not the best solution to their<br/>\nproblem.<br/>\nI didn&#39;t know this topic has been discussed three times so recently! <br/>\nOoops.<br/>\n<br/>\nHelen<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: question about tv","postDate":"1302135083","msgId":46449,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgyNDE5Mi43NTYxMy5xbUB3ZWI4MTUwNy5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGluaWhkZCtiNnViQGVHcm91cHMuY29tPg==","referencesHeader":"PGluaWhkZCtiNnViQGVHcm91cHMuY29tPg=="},"prevInTopic":46448,"nextInTopic":46450,"prevInTime":46448,"nextInTime":46450,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":" ... ","messageBody":"<div id=\"ygrps-yiv-851606098\"><br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n </span></blockquote>&lt;&lt;&lt;&lt;&lt;My thought is that even if I let my kids self-direct their education, it&#39;s <br/>\nstill my job as a parent to provide guidance. &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nUnschooling is a lot less about self-directed education and much more about <br/>\nbeing a partner to your children<br/>\n<br/>\n&lt;&lt;&lt;&lt;If you&#39;re concerned that your kids are spending too much time in front of <br/>\nthe TV, I see nothing wrong with encouraging them to find something else to do, <br/>\nwhether it&#39;s read a book, go on a bike ride, start a craft project, load the <br/>\ndishwasher, whatever.&gt;&gt;&gt;&gt;<br/>\n<br/>\nHow would you feel if your wife thought you were spending too much time on <br/>\nsomething you like to do and she encouraged you to find something she thought <br/>\nmore valuable ( to her)? Would you feel closer to her or criticized by your <br/>\nchoice of how to spend your time? That does not mean you don;t offer or has <br/>\nthings available for your child other than TV but that you respect if your <br/>\nchild chooses to watch TV. There may be a lot if TV watching for children that <br/>\njust came out of school or even grown ups after leaving a stressful environment <br/>\nor situation. IF your children has many things available and opportunities to <br/>\ndo many other things other than watch TV you should respect and value if they <br/>\nchoose TV.<br/>\nThat can be really hard for children that had their TV restricted or limited<br/>\nHere is a great link to read:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/t/economics\">http://sandradodd.com/t/economics</a><br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;If it gets to the point where they&#39;re spending most or all of the day in <br/>\nfront of the tube, I&#39;d have no problem rationing their viewing time. I look at <br/>\nTV as a very addictive drug (and scientific studies tend to bear this out, in <br/>\nterms of TV&#39;s physical effect on the brain), and sometimes even grown adults <br/>\nneed some amount of &quot;intervention&quot; to get them to hit the off button.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nThem how do you explain that uschooled children who have never been restricted <br/>\nor limited do not sit all day watching TV? They may have days they watch more, <br/>\nbut they are certainly not addicted.<br/>\nThe funny thing is that I have had several different unschooling families come <br/>\nto spend time with us and spend the night many times. I have DirectTV, Netflix <br/>\nand videos and I have never had kid sit in front of he TV glued to it and not <br/>\nwanting to even play so they could watch the 10 cartoon channels we have but I <br/>\nhave had kids come to visit that were restricted and those kids would sit in <br/>\nfront of the TV and not want to leave!! That was all they wanted to do. The <br/>\nunschooled kids wanted to play and explore while here.<br/>\n<br/>\n&lt;&lt;&lt;&lt;Bear in mind that I come from a point of view of having little use for TV in <br/>\nthe first place. My wife and I were talking about pulling the plug before we <br/>\neven had a child on the way. Our TV goes on maybe two or three times a month, <br/>\nand then it&#39;s almost always to watch a sporting event. It&#39;s just not worth the <br/>\n$90-a-month cable bill. So our decision is practical as much as it is ethical <br/>\n(and I won&#39;t drone on about that here). &gt;&gt;&gt;<br/>\n<br/>\n<br/>\nIf you do not like it don&#39;t watch it. Some people do not like reading books. I <br/>\nlove TV and I love books. TV can be absolutely wonderful and you can learn so <br/>\nmuch from it. Wonderful shows, news and even commercials can be awesome . Having <br/>\nhad a father who worked in Advertising, TV commercials have been a big source of <br/>\ngreat discussion in our family and I even now with my kids. We can appreciate <br/>\nall kinds o art!<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;But if you&#39;re a TV family, I really think it just boils down to common <br/>\nsense. Moderation in all things. You need a healthy balance. If you&#39;re worried <br/>\nabout the boredom factor, just help your kids find other interests and outlets. <br/>\nIt sounds like you&#39;re doing a great job of that already. Hopefully their <br/>\ninterests in these other areas will grow enough that their interest in zoning <br/>\nout in front of the TV will wane all on its own, as they find how much fun it is <br/>\nto engage their bodies and their active, imaginative minds in these other <br/>\nactivities. &gt;&gt;&gt;<br/>\n<br/>\nWould you tell your child he needed to read less because everything needs to be <br/>\ndone in moderation?<br/>\nTV watching can probably wane for Helen&#39;s kids unless she decides to limit them <br/>\nand then keep going back and forth between trusting them and rationing ( <br/>\nintervening) with their TV watching. I agree that given time and support they <br/>\nwill find things they love to do, after they have been able to deschool, but <br/>\nthey may love TV and still watch more than Helen is comfortable with. Maybe <br/>\ntheir career will have something to do with TV. Or maybe TV will lead them to <br/>\nsomething they love. Maybe one day while being bored they will be changing <br/>\nchannels and come upon something they decide to try out and that will lead them <br/>\nto a lot of joy and learning. Could be training dogs like Cezar Millan of the <br/>\nDog Whisperer, of baking cakes because of Cake Boss, or decorating on HGTV, so <br/>\nmany different things on TV nowadays it is amazing. Make their wolrd bigger, <br/>\nopen doors, do not shut them down because you do not like it or you do not value <br/>\nthem.<br/>\nYour children are not you.<br/>\n<br/>\nHere are some things to read ( well lots of)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/tv\">http://sandradodd.com/tv</a><br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163621138,"authorName":"odiniella","from":"&quot;odiniella&quot; &lt;hgaimari@...&gt;","profile":"odiniella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: question about tv","postDate":"1302134818","msgId":46448,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGluaXY3MitmbDc2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDcwNzI0OS45MDEwNi5xbUB3ZWI4MTUwOC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":46447,"nextInTopic":46449,"prevInTime":46447,"nextInTime":46449,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"... real life ... This is one happy consequence I m finding. ... and do ... Old habits die hard and I ve been trained to prepare my kids for working a job that","messageBody":"<div id=\"ygrps-yiv-184815293\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, BRIAN POLIKOWSKY<br/>\n&lt;polykowholsteins@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Unschoolers are not being prepared for real life, they are living in<br/>\n </span></blockquote>real life<br/>\n<blockquote><span title=\"ireply\"> &gt; *right now*!!<br/>\n </span></blockquote>This is one happy consequence I&#39;m finding.<br/>\n<br/>\n****<br/>\n<blockquote><span title=\"ireply\"> &gt; I really do not get all the fear that children are going to grow up<br/>\n </span></blockquote>and do<br/>\n<blockquote><span title=\"ireply\"> &gt; nothing but watch TV or that<br/>\n&gt; they could  just watch TV all day long.<br/>\n<br/>\n </span></blockquote>Old habits die hard and I&#39;ve been trained to prepare my kids for working<br/>\na job that won&#39;t embarrass their grandparents.  Okay, that&#39;s a cynical<br/>\nanswer, but in addition to that, I know enough people who do little more<br/>\nthan work a non skilled job to pay the bills and watch tv, waiting for<br/>\n&quot;something&quot; to happen.  Granted, their childhoods were spent in school<br/>\nawaiting the next assignment (as I think someone had mentioned to me in<br/>\nan earlier thread), but the image is a strong one and hard to shake<br/>\nwithout examples to the contrary.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He is living in real life everyday. He knows about so many things kids<br/>\n </span></blockquote>in school<br/>\n<blockquote><span title=\"ireply\"> &gt; have no idea and I am not<br/>\n&gt; talking about schoolish stuff but real life stuff.<br/>\n </span></blockquote>I appreciate this perspective.  I&#39;d love to hear more.<br/>\n<br/>\n<br/>\n****<br/>\n<blockquote><span title=\"ireply\"> &gt; I do not want to live a life preparing a child for  when he grows up.<br/>\n </span></blockquote>It may<br/>\n<blockquote><span title=\"ireply\"> &gt; never happen. The<br/>\n&gt; future is not guaranteed.<br/>\n<br/>\n </span></blockquote>Although I do recognize this (my son has an autistic spectrum disorder -<br/>\nthings didn&#39;t work out the way we planned), I also suspect that to play<br/>\nthe odds, preparing to be self-sufficient as an adult is not a useless<br/>\ngoal.  I do recognize unschooling can accomplish that, I&#39;m curious as to<br/>\nhow something like unlimited tv might not hinder that because I just<br/>\nassume unlimited tv would create a habit of desiring to being<br/>\nentertained, watching others live life in creative and imaginative ways.<br/>\n****What I can is create a rich environment where he<br/>\n<blockquote><span title=\"ireply\"> &gt; can live and learn in real life right now.<br/>\n&gt; I can be there, as a partner, to help him navigate the big world.  I<br/>\n </span></blockquote>can make<br/>\n<blockquote><span title=\"ireply\"> &gt; their world bigger and wider, or I<br/>\n&gt;<br/>\n&gt; can make it smaller. I rather make it bigger.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Alex Polikowsky<br/>\n<br/>\n </span></blockquote>I appreciate your taking the time to share this with me.  Thanks!<br/>\nHelen<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: question about tv","postDate":"1302134172","msgId":46447,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGluaXVpcytpNHRpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGluaWhkZCtiNnViQGVHcm91cHMuY29tPg=="},"prevInTopic":46446,"nextInTopic":46448,"prevInTime":46446,"nextInTime":46448,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"... **************** It helps to keep in mind that studies are done on school kids - and school kids have a number of very good reasons to drug themselves into","messageBody":"<div id=\"ygrps-yiv-1511704347\">&quot;Adrian&quot; &lt;amrush71@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I look at TV as a very addictive drug (and scientific studies tend to bear this out, in terms of TV&#39;s physical effect on the brain), and sometimes even grown adults need some amount of &quot;intervention&quot; to get them to hit the off button.<br/>\n </span></blockquote>****************<br/>\n<br/>\nIt helps to keep in mind that studies are done on school kids - and school kids have a number of very good reasons to drug themselves into numbness. If your kids don&#39;t have reasons to do that, they&#39;ll have a vastly different relationship with tv. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;My wife and I were talking about pulling the plug before we even had a child on the way.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nSince even by the loosest of definitions you aren&#39;t yet unschooling, its a Great time to give you the Most Important piece of advice for unschooling &quot;from the start&quot;: EASE IN. For your own sanity as much as anything else - you&#39;ll be the one doing all the deschooling (and you will be, even if you start now, things in your child&#39;s life will trigger thoughts and feelings from your past and you&#39;ll be deschooling again, I promise!) so set yourself up to say Yes with an open heart, and then stretch a little and say Yes some more. That&#39;s better for you And for your relationship with your child. <br/>\n<br/>\nSo in terms of tv (or sugar, or video games, the other two scaries), start where you&#39;re comfortable, but with the understanding that this is an issue where you&#39;ll eventually be doing some stretching. Read stories of happy, busy unschoolers who happen to use tv as one of the tools in their life to help you relax on the subject. Expect to be a helper, not a barricade. That&#39;s enough to get you started ;) The Good news about tv is that its changing so much right now that there are more choices all the time - its not a case of 700 channels or nothing, and there&#39;s no goal to get to 700 channels. <br/>\n<br/>\nEasing in is still good advice for people coming to unschooling with older kids, by the way. It&#39;s better to say yes more and build up trust than to dump all the rules at once and panic everyone in the family, yourself included - but it doesn&#39;t always work out that way! Some kids catch on to &quot;say yes more&quot; and want to know what&#39;s up. And some kids really do need to have their parents step away from the wall, as it were, and get right out and swim in the deep water so they have time to heal and grow a bit before they&#39;re grown. Older kids need you to stretch as much as you possibly can Right Now!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;their interest in zoning out in front of the TV <br/>\n<br/>\n </span></blockquote>Here&#39;s a place to start easing ;) Question that assumption. It helped me, when I was new to unschooling, to turn assumptions like that on their head and ask &quot;if that&#39;s Not what&#39;s happening, what Else could be going on?&quot; If they aren&#39;t zoning out....? Some people have very flat affect when they are concentrating. Others take in a lot of information in a more relaxed state - zoning &quot;in&quot; if you like. And there&#39;s a looooooot of information in the combination of audio and visual input from a show or movie, lots going on, which means there&#39;s often a lot of learning happening while someone is watching tv - whether watching a sitcom or nature show, cartoon, adventure, history, action flick..... &quot;tv&quot; isn&#39;t a monolithic thing, after all, its a conglomeration of resources especially in this time when &quot;tv&quot; can include movies and internet as well. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: question about tv","postDate":"1302132875","msgId":46446,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGluaXRhYitqbDBlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGluaWo1cStiM2hsQGVHcm91cHMuY29tPg=="},"prevInTopic":46445,"nextInTopic":46447,"prevInTime":46445,"nextInTime":46447,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"... ******************* Something that helps a lot with unschooling is starting from the assumption that independence in adulthood is something that s","messageBody":"<div id=\"ygrps-yiv-1941925040\">&quot;odiniella&quot; &lt;hgaimari@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;From the outside, the idea of watching tv all day<br/>\n&gt; doesn&#39;t correspond to the skills needed for independence in adulthood<br/>\n </span></blockquote>*******************<br/>\n<br/>\nSomething that helps a lot with unschooling is starting from the assumption that &quot;independence in adulthood&quot; is something that&#39;s natural for people to want. You don&#39;t have to push the hatchlings out of the nest, when they&#39;re ready, they&#39;ll go! It also helps to keep in mind that real life doesn&#39;t look like school. It&#39;s not a matter of slowly building skills and independence at a dull grind, its more like physical growth where things seem to happen in spurts. <br/>\n<br/>\nIf creativity is an important idea to you, then think of watching tv as soaking up artwork and context. Tv is chock full of audio and visual art and like a lot of art the good stuff is full of context and references to other art. Tv is also a wonderful source of information in and of itself - not always accurate, but neither is any one source. Interest in a particular subject leads to cross-checking sources, anyway. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;giving them the skills they&#39;ll<br/>\n&gt; need to do what interests them as adults.  How does unschooling (would<br/>\n&gt; this be considered radical unschooling?) prepare them to this end?<br/>\n<br/>\n </span></blockquote>By treating their interests as valid - vital even! right now. By valuing what they value so that they are empowered to pursue their interests right now. By helping them overcome hurdles between them and what they want so that they get used to the idea that limits and problems are hurdles to be overcome, not brick walls to batter against in vain. And because it&#39;s natural for kids to want more independence and more of a sense of personal competence, over time they&#39;ll take on more of the problem solving and use you more as one of many resources. But it likely won&#39;t be schoolish, steady progress! It will be jumps and rests, big growing periods and times of lying fallow, waiting for spring, with no way to know when spring will come until its here. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: question about tv","postDate":"1302131550","msgId":46445,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGluaXMwdStoZGM3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGluaWMyOCthcnNvQGVHcm91cHMuY29tPg=="},"prevInTopic":46444,"nextInTopic":46446,"prevInTime":46444,"nextInTime":46446,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"... I think  you re on the right track, but try not to polarize your thinking too much. It s not a matter of *either* being responsive *or* being creative -","messageBody":"<div id=\"ygrps-yiv-1542803401\">&quot;odiniella&quot; &lt;hgaimari@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;If I can think out loud for a moment more, what I<br/>\n&gt; understand from this idea is that as long as I attribute value to the<br/>\n&gt; choices my kids make, they&#39;ll be inspired to respond to MY thoughts<br/>\n&gt; about something rather than develop their own.  If they aren&#39;t really<br/>\n&gt; free to develop their own thoughts about things, I will have limited<br/>\n&gt; their creativity, which is the opposite of my goal.<br/>\n<br/>\n </span></blockquote> I think  you&#39;re on the right track, but try not to polarize your thinking too much. It&#39;s not a matter of *either* being responsive *or* being creative - creativity itself depends on inspiration. It can help to think about the way various arts are classically taught - people are encouraged to imitate other artists at first (selected artists, anyway) and use that as a basis for developing skills and ideas. Without directive teaching, though, people do that naturally - they discover &quot;influences&quot; from observing a range of art that has already been produced in the medium of interest. More sophisticated artists spend a lot of time taking in others&#39; works - in the same medium and others. Do you see what I mean? Your input is important, but it isn&#39;t the only thing that&#39;s important or even the most important thing (which can be a crushing blow to parental egos - are you feeling strong?). <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Unschooling, and in particular removing *my*<br/>\n&gt; judgments on things of value, ought to develop a far more creative kind<br/>\n&gt; of adult<br/>\n<br/>\n </span></blockquote>Depends on what you mean by &quot;judgements&quot;. Discernment matters! and it can be a source of valuable information. It&#39;s knee-jerk criticism that you want to avoid. Jumping to &quot;this is stupid&quot; will get in your kids way. Noticing what your kids like about one program and using your critical thinking skills to find something similar to allow them to expand their worlds, however, is a fantastic use of judement.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: question about tv","postDate":"1302124867","msgId":46443,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwNzI0OS45MDEwNi5xbUB3ZWI4MTUwOC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGluaWo1cStiM2hsQGVHcm91cHMuY29tPg==","referencesHeader":"PGluaWo1cStiM2hsQGVHcm91cHMuY29tPg=="},"prevInTopic":46442,"nextInTopic":46444,"prevInTime":46442,"nextInTime":46444,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"Unschoolers are notbeing prepared for real life, they areliving in real life *right now*!! My kids are young at 8 (will be 9 end of June) and just 5 and","messageBody":"<div id=\"ygrps-yiv-1200973343\">Unschoolers are notbeing prepared for real life, they areliving in real life <br/>\n*right now*!!<br/>\nMy kids are young at 8 (will be 9 end of June) and just 5 and I have been <br/>\nreading about unschooling for 8 years now.<br/>\nI have grown upwith unlimited TV and no restriction on what to watch and so <br/>\nhave my children.<br/>\nI really do not get all the fear thatchildren are going to grow up and do <br/>\nnothing but watch TV or that<br/>\nthey could just watch TV allday long. <br/>\nMy son is an avid gamer but even him takes breaks, plays with his sister for <br/>\nhours, was just helping his dad do chores because<br/>\nhe wanted to and plays lots of basketball onouralmost half court ( birthday <br/>\npresent last year).<br/>\nHe as a brand new PS3, a Wii, an X-Box 360, may games, membership to GameFly, <br/>\nhis own computer in his roomand his own<br/>\nTV. He also has many games he plays online.<br/>\nHe has his own YouTube account and his own video camera he makes movies.<br/>\nOne would think that he would spend the whole dayon those. Hedoes not.<br/>\nWe do many things, go many places, play a lot outside, he helps his dad <br/>\ndochores on our Dairy Farm.<br/>\nHe does Scouts and 4-H and he loves to talk to me about everything.<br/>\nHe is living in real life everyday. He knows about so many things kids in school <br/>\nhaveno idea and I amnot<br/>\ntalkingabout schoolish stuff but real life stuff.<br/>\n<br/>\nI do not want to live a life preparing a child for when he grows up.It may <br/>\nnever happen. The<br/>\nfuture is not guaranteed. What I can is create a rich environment where he <br/>\ncanlive and learn in real life right now.<br/>\nI can be there, as a partner, to help him navigate the big world. I can make <br/>\ntheir world bigger and wider, or I <br/>\n<br/>\ncan make it smaller. I rather make it bigger.<br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163621138,"authorName":"odiniella","from":"&quot;odiniella&quot; &lt;hgaimari@...&gt;","profile":"odiniella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: question about tv","postDate":"1302122490","msgId":46442,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGluaWo1cStiM2hsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBTkxrVGluT2RjZHpSNFZZaW9PPWtpenRNaEJDTjFiNFlRQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":46441,"nextInTopic":46443,"prevInTime":46441,"nextInTime":46443,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"... he ... If I may play Devil s Advocate here and sound like the nervous educator, I know this can be accomplished in a variety of ways, as evidenced by those","messageBody":"<div id=\"ygrps-yiv-991304222\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Tina Tarbutton<br/>\n&lt;tina.tarbutton@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t unschool so he develops my value system, I don&#39;t unschool so<br/>\n </span></blockquote>he<br/>\n<blockquote><span title=\"ireply\"> &gt; controls his own TV use.  I unschool to develop a wonderful, loving,<br/>\n&gt; positive relationship within my family.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Tina<br/>\n </span></blockquote>If I may play Devil&#39;s Advocate here and sound like the nervous educator,<br/>\nI know this can be accomplished in a variety of ways, as evidenced by<br/>\nthose who come from traditional family structures and maintain close<br/>\nties for a lifetime.  From the outside, the idea of watching tv all day<br/>\ndoesn&#39;t correspond to the skills needed for independence in adulthood,<br/>\nand I think that&#39;s the driving motivation to formalize education.  I&#39;m<br/>\nfinding the formal education plan has flaws inherent in the system but<br/>\nultimately I want my kids to feel their lives are not lacking in<br/>\nsatisfaction for them, and that means giving them the skills they&#39;ll<br/>\nneed to do what interests them as adults.  How does unschooling (would<br/>\nthis be considered radical unschooling?) prepare them to this end?<br/>\nHelen<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":350303082,"authorName":"Adrian","from":"&quot;Adrian&quot; &lt;amrush71@...&gt;","profile":"amrush71","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: question about tv","postDate":"1302120685","msgId":46444,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGluaWhkZCtiNnViQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGluaTRyYytnNnZhQGVHcm91cHMuY29tPg=="},"prevInTopic":46443,"nextInTopic":46445,"prevInTime":46443,"nextInTime":46445,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"... Hi, Helen. I m new to unschooling as well -- actually, just exploring it at this point as an alternative for our child-to-be. TV is obviously a hot topic","messageBody":"<div id=\"ygrps-yiv-231769084\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;odiniella&quot; &lt;hgaimari@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I&#39;m not a big tv watcher.  I&#39;ll watch with the family in the evenings,<br/>\n&gt; but most of the time I&#39;m doing something else while it&#39;s on.  I never<br/>\n&gt; turn it on during the day for myself.  My kids will put it on regularly.<br/>\n&gt; Not all day, but they do sit and watch more than I&#39;d like.  They&#39;ve both<br/>\n&gt; been to traditional brick and mortar school for years (through 5th grade<br/>\n&gt; and 3rd grade) and only recently have I stopped schooling at home (they<br/>\n&gt; are now 13 and 11).  No more curriculum to follow, no more assignments<br/>\n&gt; to keep up with.  I finally comprehend &quot;deschooling&quot; and we&#39;re only just<br/>\n&gt; started (maybe a month) and I figure this tv habit is part of my kids<br/>\n&gt; deschooling.  I&#39;m curious how I should respond to it.  Right now I<br/>\n&gt; don&#39;t, instead I&#39;m offering other things to do, through co-op classes<br/>\n&gt; and field trips.  We&#39;re going to the library often now.  They kids are<br/>\n&gt; finding instructions to make things on youtube so I try to accommodate<br/>\n&gt; their needs (getting a few things at Ace or keeping the table free for<br/>\n&gt; Nerf Gun modification).<br/>\n&gt; I see them sit and watch tv when their bored, not just to relax or wind<br/>\n&gt; down, and it&#39;s that boredom that I want to address.  Honestly, I&#39;m<br/>\n&gt; concerned that they&#39;ll develop the habit of couch potatoes because<br/>\n&gt; that&#39;s what makes sense to me, although I&#39;m learning that unschooling<br/>\n&gt; really works nothing like what I&#39;ve always thought makes sense.  I&#39;d<br/>\n&gt; love to hear thoughts of those who are more familiar and experienced.<br/>\n&gt; Helen<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Hi, Helen. I&#39;m new to unschooling as well -- actually, just exploring it at this point as an alternative for our child-to-be. TV is obviously a hot topic with unschoolers; I&#39;ve been on a few of these discussion boards for about two weeks now, and already this topic has come up three times.<br/>\n<br/>\nMy thought is that even if I let my kids self-direct their education, it&#39;s still my job as a parent to provide guidance. If you&#39;re concerned that your kids are spending too much time in front of the TV, I see nothing wrong with encouraging them to find something else to do, whether it&#39;s read a book, go on a bike ride, start a craft project, load the dishwasher, whatever. If it gets to the point where they&#39;re spending most or all of the day in front of the tube, I&#39;d have no problem rationing their viewing time. I look at TV as a very addictive drug (and scientific studies tend to bear this out, in terms of TV&#39;s physical effect on the brain), and sometimes even grown adults need some amount of &quot;intervention&quot; to get them to hit the off button.<br/>\n<br/>\nBear in mind that I come from a point of view of having little use for TV in the first place. My wife and I were talking about pulling the plug before we even had a child on the way. Our TV goes on maybe two or three times a month, and then it&#39;s almost always to watch a sporting event. It&#39;s just not worth the $90-a-month cable bill. So our decision is practical as much as it is ethical (and I won&#39;t drone on about that here). <br/>\n<br/>\nBut if you&#39;re a TV family, I really think it just boils down to common sense. Moderation in all things. You need a healthy balance. If you&#39;re worried about the boredom factor, just help your kids find other interests and outlets. It sounds like you&#39;re doing a great job of that already. Hopefully their interests in these other areas will grow enough that their interest in zoning out in front of the TV will wane all on its own, as they find how much fun it is to engage their bodies and their active, imaginative minds in these other activities. <br/>\n<br/>\nGood luck.<br/>\n<br/>\nAdrian</div>","specialLinks":[]},{"userId":196677035,"authorName":"Tina Tarbutton","from":"Tina Tarbutton &lt;tina.tarbutton@...&gt;","profile":"dravensmomhome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: question about tv","postDate":"1302118093","msgId":46441,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBTkxrVGluT2RjZHpSNFZZaW9PPWtpenRNaEJDTjFiNFlRQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGluaWMyOCthcnNvQGVHcm91cHMuY29tPg==","referencesHeader":"PEJBTkxrVGluZzJiTUNQVmZlZ1BVdzZBbzFhb0pFODc4NDlRQG1haWwuZ21haWwuY29tPgk8aW5pYzI4K2Fyc29AZUdyb3Vwcy5jb20+"},"prevInTopic":46440,"nextInTopic":46442,"prevInTime":46440,"nextInTime":46442,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"... Moderation is very much subjective.  I m on the computer at least 10 minutes out of every waking hour, and frequently spend 2-3 hours at a time in front of","messageBody":"<div id=\"ygrps-yiv-1988902379\">On Wed, Apr 6, 2011 at 2:40 PM, odiniella &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hgaimari@...\">hgaimari@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; . Unschooling, and in particular removing *my*<br/>\n&gt; judgments on things of value, ought to develop a far more creative kind<br/>\n&gt; of adult than the couch potato I fear, because they won&#39;t be reacting to<br/>\n&gt; tv (or anything) as &quot;forbidden fruit&quot; to be hoarded when possible, but a<br/>\n&gt; tool to be used in moderation (keeping in mind, &quot;moderation&quot; is<br/>\n&gt; subjective).<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Moderation is very much subjective.  I&#39;m on the computer at least 10 minutes<br/>\nout of every waking hour, and frequently spend 2-3 hours at a time in front<br/>\nof it.  To some that&#39;s way too much, if I had a small child it<br/>\nwould certainly be way too much, for me it&#39;s the right amount of time.  My<br/>\npartner spends about 1 hour a day or less on the computer.  Draven spends<br/>\nlots of 5 minute spurts on the computer.  Which one is right?<br/>\n<br/>\n<br/>\n<br/>\nI watch maybe 2 hours of TV per week.  My partner watches 2-3 hours a day or<br/>\nmore, and Draven has the TV or video games on constantly.  Which one is<br/>\nright?<br/>\n<br/>\n<br/>\n<br/>\nI grew up with very little restriction on TV time, Parker had a moderate<br/>\namount of restriction, but also spent 3 years in another country without<br/>\nmuch access to TV.  My parents watch way more TV than I do.  I don&#39;t think<br/>\nany of that really affected our adult decisions about TV.<br/>\n<br/>\n<br/>\n<br/>\nExpecting your children to develop the same values as you in regards to<br/>\nmedia is unreasonable no matter what form of lifestyle you lead (unschooling<br/>\nor traditional parenting) because individual people have different values.<br/>\n Children who are raised in strict households may adhere to their parents<br/>\nvalues until they move out, but then they develop their own values anyway.<br/>\n Unschooled children have the freedom to develop those values in a more<br/>\nnatural way over a longer period of time, without fighting against the<br/>\nimposed authority of their parents.<br/>\n<br/>\n<br/>\n<br/>\nAn example that is away from TV.  I&#39;m living with my parents right now.  We<br/>\nmoved in to help out with my stepfather, who had a stroke.  He is a very<br/>\nstrict, negative man and while he says very little about our lifestyle, and<br/>\nhas finally stopped trying to correct Draven for every little thing, it&#39;s<br/>\nstill hard living with him.  He and my mom are leaving this evening for an<br/>\nextended RV trip.  We probably won&#39;t change anything about the way we live<br/>\nonce they&#39;re gone, however we&#39;re looking forward to living without being<br/>\njudged for our every move.  We&#39;re also planning on being in our own place<br/>\nagain by the time that they get back, now that our help is no longer needed.<br/>\n Financially there is a huge benefit to living here, and my mother loves<br/>\nhaving us here, but living with my stepfather&#39;s constant, silent, negative,<br/>\njudgement looming over us is too much to bear.<br/>\n<br/>\n<br/>\n<br/>\nThe most important thing to me, with unschooling, is that Draven never feel<br/>\nlike that towards us.  I want him always to feel welcome in our home,<br/>\nwithout judgement, without negativity, no matter how old or young he is.<br/>\n That&#39;s not saying I don&#39;t want him to eventually have his own home and his<br/>\nown life separate from me, but I don&#39;t want him longing for that life the<br/>\ncloser he gets to 18.  I want our home to always be his home too, instead of<br/>\nsome place he feels stuck until he hits some magical age, or until he saves<br/>\nup enough money or until whatever.<br/>\n<br/>\n<br/>\n<br/>\nI don&#39;t unschool so he develops my value system, I don&#39;t unschool so he<br/>\ncontrols his own TV use.  I unschool to develop a wonderful, loving,<br/>\npositive relationship within my family.<br/>\n<br/>\n<br/>\n<br/>\nTina<br/>\n<br/>\n-- <br/>\nUnschooling Untitled &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschoolinguntitled.com/\">http://www.unschoolinguntitled.com/</a>&gt;  (<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschoolinguntitled.com\">http://www.unschoolinguntitled.com</a> )<br/>\n<br/>\nLiving an unschooled lifestyle, one experience at a time!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163621138,"authorName":"odiniella","from":"&quot;odiniella&quot; &lt;hgaimari@...&gt;","profile":"odiniella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: question about tv","postDate":"1302115208","msgId":46439,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGluaWMyOCthcnNvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBTkxrVGluZzJiTUNQVmZlZ1BVdzZBbzFhb0pFODc4NDlRQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":46438,"nextInTopic":46440,"prevInTime":46438,"nextInTime":46440,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"...  wrote: I ... try ... It does, thank you!  If I can think out loud for a moment more, what I understand from this idea is that as long","messageBody":"<div id=\"ygrps-yiv-1024383246\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Tina Tarbutton<br/>\n&lt;tina.tarbutton@...&gt; wrote:<br/>\nI<br/>\n<blockquote><span title=\"ireply\"> &gt; provide the TV and the cable, he chooses how to use it and when.  If I<br/>\n </span></blockquote>try<br/>\n<blockquote><span title=\"ireply\"> &gt; to direct his use of the things I provide he won&#39;t have the chance to<br/>\n&gt; develop his own relationship with those things.  TV included.<br/>\n&gt;<br/>\n&gt; Hope that helps.<br/>\n&gt;<br/>\n&gt; Tina<br/>\n<br/>\n<br/>\n </span></blockquote>It does, thank you!  If I can think out loud for a moment more, what I<br/>\nunderstand from this idea is that as long as I attribute value to the<br/>\nchoices my kids make, they&#39;ll be inspired to respond to MY thoughts<br/>\nabout something rather than develop their own.  If they aren&#39;t really<br/>\nfree to develop their own thoughts about things, I will have limited<br/>\ntheir creativity, which is the opposite of my goal.  In reality, I want<br/>\nthem to have the same general value system, but not necessarily defined<br/>\nby the same things.  &quot;Creativity&quot; may look different to my son because<br/>\nhe thinks differently than I do, but as long as he does pick up on the<br/>\nvalues of respect and consideration and compassion, and things like<br/>\nthis, *how* he goes about it can be up to him, free from my own<br/>\ninfluence (well, as much as possible).<br/>\nI&#39;m trying not to catastrophize the worst-case-scenario of developing<br/>\ncouch potatoes here.  Unschooling, and in particular removing *my*<br/>\njudgments on things of value, ought to develop a far more creative kind<br/>\nof adult than the couch potato I fear, because they won&#39;t be reacting to<br/>\ntv (or anything) as &quot;forbidden fruit&quot; to be hoarded when possible, but a<br/>\ntool to be used in moderation (keeping in mind, &quot;moderation&quot; is<br/>\nsubjective).<br/>\nIs this close?<br/>\nHelen<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163621138,"authorName":"odiniella","from":"&quot;odiniella&quot; &lt;hgaimari@...&gt;","profile":"odiniella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: question about tv","postDate":"1302115201","msgId":46440,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGluaWMyMSs0cTdhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBTkxrVGluZzJiTUNQVmZlZ1BVdzZBbzFhb0pFODc4NDlRQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":46439,"nextInTopic":46441,"prevInTime":46439,"nextInTime":46441,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"...  wrote: I ... try ... It does, thank you!  If I can think out loud for a moment more, what I understand from this idea is that as long","messageBody":"<div id=\"ygrps-yiv-24322803\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Tina Tarbutton<br/>\n&lt;tina.tarbutton@...&gt; wrote:<br/>\nI<br/>\n<blockquote><span title=\"ireply\"> &gt; provide the TV and the cable, he chooses how to use it and when.  If I<br/>\n </span></blockquote>try<br/>\n<blockquote><span title=\"ireply\"> &gt; to direct his use of the things I provide he won&#39;t have the chance to<br/>\n&gt; develop his own relationship with those things.  TV included.<br/>\n&gt;<br/>\n&gt; Hope that helps.<br/>\n&gt;<br/>\n&gt; Tina<br/>\n<br/>\n<br/>\n </span></blockquote>It does, thank you!  If I can think out loud for a moment more, what I<br/>\nunderstand from this idea is that as long as I attribute value to the<br/>\nchoices my kids make, they&#39;ll be inspired to respond to MY thoughts<br/>\nabout something rather than develop their own.  If they aren&#39;t really<br/>\nfree to develop their own thoughts about things, I will have limited<br/>\ntheir creativity, which is the opposite of my goal.  In reality, I want<br/>\nthem to have the same general value system, but not necessarily defined<br/>\nby the same things.  &quot;Creativity&quot; may look different to my son because<br/>\nhe thinks differently than I do, but as long as he does pick up on the<br/>\nvalues of respect and consideration and compassion, and things like<br/>\nthis, *how* he goes about it can be up to him, free from my own<br/>\ninfluence (well, as much as possible).<br/>\nI&#39;m trying not to catastrophize the worst-case-scenario of developing<br/>\ncouch potatoes here.  Unschooling, and in particular removing *my*<br/>\njudgments on things of value, ought to develop a far more creative kind<br/>\nof adult than the couch potato I fear, because they won&#39;t be reacting to<br/>\ntv (or anything) as &quot;forbidden fruit&quot; to be hoarded when possible, but a<br/>\ntool to be used in moderation (keeping in mind, &quot;moderation&quot; is<br/>\nsubjective).<br/>\nIs this close?<br/>\nHelen<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":196677035,"authorName":"Tina Tarbutton","from":"Tina Tarbutton &lt;tina.tarbutton@...&gt;","profile":"dravensmomhome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] question about tv","postDate":"1302111248","msgId":46438,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBTkxrVGluZzJiTUNQVmZlZ1BVdzZBbzFhb0pFODc4NDlRQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGluaTRyYytnNnZhQGVHcm91cHMuY29tPg==","referencesHeader":"PGluaTRyYytnNnZhQGVHcm91cHMuY29tPg=="},"prevInTopic":46437,"nextInTopic":46439,"prevInTime":46437,"nextInTime":46439,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"Draven has some form of electronics playing nearly 24/7.  He s either playing on Xbox live, or watching YouTube videos about any number of things or watching","messageBody":"<div id=\"ygrps-yiv-292669831\">Draven has some form of electronics playing nearly 24/7.  He&#39;s either<br/>\nplaying on Xbox live, or watching YouTube videos about any number of things<br/>\nor watching TV while playing with something else.  Sometimes more than one<br/>\nof those things are happening at the same time (he&#39;s often watching YouTube<br/>\nwhile watching TV).  He also falls asleep while watching TV and only<br/>\nsometimes remembers to set the sleep timer.  Since he goes to bed long after<br/>\nme, I typically turn it off when I wake up if he seems to be sleeping<br/>\nsoundly (otherwise the silence wakes him up).<br/>\n<br/>\nThis developed over time though, we&#39;re about two years into unschooling at<br/>\nthis point, maybe less.  At first when we lifted TV restriction there was<br/>\nlots of what I thought was boredom TV watching, but really it was him trying<br/>\nto get in as much as he could before I replaced the restrictions.  There<br/>\nwere many hours of very passive &quot;couch potato&quot; type behavior.  Now that he&#39;s<br/>\npretty comfortable with the idea that I won&#39;t restrict it anymore, he&#39;s more<br/>\ncomfortable using it as background noise, or as something to get ideas from<br/>\nto further his imaginative play.  When TV is playing he&#39;s normally standing<br/>\nup in front of his bed setting up some huge battle scene with halo figures.<br/>\n<br/>\nIf I would have constantly tried to redirect his attention away from that<br/>\npassive watching, I think he would have gotten the impression that I was<br/>\nstill judging his TV time and TV use, and he wouldn&#39;t have had the<br/>\nopportunity to develop his own relationship with that particular medium.<br/>\n<br/>\nIf your kids were instead sitting on the couch passively reading when they<br/>\nwere bored, would you have the same reaction?  Treat TV the same way you<br/>\ntreat anything else, it&#39;s just one of many options that they have in the<br/>\nday, provide an exciting environment for them to choose from and then don&#39;t<br/>\njudge their choices.<br/>\n<br/>\nYesterday I found some cork board and magnetic dry erase board squares on<br/>\nclearance at Walmart.  I also found some neat looking notebooks and pencils,<br/>\nalso on clearance.  We put up the boards in his room and played with the<br/>\nmagnets and push pins for awhile.  When I went to bed he was playing with<br/>\naction figures and watching TV.  This morning when I checked on him he had<br/>\nmany drawings and things he&#39;d written up on the cork boards and some designs<br/>\non the dry erase boards.  I&#39;m pretty sure these things happened with the TV<br/>\non in the background (it was still on this morning).  I provided something I<br/>\nthought he&#39;d be interested in, and helped him hang it up, but then I left<br/>\nit, he chose how to use it and when.  I feel the same way about TV, I<br/>\nprovide the TV and the cable, he chooses how to use it and when.  If I try<br/>\nto direct his use of the things I provide he won&#39;t have the chance to<br/>\ndevelop his own relationship with those things.  TV included.<br/>\n<br/>\nHope that helps.<br/>\n<br/>\nTina<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Apr 6, 2011 at 12:37 PM, odiniella &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hgaimari@...\">hgaimari@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I&#39;m not a big tv watcher. I&#39;ll watch with the family in the evenings,<br/>\n&gt; but most of the time I&#39;m doing something else while it&#39;s on. I never<br/>\n&gt; turn it on during the day for myself. My kids will put it on regularly.<br/>\n&gt; Not all day, but they do sit and watch more than I&#39;d like. They&#39;ve both<br/>\n&gt; been to traditional brick and mortar school for years (through 5th grade<br/>\n&gt; and 3rd grade) and only recently have I stopped schooling at home (they<br/>\n&gt; are now 13 and 11). No more curriculum to follow, no more assignments<br/>\n&gt; to keep up with. I finally comprehend &quot;deschooling&quot; and we&#39;re only just<br/>\n&gt; started (maybe a month) and I figure this tv habit is part of my kids<br/>\n&gt; deschooling. I&#39;m curious how I should respond to it. Right now I<br/>\n&gt; don&#39;t, instead I&#39;m offering other things to do, through co-op classes<br/>\n&gt; and field trips. We&#39;re going to the library often now. They kids are<br/>\n&gt; finding instructions to make things on youtube so I try to accommodate<br/>\n&gt; their needs (getting a few things at Ace or keeping the table free for<br/>\n&gt; Nerf Gun modification).<br/>\n&gt; I see them sit and watch tv when their bored, not just to relax or wind<br/>\n&gt; down, and it&#39;s that boredom that I want to address. Honestly, I&#39;m<br/>\n&gt; concerned that they&#39;ll develop the habit of couch potatoes because<br/>\n&gt; that&#39;s what makes sense to me, although I&#39;m learning that unschooling<br/>\n&gt; really works nothing like what I&#39;ve always thought makes sense. I&#39;d<br/>\n&gt; love to hear thoughts of those who are more familiar and experienced.<br/>\n&gt; Helen<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nUnschooling Untitled &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschoolinguntitled.com\">http://www.unschoolinguntitled.com</a>&gt;  (<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschoolinguntitled.com\">http://www.unschoolinguntitled.com</a> )<br/>\nLiving an unschooled lifestyle, one experience at a time!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":163621138,"authorName":"odiniella","from":"&quot;odiniella&quot; &lt;hgaimari@...&gt;","profile":"odiniella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"question about tv","postDate":"1302107820","msgId":46437,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGluaTRyYytnNnZhQGVHcm91cHMuY29tPg=="},"prevInTopic":9281,"nextInTopic":46438,"prevInTime":46436,"nextInTime":46438,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":"I m not a big tv watcher.  I ll watch with the family in the evenings, but most of the time I m doing something else while it s on.  I never turn it on during","messageBody":"<div id=\"ygrps-yiv-289181083\">I&#39;m not a big tv watcher.  I&#39;ll watch with the family in the evenings,<br/>\nbut most of the time I&#39;m doing something else while it&#39;s on.  I never<br/>\nturn it on during the day for myself.  My kids will put it on regularly.<br/>\nNot all day, but they do sit and watch more than I&#39;d like.  They&#39;ve both<br/>\nbeen to traditional brick and mortar school for years (through 5th grade<br/>\nand 3rd grade) and only recently have I stopped schooling at home (they<br/>\nare now 13 and 11).  No more curriculum to follow, no more assignments<br/>\nto keep up with.  I finally comprehend &quot;deschooling&quot; and we&#39;re only just<br/>\nstarted (maybe a month) and I figure this tv habit is part of my kids<br/>\ndeschooling.  I&#39;m curious how I should respond to it.  Right now I<br/>\ndon&#39;t, instead I&#39;m offering other things to do, through co-op classes<br/>\nand field trips.  We&#39;re going to the library often now.  They kids are<br/>\nfinding instructions to make things on youtube so I try to accommodate<br/>\ntheir needs (getting a few things at Ace or keeping the table free for<br/>\nNerf Gun modification).<br/>\nI see them sit and watch tv when their bored, not just to relax or wind<br/>\ndown, and it&#39;s that boredom that I want to address.  Honestly, I&#39;m<br/>\nconcerned that they&#39;ll develop the habit of couch potatoes because<br/>\nthat&#39;s what makes sense to me, although I&#39;m learning that unschooling<br/>\nreally works nothing like what I&#39;ve always thought makes sense.  I&#39;d<br/>\nlove to hear thoughts of those who are more familiar and experienced.<br/>\nHelen<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"question about tv","postDate":"1137692523","msgId":9281,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRxb2oxYittcDFrQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":46437,"prevInTime":9280,"nextInTime":9282,"topicId":9281,"numMessagesInTopic":0,"msgSnippet":" but I see that TV is a big part of a lot of people s ... I was just re-reading the posts and had to laugh at this.:) I hope you don t mind me laughing at","messageBody":"<div id=\"ygrps-yiv-83806729\">&quot; but I see that TV is a big part of a lot of people&#39;s <br/>\n<blockquote><span title=\"ireply\"> &gt; lives. &quot;<br/>\n<br/>\n </span></blockquote>I was just re-reading the posts and had to laugh at this.:)<br/>\nI hope you don&#39;t mind me laughing at part of what you said..not<br/>\nlaughing at your words, laughing about the reality here, that&#39;s all.<br/>\n<br/>\nTwo of my free children, that have a HUGE tv in Sierra&#39;s room have<br/>\nspent this morning dressing up (a witch and batman), showing me<br/>\n&quot;tricks&quot; and now are outside doing something noisy. I can hear<br/>\nsomething getting hit (maybe a bucket) not sure.<br/>\nIn and out they go, showing me stuff every so often. Sierra just<br/>\nreported that all our bird feeders got knocked off the deck by high<br/>\nwinds.  They&#39;re getting shoes on now, to go rescue all of the bird<br/>\nfeeders.<br/>\nThe television hasn&#39;t been on yet today.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]}],"prevTopicId":46485,"nextTopicId":46486}}