{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":136871563,"authorName":"ENSEMBLE S-WAYNFORTH","from":"ENSEMBLE S-WAYNFORTH &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Harry Harlow was Re: [unschoolingbasics] Re: Feeling Unrespected","postDate":"1206289659","msgId":31209,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczMDY4My43MzEyMy5xbUB3ZWI4NjIwNi5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":31208,"nextInTime":31210,"topicId":31209,"numMessagesInTopic":0,"msgSnippet":"You can find him on Wikipedia pretty easily. http://en.wikipedia.org/wiki/Harry_Harlow : In a well-known series of experiments conducted between 1963 and 1968,","messageBody":"<div id=\"ygrps-yiv-1616875721\">You can find him on Wikipedia pretty easily. <a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Harry_Harlow\">http://en.wikipedia.org/wiki/Harry_Harlow</a> :<br/>\n<br/>\nIn a well-known series of experiments conducted between 1963 and<br/>\n1968, Harlow removed baby rhesus monkeys from their mothers, and<br/>\noffered them a choice between two surrogate &quot;mothers,&quot; one made of<br/>\nterrycloth, the other of wire.<br/>\nIn the first group, the terryclothmother provided no food, while the wire mother did, in the form of anattached baby bottle containing milk. In the second group, theterrycloth mother provided food; the wire mother did not. It was foundthat the young monkeys clung to the terrycloth mother whether itprovided them with food or not, and that the young monkeys chose thewire surrogate only when it provided food.<br/>\nWhenever a frightening stimulus was brought into the cage, the<br/>\nmonkeys ran to the cloth mother for protection and comfort, no matter<br/>\nwhich mother provided them with food. This response decreased as the<br/>\nmonkeys grew older.<br/>\nWhen the monkeys were placed in an unfamiliar room with their cloth<br/>\nsurrogates, they clung to it until they felt secure enough to explore.<br/>\nOnce they began to explore, they would occasionally return to the cloth<br/>\nmother for comfort. Monkeys placed in an unfamiliar room without their<br/>\ncloth mothers acted very differently. They would freeze in fear and<br/>\ncry, crouch down, or suck their thumbs. Some of the monkeys would even<br/>\nrun from object to object, apparently searching for the cloth mother as<br/>\nthey cried and screamed. Monkeys placed in this situation with their<br/>\nwire mothers exhibited the same behavior as the monkeys with no mother.<br/>\nOnce the monkeys reached an age where they could eat solid foods,<br/>\nthey were separated from their cloth mothers for three days. When they<br/>\nwere reunited with their mothers they clung to them and did not venture<br/>\noff to explore as they had in previous situations. Harlow claimed from<br/>\nthis that the need for contact comfort was stronger than the need to<br/>\nexplore.<br/>\nThe study found that monkeys who were raised with either a wiremother or a cloth mother gained weight at the same rate. However, themonkeys that had only a wire mother had trouble digesting the milk andsuffered from diarrhea more frequently. Harlow interpreted this to mean that not having contact comfort was psychologically stressful to the monkeys.<br/>\nCritics of Harlow&#39;s claims have observed that clinging is a matterof survival in young rhesus monkeys, but not in humans, and havesuggested that his conclusions, when applied to humans, overestimatedthe importance of contact comfort and underestimated the importance ofnursing. [3]<br/>\nHarlow first reported the results of these experiments in &quot;Thenature of love,&quot; the title of his address to the sixty-sixth AnnualConvention of the American Psychological Association, Washington, D.C., August 31, 1958. The studies were motivated by John Bowlby&#39;s World Health Organization-sponsoredstudy and report, &quot;Maternal Care and Mental Health&quot; in 1950, in whichBowlby reviewed previous surveys of the effects of institutionalizationon child development such as René Spitz&#39;s[4] and conducted his own surveys on children raised in a variety of settings. In 1953, his colleague, James Robertson, produced a short and controversial documentary film titled A Two-Year-Old Goes to Hospitaldemonstrating the almost immediate effects of maternal separation.Bowlby&#39;s report, coupled with Robertson&#39;s film, demonstrated theimportance of the primary caregiver in human and non-human primatedevelopment.<br/>\n<br/>\n------------<br/>\n<br/>\nI&#39;ve seen a few films of his work, of the macaque babies crying in the lab, it is just awful to watch. <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=fLrBrk9DXVk\">http://www.youtube.com/watch?v=fLrBrk9DXVk</a> is a small video of Harry Harlow explaining his work for a television audience. There is an interesting review of his life and work here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.boston.com/news/globe/ideas/articles/2004/03/21/monkey_love/?page=1\">http://www.boston.com/news/globe/ideas/articles/2004/03/21/monkey_love/?page=1</a> Oh, and <a rel=\"nofollow\" target=\"_blank\" href=\"http://psychclassics.yorku.ca/Harlow/love.htm\">http://psychclassics.yorku.ca/Harlow/love.htm</a> is Harlow&#39;s paper on Love. <br/>\n<br/>\n<br/>\nThere is much of value in his work, but his methods seem so horrific. <br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: Stacey &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:alabtu@...\">alabtu@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Sunday, 23 March, 2008 3:42:07 PM<br/>\nSubject: [unschoolingbasics] Re: Feeling Unrespected<br/>\n<br/>\nokay...i guess i&#39;m &#39;out of the loop&#39; here;)  who is: Harry Harlow ..i <br/>\nlooked at all the previous messages and couldn&#39;t find him;)<br/>\nstacey:)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/fLrBrk9DXVk?wmode=opaque","type":"VIDEO"}]}],"prevTopicId":31150,"nextTopicId":31210}}