{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":14,"messages":[{"userId":227835915,"authorName":"m_aduhene","from":"&quot;m_aduhene&quot; &lt;m_aduhene@...&gt;","profile":"m_aduhene","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and postnatal depression","postDate":"1244594930","msgId":40424,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgwbXZ0aSs1Z2NrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRBMUZFNDMwLjQwODAxMDRAY29tY2FzdC5uZXQ+"},"prevInTopic":40324,"nextInTopic":0,"prevInTime":40423,"nextInTime":40425,"topicId":40289,"numMessagesInTopic":0,"msgSnippet":"hi, only just caught this thread, but felt i ought to reply.  i had very severe pnd after my third child.  i was hospitalised for 6 weeks and thankfully","messageBody":"<div id=\"ygrps-yiv-323780126\">hi,<br/>\nonly just caught this thread, but felt i ought to reply.  i had very severe pnd after my third child.  i was hospitalised for 6 weeks and thankfully allowed to keep yden (the baby) with me.  it took me 6 weeks after she was born to realise there was a problem.  you have done amazingly well to cope with it for 6 months but as everyone else has suggested i think you should begin the road to healing yourself.  seek out all the help u can, housework, child minding, shoppers etc. don&#39;t feel ashamed.  i am a big &quot;coper&quot; and don&#39;t like asking for help at all.  this experience for me was very humbling.  no-one had ever looked after my children except me and i had to entrust them to other people (who btw were amazing) and daddy. it was tough but necessary.  after the 6 weeks we employed an aupair for a while, which i hated but again it was necessary.  3 years down the line i am fully recovered and look back at that time as a brief downer.  my children are no worse off from the time i had to spend away from them.  u will of course not have to go to hospital but what i am trying to say is that any time u take for u will only benefit them becos it will restore u.  the other important thing i found was to talk, talk and talk some more, to supportive, caring people.  i had a friend who i phoned and just cried to.  also to cry and go with the flow.  some days were the pits but i got through it by following the advice of live by the moment.<br/>\ni am so with u as u go through this time in your life and if u want to e-mail off-list i would be happy to chat.<br/>\ni am praying for u.<br/>\nblessings<br/>\nmichelle<br/>\npls reply to : <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:michelleaduhene@...\">michelleaduhene@...</a></div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Re: Unschooling and postnatal depression","postDate":"1243640380","msgId":40324,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkwNTI5MTYzOXM1NTc1YzU2NnllZWI2NmNhOGE5OGZmODNiQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGd2b3VzNyszc2d1QGVHcm91cHMuY29tPg==","referencesHeader":"PDVCNzk0QzlELTg1RDAtNEUyMi05NTg1LTE1RDc5NTlBRjk3M0BnbWFpbC5jb20+CSA8Z3ZvdXM3KzNzZ3VAZUdyb3Vwcy5jb20+"},"prevInTopic":40320,"nextInTopic":40424,"prevInTime":40323,"nextInTime":40325,"topicId":40289,"numMessagesInTopic":0,"msgSnippet":"... ***Great advice Amberlee. This is really imperative as well.  Find someone that can watch them for an hour so you can attend your needs, even if that is","messageBody":"<div id=\"ygrps-yiv-15879001\">On Fri, May 29, 2009 at 11:27 AM, amberlee_b &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:amberlee16@...\">amberlee16@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; take some time for just you (I know mostly impossible with little ones at<br/>\n&gt; home....).<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>***Great advice Amberlee. This is really imperative as well.  Find someone<br/>\nthat can watch them for an hour so you can attend your needs, even if that<br/>\nis showering or staring at the wall. My DH would much rather me hand him the<br/>\nkids as soon as he walks in the door than be a raving lunatic. Find a<br/>\nsolution. If something isn&#39;t working keep trying until you find something<br/>\nthat does. Even if you don&#39;t feel like you are worth it right now, you know<br/>\nyour kids are worth it. The sooner you get straight the sooner they start to<br/>\nheal.<br/>\n<br/>\nFaith<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":301158115,"authorName":"amberlee_b","from":"&quot;amberlee_b&quot; &lt;amberlee16@...&gt;","profile":"amberlee_b","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and postnatal depression","postDate":"1243610823","msgId":40320,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd2b3VzNyszc2d1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDVCNzk0QzlELTg1RDAtNEUyMi05NTg1LTE1RDc5NTlBRjk3M0BnbWFpbC5jb20+"},"prevInTopic":40314,"nextInTopic":40324,"prevInTime":40319,"nextInTime":40321,"topicId":40289,"numMessagesInTopic":0,"msgSnippet":"The one thing I learned is that many times it is hormonal and not just depression.  Your hormones and thryoid get tossed around pretty good during pregnancy","messageBody":"<div id=\"ygrps-yiv-697453326\">The one thing I learned is that many times it is hormonal and not just depression.  Your hormones and thryoid get tossed around pretty good during pregnancy add lack of sleep to that and you have a time bomb waiting to happen.  If your doc is a dope and won&#39;t help (and I don&#39;t mean &quot;here is birth control and an antidepressant--any other drugs I can get you on&quot;) and you maybe look for a really good chiropractor or natural doc who will.  My chiropractor was a godsend and has helped me get from feeling like a sobbing, irritable, angry and sometimes rage-filled wreak to finally feeling like I did before I had children.  It may take a while for your body to adjust.....sort of like losing weight, you didn&#39;t put it on in a day it will take twice as long to lose as it did to put on.  Same with your hormones!<br/>\n<br/>\nAnother thing you can do is research for yourself!  I love the internet.  Don&#39;t automatically assume that it is depression that you need prozack or zoloft for.  I am surprised the docs didn&#39;t want to put you on that right away.  Anyway, look up hormone imbalances, talk to a good chiropractor, get a massage, take some time for just you (I know mostly impossible with little ones at home....).  I agree you need to get help, but really look into natural alternatives too.  Somethings you just let go--housework is first.  <br/>\n<br/>\nMany times when your hormones are off your thyroid will be also--mine would violently switch back and forth between super low to super high and make me wonky.  It has gotten better with a supplement called Ovex by Standard Process....I am looking into one that is closer to what our bodies are like right now as well to see if it can do more for me.  <br/>\n<br/>\nHang in there, just be sure to find someone you can work with to help you out!</div>","specialLinks":[]},{"userId":209361242,"authorName":"JRossedd","from":"JRossedd &lt;jrossedd@...&gt;","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Unschooling and postnatal depression","postDate":"1243604016","msgId":40314,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBMUZFNDMwLjQwODAxMDRAY29tY2FzdC5uZXQ+"},"prevInTopic":40305,"nextInTopic":40320,"prevInTime":40313,"nextInTime":40315,"topicId":40289,"numMessagesInTopic":0,"msgSnippet":"I saw this in my Miami Herald email this morning and thought of several current discussions where it might help someone cope with her own challenges --","messageBody":"<div id=\"ygrps-yiv-2004043731\">I saw this in my Miami Herald email this morning and thought of several <br/>\ncurrent discussions where it might help someone cope with her own <br/>\nchallenges -- unschooling while running in-home day care, unschooling <br/>\nthe undiapered, even unschooling while stressed/depressed (with the <br/>\ncaveat that post-partum depression specifically, can&#39;t be laughed off or <br/>\n&quot;cured&quot; by positive thinking.)<br/>\n<br/>\n <br/>\nJJ<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.momsmiami.com/?a=profile&u=2&t=blog&blog_id=1892\">http://www.momsmiami.com/?a=profile&u=2&t=blog&blog_id=1892</a><br/>\n<br/>\nPsychiatrist Judith Orloff offers six tips for combating the stress, <br/>\nworry, fear and anxiety that come from being a supermom and caretaker.<br/>\n<br/>\n*LIMIT EMOTIONAL VAMPIRES*<br/>\n<br/>\n Emotional vampires are people who sap your energy and leave you feeling <br/>\nfatigued, agitated or craving comfort food. Emotional vampires come in <br/>\nall forms, from needy children and critical spouses, to unpleasant <br/>\ncoworkers and nagging parents. When you&#39;re around people who drain your <br/>\nenergy, practice saying no, politely excusing yourself, or communicating <br/>\nyour limits clearly and calmly.<br/>\n<br/>\n*STAY IN THE NOW*<br/>\n<br/>\n  When you feel yourself being overwhelmed by responsibilities, <br/>\ndeadlines and pressures,  don&#39;t catastrophize. Instead, keep your mind <br/>\nfocused on the present moment only. Don&#39;t let it wander to worst-case <br/>\nscenarios. Stay focused on the positive changes you can make and the <br/>\npractical steps you can take today.<br/>\n<br/>\n*LAUGH IT OFF*<br/>\n<br/>\n  Mothers are great at changing direction. They&#39;re used to making <br/>\nlast-minute changes due to a sick child, a snow day, or a babysitter who <br/>\ndoesn&#39;t show. Next time you&#39;re stressed out because things aren&#39;t going <br/>\nyour way, find something humorous about your current situation, and <br/>\nwrite an inner comedy sketch about it. Searching for humor in a <br/>\nsituation immediately counteracts stress.<br/>\n<br/>\n*EVALUATE THE ANXIETY*<br/>\n<br/>\n Thoughtfully consider if a real threat exists or if you&#39;re blowing <br/>\nthings out of proportion. You can ask questions such as, &quot;What&#39;s the <br/>\nworst thing that could happen?&#39;&#39; Or, &quot;Will anyone die, go hungry or be <br/>\nharmed?&#39;&#39; Go through this mental exercise to bring stressors back into <br/>\nperspective.<br/>\n<br/>\n*CHANGE YOUR STRESS CHEMISTRY*<br/>\n<br/>\n 5-HTP is a plant extract that converts into serotonin in the brain, <br/>\ngently reducing anxiety and improving sleep. Kava-kava, from the root of <br/>\na South Pacific plant, promotes relaxation, improves sleep, and relieves <br/>\nmuscle tension. Calcium/magnesium, minerals that are depleted by stress, <br/>\nare calming and promote rest. Vigorous aerobic exercise stimulates <br/>\nfeel-good endorphins that counteract stress.<br/>\n<br/>\n*EXPRESS GRATITUDE*<br/>\n<br/>\n One of the quickest ways to defuse stress is to take a breath and make <br/>\na mental list of five things for which you are grateful. Not only does <br/>\nthis activity distract you from obsessive worries, but cultivating <br/>\npositive thoughts has an immediate calming effect on your neurochemistry <br/>\nand will help you relax and unwind.<br/>\n<br/>\n/Judith Orloff/ &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.judithorloff.com\">http://www.judithorloff.com</a>&gt;/ is a board-certified <br/>\npsychiatrist and an assistant clinical professor of psychiatry at UCLA. <br/>\nHer new book is &quot;Emotional Freedom: Liberate Yourself from Negative <br/>\nEmotions and Transform Your Life&quot; (Harmony Books, 2009, $24.95).<br/>\n/<br/>\n<br/>\n/<br/>\n/<br/>\n<br/>\n/<br/>\n/</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Re: Unschooling and postnatal depression","postDate":"1243588872","msgId":40305,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0NTJDMUMwLTc4N0YtNDY3OS04MjY0LTc1ODI4NTU1NDFDMkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGd2bHJoZCtrcHR0QGVHcm91cHMuY29tPg==","referencesHeader":"PGd2bHJoZCtrcHR0QGVHcm91cHMuY29tPg=="},"prevInTopic":40300,"nextInTopic":40314,"prevInTime":40304,"nextInTime":40306,"topicId":40289,"numMessagesInTopic":0,"msgSnippet":"... I saw that site recommended by the March of Dimes but it isn t working any more. The front page looks okay, but the links only lead to sponsored links.","messageBody":"<div id=\"ygrps-yiv-873818731\">On May 28, 2009, at 7:11 AM, jeangarretto wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; www.depressionafterdelivery.com<br/>\n<br/>\n </span></blockquote>I saw that site recommended by the March of Dimes but it isn&#39;t  <br/>\nworking any more. The front page looks okay, but the links only lead  <br/>\nto sponsored links. There&#39;s no real information there.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and postnatal depression","postDate":"1243528081","msgId":40296,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NTlGMUEyQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":40295,"nextInTopic":40299,"prevInTime":40295,"nextInTime":40297,"topicId":40289,"numMessagesInTopic":0,"msgSnippet":"... kids. I ll just scream. That s also what we taught DS to do when he was frustrated when he was littler instead of lashing out verbally or physically. He","messageBody":"<div id=\"ygrps-yiv-1440849758\"><blockquote><span title=\"ireply\">&gt; If I really need to yell I yell. I just don&#39;t yell things *at* my\r<br/>\n </span></blockquote>kids. I&#39;ll just scream.\r<br/>\n\r<br/>\nThat&#39;s also what we taught DS to do when he was frustrated when he was\r<br/>\nlittler instead of lashing out verbally or physically. He was/is free to\r<br/>\nlet loose the most blood curdling screams/yells to just vent that pent\r<br/>\nup energy. Worked well - he&#39;d yell and stomp a bit, then only after\r<br/>\nreleasing the energy, could he actually explain what the problem was and\r<br/>\nwe could move on with helping work it out.\r<br/>\n\r<br/>\nDeb R\r<br/>\n\r<br/>\n\r<br/>\n**********************************************************************\r<br/>\nThis email and any files transmitted with it are confidential and\r<br/>\nintended solely for the use of the individual or entity to whom they\r<br/>\nare addressed. If you have received this email in error please notify\r<br/>\nthe system manager.\r<br/>\n\r<br/>\nThis footnote also confirms that this email message has been swept by\r<br/>\nMIMEsweeper for the presence of computer viruses.\r<br/>\n\r<br/>\nwww.mastercam.com\r<br/>\n**********************************************************************\r<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":122460111,"authorName":"Tammy Curry","from":"Tammy Curry &lt;mamabeart00@...&gt;","profile":"mamabeart00","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unschooling and postnatal depression","postDate":"1243521827","msgId":40295,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3NzkwNi43NDQ4Mi5xbUB3ZWI0NTMxNC5tYWlsLnNwMS55YWhvby5jb20+","inReplyToHeader":"PDVCNzk0QzlELTg1RDAtNEUyMi05NTg1LTE1RDc5NTlBRjk3M0BnbWFpbC5jb20+","referencesHeader":"PGd2a2VzbithbnZ1QGVHcm91cHMuY29tPiA8NUI3OTRDOUQtODVEMC00RTIyLTk1ODUtMTVENzk1OUFGOTczQGdtYWlsLmNvbT4="},"prevInTopic":40294,"nextInTopic":40296,"prevInTime":40294,"nextInTime":40296,"topicId":40289,"numMessagesInTopic":0,"msgSnippet":"As everyone else has said you will need to get some help ASAP. PPD still isn t taken seriously enough. But you can get through it. Like others on the board, I","messageBody":"<div id=\"ygrps-yiv-808085319\">As everyone else has said you will need to get some help ASAP. PPD still isn&#39;t taken seriously enough. But you can get through it. Like others on the board, I had it. Actually it was mild after my first child but much worse with my second, there were some other factors such as the death of both my mom and mother in law just after my son was born that made it much worse, they were my support system. My husband was wonderful in helping take over house work and making sure that I ate. He did a lot with our daughter and his daughter who was living with us at the time. I was still able to nurse my son but I did use therapy and medication. The first morning that I woke up and felt &quot;whole&quot; again was amazing. <br/>\n<br/>\nDefinitely look to your support system for help. Being able to call and tell someone how you are feeling and sometimes having someone to listen to you cry, rant, and rave makes it easier to get through the day. I believe someone has already listed some really great nutritional information, this is a big must as well. Snuggle with the kids and tell them that you love them but you just don&#39;t feel like yourself right now. Kids have this way of just being themselves and it can make you feel better. If you feel overwhelmed tell them that you are and that you need to take a break. If housework is getting to you maybe see if a local teen can come over help with dishes and laundry. Sometimes even just having those two cleaning issues done so you don&#39;t have to look at it makes you feel better, less like you are failing because you don&#39;t have the energy or the normal spark to get it done. It helps to avoid that part of the cycle of feeling overwhelmed. Make sure<br/>\n you let your husband know if you need more help from him even if it is just for something simple. Walking or exercise of some kind really does help as well. And it sounds silly because you probably feel tired all the time, but sleep, full regular sleep also helps tremdously.<br/>\n<br/>\n<br/>\n <br/>\nTammy Curry, Director of Chaos<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tammycurry.blogspot.com/\">http://tammycurry.blogspot.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://crazy-homeschool-adventures.blogspot.com/\">http://crazy-homeschool-adventures.blogspot.com/</a><br/>\n<br/>\n&quot;If a child is to keep alive his inborn sense of wonder, he needs the companionship of at least one adult who can share it, rediscovering with him the joy, excitement and mystery of the world we live in.&quot;<br/>\n<br/>\nRachel Carson<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":367169565,"authorName":"Melissa Gray","from":"Melissa Gray &lt;melissagr8@...&gt;","profile":"graymamacita","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unschooling and postnatal depression","postDate":"1243519244","msgId":40294,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVCNzk0QzlELTg1RDAtNEUyMi05NTg1LTE1RDc5NTlBRjk3M0BnbWFpbC5jb20+","inReplyToHeader":"PGd2a2VzbithbnZ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGd2a2VzbithbnZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":40292,"nextInTopic":40295,"prevInTime":40293,"nextInTime":40295,"topicId":40289,"numMessagesInTopic":0,"msgSnippet":"It is possible, of course, all things are possible! It is much harder though. I usually have ppd pretty hard. Part of it is the hormones, but with birthing","messageBody":"<div id=\"ygrps-yiv-1864530434\">It is possible, of course, all things are possible! It is much harder  <br/>\nthough.<br/>\n<br/>\nI usually have ppd pretty hard. Part of it is the hormones, but with  <br/>\nbirthing your fourth, part of it might be feeling overwhelmed. It&#39;s  <br/>\nhard to have four children who need you, yes? Plus a partner, plus  <br/>\nthe house, laundry, etc...it is very overwhelming, which will delay  <br/>\nhealing from the birth.<br/>\n<br/>\nThings that work for me: letting go of the housework/cooking/personal  <br/>\nexpectations, spending more time with kids as well as ensuring that  <br/>\n*I* am eating well (because it&#39;s easy to skip a good meal when you  <br/>\nfeel depressed or rushed), and spending half an hour each afternoon  <br/>\nwalking (after dh gets home, before dinner gets started). I&#39;ve also  <br/>\ngot a pretty good routine with supplements, omegas, vitamin B  <br/>\ncomplex, still taking prenatals, and iron too. Making sure that I get  <br/>\nenough sleep at night, even if it means setting up cereal the night  <br/>\nbefore so I can lounge in bed with a nursing baby and doze in the  <br/>\nmorning. I have a friend I can call any time during the day when I&#39;m  <br/>\nfeeling overwhelmed...do you have someone like that? Even dh will do  <br/>\nin a pinch ;-)<br/>\n<br/>\nIf you&#39;ve ensured that all that has happened, it&#39;s time to call in  <br/>\nprofessionals, and be sure to feel no shame. There is nothing wrong  <br/>\nin needing help, the wrong is in ignoring it and making yourself and  <br/>\nyour family suffer unnecessarily.<br/>\n<br/>\n<br/>\nMelissa<br/>\nMom to Joshua, Breanna, Emily, Rachel, Samuel, Daniel, Avari, and  <br/>\nbaby Nathan!<br/>\nWife to Zane<br/>\n<br/>\nblog me at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives.blogspot.com/\">http://startlinglives.blogspot.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives365.blogspot.com\">http://startlinglives365.blogspot.com</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On May 27, 2009, at 5:29 PM, yarnmama4 wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; This may be a daft question, but is it possible to unschool with  <br/>\n&gt; pnd? I&#39;ve been homeschooling now for about 3 1/2 years and moving  <br/>\n&gt; towards radical unschooling for the last 1 1/2 - 2 years. I gave  <br/>\n&gt; birth to my 4th child, a beautiful baby girl, nearly 6 months ago  <br/>\n&gt; and I&#39;m not coping, I&#39;m angry or crying a lot of the time, I&#39;m  <br/>\n&gt; short tempered with my boys, and I&#39;m really not dealing with  <br/>\n&gt; anything well at the moment. I would love some ideas on how to cope  <br/>\n&gt; and avoid this having too much of an effect on my wonderful boys  <br/>\n&gt; (12, 5 & 4)<br/>\n&gt;<br/>\n&gt; Thanks in advance<br/>\n&gt;<br/>\n&gt; Morag<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":231930081,"authorName":"DJ250","from":"&quot;DJ250&quot; &lt;dj250@...&gt;","profile":"wibberbie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unschooling and postnatal depression","postDate":"1243513449","msgId":40292,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEyRDAzMzRFM0VDMDRBQTlBMTBFRTZFNUFEMzhCN0ZDQFJvY2tldFNhdWNlMj4=","inReplyToHeader":"PGd2a2VzbithbnZ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGd2a2VzbithbnZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":40291,"nextInTopic":40294,"prevInTime":40291,"nextInTime":40293,"topicId":40289,"numMessagesInTopic":0,"msgSnippet":"I had PPD with my first.  Sadly, the only person to tell me to get immediate help was my mother--not my OB, not the pediatrician!!!  And I was crying in their","messageBody":"<div id=\"ygrps-yiv-1807898629\">I had PPD with my first.  Sadly, the only person to tell me to get immediate help was my mother--not my OB, not the pediatrician!!!  And I was crying in their offices!  Anyway, yes, do get help ASAP!  I did and it made a difference, truly!  Don&#39;t make any big changes right now with your parenting--you&#39;re not ready.  Have someone come help with the baby as much as you can (or with the other kids or all three).<br/>\n<br/>\nBest wishes,<br/>\n~Melissa, in MD :)<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: yarnmama4 <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Wednesday, May 27, 2009 6:29 PM<br/>\n  Subject: [unschoolingbasics] Unschooling and postnatal depression<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  This may be a daft question, but is it possible to unschool with pnd? I&#39;ve been homeschooling now for about 3 1/2 years and moving towards radical unschooling for the last 1 1/2 - 2 years. I gave birth to my 4th child, a beautiful baby girl, nearly 6 months ago and I&#39;m not coping, I&#39;m angry or crying a lot of the time, I&#39;m short tempered with my boys, and I&#39;m really not dealing with anything well at the moment. I would love some ideas on how to cope and avoid this having too much of an effect on my wonderful boys (12, 5 & 4)<br/>\n<br/>\n  Thanks in advance<br/>\n<br/>\n  Morag<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\n<br/>\n  No virus found in this incoming message.<br/>\n  Checked by AVG - www.avg.com <br/>\n  Version: 8.5.339 / Virus Database: 270.12.42/2137 - Release Date: 05/27/09 07:50:00<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":361102819,"authorName":"jeangarretto","from":"&quot;jeangarretto&quot; &lt;jeangarretto@...&gt;","profile":"jeangarretto","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and postnatal depression","postDate":"1243509101","msgId":40300,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd2bHJoZCtrcHR0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd2a2VzbithbnZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":40299,"nextInTopic":40305,"prevInTime":40299,"nextInTime":40301,"topicId":40289,"numMessagesInTopic":0,"msgSnippet":"... First, the fact that you can talk about it and know somethings not right is good. You definetly need to figure out how to get help. I ve been there. Talk","messageBody":"<div id=\"ygrps-yiv-1836691635\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;yarnmama4&quot; &lt;mumallboys@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; This may be a daft question, but is it possible to unschool with pnd?  I&#39;ve been homeschooling now for about 3 1/2 years and moving towards radical unschooling for the last 1 1/2 - 2 years.  I gave birth to my 4th child, a beautiful baby girl, nearly 6 months ago and I&#39;m not coping, I&#39;m angry or crying a lot of the time, I&#39;m short tempered with my boys, and I&#39;m really not dealing with anything well at the moment.  I would love some ideas on how to cope and avoid this having too much of an effect on my wonderful boys (12, 5 & 4)<br/>\n&gt; <br/>\n&gt; Thanks in advance<br/>\n&gt; <br/>\n&gt; Morag<br/>\n&gt;<br/>\n </span></blockquote>First, the fact that you can talk about it and know somethings not right is good. You definetly need to figure out how to get help. I&#39;ve been there. Talk to your OB/GYN or mid-wife, also here are some websites to check out. www.depressionafterdelivery.com  and www.postpartum.net. good luck and congrats on your little girl. jean(DOULA)</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unschooling and postnatal depression","postDate":"1243509033","msgId":40291,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERDQkZEMTExLTQyMzEtNEYxMy1BQTgzLUNBQ0QyMDE2QkI2QkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGd2a2VzbithbnZ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGd2a2VzbithbnZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":40290,"nextInTopic":40292,"prevInTime":40290,"nextInTime":40292,"topicId":40289,"numMessagesInTopic":0,"msgSnippet":"... It won t be optimal. Parenting, not just unschooling, needs parents who are fully engaged. Doctors should treat postpartum depression seriously. You","messageBody":"<div id=\"ygrps-yiv-956577567\">On May 27, 2009, at 6:29 PM, yarnmama4 wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; This may be a daft question, but is it possible to unschool with  <br/>\n&gt; pnd? I&#39;ve been homeschooling now for about 3 1/2 years and moving  <br/>\n&gt; towards radical unschooling for the last 1 1/2 - 2 years. I gave  <br/>\n&gt; birth to my 4th child, a beautiful baby girl, nearly 6 months ago  <br/>\n&gt; and I&#39;m not coping, I&#39;m angry or crying a lot of the time, I&#39;m  <br/>\n&gt; short tempered with my boys, and I&#39;m really not dealing with  <br/>\n&gt; anything well at the moment. I would love some ideas on how to cope  <br/>\n&gt; and avoid this having too much of an effect on my wonderful boys  <br/>\n&gt; (12, 5 & 4)<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>It won&#39;t be optimal. Parenting, not just unschooling, needs parents  <br/>\nwho are fully engaged.<br/>\n<br/>\nDoctors should treat postpartum depression seriously. You shouldn&#39;t  <br/>\nbe putting up with it for 6 mos. If the depression is getting in the  <br/>\nway of you seeking treatment, then do it for your kids and your husband.<br/>\n<br/>\nHere&#39;s some information from the La Leche League. They&#39;ll have  <br/>\nrecommendations that will support breastfeeding:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.llli.org/NB/NBdepression.html\">http://www.llli.org/NB/NBdepression.html</a><br/>\n<br/>\nIf you go here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.llli.org/WebUS.html\">http://www.llli.org/WebUS.html</a><br/>\nyou can find a La Leche League in your area to get some personal one  <br/>\non one advice.<br/>\n<br/>\nAccording to Wikipedia therapy and drugs are equally effective (and a  <br/>\ncombination isn&#39;t any more effective). Improvement will be seen in  <br/>\n1-4 weeks.<br/>\n<br/>\nI&#39;m sure some who have experience with PPD will come along, but to  <br/>\nget started, here&#39;s something on nutrition and postpartum depression  <br/>\nfrom Wikipedia:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Nutrition<br/>\n&gt;<br/>\n&gt; Pregnant, nursing and postpartum women are strongly encouraged to  <br/>\n&gt; seek the medical advice of their obstetrician or primary care  <br/>\n&gt; physician regarding optimal nutrition during pregnancy and after  <br/>\n&gt; birth.<br/>\n&gt;<br/>\n&gt; The following nutritional information may be beneficial in  <br/>\n&gt; achieving a well-balanced diet during and after pregnancy, but  <br/>\n&gt; studies are needed to confirm their role in preventing postpartum  <br/>\n&gt; depression.<br/>\n&gt;<br/>\n&gt; Omega-3 fatty acids: Some experts believe that postpartum  <br/>\n&gt; depression can be attributed to depletion of omega 3 fatty acids  <br/>\n&gt; from the mother&#39;s brain to support development of the brain of the  <br/>\n&gt; fetus or breast fed infant. This can be prevented by ensuring that  <br/>\n&gt; sufficient omega 3 fatty acids are provided in the mother&#39;s diet. <br/>\n&gt; [12] Good natural sources of omega 3 fatty acids include edible  <br/>\n&gt; linseed oil, certain fish, grass fed rather than grain fed meat,  <br/>\n&gt; and eggs from chickens fed on flax seed or other feed high in omega  <br/>\n&gt; 3 fats. Omega 3 can also be purchased in capsule form as a dietary  <br/>\n&gt; supplement.<br/>\n&gt;<br/>\n&gt; Protein can be found in a wide variety of foods. Some examples  <br/>\n&gt; follow: 3 ounces of most meat products contain 25 grams of protein,  <br/>\n&gt; 3 large eggs have approximately 19 grams, and 3 ounces of Swiss  <br/>\n&gt; cheese have about 15 grams.<br/>\n&gt;<br/>\n&gt; Hydration: One of the most important roles in any diet (especially  <br/>\n&gt; for pregnant and nursing mothers) is that of hydration. Physicians  <br/>\n&gt; may recommend that pregnant women consume ten 8-ounce glasses of  <br/>\n&gt; water every day. Mothers who are nursing are strongly urged to  <br/>\n&gt; drink a tall glass of water, milk or juice before sitting down to  <br/>\n&gt; breastfeed their child. Women should consult with their physicians  <br/>\n&gt; about caffeine and alcohol consumption postpartum.<br/>\n&gt;<br/>\n&gt; Vitamins: A pregnant and postpartum woman should speak with her  <br/>\n&gt; physician for information about, and a recommendation for a daily  <br/>\n&gt; prenatal/postnatal vitamin.<br/>\n&gt;<br/>\n&gt; B Vitamins Some limited research is indicating that the intake of B  <br/>\n&gt; vitamins, specifically Riboflavin can help reduce the chance of  <br/>\n&gt; post partum depression. [13] (Problem with B vitamins are water  <br/>\n&gt; soluble and must be replenished each day.<br/>\n&gt;<br/>\n&gt; Appetite: If a woman finds herself with a loss of appetite or other  <br/>\n&gt; eating disturbance, she should consult her physician. This may be a  <br/>\n&gt; sign of postpartum depression and therefore should be discussed  <br/>\n&gt; with a doctor.[2]<br/>\n<br/>\n </span></blockquote>Joyce</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unschooling and postnatal depression","postDate":"1243507853","msgId":40290,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg5RUNBNjU3LUZBRkYtNEU0NS1CQUYxLTdERDhGQzlCRTMyNUBnbWFpbC5jb20+","inReplyToHeader":"PGd2a2VzbithbnZ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGd2a2VzbithbnZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":40289,"nextInTopic":40291,"prevInTime":40289,"nextInTime":40291,"topicId":40289,"numMessagesInTopic":0,"msgSnippet":"I would really love to write a lot about this however all I have is the phone right now so please understand the brevity. Please seek help for PPD asap! If you","messageBody":"<div id=\"ygrps-yiv-1283765518\">I would really love to write a lot about this however all I have is  <br/>\nthe phone right now so please understand the brevity.<br/>\n<br/>\nPlease seek help for PPD asap! If you are nursing there is still much  <br/>\nyou can do, chiropractor, acupuncutre, homeopathy,nutrionalist,  <br/>\nnatropath etc. Don&#39;t wait to get better on your own. Seek out a  <br/>\nreputable counselor and start immediately. It is imparative that you  <br/>\nheal yourself and stop hurting your kids. If you can&#39;t afford this ask  <br/>\naround until you find a sliding scale place or don&#39;t be afraid to  <br/>\nbarter etc. Get really creative and make this a priority.<br/>\n<br/>\nWhat I do when I want to tell is walk away. If I really need to yell I  <br/>\nyell. I just don&#39;t yell things *at* my kids. I&#39;ll just scream. When I  <br/>\ncalm down I can apologize and explain if I need to. It might be a  <br/>\nlittle scary to just start screaming so you might want to talk to your  <br/>\nkids first so they have an understanding.<br/>\n<br/>\nI&#39;ll write more when I can. Most important, get help NOW.<br/>\n<br/>\nFaith<br/>\n<br/>\nSent from my iPhone<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On May 27, 2009, at 6:29 PM, &quot;yarnmama4&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mumallboys@...\">mumallboys@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; This may be a daft question, but is it possible to unschool with  <br/>\n&gt; pnd? I&#39;ve been homeschooling now for about 3 1/2 years and moving  <br/>\n&gt; towards radical unschooling for the last 1 1/2 - 2 years. I gave  <br/>\n&gt; birth to my 4th child, a beautiful baby girl, nearly 6 months ago  <br/>\n&gt; and I&#39;m not coping, I&#39;m angry or crying a lot of the time, I&#39;m short  <br/>\n&gt; tempered with my boys, and I&#39;m really not dealing with anything well  <br/>\n&gt; at the moment. I would love some ideas on how to cope and avoid this  <br/>\n&gt; having too much of an effect on my wonderful boys (12, 5 & 4)<br/>\n&gt;<br/>\n&gt; Thanks in advance<br/>\n&gt;<br/>\n&gt; Morag<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":334709176,"authorName":"susan burgess","from":"&quot;susan burgess&quot; &lt;susands@...&gt;","profile":"susandsb","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and postnatal depression","postDate":"1243478997","msgId":40299,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd2a3U0bCtrdjM5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd2a2VzbithbnZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":40296,"nextInTopic":40300,"prevInTime":40298,"nextInTime":40300,"topicId":40289,"numMessagesInTopic":0,"msgSnippet":"Morag, I don t post on here hardly at all, but I read them all and I couldn t not say something to you when I read your post. I am so sorry you are having to","messageBody":"<div id=\"ygrps-yiv-748254508\">Morag, <br/>\nI don&#39;t post on here hardly at all, but I read them all and I couldn&#39;t not say something to you when I read your post.<br/>\nI am so sorry you are having to go through that, it can be so agonizing. I am a Postpartum Doula and would be happy to chat with you off list, tell you some of the nutritional and other things I recommend to mamas dealing with PPD. <br/>\n<br/>\nPeace, <br/>\nSusan<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;yarnmama4&quot; &lt;mumallboys@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; This may be a daft question, but is it possible to unschool with pnd?  I&#39;ve been homeschooling now for about 3 1/2 years and moving towards radical unschooling for the last 1 1/2 - 2 years.  I gave birth to my 4th child, a beautiful baby girl, nearly 6 months ago and I&#39;m not coping, I&#39;m angry or crying a lot of the time, I&#39;m short tempered with my boys, and I&#39;m really not dealing with anything well at the moment.  I would love some ideas on how to cope and avoid this having too much of an effect on my wonderful boys (12, 5 & 4)<br/>\n&gt; <br/>\n&gt; Thanks in advance<br/>\n&gt; <br/>\n&gt; Morag<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":283787625,"authorName":"yarnmama4","from":"&quot;yarnmama4&quot; &lt;mumallboys@...&gt;","profile":"yarnmama4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Unschooling and postnatal depression","postDate":"1243463383","msgId":40289,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd2a2VzbithbnZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":40290,"prevInTime":40288,"nextInTime":40290,"topicId":40289,"numMessagesInTopic":0,"msgSnippet":"This may be a daft question, but is it possible to unschool with pnd?  I ve been homeschooling now for about 3 1/2 years and moving towards radical unschooling","messageBody":"<div id=\"ygrps-yiv-109970340\">This may be a daft question, but is it possible to unschool with pnd?  I&#39;ve been homeschooling now for about 3 1/2 years and moving towards radical unschooling for the last 1 1/2 - 2 years.  I gave birth to my 4th child, a beautiful baby girl, nearly 6 months ago and I&#39;m not coping, I&#39;m angry or crying a lot of the time, I&#39;m short tempered with my boys, and I&#39;m really not dealing with anything well at the moment.  I would love some ideas on how to cope and avoid this having too much of an effect on my wonderful boys (12, 5 & 4)<br/>\n<br/>\nThanks in advance<br/>\n<br/>\nMorag</div>","specialLinks":[]}],"prevTopicId":40394,"nextTopicId":40416}}