{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"balance WAS pifalls","postDate":"1231860072","msgId":37770,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQjQzQTlCM0ZFQTU4NS0xNTIwLThCREBNQkxLLU0yNC5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":37769,"nextInTime":37771,"topicId":37770,"numMessagesInTopic":0,"msgSnippet":"... at all (like if they sneak what they want outside the home or in their room), so obviously giving in gracefully to a child s plans or wishes by then makes","messageBody":"<div id=\"ygrps-yiv-1981941478\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;And by the time a kid is a teenager, he or she is essentially beyond most parental authority most of the time if the kid has any independence <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>at all (like if they sneak what they want outside the home or in their <br/>\nroom), so obviously giving in gracefully to a child&#39;s plans or wishes by <br/>\nthen makes a lot of sense no matter what kind of parenting style one had. <br/>\nWhat is hard is to decide what to do in the time in between birth and <br/>\nbecoming a teenager.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n**********************<br/>\n<br/>\nThe &quot;sneaking&quot; COMES with the lack of partnership between the parent and child. <br/>\n<br/>\nYou&#39;re setting yourself up to have a child who feels the need to sneak and lie when <br/>\nyou don&#39;t groom that relationship *EARLY*.<br/>\n<br/>\nIf a child *always* has &quot;independence&quot;---and I like Meredith&#39;s take<br/>\nbetter: when a child always has *autonomy*, the child won&#39;t feel the<br/>\nneed to sneak around or lie to you. When he knows that you accept that he has automony, <br/>\nhe doesn&#39;t have that *need* to &quot;prove&quot; that he&#39;s autonomous.<br/>\n<br/>\n&quot;Giving in gracefully&quot; to my child would NEVER enter my mind---either<br/>\nwhen he&#39;s a child or a teenager---OR an adult. That&#39;s not how our<br/>\nrelationship works. I want to work to help him get what he needs---his<br/>\nentire LIFE. It may be messy. It may be tough. But I want him as<br/>\ncomfortable in his own skin and in his own home as possible.<br/>\n<br/>\nIt&#39;s not all that hard to decide to treat a child as always doing his<br/>\nbest. It may be hard to DO that sometimes, but the decision to<br/>\nshouldn&#39;t be all that hard! &lt;g&gt;<br/>\n<br/>\n***************************<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;In my family, freedom for *everyone* is important (parents, child, and even<br/>\n </span></blockquote>the dogs and pet chickens) but I accept that sometimes these freedoms and<br/>\ndesires conflict (whether when the parents freely want to use their energy<br/>\nto have the child behave in a different way or vice versa&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n************************<br/>\n<br/>\nWhy would the goal be to get someone else to act a certain way? You can&#39;t control others.<br/>\n<br/>\nI put all my energy into getting myself to act a certain way. That&#39;s<br/>\nhard enough in itself! When I use all my energy on ME, I don&#39;t have<br/>\nanything left to spend changing others. &lt;g&gt;<br/>\n<br/>\nWhat I *do* have left, I tend to spend on the dog. &lt;g&gt; But he seems happy enough.<br/>\n<br/>\n*****************************<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;Perhaps seeking balance is just not unschooling in any way? Can&#39;t quality<br/>\n </span></blockquote>compassionate childhood education be a balance of the interests of the<br/>\nparent and the interests of the child? Can one even imagine a happy family<br/>\nwhere the interests of both parent and child are not respected to some<br/>\ndegree in some sort of balance?&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n********************************<br/>\n<br/>\nI think you&#39;re very short-sighted when looking at balance. You want ALL balance NOW.<br/>\n<br/>\nI see it as a life-long pursuit.<br/>\n<br/>\nA tiny infant cannot hold up *his* end of the teeter-totter. But over<br/>\ntime, with a LOT of help work on *my* part (I take the lion&#39;s share of<br/>\nthat effort), he can eventually balance on his own. <br/>\n<br/>\nA child whose parents do it all for him and who do not let him<br/>\nexperiment on his own may never get the &quot;feel&quot; of the teeter-totter. He<br/>\nmay always need help navigating the thing. <br/>\n<br/>\nA child whose parents do *nothing* to help him *may* figure it out---but at <br/>\nwhat cost? He may fall and break his neck.<br/>\n<br/>\nWhat a child NEEDS is a parent who will hold him until he feels the<br/>\nurge to play more independently. And venture out on his own s-l-o-w-l-y<br/>\n(or quickly! &lt;g&gt;) until he understands how the teeter-totter<br/>\nworks. To get the feel of the machine. A parent who could suggest a big<br/>\nrock or three in the pockets might change the dynamics. Or who will let<br/>\nthe child scooch up or back further to experiment. Maybe put a second<br/>\nchild on one side to counter the weight. A parent who won&#39;t balk at<br/>\nusing the machine in a way that the &quot;authorities&quot; insist you<br/>\ndon&#39;t---like standing at the fulcrum and balancing that way.<br/>\n<br/>\nThe lifelong balance *I* am writing about is the WHOLE life of the<br/>\nparent-child relationship. When I&#39;m old and feeble, I may want my<br/>\nchildren to take me to that same teeter-totter and let me balance. I&#39;ll<br/>\nprobably need help. Hopefully, they won&#39;t say, &quot;You&#39;re old enough to<br/>\nknow how to do that all by yourself!&quot; &lt;g&gt;<br/>\n<br/>\nYin-yang: I trust my children; they trust me. I respect my children;<br/>\nthey respect me. I&#39;m kind to my children; they&#39;re kind to me. I&#39;m<br/>\ngenerous to my children; they&#39;re generous with me. I&#39;m patient with my<br/>\nchildren; they&#39;re patient with me. I accept my children for Who They<br/>\nAre; they accept me for Who I Am.<br/>\n<br/>\nAs the older, more experienced partner, I choose to take the first steps. I could <br/>\ntry to force them; but that dosn&#39;t seem to work for *me*, so why would I expect <br/>\nmy children to buy it? Plus---on the *balance* end of it: if I force THEM (in any way),<br/>\nwhat would be their natural response? Balance-wise? To push back? &lt;g&gt;<br/>\n<br/>\nI honestly can&#39;t think of a better-balanced relationship. I just don&#39;t need all <br/>\nthe balance at once. I look at the WHOLE picture.<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":37752,"nextTopicId":37773}}