{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":220015843,"authorName":"Kristie Cochran","from":"&quot;Kristie Cochran&quot; &lt;kristiecochran@...&gt;","profile":"kristiecochran","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Checking in from vacation","postDate":"1150310284","msgId":14563,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2cGwyYytxbzQ4QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":14562,"nextInTime":14564,"topicId":14563,"numMessagesInTopic":0,"msgSnippet":"Hi all, Kristie the newbie here.  I m currently on vacation and just wanted to pop in and tell you that I m trying to spread the word about unschooling.  I was","messageBody":"<div id=\"ygrps-yiv-19431556\">Hi all,<br/>\n<br/>\nKristie the newbie here.  I&#39;m currently on vacation and just wanted to<br/>\npop in and tell you that I&#39;m trying to spread the word about<br/>\nunschooling.  I was so thankful for the posts last week about how to<br/>\ntell people about unschooling.  We&#39;re staying at a beach house with 4<br/>\nof  my husbands sisters and their families.  One sister has 5 boys and<br/>\nall are special needs kids (I know, all kids are special and have<br/>\ntheir own needs).  She and I went out to buy groceries and stopped and<br/>\nhad lunch and we started talking about the kids and how they&#39;re having<br/>\nproblems with their oldest, 14yo, and the other problems they were<br/>\nhaving with the other boys in school.<br/>\n<br/>\nI started telling her how I was not sending my boys to school and how<br/>\npreschool just didn&#39;t work for Jared (5 next month) and how I&#39;m going<br/>\nto unschool and really try to live my life joyfully and just enjoy my<br/>\nboys.  That really struck a chord with her because between her boys<br/>\nschedules, fighting with the schools and now problems with her 14yo,<br/>\nshe&#39;s just not able to really enjoy her boys.  All of her boys are<br/>\nadopted, from the same druggie mom (who is an adopted relative, so<br/>\nthey&#39;re not blood related to the boys at all), so they are blood<br/>\nsiblings and struggling from the effects of being born addicted.  I<br/>\nreally think if she could bring them home and unschool (she tried<br/>\nhomeschooling, but it just didn&#39;t really work out well for her), then<br/>\nI think they&#39;d all be so much happier.<br/>\n<br/>\nI was a little aprehensive to bring this up to her because she is so<br/>\ncontrolling with her boys with food and bedtimes and such, I didn&#39;t<br/>\nthink she&#39;d be open, but I really think she is open, at least<br/>\nsomewhat.  I think I&#39;ll go ahead and order a couple of copies of The<br/>\nTeenage Liberation Handbook and Rue&#39;s books to get her started<br/>\nthinking about it.  She&#39;s not a computer or internet gal, so I don&#39;t<br/>\nknow if she&#39;ll be interested in joining this group or not, but I&#39;ll<br/>\ngive her lots of resources anyway.<br/>\n<br/>\nJust this morning one of the other sisters was telling my husband,<br/>\n&quot;When they&#39;re at home, they&#39;re not this wild, because they know they<br/>\nhave to live under the rules.&quot;  And I was just thinking to myself,<br/>\n&quot;Well, if they didn&#39;t have so many rules, then they&#39;d be acting<br/>\nnormally.&quot;  My boys aren&#39;t acting much differently at the beach house<br/>\nthan they do at home.  I think all of them (the adults) are a bit<br/>\nastonished that I let Jared stay up till 11pm or whenever he lays down<br/>\nto sleep, and the same with Chase (18mo).  At least they haven&#39;t<br/>\nreally  tried to tell me I should make them go to be earlier.  My SIL<br/>\nwith the 5 boys puts the 3 youngest to bed between 7:30 & 8pm.  I<br/>\ncan&#39;t believe they even go down, especially since it&#39;s not even dark<br/>\nthen, and they&#39;re up at the crack of dawn and I can&#39;t deal with that!<br/>\n<br/>\nWell, this is getting a little long, but thanks for all the words of<br/>\nwisdom last week!  I&#39;m putting them to good use.<br/>\n<br/>\nKristie, a newbie</div>","specialLinks":[]}],"prevTopicId":14535,"nextTopicId":14564}}