{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":140557563,"authorName":"Karen Mann","from":"Karen Mann &lt;celtic_starz@...&gt;","profile":"celtic_starz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"dog grooming & intro (long)","postDate":"1131125233","msgId":7531,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMTA0MTcyNzEzLjg3NTcucW1haWxAd2ViNDA0MjgubWFpbC55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":7530,"nextInTime":7532,"topicId":7531,"numMessagesInTopic":0,"msgSnippet":"I m sorry my other post was lost---oh but I do remember writing that I ll do just about anything to get you lurkers out of lurkdom---including scrubbing dogs","messageBody":"<div id=\"ygrps-yiv-982452481\">I&#39;m sorry my other post was lost---oh but I do<br/>\nremember writing that I&#39;ll do just about anything to<br/>\nget you lurkers out of lurkdom---including scrubbing<br/>\ndogs&#39; butts!! &lt;G&gt;<br/>\n<br/>\n*+*+*+*+*+<br/>\n<br/>\nLOL!!  Kelly and Alex....thank you both so much for<br/>\nthe great information.  Alex, I never would have<br/>\nthought about the kennel club.  Great idea!  Kelly, I<br/>\nknow how you feel.  I was just replying with an intro<br/>\nand *!POOF!* my browser closed and I lost it. <br/>\nBlah...I can&#39;t quite remember what I had said about<br/>\nlurking now.  But, to defend lurking, it&#39;s a great way<br/>\nto get to know everyone and to absorb the information<br/>\nthat&#39;s flying by. (for me at least)  I&#39;ve learned so<br/>\nmuch here and at UD, unschooling.com (when it was<br/>\nup)unschooling.info, and, well, you know all the<br/>\nsites.<br/>\n<br/>\nOk..I guess it&#39;s intro time...should I put in a<br/>\ndisclaimer now about how long this could be. &lt;g&gt;  I<br/>\nthink I really need to start working on a blog. <br/>\nAnyway, I&#39;m a mom of 5 kids:  Tony (21) Donnie (20)<br/>\nBrittani (17) Sara (15) Hope (10).  Yep...busy house. <br/>\nCaretaker to 5 mice, 4 cats, 2 dogs and 2 birds. <br/>\nYep...messy house. Wife to John.  Yep...happy house.<br/>\n;)  <br/>\n<br/>\nI&#39;ve known about unschooling for a number of years<br/>\nnow, but the journey began just this year, in<br/>\nFebruary.  You see, back when Tony was in 8th grade he<br/>\nwanted to commit suicide because all the kids made fun<br/>\nof him, bullied him and just didn&#39;t like him.  He was<br/>\nshy, quiet and emotional.  He was ripe for the pickin&#39;<br/>\non, so to speak.  Tony was Baker Acted at the tender<br/>\nage of 12 because he told his youth group leader about<br/>\nhis thoughts on suicide.  After he came home, he<br/>\nopened up to me about his feelings and the healing<br/>\nALMOST began.<br/>\n<br/>\nDonnie on the other hand was the outgoing, social one.<br/>\n He was at school for the friends and fun.  He kissed<br/>\nevery administrator and teacher ass on campus.  They<br/>\nall loved him!  He skipped classes, but was at school<br/>\nevery day.  Had decent grades too.  His story is that<br/>\nhe got shafted by the school system for missing too<br/>\nmany days in 8th grade summer school due to a serious<br/>\nbronchial infection.  (He had already been retained in<br/>\n7th grade for his behavior.)  Meanwhile, there was<br/>\nanother boy in a different school that missed more<br/>\ndays than him and was promoted.  It seems that the<br/>\nindividual schools can make up their own rules about<br/>\nattendance.  <br/>\n<br/>\nAnyway, I have never been happy with the public school<br/>\nsystem, even when I went to school, so I began<br/>\nresearching homeschooling.  Of course unschooling came<br/>\nup in my research.  OMG! I couldn&#39;t believe it, here<br/>\nit was NATURAL LEARNING.   Now, I knew that the family<br/>\n(John, mom, dad, brother, in-laws, etc.) would never<br/>\ngo for the unschooling.  They had fits about me<br/>\nnursing my kids past the age of 9 mos.&lt;g&gt;  So, I<br/>\ngathered all sorts of information about homeschooling<br/>\nWITH a cirriculum and presented my case to the family.<br/>\n OUCH!!  What resistance I met with.  They went<br/>\nballistic on me with the two typical concerns: <br/>\nSocialization and Math.  Unfortunately they<br/>\noutnumbered me and my campaign failed miserably.  I<br/>\ngave in and kept the boys in school.  I was always the<br/>\ngood girl.  I always did what I was told. <br/>\nMuhahaha...not anymore. ;p<br/>\n<br/>\nAs the boys were in school, I developed a new<br/>\ncampaign.  I just waited until they were 16 and<br/>\nwithdrew them from school.  Yes...there were many,<br/>\nmany fights and arguments between John and I over<br/>\nattendance, homework and their friends (ps kids). <br/>\nFinally their birthdays came and I gave them the best<br/>\nbirthday presents ever.  I withdrew them from school. <br/>\nWhen I went to withdraw Donnie, they had the paperwork<br/>\nall filled out and ready for my signature..LOL!!  Now<br/>\ncame the time for the real battle to ensue.<br/>\n<br/>\nAfter I withdrew the boys, John started saying things<br/>\nalong the lines of &quot;the girls won&#39;t be &quot;dropouts&quot; like<br/>\nthe boys&quot; and &quot;they are going to college because *I*<br/>\nwant them to&quot;.  OH! Also, that their friends won&#39;t be<br/>\nusing drugs and having sex.  (LOL!!! He&#39;s a pistol,<br/>\nain&#39;t he.  Of course, now he realizes how insane he<br/>\nsounded back then. &lt;g&gt;)  <br/>\n<br/>\nWell, the girls didn&#39;t fair any better in school. <br/>\nJust a couple of incidents:  Sara beat the crap out of<br/>\ntwo boys who were pulling on her backpack and hair on<br/>\nher way home from school one day.  Brittani had some<br/>\ngirls try to jump her for liking a certain boy.  Hope<br/>\nwas teased mercilessly about her name.  Finally, I had<br/>\nenough!!  None of them wanted to go to school.  They<br/>\nwere miserable.  Plus with this No Child Left Behind<br/>\ncrap, school was becoming worse.  All they care about<br/>\nis testing.  Recess even became obsolete in Hope&#39;s<br/>\nschool.<br/>\n<br/>\nI didn&#39;t care what anybody thought or said and<br/>\nwithdrew them from school.  I blew up John&#39;s email<br/>\nwith forwarded posts from these groups, I printed<br/>\nstuff out and left it in the bathroom, I talked until<br/>\nI was blue in the face about unschooling.  And I&#39;m<br/>\nstill talking about it. &lt;g&gt;<br/>\n<br/>\nAs far as the extended family is concerned, mom and<br/>\ndad are pretty much ok with it.  Mom sees the<br/>\ndifference.  I did received a threat from my SIL that<br/>\nshe would never speak to me again if I took the girls<br/>\nout of school.  Funny...cuz she&#39;s hosting Thanksgiving<br/>\nand I&#39;m hosting Xmas this year. &lt;g&gt;<br/>\n<br/>\nAll the kids are doing great.  Tony is still working<br/>\nat the trophy shop he started at when he was 10.  (The<br/>\nowner has no kids and will be passing the shop to<br/>\nTony.)  Donnie is in his 3rd year electrical<br/>\napprenticeship.  (He&#39;s been playing with electricity<br/>\nsince he was 4) Brittani and Sara are hanging out with<br/>\ntheir friends and finding their passions.  Hope is<br/>\nanimal crazy and loving her new free life.<br/>\n<br/>\nOk..now that I&#39;ve bored you all to death, I&#39;ll close<br/>\nwith a big thank you to all of you for your wonderful<br/>\nadvice and insight.  I love being part of this group<br/>\nan look forward to learning even MORE!!<br/>\n<br/>\n<br/>\n<br/>\nKaren<br/>\n<br/>\nWhat does education often do? It makes a straight-cut ditch of a free, meandering brook.~*~+~*~Henry David Thoreau<br/>\n<br/>\n<br/>\n\t<br/>\n\t\t<br/>\n__________________________________ <br/>\nYahoo! Mail - PC Magazine Editors&#39; Choice 2005 <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]}],"prevTopicId":7528,"nextTopicId":7346}}