{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":245074059,"authorName":"kkraczek1969","from":"&quot;kkraczek1969&quot; &lt;kkraczek1969@...&gt;","profile":"kkraczek1969","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: 20/20 show","postDate":"1137275800","msgId":9032,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRxYnMybysxMGhkbUBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PGRxYnFjciszNHFkQGVHcm91cHMuY29tPg=="},"prevInTopic":9031,"nextInTopic":0,"prevInTime":9031,"nextInTime":9033,"topicId":9029,"numMessagesInTopic":0,"msgSnippet":"I agree, Ren. I have one child, my oldest, who chose to stay in PS when I took the other two out. I have told him, since he will be going to High School next","messageBody":"<div id=\"ygrps-yiv-533785412\">I agree, Ren. I have one child, my oldest, who chose to stay in PS<br/>\nwhen I took the other two out. I have told him, since he will be going<br/>\nto High School next year, that the door is always open for him if he<br/>\nshould decide that High School isn&#39;t for him.<br/>\n<br/>\nTo me, unschooling has so much to do with letting my children lead the<br/>\nlives that they choose, even if that means staying in PS. (As much as<br/>\n I don&#39;t like it!)<br/>\n<br/>\nKristin<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; &quot;Unfortunatly I&#39;m working with my 15 y.o. who loves all of her friends<br/>\n&gt; at school, and therefore doesn&#39;t want to leave school for this reason<br/>\n&gt; ONLY.&quot;<br/>\n&gt; <br/>\n&gt; But it should be her choice. You can make home more inviting, put out<br/>\n&gt; lots of reassurance that you will make sure her friends can be over<br/>\n&gt; often etc... but if you&#39;re going to understand unschooling, then<br/>\n&gt; trusting HER choices is a good place to start.<br/>\n&gt; <br/>\n&gt; If you force her home against her will, that is more damaging long<br/>\n&gt; term than what she&#39;s getting at school. You can make school less<br/>\n&gt; important by helping her do the things she loves and forgetting about<br/>\n&gt; grades and all  the other BS that goes along with schooling. Make her<br/>\n&gt; interests and selfhood all important, and diminish the importance of<br/>\n&gt; school....and let her choose.<br/>\n&gt; That&#39;s my advice. Glad you found the list...<br/>\n&gt; <br/>\n&gt; Ren<br/>\n&gt; learninginfreedom.com<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"20/20 show","postDate":"1137274075","msgId":9031,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRxYnFjciszNHFkQGVHcm91cHMuY29tPg=="},"prevInTopic":9029,"nextInTopic":9032,"prevInTime":9030,"nextInTime":9032,"topicId":9029,"numMessagesInTopic":0,"msgSnippet":"Unfortunatly I m working with my 15 y.o. who loves all of her friends at school, and therefore doesn t want to leave school for this reason ONLY. But it","messageBody":"<div id=\"ygrps-yiv-1070826583\">&quot;Unfortunatly I&#39;m working with my 15 y.o. who loves all of her friends<br/>\nat school, and therefore doesn&#39;t want to leave school for this reason<br/>\nONLY.&quot;<br/>\n<br/>\nBut it should be her choice. You can make home more inviting, put out<br/>\nlots of reassurance that you will make sure her friends can be over<br/>\noften etc... but if you&#39;re going to understand unschooling, then<br/>\ntrusting HER choices is a good place to start.<br/>\n<br/>\nIf you force her home against her will, that is more damaging long<br/>\nterm than what she&#39;s getting at school. You can make school less<br/>\nimportant by helping her do the things she loves and forgetting about<br/>\ngrades and all  the other BS that goes along with schooling. Make her<br/>\ninterests and selfhood all important, and diminish the importance of<br/>\nschool....and let her choose.<br/>\nThat&#39;s my advice. Glad you found the list...<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":109199990,"authorName":"BethnDe@aol.com","from":"BethnDe@...","profile":"bethnde1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"re: 20/20 show","postDate":"1137257663","msgId":9029,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJhNS4zZDE2NWFiLjMwZmE4NmJmQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":9031,"prevInTime":9028,"nextInTime":9030,"topicId":9029,"numMessagesInTopic":0,"msgSnippet":"Please don t get offended by me being here with this group, and I m very brand new in joining with you parents here. We re still not in the works of taking my","messageBody":"<div id=\"ygrps-yiv-23617178\">Please don&#39;t get offended by me being here with this group, and I&#39;m very  <br/>\nbrand new in joining with you parents here. We&#39;re still not in the works of  <br/>\ntaking my child out of school yet, but we&#39;re seriously thinking about it. In the  <br/>\nmeanwhile, we&#39;re watching, researching, and etc. because I think for many  <br/>\ndifferent reasons we&#39;re going to end up unschooling before next year&#39;s school  <br/>\nyear. Unfortunatly I&#39;m working with my 15 y.o. who loves all of her friends at  <br/>\nschool, and therefore doesn&#39;t want to leave school for this reason ONLY. On <br/>\nthe  other hand, I&#39;ve been to the district, and pretty soon my next step is <br/>\ngoing to  be the Department of Education, because not only are they abiding by her <br/>\niep  (individual Education Plan, due to having a severe case of a.d.h.d and <br/>\nbeing  real low in testing), but she&#39;s got a teacher who has stolen something <br/>\nfrom my  daughter (as unbelieavable as it is sounds, it is true), lied to us <br/>\nmany times,  accused her of being a cheater then come to find out she corrected <br/>\nthe paper  incorrectly, she&#39;s accused my daughter of not handing in <br/>\nassignments, but later  found them, she&#39;s told me it&#39;s not her job to pull my daughter <br/>\nout of class for  testing, but yet it is her job and it&#39;s on my daughter&#39;s iep, <br/>\nthis teacher makes  comments to our kids that would make you fall over in <br/>\nshock, and soooooo much  more. Yet this teacher, even with the proof of theft, <br/>\nhas gotten away with all  of this. What is the district&#39;s decision on the <br/>\nmatter? Let&#39;s just move my  daughter to another team of teachers. So, needless to <br/>\nsay, the 20/20 drove home  for me that these teachers have so many rights, some <br/>\ntime, as in my situation,  too many rights. Just because these teachers are <br/>\nprotected by the union they get  away with doing so many things to our kids, and <br/>\nthen they hide behind the  protection of the union. I didn&#39;t believe it when <br/>\nI asked my advocate on this,  &quot;Why is this school letting this teacher get <br/>\naway with these things?&quot; and her  reply was, &quot;because she&#39;s in the union, and if <br/>\nthe school did anything to her  they&#39;d have to cover their butts big time, so <br/>\nthey didn&#39;t get sued&quot; I, of  course, believed this, because I do know the <br/>\npowers of a union, but boy did the  20/20 show drive this home for me, I was <br/>\ntotally amazed how this was a topic on  there last night. Another thing is that my <br/>\nstate does have school choice, I&#39;m in  Delaware, and I can select to send my <br/>\ndaughter to any school I want as long as I  provide transportation, of course <br/>\nthis just means public schools. Yet, I&#39;m  sorry, I don&#39;t see the competition <br/>\nthey were speaking of last night on 20/20.  This school choice has been the case <br/>\nfor 9 years so far, and it&#39;s changed  nothing. However, vouchers I think <br/>\nwould be a different school, I think if we  pay school taxes, than OUR children <br/>\nshould receive that money. If our children  are home schooled, than we parents <br/>\nshould receive that money for our supplies,  etc. Lastly, the thing that got me <br/>\non the show the most was how bad our kids are  behind in their education <br/>\nbecause of the way their being taught. Not to mention  when they showed the list <br/>\nwhere South Carolina was on the bottom for being the  worst on their kids <br/>\neducation, I saw where Delaware was like 4th to the bottom,  that&#39;s a crying shame. <br/>\nNo wonder our country is outsourcing jobs to other  countries, and etc. The <br/>\neducational system stinks here in this country where  you&#39;d think we&#39;d be one <br/>\nof the best. It doesn&#39;t surprise me though. Thanks for  letting me share, and <br/>\ntrust me I&#39;m 100% convinced that my kids need to be home  schooled or <br/>\nunschooled, it&#39;s just convincing them about missing their friends.  I&#39;ve even tried to <br/>\nexplain that she&#39;d have more time to spend with them instead,  but that wasn&#39;t <br/>\nenough either. Have any of you pulled your teens out and had a  hard time <br/>\nconvincing them it&#39;s worth it?  <br/>\n<br/>\nLove,<br/>\nBeth<br/>\nmother to Nikki and Kayla<br/>\nand always thinking of  Brian<br/>\nsince his sunset on  09/07/05<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":9027,"nextTopicId":8997}}