{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] schulyer","postDate":"1181397342","msgId":24316,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU5MjY4NThCLUQ1MTAtNDgzOS05ODU2LUU1QUVCNUU5NERFQUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAyOWUwMWM3YWExZiQyODQ1YTczMCQwMzAyYThjMEBsaXZpbmdyb29tMT4=","referencesHeader":"PDAyOWUwMWM3YWExZiQyODQ1YTczMCQwMzAyYThjMEBsaXZpbmdyb29tMT4="},"prevInTopic":24291,"nextInTopic":0,"prevInTime":24315,"nextInTime":24317,"topicId":24246,"numMessagesInTopic":0,"msgSnippet":"... I suspect most who haven t met Dagny or met other girls who socially mature early are finding this hard to grasp! Dagny must have been 10 when my daughter,","messageBody":"<div id=\"ygrps-yiv-1230982024\">On Jun 8, 2007, at 6:48 PM, Rue Kream wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Then, 16 months ago, whatever magic it<br/>\n&gt; is that happens happened for them.  Dagny was 13 1/4, Andrew had  <br/>\n&gt; just turned<br/>\n&gt; 17, and they were in love.<br/>\n<br/>\n </span></blockquote>I suspect most who haven&#39;t met Dagny or met other girls who socially  <br/>\nmature early are finding this hard to grasp!<br/>\n<br/>\nDagny must have been 10 when my daughter, Kat, and I first met her at  <br/>\nthe first Live and Learn Conference. Dagny had organized through the  <br/>\nLive and Learn Kids list &quot;Dumbledore&#39;s Army&quot; (I believe it was  <br/>\ncalled.) She organized get togethers during the conference. She had  <br/>\nthis amazingly mature social sense. At 10. I had to check several  <br/>\ntimes to make sure she really was only 10 because she seemed at least  <br/>\nas old as my daughter (13 at the time) if not older ;-) And not that  <br/>\nfake make up and sexy clothes &quot;maturity&quot; young schooled girls affect.  <br/>\nReal social maturity.<br/>\n<br/>\nIt really doesn&#39;t surprise me at all that she&#39;s mature enough for a  <br/>\nboyfriend at 13.<br/>\n<br/>\nAnd yet at 15 (coming up on 16 next month) Kat isn&#39;t ready. Not only  <br/>\nnot ready, but knows she&#39;s not ready because she just isn&#39;t  <br/>\ninterested and doesn&#39;t feel there&#39;s anything wrong with that. I  <br/>\noverheard her say to a friend that she didn&#39;t intend to date until  <br/>\nshe got to college. She&#39;s *very* similar to me. I too didn&#39;t date  <br/>\nuntil college but I did feel odd because it seemed &quot;everyone&quot; had a  <br/>\nboyfriend in high school. (My former best friend had a boyfriend in  <br/>\n5th grade. (Former mostly because she matured a lot faster and we  <br/>\ndidn&#39;t have much in common anymore.))  Kat, on the other hand, knows  <br/>\nshe&#39;s perfectly normal.<br/>\n<br/>\nIt&#39;s why arbitrary ages are meaningless.<br/>\n<br/>\nIt&#39;s why knowing our children, developing a relationship that earns  <br/>\ntheir trust, and being there to help them explore what they&#39;ve  <br/>\ndetermined they&#39;re ready for is what makes this all work so wonderfully.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152271008,"authorName":"Rue Kream","from":"&quot;Rue Kream&quot; &lt;skreams@...&gt;","profile":"ruekream","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] schulyer","postDate":"1181342918","msgId":24291,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyOWUwMWM3YWExZiQyODQ1YTczMCQwMzAyYThjMEBsaXZpbmdyb29tMT4=","inReplyToHeader":"PDY1MThhOTM2MDcwNjA4MTI1M2ozMmFiN2JmZXFkMmRjZTY0M2M4YjIyZmI1QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":24279,"nextInTopic":24316,"prevInTime":24290,"nextInTime":24292,"topicId":24246,"numMessagesInTopic":0,"msgSnippet":"... cookies with D s family, spending time with D s little sister and her parents, even being invited along on family outings/trips. A is absolutely welcome in","messageBody":"<div id=\"ygrps-yiv-162515500\"><blockquote><span title=\"ireply\">&gt;&gt;The first couple, D & A, spend the most of their time together making<br/>\n </span></blockquote>cookies with D&#39;s family, spending time with D&#39;s little sister and her<br/>\nparents, even being invited along on family outings/trips. A is absolutely<br/>\nwelcome in their home.<br/>\n<br/>\n**D&#39;s mom here :o). I got the ok from Dagny and Andrew to write a bit about<br/>\nthem.<br/>\n<br/>\nDagny met Andrew at the first Peabody conference when she was almost 12 and<br/>\nhe was 15 1/2.  While Dagny developed a major crush on him pretty much the<br/>\nminute she met him, Andrew had a girlfriend at the time.  So they became<br/>\nfriends, hanging out mostly in group situations and talking on the phone/IM<br/>\na LOT.  Eventually Andrew broke up with his girlfriend.  Dagny and Andrew<br/>\ndeveloped a really great friendship.  Then, 16 months ago, whatever magic it<br/>\nis that happens happened for them.  Dagny was 13 1/4, Andrew had just turned<br/>\n17, and they were in love.<br/>\n<br/>\nWe had our moments of panic at first.  I think we&#39;d probably have had those<br/>\nno matter how old she was the first time she fell in love.  She&#39;s our baby,<br/>\nand we don&#39;t want her to be hurt or sad.  But we weren&#39;t going to let those<br/>\nfears interfere in our relationships with her, or in her relationship with<br/>\nAndrew.  Our focus became, &quot;What can we do to contribute to their having a<br/>\nhealthy relationship?&quot;   Anything that would cause them to feel they had to<br/>\nsneak or lie to us would certainly not contribute to their having a healthy<br/>\nrelationship.  Anything that encouraged them to be open with us would.<br/>\n<br/>\nSo, 16 months later:  Andrew&#39;s part of our family.  He has a key to our<br/>\nhouse.  He stays here 3-4 nights a week.  He vacations with us.  He<br/>\nhouse/dog sits for us.  He makes some mean chocolate chip cookies.  He&#39;s<br/>\nkind to Dagny when she&#39;s grumpy.  He&#39;s gentle with Rowan. He&#39;s thoughtful<br/>\nand helpful.  When my great-nephews come over he&#39;s a bit of a baby-hog.  His<br/>\nlaugh makes me laugh.  We talk about parenting and South Park and cars and<br/>\nhaircuts and learning and toys and cooking.  We argue the benefits of using<br/>\nshortening in cookies. He and Dagny read to each other almost every night.<br/>\nThey jump on the trampoline, wave to strangers driving by, have nerf-gun<br/>\nwars with Rowan and Jon, wander the aisles of Job Lot, cook, play video<br/>\ngames, sew, and garden.<br/>\n<br/>\nShe&#39;s 14. He&#39;s 18. So what?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I understand D&#39;s dad did have a conversation with him about his<br/>\n </span></blockquote>expectations for how his daughter is to be treated and the consequences for<br/>\nbehaving differently. A is still around :)<br/>\n<br/>\n**Just to clarify - Jon would only have done this jokingly, as anyone who&#39;s<br/>\nmet him would probably guess :o).  Anyway, Andrew&#39;s a 3rd degree blackbelt,<br/>\nso Jon doesn&#39;t stand much of a chance &lt;G&gt;.   ~Rue<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"&quot;diana jenner&quot; &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] schulyer","postDate":"1181332397","msgId":24279,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDcwNjA4MTI1M2ozMmFiN2JmZXFkMmRjZTY0M2M4YjIyZmI1QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGY0YnVjbCtkdTdhQGVHcm91cHMuY29tPg==","referencesHeader":"PDAwOGIwMWM3YTljZSRmOTdlMjc2MCQ0MDAxYThjMEBEYXZpZD4gPGY0YnVjbCtkdTdhQGVHcm91cHMuY29tPg=="},"prevInTopic":24272,"nextInTopic":24291,"prevInTime":24278,"nextInTime":24280,"topicId":24246,"numMessagesInTopic":0,"msgSnippet":"The news stories, unfortunately, won t give any of us insight on how to unschool our children. It *does* give us a peek into how we d *not* like our future","messageBody":"<div id=\"ygrps-yiv-1014843445\">The news stories, unfortunately, won&#39;t give any of us insight on how to<br/>\nunschool our children. It *does* give us a peek into how we&#39;d *not* like our<br/>\nfuture relationships with our children to look/feel like.<br/>\nI know, personally, two unschooled teenage couples whose ages reflect the<br/>\nsame gap as in this tragic story.<br/>\nI did the tongue-clucking at first, too. Until I began to really pay<br/>\nattention to how (in my own head and with some trusted RU friends) I was<br/>\nputting on the Judges Robes in my thinking about these relationships.<br/>\nSo I decided to take off the robes & check it out for my own self. I was<br/>\nlucky enough to be in ABQ with both couples, at the 2006 Live and Learn<br/>\nConference. The first couple, D & A, spend the most of their time together<br/>\nmaking cookies with D&#39;s family, spending time with D&#39;s little sister and her<br/>\nparents, even being invited along on family outings/trips. A is absolutely<br/>\nwelcome in their home. I understand D&#39;s dad did have a conversation with him<br/>\nabout his expectations for how his daughter is to be treated and the<br/>\nconsequences for behaving differently. A is still around :) I spoke with<br/>\nthem openly and honestly about my judgment and my gratitude for being given<br/>\nan opportunity to (once again!) shift my perspective.<br/>\nThe second couple, JH & JB, I don&#39;t know as well so I took this opportunity<br/>\nto get to know them better and ask them about their relationship. Actually,<br/>\nbefore that JH&#39;s mother took me aside and told me she had refused her<br/>\ndaughter&#39;s request to see JB (with good cause, it was a long trip and a lot<br/>\nof money) until my dd died and she realized she could very well be denying<br/>\nher own daughter&#39;s last request. She found the money and JH was sent off to<br/>\nspend some time with JB and his family -- across the country. At the talent<br/>\nshow, JB got up on stage and sang &quot;The Way You Look Tonight&quot; to his girl. It<br/>\nwas obvious to me how much he loves and cherishes JH. I went to her and<br/>\nsaid, You are the luckiest girl in the room! and I meant it. I would give<br/>\nanything to have someone look at, speak of, sing to my child in that same<br/>\nway; heck, I&#39;d love for someone to do that for ME! It was all I wanted as a<br/>\nteenager, and here I am right in the same space as these amazing people who<br/>\nare in healthy relationships not only with one another, also with their<br/>\nparents (both sets) and with others in their Tribe.<br/>\nThese are parents who love and cherish their kids. Who want the very best<br/>\npossible for their kids. Their kids want to date someone *wonderful* who<br/>\nhappens to be 3+ years different in age. What can the family do as a *TEAM*<br/>\nto make it a win/win/win/win/win situation? The two aforementioned families<br/>\nare my examples for this situation. They represent the mentality and love I<br/>\nwant for my teens (when they get there!), heck for my kids at any age!<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\nI don&#39;t know what it is about me that makes me open to other people&#39;s<br/>\nkids... Mayhap it&#39;s my *never grow up* Gemini characteristics or it may just<br/>\nvery well be a symptom of being diana :::vbg::: It&#39;s not just teens, though<br/>\nI like them fine. At Life is Good, I was surrounded by the toddlers-7 year<br/>\nolds during the day and the teens at night. Nothing against adults, I talk<br/>\nto them just fine, too :) Kids just seem to *get* unschooling more quickly<br/>\nthan their older schooled counterparts. They live it versus talking about<br/>\nit. That is very appealing to me.To see it in action.<br/>\nThe news story doesn&#39;t give a generalization of how ALL kids will turn out<br/>\nand it certainly doesn&#39;t reflect the plethora of possibilities we have as<br/>\nunschoolers. I want to head towards the goal of the kind and gentle parents<br/>\nI know who have enviable relationships with their kids. A totally different<br/>\npath than outside of Unschooling.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 6/8/07, iamhisservant4ever &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:iamhisservant4ever@...\">iamhisservant4ever@...</a>&gt; wrote:<br/>\n<br/>\n&gt; I am not &quot;defending&quot; anything. There is nothing to interpret from my<br/>\n&gt; posts. I am very clear in what I am saying and how I feel.<br/>\n&gt;<br/>\n<br/>\n<br/>\n-- <br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":269152394,"authorName":"iamhisservant4ever","from":"&quot;iamhisservant4ever&quot; &lt;iamhisservant4ever@...&gt;","profile":"iamhisservant4ever","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"schulyer","postDate":"1181318357","msgId":24272,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0YnVjbCtkdTdhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwOGIwMWM3YTljZSRmOTdlMjc2MCQ0MDAxYThjMEBEYXZpZD4="},"prevInTopic":24254,"nextInTopic":24279,"prevInTime":24271,"nextInTime":24273,"topicId":24246,"numMessagesInTopic":0,"msgSnippet":"Sorry if you can t read my responses. They seem fine on my computer. I am not defending anything. There is nothing to interpret from my posts. I am very","messageBody":"<div id=\"ygrps-yiv-1712266444\">Sorry if you can&#39;t read my responses. They seem fine on my computer. <br/>\n<br/>\nI am not &quot;defending&quot; anything. There is nothing to interpret from my <br/>\nposts. I am very clear in what I am saying and how I feel.<br/>\n<br/>\nAnd I never said that the evilness of this girls character led to her <br/>\nparents murder. Again another interpretation of what I was saying <br/>\nhere. I am sure that you all know the same thign that was printed in <br/>\nthe paper and on teh news, and that was that he murdered them because <br/>\nhe was told he could not see her any longer. The fact that he brought <br/>\nalong guns has nothing to do with the possibility that maybe he was <br/>\ncrazy and planned on  carrying this out anyway?? The fact that he and <br/>\n2 other teens were &quot;practicing&quot; home invasions shortly before all of <br/>\nthis happened, I am guessing also had nothing to do with his <br/>\ncharacter. In the end it seems that everyone here is defending <br/>\nthis &quot;poor&quot; girl and her boyfriend, and blaming it all on her dead <br/>\nparents for caring about her.<br/>\n<br/>\nMaybe there are people on here that don&#39;t even know the facts behind <br/>\nthis case. Allow me to go over the facts again, with the help of one <br/>\nof the articles;<br/>\n<br/>\n<br/>\nAccording to Ludwig, Borden had spent the night at his house, after <br/>\nwhich he had dropped her off at home around 5:30 am. <br/>\n***Outstanding behavior that this 14 year old exemplified***<br/>\n<br/>\nLudwig waited for a text message from Borden, letting him know that <br/>\nshe had successfully made it back without incident, presumably by <br/>\nsneaking into the house undetected. However, the text message never <br/>\ncame. After several attempts to reach Borden, Ludwig finally <br/>\ncontacted her at around 6:15 am. Borden informed him that she had <br/>\ngotten caught and asked him to come over so her parents could talk to <br/>\nhim. At this point, Ludwig grabbed two guns and a hunting knife and <br/>\ntraveled to the Bordens&#39; house<br/>\n<br/>\n***hmm.....why all the weapons??***<br/>\n<br/>\n arriving around 7 am. Ludwig and Michael Borden argued for about 45 <br/>\nminutes, at which time Michael Borden allegedly stated that Ludwig <br/>\nwas no longer allowed to see his daughter. Ludwig then allegedly shot <br/>\nMichael Borden in the back and proceeded to shoot Cathryn Borden who <br/>\nwas sitting in the living room. Ludwig left the scene and then <br/>\nreturned in hopes to find Kara, who had run out of the house after <br/>\nthe first shooting in a frenzy. It was not long before Kara ran <br/>\ntowards his vehicle and according to Ludwig, asked him to drive as <br/>\nfar west as possible so they could marry and start a new life <br/>\ntogether. <br/>\n<br/>\n***so after being freed from her horrible parents, she willingly left <br/>\nwith their murderer and said she wanted to get married and start a <br/>\nnew life. It sounds to me like she was the one doing the manipulating <br/>\nhere. But that is only my opinion, not the truth, not the real facts. <br/>\nThe truth and facts behind all this are not for me to judge, and no <br/>\none knows what really went on, except the actual people involved in <br/>\nthe murder.***</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Lorrie","postDate":"1181316042","msgId":24254,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0YnM0YStqbmY4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwOGIwMWM3YTljZSRmOTdlMjc2MCQ0MDAxYThjMEBEYXZpZD4="},"prevInTopic":24246,"nextInTopic":24272,"prevInTime":24253,"nextInTime":24255,"topicId":24246,"numMessagesInTopic":0,"msgSnippet":"~~ It seems to me that if it had been a more open environment between the parents and their daughter, there would have been more time for her to really","messageBody":"<div id=\"ygrps-yiv-53111482\">~~<br/>\nIt seems to me that if it had been a more open environment between the<br/>\nparents and their daughter, there would have been more time for her to<br/>\nreally discover if it was this boy she wanted to be with, instead of the<br/>\nlittle time there was of the excitement and adrenaline that comes from<br/>\nsneaking around.~~<br/>\n<br/>\nExactly!<br/>\nBack in medieval times, girls that age were being married off in some<br/>\nsocieties. So &quot;proper&quot; age for sex and dating are hugely deteremined<br/>\nby societal factors which have NOTHING to do with the individuals<br/>\nreadiness.<br/>\n<br/>\nI believe that in an open, trusting home, kids often feel LESS<br/>\ninclined to have sex young.  I know so many unschooled teens (several<br/>\nwhich are sexually active and they seem to make their choices about<br/>\nsex with so much more thought and pondering. I certainly didn&#39;t think<br/>\nmuch about anything when I had sex at 16. It wasn&#39;t a true choice!<br/>\n<br/>\nMy 17 year old puts a lot of thought and care into his choices. It&#39;s<br/>\nreally cool to see.<br/>\n<br/>\nAnd unschooled kids are FAR from &quot;left to figure it out themselves&quot;<br/>\njust because we aren&#39;t trying to control their choices. In a mindful<br/>\nfamily, choices are discussed, weighed, every members needs considered<br/>\nand creative adaptations made constantly. <br/>\n<br/>\nWhen both of my kids want the front seat in the van and we sit in the<br/>\ndriveway, my input is &quot;let&#39;s figure out something that works for<br/>\neveryone&quot;.  Yeah, sometimes one person has to wait, but its<br/>\ninteresting to hear their negotiations. &quot;I know, I&#39;ll sit in back now<br/>\nbut I get it on the way home ok?&quot; or &quot;you got to sit here yesterday,<br/>\nso can I have it first today?&quot;<br/>\n<br/>\nSure, sitting in the front seat is a small thing, but if families can<br/>\nnegotiate and problem solve while putting everyone&#39;s needs as<br/>\npriority, THEN there is a pattern set for solving bigger issues. Kids<br/>\ntrust that the adults care about their needs.<br/>\n<br/>\nI would assume that a 13 year old girl truly wanting sex would find a<br/>\nway to have it whether the parents forbid it or not(oh yeah, thats<br/>\nalready been proven). I would assume she had some underlying need and<br/>\nit would be my job to figure out what that need was. I would also<br/>\nassume that her relationship with the 18 year old was her relationship<br/>\nand I would not have a right to terminate that (oh yeah, that doesn&#39;t<br/>\nwork either...interesting)<br/>\n<br/>\nI might invite that person over to our house a lot if I had concerns<br/>\nabout his behavior (which would  have NOTHING to do with his age). I<br/>\ndon&#39;t intend to be a wall between my children and their lives. They<br/>\nwill make their own choices with or without me anyway, I have much<br/>\nmore influence as a connected, aware parent that they TRUST.<br/>\n<br/>\nBut we&#39;re talking about a family that was not unschooling. We&#39;re<br/>\ntalking about a unique and bizarre situation that probably nobody<br/>\ntruly understands (including people that knew them) and that isn&#39;t<br/>\ngoing to help anyone understand unschooling or gentle parenting. So<br/>\nlets move on. PLEASE.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":280852700,"authorName":"Schuyler","from":"&quot;Schuyler&quot; &lt;s.waynforth@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Lorrie","postDate":"1181308481","msgId":24246,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwOGIwMWM3YTljZSRmOTdlMjc2MCQ0MDAxYThjMEBEYXZpZD4=","referencesHeader":"PDQ4NTAzLjc3MjgyLnFtQHdlYjM4NTA2Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":24254,"prevInTime":24245,"nextInTime":24247,"topicId":24246,"numMessagesInTopic":0,"msgSnippet":"I m having a really hard time reading your responses. It would help if you delineated somehow--a line, a series of asterisks, or even just a space-- between","messageBody":"<div id=\"ygrps-yiv-1303578438\">I&#39;m having a really hard time reading your responses. It would help if you <br/>\ndelineated somehow--a line, a series of asterisks, or even just a space--  <br/>\nbetween your writing and the writing you are responding to.<br/>\n<br/>\nEvery one of your posts is defending two things as far as I can interpret. <br/>\nThe first is that this girl was an individual situation from which no <br/>\ninferences can be drawn. And to some extent that it was the evilness of the <br/>\ngirl&#39;s character that resulted in both her sneaking behind her parents&#39; <br/>\nbacks to continue her relationship and in her boyfriend&#39;s subsequent <br/>\nmurdering of her parents. And while no one is saying that the murder of her <br/>\nparents is justified by their decisions about her dating at the age of 13, <br/>\nit is being said that in an open, trusting home she may not have felt that <br/>\nshe was being asked to choose between her family and her young man.<br/>\n<br/>\nThe second thing that you seem to be repeating ad nauseum is that anyone who <br/>\nloves their children can only choose to restrict their dating at a young <br/>\nage. For me I can only argue from the hypothetical, my two children aren&#39;t <br/>\ninterested in dating, and are only 7 and 10 so it isn&#39;t something that is <br/>\nlikely to come up for a couple of years at least.<br/>\n<br/>\nI love my children. I overflow with love for my children. When I look at <br/>\nthem, play with them, brush their hair, watch them playing, listen to them, <br/>\nfix them ice cream cones, cuddle them, I love them. It is a huge part of <br/>\nwhat defines me. I know things about them that I know my parents didn&#39;t know <br/>\nabout me. And not because I pry or eavesdrop or follow them around or get <br/>\nsomeone else to report back to me, but because they tell me. They share who <br/>\nthey are and what they are interested in with me because I&#39;m really unlikely <br/>\nto make fun of them and their interests, and because I am more than likely <br/>\nto take part in their interests with them, and have been known to help <br/>\nfacilitate those interests for them. I would never choose to shut down those <br/>\ndoors of communication by denying them something that interested them as <br/>\nmuch as being with a person that they cared for, no matter their age. I <br/>\nwouldn&#39;t be over-the-moon about Linnaea at 14 dating an 18 year old, just as <br/>\nan idea. But I would trust that she had reasons for finding this 18 year old <br/>\nappealing and I would hope that she would be comfortable with letting us get <br/>\nto know him.<br/>\n<br/>\nIt seems to me that if it had been a more open environment between the <br/>\nparents and their daughter, there would have been more time for her to <br/>\nreally discover if it was this boy she wanted to be with, instead of the <br/>\nlittle time there was of the excitement and adrenaline that comes from <br/>\nsneaking around. I mean, what a brilliant way to make dating exciting, boost <br/>\nthe normal hormonal response with the rush of the adrenal system! I&#39;m not <br/>\nsaying that he wouldn&#39;t have killed them anyhow, but maybe she would have <br/>\nchosen to leave him if they&#39;d trusted her and supported her in the choices <br/>\nshe made. Maybe she would have been able to judge him more clearly if her <br/>\nvision wasn&#39;t blurred by her parents disapproval.<br/>\n<br/>\nSchuyler<br/>\n<br/>\nwww.waynforth.blogspot.com<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Lorrie&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:iamhisservant4ever@...\">iamhisservant4ever@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nSent: Friday, June 08, 2007 8:11 AM<br/>\nSubject: [unschoolingbasics] sylvia<br/>\n<br/>\n<br/>\n&gt; ****<br/>\n&gt; Those kids who &#39;do what they want&#39; no matter what you try to teach them --  <br/>\n&gt; first, why would they want to do things that are harmful to them? What <br/>\n&gt; unmet need do they have? When a kid doesn&#39;t care about their own safety, <br/>\n&gt; and doesn&#39;t listen to his parents&#39; concerns, that&#39;s a kid who doesn&#39;t feel <br/>\n&gt; his parents understand him, where he is right in that moment.<br/>\n&gt; Probably because we live in a &quot;feel good&quot; generation, where all alot of <br/>\n&gt; people want is to feel good regardless of the consequences or if what they <br/>\n&gt; are doing is harmful or not. Some kids don&#39;t want to listen to their <br/>\n&gt; parents concerns, even if they have understanding parents. Are you telling <br/>\n&gt; me you have never seen this??<br/>\n&gt;<br/>\n&gt; .<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ____________________________________________________________________________________<br/>\n&gt; TV dinner still cooling?<br/>\n&gt; Check out &quot;Tonight&#39;s Picks&quot; on Yahoo! TV.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://tv.yahoo.com/\">http://tv.yahoo.com/</a><br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":24238,"nextTopicId":24320}}