{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":87710633,"authorName":"julie","from":"&quot;julie&quot; &lt;juillet727@...&gt;","profile":"juillet727","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"myths was Re: food thread--Mary","postDate":"1149325889","msgId":13994,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1cmpvMStzMWhzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA1MjYyMDA2MjIzMC4yMzEwNC40NDc3ODE3QjAwMDQ5QTBBMDAwMDVBNDAyMjAwNzUxMDkwMEUwMzAzMDEwMzAyMEE5NkBjb21jYXN0Lm5ldD4="},"prevInTopic":13697,"nextInTopic":0,"prevInTime":13993,"nextInTime":13995,"topicId":13697,"numMessagesInTopic":0,"msgSnippet":"*this ended up being  kind of long and blathery* just sharing my process with all this new info I get from this list... Hi Mary-- Gosh, I thought about this","messageBody":"<div id=\"ygrps-yiv-1915594019\">*this ended up being  kind of long and blathery* just sharing my <br/>\nprocess with all this new info I get from this list...   <br/>\n  Hi Mary--<br/>\nGosh, I thought about this for a long time. I mean, I do think that <br/>\nanything we put into our bodies affects us to any degree. And what we <br/>\ndo also affects us. But, it&#39;s been interesting to look at my <br/>\nattachments to my ideas. <br/>\n  I realize that when my boy is IN a melt down or very close to it <br/>\nthat I say no to sugary food or video games. The un-met needs are <br/>\nalready speaking in the grumpy behavior. I was thinking the vidoes or <br/>\nsugar made the grumpy acting out behavior. But..(thinking out loud <br/>\nhere)..maybe the need IS to play video games? I&#39;m thinking of Pam&#39;s <br/>\npost of her daughter playing SIMS for days. I understand this in my <br/>\nown behavior. I often will listen to the same album or even song for <br/>\na month easily. Or I&#39;ll watch the same movie for a month straight. I <br/>\njust watched Chocolat (with Juliette Binoche) at least once or twice <br/>\na day for the last 2 or 3 weeks, actually. I would think it was <br/>\npreposterous for someone to chastise me for it or try to change what <br/>\nI do. For me to assume what my boy should be into at any given time <br/>\nis equally ridiculous. <br/>\n  Here&#39;s a little story: my boy got home from school the other day---<br/>\nyeah that&#39;s right, I&#39;m WAY the newbie here. My boy won&#39;t be going <br/>\nback to school next year. Blech. Anyway, he says to me that he wants <br/>\nto play video games. I say, well, gosh sweetie, I have to go to work <br/>\nin an hour (I work P/T) and I want to visit with you. He REALLY wants <br/>\nto play, so he plays the video games. I&#39;m sitting right there, <br/>\nactually laying down on the couch because I have cramps and we&#39;re <br/>\ntalking about the game and whatnot and the time comes for me to get <br/>\nready and go to work and we have to go drop him off with my <br/>\npartner/his dad who is working. My boy was so sad that we didn&#39;t get <br/>\nto visit before I had to go to work, but he did get to play videos. I <br/>\nhugged him and loved him thru the sad feelings of not getting to <br/>\nvisit, but it was what he wanted at the time. I checked in throughout <br/>\nhis playing time to see if he wanted to turn it off and visit and he <br/>\nsaid no and that was really ok with me. We were still together, <br/>\ntalking.  <br/>\n Another anecdote: the other day my son said, &quot;mom, I wish I could <br/>\nget in your head and make you do what I want.&quot; &quot;And what would that <br/>\nbe?&quot; I asked. He said he wanted to choose what to eat for dinner. <br/>\nCrap! Am I really that controlling? Aargh. So, tonight he ate a cute <br/>\nfrosted flower shaped cookie, he wanted some gummi bears and some <br/>\nsome chocolate drops (natural m&m&#39;s). I put some in a bag (bought in <br/>\nbulk). That was dinner. No meltdown. We had a great night. Oh, and <br/>\nlater he wanted raviolis. And a little watermelon. Now, we have had <br/>\ndinners like this before, but I always fretted about it a lot. I want <br/>\nto be less stressed about it. <br/>\n  I saw the post about the books (Let Them Eat Cake, etc) and <br/>\nthought...man, I&#39;m going to read that book! <br/>\n  I&#39;ve had a bunch of times where my boy has played video games for <br/>\nhours and hours, once for 11 hrs and he didn&#39;t flip out. He was <br/>\nperfectly content. and other times where he eat a bunch of sugary <br/>\nstuff and there was no meltdown. Before now, I didn&#39;t know how that <br/>\ncould be. I think I&#39;m starting to understand a little bit more now. <br/>\nTrying to let go of my attachments.<br/>\n Anyway, thanks.<br/>\n~~Julie.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, zenmomma@... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt;&gt;I totally agree that this is a myth, but sometimes I choose for my<br/>\n&gt; (almost 7yr old) boy because *I* don&#39;t want to deal with a sugar-<br/>\n&gt; bombed kid or a frenetic-from-video-games kid.&gt;&gt;<br/>\n&gt; <br/>\n&gt; I personally think this is a myth also. From my experience (and I <br/>\n </span></blockquote>realize I have not experienced every child in the whole wide world) <br/>\nkids will act out for a variety of reasons. In all cases they&#39;re <br/>\ntrying to tell us something-I&#39;m tired, I&#39;m hungry, I&#39;m frustrated, <br/>\nI&#39;m bored, I&#39;m restless, etc. Lots of times they give us cues way <br/>\nbefore the meltdown stage and we can be proactive. We can bring them <br/>\nfood, suggest a temporary change in activity, rub their shoulders or <br/>\nwhatever it is they need. <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Sometimes the meltdown will still happen, but many times the <br/>\n </span></blockquote>trouble can be averted. Helping a child learn that they feel better <br/>\nafter video game breaks (or reading breaks or swimming breaks) is <br/>\npart of our job. Blaming the video game for a tired or frenetic kid <br/>\ndoes nothing to help you learn what&#39;s really triggering particular <br/>\nreactions.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I&#39;m not exactly sure what a sugar-bombed kid is exactly. Usually <br/>\n </span></blockquote>the times that kids get lots of sugar are times when there&#39;s lots of <br/>\nactivity and excitement going along with it. Birthday parties, <br/>\ncarnivals, trick or treating, Easter baskets all have a lot of <br/>\nfanfare associated with them. I think it&#39;s the build up, activity and <br/>\nfanfare that leads to overstimulation and breakdowns. But the sugar <br/>\ngets blamed as if it was the only thing to touch the child that day. <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I realize there are reactions to sugar. I know that I&#39;m <br/>\n </span></blockquote>hypoglycemic, so I need some protein when I have something very <br/>\nsugary or I&#39;ll feel awful when my blood sugar level crashes. (Would <br/>\nthat make be sugar-bombed? &lt;g&gt;.)  I&#39;ve made my kids aware of this <br/>\nconnection and so they are good at listening to their own bodies&#39; <br/>\ncues and reactions. If they do end up being hypoglycemic like me, <br/>\nI&#39;ll have done them no favors if I simply forbid candy to avoid the <br/>\nmeltdown. How much better to help them understand their bodies and <br/>\nlearn what a healthy balance of foods feels like.<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; <br/>\n&gt; --<br/>\n&gt; ~Mary<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://zenmommasgarden.blogspot.com/\">http://zenmommasgarden.blogspot.com/</a><br/>\n&gt; <br/>\n&gt; &quot;The miracle is not to walk on water. The miracle is to walk on the<br/>\n&gt; green earth, dwelling deeply in the present moment and feeling truly<br/>\n&gt; alive.&quot;<br/>\n&gt;                                    ~Thich Nhat Hanh<br/>\n&gt; <br/>\n&gt;  -------------- Original message ----------------------<br/>\n&gt; From: &quot;julie&quot; &lt;juillet727@...&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":218449772,"authorName":"zenmomma@comcast.net","from":"zenmomma@...","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"myths was Re: food thread","postDate":"1148682619","msgId":13697,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA1MjYyMDA2MjIzMC4yMzEwNC40NDc3ODE3QjAwMDQ5QTBBMDAwMDVBNDAyMjAwNzUxMDkwMEUwMzAzMDEwMzAyMEE5NkBjb21jYXN0Lm5ldD4="},"prevInTopic":0,"nextInTopic":13994,"prevInTime":13696,"nextInTime":13698,"topicId":13697,"numMessagesInTopic":0,"msgSnippet":"... (almost 7yr old) boy because *I* don t want to deal with a sugar- bombed kid or a frenetic-from-video-games kid. I personally think this is a myth also.","messageBody":"<div id=\"ygrps-yiv-1627656596\"><blockquote><span title=\"ireply\">&gt;&gt;I totally agree that this is a myth, but sometimes I choose for my<br/>\n </span></blockquote>(almost 7yr old) boy because *I* don&#39;t want to deal with a sugar-<br/>\nbombed kid or a frenetic-from-video-games kid.&gt;&gt;<br/>\n<br/>\nI personally think this is a myth also. From my experience (and I realize I have not experienced every child in the whole wide world) kids will act out for a variety of reasons. In all cases they&#39;re trying to tell us something-I&#39;m tired, I&#39;m hungry, I&#39;m frustrated, I&#39;m bored, I&#39;m restless, etc. Lots of times they give us cues way before the meltdown stage and we can be proactive. We can bring them food, suggest a temporary change in activity, rub their shoulders or whatever it is they need. <br/>\n<br/>\nSometimes the meltdown will still happen, but many times the trouble can be averted. Helping a child learn that they feel better after video game breaks (or reading breaks or swimming breaks) is part of our job. Blaming the video game for a tired or frenetic kid does nothing to help you learn what&#39;s really triggering particular reactions.<br/>\n<br/>\nI&#39;m not exactly sure what a sugar-bombed kid is exactly. Usually the times that kids get lots of sugar are times when there&#39;s lots of activity and excitement going along with it. Birthday parties, carnivals, trick or treating, Easter baskets all have a lot of fanfare associated with them. I think it&#39;s the build up, activity and fanfare that leads to overstimulation and breakdowns. But the sugar gets blamed as if it was the only thing to touch the child that day. <br/>\n<br/>\nI realize there are reactions to sugar. I know that I&#39;m hypoglycemic, so I need some protein when I have something very sugary or I&#39;ll feel awful when my blood sugar level crashes. (Would that make be sugar-bombed? &lt;g&gt;.)  I&#39;ve made my kids aware of this connection and so they are good at listening to their own bodies&#39; cues and reactions. If they do end up being hypoglycemic like me, I&#39;ll have done them no favors if I simply forbid candy to avoid the meltdown. How much better to help them understand their bodies and learn what a healthy balance of foods feels like.<br/>\n<br/>\n<br/>\n--<br/>\n~Mary<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://zenmommasgarden.blogspot.com/\">http://zenmommasgarden.blogspot.com/</a><br/>\n<br/>\n&quot;The miracle is not to walk on water. The miracle is to walk on the<br/>\ngreen earth, dwelling deeply in the present moment and feeling truly<br/>\nalive.&quot;<br/>\n                                   ~Thich Nhat Hanh<br/>\n<br/>\n -------------- Original message ----------------------<br/>\nFrom: &quot;julie&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:juillet727@...\">juillet727@...</a>&gt;</div>","specialLinks":[]}],"prevTopicId":13933,"nextTopicId":13995}}