{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":281007366,"authorName":"Leslie Kowalski","from":"Leslie Kowalski &lt;lrkowalski@...&gt;","profile":"lkowalsk","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"cats and 4 year olds","postDate":"1174846984","msgId":22528,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBOTRBRTZFLTIwRTItNEY3MC05Mzg0LUJCMjgxNzdBQTI2NkB2ZXJpem9uLm5ldD4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":22527,"nextInTime":22529,"topicId":22528,"numMessagesInTopic":0,"msgSnippet":"Hi again, Okay, so here s my 2nd problem for group discussion.  (Katharine is probably laughing her head off that I am posting this problem to yet another","messageBody":"<div id=\"ygrps-yiv-1378531381\">Hi again,<br/>\n<br/>\nOkay, so here&#39;s my 2nd problem for group discussion.  (Katharine is  <br/>\nprobably laughing her head off that I am posting this problem to yet  <br/>\nanother group!)<br/>\n<br/>\nWe have a wonderful cat - she is tolerant, friendly, and playful.   <br/>\nPaige (who is 4) adores her (as we all do) and shows her this love by  <br/>\npicking her up constantly, laying on top of her, carrying her around  <br/>\n(sometime slinging her over her shoulders), holding her even if the  <br/>\ncat is struggling, and a variety of other things that are both  <br/>\nirritating to the cat, and very difficult for me to watch.<br/>\n<br/>\nBecause the cat is sooooo tolerant, she mostly sits there with either  <br/>\na blank expression on her face, or one that looks like she&#39;s thinking  <br/>\n&quot;help me please&quot;.  She will sometimes back away from Paige, but it&#39;s  <br/>\nvery slow and rarely quickly enough to run away.  She even comes up  <br/>\nto Paige several times a day, looking for Paige to pet her, which  <br/>\nshows that she still likes her.  A good thing is that she rarely  <br/>\nbites or scratches (or if she does it&#39;s very gentle biting or  <br/>\nscratching).  But, when she does finally decide to bite, Paige is  <br/>\ntotally incensed.<br/>\n<br/>\nI have a varied response to this (which I&#39;m sure is part of the  <br/>\nproblem!).  Sometimes I think that the cat can take care of herself  <br/>\nand I let it go.  But, then I&#39;ll see Paige so something like go into  <br/>\nmy bedroom, close the door and I walk in to find her laying on top of  <br/>\nthe cat.  Or, I&#39;ll see Paige run out of the room with the cat slung  <br/>\nover her shoulders.  At those times I see it as an animal welfare  <br/>\nissue and I intervene.  Mostly I try to help Paige to recognize  <br/>\nMonty&#39;s signals (squirming, meowing, etc), or encourage her to play  <br/>\nin ways that the cat really likes.  But, overall, the whole thing has  <br/>\nbecome a difficult issue between Paige and I.  She gets really mad at  <br/>\nme for intervening, or feels really sad when I do.<br/>\n<br/>\nI know that this is normal behavior for a 4 year old.  I also know  <br/>\nthat some of it is that she is looking for my attention, so I have  <br/>\nbeen trying to focus on having more time alone with Paige and doing  <br/>\nthings she really enjoys - working toward repairing whatever might be  <br/>\nmissing in our relationship.<br/>\n<br/>\nSo, overall I think that letting her and the cat work it out, and  <br/>\nlooking for ways to help Paige feel less desirous to use the cat to  <br/>\nget my attention is what I want to do.  It&#39;s when I see it as animal  <br/>\nmistreatment that I have a problem -  that&#39;s the part I really get  <br/>\nstuck on.  I don&#39;t want to see Monty being mistreated, and I don&#39;t  <br/>\nwant either Paige or Tess to think that I think it&#39;s okay to do  <br/>\nthat.  So, overall I don&#39;t know how to present a balanced approach to  <br/>\nthis problem.<br/>\n<br/>\nAgain, probably not one of the more difficult problems in the world,  <br/>\nbut another good example of struggles that stymie me!<br/>\n<br/>\nThanks for any suggestions!<br/>\n<br/>\nLeslie</div>","specialLinks":[]}],"prevTopicId":22520,"nextTopicId":22495}}