{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":288325711,"authorName":"dinapug310","from":"&quot;dinapug310&quot; &lt;b38040@...&gt;","profile":"dinapug310","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Books on death","postDate":"1335203877","msgId":48380,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpuNDU3NSs5bG8xQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":48379,"nextInTime":48381,"topicId":48380,"numMessagesInTopic":0,"msgSnippet":"Hello all. I was hoping some of you might have book suggestions on death for kids, my daughter, Thea, is 4 1/2.  And also for me on helping kids grieve. Thea s","messageBody":"<div id=\"ygrps-yiv-1685796036\">Hello all.<br/>\n<br/>\nI was hoping some of you might have book suggestions on death for kids, my daughter, Thea, is 4 1/2.  And also for me on helping kids grieve.  <br/>\n<br/>\nThea&#39;s grandfatehr (my partner&#39;s dad) just died and though we haven&#39;t seen him in a year, bc we now live in another state, we lived there with him the 6 months prior to leaving and Thea always had a very sweet relationship with him.  I, however, did not, and though I don&#39;t express anything but care for him when talking with her, my lack of saddness, I think might be confusing a bit.  I took it very slow, I told her he died (she knew he was sick) and she said &quot;oh, will Nana miss him?&quot;  I told her &quot;yes, and papa and they&#39;ll be sad too.&quot;  Then I could see she didn&#39;t want to talk much more, so I gave her the space to take it in and waited to see if she&#39;d bring it up. She didn&#39;t mention anything until 48 hours later, she said that he&#39;d love her new pom poms and asked again if nana would miss him.  I told her yes and asked if she missed him and she said no. Then 48 hours after that, she was talking to her imaginary friend vampire about werewolf going to the hospital and that &quot;werewolf died, will you miss him?&quot; &quot;Yes, I&#39;ll miss him.&quot;  It was very sweet, she repeated it 3 or 4 times.  Then the next day she made two pictures and one was very emotional,to me at least, it was patients in a hospital and lots of sad faces and tears.  She shared it with me, but wasn&#39;t forthcoming about it like she is with most of her artwork.  So, I realized I&#39;d need to step in with a few words. <br/>\n<br/>\nSo, the next day, I asked her how she was feeling about it and I could see she was trying to hide her saddness and I told her it was okay to cry and that it was normal...she didn&#39;t know and she stopped trying to fight the tears and did start to cry.  (DH is not living with us at the moment, he was with his dad, so she&#39;s not seeing him grieve.)  We talked some more and said we&#39;d release a balloon for him and plant a tomato tree, because he liked them.  And she&#39;s been mentioning his name every day now and asks DH if he misses him every time she talks to him and she asked me to make a card for DH and to write her grandfathers name on it. So, she seems to be doing okay.  But I&#39;d like to read up a bit more.  Any book suggestions or any suggestions are welcome.<br/>\n<br/>\nThank you,<br/>\nDina</div>","specialLinks":[]}],"prevTopicId":48368,"nextTopicId":48387}}