{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":240684971,"authorName":"pellegrina@comcast.net","from":"pellegrina@...","profile":"elysgrl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Intro and 2 cents on video games","postDate":"1238076360","msgId":39119,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1OTQ1NTk1Ni4zMTc5NDEyMzgwNzYzNjA2OTcuSmF2YU1haWwucm9vdEBzejAxMTBhLndlc3RjaGVzdGVyLnBhLm1haWwuY29tY2FzdC5uZXQ+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":39118,"nextInTime":39120,"topicId":39119,"numMessagesInTopic":0,"msgSnippet":"Hi everybody! I ve been lurking for a few days, reading the video game thread with great interest.  But first, a bit about me and my family: I m Denise, mom","messageBody":"<div id=\"ygrps-yiv-636655337\">Hi everybody! <br/>\n<br/>\n<br/>\n<br/>\nI&#39;ve been lurking for a few days, reading the video game thread with great interest.  <br/>\n<br/>\n<br/>\n<br/>\nBut first, a bit about me and my family: I&#39;m Denise, mom to four kids, Zach, 22, Cody, 18, Chelsea, 16, and Logan, 7.  I homeschooled Cody and Chels for a few years almost a decade ago, mainly in response to struggles Cody was having in public school.  At the time, I was intrigued by the idea of unschooling, but when it came right down to it, I was too scared.  I just couldn&#39;t let go of the schoolthink, and we ended up using a truly abominable all-subjects-in-one giant workbook.  I supplemented with unit studies on subjects that they were interested in, and we did have a lot of fun with those. <br/>\n<br/>\n<br/>\n<br/>\nBut because we had never deschooled, and because they were so reliant on me for direction, when their very high-need little brother Logan was born, I couldn&#39;t keep up with the &quot;schooling&quot;.  After five months of basically doing &quot;nothing&quot;, they told me they didn&#39;t feel like they were learning anything anymore, and they wanted to go back to public school.  Not what a homeschooling mom wants to hear!  I panicked, and with a heavy heart and mixed feelings, I sent them back. (Cody continued to struggle for the rest of his time in school and now says he wishes I had encouraged him to stay home, so he could have spent all this wasted time working on his music.) <br/>\n<br/>\n<br/>\n<br/>\nFast forward seven years, and now that high-need baby is a very bright, funny, active, talkative little boy.  He is considered a behavior problem in first grade, and unbelievably, has already been suspended twice.  Yes, you read that right--suspended.  In first grade! This is a no-brainer for my husband and me; of course we&#39;re bringing him home.  I will never again put another child through what Cody went through (a nightmare of child study teams, psychologists, and meds, none of which he ever needed at all). <br/>\n<br/>\n<br/>\n<br/>\nSo here I am revisiting unschooling, because obviously the school-in-a-box thing didn&#39;t work the first time around.  Things are a little different now; I&#39;m older, more relaxed, and I have the gift of sweet perspective.  Having somehow raised two kids to adulthood already, I know that in spite of my mistakes and foibles, my kids are going to turn out fine anyway. One of the problems I had the first time is that I wasn&#39;t fully committed to homeschooling in general.  It was something I was doing in response to a perceived problem, and I went into with the expectation that I would probably send them back at some point.  I was afraid to deviate from the grade-level curriculum, because what if they went back?  I couldn&#39;t send them back with gaping holes in their knowledge, could !? (To this day, Chelsea teases me that I never taught her cursive writing, so she still prints everything.  Oops.) <br/>\n<br/>\n<br/>\n<br/>\nThis time around, I believe I owe it to Logan to jump in with both feet.  I&#39;ve been reading a lot of stuff I never read the first time--John Holt, John Taylor Gatto--and thinking deeply about the way I learn things myself.  Instead of looking at homeschooling as a reactive measure to a bad public school experience (even though initially that&#39;s why we made the decision to pull him out), I&#39;m looking at it as a proactive measure to help my son become the person he&#39;s meant to be.  And if that&#39;s the goal, then unschooling seems like the best (and most fun!) way to accomplish it. <br/>\n<br/>\n<br/>\n<br/>\nI&#39;m really looking forward to soaking up all the wisdom from the experienced unschoolers here.  I&#39;ve already learned a lot just from my week of lurking! <br/>\n<br/>\n<br/>\n<br/>\nFinally, about the video games:  Logan is currently obsessed with Super Mario Galaxy. (We caught him playing it at 1 am one night, long after he had supposedly gone to sleep.)  He also sometimes gets very frustrated, throws the controller down on the floor, snaps at people, even cries.  We told him that there were websites where he could get advice and codes if he was stuck, and showed him how to look it up. He didn&#39;t seem interested at first (he wanted his sister to beat the level for him) but one day after he threw himself down on his bed, crying because he couldn&#39;t beat a certain boss, he emerged from his room sniffling and rubbing his eyes, went to the computer, and found the information he needed online. He went back to his room, and fifteen minutes later, emerged victorious!  He was SO proud of himself.  His success seemed to help a lot with his frustration level, and we haven&#39;t seen any crying since.  He also loves it when we watch him play, so we do that whenever we can. <br/>\n<br/>\n<br/>\n<br/>\nAlso again, perspective helps.  His brothers went through the same thing with Tomb Raider years ago--actually we were all kind of obsessed with that one!  It eventually passed and they moved on to other interests.  Neither one of them are hardcore gamers now, but they were both &quot;addicted&quot; for a while. My advice would be to relax and let it run its course. <br/>\n<br/>\n<br/>\n<br/>\nTalk to you all soon, <br/>\n<br/>\nDenise <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":38937,"nextTopicId":39131}}