{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] The challenge of paradigm shifts was bedtimes","postDate":"1110946381","msgId":5140,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhZWQ1ZDY1MmE0ZjU3OGUyMDcxY2M2ODJiNDdlMjQ5QGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDIwMDUwMzE1MTQ1NS4xZGJrV2wyeUczTlpGcEEzQG14LWEwNjVhMDUucGFzLnNhLmVhcnRobGluay5uZXQ+","referencesHeader":"PDIwMDUwMzE1MTQ1NS4xZGJrV2wyeUczTlpGcEEzQG14LWEwNjVhMDUucGFzLnNhLmVhcnRobGluay5uZXQ+"},"prevInTopic":5131,"nextInTopic":0,"prevInTime":5139,"nextInTime":5141,"topicId":5131,"numMessagesInTopic":0,"msgSnippet":"... My BABY is 14. But I LOVE preschool-age children - my mom ran a preschool for almost my whole life and I got unschooling by understanding it as a natural","messageBody":"<div id=\"ygrps-yiv-2067332207\">On Mar 15, 2005, at 2:54 PM, Robyn Coburn wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Of course the &quot;problem&quot; with it is that Kelly, Ren and Pam aren&#39;t <br/>\n&gt; there, so<br/>\n&gt; do stay here too!<br/>\n<br/>\n&gt; Ah - that was sweet of you to say.<br/>\n<br/>\n </span></blockquote>My BABY is 14. But I LOVE preschool-age children - my mom ran a <br/>\npreschool for almost my whole life and I &quot;got&quot; unschooling by <br/>\nunderstanding it as a natural extension of the kind of free-school <br/>\nprogram my mom ran.<br/>\n<br/>\nI may not be on that list, but it makes me really happy to know it is <br/>\nthere and you all are there talking about these things while your kids <br/>\nare still so young.<br/>\n<br/>\nLUCKY KIDS!!<br/>\n<br/>\n(Lucky parents, too!)<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"The challenge of paradigm shifts was bedtimes","postDate":"1110927287","msgId":5131,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{},"prevInTopic":0,"nextInTopic":5140,"prevInTime":5130,"nextInTime":5132,"topicId":5131,"numMessagesInTopic":0,"msgSnippet":"I am discombobulated because I wrote this post and sent it, then every other post to every group I wrote subsequently came through and this one did not. ","messageBody":"<div id=\"ygrps-yiv-1439657492\">I am discombobulated because I wrote this post and sent it, then every other<br/>\npost to every group I wrote subsequently came through and this one did not.<br/>\nTherefore, being impatient I am re-posting, and my apologies if you get it<br/>\ntwice.<br/>\n**************************************<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt; Attitudes take time to change, but I know I can<br/>\ndo it.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nThat&#39;s the spirit, Judy! Yes you can.<br/>\n<br/>\nI have not posted to this general thread, because everyone else has said<br/>\nwhat I would have said, with enormous eloquence. However there are a couple<br/>\nof ideas I wanted to revisit.<br/>\n<br/>\nYou mentioned earlier that you have only been around a month, and that you<br/>\nare still making your way through Sandra&#39;s writing. I would encourage you to<br/>\ncontinue to read all her site.<br/>\n<br/>\nThe most difficult work ahead of you is not in implementing the positive<br/>\nchanges to your *behavior* that folk have suggested and you are beginning<br/>\n(kudos!), but, as you have discovered, it is making the internal changes in<br/>\nattitude - paradigm shifts. <br/>\n<br/>\nI want to suggest that you read back over some of your recent posts, looking<br/>\nat the language that you are using to describe yourself. You use imperatives<br/>\na lot that may indicate a lack of belief that you have much broader choices<br/>\nthan may seem obvious to you. You use &quot;I need&quot;, &quot;I must&quot;, &quot;always&quot; often.<br/>\nSome of your statements imply a powerlessness in the face of ....what?<br/>\nConvention, the School district, time passing in the day, a preconceived<br/>\nnotion of what &quot;good parenting&quot; looks like, expectations imposed on yourself<br/>\nand others? <br/>\n<br/>\nMuch of your paradigm seems still stuck in the idea that parents and<br/>\nchildren &quot;must&quot; or &quot;will&quot; inevitably be adversaries. I feel sad when I read<br/>\nit because I feel that you are trapped by these self-expectations that some<br/>\nof your words reveal. The sparkling wonder of Unschooling is that it frees<br/>\nthe parents to a life of greater joy as much as it frees the children! If<br/>\nyou keep at it, and don&#39;t get discouraged by the incisive rigor of some of<br/>\nthe discussion or slide in to a state of defensiveness, the rewards in your<br/>\nown spiritual growth can be as enriching as the blossoming brilliance of<br/>\nyour children as they grow.  <br/>\n<br/>\nThis self-examination and willingness to go through temporarily feeling<br/>\nreally lousy about the &quot;former self&quot; can be the hard part - but it is<br/>\nsimplified when we make a conscious effort to change our words to change our<br/>\nthoughts.<br/>\n<br/>\nI&#39;ll give you a kinda picky example.<br/>\n<br/>\nYour daughter is &quot;in school&quot;. Continuing to keep the idea that it is &quot;only<br/>\nKindergarten&quot; by backing off from the phrases &quot;in school&quot; or &quot;being<br/>\nschooled&quot; in your thoughts, is minimizing the damage that Kindergarten can<br/>\ndo in terms of preparation of the child&#39;s mind for school culture. It is the<br/>\nfirst deposit in an investment in schoolish thoughts and habits and the idea<br/>\nof grades and that learning should be directed externally on an imposed<br/>\ntimetable (in the child&#39;s mind, let alone the parents). <br/>\n<br/>\nWhen school is expected, or home is not made more vibrant than school can<br/>\nseem, or the child does not *genuinely* choose school (which includes the<br/>\nfreedom to quit at any time) but instead is trying to fulfill a need in the<br/>\nmost socially obvious, commonplace way, or because she has simply not had<br/>\nthe possibility of options discussed, then &quot;sending&quot; one child to school<br/>\nwill remain a barrier to getting to Unschooling with Joy for the whole<br/>\nfamily.<br/>\n<br/>\nYou do have more options for fulfilling the true need, once it has been<br/>\ndiscerned and discussed with your dd, and these lists are great places to<br/>\nget a quick kick in the pants if you are stuck in an &quot;our choices are<br/>\nlimited&quot; rut. It seems from what you said that her true need is for friends<br/>\nand activities. I endorse what another poster said about finding some local<br/>\ngroups now, regardless of your timetable for pulling her out. Just recall<br/>\nthat the fact that she is in school is placing barriers to getting to full<br/>\nunderstanding of Unschooling in your path - not that these cannot be<br/>\novercome.<br/>\n<br/>\nOn a practical note try www.nhen.org both for local groups and Statewide<br/>\norganizations that can give you a better idea of your legal options in NH.<br/>\n<br/>\nI want to endorse what Danielle said, about coming over to Always Unschooled<br/>\nalso. Please read the list description and guidelines carefully (my<br/>\nautomatic caution). We are also very rigorous and often have deeply<br/>\nincisive, penetrating discussions where we challenge each other to broaden<br/>\nour thinking both as parents and, recently, as spouses. <br/>\n<br/>\nWe also have a monthly parenting/learning philosophies book discussion that<br/>\nhas been wonderful. However that list&#39;s greatest usefulness to you, Judy,<br/>\nmight be that simply because the focus is on pre-school aged children, the<br/>\nattention paid to the &quot;educational component&quot; of Unschooling is minimal,<br/>\nwhile the greatest emphasis is on the Whole Life component of RU - those<br/>\nvery areas you are exploring.<br/>\n<br/>\nWe also have a files section on the group homepage that includes many other<br/>\narticles, links, and book lists that Danielle has been indefatigable in<br/>\ncompiling for our greater ease of perusal.<br/>\n<br/>\nOf course the &quot;problem&quot; with it is that Kelly, Ren and Pam aren&#39;t there, so<br/>\ndo stay here too! <br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.308 / Virus Database: 266.7.2 - Release Date: 3/11/2005</div>","specialLinks":[]}],"prevTopicId":5101,"nextTopicId":5080}}