{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: name calling","postDate":"1335036298","msgId":48375,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGptdjFpYStkbzZyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGptcWY3MCttOTVhQGVHcm91cHMuY29tPg=="},"prevInTopic":48370,"nextInTopic":0,"prevInTime":48374,"nextInTime":48376,"topicId":48368,"numMessagesInTopic":0,"msgSnippet":"... ************* Does your son like him or is he just one of the kids who tend to play together on the street? Are his feelings getting hurt or are you","messageBody":"<div id=\"ygrps-yiv-982907203\">&quot;Sara Uselton&quot; &lt;saralouwho@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; My son is 4, almost 5.  He has a very handsome, stocky build.  There&#39;s another kid on the street who has started calling him fat, among other put-downs and name-calling.<br/>\n </span></blockquote>*************<br/>\n<br/>\nDoes your son like him or is he just one of the kids who tend to play together on the street? Are his feelings getting hurt or are you jumping in to protect him before that can happen? None of that was clear from your post, and it makes a difference!<br/>\n<br/>\nKids are pretty good at telling who&#39;s friendly and easy to get along with and who isn&#39;t. I grew up with a neighborhood of kids playing together, and we learned who to avoid - the rough kids, the insulting kids. I don&#39;t remember anything those &quot;mean&quot; kids said now, thirty something years later, although I remember they said things to put other people down. They&#39;re thoughts and opinions weren&#39;t important to me, as long as I could mostly avoid them. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I offer to go play at the park and things like that, but he really likes riding his scooter around our street with his other friends. <br/>\n </span></blockquote>**************<br/>\n<br/>\nYou could do things to make your part of the street more attractive for riding bikes and scooters, maybe, if that&#39;s the big excitement. Simple obstacles and low ramps, even having things like flags or streamers to fly from a scooter could help encourage the fun to be where you are. If social play is important to your guy, than learning to be a good hostess is something for you to learn! <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] name calling","postDate":"1334924554","msgId":48370,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2MUFDODg2LTMyMzEtNDlDMi05QzY1LTVGRDQ4MjdCNzBCNEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGptcWY3MCttOTVhQGVHcm91cHMuY29tPg==","referencesHeader":"PGptcWY3MCttOTVhQGVHcm91cHMuY29tPg=="},"prevInTopic":48368,"nextInTopic":48375,"prevInTime":48369,"nextInTime":48371,"topicId":48368,"numMessagesInTopic":0,"msgSnippet":"... It sounds like you already did talk to him. If you keep bringing it up when *he s* not seemingly affected, it will feel to him like you believe there must","messageBody":"<div id=\"ygrps-yiv-1755324124\">On Apr 19, 2012, at 9:47 PM, Sara Uselton wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So, I&#39;m wondering how to talk to him about these things. Has anyone dealt with this? <br/>\n<br/>\n </span></blockquote>It sounds like you already did talk to him. <br/>\n<br/>\nIf you keep bringing it up when *he&#39;s* not seemingly affected, it will feel to him like you believe there must be something in what the other kid says.<br/>\n<br/>\nRather than trying to protect your son, empower him. Think about the skills that will be useful for him as a person when people are saying unkind things. <br/>\n<br/>\nOut in public, you can say &quot;Hey, be nice,&quot; but the other kid knows you&#39;re not the boss of him ;-) You have the right and power to express your values but you don&#39;t have the right or power to force those values on someone else. You do, though, have the power to walk away. Tell your son -- not in a worried voice but in a confident voice of empowerment -- that if it gets too much for him, he can come in and you can find something more fun to do together. (And then be prepared to do exactly that. Make doing something else top priority.) If the other kid is particularly bad, you can say that to your child where the other can hear it.<br/>\n<br/>\n In your own yard, though, you do have power. You can say &quot;I&#39;m sorry you hear things like that at home but we don&#39;t talk to each other like that here. Be nice or go home.&quot;<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":321860186,"authorName":"Sara Uselton","from":"&quot;Sara Uselton&quot; &lt;saralouwho@...&gt;","profile":"reflectionmommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"name calling","postDate":"1334886432","msgId":48368,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGptcWY3MCttOTVhQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":48370,"prevInTime":48367,"nextInTime":48369,"topicId":48368,"numMessagesInTopic":0,"msgSnippet":"I had a dilemma, that I want to handle as good as possible. My son is 4, almost 5.  He has a very handsome, stocky build.  There s another kid on the street","messageBody":"<div id=\"ygrps-yiv-808098577\">I had a dilemma, that I want to handle as good as possible.<br/>\n<br/>\nMy son is 4, almost 5.  He has a very handsome, stocky build.  There&#39;s another kid on the street who has started calling him fat, among other put-downs and name-calling.  This kid is talked to in a put-down, name-calling way by both his parents.  That&#39;s their way of disciplining, unfortunately.  And they hit, make him go to bed without dinner and things like that.  <br/>\n<br/>\nWhen the mom hears this boy name-calling, etc., she always yells at him to stop, or threatens to make him go in the house.  But that&#39;s obviously not going to solve the problem.  Me talking to him doesn&#39;t matter.  <br/>\n<br/>\nI told my son he was a big, beautiful, handsome man, and that this kid was just saying these things because he gets treated that way, and that it had nothing to do with my son.  I don&#39;t want my son to feel bad about himself at the tender age of 4!<br/>\n<br/>\nI offer to go play at the park and things like that, but he really likes riding his scooter around our street with his other friends.  He wants to just be able to play on our street.  I&#39;m always right there with him, but they ride all around the street, and I&#39;m not always within earshot when these things happen.  He doesn&#39;t want to just stay in the house, or go other places, instead.  <br/>\n<br/>\nSo, I&#39;m wondering how to talk to him about these things.  Has anyone dealt with this?  <br/>\n<br/>\nThank you so much for any input!<br/>\n<br/>\nSara</div>","specialLinks":[]}],"prevTopicId":48369,"nextTopicId":48380}}