{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":367169565,"authorName":"Melissa Gray","from":"Melissa Gray &lt;melissagr8@...&gt;","profile":"graymamacita","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Decision to Home School next  year- Long email","postDate":"1242917644","msgId":40247,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVERTZBNjUyLTA0NDQtNDZFQS1COUQxLUQ1QzQ2MjkxQkU0M0BnbWFpbC5jb20+","inReplyToHeader":"PGd1dW81dis1cW91QGVHcm91cHMuY29tPg==","referencesHeader":"PGd1dW81dis1cW91QGVHcm91cHMuY29tPg=="},"prevInTopic":40246,"nextInTopic":0,"prevInTime":40246,"nextInTime":40248,"topicId":40222,"numMessagesInTopic":0,"msgSnippet":"Hi Mary, I ve been thinking on this email off and on. It seems to me that there are a great many issues that need to be addressed, but it all comes down to do","messageBody":"<div id=\"ygrps-yiv-772730527\">Hi Mary,<br/>\nI&#39;ve been thinking on this email off and on. It seems to me that  <br/>\nthere are a great many issues that need to be addressed, but it all  <br/>\ncomes down to do YOU want to unschool? It seems like you are still  <br/>\nundecided on the unschool vs public school, and that might be where  <br/>\nhis indecision comes from. For what it&#39;s worth, I do believe that an  <br/>\neight year old is capable of making a decision, even one of this  <br/>\nmagnitude. In reality, it&#39;s not really a big decision, it doesn&#39;t  <br/>\naffect the rest of his life, except in the case of stress created by  <br/>\nschool could affect him psychologically. I say that, having kids on  <br/>\nthe spectrum, and having dealt with public schools. It took YEARS for  <br/>\nmy son to get over 1) the belief that public schools were his  <br/>\nacademic salvation and 2) that the people bullying him there were his  <br/>\nfriends.<br/>\n<br/>\nThe issue to really address, socialization. That&#39;s a big one, and  <br/>\nhard for people to let go. In my experience, young people with  <br/>\naspergers often have trouble socializing with children their age.  <br/>\nWhy? Because their brains don&#39;t mesh up well, they are developing at  <br/>\ndifferent stages, and they just don&#39;t identify. Children his age are  <br/>\noften experimenting with cliques, bullying, bribing, different ways  <br/>\nof being friends, and that&#39;s so hard for a child with aspergers  <br/>\nbecause they don&#39;t get the nonverbal nuances that make communication.  <br/>\nMy son was very rule bound, and after spending day after day with  <br/>\ncertain kids, had developed a strict set of rules about friendship  <br/>\nthat were hard to break. The one that broke my heart was that kids  <br/>\n&#39;his age&#39; don&#39;t play with &#39;babies&#39;, anyone third grade or younger? He  <br/>\nhad never felt that way but learned it at school. The one that  <br/>\nannoyed me was that all adults were stupid and trying to &#39;ruin kids  <br/>\nfun&#39;. In unschooling, all of my kids have experienced that every age,  <br/>\nregardless of ability, has something of value, and something we can  <br/>\nlearn.<br/>\n<br/>\nWe didn&#39;t have trouble finding homeschooling friends, but like you,  <br/>\ndid have problems with visiting with them at our leisure. They were  <br/>\nall so scheduled, and busy! Classes, strict routines, etc, kept us  <br/>\nseparated. Thankfully, a friend I met decided to start an unschooling  <br/>\ngroup! She advertised on other yahoo groups for unschoolers, and it&#39;s  <br/>\nbeen wonderful. It&#39;s not a large group, and there aren&#39;t a lot of  <br/>\nchildren. The ages don&#39;t match up exactly, but the kids have enjoyed  <br/>\neach other very much. We&#39;ve had people leave the group, but we don&#39;t  <br/>\ntake it personally. We&#39;ve had a LOT of people leave because there  <br/>\naren&#39;t kids the &#39;right age&#39;, which is just too sad, because they  <br/>\ndon&#39;t see that the adults aren&#39;t all the same age, and yet we manage  <br/>\nto be friends ;-)  I think knowing that he could depend on meeting  <br/>\nwith kids at least once or twice a week, it would help him if you  <br/>\nguys are rural enough to not have neighborhood children to play with.<br/>\n<br/>\nI would suggest, that if you want to unschool, you really fill the  <br/>\ndays with interesting things, at least to begin with! Lot&#39;s of field  <br/>\ntrips (we started off with going to the lake every Monday, the  <br/>\nlibrary every Tuesday, the zoo, science museum, history museum, just  <br/>\nLOTS of fun stuff to do, and a routine to visit since my son loved  <br/>\nthe routine of school, predictability and all) Hit up families one at  <br/>\na time to find good times to meet up. If they have classes/coops,  <br/>\netc, be willing to say, we&#39;ll meet whenever you are free. Or ask if  <br/>\nyou can tag along for a day. Usually big families are open to that,  <br/>\nand your son will have a chance to meet people and perhaps find a new  <br/>\ninterest. We do a lot of classes at the zoo and museum, and the kids  <br/>\nlove them and love seeing other homeschooled people. The classes are  <br/>\ngenerally more laid back, and open.<br/>\n<br/>\nOh, and be sure to help out with the sister. Sometimes little sisters  <br/>\ndo get in the way of our plans ;-) But over time, he&#39;ll develop a  <br/>\nbetter relationship with her, and it&#39;ll get better.<br/>\n<br/>\nMelissa<br/>\nMom to Joshua, Breanna, Emily, Rachel, Samuel, Daniel, Avari, and  <br/>\nbaby Nathan!<br/>\nWife to Zane<br/>\n<br/>\nblog me at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives.blogspot.com/\">http://startlinglives.blogspot.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives365.blogspot.com\">http://startlinglives365.blogspot.com</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On May 19, 2009, at 11:53 AM, Mary Hatfield wrote:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I immediately started to seek out other home school groups in our  <br/>\n&gt; area, but was unsuccessful. I am in a neighborhood surrounded by  <br/>\n&gt; home schoolers, and a number of families home school for religious  <br/>\n&gt; reasons in our county. I thought it would be a breeze to hook up  <br/>\n&gt; with other home schoolers, but unfortunately that was not the case.  <br/>\n&gt; Many of them told me that they were too busy with large families,  <br/>\n&gt; lessons, co-ops, etc to really do a home school group. I did school  <br/>\n&gt; at home until I couldn&#39;t stand it and we followed my son&#39;s  <br/>\n&gt; interests. The problem was always the socialization part. He wanted  <br/>\n&gt; friends, but I could not provide them. He had friends from his  <br/>\n&gt; previous school over on weekends, but I could not do anything  <br/>\n&gt; during the week. I also had a one year old at the time, which made  <br/>\n&gt; it harder to get out, but I still tried. He seemed very lonely and  <br/>\n&gt; sad that he did not have friends around his own age. I convinced  <br/>\n&gt; him to give our home school a chance for this year.<br/>\n&gt;<br/>\n&gt; I would like to home school Thomas after this school year as I have  <br/>\n&gt; seen a number of problems with school this year. Things stared out  <br/>\n&gt; wonderfully, then went down hill mid year. He is well behaved, but  <br/>\n&gt; is special needs in a mainstream classroom. He is considered too  <br/>\n&gt; high functioning to be with other autistic and special needs  <br/>\n&gt; students. He comes home with worksheets not done, and little notes  <br/>\n&gt; asking us to complete them at home. He starts to cry when I pull  <br/>\n&gt; out these worksheets to be completed. He tells me he does not  <br/>\n&gt; understand assignments and calls himself stupid. Bullying started  <br/>\n&gt; up again in January. The school and I are in constant communication/ <br/>\n&gt; IEP meetings about these issues, but the problems are still there.  <br/>\n&gt; He makes up various reasons not to attend school, and I allow him  <br/>\n&gt; to stay home. When I ask him about home schooling again, he tells  <br/>\n&gt; me he wants to go to school and home school. He tells me school is  <br/>\n&gt; boring, but his sister gets on his nerves and he will miss his  <br/>\n&gt; school friends.<br/>\n&gt;<br/>\n&gt; Is my eight year old capable of making this type of decision? Does  <br/>\n&gt; anyone else in the group have problem finding friends for their  <br/>\n&gt; children, and if so, how do you address that? We are in Southern  <br/>\n&gt; Maryland which is s fairly rural area, but does present some great  <br/>\n&gt; opportunities for learning. Will he gradually get use to not having  <br/>\n&gt; people his age around him.<br/>\n&gt;<br/>\n&gt; Thank you for your time and input,<br/>\n&gt; Mary<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":209361242,"authorName":"JJ Ross","from":"&quot;JJ Ross&quot; &lt;jrossedd@...&gt;","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Decision to Home School next  year- Long email","postDate":"1242913456","msgId":40246,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd2M2xyZytzY3IzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd2MjduNCtvYnJiQGVHcm91cHMuY29tPg=="},"prevInTopic":40242,"nextInTopic":40247,"prevInTime":40245,"nextInTime":40247,"topicId":40222,"numMessagesInTopic":0,"msgSnippet":"We aren t fond of socializing for its own sake and find it blessed relief not to be in big groups of people, even homeschool groups. When the kids were little,","messageBody":"<div id=\"ygrps-yiv-2032089158\">We aren&#39;t fond of socializing for its own sake and find it blessed relief not to be in big groups of people, even homeschool groups. When the kids were little, we tried all sorts of cattle call family activities where the main point was just being in a big group of kids on schedule, from birthday parties and field trips to park day and those contrived church-schooly &quot;learning circles&quot; and for us, it was wearying and pointless -- <br/>\n<br/>\nAlso we live in a neighborhood of older retired golfers, who apparently have no grandchildren to visit!  :)<br/>\n<br/>\nSo our kids found real friends (and both of DD&#39;s boyfriends) by doing what they love, in natural groups of other people who love those same things. <br/>\n<br/>\nWhat&#39;s funny about approaching it this way and not seeking out unschoolers, is how often it turned out the people of all ages they met were, if not unschoolers, at least alternative learners and thinkers.  Fascinating quirky potential friends were everywhere in the groups my kids were drawn to: musical theatre, video and game communities, Irish step-dancing, kilt-wearing bagpipers, poetry lovers. <br/>\n<br/>\nDD at age 9 made her first good friend independent of family acquaintance in a chef class for young teens, offered weekly through a neighborhood gourmet kitchen shop. By then we had long since stopped &quot;looking&quot; for other homeschoolers and we weren&#39;t doing anything homeschool-specific, but a shy guy cooking alongside her turned out to be virtual-homeschooling alone with a working mom; this was the only activity outside the home she could afford for him, because it was his sole dream to become a chef. Nick is in his early 20s now, they remain platonic phone friends and DD&#39;s the one he invited to sit with his mother at his first restaurant opening as chef.  :)<br/>\n<br/>\n<br/>\nJJ <br/>\n<br/>\n-- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Meredith&quot; &lt;meredith@...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Mary  Hatfield&quot; &lt;mhmarah@&gt; wrote:<br/>\n&gt; &gt;Does anyone else in the group have problem finding friends for their children, and if so, how do you address that? <br/>\n&gt; *********************<br/>\n&gt; <br/>\n&gt; When my kids were younger, I told absolutely everyone we homeschooled - I made a few contacts that way, other homeschoolers and at-home moms with younger kids. I&#39;ve tried a variety of homeschool groups, the best one being over an hour&#39;s drive a way. Oh, plus unschooling conferences and campouts - those are fantastic. <br/>\n&gt; <br/>\n&gt; It has also helped a lot to step away from the idea that my kids need friends who are close to them in age. Both my kids have adult friends - adults who share some interests with them and enjoy their company. <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Decision to Home School next  year- Long email","postDate":"1242866212","msgId":40242,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd2MjduNCtvYnJiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd1dW81dis1cW91QGVHcm91cHMuY29tPg=="},"prevInTopic":40231,"nextInTopic":40246,"prevInTime":40241,"nextInTime":40243,"topicId":40222,"numMessagesInTopic":0,"msgSnippet":"... ********************* When my kids were younger, I told absolutely everyone we homeschooled - I made a few contacts that way, other homeschoolers and","messageBody":"<div id=\"ygrps-yiv-812833556\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Mary  Hatfield&quot; &lt;mhmarah@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Does anyone else in the group have problem finding friends for their children, and if so, how do you address that? <br/>\n </span></blockquote>*********************<br/>\n<br/>\nWhen my kids were younger, I told absolutely everyone we homeschooled - I made a few contacts that way, other homeschoolers and at-home moms with younger kids. I&#39;ve tried a variety of homeschool groups, the best one being over an hour&#39;s drive a way. Oh, plus unschooling conferences and campouts - those are fantastic. <br/>\n<br/>\nIt has also helped a lot to step away from the idea that my kids need friends who are close to them in age. Both my kids have adult friends - adults who share some interests with them and enjoy their company. <br/>\n<br/>\nSomething else to consider is how social are you with him? Do you spend a lot of time playing and hanging out with him? Find things for the two (or three) or you to do together regularly? If he&#39;s pretty social, he needs that - needs you to socialize with him A Lot. Not as a homeschool mom teaching her son, but as a buddy. Ray had huge social needs when he was younger, and virtually no kid-friends for awhile - and didn&#39;t have the skills to play with other kids much, anyway. So my partner and I worked to meet his social needs ourselves. It takes some practice to play with a child as friend rather than a &quot;teacher&quot; but it makes a big difference to the child.<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":231930081,"authorName":"DJ250","from":"&quot;DJ250&quot; &lt;dj250@...&gt;","profile":"wibberbie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Decision to Home School next  year- Long email","postDate":"1242824726","msgId":40231,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYzRTIwODA1Q0RDNTQxOTY5MEQ5NTZFQjQ5M0JCODlFQFJvY2tldFNhdWNlMj4=","inReplyToHeader":"PGd1dW81dis1cW91QGVHcm91cHMuY29tPg==","referencesHeader":"PGd1dW81dis1cW91QGVHcm91cHMuY29tPg=="},"prevInTopic":40222,"nextInTopic":40242,"prevInTime":40230,"nextInTime":40232,"topicId":40222,"numMessagesInTopic":0,"msgSnippet":"Mary, a group of us unschoolers meets a bit further north of you once a month.  We alternate between Odenton and Catonsville.  Email me offlist if you d like","messageBody":"<div id=\"ygrps-yiv-292773048\">Mary, a group of us unschoolers meets a bit further north of you once a month.  We alternate between Odenton and Catonsville.  Email me offlist if you&#39;d like to come to our next meeting which is the 30th and will be in Odenton.  Anyone else interested can do so as well!  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dj250@...\">dj250@...</a> <br/>\n<br/>\n~Melissa, in MD :)<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Mary Hatfield <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Tuesday, May 19, 2009 12:53 PM<br/>\n  Subject: [unschoolingbasics] Decision to Home School next year- Long email<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  I am sincerely looking for the group&#39;s opinions and experiences in helping me make this decision. Please know that when I make important decisions I try to seek as much information as possible by looking at the perspectives and experiences of other. That being said, I will try to present our situation as best as possible. <br/>\n<br/>\n  I am looking to home school my 8 year son Thomas for the following school year. Technically he would be in the second grade. I home schooled him a year ago after having to pull him out of a charter school in the middle of the year. After several meetings with his then kindergarten teacher at a small private church school,our home school and the new charter school, it was decided that Thomas would greatly benefit in being in a small classroom in a kindergarten/ 1st grade setting. Thomas was also in the process of testing for autism through Kennedy Krieger in Baltimore. In the middle of the school year Thomas he was diagnosed with Asperger&#39;s Syndrome. I believe that Thomas was tested pretty late for autism as he had other medical factors. I put him in a new charter school which turned out to be a great disappointment. They dropped the kinder/1st grade program one week before school started and put in a 1st and 2nd instead. We moved him to kinder where he was so far ahead that he was bored and upset that he was in a younger grade. <br/>\n<br/>\n  I immediately started to seek out other home school groups in our area, but was unsuccessful. I am in a neighborhood surrounded by home schoolers, and a number of families home school for religious reasons in our county. I thought it would be a breeze to hook up with other home schoolers, but unfortunately that was not the case. Many of them told me that they were too busy with large families, lessons, co-ops, etc to really do a home school group. I did school at home until I couldn&#39;t stand it and we followed my son&#39;s interests. The problem was always the socialization part. He wanted friends, but I could not provide them. He had friends from his previous school over on weekends, but I could not do anything during the week. I also had a one year old at the time, which made it harder to get out, but I still tried. He seemed very lonely and sad that he did not have friends around his own age. I convinced him to give our home school a chance for this year. <br/>\n<br/>\n  I would like to home school Thomas after this school year as I have seen a number of problems with school this year. Things stared out wonderfully, then went down hill mid year. He is well behaved, but is special needs in a mainstream classroom. He is considered too high functioning to be with other autistic and special needs students. He comes home with worksheets not done, and little notes asking us to complete them at home. He starts to cry when I pull out these worksheets to be completed. He tells me he does not understand assignments and calls himself stupid. Bullying started up again in January. The school and I are in constant communication/IEP meetings about these issues, but the problems are still there. He makes up various reasons not to attend school, and I allow him to stay home. When I ask him about home schooling again, he tells me he wants to go to school and home school. He tells me school is boring, but his sister gets on his nerves and he will miss his school friends. <br/>\n<br/>\n  Is my eight year old capable of making this type of decision? Does anyone else in the group have problem finding friends for their children, and if so, how do you address that? We are in Southern Maryland which is s fairly rural area, but does present some great opportunities for learning. Will he gradually get use to not having people his age around him.<br/>\n<br/>\n  Thank you for your time and input,<br/>\n  Mary <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\n<br/>\n  No virus found in this incoming message.<br/>\n  Checked by AVG - www.avg.com <br/>\n  Version: 8.5.339 / Virus Database: 270.12.34/2122 - Release Date: 05/19/09 06:21:00<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":341403472,"authorName":"Mary  Hatfield","from":"&quot;Mary  Hatfield&quot; &lt;mhmarah@...&gt;","profile":"mhmarah","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Decision to Home School next  year- Long email","postDate":"1242751999","msgId":40222,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1dW81dis1cW91QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":40231,"prevInTime":40221,"nextInTime":40223,"topicId":40222,"numMessagesInTopic":0,"msgSnippet":"I am sincerely looking for the group s opinions and experiences in helping me make this decision.  Please know that when I make important decisions I try to","messageBody":"<div id=\"ygrps-yiv-1399258799\">I am sincerely looking for the group&#39;s opinions and experiences in helping me make this decision.  Please know that when I make important decisions I try to seek as much information as possible by looking at the perspectives and experiences of other.  That being said, I will try to present our situation as best as possible.  <br/>\n<br/>\nI am looking to home school my 8 year son Thomas for the following school year.  Technically he would be in the second grade.  I home schooled him a year ago after having to pull him out of a charter school in the middle of the year.  After several meetings with his then kindergarten teacher at a small private church school,our home school and the new charter school, it was decided that Thomas would greatly benefit in being in a small classroom in a kindergarten/ 1st grade setting.  Thomas was also in the process of testing for autism through Kennedy Krieger in Baltimore.  In the middle of the school year Thomas he was diagnosed with Asperger&#39;s Syndrome.  I believe that Thomas was tested pretty late for autism as he had other medical factors.  I put him in a new  charter school which turned out to be a great disappointment.  They dropped the kinder/1st grade program one week before school started and put in a 1st and 2nd instead.  We moved him to kinder where he was so far ahead that he was bored and upset that he was in a younger grade. <br/>\n<br/>\n  I immediately started to seek out other home school groups in our area, but was unsuccessful.  I am in a neighborhood surrounded by home schoolers, and a number of families home school for religious reasons in our county.  I thought it would be a breeze to hook up with other home schoolers, but unfortunately that was not the case.  Many of them told me that they were too busy with large families, lessons, co-ops, etc to really do a home school group.  I did school at home until I couldn&#39;t stand it and we followed my son&#39;s interests.  The problem was always the socialization part.  He wanted friends, but I could not provide them.  He had friends from his previous school over on weekends, but I could not do anything during the week. I also had a one year old at the time, which made it harder to get out, but I still tried.  He seemed very lonely and sad that he did not have friends around his own age.  I convinced him to give our home school a chance for this year. <br/>\n<br/>\nI would like to home school Thomas after this school year as I have seen a number of problems with school this year.  Things stared out wonderfully, then went down hill mid year.  He is well behaved, but is special needs in a mainstream classroom.  He is considered too high functioning to be with other autistic  and special needs students. He comes home with worksheets not done, and little notes asking us to complete them at home. He starts to cry when I pull out these worksheets to be completed.  He tells me he does not understand assignments and calls himself stupid.  Bullying started up again in January.   The school and I are in constant communication/IEP meetings about these issues, but the problems are still there.  He makes up various reasons not to attend school, and I allow him to stay home.  When I ask him about home schooling again, he tells me he wants to go to school and home school.  He tells me school is boring, but his sister gets on his nerves and he will miss his school friends.  <br/>\n<br/>\nIs my eight year old capable of making this type of decision?  Does anyone else in the group have problem finding friends for their children, and if so, how do you address that?   We are in Southern Maryland which is s fairly rural area, but does present some great opportunities for learning.  Will he gradually get use to not having people his age around him.<br/>\n<br/>\nThank you for your time and input,<br/>\nMary</div>","specialLinks":[]}],"prevTopicId":40214,"nextTopicId":8571}}