{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Is this more than sibling rivalry?","postDate":"1244841637","msgId":40444,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgwdWdyNSt0MDFyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGgwcG04Nis5czJrQGVHcm91cHMuY29tPg=="},"prevInTopic":40440,"nextInTopic":0,"prevInTime":40443,"nextInTime":40445,"topicId":40428,"numMessagesInTopic":0,"msgSnippet":"... ********************* Could be. Would she rather be home (sorry I m forgetting details of your life!)? If so, why *wouldn t* she be jealous of her sister?","messageBody":"<div id=\"ygrps-yiv-1172527873\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;jennifercroce37&quot; &lt;jennifercroce37@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I think some of her resentment is related to the fact that she goes to school while her sister is at home with me.<br/>\n </span></blockquote>*********************<br/>\n<br/>\nCould be. Would she rather be home (sorry I&#39;m forgetting details of your life!)? If so, why *wouldn&#39;t* she be jealous of her sister? Beyond that, it sounds as though she needs some reassurance that she&#39;s still just as much &quot;your baby&quot; as the younger. Make an active effort to be sweet and kind and complimentary to her! <br/>\n<br/>\nWhen Ray first came out of school he needed not just reassurance, but some appologies - we were raising Mo very differently from the way we had him at the same age! I didn&#39;t make a huge deal out of it, but any time the matter would come up in conversation (you never let Me do that) I&#39;d appologise with no &quot;buts&quot; attatched: &quot;yes, I&#39;m sorry, I&#39;ve learned a lot since then&quot; rather than &quot;I&#39;m sorry But I was doing the best I could&quot; if you see what I mean. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I feel that I give my older daughter a lot of positive attention, but it never feels like it is enough.<br/>\n </span></blockquote>************************<br/>\n<br/>\nSome kids have bigger emotional needs in general. If your dd is in school, though, that&#39;s going to sap her emotions on a daily basis - even if she enjoys it (like I said, I don&#39;t remember!). Its a stressful place to be on a *good* day and she&#39;ll be getting, at best, minimal adult attention. So lavish her with love - as much as you possibly can right now. Give her plenty of whatever kinds of affection speak best to her heart. Do you know the idea of Love Languages? Here&#39;s a link with the basic concepts (sorry, you&#39;ll have to cut and paste):<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mc.maricopa.edu/dept/d46/psy/dev/Spring99/schoolage/love.html\">http://www.mc.maricopa.edu/dept/d46/psy/dev/Spring99/schoolage/love.html</a><br/>\n<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":301158115,"authorName":"amberlee_b","from":"&quot;amberlee_b&quot; &lt;amberlee16@...&gt;","profile":"amberlee_b","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Is this more than sibling rivalry?","postDate":"1244750998","msgId":40440,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgwcm9hbSsxMDExbkBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PGgwcG04Nis5czJrQGVHcm91cHMuY29tPg=="},"prevInTopic":40438,"nextInTopic":40444,"prevInTime":40439,"nextInTime":40441,"topicId":40428,"numMessagesInTopic":0,"msgSnippet":"I have a couple suggestions/ideas....they may sound odd, but they may not.  One thing we did, our son created it, was a mailbox .  It is a posterboard with a","messageBody":"<div id=\"ygrps-yiv-784994236\">I have a couple suggestions/ideas....they may sound odd, but they may not.  One thing we did, our son created it, was a &quot;mailbox&quot;.  It is a posterboard with a business size envelope for each family member on it.  In the center envelope are scratch papers and a pencil (sometimes, usually pencils and pens walk away...) and we can write each other quick love or thank you notes.  It doesn&#39;t always get used, but it is fun!<br/>\n<br/>\nSome kids may hear you complimenting other members of the family and forget or not remember you said something to them as well.  Maybe she needs to SEE the sentiments and not just hear them?  You also said she was going to school, so she may see that as an issue as well, hopefully unschooling will alleviate that situation.  I worked really hard when my kids were little to &quot;catch them being good&quot; so to speak.  When I noticed they asked to borrow a siblings toy or helped the other up when they fell I would say something.  Then ignore the junk behavior (leaving laundry strewn about, whining, saying things that would noramally make you cringe or yell)....always focus on the positive.  <br/>\n<br/>\nIf you are doing the praise of the younger child in front of the older child, maybe get into practice of saying things to them privately.  She is used to PS where the goal is to embarrass and make other children feel less than the one being praised (all for the goal of attempting to get the other children to comply....).  That could be why you see that reaction to your positive praise of the younger child.<br/>\n<br/>\nAnother thing we have done is at the dinner table.  We try to eat dinner together and when we do we give each person a chance to talk about their day.  They can talk about something cool they did, figured out, &quot;learned&quot;, or their feelings when certain things happened.  They get to express themselves.  Sometimes we go around the table and give gratitude for 5 things....or say why we love each other--what we are thankful for about each other.  No one has to do this, but it is there if the want to.<br/>\n<br/>\nI don&#39;t know if any of this will help, or if they will want to try any of it.  If so, great!  <br/>\nHuggs,<br/>\nAmberlee<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;jennifercroce37&quot; &lt;jennifercroce37@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I am noticing that when I compliment my younger daughter my older daughter gets very jealous and upset and will immediately want me to say something positive about her.  I don&#39;t know if this is regular sibling rivalry or something deeper.  I feel that I give my older daughter a lot of positive attention, but it never feels like it is enough.  I think some of her resentment is related to the fact that she goes to school while her sister is at home with me.  I hope that homeschooling/unschooling will help alleviate some of these feelings.  Has anyone experienced this behavior between siblings?  How do you help each child feel special and important when they are very different.<br/>\n&gt; <br/>\n&gt; Thanks,<br/>\n&gt; Jen<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Is this more than sibling rivalry?","postDate":"1244744848","msgId":40438,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkwNjExMTEyN242NmMxMmEwZW1iYTcwODE2MTZjYTAzNjBmQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGgwcG04Nis5czJrQGVHcm91cHMuY29tPg==","referencesHeader":"PGgwcG04Nis5czJrQGVHcm91cHMuY29tPg=="},"prevInTopic":40428,"nextInTopic":40440,"prevInTime":40437,"nextInTime":40439,"topicId":40428,"numMessagesInTopic":0,"msgSnippet":"I didn t see any response to this. I have been unavailable lately. Better better late than never :-) OP: I am noticing that when I compliment my younger","messageBody":"<div id=\"ygrps-yiv-74413842\">I didn&#39;t see any response to this. I have been unavailable lately. Better<br/>\nbetter late than never :-)<br/>\n<br/>\nOP: I am noticing that when I compliment my younger daughter my older<br/>\ndaughter gets very jealous and upset and will immediately want me to say<br/>\nsomething positive about her.<br/>\n<br/>\n***If this really seems to be true than try to be proactive. Compliment the<br/>\nolder daughter a lot. Try to change the quality of your compliments to be<br/>\nless of a rewards as an acknowledgment. Give her back her power that was<br/>\nlikely taken away in school. She doesn&#39;t need to please you. Rather than say<br/>\n&quot;Oh that&#39;s a pretty picture.&quot; say &quot;I really like the way you put that green<br/>\nand orange together. I would have never thought of that color combination.&quot;<br/>\nAcknowledge her frequently in this area. Make is about her instead of a<br/>\njealousy issue. Kids get jealous sometimes. She is feeling jealous, what is<br/>\nthe need behind that? What can you do to fill that need?<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\nOP: I don&#39;t know if this is regular sibling rivalry or something deeper.<br/>\n<br/>\n***Does is really matter? I made the mistake of worrying too deeply and<br/>\nexamining everything. It sets you off course. Be with her right now, where<br/>\nshe is.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-==-=-=<br/>\n<br/>\nOP: I feel that I give my older daughter a lot of positive attention, but it<br/>\nnever feels like it is enough.<br/>\n<br/>\n***It might not be right now. Keep giving, give, give, give. She might feel<br/>\nvery empty. Can you step into her life mentally and see why she might feel<br/>\nthat way? Can you see what she might need? You can ask her too but she may<br/>\nnot know. She may just need time to heal.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\nOP: I think some of her resentment is related to the fact that she goes to<br/>\nschool while her sister is at home with me. I hope that<br/>\nhomeschooling/unschooling will help alleviate some of these feelings. Has<br/>\nanyone experienced this behavior between siblings? How do you help each<br/>\nchild feel special and important when they are very different.<br/>\n<br/>\n***Each child is different. I have three. I don&#39;t treat them the same or try<br/>\nto make it all fair. I am conscious of what each needs and I give<br/>\naccordingly. Sometimes my 12 year old needs more than the baby. I give it or<br/>\nI find a way to help her get her needs met. I don&#39;t give out a hug to all of<br/>\nthem because one kids wants one (ok well I night but we aren&#39;t keeping score<br/>\n:-) If the oldest needs more give it. What is it going to hurt? She needs<br/>\nmore right now. Its like being hungry. If the older one is hungrier than the<br/>\nlittle one you don&#39;;t stop her from eating her fill.<br/>\n<br/>\nA little how it goes in our casa. I snuggle with ds6 every chance I can. He<br/>\ncraves touch and hugs, and kisses. He also loves to hear my say I love you<br/>\nand do our special hand sign for I love you. My dd12 would be annoyed if I<br/>\ndid it frequently for her. She needs to be snuggled and kissed and even<br/>\nwants to hear she is loved but not as much as ds. The baby still loves to<br/>\nnurse. The older ones don&#39;t so I don&#39;t even offer. I nurse the baby whenever<br/>\nshe wants even though I never nurse the other two anymore. The oldest loves<br/>\nto talk. I listen intently to everything she has to say. I ask questions and<br/>\ntry to remember as much as possible. Ds6 would be annoyed if I asked him<br/>\nquestions or pressured him in anyway to talk. He is a quieter kid. They each<br/>\nlove different things to when I am out I try to keep an eye out for<br/>\nsomething that one of they may love. I keep in mind that if I get something<br/>\nfor one of my dd&#39;s I need to get something for my ds6. He needs to recieve<br/>\nthe a present if his sisters do. He feels really left out if he gets<br/>\nnothing. I always make sure to pick up a little something if I find<br/>\nsomething for dds. It might be a bag of his favorite chips or a small toy.<br/>\nI hope this helps.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=--=-<br/>\n<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":336564039,"authorName":"jennifercroce37","from":"&quot;jennifercroce37&quot; &lt;jennifercroce37@...&gt;","profile":"jennifercroce37","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Is this more than sibling rivalry?","postDate":"1244683334","msgId":40428,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgwcG04Nis5czJrQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":40438,"prevInTime":40427,"nextInTime":40429,"topicId":40428,"numMessagesInTopic":0,"msgSnippet":"I am noticing that when I compliment my younger daughter my older daughter gets very jealous and upset and will immediately want me to say something positive","messageBody":"<div id=\"ygrps-yiv-621811400\">I am noticing that when I compliment my younger daughter my older daughter gets very jealous and upset and will immediately want me to say something positive about her.  I don&#39;t know if this is regular sibling rivalry or something deeper.  I feel that I give my older daughter a lot of positive attention, but it never feels like it is enough.  I think some of her resentment is related to the fact that she goes to school while her sister is at home with me.  I hope that homeschooling/unschooling will help alleviate some of these feelings.  Has anyone experienced this behavior between siblings?  How do you help each child feel special and important when they are very different.<br/>\n<br/>\nThanks,<br/>\nJen</div>","specialLinks":[]}],"prevTopicId":40432,"nextTopicId":40426}}