{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Arizona homeschooler","postDate":"1170425936","msgId":21169,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVwdmg4Zys1N25kQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwNmMwMWM3NDZjYyQzZjYwNThlMCQ2NDAyYThjMEBsYXVuY2htb2RlbS5jb20+"},"prevInTopic":21165,"nextInTopic":0,"prevInTime":21168,"nextInTime":21170,"topicId":21165,"numMessagesInTopic":0,"msgSnippet":"~~ I am afraid he will not WANT to  learn on his own and he has a grasp on reading but is not perfect at it yet and he knows how to add and subtract . he","messageBody":"<div id=\"ygrps-yiv-1049019928\">~~ I am afraid he will not WANT to  learn on his own and he has a<br/>\ngrasp on reading but is not perfect at it yet and <br/>\nhe knows how to add and subtract . he doesnt know nouns and verbs etc,~~<br/>\n<br/>\nOh my....there is no six year old on earth that needs to know any of<br/>\nthe above. I think 6 year olds might need to know how to dig in the<br/>\ndirt, or blow bubbles, or play a made-up game or climb a tree (or<br/>\nmaybe not, depending on the 6 year old)! But nouns and verbs? WHY??<br/>\nWhy does anyone really need to know that until they WANT to know it?<br/>\nReading perfectly at 6 is NOT &quot;normal&quot; or desirable. That&#39;s the school<br/>\nsystem convincing you it is, but that&#39;s not true.<br/>\n<br/>\nMy 13 year old learned to read fluently at age 12.5. He reads better<br/>\nthan my dd who learned to read around the &quot;typical&quot; age of 6. Reading<br/>\nhappens naturally if you trust that humans want to learn what they are<br/>\nsurrounded by. Same with math. Same with growing a garden or painting<br/>\na picture or any other activity a child might choose. People learn<br/>\nwhat they are INTERESTED in.<br/>\n<br/>\nIf he never wants to learn what a noun or verb are, I don&#39;t believe<br/>\nthat will hinder his success in life whatsover. Losing his passion and<br/>\nzeal for life and learning will definitely impact his life in a big way.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":193064123,"authorName":"Nance Confer","from":"&quot;Nance Confer&quot; &lt;marbleface@...&gt;","profile":"nanceconfer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Arizona homeschooler","postDate":"1170422144","msgId":21165,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNmMwMWM3NDZjYyQzZjYwNThlMCQ2NDAyYThjMEBsYXVuY2htb2RlbS5jb20+"},"prevInTopic":0,"nextInTopic":21169,"prevInTime":21164,"nextInTime":21166,"topicId":21165,"numMessagesInTopic":0,"msgSnippet":"So withdraw him from the academy and send your letter of intent. Then play. With them. Have fun. See where you are in a year. Jordan sounds like a wonderful","messageBody":"<div id=\"ygrps-yiv-794851461\">So withdraw him from the academy and send your letter of intent. <br/>\n<br/>\nThen play. With them. Have fun. See where you are in a year. <br/>\n<br/>\nJordan sounds like a wonderful kid who shouldn&#39;t have to put up with the dreck in a typical curriculum. (Should anyone?)<br/>\n<br/>\nBe brave, Mom! :)<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\nHi Every one I need help please, My son Jordan is 6 and I started &quot; Homeschooling &quot; him last year in kindergarten with arizona virtual academy an online charter school and im telling you it has really burned us both out , its so much stuff and he is creative and artistic and loves to do that stuff and I have been really researching and wanting to find a better way to teach my son school and i have a 4 year old too who I have been stressed about teaching him too. I really lvoe my kids and love having them home with me and believe in being their teacher very much and I have been reading so much about unschooling and it seems like a very good idea but I seem to have all the fears that i read about and I dont know where to start because Jordan is so turned off by school right now because of the online academy and both of us feeling pressured that I am afraid he will not WANT to learn on his own and he has a grasp on reading but is not perfect at it yet and he knows how to add<br/>\nand subtract . he doesnt know nouns and verbs etc, I just couldnt get him to understand that concept yet and I get worried he wont be smart as an adult but yet he is very smart and a wonderful artist , he loves to paint and draw pictures, he draws like 30 pictures a day because he loves it and he talks like an intelectual and he ahs this great personality , He also loves the cooking channel very much. so I was just really wanting some good advice from you all and hekp me know where to start and what to do. I know the arizona laws are pretty simple when it comes to home schooling , all i have to do is send an letter of intent to homeschool, which the virtual academy is not technicly homeschooling but all i knew to do as of last year, well thankyou I would love to hear feed back .<br/>\nthanks candy<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":21163,"nextTopicId":21168}}