{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:When/How to Give Scary Information","postDate":"1279044785","msgId":44526,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NkRGNEQ5QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":44521,"nextInTopic":44527,"prevInTime":44525,"nextInTime":44527,"topicId":44521,"numMessagesInTopic":0,"msgSnippet":"Oh BTW we ve also had lots of discussions of scary stuff for other reasons too: FIL was very sick for several months before he passed away a couple years ago","messageBody":"<div id=\"ygrps-yiv-959139908\">Oh BTW we&#39;ve also had lots of discussions of &#39;scary&#39; stuff for other<br/>\nreasons too: FIL was very sick for several months before he passed away<br/>\na couple years ago (including kidney dialysis - we went to visit when he<br/>\nwas hooked up to the dialysis machine and the nurse on duty was glad to<br/>\nshow us a cut away model of the filter and explain all the tubes and<br/>\nequipment); my dad had a heart attack and bypass surgery a few years<br/>\nago; my mom had yet another heart surgery last year; DH was hospitalized<br/>\nwith what they said was a TIA (mini stroke) a couple of years ago.<br/>\nThrough all of it, we made sure to take quiet times together to talk and<br/>\nask/answer questions, pull out the human body books and look up stuff,<br/>\nand so on. Funny: prior to my mom&#39;s surgery, they needed to do a cardiac<br/>\ncatheterization. So, I was explaining that to DS and he said &quot;Oh yeah, I<br/>\nsaw that on &#39;House&#39; one time...&quot; That made it much easier to explain -<br/>\nhe already knew what it looked like, being able to picture it took away<br/>\na lot of the scary unknown. <br/>\n<br/>\nInformation at a level that is appropriate and lots of space to be and<br/>\nthink and talk and ask.<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:When/How to Give Scary Information","postDate":"1279044350","msgId":44527,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1NkRGNEQ4QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":44526,"nextInTopic":0,"prevInTime":44526,"nextInTime":44528,"topicId":44521,"numMessagesInTopic":0,"msgSnippet":"Exactly (what you worked out as you wrote it out). Both DH and I have health issues. I work fulltime so DS (12) is home with DH while I m at work. In addition","messageBody":"<div id=\"ygrps-yiv-762849618\">Exactly (what you worked out as you wrote it out). Both DH and I have<br/>\nhealth issues. I work fulltime so DS (12) is home with DH while I&#39;m at<br/>\nwork. In addition to health issues (pre-existing stuff) there&#39;s all<br/>\nsorts of accidents that can happen - DH gets hurt mowing the lawn, for<br/>\nexample. We have explained, over time, in developmentally appropriate<br/>\nways, how to help should it be needed, where the first aid stuff is, how<br/>\nto contact first responders and me. For example, DS knows that if my<br/>\nblood sugar goes low, I need something quick sugary and he knows where<br/>\nthe glucose tablets are and what they look like (I always carry some<br/>\nwithin reach). There have been a couple times when I&#39;ve been home and<br/>\ntested (felt weird) and said &quot;My blood sugar is low&quot; and DS went and<br/>\nmixed up a quick half glass of chocolate milk (which is actually a good<br/>\noption). It was something he could do right then, without hunting for<br/>\nanything, just react. Knowing both sides of things: what the issues are<br/>\nAND what to do about them is important. Without the latter, the former<br/>\nis likely to be more scary.<br/>\n<br/>\nKnowing what to do, having information built in so that there&#39;s not even<br/>\nany thinking involved so much as reacting, has really helped DS (and all<br/>\nof us) to not be afraid. It&#39;s kind of the same way my mom instilled<br/>\ndefensive driving tactics in us as we learned to drive. It wasn&#39;t a<br/>\nlecture or &#39;scary&#39; thing - just tidbits as she was driving about how she<br/>\nkept her eyes out for &#39;what if&#39; situations so she could be ready. Came<br/>\nin handy too: I was driving on a two lane back road when the vehicle in<br/>\nfront of me slipped on ice and spun into an oncoming vehicle. My car<br/>\nstarted to slip and I automatically reacted, bringing my vehicle to a<br/>\nsafe stop without hitting anything. Can&#39;t say that I consciously<br/>\nremember what all I did, I just went into &#39;auto pilot&#39;. (I also sent my<br/>\nmom a bouquet of flowers that day as a thank you) Both DH and I have<br/>\nCPR/AED training and once DS is physically big enough to handle the<br/>\nphysical aspects of it, he&#39;ll have the opportunity to take the same<br/>\ntraining as well.<br/>\n<br/>\nI&#39;m sure that his dad, if he&#39;s an experienced hiker, has a properly<br/>\nstocked first aid kit in his gear. That might be another touch point to<br/>\ninclude - have him show Sean where the first aid kit is and how it&#39;s<br/>\nlaid out (band aids here, bug bite stuff here, and so on) and that would<br/>\nbe a perfect time for him to mention where he keeps his asthma meds as<br/>\nwell. That would be a good addendum to whatever information you provide<br/>\nfor him, kind of building a coherent whole of the information.<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":151505017,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;carenkh@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"When/How to Give Scary Information","postDate":"1278976121","msgId":44521,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkxZzc5cCs2MGcyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":44526,"prevInTime":44520,"nextInTime":44522,"topicId":44521,"numMessagesInTopic":0,"msgSnippet":"Seth, 11, is going hiking with his Dad for a few days in a couple of weeks. He s nervous about going - he s always declined before, when his Dad offered, but","messageBody":"<div id=\"ygrps-yiv-2019811354\">Seth, 11, is going hiking with his Dad for a few days in a couple of weeks. He&#39;s nervous about going - he&#39;s always declined before, when his Dad offered, but this time he said he wants to go. He&#39;s asked his Dad a couple of times if he&#39;s absolutely miserable, if they can leave. His Dad has assured him that, of course they&#39;ll leave, no problem.<br/>\n<br/>\nI woke in the middle of the night the other night with a fear popping up. His Dad has asthma, and he&#39;s had it well under control for years. It used to be a lot worse when I first met him. He told me of a time that he had gone hiking before we met when he had a terrible asthma attack, and very nearly died. He ended up in the hospital for close to a week. I don&#39;t remember the details - did he drive himself to the hospital? Was he hiking with someone else? I guess that&#39;s not important now. Anyway - my fear is that he will somehow get sick on this hike, and it will be just him & Seth. They&#39;re going to be out of cellphone range for a large part of the hike.<br/>\n<br/>\nI&#39;m wanting to give Seth information about what to do if something does happen to his Dad, but I don&#39;t want to freak him out! I can&#39;t think of how to bring it up. I realize I don&#39;t need to tell him about the other time his Dad got sick (just realized that in writing this, boy it helps to write stuff out!) and I can just present it as information. &quot;Hey, since you&#39;re going hiking, here&#39;s information you need.&quot;<br/>\n<br/>\nThat feels so unnatural when I write it out! &quot;Present information&quot;, etc. I guess my fear is getting in the way of our flow! A healthy friend recently died suddenly with a stroke; I think that&#39;s got my awareness on &quot;Anything can happen!&quot; His Dad is mostly healthy - but so was my friend. He had recently run the Boston Marathon!<br/>\n<br/>\nAll right, so in the flow of our conversation, I can bring it up - not even specifically about his Dad, just &quot;stuff you need to know when you go hiking&quot;.<br/>\n<br/>\nI think I&#39;ve mostly worked it out in this post, so thanks for being here! If you have additional thoughts or insights, let me know.<br/>\n<br/>\nThanks,<br/>\nCaren</div>","specialLinks":[]}],"prevTopicId":44511,"nextTopicId":44531}}