{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":46250780,"authorName":"denise","from":"&quot;denise&quot; &lt;de_perri@...&gt;","profile":"de_perri","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"something of interest...","postDate":"1121257944","msgId":5728,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRiMzFrbys0OG8wQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":5727,"nextInTime":5729,"topicId":5728,"numMessagesInTopic":0,"msgSnippet":"A move to lower school age to 6 Phila. s mandatory age for school now is 8. That s too late, educators say. By Susan Snyder Inquirer Staff Writer In","messageBody":"<div id=\"ygrps-yiv-1014898364\">A move to lower school age to 6<br/>\n<br/>\nPhila.&#39;s mandatory age for school now is 8. That&#39;s too late, educators say.<br/>\n<br/>\nBy Susan Snyder<br/>\n<br/>\nInquirer Staff Writer<br/>\n<br/>\n<br/>\n<br/>\nIn Pennsylvania, parents can wait until their children are 8 years old to begin school, but <br/>\nsome state lawmakers and educators say that&#39;s too late, especially in an academically <br/>\nstruggling school district such as Philadelphia&#39;s.<br/>\n<br/>\n<br/>\nSo the move is on to lower the compulsory school age in the city to 6.<br/>\n<br/>\n<br/>\nPaul Vallas, chief executive of Philadelphia schools, said the change not only would allow <br/>\nthe district to force lagging parents to enroll their children, but also would boost academic <br/>\nachievement and curb disciplinary problems caused by children placed out of their peer <br/>\ngroup.<br/>\n<br/>\n<br/>\n&quot;We&#39;re behind the eight ball before we even start,&quot; Vallas said. &quot;It leads to the phenomena <br/>\nof 17-year-old ninth graders.&quot;<br/>\n<br/>\n<br/>\nIn Philadelphia last September, nearly 20 percent, or 2,838, of the district&#39;s 14,678 first <br/>\ngraders were age 7 or 8, officials said. Up to a third of the older first graders repeated <br/>\nkindergarten or were repeating first grade; the others simply started school later, Vallas <br/>\nsaid.<br/>\n<br/>\n<br/>\nThe district did not have an estimate on how many of them previously attended <br/>\nkindergarten, which is not required in Pennsylvania.<br/>\n<br/>\n<br/>\nVallas said the late-starters face problems in their own learning and pose problems for <br/>\nothers. They tend to be less academically prepared, are more likely to become disciplinary <br/>\nproblems, and eventually are at greater risk of dropping out, he said.<br/>\n<br/>\n<br/>\n&quot;The older the kids get, the more self-conscious they become about themselves and the <br/>\ndifferences between themselves and their classmates,&quot; he said. &quot;These are the children <br/>\nwho are most likely to become disruptive and become the bullies.&quot;<br/>\n<br/>\n<br/>\nThe state House of Representatives voted 102-97 last month for the change in the city&#39;s <br/>\ncompulsory school age. The bill has moved to the Senate for consideration.<br/>\n<br/>\n<br/>\nThe bill specifies that students must be enrolled in school at age 6. Enrollment in either <br/>\nkindergarten or first grade would comply, though Vallas said he would push for first grade <br/>\nat that age.<br/>\n<br/>\n<br/>\nState Rep. James R. Roebuck Jr. (D., Phila.), chairman of the House Education Committee <br/>\nand the prime mover behind the bill, said he wants to get the Philadelphia provision in <br/>\nplace by the end of this year and in effect for the 2006-07 school year.<br/>\n<br/>\n<br/>\nSome have advocated that the age change be extended throughout the state. Pennsylvania <br/>\nis one of only two states - Washington is the other - that allow parents to register their <br/>\nchildren at age 8.<br/>\n<br/>\n<br/>\nOpposition, however, is significant, with concerns that a change in the law - which dates <br/>\nto when children worked on farms and elsewhere to help support their families - usurps <br/>\nparental rights.<br/>\n<br/>\n<br/>\nState Rep. Patrick Elvin Fleagle (R., Franklin) opposed the move in the House.<br/>\n<br/>\n<br/>\n&quot;We have, in education as well as a lot of other areas of government, played Big Brother,&quot; <br/>\nsaid Fleagle, who is on the Education Committee. &quot;We should be going in the other <br/>\ndirection in making parents more responsible for those types of decisions.&quot;<br/>\n<br/>\n<br/>\nVallas said the district would launch a campaign to make parents aware of the change if <br/>\nthe bill passes.<br/>\n<br/>\n<br/>\nHe said some of the parents who start their children later are &quot;the less experienced <br/>\nparents... who are overwhelmed with day-to-day things.&quot; He also acknowledged that some <br/>\nof the parents may be recent immigrants to the United States whose children are older <br/>\nwhen they arrive. There are some parents who have elected to keep their children out of <br/>\nschool until later because they felt the children were not ready yet.<br/>\n<br/>\n<br/>\nThe bill exempts home-schoolers, but some of them expressed concern, wondering <br/>\nwhether it would lead to further intrusion later. Candy Kennedy, of the Pennsylvania Home <br/>\nEducation Network, said there must be better ways to get parents to send their children to <br/>\nschool earlier, such as educating them about the need to do so.<br/>\n<br/>\n<br/>\nSeveral districts outside Philadelphia said few of their students would be affected if a <br/>\nstatewide law were enacted.<br/>\n<br/>\n<br/>\n&quot;Most parents have their child in school by age 6 already,&quot; said Lou DeVlieger, assistant <br/>\nsuperintendent in the Upper Darby School District in Delaware County.<br/>\n<br/>\n<br/>\nIn Pittsburgh, with 33,000 students the second-largest district in the state, officials <br/>\nestimated that fewer than 10 students a year are enrolled later than age 6.<br/>\n<br/>\n<br/>\nBut Kaye Cupples, executive director for student support services, still would welcome a <br/>\nlower attendance age. &quot;It&#39;s not unusual to find that those students enrolling late are the <br/>\nones we really needed to have when they were 4 or 5,&quot; he said.<br/>\n<br/>\n<br/>\nContact staff writer Susan Snyder at 215-854-4693 or <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ssnyder@...\">ssnyder@...</a></div>","specialLinks":[]}],"prevTopicId":5715,"nextTopicId":5734}}