{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":96545052,"authorName":"marji","from":"marji &lt;marji@...&gt;","profile":"gaia10921","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] no peace in my home!","postDate":"1153323518","msgId":15870,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcuMC4xLjAuMC4yMDA2MDcxOTExMzYxNS4wMWNjNzAzOEBnYWlhd29sZi5vcmc+","inReplyToHeader":"PDUuMi4xLjEuMi4yMDA2MDcxOTA5MTA0OS4wMWNmOGQzMEBpbmNvbWluZy52ZXJpem9uLm5ldD4=","referencesHeader":"PDUuMi4xLjEuMi4yMDA2MDcxNjIxMjQxMS4wMGJjZjhmOEBpbmNvbWluZy52ZXJpem9uLm5ldD4gPDUuMi4xLjEuMi4yMDA2MDcxNjIxMjQxMS4wMGJjZjhmOEBpbmNvbWluZy52ZXJpem9uLm5ldD4gPDUuMi4xLjEuMi4yMDA2MDcxOTA5MTA0OS4wMWNmOGQzMEBpbmNvbWluZy52ZXJpem9uLm5ldD4="},"prevInTopic":15863,"nextInTopic":0,"prevInTime":15869,"nextInTime":15871,"topicId":15804,"numMessagesInTopic":0,"msgSnippet":"... Well, this really choked me up!!!  Your whole post is so sweet.  I have a feeling things are going to get onto a wonderful new track for you and your kids!","messageBody":"<div id=\"ygrps-yiv-23360239\">At 10:11 7/19/2006, you wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;That makes so much sense. I hope I can learn to be as kind as you are.<br/>\n&gt;Yesterday he started getting wild and I was able to get his attention like<br/>\n&gt;you suggested and it went very well! I explained to him that I WAS helping<br/>\n&gt;him get what he wanted, I think he thought I was ignoring him or pushing<br/>\n&gt;his needs to the back of the list. Once he realized that what I was doing<br/>\n&gt;was clearing a space for his things, he was a changed child!<br/>\n<br/>\n </span></blockquote>Well, this really choked me up!!!  Your whole post is so sweet.  I <br/>\nhave a feeling things are going to get onto a wonderful new track for <br/>\nyou and your kids!<br/>\n<br/>\n~Marji <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":205659962,"authorName":"Anne B","from":"Anne B &lt;kbarnett3@...&gt;","profile":"novax4us","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] no peace in my home!","postDate":"1153318286","msgId":15863,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMi4xLjEuMi4yMDA2MDcxOTA5MTA0OS4wMWNmOGQzMEBpbmNvbWluZy52ZXJpem9uLm5ldD4=","inReplyToHeader":"PEEwMTdDREM3LThFNzgtNDBBNi05RjkwLURBN0UyQ0Y4RDI2RkBlYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PDUuMi4xLjEuMi4yMDA2MDcxNjIxMjQxMS4wMGJjZjhmOEBpbmNvbWluZy52ZXJpem9uLm5ldD4gPDUuMi4xLjEuMi4yMDA2MDcxNjIxMjQxMS4wMGJjZjhmOEBpbmNvbWluZy52ZXJpem9uLm5ldD4="},"prevInTopic":15833,"nextInTopic":15870,"prevInTime":15862,"nextInTime":15864,"topicId":15804,"numMessagesInTopic":0,"msgSnippet":"Wow, Joyce. You really make a lot of sense! ... Yes that does help me change my view of the situation. ... That makes so much sense. I hope I can learn to be","messageBody":"<div id=\"ygrps-yiv-1337143638\">Wow, Joyce. You really make a lot of sense!<br/>\n<br/>\nAt 10:40 AM 7/18/2006 -0400, you wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;That doesn&#39;t help solve it, but maybe help you look at him<br/>\n&gt;differently so you can try something new.<br/>\n<br/>\n </span></blockquote>Yes that does help me change my view of the situation.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Now let&#39;s go out and figure out what you want and how I can<br/>\n&gt;help you. What would you like for a snack while we figure that<br/>\n&gt;out.&quot; (Or something to that effect. Don&#39;t turn *him* into the<br/>\n&gt;problem. Get back to the original problem that began the downward<br/>\n&gt;spiral.<br/>\n<br/>\n </span></blockquote>That makes so much sense. I hope I can learn to be as kind as you are. <br/>\nYesterday he started getting wild and I was able to get his attention like <br/>\nyou suggested and it went very well!  I explained to him that I WAS helping <br/>\nhim get what he wanted, I think he thought I was ignoring him or pushing <br/>\nhis needs to the back of the list. Once he realized that what I was doing <br/>\nwas clearing a space for his things, he was a changed child!<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Maybe what he wanted was for you to play with the train with him.<br/>\n<br/>\n </span></blockquote>THat is very likely, in hind sight, though he never verbalized <br/>\nit.  Yesterday after I cleared a space for him and got the set out, I asked <br/>\nhim to please let me know if he needed help finding any parts.  I ended up <br/>\nsitting down with him for awhile and he loved it.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Could you find a way to spend some time with just him alone?<br/>\n<br/>\n </span></blockquote>I think that is a great idea, though at this point baby has to come too.  I <br/>\nam definitely going to work on that idea.  If we can sneak out without the <br/>\nother two kids knowing. however, they&#39;ll be upset when they find out.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;But what you&#39;re doing now isn&#39;t getting you a loving relationship<br/>\n&gt;either.<br/>\n<br/>\n </span></blockquote>very true.  it always feels like there is a battle going on between he and <br/>\nmyself.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;*Maybe* what you&#39;ve done is focus on your role of what you &quot;have to<br/>\n&gt;do&quot; to raise a family. Maybe your top priority is the things you have<br/>\n&gt;to do: clean, laundry, shop, tend to the baby. Do you find yourself<br/>\n&gt;regularly saying no to children&#39;s requests to do something because<br/>\n&gt;there&#39;s things you have to do?<br/>\n<br/>\n </span></blockquote>Oh yes.  You have hit the nail on the head.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Or have they learned not to ask  because they know that&#39;s your answer?<br/>\n<br/>\n </span></blockquote>maybe so! maybe that is why they go and do the things they do!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Do they feel that if they ask  you to do something for them that you will <br/>\n&gt;put it at the top of your  list?<br/>\n<br/>\n </span></blockquote>I&#39;m sure they do not have this impression at all.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;(Obviously we can&#39;t always. But the more we do set aside what<br/>\n&gt;we&#39;re doing when it&#39;s possible (rather than when it&#39;s convenient<br/>\n&gt;since it&#39;s rarely convenient!), the more confidence they have that<br/>\n&gt;they truly are number one for us and the more willing they are to<br/>\n&gt;wait when we can&#39;t stop what we&#39;re doing right away.)<br/>\n<br/>\n </span></blockquote>I was thinking about that lately, about how I so often put them off because <br/>\nit is inconvenient to jump up and do as they ask. Wait a minute, in a <br/>\nminute, in a little while, later...they hear that a lot. I always have a <br/>\nmillion things to do, or a million emails to read. I seldom put their <br/>\nrequests first. So that is something to work on. I tend to get very focused <br/>\non what I am doing. I suppose kids are an inconvenience. But I need to look <br/>\nat it differently.  After all, these kids are my life.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I don&#39;t really know. I&#39;m just throwing out likely things that would<br/>\n&gt;cause a child to essentially stick his tongue out at his parent. What<br/>\n&gt;you&#39;ve written paints a picture of a disconnect between parents and<br/>\n&gt;children, a divide between those who work to keep the house running<br/>\n&gt;and those who should be off playing.<br/>\n<br/>\n </span></blockquote>thank you. i look forward to learning more on this list. more about being <br/>\nkind and gentle and paying more attention to my kids.  i can see i need to <br/>\nfocus on my oldest child more than ever before. i don&#39;t want to be at odds <br/>\nwith him all the time. i don&#39;t want him to become an angry, rebellious <br/>\nteenager. i have learned already that when i think i have control of the <br/>\nkids, control by coercion is not real control, and won&#39;t work at all when <br/>\nthe kids are older. so i am desperate to find better ways of doing things. <br/>\ni&#39;ll read the books mentioned. how about Connection Parenting by Pam Leo, <br/>\nand Raising our children, raising ourselves by Naomi Aldort...can anyone <br/>\nrecommend them?<br/>\n<br/>\nthanks,<br/>\n<br/>\nAnne<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nAnne<br/>\nSAHM mom to Jeffrey 8, Patrick 5, Nicole 3 and Colleen born 11-29-05<br/>\nin the Allegheny Mountains of PA<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":244360311,"authorName":"Deb","from":"&quot;Deb&quot; &lt;soggyboysmom@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: no peace in my home!","postDate":"1153238586","msgId":15833,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU5ajBucStjbWF2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDUuMi4xLjEuMi4yMDA2MDcxNjIxMjQxMS4wMGJjZjhmOEBpbmNvbWluZy52ZXJpem9uLm5ldD4="},"prevInTopic":15832,"nextInTopic":15863,"prevInTime":15832,"nextInTime":15834,"topicId":15804,"numMessagesInTopic":0,"msgSnippet":"... If that was my son, I d say what it was was that he needed ME with him and that he was saying he missed me and felt left out because I went off without","messageBody":"<div id=\"ygrps-yiv-1233946820\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Anne B &lt;kbarnett3@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; my 8 yo J has been wildly exuberant all day.  I got home from church <br/>\n&gt;(just <br/>\n&gt; the baby and I had gone) at around 2 and he has been insane since.<br/>\n </span></blockquote>If that was my son, I&#39;d say what it was was that he needed ME with him <br/>\nand that he was saying he missed me and felt left out because I went <br/>\noff without him, taking instead this small &quot;intruder&quot;. I might also <br/>\nwant to check in with my DH and find out if they had eaten recently <br/>\n(sometimes they both will get focused on whatever they are doing and <br/>\nboth DH and DS will &#39;forget&#39; to go eat something). The combination of <br/>\nhungry and anything else (like missing me) will send DS off the deep <br/>\nend behaviorally. One thing we found back when he was about 5 (he&#39;s 8 <br/>\nnow) was he would start pushing buttons until we got aggravated. One <br/>\ntime I flat asked &quot;why are you not stopping when you aren&#39;t happy with <br/>\nthe outcome?&quot; (okay not so nicely worded but you get the gist). He <br/>\nsaid &quot;My brain won&#39;t let me stop&quot; in such a pitiful voice - he didn&#39;t <br/>\nWANT to be aggravating but he was wound so tightly at that point he <br/>\ncould NOT stop. That&#39;s when we connected the needs food to behavior. <br/>\nBY making sure he gets regular input of food, he is better able to <br/>\nmanage other stuff.<br/>\n<br/>\nI WOH fulltime so when I get home, DS wants ME - my focused attention. <br/>\nSounds like your DS wanted that too. But odds are, when you got home <br/>\nyou had 101 things that you &quot;had to&quot; do - feed the baby, get the <br/>\nlittle kids down for a nap, do the dishes, etc. So he escalated until <br/>\nhe GOT what he wanted - your attention, even if it was your FRUSTRATED <br/>\nattention. What works for us is that when I&#39;ve been gone (whether it&#39;s <br/>\nto work or to church by myself occasionally or grocery shopping alone <br/>\nor whatever), I *deliberately* plan to give the first 15 minutes of <br/>\nattention to DS. That may mean talking to him while unpacking <br/>\ngroceries (which also draws him in to help - he is quite proud that he <br/>\ncan carry 2 whole full gallons of milk on his own). It might mean <br/>\nleaving the incoming mail on the table while I go see what he&#39;s been <br/>\nbuilding with his k&#39;nex, whatever. We also do a one night per week mom <br/>\n& son night - we may go do something &quot;useful&quot; (like this week we need <br/>\nto return his new life vest and get a bigger size) or we may just go <br/>\nsit at Starbucks or whatever. Just to spend an hour or so alone, just <br/>\nus two. He has repeatedly said that&#39;s his favorite part of the whole <br/>\nweek. And, knowing he is getting that focused time, the rest of the <br/>\nweek is less turbulent with him vying for attention with my work, the <br/>\nhousehold stuff, my time with DH, etc. He knows his time will come, in <br/>\nsmall and large doses.<br/>\n<br/>\nNow, I don&#39;t have multiple kids so I&#39;ll toss in that disclaimer - it&#39;s <br/>\neasier with just one kid. But the same principles, I thin, can apply.<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] no peace in my home!","postDate":"1153233631","msgId":15832,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEwMTdDREM3LThFNzgtNDBBNi05RjkwLURBN0UyQ0Y4RDI2RkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDUuMi4xLjEuMi4yMDA2MDcxNjIxMjQxMS4wMGJjZjhmOEBpbmNvbWluZy52ZXJpem9uLm5ldD4=","referencesHeader":"PDUuMi4xLjEuMi4yMDA2MDcxNjIxMjQxMS4wMGJjZjhmOEBpbmNvbWluZy52ZXJpem9uLm5ldD4="},"prevInTopic":15822,"nextInTopic":15833,"prevInTime":15831,"nextInTime":15833,"topicId":15804,"numMessagesInTopic":0,"msgSnippet":"... I think at the heart of this, he s trying to communicate something and you re speaking different languages. He s trying to get something and he s ending up","messageBody":"<div id=\"ygrps-yiv-2117815384\">On Jul 16, 2006, at 9:34 PM, Anne B wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; he has been insane since. its<br/>\n&gt; after 9 and he is still at it. i don&#39;t know what to do about him. he<br/>\n&gt; doesn&#39;t obey, not without threats of violence, or violence, when he  <br/>\n&gt; is like<br/>\n&gt; this. ask him to do something, he says no and runs away. ask him  <br/>\n&gt; not to do<br/>\n&gt; something, he smiles and does it some more. suggest that he go out  <br/>\n&gt; and play<br/>\n&gt; basketball, which he loves to do, he won&#39;t do it. we are so tired  <br/>\n&gt; of him<br/>\n&gt; throwing things, running through the house, making all kinds of noise,<br/>\n&gt; hurting siblings, destroying things, deliberately doing what he&#39;s been<br/>\n&gt; asked many times not to do.<br/>\n<br/>\n </span></blockquote>I think at the heart of this, he&#39;s trying to communicate something  <br/>\nand you&#39;re speaking different languages. He&#39;s trying to get something  <br/>\nand he&#39;s ending up with something else. So he just tries harder.<br/>\n<br/>\nIt&#39;s similar to what you&#39;re doing with him. You say stop. He doesn&#39;t  <br/>\nstop. So you try the same thing, just harder. Louder, yelling,  <br/>\nthreatening.<br/>\n<br/>\nThat&#39;s what he&#39;s doing. He wants something. So he just keeps  <br/>\nescalating his attempts. *He* may not even know what it is and he  <br/>\ndefinitely doesn&#39;t know how to go about getting it.<br/>\n<br/>\nThat doesn&#39;t help solve it, but maybe help you look at him  <br/>\ndifferently so you can try something new.<br/>\n<br/>\nI would second the recommendation of the books: Raising Your Spirit  <br/>\nChild and The Explosive Child. So many people have said after reading  <br/>\nthem that they can see their child in there and can now understand.  <br/>\nSort of like learning their language! :-)<br/>\n<br/>\nIn the meantime, rather than focusing on getting him to do what you  <br/>\nwant, say &quot;No,&quot; and stop him if you need to but then immediately  <br/>\nfocus on helping him get what he wants. If  he says &quot;wake the baby&quot;  <br/>\nor something unkind, trust that that isn&#39;t it! He may have settled on  <br/>\nthat because he&#39;s lost focus of what he wants or he&#39;s just lost  <br/>\ncontrol of what he wants. But do say &quot;I can&#39;t let anyone hurt my  <br/>\nkids. Now let&#39;s go out and figure out what you want and how I can  <br/>\nhelp you. What would you like for a snack while we figure that  <br/>\nout.&quot; (Or something to that effect. Don&#39;t turn *him* into the  <br/>\nproblem. Get back to the original problem that began the downward  <br/>\nspiral.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; i&#39;ve always tried to be a gentle parent. he&#39;s always<br/>\n&gt; been good at pushing, and pushing, and pushing until i explode. its  <br/>\n&gt; like he<br/>\n&gt; thinks he can do whatever he wants.<br/>\n<br/>\n </span></blockquote>What causes him to push? Why is he pushing? What&#39;s he trying to get?  <br/>\nThere&#39;s something that&#39;s causing the behavior. Trying to stop the  <br/>\nbehavior doesn&#39;t eliminate the cause. (Obviously as you well know!)<br/>\n<br/>\nThere&#39;s some disconnect there. He&#39;s wanting and wanting *something*  <br/>\nbut he&#39;s not getting that through to anyone. What he&#39;s getting is  <br/>\n&quot;No. Stop. Don&#39;t.&quot; He does of course need to hear No when he&#39;s  <br/>\nhurting someone or something but then he needs help getting what it  <br/>\nis he&#39;s trying to get.<br/>\n<br/>\nHe *should* feel he can do anything he wants. But he should also feel  <br/>\nthat he shouldn&#39;t hurt others while doing so. I think it will help to  <br/>\nsee him not as wrong for having the idea that he can do what he wants  <br/>\nhow ever he wants but that he got that idea for a good (to him)  <br/>\nreason. There&#39;s a legitimate reason he&#39;s come to that conclusion.  <br/>\nThere&#39;s something he&#39;s missing that he needs.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; for example, he wanted to build his lego train set this afternoon.  <br/>\n&gt; i didn&#39;t<br/>\n&gt; want to get it out, but i did, so i put it out on the counter in  <br/>\n&gt; our art<br/>\n&gt; room in the basement and went back upstairs where i was sitting  <br/>\n&gt; with the<br/>\n&gt; baby, sorting lego.  he soon lost interest in that and poured a  <br/>\n&gt; bottle of<br/>\n&gt; finger paint out on a paper (on a different table).<br/>\n<br/>\n </span></blockquote>Maybe what he wanted was for you to play with the train with him.<br/>\n<br/>\nIf he knew he wasn&#39;t supposed to pour the paint out and did so  <br/>\nanyway, that&#39;s a pretty clear &quot;I&#39;m not getting the attention I need.&quot;<br/>\n<br/>\nCould you find a way to spend some time with just him alone? Go to a  <br/>\npark or fishing or for a cup of hot chocolate or .... If you can at  <br/>\nall swing doing that with each child, just being with them,  <br/>\nconnecting just with them, it will help fill them up when they may be  <br/>\nfeeling emptied.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; they mostly eat what they want, when they want, and sleep when and  <br/>\n&gt; where<br/>\n&gt; they want. they don&#39;t have any assigned chores. they have a free<br/>\n&gt; life.  i&#39;ve been told they need limits, boundaries, routines, and  <br/>\n&gt; limited<br/>\n&gt; choices, and that such would make my life easier.<br/>\n<br/>\n </span></blockquote>Limits, etc will make life easier in some ways and harder in other  <br/>\nways. It&#39;s a compromise. If children learn they need to do x &quot;or  <br/>\nelse&quot; -- depending on the personality of the child -- x will often  <br/>\nget done. But what gets sacrificed is a loving relationship with the  <br/>\nchildren.<br/>\n<br/>\nBut what you&#39;re doing now isn&#39;t getting you a loving relationship  <br/>\neither.<br/>\n<br/>\n*Maybe* what you&#39;ve done is focus on your role of what you &quot;have to  <br/>\ndo&quot; to raise a family. Maybe your top priority is the things you have  <br/>\nto do: clean, laundry, shop, tend to the baby. Do you find yourself  <br/>\nregularly saying no to children&#39;s requests to do something because  <br/>\nthere&#39;s things you have to do? Or have they learned not to ask  <br/>\nbecause they know that&#39;s your answer? Do they feel that if they ask  <br/>\nyou to do something for them that you will put it at the top of your  <br/>\nlist? (Obviously we can&#39;t always. But the more we do set aside what  <br/>\nwe&#39;re doing when it&#39;s possible (rather than when it&#39;s convenient  <br/>\nsince it&#39;s rarely convenient!), the more confidence they have that  <br/>\nthey truly are number one for us and the more willing they are to  <br/>\nwait when we can&#39;t stop what we&#39;re doing right away.)<br/>\n<br/>\nI don&#39;t really know. I&#39;m just throwing out likely things that would  <br/>\ncause a child to essentially stick his tongue out at his parent. What  <br/>\nyou&#39;ve written paints a picture of a disconnect between parents and  <br/>\nchildren, a divide between those who work to keep the house running  <br/>\nand those who should be off playing.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":77228268,"authorName":"hilltowner4","from":"&quot;hilltowner4&quot; &lt;marla@...&gt;","profile":"hilltowner4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: no peace in my home!","postDate":"1153193444","msgId":15822,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU5aGtsNCtxMGhwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDUuMi4xLjEuMi4yMDA2MDcxNjIxMjQxMS4wMGJjZjhmOEBpbmNvbWluZy52ZXJpem9uLm5ldD4="},"prevInTopic":15804,"nextInTopic":15832,"prevInTime":15821,"nextInTime":15823,"topicId":15804,"numMessagesInTopic":0,"msgSnippet":"Hi Anne, I m so sorry that you are going through this.  It sounds like a very tough situation and you sound like you are trying very hard to gently parent.","messageBody":"<div id=\"ygrps-yiv-2023726202\">Hi Anne,<br/>\n<br/>\nI&#39;m so sorry that you are going through this.  It sounds like a very<br/>\ntough situation and you sound like you are trying very hard to gently<br/>\nparent.  Hang in there . . . things will get better!<br/>\n<br/>\nI wish I had a good answer for you.  I have a 7 yo. dd who also can be<br/>\nquite explosive and physical at times.  I&#39;ve found that sitting down<br/>\nwith her when she&#39;s not out-of-control and talking about what she<br/>\nthinks she may be needing when she explodes can be really helpful.  We<br/>\nalso talk about what ways she can express herself without hurting<br/>\nothers or their things.  She is a very passionate, high-spirited<br/>\nchild.  Her highs are real high and her lows are real low and the<br/>\nin-betweens sometimes seem rare - lol.  Some books that may help are<br/>\n&quot;Your Spirited Child,&quot; by Mary Sheedy Kurchinka and &quot;The Explosive<br/>\nChild,&quot; by Ross Greene.  Both of these books helped me learn more<br/>\nabout where my child was coming from and gave me excellent ideas about<br/>\nhelping her.<br/>\n<br/>\nI hope some of this is helpful.  I&#39;d love to write more, but my 3 yo.<br/>\nis calling!  There are so many fantastic posters here, I know you will<br/>\nget some great answers.<br/>\n<br/>\nHang in there!<br/>\n<br/>\nMarla mom to Amy (7 yo.) and Lily (3 yo.)<br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":205659962,"authorName":"Anne B","from":"Anne B &lt;kbarnett3@...&gt;","profile":"novax4us","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"no peace in my home!","postDate":"1153100061","msgId":15804,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMi4xLjEuMi4yMDA2MDcxNjIxMjQxMS4wMGJjZjhmOEBpbmNvbWluZy52ZXJpem9uLm5ldD4="},"prevInTopic":0,"nextInTopic":15822,"prevInTime":15803,"nextInTime":15805,"topicId":15804,"numMessagesInTopic":0,"msgSnippet":"my 8 yo J has been wildly exuberant all day.  I got home from church (just the baby and I had gone) at around 2 and he has been insane since. its after 9 and","messageBody":"<div id=\"ygrps-yiv-1474725204\">my 8 yo J has been wildly exuberant all day.  I got home from church (just <br/>\nthe baby and I had gone) at around 2 and he has been insane since. its <br/>\nafter 9 and he is still at it. i don&#39;t know what to do about him. he <br/>\ndoesn&#39;t obey, not without threats of violence, or violence, when he is like <br/>\nthis. ask him to do something, he says no and runs away. ask him not to do <br/>\nsomething, he smiles and does it some more. suggest that he go out and play <br/>\nbasketball, which he loves to do, he won&#39;t do it. we are so tired of him <br/>\nthrowing things, running through the house, making all kinds of noise, <br/>\nhurting siblings, destroying things, deliberately doing what he&#39;s been <br/>\nasked many times not to do.  sometimes all of the above at the same time. <br/>\nthis will go on and on until i or dh looses our temper and comes after <br/>\nhim.  i am trying to do the gentle parenting thing. i always AP&#39;d him and <br/>\nnever spanked him til he was about 2.5, and then when on rare occasion i <br/>\ndid he&#39;d just laugh.  i&#39;ve always tried to be a gentle parent. he&#39;s always <br/>\nbeen good at pushing, and pushing, and pushing until i explode. its like he <br/>\nthinks he can do whatever he wants. it seems like the only thing he will <br/>\nlisten to is when my dh comes after him and yells.<br/>\n<br/>\nand yet i am trying to be less controlling (my mom would say i don&#39;t <br/>\ncontrol enough) and trying not to punish or threaten. which leaves me with <br/>\nwhat? if actions have no consequence, how does he learn to behave in an <br/>\nacceptable, responsible manner?<br/>\n<br/>\nfor example, he wanted to build his lego train set this afternoon. i didn&#39;t <br/>\nwant to get it out, but i did, so i put it out on the counter in our art <br/>\nroom in the basement and went back upstairs where i was sitting with the <br/>\nbaby, sorting lego.  he soon lost interest in that and poured a bottle of <br/>\nfinger paint out on a paper (on a different table).  my 3 yo told me about <br/>\nit. he never mentioned it. when i got time to go down i cleaned it up. i <br/>\ndidn&#39;t yell, threaten, punish etc.  when next i saw him i told him i was <br/>\ndisappointed he did that, and reminded him that he knows better. he was <br/>\njust smiling like who cares.<br/>\n<br/>\nthey mostly eat what they want, when they want, and sleep when and where <br/>\nthey want. they don&#39;t have any assigned chores. they have a free <br/>\nlife.  i&#39;ve been told they need limits, boundaries, routines, and limited <br/>\nchoices, and that such would make my life easier. i want them to be free to <br/>\nmake choices, but ours is not a happy home with all the chaos, destruction <br/>\nand yelling. how can i be a peaceful parent? how can we have a joyful home? <br/>\nright now i am ready to put my 8 yo in school just to have a break! things <br/>\nare very different when he is not around. but i have not been good at <br/>\nenforcing routines, etc. and i don&#39;t see how it would make my life easier <br/>\neither.<br/>\n<br/>\nmy mother says my children will never learn to be responsible, or self <br/>\ndisciplined, and that it will be my fault. what would you do? i&#39;ll be happy <br/>\nto provide additional details about his behaviors and our home life if that <br/>\nwould help.<br/>\n<br/>\nthanks for reading.<br/>\n<br/>\nAnne<br/>\n<br/>\nAnne<br/>\nSAHM mom to Jeffrey 8, Patrick 5, Nicole 3 and Colleen born 11-29-05<br/>\nin the Allegheny Mountains of PA<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":15847,"nextTopicId":15821}}