{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":318361775,"authorName":"Christina M","from":"Christina M &lt;aaminah07@...&gt;","profile":"aaminah07","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re:Transition ~ advice","postDate":"1201296762","msgId":29012,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI2MDExLjgwMDMzLnFtQHdlYjU3NTEzLm1haWwucmUxLnlhaG9vLmNvbT4="},"prevInTopic":28988,"nextInTopic":0,"prevInTime":29011,"nextInTime":29013,"topicId":28980,"numMessagesInTopic":0,"msgSnippet":"Thank you for your support and all the wonderful advice. It was very uplifting, and gave me some great energy. I think that is the best way I can explain it.","messageBody":"<div id=\"ygrps-yiv-154533687\">Thank you for your support and all the wonderful advice. It was very uplifting, and gave me some great energy. I think that is the best way I can explain it. My girls due to counseling appointments have missed a lot of school. However, they are under the limit for the attorney general to step in. Not to mention, they can stick their rules on absent days. I feel if they are excused due to doctors and its not a full day missed then they have no ground to stand on. <br/>\n <br/>\nHowever, just as I am writing I got a call from my youngest daughters Principal. She told me she got a call from the district office, stating I had submitted my application for homeschooling. So she was wanting to inquire when they were gonna start that, and if it were true. The plan was to file for homeschooling Feb 1st after I move to Rapid City, from Box Elder SD. Smiles.. So I gladly informed her, she was correct that I have had enough of the issues here, that I thought it best to start the process here before moving. Which to be honest would be easier then to deal with &quot;requirements&quot; Rapid City states. <br/>\n <br/>\nOf course, she was like if there is anything I can do please let me know. I told her thank you, have a great weekend. It would of been much easier to leave my girls in school during the weekdays of moving which was Feb 1 and 4th. However, my girls are not a problem. Id much rather them be safe and in the way (if that were the case) then at school dealing with the negative issues they&#39;ve had. <br/>\n <br/>\nLast night, my oldest daughter whom has had the suicide issues come about, was given a note in 6th period yesterday. It said something along lines, that she was gonna die/kill herself at 12pm tonight. My daughter gave it to a teacher who turned it over. From what I was told, they both ended up in the office. My daughter was not with them while questioning the other student. However, she said they told her the only reason why this student wrote that note to her was because my daughter had upset the girl by licking her few days prior. Of course, she told them she did not such thing. Anyways, my issue was not any of this, but the fact that my daughter stated that student was able to return to her class room after all that. However, with my daughter both times, one was a letter that was written five days prior was handled differently. <br/>\nWhat I think may have caused them to handle it in such a way was that other young girl spoke to them. My daughter has social anxiety and she much rather be sent away then forced to talk to you if she is not comfortable. <br/>\n <br/>\nAnyways, I feel much less stressed about next week. Even getting them to school for the last three days they are finishing up I feel a difference. Even my girls, have a lighter look to them. I can only pray it will get better and we will be able to grow closer all over again. Also, I have decided that &quot;vacation&quot; started but out of respect they will finish up Monday at school. Today they took cakes to their class. My oldest did not want to take a cake to the students she took a smaller one to the teachers. They were very excited this morning. <br/>\n <br/>\nThanks again, Ive written a novel, sorry. I can rattle on. I do not have a lot of contacts, nor do I get out much. That will change now. smiles.<br/>\n <br/>\nHugs,<br/>\n <br/>\nChristina<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: Debra Rossing &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:debra.rossing@...\">debra.rossing@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Friday, January 25, 2008 9:27:20 AM<br/>\nSubject: [unschoolingbasics] Re:Transition ~ advice<br/>\n<br/>\nBTW if they&#39;ve got any &quot;excused absences&quot; left USE them - stay under the<br/>\nnumber of days that raises flags or draws attention but maybe just take<br/>\ndays here and there off - after all you&#39;re moving, lots of stuff that<br/>\nneeds to get done when you&#39;re moving, right?<br/>\n<br/>\nDeb <br/>\n<br/>\n************ ********* ********* ********* ********* ********* ********* ****<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam. com<br/>\n************ ********* ********* ********* ********* ********* ********* ****<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      ____________________________________________________________________________________<br/>\nNever miss a thing.  Make Yahoo your home page. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.yahoo.com/r/hs\">http://www.yahoo.com/r/hs</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:Transition ~ advice","postDate":"1201278440","msgId":28988,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1Mzk1MTFGQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":28982,"nextInTopic":29012,"prevInTime":28987,"nextInTime":28989,"topicId":28980,"numMessagesInTopic":0,"msgSnippet":"BTW if they ve got any excused absences left USE them - stay under the number of days that raises flags or draws attention but maybe just take days here and","messageBody":"<div id=\"ygrps-yiv-1251770026\">BTW if they&#39;ve got any &quot;excused absences&quot; left USE them - stay under the<br/>\nnumber of days that raises flags or draws attention but maybe just take<br/>\ndays here and there off - after all you&#39;re moving, lots of stuff that<br/>\nneeds to get done when you&#39;re moving, right?<br/>\n<br/>\nDeb <br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"&quot;diana jenner&quot; &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Transition ~ advice","postDate":"1201216732","msgId":28982,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDgwMTI0MTUxOHkyMWM3Y2JjYnVlZjkyNWMyYmFjMTU5YTBlQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDQwOTQ3MC4yMjc1MC5xbUB3ZWI1NzUwNy5tYWlsLnJlMS55YWhvby5jb20+","referencesHeader":"PDQwOTQ3MC4yMjc1MC5xbUB3ZWI1NzUwNy5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":28980,"nextInTopic":28988,"prevInTime":28981,"nextInTime":28983,"topicId":28980,"numMessagesInTopic":0,"msgSnippet":"... You re moving. Tell the school. They don t have to go back there anymore, ever, ever, ever!!! It really and truly is that simple. You don t need to give","messageBody":"<div id=\"ygrps-yiv-1317761601\">On Jan 24, 2008 1:02 PM, Christina M &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aaminah07@...\">aaminah07@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   I have two daughters ages 10 & 11, and I am a single mother. Currently<br/>\n&gt; my daughter&#39;s attend public school here in South Dakota.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>You&#39;re moving. Tell the school.<br/>\nThey don&#39;t have to go back there anymore, ever, ever, ever!!!<br/>\nIt really and truly is that simple. You don&#39;t need to give them any<br/>\nspecifics, a forwarding address maybe. No explaining, no dates, no plans to<br/>\nhomeschool, nada. You&#39;re moving out of the district, buh-bye.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; After giving this all plenty of thought, and the process the other<br/>\n&gt; district has us going through I have decided to file for the exempt cert.<br/>\n&gt; here. I&#39;m pondering if I should take them out now or follow their process of<br/>\n&gt; leaving them in school until it gets approved. They told me the school board<br/>\n&gt; meets Monday night. Any suggestions or has anyone have had to go through<br/>\n&gt; something similar?<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I know this school district specifically is known to bully those parents who<br/>\nare unfamiliar with SD Law.<br/>\nYou *can* choose not to do business with them. You can choose to *delay*<br/>\ngiving them any information until next fall, if ya wanna. You should talk to<br/>\nthe local families about this if you want specific advice on who to deal<br/>\nwith in RC.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also, just to touch base she has a friend in the area that has many of her<br/>\n&gt; own medical issues for which she is on medication for. I have narrowed the<br/>\n&gt; time line down and this girl has been a negative influence on my daughter.<br/>\n&gt; This same girl introduced a man from Florida to my daughter from the net,<br/>\n&gt; who attempted to get my daughter to get nasty etc. Needless to say I did set<br/>\n&gt; him up, got him number, photos, and achieves and filed a report to the<br/>\n&gt; police. So with all that in mind I think starting this process now will be<br/>\n&gt; most beneficial to everyone for many reasons.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>If only to avoid this incredible amount of drama, keep your girls home!<br/>\nYou&#39;re moving, you&#39;ve got plenty to focus on that is healthy and happy.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; p.s. I am excited to start the deschooling process, although Im slightly<br/>\n&gt; worried about the process.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Proclaim yourselves *On Vacation* until further notice. Enjoy your Now :)<br/>\n-- <br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":318361775,"authorName":"Christina M","from":"Christina M &lt;aaminah07@...&gt;","profile":"aaminah07","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Transition ~ advice","postDate":"1201208554","msgId":28980,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwOTQ3MC4yMjc1MC5xbUB3ZWI1NzUwNy5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":28982,"prevInTime":28979,"nextInTime":28981,"topicId":28980,"numMessagesInTopic":0,"msgSnippet":"Hello Everyone, Forgive me, I am not sure if I have really introduced myself as I have joined so many home school groups. I know if I have said anything about","messageBody":"<div id=\"ygrps-yiv-1816064365\">Hello Everyone,<br/>\n <br/>\nForgive me, I am not sure if I have really introduced myself as I have joined so many home school groups. I know if I have said anything about my family it has been a while. So I will try to touch base about our situation. We have so much that has happened, and I need to talk to someone. Forgive me if I stray from the subject of homeschooling. I hope to gain as much support, and knowledge that can possibly be given. <br/>\n <br/>\nI have two daughters ages 10 & 11, and I am a single mother. Currently my daughter&#39;s attend public school here in South Dakota. However, due to my youngest having some memory and self esteem issues I considered homeschooling a few months ago. It was about a month ago that I joined  a few home school groups and reconsidered homeschooling both of my daughters. Due to moving to another town here in SD Feb 1st. With all the personal issues going on,  and what I&#39;ve heard about the middle school, its a plan to start homeschooling in Feb. Anyways, how the school district works  is I have to register them, while it gets approved they are suppose to stay enrolled in school. Which I thought was goofy, I stated I am not driving them to another school district to wait for their approval nor will I put them in their schools just to take them out. The end result was to turn my papers in on the 28th Jan and once I move to town it should not be a issue as they would<br/>\n review the paperwork on the 7th of Feb.  <br/>\n <br/>\nHowever, my youngest has express on a number of occasions some things going on at school and last night she mentioned crying after her teacher addressed something that was not the case, nor her business. At the same time, I have my oldest daughter whom has some social anxieties. She has been doing very well. However few wks ago many of the girls at school started in on name calling, just being cruel. Over a wk ago I got a call from her school informing me that it was reported to them she was over heard with another student talking about suicide. I had to take her out of class, we talked and it turned out to be taken out of context. Anyways, yesterday I was called and told that they had found a note on Friday and traced it back to my daughter whom admitted to writing it. Long story short I moved her counseling appt that she had up a few hours. I went to the school and signed her out. Their response half the time is they are concerned about her, and if Ive<br/>\n considered having her evaluated. One went as far to ask me if she was only any medications for her anxieties or depression. I&#39;d love to scream right about then. She is fine, she wrote the note because her one friend wasn&#39;t talking to her, but she was giving all her attention to another girl that was being very mean to my daughter. She said she wrote it to grab her attention, and it had worked. She said it was just a stupid note. Her doctor feels she is not a risk to herself, as I do as well. However, we only plan to have another wk in school, I am praying nothing else pops up.<br/>\n <br/>\nAfter giving this all plenty of thought, and the process the other district has us going through I have decided to file for the exempt cert. here. I&#39;m pondering if I should take them out now or follow their process of leaving them in school until it gets approved. They told me the school board meets Monday night. Any suggestions or has anyone have had to go through something similar? Also, just to touch base she has a friend in the area that has many of her own medical issues for which she is on medication for. I have narrowed the time line down and this girl has been a negative influence on my daughter. This same girl introduced a man from Florida to my daughter from the net, who attempted to get my daughter to get nasty etc. Needless to say I did set him up, got him number, photos, and achieves and filed a report to the police. So with all that in mind I think starting this process now will be most beneficial to everyone for many reasons.<br/>\n <br/>\nI apologize for my long letter, as I am rereading this I feel its alot nonsense / perhaps drama to be posting. I just need to get this off my chest and seek any advice anyone may have. Even if I have already heard it I know it will be consoling. <br/>\n <br/>\nAgain accept my apologies.<br/>\n <br/>\nThank you very much,<br/>\n <br/>\nChristina<br/>\n <br/>\np.s. I am excited to start the deschooling process, although Im slightly worried about the process. Everyone who posts have helped me in so many ways. I just have a few areas of nervousness.<br/>\n<br/>\n<br/>\n      ____________________________________________________________________________________<br/>\nNever miss a thing.  Make Yahoo your home page. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.yahoo.com/r/hs\">http://www.yahoo.com/r/hs</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":28991,"nextTopicId":28959}}