{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":254934996,"authorName":"duckgirl01","from":"&quot;duckgirl01&quot; &lt;hippytrish@...&gt;","profile":"duckgirl01","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: just need some help/encouragement/thoughts...","postDate":"1258640167","msgId":42107,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlM2p2NytnNGRyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhlMG90dStlNmJzQGVHcm91cHMuY29tPg=="},"prevInTopic":42103,"nextInTopic":0,"prevInTime":42106,"nextInTime":42108,"topicId":42100,"numMessagesInTopic":0,"msgSnippet":"We re expats too, so I can totally relate to what you are saying. There are almost no unschoolers in the country we are in. It can feel very isolating to me","messageBody":"<div id=\"ygrps-yiv-433553331\">We&#39;re expats too, so I can totally relate to what you are saying. There are almost no unschoolers in the country we are in. <br/>\n<br/>\nIt can feel very isolating to me when we tend to always have conversations with parents who are discussing curriculum, or other topics that I don&#39;t usually feel I have much to contribute to. I often feel that the comments going on in my head would not really be welcome if I actually voiced them in the discussion. Frankly, I probably wouldn&#39;t hang out with curriculum-minded parents if it were just me involved. But what I try to remember is that I&#39;m there in that situation for the good of my kids - usually because they want to hang out with other kids, or maybe because they have chosen to do the particular activity that is going on that day. So when I&#39;m listening to the other parents go on and on, what I try to do is refocus on what my kids are doing, how much fun they are having, and why I&#39;m really there. The truth of the matter is that I&#39;m not there to get support from the parents in this situation. Those parents are not going to really give me any support because they really don&#39;t understand unschooling at all. So I repeat to myself, &quot;These are not my support people.&quot; And then I look to my kids, to see the smiles on their faces, and *that* is my support - their smiles. <br/>\n<br/>\nTrish<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Let me just say, we don&#39;t live in the USA, and as expats, we&#39;re just happy to know other homeschoolers. So far I have not met even one other unschooler (EVER!), or at least they don&#39;t openly say they are that. The other moms are very friendly and encouraging, though the conversation often ends up in curriculum discussion, comparison of their children, etc which I usually just listen to, and occasionally try to encourage them not to compare, and offer encouragement to lighten up...<br/>\n<br/>\n&gt; Emily<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":221315529,"authorName":"Ronnie","from":"&quot;Ronnie&quot; &lt;hmsdragonfly@...&gt;","profile":"hmsdragonfly","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: just need some help/encouragement/thoughts...","postDate":"1258576395","msgId":42103,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlMWxtYis5c2w1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhlMG90dStlNmJzQGVHcm91cHMuY29tPg=="},"prevInTopic":42100,"nextInTopic":42107,"prevInTime":42102,"nextInTime":42104,"topicId":42100,"numMessagesInTopic":0,"msgSnippet":"Maybe try keeping a journal, or even just a list scribbled on the back of an envelope, of your kids daily activities. At the end of the week, go back through","messageBody":"<div id=\"ygrps-yiv-1139269975\">Maybe try keeping a journal, or even just a list scribbled on the back of an envelope, of your kids&#39; daily activities. At the end of the week, go back through and discover how much fun they had, how much learning they did, and what an amazing variety of sources of inspiration they found.<br/>\n<br/>\nWhen they ask for school activities, simply provide them, as if it&#39;s no big deal (because it isn&#39;t). They just want to see what it&#39;s all about.<br/>\n<br/>\nAnd every day before you go into the co-op, remind yourself that you&#39;re only there for the fun. You have chosen unschooling for a reason, and the people who can best assess how it&#39;s going are you and your children. You can rest assured that your kids will tell you if and when they want something to be different!<br/>\n<br/>\nRonnie<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sites.google.com/site/dragonflykaizen/\">http://sites.google.com/site/dragonflykaizen/</a></div>","specialLinks":[]},{"userId":410771768,"authorName":"ejemama","from":"&quot;ejemama&quot; &lt;ejemama@...&gt;","profile":"ejemama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"just need some help/encouragement/thoughts...","postDate":"1258546942","msgId":42100,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlMG90dStlNmJzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":42103,"prevInTime":42099,"nextInTime":42101,"topicId":42100,"numMessagesInTopic":0,"msgSnippet":"Hi everyone, I m just having one of those days that I can see so many mistakes that have made, and though I can see them as things to learn from, it all just","messageBody":"<div id=\"ygrps-yiv-338751598\">Hi everyone,<br/>\nI&#39;m just having one of those days that I can see so many mistakes that have made, and though I can see them as things to learn from, it all just seems like too much. <br/>\n<br/>\nWe belong to a coop of other homeschoolers and my daughters absolutely love the activities and things that the other moms and kids bring to the group. However, they all seem to be more homeschoolers than unschoolers, and I end up feeling like a slacker because I&#39;m not all prepared with tons of great amazing well thought-out activities for the kids.<br/>\n<br/>\nLet me just say, we don&#39;t live in the USA, and as expats, we&#39;re just happy to know other homeschoolers. So far I have not met even one other unschooler (EVER!), or at least they don&#39;t openly say they are that. The other moms are very friendly and encouraging, though the conversation often ends up in curriculum discussion, comparison of their children, etc which I usually just listen to, and occasionally try to encourage them not to compare, and offer encouragement to lighten up...<br/>\n<br/>\nThe thing that I struggle with is that it&#39;s really hard to unschool without anyone to watch in real life - I mean like a friend who is doing it this way too.. Often I go home from the coop feeling like I&#39;m totally screwing up my kids, that I just am not doing it right, that I should put them back in school because even if I wanted to do it the schooly way, I just can&#39;t. I just feel like I&#39;m not measuring up to what I want for my kids. <br/>\n<br/>\nSo, I don&#39;t want to compare, but I end up comparing!! I want to be here, and I want to live in the Now but I just keep getting lost in the bog. I feel like I have no one to support me here, including my husband who would really like to see more &quot;work&quot; getting done (which I appease by showing the projects they&#39;ve come up with on their own, and other stuff we&#39;ve started, sometimes finished, sometimes not) Even my kids sometimes see that the other kids do school stuff, and sometimes they ask to do something like they&#39;ve seen at a friend&#39;s house (which usually we do).<br/>\n<br/>\nI&#39;ve learned a lot from this group, and I always want to post something to say thank you, but here I am asking for support instead. But thank you, even though you don&#39;t know I&#39;m here most of the time, this is where I get my energy from to keep at this unschooling journey. <br/>\n<br/>\nEmily</div>","specialLinks":[]}],"prevTopicId":42093,"nextTopicId":42109}}