{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":236897304,"authorName":"frozenandcold","from":"&quot;frozenandcold&quot; &lt;fivefreebirds@...&gt;","profile":"frozenandcold","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"hitting a hard spot!!! help","postDate":"1146406646","msgId":12645,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUzMmd0bStyaW9iQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":12644,"nextInTime":12646,"topicId":12645,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-231016634\">&lt;&lt;&lt;&lt;&lt;My 10 year old thinks he<br/>\ncan just say whatever he wants to me and he&#39;s been hitting his <br/>\nbrother (the<br/>\n7 year old).  The 14 year old has been instigating a lot of fights <br/>\nbetween<br/>\nthe 2 younger boys.  They don&#39;t bathe, and they get FILTHY!!!  They <br/>\nhave<br/>\nbecome lazy and sullen, they stay up all night and sleep half the <br/>\nday.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nWow, you got some great advice on this subject!  I think the main <br/>\nthing to remember is that it is not about NO rules and limits, it is <br/>\nabout NO ARBITRARY rules and limits, and I do prefer the principle <br/>\napproach over the &quot;rules&quot;.  If things make sense most kids are more <br/>\nthan willing to go along with it.  For me it is is more about <br/>\nrespecting them as a fellow human beings not some puppet to be <br/>\ncontrolled.  It is more about helping them and guiding as they make <br/>\ntheir own choices that are unique only to them.  <br/>\n<br/>\nEveryone in the house deserves to be safe, and that means safe from <br/>\nphysical, verbal, and emotional harm.  It is something we struggle <br/>\nwith in our home so don&#39;t think that all unschoolers live this <br/>\nperfectly peaceful life all the time.  One thing that my sister Ren <br/>\nhas taught me over the last couple weeks while we were staying with <br/>\nthem is that distraction is a WONDERFUL tool!!!!  I tend to sit <br/>\nthere and say &quot;Stop that, that is not okay.&quot; until I am so fed up <br/>\nthat I get agitated.  The other day the kids were outside playing <br/>\nbut their tone indicated that they were getting a little irritated <br/>\nwith each other; Ren went outside and said &quot;Hey, you guys want to <br/>\nbuild a fire and have s&#39;mores?&quot;  Talk about a distraction!  We went <br/>\nand built a fire and the kids started laughing again and forgot all <br/>\nabout whatever was irritating them.  Sometimes they just need a <br/>\nchange of pace.  <br/>\n<br/>\nMy kids definitely go through down times (I prefer to not call it <br/>\nlaziness) when there is changes of any kind going on in our family.  <br/>\nI do know though that if you just plan some fun, interesting things <br/>\nthat they will most likely want to join you.  Even my son who spends <br/>\nHOURS on the computer every day and seems to never come out of his <br/>\nroom will join us if there is something interesting going on.  <br/>\nSomething as simple as Art Trading Cards.  Something else that we do <br/>\nperiodically (another one of Rens suggestions) is to just get in the <br/>\ncar and drive, I let the kids tell me whether to turn right, left or <br/>\ngo straight.  Wherever we end up we go in and check it out.  You <br/>\nwill be amazed where you end up.  One day we ended up at Joanns <br/>\nFabrics and ended up making mittens that day!  <br/>\n<br/>\nBe patient because you are in the process of redefining your life <br/>\nreally and it takes time to figure it out.  I do agree with the <br/>\nadvice that you got about not letting go of everything at one time; <br/>\nthat can be overwhelming for kids who aren&#39;t used to having lots of <br/>\nchoices.  Just say yes more often and slowly let go of arbitrary <br/>\nrules, negotiate more so that everyone in the family gets at least a <br/>\npart of what they want, and make YOUR life really interesting; <br/>\ninvest in your own passions and interests and see how that effects <br/>\nthe whole family!!<br/>\n<br/>\nHeidi Snavley<br/>\n<br/>\nps about the showers and filthiness:  I have one that only showers <br/>\nonce a week or so and as long as he doesn&#39;t effect the rest of us <br/>\ntoo bad I don&#39;t say much but something you can do to encourage <br/>\nregular showers is to make the bathroom a fun place to be with great <br/>\ndecorations, bright colored towels, fun soaps, good smelling <br/>\nshampoo, etc.  Don&#39;t know if it will work but my kids love that kind <br/>\nof thing!!</div>","specialLinks":[]}],"prevTopicId":12638,"nextTopicId":12646}}