{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: losing things all the time","postDate":"1285363485","msgId":44873,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRDJBNDYwQjg5QzFFOS0xNTM4LTFCOTJAd2VibWFpbC1tMDM3LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PGk3Zm0ydCs1ZmZnQGVHcm91cHMuY29tPg=="},"prevInTopic":44866,"nextInTopic":0,"prevInTime":44872,"nextInTime":44874,"topicId":44835,"numMessagesInTopic":0,"msgSnippet":"I m so sorry for your loss, JJ! ~Kelly Kelly Lovejoy There is no single effort more radical in its potential for saving the world than a transformation of the","messageBody":"<div id=\"ygrps-yiv-1569277301\">I&#39;m so sorry for your loss, JJ!<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: JJ &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jrossedd@...\">jrossedd@...</a>&gt;<br/>\n<br/>\nThere&#39;s nothing about the attitude of &quot;that&#39;ll teach you a lesson&quot; that comes <br/>\nacross as educational, much less helpful or loving. Still, losing things can <br/>\nlead to at least two kinds of good learning opportunities: practical tricks for <br/>\nremembering where to find things when she wants them, AND deepening her moral <br/>\nsense of how much more important it is to care about people than about things.<br/>\n<br/>\nIn our family these ideas might have been less painful for the kids to <br/>\ninternalize, because the loss was mine. We were hurrying to get the children to <br/>\na dress rehearsal for a singing and dancing show; their dad&#39;s mother had flown <br/>\nacross the country to stay with us and see it. I was washing up in the kitchen <br/>\nright before we all piled in the van with costumes, cameras and such, and got on <br/>\nthe highway. I was driving. I glanced at my hands on the wheel and realized my <br/>\nwedding rings were gone: my diamond engagement ring, my wedding band and also my <br/>\nmother&#39;s diamond wedding band I had inherited when she passed away. The most <br/>\nvaluable possessions I owned in both senses of the word -- thousands of dollars <br/>\nand lifetimes of meaning that went everywhere with me.<br/>\n<br/>\nI figured I&#39;d left them by the sink. I desperately wanted to pull over and go <br/>\nstraight home to search; I felt lost and incomplete and panicked. Mother-in-law <br/>\nsuggested it and said if they really were by the sink, it would be quick and we <br/>\nwouldn&#39;t be too late. I wanted to! -- how could I wait hours, pretend it didn&#39;t <br/>\nmatter, go make mom smalltalk and then sit and clap for my kids, looking at my <br/>\nhands the whole time and seeing what I was missing?<br/>\n<br/>\nInstead I thought about my mom and that she would care more about the kids&#39; day <br/>\nthan her rings or mine, and would want me to, too. And I realized that I did. <br/>\nAnd told them so.  <br/>\n<br/>\nWe went on and had a great show, even went out to dinner after for a little <br/>\nfamily celebration before going home. Then everyone whole-heartedly helped me <br/>\ntear the house apart, that night and for many days after. The rings were never <br/>\nfound but in a way they were replaced with some very valuable power of story. it <br/>\nmight have been one of our best days together. I think Mom would be so proud of <br/>\nthem -- and of me too. :)  <br/>\n<br/>\nJJ<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":111495799,"authorName":"Cornelia","from":"&quot;Cornelia&quot; &lt;corneliablik@...&gt;","profile":"corneliablik","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: losing things all the time","postDate":"1285306570","msgId":44866,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk3aGRjYSsxNzFsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk3Zm0ydCs1ZmZnQGVHcm91cHMuY29tPg=="},"prevInTopic":44850,"nextInTopic":44873,"prevInTime":44865,"nextInTime":44867,"topicId":44835,"numMessagesInTopic":0,"msgSnippet":"Dear JJ, I am more of a reader than a poster on this list - and have found it very helpful - wish I could be more active (maybe when I m less","messageBody":"<div id=\"ygrps-yiv-1344988551\">Dear JJ,<br/>\nI am more of a reader than a poster on this list - and have found it very helpful - wish I could be more active (maybe when I&#39;m less sleep-deprived-obsessed!)- anyway after that preamble, I had to write and tell you that both my husband and I found your story very moving. Thank you so much for posting it - it will stay with me as a wonderful metaphor for what is valuable in life - especially how you were able to talk about what your true inheritence was from your Mum - even though the symbols were lost, what remains now is so powerful and loving.<br/>\nThanks again,<br/>\nCornelia<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;JJ&quot; &lt;jrossedd@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; There&#39;s nothing about the attitude of &quot;that&#39;ll teach you a lesson&quot; that comes across as educational, much less helpful or loving. Still, losing things can lead to at least two kinds of good learning opportunities: practical tricks for remembering where to find things when she wants them, AND deepening her moral sense of how much more important it is to care about people than about things.<br/>\n&gt; <br/>\n&gt; In our family these ideas might have been less painful for the kids to internalize, because the loss was mine. We were hurrying to get the children to a dress rehearsal for a singing and dancing show; their dad&#39;s mother had flown across the country to stay with us and see it. I was washing up in the kitchen right before we all piled in the van with costumes, cameras and such, and got on the highway. I was driving. I glanced at my hands on the wheel and realized my wedding rings were gone: my diamond engagement ring, my wedding band and also my mother&#39;s diamond wedding band I had inherited when she passed away. The most valuable possessions I owned in both senses of the word -- thousands of dollars and lifetimes of meaning that went everywhere with me.<br/>\n&gt; <br/>\n&gt; I figured I&#39;d left them by the sink. I desperately wanted to pull over and go straight home to search; I felt lost and incomplete and panicked. Mother-in-law suggested it and said if they really were by the sink, it would be quick and we wouldn&#39;t be too late. I wanted to! -- how could I wait hours, pretend it didn&#39;t matter, go make mom smalltalk and then sit and clap for my kids, looking at my hands the whole time and seeing what I was missing?<br/>\n&gt; <br/>\n&gt; Instead I thought about my mom and that she would care more about the kids&#39; day than her rings or mine, and would want me to, too. And I realized that I did. And told them so.  <br/>\n&gt; <br/>\n&gt; We went on and had a great show, even went out to dinner after for a little family celebration before going home. Then everyone whole-heartedly helped me tear the house apart, that night and for many days after. The rings were never found but in a way they were replaced with some very valuable power of story. it might have been one of our best days together. I think Mom would be so proud of them -- and of me too. :)  <br/>\n&gt; <br/>\n&gt; JJ<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Schuyler &lt;s.waynforth@&gt; wrote:<br/>\n&gt; &gt; <br/>\n&gt; &gt; People lose things. People break things. Things don&#39;t tend to remain pristine or with their original owners for always. Sympathy is a good response. Trying to help her keep track of things and talking about what is too valuable to her to go with her everywhere may help. Getting means to keep track of things more easily. Getting a case for an iPod that she can hang off her neck, if that would be an accessory she would be comfortable with. I know it&#39;s a bit of closing the barn door after the horse got out, but thinking of ways to help her keep track of things is far better than punishing her for losing something. Breathe and recognise that the loss is hers.<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: losing things all the time","postDate":"1285262704","msgId":44850,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk3ZzJoZys1YmZzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk3ZnFkaCtxZjFqQGVHcm91cHMuY29tPg=="},"prevInTopic":44849,"nextInTopic":44866,"prevInTime":44849,"nextInTime":44851,"topicId":44835,"numMessagesInTopic":0,"msgSnippet":"... *********** Taking time to calm yourself - to separate your own reaction to your own issues from your daughter - is certainly better than shouting at her","messageBody":"<div id=\"ygrps-yiv-387150971\">&quot;flyingtwinsmom&quot; &lt;flyingtwinsmom@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I know that she needs my sympathy, but what about those times when I&#39;m not ready for that? Is it ok to just tell her that I need a few minutes before dealing with her while I go and calm myself?<br/>\n </span></blockquote>***********<br/>\n<br/>\nTaking time to calm yourself - to separate your own reaction to your own issues from your daughter - is certainly better than shouting at her or scolding or shaming her. Better still to take a deep breath and focus on your daughter, but if your own reserves are low go with the &quot;best&quot; option in the moment. Next time you can take it a step further. <br/>\n<br/>\nIt can help a lot to think in terms of &quot;next time&quot; instead of &quot;in the future&quot; in a more global sense. The idea that you&#39;ll make a big change once and for all often holds people back - its intimidating! And its a setup for beating yourself up when you aren&#39;t your most perfect best. Your in-the-moment best will get better with practice. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: losing things all the time","postDate":"1285261278","msgId":44849,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE0NURBRUYxODY1NDQwMUU4QjRGMUE4RDFBNDM4NDM4QENvbm5pZVBDPg==","inReplyToHeader":"PEFBTkxrVGk9dyt6X1p4RWpXaWlqQ1EwdnlPYVNIZXRCbjVOdE5xNWV1RjBtd0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGk3Zm0yZittaHV0QGVHcm91cHMuY29tPiA8aTdmcWRoK3FmMWpAZUdyb3Vwcy5jb20+IDxBQU5Ma1RpPXcrel9aeEVqV2lpakNRMHZ5T2FTSGV0Qm41TnROcTVldUYwbXdAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":44845,"nextInTopic":44850,"prevInTime":44848,"nextInTime":44850,"topicId":44835,"numMessagesInTopic":0,"msgSnippet":"... stuff later when you are alone. Otherwise, you are still doing the same things to her, you are just not being vocal about it.","messageBody":"<div id=\"ygrps-yiv-457872689\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Stuff your feelings and be warm and supportive and then deal with the ugly<br/>\n </span></blockquote>stuff later when you are alone. Otherwise, you are still doing the same<br/>\nthings to her, you are just not being vocal about it.&lt;&lt;&lt;<br/>\n<br/>\nI disagree with stuffing your feelings. My 6 year old is always losing things. She had a DS game that she lost. We looked and looked for it. It wasn&#39;t that big of a deal because she had at least gotten to play with it and we knew it was somewhere in the house. Out of the blue she found it sitting on my desk under some stuff.<br/>\n<br/>\nFast forward a bit, we bought her another DS game that is kind of hard to find and it was kind of expensive. The day we bought it, she lost it. I was mad and I told her I was mad. I wasn&#39;t mad at her because she has 2 little sisters that are always messing with her stuff. Daddy and I lose stuff all the time. I told her that I was mad because she hadn&#39;t gotten to play with it. I was mad because I didn&#39;t help her keep track of it better. I don&#39;t like seeing my girls upset. I looked and looked and looked some more. I dumped out every toy box in the house and looked everywhere. At one point, my 6 year old came up to me and said, &quot;Mom, it&#39;s okay. You can stop looking. Remember how we found the other game? This one will turn up eventually.&quot; Of course, we have a family joke that our house eats things. Whenever something gets lost, we may be mad that it is lost but we don&#39;t get mad at each other because we have all lost something at one time or another. I think it is possible to be supportive without stuffing your feelings.<br/>\n<br/>\nConnie<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":277213997,"authorName":"Karen Swanay","from":"Karen Swanay &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: losing things all the time","postDate":"1285255967","msgId":44845,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9dyt6X1p4RWpXaWlqQ1EwdnlPYVNIZXRCbjVOdE5xNWV1RjBtd0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGk3ZnFkaCtxZjFqQGVHcm91cHMuY29tPg==","referencesHeader":"PGk3Zm0yZittaHV0QGVHcm91cHMuY29tPiA8aTdmcWRoK3FmMWpAZUdyb3Vwcy5jb20+"},"prevInTopic":44842,"nextInTopic":44849,"prevInTime":44844,"nextInTime":44846,"topicId":44835,"numMessagesInTopic":0,"msgSnippet":"That s a bit like saying Is it OK for me to slap her in the face while I wait for the urge to punch her in the face passes?  She s going to KNOW you are","messageBody":"<div id=\"ygrps-yiv-517281144\">That&#39;s a bit like saying &quot;Is it OK for me to slap her in the face while I<br/>\nwait for the urge to punch her in the face passes?&quot;  She&#39;s going to KNOW you<br/>\nare pissed off at her and the damage will be done.  How about immediately<br/>\nasking yourself &quot;Did she do it on purpose to piss me off?&quot;  If the answer is<br/>\n&quot;No&quot; then DON&#39;T GET MAD.  You wouldn&#39;t want to be shamed don&#39;t do it to<br/>\nher.  She already feels bad enough about it.  Treat her like you&#39;d want to<br/>\nbe treated in the same situation.  Recognize that accidents happen and she&#39;s<br/>\nalready had to deal with the panic and the flood of cortisol that comes with<br/>\nit.  Don&#39;t compound it and take away your love or even make it seem like<br/>\nyour love is conditional on her being &quot;responsible&quot;...she didn&#39;t do it on<br/>\npurpose.<br/>\n<br/>\nStuff your feelings and be warm and supportive and then deal with the ugly<br/>\nstuff later when you are alone.  Otherwise, you are still doing the same<br/>\nthings to her, you are just not being vocal about it.<br/>\n<br/>\nKaren<br/>\nFrom House, MD discussing parents of a child with Autism --<br/>\nDr Allison Cameron:Is it so wrong for them to want to have a normal child?<br/>\nIt&#39;s normal to want to be normal.<br/>\nHouse: Spoken like a true circle queen. See, skinny socially privileged<br/>\nwhite people get to draw this neat little circle, and everyone inside the<br/>\ncircle is normal, anyone outside the circle should be beaten, broken and<br/>\nreset so they can be brought into the circle. Failing that, they should be<br/>\ninstitutionalized or worse, pitied.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nOn Thu, Sep 23, 2010 at 10:06 AM, flyingtwinsmom<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:flyingtwinsmom@...\">flyingtwinsmom@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Thank you everyone. Reading how to handle it positively has helped to calm<br/>\n&gt; me. Dh will still overreact but I&#39;m prepared for that. I know that she needs<br/>\n&gt; my sympathy, but what about those times when I&#39;m not ready for that? Is it<br/>\n&gt; ok to just tell her that I need a few minutes before dealing with her while<br/>\n&gt; I go and calm myself?<br/>\n&gt; Bonni<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":191799655,"authorName":"flyingtwinsmom","from":"&quot;flyingtwinsmom&quot; &lt;flyingtwinsmom@...&gt;","profile":"flyingtwinsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: losing things all the time","postDate":"1285254385","msgId":44842,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk3ZnFkaCtxZjFqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk3Zm0yZittaHV0QGVHcm91cHMuY29tPg=="},"prevInTopic":44841,"nextInTopic":44845,"prevInTime":44841,"nextInTime":44843,"topicId":44835,"numMessagesInTopic":0,"msgSnippet":"Thank you everyone. Reading how to handle it positively has helped to calm me. Dh will still overreact but I m prepared for that. I know that she needs my","messageBody":"<div id=\"ygrps-yiv-623883233\">Thank you everyone. Reading how to handle it positively has helped to calm me. Dh will still overreact but I&#39;m prepared for that. I know that she needs my sympathy, but what about those times when I&#39;m not ready for that? Is it ok to just tell her that I need a few minutes before dealing with her while I go and calm myself?<br/>\nBonni</div>","specialLinks":[]},{"userId":209361242,"authorName":"JJ","from":"&quot;JJ&quot; &lt;jrossedd@...&gt;","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: losing things all the time","postDate":"1285249949","msgId":44841,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk3Zm0ydCs1ZmZnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3NDk4NS4yOTUyMS5xbUB3ZWI4NjIwOC5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":44840,"nextInTopic":44842,"prevInTime":44840,"nextInTime":44842,"topicId":44835,"numMessagesInTopic":0,"msgSnippet":"There s nothing about the attitude of that ll teach you a lesson that comes across as educational, much less helpful or loving. Still, losing things can lead","messageBody":"<div id=\"ygrps-yiv-1150701170\">There&#39;s nothing about the attitude of &quot;that&#39;ll teach you a lesson&quot; that comes across as educational, much less helpful or loving. Still, losing things can lead to at least two kinds of good learning opportunities: practical tricks for remembering where to find things when she wants them, AND deepening her moral sense of how much more important it is to care about people than about things.<br/>\n<br/>\nIn our family these ideas might have been less painful for the kids to internalize, because the loss was mine. We were hurrying to get the children to a dress rehearsal for a singing and dancing show; their dad&#39;s mother had flown across the country to stay with us and see it. I was washing up in the kitchen right before we all piled in the van with costumes, cameras and such, and got on the highway. I was driving. I glanced at my hands on the wheel and realized my wedding rings were gone: my diamond engagement ring, my wedding band and also my mother&#39;s diamond wedding band I had inherited when she passed away. The most valuable possessions I owned in both senses of the word -- thousands of dollars and lifetimes of meaning that went everywhere with me.<br/>\n<br/>\nI figured I&#39;d left them by the sink. I desperately wanted to pull over and go straight home to search; I felt lost and incomplete and panicked. Mother-in-law suggested it and said if they really were by the sink, it would be quick and we wouldn&#39;t be too late. I wanted to! -- how could I wait hours, pretend it didn&#39;t matter, go make mom smalltalk and then sit and clap for my kids, looking at my hands the whole time and seeing what I was missing?<br/>\n<br/>\nInstead I thought about my mom and that she would care more about the kids&#39; day than her rings or mine, and would want me to, too. And I realized that I did. And told them so.  <br/>\n<br/>\nWe went on and had a great show, even went out to dinner after for a little family celebration before going home. Then everyone whole-heartedly helped me tear the house apart, that night and for many days after. The rings were never found but in a way they were replaced with some very valuable power of story. it might have been one of our best days together. I think Mom would be so proud of them -- and of me too. :)  <br/>\n<br/>\nJJ<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nSchuyler &lt;s.waynforth@...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; People lose things. People break things. Things don&#39;t tend to remain pristine or with their original owners for always. Sympathy is a good response. Trying to help her keep track of things and talking about what is too valuable to her to go with her everywhere may help. Getting means to keep track of things more easily. Getting a case for an iPod that she can hang off her neck, if that would be an accessory she would be comfortable with. I know it&#39;s a bit of closing the barn door after the horse got out, but thinking of ways to help her keep track of things is far better than punishing her for losing something. Breathe and recognise that the loss is hers.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: losing things all the time","postDate":"1285249935","msgId":44840,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk3Zm0yZittaHV0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQyMDA0My41NDE2OC5xbUB3ZWI1NDYwNy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":44839,"nextInTopic":44841,"prevInTime":44839,"nextInTime":44841,"topicId":44835,"numMessagesInTopic":0,"msgSnippet":"... I haven t read the other replies yet but wanted to comment on this, in particular. Some people are really good at keeping up with things, and others not so","messageBody":"<div id=\"ygrps-yiv-1059429462\">b prince &lt;flyingtwinsmom@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; My daughters are always misplacing and losing things.<br/>\n<br/>\n </span></blockquote>I haven&#39;t read the other replies yet but wanted to comment on this, in particular. Some people are really good at keeping up with things, and others not so much. I used to be the person who was always misplacing things, despite having been &quot;raised&quot; with punishment for losing possessions.<br/>\n<br/>\nAfter Mo was born I started keeping careful track of certain things - specifically my sewing things, since they can be dangerous to toddlers. So once Mo got to the age where she had specific things that needed to be kept track of, I&#39;d had some practice. It helps *me* to focus on just a few things. Mo regularly misplaces things, so I have strategies for keeping track of those things. It worked better when I was the at-home parent - now that I&#39;m working, I find I have to backtrack through her projects rather than knowing where I&#39;m likely to find something. <br/>\n<br/>\nI haven&#39;t ever seen inflicting punishment on someone for losing something to be effective. When Ray was in school and losing school work, it actually set him up to avoid *doing* his school work - he knew he was likely to be punished anyway, so why bother? As well for a sheep as a lamb, as they say. <br/>\n<br/>\nHelp your daughter keep up with her things. It won&#39;t likely make any difference at all in how much she loses them, but it Will create more peace and harmony in your home, and let your daughter see you as a valuable ally, rather than an adversary. <br/>\n<br/>\n---Meredith (Mo 9, Ray 17)</div>","specialLinks":[]},{"userId":139136574,"authorName":"Jeanette","from":"Jeanette &lt;jeanettec_99@...&gt;","profile":"jeanettec_99","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] losing things all the time","postDate":"1285246996","msgId":44839,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk0NjMyOC41NDc2LnFtQHdlYjM2MTA4Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":44838,"nextInTopic":44840,"prevInTime":44838,"nextInTime":44840,"topicId":44835,"numMessagesInTopic":0,"msgSnippet":"We found my son s lost DS 4 months after he lost it. We were just about to buy a used one from our neighbor before we found it the other day : )!  It was/is","messageBody":"<div id=\"ygrps-yiv-1198856717\">We found my son&#39;s lost DS 4 months after he &quot;lost&quot; it. We were just about to buy a used one from our neighbor before we found it the other day : )!  It was/is a standing joke in my house how often I lost money....so for some reason I &quot;get&quot; how these things happen.  I tend to have a one track mind : ).....has it&#39;s positives and negatives.  <br/>\n<br/>\nJeanette Wilson<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sep 22, 2010, at 11:56 PM, b prince &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:flyingtwinsmom@...\">flyingtwinsmom@...</a>&gt; wrote:<br/>\n<br/>\nI know this doesn&#39;t apply directly to unschooling, but it does apply to the <br/>\nlifestyle. My daughters are always misplacing and losing things. The latest is a <br/>\nreal kicker. She has lost her purse, which she borrowed from me. She thinks her <br/>\niPod touch and her DS were in it. DH is going to flip. It&#39;s been gone over a <br/>\nweek and we can&#39;t remember any place that she might have left it although we do <br/>\nremember when she last had it. The old me would ground her and make her work it <br/>\noff. I am very, very mad about it, but I don&#39;t want to damage our relationship <br/>\nover &quot;things.&quot; I need suggestions on a more loving way to handle this.<br/>\nBonni<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] losing things all the time","postDate":"1285232777","msgId":44838,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3NDk4NS4yOTUyMS5xbUB3ZWI4NjIwOC5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDQyMDA0My41NDE2OC5xbUB3ZWI1NDYwNy5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDQyMDA0My41NDE2OC5xbUB3ZWI1NDYwNy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":44837,"nextInTopic":44839,"prevInTime":44837,"nextInTime":44839,"topicId":44835,"numMessagesInTopic":0,"msgSnippet":"It is actually possible that you could make an insurance claim against your home insurance. Start with the knowledge that she didn t do it on purpose. Start","messageBody":"<div id=\"ygrps-yiv-3751308\">It is actually possible that you could make an insurance claim against your home <br/>\ninsurance. <br/>\n<br/>\n<br/>\nStart with the knowledge that she didn&#39;t do it on purpose. Start from there. <br/>\nMove to the fact that she lost some things that were very valuable to her. If <br/>\nSimon or Linnaea lost their iPods or their Ds&#39;s they would be really, really <br/>\nunhappy and sad. Don&#39;t add to her sadness, her sense of loss the guilt over <br/>\nhaving failed to uphold your standards of keeping track of things. Have you ever <br/>\nlost something? I&#39;ve lost my keys. I&#39;ve lost money, I&#39;ve lost jewelry. I&#39;ve lost <br/>\na fair number of things. <br/>\n<br/>\n<br/>\nThere is a book by  L.Frank Baum, the author of the Wizard of Oz and many of the <br/>\nsubsequent books, called Dot and Tot in Merryland. It&#39;s about a little girl and <br/>\na littler boy who go in a row boat through a tunnel that gets them into a sort <br/>\nalternate world. As they float along they pass through different states within <br/>\nthis world. One is a place where everything and everyone is made out of candy. <br/>\nMy memory is that Tot gets in trouble for biting someone, although they just <br/>\ntake the someone to the candy maker and he replaces the bitten off bit. One <br/>\nstate is the place where babies come from, with storks on hand to care for them <br/>\nand to deliver them. One valley is filled with the things that people have lost. <br/>\nIt starts with mundane things, things like pins and buttons and hairpins and <br/>\nlead-pencils of varying degrees of newness. There is a morality tale of little <br/>\nboys losing their coats and hats because they don&#39;t hang them up properly. There <br/>\nare rings and pennies and most &#39;specially is Tot&#39;s doll Jane who has been well <br/>\nand truly loved and he is so pleased to find her. I always felt sad to think of <br/>\na whole realm in an imaginary land given over to things people have lost. I <br/>\nthink it would have been fun if they&#39;d been ordered by epoch, but that was <br/>\nprobably outside of L.Frank Baum&#39;s remit. It was just a thought maybe, maybe one <br/>\nof his children had lost a doll named Jane recently and he wanted to give them a <br/>\nmoment of hope that she existed somewhere. <br/>\n<br/>\n<br/>\nPeople lose things. People break things. Things don&#39;t tend to remain pristine or <br/>\nwith their original owners for always. Sympathy is a good response. Trying to <br/>\nhelp her keep track of things and talking about what is too valuable to her to <br/>\ngo with her everywhere may help. Getting means to keep track of things more <br/>\neasily. Getting a case for an iPod that she can hang off her neck, if that would <br/>\nbe an accessory she would be comfortable with. I know it&#39;s a bit of closing the <br/>\nbarn door after the horse got out, but thinking of ways to help her keep track <br/>\nof things is far better than punishing her for losing something. Breathe and <br/>\nrecognise that the loss is hers. Except for the purse. I guess that&#39;s your loss, <br/>\ntoo. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: b prince &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:flyingtwinsmom@...\">flyingtwinsmom@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Thursday, 23 September, 2010 4:56:34<br/>\nSubject: [unschoolingbasics] losing things all the time<br/>\n<br/>\nI know this doesn&#39;t apply directly to unschooling, but it does apply to the <br/>\nlifestyle. My daughters are always misplacing and losing things. The latest is a <br/>\n<br/>\nreal kicker. She has lost her purse, which she borrowed from me. She thinks her <br/>\niPod touch and her DS were in it. DH is going to flip. It&#39;s been gone over a <br/>\nweek and we can&#39;t remember any place that she might have left it although we do <br/>\nremember when she last had it. The old me would ground her and make her work it <br/>\noff. I am very, very mad about it, but I don&#39;t want to damage our relationship <br/>\nover &quot;things.&quot; I need suggestions on a more loving way to handle this.<br/>\nBonni<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":228546675,"authorName":"Deena Seckinger","from":"Deena Seckinger &lt;seckingerfamily@...&gt;","profile":"seckingerfamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] losing things all the time","postDate":"1285218104","msgId":44837,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3ODMyMy40NzcyNC5xbUB3ZWIzODQwOC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDQyMDA0My41NDE2OC5xbUB3ZWI1NDYwNy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":44835,"nextInTopic":44838,"prevInTime":44836,"nextInTime":44838,"topicId":44835,"numMessagesInTopic":0,"msgSnippet":"Try to imagine it s your purse or dh s briefcase.  You would be absolutely sick to your stomach over it and having someone else shame you wouldn t help at","messageBody":"<div id=\"ygrps-yiv-2003990598\">Try to imagine it&#39;s your purse or dh&#39;s briefcase.  You would be absolutely sick to your stomach over it and having someone else shame you wouldn&#39;t help at all.  I left my purse (which I usually don&#39;t carry) at the bowling alley once and realized it when we pulled into our driveway.  Recently, our 12 y.o. left her cell phone in an airport bathroom.  In both instances, we were almost physically ill about it.  Both times we returned to the scene and both times the objects were gone.  However, both times someone found them and turned them in and we were able to recover the items.<br/>\n<br/>\nIf your husband left his briefcase behind somewhere, then certainly you wouldn&#39;t shame or berate him for being irresponsible or for the cost of the contents so consider how loving and supportive you would be to him and show that same concern and support for dd.  Also have her call every business you frequent even if you don&#39;t remember going there &quot;recently&quot;.  File a police report (if you can) or at least call to see if anyone turned it in.  She&#39;s already experiencing the &quot;logical consequence&quot; because she doesn&#39;t have any of her stuff and isn&#39;t getting it replaced.  This is the time to care for her the way you would want to be cared for if you got wrapped up in a conversation at a restaurant and walked out without your purse only to discover it gone.<br/>\n<br/>\nAs for the reality, visit this website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.identitytheftlabs.com/stolen-wallet-purse/\">http://www.identitytheftlabs.com/stolen-wallet-purse/</a> (if the link doesn&#39;t go through, google &quot;what to do if I lost my purse&quot; and help her go through the steps.  The good news if there was identification in it, you might get it back.  The bad news if there was identification in it, someone might steal her identity knowing you won&#39;t be checking/needing her credit for several years (identity theft victims &lt;16 are the highest group).<br/>\n<br/>\nI hope this helps,<br/>\n<br/>\nDeena in McDonough, GA<br/>\n<br/>\n<br/>\n<br/>\n&quot;Everybody is a genius. But if you judge a fish by its ability to climb a tree, it will live its whole life believing that it is stupid.&quot; — Albert Einstein<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":191799655,"authorName":"b prince","from":"b prince &lt;flyingtwinsmom@...&gt;","profile":"flyingtwinsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"losing things all the time","postDate":"1285214194","msgId":44835,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMDA0My41NDE2OC5xbUB3ZWI1NDYwNy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":44837,"prevInTime":44834,"nextInTime":44836,"topicId":44835,"numMessagesInTopic":0,"msgSnippet":"I know this doesn t apply directly to unschooling, but it does apply to the lifestyle. My daughters are always misplacing and losing things. The latest is a ","messageBody":"<div id=\"ygrps-yiv-697492258\">I know this doesn&#39;t apply directly to unschooling, but it does apply to the <br/>\nlifestyle. My daughters are always misplacing and losing things. The latest is a <br/>\nreal kicker. She has lost her purse, which she borrowed from me. She thinks her <br/>\niPod touch and her DS were in it. DH is going to flip. It&#39;s been gone over a <br/>\nweek and we can&#39;t remember any place that she might have left it although we do <br/>\nremember when she last had it. The old me would ground her and make her work it <br/>\noff. I am very, very mad about it, but I don&#39;t want to damage our relationship <br/>\nover &quot;things.&quot; I need suggestions on a more loving way to handle this.<br/>\nBonni<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":44852,"nextTopicId":44876}}