{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":896746,"authorName":"kellyinsc","from":"&quot;kellyinsc&quot; &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Letter from Harvard alumnus","postDate":"1330118981","msgId":47936,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppOHZnNSt0MTdmQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":47935,"nextInTime":47937,"topicId":47936,"numMessagesInTopic":0,"msgSnippet":"Below is a letter from a Harvard alumnus who interviews prospective students. Too many parents contact me about college concerns---often when the child is nine","messageBody":"<div id=\"ygrps-yiv-797269116\">Below is a letter from a Harvard alumnus who interviews prospective students. <br/>\n<br/>\nToo many parents contact me about college concerns---often when the child is nine or ten. Things change in education/college admissions sooo much in eight to ten years: don&#39;t let today&#39;s worries concern you! Spend more time exposing your child to interesting things, people, and situations. Don&#39;t try to make your child&#39;s application look like every other high school graduate: He&#39;s NOT! Your child&#39;s portfolio should bowl over an alumnus or admission officer! Make it different! Let your child SHINE!<br/>\n<br/>\nDear Eighth Grader:<br/>\n<br/>\nCollege interview season is drawing to a close. Hundreds of thousands of high school seniors would like to believe that they have secured admission to prestigious colleges by impressing alumni like me with their sterling credentials and conversational aptitude.<br/>\n<br/>\nOur meeting will not take place for four years. I hope you don&#39;t think it too presumptuous of me to give you some things to think about now, at this early juncture -- to help you prepare.<br/>\n<br/>\nI have three kids of my own, including an eighth grader like you. My house will still be pretty noisy in 2016 -- so, let&#39;s meet at Einstein&#39;s, the bagel place. I&#39;ll be the one doing the crossword puzzle.<br/>\n<br/>\nI&#39;ve been conducting Harvard interviews for many years. Even though I graduated from Harvard, I feel somewhat like a poser. I know to a moral certainty that, if I were to apply to the college today, the chances of my getting in would be less than zero. Admission standards have grown more rigorous over the last quarter century. Sometimes, it&#39;s good to be older.<br/>\n<br/>\nI interview applicants because it&#39;s fun. I like hearing about what&#39;s going on in your youthful world, one that is now largely foreign to me. And, unlike my own kids, when I ask questions, applicants have to answer. I like that, too.<br/>\n<br/>\nA friend recently asked me whether I interview because I like to wield power -- like Commodus in Gladiator, whose &quot;thumbs up&quot; gesture in the Coliseum meant life or death.<br/>\n<br/>\nBut my powers are hardly imperial. I am not a gatekeeper. A lot of kids about whom I write enthusiastic recommendations do not get in to Harvard. Some people say that the whole interview process is just an elaborate ruse intended to increase alumni donations. Still, my reports must count for something, because, when they are late, I receive testy emails admonishing me.<br/>\n<br/>\nThe first thing you should know is that great test scores and grade point averages do not, standing alone, excite me. If I had one candy-coated chocolate for every kid I&#39;ve interviewed with an ACT score of 34, I could fill an industrial-size bag of M&Ms that Costco sells for $8.99. High grades? These days, in this era of hyper grade inflation, who doesn&#39;t get a four point gazillion GPA?<br/>\n<br/>\nYou can leave at home the curriculum vitae printed on bond paper. I know you&#39;ll be well rounded. You&#39;ll play midfield on the varsity soccer team, clarinet in the symphony band and Benny Southstreet in Guys and Dolls. The exhortations of guidance counselors, over-invested parents and the authors of College Admissions for Dummies will guarantee that.<br/>\n<br/>\nGiven that so many candidates have outstanding credentials, you may think that it will be impossible for you to stand out. Not true. The special kid announces herself boldly, unmistakably; she can&#39;t be missed -- like a flare streaking across a starless nighttime sky.<br/>\n<br/>\nWhat do I look for? Qualities that are hard to spot on admissions applications, but ones that scream out during probing conversation: passion, intellect, curiosity and mettle.<br/>\n<br/>\nSo, when I ask you to explain why you say you dislike the president, it&#39;d be best for you to do more than mimic the political prejudices of your parents. Please show that you&#39;ve given issues like that some independent thought.<br/>\n<br/>\nAnd, if the conversation happens to turn toward your belief in God, I would love to hear the basis for that belief, that you&#39;ve wrestled with questions of faith and that you&#39;ve developed an intellectual construct that takes into account doubt and opposing points of view.<br/>\n<br/>\nI&#39;ll want to learn whether an exciting idea has ever overtaken you, whether you&#39;ve ever had an epiphany, a &quot;eureka&quot; moment.<br/>\n<br/>\nHow did the universe begin? What are your most troubling personal weaknesses? Does your high school have a caste system, and, if so, how do you fit into, and feel about, it? Where does morality come from? What&#39;s more important, reason or passion? What&#39;s the last book you read outside of school that changed the way you think about something important? What did you do to motivate yourself to make the varsity tennis team?<br/>\n<br/>\nDo you have answers to these questions? Have you even thought about them?<br/>\n<br/>\nIn his recent book, The Social Animal, David Brooks describes how a high school student might transform himself into a prodigious thinker, a generator of original ideas, a traveler on the road to wisdom. The journey is one that will be defined by struggle, by reading and re-reading books that may be hard to understand, by challenging assumptions, by trying to harness and unify stray and random thoughts, by cultivating expertise.<br/>\n<br/>\nWhen you and I meet, will you have set out on this intellectual voyage? Will you be energized or enervated by your odyssey? Or will you have forsaken the journey altogether, seduced by Facebook, the Disney Channel and other opiates?<br/>\n<br/>\nAnd, by the way, you won&#39;t have to be an extra-curricular &quot;superstar&quot; to impress me. It&#39;ll be okay if you&#39;re not elected class president or named to the all-state lacrosse team.<br/>\n<br/>\nBut I will investigate whether you are disciplined, whether you are a dilettante, whether you know how to energetically commit yourself to something about which you say you care. Alternatively, I will ask myself whether your words are your own and whether your activities are cynically calculated to win admissions to an Ivy League school.<br/>\n<br/>\nI recently interviewed a girl who easily won me over (she got into Harvard), not because her accomplishments were spectacular, but because her opinions were well-formed but humbly-stated, because her passion for cross-country compelled her to run at least five miles almost every day since ninth grade and because she waxed sentimental about polka dancing, an activity that does not appear prominently on the radar screens of most college admissions officials.<br/>\n<br/>\nThere aren&#39;t too many kids out there like that. So, if you&#39;re one of them, you&#39;ll have a leg up, at least in my eyes.<br/>\n<br/>\nI am writing to you now, years before our meeting, because I think you&#39;ll need time to work on some of these things. Intellectual ambition, drive and zest for discovery can&#39;t be turned on and off like a light switch.<br/>\n<br/>\nWe only cultivate these characteristics slowly, and we do so only by conquering apathy and peer pressure, by shunning minimalism and materialism and by appreciating the positive correlation between effort and reward. As Aristotle observed, &quot;We are what we repeatedly do. Excellence, then, is not an act but a habit.&quot;<br/>\n<br/>\nFrankly, it&#39;s not really that important whether you go to Harvard. There are a lot of Harvard graduates who do not lead productive lives. And, of course, Harvard and other comparable schools have not cornered the market on success.<br/>\n<br/>\nBut, irrespective of where you go to college, I think this is true: If you prepare for our interview in the manner I have suggested, your adult life is far more likely to be intellectually rich, rewarding and happy. The world will be a more exciting place for you.<br/>\n<br/>\nSo, future Harvard applicant, I&#39;m looking forward to having a great discussion with you four years from now. In the meantime, log out of Facebook, for goodness sake.<br/>\n<br/>\nWarm regards,<br/>\n<br/>\nAndy Doctoroff &#39;85</div>","specialLinks":[]}],"prevTopicId":47929,"nextTopicId":47941}}