{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Worth fighting for?","postDate":"1269093617","msgId":43422,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcyNjE5QzM2LUJFOTQtNDlBNy05RDM5LUNBMjMyMTA1NUNEOEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGhvMGNtNStxOXF1QGVHcm91cHMuY29tPg==","referencesHeader":"PGhvMGNtNStxOXF1QGVHcm91cHMuY29tPg=="},"prevInTopic":43409,"nextInTopic":0,"prevInTime":43421,"nextInTime":43423,"topicId":43406,"numMessagesInTopic":0,"msgSnippet":"... The idea sounds good because it s based on the assumption that what s learned to meet state requirements has meaning outside of school. The requirements","messageBody":"<div id=\"ygrps-yiv-1729817360\">On Mar 19, 2010, at 1:36 PM, gcriminy wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Now, my partner&#39;s feeling is that, since we were doing so well  <br/>\n&gt; already, why not use a little of every day to make sure we&#39;re at or  <br/>\n&gt; past state requirements, and then use the rest of the day to do  <br/>\n&gt; whatever we want.<br/>\n<br/>\n </span></blockquote>The idea sounds good because it&#39;s based on the assumption that what&#39;s  <br/>\nlearned to meet state requirements has meaning outside of school.<br/>\n<br/>\nThe requirements look like they have meaning. It&#39;s hard to argue that  <br/>\nkids won&#39;t need to count, recognize number patterns, add and so on!  <br/>\nThe assumption is that educators know the best methods to get that  <br/>\nknowledge into kids.<br/>\n<br/>\nThe original purpose of public education, and the reason schools use  <br/>\nthe methods they do, is the goal was to *cheaply* raise the *minimum*  <br/>\nlevel of education of what was becoming a heavily immigrant  <br/>\npopulation at the turn of the 1900s. They wanted the kids prepared  <br/>\nfor factory work with a functional education in the English language,  <br/>\nmath and reading.<br/>\n<br/>\nAssembly lines were all the rage back then. They were an amazing  <br/>\nprocess that employed fewer workers who could turn out a larger  <br/>\nnumber of uniform products. And when you step back away from school  <br/>\nand look at them with that eye, you can see the structure. One worker  <br/>\n(teacher) gets as much raw material as she can handle (30ish  <br/>\nstudents) and applies one process to them (the grade&#39;s curriculum)  <br/>\nand then passes them onto the next worker (the next grade&#39;s teacher)  <br/>\non the assembly line.<br/>\n<br/>\nBut ever since the late 1950&#39;s (when the Russians beat us into space)  <br/>\nschools have been asked to do way more than they&#39;re designed for.  <br/>\nThey really aren&#39;t designed to get the maximum number of kids  <br/>\npossible into college. (And if you speak to college professors, it&#39;s  <br/>\npretty clear they don&#39;t think much of the preparation of most  <br/>\nstudents! Most kids just see college as 4 more years of hoops to jump  <br/>\nthrough to get to a job. Way too many students want to do the minimum  <br/>\npossible to get the grade and the piece of paper. *That&#39;s* what  <br/>\nschools have trained them to value.)<br/>\n<br/>\nIt&#39;s not that teachers don&#39;t care. It&#39;s that they&#39;re stuck with a  <br/>\nmodel that works against how people naturally learn. Learning  <br/>\ninformation out of context in someone else&#39;s order is hard *not*  <br/>\nbecause learning is hard. Learning is natural and easy! It&#39;s because  <br/>\nwe don&#39;t learn by memorizing someone else&#39;s understanding of the  <br/>\nworld. We learn best and naturally by figuring out what fascinates  <br/>\nus. Most teachers will grouse about how much kids have forgotten over  <br/>\nthe summer. They say it&#39;s like the kids never learned anything the  <br/>\nyear before.<br/>\n<br/>\nThat&#39;s because the method schools use is best for proving information  <br/>\nis going in, eg, teachers are doing their job. It&#39;s hard to test to  <br/>\nsee if kids understand what they&#39;re memorizing.<br/>\n<br/>\nUnschooling avoids that. Unschooling matches how humans -- all  <br/>\nthinking animals really -- learn: by exploring what intrigues them,  <br/>\nby drawing understanding from doing and trying out what interests  <br/>\nthem and seeing how those things work and don&#39;t work. That process  <br/>\n*looks* totally inefficient! It doesn&#39;t look like it&#39;s heading  <br/>\nanywhere. But it builds on their strengths and interests. It&#39;s the  <br/>\nprocess that kids use to acquire language, that works so effortlessly  <br/>\nto move them from not knowing language exists to competency in a few  <br/>\nyears. (Compare that to the school process of trying to put Spanish  <br/>\ninto kids heads over 2 years. How many words do most people remember  <br/>\nfrom those years? Other than &quot;el escritorio&quot; (school desk) and &quot;el  <br/>\nlibro&quot; that we learned on the first day, all my Spanish is words I&#39;ve  <br/>\npicked up from repetition in real life. 2 words in 2 years is what  <br/>\nI&#39;d call inefficient!)<br/>\n<br/>\nThese might help ease his worries that it&#39;s harmful to not keep up  <br/>\nwith schools.<br/>\n<br/>\nProducts of Education<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/joyce/products\">http://sandradodd.com/joyce/products</a><br/>\n<br/>\nWhy You Can&#39;t Let Go<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/joyce/talk\">http://sandradodd.com/joyce/talk</a><br/>\n<br/>\nWhy schools use the methods they do<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/academics/whyschoolsdusewhattheydo.html\">http://joyfullyrejoycing.com/academics/whyschoolsdusewhattheydo.html</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think my partner may put his foot down and insist that we keep up  <br/>\n&gt; a more school-at-home atmosphere.<br/>\n<br/>\n </span></blockquote>Better to find what will help him feel comfortable way before he  <br/>\nreaches the &quot;I can&#39;t take it anymore!&quot; point ;-)<br/>\n<br/>\nAsk him what small things will help him feel comfortable. As you go  <br/>\nthrough your day, be aware of what your daughter&#39;s doing and take  <br/>\nmental notes of what the two of you explored and discovered so you  <br/>\ncan tell him when he comes home. Keep a blog with pictures and scans.  <br/>\n(This is good for relatives too :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know in part, he feels as if my daughter and I are on permanent  <br/>\n&gt; vacation, whilst he slaves away in the working world, and I think  <br/>\n&gt; the unschooling reinforces that view.<br/>\n<br/>\n </span></blockquote>What are some nice things you can do for him that will make him feel  <br/>\nhis efforts are appreciated? Help him feel he&#39;s part of the team  <br/>\nrather than the funder of you and your daughter&#39;s team?<br/>\n<br/>\nHis favorite meals on Friday nights? Love notes? What&#39;s his primary  <br/>\n&quot;love language&quot;?<br/>\n<br/>\n(Gary Chapman posited there are 5 primary ways of expressing love and  <br/>\nwhile they&#39;re all meaningful, most of us lean toward one feeling most  <br/>\nlike an expression of love.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.5lovelanguages.com/learn-the-languages/the-five-love-\">http://www.5lovelanguages.com/learn-the-languages/the-five-love-</a> <br/>\nlanguages/<br/>\n<br/>\nIt&#39;s a rare relationship that returns more than the sum total --  <br/>\ncounting both deposits and withdrawals -- that goes into it.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Worth fighting for?","postDate":"1269031168","msgId":43409,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvMG5lMCtoOGI5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhvMGNtNStxOXF1QGVHcm91cHMuY29tPg=="},"prevInTopic":43406,"nextInTopic":43422,"prevInTime":43408,"nextInTime":43410,"topicId":43406,"numMessagesInTopic":0,"msgSnippet":"... -and also- ... From an *academic* standpoint things were going well. From an emotional standpoint, not very well at all. Its Normal for homeschool parents","messageBody":"<div id=\"ygrps-yiv-1619822843\">I&#39;m going to set two things you said next to each other and maybe that will help you see where some of your discomfort is coming from. You said:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I stopped making her do &#39;school&quot; and she seems much happier, and best of all ;-), happier with me and less likely to have tantrums with myself as the focus.&lt;&lt;<br/>\n<br/>\n </span></blockquote>-and also-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;we were doing so well&lt;&lt;<br/>\n<br/>\n </span></blockquote>From an *academic* standpoint things were going well. From an emotional standpoint, not very well at all. Its Normal for homeschool parents to fight with their kids on a regular basis, even the kids who &quot;do well&quot;. Its a natural result of being made to do something by someone else. That&#39;s something to consider. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I know in part, he feels as if my daughter and I are on permanent vacation, whilst he slaves away in the working world, and I think the unschooling reinforces that view.<br/>\n </span></blockquote>************<br/>\n<br/>\nRather than trying to make your dd a different kind of slave (to use your analogy) what about doing what you can to help your dh feel like a loved and valued member of the family? Let him know in ways that seem meaningful to him that you care for him and all he does for y&#39;all. Think about what seems to work for him in those terms - it could be words, or backrubs or letting him buy more electronics than you really &quot;need&quot; or whatever. Keep in mind that sex helps, too - find more ways to let him know he&#39;s sexy and love him up! That can make a bigger difference for men than women realize, sometimes - their libido gets tied into their emotional needs in different ways than ours. <br/>\n<br/>\nSomething else that can help with parents who work outside the home is to give regular &quot;updates&quot; about your day, what sorts of things your dd is doing during the day. If he&#39;s concerned about educational issues, you can start off with an educational context: this is what she learned about, these are skills she practices, etc. Here&#39;s a link to give  you some ideas in that direction:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschoolingcurriculum.html\">http://sandradodd.com/unschoolingcurriculum.html</a><br/>\n<br/>\nYou might also check out sources like Mindware for... I don&#39;t want to say &quot;educational toys&quot; it sounds so stodgy, these are &quot;geek toys&quot; designed to be fun *and* you get to learn something too. We love Mindware stuff &#39;round here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mindwarewholesale.com/Home/Index.aspx\">http://www.mindwarewholesale.com/Home/Index.aspx</a><br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":335624523,"authorName":"gcriminy","from":"&quot;gcriminy&quot; &lt;senlin_says@...&gt;","profile":"gcriminy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Worth fighting for?","postDate":"1269020165","msgId":43406,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvMGNtNStxOXF1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":43409,"prevInTime":43405,"nextInTime":43407,"topicId":43406,"numMessagesInTopic":0,"msgSnippet":"Hello, everyone. I recently joined this group and I ve been enjoying all of the postings so much. I m going to jump right in with a question. My daughter (an","messageBody":"<div id=\"ygrps-yiv-7984624\">Hello, everyone. <br/>\n<br/>\n    I recently joined this group and I&#39;ve been enjoying all of the postings so much. I&#39;m going to jump right in with a question. My daughter (an only child) is six. If she were in public school she would be in kindergarten right now. We were using an online curriculum as well as workbooks, and she has finished and exceeded all the public school requirements for a first grader. Learning is very easy for her-- it&#39;s almost as if she knows everything already, and we really only needed to spend a few minutes per day on each school subject for her to grasp and retain the information.  About a month ago, I stopped making her do &#39;school&quot; and she seems much happier, and best of all ;-), happier with me and less likely to have tantrums with myself as the focus. Now, my partner&#39;s feeling is that, since we were doing so well already, why not use a little of every day to make sure we&#39;re at or past state requirements, and then use the rest of the day to do whatever we want. And I have to admit that I don&#39;t have a terrific answer as to why I feel so strongly that unschooling would be better.  I think my partner may put his foot down and insist that we keep up a more school-at-home atmosphere. So-- do I insist on the unschooling? What if my partner says that it&#39;s either school-at-home or public school? I know in part, he feels as if my daughter and I are on permanent vacation, whilst he slaves away in the working world, and I think the unschooling reinforces that view.<br/>\n<br/>\n   Any advice would be welcome. I&#39;ve posted a variation of this question on another list in the past few weeks, so please bear with me if you belong to that group also. Thanks in advance.  --Jennifer</div>","specialLinks":[]}],"prevTopicId":43388,"nextTopicId":43354}}