{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":28,"messages":[{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: dining was:Re: New here!","postDate":"1328405181","msgId":47899,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4MzUxQkRDNUJAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":47898,"nextInTopic":0,"prevInTime":47898,"nextInTime":47900,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"Exactly - sometimes we eat together - like tonight, it was pancake night, and that tends to not only have drippy sticky stuff involved but we always have","messageBody":"<div id=\"ygrps-yiv-1735311042\">Exactly - sometimes we eat together - like tonight, it was pancake night, and that tends to not only have drippy sticky stuff involved but we always have something of a buffet of toppings (tonight, there were probably 10 toppings on the table, sometimes it&#39;s more, sometimes less). That lends itself more to the table. On other nights (like rice and veggies), DS might come get his food then choose to go back to watching whatever he was watching on TV. DH and I will chat some and read magazines some. If DS is at the table with us, we&#39;ll mostly chat and then DH and I connect over the dishes (he washes, I dry and put away) while we listen to music. For the record, I work fulltime outside the home and DH is the full time at home parent. I connect with DS when I get home and we&#39;re setting out the dinnerware and such, I might go sit and watch him playing a videogame for a bit if he&#39;s in the middle of something and grab a hug when he&#39;s at a save point or a lull in the action. Oh, and now we&#39;ve got yet another dynamic because we&#39;ve got a friend staying with us, so incorporating her into things is a little different as well - not a &#39;dinner guest&#39; or overnight visitor, she&#39;s part of the household for the foreseeable future. And then sometimes (very sometimes) SIL, who also lives here, will actually choose to join us for dinner (often her work schedule and other activities mean she&#39;s either not around at dinner time or she&#39;s heading out to eat with her boyfriend). Dinner is ready at approximately the same time Monday-Saturday but no one is required to eat at that time or eat the same food - SIL rarely eats what we prepare even if she&#39;s around at dinnertime (Sunday dinners are typically potluck, grab leftovers or something when you get hungry). So, DS might choose to eat at 6 pm but he might pick tater tots with shredded cheddar instead of the pasta and sauce that was prepared. Or, he might decide that he wants pasta but isn&#39;t hungry or is in the middle of a quest in Skyrim and needs to hold off for 15 or 20 minutes, so he gets leftovers (reheated as necessary, with help if he needs or wants it). It&#39;s all flexible, as meets the needs of those involved. FWIW we always had family dinners when I was growing up and I generally enjoyed hanging out chatting with my folks. But, we were scattered to the four winds most of the day so it was nice to just be together at dinnertime. That dynamic is very different with my household now. I talk with DH (and DS) a couple times during the day, we email, etc. DH and DS are home together generally. I try to spend a bit of time with each of them when I get home to slip back into the &#39;family zone&#39; - whether it&#39;s over dinner and discussing an article in Smithsonian magazine or planning what to bring to the Super Bowl party (we&#39;re doing dips and dippers - three homemade dips, roasted red pepper hummus, guacamole, and queso - okay it&#39;s not exactly queso, it&#39;s vegan cheese-like sauce with salsa mixed in, and okay yeah it&#39;s Newman&#39;s Own salsa - and pita crisps, tortilla chips, and fresh veggies for dipping).<br/>\n<br/>\n--Deb R<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: New here!","postDate":"1328290270","msgId":47898,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjgyOTAyNzAuNjg3NjQuWWFob29NYWlsTmVvQHdlYjgxNTAxLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGpnaDFzbCs3cmlmQGVHcm91cHMuY29tPg==","referencesHeader":"PGpnYnRlaCtjb2wzQGVHcm91cHMuY29tPiA8amdoMXNsKzdyaWZAZUdyb3Vwcy5jb20+"},"prevInTopic":47897,"nextInTopic":47899,"prevInTime":47897,"nextInTime":47899,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"Another alternative is a used desktop or even laptop. If you child is a gamer a kindle fire won t do. My son is  a gamer and I am always looking on Craigslist","messageBody":"<div id=\"ygrps-yiv-1239079767\">Another alternative is a used desktop or even laptop. If you child is a gamer a kindle fire won&#39;t do.<br/>\nMy son is  a gamer and I am always looking on Craigslist for computers and I see decent desktops<br/>\nfo3 $200 or even less. Sometimes all you need to do is install a new graphics card ( if heavy gamer) and that can be $50 !<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":403692019,"authorName":"mairi.sasaki@gmail.com","from":"mairi.sasaki@...","profile":"mairi.sasaki","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: New here!","postDate":"1328288921","msgId":47897,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc4Njc3Njg1NS0xMzI4Mjg4OTIyLWNhcmRodV9kZWNvbWJvYnVsYXRvcl9ibGFja2JlcnJ5LnJpbS5uZXQtODcyMDgyOTgxLUBiNS5jNC5iaXNlNi5ibGFja2JlcnJ5Pg==","inReplyToHeader":"PDA2MTRENTc2RDFFMDRENDc5RTNBOEVDRUEwNEY2MUI1QFNoZXJ5bExhcHRvcD4=","referencesHeader":"PGpnZW9mNCs5OHRrQGVHcm91cHMuY29tPiAgPDA2MTRENTc2RDFFMDRENDc5RTNBOEVDRUEwNEY2MUI1QFNoZXJ5bExhcHRvcD4="},"prevInTopic":47896,"nextInTopic":47898,"prevInTime":47896,"nextInTime":47898,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"I am sure I am missing something obvious, but why would a family want to move away from eating together to everyone just snacking when they feel like? Our","messageBody":"<div id=\"ygrps-yiv-1786606203\">&quot;I am sure I am missing something obvious, but why would a family want to move away from eating together to everyone just snacking when they feel like? Our family meal times are such joyous occasions.&quot;\r<br/>\n\r<br/>\nIf family meals are joyous occasions, then it makes sense to have them. In our family the experience was very different.  For a few years we did family dinners based on the popular wisdom that it was good for family cohesion.  But our 5 year old is very intense in his playing and could care less about eating. Bringing him to the dinner table did not mean togetherness and connection to him. It meant that we were interrupting his play, ignoring what was important to him, forcing him to participate in something he didn&#39;t value.  When we announced dinner time, he screamed &#39;no!&#39; repeatedly in angry protest.  Each night. We&#39;d cajole and insist and physically carry him to the table where he was miserable and needed all of our attention, handling his protests and encouraging him to eat, just to get through the meal.  It wasn&#39;t joyous, it was miserable.  For all of us.\r<br/>\n\r<br/>\nMoving away from the rule that all families should eat dinner together towards the principles of looking to our own specific child&#39;s need for play, nutrition and connection was a move towards greater peace and happiness for all of us.  We now bring food to him while he is playing, and we eat ourselves.  Our son doesn&#39;t connect through breaking bread together.  He connects when we play with him.  So we shift our focus and energy from enforcing a family ritual to making sure we spend time playing together. \r<br/>\n\r<br/>\nJust one example of why some families might move away from family meals.\r<br/>\nMairi. \r<br/>\n\r<br/>\n-----Original Message-----\r<br/>\nFrom: &quot;Sheryl Lentine&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sheryl@...\">sheryl@...</a>&gt;\r<br/>\nSender: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>\r<br/>\nDate: Fri, 3 Feb 2012 00:34:34 \r<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;\r<br/>\nReply-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>\r<br/>\nSubject: Re: [unschoolingbasics] Re: New here!\r<br/>\n\r<br/>\nI am sure I am missing something obvious, but why would a family want to move away from eating together to everyone just snacking when they feel like?  Our family meal times are such joyous occasions.  We have 6 children, and they are all very busy and active with different projects and different interests going. I am involved with the kids all day, but meal time is the one time when we ALL come together.\r<br/>\n\r<br/>\n“If the kids are eating so much you&#39;re running out of food, you need to allocate more of your budget toward food, and/or find foods they like which are filling. If the trouble is you&#39;re transitioning from set meal times and limited availability to something more like grazing, then it&#39;s likely you&#39;re facing another logistical puzzle. The Kinds of foods you buy and prepare will need to change to make sure the kids can get all the nutrition they need in ways which work for them. It can help to think in terms of hors d&#39;oeuvres or finger foods - things which are easy for kids to eat without having to wait. Home-made baked goods are Great for keeping the house stocked with convenient, nutritious foods. There are other ideas here:”\r<br/>\nBlessings,\r<br/>\nSheryl\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n[Non-text portions of this message have been removed]\r<br/>\n\r<br/>\n\r<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"dining was:Re: New here!","postDate":"1328287951","msgId":47896,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRUIwQUI1QUM3OTI5NC1GNEMtMTE1QkNAd2VibWFpbC1kMDk0LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PDA2MTRENTc2RDFFMDRENDc5RTNBOEVDRUEwNEY2MUI1QFNoZXJ5bExhcHRvcD4=","referencesHeader":"PGpnZW9mNCs5OHRrQGVHcm91cHMuY29tPiA8MDYxNEQ1NzZEMUUwNEQ0NzlFM0E4RUNFQTA0RjYxQjVAU2hlcnlsTGFwdG9wPg=="},"prevInTopic":47895,"nextInTopic":47897,"prevInTime":47895,"nextInTime":47897,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"If everyone loves suppertime, the family should do that. Mine does often. Mealtimes are important to us. I love to cook, and I love to present the food well.","messageBody":"<div id=\"ygrps-yiv-1212061496\">If everyone loves suppertime, the family should do that. Mine does often.<br/>\n<br/>\n<br/>\nMealtimes are important to us. I love to cook, and I love to present the food well. But that doesn&#39;t mean that every meal is at the table together. <br/>\n<br/>\n<br/>\n<br/>\nSometimes Duncan (almost 16) wants to take his plate upstairs while he&#39;s gaming. Sometimes Ben (DH) and I take our plates to the coffee table and watch TV. Sometimes Duncan joins us there. Sometimes Ben and I dine outside on the deck. Duncan may or may not join us.<br/>\n<br/>\n<br/>\nCameron is 24 and is living somewhere else more than he&#39;s home; but when he&#39;s home, we&#39;re all much more likely to gather around the table. <br/>\n<br/>\n<br/>\nSome meals beg for the kitchen table (homemade sushi, for example---or breakfast for supper). Some are more coffeetable meals, like soup & bread, pizza or hot dogs.<br/>\n<br/>\n<br/>\nSometimes we dip our plates from the stove and sit down at the table or head for the den. Sometimes I put everything in table-safe bowls and serve family style---most often, that&#39;s when we sit at the kitchen table.<br/>\n<br/>\n<br/>\nGenerally when we have guests, we&#39;ll sit at the table---more room and more civilized. &lt;g&gt;<br/>\n<br/>\n<br/>\n<br/>\nWhen Cameron was in school, eating at the table was important to all of us because that was almost the only time when we could be together and share our days. Soon after changing to unschooling, we realized we didn&#39;t *need* that time (we get it throughout the day), so we drifted to a less formal way of dining. We *still* eat at 6:30 every evening: that allows Ben to get home, cool down (he rides 13 miles to & from work), and shower. Everyone knows when supper is. But if they&#39;re out, I always have leftovers in the refrigerator.<br/>\n<br/>\n<br/>\nThe children or Ben will often ask to sit at the table if we haven&#39;t had much together time with each other recently. That&#39;s *always* honored. When we eat at the table, we&#39;re more than likely to spend a LONG time afterwards chatting and joking. Not so much when we&#39;re around the coffee table. Not at all when we&#39;re spread out around the house for supper. <br/>\n<br/>\n<br/>\nSuppertime *can* be made into a chore for children if it ISN&#39;T joyous. I have many friends for whom suppertime was painful: no talking, too much adult chatter-none for kids, too many &quot;regulations,&quot; clean plate club, one &quot;no thankyou bite,&quot;  &quot;Dining with the Queen or President&quot; etiquette----too many nasty things that can make a child dread suppertime.<br/>\n<br/>\n<br/>\n<br/>\nNothing is written in stone: if it works and everyone is happy with it, do it. If not, step back and make changes. But don&#39;t do it just because some commercial/culture tells you to! &lt;G&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Sheryl Lentine &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sheryl@...\">sheryl@...</a>&gt;<br/>\n<br/>\nI am sure I am missing something obvious, but why would a family want to move <br/>\naway from eating together to everyone just snacking when they feel like?  Our <br/>\nfamily meal times are such joyous occasions.  We have 6 children, and they are <br/>\nall very busy and active with different projects and different interests going. <br/>\nI am involved with the kids all day, but meal time is the one time when we ALL <br/>\ncome together.<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":366861124,"authorName":"lvhomeschool","from":"&quot;lvhomeschool&quot; &lt;bryandmiss96@...&gt;","profile":"lvhomeschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New here!","postDate":"1328286421","msgId":47895,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpnaDFzbCs3cmlmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpnYnRlaCtjb2wzQGVHcm91cHMuY29tPg=="},"prevInTopic":47894,"nextInTopic":47896,"prevInTime":47894,"nextInTime":47896,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"Hi There: Hope it s okay to chime in. A kindle fire was a great alternative for us when we wanted to add something computerish for our 8 and 10 year olds. It","messageBody":"<div id=\"ygrps-yiv-579821765\">Hi There:<br/>\nHope it&#39;s okay to chime in.<br/>\nA kindle fire was a great alternative for us when we wanted to add something computerish for our 8 and 10 year olds. It gives them access to the Internet, Netflix, a host of games via apps and email. For us it was more affordable than the IPad or more computers, so we were able to get two. The only thing they can&#39;t do is print from it, but if they email a link or note to my MacBook we can print it that way. My 10 year old saw the commercials (she&#39;s a huge reading fan) and thought it&#39;d be neat to have the bells and whistles or a computer in a kindle. They also have the second generation kindle, handheld ds systems, leapsters, and we have a wii and Xbox 360. We didn&#39;t acquire these all at once but over time. Some were gifts for birthdays and holidays from my parents or brother.<br/>\nMy son is 5 and the wii and Xbox are his preferences. He and I play the wii every morning. But there are many times the older two lend my younger two their kindles to watch a movie or play a game during the day. And the littles are in the room with us while we may be doing something else.<br/>\nMy older girls tend to reach for their kindles when the rest of the house is asleep more often than not, they like being snuggled under the covers while emailing a family member or watching a movie.<br/>\nThere are enough options for everyone to have a choice of using something they enjoy.<br/>\nHope you find a solution which works for your family.<br/>\n~Melissa~<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; . I face some challenges here - the kids all love the computer and want to be on it all the time, but with 4 of them that doesn&#39;t really work. I want to give them the freedom to do the things they want, but they just end up bickering over it so I&#39;ve been limiting computer time to an hour each on weekends. Any thoughts on a better way to do it or how you deal with fighting? <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: New here!","postDate":"1328262642","msgId":47894,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjgyNjI2NDIuODY1MjkuWWFob29NYWlsTmVvQHdlYjg3MzA1Lm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDA2MTRENTc2RDFFMDRENDc5RTNBOEVDRUEwNEY2MUI1QFNoZXJ5bExhcHRvcD4=","referencesHeader":"PGpnZW9mNCs5OHRrQGVHcm91cHMuY29tPiA8MDYxNEQ1NzZEMUUwNEQ0NzlFM0E4RUNFQTA0RjYxQjVAU2hlcnlsTGFwdG9wPg=="},"prevInTopic":47893,"nextInTopic":47895,"prevInTime":47893,"nextInTime":47895,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"... want to move away from eating together to everyone just snacking when they feel like?  Our family meal times are such joyous occasions.  We have 6","messageBody":"<div id=\"ygrps-yiv-563933982\"><blockquote><span title=\"ireply\">&gt;&gt;I am sure I am missing something obvious, but why would a family <br/>\n </span></blockquote>want to move away from eating together to everyone just snacking when <br/>\nthey feel like?  Our family meal times are such joyous occasions.  We <br/>\nhave 6 children, and they are all very busy and active with different <br/>\nprojects and different interests going. I am involved with the kids all <br/>\nday, but meal time is the one time when we ALL come together.&lt;&lt;<br/>\n<br/>\nIf something works well for your family there isn&#39;t any real need to change it. For Simon and Linnaea and David and myself meal times, with all of us sitting at a table, have never been something that worked. Simon and Linnaea eat when they are hungry. That&#39;s what works really well in our home. Letting them be hungry until a set meal time has led to misery on at least one person&#39;s part. We do have dinner at roughly the same time every day, but what is feed is individual specific. So on pizza night, for example, I have something else &#39;cause while I like making pizza I don&#39;t like eating it. And the pizzas are individually tailored. Or on nights when David and I have curry we fix something else for Simon and Linnaea. <br/>\n<br/>\nUnschooling, radically unschooling, is about working to make the environment good for your child. It&#39;s about working to make it a rich and engaging place to be. Letting a child get hungry so that a tradition of a family dinner time at a table can be maintained isn&#39;t about the child, it&#39;s about the tradition. And I&#39;m not saying that you are doing that, but you asked why a family would want to move away from eating together, and my answer is because eating together wasn&#39;t more valuable than the comfort and well being of the children involved. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] New here!","postDate":"1328262368","msgId":47893,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2MkE1RDZCLTc3OTMtNDNBRS04NUZCLTc4NTEyM0MwNzk0NUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDA2MTRENTc2RDFFMDRENDc5RTNBOEVDRUEwNEY2MUI1QFNoZXJ5bExhcHRvcD4=","referencesHeader":"PGpnZW9mNCs5OHRrQGVHcm91cHMuY29tPiA8MDYxNEQ1NzZEMUUwNEQ0NzlFM0E4RUNFQTA0RjYxQjVAU2hlcnlsTGFwdG9wPg=="},"prevInTopic":47892,"nextInTopic":47894,"prevInTime":47892,"nextInTime":47894,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"... It helps to think outside the box. Many people find meals to be an opportunity for connecting. But the connection doesn t come automatically with eating","messageBody":"<div id=\"ygrps-yiv-1280361095\">On Feb 3, 2012, at 1:34 AM, Sheryl Lentine wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but why would a family want to move away from eating<br/>\n&gt; together to everyone just snacking when they feel like?<br/>\n&gt; Our family meal times are such joyous occasions.<br/>\n<br/>\n </span></blockquote>It helps to think outside the box. Many people find meals to be an opportunity for connecting. But the connection doesn&#39;t come automatically with eating together. And eating together isn&#39;t the only way to get it.<br/>\n<br/>\nWhat&#39;s making it work for your family might be the mix of personalities you have. What&#39;s making it work might be something in particular you&#39;re doing that&#39;s making it enjoyable for everyone. It might be your and your husband&#39;s personalities that draws people to you.<br/>\n<br/>\nThat&#39;s why &quot;This is what works for me,&quot; isn&#39;t good for this kind of list. What does work for this list is looking beneath the hood of ideas and figuring out *why* they work. Dig into the principles beneath what&#39;s going on. Think about how someone else with a totally different mix of personalities and needs can get it to work.<br/>\n<br/>\nThe meals when I was growing up where when my parents talked about daily stuff that mattered to them. It wasn&#39;t that my sister and I couldn&#39;t join in. They just weren&#39;t talking about things that interested us. They didn&#39;t make a point of drawing us in. That wasn&#39;t their priority for dinner time. <br/>\n<br/>\nUnless parents make it a priority to meet the kids&#39; needs for connection, it won&#39;t just happen by making everyone eat together. For parents and kids who aren&#39;t chatty, the parents are going to need to put in a great deal of thought on how they can make gathering at the dinner time each day a drawing point for the kids.<br/>\n<br/>\nFor us it worked to eat in front of the TV and watch shows and movies we all wanted to watch. The principle that made it work -- the why it worked -- is that we found an activity that was enjoyable for all of us and connected through that. That would be harder to do with a larger family but it worked for 3 people who aren&#39;t big talkers.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":409467702,"authorName":"Sheryl Lentine","from":"&quot;Sheryl Lentine&quot; &lt;sheryl@...&gt;","profile":"sheryl_lentine","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: New here!","postDate":"1328250874","msgId":47892,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2MTRENTc2RDFFMDRENDc5RTNBOEVDRUEwNEY2MUI1QFNoZXJ5bExhcHRvcD4=","inReplyToHeader":"PGpnZW9mNCs5OHRrQGVHcm91cHMuY29tPg==","referencesHeader":"PGpnZW9mNCs5OHRrQGVHcm91cHMuY29tPg=="},"prevInTopic":47891,"nextInTopic":47893,"prevInTime":47891,"nextInTime":47893,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"I am sure I am missing something obvious, but why would a family want to move away from eating together to everyone just snacking when they feel like?  Our","messageBody":"<div id=\"ygrps-yiv-1611159975\">I am sure I am missing something obvious, but why would a family want to move away from eating together to everyone just snacking when they feel like?  Our family meal times are such joyous occasions.  We have 6 children, and they are all very busy and active with different projects and different interests going. I am involved with the kids all day, but meal time is the one time when we ALL come together.<br/>\n<br/>\n“If the kids are eating so much you&#39;re running out of food, you need to allocate more of your budget toward food, and/or find foods they like which are filling. If the trouble is you&#39;re transitioning from set meal times and limited availability to something more like grazing, then it&#39;s likely you&#39;re facing another logistical puzzle. The Kinds of foods you buy and prepare will need to change to make sure the kids can get all the nutrition they need in ways which work for them. It can help to think in terms of hors d&#39;oeuvres or finger foods - things which are easy for kids to eat without having to wait. Home-made baked goods are Great for keeping the house stocked with convenient, nutritious foods. There are other ideas here:”<br/>\nBlessings,<br/>\nSheryl<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":504095955,"authorName":"squink1980","from":"&quot;squink1980&quot; &lt;jennicamaxfield@...&gt;","profile":"squink1980","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New here!","postDate":"1328218556","msgId":47891,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpnZXZqcythYzU3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpnZW9mNCs5OHRrQGVHcm91cHMuY29tPg=="},"prevInTopic":47889,"nextInTopic":47892,"prevInTime":47890,"nextInTime":47892,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"That all makes a lot of sense. It s all about perspective! Thanks for the input...such a great wealth of knowledge and insight!! Jennica","messageBody":"<div id=\"ygrps-yiv-1100159325\">That all makes a lot of sense. It&#39;s all about perspective! Thanks for the input...such a great wealth of knowledge and insight!!<br/>\n<br/>\nJennica</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New here!","postDate":"1328211427","msgId":47889,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpnZW9sMyt1aHMxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMjgxODc4MTcuNTI4OTUuWWFob29NYWlsTmVvQHdlYjE2MTUwMy5tYWlsLmJmMS55YWhvby5jb20+"},"prevInTopic":47888,"nextInTopic":47891,"prevInTime":47888,"nextInTime":47890,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"... I have one kid who s a talker and one who isn t, so I d modify that a little: Communicate! And a lot of times, that means that parents need to start by","messageBody":"<div id=\"ygrps-yiv-601416414\">Amy Lemmon &lt;amylemmon@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; TALK! TALK! TALK! TALK! TALK! TALK!<br/>\n<br/>\n </span></blockquote>I have one kid who&#39;s a talker and one who isn&#39;t, so I&#39;d modify that a little: Communicate! And a lot of times, that means that parents need to start by looking and listening, rather than launching in to talking too soon. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: New here!","postDate":"1328211236","msgId":47888,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpnZW9mNCs5OHRrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpnYnRlaCtjb2wzQGVHcm91cHMuY29tPg=="},"prevInTopic":47887,"nextInTopic":47889,"prevInTime":47887,"nextInTime":47889,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"... *************** It can help to step away from the word allow and move toward ideas like facilitating, helping, supporting. Be their partner as they live","messageBody":"<div id=\"ygrps-yiv-1910848104\">&quot;squink1980&quot; &lt;jennicamaxfield@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; From what I can tell from researching unschooling, it&#39;s all about allowing your kids to explore freely and learn from living.<br/>\n </span></blockquote>***************<br/>\n<br/>\nIt can help to step away from the word &quot;allow&quot; and move toward ideas like facilitating, helping, supporting. Be their partner as they live their lives and the learning generally takes care of itself. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; the kids all love the computer and want to be on it all the time, but with 4 of them that doesn&#39;t really work<br/>\n </span></blockquote>**************<br/>\n<br/>\nI&#39;d be surprised if it did work! That&#39;s a lot of people expected to share one marvelous resource - as if only one of them could go outside to play at a time, or go into a library at a time. If you think in those terms, seeing &quot;the computer&quot; as a big collection of things to explore rather than just one thing, it&#39;s a lot easier to see why it would be good to make that collection more available to more of your kids simultaneously. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; What I find really hard about that is in allowing the kids to do the activities they want to do, a lot of time that results in big messes and things getting lost and broken. How do you guys handle that sort of thing?<br/>\n </span></blockquote>****************<br/>\n<br/>\nSwap out that word &quot;allow&quot; with &quot;facilitate&quot; and re-think the situation from that angle. How can you better facilitate what your kids want to do? I bet they don&#39;t want things lost and broken, either. If you think in those terms, you have a logistical puzzle - and if you like to be in control, then working out that logistical puzzle can help you meet your own needs to an extent. How can you arrange and organize your space and time to facilitate multiple projects at irregular intervals which may at times overlap? <br/>\n<br/>\nKeep in mind that kids are busy people, and their priorities won&#39;t always match yours. It won&#39;t help things to try and get them on the same page in terms of priorities - they&#39;ll just see you as a kind of bully, making them do things which aren&#39;t important. It&#39;s up to you, as the adult, to do the broader thinking and adjust your priorities to support theirs. That doesn&#39;t mean their priorities are always more important - this isn&#39;t some kind of super-martyr philosophy ;) but as their helper, their priorities are important to you.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I want the kids to learn to clean up after themselves and take care of our belongings<br/>\n </span></blockquote>*****************<br/>\n<br/>\nIt also helps to step away from &quot;I want them to learn...&quot;. Kids learn. It&#39;s fundamental to their natures - not just as kids, but as human beings. Human beings are driven to learn, it&#39;s one of our most amazing features. Know that they will learn. The hard part is also knowing that you cannot, ever, no matter what you do, Control what they will learn, or when, or how. <br/>\n<br/>\nLearning to keep house isn&#39;t something which requires years of training. As such, it&#39;s a very very low priority for kids who are busy learning about a big, complex world. The desire to take care of their home and possessions is something which will grow from valuing their home and lives and the people around them - if their home is a stressful place, full of antagonism, it&#39;s hard to want to take care of it. So the more you can do to make your kids lives pleasant and peaceful, the more reasons they&#39;ll have to help out. <br/>\n<br/>\nBut! At first, they&#39;ll help out in ways which make sense to Them - and once again, their priorities will be different than yours. It helps to see kids being thoughtful and helpful and stepping away from wishing their graciousness was more convenient to you. As the kids get used to the idea that their needs and priorities are important to you, they&#39;ll be much more likely to help out if you ask (and I mean really ask, not a demand phrased as a question).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Mostly I suppose my biggest struggles lie in transitioning...<br/>\n<br/>\n </span></blockquote>Ding, ding, ding! Transitions are Hard! They can leave you feeling unsure and unsettled. What can help is thinking deeply about your values and make decisions based on what moves You closer to your values - not pushing your values on your kids, but living them out in your daily interactions. That sounds like awfully airy-fairy advice when what you want is &quot;how do I keep the house from looking like a bomb hit it?&quot; I know ;) but digging down into your values gives you a concrete foundation decision making. If you value kindness, yelling at your kids over the mess isn&#39;t as kind as offering and incentive to help out. If you value courtesy, interrupting a child in the middle of a tv show to do something is less courteous than waiting for a break in the program. If you value creativity, looking for out of the box solutions to common problems is more creative than falling back on old standbys like setting rules and limits. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I want to let the kids be responsible for themselves...<br/>\n<br/>\n </span></blockquote>Psst! Don&#39;t &quot;let&quot; them, help them. Make it easier for them to get their own needs met if that&#39;s what they want, and easy for them to ask for help if that&#39;s what they prefer. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; an empty fridge from kids eating constantly<br/>\n<br/>\n </span></blockquote>If the kids are eating so much you&#39;re running out of food, you need to allocate more of your budget toward food, and/or find foods they like which are filling. If the trouble is you&#39;re transitioning from set meal times and limited availability to something more like grazing, then it&#39;s likely you&#39;re facing another logistical puzzle. The Kinds of foods you buy and prepare will need to change to make sure the kids can get all the nutrition they need in ways which work for them. It can help to think in terms of hors d&#39;oeuvres or finger foods - things which are easy for kids to eat without having to wait. Home-made baked goods are Great for keeping the house stocked with convenient, nutritious foods. There are other ideas here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/eating/monkeyplatter\">http://sandradodd.com/eating/monkeyplatter</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/food\">http://sandradodd.com/food</a><br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":504095955,"authorName":"squink1980","from":"&quot;squink1980&quot; &lt;jennicamaxfield@...&gt;","profile":"squink1980","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: New here!","postDate":"1328197948","msgId":47887,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpnZWJmcysxMTM5Y0BlR3JvdXBzLmNvbT4=","inReplyToHeader":"PDEzMjgxODc4MTcuNTI4OTUuWWFob29NYWlsTmVvQHdlYjE2MTUwMy5tYWlsLmJmMS55YWhvby5jb20+"},"prevInTopic":47885,"nextInTopic":47888,"prevInTime":47886,"nextInTime":47888,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"That s a really great perspective, Amy, thanks! I think I was spending all my time expecting my kids to conform to my rules and boundaries and as a result they","messageBody":"<div id=\"ygrps-yiv-368543937\">That&#39;s a really great perspective, Amy, thanks! I think I was spending all my time expecting my kids to conform to my rules and boundaries and as a result they were constantly fighting against that control and trying to be heard. I&#39;m trying to stop looking at them as a reflection of me and my parenting and more as individuals with their own hopes and wants and needs that are just as important if not more so than mine. That little shift in my mindset has made a HUGE difference already!<br/>\n<br/>\nJennica<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Amy Lemmon &lt;amylemmon@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; It looks like you have received lots of really great advice ... I have six kids and unschool very freely! I too have some control issues at times. But I have learned that the number one thing - for us - is TALKING ... when I feel frustrated we talk, when the kids feel frustrated we talk, when there is an issue we all sit down and work on solutions together. If just a couple of the kids are having an issue we still (most likely) communicate it as a family. We are a family of eight (kids ages: 17, 14, 10, 6, 4, 3), we live in a 750 square foot house at the moment ... we are together all the time, we talk a lot and really that is where we do a LOT of our learning. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I like what I believe Schuyler said: that the children did not chose to be siblings. They really do need to be taught and guided and in my opinion it is not THEIR jobs to do everything ... for me, I am the mom and therefore I signed up to care for these littles for at least 18 years. They indeed can help out but we have to remember the boundaries. Ask them what they think ... my kids always tell me that I am insane when I say our house is a &quot;disaster&quot; ... they point out what a disaster really is and try to put it in perspective for me ...<br/>\n&gt; <br/>\n&gt; TALK! TALK! TALK! TALK! TALK! TALK!<br/>\n&gt; <br/>\n&gt; And best of luck!<br/>\n&gt; <br/>\n&gt; Â <br/>\n&gt; With peace, love and kindness, <br/>\n&gt; Amy Lemmon<br/>\n&gt; amylemmon@...<br/>\n&gt; Blog: Six Flower Mom<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ________________________________<br/>\n&gt;  From: squink1980 &lt;jennicamaxfield@...&gt;<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n&gt; Sent: Wednesday, February 1, 2012 11:40 AM<br/>\n&gt; Subject: [unschoolingbasics] New here!<br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Â  <br/>\n&gt; Hey everyone,<br/>\n&gt; <br/>\n&gt; My name is Jennica and I&#39;m in my second year of homeschooling my 4 kids who are 6, 8, 10, and 12. We are slowly migrating towards unschooling and very much enjoying it. Actually, my whole approach to parenting has been slowly changing.<br/>\n&gt; <br/>\n&gt; I have a couple of questions for you seasoned unschoolers out there...<br/>\n&gt; <br/>\n&gt; From what I can tell from researching unschooling, it&#39;s all about allowing your kids to explore freely and learn from living. I face some challenges here - the kids all love the computer and want to be on it all the time, but with 4 of them that doesn&#39;t really work. I want to give them the freedom to do the things they want, but they just end up bickering over it so I&#39;ve been limiting computer time to an hour each on weekends. Any thoughts on a better way to do it or how you deal with fighting? <br/>\n&gt; <br/>\n&gt; Also, I come from a long line of control freaks and have been working really hard to let go of the need to control everything when it comes to the kids and well, life in general. What I find really hard about that is in allowing the kids to do the activities they want to do, a lot of time that results in big messes and things getting lost and broken. How do you guys handle that sort of thing? I want the kids to learn to clean up after themselves and take care of our belongings, but that just doesn&#39;t seem to happen unless I am constantly after them about it and I don&#39;t want to be the nagging mom. I also don&#39;t want to spend my entire day cleaning up after them which I seem to be doing more often than not. I don&#39;t expect the house to be spotless, but most times it looks like a bomb went off and no one seems to mind but me!<br/>\n&gt; <br/>\n&gt; Mostly I suppose my biggest struggles lie in transitioning from the authoritative, controlling parent to the facilitator. I want to let the kids be responsible for themselves...what and when they eat, when they sleep, which activities they pursue, etc. I also don&#39;t want to lose my mind in a house that is constantly messy, with kids who are fighting and an empty fridge from kids eating constantly.  Any insights, tips, or advice is welcome!<br/>\n&gt; <br/>\n&gt; Jennica <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":271348167,"authorName":"Amy Lemmon","from":"Amy Lemmon &lt;amylemmon@...&gt;","profile":"amylemmon","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] New here!","postDate":"1328187817","msgId":47885,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjgxODc4MTcuNTI4OTUuWWFob29NYWlsTmVvQHdlYjE2MTUwMy5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PGpnYnRlaCtjb2wzQGVHcm91cHMuY29tPg==","referencesHeader":"PGpnYnRlaCtjb2wzQGVHcm91cHMuY29tPg=="},"prevInTopic":47884,"nextInTopic":47887,"prevInTime":47884,"nextInTime":47886,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"It looks like you have received lots of really great advice ... I have six kids and unschool very freely! I too have some control issues at times. But I have","messageBody":"<div id=\"ygrps-yiv-1306881661\">It looks like you have received lots of really great advice ... I have six kids and unschool very freely! I too have some control issues at times. But I have learned that the number one thing - for us - is TALKING ... when I feel frustrated we talk, when the kids feel frustrated we talk, when there is an issue we all sit down and work on solutions together. If just a couple of the kids are having an issue we still (most likely) communicate it as a family. We are a family of eight (kids ages: 17, 14, 10, 6, 4, 3), we live in a 750 square foot house at the moment ... we are together all the time, we talk a lot and really that is where we do a LOT of our learning. <br/>\n<br/>\n<br/>\nI like what I believe Schuyler said: that the children did not chose to be siblings. They really do need to be taught and guided and in my opinion it is not THEIR jobs to do everything ... for me, I am the mom and therefore I signed up to care for these littles for at least 18 years. They indeed can help out but we have to remember the boundaries. Ask them what they think ... my kids always tell me that I am insane when I say our house is a &quot;disaster&quot; ... they point out what a disaster really is and try to put it in perspective for me ...<br/>\n<br/>\nTALK! TALK! TALK! TALK! TALK! TALK!<br/>\n<br/>\nAnd best of luck!<br/>\n<br/>\n <br/>\nWith peace, love and kindness, <br/>\nAmy Lemmon<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:amylemmon@...\">amylemmon@...</a><br/>\nBlog: Six Flower Mom<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n From: squink1980 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jennicamaxfield@...\">jennicamaxfield@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSent: Wednesday, February 1, 2012 11:40 AM<br/>\nSubject: [unschoolingbasics] New here!<br/>\n <br/>\n<br/>\n  <br/>\nHey everyone,<br/>\n<br/>\nMy name is Jennica and I&#39;m in my second year of homeschooling my 4 kids who are 6, 8, 10, and 12. We are slowly migrating towards unschooling and very much enjoying it. Actually, my whole approach to parenting has been slowly changing.<br/>\n<br/>\nI have a couple of questions for you seasoned unschoolers out there...<br/>\n<br/>\nFrom what I can tell from researching unschooling, it&#39;s all about allowing your kids to explore freely and learn from living. I face some challenges here - the kids all love the computer and want to be on it all the time, but with 4 of them that doesn&#39;t really work. I want to give them the freedom to do the things they want, but they just end up bickering over it so I&#39;ve been limiting computer time to an hour each on weekends. Any thoughts on a better way to do it or how you deal with fighting? <br/>\n<br/>\nAlso, I come from a long line of control freaks and have been working really hard to let go of the need to control everything when it comes to the kids and well, life in general. What I find really hard about that is in allowing the kids to do the activities they want to do, a lot of time that results in big messes and things getting lost and broken. How do you guys handle that sort of thing? I want the kids to learn to clean up after themselves and take care of our belongings, but that just doesn&#39;t seem to happen unless I am constantly after them about it and I don&#39;t want to be the nagging mom. I also don&#39;t want to spend my entire day cleaning up after them which I seem to be doing more often than not. I don&#39;t expect the house to be spotless, but most times it looks like a bomb went off and no one seems to mind but me!<br/>\n<br/>\nMostly I suppose my biggest struggles lie in transitioning from the authoritative, controlling parent to the facilitator. I want to let the kids be responsible for themselves...what and when they eat, when they sleep, which activities they pursue, etc. I also don&#39;t want to lose my mind in a house that is constantly messy, with kids who are fighting and an empty fridge from kids eating constantly.  Any insights, tips, or advice is welcome!<br/>\n<br/>\nJennica <br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":504095955,"authorName":"squink1980","from":"&quot;squink1980&quot; &lt;jennicamaxfield@...&gt;","profile":"squink1980","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New here!","postDate":"1328160485","msgId":47884,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpnZDZ0NSs1dWpsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMjgxMjYwMTEuNzM0NDMuWWFob29NYWlsTmVvQHdlYjg3MzAyLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":47881,"nextInTopic":47885,"prevInTime":47883,"nextInTime":47885,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"Fantastic advice, Schuyler, thank you! I found an incredible website today along the same lines as what you are talking about... joyfullyrejoycing.com","messageBody":"<div id=\"ygrps-yiv-1493722858\">Fantastic advice, Schuyler, thank you! I found an incredible website<br/>\ntoday along the same lines as what you are talking about...<br/>\njoyfullyrejoycing.com &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com\">http://joyfullyrejoycing.com</a>&gt;  and just started<br/>\nsaying yes more often and focusing on the fun and exploration the kids<br/>\nwere doing instead of the mess they were making. They were so happy at<br/>\nthe end of the day from all the great things that they did that they<br/>\ndidn&#39;t mind helping to tidy up when I asked them. They also fought a lot<br/>\nless. It&#39;s amazing what a slight change in perspective can do!<br/>\nJennica<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] New here!","postDate":"1328126011","msgId":47881,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjgxMjYwMTEuNzM0NDMuWWFob29NYWlsTmVvQHdlYjg3MzAyLm1haWwuaXJkLnlhaG9vLmNvbT4=","referencesHeader":"PGpnYnRlaCtjb2wzQGVHcm91cHMuY29tPiA="},"prevInTopic":47880,"nextInTopic":47884,"prevInTime":47880,"nextInTime":47883,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"... With four kids, 1 computer is not going to be enough. Look for finding ways to afford another computer, to afford more than one other computer. See if you","messageBody":"<div id=\"ygrps-yiv-1097852153\"><blockquote><span title=\"ireply\">&gt;&gt;the kids all love the computer and want to be on it all the time, but with 4 of them that doesn&#39;t really work&lt;&lt;<br/>\n<br/>\n<br/>\n </span></blockquote>With four kids, 1 computer is not going to be enough. Look for finding ways to afford another computer, to afford more than one other computer. See if you can buy one secondhand that you can add ram or memory to, or build one if money is tight. Maybe on days when they all want to be on the computer at the same time, in the meantime, you can see about using the computers that your library may make available to the public if what they want to do can be accomodate there. If what they are doing on the computer is gaming look into getting video game systems. They are remarkably good value for the money. Have big processors, very fast, absolutely fit for use. You could get older systems with games packaged together, like a game cube or a ps2 and a cheap television, maybe through Craiglist. Think for ways to have more to meet their needs instead of asking them to shrink themselves to meet yours. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I want to give them the freedom to do the things they want, but they <br/>\n </span></blockquote>just end up bickering over it so I&#39;ve been limiting computer time to an <br/>\nhour each on weekends.&lt;&lt;<br/>\n<br/>\nWhy? Why would you limit it down to such a little time? Do you look askance at the computer? Do you see at as a part of some slippery slope to your 4 children living in your basement into their 30s and never dating? I assume they aren&#39;t at school so the weekends thing is arbitrary. There are 4 of them and not 12 so an hour a day is equally arbitrary. And, of course, by limiting what they want you are simply making it something that they are much more likely to bicker over. <br/>\n<br/>\nGet more! Figure out what they need and figure out how to afford it! Don&#39;t make their world or their passions or their desires smaller than they are, make them bigger, help them to get what they want, what they need. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I want to let the kids be responsible for themselves...what and when <br/>\n </span></blockquote>they eat, when they sleep, which activities they pursue, etc. I also don&#39;t want to lose my mind in a house that is constantly messy, with kids who are fighting and an <br/>\nempty fridge from kids eating constantly.  &gt;&gt;<br/>\n<br/>\nYou have 4 children. 6, 8, 10 and 12 aren&#39;t going to be really capable of cleaning or dealing with interactions with each other peacefully. They didn&#39;t choose to be or choose to have siblings. You made a choice to have each of them, however they happened. You are responsible for them. You are the one who needs to work to make their lives work within your constraints. <br/>\n<br/>\nGo slow. Say yes more. Look for ways to meet their needs and their desires and their wants and try not to make too strict a delineation between need and want. There is a learning curve that you have to work through for unschooling to work. You have to learn to recognise when you are helping them to when you are pushing them to fit into what it is you want them to be or think they ought to be. You need to look to them for guidance on what to do next for or with them. Be with them more. Being with them more is almost always the best way to figure out how to help them to negotiate difficult things. Rules tend to get in the way of negotiations and often are used as a guideline for when there isn&#39;t help easily at hand. I imagine there is a lot of heated exchanges now about whose turn it is to use the computer and how long someone else has been on it. Your presence, your ability to shift them from one moment&#39;s tension to a moment that is less tense will help<br/>\n to keep those moments less likely to spiral into full out fueding and fighting. And may even make them less frequent. <br/>\n<br/>\nGet more stuff for them to do. The more stuff that they can choose to do that is fun and engaging and valuable, the less they will see to fight over access to the computer. Particularly if there are more computers to go around. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":504095955,"authorName":"squink1980","from":"&quot;squink1980&quot; &lt;jennicamaxfield@...&gt;","profile":"squink1980","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"New here!","postDate":"1328118033","msgId":47880,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpnYnRlaCtjb2wzQGVHcm91cHMuY29tPg=="},"prevInTopic":44955,"nextInTopic":47881,"prevInTime":47879,"nextInTime":47881,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"Hey everyone, My name is Jennica and I m in my second year of homeschooling my 4 kids who are 6, 8, 10, and 12. We are slowly migrating towards unschooling and","messageBody":"<div id=\"ygrps-yiv-114296772\">Hey everyone,<br/>\n<br/>\nMy name is Jennica and I&#39;m in my second year of homeschooling my 4 kids who are 6, 8, 10, and 12. We are slowly migrating towards unschooling and very much enjoying it. Actually, my whole approach to parenting has been slowly changing.<br/>\n<br/>\nI have a couple of questions for you seasoned unschoolers out there...<br/>\n<br/>\nFrom what I can tell from researching unschooling, it&#39;s all about allowing your kids to explore freely and learn from living. I face some challenges here - the kids all love the computer and want to be on it all the time, but with 4 of them that doesn&#39;t really work. I want to give them the freedom to do the things they want, but they just end up bickering over it so I&#39;ve been limiting computer time to an hour each on weekends. Any thoughts on a better way to do it or how you deal with fighting? <br/>\n<br/>\nAlso, I come from a long line of control freaks and have been working really hard to let go of the need to control everything when it comes to the kids and well, life in general. What I find really hard about that is in allowing the kids to do the activities they want to do, a lot of time that results in big messes and things getting lost and broken. How do you guys handle that sort of thing? I want the kids to learn to clean up after themselves and take care of our belongings, but that just doesn&#39;t seem to happen unless I am constantly after them about it and I don&#39;t want to be the nagging mom. I also don&#39;t want to spend my entire day cleaning up after them which I seem to be doing more often than not. I don&#39;t expect the house to be spotless, but most times it looks like a bomb went off and no one seems to mind but me!<br/>\n<br/>\nMostly I suppose my biggest struggles lie in transitioning from the authoritative, controlling parent to the facilitator. I want to let the kids be responsible for themselves...what and when they eat, when they sleep, which activities they pursue, etc. I also don&#39;t want to lose my mind in a house that is constantly messy, with kids who are fighting and an empty fridge from kids eating constantly.  Any insights, tips, or advice is welcome!<br/>\n<br/>\nJennica</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: New here!","postDate":"1287084699","msgId":44955,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk5N2xxcit1NG05QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdBOEQ2RUIwLTBDOEItNEQ5OC1BM0FDLUY5MTlCQkJEMTExQ0BtZS5jb20+"},"prevInTopic":44954,"nextInTopic":47880,"prevInTime":44954,"nextInTime":44956,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"Thanks! :) I think so much of starting to live as an unschooler is giving yourself and your kids the luxury of time. Leaving space for things to develop. I","messageBody":"<div id=\"ygrps-yiv-170675375\">Thanks! :)<br/>\n<br/>\nI think so much of starting to live as an unschooler is giving yourself and your kids the luxury of time. Leaving space for things to develop.<br/>\n<br/>\nI have recently been running on the public school clock -- long, boring story of no consequence to this audience -- and the time that is sucked from our day is just amazing. A real waste when I know we could be at home making mud pies and reading and playing with our &quot;guitar,&quot; etc. <br/>\n<br/>\nI am so looking forward to having my days back. Maybe this has made me appreciate the loveliness of living as an unschooler even more.<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Birchwood Academy &lt;birchwoodacademy@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi Nance - thank you for this lovely succinct reply.  A good reminder  <br/>\n&gt; for me!!<br/>\n&gt; ~ Colleen<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":157587370,"authorName":"iksnolbay67","from":"&quot;iksnolbay67&quot; &lt;iksnolbay67@...&gt;","profile":"iksnolbay67","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New here!","postDate":"1287078306","msgId":44954,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk5N2ZqMisyam1jQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk5NGFrait2ZmhiQGVHcm91cHMuY29tPg=="},"prevInTopic":44953,"nextInTopic":44955,"prevInTime":44953,"nextInTime":44955,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"Hi, Marie, I think Nance s response was amazing & absolutely captures what those of us who have been unschooling for a while have done with our own children.","messageBody":"<div id=\"ygrps-yiv-988806313\">Hi, Marie,<br/>\n<br/>\nI think Nance&#39;s response was amazing & absolutely captures what those of us who have been unschooling for a while have done with our own children.  I realize that your son&#39;s specific needs paired with the needs of your baby leaves you feeling quite overwhelmed.  Know this - you are not in a race.  You & your son do not have to do anything within some arbitrary time frame.  Please read as much as you can about unschooling when you can, even if it&#39;s in dribs and drabs.  This group has so much information on all of the issues you&#39;ve raised in your message - these are extremely common questions - so do check out the archives.  There are a number of excellent blogs and websites about unschooling & radical unschooling - a quick google search will bring them up.<br/>\n<br/>\nBreathe!  Trust that you are taking positive steps to enrich your families life.  Be patient with yourself & your children.<br/>\n<br/>\nWe&#39;re all here to help each other grow & understand unschooling - welcome to the group!<br/>\n<br/>\n~ Christine<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;marbleface@...&quot; &lt;marbleface@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi --<br/>\n&gt; <br/>\n&gt; First -- stop. Stop what is not working and what is just frustrating both of you.<br/>\n&gt; <br/>\n&gt; Do that for a while. Now do it some more.<br/>\n&gt; <br/>\n&gt; Now start to notice what life might be like if you didn&#39;t have a layer of &quot;school&quot; on top of everything else.<br/>\n&gt; <br/>\n&gt; Do that some more. Strap the baby on and go for a walk in the woods. Next day, go to the beach. Next day, rent some movies, pop some corn and enjoy. <br/>\n&gt; <br/>\n&gt; Now go to the library. Get cards. Hand the card to your son. Tell him he can get anything he wants. Do not hover and pick out his books or tapes. Back off. Be there to help. Go home and let the books sit for a week before it occurs to Dear Son that maybe he could look at one of them. Do not treat that as an invitation to &quot;teach.&quot; Let him enjoy his book in peace. Return the books. Repeat. Apply same method to any other activity Dear Son is interested in -- get there, get the thing, let him enjoy it, be available but not controlling. <br/>\n&gt; <br/>\n&gt; Now play with the baby. Now do some laundry. Now go outside. Go outside again. Now notice the seasons. Now notice the holidays. <br/>\n&gt; <br/>\n&gt; Hmmm. . . . are you enjoying each others&#39; company? Good. Now keep doing that. <br/>\n&gt; <br/>\n&gt; Answer or research questions as they come up. Not in a forced way. Not in a scheduled way. As life presents them.<br/>\n&gt; <br/>\n&gt; Instruct all comers -- Gramma or stranger or neighborhood kid -- that you are not doing &quot;school&quot; and don&#39;t need their opinion on that decision, thank you very much. Or don&#39;t. Handle it in a way that is comfortable for you but do not be bullied into &quot;just doing a few lessons&quot; to placate others.<br/>\n&gt; <br/>\n&gt; Now get back to enjoying your days. Look up every once in a while. Notice if the kids are happy. Notice if the house is calm -- in that cluttered way that houses with kids can be. <br/>\n&gt; <br/>\n&gt; Can something. Plant something. Paint something -- like a chair or a room, not an &quot;art lesson.&quot; Bake something. Dear Son asks about stars. Research stars online. Buy a telescope. Dear Son never asks about anything. Fine. Read what you like and look things up when you need to and show how it is done and let Dear Son know the computer is his to use too. <br/>\n&gt; <br/>\n&gt; When appropriate, in context, see if Dear Son wants to do any sort of organized activity. How? Ask him. Would he be at all interested in a sport of some kind. No. Great, more time for fun. Would he like to take an art class? Yes. Great, let&#39;s go find out about that one at the community center. Any answer -- yes or no or maybe or an answer than changes with time -- is fine. The answer is not the point. The activity is not the point. The point it that Dear Son has a chance to realize he owns what is going into his head and has an active part in structuring his days. <br/>\n&gt; <br/>\n&gt; Talk to your children about many things and like they are actual people -- not someone needing instruction. Just speak in a normal tone of voice, the way you would talk to me. <br/>\n&gt; <br/>\n&gt; Do not think of Dear Son as defiant. Think of him as dear. A precious person you brought into the world who you now have the privilege of living with. Who needs you to slow down sometimes. Who needs to stop wasting his days on worksheets. Who likes video games (that you may not like or understand or want to play, if you are like me). <br/>\n&gt; <br/>\n&gt; Let him control what he can. He wants to control something? It&#39;s not going to kill him? Let him. Help him. <br/>\n&gt; <br/>\n&gt; Etc.<br/>\n&gt; <br/>\n&gt; Continue for years. Change and grow as appropriate. Now you are unschooling. :) <br/>\n&gt; <br/>\n&gt; Nance<br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;lapointmarie&quot; &lt;lapointmarie@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; Hello Everyone, I&#39;m new to homeschooling. Right now I am very frustrated to say the least. When I decided to bring my special needs child home to school him I did NOT want to bring school home and sadly that&#39;s what it has ended up being. We tried Unit study method which has not worked. I have ended up doing most of the work. My son can be defiant and just wants to be in control of everything. I also have a 6 month old and I just do not have 6 hours to spend at a table with him doing boring lessons which do not seem to intrest him. I really want to &quot;Unschool&quot; him but have great concerns on how will I know if he is learning and what do I do with him all day. I think he needs more life skills rather than just being at a table doing&quot;School&quot; he is more of a hands on kid and I really just want to enjoy being a mom.If I left everything up to him he would watch TV all day or play video games. And I also have heard of the term &quot;Deschool&quot; what does this mean? and how long does it take? Any advice would be greatly apperciated....I just want to enjoy being with my kids and have fun with them.......And not feel like I am not doing an adequate job in educating him and preparing him for life. My son has a mild form of Autism and Bipolar disorder. He tells me I am rushing him and he just wants to slow down.......<br/>\n&gt; &gt; Sorry this is so long, but I just am at a loss on where to go from here!!                                  Marie<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":463237211,"authorName":"Birchwood Academy","from":"Birchwood Academy &lt;birchwoodacademy@...&gt;","profile":"birchwodacademyprincipal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: New here!","postDate":"1287057994","msgId":44953,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdBOEQ2RUIwLTBDOEItNEQ5OC1BM0FDLUY5MTlCQkJEMTExQ0BtZS5jb20+"},"prevInTopic":44952,"nextInTopic":44954,"prevInTime":44952,"nextInTime":44954,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"Hi Nance - thank you for this lovely succinct reply.  A good reminder for me!! ~ Colleen","messageBody":"<div id=\"ygrps-yiv-2050924276\">Hi Nance - thank you for this lovely succinct reply.  A good reminder  <br/>\nfor me!!<br/>\n~ Colleen</div>","specialLinks":[]},{"userId":367302968,"authorName":"VickiJ","from":"&quot;VickiJ&quot; &lt;vjohnsonbarrett@...&gt;","profile":"vjohnsonbarrett","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: New here!","postDate":"1287020088","msgId":44952,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk5NW1ubys1dTZkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk5NGFrait2ZmhiQGVHcm91cHMuY29tPg=="},"prevInTopic":44951,"nextInTopic":44953,"prevInTime":44951,"nextInTime":44953,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"I just loved this post! It s such a realistice, understandable, accessible description of how unschooling works every day, starting whenever it is you start. I","messageBody":"<div id=\"ygrps-yiv-1570489987\">I just loved this post! It&#39;s such a realistice, understandable, accessible description of how unschooling works every day, starting whenever it is you start. I wish everyone who would like to know more about unschooling could read this. Thanks so much for laying this out in such an enthusiastic and simple way!<br/>\nVicki<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":151505017,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;carenkh@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New here!","postDate":"1286978887","msgId":44951,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk5NGVnNytpdnZxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk5MXBuZCtjcmkzQGVHcm91cHMuY29tPg=="},"prevInTopic":44950,"nextInTopic":44952,"prevInTime":44950,"nextInTime":44952,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"I feel like I don t have time to address everything in your email, so I ll start with a couple things. First, take time to deschool. Read both of these pages,","messageBody":"<div id=\"ygrps-yiv-805110445\">I feel like I don&#39;t have time to address everything in your email, so I&#39;ll start with a couple things.<br/>\n<br/>\nFirst, take time to deschool. Read both of these pages, and really take in what they&#39;re saying. (and if you&#39;re inspired to follow links, do, but don&#39;t overwhelm yourself!)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/beginning\">http://sandradodd.com/beginning</a><br/>\n<br/>\nReally step back. Support his gameplaying and TV watching and whatever else he needs to do to find *himself* again. Watch TV with him. Play games with him, or if you&#39;re not able to do that, get to know the games somehow, by watching him or reading online or asking questions here.<br/>\n<br/>\nKids learn TONS through gaming and TV.<br/>\n<br/>\nSecond, as much as you&#39;re able, don&#39;t make him do what he doesn&#39;t want to do. I know that can seem scary, but as the mother of a child who would absolutely be seen as &quot;defiant&quot; if he was coerced into doing things, I can say the more you can let go of that control, the better things will be - your relationship, your son&#39;s sense of self, the peace of your home.<br/>\n<br/>\nHe&#39;s not defiant, he&#39;s standing up for himself. Listen to him. <br/>\n<br/>\nI hope I have time to write more later, and I bet others will step in with more - <br/>\n<br/>\npeace,<br/>\nCaren</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: New here!","postDate":"1286974931","msgId":44950,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk5NGFrait2ZmhiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk5MXBuZCtjcmkzQGVHcm91cHMuY29tPg=="},"prevInTopic":44949,"nextInTopic":44951,"prevInTime":44949,"nextInTime":44951,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"Hi -- First -- stop. Stop what is not working and what is just frustrating both of you. Do that for a while. Now do it some more. Now start to notice what life","messageBody":"<div id=\"ygrps-yiv-883836282\">Hi --<br/>\n<br/>\nFirst -- stop. Stop what is not working and what is just frustrating both of you.<br/>\n<br/>\nDo that for a while. Now do it some more.<br/>\n<br/>\nNow start to notice what life might be like if you didn&#39;t have a layer of &quot;school&quot; on top of everything else.<br/>\n<br/>\nDo that some more. Strap the baby on and go for a walk in the woods. Next day, go to the beach. Next day, rent some movies, pop some corn and enjoy. <br/>\n<br/>\nNow go to the library. Get cards. Hand the card to your son. Tell him he can get anything he wants. Do not hover and pick out his books or tapes. Back off. Be there to help. Go home and let the books sit for a week before it occurs to Dear Son that maybe he could look at one of them. Do not treat that as an invitation to &quot;teach.&quot; Let him enjoy his book in peace. Return the books. Repeat. Apply same method to any other activity Dear Son is interested in -- get there, get the thing, let him enjoy it, be available but not controlling. <br/>\n<br/>\nNow play with the baby. Now do some laundry. Now go outside. Go outside again. Now notice the seasons. Now notice the holidays. <br/>\n<br/>\nHmmm. . . . are you enjoying each others&#39; company? Good. Now keep doing that. <br/>\n<br/>\nAnswer or research questions as they come up. Not in a forced way. Not in a scheduled way. As life presents them.<br/>\n<br/>\nInstruct all comers -- Gramma or stranger or neighborhood kid -- that you are not doing &quot;school&quot; and don&#39;t need their opinion on that decision, thank you very much. Or don&#39;t. Handle it in a way that is comfortable for you but do not be bullied into &quot;just doing a few lessons&quot; to placate others.<br/>\n<br/>\nNow get back to enjoying your days. Look up every once in a while. Notice if the kids are happy. Notice if the house is calm -- in that cluttered way that houses with kids can be. <br/>\n<br/>\nCan something. Plant something. Paint something -- like a chair or a room, not an &quot;art lesson.&quot; Bake something. Dear Son asks about stars. Research stars online. Buy a telescope. Dear Son never asks about anything. Fine. Read what you like and look things up when you need to and show how it is done and let Dear Son know the computer is his to use too. <br/>\n<br/>\nWhen appropriate, in context, see if Dear Son wants to do any sort of organized activity. How? Ask him. Would he be at all interested in a sport of some kind. No. Great, more time for fun. Would he like to take an art class? Yes. Great, let&#39;s go find out about that one at the community center. Any answer -- yes or no or maybe or an answer than changes with time -- is fine. The answer is not the point. The activity is not the point. The point it that Dear Son has a chance to realize he owns what is going into his head and has an active part in structuring his days. <br/>\n<br/>\nTalk to your children about many things and like they are actual people -- not someone needing instruction. Just speak in a normal tone of voice, the way you would talk to me. <br/>\n<br/>\nDo not think of Dear Son as defiant. Think of him as dear. A precious person you brought into the world who you now have the privilege of living with. Who needs you to slow down sometimes. Who needs to stop wasting his days on worksheets. Who likes video games (that you may not like or understand or want to play, if you are like me). <br/>\n<br/>\nLet him control what he can. He wants to control something? It&#39;s not going to kill him? Let him. Help him. <br/>\n<br/>\nEtc.<br/>\n<br/>\nContinue for years. Change and grow as appropriate. Now you are unschooling. :) <br/>\n<br/>\nNance<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;lapointmarie&quot; &lt;lapointmarie@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hello Everyone, I&#39;m new to homeschooling. Right now I am very frustrated to say the least. When I decided to bring my special needs child home to school him I did NOT want to bring school home and sadly that&#39;s what it has ended up being. We tried Unit study method which has not worked. I have ended up doing most of the work. My son can be defiant and just wants to be in control of everything. I also have a 6 month old and I just do not have 6 hours to spend at a table with him doing boring lessons which do not seem to intrest him. I really want to &quot;Unschool&quot; him but have great concerns on how will I know if he is learning and what do I do with him all day. I think he needs more life skills rather than just being at a table doing&quot;School&quot; he is more of a hands on kid and I really just want to enjoy being a mom.If I left everything up to him he would watch TV all day or play video games. And I also have heard of the term &quot;Deschool&quot; what does this mean? and how long does it take? Any advice would be greatly apperciated....I just want to enjoy being with my kids and have fun with them.......And not feel like I am not doing an adequate job in educating him and preparing him for life. My son has a mild form of Autism and Bipolar disorder. He tells me I am rushing him and he just wants to slow down.......<br/>\n&gt; Sorry this is so long, but I just am at a loss on where to go from here!!                                  Marie<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":456646735,"authorName":"lapointmarie","from":"&quot;lapointmarie&quot; &lt;lapointmarie@...&gt;","profile":"lapointmarie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"New here!","postDate":"1286892077","msgId":44949,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk5MXBuZCtjcmkzQGVHcm91cHMuY29tPg=="},"prevInTopic":6661,"nextInTopic":44950,"prevInTime":44948,"nextInTime":44950,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"Hello Everyone, I m new to homeschooling. Right now I am very frustrated to say the least. When I decided to bring my special needs child home to school him I","messageBody":"<div id=\"ygrps-yiv-1263303930\">Hello Everyone, I&#39;m new to homeschooling. Right now I am very frustrated to say the least. When I decided to bring my special needs child home to school him I did NOT want to bring school home and sadly that&#39;s what it has ended up being. We tried Unit study method which has not worked. I have ended up doing most of the work. My son can be defiant and just wants to be in control of everything. I also have a 6 month old and I just do not have 6 hours to spend at a table with him doing boring lessons which do not seem to intrest him. I really want to &quot;Unschool&quot; him but have great concerns on how will I know if he is learning and what do I do with him all day. I think he needs more life skills rather than just being at a table doing&quot;School&quot; he is more of a hands on kid and I really just want to enjoy being a mom.If I left everything up to him he would watch TV all day or play video games. And I also have heard of the term &quot;Deschool&quot; what does this mean? and how long does it take? Any advice would be greatly apperciated....I just want to enjoy being with my kids and have fun with them.......And not feel like I am not doing an adequate job in educating him and preparing him for life. My son has a mild form of Autism and Bipolar disorder. He tells me I am rushing him and he just wants to slow down.......<br/>\nSorry this is so long, but I just am at a loss on where to go from here!!                                  Marie</div>","specialLinks":[]},{"userId":1224177,"authorName":"Saulithyia@aol.com","from":"Saulithyia@...","profile":"saulithyia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: New here!","postDate":"1127230333","msgId":6661,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1ZC41OTYwNmQ4Zi4zMDYxODU3ZEBhb2wuY29tPg=="},"prevInTopic":6655,"nextInTopic":44949,"prevInTime":6660,"nextInTime":6662,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/20/2005 6:09:58 AM Eastern Daylight Time, kbcdlovejo@aol.com writes: This is  EXACTLY why there are so many adults who cannot read. SCHOOL","messageBody":"<div id=\"ygrps-yiv-379159413\">In a message dated 9/20/2005 6:09:58 AM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> writes:<br/>\n<br/>\nThis is  EXACTLY why there are so many adults who cannot read. SCHOOL does it <br/>\nto them.  School <br/>\nand their parents. Society thinks schools are correct in their idea  to teach <br/>\nyounger and  <br/>\nyounger children to read. It&#39;s a crock.  Children *need* to do it when <br/>\nthey&#39;re ready---and <br/>\nno  sooner.<br/>\n<br/>\n<br/>\n <br/>\n <br/>\nI am the opposite of my husband... I hate math. Always have. I had it  forced <br/>\ndown my throat. I never understood Algebra and Geometry and all those  darn <br/>\nformulas we HAD to know. My father is an engineer. Tool Design, so to him,  <br/>\nthat stuff came naturally. HE used it on a daily basis. And I remember many  <br/>\nfights and tears over homework. <br/>\nI love English and History... my husband is the Math and Science guy. I&#39;m  <br/>\nlucky if I can add in my head, and he can&#39;t write a sentence without errors. I  <br/>\ncan&#39;t see putting my kids through that. I&#39;d rather love it. The one math class <br/>\nI  ever enjoyed was Accounting, and that was considered the &quot;dumb&quot; class. You <br/>\ntook  it if you weren&#39;t taking Calculus or Trig. I took it, and was in a <br/>\nclass with  all the kids who were considered &quot;dumb&quot;. They could&#39;ve cared less <br/>\nabout class  and the teacher gave up trying, but ended up doing one on one with <br/>\nme. I flew  way ahead of where the class was supposed to be, and took the final <br/>\nexam. The  teacher just glanced over it and gave me an A+ since I had done <br/>\ndouble the work  (equivalent of Accounting I & II). <br/>\nI wonder if I would&#39;ve liked math more if it hadn&#39;t been forced...  <br/>\n<br/>\nJenny<br/>\nHomeschooling in Greenfield<br/>\nDanny (5), Kelsey (3) and  Evelyn (1)<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\nEducation is not  filling a pail but the lighting of a fire.  ~William Butler <br/>\n Yeats<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: New here!","postDate":"1127210975","msgId":6655,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDNzhCRTI4OTVGM0Q4Mi01QTQtOEVAbWJsay1yMzkuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PDFhYS4zZWIzNzQ0OC4zMDYwYTYwZEBhb2wuY29tPg==","referencesHeader":"PDFhYS4zZWIzNzQ0OC4zMDYwYTYwZEBhb2wuY29tPg=="},"prevInTopic":6651,"nextInTopic":6661,"prevInTime":6654,"nextInTime":6656,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"... From: Saulithyia@aol.com To: unschoolingbasics@yahoogroups.com This reading thread is interesting as I see a lot of my husband there. He won t read.  Can t","messageBody":"<div id=\"ygrps-yiv-183510336\">-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Saulithyia@...\">Saulithyia@...</a><br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n<br/>\nThis <br/>\n reading thread is interesting as I see a lot of my husband there. He won&#39;t <br/>\nread.  Can&#39;t spell to save his life, and even had a teacher once say he&#39;d never <br/>\n graduate. He did, did 2 years of college, but dropped out because it was too <br/>\n hard (ie. he couldn&#39;t read very well). He still struggles with it and it&#39;s <br/>\njust  in his system that he can&#39;t do it. It&#39;s really sad and to undo so many <br/>\nyears of  this thinking is next to impossible. But, he trusts my judgement on <br/>\nthe  homeschooling thing, even with his concerns.  <br/>\n<br/>\n**************<br/>\n <br/>\nThis is EXACTLY why there are so many adults who cannot read. SCHOOL does it to them. School <br/>\nand their parents. Society thinks schools are correct in their idea to teach younger and  <br/>\nyounger children to read. It&#39;s a crock. Children *need* to do it when they&#39;re ready---and <br/>\nno sooner.<br/>\n <br/>\nIf they&#39;re pushed too early, the result is your husband. That shouldn&#39;y be *too* hard an <br/>\nidea for him to grasp! &lt;g&gt;<br/>\n <br/>\n~Kelly<br/>\nKelly LovejoyConference CoordinatorLive and Learn Unschooling ConferenceOctober 6-9, 2005<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1224177,"authorName":"Saulithyia@aol.com","from":"Saulithyia@...","profile":"saulithyia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: New here!","postDate":"1127173133","msgId":6651,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhYS4zZWIzNzQ0OC4zMDYwYTYwZEBhb2wuY29tPg=="},"prevInTopic":6646,"nextInTopic":6655,"prevInTime":6650,"nextInTime":6652,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/19/2005 7:12:59 PM Eastern Daylight Time, jlh44music@yahoo.com writes: Welcome  Jenny! I ve seen you on the masshomelearningassoc group","messageBody":"<div id=\"ygrps-yiv-216262399\">In a message dated 9/19/2005 7:12:59 PM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jlh44music@...\">jlh44music@...</a> writes:<br/>\n<br/>\nWelcome  Jenny!<br/>\nI&#39;ve seen you on the masshomelearningassoc group too!  I feel  much like <br/>\nyou do about being drawn to unschooling.   It&#39;s  getting easier all the <br/>\ntime to let go.  My dh is supportive of her  homeschooling, he had very <br/>\nsimiliar &quot;issues&quot; as she did in school (dd just  finished 6th grade), <br/>\nbut he doesn&#39;t quite get &quot;unschooling&quot; yet! (we&#39;re  working on him!)<br/>\nJann (North Reading)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nlol, yep, I&#39;m on the mhla group too!<br/>\nMy dh just doesn&#39;t seem &quot;interested&quot; and has more concerns that not. I try  <br/>\nto get him on the boat with me, but he&#39;s still paddling behind... He had issues <br/>\n in public school (labelled learning disabled &quot;language comprehension&quot;). This <br/>\n reading thread is interesting as I see a lot of my husband there. He won&#39;t <br/>\nread.  Can&#39;t spell to save his life, and even had a teacher once say he&#39;d never <br/>\n graduate. He did, did 2 years of college, but dropped out because it was too <br/>\n hard (ie. he couldn&#39;t read very well). He still struggles with it and it&#39;s <br/>\njust  in his system that he can&#39;t do it. It&#39;s really sad and to undo so many <br/>\nyears of  this thinking is next to impossible. But, he trusts my judgement on <br/>\nthe  homeschooling thing, even with his concerns.  <br/>\n<br/>\nJenny<br/>\nHomeschooling in Greenfield<br/>\nDanny (5), Kelsey (3) and  Evelyn (1)<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\nEducation is not  filling a pail but the lighting of a fire.  ~William Butler <br/>\n Yeats<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":213809267,"authorName":"jlh44music","from":"&quot;jlh44music&quot; &lt;jlh44music@...&gt;","profile":"jlh44music","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: New here!","postDate":"1127171527","msgId":6646,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRnbmdrNyt2ODVkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE1LjRkNTg4NmU4LjMwNjA4YWRmQGFvbC5jb20+"},"prevInTopic":6644,"nextInTopic":6651,"prevInTime":6645,"nextInTime":6647,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"... past some deschooling issues myself, but find myself letting go more and more. The hubby is a little harder to break :o) Welcome Jenny! I ve seen you on","messageBody":"<div id=\"ygrps-yiv-736709200\"><blockquote><span title=\"ireply\">&gt; I look forward to learning more from this group. I&#39;m still working <br/>\n </span></blockquote>past some deschooling issues myself, but find myself letting go more <br/>\nand more. The hubby is a little harder to break :o)<br/>\n<br/>\nWelcome Jenny!<br/>\nI&#39;ve seen you on the masshomelearningassoc group too!  I feel much like <br/>\nyou do about being drawn to unschooling.   It&#39;s getting easier all the <br/>\ntime to let go.  My dh is supportive of her homeschooling, he had very <br/>\nsimiliar &quot;issues&quot; as she did in school (dd just finished 6th grade), <br/>\nbut he doesn&#39;t quite get &quot;unschooling&quot; yet! (we&#39;re working on him!)<br/>\nJann (North Reading)</div>","specialLinks":[]},{"userId":1224177,"authorName":"Saulithyia@aol.com","from":"Saulithyia@...","profile":"saulithyia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"New here!","postDate":"1127166175","msgId":6644,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1LjRkNTg4NmU4LjMwNjA4YWRmQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":6646,"prevInTime":6643,"nextInTime":6645,"topicId":6644,"numMessagesInTopic":0,"msgSnippet":"Hi! I m new here... This is our first year officially homeschooling in MA. My son will be 6  in Dec. and I have 2 daughters, 3 and 1. Little about me... I m","messageBody":"<div id=\"ygrps-yiv-722776747\">Hi!<br/>\nI&#39;m new here...<br/>\nThis is our first year &quot;officially&quot; homeschooling in MA. My son will be 6  in <br/>\nDec. and I have 2 daughters, 3 and 1.<br/>\n <br/>\nLittle about me... I&#39;m 30, and sahm. Homeschooling is something I&#39;ve always  <br/>\nwanted to do since my son was a baby. I&#39;ve never put a finger on &quot;why&quot;, but <br/>\nI&#39;m  guessing since I was a former Secondary Ed. minor in college, that my  <br/>\neducational view was &quot;tainted&quot;. When I was younger, I always wanted to be a  <br/>\nteacher or a psychologist. My parent&#39;s don&#39;t believe in psychology of any form,  <br/>\nand refused to pay for my tutition if I persued that. Shame on them. And young,  <br/>\nnaive me, felt I had no other alternative but to persue teaching.<br/>\n <br/>\nI decided I wanted to teach high school English. I love English. However,  <br/>\ndealing with the schools, administrators, students who wanted nothing to do with <br/>\n teachers, and teachers wanting nothing to do with students... my own high <br/>\nschool  experience was mediocre. I thought it was because I was a teen and <br/>\nthat&#39;s how my  view was then. Until I was the &quot;teacher&quot;. That&#39;s when I realized <br/>\nthat what I  thought was a &quot;joke&quot; as a teen, was the same view I had on the <br/>\nflip-side. I  dropped the Ed. part 3 semesters away from the end and graduated with <br/>\na B.A. in  English.<br/>\n <br/>\nI&#39;ve researched the different homeschooling &quot;methods&quot;, and have leaned  <br/>\ntowards unschooling more and more... It makes sense to me. And, let&#39;s face it,  I&#39;m <br/>\n&quot;lazy&quot; &lt;G&gt; I don&#39;t want to do &quot;teacher&quot; stuff. I don&#39;t want to worry  about <br/>\ncurriculum and all that. My joy is kicking back with the kids and being a  kid <br/>\nagain myself. I love watching them grow and expand their worlds. I didn&#39;t  <br/>\nhave my babies to ship them off to an institution to be herded around like  <br/>\ncattle through years of sitting at desks and doing &quot;busywork&quot;. <br/>\n <br/>\nAnyway.. that&#39;s me. My son is a smart kiddo, very &quot;artsy&quot;. He is taking a  <br/>\nhomeschooler&#39;s art class starting next Monday, more for the interaction  away <br/>\nfrom home. But, we figured that was better for him and anything &quot;athletic&quot;,  as <br/>\nhe has some issues and competition wouldn&#39;t be a good route for him. He needs  <br/>\nto be in control of things, and sports doesn&#39;t let him control things as  art <br/>\ndoes. He&#39;s excited. And he&#39;s more a visual learner. He&#39;s playing this  <br/>\ncomputer program now that is teaching him reading and he LOVES it. Plays it on  his <br/>\nown time. He&#39;s been applying a lot of what he&#39;s learned there to his  real <br/>\nlife situations.<br/>\n <br/>\nI look forward to learning more from this group. I&#39;m still working past  some <br/>\ndeschooling issues myself, but find myself letting go more and more. The  <br/>\nhubby is a little harder to break :o)<br/>\n <br/>\n<br/>\nJenny<br/>\nMom  to Danny, Kelsey and Evelyn<br/>\nHappily homeschooling in  Greenfield<br/>\n~*~*~*~*~*~*~*~*~*~*~*~*~<br/>\nLearning is a  treasure that will follow its owner everywhere.  ~Chinese  <br/>\nProverb<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":5838,"nextTopicId":47900}}