{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: new & learning about different learning styles","postDate":"1192389505","msgId":27106,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZldHEyMSszcTZzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZlczR1bys5NzQ5QGVHcm91cHMuY29tPg=="},"prevInTopic":27100,"nextInTopic":0,"prevInTime":27105,"nextInTime":27107,"topicId":27069,"numMessagesInTopic":0,"msgSnippet":"... might ... them. ... What about bringing the drawing with her? A portable lap-board or easle? Does she respond to we need to do x in y minutes? or is that","messageBody":"<div id=\"ygrps-yiv-2045101854\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Debi&quot; <br/>\n&lt;fightingautism@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Allie&#39;s interest is to sit & draw the same pics over & over. She <br/>\n </span></blockquote>might<br/>\n<blockquote><span title=\"ireply\"> &gt; alternate between 2-3 pics all day, but draw about 100 pics of <br/>\n </span></blockquote>them.<br/>\n<blockquote><span title=\"ireply\"> &gt; That&#39;s no problem for me, except when we HAVE to do other things, <br/>\n<br/>\n </span></blockquote>What about bringing the drawing with her? A portable lap-board or <br/>\neasle? Does she respond to &quot;we need to do x in y minutes?&quot; or is <br/>\nthat stressful for her? Can you reduce those &quot;have tos&quot;? Trade <br/>\ndriving with other families? Are there other &quot;have tos&quot; besides the <br/>\ncleaning (I&#39;ll get to that) that we can help you brainstorm ways to <br/>\nmake less pressing?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I also work hard at understanding Allie on nonverbal levels, but <br/>\n </span></blockquote>it&#39;s<br/>\n<blockquote><span title=\"ireply\"> &gt; impossible for me to comprehend on some levels. Like back to the <br/>\n </span></blockquote>room<br/>\n<blockquote><span title=\"ireply\"> &gt; cleaning. I get it she doesn&#39;t like it. I did realize part of it <br/>\n </span></blockquote>was<br/>\n<blockquote><span title=\"ireply\"> &gt; my dread because I would get defensive when she would scream when I<br/>\n&gt; would calmly, joyfully say, &quot;Clean room!&quot;<br/>\n<br/>\n </span></blockquote>I&#39;d understand that to mean: &quot;don&#39;t order me around, goshdangit!&quot; A <br/>\ncalm joyful order is still an order. If it helps her to have a clean <br/>\nroom, why aren&#39;t you cleaning it? Oh, wait, here it is....<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; and I&#39;ve always had the philosophy if a child is old enough to make<br/>\n&gt; the mess, the child is old enough to clean it.<br/>\n<br/>\n </span></blockquote>This ties in with what I was saying in another post about autonomy <br/>\nbeing different than independence. Here&#39;s a link to that, if you&#39;re <br/>\nnot reading all the posts, its after the third quote:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/message/27102\">http://groups.yahoo.com/group/unschoolingbasics/message/27102</a><br/>\n<br/>\nFor kids in school, pushing independence is necessary. They have to <br/>\ngo away from their parents and spend their days among strangers. <br/>\nThey *need* to be independent, because they are penalized for being <br/>\nkind and helpful (do your own work, not your neighbors). Its one of <br/>\nthe things many people find they have to un-learn once they leave <br/>\nschool - instead, they have to learn to support spouses and team-<br/>\nmates and clients. <br/>\n<br/>\nUnschooling lets kids learn about mutual support from their parents. <br/>\nThey get to learn that it feels good to be kind. Most of us didn&#39;t <br/>\nlearn that as kids - we learned &quot;do your own work&quot; and &quot;you&#39;re big <br/>\nenough to do it yourself&quot; and we&#39;ve internalized those messages to <br/>\nthe point we don&#39;t question them, or see the cruelty. Part of the <br/>\ndeschooling process involves questioning those internalized messages <br/>\nand holding them up against our values. If we value helpfulness, how <br/>\ndo our kids learn about that? By being made to do things they <br/>\ndislike? Or by being helped when they need help?<br/>\n<br/>\nDo you ever help a friend who needs a hand with something? Would you <br/>\ndo something kind for a person who was in over her head - bring a <br/>\ncasserole to a shut-in or new mom? That&#39;s the sort of attitude <br/>\nunschoolers try to have toward our kids - kindness and helpfulness <br/>\nare valuble so we Model them. We express them to our kids. Please! <br/>\nLet me help you. <br/>\n<br/>\nSupporting your dd&#39;s autonomy - helping her be able to get her needs <br/>\nmet - is going to include making sure her personal space isn&#39;t too <br/>\noverwhelming for her. My dd can find her art supplies much more <br/>\neasily when the room is picked up - so I pick it up regularly. I <br/>\ncertainly could do the whole &quot;put that on the shelf, put this in the <br/>\nbox...&quot; thing, but it takes less time and energy and Grief for me to <br/>\njust Do it. As a gift. So my dd can do what&#39;s imporant to her. In <br/>\nthe long run, she does things that are kind for me - because <br/>\nkindness is important in our family. <br/>\n<br/>\nKindness isn&#39;t so important in Ray&#39;s mom&#39;s family. Independence is <br/>\nimportant, and getting what you deserve. It took some time for Ray <br/>\nto start being kind &quot;just because&quot; after he moved in with us. He was <br/>\nthe stereotypical sulky, resistant teenager. Now he offers to do <br/>\nthings just for the sake of being nice. Because he&#39;s surrounded by <br/>\npeople being kind to *him* just because.<br/>\n<br/>\nThis is probably sounding like I&#39;m saying I think you&#39;re a big <br/>\nmeanie as a mom - I think its more likely you&#39;re doing what most <br/>\npeople with kids in school do, and accepting certain things as <br/>\ninevitable that are really a result of the ways schools are managed <br/>\n(not even a result of what&#39;s educationally valuble, but that&#39;s <br/>\nanother rant entirely). Whole life unschooling involves looking at <br/>\nfamily relationships via a different paradigm. Its certainly <br/>\npossible to unschool in the sense of having no curriculum without <br/>\nbuying the farm, as it were, but personally, I think its a great <br/>\nfarm and can&#39;t imagine why anyone *wouldn&#39;t* want to live here.<br/>\n<br/>\n---Meredith (Mo 6, Ray 14)</div>","specialLinks":[]},{"userId":315167313,"authorName":"guideforthree","from":"&quot;guideforthree&quot; &lt;guideforthree@...&gt;","profile":"guideforthree","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: new & learning about different learning styles","postDate":"1192347810","msgId":27100,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZlc2hiMit0N3ViQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZlcDR0aCs3ZHZtQGVHcm91cHMuY29tPg=="},"prevInTopic":27099,"nextInTopic":27106,"prevInTime":27099,"nextInTime":27101,"topicId":27069,"numMessagesInTopic":0,"msgSnippet":"My seven year old is also on the spectrum (Asperger s).  I have no idea how homeschooling will play out for you and your daughter, but I can tell you how it","messageBody":"<div id=\"ygrps-yiv-1902636933\">My seven year old is also on the spectrum (Asperger&#39;s).  I have no <br/>\nidea how homeschooling will play out for you and your daughter, but I <br/>\ncan tell you how it has affected my son.<br/>\n<br/>\nSince we withdrew from school last year:<br/>\n<br/>\nSocially, he is doing remarkably better.  Rather than being left out <br/>\nin a classroom full of kids, his social encounters have been much <br/>\nmore realistic (just one or two kids at a time).  He is learning how <br/>\nto play with other kids appropriately.  He is learning how to join a <br/>\ngroup at the playground, because his big brother is there modeling <br/>\nthe process and making sure he doesn&#39;t get left out.<br/>\n<br/>\nAs far as sensory issues are concerned, I am much more able to <br/>\ncontrol his environment at home than in a school setting.  I am also <br/>\nin tune with his sensory overload signals, and I can remove him from <br/>\na situation before he has a meltdown.  Overall he has much less <br/>\nanxiety due to sensory distress than he had when he was in school.<br/>\n<br/>\nHomeschooling also works well with the restrictive interests often <br/>\nassociated with PDD.  Your daughter likes art...go with that.  There <br/>\nis no end to the things you can learn through art.  My son is <br/>\nobsessed with Bionicles (lego robots).  I recently bought him a <br/>\nBionicle enclyclopedia.  He is learning to use an encyclopedia, and <br/>\nhe is reading (not his favorite activity).<br/>\n<br/>\nLike many other parents with kids on the spectrum, I noticed great <br/>\nsummers with horrible transitions into the school year.  This year <br/>\nwas the first year we did not go back to school, and it is the first <br/>\nyear we have had a smooth autumn in many, many years.  When I pulled <br/>\nmy son out last spring, in typical Asperger fasion, he was concerned <br/>\nabout not having access to the classroom materials.  I bought the <br/>\nitems he was most attached to, and he hasn&#39;t looked back since.<br/>\n<br/>\nI just finished reading *Look Me In the Eyes*  The author of this <br/>\nmemoir has Asperger&#39;s, and his life improved drastically after he <br/>\ndropped out of school and was able to unschool himself.  He went on <br/>\nto design the smoking guitars for KISS, and he later designed several <br/>\nof Milton Bradley&#39;s electronic toys back in the 80&#39;s.  This book was <br/>\nfurther validation for my decision to unschool my Aspie.  <br/>\n<br/>\nI hope this was helpful.  What ever you decide, I am sure it will be <br/>\nthe right decision for your family.</div>","specialLinks":[]},{"userId":87859383,"authorName":"Debi","from":"&quot;Debi&quot; &lt;fightingautism@...&gt;","profile":"fightingautism","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: new & learning about different learning styles","postDate":"1192335591","msgId":27099,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZlczVkNys3MjFxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk3Nzc3LjY3NDQ2LnFtQHdlYjMxNDA4Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":27098,"nextInTopic":27100,"prevInTime":27098,"nextInTime":27100,"topicId":27069,"numMessagesInTopic":0,"msgSnippet":"She wanted to be with other kids her own age. I found a few homeschooling groups; they were either full and didn t have room for any more to join them, or","messageBody":"<div id=\"ygrps-yiv-3912955\">She wanted to be with other kids her own age. I found a few<br/>\nhomeschooling groups; they were either &quot;full&quot; and didn&#39;t have room for<br/>\nany more to join them, or the activities were when my daughter with<br/>\nautism could not have participated without major meltdowns. I also<br/>\nfound some didn&#39;t want a child with autism joining them, which<br/>\nrepulsed me from even wanting to be around them. <br/>\n<br/>\nI don&#39;t know how my daughter with autism would feel about it, that&#39;s<br/>\npart of my problem. When school is out, she&#39;s SO GLAD to be home, but<br/>\nabout half way through summer she starts talking about school like<br/>\ncrazy, the first couple of weeks she&#39;s THRILLED to be back, but then<br/>\nthe rest of the year it can be a struggle to get her there because of<br/>\nher behavior. The odd thing is on many of the mornings that she&#39;s<br/>\nscreaming about going to school she has perfect days -- completes her<br/>\nwork, her behaviors are under control, etc. <br/>\n<br/>\nWe do IV chelation every 2 weeks. My daughter asks for it about 8 days<br/>\nafter the previous IV. She says they make her feel better. Before that<br/>\nwe did some home chelation using alpha lipoic acid. Andy Cutler has a<br/>\nprotocol you can find on the autism-mercury board, which is natural<br/>\nmedicine, not homeopathic. I believe that those who know what they&#39;re<br/>\ndoing, like *good* DANs, provide perfectly safe chelation. In fact, I<br/>\nhaven&#39;t heard of any dangerous things happening while using the DAN<br/>\nchelation protocols from any of the parents I know, but I&#39;m sure<br/>\neverything can have drawbacks. I do know my daughter doesn&#39;t do well<br/>\nwith DMSA. Allie is off the charts in aluminum. I would suggest if you<br/>\nare thinking about it at all to start with a poryphins test, that&#39;s<br/>\nconsidered the best initial test to do. <br/>\n<br/>\nThanks & HTH,<br/>\nDebi<br/>\n<br/>\n4</div>","specialLinks":[]},{"userId":87859383,"authorName":"Debi","from":"&quot;Debi&quot; &lt;fightingautism@...&gt;","profile":"fightingautism","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: new & learning about different learning styles","postDate":"1192335128","msgId":27098,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZlczR1bys5NzQ5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZlcXI3ZSs2bmwxQGVHcm91cHMuY29tPg=="},"prevInTopic":27092,"nextInTopic":27099,"prevInTime":27097,"nextInTime":27099,"topicId":27069,"numMessagesInTopic":0,"msgSnippet":"I do see my daughter s obsessions as passions. I m not a real pc kinda gal and at times her passions are obsessions & I have passions that seem to be","messageBody":"<div id=\"ygrps-yiv-1327820720\">I do see my daughter&#39;s obsessions as passions. I&#39;m not a real pc kinda<br/>\ngal and at times her passions are obsessions & I have passions that<br/>\nseem to be obsessions at times, too, so for me it&#39;s interchangeable. <br/>\n<br/>\nAllie&#39;s interest is to sit & draw the same pics over & over. She might<br/>\nalternate between 2-3 pics all day, but draw about 100 pics of them.<br/>\nThat&#39;s no problem for me, except when we HAVE to do other things, such<br/>\nas pick up sisters, clean bedroom (there&#39;s NEVER a good time for her<br/>\nto clean) and trust me, I&#39;m not one who pushes cleanliness too much,<br/>\njut ask hubby, lol!<br/>\n<br/>\nI accept your statement that kids hate homeschool when parents don&#39;t<br/>\nsupport them & their passions; at the same time, like with my Jessica,<br/>\nshe really craved being with her friends at school. I tried like<br/>\neverything to get us into social situations for her, but the<br/>\nhomeschooling groups here were very cliquish; we couldn&#39;t seem to find<br/>\nany that welcomed us, every group I found told me they were full.<br/>\nAlso, those who were not full had events at times my daughter with<br/>\nautism would not have stood it because of noise, etc, hubby was still<br/>\nat work, no one would watch the other girls, etc. I guess this is my<br/>\nfear, but while typing this I realize we are in a different place now,<br/>\nthe kids are older, etc, so perhaps you&#39;ve walked me through some of<br/>\nthis by letting me ramble, lol.<br/>\n<br/>\nI also work hard at understanding Allie on nonverbal levels, but it&#39;s<br/>\nimpossible for me to comprehend on some levels. Like back to the room<br/>\ncleaning. I get it she doesn&#39;t like it. I did realize part of it was<br/>\nmy dread because I would get defensive when she would scream when I<br/>\nwould calmly, joyfully say, &quot;Clean room!&quot; I found my attitude was<br/>\nturning to negative and that was feeding some of it. I also realized<br/>\nthat clean room was too vague. However, now I give her specific<br/>\ndirections, such as, &quot;put Doras in box&quot; and she screams. I have<br/>\nthought some of it is that she likes to visually see all her toys, but<br/>\nthat&#39;s not the entire case either, because when her room is destroyed<br/>\nshe won&#39;t go in there. When *I* clean it, she doesn&#39;t want to leave<br/>\nit. I get it that she doesn&#39;t like cleaning it herself, but she&#39;s 8<br/>\nand I&#39;ve always had the philosophy if a child is old enough to make<br/>\nthe mess, the child is old enough to clean it. Like when my oldest was<br/>\n13 mos old, if she dumped out toys, I had her clean them up. Sure, we<br/>\nmight make a game out of it, I am very willing to help, encourage, etc. <br/>\n<br/>\nThanks for any advice!<br/>\n<br/>\nDebi</div>","specialLinks":[]},{"userId":171724177,"authorName":"Kelly Weyd","from":"Kelly Weyd &lt;kellmar98@...&gt;","profile":"kellmar98","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] new & learning about different learning styles","postDate":"1192334451","msgId":27092,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk3Nzc3LjY3NDQ2LnFtQHdlYjMxNDA4Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDcwMjg0OS40ODM5MC5xbUB3ZWIzMTQwMy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":27082,"nextInTopic":27098,"prevInTime":27091,"nextInTime":27093,"topicId":27069,"numMessagesInTopic":0,"msgSnippet":"I am so tired so I hope who knows how long I will last on this computer tonight.  Debi, have you checked out Sandradodd.com or JoyfullyRejoicing.com.  Those","messageBody":"<div id=\"ygrps-yiv-965932668\">I am so tired so I hope who knows how long I will last on this computer tonight.  Debi, have you checked out Sandradodd.com or JoyfullyRejoicing.com.  Those are two really great sites that help explain Unschooling and gives you a bit of info. about the Unschooling Philosophy etc.  <br/>\n   <br/>\n  Why did your daughter hate homeschooling?  Why was she loney?  <br/>\n   <br/>\n  I ask these questions because if my girls hated something about our days together (and they do occasionally) then I would change what they hated.  I would offer them something different.  Since I am an Unschooler I let my girls &quot;drive the bus&quot; so to speak.  They decide what they are going to learn and I do my best to make it happen.  For instance my 9 year old is obsessed with birds.......it&#39;s her passion, she loves it, and it&#39;s important to her.  We set up multiple bird feeders right outside our sunroom windows.  Uncle Scott got her binoculars.  Cousin Tara bought her a bird guide book.  I have let her check out EVERY single bird book at our local library.  I have bought her other bird books.  She draws and takes pictures of birds.  She writes in her journal about birds.  She has a bird feather collection.  She knows more about birds than anyone I know.  This is where the the TRUE learning has come in.  I have not forced her to sit down, tried to shove some boring<br/>\n curriculum on her that she finds no value in.  She has found value in birds, and we have FLOWN with it.  Hey, did you all catch the little funny in that, LOL.  Just seeing if anyone is still reading or awake.<br/>\n   <br/>\n  Also if my girls were loney then I would find a way around that too.  We go to homeschooling park days, playdates, etc. etc.  In fact sometimes we do so much of that we need to stay home and rest.  Oh, and also if your daughter loves school, I certainly am not saying she should be at home.  Even Unschoolers I think would agree that if the child chooses school, finds it right for their own lives, and loves it then that is where the child should be.  <br/>\n   <br/>\n  My other daughter is 7.  She has NLD, ADHD, SPD and TS.  When she was in public school, the sensory issues were just a complete nightmare for her.  She would come home everyday and have a complete meltdown, sometimes screaming, punching and kicking walls for hours.  Schools are not great places for children with sensory issues.   Something as simple as those flourescent lights humming can drive them into a meltdown.  If you feel in your heart it&#39;s the right thing to do, bring her home.  It&#39;s the best thing I ever did for both of my girls.  Also how does she feel about it?<br/>\n   <br/>\n  Also I am fascinated with the whole DAN protocols.  I have always felt Mariah, my 7 year old,  is holding heavy metals......mainly mercury.  I have never had a blood or hair test done on her, but according to our Homeopath heavy metals are her main issues.  I&#39;ve felt for a long time that this child needs Chelation.  But I keep hearing how expensive it is, and well we just don&#39;t have that kind of money.  I have heard you can do chelation on your own child, but I have very limited knowledge on the subject and well I would not take a chance with something like that.  A person could end up harming their child instead of helping.   <br/>\n   <br/>\n  By the way, I was absolutely shaking the day I pulled both of my girls out of school.  I thought, OH, what have I gotten myself into?  And my 9 year old is the one who begged me to homeschool her.  She hated school!  She did NOT want to be there.  I am so glad I listened to her, and brought both girls home.  Good Luck with your decision.<br/>\n  Kelly<br/>\n<br/>\nKelly Weyd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kellmar98@...\">kellmar98@...</a>&gt; wrote:<br/>\n          Debi,<br/>\nI will try and get to this post a little later. I&#39;ve got company coming, but I would love to chat a bit. So later tonight I&#39;ll get back on the computer and post a bit. I&#39;ve got a daughter on the spectrum so I&#39;ll tell you a little bit about us, and what is working for us. <br/>\nKelly<br/>\n<br/>\n<br/>\nDebi &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fightingautism@...\">fightingautism@...</a>&gt; wrote:<br/>\nHey everyone, I&#39;m Debi. I have 3 daughters, 10, 8, and 5. My 10 yr old<br/>\nhas been private schooled, public schooled ,home schooled, then back<br/>\nto public. Essentially, she LOVES public school. My 8 year old has<br/>\nautism and we&#39;ve had our battles each year, she&#39;s in second grade. My<br/>\n5yr old is in public school kindergarten & LOVING it. I&#39;m strongly<br/>\nleaning toward pulling my 8 yr old to homeschool.<br/>\n<br/>\nHere&#39;s my biggest fear. When we tried homeschooling with Jessica, she<br/>\nHATED it. She was so lonely. She never wants to homeschool again.<br/>\nFine, what ever works. Allie, my 8 yr old, is a major struggle with<br/>\nschool. She&#39;s very smart academically but has the typical issues<br/>\nassociated with autism, auditory sensitivity, difficulty following<br/>\ndirections, etc. She pretty much wants to do her art all day long, a<br/>\nnew obsession of her&#39;s in the last 6 mos or so. Each year I feel like<br/>\nI have to teach the teachers all over again. I don&#39;t blame them, they<br/>\nget the royal screw by administration each year.<br/>\n<br/>\nI&#39;m also in college for my BSN. I have 2 1/2 yrs until finished.<br/>\nBarring something major, hubby & I feel I should try to keep her in<br/>\nschool until I&#39;m finished so I can work part-time if need-be to pay<br/>\noff the student loans I have incurred. I&#39;ve also dreamed of having an<br/>\nautism clinic (my goal is to be a family nurse practitioner focusing<br/>\non DAN! protocols) & Allie can come work with me as she gets older, if<br/>\nshe wants. All that said, if I felt we truly needed to, I&#39;d quit<br/>\nschool tomorrow & keep her home.<br/>\n<br/>\nBack to my fear. I fear pulling out Allie and her hating it. I know I<br/>\ncan always send her back, but we can&#39;t do a to school home again every<br/>\nfew weeks every time she gets stressed, which is a common problem with<br/>\nher. How do I overcome this fear/guilt if she seems to miss school?<br/>\nLet me also say, she can talk but has limited abilities to express<br/>\nherself, so I think this is part of my fear, too.<br/>\n<br/>\nThanks for any thoughts. I&#39;m trying to really research & prepare<br/>\nmyself now so that we can be ready if/when the time comes.<br/>\n<br/>\nDebi<br/>\n<br/>\n---------------------------------<br/>\nCheck out the hottest 2008 models today at Yahoo! Autos.<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n                         <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nFussy? Opinionated? Impossible to please? Perfect.  Join Yahoo!&#39;s user panel and lay it on us.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":171724177,"authorName":"Kelly Weyd","from":"Kelly Weyd &lt;kellmar98@...&gt;","profile":"kellmar98","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] new & learning about different learning styles","postDate":"1192307705","msgId":27082,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwMjg0OS40ODM5MC5xbUB3ZWIzMTQwMy5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGZlcDR0aCs3ZHZtQGVHcm91cHMuY29tPg=="},"prevInTopic":27077,"nextInTopic":27092,"prevInTime":27081,"nextInTime":27083,"topicId":27069,"numMessagesInTopic":0,"msgSnippet":"Debi, I will try and get to this post a little later.  I ve got company coming, but I would love to chat a bit.  So later tonight I ll get back on the computer","messageBody":"<div id=\"ygrps-yiv-41416544\">Debi,<br/>\n  I will try and get to this post a little later.  I&#39;ve got company coming, but I would love to chat a bit.  So later tonight I&#39;ll get back on the computer and post a bit.  I&#39;ve got a daughter on the spectrum so I&#39;ll tell you a little bit about us, and what is working for us.  <br/>\n  Kelly<br/>\n  <br/>\n<br/>\nDebi &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fightingautism@...\">fightingautism@...</a>&gt; wrote:<br/>\n          Hey everyone, I&#39;m Debi. I have 3 daughters, 10, 8, and 5. My 10 yr old<br/>\nhas been private schooled, public schooled ,home schooled, then back<br/>\nto public. Essentially, she LOVES public school. My 8 year old has<br/>\nautism and we&#39;ve had our battles each year, she&#39;s in second grade. My<br/>\n5yr old is in public school kindergarten & LOVING it. I&#39;m strongly<br/>\nleaning toward pulling my 8 yr old to homeschool.<br/>\n<br/>\nHere&#39;s my biggest fear. When we tried homeschooling with Jessica, she<br/>\nHATED it. She was so lonely. She never wants to homeschool again.<br/>\nFine, what ever works. Allie, my 8 yr old, is a major struggle with<br/>\nschool. She&#39;s very smart academically but has the typical issues<br/>\nassociated with autism, auditory sensitivity, difficulty following<br/>\ndirections, etc. She pretty much wants to do her art all day long, a<br/>\nnew obsession of her&#39;s in the last 6 mos or so. Each year I feel like<br/>\nI have to teach the teachers all over again. I don&#39;t blame them, they<br/>\nget the royal screw by administration each year.<br/>\n<br/>\nI&#39;m also in college for my BSN. I have 2 1/2 yrs until finished.<br/>\nBarring something major, hubby & I feel I should try to keep her in<br/>\nschool until I&#39;m finished so I can work part-time if need-be to pay<br/>\noff the student loans I have incurred. I&#39;ve also dreamed of having an<br/>\nautism clinic (my goal is to be a family nurse practitioner focusing<br/>\non DAN! protocols) & Allie can come work with me as she gets older, if<br/>\nshe wants. All that said, if I felt we truly needed to, I&#39;d quit<br/>\nschool tomorrow & keep her home.<br/>\n<br/>\nBack to my fear. I fear pulling out Allie and her hating it. I know I<br/>\ncan always send her back, but we can&#39;t do a to school home again every<br/>\nfew weeks every time she gets stressed, which is a common problem with<br/>\nher. How do I overcome this fear/guilt if she seems to miss school?<br/>\nLet me also say, she can talk but has limited abilities to express<br/>\nherself, so I think this is part of my fear, too.<br/>\n<br/>\nThanks for any thoughts. I&#39;m trying to really research & prepare<br/>\nmyself now so that we can be ready if/when the time comes.<br/>\n<br/>\nDebi<br/>\n<br/>\n<br/>\n<br/>\n                         <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\n Check out  the hottest 2008 models today at Yahoo! Autos.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: new & learning about different learning styles","postDate":"1192292398","msgId":27077,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZlcXI3ZSs2bmwxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZlcDR0aCs3ZHZtQGVHcm91cHMuY29tPg=="},"prevInTopic":27069,"nextInTopic":27082,"prevInTime":27076,"nextInTime":27078,"topicId":27069,"numMessagesInTopic":0,"msgSnippet":"Well, this is an unschooling board, not a general homeschooling board, so I m going to give you some very unschooly answers! ... Its helpful to think of our","messageBody":"<div id=\"ygrps-yiv-1804208554\">Well, this is an unschooling board, not a general homeschooling <br/>\nboard, so I&#39;m going to give you some very &quot;unschooly&quot; answers!<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Debi&quot; <br/>\n&lt;fightingautism@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; She pretty much wants to do her art all day long, a<br/>\n&gt; new obsession of her&#39;s in the last 6 mos or so.<br/>\n<br/>\n </span></blockquote>Its helpful to think of our kids as being passionate about living <br/>\nand learning - your dd is passionate about art. Fabulous! does she <br/>\ndraw, paint, build, sew? Learning to see her as passionate (rather <br/>\nthan obsessive) will help you to connect with her and support her. <br/>\n<br/>\nI have one child who is currently passionate about making all manner <br/>\nof things out of paper and will spend whole days cutting and taping. <br/>\nThe other is passionate about online role-playing games and spends <br/>\nhours on the computer every day. In the process of perusing their <br/>\npassions, they learn about all sorts of things - from economics to <br/>\nanatomy.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Back to my fear. I fear pulling out Allie and her hating it.<br/>\n<br/>\n </span></blockquote>Kids hate homeschool when parents don&#39;t support them and their <br/>\npassions and so make homeschooling even less interesting and more <br/>\nstressful than school. If you are doing everything you can to <br/>\nsupport your dd and her passions, she&#39;s unlikely to hate being home. <br/>\n<br/>\nKids interests and needs vary alot. My gamer is really really <br/>\nsocial - that&#39;s why he likes the online games, he gets to chat with <br/>\nother people the whole time. Living in the middle of nowhere, as we <br/>\ndo, its a handy way for him to meet *some* of his social needs on a <br/>\nregular basis. But we also need to do other things all the time to <br/>\nsupport his need to socialize with other people. We&#39;re constantly <br/>\nlooking for other ways for him to do that that he&#39;ll enjoy. Its a <br/>\nlot of work! But its not lesson-planning sorts of work, its going to <br/>\nparties and events and planning get-togethers and networking and <br/>\ntrying new coffee-houses - not the easiest kind of work for a couple <br/>\nintroverts, but we manage. <br/>\n<br/>\nMy paper-artist is much more the introvert, but very active. We&#39;re <br/>\nalways looking for new things to do, climb, spin, roll, tackle and <br/>\nswing from. All of that on a very low income, besides. Today I&#39;m <br/>\nhoping to go to an event with stilt-walkers so she can see what that <br/>\nlooks like irl - descriptions and pictures aren&#39;t cutting the <br/>\nmustard. Again, its lots of work, but it doesn&#39;t look anything <br/>\nlike &quot;teaching&quot;. More like managing a circus - complete with <br/>\ncostumes made entirely of paper ;)<br/>\n<br/>\nAnd again, all of these things are sources of learning for my kids. <br/>\nThere&#39;s no separation between art and science and reading and fun. <br/>\nIts all learning, all the time, here!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Let me also say, she can talk but has limited abilities to express<br/>\n&gt; herself, so I think this is part of my fear, too.<br/>\n<br/>\n </span></blockquote>My younger child wasn&#39;t very interested in verbal communication <br/>\nuntil about a year ago - and yet an important part of unschooling is <br/>\nlearning to communicate with our children. In some ways, that was an <br/>\nadvantage for me, bc I didn&#39;t have the luxury of &quot;explaining&quot; things <br/>\nto her - I had to do a lot of careful watching and striving to <br/>\nunderstand what was going on with Mo so I could help her get her <br/>\nneeds met without a whole lot of words. My older kid is really <br/>\nreally verbal, so it was easy, when he was younger especially, to <br/>\nfall into the habit of &quot;telling&quot; him things and thinking that <br/>\nwas &quot;communication&quot;. Oops. Kids - all kids - need us to listen and <br/>\nwatch and learn to understand them. Whole life unschooling assumes <br/>\nthat to be the Most Important part of parenting (and hence <br/>\nunschooling itself).<br/>\n<br/>\n---Meredith (Mo 6, Ray 14)</div>","specialLinks":[]},{"userId":87859383,"authorName":"Debi","from":"&quot;Debi&quot; &lt;fightingautism@...&gt;","profile":"fightingautism","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"new & learning about different learning styles","postDate":"1192236785","msgId":27069,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZlcDR0aCs3ZHZtQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":27077,"prevInTime":27068,"nextInTime":27070,"topicId":27069,"numMessagesInTopic":0,"msgSnippet":"Hey everyone, I m Debi. I have 3 daughters, 10, 8, and 5. My 10 yr old has been private schooled, public schooled ,home schooled, then back to public.","messageBody":"<div id=\"ygrps-yiv-370530237\">Hey everyone, I&#39;m Debi. I have 3 daughters, 10, 8, and 5. My 10 yr old<br/>\nhas been private schooled, public schooled ,home schooled, then back<br/>\nto public. Essentially, she LOVES public school. My 8 year old has<br/>\nautism and we&#39;ve had our battles each year, she&#39;s in second grade. My<br/>\n5yr old is in public school kindergarten & LOVING it. I&#39;m strongly<br/>\nleaning toward pulling my 8 yr old to homeschool.<br/>\n<br/>\nHere&#39;s my biggest fear. When we tried homeschooling with Jessica, she<br/>\nHATED it. She was so lonely. She never wants to homeschool again.<br/>\nFine, what ever works. Allie, my 8 yr old, is a major struggle with<br/>\nschool. She&#39;s very smart academically but has the typical issues<br/>\nassociated with autism, auditory sensitivity, difficulty following<br/>\ndirections, etc. She pretty much wants to do her art all day long, a<br/>\nnew obsession of her&#39;s in the last 6 mos or so. Each year I feel like<br/>\nI have to teach the teachers all over again. I don&#39;t blame them, they<br/>\nget the royal screw by administration each year.<br/>\n<br/>\nI&#39;m also in college for my BSN. I have 2 1/2 yrs until finished.<br/>\nBarring something major, hubby & I feel I should try to keep her in<br/>\nschool until I&#39;m finished so I can work part-time if need-be to pay<br/>\noff the student loans I have incurred. I&#39;ve also dreamed of having an<br/>\nautism clinic (my goal is to be a family nurse practitioner focusing<br/>\non DAN! protocols) & Allie can come work with me as she gets older, if<br/>\nshe wants. All that said, if I felt we truly needed to, I&#39;d quit<br/>\nschool tomorrow & keep her home.<br/>\n<br/>\nBack to my fear. I fear pulling out Allie and her hating it. I know I<br/>\ncan always send her back, but we can&#39;t do a to school home again every<br/>\nfew weeks every time she gets stressed, which is a common problem with<br/>\nher. How do I overcome this fear/guilt if she seems to miss school?<br/>\nLet me also say, she can talk but has limited abilities to express<br/>\nherself, so I think this is part of my fear, too.<br/>\n<br/>\nThanks for any thoughts. I&#39;m trying to really research & prepare<br/>\nmyself now so that we can be ready if/when the time comes.<br/>\n<br/>\nDebi</div>","specialLinks":[]}],"prevTopicId":27076,"nextTopicId":27024}}