{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":184269211,"authorName":"rebecca de","from":"rebecca de &lt;rebeccadehate@...&gt;","profile":"rebeccadehate","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Help, would someone please call me???","postDate":"1277831429","msgId":44460,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0NTc0Ny4xOTgyMy5xbUB3ZWI1NjEwOC5tYWlsLnJlMy55YWhvby5jb20+","inReplyToHeader":"PGkwNG8yYStxbWZqQGVHcm91cHMuY29tPg==","referencesHeader":"PGkwNG8yYStxbWZqQGVHcm91cHMuY29tPg=="},"prevInTopic":44430,"nextInTopic":0,"prevInTime":44457,"nextInTime":44461,"topicId":44410,"numMessagesInTopic":0,"msgSnippet":"Elli, your post -- has helped me immensely!! I think that you worked through much of your thoughts by just writing it down -- huh!? my mom  and sister have at","messageBody":"<div id=\"ygrps-yiv-374091908\">Elli,<br/>\n  your post -- has helped me immensely!! I think that you worked through much of your thoughts by just writing it down -- huh!? my mom  and sister have at one point been very against my homeschooling -- and when my mom thought it was unschooling -- she really -- mis understood -- still does! but we have started to learn to respect the different values!! as you wrote -- different values!! thank you for posting!<br/>\n<br/>\n Rebecca De Hate<br/>\nwww.the-team.biz/mv978831<br/>\nwww.rebeccadehate.vpweb.com<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: &quot;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marbleface@...\">marbleface@...</a>&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marbleface@...\">marbleface@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Sat, June 26, 2010 7:24:58 AM<br/>\nSubject: [unschoolingbasics] Re: Help, would someone please call me???<br/>\n<br/>\n  <br/>\nThey weren&#39;t respectful to you. Why not tell them what you really feel, however you want to, and let them worry about their feelings? <br/>\n<br/>\nNance<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Elli&quot; &lt;elinorsparks@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Help!  Would someone please call me???  I need to talk to an unschooling person on the phone. <br/>\n&gt; <br/>\n&gt; I just got a letter in the mail from my parents who live in my town, 20 minutes away.  In fact, I just dropped my daughter off to their house with a friend of hers.  Mom and dad are taking the girls out to dinner and the theater.  When I got home I found this letter in the mail that my daughter had handed to me just before we left.<br/>\n&gt; <br/>\n&gt; Anyway, in this letter they are telling me it is time to send my kids back to school.  Got this letter after watching Wife Swap about an unschooling mom swapping with an elementary-school-teacher mom.  They presented the unschooling family as lazy and crazy and unattractive.  I like watching Wife Swap, it gives me time to think about things I might want to do differently in my house, but this one freaked me out.  Getting this letter from my parents right now added to the freak out. <br/>\n&gt; <br/>\n&gt; We are unschooling while working full time jobs.  We&#39;ve got two nannies helping out.  I can work from home 2 or 3 days each week so I get to be around the kids a lot. <br/>\n&gt; <br/>\n&gt; They are 9 and 12.  Right now my 9 loves on-line video games.  My 12 is playing with Barbies we found on-line - fashion and photography. It helps to have a cooperative model like Barbie.  She also bought a math workbook because she wanted to make it easier to pass the homeschooling test required in our state.  It turned out to be a biblical math work book.  So I keep teasing her that she is getting a combo class of religion and math.<br/>\n&gt; <br/>\n&gt; &quot;Life is the classroom, love is the lesson&quot; sums up my philosophy on life.  If my kids grow up knowing how to communicate their feelings and ask for what they want and treat each other with kindness and respect and encouragement and understanding, then I know I will have done my part. <br/>\n&gt; <br/>\n&gt; I could probably do a better job at &quot;strewing&quot; but the kids seem to find what they like just fine. <br/>\n&gt; <br/>\n&gt; I also like the idea of &quot;living as if school doesn&#39;t exist.&quot;  What do you do with your day...just live!  My hubby is planning to relocate his workshop to the studio in our back yard, which will bring him closer to the kids during the day.  We plan to keep the nannies as long as we are both working.  They are lovely and artistic which fits our family perfectly.  They feed the kids and help with light housework which makes my life easier and more pleasant.  My daughter enjoys them both and actually misses them when they aren&#39;t here.  Reminds me of the slogan, &quot;It takes a village to raise a child&quot;  I always felt overwhelmed trying to do it alone.  I like having other folks in the picture. <br/>\n&gt; <br/>\n&gt; Hubby just called!!!!  He is on a trip and gave me some good support just now.  He said, &quot;Tell your mother to butt out.  If our kids don&#39;t like what we&#39;ve done as far as school-no-school, our kids can let us know either now or later in life.  That&#39;s between us and our kids and no one else.&quot;<br/>\n&gt; <br/>\n&gt; I think my parents think un-schooling is child abuse or something.<br/>\n&gt; <br/>\n&gt; Also, mom came from a family where education was prized - a school teacher mom and a minister dad who used to be a school principal.   Going to college allowed mom and all of her sisters to post-pone marriage, which was seen as a miserable institution by her mother and grandmother who was married to an alcoholic.  My dad was the first in his family to go to college. <br/>\n&gt; <br/>\n&gt; So this letter sits here next to me on the kitchen table...What I want to do is put it in an envelop and mail it back to my parents with a note that says, &quot;I appreciate the loving intent behind this letter.  I am not looking for advice from you about the children&#39;s education.  I will let you know when I want your advice.  It would make me so happy if you would let go of your fear and find some faith.&quot;<br/>\n&gt; <br/>\n&gt; Their snarky attitude about un-schooling is apparent to my children who no longer want to visit my parents, spend the night, eat dinner with them, or otherwise hang out with them.  So I am not making them do this. <br/>\n&gt; <br/>\n&gt; It is stressful and confusing when grandma says to the kids, &quot;You will be going back to school when your mom goes back to work.&quot;  Or she snaps or disses them for falling asleep when they visit or being asleep when she and Dad visit us.  My son is particularly sensitive to her attitude and he refuses to visit my parents.  He can hardly get himself to say hi to her.  She doesn&#39;t say hi to him when she visits once a month.  Dad does, but she won&#39;t.  So my kid has to gather his courage and go say hi to her. <br/>\n&gt; <br/>\n&gt; Tensions run so high that I don&#39;t even ask my kids to visit them any more.  I have had my parents and my aunt and uncle over for Sunday dinner once this month and once last month.  I asked the kids first.  They were okay with it.  We had a nice dinner.  I didn&#39;t make the kids eat with us (not enough room at the table anyway.)  I always had cousins around to play with at family dinners.  My kids don&#39;t have any cousins in town, so playing video games while the adults visit is just fine with me.  Dang, I am getting defensive now!!!! <br/>\n&gt; <br/>\n&gt; Communication with my mom is a challenge.  Probably with my dad too, although I don&#39;t know for sure, because mom is always in the midst of things.<br/>\n&gt; <br/>\n&gt; My big life lesson is to trust my inner guidance and follow my bliss regardless of what my mom thinks I should be doing.  Always wanted to be an organic farmer...mom dismissed that dream and vigorously campaigned against it.  How I wish I had heard, &quot;You can do it.  We know you can.&quot; instead of, &quot;Farming is dirty and lonely and leaves you poor.  It is hard hard hard work.  You will be miserable.&quot; Having their encouragement and understanding would have been lovely when I was thinking about becoming an organic farmer 20 years ago. <br/>\n&gt; <br/>\n&gt; I&#39;ve got a great job now.  My schedule is flexible.  The organization makes a difference in the world.  I have 15 years experience in my profession and I am smart which makes the work easy.  I am raising my kids with love and patience.  I&#39;ve got a great team of nannies helping me parent.  I am creating, with my husband, a marriage that gives me pleasure and strength.  I watch with intense happiness as my parenting and my husband&#39;s parenting grows more loving and patient with every day.  My kids are happy and content.  They are doing things they enjoy.  They have friends.  My son giggles now, which I never heard him doing as a young child.  My kids treat each other and me and their dad with kindness and respect, encouragement and understanding.  And I know that they learned this from me!!!!!!!!!!!  I am a brilliant un-schooling mama and my kids, right now in this very moment, are in the absolute perfect spot.  And that will be the case always.<br/>\n&gt; <br/>\n&gt; Ahhhhhhhhhhhh, I am feeling so much better. <br/>\n&gt; <br/>\n&gt; I am going to let that letter sit there.  And then, I am going to...oh!  I just got it!  Values, my parents and I have different values!!! <br/>\n&gt; <br/>\n&gt; They value education.  I value communication. <br/>\n&gt; <br/>\n&gt; They value school.  I value life. <br/>\n&gt; <br/>\n&gt; They value church.  I value the Goddess and prefer to be cooking the primitive diet food that helped cure me of rheumatoid arthritis and listening to &quot;This American Life&quot; on Sunday mornings. <br/>\n&gt; <br/>\n&gt; They value cleanliness.  I value creativity, even if it makes a big mess that you don&#39;t clean up right away. <br/>\n&gt; <br/>\n&gt; They value fitting in.  I value finding my own way. <br/>\n&gt; <br/>\n&gt; They valued extended family over nuclear family.  My firggin&#39; uncle was a pedophile but we still had to go to his house for Christmas every year.  I value my kids and hubby and me first and foremost.  As I said, their comfort and protection comes first.<br/>\n&gt; <br/>\n&gt; We share a value - caring about the community. They volunteer and mom has always worked for non-profit organizations.  I like supporting folks who do something new to improve the world.<br/>\n&gt; <br/>\n&gt; We share a value - democracy (although I prefer giving my kids the actual experience of sharing in decision making rather than having them read about it in a history book while they are compelled to sit still and take tests.)<br/>\n&gt; <br/>\n&gt; So, many of our core values clash although a few line up.  Now I get why this hits me and them so hard.<br/>\n&gt; <br/>\n&gt; The question is how to be kind and respectful to them and yet retain my core values...<br/>\n&gt; <br/>\n&gt; Hmmmmm...something to think about.<br/>\n&gt; <br/>\n&gt; Thanks for listening and reading, if you got this far!!!<br/>\n&gt; <br/>\n&gt; I&#39;d still appreciate a call - 804-475-6775 - and/or feedback.<br/>\n&gt; <br/>\n&gt; Thanks!<br/>\n&gt; <br/>\n&gt; Peace,<br/>\n&gt; <br/>\n&gt; Elli<br/>\n&gt;<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":441747317,"authorName":"Erica Guthaus","from":"Erica Guthaus &lt;eguthaus@...&gt;","profile":"elguthaus","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Help, would someone please call me??? - an \tupdate","postDate":"1277665945","msgId":44430,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlraU9OX0p3WGEwdVFUaXdrUDA3Y0JaMmNPSnM0NzZKUFE1ckhrTEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGkwODc1citkbTJhQGVHcm91cHMuY29tPg==","referencesHeader":"PGkwNWsxMSt1aWE4QGVHcm91cHMuY29tPgk8aTA4NzVyK2RtMmFAZUdyb3Vwcy5jb20+"},"prevInTopic":44429,"nextInTopic":44460,"prevInTime":44429,"nextInTime":44431,"topicId":44410,"numMessagesInTopic":0,"msgSnippet":"Elli, Thanks so much for sharing your thought process with us!  When I read your OP I was completely drawn in because my parents sound much like yours and I ","messageBody":"<div id=\"ygrps-yiv-1067966197\">Elli,<br/>\n<br/>\nThanks so much for sharing your thought process with us!  When I read your<br/>\nOP I was completely drawn in because my parents sound much like yours and I<br/>\ncould totally see myself getting a letter just like that (only in my case it<br/>\nwould be a passive aggressive email *g*).  My mother is NOTORIOUS for her<br/>\nunsolicited advice and it has taken a long time to be able to simply take<br/>\nher words with a grain of salt and go on about my way of doing what&#39;s best<br/>\nfor my family without considering her feelings or reaction to it.  Many<br/>\ntimes this still much easier said than done.<br/>\n<br/>\nI like the approach of changing the names in your very simple letter and<br/>\nsending it back.  I think it&#39;s perfect (and I plan on keeping that one in my<br/>\nback pocket for when I need it..surely sooner, not later!)!<br/>\n<br/>\nGrace,<br/>\n<br/>\nErica<br/>\n***************<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Here&#39;s what I wrote:<br/>\n&gt;<br/>\n&gt; Dear Mom,<br/>\n&gt;<br/>\n&gt; I love you.<br/>\n&gt;<br/>\n&gt; I don&#39;t like it when you tell me what to do.<br/>\n&gt;<br/>\n&gt; Would you please stop doing that?<br/>\n&gt;<br/>\n&gt; Thanks.<br/>\n&gt;<br/>\n&gt; Love,<br/>\n&gt;<br/>\n&gt; Sophia<br/>\n&gt;<br/>\n&gt; ps. There might be times when I want to hear your advice. I will let you<br/>\n&gt; know then. Thanks.<br/>\n&gt;<br/>\n&gt; I like that!! I think I am going to rewrite it and sign my name to it.<br/>\n&gt;<br/>\n&gt; And I am going to let go of the outcome!<br/>\n&gt;<br/>\n&gt; Thanks for your support.<br/>\n&gt;<br/>\n&gt; - Elli<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":237471585,"authorName":"Elli","from":"&quot;Elli&quot; &lt;elinorsparks@...&gt;","profile":"sistergoddesselli","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Help, would someone please call me??? - an update","postDate":"1277665275","msgId":44429,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkwODc1citkbTJhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkwNWsxMSt1aWE4QGVHcm91cHMuY29tPg=="},"prevInTopic":44418,"nextInTopic":44430,"prevInTime":44428,"nextInTime":44430,"topicId":44410,"numMessagesInTopic":0,"msgSnippet":"Hi all - Writing has helped me a lot.  Over the course of the weekend I ve written several different versions of a letter that I might send back to them. I","messageBody":"<div id=\"ygrps-yiv-79561817\">Hi all -<br/>\n<br/>\nWriting has helped me a lot.  Over the course of the weekend I&#39;ve written several different versions of a letter that I might send back to them.  <br/>\n<br/>\nI read the most recent one to my daughter.  She observed that I was still making jabs back at my mom throughout the letter.  My brilliant sweet daughter suggested that I write to her as I would want to be written to.  So, I wrote a letter that I imagined I would want my daughter to write to me if she and I were in the same situation.<br/>\n<br/>\nHere&#39;s what I wrote:<br/>\n<br/>\nDear Mom,<br/>\n<br/>\nI love you.<br/>\n<br/>\nI don&#39;t like it when you tell me what to do.<br/>\n<br/>\nWould you please stop doing that?<br/>\n<br/>\nThanks.<br/>\n<br/>\nLove,<br/>\n<br/>\nSophia<br/>\n<br/>\nps.  There might be times when I want to hear your advice.  I will let you know then.  Thanks.<br/>\n<br/>\n<br/>\nI like that!!  I think I am going to rewrite it and sign my name to it.<br/>\n<br/>\nAnd I am going to let go of the outcome!<br/>\n<br/>\nThanks for your support.<br/>\n<br/>\n- Elli</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Help, would someone please call me???","postDate":"1277580129","msgId":44418,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkwNWsxMSt1aWE4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkwM2QzdStldGVuQGVHcm91cHMuY29tPg=="},"prevInTopic":44413,"nextInTopic":44429,"prevInTime":44417,"nextInTime":44419,"topicId":44410,"numMessagesInTopic":0,"msgSnippet":"... ************* It can help to see valuing community as an aspect of wanting to have connections with other people. The basic, underlying need is for human","messageBody":"<div id=\"ygrps-yiv-1601629028\">&quot;Elli&quot; &lt;elinorsparks@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; The question is how to be kind and respectful to them and yet retain my core values...<br/>\n </span></blockquote>*************<br/>\n<br/>\nIt can help to see &quot;valuing community&quot; as an aspect of wanting to have connections with other people. The basic, underlying need is for human contact and connection - something I&#39;ll bet you Do value, just on different terms. You can honor that by sending them pix or photos or keeping a blog or facebook page for their benefit - something where you can tell the fun stories and show off the cute pictures and they get to know that you care enough to stay in touch, even if they wonder why you never visit any more. <br/>\n<br/>\nIf you&#39;re looking for ways to connect your value to theirs, it might help to think about that &quot;takes a village&quot; saying. To some people, extended family Is the village. That can be a result of isolation or a result of naturally fitting in well in that environment. In that sense, you have the same value, but to you &quot;fitting in&quot; is what defines your village, and since you don&#39;t fit in with family, you&#39;ve moved to a different village, as it were. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Anyway, in this letter they are telling me it is time to send my kids back to school.  Got this letter after watching Wife Swap about an unschooling mom <br/>\n </span></blockquote>***************<br/>\n<br/>\nJust in case it comes up again, it might help to think of something casual to say about television &quot;reality&quot; shows (or &quot;news&quot; shows for that matter, since there have been a lot of unschoolers on tv lately). I honestly wouldn&#39;t respond beyond that - let them know that what they saw on tv has nothing to do with your real life and leave it at that. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Their snarky attitude about un-schooling is apparent to my children who no longer want to visit my parents, spend the night, eat dinner with them, or otherwise hang out with them.  So I am not making them do this. <br/>\n </span></blockquote>*****************<br/>\n<br/>\nGood. Its important to honor your kids boundaries in this regard. I&#39;m hoping De chimes in on this topic, since she had some hard times with her family - or maybe inlaws - for awhile. If not I&#39;ll try to find the old threads on the topic. <br/>\n<br/>\nFWIW, I was made to visit extended family as a child and it wasn&#39;t horrible, but I was never really comfortable - and now, as an adult I have next to no contact with most of my family. Making kids visit with family doesn&#39;t grow love. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Help!  Would someone please call me???  I need to talk to an unschooling person on the phone.  <br/>\n </span></blockquote>*************<br/>\n<br/>\nDid anyone call? Do you still need it? I don&#39;t think as well out loud as I do in print, but I can offer encouragement and support over the phone for sure. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help, would someone please call me???","postDate":"1277551498","msgId":44413,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkwNG8yYStxbWZqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkwM2QzdStldGVuQGVHcm91cHMuY29tPg=="},"prevInTopic":44412,"nextInTopic":44418,"prevInTime":44412,"nextInTime":44414,"topicId":44410,"numMessagesInTopic":0,"msgSnippet":"They weren t respectful to you. Why not tell them what you really feel, however you want to, and let them worry about their feelings? Nance","messageBody":"<div id=\"ygrps-yiv-1272905177\">They weren&#39;t respectful to you. Why not tell them what you really feel, however you want to, and let them worry about their feelings? <br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Elli&quot; &lt;elinorsparks@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Help!  Would someone please call me???  I need to talk to an unschooling person on the phone.  <br/>\n&gt; <br/>\n&gt; I just got a letter in the mail from my parents who live in my town, 20 minutes away.  In fact, I just dropped my daughter off to their house with a friend of hers.  Mom and dad are taking the girls out to dinner and the theater.  When I got home I found this letter in the mail that my daughter had handed to me just before we left.<br/>\n&gt; <br/>\n&gt; Anyway, in this letter they are telling me it is time to send my kids back to school.  Got this letter after watching Wife Swap about an unschooling mom swapping with an elementary-school-teacher mom.  They presented the unschooling family as lazy and crazy and unattractive.  I like watching Wife Swap, it gives me time to think about things I might want to do differently in my house, but this one freaked me out.  Getting this letter from my parents right now added to the freak out.    <br/>\n&gt; <br/>\n&gt; We are unschooling while working full time jobs.  We&#39;ve got two nannies helping out.  I can work from home 2 or 3 days each week so I get to be around the kids a lot.  <br/>\n&gt; <br/>\n&gt; They are 9 and 12.  Right now my 9 loves on-line video games.  My 12 is playing with Barbies we found on-line - fashion and photography. It helps to have a cooperative model like Barbie.  She also bought a math workbook because she wanted to make it easier to pass the homeschooling test required in our state.  It turned out to be a biblical math work book.  So I keep teasing her that she is getting a combo class of religion and math.<br/>\n&gt; <br/>\n&gt; &quot;Life is the classroom, love is the lesson&quot; sums up my philosophy on life.  If my kids grow up knowing how to communicate their feelings and ask for what they want and treat each other with kindness and respect and encouragement and understanding, then I know I will have done my part. <br/>\n&gt; <br/>\n&gt; I could probably do a better job at &quot;strewing&quot; but the kids seem to find what they like just fine.  <br/>\n&gt; <br/>\n&gt; I also like the idea of &quot;living as if school doesn&#39;t exist.&quot;  What do you do with your day...just live!  My hubby is planning to relocate his workshop to the studio in our back yard, which will bring him closer to the kids during the day.  We plan to keep the nannies as long as we are both working.  They are lovely and artistic which fits our family perfectly.  They feed the kids and help with light housework which makes my life easier and more pleasant.  My daughter enjoys them both and actually misses them when they aren&#39;t here.  Reminds me of the slogan, &quot;It takes a village to raise a child&quot;  I always felt overwhelmed trying to do it alone.  I like having other folks in the picture.  <br/>\n&gt; <br/>\n&gt; Hubby just called!!!!  He is on a trip and gave me some good support just now.  He said, &quot;Tell your mother to butt out.  If our kids don&#39;t like what we&#39;ve done as far as school-no-school, our kids can let us know either now or later in life.  That&#39;s between us and our kids and no one else.&quot;<br/>\n&gt; <br/>\n&gt; I think my parents think un-schooling is child abuse or something.<br/>\n&gt; <br/>\n&gt; Also, mom came from a family where education was prized - a school teacher mom and a minister dad who used to be a school principal.   Going to college allowed mom and all of her sisters to post-pone marriage, which was seen as a miserable institution by her mother and grandmother who was married to an alcoholic.  My dad was the first in his family to go to college. <br/>\n&gt; <br/>\n&gt; So this letter sits here next to me on the kitchen table...What I want to do is put it in an envelop and mail it back to my parents with a note that says, &quot;I appreciate the loving intent behind this letter.  I am not looking for advice from you about the children&#39;s education.  I will let you know when I want your advice.  It would make me so happy if you would let go of your fear and find some faith.&quot;<br/>\n&gt; <br/>\n&gt; Their snarky attitude about un-schooling is apparent to my children who no longer want to visit my parents, spend the night, eat dinner with them, or otherwise hang out with them.  So I am not making them do this.  <br/>\n&gt; <br/>\n&gt; It is stressful and confusing when grandma says to the kids, &quot;You will be going back to school when your mom goes back to work.&quot;  Or she snaps or disses them for falling asleep when they visit or being asleep when she and Dad visit us.  My son is particularly sensitive to her attitude and he refuses to visit my parents.  He can hardly get himself to say hi to her.  She doesn&#39;t say hi to him when she visits once a month.  Dad does, but she won&#39;t.  So my kid has to gather his courage and go say hi to her.  <br/>\n&gt; <br/>\n&gt; Tensions run so high that I don&#39;t even ask my kids to visit them any more.  I have had my parents and my aunt and uncle over for Sunday dinner once this month and once last month.  I asked the kids first.  They were okay with it.  We had a nice dinner.  I didn&#39;t make the kids eat with us (not enough room at the table anyway.)  I always had cousins around to play with at family dinners.  My kids don&#39;t have any cousins in town, so playing video games while the adults visit is just fine with me.  Dang, I am getting defensive now!!!! <br/>\n&gt; <br/>\n&gt; Communication with my mom is a challenge.  Probably with my dad too, although I don&#39;t know for sure, because mom is always in the midst of things.<br/>\n&gt; <br/>\n&gt; My big life lesson is to trust my inner guidance and follow my bliss regardless of what my mom thinks I should be doing.  Always wanted to be an organic farmer...mom dismissed that dream and vigorously campaigned against it.  How I wish I had heard, &quot;You can do it.  We know you can.&quot; instead of, &quot;Farming is dirty and lonely and leaves you poor.  It is hard hard hard work.  You will be miserable.&quot; Having their encouragement and understanding would have been lovely when I was thinking about becoming an organic farmer 20 years ago. <br/>\n&gt; <br/>\n&gt; I&#39;ve got a great job now.  My schedule is flexible.  The organization makes a difference in the world.  I have 15 years experience in my profession and I am smart which makes the work easy.  I am raising my kids with love and patience.  I&#39;ve got a great team of nannies helping me parent.  I am creating, with my husband, a marriage that gives me pleasure and strength.  I watch with intense happiness as my parenting and my husband&#39;s parenting grows more loving and patient with every day.  My kids are happy and content.  They are doing things they enjoy.  They have friends.  My son giggles now, which I never heard him doing as a young child.  My kids treat each other and me and their dad with kindness and respect, encouragement and understanding.  And I know that they learned this from me!!!!!!!!!!!  I am a brilliant un-schooling mama and my kids, right now in this very moment, are in the absolute perfect spot.  And that will be the case always.<br/>\n&gt; <br/>\n&gt; Ahhhhhhhhhhhh, I am feeling so much better.  <br/>\n&gt; <br/>\n&gt; I am going to let that letter sit there.  And then, I am going to...oh!  I just got it!  Values, my parents and I have different values!!!  <br/>\n&gt; <br/>\n&gt; They value education.  I value communication.  <br/>\n&gt; <br/>\n&gt; They value school.  I value life.  <br/>\n&gt; <br/>\n&gt; They value church.  I value the Goddess and prefer to be cooking the primitive diet food that helped cure me of rheumatoid arthritis and listening to &quot;This American Life&quot; on Sunday mornings.  <br/>\n&gt; <br/>\n&gt; They value cleanliness.  I value creativity, even if it makes a big mess that you don&#39;t clean up right away.  <br/>\n&gt; <br/>\n&gt; They value fitting in.  I value finding my own way.  <br/>\n&gt; <br/>\n&gt; They valued extended family over nuclear family.  My firggin&#39; uncle was a pedophile but we still had to go to his house for Christmas every year.  I value my kids and hubby and me first and foremost.  As I said, their comfort and protection comes first.<br/>\n&gt; <br/>\n&gt; We share a value - caring about the community. They volunteer and mom has always worked for non-profit organizations.  I like supporting folks who do something new to improve the world.<br/>\n&gt; <br/>\n&gt; We share a value - democracy (although I prefer giving my kids the actual experience of sharing in decision making rather than having them read about it in a history book while they are compelled to sit still and take tests.)<br/>\n&gt; <br/>\n&gt; So, many of our core values clash although a few line up.  Now I get why this hits me and them so hard.<br/>\n&gt; <br/>\n&gt; The question is how to be kind and respectful to them and yet retain my core values...<br/>\n&gt; <br/>\n&gt; Hmmmmm...something to think about.<br/>\n&gt; <br/>\n&gt; Thanks for listening and reading, if you got this far!!!<br/>\n&gt; <br/>\n&gt; I&#39;d still appreciate a call - 804-475-6775 - and/or feedback.<br/>\n&gt; <br/>\n&gt; Thanks!<br/>\n&gt; <br/>\n&gt; Peace,<br/>\n&gt; <br/>\n&gt; Elli<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":367302968,"authorName":"VickiJ","from":"&quot;VickiJ&quot; &lt;vjohnsonbarrett@...&gt;","profile":"vjohnsonbarrett","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Help, would someone please call me???","postDate":"1277541636","msgId":44412,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkwNGVlNCtoOGVpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkwM2QzdStldGVuQGVHcm91cHMuY29tPg=="},"prevInTopic":44410,"nextInTopic":44413,"prevInTime":44411,"nextInTime":44413,"topicId":44410,"numMessagesInTopic":0,"msgSnippet":"I just love how you talked yourself through this! I, too, felt better by the time you were finished processing your thoughts. You are doing just fine . . . ","messageBody":"<div id=\"ygrps-yiv-535284972\">I just love how you talked yourself through this! I, too, felt better by the time you were finished processing your thoughts. You are doing just fine . . .<br/>\nVicki<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Elli&quot; &lt;elinorsparks@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Help!  Would someone please call me???  I need to talk to an unschooling person on the phone.  <br/>\n&gt; <br/>\n&gt;&gt; <br/>\n&gt; So, many of our core values clash although a few line up.  Now I get why this hits me and them so hard.<br/>\n&gt; <br/>\n&gt; The question is how to be kind and respectful to them and yet retain my core values...<br/>\n&gt; <br/>\n&gt; Hmmmmm...something to think about.<br/>\n&gt; <br/>\n&gt; Thanks for listening and reading, if you got this far!!!<br/>\n&gt; <br/>\n&gt; I&#39;d still appreciate a call - 804-475-6775 - and/or feedback.<br/>\n&gt; <br/>\n&gt; Thanks!<br/>\n&gt; <br/>\n&gt; Peace,<br/>\n&gt; <br/>\n&gt; Elli<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":237471585,"authorName":"Elli","from":"&quot;Elli&quot; &lt;elinorsparks@...&gt;","profile":"sistergoddesselli","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Help, would someone please call me???","postDate":"1277507518","msgId":44410,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkwM2QzdStldGVuQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":44412,"prevInTime":44409,"nextInTime":44411,"topicId":44410,"numMessagesInTopic":0,"msgSnippet":"Help!  Would someone please call me???  I need to talk to an unschooling person on the phone. I just got a letter in the mail from my parents who live in my","messageBody":"<div id=\"ygrps-yiv-1332959066\">Help!  Would someone please call me???  I need to talk to an unschooling person on the phone.  <br/>\n<br/>\nI just got a letter in the mail from my parents who live in my town, 20 minutes away.  In fact, I just dropped my daughter off to their house with a friend of hers.  Mom and dad are taking the girls out to dinner and the theater.  When I got home I found this letter in the mail that my daughter had handed to me just before we left.<br/>\n<br/>\nAnyway, in this letter they are telling me it is time to send my kids back to school.  Got this letter after watching Wife Swap about an unschooling mom swapping with an elementary-school-teacher mom.  They presented the unschooling family as lazy and crazy and unattractive.  I like watching Wife Swap, it gives me time to think about things I might want to do differently in my house, but this one freaked me out.  Getting this letter from my parents right now added to the freak out.    <br/>\n<br/>\nWe are unschooling while working full time jobs.  We&#39;ve got two nannies helping out.  I can work from home 2 or 3 days each week so I get to be around the kids a lot.  <br/>\n<br/>\nThey are 9 and 12.  Right now my 9 loves on-line video games.  My 12 is playing with Barbies we found on-line - fashion and photography. It helps to have a cooperative model like Barbie.  She also bought a math workbook because she wanted to make it easier to pass the homeschooling test required in our state.  It turned out to be a biblical math work book.  So I keep teasing her that she is getting a combo class of religion and math.<br/>\n<br/>\n&quot;Life is the classroom, love is the lesson&quot; sums up my philosophy on life.  If my kids grow up knowing how to communicate their feelings and ask for what they want and treat each other with kindness and respect and encouragement and understanding, then I know I will have done my part. <br/>\n<br/>\nI could probably do a better job at &quot;strewing&quot; but the kids seem to find what they like just fine.  <br/>\n<br/>\nI also like the idea of &quot;living as if school doesn&#39;t exist.&quot;  What do you do with your day...just live!  My hubby is planning to relocate his workshop to the studio in our back yard, which will bring him closer to the kids during the day.  We plan to keep the nannies as long as we are both working.  They are lovely and artistic which fits our family perfectly.  They feed the kids and help with light housework which makes my life easier and more pleasant.  My daughter enjoys them both and actually misses them when they aren&#39;t here.  Reminds me of the slogan, &quot;It takes a village to raise a child&quot;  I always felt overwhelmed trying to do it alone.  I like having other folks in the picture.  <br/>\n<br/>\nHubby just called!!!!  He is on a trip and gave me some good support just now.  He said, &quot;Tell your mother to butt out.  If our kids don&#39;t like what we&#39;ve done as far as school-no-school, our kids can let us know either now or later in life.  That&#39;s between us and our kids and no one else.&quot;<br/>\n<br/>\nI think my parents think un-schooling is child abuse or something.<br/>\n<br/>\nAlso, mom came from a family where education was prized - a school teacher mom and a minister dad who used to be a school principal.   Going to college allowed mom and all of her sisters to post-pone marriage, which was seen as a miserable institution by her mother and grandmother who was married to an alcoholic.  My dad was the first in his family to go to college. <br/>\n<br/>\nSo this letter sits here next to me on the kitchen table...What I want to do is put it in an envelop and mail it back to my parents with a note that says, &quot;I appreciate the loving intent behind this letter.  I am not looking for advice from you about the children&#39;s education.  I will let you know when I want your advice.  It would make me so happy if you would let go of your fear and find some faith.&quot;<br/>\n<br/>\nTheir snarky attitude about un-schooling is apparent to my children who no longer want to visit my parents, spend the night, eat dinner with them, or otherwise hang out with them.  So I am not making them do this.  <br/>\n<br/>\nIt is stressful and confusing when grandma says to the kids, &quot;You will be going back to school when your mom goes back to work.&quot;  Or she snaps or disses them for falling asleep when they visit or being asleep when she and Dad visit us.  My son is particularly sensitive to her attitude and he refuses to visit my parents.  He can hardly get himself to say hi to her.  She doesn&#39;t say hi to him when she visits once a month.  Dad does, but she won&#39;t.  So my kid has to gather his courage and go say hi to her.  <br/>\n<br/>\nTensions run so high that I don&#39;t even ask my kids to visit them any more.  I have had my parents and my aunt and uncle over for Sunday dinner once this month and once last month.  I asked the kids first.  They were okay with it.  We had a nice dinner.  I didn&#39;t make the kids eat with us (not enough room at the table anyway.)  I always had cousins around to play with at family dinners.  My kids don&#39;t have any cousins in town, so playing video games while the adults visit is just fine with me.  Dang, I am getting defensive now!!!! <br/>\n<br/>\nCommunication with my mom is a challenge.  Probably with my dad too, although I don&#39;t know for sure, because mom is always in the midst of things.<br/>\n<br/>\nMy big life lesson is to trust my inner guidance and follow my bliss regardless of what my mom thinks I should be doing.  Always wanted to be an organic farmer...mom dismissed that dream and vigorously campaigned against it.  How I wish I had heard, &quot;You can do it.  We know you can.&quot; instead of, &quot;Farming is dirty and lonely and leaves you poor.  It is hard hard hard work.  You will be miserable.&quot; Having their encouragement and understanding would have been lovely when I was thinking about becoming an organic farmer 20 years ago. <br/>\n<br/>\nI&#39;ve got a great job now.  My schedule is flexible.  The organization makes a difference in the world.  I have 15 years experience in my profession and I am smart which makes the work easy.  I am raising my kids with love and patience.  I&#39;ve got a great team of nannies helping me parent.  I am creating, with my husband, a marriage that gives me pleasure and strength.  I watch with intense happiness as my parenting and my husband&#39;s parenting grows more loving and patient with every day.  My kids are happy and content.  They are doing things they enjoy.  They have friends.  My son giggles now, which I never heard him doing as a young child.  My kids treat each other and me and their dad with kindness and respect, encouragement and understanding.  And I know that they learned this from me!!!!!!!!!!!  I am a brilliant un-schooling mama and my kids, right now in this very moment, are in the absolute perfect spot.  And that will be the case always.<br/>\n<br/>\nAhhhhhhhhhhhh, I am feeling so much better.  <br/>\n<br/>\nI am going to let that letter sit there.  And then, I am going to...oh!  I just got it!  Values, my parents and I have different values!!!  <br/>\n<br/>\nThey value education.  I value communication.  <br/>\n<br/>\nThey value school.  I value life.  <br/>\n<br/>\nThey value church.  I value the Goddess and prefer to be cooking the primitive diet food that helped cure me of rheumatoid arthritis and listening to &quot;This American Life&quot; on Sunday mornings.  <br/>\n<br/>\nThey value cleanliness.  I value creativity, even if it makes a big mess that you don&#39;t clean up right away.  <br/>\n<br/>\nThey value fitting in.  I value finding my own way.  <br/>\n<br/>\nThey valued extended family over nuclear family.  My firggin&#39; uncle was a pedophile but we still had to go to his house for Christmas every year.  I value my kids and hubby and me first and foremost.  As I said, their comfort and protection comes first.<br/>\n<br/>\nWe share a value - caring about the community. They volunteer and mom has always worked for non-profit organizations.  I like supporting folks who do something new to improve the world.<br/>\n<br/>\nWe share a value - democracy (although I prefer giving my kids the actual experience of sharing in decision making rather than having them read about it in a history book while they are compelled to sit still and take tests.)<br/>\n<br/>\nSo, many of our core values clash although a few line up.  Now I get why this hits me and them so hard.<br/>\n<br/>\nThe question is how to be kind and respectful to them and yet retain my core values...<br/>\n<br/>\nHmmmmm...something to think about.<br/>\n<br/>\nThanks for listening and reading, if you got this far!!!<br/>\n<br/>\nI&#39;d still appreciate a call - 804-475-6775 - and/or feedback.<br/>\n<br/>\nThanks!<br/>\n<br/>\nPeace,<br/>\n<br/>\nElli</div>","specialLinks":[]}],"prevTopicId":44436,"nextTopicId":44405}}