{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Frustrated Daughter and Sibling Conflict","postDate":"1318711652","msgId":47529,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo3Y3JoNCs0cnRvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo3Y21kaytnMmNhQGVHcm91cHMuY29tPg=="},"prevInTopic":47528,"nextInTopic":0,"prevInTime":47528,"nextInTime":47530,"topicId":47528,"numMessagesInTopic":0,"msgSnippet":"... That s a setup for conflict right there! Age five often seems like a rehash of age three in terms of needs and how kids solve problems. So some of the","messageBody":"<div id=\"ygrps-yiv-917964813\">&quot;clarissa&quot; &lt;beasyouare@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Daughter is 5.5 and son is 3.5...<br/>\n<br/>\n </span></blockquote>That&#39;s a setup for conflict right there! Age five often seems like a rehash of age three in terms of needs and how kids solve problems. So some of the problem will eventually go away on its own - they won&#39;t be 3 and 5 forever.<br/>\n<br/>\nSomething to keep in mind - and this might sound odd - is that your goal isn&#39;t to stop them from fighting, but to help them learn more about problem solving. Arguing is how they&#39;re learning to do that. You want to prevent injuries and keep one child from feeling bullied by the other, but don&#39;t expect &quot;A&quot; solution. You&#39;re helping them build a skill-set by working out each issue individually. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;My usual method- to be more present and engaged with them - is not seeming to help.<br/>\n </span></blockquote>***************<br/>\n<br/>\nDepending on what you&#39;re doing and what they need, it could help to step back a bit. That&#39;s something to experiment with - sometimes it&#39;s better to let kids work things out. Sometimes it&#39;s better to get in the middle. Sometimes it&#39;s better to talk to each of the separately and play mediator. There are more thoughts on siblings and fighting collected here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/fighting\">http://sandradodd.com/peace/fighting</a><br/>\n<br/>\nBut again, the big thing to keep in mind is that often you can&#39;t depend on one method, even with situations that seem very similar. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Lately they have both been figuring out what it means to them to trade their toys or give them to each other and conflict and name-calling set in when one of them, in almost every case, eventually changes their mind and wants their toy back.<br/>\n </span></blockquote>******************<br/>\n<br/>\nIf you&#39;re right there, you can suggest they &quot;take turns&quot; rather than &quot;trade&quot;. If you&#39;re pretty sure the original owner is going to want the toy back, its not a real trade and it may help to assert that (as kindly as you can) from the start - trades are not &quot;forever&quot; - and remind them later. Chances are that&#39;s not going to &quot;solve&quot; things or prevent hurt feelings, at least not the first time, but it does offer them another option in terms of how to think about things. That&#39;s an important part of your role - providing ideas and options they don&#39;t think of themselves. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Lillian is often very persistent when she wants something that is not hers and has started using some new techniques that come across as pressuring her brother and friends, telling them if they don&#39;t give her what she wants she will hate them/not be their friend/hit them/take it anyway.<br/>\n </span></blockquote>**************<br/>\n<br/>\nFrom her point of view, its a tactic which is worth trying. If you&#39;re on hand, offer other options - turn taking, or a distraction for her or for all the kids. Offer a snack. Offer to put on a movie or play a game. Offer to do something in another room with one or more children. <br/>\n<br/>\n A bigger question might be why she&#39;s so focused on wanting what other people have. Is she feeling insecure about something? Is she getting enough babying? Sometimes parents forget to baby an eldest child and that can create a lot of insecurity. Has she been made to give up or &quot;hand down&quot; things to her brother or give things away to others? Does she need more &quot;girl time&quot; or time alone with her mommy? Does she co-sleep? Sometimes kids will move out of the family bed but then need to come back. Is she getting snacks at regular intervals? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I attempt to let her know I see she is disappointed...<br/>\n<br/>\n </span></blockquote>To her, that may come across as belittling. Right in that moment, she&#39;s furious and hateful. You don&#39;t need to argue with her about that or put down her feelings. They&#39;re hers. If she&#39;s upsetting her brother or her dad, go be kind to him. Let him know you love him, then see what you can do to be kind to her, too, so she can stop being so unhappy. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":215968352,"authorName":"clarissa","from":"&quot;clarissa&quot; &lt;beasyouare@...&gt;","profile":"soulstar78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Frustrated Daughter and Sibling Conflict","postDate":"1318706420","msgId":47528,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo3Y21kaytnMmNhQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":47529,"prevInTime":47527,"nextInTime":47529,"topicId":47528,"numMessagesInTopic":0,"msgSnippet":"Hi all, Daughter is 5.5 and son is 3.5. Lately there has been an increase in their conflicts and I am not sure how to approach it. My usual method- to be more","messageBody":"<div id=\"ygrps-yiv-734437422\">Hi all,<br/>\nDaughter is 5.5 and son is 3.5. Lately there has been an increase in their conflicts and I am not sure how to approach it. My usual method- to be more present and engaged with them - is not seeming to help. Often, getting out of the house helps but lately the conflict comes with us. <br/>\nLately they have both been figuring out what it means to them to trade their toys or give them to each other and conflict and name-calling set in when one of them, in almost every case, eventually changes their mind and wants their toy back. They say &quot;But I was kidding. I didn&#39;t really mean to give it to her/him.&quot;<br/>\nBoth of them are dong a lot of calling each other and me and my husband &quot;stupid&quot; and &quot;bad&quot; and there&#39;s a lot of &quot;I hate you&quot; flying from their mouths. I realize they are expressing something but am pretty tired of all this! <br/>\nLillian is often very persistent when she wants something that is not hers and has started using some new techniques that come across as pressuring her brother and friends, telling them if they don&#39;t give her what she wants she will hate them/not be their friend/hit them/take it anyway. I want to assist her in getting what she wants but am uncomfortable with her threats. She also makes threats to me and my husband when she doesn&#39;t get the answer she wants. I attempt to let her know I see she is disappointed but I want everyone in our family to feel safe in our home and we don&#39;t want to be threatened. As I type this, I am seeing that she sounds like a pretty angry little girl and feel compelled to add that I make a point to notice the many thoughtful and compassionate gestures she makes as well. <br/>\nI&#39;d very much love to hear how others would handle these types of challenges.<br/>\nThanks,<br/>\nClarissa</div>","specialLinks":[]}],"prevTopicId":47507,"nextTopicId":47502}}