{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: finding alone time with husband","postDate":"1363308038","msgId":49746,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtodHFtNituMzQ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBTWY4aTFYRnUxdWNKUktfd1JYVFRXeEQrdFNRT3djY245TnIwZmJEWkVEUl9hSy1zZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49735,"nextInTopic":0,"prevInTime":49745,"nextInTime":49748,"topicId":49724,"numMessagesInTopic":0,"msgSnippet":"... This is really sweet. Over time George and I have build up a kind of private language made up of references and bits of humor that only we share. It s the","messageBody":"<div id=\"ygrps-yiv-1692151394\">Renae R &lt;renaerentz@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;One thing<br/>\n&gt; that has helped me has been to think of our sexual intimacy as ongoing<br/>\n&gt; rather than as an &quot;event.&quot;  The &quot;foreplay&quot; is ongoing from text messages<br/>\n&gt; throughout the day, to touching and kissing for little impromptu bits of<br/>\n&gt; time in the evening<br/>\n<br/>\n </span></blockquote>This is really sweet. Over time George and I have build up a kind of private language made up of references and bits of humor that only we share. It&#39;s the sort of thing which often grows in families naturally - you know how there are some jokes only your siblings will ever get? That sort of private language, only it includes little bits of code which refer to shared intimacies and even sex. It&#39;s sweet and it keeps us connecting - not just connectED but actively connecting even when we&#39;re busy doing other things. <br/>\n<br/>\nThere are bits of irony and fantasy and even the macabre in our shared play, but it&#39;s never cynical or mean. We don&#39;t tear each other down any more than we tear our kids down, and for essentially the same reasons. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":475325572,"authorName":"Renae R","from":"Renae R &lt;renaerentz@...&gt;","profile":"mnmom228","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: finding alone time with husband","postDate":"1363028053","msgId":49735,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTWY4aTFYRnUxdWNKUktfd1JYVFRXeEQrdFNRT3djY245TnIwZmJEWkVEUl9hSy1zZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGtobDY4NytvbzI5QGVHcm91cHMuY29tPg==","referencesHeader":"PDEzNjI5NjM4NjguOTUyMTIuWWFob29NYWlsTmVvQHdlYjE2NDAwMi5tYWlsLmdxMS55YWhvby5jb20+CTxraGw2ODcrb28yOUBlR3JvdXBzLmNvbT4="},"prevInTopic":49734,"nextInTopic":49746,"prevInTime":49734,"nextInTime":49736,"topicId":49724,"numMessagesInTopic":0,"msgSnippet":"My husband and I enjoy sharing in sexual experiences together.  One thing that has helped me has been to think of our sexual intimacy as ongoing rather than as","messageBody":"<div id=\"ygrps-yiv-451988642\">My husband and I enjoy sharing in sexual experiences together.  One thing<br/>\nthat has helped me has been to think of our sexual intimacy as ongoing<br/>\nrather than as an &quot;event.&quot;  The &quot;foreplay&quot; is ongoing from text messages<br/>\nthroughout the day, to touching and kissing for little impromptu bits of<br/>\ntime in the evening, jumping in the shower together, etc.. all building up<br/>\nto intercourse later that night.  When the tension or excitement is<br/>\nbuilding up all day and is ongoing, the actual intercourse doesn&#39;t take<br/>\nvery long because we skip a few steps and we already feel very connected.<br/>\nSometimes one of us will get started by themselves and then the other joins<br/>\nwhen our daughter is occupied.<br/>\n<br/>\nWe do like to have more time for the two of us and so about once a month,<br/>\nwe try to have someone watch my daughter for an afternoon or evening and we<br/>\ncan spend more time cuddling, watching the movies we like, or having a<br/>\nlonger, more romantic sexual experience.<br/>\n<br/>\nI don&#39;t talk about my sexuality very much, so this was really awkward for<br/>\nme to write, so I hope it helps someone!!<br/>\n<br/>\nRenae<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: finding alone time with husband","postDate":"1363024967","msgId":49734,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtobDY4NytvbzI5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNjI5NjM4NjguOTUyMTIuWWFob29NYWlsTmVvQHdlYjE2NDAwMi5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":49731,"nextInTopic":49735,"prevInTime":49733,"nextInTime":49735,"topicId":49724,"numMessagesInTopic":0,"msgSnippet":"... ************** Since I don t know you, I can t possibly know what you need - and what you, personally, need is less important to the discussion as a whole","messageBody":"<div id=\"ygrps-yiv-1405683277\">Kari Barber &lt;spiraldancer27@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I just wanted to be clear because it seems like you keep suggesting that it must be something else I need.<br/>\n </span></blockquote>**************<br/>\n<br/>\nSince I don&#39;t know you, I can&#39;t possibly know what you need - and what you, personally, need is less important to the discussion as a whole than digging down into the various ideas surrounding the subject and how they relate to learning and human nature. I&#39;m sorry that wasn&#39;t clear. Probably you don&#39;t actually need more than Dana&#39;s list ;) but other people are reading and their situations won&#39;t be identical to yours. <br/>\n<br/>\nI&#39;m going to keep digging into ideas.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think too often people (especially women) discount its massive importance in a marriage. <br/>\n </span></blockquote>**************<br/>\n<br/>\nMassive importance is a massive overstatement. The importance of sex in a marriage varies a whole lot - even within the same marriage. It&#39;s not uncommon for women to go through long periods of very low libido, especially with pregnancies and breastfeeding thrown into the mix. And yet other women get much, much more interested in sex when they&#39;re pregnant and/or nursing. Men&#39;s libidos also fluctuate, although they tend not to talk about that so much. Health issues, including mental health issues, also play a big part in sexual interest and availability. <br/>\n<br/>\nFor some individuals sex is more important than it is for others. That will have an effect on the importance of sex in a relationship - it will also have an effect on the importance of communication in a relationship!  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;it&#39;s about creating a kind of magic shared experience. For me it&#39;s a kind of bonding that cannot be achieved through any other means.<br/>\n </span></blockquote>**************<br/>\n<br/>\nThat&#39;s a good example of how sex can meet different needs for different people. For you, it&#39;s about creating a magic shared experience. That&#39;s not true for everyone. It is possible to create magical, shared experiences without sex. It&#39;s possible to be really intimate without sex. It&#39;s possible to bond without sex. So it&#39;s possible to get those needs met to an extent even if you can&#39;t find time for sex per se or if you or your partner is sexually unavailable for a time. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;sex isn&#39;t really about orgasm, often we are actually better at that on our own, right?<br/>\n </span></blockquote>*****************<br/>\n<br/>\nWhile I absolutely appreciate that very feminist perspective, it&#39;s not realistic to assume all other moms have figured that out. And it&#39;s Really not realistic to assume that most husbands will agree that sex isn&#39;t about orgasm. That&#39;s something couples can learn about together, for sure.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: finding alone time with husband","postDate":"1363005832","msgId":49731,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4M0M5RDc2RTVAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":49730,"nextInTopic":49734,"prevInTime":49730,"nextInTime":49732,"topicId":49724,"numMessagesInTopic":0,"msgSnippet":"When DS was littler (under about 6), we d have regular weekly date nights which often meant simply that we dropped DS off to visit with Grandma for a couple","messageBody":"<div id=\"ygrps-yiv-666765688\">When DS was littler (under about 6), we&#39;d have regular weekly &#39;date nights&#39; which often meant simply that we dropped DS off to visit with Grandma for a couple of hours then went home specifically for physical intimacy. FWIW, by the time DS was 5, we were okay with him being up after we went up to the bedroom - however, he usually wanted to be with us, so he&#39;d make his way upstairs shortly after we did and come in for snuggling to sleep. Since I WOH fulltime, I&#39;m the only one in the house with a bedtime of sorts. Both DS and DH know that if you want Mommy for anything, talk to me before that bedtime. DS would fall asleep in our bed and we&#39;d &#39;sleepwalk&#39; or carry him back to his room; he was free to return to our bed if he woke during the night. By the time he was maybe 6 or 7, he was okay playing and watching TV and such downstairs while hubby and I went upstairs &quot;behind closed doors&quot;. We just asked that DS knock first before coming into the room - and we extended the same courtesy to him when entering his room. By that point, he asked what we do when we&#39;re &quot;in private&quot; and I told him that sometimes we talk about things that would probably be boring for him (like bills), sometimes we watched movies that were not things he liked, and sometimes we had sex (yes I said it pretty much exactly that plainly). He pondered that for a few days, then came back and asked what exactly &#39;sex&#39; was. So I explained the basics (he already knew that men and women had different &#39;parts&#39;). However, there&#39;s just one of him, no younger (or older) siblings to interact with (or conflict with), so that changes dynamics a bit. We have also, from time to time, set the alarm for an hour or so early when we were pretty sure DS would still be asleep in his room or we&#39;d &#39;nap&#39; for a few hours then use the middle of the night for intimacy then go back to sleep. We also not only keep in contact (notes, calls, emails) but little things like patting his butt as I walk past while we&#39;re getting supper onto the table or he&#39;ll come up behind me when I&#39;m reading and rub my neck and so on - just little &quot;in passing&quot; tidbits to remind the other person that yes, I do still find you sexy, attractive, and I want you as soon as we can find the space. The best options for that will vary depending on the individual though - some folks aren&#39;t so much into the touching but would love a wink, that &#39;certain&#39; look, or other signals that mean the same thing. Hubby and I even have little &#39;secret&#39; words or messages that we can use that no one else would catch that we can use even in social gatherings to say &quot;you look sexy, I want you&quot;. Oh, for the record, we&#39;ve been on this path since DS was born and yes, there have been ups and downs and bumps and twists along the way because nothing stays the same forever, especially where people are concerned (young or old). What we did when DS was 6 is not the same as now, when he&#39;s almost 15 and pretty much self-sufficient in many ways - when he was 6, I made sure there were easy to grab snacks for DS if he stayed up after my bedtime and I&#39;d check in to see if he needed me to prepare something that needed slicing or cooking before I went upstairs. Now, he can generally handle anything he might want which is good since he often stays up into the wee hours playing online with friends.<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":548186760,"authorName":"julie finnin day","from":"julie finnin day &lt;julipfin@...&gt;","profile":"julipfinn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: finding alone time with husband","postDate":"1362990048","msgId":49730,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBUEthVG50d3paN2JIOE1hcys3UmpOZnh6ci1hZXllS21DbUc1bnJCXzItdXNXSDZSQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDEzNjI5NjM4NjguOTUyMTIuWWFob29NYWlsTmVvQHdlYjE2NDAwMi5tYWlsLmdxMS55YWhvby5jb20+","referencesHeader":"PDEzNjI5MzcxMzYuNjkyNjguWWFob29NYWlsTmVvQHdlYjE2NDAwMi5tYWlsLmdxMS55YWhvby5jb20+CTxraGo0czMrdTU1cEBlR3JvdXBzLmNvbT4JPDEzNjI5NjM4NjguOTUyMTIuWWFob29NYWlsTmVvQHdlYjE2NDAwMi5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":49729,"nextInTopic":49731,"prevInTime":49729,"nextInTime":49731,"topicId":49724,"numMessagesInTopic":0,"msgSnippet":"Another thought -- with my kids going to bed at 1 or 2am, they sleep till noon. My hubby and I wake up hours earlier on weekends and have date mornings --","messageBody":"<div id=\"ygrps-yiv-1182770673\">Another thought -- with my kids going to bed at 1 or 2am, they sleep till<br/>\nnoon. My hubby and I wake up hours earlier on weekends and have &quot;date<br/>\nmornings&quot; -- lounge, watch favorite tv shows, spend our quality time. Its<br/>\nkind of nice because we have more energy at the beginning of the day than<br/>\nlate at night.<br/>\n<br/>\nJulie<br/>\n<blockquote><span title=\"qreply\"> On Mar 10, 2013 6:25 PM, &quot;Kari Barber&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:spiraldancer27@...\">spiraldancer27@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Dana does have a great list- somewhat limited by the small amount of time<br/>\n&gt; my hubby is home during the week, but yes, certainly implementable. It&#39;s<br/>\n&gt; easy to forget that it&#39;s not all about bedtime.  As for masturbation, sure,<br/>\n&gt; we are both great fans of it and definitely don&#39;t begrudge each other<br/>\n&gt; wanting to do it. Still not the same thing, though- sex isn&#39;t really about<br/>\n&gt; orgasm, often we are actually better at that on our own, right?- it&#39;s about<br/>\n&gt; creating a kind of magic shared experience. For me it&#39;s a kind of bonding<br/>\n&gt; that cannot be achieved through any other means. I think too often people<br/>\n&gt; (especially women) discount its massive importance in a marriage. I won&#39;t<br/>\n&gt; keep going on that, I just wanted to be clear because it seems like you<br/>\n&gt; keep suggesting that it must be something else I need.<br/>\n&gt;<br/>\n&gt; I really have wanted to bring this up for a long time, because I don&#39;t see<br/>\n&gt; it being really discussed anywhere, and I am glad to have people&#39;s thoughts<br/>\n&gt; and ideas.<br/>\n&gt; Thanks :)<br/>\n&gt; Kari<br/>\n&gt;<br/>\n&gt; ________________________________<br/>\n&gt; From: Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt;<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n&gt; Sent: Sunday, March 10, 2013 7:26 PM<br/>\n&gt; Subject: [unschoolingbasics] Re: finding alone time with husband<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Dana had a great list; get away from the idea that sex needs to happen at<br/>\n&gt; a certain time, place, or way. Don&#39;t confine yourself to an hour in the<br/>\n&gt; late evening, before falling asleep. This has the added benefit of making<br/>\n&gt; your sex life more fun, more of an adventure!<br/>\n&gt;<br/>\n&gt; It may also help to dig down into the assumption that what you need Has To<br/>\n&gt; come from your partner. This is something which is usually more of an issue<br/>\n&gt; for women than men - we&#39;re more likely to be uncomfortable masturbating and<br/>\n&gt; less likely to be good at it. And some people - men and women - get hung up<br/>\n&gt; on the idea that married people shouldn&#39;t need to masturbate, that it&#39;s a<br/>\n&gt; sign of failure in a relationship. It isn&#39;t.<br/>\n&gt; Looking for ways to get your own, physical needs met takes some of the<br/>\n&gt; urgency out of finding time alone with your sweetie. It can also be a way<br/>\n&gt; to increase communication in your relationship - even a way to add a little<br/>\n&gt; more spice to things.<br/>\n&gt;<br/>\n&gt; ---Meredith<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":132476879,"authorName":"Kari Barber","from":"Kari Barber &lt;spiraldancer27@...&gt;","profile":"spiraldancer27","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: finding alone time with husband","postDate":"1362963868","msgId":49729,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjI5NjM4NjguOTUyMTIuWWFob29NYWlsTmVvQHdlYjE2NDAwMi5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PGtoajRzMyt1NTVwQGVHcm91cHMuY29tPg==","referencesHeader":"PDEzNjI5MzcxMzYuNjkyNjguWWFob29NYWlsTmVvQHdlYjE2NDAwMi5tYWlsLmdxMS55YWhvby5jb20+IDxraGo0czMrdTU1cEBlR3JvdXBzLmNvbT4="},"prevInTopic":49728,"nextInTopic":49730,"prevInTime":49728,"nextInTime":49730,"topicId":49724,"numMessagesInTopic":0,"msgSnippet":"Dana does have a great list- somewhat limited by the small amount of time my hubby is home during the week, but yes, certainly implementable. It s easy to","messageBody":"<div id=\"ygrps-yiv-1810657060\">Dana does have a great list- somewhat limited by the small amount of time my hubby is home during the week, but yes, certainly implementable. It&#39;s easy to forget that it&#39;s not all about bedtime.  As for masturbation, sure, we are both great fans of it and definitely don&#39;t begrudge each other wanting to do it. Still not the same thing, though- sex isn&#39;t really about orgasm, often we are actually better at that on our own, right?- it&#39;s about creating a kind of magic shared experience. For me it&#39;s a kind of bonding that cannot be achieved through any other means. I think too often people (especially women) discount its massive importance in a marriage. I won&#39;t keep going on that, I just wanted to be clear because it seems like you keep suggesting that it must be something else I need. <br/>\n<br/>\nI really have wanted to bring this up for a long time, because I don&#39;t see it being really discussed anywhere, and I am glad to have people&#39;s thoughts and ideas. <br/>\nThanks :)<br/>\nKari<br/>\n<br/>\n<br/>\n________________________________<br/>\n From: Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSent: Sunday, March 10, 2013 7:26 PM<br/>\nSubject: [unschoolingbasics] Re: finding alone time with husband<br/>\n <br/>\n<br/>\n  <br/>\nDana had a great list; get away from the idea that sex needs to happen at a certain time, place, or way. Don&#39;t confine yourself to an hour in the late evening, before falling asleep. This has the added benefit of making your sex life more fun, more of an adventure! <br/>\n<br/>\nIt may also help to dig down into the assumption that what you need Has To come from your partner. This is something which is usually more of an issue for women than men - we&#39;re more likely to be uncomfortable masturbating and less likely to be good at it. And some people - men and women - get hung up on the idea that married people shouldn&#39;t need to masturbate, that it&#39;s a sign of failure in a relationship. It isn&#39;t. <br/>\nLooking for ways to get your own, physical needs met takes some of the urgency out of finding time alone with your sweetie. It can also be a way to increase communication in your relationship - even a way to add a little more spice to things.<br/>\n<br/>\n---Meredith<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: finding alone time with husband","postDate":"1362958019","msgId":49728,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtoajRzMyt1NTVwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNjI5MzcxMzYuNjkyNjguWWFob29NYWlsTmVvQHdlYjE2NDAwMi5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":49727,"nextInTopic":49729,"prevInTime":49727,"nextInTime":49729,"topicId":49724,"numMessagesInTopic":0,"msgSnippet":"Dana had a great list; get away from the idea that sex needs to happen at a certain time, place, or way. Don t confine yourself to an hour in the late evening,","messageBody":"<div id=\"ygrps-yiv-1813848934\">Dana had a great list; get away from the idea that sex needs to happen at a certain time, place, or way. Don&#39;t confine yourself to an hour in the late evening, before falling asleep. This has the added benefit of making your sex life more fun, more of an adventure! <br/>\n<br/>\nIt may also help to dig down into the assumption that what you need Has To come from your partner. This is something which is usually more of an issue for women than men - we&#39;re more likely to be uncomfortable masturbating and less likely to be good at it. And some people - men and women - get hung up on the idea that married people shouldn&#39;t need to masturbate, that it&#39;s a sign of failure in a relationship. It isn&#39;t. <br/>\nLooking for ways to get your own, physical needs met takes some of the urgency out of finding time alone with your sweetie. It can also be a way to increase communication in your relationship - even a way to add a little more spice to things.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":9543528,"authorName":"Dana Hoffman Ellis","from":"Dana Hoffman Ellis &lt;hoffmanwilson@...&gt;","profile":"hoffmanwilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: finding alone time with husband","postDate":"1362942532","msgId":49727,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2OTQ3OUUyLTUxOEYtNEVFQS04MzJELTY4MTYzODA3RDJCQ0B5YWhvby5jb20+","inReplyToHeader":"PDEzNjI5MzcxMzYuNjkyNjguWWFob29NYWlsTmVvQHdlYjE2NDAwMi5tYWlsLmdxMS55YWhvby5jb20+","referencesHeader":"PDEzNjI4NDc4MDEuNDYzMDQuWWFob29NYWlsTmVvQHdlYjEyNjEwMi5tYWlsLm5lMS55YWhvby5jb20+IDxraGdsbTMraDZqdkBlR3JvdXBzLmNvbT4gPDEzNjI5MzcxMzYuNjkyNjguWWFob29NYWlsTmVvQHdlYjE2NDAwMi5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":49726,"nextInTopic":49728,"prevInTime":49726,"nextInTime":49728,"topicId":49724,"numMessagesInTopic":0,"msgSnippet":"... Times to have sex: Set the alarm an hour early Wake up in the middle of the night Start a show for the kids and take a long shower together Nap time, if","messageBody":"<div id=\"ygrps-yiv-614343336\"><blockquote><span title=\"ireply\">&gt; What I&#39;d like, if folks are willing, is a discussion on how all of you deal with meeting this particular need- which is real and cannot be subverted into other things all the time. Have you figured out what to do about it or are you frustrated? What works?<br/>\n<br/>\n </span></blockquote>Times to have sex:<br/>\nSet the alarm an hour early<br/>\nWake up in the middle of the night<br/>\nStart a show for the kids and take a long &quot;shower&quot; together<br/>\nNap time, if your little ones nap<br/>\nWhen they&#39;re playing with the neighbor kids<br/>\nWeekly &quot;date night&quot; when they&#39;re with grandma or a babysitter<br/>\nTell the kids *you* need a nap<br/>\n  <br/>\nJust a few examples.<br/>\n<br/>\nDana<br/>\n<br/>\nSent from my iPad<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":132476879,"authorName":"Kari Barber","from":"Kari Barber &lt;spiraldancer27@...&gt;","profile":"spiraldancer27","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: finding alone time with husband","postDate":"1362937136","msgId":49726,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjI5MzcxMzYuNjkyNjguWWFob29NYWlsTmVvQHdlYjE2NDAwMi5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PGtoZ2xtMytoNmp2QGVHcm91cHMuY29tPg==","referencesHeader":"PDEzNjI4NDc4MDEuNDYzMDQuWWFob29NYWlsTmVvQHdlYjEyNjEwMi5tYWlsLm5lMS55YWhvby5jb20+IDxraGdsbTMraDZqdkBlR3JvdXBzLmNvbT4="},"prevInTopic":49725,"nextInTopic":49727,"prevInTime":49725,"nextInTime":49727,"topicId":49724,"numMessagesInTopic":0,"msgSnippet":"I tend to merely lurk here, but I felt like I needed to say this for the others who might not pipe up. Sex for many of us is a basic need in a marriage that","messageBody":"<div id=\"ygrps-yiv-1695853797\">I tend to merely lurk here, but I felt like I needed to say this for the others who might not pipe up. Sex for many of us is a basic need in a marriage that really can&#39;t be met by anything other than, well, sex. Let&#39;s not pretend that the need for sexual intimacy is just a mask for something else and can always be met in other ways.  My husband and I are very cuddly and communicative- no trouble getting our other emotional needs met in the presence of, and including, our children. But this one is obviously different.<br/>\nI have been wanting to ask this question for a long time here but have been afraid to bring it up (in fact, I&#39;m ducking now), because I can get behind everything else about unschooling- we&#39;ve only been doing this a year  (homeschooling a year before that) and of course we try things out and make mistakes. We are working toward it consistently, but this lack of time for intimacy has been our biggest roadblock to getting rid of bedtimes. We have a 3 and a 7 year old, so they can&#39;t just stay up alone while we go to bed.  We&#39;ve been relaxing bedtimes many nights, but some nights we want to ourselves. <br/>\nWhat I&#39;d like, if folks are willing, is a discussion on how all of you deal with meeting this particular need- which is real and cannot be subverted into other things all the time. Have you figured out what to do about it or are you frustrated? What works?<br/>\n<br/>\nThanks,<br/>\nKari<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n From: Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSent: Saturday, March 9, 2013 7:55 PM<br/>\nSubject: [unschoolingbasics] Re: finding alone time with husband<br/>\n <br/>\n<br/>\n  <br/>\nIt helps a lot to separate &quot;alone time with spouse&quot; out into smaller components so you&#39;re not stuck trying to meet a dozen needs at once. With little kids, you&#39;re not going to Get big chunks of time when they&#39;re awake. Breaking things down into bite sized chunks sets you up to meet your various needs in windows of opportunity. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;go to our bedroom around 10 pm to watch a movie<br/>\n<br/>\n </span></blockquote>Don&#39;t expect to get a whole hour of privacy at home with your kids. If it&#39;s not a movie you&#39;re comfortable watching with the kids, put it aside for now - or if you have a childcare option, you could look into having a regular &quot;date night&quot; to do things like watch movies. But movies will be around. What does that movie represent to you? Break that down into bite-sized parts. <br/>\n<br/>\nQuiet resting time? That doesn&#39;t need to be done together - for that matter, neither does watching a movie, you could do it separately while the other parent hangs out with the kids. Adult conversation? That doesn&#39;t need to happen away from kids - learn to multi-task! It takes some practice at first, but you can have conversations in the midst of doing other things. Heck, put in a Kids movie, snuggle down with the whole crew and have a very quiet adult conversation then. <br/>\n<br/>\nGeneral connection? Can you text or email each other during the day? A quick phone call at lunch? Or think about the sorts of things moms do for school kids - a note tucked in a pocket your sweetie will discover later, something special to brighten up the day and say &quot;I&#39;m thinking of you.&quot;<br/>\n<br/>\nWhat else? Sex? That&#39;s something which also tends to be used to meet multiple needs - you can dig down into those needs and look for other ways to meet them, too. If your husband looks to sex to feel valued and cared for, be sure you&#39;re letting him know in other ways, outside the bedroom, how important he is in your life, how much you value what he gives you by working to support the family. If you&#39;re using sex to meet some of your own emotional needs, consider other ways your husband can support you, too. It might help to read something the &quot;The Five Love Languages&quot; for ideas. <br/>\n<br/>\n---Meredith<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: finding alone time with husband","postDate":"1362876931","msgId":49725,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtoZ2xtMytoNmp2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNjI4NDc4MDEuNDYzMDQuWWFob29NYWlsTmVvQHdlYjEyNjEwMi5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":49724,"nextInTopic":49726,"prevInTime":49724,"nextInTime":49726,"topicId":49724,"numMessagesInTopic":0,"msgSnippet":"It helps a lot to separate alone time with spouse out into smaller components so you re not stuck trying to meet a dozen needs at once. With little kids,","messageBody":"<div id=\"ygrps-yiv-2095278931\">It helps a lot to separate &quot;alone time with spouse&quot; out into smaller components so you&#39;re not stuck trying to meet a dozen needs at once. With little kids, you&#39;re not going to Get big chunks of time when they&#39;re awake. Breaking things down into bite sized chunks sets you up to meet your various needs in windows of opportunity. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;go to our bedroom around 10 pm to watch a movie<br/>\n<br/>\n </span></blockquote>Don&#39;t expect to get a whole hour of privacy at home with your kids. If it&#39;s not a movie you&#39;re comfortable watching with the kids, put it aside for now - or if you have a childcare option, you could look into having a regular &quot;date night&quot; to do things like watch movies. But movies will be around. What does that movie represent to you? Break that down into bite-sized parts. <br/>\n<br/>\nQuiet resting time? That doesn&#39;t need to be done together - for that matter, neither does watching a movie, you could do it separately while the other parent hangs out with the kids. Adult conversation? That doesn&#39;t need to happen away from kids - learn to multi-task! It takes some practice at first, but you can have conversations in the midst of doing other things. Heck, put in a Kids movie, snuggle down with the whole crew and have a very quiet adult conversation then. <br/>\n<br/>\nGeneral connection? Can you text or email each other during the day? A quick phone call at lunch? Or think about the sorts of things moms do for school kids - a note tucked in a pocket your sweetie will discover later, something special to brighten up the day and say &quot;I&#39;m thinking of you.&quot;<br/>\n<br/>\nWhat else? Sex? That&#39;s something which also tends to be used to meet multiple needs - you can dig down into those needs and look for other ways to meet them, too. If your husband looks to sex to feel valued and cared for, be sure you&#39;re letting him know in other ways, outside the bedroom, how important he is in your life, how much you value what he gives you by working to support the family. If you&#39;re using sex to meet some of your own emotional needs, consider other ways your husband can support you, too. It might help to read something the &quot;The Five Love Languages&quot; for ideas. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":506344661,"authorName":"fundayeveryday","from":"fundayeveryday &lt;kristenssrr@...&gt;","profile":"kristenssrr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"finding alone time with husband","postDate":"1362847801","msgId":49724,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjI4NDc4MDEuNDYzMDQuWWFob29NYWlsTmVvQHdlYjEyNjEwMi5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":49725,"prevInTime":49723,"nextInTime":49725,"topicId":49724,"numMessagesInTopic":0,"msgSnippet":"Being more present with my four children has been so awesome. Lately I m finding that I m not as present with my husband! My children and I are together from","messageBody":"<div id=\"ygrps-yiv-1290712747\">Being more present with my four children has been so awesome. Lately I&#39;m finding that I&#39;m not as present with my husband! My children and I are together from when they wake up (husband is not home from work yet) to about 1030 at night.They are with both of us from 4-10pm on most days.  When my husband and I go to our bedroom around 10 pm to watch a movie, someone comes in and wants to show us a picture they drew, so we look at it and tell them how nice it is.  Then someone else comes in to ask what we will be doing tomorrow,etc.! We listen and answer and are glad to be with them. When I ask them if we can have time alone for a little bit, they say that as long as we (parents) are awake, they want to be with us=) My husband does express frustration and I don&#39;t blame him. any suggestions?<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":49736,"nextTopicId":49682}}