{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":186674637,"authorName":"Katie","from":"&quot;Katie&quot; &lt;kattilily@...&gt;","profile":"mammicherie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Intro/Manners","postDate":"1093462433","msgId":2968,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNnaXBqMStuZGJoQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":2967,"nextInTime":2969,"topicId":2968,"numMessagesInTopic":0,"msgSnippet":"Hello All, I want to thank you all so very much for your wonderful responses to my post.  All your experiences and resources are so helpful to me. I feel like","messageBody":"<div id=\"ygrps-yiv-1968632298\">Hello All,<br/>\n<br/>\nI want to thank you all so very much for your wonderful responses to <br/>\nmy post.  All your experiences and resources are so helpful to me.  <br/>\nI feel like I have so much emotional work to do to be the parent I <br/>\nwish to be.  I haven&#39;t yet made it through all of them but I wanted <br/>\nto reply to Tracy&#39;s really quickly.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Did you?  How would you have known any different?  It&#39;s kind of <br/>\n&gt;&gt;easy to <br/>\n&gt;&gt;just assume that you must have &quot;needed&quot; something because that&#39;s <br/>\n&gt;&gt;the <br/>\n&gt;&gt;way you were raised, but if we really look hard and break things <br/>\n&gt;&gt;down <br/>\n&gt;&gt;sometimes things aren&#39;t what they seem.<br/>\n<br/>\n </span></blockquote>The thing is that I have actually experienced opposite ends of the <br/>\nspectrum in parenting.  I grew up for the first 5 years with married <br/>\nparents, my mom very liberal and totally into letting me be <br/>\nindependant and figure things out on my own.  I did have a reward <br/>\nsystem~ a star chart in which I recieved a star sticker for certain <br/>\ntasks.  I was allowed to run out of the house as I pleased, hair a <br/>\nmess, clothes I wished for, blanky in hand.  My dad was more <br/>\nconservative type, and he provided me some neutral structure.  He <br/>\nhad the philosophy that kids will be kids, but he also was stern <br/>\nwhen I did things wrong.  He didn&#39;t get mad often, but when he did <br/>\nhe was very mad or worse very disappointed in me.  My dad did choose <br/>\nsome punitive punishments on rare occasions.  I find most of them to <br/>\nbe pointless because all they did was make me hurt by him, not by <br/>\nwhat I did.  For the next years of my life, till 12, I was raised in <br/>\nan extreme manner.  My dad remaried a woman who suffered miserably <br/>\nin her own head and therefore made everyone around her suffer as <br/>\nwell.  She was extremely controlling, parenting through fear and <br/>\nmanipulation.  This has caused me such emotional trama.  When I <br/>\nmoved back in with my mom I had the complete other end of the <br/>\nspectrum.  My mom had no control over me and let me do whatever I <br/>\nwanted.  I guess this is my fear.  I don&#39;t want my daughter to be <br/>\nwithout guidance because I see the irreversable dicisions I made <br/>\nunder this type of parenting.  Ofcourse I would never in my life <br/>\ndream to parent the way my dad&#39;s wife did.  I have always thought <br/>\nthere should be a middle ground between the two.  Maybe my mom had <br/>\nthe right idea but she lacked in herself the example.  She is to <br/>\nthis day an emotional wreck for so many reasons, and doesn&#39;t have <br/>\nboundaries so therefore doesn&#39;t respect mine.  I could go on, but <br/>\nnot really the point.  Anyway.  All my questions about unschooling <br/>\nare coming from these experiences.  I know I really absolutely <br/>\nneeded someone to sit me down and say NO!  I needed someone to tell <br/>\nme to respect myself, to take care of me, to give me guidance, and <br/>\nto protect me from myself.  Granted I would never have listened if <br/>\nit was in a punitive coercive manner.  So I&#39;m wondering where the <br/>\nmiddle ground is.  Maybe after reading all the links recommended and <br/>\npicking up an unschooling book I&#39;ll understand.  I hope I haven&#39;t <br/>\nrambled.  Thanks for listening.<br/>\n<br/>\nWarmly,<br/>\nKatie</div>","specialLinks":[]}],"prevTopicId":2960,"nextTopicId":2914}}