{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":23,"messages":[{"userId":80776775,"authorName":"Kelly Nishan","from":"&quot;Kelly Nishan&quot; &lt;kel9769@...&gt;","profile":"kel9769","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Cutting- Please help!","postDate":"1224079106","msgId":36617,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdkNHN1MitoNzQ3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDkxODYzLjg1OTYzLnFtQHdlYjg2MjA5Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":36614,"nextInTopic":0,"prevInTime":36616,"nextInTime":36618,"topicId":36439,"numMessagesInTopic":0,"msgSnippet":"... that is good and wonderful that she is somehow taking that away from you by self-harming? It s a hard thing when you feel like you ve done so much to make","messageBody":"<div id=\"ygrps-yiv-1841322015\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Schuyler &lt;s.waynforth@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Why does it piss you off? Do you feel like you&#39;ve done so much <br/>\n </span></blockquote>that is good and wonderful that she is somehow taking that away from <br/>\nyou by self-harming? It&#39;s a hard thing when you feel like you&#39;ve <br/>\ndone so much to make someone else&#39;s life better and it still isn&#39;t <br/>\ngood enough. Unfortunately it&#39;s worse than useless to get angry at <br/>\nsomeone not appreciating what you&#39;ve done.  When your daughter is <br/>\nfeeling bad enough to cut herself it isn&#39;t<br/>\n<blockquote><span title=\"ireply\"> &gt; because you have done good things and she isn&#39;t grateful, it&#39;s <br/>\n </span></blockquote>because<br/>\n<blockquote><span title=\"ireply\"> &gt; she feels bad. <br/>\n<br/>\n </span></blockquote>Oh yeah my initial feeling was that it was all about me and I was <br/>\nmad.  I got over it pretty quick but still it&#39;s how I felt.  I don&#39;t <br/>\nbeat myself up that I felt that way but I do wish I hadn&#39;t talked to <br/>\nher when I felt that way.  It didn&#39;t accomplish anything and it made <br/>\nus both feel bad.  I apologized and I will do better next time.  <br/>\n<br/>\nEven in the heat of the moment we were both clear on the fact that <br/>\nhow I was reacting was my problem that I needed to work out for <br/>\nmyself.  I can be a support to her if she wants me to in dealing <br/>\nwith her feelings but she can&#39;t support me in dealing with mine and <br/>\nI don&#39;t expect her to.  The only thing I can do is be as trustworthy <br/>\nand loving as I can be so she will feel safe to come to me.  I don&#39;t <br/>\neven really care if she doesn&#39;t come to me as long as she feels she <br/>\nhas somebody.  She and my sister are very close so maybe she&#39;ll talk <br/>\nto her.  <br/>\nKelly</div>","specialLinks":[]},{"userId":239110911,"authorName":"Christine","from":"&quot;Christine&quot; &lt;homeschoolmom@...&gt;","profile":"greeneyedtexasgal2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Cutting- Please help!","postDate":"1224050155","msgId":36614,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdkNDBsYit0YmFrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdjajNvYStyZHJrQGVHcm91cHMuY29tPg=="},"prevInTopic":36609,"nextInTopic":36617,"prevInTime":36613,"nextInTime":36615,"topicId":36439,"numMessagesInTopic":0,"msgSnippet":"I know I am totally new here and therefore I hope you will afford me a little patience in jumping into this topic. When I was about 13, I started cutting. I","messageBody":"<div id=\"ygrps-yiv-170877149\">I know I am totally new here and therefore I hope you will afford me a<br/>\nlittle patience in jumping into this topic. <br/>\n<br/>\nWhen I was about 13, I started cutting. I came from a background that<br/>\nI am sure is absolutely alien to you, but I want to give it to you in<br/>\nhopes that it may give you some insight to exactly what is the root<br/>\ncause of your daughter&#39;s desire to hurt herself. <br/>\n<br/>\nMy mother was a drug addict and I had been abused by my mother&#39;s drug<br/>\nfriends for an extended period of time. I was afraid to seek help, as<br/>\nit had gone on so long, we (meaning people in general) tend to suffer<br/>\nin silence on those things we have become accustomed to for fear that<br/>\nthe unknown will often be worse and uncontrollable. Over a period of<br/>\ntime, suppressing emotions and feelings to hide the turmoil took it&#39;s<br/>\ntoll. I started to feel numb inside, trapped in a void of non-emotion<br/>\nand mentally I began to break down. I started cutting myself just<br/>\nbecause I needed to see the blood to root myself, to feel as though I<br/>\nwas still alive. The pain made me feel human...if that makes sense at all.<br/>\n<br/>\nCutters, in my personal experience and by association, are those who<br/>\nhave an enormous build up of emotion that they&#39;ve separated themselves<br/>\nwith for one reason or another that is about to come uncorked...often<br/>\nviolently. They use this method to try to ground themselves, to<br/>\nre-bury what is bothering them so deeply. I quit cutting when I<br/>\ndetermined that people were onto me. I was fearful of what it would<br/>\nmean if I had to explain myself and moved on to further destructive<br/>\nmethods instead. <br/>\n<br/>\nI know your first thought is to be angry at your daughter for not<br/>\nsharing her deeper emotions with you...and it&#39;s natural that you<br/>\nwould! Your teen daughter is dealing with something really deep to her<br/>\nas well as a strong desire to be independent from mom while still<br/>\nneeding her desperately...that&#39;s very conflicting and confusing to<br/>\nher. Finding a way to bring balance to that and encourage her to let<br/>\nyou in is your biggest challenge now but will reap the max in<br/>\nbenefits. Either you or a trusted friend will need to really let the<br/>\nmomma barrier down and get her to open up to you...not as<br/>\nmother/daughter but as trusted and loved friend. If you can do<br/>\nthat...then you&#39;ll reach the true root of what&#39;s causing her to act<br/>\nout this way. <br/>\n<br/>\nI hope what I wrote makes sense and is received in love as I only<br/>\nintended it to be written that way. <br/>\n<br/>\nBest wishes to you and to your daughter. <br/>\n<br/>\nChristine</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Cutting- Please help!","postDate":"1224024364","msgId":36609,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgxMDE0MTU0NnM3ZmNhNDI1ZXEyMTgxZjI1Mzk3NGZkYmY4QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDkxODYzLjg1OTYzLnFtQHdlYjg2MjA5Lm1haWwuaXJkLnlhaG9vLmNvbT4=","referencesHeader":"PDkxODYzLjg1OTYzLnFtQHdlYjg2MjA5Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":36606,"nextInTopic":36614,"prevInTime":36608,"nextInTime":36610,"topicId":36439,"numMessagesInTopic":0,"msgSnippet":"I agree that it s a mistake to think of boredom as ingratitude.  One might be having so much fun and just wants to continue ... but being no longer a little","messageBody":"<div id=\"ygrps-yiv-337174861\">I agree that it&#39;s a mistake to think of boredom as ingratitude.  One might<br/>\nbe having so much fun and just wants to continue ... but being no longer a<br/>\nlittle kid and feeling one &quot;has to&quot; be mature and leave when others are<br/>\nready to move on.  So.  It isn&#39;t *at all* that a child is bored because<br/>\nsomething wasn&#39;t good enough.  The ordinary or mundane looks unappealing by<br/>\ncomparison not comfortable.  I remember that a lot more when I was younger.<br/>\nI feel it sometimes as an adult but not near as much as I did when I was a<br/>\nkid.  I&#39;m more settled in my life now than I was as a teen when I had no<br/>\nidea what I should be doing next.  The pressure to succeed somehow in adult<br/>\nlife or to identify with adulthood sooner than one is ready is a thought<br/>\nthat&#39;s embedded early in school and that thought only gets more worrisome as<br/>\ntime goes on.  It&#39;s only after a few milestones one feels adds up to adult<br/>\nstatus have been passed that things might begin to feel more comfortable.<br/>\n<br/>\nAbout cutting.  A lot of kids feel so much disconnection that it&#39;s hard to<br/>\nfind a way to heal it.  And attributing the problem to a lack of gratitude<br/>\nunderestimates the level of difficulty.  Some adults may think that a kid&#39;s<br/>\nlife must be so much easier than adult life.  I think now that the kid is<br/>\nolder it makes a lot more sense to shift into friendship and do things to<br/>\nshow openness and sensitivity that stretch the parent in new ways and allow<br/>\nthe relationship to mature.  Of course, that&#39;s much easier said than done<br/>\nfor most people.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 10/14/08, Schuyler &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt; wrote:<br/>\n<br/>\n&gt; ------------snip-------------<br/>\n&gt;  When<br/>\n&gt;  she left school in 8th grade I was very afraid of her cutting.<br/>\n&gt;  Turns out she did it anyway and started after she left school.  That<br/>\n&gt;  kind of pisses me off.<br/>\n&gt;  ------------snip-------------<br/>\n&gt;<br/>\n&gt;  Why does it piss you off? Do you feel like you&#39;ve done so much that is<br/>\ngood and wonderful that she is somehow taking that away from you by<br/>\nself-harming? It&#39;s a hard thing when you feel like you&#39;ve done so much to<br/>\nmake someone else&#39;s life better and it still isn&#39;t good enough.<br/>\nUnfortunately it&#39;s worse than useless to get angry at someone not<br/>\nappreciating what you&#39;ve done.  When your daughter is feeling bad enough to<br/>\ncut herself it isn&#39;t<br/>\n&gt;  because you have done good things and she isn&#39;t grateful, it&#39;s because<br/>\n&gt;  she feels bad. Making her accountable for all the good things that<br/>\n&gt;  you&#39;ve done aren&#39;t going to help her feel better. In fact it will just<br/>\n&gt;  add to her burden. Much better if you can see how much better your life<br/>\nis for what you&#39;ve done, how much more you enjoy being with your daughter<br/>\nand having favorite sci-fi shows to reference. Think about it as a gift, not<br/>\none that you get to hold  her accountable to, just a gift.<br/>\n&gt;<br/>\n&gt;  Yesterday we were in town walking from the library to a toy store and<br/>\nLinnaea said she was bored and I wish instead of saying &quot;How could you be<br/>\nbored, we are just walking through town?&quot; judging her expectation of<br/>\nentertainment as too high, I&#39;d said &quot;let&#39;s race&quot; or invited her to bunny hop<br/>\nwith me or something. We did shoot people with imaginary laser guns, though.<br/>\nHer boredom wasn&#39;t mine to judge. She expressed a need and I could have<br/>\nhelped to fulfill it. I felt hurt that she was bored. We had gone to town<br/>\nand were looking for games that she and Simon wanted and we&#39;d just played a<br/>\nfantastic game of laser tag. It felt like she was dissing all of that for<br/>\nher boredom. But that was all me. I was feeling like I should be praised for<br/>\nall that I did or made possible or whatever. She had a good time doing those<br/>\nthings but, in those 10 minutes of walking across the centre of town, she<br/>\nwanted something engaging then. I regret that I didn&#39;t play right away. It<br/>\n&gt;   won&#39;t happen next time.<br/>\n&gt;<br/>\n&gt;  Schuyler<br/>\n&gt;  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.waynforth.blogspot.com\">http://www.waynforth.blogspot.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Cutting- Please help!","postDate":"1224013938","msgId":36606,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkxODYzLjg1OTYzLnFtQHdlYjg2MjA5Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":36605,"nextInTopic":36609,"prevInTime":36605,"nextInTime":36607,"topicId":36439,"numMessagesInTopic":0,"msgSnippet":"... When she left school in 8th grade I was very afraid of her cutting. Turns out she did it anyway and started after she left school.  That kind of pisses me","messageBody":"<div id=\"ygrps-yiv-1224655676\">------------snip-------------<br/>\nWhen <br/>\nshe left school in 8th grade I was very afraid of her cutting. <br/>\nTurns out she did it anyway and started after she left school.  That <br/>\nkind of pisses me off.<br/>\n------------snip-------------<br/>\n<br/>\nWhy does it piss you off? Do you feel like you&#39;ve done so much that is good and wonderful that she is somehow taking that away from you by self-harming? It&#39;s a hard thing when you feel like you&#39;ve done so much to make someone else&#39;s life better and it still isn&#39;t good enough. Unfortunately it&#39;s worse than useless to get angry at someone not appreciating what you&#39;ve done.  When your daughter is feeling bad enough to cut herself it isn&#39;t<br/>\nbecause you have done good things and she isn&#39;t grateful, it&#39;s because<br/>\nshe feels bad. Making her accountable for all the good things that<br/>\nyou&#39;ve done aren&#39;t going to help her feel better. In fact it will just<br/>\nadd to her burden. Much better if you can see how much better your life is for what you&#39;ve done, how much more you enjoy being with your daughter and having favorite sci-fi shows to reference. Think about it as a gift, not one that you get to hold  her accountable to, just a gift.<br/>\n<br/>\nYesterday we were in town walking from the library to a toy store and Linnaea said she was bored and I wish instead of saying &quot;How could you be bored, we are just walking through town?&quot; judging her expectation of entertainment as too high, I&#39;d said &quot;let&#39;s race&quot; or invited her to bunny hop with me or something. We did shoot people with imaginary laser guns, though. Her boredom wasn&#39;t mine to judge. She expressed a need and I could have helped to fulfill it. I felt hurt that she was bored. We had gone to town and were looking for games that she and Simon wanted and we&#39;d just played a fantastic game of laser tag. It felt like she was dissing all of that for her boredom. But that was all me. I was feeling like I should be praised for all that I did or made possible or whatever. She had a good time doing those things but, in those 10 minutes of walking across the centre of town, she wanted something engaging then. I regret that I didn&#39;t play right away. It<br/>\n won&#39;t happen next time. <br/>\n<br/>\nSchuyler<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.waynforth.blogspot.com\">http://www.waynforth.blogspot.com</a><br/>\n <br/>\n<br/>\n    <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":80776775,"authorName":"Kelly Nishan","from":"&quot;Kelly Nishan&quot; &lt;kel9769@...&gt;","profile":"kel9769","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Cutting- Please help!","postDate":"1224012772","msgId":36605,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdkMnM1NCt2ZDJ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwNDM0OS45NTM1Ni5xbUB3ZWI1NDEwNy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":36604,"nextInTopic":36606,"prevInTime":36604,"nextInTime":36606,"topicId":36439,"numMessagesInTopic":0,"msgSnippet":"it doesn t really matter how *we* see our kids experience, it matters how *they* see it and feel about it(totally paraphrased).  It s great when","messageBody":"<div id=\"ygrps-yiv-1222948591\">it doesn&#39;t really matter how *we* see our kids&#39; experience, it <br/>\nmatters how *they* see it and feel about it(totally <br/>\nparaphrased).  It&#39;s great when *we* think we help our kids get what <br/>\nthey want, but what really matters is if *they* feel we are really <br/>\nhelping them get what they want, that we&#39;re in their corner, have <br/>\ntheir back.  &gt; Jodi <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n </span></blockquote>I do think about that a lot and recognize that how she is <br/>\nexperiencing things is what matters.  Sometimes it&#39;s just so <br/>\nfrustrating that I try so hard and she is never content.  It breaks <br/>\nmy heart sometimes that I am never enough for her.  I used to get so <br/>\ndefeated by it that I would hold myself back from her as a way to <br/>\npunish her.  My affection and attention.  I try really really hard <br/>\nnot to do that anymore.  Part of her age is also wanting to <br/>\nexperience new things and feeling frustrated when I can&#39;t give her <br/>\neverything.  There are some things that she has to be able to be <br/>\nself motivated.  Plus because it&#39;s always been just the 2 of us I <br/>\nget all the blame for everything.   We both procrastinate and lack <br/>\nmotivation sometimes but in the end it&#39;s always my fault.  I know <br/>\nthis and accept it but sometimes I do feel defeated by it.  That <br/>\nfeeling is only temporary though.   I&#39;m mostly able to shake it off <br/>\nand keep doing my best for today.  Maybe tomorrow&#39;s best will be a <br/>\nlittle bit better.<br/>\nKelly</div>","specialLinks":[]},{"userId":80776775,"authorName":"Kelly Nishan","from":"&quot;Kelly Nishan&quot; &lt;kel9769@...&gt;","profile":"kel9769","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Cutting- Please help!","postDate":"1224011748","msgId":36604,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdkMnI1NCs2OGhwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEM1MUEzMjZBLjExMjJCJXpvYWNvbm5lckBjb21jYXN0Lm5ldD4="},"prevInTopic":36603,"nextInTopic":36605,"prevInTime":36603,"nextInTime":36605,"topicId":36439,"numMessagesInTopic":0,"msgSnippet":"... maybe it ... books.  ... Thanks for the recommendation Zoa.  I will definitely look for them. Kelly","messageBody":"<div id=\"ygrps-yiv-211349269\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; Since your daughter is having a hard time seeing your love for her, <br/>\n </span></blockquote>maybe it<br/>\n<blockquote><span title=\"ireply\"> &gt; would help you two to check out the Five Love Languages series of <br/>\n </span></blockquote>books. &gt; <br/>\n<blockquote><span title=\"ireply\"> &gt; Zoa<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Thanks for the recommendation Zoa.  I will definitely look for them.<br/>\nKelly</div>","specialLinks":[]},{"userId":80776775,"authorName":"Kelly Nishan","from":"&quot;Kelly Nishan&quot; &lt;kel9769@...&gt;","profile":"kel9769","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Cutting- Please help!","postDate":"1224011653","msgId":36603,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdkMnIyNStnZ3JqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ0REE0NzdGLURCNUYtNDdBNy1BRjBGLUE0NzEwNEJDNTQwM0BtYWMuY29tPg=="},"prevInTopic":36602,"nextInTopic":36604,"prevInTime":36602,"nextInTime":36604,"topicId":36439,"numMessagesInTopic":0,"msgSnippet":"... information. ... why ... and ... Our local community college does have a good program with an internal day care.  She is interested in a different college","messageBody":"<div id=\"ygrps-yiv-548674492\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; Can she go to a career counselor/college counselor to get <br/>\n </span></blockquote>information.  <br/>\n<blockquote><span title=\"ireply\"> &gt; ECE is a field in which community colleges excel, so I&#39;m wondering <br/>\n </span></blockquote>why  <br/>\n<blockquote><span title=\"ireply\"> &gt; she wouldn&#39;t want to start with that? Maybe if the information <br/>\n </span></blockquote>and  <br/>\n<blockquote><span title=\"ireply\"> &gt; advice came from someone else, she&#39;d be more open to it?<br/>\n&gt; <br/>\n&gt; -pam<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Our local community college does have a good program with an <br/>\ninternal day care.  She is interested in a different college because <br/>\nshe visited there for Take your Daughter to Work Day a few years <br/>\nago.  She got matched with the director of the program and got to <br/>\nvisit the day care as well as sit in on a couple of classes.  She <br/>\nalso knows some kids who go to the community college because they <br/>\ndropped out so she has a negative idea like it&#39;s not as good.  Maybe <br/>\nif she visited specifically to check out the early childhood program <br/>\nshe would see it&#39;s a good place to start out.  Thanks for the idea.<br/>\nKelly</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Cutting- Please help!","postDate":"1224007927","msgId":36602,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0REE0NzdGLURCNUYtNDdBNy1BRjBGLUE0NzEwNEJDNTQwM0BtYWMuY29tPg==","inReplyToHeader":"PGdkMjlrcythY291QGVHcm91cHMuY29tPg==","referencesHeader":"PGdkMjlrcythY291QGVHcm91cHMuY29tPg=="},"prevInTopic":36601,"nextInTopic":36603,"prevInTime":36601,"nextInTime":36603,"topicId":36439,"numMessagesInTopic":0,"msgSnippet":"... Can she go to a career counselor/college counselor to get information. ECE is a field in which community colleges excel, so I m wondering why she wouldn t","messageBody":"<div id=\"ygrps-yiv-1127305073\">On Oct 14, 2008, at 7:17 AM, Kelly Nishan wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The thing she want most is to<br/>\n&gt; start a full time ealy education program at a nearby college.  She<br/>\n&gt; does not want to get her GED or take community college classes.  I<br/>\n&gt; looked up the admission requirements and wrote them all down for her<br/>\n&gt; and I looked into how to register for the SAT.  The thing she needs<br/>\n&gt; to get done is a portfolio and I think it&#39;s freaking her out a<br/>\n&gt; little.  We talked about some ways for her to do it.<br/>\n<br/>\n </span></blockquote>Can she go to a career counselor/college counselor to get information.  <br/>\nECE is a field in which community colleges excel, so I&#39;m wondering why  <br/>\nshe wouldn&#39;t want to start with that? Maybe if the information and  <br/>\nadvice came from someone else, she&#39;d be more open to it?<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":215778715,"authorName":"Jodi Bezzola","from":"Jodi Bezzola &lt;jodibezzola@...&gt;","profile":"jodibezzola","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Cutting- Please help!","postDate":"1224001722","msgId":36601,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwNDM0OS45NTM1Ni5xbUB3ZWI1NDEwNy5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGdkMjlrcythY291QGVHcm91cHMuY29tPg=="},"prevInTopic":36597,"nextInTopic":36602,"prevInTime":36600,"nextInTime":36602,"topicId":36439,"numMessagesInTopic":0,"msgSnippet":"~~This weekend I touched on something she said during our first conversation. She felt that I didn t help her do what she wanted to do but only those things","messageBody":"<div id=\"ygrps-yiv-1169175778\">~~This weekend I touched on something she said during our first <br/>\nconversation. She felt that I didn&#39;t help her do what she wanted to <br/>\ndo but only those things that I wanted for her or that I thought she <br/>\nSHOULD want. I don&#39;t really think I do this but I can understand <br/>\nthat is how she sees it right now.~~<br/>\n <br/>\nThis part of what was written struck me.  I can&#39;t remember who said it, but someone, somewhere on this list or another one, said that it doesn&#39;t really matter how *we* see our kids&#39; experience, it matters how *they* see it and feel about it(totally paraphrased).  It&#39;s great when *we* think we help our kids get what they want, but what really matters is if *they* feel we are really helping them get what they want, that we&#39;re in their corner, have their back.  For some reason she is experiencing it as you not helping her get/do what she wants  Perhaps that bears further examination?  One thing I feel is so stellar about radical unschooling is the opportunity for me as a parent to really examine everything.  To really go deeper, and stretch, and examine thoroughly every nook and cranny of my motives, my feelings, my responses, etc.  I see this as a great opportunity for some more examination :).<br/>\n <br/>\nJodi <br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224031522,"authorName":"Zoa Conner","from":"Zoa Conner &lt;zoaconner@...&gt;","profile":"zoaconner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Cutting- Please help!","postDate":"1223997994","msgId":36597,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM1MUEzMjZBLjExMjJCJXpvYWNvbm5lckBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGdkMjlrcythY291QGVHcm91cHMuY29tPg=="},"prevInTopic":36596,"nextInTopic":36601,"prevInTime":36596,"nextInTime":36598,"topicId":36439,"numMessagesInTopic":0,"msgSnippet":"Kelly, You said: Liz has always been the kind of kid that did not see how much she was loved. Since your daughter is having a hard time seeing your love for","messageBody":"<div id=\"ygrps-yiv-1486042594\">Kelly, <br/>\n<br/>\nYou said: Liz has always been the kind of kid that did not see how much she<br/>\nwas loved.  <br/>\n<br/>\nSince your daughter is having a hard time seeing your love for her, maybe it<br/>\nwould help you two to check out the Five Love Languages series of books. It<br/>\njust might be that the things which make her feel loved (which languages she<br/>\nneeds to hear) are not things you are doing yet, but things you could be<br/>\ndoing for her.<br/>\n<br/>\nJust a thought. Glad things are looking up for you and your daughter.<br/>\n<br/>\nZoa<br/>\n----------------<br/>\nZoa Conner, PhD<br/>\nPhysicist and Organic Learning Mother<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:zoaconner@...\">zoaconner@...</a><br/>\n*Handmade stuff @ earthyzee.etsy.com <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":80776775,"authorName":"Kelly Nishan","from":"&quot;Kelly Nishan&quot; &lt;kel9769@...&gt;","profile":"kel9769","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Cutting- Please help!","postDate":"1223993820","msgId":36596,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdkMjlrcythY291QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdjajNvYStyZHJrQGVHcm91cHMuY29tPg=="},"prevInTopic":36541,"nextInTopic":36597,"prevInTime":36595,"nextInTime":36597,"topicId":36439,"numMessagesInTopic":0,"msgSnippet":"Thanks to everyone who replied to my post both on and off list.  The support and suggestions have been really helpful to me.  I didn t handle the whole thing","messageBody":"<div id=\"ygrps-yiv-342253142\">Thanks to everyone who replied to my post both on and off list.  The <br/>\nsupport and suggestions have been really helpful to me.  I didn&#39;t <br/>\nhandle the whole thing very well but things could have been worse.  <br/>\nI tried to talk to her about it really calmly but then I did get mad <br/>\nabout it for a little bit.  We kind of kept our conversations about <br/>\nit into short little bursts.  At first I felt personally betrayed <br/>\nbecause I really felt like I had worked so hard to make her life <br/>\nbetter and she still feels the need to be self destructive.  When <br/>\nshe left school in 8th grade I was very afraid of her cutting.  <br/>\nTurns out she did it anyway and started after she left school.  That <br/>\nkind of pisses me off.  Then again things probably could have been <br/>\nso much worse if she had stayed in school.  She says she is not <br/>\ndepressed or suicidal and does not want to go to counseling.  She is <br/>\nnot quite ready to admit that it is a problem or something she needs <br/>\nhelp with.  The one thing she won&#39;t tell me is why she does it.  She <br/>\nshowed me the marks on her wrist and they are very fine lines. <br/>\n<br/>\n Our first conversation did not go great but it was productive.  The <br/>\nnext day I was able to tell her how much I love her and that I would <br/>\nlove her even if she was covered in marks.  I told her i would love <br/>\nher even if she was a reaver which is a dorky sci fi reference from <br/>\na show we both love.  She said but if she was a reaver she would <br/>\nwant to eat me.  I told her I would love her even if she ate me and <br/>\nused my skin for clothes.  Then she laughed and said that was gross <br/>\nbut I got my point across.  Liz has always been the kind of kid that <br/>\ndid not see how much she was loved.  She has a good group of women <br/>\nrole models that really love her and listen to her and understand <br/>\nher.  The piece she is missing is a good male adult in her life.  <br/>\nThat&#39;s just the way it happened.  Her dad wasn&#39;t around.  My dad <br/>\nargued with both my sister and I and hasn&#39;t seen his granddaughters <br/>\nin several years.  Maybe that has something to do with it maybe <br/>\nnot.  <br/>\n<br/>\nThis weekend I touched on something she said during our first <br/>\nconversation.  She felt that I didn&#39;t help her do what she wanted to <br/>\ndo but only those things that I wanted for her or that I thought she <br/>\nSHOULD want.  I don&#39;t really think I do this but I can understand <br/>\nthat is how she sees it right now.  The thing she want most is to <br/>\nstart a full time ealy education program at a nearby college.  She <br/>\ndoes not want to get her GED or take community college classes.  I <br/>\nlooked up the admission requirements and wrote them all down for her <br/>\nand I looked into how to register for the SAT.  The thing she needs <br/>\nto get done is a portfolio and I think it&#39;s freaking her out a <br/>\nlittle.  We talked about some ways for her to do it.  <br/>\n<br/>\nRight now I understand I may or may not be able to make things <br/>\nbetter for her but I sure could make them worse.  Mostly I know this <br/>\nis not about me.  She&#39;s not cutting to hurt me and I need to not <br/>\ntake it as a personal insult as a mom.  I love her even when she <br/>\ndoesn&#39;t believe it.  I am doing my best to help her even when she <br/>\ndoesn&#39;t see it.  She feels that the only thing accomplished by my <br/>\nknowing is that I feel bad about it.  Just maybe though she will see <br/>\nthat even if I freak out a little I can be trusted to deal with <br/>\nknowing things about her.  This is something that will probably be <br/>\nan ongoing struggle for me for awhile.  Thank you all for helping me.<br/>\nKelly</div>","specialLinks":[]},{"userId":274026229,"authorName":"logan_rose_porter","from":"&quot;logan_rose_porter&quot; &lt;logan_rose_porter@...&gt;","profile":"logan_rose_porter","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Cutting- Please help!","postDate":"1223715959","msgId":36541,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdjcHE5bit0bHRqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdjcDhoZSs3ZzQ1QGVHcm91cHMuY29tPg=="},"prevInTopic":36535,"nextInTopic":36596,"prevInTime":36540,"nextInTime":36542,"topicId":36439,"numMessagesInTopic":0,"msgSnippet":"A few things, Cutting is not always benign - it CAN be a suicide thing, or at the very least a wanting to die thing. Take ANY cutting seriously. I agree with","messageBody":"<div id=\"ygrps-yiv-1913696516\">A few things,<br/>\n<br/>\nCutting is not always benign - it CAN be a suicide thing, or at the very least a wanting to <br/>\ndie thing. Take ANY cutting seriously.<br/>\n<br/>\nI agree with others that it is usually related to wanting to release emotional pain with <br/>\nphysical pain.<br/>\n<br/>\nTell her you love her- she may not realize or believe you do- tell her directly. If you see <br/>\nher in turmoil (crying or otherwise) talk to her, ask her whats wrong. Im sure you already <br/>\ndo these things but just reinforcing :)<br/>\n<br/>\nShe sounds very sad, and dont feel betrayed that she didnt tell you, chances are she&#39;s well <br/>\naware that it would only make you feel bad too, and the only way out of this is within her. <br/>\nAll you can do is be there for her.<br/>\n<br/>\nL<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;wisdomalways5&quot; &lt;wisdom1133@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Heather B.&quot; <br/>\n&gt; &lt;heatherbean@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; I don&#39;t have any sure advice for you.  But one of my best friends <br/>\n&gt; starting<br/>\n&gt; &gt; cutting in high school and never stopped that I know of.  &gt; <br/>\n&gt; &gt;  <br/>\n&gt; <br/>\n&gt; I was a cutter in highschool- actually I took a pin and scratched my <br/>\n&gt; skin till it bled- for me it was because I never had a say- I could <br/>\n&gt; not speak or stand up for what I wanted or how I felt so when I felt <br/>\n&gt; huge pain the physical pain was a release- it is like biting your <br/>\n&gt; lip or digging your nails into something-- <br/>\n&gt; <br/>\n&gt; does your daughter feel like she can express herself and that those <br/>\n&gt; around her are OKAY with it--- do you know WHERE she is cutting- for <br/>\n&gt; me it was on the wrists and then I wore long sleeves- <br/>\n&gt; <br/>\n&gt; back then I do not think I KNEW why I was doing it so asking her <br/>\n&gt; what the hell she is thinking probably will not work maybe figuring <br/>\n&gt; out ways she can express her pain or her feelings would help without <br/>\n&gt; having to talk about it. <br/>\n&gt; <br/>\n&gt; Julie<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":295439124,"authorName":"wisdomalways5","from":"&quot;wisdomalways5&quot; &lt;wisdom1133@...&gt;","profile":"wisdomalways5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Cutting- Please help!","postDate":"1223697774","msgId":36535,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdjcDhoZSs3ZzQ1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwRkMxOENDREUxRjQwRUZCNjVFRDEwMjhBRkRFNjA2QGZlYXRoZXJiZWFuPg=="},"prevInTopic":36506,"nextInTopic":36541,"prevInTime":36534,"nextInTime":36536,"topicId":36439,"numMessagesInTopic":0,"msgSnippet":"... starting ... I was a cutter in highschool- actually I took a pin and scratched my skin till it bled- for me it was because I never had a say- I could not","messageBody":"<div id=\"ygrps-yiv-814703974\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Heather B.&quot; <br/>\n&lt;heatherbean@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I don&#39;t have any sure advice for you.  But one of my best friends <br/>\n </span></blockquote>starting<br/>\n<blockquote><span title=\"ireply\"> &gt; cutting in high school and never stopped that I know of.  &gt; <br/>\n&gt;  <br/>\n<br/>\n </span></blockquote>I was a cutter in highschool- actually I took a pin and scratched my <br/>\nskin till it bled- for me it was because I never had a say- I could <br/>\nnot speak or stand up for what I wanted or how I felt so when I felt <br/>\nhuge pain the physical pain was a release- it is like biting your <br/>\nlip or digging your nails into something-- <br/>\n<br/>\ndoes your daughter feel like she can express herself and that those <br/>\naround her are OKAY with it--- do you know WHERE she is cutting- for <br/>\nme it was on the wrists and then I wore long sleeves- <br/>\n<br/>\nback then I do not think I KNEW why I was doing it so asking her <br/>\nwhat the hell she is thinking probably will not work maybe figuring <br/>\nout ways she can express her pain or her feelings would help without <br/>\nhaving to talk about it. <br/>\n<br/>\nJulie</div>","specialLinks":[]},{"userId":264895013,"authorName":"nicole durbin","from":"nicole durbin &lt;shannikki1@...&gt;","profile":"shannikki1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Cutting- Please help!","postDate":"1223607689","msgId":36506,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3MzI2OC40NDEwMy5xbUB3ZWIzNzUwMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":36500,"nextInTopic":36535,"prevInTime":36505,"nextInTime":36507,"topicId":36439,"numMessagesInTopic":0,"msgSnippet":"What about  getting fun/soothing supplies she can use to appreciate and enjoy her body...bath goodies like bubble bath, lotions, yummy smelling soap and","messageBody":"<div id=\"ygrps-yiv-634471708\">What about  getting fun/soothing supplies she can use to appreciate and enjoy her body...bath goodies like bubble bath, lotions, yummy smelling soap and shampoos...if money allows, maybe shopping with you for some pretty, comfy underwear of choice...might help to see how she feels good being with her body, she doesn&#39;t have to know you know, it&#39;s just a special time together. <br/>\n <br/>\nAsk her what you can do. Even if no response becomes of it at first, she will know that you are available. You are already showing how much you care and that you are a wonderful mom by seeking help! <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":244317154,"authorName":"Heather B.","from":"&quot;Heather B.&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Cutting- Please help!","postDate":"1223600741","msgId":36500,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwRkMxOENDREUxRjQwRUZCNjVFRDEwMjhBRkRFNjA2QGZlYXRoZXJiZWFuPg=="},"prevInTopic":36493,"nextInTopic":36506,"prevInTime":36499,"nextInTime":36501,"topicId":36439,"numMessagesInTopic":0,"msgSnippet":"I don t have any sure advice for you.  But one of my best friends starting cutting in high school and never stopped that I know of.  She has large, deep scars","messageBody":"<div id=\"ygrps-yiv-625365561\">I don&#39;t have any sure advice for you.  But one of my best friends starting<br/>\ncutting in high school and never stopped that I know of.  She has large,<br/>\ndeep scars on literally every inch of her body except her face and hands.  I<br/>\nnever knew what to make of it or how to help her.  Apparently, any help she<br/>\nreceived never helped at all.  <br/>\n<br/>\n <br/>\n<br/>\nI&#39;m sharing this because even though a few people have said that it may work<br/>\nitself out, the flip side is that it may not.   <br/>\n<br/>\n <br/>\n<br/>\n&quot;What would you do if you couldn&#39;t fail?&quot;<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":261717354,"authorName":"Emily","from":"&quot;Emily&quot; &lt;emilybug@...&gt;","profile":"emilybug2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Cutting- Please help!","postDate":"1223572884","msgId":36493,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdjbGVpaythcG8yQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDQUY3RDkxREE3OEFFMC1FOUMtMUYyRUBXRUJNQUlMLURZMjUuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":36471,"nextInTopic":36500,"prevInTime":36492,"nextInTime":36494,"topicId":36439,"numMessagesInTopic":0,"msgSnippet":"My sister-in-law did this in junior high. Her parents went with the What the hell are you doing to yourself approach. She refused all ","messageBody":"<div id=\"ygrps-yiv-1828660295\">My sister-in-law did this in junior high. Her parents went with the<br/>\n&quot;What the hell are you doing to yourself&quot; approach. She refused all<br/>\n&quot;help&quot;/medication/counseling. In her early 20s she is still not<br/>\nfunctioning well.<br/>\n<br/>\nI agree that you should see if it works itself out. Don&#39;t start<br/>\nlooking at her funny or let on that you are worrying about her. It<br/>\nwould be awful if she found out that her sister shared this info with<br/>\nyou. I imagine she would feel betrayed and stop talking to her sister<br/>\nabout those things &quot;parents can do nothing about&quot;<br/>\n<br/>\nPerhaps you could share some resources on other natural mood elevators<br/>\nif she doesn&#39;t want to take the anti-depressants. Or you could ask her<br/>\nsister to pass on the info about cutting- why it makes sense (the<br/>\nnatural chemical release stuff) and it might motivate her to look for<br/>\nother things she can do to get that feeling, like jogging. The more<br/>\ntools she has to deal with it on her own, the quicker she will admit<br/>\nto herself that scabs aren&#39;t hot.<br/>\n<br/>\nMy SIL is bi-polar and she is happier when she is busy. She also seems<br/>\nto feel best about herself when she is helping or doing stuff for<br/>\nothers. Maybe you could set some &quot;get healthy(er)&quot; food and exercise<br/>\ngoals for yourself and ask your daughter to join you to help keep you<br/>\nmotivated and on track.</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Cutting- Please help!","postDate":"1223567723","msgId":36471,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMwNzA1OC43Njc1Ni5xbUB3ZWI4MTUwNy5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDU4MDc4OC4zODUzNC5xbUB3ZWI4NjIwOC5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":36461,"nextInTopic":36493,"prevInTime":36470,"nextInTime":36472,"topicId":36439,"numMessagesInTopic":0,"msgSnippet":"I agree with Schuyler. My brother used to carve works on himself in his teens. He was very conflicted, in turmoil and a very sensitive guy. He also dropped out","messageBody":"<div id=\"ygrps-yiv-1248607039\">I agree with Schuyler.<br/>\nMy brother used to carve works on himself in his teens. He was very conflicted, in turmoil and a very sensitive guy. He also dropped out of high school and than met his girlfriend and moved out. He stopped when that happened. I wish I could ask him question bu he passed away young.<br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Thu, 10/9/08, Schuyler &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Cutting- Please help!","postDate":"1223544643","msgId":36456,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4MDc4OC4zODUzNC5xbUB3ZWI4NjIwOC5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":36452,"nextInTopic":36461,"prevInTime":36455,"nextInTime":36457,"topicId":36439,"numMessagesInTopic":0,"msgSnippet":"In high school I used to cut myself. I used to sit in my room in the evening feeling totally isolated and sad and confused, listening to something on my radio","messageBody":"<div id=\"ygrps-yiv-1201395256\">In high school I used to cut myself. I used to sit in my room in the evening feeling totally isolated and sad and confused, listening to something on my radio shack record player with the eight track tape deck, and I used a razor blade and cut around my ankles. It was about taking internal turmoil and giving it substance, making it real. My parents caught me at some point and freaked out. I ended up on the roof that night with them trying to grab me through the windows. They set me up with a counselor, Gaye McTate, who I&#39;d go see once a week. She was really nice. I think it helped a bit to have someone paid to listen to me and to talk to me for an hour a week. The best part was when she yelled at my dad for being late to a family meeting, arguing that I was at least as important as the clients he had at his office. My memory of my cutting is that it didn&#39;t stop. It was never very severe. It was always just minor cuts in my leg. I had a friend who carved<br/>\n words into her skin. Her need for release and expression was so much greater than mine. <br/>\n<br/>\nThe cutting is a symptom. I know I stopped when I dropped out of high school. My life didn&#39;t get easier, but it became more mine. I know it started when my mom moved back home from living in another city to work. I know that her moving back took the control that I had expanded to live with outside of my hands and that it was hard to shrink to her requirements. There is something in your daughter&#39;s life that is making her feel out of control, or in so much turmoil that she needs to express it through cutting. I would recommend trying to find lots of cool and engaging things to do. I would not recommend damaging the trust that she has in her older sister by talking about her cutting and you know. <br/>\n<br/>\nSchuyler<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.waynforth.blogspot.com\">http://www.waynforth.blogspot.com</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI just found out my 15 year old daughter is cutting and I&#39;m totally <br/>\nfreaking out.  We had talked about cutting a few weeks ago because <br/>\nher older sister who was visiting told me she had been cutting but <br/>\nstopped.  I asked Lizzy if she knew and she did.  I felt like that <br/>\nis something she should have talked to me about.  She said it&#39;s not <br/>\nthe kind of thing you talk to parents about.  She doesn&#39;t feel like <br/>\nparents can do anything about it so it doesn&#39;t help if they know.  I <br/>\ntook her out of school in 8th grade because I was afraid of her <br/>\nhurting herself like this.  Her sister just sent me a copy of a <br/>\nconversation they have been having on myspace that Lizzy is cutting <br/>\nand doesn&#39;t want to stop.  I haven&#39;t talked to her about it yet but <br/>\nI feel like I&#39;m going to throw up right now. <br/>\n<br/>\nPlease help me find the best way to deal with this.  My first <br/>\nreaction is total mental chaos.  Send her to school, send her to <br/>\ncounseling, punish her, quit my job and watch her all day, MAKE her <br/>\ntake the antidepressants that she refused to take the last few <br/>\nmonths.   I know really I can&#39;t make her stop but how can I help her <br/>\nsee that she should.  I don&#39;t understand this behavior but it seems <br/>\nso much more common than when I was a kid.  It scares the shit out <br/>\nof me.  Also her hiding things from me scares me. <br/>\n<br/>\nOur communication is better than it used to be but she has always <br/>\nrefused to talk about certain things.   I thought she was happy for <br/>\nthe most part though.  SHe has total control over just about <br/>\neverything in her life.  I work with her to help her get whatever <br/>\nshe wants.  I don&#39;t punish her.  What else can I do?   SHe has <br/>\nalways had a certain negativity to her thinking but I didn&#39;t think <br/>\nit was that bad for her anymore.   I am not going to talk to her <br/>\nabout this until I have thought about it and calmed down a <br/>\nlittle. <br/>\nKelly<br/>\n<br/>\n__<br/>\n. <br/>\n    <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":277736389,"authorName":"HoneyBeeECPlus3@aol.com","from":"HoneyBeeECPlus3@...","profile":"traceec1997","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Cutting- Please help!","postDate":"1223524147","msgId":36461,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQUY3RDkxREE3OEFFMC1FOUMtMUYyRUBXRUJNQUlMLURZMjUuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PDY0NDQ2Mi43NjIxOC5xbUB3ZWI1MjAxMC5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDY0NDQ2Mi43NjIxOC5xbUB3ZWI1MjAxMC5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":36456,"nextInTopic":36471,"prevInTime":36460,"nextInTime":36462,"topicId":36439,"numMessagesInTopic":0,"msgSnippet":"i remember in college i wrote a poem about not being able to feel unless i was bleeding.? i looked forward to my period because of the cramping and blood.? it","messageBody":"<div id=\"ygrps-yiv-422927076\">i remember in college i wrote a poem about not being able to feel unless i was bleeding.? i looked forward to my period because of the cramping and blood.? it was the only time i really felt alive.? i never cut.? i agree with what someone else said about the bleeding letting out the negative.? i have never researched it, but i believe that menstruation is a time of healing and of letting go of more than just an unfertilized ovum.? i can see how if that wasn&#39;t enough, someone would cut to make the blood flow out.? <br/>\n<br/>\n<br/>\n<br/>\nit is so strange, the older i get, how i meet more and more people who are validating things i have felt throughout my life.? i know there must be a reason it is happening now as opposed to then, but it sure would&#39;ve been nice to not constantly feel like the odd one out before.? <br/>\n<br/>\n<br/>\n<br/>\n~Tracee----who shares everything with everyone she&#39;s ever met, but never gotten this personal with perfect strangers in a public arena-----<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\n<br/>\nFrom: Amy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:quinlonsma@...\">quinlonsma@...</a>&gt;<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n<br/>\nSent: Wed, 8 Oct 2008 8:14 pm<br/>\n<br/>\nSubject: Re: [unschoolingbasics] Cutting- Please help!<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n                  <br/>\n  <br/>\n          <br/>\n              <br/>\nTo the best of my understanding Cutting is one way teenagers have found to &quot;feel&quot;. I didn&#39;t cut myself as a teen but I was engaged in other harmful behaviors to &quot;feel&quot; . The reason I put the word in quotes is because the word is sadly inadaquate and yet it&#39;s all I have to try and describe.<br/>\n<br/>\n  <br/>\n<br/>\n  Obviously, as an unschooler I realize the challenges inherent in helping a child who may not want to be helped. So I&#39;m going to throw out there some suggestions from my heart and my experience as a teenager/young adult not as parent because my kids are still barely kindergarten and I haven&#39;t experienced the parental side of this equation. <br/>\n<br/>\n  <br/>\n<br/>\n  First in conversation I would be very careful to only state the obvious and stay as far away from assumptions as possible. <br/>\n<br/>\n  <br/>\n<br/>\n  First and foremost your daughter NEEDS to know absolutely that you accept her and love her no matter what she does exactly as she is. that if she cut herself every day for the rest of her life, if she were covered in scars you would still love and accept her.? <br/>\n<br/>\n  <br/>\n<br/>\n  Secondly, self harm is not something happy people do.<br/>\n<br/>\n  <br/>\n<br/>\n  Third, does she know why she is doing this? again reassure her that no matter what she says you will still love and accept her.<br/>\n<br/>\n  <br/>\n<br/>\n  Fourth, she may not know. Life is kinda funny that way. We don&#39;t always know why we do the things we do.<br/>\n<br/>\n  <br/>\n<br/>\n  Fifth, Does she want to stop? Does she see this as a problem? or is it something she wants to continue? or maybe she sees cutting herself as something out of her control something she just does and doesn&#39;t know why.<br/>\n<br/>\n  <br/>\n<br/>\n  the BBC has been running a discussion on cutting<br/>\n<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bbc.co.uk/birmingham/teens/2004/self_harm.shtml\">http://www.bbc.co.uk/birmingham/teens/2004/self_harm.shtml</a><br/>\n<br/>\n  <br/>\n<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.selfharm.org.uk/default.aspa\">http://www.selfharm.org.uk/default.aspa</a><br/>\n<br/>\n  <br/>\n<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://nohurt.org/edition%202/cutting.html\">http://nohurt.org/edition%202/cutting.html</a><br/>\n<br/>\n  <br/>\n<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youthnoise.com/page.php?page_id=1410\">http://www.youthnoise.com/page.php?page_id=1410</a> <br/>\n<br/>\n  <br/>\n<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.freewebs.com/self_harm_life/understandingselfharmers.htm\">http://www.freewebs.com/self_harm_life/understandingselfharmers.htm</a><br/>\n<br/>\n  <br/>\n<br/>\n  If she refuses help insist she start working out with you every day. At least 2 hours every day. Whatever she is physically drawn to. Swimming, ice skating, rock climbing, a gym membership whatever. Beg and plead if you have to. The working out balances most imbalances that may hormonally be affecting her and numbing her. The endorphins will make her feel better about herself and the exercise the mere action of intensly working out will help dissapate those feelings of numbness and loss.<br/>\n<br/>\n  <br/>\n<br/>\n  Of course I would love to hear she wanted to see a psych and entered a talk therapy program but the reality is that most people attach a stigma to that and won&#39;t go.<br/>\n<br/>\n  <br/>\n<br/>\n  Love and Laughter,<br/>\n<br/>\n  <br/>\n<br/>\n  Amy<br/>\n<br/>\n  <br/>\n<br/>\n  snugglebugg.com/sagepixie <br/>\n<br/>\n  <br/>\n<br/>\n  ?<br/>\n<br/>\n       <br/>\n<br/>\n      <br/>\n<br/>\n      <br/>\n<br/>\n  <br/>\n<br/>\n      <br/>\n<br/>\n  <br/>\n<br/>\n      <br/>\n<br/>\n      <br/>\n<br/>\n  <br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n  <br/>\n<br/>\n  <br/>\n      <br/>\n                                                <br/>\n   <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Cutting- Please help!","postDate":"1223515286","msgId":36452,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgxMDA4MTgyMXcyYjg2MmFkNnY5MDZiZmIzZWUwMTU1NTcxQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDY0NDQ2Mi43NjIxOC5xbUB3ZWI1MjAxMC5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PGdjajNvYStyZHJrQGVHcm91cHMuY29tPgkgPDY0NDQ2Mi43NjIxOC5xbUB3ZWI1MjAxMC5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":36451,"nextInTopic":36456,"prevInTime":36451,"nextInTime":36453,"topicId":36439,"numMessagesInTopic":0,"msgSnippet":"I think talk therapy is often too direct and therefore ineffective because some undergoing therapy usually don t feel like talking and feel worse because they","messageBody":"<div id=\"ygrps-yiv-1736435667\">I think talk therapy is often too direct and therefore ineffective because<br/>\nsome undergoing therapy usually don&#39;t feel like talking and feel worse<br/>\nbecause they can&#39;t open up.<br/>\n<br/>\nThere are other therapies.  Expressive arts therapies: music, art,<br/>\nmotion/dance.  I think the swimming idea is excellent.  Being with is great<br/>\nif that&#39;s what is wanted.  Be open also to the teen who wants to accomplish<br/>\nthings on their own, and make the way clear to do so.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 10/8/08, Amy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:quinlonsma@...\">quinlonsma@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   To the best of my understanding Cutting is one way teenagers have found<br/>\n&gt; to &quot;feel&quot;. I didn&#39;t cut myself as a teen but I was engaged in other harmful<br/>\n&gt; behaviors to &quot;feel&quot; . The reason I put the word in quotes is because the<br/>\n&gt; word is sadly inadaquate and yet it&#39;s all I have to try and describe.<br/>\n&gt;<br/>\n&gt; Obviously, as an unschooler I realize the challenges inherent in helping a<br/>\n&gt; child who may not want to be helped. So I&#39;m going to throw out there some<br/>\n&gt; suggestions from my heart and my experience as a teenager/young adult not as<br/>\n&gt; parent because my kids are still barely kindergarten and I haven&#39;t<br/>\n&gt; experienced the parental side of this equation.<br/>\n&gt;<br/>\n&gt; First in conversation I would be very careful to only state the obvious and<br/>\n&gt; stay as far away from assumptions as possible.<br/>\n&gt;<br/>\n&gt; First and foremost your daughter NEEDS to know absolutely that you accept<br/>\n&gt; her and love her no matter what she does exactly as she is. that if she cut<br/>\n&gt; herself every day for the rest of her life, if she were covered in scars you<br/>\n&gt; would still love and accept her.<br/>\n&gt;<br/>\n&gt; Secondly, self harm is not something happy people do.<br/>\n&gt;<br/>\n&gt; Third, does she know why she is doing this? again reassure her that no<br/>\n&gt; matter what she says you will still love and accept her.<br/>\n&gt;<br/>\n&gt; Fourth, she may not know. Life is kinda funny that way. We don&#39;t always<br/>\n&gt; know why we do the things we do.<br/>\n&gt;<br/>\n&gt; Fifth, Does she want to stop? Does she see this as a problem? or is it<br/>\n&gt; something she wants to continue? or maybe she sees cutting herself as<br/>\n&gt; something out of her control something she just does and doesn&#39;t know why.<br/>\n&gt;<br/>\n&gt; the BBC has been running a discussion on cutting<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bbc.co.uk/birmingham/teens/2004/self_harm.shtml\">http://www.bbc.co.uk/birmingham/teens/2004/self_harm.shtml</a><br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.selfharm.org.uk/default.aspa\">http://www.selfharm.org.uk/default.aspa</a><br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://nohurt.org/edition%202/cutting.html\">http://nohurt.org/edition%202/cutting.html</a><br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youthnoise.com/page.php?page_id=1410\">http://www.youthnoise.com/page.php?page_id=1410</a><br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.freewebs.com/self_harm_life/understandingselfharmers.htm\">http://www.freewebs.com/self_harm_life/understandingselfharmers.htm</a><br/>\n&gt;<br/>\n&gt; If she refuses help insist she start working out with you every day. At<br/>\n&gt; least 2 hours every day. Whatever she is physically drawn to. Swimming, ice<br/>\n&gt; skating, rock climbing, a gym membership whatever. Beg and plead if you have<br/>\n&gt; to. The working out balances most imbalances that may hormonally be<br/>\n&gt; affecting her and numbing her. The endorphins will make her feel better<br/>\n&gt; about herself and the exercise the mere action of intensly working out will<br/>\n&gt; help dissapate those feelings of numbness and loss.<br/>\n&gt;<br/>\n&gt; Of course I would love to hear she wanted to see a psych and entered a talk<br/>\n&gt; therapy program but the reality is that most people attach a stigma to that<br/>\n&gt; and won&#39;t go.<br/>\n&gt;<br/>\n&gt; Love and Laughter,<br/>\n&gt;<br/>\n&gt; Amy<br/>\n&gt;<br/>\n&gt; snugglebugg.com/sagepixie<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":139413400,"authorName":"Amy","from":"Amy &lt;quinlonsma@...&gt;","profile":"quinlonsma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Cutting- Please help!","postDate":"1223511248","msgId":36451,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY0NDQ2Mi43NjIxOC5xbUB3ZWI1MjAxMC5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGdjajNvYStyZHJrQGVHcm91cHMuY29tPg=="},"prevInTopic":36448,"nextInTopic":36452,"prevInTime":36450,"nextInTime":36452,"topicId":36439,"numMessagesInTopic":0,"msgSnippet":"To the best of my understanding Cutting is one way teenagers have found to feel . I didn t cut myself as a teen but I was engaged in other harmful behaviors","messageBody":"<div id=\"ygrps-yiv-1390757135\">To the best of my understanding Cutting is one way teenagers have found to &quot;feel&quot;. I didn&#39;t cut myself as a teen but I was engaged in other harmful behaviors to &quot;feel&quot; . The reason I put the word in quotes is because the word is sadly inadaquate and yet it&#39;s all I have to try and describe.<br/>\n<br/>\nObviously, as an unschooler I realize the challenges inherent in helping a child who may not want to be helped. So I&#39;m going to throw out there some suggestions from my heart and my experience as a teenager/young adult not as parent because my kids are still barely kindergarten and I haven&#39;t experienced the parental side of this equation. <br/>\n<br/>\nFirst in conversation I would be very careful to only state the obvious and stay as far away from assumptions as possible. <br/>\n<br/>\nFirst and foremost your daughter NEEDS to know absolutely that you accept her and love her no matter what she does exactly as she is. that if she cut herself every day for the rest of her life, if she were covered in scars you would still love and accept her.  <br/>\n<br/>\nSecondly, self harm is not something happy people do.<br/>\n<br/>\nThird, does she know why she is doing this? again reassure her that no matter what she says you will still love and accept her.<br/>\n<br/>\nFourth, she may not know. Life is kinda funny that way. We don&#39;t always know why we do the things we do.<br/>\n<br/>\nFifth, Does she want to stop? Does she see this as a problem? or is it something she wants to continue? or maybe she sees cutting herself as something out of her control something she just does and doesn&#39;t know why.<br/>\n<br/>\n<br/>\nthe BBC has been running a discussion on cutting<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bbc.co.uk/birmingham/teens/2004/self_harm.shtml\">http://www.bbc.co.uk/birmingham/teens/2004/self_harm.shtml</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.selfharm.org.uk/default.aspa\">http://www.selfharm.org.uk/default.aspa</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://nohurt.org/edition%202/cutting.html\">http://nohurt.org/edition%202/cutting.html</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youthnoise.com/page.php?page_id=1410\">http://www.youthnoise.com/page.php?page_id=1410</a> <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.freewebs.com/self_harm_life/understandingselfharmers.htm\">http://www.freewebs.com/self_harm_life/understandingselfharmers.htm</a><br/>\n<br/>\nIf she refuses help insist she start working out with you every day. At least 2 hours every day. Whatever she is physically drawn to. Swimming, ice skating, rock climbing, a gym membership whatever. Beg and plead if you have to. The working out balances most imbalances that may hormonally be affecting her and numbing her. The endorphins will make her feel better about herself and the exercise the mere action of intensly working out will help dissapate those feelings of numbness and loss.<br/>\n<br/>\nOf course I would love to hear she wanted to see a psych and entered a talk therapy program but the reality is that most people attach a stigma to that and won&#39;t go.<br/>\n<br/>\nLove and Laughter,<br/>\n<br/>\nAmy<br/>\n<br/>\nsnugglebugg.com/sagepixie <br/>\n<br/>\n <br/>\n\t <br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t<br/>\n<br/>\n<br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":170761003,"authorName":"Kytka &quot;Kit&quot; Hilmar-Jezek","from":"&quot;Kytka &#92;&quot;Kit&#92;&quot; Hilmar-Jezek&quot; &lt;waldorfinspired@...&gt;","profile":"waldorfinspired","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Cutting- Please help!","postDate":"1223501186","msgId":36448,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY2Mzc0Ny42NzU5NS5xbUB3ZWI2MzkwMi5tYWlsLnJlMS55YWhvby5jb20+","inReplyToHeader":"PGdjajNvYStyZHJrQGVHcm91cHMuY29tPg=="},"prevInTopic":36439,"nextInTopic":36451,"prevInTime":36447,"nextInTime":36449,"topicId":36439,"numMessagesInTopic":0,"msgSnippet":"Hello Kelly,   First, please do not allow fear to get in the way of thinking. Cutting is a form of self harm that is like over eating, or like an adults","messageBody":"<div id=\"ygrps-yiv-33261223\">Hello Kelly,<br/>\n <br/>\nFirst, please do not allow fear to get in the way of thinking. Cutting is a form of self harm that is like over eating, or like an adults alcohol. It is NOT a suidice attempt, normally. I did a lot of research because I am a life loving and happy optimist who went through a year of hell and I began cutting. I found my entire world turned upside down and I did not know how to deal with it. Imagine losing 60 days of your life, your kids, all of your life&#39;s work, reputation, home, country, stuff (adding up to well over $2 million dollars) and lifestyle in general... I felt I wanted to scream out because no one could &quot;relate&quot; to what I went through... At times the pain got so great, and I needed to speak - but again, no one could comprehend or even address the issues that were so overwhelming to me. I literally felt as though I HAD to let and allow some pain out of my body, in a SYMBOLIC way... I felt that if I allowed a small slash in my skin, the pain<br/>\n would exit, and I would not blow up from the inside out. I know for those who have no idea how this works, it does not make too much sense... but it just &quot;felt&quot; like the only coping mechanism I had at the time. My throat chakra felt totally closed, I felt suppressed in expressing the overwhelming grief and betrayal, the deep attack on everything I had ever held as pure and sacred. <br/>\n <br/>\nTo this day, I would say that my family allowing me to sit in my corner or closet for those few very challenging months and cut without baker acting me, saved my life...  So I ask that you consider this... what could she be having trouble coping with. I am 44, and my mom wanted me to speak to her, to talk it out... but again, no words could express how I felt. The anguish was terrifying and too real, and I literally felt if I did not cut small - then I would have a stroke, heart attack, total nervous breakdown, or just drop dead.....<br/>\n <br/>\nNo one ever counseled me, and it left the same way it came into my life, one day I just realized it was ugly, I did not feel &quot;pretty&quot; or &quot;sane&quot; with those marks... and they did not get me the help I was wanting... what got me what I wanted was the love and support of my family who told me they loved me very much and would support and understand what I was going through.<br/>\n <br/>\nFrom a physical standpoint, certain hormones/chemicals are released that act as a natural &quot;valium&quot; and downer to actually prevent a larger type of self attack... it calms, and it makes one feel somehow validated in the experience of pain.<br/>\n <br/>\nI have a LOT of literature and links, sites I could recommend... I just wanted to suggest that you do not attack her with &quot;what the hell is wrong with you&quot; or &quot;why are you trying to kill yourself&quot; because that is NOT the attention she needs.... it is a very tough call, because in my opinion, when the person gets to that place, they really feel totally overwhelmed where &quot;logical&quot; talkingt is no longer effective... and yet it needs to be discussed in a non intrusive way, non judgmental way.  The &quot;high&quot; your body goes through is addictive too - so what may have started as a quick way to cope, or to try something peers are doing, has become a &quot;high&quot; for her....<br/>\n <br/>\nToo many thoughts in my mind, too many possibilities - I just wanted to add this and offer some of my links, writing, sites if you need.... <br/>\n <br/>\nHold her in the highest light.... <br/>\n<br/>\nTo Your Continued Growth & Success!<br/>\n <br/>\nKytka &quot;Kit&quot; Hilmar-Jezek, ND, PhD<br/>\nSpeaker, Coach, Author, <br/>\n <br/>\nFounder and Editor of The Age of Attraction Book Series <br/>\nAuthor of Reiki for Children<br/>\nEditor of My Journey To Becoming a Mayan Shaman<br/>\nFounder of the Following Websites:  The Age of Attraction,<br/>\nWaldorf Homeschoolers, Reiki Kids, Spiritual & Abundant Kids Blog<br/>\nCreator of the Following Videos:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/user/WaldorfHomeschoolers\">http://www.youtube.com/user/WaldorfHomeschoolers</a> <br/>\n <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Wed, 10/8/08, Kelly Nishan &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kel9769@...\">kel9769@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Kelly Nishan &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kel9769@...\">kel9769@...</a>&gt;<br/>\nSubject: [unschoolingbasics] Cutting- Please help!<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Wednesday, October 8, 2008, 1:04 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI just found out my 15 year old daughter is cutting and I&#39;m totally <br/>\nfreaking out. We had talked about cutting a few weeks ago because <br/>\nher older sister who was visiting told me she had been cutting but <br/>\nstopped. I asked Lizzy if she knew and she did. I felt like that <br/>\nis something she should have talked to me about. She said it&#39;s not <br/>\nthe kind of thing you talk to parents about. She doesn&#39;t feel like <br/>\nparents can do anything about it so it doesn&#39;t help if they know. I <br/>\ntook her out of school in 8th grade because I was afraid of her <br/>\nhurting herself like this. Her sister just sent me a copy of a <br/>\nconversation they have been having on myspace that Lizzy is cutting <br/>\nand doesn&#39;t want to stop. I haven&#39;t talked to her about it yet but <br/>\nI feel like I&#39;m going to throw up right now. <br/>\n<br/>\nPlease help me find the best way to deal with this. My first <br/>\nreaction is total mental chaos. Send her to school, send her to <br/>\ncounseling, punish her, quit my job and watch her all day, MAKE her <br/>\ntake the antidepressants that she refused to take the last few <br/>\nmonths. I know really I can&#39;t make her stop but how can I help her <br/>\nsee that she should. I don&#39;t understand this behavior but it seems <br/>\nso much more common than when I was a kid. It scares the shit out <br/>\nof me. Also her hiding things from me scares me. <br/>\n<br/>\nOur communication is better than it used to be but she has always <br/>\nrefused to talk about certain things. I thought she was happy for <br/>\nthe most part though. SHe has total control over just about <br/>\neverything in her life. I work with her to help her get whatever <br/>\nshe wants. I don&#39;t punish her. What else can I do? SHe has <br/>\nalways had a certain negativity to her thinking but I didn&#39;t think <br/>\nit was that bad for her anymore. I am not going to talk to her <br/>\nabout this until I have thought about it and calmed down a <br/>\nlittle. <br/>\nKelly<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":80776775,"authorName":"Kelly Nishan","from":"&quot;Kelly Nishan&quot; &lt;kel9769@...&gt;","profile":"kel9769","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Cutting- Please help!","postDate":"1223496266","msgId":36439,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdjajNvYStyZHJrQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":36448,"prevInTime":36438,"nextInTime":36440,"topicId":36439,"numMessagesInTopic":0,"msgSnippet":"I just found out my 15 year old daughter is cutting and I m totally freaking out.  We had talked about cutting a few weeks ago because her older sister who was","messageBody":"<div id=\"ygrps-yiv-1062874592\">I just found out my 15 year old daughter is cutting and I&#39;m totally <br/>\nfreaking out.  We had talked about cutting a few weeks ago because <br/>\nher older sister who was visiting told me she had been cutting but <br/>\nstopped.  I asked Lizzy if she knew and she did.  I felt like that <br/>\nis something she should have talked to me about.  She said it&#39;s not <br/>\nthe kind of thing you talk to parents about.  She doesn&#39;t feel like <br/>\nparents can do anything about it so it doesn&#39;t help if they know.  I <br/>\ntook her out of school in 8th grade because I was afraid of her <br/>\nhurting herself like this.  Her sister just sent me a copy of a <br/>\nconversation they have been having on myspace that Lizzy is cutting <br/>\nand doesn&#39;t want to stop.  I haven&#39;t talked to her about it yet but <br/>\nI feel like I&#39;m going to throw up right now.  <br/>\n<br/>\nPlease help me find the best way to deal with this.  My first <br/>\nreaction is total mental chaos.  Send her to school, send her to <br/>\ncounseling, punish her, quit my job and watch her all day, MAKE her <br/>\ntake the antidepressants that she refused to take the last few <br/>\nmonths.   I know really I can&#39;t make her stop but how can I help her <br/>\nsee that she should.  I don&#39;t understand this behavior but it seems <br/>\nso much more common than when I was a kid.  It scares the shit out <br/>\nof me.  Also her hiding things from me scares me.  <br/>\n<br/>\nOur communication is better than it used to be but she has always <br/>\nrefused to talk about certain things.   I thought she was happy for <br/>\nthe most part though.  SHe has total control over just about <br/>\neverything in her life.  I work with her to help her get whatever <br/>\nshe wants.  I don&#39;t punish her.  What else can I do?   SHe has <br/>\nalways had a certain negativity to her thinking but I didn&#39;t think <br/>\nit was that bad for her anymore.   I am not going to talk to her <br/>\nabout this until I have thought about it and calmed down a <br/>\nlittle.    <br/>\nKelly</div>","specialLinks":[]}],"prevTopicId":36616,"nextTopicId":36613}}