{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":362437716,"authorName":"Paul & Camille","from":"&quot;Paul & Camille&quot; &lt;morlingfamily@...&gt;","profile":"mumspreciousones","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: How to blend our routines? (bedtime blues!)","postDate":"1276213321","msgId":44358,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PG9wLnZkM3lzYjF3OXZxMHUzQGxvY2FsaG9zdD4="},"prevInTopic":44353,"nextInTopic":0,"prevInTime":44357,"nextInTime":44359,"topicId":44349,"numMessagesInTopic":0,"msgSnippet":"Sorry if this has been touched on as I dont have time to read through everything right now - this is what I do.  We go to bed together, I get a DVD that ds","messageBody":"<div id=\"ygrps-yiv-784992354\">Sorry if this has been touched on as I dont have time to read through  <br/>\neverything right now - this is what I do.  We go to bed together, I get a  <br/>\nDVD that ds wants to watch and we put in in the computer on the end of the  <br/>\nbed.  We watch together, I often fall asleep but he snuggles beside me and  <br/>\nwe talk and laugh and have fun - until I go to sleep.  When hes ready to  <br/>\ngo to sleep he either says, Im tired now can you take the computer away  <br/>\n(which I do) and then we snuggle to sleep again - OR I get up after hes  <br/>\nasleep.  Sometimes he goes to sleep with the DVD going and Daddy comes and  <br/>\nchecks on us from time to time to take the computer away if we both fall  <br/>\nasleep.  We both look forward to this time together and snuggling.   <br/>\nSometimes we read instead, but either way its an enjoyable, relaxing time  <br/>\nfor both of us.  Ds is now 6 y.o and weve always had a lovely time going  <br/>\nto bed.<br/>\n<br/>\nCamille</div>","specialLinks":[]},{"userId":304719992,"authorName":"Vickie","from":"Vickie &lt;vickbaron@...&gt;","profile":"vickbaron","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] How to blend our routines? (bedtime blues!)","postDate":"1276173690","msgId":44353,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3MjQ3My42Nzc1OC5xbUB3ZWI4MTAwMi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PEFBTkxrVGluUWFJRlI2MWdoQmVjTERRdFNlaWN3UFlRN0Y1cnF2Z18tUFU5eUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGluUWFJRlI2MWdoQmVjTERRdFNlaWN3UFlRN0Y1cnF2Z18tUFU5eUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":44352,"nextInTopic":44358,"prevInTime":44352,"nextInTime":44354,"topicId":44349,"numMessagesInTopic":0,"msgSnippet":"... My 3.5yo dd sometimes stays up without us... I set up a movie and a place to sleep in the living room for her, and keep the path to our room lighted (we","messageBody":"<div id=\"ygrps-yiv-1931300845\"><blockquote><span title=\"ireply\">&gt;&gt; I love the idea that when she&#39;s older, dd can stay up after mum and dad, why not?&lt;&lt;<br/>\n<br/>\n </span></blockquote>My 3.5yo dd sometimes stays up without us... I set up a movie and a place to sleep in the living room for her, and keep the path to our room lighted (we all share a bedroom), in case she wants to come in. It also helps that our house is all on one floor. Sometimes she falls asleep in the living room, and other times she has called for us at crazy hours to put on another movie. I feel bad that she&#39;s alone, but she doesn&#39;t mind. It would be just like if she had her own room anyway.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Plus I really still need &#39;down time&#39; without the kids.&lt;&lt;<br/>\n<br/>\n </span></blockquote>To echo what others have said about this, it was hard for me to let go of this idea too, but life has been better since I have let go of the expectation of time alone at night. Sometimes I get it, and that&#39;s great, but most times I don&#39;t. I also have a 1.5yo ds who nurses to sleep earlier than dd. It helps me now to think of the night time as my special time &quot;alone&quot; with dd. We cuddle up to a movie together or read books without the little one interrupting. And usually it works out that ds wakes up earlier, so I get some time alone with him in the morning. If I&#39;m really lucky, I can sneak out of bed before either of them wakes up, and then I love my quiet time.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I really don&#39;t want to be up till 1am every night.&lt;&lt;<br/>\n<br/>\n </span></blockquote>Does she still resist going to bed if you go to bed at the same time? Sometimes mine does, but I have found a few things that ease her into bed. She loves me to read to her, so some nights it works if we pick a bunch of books, and then read each one in a different place, on the way to bed. So we might read one on the couch, one in the bathroom while she goes potty, one in my bed, and then one (or more) in her bed. She likes that game sometimes. But after I read to her in bed, I have to stay in the room (either in her bed, mine, or if ds wakes up, I go to his bed and nurse him). If I tried to leave the room before she fell asleep it would not go well.<br/>\n<br/>\nAlso, my husband works very long hours in the summer, and sometimes we go days without seeing him. I found this frustrating as I wanted to have a conversation with him without the kids sometimes, and dd would always be up with me. I figured out that some nights, it works if we take a drive when dh gets home. We all get to be together, the kids are calm (neither one minds the car), and bonus if one or both falls asleep. Dh and I get to talk to each other too. dd transfers to bed pretty well as long as it&#39;s late enough, and ds can usually nurse right back to sleep if he wakes up on the transfer.<br/>\n<br/>\nAnd lastly, I just want to let you know that I understand what you are going through. Only a few months ago, it seemed like bedtime would never work out. dd would always ask for another movie, and it was so hard to agree to it. It took a while, but she is finally at the point where she will decide that she has had enough for the night, and agree to move toward the bed without any fight. She still never asks to go to bed though. I have to just start moving us in that direction together. If I get any resistance, I know she is not ready yet and there is no point in trying. But we are starting to understand each other better on this issue. Good luck to you! You will make it through this.<br/>\n<br/>\nVickie<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] How to blend our routines? (bedtime blues!)","postDate":"1276160088","msgId":44352,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxNzU2NS45MTMyOS5xbUB3ZWI4NjIwNi5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PEFBTkxrVGluUWFJRlI2MWdoQmVjTERRdFNlaWN3UFlRN0Y1cnF2Z18tUFU5eUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGluUWFJRlI2MWdoQmVjTERRdFNlaWN3UFlRN0Y1cnF2Z18tUFU5eUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":44351,"nextInTopic":44353,"prevInTime":44351,"nextInTime":44353,"topicId":44349,"numMessagesInTopic":0,"msgSnippet":"I can remember walking around the village where we used to live in the middle of summer at 8 o clock or 9, fully bright out, and seeing the blinds drawn on so","messageBody":"<div id=\"ygrps-yiv-1245327592\">I can remember walking around the village where we used to live in the middle of summer at 8 o&#39;clock or 9, fully bright out, and seeing the blinds drawn on so many upstairs windows as children were going to bed. I think it is very hard in the UK to stick to a set bedtime when the changing daylight alters the biorhythm of the inhabitants. And it&#39;s lovely outside at 9 to go and watch the swallows and swifts catching their babies meals and to see the bats beginning to come out for their own meals or to maybe catch a glimpse of a hedgehog humphing along through a garden. There is a lovely peacefulness to wandering around a village all tucked up for bed while you chat and giggle and play with your own family. <br/>\n<br/>\nSimon and Linnaea never wanted to stay up alone, not at 3 3/4. I know that isn&#39;t true for all almost 4 year olds, but for both Simon and Linnaea that was the case. Going to bed wasn&#39;t that much of an issue once I stopped having set bedtimes. It also took really examining my desire for down time. I had held on to this notion that down time needed to happen at a set time of a day, after Simon and Linnaea had gone to bed, and that it was exclusive of them. When I let that go, when I gave in to their need for me to be with them and their need to be engaged, I found downtime all over the place. Playing with dolls, and listening to Linnaea explain what was going on was so restful, sitting with Simon on my lap and watching him play through Asterix and Obelix on the computer, cuddling up for a movie or a television programme, all things that required only my presence and not so much my active participation. And let me tell you, in that horrible way of someone<br/>\n with older children, how much I miss being such a central part of their lives. At 10 and 13, not so many years on, my downtime is so big I find myself working to engage with them and floundering around looking for things to engage me. I&#39;m so fortunate that they really enjoy being with me, they are so willing to let me sit with them and watch what they are doing. Linnaea&#39;s even still willing to let me read to her. <br/>\n<br/>\nOne of the things I noticed, too, when I let go of my down time expectation was how much more I enjoyed being with Simon and Linnaea. It was weird, like the desire for downtime made me resentful of their need of me. But when I fully embraced the fact that as little children who I had chosen to have and to parent in this way, they needed me, well, I really stopped seeing them so much as obstacles between me and whatever else it was I wanted to do. <br/>\n<br/>\nSome of the things that helped with bedtimes were having things that were pleasant in bed. Sometimes it was watching the Pink Panther over and over again. Sometimes it was reading books until my speech slurred with sleep or a little sweaty head needed to be dislodged from the crook of my arm so that I could curl up and go to sleep. Bed needed to be at least as good as staying downstairs to do whatever could be done downstairs without an adult around. Or with a sleepy not particularly responsive adult as company. It also helped a lot to nudge Linnaea toward a later bedtime so that I could stay up with Simon and sleep in the next day more easily. <br/>\n<br/>\nOn days when I was exhausted from a less than restful nights sleep and having two very active young children to care for, I would set up a whole cool bunch of stuff to play with in a room where I could curl up in front of the door and fall asleep while they played. It was a good way of meeting all of our needs. And even if I didn&#39;t sleep all that well, the 30 minutes of zoning out by the door made it much more possible for me to deal with the next part of the day. <br/>\n<br/>\nOh and about kids tv, Simon and Linnaea quite enjoyed David Attenborough shows, they loved the Life in the Freezer and Blue Planet and shows of that ilk. It may help to have more than the standard kids shows on offer for when you feel in need of a change. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Caroline Gallear &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:carolinegallear@...\">carolinegallear@...</a>&gt;<br/>\n<br/>\n<br/>\nHi all,<br/>\n<br/>\nOur ever-changing bedtime routines are being challenged once again...<br/>\n<br/>\nA couple of weeks after we stopped saying &quot;time for bed, don&#39;t argue!&quot; to<br/>\ndd, age 3 3/4, she began asking to go up at 8.30 or 9pm.  Great! we thought,<br/>\nhappy child and time for us to  unwind too!  Now everything is different,<br/>\nand every night she cries that she wants to stay up late, doesn&#39;t want to<br/>\nsleep etc.  We gently say that it IS late, and we all need sleep, Mummy is<br/>\ngoing to bed now, so we can&#39;t do ...(fill in the blank).<br/>\n<br/>\nI have broken nights with ds, 2 years, who asks to nurse to sleep about<br/>\n7.30pm and gets up about 7am.<br/>\n<br/>\nSO... I love the idea that when she&#39;s older, dd can stay up after mum and<br/>\ndad, why not?  If I visit my parents I feel excited and &#39;naughty&#39; staying up<br/>\nreally late, and I&#39;m 30!  But she&#39;s too little to stay up alone, and I need<br/>\nto sleep come 10 or 10.30pm!  Plus I really still need &#39;down time&#39; without<br/>\nthe kids.  I enjoy the days so much better and relate to them better if  I<br/>\ndon&#39;t have wall-to-wall games and kids&#39; TV.  Is that bad?<br/>\n<br/>\nI must confess that I feel I haven&#39;t really let go of the whole bedtime<br/>\nthing.  I thought I had to begin with, but it&#39;s now getting to be so late<br/>\nevery evening, I&#39;m so tired that I can&#39;t explain anything gently or<br/>\nnegotiate.  Plus, she then sleeps in later each day so of course she wants<br/>\nto go to bed later.  Is there a gentle way I can try to sync everyone&#39;s<br/>\nroutines a little better?  Or should I just totally let go, resign myself to<br/>\nbeing knackered for a week and see what she does?  I feel inspired by the<br/>\nstories of kids working it out for themselves, maybe having a mad time then<br/>\nsettling into their own routine, but I really don&#39;t want to be up till 1am<br/>\nevery night.<br/>\n<br/>\nI feel a bit rubbish about this right now.  I don&#39;t like controlling dd, but<br/>\nI don&#39;t feel comfortable giving her everything she wants when that leaves me<br/>\nso drained.<br/>\n<br/>\nThanks for reading, sorry I am so slow to get this thing :)<br/>\n<br/>\nCaroline<br/>\ndh<br/>\ndd 3 3/4<br/>\nds 2<br/>\nHampshire, UK.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] How to blend our routines? (bedtime blues!)","postDate":"1276140725","msgId":44351,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE4OTczMDg3NzI0RDRFOUJBOEE3QUM5QzE0MEQ2Q0M5QENvbm5pZVBDPg==","inReplyToHeader":"PEFBTkxrVGluUWFJRlI2MWdoQmVjTERRdFNlaWN3UFlRN0Y1cnF2Z18tUFU5eUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGluUWFJRlI2MWdoQmVjTERRdFNlaWN3UFlRN0Y1cnF2Z18tUFU5eUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":44350,"nextInTopic":44352,"prevInTime":44350,"nextInTime":44352,"topicId":44349,"numMessagesInTopic":0,"msgSnippet":"... Why can t she do it now? : -) My 3 year old will often times go to sleep after me. Once I get the baby to sleep, I go to sleep and let my 3 year old lay in","messageBody":"<div id=\"ygrps-yiv-804090671\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;SO... I love the idea that when she&#39;s older, dd can stay up after mum and dad, why not?&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Why can&#39;t she do it now? : -) My 3 year old will often times go to sleep after me. Once I get the baby to sleep, I go to sleep and let my 3 year old lay in bed and watch TV until she falls asleep. She is in the room with us so that I can still hear her. Usually, because the rest of the house is quiet and dark, she will stay in our room with us. I don&#39;t remember if your daughter sleeps with you or if she is in another room. One big sleeping room has been our answer to the night time blues. It isn&#39;t always smooth sailing though. There are times that they get a little wild and I have to ask them to run laps around the house to help them wind down. : -) <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Plus I really still need &#39;down time&#39; without the kids. I enjoy the days so much better and relate to them better if I<br/>\n </span></blockquote>don&#39;t have wall-to-wall games and kids&#39; TV. Is that bad?&lt;&lt;&lt;<br/>\n<br/>\nWhat do you mean by down time? Does it have to be done at the same time every day or can you find other ways of getting down time that don&#39;t involve the kids going to bed at certain times. I don&#39;t think it is bad to want or need down time. You may just have to get creative in how you get it. Maybe you need to get your husband/neighbor/nanny/etc. to watch the kids for a little while each day/week/month so you can get down time that doesn&#39;t involve bed time. I get my down time in the morning when I feel like I need it. We all go to bed around the same time so I just sneak out of bed in the morning and play on the computer. Or, at night, I do stuff while everyone is winding down. Right now, all of the lights are off and we are winding down for the evening. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I must confess that I feel I haven&#39;t really let go of the whole bedtime thing.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>It&#39;s hard to let go of something that is so ingrained in society. Everywhere you go, you hear messages about how important it is for kids to have strict bedtimes and strict bedtime routines. When my oldest was a baby, my husband made the mistake of mentioning that our oldest didn&#39;t go to bed until 10:30 because I worked nights. He got an earful about how we shouldn&#39;t do that. We should be putting her to bed at 7, 8 at the latest. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I thought I had to begin with, but it&#39;s now getting to be so late every evening, I&#39;m so tired that I can&#39;t explain anything gently or negotiate. Plus, she then sleeps in later each day so of course she wants<br/>\n </span></blockquote>to go to bed later. Is there a gentle way I can try to sync everyone&#39;s routines a little better?&lt;&lt;&lt;&lt;<br/>\n<br/>\nTrying to get the littlest one to stay up later might help. We still have lots of rough spots when it comes to bed time. Sometimes I am gentle and am able to negotiate without a problem. Sometimes, I am a real butthead because I am so tired. My absolute limit is 11PM. I have tried to hang with them all night but it didn&#39;t work. They won&#39;t stay up without me so they just come in our room and watch TV. We have found that certain programs will put them to sleep. I do have to remind them to be quiet from time to time. I think that is just the nature of little kids though. They get wild and crazy. Yes, I get firm with them but I don&#39;t let it get to me because I know that it is perfectly normal. I am respectful towards my kids but that doesn&#39;t mean that I am always super nice and that doesn&#39;t mean that I am always able to be the perfect mom that can always negotiate and be gentle. I am human. Sometimes I think that some of the lists make it sound as though unschooling parents don&#39;t have the normal range of emotions. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Or should I just totally let go, resign myself to being knackered for a week and see what she does? I feel inspired by the stories of kids working it out for themselves, maybe having a mad time then<br/>\n </span></blockquote>settling into their own routine, but I really don&#39;t want to be up till 1am every night.&lt;&lt;&lt;<br/>\n<br/>\nOnly you can answer that question. : -) If you haven&#39;t tried letting her see what her limits are, then it might be helpful to just let her explore it. We went whole hog for a while and didn&#39;t have any bed times and the girls and I stayed up late with many all nighters. After a while, we were all feeling crappy and were cranky. I talked about it with my older girls and we all decided that we liked having bed times. My girls tell me that they feel much better and that they like being able to do more stuff. My 3 year old follows our cues most of the time so she just goes to bed when we do because she doesn&#39;t like being alone. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I feel a bit rubbish about this right now. I don&#39;t like controlling dd, but I don&#39;t feel comfortable giving her everything she wants when that leaves me so drained.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>It&#39;s hard to find a balance. Unschooling isn&#39;t about giving kids everything they want. In our house, we have found a balance by having a bedtime around 11PM. It&#39;s not strict but that is our loose goal. Sometimes the kids ask to go to bed sooner and sometimes they don&#39;t. When they don&#39;t, we all remind each other that it is time for us all to go to bed. For me, the thing that I try to avoid is arbitrary rules that only apply to the kids. Because my husband and I are subject to the same bedtime, I feel a little better about it. When my girls get old enough and want to stay up later, they are welcome to. Right now, they have asked us to help them go to bed earlier and get up earlier because it makes them feel better.<br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How to blend our routines? (bedtime blues!)","postDate":"1276127946","msgId":44350,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh1cDlzYStpbzU1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGluUWFJRlI2MWdoQmVjTERRdFNlaWN3UFlRN0Y1cnF2Z18tUFU5eUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":44349,"nextInTopic":44351,"prevInTime":44349,"nextInTime":44351,"topicId":44349,"numMessagesInTopic":0,"msgSnippet":"... Can you wake her up earlier? Alternately, can you ease the younger child onto a later schedule? Sometimes that can be easier. ... It might help to make a","messageBody":"<div id=\"ygrps-yiv-1373906130\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Caroline Gallear &lt;carolinegallear@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Plus, she then sleeps in later each day so of course she wants<br/>\n&gt; to go to bed later. Is there a gentle way I can try to sync everyone&#39;s<br/>\n&gt; routines a little better?<br/>\n<br/>\n </span></blockquote>Can you wake her up earlier? Alternately, can you ease the younger child onto a later schedule? Sometimes that can be easier. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Or should I just totally let go, resign myself to<br/>\n&gt; being knackered for a week and see what she does? <br/>\n<br/>\n </span></blockquote>It might help to make a list of all the alternatives and pick whichever seems most workable - as an Experiment. The experiment part is important because you don&#39;t want to set yourself up to feel &quot;locked in&quot; to a decision. You&#39;re trying to figure something out, something that involves young children, and to some extent that involves the methodology of young children: experimentation.  <br/>\n<br/>\nTotally letting go can take more than a week - that&#39;s something to think about. Plan for weeks (plural, maybe several!!!) of transition time when you won&#39;t have any outtings, few if any visitors, while you have a houseful of people who are trying to find a workable sleep and waking routine.  <br/>\n<br/>\nIs it summer where you are? Sorry I can&#39;t keep track of everyone! If so, see if there&#39;s an older child or teen who&#39;d be willing to come have some sleep-overs so you can get some rest that way.<br/>\n<br/>\nWhat did you like about the arrangement you had before and what didn&#39;t you like? There was a lot of fighting, right? And resentment? The key to getting over resentment isn&#39;t necessarily changing what you do - its changing how you react to things not going exactly the way you&#39;d like. Is it &quot;worth it&quot; to go back? There&#39;s no &quot;right answer&quot; on that and you don&#39;t have to answer it here - answer in your heart. Maybe you have mixed feelings - sometimes none of the solutions seem good! I&#39;ve been there, blundering along, hoping to trip over a better idea. Many times, waiting another week will help me have a better perspective. If I can wait one week, sometimes I can wait one more. Enough weeks go by and Something will change. <br/>\n<br/>\nTrying to transition slowly is setting you up for a longer, more stressful transition. The whole thing is getting dragged out. That&#39;s one of the possible side effects of &quot;saying yes more&quot; rather than diving in - you&#39;re still exerting control, so your kids keep resisting. Shucks. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Plus I really still need &#39;down time&#39; without<br/>\n&gt; the kids.  I enjoy the days so much better and relate to them better if  I<br/>\n&gt; don&#39;t have wall-to-wall games and kids&#39; TV.  Is that bad?<br/>\n<br/>\n </span></blockquote>Are you a bad person? No. Is it getting in the way of figuring out a routine that works for everyone? Yes. Maybe not the idea of &quot;down time&quot; itself, but if you have specific ideas about how and when it needs to happen then that&#39;s going to get in the way for sure. <br/>\n<br/>\nIt took me awhile to get used to kids&#39; TV. It was rough at first - the sounds are all different. My transitional compromise was to have certain movies and shows that were okay after a certain time (at that point the sole tv was in my bedroom! I&#39;ve since rectified that situation) so that I could wind down. I can&#39;t wind down to the Eds! But I can wind down to Courage or even Billy and Mandy. <br/>\n<br/>\nTransitional compromises are okay! Maybe a transitional compromise could be scheduling some late night fun - plan some evening outtings. Get ice-cream or go to a park to watch fireflies. If you live in a city with a river or lake, see if there are evening light show events along the water (popular in New England, don&#39;t know about elsewhere). Make staying up late something fun to do together. <br/>\n<br/>\nAnother transitional compromise could be &quot;quiet time&quot; - she can stay up if she watches a show or movie with headphones or does some other, quiet activity by herself. A sort of if-then agreement (although those are much much harder to create with young children!). That could even be mixed in with planned late-nights. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Thanks for reading, sorry I am so slow to get this thing :)<br/>\n<br/>\n </span></blockquote>I don&#39;t think you&#39;re slow to &quot;get&quot; anything - you just want things to settle down Now! or at least soon ;) That&#39;s not a terrible thing. It might help to see that same reaction going on with your dd. She wants *you* to settle down Now and let her have her experiment with staying up as late as she wants as often and as long as she wants. She&#39;s not enjoying be stuck in a weird transition any more than you are, I&#39;ll bet. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":326479635,"authorName":"Caroline Gallear","from":"Caroline Gallear &lt;carolinegallear@...&gt;","profile":"caroline.gallear","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"How to blend our routines? (bedtime blues!)","postDate":"1276121474","msgId":44349,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluUWFJRlI2MWdoQmVjTERRdFNlaWN3UFlRN0Y1cnF2Z18tUFU5eUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":44350,"prevInTime":44348,"nextInTime":44350,"topicId":44349,"numMessagesInTopic":0,"msgSnippet":"Hi all, Our ever-changing bedtime routines are being challenged once again... A couple of weeks after we stopped saying time for bed, don t argue! to dd, age","messageBody":"<div id=\"ygrps-yiv-1011786005\">Hi all,<br/>\n<br/>\nOur ever-changing bedtime routines are being challenged once again...<br/>\n<br/>\nA couple of weeks after we stopped saying &quot;time for bed, don&#39;t argue!&quot; to<br/>\ndd, age 3 3/4, she began asking to go up at 8.30 or 9pm.  Great! we thought,<br/>\nhappy child and time for us to  unwind too!  Now everything is different,<br/>\nand every night she cries that she wants to stay up late, doesn&#39;t want to<br/>\nsleep etc.  We gently say that it IS late, and we all need sleep, Mummy is<br/>\ngoing to bed now, so we can&#39;t do ...(fill in the blank).<br/>\n<br/>\nI have broken nights with ds, 2 years, who asks to nurse to sleep about<br/>\n7.30pm and gets up about 7am.<br/>\n<br/>\nSO... I love the idea that when she&#39;s older, dd can stay up after mum and<br/>\ndad, why not?  If I visit my parents I feel excited and &#39;naughty&#39; staying up<br/>\nreally late, and I&#39;m 30!  But she&#39;s too little to stay up alone, and I need<br/>\nto sleep come 10 or 10.30pm!  Plus I really still need &#39;down time&#39; without<br/>\nthe kids.  I enjoy the days so much better and relate to them better if  I<br/>\ndon&#39;t have wall-to-wall games and kids&#39; TV.  Is that bad?<br/>\n<br/>\nI must confess that I feel I haven&#39;t really let go of the whole bedtime<br/>\nthing.  I thought I had to begin with, but it&#39;s now getting to be so late<br/>\nevery evening, I&#39;m so tired that I can&#39;t explain anything gently or<br/>\nnegotiate.  Plus, she then sleeps in later each day so of course she wants<br/>\nto go to bed later.  Is there a gentle way I can try to sync everyone&#39;s<br/>\nroutines a little better?  Or should I just totally let go, resign myself to<br/>\nbeing knackered for a week and see what she does?  I feel inspired by the<br/>\nstories of kids working it out for themselves, maybe having a mad time then<br/>\nsettling into their own routine, but I really don&#39;t want to be up till 1am<br/>\nevery night.<br/>\n<br/>\nI feel a bit rubbish about this right now.  I don&#39;t like controlling dd, but<br/>\nI don&#39;t feel comfortable giving her everything she wants when that leaves me<br/>\nso drained.<br/>\n<br/>\nThanks for reading, sorry I am so slow to get this thing :)<br/>\n<br/>\nCaroline<br/>\ndh<br/>\ndd 3 3/4<br/>\nds 2<br/>\nHampshire, UK.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":44354,"nextTopicId":44359}}