{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":20,"messages":[{"userId":333930247,"authorName":"irelandkelly10","from":"&quot;irelandkelly10&quot; &lt;irelandkelly10@...&gt;","profile":"irelandkelly10","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: rules v principles Was the knife issue","postDate":"1323210040","msgId":47739,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpibTRmbythaXVxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGphbWM2bCs3ZW1oQGVHcm91cHMuY29tPg=="},"prevInTopic":47737,"nextInTopic":0,"prevInTime":47738,"nextInTime":47740,"topicId":47706,"numMessagesInTopic":0,"msgSnippet":"... I am SO glad you posted about this.  I have four kids and you could be describing my 7 year old.  He does crazy stuff (well, crazy to me) and rules just","messageBody":"<div id=\"ygrps-yiv-1997595938\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; &quot;I didn&#39;t get the luxury of a &quot;good kid&quot; with Ray, so I had the chance to get a hard look at what rules do and don&#39;t do. They don&#39;t protect anyone. They don&#39;t parent your kids when your back is turned - and depending on the child, may set your kid up to do Exactly those things you&#39;d rather he didn&#39;t. They don&#39;t provide a sense of safety when you&#39;re &quot;firm&quot; about them because in order to be really, really &quot;firm&quot; (with a particularly curious and/or thoughtful child) you have to be so dogmatic that the rules become a power-trip - otherwise every rule is modified and excepted in response to good sense. So I learned to start from good sense and figure out how to work With my busy, inquisitive boy who wanted to touch - and often break - just about everything.&quot;<br/>\n<br/>\n </span></blockquote>I am SO glad you posted about this.  I have four kids and you could be describing my 7 year old.  He does crazy stuff (well, crazy to me) and rules just wouldn&#39;t work.  He is the one who drew with pen on the wall when my back was turned (he ran out of paper), cut up the fuzzy felt board (he wanted a smaller one) and who peeled the paper off of a christmas tree decoration (he wanted to see what it was made of.)<br/>\n<br/>\nMy other kids - two older and one younger than him - wouldn&#39;t think to do these things, or would at least ask first but he doesn&#39;t seem to have this capacity just yet.  None of the things he did were bad, and all had a valid (to him) reason.<br/>\n<br/>\nHe also has a pen knife.  <br/>\n<br/>\nHe carves his own magic staffs and swords and has never hurt himself but we have talked and talked about knives.  He also does a lot of cooking so has used knives for chopping alot.  He knows they hurt, he&#39;s seen me chop off my finger nail before! <br/>\n<br/>\nI think the rules v principles discussion is a really interesting one....especially since my daughter is an avid rule follower and her sibling clearly isn&#39;t!<br/>\n<br/>\nKelly  <br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; ---<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":178804705,"authorName":"Daria S","from":"&quot;Daria S&quot; &lt;daria_simionescu@...&gt;","profile":"lilreddgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling infants/toddlers","postDate":"1322815239","msgId":47737,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpiYTJ1NytjdHRwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGphb2liOCtxNnY0QGVHcm91cHMuY29tPg=="},"prevInTopic":47733,"nextInTopic":47739,"prevInTime":47736,"nextInTime":47738,"topicId":47706,"numMessagesInTopic":0,"msgSnippet":"Meredith - wondering why you are not a giant fan of Aletha Solter...? I am just now exploring some of her writings and feeling curious","messageBody":"<div id=\"ygrps-yiv-414283000\">Meredith - <br/>\n<br/>\nwondering why you are not a giant fan of Aletha Solter...?<br/>\n<br/>\n I am just now exploring some of her writings and feeling curious<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Meredith&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; &quot;Sacha Davis&quot; &lt;sacha@&gt; wrote:<br/>\n&gt; &gt;&gt; I really appreciate (I think) Meredith saying that it&#39;s okay for kids to<br/>\n&gt; &gt; be frustrated.  It really is okay, it builds resiliance.<br/>\n&gt; <br/>\n&gt; Egads! That&#39;s not what I meant at all! And it isn&#39;t even true. Frustration doesn&#39;t make one stronger or more capable, it very often wears people down. Frustration is part of how schools fail - they make &quot;learning&quot; one frustration after another until kids give up.<br/>\n&gt; <br/>\n&gt; But! parents can get all wound up trying to fix Everything when sometimes there&#39;s nothing to fix. When the sun goes down and your kid cries because the day is over, there&#39;s nothing to fix. You can offer a gazillion fun things to do after sunset, but only time will bring the sun back, and sometimes that&#39;s a sad thing. It&#39;s okay for kids to feel the whole range of human emotions - how else will they learn about them? It&#39;s not about building anything, though; life isn&#39;t a series of lessons and you don&#39;t need lessons to learn. Human beings learn because that&#39;s our great gift in life: learning. <br/>\n&gt; <br/>\n&gt; I&#39;m not a giant fan of Althea Solter, but she does have a point that sometimes tears serve a purpose for the person who is crying - sometimes you just need a good cry! The release of brain chemicals produced in a &quot;good cry&quot; can leave you feeling better afterwards; and that can be as true of babies and little kids as moms. <br/>\n&gt; <br/>\n&gt; ---Meredith<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":292815228,"authorName":"nancyannbennett","from":"&quot;nancyannbennett&quot; &lt;tom.bennett@...&gt;","profile":"nancyannbennett","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling infants/toddlers","postDate":"1322409131","msgId":47733,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGphdG1iYiszbHBuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpha2g4cCtnYWlvQGVHcm91cHMuY29tPg=="},"prevInTopic":47731,"nextInTopic":47737,"prevInTime":47732,"nextInTime":47734,"topicId":47706,"numMessagesInTopic":0,"msgSnippet":"Hi Ivana, I am a novice at this so I offer these ideas humbly. ********************* 2. I try to let him play with pretty much anything I use, but there are","messageBody":"<div id=\"ygrps-yiv-1363129899\">Hi Ivana,<br/>\nI am a novice at this so I offer these ideas humbly.<br/>\n<br/>\n*********************<br/>\n2. I try to let him play with pretty much anything I use, but there are times I<br/>\ndo take stuff away for safety reasons. For example, if he reaches for my knife<br/>\nwhile we&#39;re eating, I move it away and give him something that&#39;s safe (cup,<br/>\nspoon, food). This sometimes works, but other times he gets upset, because he<br/>\nreally wants the knife (or whatever else it was). How should I deal with this<br/>\nkind of situation?<br/>\n<br/>\n3. The dangerous stuff from last question: what is really dangerous and what can<br/>\nI actually give him and show him how to use safely? We let him play with remote<br/>\ncontrolls and our phones. If he&#39;s just looking and pushing buttons, I let him<br/>\nbe, but take it away if he starts putting it in the mouth, say &#39;not for eating&#39;<br/>\nand give it back to him. Should I have a similar approach with knives and forks<br/>\nor is that a bad idea?<br/>\n***************************<br/>\n<br/>\nI just wanted to say that whatver you decide to do to handle these situations to be aware that it&#39;s a great opportunity for you.  These situations don&#39;t go away as children get older but rather change (as you see from the other thread about the 5 yo wanting a knife ;o) )<br/>\nYes your baby cannot talk and understanding is more limited with a young baby.  At that age, I think safe alternatives and respectful distractions often work well. There have been lots of great ideas around that already (such as second hand or old/broken remote controls/ old mobile phones etc as &#39;toys&#39;). But it is also exciting for you to be aware of unschooling when your baby is so young and to start exploring some ideas of unschooling and parenting. Helping you to find the way that works for your family. By starting young, you get to grow into it with your little one. I hope that makes sense.<br/>\n<br/>\nBest wishes<br/>\nNancy-Ann</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling infants/toddlers","postDate":"1322344915","msgId":47731,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4MzUxNjA2MDdAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":47730,"nextInTopic":47733,"prevInTime":47730,"nextInTime":47732,"topicId":47706,"numMessagesInTopic":0,"msgSnippet":"... LOL yes you do - usually I ll tell DH and DS I just need a good cry - nothing you ve done or not done (if that s truly the case, which it usually is), I","messageBody":"<div id=\"ygrps-yiv-1301611248\"><blockquote><span title=\"ireply\">&gt;sometimes you just need a good cry! The release of brain chemicals produced in a &quot;good cry&quot; can leave you feeling better afterwards;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>LOL yes you do - usually I&#39;ll tell DH and DS &quot;I just need a good cry - nothing you&#39;ve done or not done (if that&#39;s truly the case, which it usually is), I just need to cry.&quot; So, DS will grab the Kleenex and DH will hold me (if that&#39;s what I need right then) and I&#39;ll cry. Then it&#39;s over and we move on.<br/>\n<br/>\n--Deb R<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************</div>","specialLinks":[]},{"userId":274177100,"authorName":"Vickisue Gray","from":"Vickisue Gray &lt;vickisue_gray@...&gt;","profile":"vickisue_gray","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: rules v principles Was the knife issue","postDate":"1322324402","msgId":47730,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJERUVCMDM5LTFDMkItNEZENS05MUExLUU2MTYwMEEzM0I2NEB5YWhvby5jb20+"},"prevInTopic":47729,"nextInTopic":47731,"prevInTime":47729,"nextInTime":47731,"topicId":47706,"numMessagesInTopic":0,"msgSnippet":"But there needs not to be a rule about abusing horses for the kid s safety. There needs to be a philosophy about how to live life and respect for the safety","messageBody":"<div id=\"ygrps-yiv-1502576657\">&quot;But there needs not to be<br/>\na &quot;rule&quot; about abusing horses for the kid&#39;s safety. There needs to be a<br/>\nphilosophy about how to live life and respect for the safety and happiness<br/>\nof others to include animals, which all people abide by.&quot;<br/>\n<br/>\nExactly!  <br/>\n<br/>\n=)<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling infants/toddlers","postDate":"1322248273","msgId":47729,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGphb3A4aCthMWhlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMjIxNTU4MDIuNzEwOTQuWWFob29NYWlsTmVvQHdlYjEyMDUwNi5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":47728,"nextInTopic":47730,"prevInTime":47728,"nextInTime":47730,"topicId":47706,"numMessagesInTopic":0,"msgSnippet":"This just made me think about my recent kitchen reorganization. It is OK, now that the kids are 16 and 18, to put the knives in lower drawers. It takes me a","messageBody":"<div id=\"ygrps-yiv-757280424\">This just made me think about my recent kitchen reorganization. It is OK, now that the kids are 16 and 18, to put the knives in lower drawers. It takes me a while sometimes. . . :)<br/>\n<br/>\nNance<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Vickisue Gray &lt;vickisue_gray@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi Ivana,<br/>\n&gt; <br/>\n&gt; My advice would be to be firm on rules of safety and use the &#39;watermark rule&#39; for making Kyo&#39;s world a safe and fun place. In my house, the watermark rule represents moving all dangerous and or fragile items out of reach/sight/room depending on item.  There&#39;s nothing wrong with using discretion on what items a small one has available.  An example of this is when I started having children, all lower kitchen cabinets were made child friendly.  That way if my daughter explored I didn&#39;t have to worry about it.  She had fun pulling out the pots and pans and tupperware.  Lots of happy memories watching her discover and play.  =)<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; My first born who is now 21yo, just moved into her first house that she and her boyfriend bought together.  Since they have friends who already have babies and small children and someday they plan on having their own, I had suggested that they just set up their house in a child friendly way right from the get go.  To me, this means storing all cleaning supplies, hazardous items in one place and out of reach of curious little ones.  Someplace easy to block or lock so when friends are over, you just don&#39;t need to worry about it.  Knives can be dangerous but there are also kid friendlier knives meaning more along the line of say a butter knife and even then, I&#39;d be watching/helping an 8 month old.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":277213997,"authorName":"K S","from":"K S &lt;luvbullbreeds@...&gt;","profile":"kswanay1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: rules v principles Was the knife issue","postDate":"1322243719","msgId":47728,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTTROK3B0MkxLNVhRPWpWT1k9UGNrQnRWZUY0UUFwOGlIY1FwLURBaXNzOTRSOHFTZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":47725,"nextInTopic":47729,"prevInTime":47727,"nextInTime":47729,"topicId":47706,"numMessagesInTopic":0,"msgSnippet":"I m currently working at an Intensive Out Patient treatment facility for people with substance abuse issues.  (Many of them have co-occurring disorders as","messageBody":"<div id=\"ygrps-yiv-576648819\">I&#39;m currently working at an Intensive Out Patient treatment facility for<br/>\npeople with substance abuse issues.  (Many of them have co-occurring<br/>\ndisorders as well.)  My current group are all about 18-26 years old though<br/>\nI do have a few people who are over 60.  But the &quot;kids&quot; all share one<br/>\ncommon experience beyond the substance abuse, they all had &quot;rule&quot; driven<br/>\nlives.  Some rules were abusive, (and I&#39;m not saying all are. But for<br/>\nexample, one girl&#39;s mother had a &quot;rule&quot; about this girl never looking<br/>\nprettier than the mother or she&#39;d beat her until she had bruises etc.)  But<br/>\nback to topic, none of these kids used around their parents.  Even when the<br/>\nparents were also users.  The &quot;rule&quot; of the parents, school, etc was that<br/>\n&quot;drugs are bad&quot; and they found ways to break that rule, in many cases just<br/>\nto prove to themselves that they had some amount of control over their own<br/>\nlives.<br/>\n<br/>\nThat&#39;s what &quot;rules&quot; do really, -- say to a person &quot;Here is my way of<br/>\ncontrolling you.&quot;  We have rules for traffic, jobs, taxes etc...which are<br/>\nimposed on us by our governments and societies.  Very few people like<br/>\npaying taxes even when they agree taxes are necessary.  I guess my point<br/>\nis, I would avoid making &quot;rules&quot; and framing them in such a way that the<br/>\nchild upon whom they are imposed is supposed to &quot;buy&quot; that they are for<br/>\ntheir own good or they are somehow important by sake of being a rule.<br/>\nBecause people who have no control over their lives generally look for ways<br/>\nto get it back.  And given what I do currently, I would say a lot of them<br/>\nharbor pain, anger, or resentment toward their parents for what happened to<br/>\ntheir lives.<br/>\n<br/>\nWe have pets here and I suppose we have a &quot;rule&quot; about not abusing them,<br/>\nbut it&#39;s not a &quot;rule&quot; it&#39;s a way of living.  &quot;We treat our pets with<br/>\nkindness.&quot;  Not so much an edict as just a gentle way of approaching life.<br/>\n<br/>\nMy kids (the treatment kids) struggle a great deal with trying to learn how<br/>\nto live life in a way which will not harm themselves, and problem-solve in<br/>\neffective ways, when they are not told what to do.  More than dealing with<br/>\n&quot;drugs are bad&quot; type ideas, what I do is help them navigate life in ways<br/>\nwhich bring them joy and lessen their pain in the absence of someone saying<br/>\n&quot;DO THIS NOT THAT&quot; because they never learned this skill.  (And some of<br/>\nthese kids had 4.0 gpas in high school and full-ride scholarships to Ivy<br/>\nleague schools so it&#39;s not that they are all from disadvantaged<br/>\nbackgrounds.)<br/>\n<br/>\nI guess I would say think about the real issues surrounding a child and the<br/>\nremote control/knife/cell phone/horses/whatever, and decide what is real,<br/>\nand what is fear.  If it is &quot;your&quot; fear that the child might get hurt<br/>\nfigure out why and what you can do about that.  What is the reality of the<br/>\nsituation?  Pull a horse&#39;s tail and the horse might at its discretion<br/>\nkick...which may result in broken ribs or worse.  But there needs not to be<br/>\na &quot;rule&quot; about abusing horses for the kid&#39;s safety.  There needs to be a<br/>\nphilosophy about how to live life and respect for the safety and happiness<br/>\nof others to include animals, which all people abide by.<br/>\n<br/>\nThe problem with &quot;No knives&quot; is that said kid sees the adults use them<br/>\nwithout harm.  So their lived experience does not match what they are being<br/>\ntold.  I suppose I&#39;m trying to say more presence, guidance and respect for<br/>\nthe child as a human being, and less &quot;rules&quot; because &quot;rules&quot; only give the<br/>\nimpression they work.  All I see are &quot;rules&quot; doing damage on really<br/>\nprofound scales with the kids in my program.  I am for the most part,<br/>\nre-parenting them to help them grow past the damage and get a shot at a<br/>\nlife which is happy and fulfilling for them.<br/>\n<br/>\nTL;DR = Rules don&#39;t work like we think they do.<br/>\n<br/>\nKRS<br/>\n&quot;We have a lot of systemic, built-in bias and prejudice -- not just against<br/>\nrace, but against those others who are different than the majority of us in<br/>\nthis country.&quot;  ~ Morris Dees ~<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling infants/toddlers","postDate":"1322241192","msgId":47725,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGphb2liOCtxNnY0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEyNjguMTI4Ljk1LjIzOC4xMzcuMTMyMjE3MTUyOC5zcXVpcnJlbEB3ZWJtYWlsLmRyaXp6bGUuY29tPg=="},"prevInTopic":47724,"nextInTopic":47728,"prevInTime":47724,"nextInTime":47726,"topicId":47706,"numMessagesInTopic":0,"msgSnippet":"... Egads! That s not what I meant at all! And it isn t even true. Frustration doesn t make one stronger or more capable, it very often wears people down.","messageBody":"<div id=\"ygrps-yiv-345553809\">&quot;Sacha Davis&quot; &lt;sacha@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I really appreciate (I think) Meredith saying that it&#39;s okay for kids to<br/>\n&gt; be frustrated.  It really is okay, it builds resiliance.<br/>\n<br/>\n </span></blockquote>Egads! That&#39;s not what I meant at all! And it isn&#39;t even true. Frustration doesn&#39;t make one stronger or more capable, it very often wears people down. Frustration is part of how schools fail - they make &quot;learning&quot; one frustration after another until kids give up.<br/>\n<br/>\nBut! parents can get all wound up trying to fix Everything when sometimes there&#39;s nothing to fix. When the sun goes down and your kid cries because the day is over, there&#39;s nothing to fix. You can offer a gazillion fun things to do after sunset, but only time will bring the sun back, and sometimes that&#39;s a sad thing. It&#39;s okay for kids to feel the whole range of human emotions - how else will they learn about them? It&#39;s not about building anything, though; life isn&#39;t a series of lessons and you don&#39;t need lessons to learn. Human beings learn because that&#39;s our great gift in life: learning. <br/>\n<br/>\nI&#39;m not a giant fan of Althea Solter, but she does have a point that sometimes tears serve a purpose for the person who is crying - sometimes you just need a good cry! The release of brain chemicals produced in a &quot;good cry&quot; can leave you feeling better afterwards; and that can be as true of babies and little kids as moms. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":274177100,"authorName":"Vickisue Gray","from":"Vickisue Gray &lt;vickisue_gray@...&gt;","profile":"vickisue_gray","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: rules v principles Was the knife issue","postDate":"1322238630","msgId":47724,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjIyMzg2MzAuMjMwMTcuWWFob29NYWlsTmVvQHdlYjEyMDUwMS5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":47720,"nextInTopic":47725,"prevInTime":47723,"nextInTime":47725,"topicId":47706,"numMessagesInTopic":0,"msgSnippet":"Lol Meredith, I was originally going to use common sense and not rules as we don t have rules but my spouse and I ve had many conversations about the","messageBody":"<div id=\"ygrps-yiv-1019834355\">Lol Meredith,<br/>\n<br/>\nI was originally going to use &#39;common sense&#39; and not &#39;rules&#39; as we don&#39;t have &#39;rules&#39; but my spouse and I&#39;ve had many conversations about the term &#39;common sense&#39; which isn&#39;t as common as one would think!  =)  <br/>\n<br/>\nI totally agree that rules do nothing.  People do what people will do.  Adults and kids alike.  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling infants/toddlers","postDate":"1322229478","msgId":47720,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4MzUxNjA0QjRAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":47718,"nextInTopic":47724,"prevInTime":47719,"nextInTime":47721,"topicId":47706,"numMessagesInTopic":0,"msgSnippet":"Maybe the trip is too long/too much - have you tried shorter trips? Or, possibly, try fewer trips. Not stop going out altogether necessarily but maybe 3 times","messageBody":"<div id=\"ygrps-yiv-1276514245\">Maybe the trip is too long/too much - have you tried shorter trips? Or, possibly, try fewer trips. Not stop going out altogether necessarily but maybe 3 times per week instead of 5 (for instance). Just because he loved going out every day last month does not mean he&#39;s fine with it this month. Stuff changes. I know that for my DS, about 3 &quot;outside activities&quot; (park days, trips to the science museum, grocery store, etc) were about all he could handle in a week. Occasionally more, sometimes less. And,  too, within those trips, if we had more than two stops, that could be problematic as well. Often, we&#39;d save multi-stop errands and the like for when one of us could stay home with him or when he was visiting with grandma each week.<br/>\n<br/>\nAnother thing to ponder for yourself is whether perhaps the car seat comes to represent leaving the &#39;fun stuff&#39;. It&#39;s not the seat so much as that it means playing with friends, visiting the zoo, etc is over. Something we often tried to do was rather than focusing on &quot;we&#39;re leaving now&quot; was &quot;we&#39;re going to&quot; whatever. For instance, DS often didn&#39;t want to leave off playing after Wednesday night church services. If we said &quot;time to go home now&quot; there&#39;d often be tears and struggles. But, if we said &quot;Time to go past the bug zappers&quot; he&#39;d often (not always) head to the car. [the bug zappers are big industrial electrified ultraviolet type lights that were mounted on a series of factory buildings along one of our possible routes home]<br/>\n<br/>\nAs far as dangerous stuff, we generally had a principle of &#39;be safe&#39; - sometimes we&#39;d try to substitute things (butter knife for steak knife for instance) and other times we&#39;d work with him to use the item. It depended on the why a lot of the time. Did he want the knife to explore knives or did he want the knife to do useful work (cutting up vegetables like mom and dad were doing). Those are very different things. Exploring a bladed sharp object for its own self usually involved us alongside guiding and helping. Doing useful work, however, we often could find ways he could be independent with that - the taut wire egg and cheese slicers, for instance, are wonderful. DS could safely and independently slice mushrooms, kiwi, strawberries, eggs, etc while DH and I did other things because it&#39;s near impossible to cut skin on the wires. As he got older, we helped him with &quot;kitchen tips and tricks&quot; that make it safer (even for adults). For example, cutting a small slice off the bottom of a tomato or other round object means they aren&#39;t going to roll around (as much) when being sliced. We also made sure the knives were quite sharp and that the cutting board had a non-skid surface underneath so it would slip and slide when in use. For some kids, using knives comes as easily and comfortably as breathing from the time they are wee ones; others might grow into using them in steps and stages. It&#39;s up to us as parents to be aware and alert to both verbal and body language signs of comfort/discomfort and meet them where they are and partner with them to get to their own goals. Just as my hubby might help me improve my skills with handling home repairs, we help DS as he chooses in handling knives or cooking over the hot stove or using the microwave.<br/>\n<br/>\n--Deb R<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":146052230,"authorName":"Sacha Davis","from":"&quot;Sacha Davis&quot; &lt;sacha@...&gt;","profile":"sacha_pie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unschooling infants/toddlers","postDate":"1322188592","msgId":47718,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyMzguMTI4Ljk1LjIzOC4xMzcuMTMyMjE4ODU5Mi5zcXVpcnJlbEB3ZWJtYWlsLmRyaXp6bGUuY29tPg==","inReplyToHeader":"PDEzMjIxODU0MTIuNjY1MDEuWWFob29NYWlsTmVvQHdlYjgxNTA1Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PGpha2g4cCtnYWlvQGVHcm91cHMuY29tPiAgICA8MTI2OC4xMjguOTUuMjM4LjEzNy4xMzIyMTcxNTI4LnNxdWlycmVsQHdlYm1haWwuZHJpenpsZS5jb20+ICAgIDwxMzIyMTg1NDEyLjY2NTAxLllhaG9vTWFpbE5lb0B3ZWI4MTUwNS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":47717,"nextInTopic":47720,"prevInTime":47717,"nextInTime":47719,"topicId":47706,"numMessagesInTopic":0,"msgSnippet":"Okay, I need to clarify.  I in no way think any parent should not address frustration to purposely build resiliance.  That s not what *I* meant and *my* words","messageBody":"<div id=\"ygrps-yiv-1872320874\">Okay, I need to clarify.  I in no way think any parent should not address<br/>\nfrustration to purposely build resiliance.  That&#39;s not what *I* meant and<br/>\n*my* words haven&#39;t been taken in the right way - a foible of email.<br/>\n<br/>\nTo explain - frustration is a natural developmental process and sometimes<br/>\nparents, I think especially when parenting babies, will feel helpless<br/>\nbecause the level of frustration their child is experiencing may not be<br/>\nresolveable.  But what Joyce said is perfect - frustration just IS  and as<br/>\nalways I just LOVE her words.<br/>\n<br/>\nI would never ever leave a baby, child, kid, teenager frustrated purposely<br/>\nbecause I&#39;m trying to build resiliance - that is machiavellian and cruel. <br/>\nI would always try to address, to reduce, to change things in a way that<br/>\nprevents those moments.  And when they hit anyway, I would, and I do<br/>\npretty much every day, stay present and empathize.<br/>\nHope that clears things up.<br/>\n<br/>\nSacha<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; &lt;&lt;&lt;&quot;I really appreciate (I think) Meredith saying that it&#39;s okay for kids<br/>\n&gt; to<br/>\n&gt; be frustrated. It really is okay, it builds resiliance.&quot;&gt;&gt;&gt;&gt;&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I do not think that was what Meredith was saying. I do not think she is<br/>\n&gt; advocating for kids to be frustrated so they build resilience.<br/>\n&gt; What she is saying , and that it took me a while to understand when I had<br/>\n&gt; an easily frustrated child, is that  we cannot fix everything.<br/>\n&gt; Things will happen and kids will get frustrated. That is life. If we can<br/>\n&gt; help that is awesome. <br/>\n&gt;<br/>\n&gt; If my child wants to chew on yet another of cell phones ( I had one die<br/>\n&gt; because of it years ago) I would not let it.<br/>\n&gt; I would give him an old phone but not the one I do not want it broken. It<br/>\n&gt; costs money I cannot afford.<br/>\n&gt; Sometimes my son wanted impossible things like the commercial to play<br/>\n&gt; again because he like it.<br/>\n&gt; Back then I did not have a DVR to play back stuff. I wish I had. When my<br/>\n&gt; service offered us one with free installation I got it.<br/>\n&gt; It made life a lot easier.   But while I did not have it all I could<br/>\n&gt; really do was be supportive and make sure all his needs where met to make<br/>\n&gt; sure he was &#39;<br/>\n&gt; not hungry or tired. It was random so I could never tell which commercial<br/>\n&gt; he wanted to see again or I would record them in a tape.<br/>\n&gt;<br/>\n&gt; Sure I tried what I could but sometimes he just got frustrated and had<br/>\n&gt; huge meltdowns.<br/>\n&gt; The moment I learned to stay calm that is when things started getting<br/>\n&gt; better. He still had meltdowns but I was able to keep my calm<br/>\n&gt; and that helped him so much more. We cannot fix everything . I cannot make<br/>\n&gt; the sun come out when it is raining.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Thinking that frustration is good for building resilience can be dangerous<br/>\n&gt; thinking.<br/>\n&gt; I remember my friend letting her 2 week old cry so she could learn<br/>\n&gt; to self-soothe and , as the doctor said, exercise her lungs.<br/>\n&gt; So my friend felt it was necessary.<br/>\n&gt; I am glad I did not believe a bit on that and  did not let my babies cry<br/>\n&gt; it out but I still hear people saying that.<br/>\n&gt;<br/>\n&gt; People say kids need to have very set and enforced rules or your house<br/>\n&gt; will be chaotic. My house is far from being chaotic and is very peaceful<br/>\n&gt; and happy.<br/>\n&gt; My kids are great and pretty amazing.<br/>\n&gt;<br/>\n&gt; Alex Polikowsky<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt; Alex Polikowsky<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unschooling infants/toddlers","postDate":"1322185579","msgId":47717,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjIxODU1NzkuNTI0NzQuWWFob29NYWlsTmVvQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDkyOTYwQUM3LTA4MDktNEJCRC05RDIyLTczNkE0Rjc5QTc1RkB2ZXJpem9uLm5ldD4=","referencesHeader":"PGpha2g4cCtnYWlvQGVHcm91cHMuY29tPiA8MTI2OC4xMjguOTUuMjM4LjEzNy4xMzIyMTcxNTI4LnNxdWlycmVsQHdlYm1haWwuZHJpenpsZS5jb20+IDw5Mjk2MEFDNy0wODA5LTRCQkQtOUQyMi03MzZBNEY3OUE3NUZAdmVyaXpvbi5uZXQ+"},"prevInTopic":47716,"nextInTopic":47718,"prevInTime":47716,"nextInTime":47718,"topicId":47706,"numMessagesInTopic":0,"msgSnippet":"I wrote  a big post then I read Joyce s perfect words and much shorter and clear writing! I want to say: There, that is what I wanted to say! Thanks Joyce!  ","messageBody":"<div id=\"ygrps-yiv-728130868\">I wrote  a big post then I read Joyce&#39;s perfect words and much shorter and clear writing!<br/>\nI want to say: There, that is what I wanted to say! Thanks Joyce!<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n________________________________<br/>\n From: Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSent: Thursday, November 24, 2011 5:21 PM<br/>\nSubject: Re: [unschoolingbasics] Unschooling infants/toddlers<br/>\n <br/>\n<br/>\n  <br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Nov 24, 2011, at 4:52 PM, Sacha Davis wrote:<br/>\n<br/>\n&gt;  it&#39;s okay for kids to<br/>\n&gt; be frustrated. It really is okay, it builds resiliance.<br/>\n<br/>\nWell, being frustrated shouldn&#39;t be seen as a positive thing, not as <br/>\nsomething to allow because good things will come of it.<br/>\n<br/>\nFrustration just is. Frustrating things will happen because the world <br/>\ndoesn&#39;t always give us what we want when we want it. If a parent can&#39;t <br/>\nfix the situation or prevent it, then sympathy is a really good thing.<br/>\n<br/>\nFix what you can. Be proactive to prevent what you can. And when you <br/>\ncan&#39;t, sympathize.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\nR<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Unschooling infants/toddlers","postDate":"1322185412","msgId":47716,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjIxODU0MTIuNjY1MDEuWWFob29NYWlsTmVvQHdlYjgxNTA1Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDEyNjguMTI4Ljk1LjIzOC4xMzcuMTMyMjE3MTUyOC5zcXVpcnJlbEB3ZWJtYWlsLmRyaXp6bGUuY29tPg==","referencesHeader":"PGpha2g4cCtnYWlvQGVHcm91cHMuY29tPiA8MTI2OC4xMjguOTUuMjM4LjEzNy4xMzIyMTcxNTI4LnNxdWlycmVsQHdlYm1haWwuZHJpenpsZS5jb20+"},"prevInTopic":47715,"nextInTopic":47717,"prevInTime":47715,"nextInTime":47717,"topicId":47706,"numMessagesInTopic":0,"msgSnippet":" I do not think that","messageBody":"<div id=\"ygrps-yiv-1372795396\">&lt;&lt;&lt;&quot;I really appreciate (I think) Meredith saying that it&#39;s okay for kids to<br/>\nbe frustrated. It really is okay, it builds resiliance.&quot;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nI do not think that was what Meredith was saying. I do not think she is advocating for kids to be frustrated so they build resilience.<br/>\nWhat she is saying , and that it took me a while to understand when I had an easily frustrated child, is that  we cannot fix everything.<br/>\nThings will happen and kids will get frustrated. That is life. If we can help that is awesome. <br/>\n<br/>\nIf my child wants to chew on yet another of cell phones ( I had one die because of it years ago) I would not let it.<br/>\nI would give him an old phone but not the one I do not want it broken. It costs money I cannot afford.<br/>\nSometimes my son wanted impossible things like the commercial to play again because he like it.<br/>\nBack then I did not have a DVR to play back stuff. I wish I had. When my service offered us one with free installation I got it.<br/>\nIt made life a lot easier.   But while I did not have it all I could really do was be supportive and make sure all his needs where met to make sure he was &#39;<br/>\nnot hungry or tired. It was random so I could never tell which commercial he wanted to see again or I would record them in a tape.<br/>\n<br/>\nSure I tried what I could but sometimes he just got frustrated and had huge meltdowns.<br/>\nThe moment I learned to stay calm that is when things started getting better. He still had meltdowns but I was able to keep my calm<br/>\nand that helped him so much more. We cannot fix everything . I cannot make the sun come out when it is raining.<br/>\n<br/>\n<br/>\nThinking that frustration is good for building resilience can be dangerous thinking.<br/>\nI remember my friend letting her 2 week old cry so she could learn to self-soothe and , as the doctor said, exercise her lungs.<br/>\nSo my friend felt it was necessary.<br/>\nI am glad I did not believe a bit on that and  did not let my babies cry it out but I still hear people saying that.<br/>\n<br/>\nPeople say kids need to have very set and enforced rules or your house will be chaotic. My house is far from being chaotic and is very peaceful and happy.<br/>\nMy kids are great and pretty amazing.<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unschooling infants/toddlers","postDate":"1322176881","msgId":47715,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyOTYwQUM3LTA4MDktNEJCRC05RDIyLTczNkE0Rjc5QTc1RkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEyNjguMTI4Ljk1LjIzOC4xMzcuMTMyMjE3MTUyOC5zcXVpcnJlbEB3ZWJtYWlsLmRyaXp6bGUuY29tPg==","referencesHeader":"PGpha2g4cCtnYWlvQGVHcm91cHMuY29tPiA8MTI2OC4xMjguOTUuMjM4LjEzNy4xMzIyMTcxNTI4LnNxdWlycmVsQHdlYm1haWwuZHJpenpsZS5jb20+"},"prevInTopic":47714,"nextInTopic":47716,"prevInTime":47714,"nextInTime":47716,"topicId":47706,"numMessagesInTopic":0,"msgSnippet":"... Well, being frustrated shouldn t be seen as a positive thing, not as something to allow because good things will come of it. Frustration just is.","messageBody":"<div id=\"ygrps-yiv-302296605\">On Nov 24, 2011, at 4:52 PM, Sacha Davis wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  it&#39;s okay for kids to<br/>\n&gt; be frustrated. It really is okay, it builds resiliance.<br/>\n<br/>\n </span></blockquote>Well, being frustrated shouldn&#39;t be seen as a positive thing, not as  <br/>\nsomething to allow because good things will come of it.<br/>\n<br/>\nFrustration just is. Frustrating things will happen because the world  <br/>\ndoesn&#39;t always give us what we want when we want it. If a parent can&#39;t  <br/>\nfix the situation or prevent it, then sympathy is a really good thing.<br/>\n<br/>\nFix what you can. Be proactive to prevent what you can. And when you  <br/>\ncan&#39;t, sympathize.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":146052230,"authorName":"Sacha Davis","from":"&quot;Sacha Davis&quot; &lt;sacha@...&gt;","profile":"sacha_pie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unschooling infants/toddlers","postDate":"1322171528","msgId":47714,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyNjguMTI4Ljk1LjIzOC4xMzcuMTMyMjE3MTUyOC5zcXVpcnJlbEB3ZWJtYWlsLmRyaXp6bGUuY29tPg==","inReplyToHeader":"PGpha2g4cCtnYWlvQGVHcm91cHMuY29tPg==","referencesHeader":"IDxqYWtoOHArZ2Fpb0BlR3JvdXBzLmNvbT4="},"prevInTopic":47712,"nextInTopic":47715,"prevInTime":47713,"nextInTime":47715,"topicId":47706,"numMessagesInTopic":0,"msgSnippet":"Is Kyo still in the bucket carseat?  If he is, moving into the next seat might help.  I sometimes give Zivia a GIANT beach ball to play within the car seat,","messageBody":"<div id=\"ygrps-yiv-1666787673\">Is Kyo still in the bucket carseat?  If he is, moving into the next seat<br/>\nmight help.  I sometimes give Zivia a GIANT beach ball to play within the<br/>\ncar seat, but she&#39;s older and more tolerant.  I know of some people who<br/>\nhave hung things off the ceiling of their car.  But overall, this will<br/>\npass.<br/>\n<br/>\nI really appreciate (I think) Meredith saying that it&#39;s okay for kids to<br/>\nbe frustrated.  It really is okay, it builds resiliance.<br/>\n<br/>\nAs for safety, I suggest looking at the object you feel uncomfortable with<br/>\nand thinking through what could truly happen.  What is the danger of the<br/>\nfork?  If the knife is a butter knife, how badly could he hurt himself<br/>\nwith it?  Is the remote control going to hurt him somehow?  To me some<br/>\nthings are pretty clear, like wandering in a parking lot or into traffic,<br/>\nsticking a finger into an outlet, but other things bring different levels<br/>\nof risk - a fork might poke him, he might cry, but is it going to place<br/>\nhim in a truly unsafe situation?  Walking with a fork would bring more<br/>\ndanger than sitting, so maybe have him sit.<br/>\n<br/>\nThen look at the big picture - is this about safety or about preventing<br/>\nhim from getting hurt, and if it&#39;s about him getting hurt, is protecting<br/>\nhim from this preventing exploration?<br/>\n<br/>\nThen there are replacement items - you don&#39;t want teeth marks on your<br/>\nremote, maybe find one at Goodwill he can chew on.  Could you offer him<br/>\nsome plastic kid eating utensil that he&#39;d enjoy using (my 15 mo. daugther<br/>\nLOVES her plastic fork!).<br/>\n<br/>\nThat&#39;s all I have for now.<br/>\n<br/>\nS.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Hello everyone,<br/>\n&gt;<br/>\n&gt; I&#39;ve been reading the list for a while, but I think this is my first post.<br/>\n&gt; I&#39;ve also read most of Sandra Dodd&#39;s website many times over, but I still<br/>\n&gt; have some questions.<br/>\n&gt;<br/>\n&gt; I have an 8 month old son Kyo whom I plan to unschool. We&#39;re already doing<br/>\n&gt; most of the things Attachment Parenting style, such as breastfeeding on<br/>\n&gt; demand, co-sleeping, babywearing, etc. Sandra&#39;s page said that there is<br/>\n&gt; more to it than that: if you want to unschool you need to provide a rich<br/>\n&gt; environment and let your baby explore. I try to do that too, but here are<br/>\n&gt; some questions.<br/>\n&gt;<br/>\n&gt; 1. Kyo hates spending time in his carseat. He&#39;s usually fine when we go<br/>\n&gt; somewhere, but gets cranky when coming back. It doesn&#39;t matter if he had a<br/>\n&gt; nap before we left to go home, he cries like it&#39;s the end of the world. It<br/>\n&gt; doesn&#39;t happen every time, but about one out of four trips. Sometimes my<br/>\n&gt; singing calms him down, but not always. It&#39;s usually the worst after we<br/>\n&gt; enter our neighborhood and are 5 min away from the house. I don&#39;t want<br/>\n&gt; this to stop us from going out, because he loves to go to different<br/>\n&gt; places, but I&#39;m not sure what&#39;s the best way to help him deal with the<br/>\n&gt; trip home.<br/>\n&gt;<br/>\n&gt; 2. I try to let him play with pretty much anything I use, but there are<br/>\n&gt; times I do take stuff away for safety reasons. For example, if he reaches<br/>\n&gt; for my knife while we&#39;re eating, I move it away and give him something<br/>\n&gt; that&#39;s safe (cup, spoon, food). This sometimes works, but other times he<br/>\n&gt; gets upset, because he really wants the knife (or whatever else it was).<br/>\n&gt; How should I deal with this kind of situation?<br/>\n&gt;<br/>\n&gt; 3. The dangerous stuff from last question: what is really dangerous and<br/>\n&gt; what can I actually give him and show him how to use safely? We let him<br/>\n&gt; play with remote controlls and  our phones. If he&#39;s just looking and<br/>\n&gt; pushing buttons, I let him be, but take it away if he starts putting it in<br/>\n&gt; the mouth, say &#39;not for eating&#39; and give it back to him. Should I have a<br/>\n&gt; similar approach with knives and forks or is that a bad idea?<br/>\n&gt;<br/>\n&gt; I probably have more questions, but this is what I could come up with for<br/>\n&gt; now. I apologise for typos, I&#39;m wrighting this on my phone.<br/>\n&gt;<br/>\n&gt; Thanks in advance,<br/>\n&gt;<br/>\n&gt; Ivana<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"rules v principles Was the knife issue","postDate":"1322169365","msgId":47712,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGphbWM2bCs3ZW1oQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMjIxNTU4MDIuNzEwOTQuWWFob29NYWlsTmVvQHdlYjEyMDUwNi5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":47711,"nextInTopic":47714,"prevInTime":47711,"nextInTime":47713,"topicId":47706,"numMessagesInTopic":0,"msgSnippet":"I m pulling this out of another post to discuss the ideas of rules in particular. ... **************** Why see that as a rule though, and not rather apply","messageBody":"<div id=\"ygrps-yiv-37998898\">I&#39;m pulling this out of another post to discuss the ideas of rules in particular. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My advice would be to be firm on rules of safety and use the &#39;watermark rule&#39; for making Kyo&#39;s world a safe and fun place. In my house, the watermark rule represents moving all dangerous and or fragile items out of reach/sight/room depending on item.<br/>\n </span></blockquote>****************<br/>\n<br/>\nWhy see that as a &quot;rule&quot; though, and not rather apply common sense and thoughtfulness to each item? There&#39;s no need to think of it as some kind of rule, and no need to &quot;be firm&quot; about something that&#39;s going to start with exceptions and gain more as the child gets older. &quot;No...except&quot; is one of the worst aspects of rules, turning them into a quagmire of continual mixed messages. And where safety is concerned, that quagmire is where kids get hurt, regularly and predictably, by looking for ways to stretch, evade and break the rules. Make your kids&#39; world safe and fun Not because its some kind of rule, but because you can see the benefits of doing so in a happier child and less stressful time for yourself. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We moved to a farm when my youngest was 1yo so certain rules had to be in place.  No swinging on the horse&#39;s tail, no running in front of the bulldozer/tractor/plow, no swimming in the alligator infested pond...  For us, just making firm &quot;rules&quot; with the kids having a clear understanding seemed to work.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nI&#39;m glad you said &quot;seemed&quot; - yes, rules Seem to work When kids Obey them. But not all kids do, and that&#39;s the problem. I live in farm country and know there are kids who hurt farm animals, go places and do things they&#39;re &quot;not supposed to&quot; and get hurt or hurt other people. It&#39;s not rules which keep kids safe, its parental support. Without that, rules are just words and hope that luck is on your side, and you got a &quot;good kid&quot;: one who will obey. <br/>\n<br/>\nI didn&#39;t get the luxury of a &quot;good kid&quot; with Ray, so I had the chance to get a hard look at what rules do and don&#39;t do. They don&#39;t protect anyone. They don&#39;t parent your kids when your back is turned - and depending on the child, may set your kid up to do Exactly those things you&#39;d rather he didn&#39;t. They don&#39;t provide a sense of safety when you&#39;re &quot;firm&quot; about them because in order to be really, really &quot;firm&quot; (with a particularly curious and/or thoughtful child) you have to be so dogmatic that the rules become a power-trip - otherwise every rule is modified and excepted in response to good sense. So I learned to start from good sense and figure out how to work With my busy, inquisitive boy who wanted to touch - and often break - just about everything. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":274177100,"authorName":"Vickisue Gray","from":"Vickisue Gray &lt;vickisue_gray@...&gt;","profile":"vickisue_gray","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Unschooling infants/toddlers","postDate":"1322155802","msgId":47711,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjIxNTU4MDIuNzEwOTQuWWFob29NYWlsTmVvQHdlYjEyMDUwNi5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":47709,"nextInTopic":47712,"prevInTime":47710,"nextInTime":47712,"topicId":47706,"numMessagesInTopic":0,"msgSnippet":"Hi Ivana, My advice would be to be firm on rules of safety and use the watermark rule for making Kyo s world a safe and fun place. In my house, the watermark","messageBody":"<div id=\"ygrps-yiv-1597759787\">Hi Ivana,<br/>\n<br/>\nMy advice would be to be firm on rules of safety and use the &#39;watermark rule&#39; for making Kyo&#39;s world a safe and fun place. In my house, the watermark rule represents moving all dangerous and or fragile items out of reach/sight/room depending on item.  There&#39;s nothing wrong with using discretion on what items a small one has available.  An example of this is when I started having children, all lower kitchen cabinets were made child friendly.  That way if my daughter explored I didn&#39;t have to worry about it.  She had fun pulling out the pots and pans and tupperware.  Lots of happy memories watching her discover and play.  =)<br/>\n<br/>\n<br/>\nMy first born who is now 21yo, just moved into her first house that she and her boyfriend bought together.  Since they have friends who already have babies and small children and someday they plan on having their own, I had suggested that they just set up their house in a child friendly way right from the get go.  To me, this means storing all cleaning supplies, hazardous items in one place and out of reach of curious little ones.  Someplace easy to block or lock so when friends are over, you just don&#39;t need to worry about it.  Knives can be dangerous but there are also kid friendlier knives meaning more along the line of say a butter knife and even then, I&#39;d be watching/helping an 8 month old.<br/>\n<br/>\nAs for the car seat issue.   Maybe someone else will have an idea?  My first thought is maybe he needed a snack?  My children would get fussy if they went too long between fuel ups.  =)  I remember when my son was a toddler, he seemed to like to nibble every 20 minutes!  Or so it seemed, lol.  Even now, at age 14, if he goes too long between meals (thankfully he can go more then 20 minutes, haha) his temper seems to slide to the dark side.  I even prepare a snack for him for after his BJJ class as he is ravenous after working out and if I don&#39;t get something into him, his attitude slides.  He&#39;s aware of this and he is working on controlling it, but just having a protein shake or something helps.  <br/>\n<br/>\nMy only experience with a child acting up in the car was my son who would need a bucket for the ride to school as he only got car sick if he was going.  Funny how if I told him he only had to ride along so I could drop his sisters off, he wouldn&#39;t be car sick.  Needless to say, unschooling solved THAT issue. =)  <br/>\n<br/>\n<br/>\nI&#39;d have fun playing with this issue.  Like how my spouse played with ponies and carts or his old polo pony who was fine leaving the barn but no matter where you were or how far you were, would limp when heading in the direction home.  Turn around and the limp magically disappearred!  Head home...limp, limp...  silly pony with a great sense of direction!  <br/>\n<br/>\n<br/>\nThe fussiness could even be sunlight in his eyes.  I&#39;d be tempted to &#39;block&#39; his window view once just to see if it makes a difference.  Maybe he knows the sights of reaching home and doesn&#39;t want the outing to stop?  Maybe he needs a change?  Maybe switch the car seat to the other side of the vehicle then see what happens?  Experiment till you figure out what&#39;s triggering it and how to change it to a better experience.  My spouse bought us a used high top conversion van with a video player and TV then added a Nintendo 64 back in the day.  It made for peaceful trips.  Hang in there and maybe you will find a solution that will make for a more peaceful situation.   <br/>\n<br/>\n<br/>\nWe moved to a farm when my youngest was 1yo so certain rules had to be in place.  No swinging on the horse&#39;s tail, no running in front of the bulldozer/tractor/plow, no swimming in the alligator infested pond...  For us, just making firm &quot;rules&quot; with the kids having a clear understanding seemed to work.  We didn&#39;t have many rules, but they knew of the few and knew why.  They also knew that IF they wanted to &#39;swing on a horse&#39; to just get dad and he&#39;d help them figure out a way that both the horse and the child would have great fun together. The ponds were only off limits if dad wasn&#39;t around which was just fine with the kids because dad being there just made everything way more fun!  (Yea, I got pictures!! Happy memories.)<br/>\n<br/>\nHope this is of some help.<br/>\n<br/>\nPeace and laughter!<br/>\n<br/>\n<br/>\nVicki<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling infants/toddlers","postDate":"1322153008","msgId":47709,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGphbHM3Zys4bjYyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpha2g4cCtnYWlvQGVHcm91cHMuY29tPg=="},"prevInTopic":47708,"nextInTopic":47711,"prevInTime":47708,"nextInTime":47710,"topicId":47706,"numMessagesInTopic":0,"msgSnippet":"Babies cry. You are almost home. Smile and speak softly and reassuringly and get home safely. Babies shouldn t be playing with knives or anything else that","messageBody":"<div id=\"ygrps-yiv-2018924754\">Babies cry. You are almost home. Smile and speak softly and reassuringly and get home safely. <br/>\n<br/>\nBabies shouldn&#39;t be playing with knives or anything else that they can hurt themselves with. Smile and say it&#39;s not safe and move it away and move on.<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Ivana&quot; &lt;ivanica@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hello everyone,<br/>\n&gt; <br/>\n&gt; I&#39;ve been reading the list for a while, but I think this is my first post. I&#39;ve also read most of Sandra Dodd&#39;s website many times over, but I still have some questions.<br/>\n&gt; <br/>\n&gt; I have an 8 month old son Kyo whom I plan to unschool. We&#39;re already doing most of the things Attachment Parenting style, such as breastfeeding on demand, co-sleeping, babywearing, etc. Sandra&#39;s page said that there is more to it than that: if you want to unschool you need to provide a rich environment and let your baby explore. I try to do that too, but here are some questions.<br/>\n&gt; <br/>\n&gt; 1. Kyo hates spending time in his carseat. He&#39;s usually fine when we go somewhere, but gets cranky when coming back. It doesn&#39;t matter if he had a nap before we left to go home, he cries like it&#39;s the end of the world. It doesn&#39;t happen every time, but about one out of four trips. Sometimes my singing calms him down, but not always. It&#39;s usually the worst after we enter our neighborhood and are 5 min away from the house. I don&#39;t want this to stop us from going out, because he loves to go to different places, but I&#39;m not sure what&#39;s the best way to help him deal with the trip home.<br/>\n&gt; <br/>\n&gt; 2. I try to let him play with pretty much anything I use, but there are times I do take stuff away for safety reasons. For example, if he reaches for my knife while we&#39;re eating, I move it away and give him something that&#39;s safe (cup, spoon, food). This sometimes works, but other times he gets upset, because he really wants the knife (or whatever else it was). How should I deal with this kind of situation?<br/>\n&gt; <br/>\n&gt; 3. The dangerous stuff from last question: what is really dangerous and what can I actually give him and show him how to use safely? We let him play with remote controlls and  our phones. If he&#39;s just looking and pushing buttons, I let him be, but take it away if he starts putting it in the mouth, say &#39;not for eating&#39; and give it back to him. Should I have a similar approach with knives and forks or is that a bad idea? <br/>\n&gt; <br/>\n&gt; I probably have more questions, but this is what I could come up with for now. I apologise for typos, I&#39;m wrighting this on my phone.<br/>\n&gt; <br/>\n&gt; Thanks in advance,<br/>\n&gt; <br/>\n&gt; Ivana<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling infants/toddlers","postDate":"1322152557","msgId":47708,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGphbHJwZCtjYzQ1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpha2g4cCtnYWlvQGVHcm91cHMuY29tPg=="},"prevInTopic":47706,"nextInTopic":47709,"prevInTime":47707,"nextInTime":47709,"topicId":47706,"numMessagesInTopic":0,"msgSnippet":"... *************** It might help to return sooner - or later! Return before he s tired, I mean, or wait until he s so wiped out he sleeps all the way home. It","messageBody":"<div id=\"ygrps-yiv-195781242\">&quot;Ivana&quot; &lt;ivanica@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; 1. Kyo hates spending time in his carseat. He&#39;s usually fine when we go somewhere, but gets cranky when coming back.<br/>\n </span></blockquote>***************<br/>\n<br/>\nIt might help to return sooner - or later! Return before he&#39;s tired, I mean, or wait until he&#39;s so wiped out he sleeps all the way home. It could help to stop for something on the way and break up the trip. It could help to have a snack for him in the car, or some special toy which &quot;lives&quot; in the car to make the trip itself more appealing. It might also help to have something planned to do at home to make going home something to look forward to.<br/>\n<br/>\n Experiment, changing up whatever you can, but also realize it may just be his way of expressing fatigue and sadness that whatever fun you&#39;ve had is clearly over, no going back. It won&#39;t change his response, but it will help you relax into the inevitability to tears on the way home. <br/>\n<br/>\nFor awhile, when she was a toddler (don&#39;t recall the exact age) my daughter cried herself to sleep every night. After a few weeks of trying to figure out what was wrong and fix things, I relaxed about it - not a coldblooded shutting down but acceptance that this was how she was going to transition into sleep for now. Eventually, that stage passed. Eventually, your son will stop crying in the car on the way home. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;For example, if he reaches for my knife while we&#39;re eating, I move it away and give him something that&#39;s safe (cup, spoon, food). This sometimes works, but other times he gets upset, because he really wants the knife (or whatever else it was). How should I deal with this kind of situation?<br/>\n </span></blockquote>*******************<br/>\n<br/>\nThat seems like essentially the same issue as above - you can experiment with other ways to distract him, but do understand that it&#39;s okay for him just to be frustrated and upset. He&#39;s Just frustrated and upset, and those are perfectly normal feelings which everyone deals with sometimes. It won&#39;t help him for you to be upset because he is. It will help more to gently commiserate with the knowledge it won&#39;t &quot;help&quot; in terms of changing his mood - but it Will help for him to know that you care he feels bad, even if you can&#39;t make things better. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 3. The dangerous stuff from last question: what is really dangerous and what can I actually give him and show him how to use safely?<br/>\n </span></blockquote>*****************<br/>\n<br/>\nThat&#39;s such a big &quot;it depends&quot;! How curious is he and in what ways? How adept is he and how careful is he by nature? You could give him something like a knife and hold your hand over his, guiding and directing him, showing him how to use it... if he&#39;ll go for that. Some kids are perfectly happy with that sort of arrangement until the get the hang of whatever the object is and don&#39;t need your guidance any more. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; We let him play with remote controlls and  our phones. If he&#39;s just looking and pushing buttons, I let him be, but take it away if he starts putting it in the mouth, say &#39;not for eating&#39; and give it back to him.<br/>\n </span></blockquote>***************<br/>\n<br/>\nWHY is it &quot;not for eating&quot;? Are you afraid he&#39;ll get an electric shock or that he&#39;ll damage the electronics? I&#39;d tell him your concerns in simple language while also looking for ways for him to mouth things, since that&#39;s a big part of how babies learn. Maybe say &quot;woops! electricity and spit don&#39;t mix&quot; and take out the batteries. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Should I have a similar approach with knives and forks or is that a bad idea?<br/>\n </span></blockquote>*****************<br/>\n<br/>\n&quot;Not for eating&quot; seems like a really confusing thing to say about eating utensils, especially forks which he Sees you put in your mouth. So it&#39;s worthwhile to let him mouth some forks while you keep close watch. With a knife, I&#39;d say &quot;its sharp!&quot; and keep it away from his mouth for now, but if he&#39;s willing, guide his hands and help him cut things. In fact, give him his own non sharp knife so he can check it out and give him something soft to cut like a banana or some avocado or canned yams.<br/>\n<br/>\nMost of all, know that you may not need One solution so much as a kind of tool-box of options. Sometimes he may be fine with one solution and other times not - that&#39;s normal human behavior, people don&#39;t always need the exact same things from day to day. So have a few things to try And expect that sometimes you&#39;ll be left with an annoyed, unhappy child faced with the fact that there are, alas, real limits in life. Commiserate gently until he&#39;s ready to move on. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":432327730,"authorName":"Ivana","from":"&quot;Ivana&quot; &lt;ivanica@...&gt;","profile":"bibica_us","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Unschooling infants/toddlers","postDate":"1322109017","msgId":47706,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpha2g4cCtnYWlvQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":47708,"prevInTime":47705,"nextInTime":47707,"topicId":47706,"numMessagesInTopic":0,"msgSnippet":"Hello everyone, I ve been reading the list for a while, but I think this is my first post. I ve also read most of Sandra Dodd s website many times over, but I","messageBody":"<div id=\"ygrps-yiv-1668003006\">Hello everyone,<br/>\n<br/>\nI&#39;ve been reading the list for a while, but I think this is my first post. I&#39;ve also read most of Sandra Dodd&#39;s website many times over, but I still have some questions.<br/>\n<br/>\nI have an 8 month old son Kyo whom I plan to unschool. We&#39;re already doing most of the things Attachment Parenting style, such as breastfeeding on demand, co-sleeping, babywearing, etc. Sandra&#39;s page said that there is more to it than that: if you want to unschool you need to provide a rich environment and let your baby explore. I try to do that too, but here are some questions.<br/>\n<br/>\n1. Kyo hates spending time in his carseat. He&#39;s usually fine when we go somewhere, but gets cranky when coming back. It doesn&#39;t matter if he had a nap before we left to go home, he cries like it&#39;s the end of the world. It doesn&#39;t happen every time, but about one out of four trips. Sometimes my singing calms him down, but not always. It&#39;s usually the worst after we enter our neighborhood and are 5 min away from the house. I don&#39;t want this to stop us from going out, because he loves to go to different places, but I&#39;m not sure what&#39;s the best way to help him deal with the trip home.<br/>\n<br/>\n2. I try to let him play with pretty much anything I use, but there are times I do take stuff away for safety reasons. For example, if he reaches for my knife while we&#39;re eating, I move it away and give him something that&#39;s safe (cup, spoon, food). This sometimes works, but other times he gets upset, because he really wants the knife (or whatever else it was). How should I deal with this kind of situation?<br/>\n<br/>\n3. The dangerous stuff from last question: what is really dangerous and what can I actually give him and show him how to use safely? We let him play with remote controlls and  our phones. If he&#39;s just looking and pushing buttons, I let him be, but take it away if he starts putting it in the mouth, say &#39;not for eating&#39; and give it back to him. Should I have a similar approach with knives and forks or is that a bad idea? <br/>\n<br/>\nI probably have more questions, but this is what I could come up with for now. I apologise for typos, I&#39;m wrighting this on my phone.<br/>\n<br/>\nThanks in advance,<br/>\n<br/>\nIvana</div>","specialLinks":[]}],"prevTopicId":47738,"nextTopicId":47740}}