{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":205425680,"authorName":"robinstempo@aol.com","from":"robinstempo@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] don&#39;t know what to do (Single Parent)","postDate":"1145329050","msgId":12242,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxNS4zNDVhMjA2LjMxNzVhZjlhQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":12241,"nextInTime":12243,"topicId":12242,"numMessagesInTopic":0,"msgSnippet":"Have you gotten any ideas that will help you out yet?  I know you have asked on several lists. As a single, working parent it may be hard enough to find the","messageBody":"<div id=\"ygrps-yiv-500392636\">Have you gotten any ideas that will help you out yet?  I know you have asked <br/>\non several lists. As a single, working parent it may be hard enough to find <br/>\nthe time and energy to cook dinner, much less read and respond to e-mail. <br/>\nPerhaps if you let us know what town you are in, someone will have a resource for <br/>\nyou.<br/>\n  <br/>\nMy kids are teens now, and I have been pretty much a single parent for the <br/>\nlast six or so years.  I&#39;m hearing a familiar frustration in your writing, that <br/>\nI felt when I was trying to do everything alone.  It is hard to do, and the <br/>\nguilt can be crippling.  I felt very committed to unschooling, and since the <br/>\nkids had never spent much time in school, I did not want to force them into it, <br/>\njust because I was suddenly their single, sole provider.  They were smart and <br/>\nclever and understanding, and I assumed we could do it all.  Whatever that <br/>\nwas...  <br/>\nNow, that we look back, we all can see that there are some things we would do <br/>\ndifferently. I often ran out of time, money, or energy to provide my kids <br/>\nwith the guidance and encouragement they needed. There was a lot of love, and <br/>\nhugs, and laughter, and tears, but very few of the presents, supplies, <br/>\nexcursions, workshops and classes that they were used to, or that our old friends were <br/>\ndoing. I was struggling to keep food on the table.  Feeling angry, depressed <br/>\nand defiant about our situation and yet, determined to stick to my ideals.  The <br/>\nkids became resentful about how hard life had become.  We often talk on these <br/>\nlists about keeping our kids with us as we are working/learning through <br/>\ntraumas, and healing together as a family.  But as a single stressed out mom, <br/>\nhelping all of us recover from some harrowing circumstances, I needed lots of <br/>\nguidance and support myself.  Beyond Unschooling Support, I found some relief and <br/>\nnew friends by going to various weekly support meetings for domestic <br/>\nviolence/divorce/single parenting/healthy cooking,  etc.  They usually offered some kind <br/>\nof child care, and my kids met other kids from similar circumstances.  <br/>\nLooking back, they might have enjoyed a year or two in school, had I relaxed <br/>\nmy standards a little. I just didn&#39;t think I could stand it.  According to <br/>\ntheir most recent discussion, I did not realize how much they were bored and <br/>\nclimbing the walls while I was at work, or in therapy, or at the doctor.  One has <br/>\nbecome very self sufficient, the other is still waiting for someone to <br/>\nentertain him.  <br/>\nI&#39;m trying to say to take care of yourself, heal and be happy, and share your <br/>\nlight and wisdom with your sensitive son.  You&#39;ll both feel better.  <br/>\nI&#39;m off to work now.  A job I enjoy, but still overworked and underpaid.<br/>\nWishing you well,<br/>\nBird</div>","specialLinks":[]}],"prevTopicId":12210,"nextTopicId":12160}}