{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":78282269,"authorName":"soggyboysmom","from":"&quot;soggyboysmom&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Digest Number 466","postDate":"1120836465","msgId":5698,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRhbTYxaCt0MGl1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE1MjI0LTQyQ0U4NUYyLTQ2OUBzdG9yZWZ1bGwtMzE1Mi5iYXkud2VidHYubmV0Pg=="},"prevInTopic":5696,"nextInTopic":0,"prevInTime":5697,"nextInTime":5699,"topicId":5696,"numMessagesInTopic":0,"msgSnippet":"... Not to argue or anything, but just for fodder while you re chewing this over (all comments below are meant that way): if your kids go out and get a game","messageBody":"<div id=\"ygrps-yiv-1378835953\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, michele-nappi@w... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Deb and Kelly<br/>\n&gt; Thank you for your replies. I still feel it is a lie on some level <br/>\n&gt;to take what they are learning and make it fit state regulations. I <br/>\n&gt;know my<br/>\n&gt; sons do too on some level. So does my family. I worked on changing <br/>\n&gt;my<br/>\n&gt; mind and for the most part I am satisfied they are learning and I <br/>\n&gt;talk<br/>\n&gt; to them to get them to understand what they are learning. <br/>\n </span></blockquote>Not to argue or anything, but just for fodder while you&#39;re chewing <br/>\nthis over (all comments below are meant that way): if your kids go <br/>\nout and get a game guide for a video game, and read through it and <br/>\nuse the information to get through a level or two (or 10), isn&#39;t <br/>\nthat &quot;reading comprehension&quot; in it&#39;s practical, *real* use? Why <br/>\nwould you feel that you are lying in saying they were exercising <br/>\nreading comprehension? Because they didn&#39;t use graded readers for a <br/>\nset time each day and answer 10 questions?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My 17 year old has learned a lot this past<br/>\n&gt; year or so from the job he has. I think it is within himself that <br/>\n&gt;he<br/>\n&gt; feels stupid and ugly. It has to do with public schooling and how <br/>\n&gt;he was<br/>\n&gt; treated there but more about how he clings to this idea at this <br/>\n&gt;point,<br/>\n&gt; because he is too afraid to face facts and move on with his life. <br/>\n&gt;We<br/>\n&gt; talk about that together, also.<br/>\n </span></blockquote>What &#39;facts&#39; is he clinging to? What do you see as the next thing he <br/>\nneeds to do to &quot;move on with his life&quot;? What if he simply continues <br/>\nin his current job for another 5 years?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;My 20 year old just went back to<br/>\n&gt; highschool for her diploma. She is not liking it. She is working <br/>\n&gt;through<br/>\n&gt; the idea that &quot;everyone has to have a highschool diploma.&quot; She <br/>\n&gt;cried<br/>\n&gt; once again because she couldnt walk down the isle with the other <br/>\n&gt;people<br/>\n&gt; during this years graduation and didnt go to the prom. All this <br/>\n&gt;pain<br/>\n&gt; from believing that this is the only way to &quot;graduate.&quot; <br/>\n </span></blockquote>Okay, will print her up a lovely diploma with her name in <br/>\ncalligraphy and make a speech about all the lovely things about her <br/>\nand send her and boyfriend out for a night on the town, maybe with <br/>\nanother couple they know. I WENT to public high school for 4 yrs and <br/>\ndidn&#39;t go to the prom. I WENT to a 4 yr college and attended a grand <br/>\ntotal of one formal (what a nightmare! I only went because a <br/>\nfriend&#39;s bf wanted a frat bro of his to go so I said OK - BIG <br/>\nmistake! bleh!). Why does she need to&#39;go back to high school&#39;? She <br/>\ncan take a GED (if that would be ok to her) without doing <br/>\nany &quot;classes&quot; - or she could take a prep class or just work through <br/>\na prep book (available at most bookstores). And, as an &#39;adult <br/>\nlearner&#39;/&#39;non-traditional&#39; student, she could probably get admitted <br/>\nto a local community college right now, doing something she is at <br/>\nleast interested in. The key maybe is for her to find something she <br/>\nlikes - does she like flower arranging? star gazing? skateboarding? <br/>\ngraphic design? cooking?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Her boyfriend didnt graduate from highschool, either. <br/>\n&gt;He is employed just recently. He wasnt ready before that. Now is <br/>\n&gt;the &quot;right time&quot; and he is happy to be working. <br/>\n </span></blockquote>Great for him! And there are lots of people with MAs, MBAs, and PhDs <br/>\nwho are also having a hard time finding work.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;My 22 year old graduated from highschool, was so traumatized<br/>\n&gt; going to college that he quit. He is now a branch manager of a <br/>\n&gt;bank.<br/>\n&gt; They have classes he can take to keep up to date on bank business. <br/>\n&gt;They<br/>\n&gt; still count college as a goal when raises/money is concerned. <br/>\n </span></blockquote>Ah - but now, if he has found something he is enjoying (don&#39;t know <br/>\nif he is enjoying it or just liking the paycheck), slowly taking <br/>\nclasses at a local (2 or 4 yr) college while working with an eye <br/>\ntoward an AS/BS in accounting and finance (or something similar) to <br/>\nstart - make sure he checks into getting credits for life <br/>\nexperience - might be something he could do now - and it is possible <br/>\nthe bank would help with tuition and stuff (many businesses will <br/>\nhelp with such stuff if you are improving your value to them). At 18 <br/>\nhe probably wasn&#39;t ready - especially if it was an away from home, <br/>\ndon&#39;t know what I want to do, total immersion experience. Now, 4 yrs <br/>\nlater, he may well finally be ready to take it on as an adult <br/>\nlearner - lots of places (2 and 4 yr colleges) have degree programs <br/>\ndesigned for adults with jobs.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I once looked in to getting degrees through a private accredited<br/>\n&gt; alternative school. These degrees would not be accepted by any <br/>\n&gt;other school. <br/>\n </span></blockquote>Why would you care if another *school* accepted the degree? Wouldn&#39;t <br/>\nyou already have what you wanted (the learning, the degree, etc)? In <br/>\nmost cases, you can test into/out of things - DH tested out of <br/>\nenough credits (entering college as a freshman a decade after high <br/>\nschool) to be a full sophomore after 1 semester. So, you could in <br/>\ntheory earn credit by examination for the things you had previously <br/>\nstudied - it just wouldn&#39;t be a 1 for 1 transfer.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I know President Clinton staff members were &quot;busted&quot; at some<br/>\n&gt; point for having degrees from unaccredited colleges. <br/>\n </span></blockquote>I suppose that is an issue IF they try to pass them off as <br/>\naccredited (when a job specifically spells out that it is a <br/>\nrequirement) OR if they are Internet diploma-mills (&quot;send us cash, <br/>\nwe&#39;ll say you&#39;re anything you want us to say&quot;). <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;The situation gets<br/>\n&gt; funky when there is money involved.<br/>\n&gt; I guess it just depends on what one does with the degree. <br/>\n </span></blockquote>It&#39;s only &quot;funky&quot; if you are trying to pass yourself off as <br/>\nsomething you aren&#39;t. The guy who was my boss, who is now two levels <br/>\nup from there, well into upper management, doesn&#39;t have a college <br/>\ndegree yet he is a manager of several managers reporting directly to <br/>\nthe pres and vp of this high tech company. But he never said he had <br/>\na degree to start with. He did have many year of experience and a <br/>\ngood track record - and once you get past about 25 yrs old, no one <br/>\nreally cares about your high school transcript.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Thanks. Michele<br/>\n&gt; <br/>\n </span></blockquote>--Deb</div>","specialLinks":[]},{"userId":12116257,"authorName":"michele-nappi@webtv.net","from":"michele-nappi@...","profile":"whitelight_2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Digest Number 466","postDate":"1120830962","msgId":5696,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1MjI0LTQyQ0U4NUYyLTQ2OUBzdG9yZWZ1bGwtMzE1Mi5iYXkud2VidHYubmV0Pg==","inReplyToHeader":"dW5zY2hvb2xpbmdiYXNpY3NAeWFob29ncm91cHMuY29tJ3MgbWVzc2FnZSBvZiA4IEp1bCAyMDA1CTExOjM4OjU0IC0wMDAw"},"prevInTopic":0,"nextInTopic":5698,"prevInTime":5695,"nextInTime":5697,"topicId":5696,"numMessagesInTopic":0,"msgSnippet":"Deb and Kelly Thank you for your replies. I still feel it is a lie on some level to take what they are learning and make it fit state regulations. I know my ","messageBody":"<div id=\"ygrps-yiv-1756395951\">Deb and Kelly<br/>\nThank you for your replies. I still feel it is a lie on some level to<br/>\ntake what they are learning and make it fit state regulations. I know my<br/>\nsons do too on some level. So does my family. I worked on changing my<br/>\nmind and for the most part I am satisfied they are learning and I talk<br/>\nto them to get them to understand what they are learning. I don&#39;t mean<br/>\nto sound defensive or to instigate anything by what I am saying. It is<br/>\nmore another layer of me working though the old thoughts that were put<br/>\nin my head all these years. My 17 year old has learned a lot this past<br/>\nyear or so from the job he has. I think it is within himself that he<br/>\nfeels stupid and ugly. It has to do with public schooling and how he was<br/>\ntreated there but more about how he clings to this idea at this point,<br/>\nbecause he is too afraid to face facts and move on with his life. We<br/>\ntalk about that together, also. My 20 year old just went back to<br/>\nhighschool for her diploma. She is not liking it. She is working through<br/>\nthe idea that &quot;everyone has to have a highschool diploma.&quot; She cried<br/>\nonce again because she couldnt walk down the isle with the other people<br/>\nduring this years graduation and didnt go to the prom. All this pain<br/>\nfrom believing that this is the only way to &quot;graduate.&quot; Her boyfriend<br/>\ndidnt graduate from highschool, either. He is employed just recently. He<br/>\nwasnt ready before that. Now is the &quot;right time&quot; and he is happy to be<br/>\nworking. My 22 year old graduated from highschool, was so traumatized<br/>\ngoing to college that he quit. He is now a branch manager of a bank.<br/>\nThey have classes he can take to keep up to date on bank business. They<br/>\nstill count college as a goal when raises/money is concerned. <br/>\nI once looked in to getting degrees through a private accredited<br/>\nalternative school. These degrees would not be accepted by any other<br/>\nschool. I know President Clinton staff members were &quot;busted&quot; at some<br/>\npoint for having degrees from unaccredited colleges. The situation gets<br/>\nfunky when there is money involved.<br/>\nI guess it just depends on what one does with the degree. As I said, I<br/>\nam working through thoughts and I dont mean to offend anyone. This is<br/>\nthe only way I can think of to get some feedback on these thoughts.<br/>\nThanks. Michele<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":5692,"nextTopicId":5699}}