{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":139339753,"authorName":"Trina","from":"&quot;Trina&quot; &lt;trina@...&gt;","profile":"trinarobeli","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Introduction, and response to &quot;bad superior attitude&quot;","postDate":"1089240603","msgId":1515,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTEwMWM0NjQ3NCRjMmI5MTU3MCQ5YjgwM2Y5NEB0cmluYT4=","inReplyToHeader":"PDEwODkyMjM0MjkuOTE2ODguNzIxNzAubTE4QHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":1514,"nextInTime":1516,"topicId":1515,"numMessagesInTopic":0,"msgSnippet":"Wow, I guess I d better slip my intro in quick cause I ve been lurking for the last few days, and feel like I want to respond to what Robyn is experiencing","messageBody":"<div id=\"ygrps-yiv-1711643814\">Wow, I guess I&#39;d better slip my intro in quick cause I&#39;ve been lurking<br/>\nfor the last few days, and feel like I want to respond to what Robyn is<br/>\nexperiencing with Jayn and her &quot;friend&quot; . . . <br/>\n<br/>\nMy name is Trina, DH Rob and DS Elijah, 1YO; we have a lot of interest<br/>\nin unschooling and gentle living, and a lot to learn, which is why I&#39;m<br/>\nreally glad to be on this list!  Right now DS&#39;s field of study is dirt,<br/>\nmud, dogs, rocks, flowers and weeds.  I love how mellow and centered he<br/>\ngets just being outside, and how occupied he keeps himself.  <br/>\n<br/>\nI am relatively new to the world of online discussions and am astonished<br/>\nand really excited at the level of community that seems to come together<br/>\nthis way.  We&#39;re living in a small land-based community in northern New<br/>\nMexico, and love our community partners, who welcome and honor our<br/>\n&quot;unconventional&quot; parenting style.  My main beef is that we&#39;re the only<br/>\nfamily, and that I (at 33) am the youngest except for DS! LOL  we&#39;re<br/>\nopen to this shifting, in a good and organic way.  <br/>\n<br/>\nSo what came up for me while reading your sharing Robyn . . . When I was<br/>\nfinishing fourth grade, our parents (of 9 children) announced that they<br/>\nwere taking us out of school.  I loved being trusted with my own<br/>\nlearning process, and so enjoyed being able to follow my own passions as<br/>\nthey grew and shifted and branched out.  YUMMM!<br/>\n<br/>\nOnly difficult thing was, there were few others in our area who were<br/>\nhome-schooling as well.  There was one girl my age who I hung out with<br/>\nconstantly.  I didn&#39;t really like her, but for some reason had a hard<br/>\ntime pulling myself out of the &quot;tractor beam&quot; of being with her.  She<br/>\neffectively dominated the space between us and always decided what we<br/>\nwould do and how we would do it.  I really felt like a nothing.  I know<br/>\nmy mom occasionally tried to discourage our &quot;friendship&quot; but I<br/>\nstubbornly insisted on continuing this numbing experience.  My mom<br/>\nrecently remarked on how mean she was to me -- why did I continue to<br/>\nhang out with her?  <br/>\n<br/>\nI still can&#39;t answer that question.  The interesting thing to me was,<br/>\nthough, what changed for me, that helped me move on:<br/>\n<br/>\nA few years into this experience, my Mom started seeking counseling,<br/>\ndoing her own inner work, trying with huge effort to contradict the<br/>\nheavy inner and outer messages that said that she didn&#39;t matter.  She<br/>\nstarted exploring her creative side, writing, painting, and asking the<br/>\nquestion &quot;what do *I* want?&quot;.  <br/>\n<br/>\nThis work that Mom did was a small earthquake that shook up just about<br/>\neverything in our lives.  It was around this time that I made some<br/>\ndecisions in my life, which essentially spelled the end of me hanging<br/>\nout with this girl.<br/>\n<br/>\nI don&#39;t know what it is like for you, Robyn, and my story may be way way<br/>\noff topic for what you experience, but it reminded me again how potent<br/>\nmy mama&#39;s example of self-care was, and is, for me.  Thanks for<br/>\nreminding me.<br/>\n<br/>\nBlessings . . . <br/>\nTrina<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.714 / Virus Database: 470 - Release Date: 7/2/2004</div>","specialLinks":[]}],"prevTopicId":1505,"nextTopicId":1520}}