{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":212934673,"authorName":"Michelle Leifur Reid","from":"&quot;Michelle Leifur Reid&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] What have your kids been into lately?","postDate":"1160403742","msgId":18015,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjEwMDkwNzIycTMxMGY4NWI5Z2Q0M2YwODNjMjRkOTE0M2FAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGVmcTRiZitmbG85QGVHcm91cHMuY29tPg==","referencesHeader":"PGVmcTRiZitmbG85QGVHcm91cHMuY29tPg=="},"prevInTopic":18000,"nextInTopic":0,"prevInTime":18014,"nextInTime":18016,"topicId":17705,"numMessagesInTopic":0,"msgSnippet":"I finally have a few minutes that I can think about what the kids are doing (rather than going and doing with them :) ) Emily is all things Japanese right","messageBody":"<div id=\"ygrps-yiv-593992381\">I finally have a few minutes that I can think about what the kids are<br/>\ndoing (rather than going and doing with them :) )<br/>\n<br/>\nEmily is &quot;all things Japanese&quot; right now.  Language, culture,<br/>\nliterature, movies, books, art, origami, dress, tea, etc etc etc.<br/>\nThere is a row of origami cranes hanging from the kitchen threshold<br/>\nand the phone is currently answered with &quot;moshi moshi&quot; (sp?)  I love<br/>\nto see her strewing her own interests around in front of me!  :-D<br/>\n<br/>\nMary Elayne is doing great in gymnastics.  Really loving it.  Trying<br/>\nto perfect her handstand and headstand so she can go for the next<br/>\nlevel.  She is also taking ballroom dance classes, although she is<br/>\nhaving problems with actually dancing *with* someone.  The teachers<br/>\nare great though and have let her come to the studio anytime they<br/>\ndont&#39; have a class going on (individual lessons are fine) so that she<br/>\ncan get used to being there and perhaps she may actually dance with<br/>\nthe female instructor some day soon.<br/>\n<br/>\nKeon is mastering the new Star Wars Lego game.  It&#39;s his main focus<br/>\nright now.  Although yesterday he happily spent a few hours at the<br/>\nbookstore with his father (not the one I work at) which was odd as<br/>\nusually he is very much the &quot;hunt it, shoot it, drag it home) kind of<br/>\nshopper.<br/>\n<br/>\nWe&#39;ve had a delightful visit from one of our annual unschooling<br/>\nfamilies who rents a beach house for the month of September and had<br/>\nmany pleasant visits with them.  I sometimes wish they lived here.<br/>\nWe&#39;ve been to the beach and to the Naval Aviation Museum.  Lots of fun<br/>\nat both.  We *finally* had an opporunity to walk through the hands on<br/>\ndisplay &quot;for educational purposes&quot; and while the kids couldn&#39;t do as<br/>\nmuch as they would have liked and were bored silly by the power point<br/>\ndisplay we have great hopes that we can now have longer access to the<br/>\nhands on area since we proved that our kids are not a bunch of<br/>\nruffians.  Oh, that&#39;s something else they got to do.  The kids were<br/>\nable to fly in the flight simulators that the pilot students use in<br/>\nflight school.  Very fun and Mary Elayne did the best landing ever!<br/>\nThe boys thought it was great fun to &quot;crash&quot; a mulit-million dollar<br/>\nairplane, but Mary Elayne&#39;s goal was perfection.  She had to do<br/>\neverything just right.  She was very serious the whole time and really<br/>\nenjoyed it.<br/>\n<br/>\nOK, would love to chat some more about my wonderful kids and their<br/>\never expanding worlds, but work calls.<br/>\n<br/>\nMichelle</div>","specialLinks":[]},{"userId":145571280,"authorName":"Cory and Amy Nelson","from":"Cory and Amy Nelson &lt;acnelson@...&gt;","profile":"amcanelson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] What have your kids been into lately?","postDate":"1160353698","msgId":18000,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM3ODgzOUU1LTU5RDYtNDc0Ri05RkEzLUI2MkY5M0I5RTU1MEBpdy5uZXQ+","inReplyToHeader":"PGVmcTRiZitmbG85QGVHcm91cHMuY29tPg==","referencesHeader":"PGVmcTRiZitmbG85QGVHcm91cHMuY29tPg=="},"prevInTopic":17757,"nextInTopic":18015,"prevInTime":17999,"nextInTime":18001,"topicId":17705,"numMessagesInTopic":0,"msgSnippet":"I m so far behind in emails that I don t even know if this is being discussed anymore. ;-) Accalia (7) has started a new session of dance at the studio where ","messageBody":"<div id=\"ygrps-yiv-1081183426\">I&#39;m so far behind in emails that I don&#39;t even know if this is being  <br/>\ndiscussed anymore. ;-)<br/>\n<br/>\nAccalia (7) has started a new session of dance at the studio where  <br/>\nshe&#39;s been dancing since age 4. She&#39;s so excited about learning a new  <br/>\nroutine for the recital next May. She is, however, a little  <br/>\ndisappointed that they won&#39;t be using their tap shoes. Lately she&#39;s  <br/>\nalso been fascinated by anything to do with Chinese culture - pandas,  <br/>\nthe Great Wall and architecture right now. We didn&#39;t realize the  <br/>\nHarvest Moon Festival was coming up this past Thursday, otherwise we  <br/>\nwould prepared for that, especially making or buying the Harvest Moon  <br/>\ncakes. We are planning to celebrate the Chinese New Year, though.  <br/>\nShe&#39;s also been playing a lot of computer games lately (goes in waves  <br/>\nwith that). One of her favorites is www.dressupgames.com<br/>\n<br/>\nCole (4) has recently become very interested in computer games as  <br/>\nwell and has been playing a Putt Putt game much of the time ever  <br/>\nsince we picked one up at a garage sale last Friday. His favorite  <br/>\ntoys include his Spiderman action figures and Imaginext castle set.  <br/>\nIf he can do something with his hands - playing in the dirt or sand,  <br/>\nplaying with playdough, mixing concoctions with food and liquids,  <br/>\netc. - then he&#39;s perfectly content.<br/>\n<br/>\nElla (11 months) is so close to walking and therefore spends as much  <br/>\ntime as possible on her two feet walking around furniture or people.  <br/>\nShe&#39;s also perfecting the skill of opening and closing anything -  <br/>\ndoors, books, cabinets, etc. She&#39;s a big fan of dancing around in the  <br/>\nliving room or kitchen, too, and loves to help me unload the dishwasher.<br/>\n<br/>\nAmy<br/>\nMama to Accalia (6/14/99), Cole (9/03/02) and Ella (10/29/05)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://thissideofsomewhere.com/\">http://thissideofsomewhere.com/</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":282257979,"authorName":"Wildflower Car","from":"&quot;Wildflower Car&quot; &lt;unschoolfool@...&gt;","profile":"red_olive5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] What have your kids been into lately?","postDate":"1159835521","msgId":17757,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTctRjREQTc3QzNCQzcyNzFCRUI1Qjg5RUNBMUMwQHBoeC5nYmw+"},"prevInTopic":17708,"nextInTopic":18000,"prevInTime":17756,"nextInTime":17758,"topicId":17705,"numMessagesInTopic":0,"msgSnippet":"My kids have been really into music lately. We found a guy who just moved here and in getting his doctorate in music. His wife is from India and is a chef,","messageBody":"<div id=\"ygrps-yiv-1023021355\">My kids have been really into music lately.<br/>\n<br/>\nWe found a guy who just moved here and in getting his doctorate in music. <br/>\nHis wife is from India and is a chef, they have twin 2 year old boys. So <br/>\nanyway, he agreed to give us unstructured lessons. We bring our guitars, one <br/>\nelectric and one acoustic, our violin, and a few small things like a finger <br/>\npiano and a whistle harmonica thing.<br/>\n<br/>\nHe taught us some basics and lets us just do whatever while guiding us when <br/>\nwe ask. He also has a piano and a drum set that we have all played on.<br/>\n<br/>\nHis wife and children have started to know us better so we have just sat <br/>\naround and talked and played. It has been great. I have learned so much <br/>\nabout her culture and even tasted some of her wonderful meals. He is from <br/>\nOklahoma and has never been exposed to homeschooling, unschooling or the <br/>\nlikes. But he has started asking myself and my girls all kinds of questions. <br/>\nIt has been a nice barter of information! He also is planning on becoming <br/>\nself employed with his music and is very interested in how my husband became <br/>\nself employed by following his passion, but that is just what he wants to <br/>\ndo. They have different passions, but the same big picture in mind.<br/>\n<br/>\nWildflower<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;From: &quot;Joanne&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:billyandjoanne@...\">billyandjoanne@...</a>&gt;<br/>\n&gt;Reply-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n&gt;To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n&gt;Subject: [unschoolingbasics] What have your kids been into lately?<br/>\n&gt;Date: Mon, 02 Oct 2006 04:25:19 -0000<br/>\n&gt;<br/>\n&gt;We had a thread like this a few months ago and it was nice reading<br/>\n&gt;about all the cool stuff our kids were interested in and what they<br/>\n&gt;were doing because of those interests. Feel free to add on to this<br/>\n&gt;and give us the latest on what your unschoolers have been up to. :-)<br/>\n&gt;<br/>\n&gt;My youngest had a birthday last month and just turned 8. She<br/>\n&gt;passionate about astronomy and all things space related. She enjoys<br/>\n&gt;reading and watching videos about early astronomers and the solar<br/>\n&gt;system. We bought a telescope for Christmas but ended up returning<br/>\n&gt;it because it just wasn&#39;t as good as we thought. We&#39;re in the market<br/>\n&gt;for another one. She&#39;s looking forward to that. :-) We took a two<br/>\n&gt;day trip to the Kennedy Space Center and she had a blast!! (pun<br/>\n&gt;intended. lol) She got to meet an astronaut (John Blaha) and talk to<br/>\n&gt;him for a while.<br/>\n&gt;<br/>\n&gt;I just posted about my middle daughter and how her love for horses<br/>\n&gt;and led her in many directions and in the path of many people.<br/>\n&gt;She&#39;s also involved with Storytelling and has joined (for the second<br/>\n&gt;time) a storytelling workshop. It ends in January, with her telling<br/>\n&gt;her story at the Storytelling Festival. :-) My son participated last<br/>\n&gt;time also but opted out this time around.<br/>\n&gt;<br/>\n&gt;He&#39;s heavily into Yu-Gi-Oh and attends a duel every Saturday. He&#39;s<br/>\n&gt;met a lot of cool kids through it and has a pretty nice collection<br/>\n&gt;of cards. He even showed his younger sister how to battle. :-)<br/>\n&gt;He&#39;s also VERY into auto racing and my husband & he have been to<br/>\n&gt;Daytona several times. We have a local short track nearby and he<br/>\n&gt;enjoys going there to watch them practice.<br/>\n&gt;<br/>\n&gt;Tell us about your kids..... :-)<br/>\n&gt;<br/>\n&gt;~ Joanne ~<br/>\n&gt;Mom to Jacqueline (8), Shawna (11) & Cimion (13)<br/>\n&gt;Adopted into our hearts October 2003<br/>\n&gt;************************************<br/>\n&gt;Unschooling Voices ~ Add Your Voice<br/>\n&gt;www.foreverparents.com/UnschoolingVoices.html<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>_________________________________________________________________<br/>\nTry the new Live Search today!  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://imagine-windowslive.com/minisites/searchlaunch/?locale=en-us&FORM=WLMTAG\">http://imagine-windowslive.com/minisites/searchlaunch/?locale=en-us&FORM=WLMTAG</a></div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"Melissa &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] What have your kids been into lately?","postDate":"1159765955","msgId":17708,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMwRTY4OEI1LTg5NjgtNDJGMy1CMjlFLTMyMjVGMDIzNEY5REBjb3gubmV0Pg==","inReplyToHeader":"PGVmcTRiZitmbG85QGVHcm91cHMuY29tPg==","referencesHeader":"PGVmcTRiZitmbG85QGVHcm91cHMuY29tPg=="},"prevInTopic":17705,"nextInTopic":17757,"prevInTime":17707,"nextInTime":17709,"topicId":17705,"numMessagesInTopic":0,"msgSnippet":"Good Idea Joanne! All the kids just spent the weekend camping with their dad, I was at home with Avari. They love to camp at the wildlife reserve, it s a","messageBody":"<div id=\"ygrps-yiv-1711398108\">Good Idea Joanne! All the kids just spent the weekend camping with  <br/>\ntheir dad, I was at home with Avari. They love to camp at the  <br/>\nwildlife reserve, it&#39;s a totally different atmosphere than most other  <br/>\ncampsites, very quiet and respectful. Josh is planning two more  <br/>\ncampouts this month, the girls want one of their own. SO we&#39;re  <br/>\nworking on.<br/>\n<br/>\nLet&#39;s see, Josh is still very much the gamer, nearly every spare  <br/>\nsecond is spent playing video games (Tony Hawk or Animal Crossing),  <br/>\nthose that aren&#39;t are spent planning how to make more money to buy  <br/>\nthe Wii. He has saved nearly $230, so he&#39;s $20 shy of the expected  <br/>\ncost at release, and he&#39;s figuring out more ways to do that. He&#39;s  <br/>\nalso trying to sell scout popcorn so that he has enough to pay for  <br/>\ncamp next summer as well as put a sizeable downpayment on the scout  <br/>\nexchange to Australia which should happen when he hits 14 (min age  <br/>\nfor the exchange). He&#39;s finally gotten to the trumpet lessons that  <br/>\nare fun, which I&#39;m thankful for because he was about to quit. He just  <br/>\nbuilt a bridge in the backyard and is now designing his own catapults  <br/>\nso that the next time it rains they can have a mudball war over the  <br/>\ncreek. He&#39;s also training for his first overnight hike, it&#39;s a 14  <br/>\nmile hike and he&#39;s the grubmaster as well, which is just insanity but  <br/>\nwe&#39;re trying to figure it out. He&#39;s also lately been really into  <br/>\nlaunching his rockets, he&#39;s had them for years and just the past week  <br/>\nhas spent every evening out blasting one after another (and has only  <br/>\nlost one!) Now he&#39;s figured out that he wants to put his name and  <br/>\nnumber on so maybe he can make some new friends when they get lost.<br/>\n<br/>\nBreanna just shaved her head completely over to about an inch and  <br/>\nwants it dyed green. She spends most of her time drawing pictures of  <br/>\nGarfield characters and Scooby Doo, which she watches a lot. In her  <br/>\nspare time she scratches out designs in our copious dirtfarm. She  <br/>\nchanges clothes alot and looks in the mirror, since she&#39;s nonverbal I  <br/>\nthink that&#39;s her way of saying that she has a closet full of nothing  <br/>\nto wear. I think next week I&#39;m going to take her out to dinner and  <br/>\nmaybe to Hot Topic, her favorite store.<br/>\n<br/>\nEmily just found a halfpipe for sale and she&#39;s trying to figure out  <br/>\nhow she can get her paws on $350. We can afford maybe $100 to help  <br/>\nher right now. I told her if she wanted we could build one, and so  <br/>\nshe spent most of the day she had at home, online looking for designs  <br/>\nthat lend themselves to affordability and ease of build. She&#39;s riding  <br/>\nher bike a lot and trying to figure out how to do the tricks she saw  <br/>\non espn xtreme sports.  She&#39;s really into animal crossing as well,  <br/>\nher and Rachel spend a good deal of time hanging out and trying to  <br/>\nfind fun &#39;stuff&#39; to do.<br/>\n<br/>\nRachel is busy designing everyone&#39;s costumes for halloween, She wants  <br/>\nDan to be a squirrel so she&#39;s spending hours every day out scouring  <br/>\nthe neighborhood for acorns. Her and Emily have designated one house  <br/>\n&quot;acorn city&quot; because they  have several oak trees and they have about  <br/>\nseven gallon size ziplock bags full of them. She&#39;s riding her bike a  <br/>\nlot, and has figured out how to do several tricks on her scooter. She  <br/>\nloves to draw, and has books full of pictures and stories that she&#39;s  <br/>\nillustrated. She&#39;s figured out how to read, and so she&#39;s reading all  <br/>\nof Emily&#39;s books that are laying around.<br/>\n<br/>\nSam is so amazing to me...he&#39;s a natural born story teller, and he&#39;s  <br/>\ngot a million of them. They all follow a very mythological bent, &quot;The  <br/>\nGolden _____&quot;  He lowers his voice dramatically and softens his &quot;R&#39;s&quot;  <br/>\nso that he sounds like the narrator on some of the movie&#39;s he loves.  <br/>\nHe&#39;s watching Jason and the Argonauts, as well as Clash of the  <br/>\nTitans. He&#39;s trying to figure out what kind of training he needs to  <br/>\nbe a true knight. He&#39;s really trying to cook, and often I&#39;ll walk  <br/>\ninto the kitchen to find him mixing various ingredients together,  <br/>\nalways consisting of at least ketchup, a raw egg, and some vinegar.  <br/>\nSometimes rice flour, but mostly corn meal. There are some  <br/>\nvariations. He&#39;s figured out that making up stuff isn&#39;t working for  <br/>\nhim right now, so he&#39;s asking my help to follow recipe cards. I&#39;m  <br/>\nhoping he&#39;ll keep his love of adventure around for cooking...his  <br/>\ndad&#39;s a good cook!<br/>\n<br/>\nDan&#39;s interests are pretty basic, he&#39;s very sporty, loves to throw  <br/>\nand kick balls. He mostly follows Sam around and tries to get him to  <br/>\nwrestle. Sam was really not into that until I mentioned that it might  <br/>\nbe pretty good knight training. Now he&#39;s stopping Dan, telling him to  <br/>\nlook at their positions and see if they&#39;re &#39;ausentic&#39;. He&#39;s loving  <br/>\nhelping me cook, and Sam is the head chef while Dan is his minion..I  <br/>\nmean, helper.<br/>\n<br/>\nAvari is a rockin lil gal, she loves music and will toddle over to  <br/>\nthe counter and bang until we turn the radio on. She has all kinds of  <br/>\ninstruments, maraca&#39;s are her favorite, but pots and spoons do in a  <br/>\npinch. She&#39;s figured out how to go down the stairs, so she now has  <br/>\nfree reign of the house. IF she&#39;s not in the mood, she&#39;ll stand there  <br/>\nand scream til someone carries her up or down. Not bad for ten months  <br/>\nold. ;-)<br/>\nMelissa<br/>\nMom to Josh (11), Breanna (9), Emily (7), Rachel (6), Sam (5), Dan  <br/>\n(3), and Avari Rose<br/>\n<br/>\nshare our lives at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://360.yahoo.com/multimomma\">http://360.yahoo.com/multimomma</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Oct 1, 2006, at 11:25 PM, Joanne wrote:<br/>\n<br/>\n&gt; We had a thread like this a few months ago and it was nice reading<br/>\n&gt; about all the cool stuff our kids were interested in and what they<br/>\n&gt; were doing because of those interests. Feel free to add on to this<br/>\n&gt; and give us the latest on what your unschoolers have been up to. :-)<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":185550057,"authorName":"Joanne","from":"&quot;Joanne&quot; &lt;billyandjoanne@...&gt;","profile":"billyandjoanne","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"What have your kids been into lately?","postDate":"1159763119","msgId":17705,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVmcTRiZitmbG85QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":17708,"prevInTime":17704,"nextInTime":17706,"topicId":17705,"numMessagesInTopic":0,"msgSnippet":"We had a thread like this a few months ago and it was nice reading about all the cool stuff our kids were interested in and what they were doing because of","messageBody":"<div id=\"ygrps-yiv-1460749310\">We had a thread like this a few months ago and it was nice reading <br/>\nabout all the cool stuff our kids were interested in and what they <br/>\nwere doing because of those interests. Feel free to add on to this <br/>\nand give us the latest on what your unschoolers have been up to. :-)<br/>\n<br/>\nMy youngest had a birthday last month and just turned 8. She <br/>\npassionate about astronomy and all things space related. She enjoys <br/>\nreading and watching videos about early astronomers and the solar <br/>\nsystem. We bought a telescope for Christmas but ended up returning <br/>\nit because it just wasn&#39;t as good as we thought. We&#39;re in the market <br/>\nfor another one. She&#39;s looking forward to that. :-) We took a two <br/>\nday trip to the Kennedy Space Center and she had a blast!! (pun <br/>\nintended. lol) She got to meet an astronaut (John Blaha) and talk to <br/>\nhim for a while. <br/>\n<br/>\nI just posted about my middle daughter and how her love for horses <br/>\nand led her in many directions and in the path of many people. <br/>\nShe&#39;s also involved with Storytelling and has joined (for the second <br/>\ntime) a storytelling workshop. It ends in January, with her telling <br/>\nher story at the Storytelling Festival. :-) My son participated last <br/>\ntime also but opted out this time around. <br/>\n<br/>\nHe&#39;s heavily into Yu-Gi-Oh and attends a duel every Saturday. He&#39;s <br/>\nmet a lot of cool kids through it and has a pretty nice collection <br/>\nof cards. He even showed his younger sister how to battle. :-) <br/>\nHe&#39;s also VERY into auto racing and my husband & he have been to <br/>\nDaytona several times. We have a local short track nearby and he <br/>\nenjoys going there to watch them practice.  <br/>\n<br/>\nTell us about your kids..... :-)<br/>\n<br/>\n~ Joanne ~<br/>\nMom to Jacqueline (8), Shawna (11) & Cimion (13)<br/>\nAdopted into our hearts October 2003<br/>\n************************************<br/>\nUnschooling Voices ~ Add Your Voice<br/>\nwww.foreverparents.com/UnschoolingVoices.html</div>","specialLinks":[]}],"prevTopicId":18011,"nextTopicId":17972}}