{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":173212844,"authorName":"Michelle","from":"Michelle &lt;mamatoethan1@...&gt;","profile":"mamatoethan1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Thanks for input","postDate":"1088366712","msgId":1203,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNjI3MjAwNTEyLjk1MTg2LnFtYWlsQHdlYjUzMzA4Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGNibjgxaStqbG5oQGVHcm91cHMuY29tPg=="},"prevInTopic":1202,"nextInTopic":0,"prevInTime":1202,"nextInTime":1204,"topicId":1199,"numMessagesInTopic":0,"msgSnippet":"When we got our new, not expensive eating area table, we moved the old one into the garage, that has not had a car in it for years.  I also moved the old","messageBody":"<div id=\"ygrps-yiv-1776716170\">When we got our new, not expensive eating area table, we moved the old one into the garage, that has not had a car in it for years.  I also moved the old dresser from my sons room out there, and put down those large alphabet foam squares under it all.  Now my son has his own craft area.  The dresser is full of everything he wants to work with, with the paint on the top, as I still like to help with those.  This way, he can take out and leave out whatever he wants to work on, for as long as he wants to work on it.  The foam cleans very easy, and is nice to walk on.  It is a little hot there right now, with the summer, but a fan makes it nice.  I am planning hanging fishing line or something like that from the ceiling, so we can hang up all his paintings to dry, and have a place to display them all.  We are constantly in the garage, as it is the only way to the back yard, where the pool and trampoline is.  This way he gets to have his area to play and create, and we still have a place<br/>\n for dad and I to sit and eat dinner.  Son does not like to sit at the table with us, so he is in with the TV  for most meals!!  <br/>\n <br/>\nMichelle<br/>\n<br/>\n<br/>\nRen Allen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt; wrote:<br/>\n<br/>\nPerhaps you have an extra bedroom, or dining area that could contain <br/>\nmost of his art/toy stuff, so it doesn&#39;t end up on stairs as often?<br/>\n<br/>\n<br/>\nRen<br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! Mail - 50x more storage than other providers!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Thanks for input","postDate":"1088365426","msgId":1202,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNibjgxaStqbG5oQGVHcm91cHMuY29tPg=="},"prevInTopic":1199,"nextInTopic":1203,"prevInTime":1201,"nextInTime":1203,"topicId":1199,"numMessagesInTopic":0,"msgSnippet":"I think part of the attachment I have to not slipping and falling on stuff and keeping the floor cleared is that not doing so literally caused injuries. I ","messageBody":"<div id=\"ygrps-yiv-425437536\">&quot;I think part of the<br/>\nattachment I have to not slipping and falling on stuff and keeping<br/>\nthe floor cleared is that not doing so literally caused injuries. I<br/>\nalso have a 20 year history of being a construction worker and just<br/>\nbeing conscious of the danger of an unsafe enviornment. These are<br/>\njust my own personal issues I will need to work through.&quot;<br/>\n<br/>\nAh, those personal issues we all have eh?:)<br/>\n<br/>\nI was thinking, as I read your post, that maybe part of the shift, <br/>\nmight be in how you arrange your home. Maybe there are some things <br/>\nthat could be changed, in order to make it more kid friendly as far <br/>\nas safety?<br/>\nI recently realized that I still had a lot of &quot;shoulds&quot; in my head <br/>\nin regards to my home. Who says a living room has to contain <br/>\nfurniture? Who says I can&#39;t have an acrobat bar hanging from the <br/>\nbeam in the middle of the room in a very small house? :)<br/>\nI&#39;ve limited myself in terms of how a house should be arranged, and <br/>\nwe&#39;re slowly changing that.<br/>\nMy friends think we have a pretty darn kid-friendly house, but I was <br/>\nstill thinking too much of visitors and not realizing the <br/>\npossibilities.<br/>\nSo we&#39;re going with big pillows and beanbags in the living <br/>\nroom...maybe one loveseat for visitors that truly can&#39;t sit on the <br/>\nfloor pillows.  I want to have a mini-trampoline stashed somewhere <br/>\nand a bar hanging for the kids to swing on.<br/>\nI am planning to paint the wall by our teensy dining area, so that <br/>\nit has a chalk board surface as part of a mural, and framed kid art <br/>\nall over.<br/>\nRather than get upset about my nice furniture getting ruined, we&#39;ll <br/>\njust get rid of it! Instead of fussing at the kids about painting on <br/>\nthe walls, we&#39;ll make art walls! <br/>\nSometimes the little shifts in thinking can make a big difference.<br/>\nPerhaps you have an extra bedroom, or dining area that could contain <br/>\nmost of his art/toy stuff, so it doesn&#39;t end up on stairs as often?<br/>\nI don&#39;t know your situation of course, but I bet there are some <br/>\npossible changes that could be made, in order to avoid a lot of the <br/>\nmess stress.<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":157863786,"authorName":"Kay Alina","from":"&quot;Kay Alina&quot; &lt;angelsguard@...&gt;","profile":"angelsguardalways","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Thanks for input","postDate":"1088362011","msgId":1199,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNibjRtcitiYW1vQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":1202,"prevInTime":1198,"nextInTime":1200,"topicId":1199,"numMessagesInTopic":0,"msgSnippet":"I just want to thank everything for the input in regard to their feelings, opinions and ideas on cleaning up or not.  I will try on some of what was suggested","messageBody":"<div id=\"ygrps-yiv-146555219\">I just want to thank everything for the input in regard to their <br/>\nfeelings, opinions and ideas on cleaning up or not.  I will try on <br/>\nsome of what was suggested and see if it fits.  Many of the <br/>\ndecisions I have made in my life have come from a place of what if <br/>\nthis was the last day I had on this planet so I can put those <br/>\nglasses on fairly easily.  I was diagnosed with a terminal cancer in <br/>\n1991 and the wake up call helped.  I tried to take a look at the <br/>\nwhy&#39;s of my behavior.  I realize part of the attachment to order is <br/>\na safety issue.  We have four floors and three flights of stairs.  A <br/>\ncouple of weeks ago after I was out the night before at a conference <br/>\nand the room was not in it&#39;s normal order because his dad didn&#39;t put <br/>\neverything back Alexander tripped over a cushion and got a goose egg <br/>\non his forehead when it hit the rocker.  He has also fallen down the <br/>\nstairs, tripped over something and chipped his tooth on a metal <br/>\nrailing and done a few other headers.  I know kids get injuries.  It <br/>\nis never an easy thing for me to deal with.  I think part of that <br/>\ncomes from early childhood when I was responsible for my younger <br/>\nbrother and he was gashing himself regularly with blood squirts and <br/>\nstitches.  Accidents do freak me out.  Alexander has had regular <br/>\nchiropractic treatment because of it.  I think part of the <br/>\nattachment I have to not slipping and falling on stuff and keeping <br/>\nthe floor cleared is that not doing so literally caused injuries.  I <br/>\nalso have a 20 year history of being a construction worker and just <br/>\nbeing conscious of the danger of an unsafe enviornment.  These are <br/>\njust my own personal issues I will need to work through.  I am <br/>\nkeeping an open mind and I want to look at things from a different <br/>\nperspective.  I will probably come by this whole thing slowly.  I do <br/>\nnot currently have any unschooling support regarding friends so I am <br/>\ndependent upon boards like this.  I read that there is an OC group <br/>\nand I would be interested in attending that park day.  Thanks again <br/>\nto all who shared.  <br/>\nKay</div>","specialLinks":[]}],"prevTopicId":1130,"nextTopicId":1207}}