{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":19,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Possible new unschoolers","postDate":"1129896351","msgId":7140,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDN0E0NEVFQTVBNTgwOC1DOC0xMUNCQE1CTEstTTI1LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PGRocnNvYSs2aHF2QGVHcm91cHMuY29tPg==","referencesHeader":"PGRocnNvYSs2aHF2QGVHcm91cHMuY29tPg=="},"prevInTopic":6952,"nextInTopic":0,"prevInTime":7139,"nextInTime":7141,"topicId":6934,"numMessagesInTopic":0,"msgSnippet":"Lindsay, I apologize for just now getting back to you. I was in transit to the conference when your post came through. I m SO sorry for your loss. I can t","messageBody":"<div id=\"ygrps-yiv-56992303\">Lindsay,<br/>\n <br/>\nI apologize for just now getting back to you. I was in transit to the conference when your post came through. <br/>\n <br/>\nI&#39;m SO sorry for your loss. I can&#39;t imagine such a tragedy.<br/>\n <br/>\nWhat state are you in? We could probably put you in direct touch with someone in your area<br/>\n <br/>\nI&#39;m glad the children have a guardian who is so concerned for their mental/emotional health.<br/>\n <br/>\nPlease let us know what we can do to help you with your situation.<br/>\n <br/>\nMuch love and luck on this journey! And feel free to call me directly if you have any questions or just need to talk.<br/>\n <br/>\n~Kelly<br/>\n803 776 4849<br/>\n <br/>\n <br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n <br/>\n <br/>\n-----Original Message-----<br/>\nFrom: lindsayborrer &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lindsayborrer@...\">lindsayborrer@...</a>&gt;<br/>\n<br/>\nHello, I just joined, and wanted to introduce myself and possibly get <br/>\nsome advice.<br/>\n<br/>\nMy name is Lindsay, and I am 25 and married for a year to my beloved, <br/>\nDan. Six months ago my family had a tragedy, and everything changed. <br/>\nMy husband&#39;s brother and sister and their respective spouses had gone <br/>\non a weekend away when they were killed by a drunk driver. Between <br/>\nthe two families, there are 7 children, from age 4 to 13. My husband <br/>\nwas listed as back-up guardian in both sets of wills (they are a very <br/>\nclose family, and the primary guardians were all killed.)<br/>\n<br/>\nAs a result, we are now parenting 7 children very, very suddenly. The <br/>\nlegal aspects have just been completed, and we are now legal <br/>\nguardians for all the children. We have also just bought a new house <br/>\nwhere we will all fit.<br/>\n<br/>\nThe kids are grieving, but luckily they have one another. But they <br/>\nare in new schools, and several of the kids are refusing to go. They <br/>\nare afraid to be away from Dan and me and  each other <br/>\n(understandably!) because they are afraid something will happen to <br/>\nmore people they love.<br/>\n<br/>\nMy husband and I are lawyers at the very beginning of our careers, <br/>\nbut suddenly taking care of these kids seems more important. With the <br/>\nlife insurance money from both families, it is extremely doable that <br/>\neither (or even both of us) could just not work and be home with the <br/>\nkids. If either of us do that, it will change forever the kind of <br/>\ncareers we will have.<br/>\n<br/>\nBut a few years ago I read Summerhill and Holt, and I think that <br/>\nunschooling would be the perfect thing for the kids. They need time <br/>\nand love. Other relatives think they should just be in school, and <br/>\nthat we should use the money to hire help. A couple have suggested <br/>\nthat the kids could be sent to boarding school. But they have lost so <br/>\nmuch already.<br/>\n<br/>\nWhat do you think? Would school give them more normalcy?<br/>\n<br/>\nBy the way, the kids are Annie, 10, Trey, 7, Lilly, 4, and Sophie, <br/>\n13, Emma, 11, Becca, 9, and Phin, 7.<br/>\n<br/>\nLindsay and Dan<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":213809267,"authorName":"jlh44music","from":"&quot;jlh44music&quot; &lt;jlh44music@...&gt;","profile":"jlh44music","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Possible new unschoolers","postDate":"1128467667","msgId":6952,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRodjJjaitodTAwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRocnNvYSs2aHF2QGVHcm91cHMuY29tPg=="},"prevInTopic":6951,"nextInTopic":7140,"prevInTime":6951,"nextInTime":6953,"topicId":6934,"numMessagesInTopic":0,"msgSnippet":"What wonderful responses you ve been getting to your post! I wanted to share this site for you (nhen.org, they list support groups in every state), in case you","messageBody":"<div id=\"ygrps-yiv-337781309\">What wonderful responses you&#39;ve been getting to your post!<br/>\n<br/>\nI wanted to share this site for you (nhen.org, they list support <br/>\ngroups in every state), in case you want to try to find local <br/>\nhomeschooling support groups (there are often a lot of unschoolers <br/>\nwho belong to these groups as well) and also if you post what state <br/>\nyou&#39;re in here there might be some members who can help you get <br/>\nstarted (depending too on what your state&#39;s homeschooling <br/>\nrequirements are - in some states you don&#39;t have to do anything, <br/>\nothers, like mine (MA) are more particular, but fortunately we have <br/>\nsome great sites for guidance and I also belong to a MA yahoo group <br/>\nthat has been very helpful in getting started as far as what&#39;s <br/>\nrequired by my state).   You might want to do a search on yahoo <br/>\ngroups (&quot;unschooling&quot; and your state name, or if you just put <br/>\nunschooling, you can look through what you come up with to see if <br/>\nthere&#39;s any in your particular state).<br/>\n<br/>\nPlease keep us posted.  I&#39;m sending hugs and love in your direction.<br/>\nJann</div>","specialLinks":[]},{"userId":202172558,"authorName":"Elisa Allender","from":"Elisa Allender &lt;eallender@...&gt;","profile":"eally","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Possible new unschoolers","postDate":"1128467345","msgId":6951,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzNDMwQjkxLjQwOTAxMDZAYmVsbHNvdXRoLm5ldD4=","inReplyToHeader":"PGRodWRlOCtmbzEwQGVHcm91cHMuY29tPg==","referencesHeader":"PGRodWRlOCtmbzEwQGVHcm91cHMuY29tPg=="},"prevInTopic":6950,"nextInTopic":6952,"prevInTime":6950,"nextInTime":6952,"topicId":6934,"numMessagesInTopic":0,"msgSnippet":"You know something.....all this talk about careers and quitting careers to stay home with kids made me think of a conversation I had with one of my teenage","messageBody":"<div id=\"ygrps-yiv-370410097\">You know something.....all this talk about careers and quitting careers <br/>\nto stay home with kids made me think of a conversation I had with one of <br/>\nmy teenage daughters recently.  She just graduated this past year and is <br/>\nin college now, but she doesn&#39;t drive yet.  She is extremely nervous and <br/>\nhates driving.  I have made her drive more and more lately (with me of <br/>\ncourse since she doesnt&#39; have her license yet!) hoping that her <br/>\nconfidence will build and she will start driving herself to things.  She <br/>\nattends college, coaches cheerleading at the community ballpark, has a <br/>\nweekly babysitting job and weekly cleaning job and I cart her back and <br/>\nforth to all this stuff.  My husband and I are getting ready to leave <br/>\ntown for 3 weeks at the end of this month to go on a trip cross country <br/>\nto celebrate our anniversary (we are taking our 9-yr-old with us and he <br/>\nis so excited!)  Anyway, I have been preparing my dd for this separation <br/>\nbecause she is going to have to drive herself around town (unless she <br/>\nsweet talks grandma and grandpa to cart her everywhere....LOL)  She made <br/>\nthe comment recently that she is going to miss me and our talks when I <br/>\nam out of town and she doesn&#39;t want to drive by herself back and <br/>\nforth....she LIKES me driving her around because we talk and cut up and <br/>\nhang out.  I felt so honored! <br/>\n<br/>\nI was a single mom early on in my twenties and I went to college, worked <br/>\nfull time and raised 3 small children by myself for 5 years before I <br/>\nremarried.  Once I remarried, my husband and I decided to have a child <br/>\nof our own and when he was born a year later I wanted to quit work and <br/>\nstay home with our son.  I ended up working until he was two and by then <br/>\nmy other children were in middle school.  I worked in dialysis at the <br/>\nhospital and loved my job but I was always taking off work to chaperone <br/>\nfield trips and do things with the kids.  My boss told me one day I <br/>\nneeded to make a decision whether I was going to have a career there or <br/>\nbe a mom.....so I quit!  Without even discussing it with my husband.  He <br/>\nabout freaked when I told him. <br/>\n<br/>\nWell that was 7 years ago now and I praise God every day that I have <br/>\nbeen able to stay home with the kids.  Since my daughter has started <br/>\ncollege this year she has asked me recently if I have any desire to go <br/>\nback to work at the hospital one day and I told her heck no!  I was in <br/>\nthe medical field for 10 years and loved every bit of it but now that I <br/>\nam out of it and have expanded my horizons and lived life I have so many <br/>\nother interests I would pursue before ever going back to work in that <br/>\nfield.  Sort of like unschooling!  I was allowed to spread my wings and <br/>\nfly the last 10 years along with my children and I have learned so much <br/>\nand experienced so many things.  It has been an awesome time of growth!  <br/>\nThanks for listening..........<br/>\nElisa</div>","specialLinks":[]},{"userId":189611316,"authorName":"huntmom1996","from":"&quot;huntmom1996&quot; &lt;jechunt@...&gt;","profile":"huntmom1996","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Possible new unschoolers","postDate":"1128459872","msgId":6950,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRodXFwMCtuMTN0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRocnNvYSs2aHF2QGVHcm91cHMuY29tPg=="},"prevInTopic":6949,"nextInTopic":6951,"prevInTime":6949,"nextInTime":6951,"topicId":6934,"numMessagesInTopic":0,"msgSnippet":"Thank God those children have you two.  It is a huge leap of faith, but I have to think that to model trust in their learning can only help the children regain","messageBody":"<div id=\"ygrps-yiv-1508092587\">Thank God those children have you two.  It is a huge leap of faith, <br/>\nbut I have to think that to model trust in their learning can only <br/>\nhelp the children regain some of teh trust in the universe that they <br/>\nmust have lost.<br/>\n<br/>\nSchool won&#39;t help them bond, build trust in you and themselves, or <br/>\nheal their pain.  But maybe you can.  Stay home, watch good movies, <br/>\nplay games and make some gentle unschooling friends.<br/>\n<br/>\nAlso, others may be able to speak more to this (and check out <br/>\nsandradood.com on unschooling school <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/schoolchoice\">http://sandradodd.com/schoolchoice</a> ).  Basically, what I have heard <br/>\npeople say is that you may have school in your life, but it is just <br/>\nsome *thing* in your life~not *the* thing that will bring normalcy to <br/>\nyou lives.  I really liked a book called _The Intentional Family_ by <br/>\nWilliam Doherty.   Here&#39;s a link  to amazon:  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/gp/product/038073205X/002-8263217-2710409?\">http://www.amazon.com/gp/product/038073205X/002-8263217-2710409?</a><br/>\nv=glance&n=283155&n=507846&s=books&v=glance<br/>\n<br/>\nThis book is a user friendly book that describes rituals you can use <br/>\nat home (candles at dinner or going around the table saying favorite <br/>\nparts of the day) pretty easily that create community feeling.  I <br/>\nhave to say, tho, that I haven&#39;t looked at it in a few years and it <br/>\nmay be very &quot;schooly&quot; as I was a different person then (but we still <br/>\ndo a lot of the rituals).<br/>\n<br/>\nSome of the children may choose school, and some may stay home.  You <br/>\nsound so respectful of them already, you are on the right track <br/>\nalready no matter what you choose.<br/>\n<br/>\nAs for the money, just because they are all home doesn&#39;t mean you may <br/>\nnot still use some of it for help.  :)<br/>\n<br/>\nUnschooling/homeschooling is something that people (relatives) <br/>\nfrequently have objections to, or even gentle concerns about. <br/>\n<br/>\nUnfortunately, as &quot;instant&quot; parents, you guys haven&#39;t already lived <br/>\nthrough everyone having an opinion about your babies; clothes, <br/>\nnursery colors, names, how you are carrying your babies, binkies, <br/>\nbreast feeding, sleeping, carrying, crying, consoling/not consoling, <br/>\nreading, tv, gun toys, natural foods, additives, detergent types, <br/>\ntime outs, etc, to name a few things my family has expressed an <br/>\nopinion about LOL.<br/>\n<br/>\nBest wishes and much admiration and love for you and those children.<br/>\n<br/>\nPeace~Jessica</div>","specialLinks":[]},{"userId":129294861,"authorName":"christy_imnotred","from":"&quot;christy_imnotred&quot; &lt;christy_imnotred@...&gt;","profile":"christy_imnotred","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Possible new unschoolers","postDate":"1128446216","msgId":6949,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRodWRlOCtmbzEwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRocnNvYSs2aHF2QGVHcm91cHMuY29tPg=="},"prevInTopic":6948,"nextInTopic":6950,"prevInTime":6948,"nextInTime":6950,"topicId":6934,"numMessagesInTopic":0,"msgSnippet":"Oh, bless you!  Thank you for taking these children in and investigating unschooling.  If you or your husband are willing to take a year off and just be with","messageBody":"<div id=\"ygrps-yiv-545777523\">Oh, bless you!  Thank you for taking these children in and <br/>\ninvestigating unschooling.  If you or your husband are willing to <br/>\ntake a year off and just be with the kids, I think it would make a <br/>\nworld of difference in their healing process.  After that year, you <br/>\ncan all discuss, as a family, if they want to stay home or if they <br/>\nwant to go to school.  I can&#39;t imagine how putting a child that has <br/>\njust lost both parents into school could be at all helpful.  How can <br/>\nthey possible concentrate when their world has been torn apart?  By <br/>\nmaking it for a year to begin with, you don&#39;t have to project into <br/>\nthe future and worry about careers etc.  Just do what you need to <br/>\nright now, the future will be there later to worry about.<br/>\n<br/>\nI have a PhD in science and spent many years building a successful <br/>\ncareer.  When my son was born, I was just going to stay home with him <br/>\nfor a year.  He is six now and I don&#39;t plan on ever going back to <br/>\nwork full-time.  Being with him means so much more than any career <br/>\never could.  But, I have found some fun and creative ways to still be <br/>\ninvolved in science (and make some money).<br/>\n<br/>\nI wish you all the best.  You are doing an amazing thing!<br/>\n<br/>\nChristy</div>","specialLinks":[]},{"userId":180916515,"authorName":"liannemargaret","from":"&quot;liannemargaret&quot; &lt;liannemargaret@...&gt;","profile":"liannemargaret","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Possible new unschoolers","postDate":"1128445746","msgId":6948,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRodWN2aStvaWQxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRocnNvYSs2aHF2QGVHcm91cHMuY29tPg=="},"prevInTopic":6946,"nextInTopic":6949,"prevInTime":6947,"nextInTime":6949,"topicId":6934,"numMessagesInTopic":0,"msgSnippet":"Is it possible for one or both of you to have a home-based practise? Even if you both have to work out of the home, can there be some flexibility that allows","messageBody":"<div id=\"ygrps-yiv-1077935288\">Is it possible for one or both of you to have a home-based practise?<br/>\n<br/>\nEven if you both have to work out of the home, can there be some<br/>\nflexibility that allows tag teaming child care between parents and a<br/>\nhired person, at least until the oldest / older 2 are old enough to<br/>\nhelp out, possibly for a small wage?<br/>\n<br/>\nI&#39;m going to another country for a one year program, and am the<br/>\nprimary (only, except for 3 days every 2 weeks) caregiver of my 6 yr<br/>\nold now.  Initially, I thought I would have to leave my son with<br/>\nextended family, or a close friend.  This was unacceptable to us both.  <br/>\n<br/>\nThen I went at it from the other end...  what are our needs?  Then the<br/>\nway to make it happen seems clearer, and an easier jump.  I have<br/>\narranged for a young teen peer of my son to be a live in nanny, for<br/>\nroom & board + small monthly allowance.  It&#39;s a great opportunity for<br/>\nher to experience another culture with security, and a perfect<br/>\nsolution for us.<br/>\n<br/>\nI hope your family comes to a solution without  any more pain.<br/>\n<br/>\nLianne <br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;lindsayborrer&quot;<br/>\n&lt;lindsayborrer@y...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt; Hello, I just joined, and wanted to introduce myself and possibly get <br/>\n&gt; some advice.<br/>\n&gt; <br/>\n&gt; My name is Lindsay, and I am 25 and married for a year to my beloved, <br/>\n&gt; Dan. Six months ago my family had a tragedy, and everything changed. <br/>\n&gt; My husband&#39;s brother and sister and their respective spouses had gone <br/>\n&gt; on a weekend away when they were killed by a drunk driver. Between <br/>\n&gt; the two families, there are 7 children, from age 4 to 13. My husband <br/>\n&gt; was listed as back-up guardian in both sets of wills (they are a very <br/>\n&gt; close family, and the primary guardians were all killed.)<br/>\n&gt; <br/>\n&gt; As a result, we are now parenting 7 children very, very suddenly. The <br/>\n&gt; legal aspects have just been completed, and we are now legal <br/>\n&gt; guardians for all the children. We have also just bought a new house <br/>\n&gt; where we will all fit.<br/>\n&gt; <br/>\n&gt; The kids are grieving, but luckily they have one another. But they <br/>\n&gt; are in new schools, and several of the kids are refusing to go. They <br/>\n&gt; are afraid to be away from Dan and me and  each other <br/>\n&gt; (understandably!) because they are afraid something will happen to <br/>\n&gt; more people they love.<br/>\n&gt; <br/>\n&gt; My husband and I are lawyers at the very beginning of our careers, <br/>\n&gt; but suddenly taking care of these kids seems more important. With the <br/>\n&gt; life insurance money from both families, it is extremely doable that <br/>\n&gt; either (or even both of us) could just not work and be home with the <br/>\n&gt; kids. If either of us do that, it will change forever the kind of <br/>\n&gt; careers we will have.<br/>\n&gt; <br/>\n&gt; But a few years ago I read Summerhill and Holt, and I think that <br/>\n&gt; unschooling would be the perfect thing for the kids. They need time <br/>\n&gt; and love. Other relatives think they should just be in school, and <br/>\n&gt; that we should use the money to hire help. A couple have suggested <br/>\n&gt; that the kids could be sent to boarding school. But they have lost so <br/>\n&gt; much already.<br/>\n&gt; <br/>\n&gt; What do you think? Would school give them more normalcy?<br/>\n&gt; <br/>\n&gt; By the way, the kids are Annie, 10, Trey, 7, Lilly, 4, and Sophie, <br/>\n&gt; 13, Emma, 11, Becca, 9, and Phin, 7.<br/>\n&gt; <br/>\n&gt; Lindsay and Dan </span></blockquote></div>","specialLinks":[]},{"userId":196864475,"authorName":"Janis Tan","from":"Janis Tan &lt;janistan@...&gt;","profile":"whitedesertrose2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Possible new unschoolers","postDate":"1128440920","msgId":6946,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU0M2M1NDcxMDUxMDA0MDg0OHM1ZDU2Y2ExYmk1Nzg1NGM0NDcxNjA3MzI2QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGRocnNvYSs2aHF2QGVHcm91cHMuY29tPg==","referencesHeader":"PGRocnNvYSs2aHF2QGVHcm91cHMuY29tPg=="},"prevInTopic":6945,"nextInTopic":6948,"prevInTime":6945,"nextInTime":6947,"topicId":6934,"numMessagesInTopic":0,"msgSnippet":"Hello Lindsay and Dan, even though I am no seasoned unschooler, I feel compelled to respond because your post so touched me. I feel terribly sorry for you and","messageBody":"<div id=\"ygrps-yiv-1912598357\">Hello Lindsay and Dan,<br/>\n<br/>\neven though I am no seasoned unschooler, I feel compelled to respond because<br/>\nyour post so touched me. I feel terribly sorry for you and your dh&#39;s loss,<br/>\nas well as the children&#39;s loss, it is so tragic! On the other hand, I feel<br/>\nhappy and relieved for the children for they have wonderful guardians who<br/>\nare so willing to consider their true needs! I think they are very lucky and<br/>\nwould like to tell you how touched it made me to read the words you wrote.<br/>\n<br/>\nYou asked abt school and normalcy. I don&#39;t see how going to school will make<br/>\nthings or them &quot;normal&quot;- imagine them seeing parents of their classmates<br/>\npicking them up from sch, attending activities, eating foods from home, etc<br/>\netc. Their state now is far from &quot;normalcy&quot;, goodness, they just lost their<br/>\nparents! It may take years for them to work out their grief. I agree with<br/>\nwhat all the others have said, they need a lot of space to grief, think<br/>\nthings through, and be in a space of love and safety. Thank goodness it is<br/>\npossible for this to happen!<br/>\n<br/>\nIn the meantime, I will really like to recommend the book &quot;Hold on to your<br/>\nKids&quot;- even tho it is geared towards parents, I think everyone shd read it.<br/>\nIt will lead to an understanding why the &quot;normal&quot; way our society function,<br/>\nor treat children, is actually heading us to problems. It may also show you<br/>\n(or rather your relatives) why it is so crucial now for the children to be<br/>\nable to have your love and guidance, instead of being thrown off to school.<br/>\n<br/>\nYou seem to have an open heart, and this will lead you and the children<br/>\nwell! Your post actually gave me much food for thought, and much hope,<br/>\nbecause I see a caring soul who understands the truly important things in<br/>\nlife, and this inspires me, so I thank you!<br/>\n<br/>\nYou did not say which state you are in, maybe if you do there are<br/>\nunschoolers near you who can give you some support. It may also be good for<br/>\nthe kids to know/meet other children who do not go to school, and do not<br/>\nneed to go. Explore the idea of unschooling with them and see how they feel<br/>\nabout it.<br/>\nFind support for yourself too, I am sure you will need it some time down the<br/>\nroad.<br/>\n<br/>\nAll the best to you and your new family!!<br/>\n<br/>\nWarmly,<br/>\nJanis in AZ<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 10/3/05, lindsayborrer &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lindsayborrer@...\">lindsayborrer@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hello, I just joined, and wanted to introduce myself and possibly get<br/>\n&gt; some advice.<br/>\n&gt;<br/>\n&gt; My name is Lindsay, and I am 25 and married for a year to my beloved,<br/>\n&gt; Dan. Six months ago my family had a tragedy, and everything changed.<br/>\n&gt; My husband&#39;s brother and sister and their respective spouses had gone<br/>\n&gt; on a weekend away when they were killed by a drunk driver. Between<br/>\n&gt; the two families, there are 7 children, from age 4 to 13. My husband<br/>\n&gt; was listed as back-up guardian in both sets of wills (they are a very<br/>\n&gt; close family, and the primary guardians were all killed.)<br/>\n&gt;<br/>\n&gt; As a result, we are now parenting 7 children very, very suddenly. The<br/>\n&gt; legal aspects have just been completed, and we are now legal<br/>\n&gt; guardians for all the children. We have also just bought a new house<br/>\n&gt; where we will all fit.<br/>\n&gt;<br/>\n&gt; The kids are grieving, but luckily they have one another. But they<br/>\n&gt; are in new schools, and several of the kids are refusing to go. They<br/>\n&gt; are afraid to be away from Dan and me and each other<br/>\n&gt; (understandably!) because they are afraid something will happen to<br/>\n&gt; more people they love.<br/>\n&gt;<br/>\n&gt; My husband and I are lawyers at the very beginning of our careers,<br/>\n&gt; but suddenly taking care of these kids seems more important. With the<br/>\n&gt; life insurance money from both families, it is extremely doable that<br/>\n&gt; either (or even both of us) could just not work and be home with the<br/>\n&gt; kids. If either of us do that, it will change forever the kind of<br/>\n&gt; careers we will have.<br/>\n&gt;<br/>\n&gt; But a few years ago I read Summerhill and Holt, and I think that<br/>\n&gt; unschooling would be the perfect thing for the kids. They need time<br/>\n&gt; and love. Other relatives think they should just be in school, and<br/>\n&gt; that we should use the money to hire help. A couple have suggested<br/>\n&gt; that the kids could be sent to boarding school. But they have lost so<br/>\n&gt; much already.<br/>\n&gt;<br/>\n&gt; What do you think? Would school give them more normalcy?<br/>\n&gt;<br/>\n&gt; By the way, the kids are Annie, 10, Trey, 7, Lilly, 4, and Sophie,<br/>\n&gt; 13, Emma, 11, Becca, 9, and Phin, 7.<br/>\n&gt;<br/>\n&gt; Lindsay and Dan<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":230228075,"authorName":"Brenda Hoffman","from":"&quot;Brenda Hoffman&quot; &lt;yourhealthyfamily@...&gt;","profile":"brendamariehoffman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Possible new unschoolers","postDate":"1128438442","msgId":6945,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMDA0MTUwNzIyLkFFMTUyMUY1MEIxQHdzMS0yLnVzNC5vdXRibGF6ZS5jb20+"},"prevInTopic":6944,"nextInTopic":6946,"prevInTime":6944,"nextInTime":6946,"topicId":6934,"numMessagesInTopic":0,"msgSnippet":"I m so sorry to hear about this tragedy!  Out of curiosity are you and your husband in the same type of law (ie family, crimnal, etc) because you might","messageBody":"<div id=\"ygrps-yiv-1412746381\">I&#39;m so sorry to hear about this tragedy!  Out of curiosity are you and<br/>\nyour husband in the same type of law (ie family, crimnal, etc) because<br/>\nyou might consider opening your own law firm as it seems you may have the<br/>\nfunds available and if so then you could both &quot;take turns&quot; being there<br/>\nfor your new big family and then unschooling would work out great.<br/>\n<br/>\n=^..^=  Pastor Brenda<br/>\nOrdained ULC Minister<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:yourhealthyfamily@...\">yourhealthyfamily@...</a><br/>\nHolistic living made easy at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.yourhealthyfamilyhome.com\">http://www.yourhealthyfamilyhome.com</a><br/>\nDiscover a way to increase your health and/or income!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://practicalsolution.info\">http://practicalsolution.info</a><br/>\n<br/>\n-- <br/>\n___________________________________________________________<br/>\nSign-up for Ads Free at Mail.com<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://promo.mail.com/adsfreejump.htm\">http://promo.mail.com/adsfreejump.htm</a><br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":188356966,"authorName":"Brandie","from":"Brandie &lt;scrapdiva73@...&gt;","profile":"scrapdiva73","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Possible new unschoolers","postDate":"1128406705","msgId":6944,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMDA0MDYxODI1LjY5MjAyLnFtYWlsQHdlYjUxODA3Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGRocnNvYSs2aHF2QGVHcm91cHMuY29tPg=="},"prevInTopic":6943,"nextInTopic":6945,"prevInTime":6943,"nextInTime":6945,"topicId":6934,"numMessagesInTopic":0,"msgSnippet":"Hi Lindsay... It s best for you to follow their lead.  These children have been through enough -- things they had no control over.  Give them back some","messageBody":"<div id=\"ygrps-yiv-2038889348\">Hi Lindsay...<br/>\nIt&#39;s best for you to follow their lead.  These<br/>\nchildren have been through enough -- things they had<br/>\nno control over.  Give them back some control.  If<br/>\nthey don&#39;t want to attend school, don&#39;t make them.  If<br/>\nany of them really want school, allow them to attend. <br/>\nLet them make the choice and support them either way.<br/>\n<br/>\nI am very sorry for what you and your family have gone<br/>\nthrough.  I encourage you to hang out here and ask any<br/>\nand all questions you might have and read everything<br/>\nyou can about unschooling.<br/>\n<br/>\n<br/>\nBrandie <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tableforfive.blogspot.com\">http://tableforfive.blogspot.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://homemadeliving.blogspot.com\">http://homemadeliving.blogspot.com</a> <br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n__________________________________ <br/>\nYahoo! Mail - PC Magazine Editors&#39; Choice 2005 <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Possible new unschoolers","postDate":"1128395119","msgId":6943,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGRocnNvYSs2aHF2QGVHcm91cHMuY29tPg=="},"prevInTopic":6942,"nextInTopic":6944,"prevInTime":6942,"nextInTime":6944,"topicId":6934,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1444487147\">&lt;&lt;&lt;&lt; As a result, we are now parenting 7 children very, very suddenly. The <br/>\nlegal aspects have just been completed, and we are now legal <br/>\nguardians for all the children. We have also just bought a new house <br/>\nwhere we will all fit.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nLike the others who have replied I commend you both for opening your home<br/>\nand hearts to loving your nephews and nieces, even while you must be<br/>\ngrieving also. I agree with Pam that treating life as temporary vacation<br/>\nwould be a great idea, to help the children move from a place of fear to a<br/>\nplace of confidence. I&#39;m sure that incipient puberty is complicating the<br/>\nemotions of some of your children. <br/>\n<br/>\n&lt;&lt;&lt;&lt; My husband and I are lawyers at the very beginning of our careers, <br/>\nbut suddenly taking care of these kids seems more important. With the <br/>\nlife insurance money from both families, it is extremely doable that <br/>\neither (or even both of us) could just not work and be home with the <br/>\nkids. If either of us do that, it will change forever the kind of <br/>\ncareers we will have. &gt;&gt;&gt;&gt;<br/>\n<br/>\nYour heart and intuition are telling you the truth, I think. Taking care of<br/>\nthese kids *is* more important. I hope that you can see this as an<br/>\nopportunity to embrace freedom for yourselves, and find creative ways to<br/>\nstill practice. Many people do not have financial freedoms that allow them<br/>\nto consider the choice of one parent being home, let alone both. It makes a<br/>\nlot of difference to my dd to have her father and I with her most of the<br/>\ntime - although in our case that was due to an injury. <br/>\n<br/>\nBTW there is a group called National Home Education Legal Defense - the<br/>\ngoals and mission are spelled out at the website www.nheld.com . They are a<br/>\nsecular group of lawyers, not to be confused with HSLDA. It is probably too<br/>\nsoon to think about this, but here may be a way to continue to foster your<br/>\ninterest in law and bring your expertise to bear with a group that can<br/>\nalways use more help.<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt; What do you think? Would school give them more normalcy? &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nI&#39;m not sure that normalcy is something to be desired when their emotional<br/>\nsituation is so far from normal. Boarding school is certainly not a normal<br/>\nsituation. Take it from one who&#39;s been there.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.344 / Virus Database: 267.11.9/117 - Release Date: 10/3/2005</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Possible new unschoolers","postDate":"1128394018","msgId":6942,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRoc3FmMisyYnZmQGVHcm91cHMuY29tPg=="},"prevInTopic":6941,"nextInTopic":6943,"prevInTime":6941,"nextInTime":6943,"topicId":6934,"numMessagesInTopic":0,"msgSnippet":"But a few years ago I read Summerhill and Holt, and I think that unschooling would be the perfect thing for the kids. They need time and love.  Time and love","messageBody":"<div id=\"ygrps-yiv-933737278\">&quot;But a few years ago I read Summerhill and Holt, and I think that<br/>\nunschooling would be the perfect thing for the kids. They need time<br/>\nand love. &quot;<br/>\n<br/>\nTime and love don&#39;t happen at school. You&#39;re right though, that is the<br/>\nbest thing for them...time and love that is.:)<br/>\nWhat a wonderful thing that they have you in this terrible tragedy.<br/>\nI really don&#39;t think there is anything &quot;normal&quot; about school, it&#39;s a<br/>\nfalse environment at best. I don&#39;t see how sucking it up and suffering<br/>\nmore helps anyone...especially a grieving child.<br/>\nSchool is abuse of the human spirit, they&#39;ve been through more than<br/>\nmost  young people in this country will ever suffer, give them freedom<br/>\nof choice and plenty of wonderful things to do outside of school.<br/>\n<br/>\nPlease start reading some of the things listed in the &quot;links&quot; section<br/>\nof this site. I really, really wish you could all get to St. Louis for<br/>\nthe conference this weekend. Maybe next year? If you could all get<br/>\nthere, you can register at the door.:)<br/>\nliveandlearnconference.org.<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Possible new unschoolers","postDate":"1128393452","msgId":6941,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4MEEyMEJFLTU4MzYtNEU1RS1BNTdFLTY2MEVFOEQ1NzYwMEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGRocnNvYSs2aHF2QGVHcm91cHMuY29tPg==","referencesHeader":"PGRocnNvYSs2aHF2QGVHcm91cHMuY29tPg=="},"prevInTopic":6940,"nextInTopic":6942,"prevInTime":6940,"nextInTime":6942,"topicId":6934,"numMessagesInTopic":0,"msgSnippet":"School would give them all KINDS of additional pressures and stresses and steal a lot of their time which could be used for bonding and healing - with you and","messageBody":"<div id=\"ygrps-yiv-936168176\">School would give them all KINDS of additional pressures and stresses  <br/>\nand steal a lot of their time which could be used for bonding and  <br/>\nhealing - with you and each other. If they go to school, you&#39;ll spend  <br/>\nALL your time on logistics - getting them dressed and fed and  <br/>\nhomework done and all that. And you&#39;re guaranteed to develop at least  <br/>\na somewhat adversarial relationship with them when you have to make  <br/>\nthem do stuff. I really don&#39;t see any way that putting them in school  <br/>\ncould be better than a nice long vacation.<br/>\n<br/>\nGive them the gift of a year of peace and support and envelop them in  <br/>\nyour new large family life. You don&#39;t have to make a commitment for  <br/>\n&quot;forever&quot; - just take this year.<br/>\n<br/>\nAnd - I also left a high-powered career to be a homeschooling parent  <br/>\n- I wouldn&#39;t trade one MINUTE of homeschooling for my foregone career.<br/>\n<br/>\nAlso - you might be surprised what can happen, work-wise, when you  <br/>\nstep off of the conventional path - you might end up with a far more  <br/>\nsatisfying career, anyway, once you start thinking creatively it is  <br/>\namazing what completely unexpected developments arise.<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Oct 3, 2005, at 11:19 AM, lindsayborrer wrote:<br/>\n<br/>\n&gt; What do you think? Would school give them more normalcy?<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":11220207,"authorName":"amcarlson@mindspring.com","from":"amcarlson@...","profile":"gunnar333us","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Possible new unschoolers","postDate":"1128382943","msgId":6940,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2ODQwOS4xMTI4MzgyOTQ0MDI4LkphdmFNYWlsLnJvb3RAbXN3YW11aS1zd2lzcy5hdGwuc2EuZWFydGhsaW5rLm5ldD4="},"prevInTopic":6939,"nextInTopic":6941,"prevInTime":6939,"nextInTime":6941,"topicId":6934,"numMessagesInTopic":0,"msgSnippet":"Dear Lindsay:  Thank you for reaching out to this unschoolers list at this time of incredible tragedy and change for you, your husband and your new family.","messageBody":"<div id=\"ygrps-yiv-1814133246\">Dear Lindsay:  Thank you for reaching out to this unschoolers list at this time of incredible tragedy and change for you, your husband and your new family.  There is alot of hope and wisdom here.  I&#39;m new to the unschooling philosophy (have been homeschooling for 3 years but only in the last year have shifted to unschooling.)   We have three adopted children, my daughter decided to go to school this year, my boys are unschooling (they&#39;re 12).  My partner and I also  work, so it is possible to continue careers with adjustments.  As other people have counseled, it sounds as if the children are guiding you towards what they need and want.  It may not be the same for all of them, in terms of what they need to grieve and process all this change.  What a gift that you both have the time, space, heart, to welcome them into your family.  I send you all my thoughts and prayers.  love, Ann.</div>","specialLinks":[]},{"userId":213809267,"authorName":"jlh44music","from":"&quot;jlh44music&quot; &lt;jlh44music@...&gt;","profile":"jlh44music","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Possible new unschoolers","postDate":"1128375335","msgId":6939,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRoczg3Nys5dTRpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRocnNvYSs2aHF2QGVHcm91cHMuY29tPg=="},"prevInTopic":6938,"nextInTopic":6940,"prevInTime":6938,"nextInTime":6940,"topicId":6934,"numMessagesInTopic":0,"msgSnippet":"Welcome Lindsay, I m so sorry to hear your tragic story, but how lucky for the kids to be able to be together. I agree that they need time to grieve at home,","messageBody":"<div id=\"ygrps-yiv-2011632783\">Welcome Lindsay,<br/>\nI&#39;m so sorry to hear your tragic story, but how lucky for the kids to <br/>\nbe able to be together. <br/>\n<br/>\nI agree that they need time to grieve at home, where it&#39;s safe.  Take <br/>\nthe time and talk with them, let them share what they feel they need <br/>\nright now.  If you&#39;re able to do that financially, then what a gift <br/>\nyou will give them.<br/>\n<br/>\nAs someone posted, most of the &quot;experienced&quot; unschoolers are at the <br/>\nLive and Learn Conference thru the weekend, but if you have a chance <br/>\nto go back and read through some of the archives this is a great <br/>\ngroup for newbies to unschooling.  My daughter just finished 6th <br/>\ngrade, and is deschooling big time.  I researched homeschooling <br/>\nstarting over 2 years ago, found unschooling, have read tons of <br/>\nbooks, websites, joined (and unjoined!) several yahoo groups and have <br/>\nfound the people here to be so supportive.   I KNOW that unschooling <br/>\nis what&#39;s best for my child.   Feel free to share some of your <br/>\nthoughts here (even with many of the more experienced unschoolers <br/>\ngone for the week),  sometimes it helps to have a place where you <br/>\nknow you can ask questions where others understand and have been <br/>\nthere (or in some cases are still &quot;there&quot;!).<br/>\nJann</div>","specialLinks":[]},{"userId":202172558,"authorName":"Elisa Allender","from":"&quot;Elisa Allender&quot; &lt;eallender@...&gt;","profile":"eally","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Possible new unschoolers","postDate":"1128375238","msgId":6938,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMDAzMjEzNDA5LktVTksxMjE1NC5pYm02MmFlYy5iZWxsc291dGgubmV0QHlvdXI0MTA1ZTU4N2I2Pg==","inReplyToHeader":"PGRocnNvYSs2aHF2QGVHcm91cHMuY29tPg=="},"prevInTopic":6937,"nextInTopic":6939,"prevInTime":6937,"nextInTime":6939,"topicId":6934,"numMessagesInTopic":0,"msgSnippet":"Oh my heart!!  How sad!  God bless you and your husband for taking in these poor children.  They NEED family around them right now. It sounds like they are","messageBody":"<div id=\"ygrps-yiv-320683798\">Oh my heart!!  How sad!  God bless you and your husband for taking in these<br/>\npoor children.  They NEED family around them right now. It sounds like they<br/>\nare telling you that very loud and clear.  Those children&#39;s whole world has<br/>\nchanged, as far as they are concerned they have lost everything.  Unless<br/>\nTHEY want to and desire school that is the last thing they need right now.<br/>\nThey need to be able to live and grow confident in their new surroundings<br/>\nand new &quot;parents&quot;.  Praise God that you won&#39;t have a financial burden if you<br/>\nor hubby quits working..so many people choose to live as one income families<br/>\nand struggle financially their whole lives but they are so happy as a family<br/>\nbecause they have that family bond and closeness  that working parents just<br/>\ncan&#39;t have with their children.  Listen to the kids.ask them what THEY want<br/>\nand do what they want.  Don&#39;t listen to relatives and others who are not in<br/>\nyour shoes or the shoes of those children who are grieving.  Boarding<br/>\nschool???!!!!!  You have got to be kidding me!  That sounds to me like<br/>\nwhoever suggested that just doesn&#39;t want to see the grieving children or<br/>\nhave to deal with their grief..better to send the child away and let<br/>\nsomebody else deal with their grief!<br/>\n<br/>\nI will be praying for you and your husband and your new responsibilities.<br/>\nHope things smooth out for you guys!<br/>\n<br/>\nMuch love and prayers,<br/>\n<br/>\nElisa<br/>\n<br/>\n <br/>\n<br/>\n  _____  <br/>\n<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>] On Behalf Of lindsayborrer<br/>\nSent: Monday, October 03, 2005 1:20 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: [unschoolingbasics] Possible new unschoolers<br/>\n<br/>\n <br/>\n<br/>\nHello, I just joined, and wanted to introduce myself and possibly get <br/>\nsome advice.<br/>\n<br/>\nMy name is Lindsay, and I am 25 and married for a year to my beloved, <br/>\nDan. Six months ago my family had a tragedy, and everything changed. <br/>\nMy husband&#39;s brother and sister and their respective spouses had gone <br/>\non a weekend away when they were killed by a drunk driver. Between <br/>\nthe two families, there are 7 children, from age 4 to 13. My husband <br/>\nwas listed as back-up guardian in both sets of wills (they are a very <br/>\nclose family, and the primary guardians were all killed.)<br/>\n<br/>\nAs a result, we are now parenting 7 children very, very suddenly. The <br/>\nlegal aspects have just been completed, and we are now legal <br/>\nguardians for all the children. We have also just bought a new house <br/>\nwhere we will all fit.<br/>\n<br/>\nThe kids are grieving, but luckily they have one another. But they <br/>\nare in new schools, and several of the kids are refusing to go. They <br/>\nare afraid to be away from Dan and me and  each other <br/>\n(understandably!) because they are afraid something will happen to <br/>\nmore people they love.<br/>\n<br/>\nMy husband and I are lawyers at the very beginning of our careers, <br/>\nbut suddenly taking care of these kids seems more important. With the <br/>\nlife insurance money from both families, it is extremely doable that <br/>\neither (or even both of us) could just not work and be home with the <br/>\nkids. If either of us do that, it will change forever the kind of <br/>\ncareers we will have.<br/>\n<br/>\nBut a few years ago I read Summerhill and Holt, and I think that <br/>\nunschooling would be the perfect thing for the kids. They need time <br/>\nand love. Other relatives think they should just be in school, and <br/>\nthat we should use the money to hire help. A couple have suggested <br/>\nthat the kids could be sent to boarding school. But they have lost so <br/>\nmuch already.<br/>\n<br/>\nWhat do you think? Would school give them more normalcy?<br/>\n<br/>\nBy the way, the kids are Annie, 10, Trey, 7, Lilly, 4, and Sophie, <br/>\n13, Emma, 11, Becca, 9, and Phin, 7.<br/>\n<br/>\nLindsay and Dan<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  _____  <br/>\n<br/>\nYAHOO! GROUPS LINKS <br/>\n<br/>\n <br/>\n<br/>\n*\t Visit your group &quot;unschoolingbasics<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics\">http://groups.yahoo.com/group/unschoolingbasics</a>&gt; &quot; on the web.<br/>\n  <br/>\n*\t To unsubscribe from this group, send an email to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a>?subject=Unsubscribe&gt; <br/>\n  <br/>\n*\t Your use of Yahoo! Groups is subject to the Yahoo!<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;  Terms of Service. <br/>\n<br/>\n <br/>\n<br/>\n  _____  <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1224177,"authorName":"Saulithyia@aol.com","from":"Saulithyia@...","profile":"saulithyia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Possible new unschoolers","postDate":"1128374073","msgId":6937,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwMy42YjBmM2I3Ni4zMDcyZjkzOUBhb2wuY29tPg=="},"prevInTopic":6936,"nextInTopic":6938,"prevInTime":6936,"nextInTime":6938,"topicId":6934,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/3/2005 4:34:35 PM Eastern Daylight Time, lindsayborrer@yahoo.com writes: What do  you think? Would school give them more normalcy? By the","messageBody":"<div id=\"ygrps-yiv-593496031\">In a message dated 10/3/2005 4:34:35 PM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lindsayborrer@...\">lindsayborrer@...</a> writes:<br/>\n<br/>\nWhat do  you think? Would school give them more normalcy?<br/>\n<br/>\nBy the way, the kids  are Annie, 10, Trey, 7, Lilly, 4, and Sophie, <br/>\n13, Emma, 11, Becca, 9, and  Phin, 7.<br/>\n<br/>\n<br/>\nWelcome Lindsay... I&#39;m very sorry for your losses and how wonderful that  <br/>\nthese children have a single place to go to and someone to love them and care  <br/>\nfor them...<br/>\n <br/>\nIn my opinion, I think they need each other to heal and deal with their  <br/>\ngrief. Let them talk about their feelings, react to their feelings and just  &quot;be&quot;. <br/>\nI know, from my own experiences, schools don&#39;t always handle grief very  <br/>\nwell... with so many issues each individual may or may not have, sometimes the  <br/>\nimportant stuff gets swept under the carpet and no good results from that.<br/>\n <br/>\nAre either you or your husband able to work from home? I wouldn&#39;t think you  <br/>\nwould necessarily have to end your careers, just shift a little. See what <br/>\ncould  work for you. Maybe you could work at home some days while your husband is <br/>\nat  the office and vice versa. You need to figure out what will be best for <br/>\nyou and  your family.<br/>\n <br/>\nAnd I wouldn&#39;t worry about what other family members say... shipping them  <br/>\noff to boarding school?? Yikes! You are the childrens&#39; legal guardians now.  <br/>\nThere must have been a good reason why you and your husband were chosen and not  <br/>\nother family members. Those kids need each other right now, not to be torn <br/>\napart  anymore. They need time to heal.<br/>\n <br/>\n <br/>\n <br/>\nJenny<br/>\nHomeschooling in Greenfield<br/>\nDanny (12-1-99), Kelsey  (11-1-01) and Evelyn (5-19-04)<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\nEducation is not filling a pail but the lighting of a  fire.  ~William Butler <br/>\nYeats<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":35875473,"authorName":"Heather","from":"&quot;Heather&quot; &lt;heather@...&gt;","profile":"heather_200115","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Possible new unschoolers","postDate":"1128373598","msgId":6936,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzNDE5ZDYxLjE1NzgyOTgzLjRjMTEuMjA1NEBteC5nbWFpbC5jb20+","inReplyToHeader":"PGRocnNvYSs2aHF2QGVHcm91cHMuY29tPg=="},"prevInTopic":6935,"nextInTopic":6937,"prevInTime":6935,"nextInTime":6937,"topicId":6934,"numMessagesInTopic":0,"msgSnippet":"Dear Lindsay, Your letter brought tears to my eyes.  I m so sorry for your family s loss. And I want to give you & your dh hugs for creating a safe home for","messageBody":"<div id=\"ygrps-yiv-384741639\">Dear Lindsay,<br/>\n<br/>\n <br/>\n<br/>\nYour letter brought tears to my eyes.  I&#39;m so sorry for your family&#39;s loss.<br/>\nAnd I want to give you & your dh hugs for creating a safe home for the<br/>\nchildren. <br/>\n<br/>\nYou ask if school would give them more normalcy.  But it sounds like the<br/>\nchildren are already telling you what they want - they want to stay home, to<br/>\nbe with each other & with you & Dan, where they feel safe & loved.  I&#39;m<br/>\nguessing your relatives are giving advice by thinking about what they would<br/>\ndo in your situation.  Just because they might put the children in school or<br/>\nsend them to boarding school, does not mean they are thinking of the best<br/>\ninterests of the children.  It sounds like you are.  Follow your heart.<br/>\nWelcome to the list.  <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\nHeather <br/>\n<br/>\nTucson AZ<br/>\n<br/>\nUnschooling mom to Quentin, almost 9 (on Sunday) & Sierra, recently turned 7<br/>\n<br/>\n <br/>\n<br/>\np.s.  Where are you located?  This list may be quieter than usual this week<br/>\nas there is an unschooling conference in St. Louis this Thurs - Sunday.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.liveandlearnconference.org/\">http://www.liveandlearnconference.org/</a><br/>\n<br/>\n  _____  <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":92643757,"authorName":"Leslie530@aol.com","from":"Leslie530@...","profile":"lescather","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Possible new unschoolers","postDate":"1128372604","msgId":6935,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0Ny40ZWNjMWE0OC4zMDcyZjM3Y0Bhb2wuY29tPg=="},"prevInTopic":6934,"nextInTopic":6936,"prevInTime":6934,"nextInTime":6936,"topicId":6934,"numMessagesInTopic":0,"msgSnippet":"Hi Lindsay and Dan.  Wow, what a tragic story.  I wish you all  well as you all adjust to so many changes and so much pain. Most of our group is at the Live","messageBody":"<div id=\"ygrps-yiv-975944412\">Hi Lindsay and Dan.  Wow, what a tragic story.  I wish you all  well as you <br/>\nall adjust to so many changes and so much pain.<br/>\n <br/>\nMost of our group is at the Live and Learn unschooling conference, so our  <br/>\nlist will be quiet for a week or so.<br/>\n <br/>\nOthers will have such great advise.  My thought is that maybe you  offer each <br/>\nchild a choice of whether they want to go to school or stay  home.  They have <br/>\nhad so many changes, maybe they could decide which place  will help them <br/>\nadjust to their new life.  Chances are some may choose  school at first, then <br/>\nmaybe as they get more settled they will be ready to stay  home.<br/>\n <br/>\nI do believe that unschooling heals children.  There are a few people  on <br/>\nthis list that have adopted children in great need of healing.   Hopefully they <br/>\nwill have some advise for you.<br/>\n <br/>\nTake care,<br/>\nLeslie in SC<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":239602179,"authorName":"lindsayborrer","from":"&quot;lindsayborrer&quot; &lt;lindsayborrer@...&gt;","profile":"lindsayborrer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Possible new unschoolers","postDate":"1128363594","msgId":6934,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRocnNvYSs2aHF2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":6935,"prevInTime":6933,"nextInTime":6935,"topicId":6934,"numMessagesInTopic":0,"msgSnippet":"Hello, I just joined, and wanted to introduce myself and possibly get some advice. My name is Lindsay, and I am 25 and married for a year to my beloved, Dan.","messageBody":"<div id=\"ygrps-yiv-162469938\">Hello, I just joined, and wanted to introduce myself and possibly get <br/>\nsome advice.<br/>\n<br/>\nMy name is Lindsay, and I am 25 and married for a year to my beloved, <br/>\nDan. Six months ago my family had a tragedy, and everything changed. <br/>\nMy husband&#39;s brother and sister and their respective spouses had gone <br/>\non a weekend away when they were killed by a drunk driver. Between <br/>\nthe two families, there are 7 children, from age 4 to 13. My husband <br/>\nwas listed as back-up guardian in both sets of wills (they are a very <br/>\nclose family, and the primary guardians were all killed.)<br/>\n<br/>\nAs a result, we are now parenting 7 children very, very suddenly. The <br/>\nlegal aspects have just been completed, and we are now legal <br/>\nguardians for all the children. We have also just bought a new house <br/>\nwhere we will all fit.<br/>\n<br/>\nThe kids are grieving, but luckily they have one another. But they <br/>\nare in new schools, and several of the kids are refusing to go. They <br/>\nare afraid to be away from Dan and me and  each other <br/>\n(understandably!) because they are afraid something will happen to <br/>\nmore people they love.<br/>\n<br/>\nMy husband and I are lawyers at the very beginning of our careers, <br/>\nbut suddenly taking care of these kids seems more important. With the <br/>\nlife insurance money from both families, it is extremely doable that <br/>\neither (or even both of us) could just not work and be home with the <br/>\nkids. If either of us do that, it will change forever the kind of <br/>\ncareers we will have.<br/>\n<br/>\nBut a few years ago I read Summerhill and Holt, and I think that <br/>\nunschooling would be the perfect thing for the kids. They need time <br/>\nand love. Other relatives think they should just be in school, and <br/>\nthat we should use the money to hire help. A couple have suggested <br/>\nthat the kids could be sent to boarding school. But they have lost so <br/>\nmuch already.<br/>\n<br/>\nWhat do you think? Would school give them more normalcy?<br/>\n<br/>\nBy the way, the kids are Annie, 10, Trey, 7, Lilly, 4, and Sophie, <br/>\n13, Emma, 11, Becca, 9, and Phin, 7.<br/>\n<br/>\nLindsay and Dan</div>","specialLinks":[]}],"prevTopicId":7085,"nextTopicId":7123}}