{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Fwd: [AlwaysLearning] Re: chores","postDate":"1122468694","msgId":5854,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDNzYwQzEwREU0Njc0NS1FMzAtMjM0NEBNQkxLLU0zOC5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PGRicGNkcStydGozQGVHcm91cHMuY29tPg==","referencesHeader":"PGRicGNkcStydGozQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":5853,"nextInTime":5855,"topicId":5854,"numMessagesInTopic":0,"msgSnippet":"I forwarded this over from ALwaysLearning because I thought it might help somenewbies here as well. I hope Joyce doesn t mind! ","messageBody":"<div id=\"ygrps-yiv-15257855\">I forwarded this over from ALwaysLearning because I thought it might <br/>\nhelp somenewbies here as well.<br/>\n<br/>\nI hope Joyce doesn&#39;t mind! &lt;g.<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\nOctober 6-9, 2005<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n<br/>\n-----Original Message-----<br/>\nFrom: jfetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>&gt;<br/>\n<br/>\n  **She would have other kitchen duties if not that. Many meals I<br/>\nprepare on my own, but she does help me quite often. We live in<br/>\nthe same apartment and as such are a team.**<br/>\n<br/>\n I think the dissonance you may be feeling between<br/>\nwhat you&#39;re writing and the responses you&#39;re getting might have<br/>\nto do more with word choice than with differing ideas.<br/>\n<br/>\nFirst I&#39;d like to reiterate what Sandra said. There are (basically)<br/>\ntwo types of unschooling lists. One is for support where people<br/>\nshare what they do and so they can get to know each other. The<br/>\nother is for discussion. People share problems they&#39;re having so<br/>\nthey can discuss it :-) So if there&#39;s anything you do that you don&#39;t<br/>\nwant people to pull out and say &quot;What do you mean by that?<br/>\nHave you really examined what you&#39;re doing?&quot; it&#39;s best not to<br/>\npost it.<br/>\n<br/>\nIt&#39;s not that the list doesn&#39;t accept people for who they are. It&#39;s<br/>\nthat this list is specifically for discussing ideas. It&#39;s *for* holding<br/>\npractices and thoughts and ideas up to examination.<br/>\n<br/>\nRather than a place to kick back and let it all hang out, this is a<br/>\nplace where people come to have their ideas challenged, to look<br/>\nat life in ways they&#39;d never considered before.<br/>\n<br/>\nBasically on this list the filter through which ideas pass is<br/>\ntreating children as fellow human beings. If someone presents<br/>\nan idea where it sounds like the child is being treated in a way<br/>\nthat an adult would be upset to be treated, the idea will raise red<br/>\nflags for many people. And the idea will be discussed.<br/>\n<br/>\n**She would have other kitchen duties if not that.**<br/>\n<br/>\nThis might be a word use problem.<br/>\n<br/>\n&quot;Have&quot; suggests that your daughter has been assigned kitchen<br/>\nduties by someone else. &quot;Have&quot; suggests that if she doesn&#39;t do<br/>\nthem then there will be punishment.<br/>\n<br/>\nNow that *idea* will raise red flags and people will want to<br/>\ndiscuss the *idea* of making children -- not your child, not what<br/>\nyou do in your home -- but the idea of making children do chores.<br/>\n<br/>\nStep back for a moment and treat this as though it weren&#39;t about<br/>\nwhat you&#39;re doing, but about broader ideas.<br/>\n<br/>\nDoes it help build a good relationship between two humans for<br/>\none human to have the power over another to tell them what to<br/>\ndo and to punish them if they don&#39;t?<br/>\n<br/>\n(Step back. This isn&#39;t about you. It&#39;s about how *people* feel.)<br/>\n<br/>\nLots of parents would say no, it doesn&#39;t help build a good<br/>\nrelationshp. They&#39;d probably be thinking about their spouse,<br/>\nsaying, &quot;I don&#39;t want my husband to tell me what to do and<br/>\npunish me if I don&#39;t!&quot;<br/>\n<br/>\nAnd yet, without realizing it, they&#39;d be doing exactly that to their<br/>\nkids! They&#39;d make their kids do something and punish them (or<br/>\nmake them feel bad or get mad at them or ask them over and<br/>\nover and over ...) And they&#39;d say &quot;Yes, I&#39;m making her, but ___.&quot;<br/>\nAnd they&#39;d fill in the blank with &quot;they&#39;re kids&quot;, &quot;they don&#39;t know as<br/>\nmuch,&quot; &quot;someone has to be in charge,&quot; and so on and so on.<br/>\n<br/>\nBut what it all boils down to, regardless of the justification, we<br/>\nare tearing down a relationship when we assert our authority<br/>\nover someone weaker. When we take away someone&#39;s power to<br/>\nsay no, we are tearing down a good relationship and creating a<br/>\nrelationship of adversaries: Parent vs child. And when there are<br/>\nadversaries, there is a struggle for power. And when there is a<br/>\nstruggle for power there are winners and losers.<br/>\n<br/>\nBut none of those words: struggle, power, winner, loser have<br/>\nanything to do with building a loving relationship, do they?<br/>\nThey&#39;re all really yucky words to put into a relationship.<br/>\n<br/>\nAnd there are better ways to be with kids than as adversaries.<br/>\nThere are ways to live life together, get all the things done that<br/>\nwe feel we&#39;d like to get done *and* build a loving relationship<br/>\nwith our kids.<br/>\n<br/>\nSo we talk about it here. A lot :-)<br/>\n<br/>\n**We live in the same apartment and as such are a team.**<br/>\n<br/>\nThis is the point that most parents would love to be at :-)<br/>\n<br/>\nThe problem is that being a team doesn&#39;t just happen by existing<br/>\ntogether. Children aren&#39;t born realizing they&#39;re part of a team so<br/>\nthey need to pitch in. In fact children are born believing everything<br/>\nis about them ;-)<br/>\n<br/>\nTraditional parenting would say that kids need to be taught that<br/>\nlife isn&#39;t about them. Traditional parenting would say kids need<br/>\nto learn to do what parents say so kids can learn that life isn&#39;t all<br/>\nabout them.<br/>\n<br/>\nBut what that teaches kids is that life is all about being an adult<br/>\nso you can be bigger and get your way by telling others what to<br/>\ndo.<br/>\n<br/>\n(Turn that idea upside down. What if an adult thinks another<br/>\nadult needs to learn the lesson that others should be taken into<br/>\nconsideration too so starts ordering the other adult around,<br/>\nmaking the second adult do what the first adult wants. It just<br/>\nfeels *wrong*. But most parents, even if they see the wrongness<br/>\nof it, think that&#39;s life and kids just have to learn.)<br/>\n<br/>\nOn this list we help people find better ways! :-) We help them see<br/>\nthat we can support kids in their belief that it&#39;s all about them.<br/>\nWhile *at the same time* helping them see  it&#39;s all about mom<br/>\nand big sister and dad too.<br/>\n<br/>\nThe problem is that most parents don&#39;t know how to get to a<br/>\nfeeling of &quot;we&#39;re a team.&quot; Or they think they know but the ways<br/>\nthey&#39;ll go about it -- for instance making their kids do chores<br/>\nbecause they&#39;re a part of a team -- only work for kids who are<br/>\nvery compliant or desperately needing to please. Those ways<br/>\ntend to have the opposite effect on kids with other personalities.<br/>\nAnd when parents don&#39;t get the results they expect,  when the<br/>\nkids act resentful of being made to do chores, act as though their<br/>\nparents care more about the things they&#39;re making the kids do<br/>\nthan they do about the kids, the parents wonder what&#39;s wrong<br/>\nwith their kids. They wonder why Roberta&#39;s daughter is chopping<br/>\nvegetables happily for her mom while their own kids roll their<br/>\neyes and groan and do half-assed jobs.<br/>\n<br/>\nOn this list we help people examine what goes into building<br/>\nrelationship so that we become people our kids want to help :-)<br/>\nIt&#39;s not just luck if kids help. There are ways we can relate to kids<br/>\nthat will foster a great relationship.<br/>\n<br/>\n**Through cooking I teach her her heritage - both sides.**<br/>\n<br/>\nTeach is another word land mine.<br/>\n<br/>\nTeach, for many people who are trying to understand<br/>\nunschooling, is a loaded word. It brings up pictures of a teacher<br/>\npushing information into a child.<br/>\n<br/>\nWe try to help people drop that image. And to help them drop that<br/>\nimage we try to help them see how learning is different from<br/>\nteaching.<br/>\n<br/>\n(There are ways that teaching is like learning *but* it&#39;s examining<br/>\nhow learning is *different* from teaching that helps people get<br/>\nunschooling.)<br/>\n<br/>\nTeaching is about pushing information in. Learning is about<br/>\nsomeone pulling something they want in.<br/>\n<br/>\nOnce people can turn their thinking around from trying to get<br/>\nwhat they want a child to learn into the child to thinking in terms<br/>\nof what the child wants to pull in for himself, they&#39;re a lot closer to<br/>\nunderstanding unschooling.<br/>\n<br/>\n**Surely there are some things we can learn about how to do<br/>\nchores, but basically they are just something that need to be<br/>\ndone and if not we don&#39;t eat, have clean clothes, or a clean<br/>\nhome.**<br/>\n<br/>\n&quot;Need to&quot; is another word land mine. As you point out while there<br/>\nare things that we &quot;need to do&quot; it&#39;s helpful -- freeing! -- to turn <br/>\nthat<br/>\npicture up side down so we can see it in a new way.<br/>\n<br/>\nIF we see everything we do as a choice, then it frees us from<br/>\nsome outside mysterious power that&#39;s supposedly making us<br/>\ndo such and such.<br/>\n<br/>\nLots of people get trapped thinking they &quot;have to&quot; make dinner.<br/>\nThe truth is that they don&#39;t. They *choose* to make dinner for<br/>\nreasons that they don&#39;t think are even worth considering. But they<br/>\n*are* worth considering because if they aren&#39;t considered then it<br/>\nfeels like we don&#39;t have a choice.<br/>\n<br/>\nWe don&#39;t have to make dinner. We could order pizza. We could<br/>\neat frozen dinners. We could hire a chef. We could make a<br/>\nmonth of meals on one day and put them in the freezer. (The list<br/>\ncould go on.)<br/>\n<br/>\nBut someone might *choose* to make dinner because ... It&#39;s<br/>\ncheaper. It&#39;s healthier. It&#39;s a way they enjoy showing someone<br/>\nthey care for them. (The list could go on.)<br/>\n<br/>\nOne thing that helped drive this idea home for me is that I always<br/>\nfelt I had to clean the toilet every x number of days. I didn&#39;t listen<br/>\nto the voice ;-) but that voice was there nagging me whenever I<br/>\nlooked at the toilet. And that guilt making voice made me<br/>\nresentful and rebellious so that I didn&#39;t clean the toilet.<br/>\n<br/>\nBut then I stopped and said, no, I don&#39;t *have to* clean the toilet.<br/>\nBut sometimes it&#39;s really nice for the toilet to be clean. And from<br/>\nthen it became a choice. I no longer *had to* clean the toilet any<br/>\nmore! But sometimes I *chose to* clean the toilet because I<br/>\nwanted it clean :-) And ever since then, because I know I can say<br/>\nno anytime I want to, I do clean my toilet more often than when I<br/>\n&quot;had to&quot;.<br/>\n<br/>\nDoes that make any sense?<br/>\n<br/>\nNo one *has to* think that way but it&#39;s a really helpful way if<br/>\nsomeone finds themselves stuck with the idea of &quot;have to&quot; and<br/>\nthey&#39;d like to change.<br/>\n<br/>\nIt really  really really helps on a discussion list to step back from<br/>\nsomething you do when it&#39;s being discussed and look at it as an<br/>\nabstract idea. Look at it from a distance as though it&#39;s<br/>\ngeneralized and not about you any more. Turn it this way and<br/>\nthat. Turn kids into adults. Turn adults into kids. Turn ideas<br/>\nupside down and inside out. Expand it. If it&#39;s a good idea then it<br/>\ncan cover more than one thing. For example many people come<br/>\nto unschooling thinking it&#39;s just about academic learning, that<br/>\nkids can learn best by learning what interests them. And then<br/>\nthey start thinking, hmm, if that&#39;s true, then why is it true only of<br/>\nacademics? Why, if I&#39;ll let my child choose when and how to<br/>\nlearn math concepts, am I making her sit at the table and learn<br/>\ntable manners? And they&#39;ll expand it more and start questioning<br/>\nall sorts of things they never thought to question.<br/>\n<br/>\nBasically this list is for people who want the ideas of how to build<br/>\na relationship with their kids, who don&#39;t want to do things that will<br/>\ntear the relationship down.<br/>\n<br/>\nIf you&#39;re doing things differently, that&#39;s okay. :-) It&#39;s just that <br/>\nthis<br/>\nisn&#39;t the list to *talk* about how we all do things differently. It&#39;s a<br/>\nplace to discuss how we can respect our kids and still manage<br/>\nto get all the things done we want to and discuss that in ways<br/>\nthat will help others figure out how to make it work for them too.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Links</div>","specialLinks":[]}],"prevTopicId":5819,"nextTopicId":5785}}