{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":344016934,"authorName":"Jess Pierce","from":"Jess Pierce &lt;jlynnp7@...&gt;","profile":"jlynnp7","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"New to unschool","postDate":"1243002325","msgId":40256,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0MjY3Ni4zMjYwMC5xbUB3ZWI0NjEwNi5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":40255,"nextInTime":40257,"topicId":40256,"numMessagesInTopic":0,"msgSnippet":"I am new to this group, but I have always homeschooled my 8 year old and 6 year old.  We are having the same problems with making friends.  We were in a","messageBody":"<div id=\"ygrps-yiv-1450378587\">I am new to this group, but I have always homeschooled my 8 year old and 6 year old.  We are having the same problems with making friends.  We were in a group that my children loved, but since making the decision not to stress about school work and to unschool I don&#39;t think our old group is where we need to be next year.   I am wondering if &quot;unschoolers&quot; ever have group meetings so the kids can get to know eachother. I am in Northwest Arkansas.  Thank you--Jessica Pierce<br/>\n<br/>\n   <a rel=\"nofollow\" target=\"_blank\" href=\"http://homeschoolblogger.com/jess\">http://homeschoolblogger.com/jess</a>                                       Avon representative-   www.youravon.com/jessicapierce<br/>\n                                What are you doing for Heaven&#39;s sake?!<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Wed, 5/20/09, DJ250 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dj250@...\">dj250@...</a>&gt; wrote:<br/>\n<br/>\nFrom: DJ250 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dj250@...\">dj250@...</a>&gt;<br/>\nSubject: Re: [unschoolingbasics] Decision to Home School next  year- Long email<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Wednesday, May 20, 2009, 1:05 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n            <br/>\n            <br/>\n<br/>\n<br/>\n      <br/>\n      Mary, a group of us unschoolers meets a bit further north of you once a month.  We alternate between Odenton and Catonsville.  Email me offlist if you&#39;d like to come to our next meeting which is the 30th and will be in Odenton.  Anyone else interested can do so as well!  dj250@verizon. net <br/>\n<br/>\n<br/>\n<br/>\n~Melissa, in MD :)<br/>\n<br/>\n<br/>\n<br/>\n----- Original Message ----- <br/>\n<br/>\n  From: Mary Hatfield <br/>\n<br/>\n  To: unschoolingbasics@ yahoogroups. com <br/>\n<br/>\n  Sent: Tuesday, May 19, 2009 12:53 PM<br/>\n<br/>\n  Subject: [unschoolingbasics] Decision to Home School next year- Long email<br/>\n<br/>\n<br/>\n<br/>\nI am sincerely looking for the group&#39;s opinions and experiences in helping me make this decision. Please know that when I make important decisions I try to seek as much information as possible by looking at the perspectives and experiences of other. That being said, I will try to present our situation as best as possible. <br/>\n<br/>\n<br/>\n<br/>\nI am looking to home school my 8 year son Thomas for the following school year. Technically he would be in the second grade. I home schooled him a year ago after having to pull him out of a charter school in the middle of the year. After several meetings with his then kindergarten teacher at a small private church school,our home school and the new charter school, it was decided that Thomas would greatly benefit in being in a small classroom in a kindergarten/ 1st grade setting. Thomas was also in the process of testing for autism through Kennedy Krieger in Baltimore. In the middle of the school year Thomas he was diagnosed with Asperger&#39;s Syndrome. I believe that Thomas was tested pretty late for autism as he had other medical factors. I put him in a new charter school which turned out to be a great disappointment. They dropped the kinder/1st grade program one week before school started and put in a 1st and 2nd instead. We moved him to kinder where he<br/>\n was so far ahead that he was bored and upset that he was in a younger grade. <br/>\n<br/>\n<br/>\n<br/>\nI immediately started to seek out other home school groups in our area, but was unsuccessful. I am in a neighborhood surrounded by home schoolers, and a number of families home school for religious reasons in our county. I thought it would be a breeze to hook up with other home schoolers, but unfortunately that was not the case. Many of them told me that they were too busy with large families, lessons, co-ops, etc to really do a home school group. I did school at home until I couldn&#39;t stand it and we followed my son&#39;s interests. The problem was always the socialization part. He wanted friends, but I could not provide them. He had friends from his previous school over on weekends, but I could not do anything during the week. I also had a one year old at the time, which made it harder to get out, but I still tried. He seemed very lonely and sad that he did not have friends around his own age. I convinced him to give our home school a chance for this year. <br/>\n<br/>\n<br/>\n<br/>\nI would like to home school Thomas after this school year as I have seen a number of problems with school this year. Things stared out wonderfully, then went down hill mid year. He is well behaved, but is special needs in a mainstream classroom. He is considered too high functioning to be with other autistic and special needs students. He comes home with worksheets not done, and little notes asking us to complete them at home. He starts to cry when I pull out these worksheets to be completed. He tells me he does not understand assignments and calls himself stupid. Bullying started up again in January. The school and I are in constant communication/ IEP meetings about these issues, but the problems are still there. He makes up various reasons not to attend school, and I allow him to stay home. When I ask him about home schooling again, he tells me he wants to go to school and home school. He tells me school is boring, but his sister gets on his nerves and<br/>\n he will miss his school friends. <br/>\n<br/>\n<br/>\n<br/>\nIs my eight year old capable of making this type of decision? Does anyone else in the group have problem finding friends for their children, and if so, how do you address that? We are in Southern Maryland which is s fairly rural area, but does present some great opportunities for learning. Will he gradually get use to not having people his age around him.<br/>\n<br/>\n<br/>\n<br/>\nThank you for your time and input,<br/>\n<br/>\n  Mary <br/>\n<br/>\n<br/>\n<br/>\n------------ --------- --------- --------- --------- --------- -<br/>\n<br/>\n<br/>\n<br/>\nNo virus found in this incoming message.<br/>\n<br/>\n  Checked by AVG - www.avg.com <br/>\n<br/>\n  Version: 8.5.339 / Virus Database: 270.12.34/2122 - Release Date: 05/19/09 06:21:00<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n      <br/>\n<br/>\n    <br/>\n    <br/>\n\t<br/>\n\t <br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t<br/>\n<br/>\n<br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]}],"prevTopicId":40255,"nextTopicId":40265}}