{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":46477013,"authorName":"Ulrike Haupt","from":"&quot;Ulrike Haupt&quot; &lt;rica@...&gt;","profile":"ulrikehaupt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"just a little appreciation","postDate":"1091644747","msgId":2517,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwODAwMWM0N2E1MiQ3ZDJmYWQ0MCQ5ZmY5ZmVhOUBoYXVwdD4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":2516,"nextInTime":2518,"topicId":2517,"numMessagesInTopic":0,"msgSnippet":"Dear friends Since I only joined this list a couple of days ago, I don t really have the hang of all the concerns of the list yet. From your many posts though","messageBody":"<div id=\"ygrps-yiv-1715725991\">Dear friends<br/>\n<br/>\nSince I only joined this list a couple of days ago, I don&#39;t really have the<br/>\nhang of all the concerns of the list yet. From your many posts though I do<br/>\nget a lot of valuable input already. Most of it is very, very reassuring to<br/>\nme.<br/>\n<br/>\nWhat I find absolutely fascinating is that some of you are talking about<br/>\nhomeschooling / unschooling for kids the age of under five or six years of<br/>\nage. Ok, I take this back. Alexander grew up in great freedom and when he<br/>\nwas about five, half a year before he was due to start ordinary public<br/>\nschool I managed to get him into a &#39;kindergarten&#39; for some social<br/>\ninteraction. He hated it and I DID NOT CATCH IT then. My mistake. :) So it<br/>\ntook us another three years of bs to come to the first decision of<br/>\n&#39;homeschooling&#39; without a fixed curriculum and after a while another 7<br/>\nmonths of trying another type of school to unschool for good. For<br/>\nappearances sake I bought a couple of books of his &#39;current standard&#39; but I<br/>\nhave lots and lots of other books on all types of subjects as well as<br/>\ninternet so on the account of &#39;availability of knowledge&#39; I can&#39;t be caught<br/>\nout. (This is about me, not Alexander :))<br/>\n<br/>\nWell, within a very short time of &#39;free flowing&#39; Alexander lost ALL<br/>\nanti-school symptoms. Hurrah!<br/>\nHe basically follows his bliss (as I do too! :)) and has his own timing and<br/>\nschedule (180 degrees from us - sleeping days and waking nights LOL) I love<br/>\nwatching his endeavours. His &#39;days&#39; are filled with action! Computer= games,<br/>\ndesigns, music, TV, recording and playbacks of his favourite series (Bey<br/>\nBlades), designing games - whatever is the current favour - Bey Blades,<br/>\ndesigning things (bey blades from Legos) or games, building tree houses,<br/>\nflying kites, creating music on the keyboard, reading (comics and other<br/>\nstuff), angling at the nearby dam, designing and building the 50th odd wire<br/>\ncar, design a game on the computer, starting a window garden, watching the<br/>\ncat getting babies, calling his friend about the latest bay blades series,<br/>\nhaving an hour long bath, demanding me to design a computer game with bey<br/>\nblades for him, (This involves much too much writing and basically he wants<br/>\nme to design it for him! :) btw. I&#39;m not going to write his games for hi, He<br/>\ncan do it for himself.)<br/>\n<br/>\nAt this very moment he is - listening to the latest recorded bye blades<br/>\nepisode and building a bey blade arena - for testing- from a piece of<br/>\ncardboard. This is to be covered with paper mache - pieces of torn newspaper<br/>\nwith a glue from starch and water - which involves some trial and error<br/>\nexperiences. - something he hates with a vengeance :) To keep an even<br/>\ntemper, when the little one gets all upset because something does not work<br/>\nout immediately takes a lot of patients with myself -each time. For me the<br/>\nmagic wand is EFT (emotional freedom technique - see www.emofree.com - where<br/>\nI can switch from anti to pro with the setup statement of &quot;Even though this<br/>\nis an issue, I deeply and completely accept myself&quot;<br/>\n<br/>\nbtw. with this same statement - Even though this is the issue (name it), I&#39;m<br/>\nOK, - I could assist a little friend of Alexander a few days ago to get a<br/>\nbetter handle on his slightly  difficult family life.<br/>\n<br/>\nAll in all I find that the more in harmony I come with myself and my own<br/>\ndesires and wishes and issues the easier it is to live with Alexander and<br/>\nthe more exciting the adventures get that Alexander gets into on his own<br/>\nroad to &#39;know&#39; what he wants and needs to know.<br/>\n<br/>\nbtw did I mention bey blades? They seem to be wonderful as unschooling<br/>\nteaching aids for - maths, static&#39;s, social interaction, designing<br/>\nstructures, finding fun, crafts techniques, technology, routine, persistence<br/>\nand patience, marketing (getting dad to buy him something he wants NOW!) and<br/>\nmany other areas of learning general life skills. :)<br/>\n<br/>\nI do know that he is quite proficient already in many areas that were closed<br/>\nbooks for me and my younger brothers at the same age he is now. He knows<br/>\nlots about plumbing, electricity (AC and DC), he can do soldering and<br/>\nwelding (electric), can handle any power tool in his dad&#39;s workshop, builds<br/>\nwire cars with astonishing accuracy and moveability, draws freehand and with<br/>\nthe computer designs (also 3D),  plays music (two hands all fingers on the<br/>\nkeyboard) from remembered tunes and composes his own tunes on the computer<br/>\nor keyboard, learns to play any game on his own and gets the games cheats<br/>\nfrom the internet within 24 hours or less, designs animations on various<br/>\nplatforms all on his own..<br/>\n<br/>\nDo you get that I am absolutely thrilled with living with Alexander? I think<br/>\nhe is a genius. And not only on one subject but an all-round genius, too. He<br/>\nhas wonderful control over his body (climbs all kinds of trees, and jumps<br/>\nand runs and moves with grace) and his mind (talks and reads, and thinks and<br/>\nargues) and is interested in getting his emotions under control, too - asks<br/>\nhow to feel best when the going gets a little bit difficult. :)<br/>\n<br/>\nOK, why am I really writing this? I want to get into the best feeling<br/>\nposition for myself about this whole situation. Taken in the context of<br/>\nAlexander and I this is wonderful. But what about the &#39;governing<br/>\ninstitutions? Ah, when I know that I am the only governing institution that<br/>\ncounts in the end, then I&#39;ll be a vibrational match to &#39;no issue on<br/>\neducational matters.&#39; Ok, this is directly applied science of deliberate<br/>\ncreation and art of allowing from the Abraham-Hicks materials. And this is<br/>\nwhat my joining you boiled down to basically.<br/>\n<br/>\nThank you for reading/listening.<br/>\n<br/>\nBlessed be<br/>\nUlrike</div>","specialLinks":[]}],"prevTopicId":2476,"nextTopicId":2471}}