{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Intro--very long and mildly narcissistic","postDate":"1150307155","msgId":14556,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFFMjFBREEyLTk0MTMtNEM1Qi1CQzAzLUMyOUY0NEJGQTBFREBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGU2cDRrZSttbjU1QGVHcm91cHMuY29tPg==","referencesHeader":"PGU2cDRrZSttbjU1QGVHcm91cHMuY29tPg=="},"prevInTopic":14544,"nextInTopic":0,"prevInTime":14555,"nextInTime":14557,"topicId":14535,"numMessagesInTopic":0,"msgSnippet":"... You were schooled, right? So you can t compare what you would have sought to learn with what an unschooled kid might seek to learn. It just doesn t work","messageBody":"<div id=\"ygrps-yiv-1731959773\">On Jun 14, 2006, at 6:57 AM, freepsgal wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I value seeking knowledge from those who have it and having them<br/>\n&gt;&gt; share it with me.  For this reason I am a bit torn because I<br/>\n&gt;&gt; recognize today that there was plenty of knowledge that I would<br/>\n&gt;&gt; not have sought to learn when I needed it, but that I had<br/>\n&gt;&gt; acquired as a child.<br/>\n<br/>\n </span></blockquote>You were schooled, right? So you can&#39;t compare what &quot;you&quot; would have  <br/>\nsought to learn with what an unschooled kid might seek to learn.<br/>\n<br/>\nIt just doesn&#39;t work the same way for these kids - they are different.<br/>\n<br/>\nYou say you value seeking knowledge from those who have it and having  <br/>\nthem share it with you -- that is a way of life for unschoolers,  <br/>\nevery person around them is seen as a resource for learning something  <br/>\ninteresting and potentially valuable.<br/>\n<br/>\nWhen kids are little, their focus is on physical skills - sitting up,  <br/>\nwalking, etc. Then they turn more to communication and relationships  <br/>\n- talking and empathy. Then there is an age range in which kids tend  <br/>\nto be &quot;fact-gatherers&quot; - usually around ages 8 to 11 or so. They  <br/>\noften LOVE information, at that age, and tend to be very concrete,  <br/>\nnot interested so much in analyzing stuff, but more interested in  <br/>\ngaining knowledge. Then they get into more abstract thinking - great  <br/>\nbig ideas and also how everything fits together.<br/>\n<br/>\nUnschooled kids don&#39;t ever really exit these stages - when they hit  <br/>\nthe more abstract thinking stage, they just add that new ability/ <br/>\ninterest to the concrete information-gathering they were already  <br/>\ndoing, for example.<br/>\n<br/>\nI think they tend to be more integrated in some way - it is hard for  <br/>\nme to explain what I mean, but I&#39;ve seen it over and over. The 18  <br/>\nyear old unschooler still has the enthusiasm and energy for trying  <br/>\nthings that she/he had at 1 year old when learning to walk and at 5  <br/>\nor 6 when learning to ride a bike. He/she still has the awareness of  <br/>\nbecoming more and more empathetic and communicating more clearly - a  <br/>\nprocess that started as a toddler. AND he/she still loves information  <br/>\n- looks at the whole world as a sort of natural museum, like those  <br/>\nfact-gathering 10 year olds, and has added to all that an ability to  <br/>\nput it all into perspective, to analyze, to choose consciously, to  <br/>\nthink critically.<br/>\n<br/>\n-pam<br/>\n<br/>\nUnschooling shirts, cups, bumper stickers, bags...<br/>\nLive Love Learn<br/>\nUNSCHOOL!<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cafepress.com/livelovelearn\">http://www.cafepress.com/livelovelearn</a>&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":244909672,"authorName":"freepsgal","from":"&quot;freepsgal&quot; &lt;freepsgal@...&gt;","profile":"freepsgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Intro--very long and mildly narcissistic","postDate":"1150293454","msgId":14544,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2cDRrZSttbjU1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMjgwMWM2OGZhYSQyYzBmNzJhMCQwMjAyYThjMEBNYWluPg=="},"prevInTopic":14535,"nextInTopic":14556,"prevInTime":14543,"nextInTime":14545,"topicId":14535,"numMessagesInTopic":0,"msgSnippet":"... Okay, yes, now I do feel like I m being stalked!!  How many yahoo groups is this now??  Oh go on and say it Mary Alice, repeat after me:  I AM AN","messageBody":"<div id=\"ygrps-yiv-1638186176\"><blockquote><span title=\"ireply\">&gt; Okay, now Beth is really gonna think I am stalking her. (just take<br/>\n&gt; it as the vote of confidence that it is..&lt;g&gt;)<br/>\n<br/>\n </span></blockquote>Okay, yes, now I do feel like I&#39;m being stalked!!  How many yahoo <br/>\ngroups is this now??  Oh go on and say it Mary Alice, repeat after <br/>\nme:  I AM AN UNSCHOOLER and my children are wonderful!  :)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I value academia and organized instruction, I do.<br/>\n<br/>\n </span></blockquote>Notice this is an &quot;I&quot; statement.  Just because you value it does not <br/>\nmean your children will or should value it as well.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I value seeking knowledge from those who have it and having them<br/>\n&gt; share it with me.  For this reason I am a bit torn because I<br/>\n&gt; recognize today that there was plenty of knowledge that I would<br/>\n&gt; not have sought to learn when I needed it, but that I had<br/>\n&gt; acquired as a child.<br/>\n<br/>\n </span></blockquote>You can&#39;t know that because you weren&#39;t in that position.  Stop and <br/>\nthink about this a moment... when your boys have wanted to know <br/>\nsomething, have they truly given up before finding out because it <br/>\nseems schoolish to learn something?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My biggest problem is not feeling like the underachiever I always<br/>\n&gt; have been when <br/>\n<br/>\n </span></blockquote>Mary Alice, look at what you wrote!  &quot;I always have been&quot;  ??  <br/>\nFirst, you&#39;re probably being too hard on yourself.  Second, you&#39;re <br/>\ncomparing yourself to others within a schoolish mentality.  Third, <br/>\nyou&#39;re passing your baggage onto your children.  You probably feel <br/>\nthe way you do because of the way you were raised and all of your <br/>\nexperiences.  Right?  Your boys are not being raised under the same <br/>\nset of circumstances!  They are wonderful!  And I can say that <br/>\nbecause I actually have met them.  *laugh*<br/>\n<br/>\nYou are an unschooler wanna-be.  You&#39;ve got what it takes but you <br/>\nare just hanging onto those last few threads of traditional crap <br/>\nthat you just can&#39;t seem to let go of.  The funny thing is that your <br/>\nDH and boys are definitely *there*, you just have trouble defining <br/>\nyourself that way!  :)<br/>\n<br/>\nI&#39;ve got to get together with you soon.  I&#39;d love to let you borrow <br/>\nmy Parenting a Free Child book by Rue Kream, IF you promise to give <br/>\nit back!!!  *grin*<br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":68754254,"authorName":"Mary Alice","from":"&quot;Mary Alice&quot; &lt;mapraelm@...&gt;","profile":"meri_aliss","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Intro--very long and mildly narcissistic","postDate":"1150286447","msgId":14535,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjgwMWM2OGZhYSQyYzBmNzJhMCQwMjAyYThjMEBNYWluPg=="},"prevInTopic":0,"nextInTopic":14544,"prevInTime":14534,"nextInTime":14536,"topicId":14535,"numMessagesInTopic":0,"msgSnippet":"Okay, now Beth is really gonna think I am stalking her. (just take it as the vote of confidence that it is.. ) I am Mary Alice, full time mother-baby nurse","messageBody":"<div id=\"ygrps-yiv-1137961554\">Okay, now Beth is really gonna think I am stalking her. (just take it as the<br/>\nvote of confidence that it is..&lt;g&gt;)<br/>\n<br/>\n <br/>\n<br/>\nI am Mary Alice, full time mother-baby nurse by night, wife to Mike the HVAC<br/>\nbusiness owner and mother to 2 boys by day (and night)!<br/>\n<br/>\nThe older of the two is 11 and was in ps until halfway through 4th<br/>\ngrade-pulled him out in November of &#39;04 because I didn&#39;t see the rewards<br/>\ninherent in breaking his spirit in order to help him fit into a classroom.<br/>\nThe year before had been the one good year of school he had-it was really<br/>\nuplifting-and I thought we were on an upswing. We had always known about<br/>\nhsing, but I was in school full time and acknowledged that ps was an<br/>\naffordable option to facilitate that-free daycare and only that. As he got<br/>\nolder I think I lost sight of that mentality and started to buy into the<br/>\nidea that schooling was a precious resource and stopped questioning their<br/>\nsacred cow. Plus, I graduated and started working full time. And then we had<br/>\na great year in which E blossomed and bloomed into a self-confident,<br/>\nresponsible young man! He loved his teacher, he enjoyed school. The next<br/>\nyear we were back to the taming of the child to fit into the classroom. We&#39;d<br/>\nhad enough. It was actually DH&#39;s idea to bring him home! I wasn&#39;t sure I<br/>\ncould handle the pressure! But much like the time he brought our newborn<br/>\nnursling to our bed and said, &quot;Why don&#39;t you just let him sleep with us?&quot; to<br/>\nmy great surprise, I didn&#39;t balk and ran with it!<br/>\n<br/>\n <br/>\n<br/>\nI had dreamed of never ever sending my little one to school. But then I<br/>\nneeded somebody to take care of him while I was sleeping for my night shift,<br/>\nand last year he stayed in the day care we loved for pre-k because he just<br/>\nadored his teachers and his classmates and was really grooving on the<br/>\nstructure of it all. No problem there. He knew he&#39;d have more fun there than<br/>\nhe would at home while I slept! I almost sent him to Kindergarten this past<br/>\nautumn and just couldn&#39;t bring myself to do that to him! At least not just<br/>\nbecause I was afraid I couldn&#39;t teach him how to read! (How unlike me,<br/>\nreally! I can do anything!)<br/>\n<br/>\n <br/>\n<br/>\nDH works all day and owns his own business (with partners thank goodness)<br/>\nand he&#39;s the one who calms me down and says things like, &quot;We can&#39;t stop them<br/>\nfrom learning. When does school end and life begin? It doesn&#39;t!&quot; I have<br/>\nstrewn his path with AP and other ideas and although in the normal course of<br/>\nevents I think he never would have encountered these ideas, he has run with<br/>\nthem-like discussing homebirth (not that we&#39;ve done it) or breastfeeding<br/>\nwith his construction buddies when one of them announces an impending baby!<br/>\nHe has intuitively accepted that children are people and love learning and<br/>\nthank goodness I have him to convert theory to practice for me. I panic in<br/>\nthe moment. <br/>\n<br/>\n <br/>\n<br/>\nWe have mostly unschooled the whole time, or less-schooled. I brought Elijah<br/>\nhome with the sole intention (and I need to remember this!) that if he gains<br/>\nnothing else he will maintain his mental health. I think I lost what little<br/>\nI might have had (raised by an absent recovering alcoholic and a manic<br/>\ndepressive genius) by having to fit into a classroom. Nobody cared if I<br/>\nlearned anything-and they all knew intuitively that I grasped everything<br/>\npresented-and yet it was like they *had* to get something over on me, they<br/>\n*had* to gain the upper hand on one thing. I see that now. I totally did not<br/>\nsee it then. All I saw was that I was the exception to the rule, every rule<br/>\nand was therefore useless in society, or at least homeless. But I digress.<br/>\n<br/>\n <br/>\n<br/>\nI value academia and organized instruction, I do. I value seeking knowledge<br/>\nfrom those who have it and having them share it with me.  For this reason I<br/>\nam a bit torn because I recognize today that there was plenty of knowledge<br/>\nthat I would not have sought to learn when I needed it, but that I had<br/>\nacquired as a child. I am grateful for my grasp of grammar and usage, but I<br/>\nam not sure, if I had never encountered it I would have taken the time later<br/>\nto learn it. However, had *my* mother unschooled me, I would have learned it<br/>\nanyway because she would have continued to correct my grammar ant that of<br/>\nany radio announcers or written media she encountered! So I need to learn to<br/>\ntrust that my children are steeped in my values simply by living with me and<br/>\nare likely to therefore value what I value. I never read much as a child<br/>\nbeyond picture books but everyone I loved did. When my attention span and<br/>\nlifestyle allowed it, I became the avid reader I had always dreamed of<br/>\nbecoming. I think osmosis and immersion really does work a lot more<br/>\nprofoundly than forced application. <br/>\n<br/>\n <br/>\n<br/>\nBut.<br/>\n<br/>\n <br/>\n<br/>\nMy biggest problem is not feeling like the underachiever I always have been<br/>\nwhen people ask me in awe, &quot;How do you do it?&quot; Because all I ever want to<br/>\nsay is, &quot;I don&#39;t do it, they do!&quot; People ask me, &quot;when do you sleep-when do<br/>\nyou teach?&quot; I skirt the questions with, &quot;They have things they can do while<br/>\nI am sleeping.&quot; Now that I write this, I see the parallel I need to draw.<br/>\nWhen I nursed them both for 3+ years each, I avoided many a conflict simply<br/>\nby not volunteering information that was not public knowledge.  Granted, it<br/>\nwas a safety issue for me, as I didn&#39;t want to have to defend my parenting<br/>\npractices every time I turned around. But it also made sure that by not<br/>\noffering up my lifestyle choices to public scrutiny, I was not asking for<br/>\napproval. I need to do that now, with this lifestyle choice. I need to<br/>\nsettle into it and trust it like I did the attachment of babyhood and<br/>\ntoddlerhood. Sending my kids away really interrupted the natural progression<br/>\nof immersion that was our life together. At least now I have it back! I am<br/>\nonly just realizing this since I started embracing unschooling-embracing my<br/>\nboys as they are.   <br/>\n<br/>\n <br/>\n<br/>\nMary Alice Madaris<br/>\n<br/>\nMother and Facilitator to Elijah and Noah<br/>\n<br/>\nWife and partner to Mike<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":14553,"nextTopicId":14563}}