{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":78282269,"authorName":"Deb","from":"&quot;Deb&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Family issues...","postDate":"1188248246","msgId":26021,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZhdmRybSs4aWUyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY0OTk2OS4zMDM0NS5xbUB3ZWIzMzEwMy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":26019,"nextInTopic":0,"prevInTime":26020,"nextInTime":26022,"topicId":26019,"numMessagesInTopic":0,"msgSnippet":"That can be tough. We ve found that tackling it head on ahead of time is the best tack to take with DS (he s 9). So, we bring up stuff like Auntie is probably","messageBody":"<div id=\"ygrps-yiv-1840495955\">That can be tough. We&#39;ve found that tackling it head on ahead of <br/>\ntime is the best tack to take with DS (he&#39;s 9). So, we bring up <br/>\nstuff like &quot;Auntie is probably going to tell T that he has to eat <br/>\nhis hot dog before he has cake. That&#39;s not something we do but <br/>\nthat&#39;s the way they run their family.&quot; (okay not so stilted and <br/>\nwordy but you get the drift) That way we can handle the &quot;that&#39;s so <br/>\nnot fair&quot; and &quot;That&#39;s really dumb&quot; type comments and get that talked <br/>\nout before we get where we are going. We&#39;ve been doing that sort of <br/>\nthing since DS got old enough to notice (somewhere between 5 and 7). <br/>\nHe&#39;s goteen more and more observant and more able to recognize the <br/>\ndifferences between his life and the lives of kids (and people in <br/>\ngeneral) around him. It&#39;s given rise to some interesting discussions <br/>\nand comments like &quot;Other parents might make me &lt;do this&gt;. I&#39;m really <br/>\nglad I don&#39;t have to do that.&quot; Now he&#39;s older we do stuff like &quot;Hey <br/>\nlet&#39;s have a family pool -everybody guess how many times we&#39;ll hear <br/>\na parent tell their kid No&quot; and he knows to keep it between us (BTW <br/>\nhe won the last pool - he said there&#39;d be 25 No&#39;s at his cousin&#39;s <br/>\n4th birthday party where there were about 9 or 10 kids all between <br/>\nages 2 and 9. There were only about 16 - DH and I picked higher so <br/>\nDS won).<br/>\n<br/>\nAll that to say, discuss things ahead of time and provide <br/>\nappropriate wording that can be used &quot;Gee that&#39;s a movie I really <br/>\nlike. Maybe sometime you can come over and watch it with me and then <br/>\ndecide&quot; I&#39;d focus more on the language choices (avoiding stupid, <br/>\ndumb, etc) than the content, since the content is true - a decision <br/>\nwas made on the first 5 minutes of a movie based on the discomfort <br/>\nlevel/judgement of one person rather than saying &quot;Let me watch all <br/>\nof this first so I can check for problem areas we need to skip <br/>\nthrough&quot; or &quot;let&#39;s check reviews on this website&quot; or whatever. And, <br/>\nmaybe even (with appropriate language) rather than you trying to <br/>\nexplain, go right to the source - ask Uncle (politely) what it was <br/>\nhe found offensive since that might be the only time x happens in <br/>\nthe movie.<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":204429098,"authorName":"neha","from":"neha &lt;nishaysmom@...&gt;","profile":"nishaysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Family issues...","postDate":"1188244810","msgId":26019,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY0OTk2OS4zMDM0NS5xbUB3ZWIzMzEwMy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":26021,"prevInTime":26018,"nextInTime":26020,"topicId":26019,"numMessagesInTopic":0,"msgSnippet":"Hi All, I am a LONG time lurker on this list and have benefitted tremendously! We are unschoolers - Nishay is my older son who is 7 and I have a younger, Neer,","messageBody":"<div id=\"ygrps-yiv-1729452437\">Hi All,<br/>\n   <br/>\n  I am a LONG time lurker on this list and have benefitted tremendously! We are unschoolers - Nishay is my older son who is 7 and I have a younger, Neer, 10mo. We live near our pretty conservative relatives and have had a few small issues come up a few times. I was hoping to get feedback, insight and other&#39;s experience on it.....<br/>\n   <br/>\n  We went to my sister in laws house this weekend..... it was an interesting trip!<br/>\n  All was well initially - the kids had met after quite sometime, so took a bit warming up to each other, but then they were off! <br/>\n   <br/>\n  Nishay&#39;s aunt had asked me what she could get him for his bday, and I had suggested the High School Musical CD or DVD or something from Disney Channel. She did get him the HSM CD and Nishay was thrilled! He asked his cousins if they had seen the movies & their mom answered that they were going to but their dad thought it wasn&#39;t appropriate after watching the first 5 minutes or so. (I silently went ..&quot;uh oh&quot;)...Nishay was very surprised - he said to his aunt - &quot;But the movies are for kids - they are really good&quot;. His aunt was like - yeah...... But he persisted & I told him to let it go and that we&#39;d talk about it later and maybe they could go play something .... He persisted and I took him aside and gently commiserated with him and said that other families do things differently and even if we don&#39;t agree - we have to let it go. He PERSISTED...&#39;But, WHY, mamma, WHY? He (cousin&#39;s dad) didn&#39;t even watch the show, how does he know it&#39;s not ok? You can&#39;t tell after watching<br/>\n just five minutes!&quot;... To make a long story short, I mamnaged to distract him and we spent the rest of the evening relatively peacefully ..... except as we were about to leave, there was an ad for HSM on TV (it was going to play next) and Nishay started again - &#39;It&#39;s coming on - they should watch it - Mamma - I want to watch a few minutes before we leave&#39; (because he wanted to make sure his cousins saw it). &quot;It&#39;s my favorite movie and I want them to see it....&quot; On & on.....<br/>\n   <br/>\n  We finally got into the car to leave & Nishay continued to vent &quot;Mamma, it doesn&#39;t make sense - How can he decide in just 5 minutes? He didn&#39;t even watch the movie? My cousins wanted to watch it - why is he forcing them? It should be their decision&quot; (again, etc etc!).<br/>\n   <br/>\n  I again commiserated and told him I totally agreed with him. He kept asking me WHY? I told him sometimes things dont make sense to us & there is a good chance that a lot of things we do don&#39;t make sense to them - but they are not forcing us or passing judgement (at least not to our face;)) - and we owe them the same respect.<br/>\n   <br/>\n  After a while, it calmed down & I started the new CD, that we all enjoyed on the drive home.<br/>\n   <br/>\n  SO! My questions!<br/>\n  At one point - Nishay said &#39;They are the worst parents EVER!&#39;. That got Nitin (dh) & me a bit concerned. Fortunately we were in the car when he said that - but I can see him saying that in front of the parents. Nitin feels apprehensive about that. He was saying that we know he is thinking & saying all this all by himself - but traditional parents will think he is saying what he heard his parents say. If they think that ( & even if they dont think that, but just hear Nishay say it), that wouldn&#39;t/couldn&#39;t be good for a relationship?! <br/>\n  How do you explain that to a 7 yo? Propriety? Can I realistically/developmentally expect him to understand? <br/>\n   <br/>\n  And secondly, how could I handle such a situation in the future? Should I have done anything differently? <br/>\n   <br/>\n  Any other feedback?<br/>\n<br/>\n<br/>\n* <br/>\n* <br/>\n* <br/>\n* <br/>\n* <br/>\n* <br/>\n  *<br/>\n  *<br/>\n  *<br/>\n<br/>\nEducationis a process of living and not a preparation for future living. -- John Dewey <br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n  <br/>\n<br/>\n  *************************<br/>\nOrganic food delivered!<br/>\n  diamondorganics.com<br/>\n   <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nBe a better Heartthrob. Get better relationship answers from someone who knows.<br/>\nYahoo! Answers - Check it out. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":25929,"nextTopicId":25989}}