{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":197017321,"authorName":"Tracey Inman","from":"&quot;Tracey Inman&quot; &lt;traceyi@...&gt;","profile":"tracey_inman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"OT-Appointing Guardians/Insurance","postDate":"1166540702","msgId":19927,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PCEmIUFBQUFBQUFBQUFBWUFBQUFBQUFBQU1KSWxSaGorQlZIaW5NaGo3eEZPSnZDZ0FBQUVBQUFBTW9tT2NHRnNpSkxqRWY4VmUvU2h2RUJBQUFBQUE9PUBzY2NvYXN0Lm5ldD4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":19926,"nextInTime":19928,"topicId":19927,"numMessagesInTopic":0,"msgSnippet":"... insurance. I had ALL (acute lymphocytic leuk) when I was in my TWENTIES (I am almost in my 40 s now) and they still will not write me a policy! I am so ","messageBody":"<div id=\"ygrps-yiv-637347011\"><blockquote><span title=\"ireply\">&gt;&gt;You are SO RIGHT. Unfortunately, no insurance company will give me life <br/>\n </span></blockquote>insurance. I had ALL (acute lymphocytic leuk) when I was in my TWENTIES (I<br/>\nam <br/>\nalmost in my 40&#39;s now) and they still will not write me a policy! I am so <br/>\ntotally in remission. As a matter of fact, people I know who were never sick<br/>\nare <br/>\nway more at risk for dropping dead soon than I am being that I care for my<br/>\nbody <br/>\nwith such great thought! GRRR. It is such a disappointment :-(&lt;&lt;<br/>\n<br/>\n <br/>\n<br/>\nJust so happens insurance is what I do for a living and I am here to bring<br/>\nyou good news!  In spite of your health, you can have life insurance.  There<br/>\nare some companies that will write you a &quot;guarantee issue&quot; life policy.<br/>\nThat means regardless of your health you will get issued.  There is<br/>\ngenerally a 3 year window where if you die from health issues your<br/>\nbeneficiary will only receive your premiums back plus some interest.  But,<br/>\nif you die from an accident then the full face amount will be given.  It is<br/>\na little harder to find when you are under 40 yo because you need to be<br/>\ncareful what company you use and that the AM Best rating is at least an &#39;A&#39;<br/>\nHowever once you turn 46 I know of a couple great companies you could look<br/>\ninto.  <br/>\n<br/>\n <br/>\n<br/>\nAnother way to guarantee you have life insurance is if you or your spouse is<br/>\nworking where they offer benefits.  Work term life is cheap, cheap, cheap.<br/>\nMax out on it!  Don&#39;t let it be all you have,  especially if you are healthy<br/>\nbecause with work policies you won&#39;t own them and you loose them when you<br/>\nleave.  You always need to have something you own and I recommend that part<br/>\nof what you do is a Whole Life policy paid up at 65.  When you are our age,<br/>\nyou generally need to couple that with a larger Term policy to meet the<br/>\nneeds at the time.<br/>\n<br/>\n <br/>\n<br/>\nMy dh and I have my sister and her dh as guardians should something happen<br/>\nto both of us.  We have made provisions through life insurance to make sure<br/>\nmy sister would have plenty to raise them and there is enough to be set<br/>\naside for both of our girls to begin there lives.  We have also made it<br/>\nclear that my sister is to sell her home ( and ours) and build or find a<br/>\nhome with land that would accommodate our animals in their area.  That is<br/>\nvery important to our girls.  My sister actually brought this up to me (just<br/>\nso you don&#39;t think I am being overboard with my demands).  Unfortunately she<br/>\ndoes not understand nor choose to understand unschooling, but I know my<br/>\ngirls love her and her dh and emotionally they would take very good care of<br/>\nthem.  <br/>\n<br/>\n <br/>\n<br/>\nWow, I didn&#39;t mean to get so wordy.  As you can tell this is something I am<br/>\nVERY passionate about.  If anyone has specific questions and would like to<br/>\ne-mail me off list, please feel free. <br/>\n<br/>\n <br/>\n<br/>\nPeace,<br/>\n<br/>\nTracey - SC - Mom to Rachael (14) & Madison (11) <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":19898,"nextTopicId":19816}}