{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":217204862,"authorName":"Misty","from":"&quot;Misty&quot; &lt;misty@...&gt;","profile":"mistyfelner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Spelling... a few long thoughts","postDate":"1145912738","msgId":12416,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUyamVqMitmOWRkQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":12415,"nextInTime":12417,"topicId":12416,"numMessagesInTopic":0,"msgSnippet":"It s funny that this topic came up now.  I just started reading JOhn Holt s Learning All the Time , the first part of which deals with reading and writing and","messageBody":"<div id=\"ygrps-yiv-2014984796\">It&#39;s funny that this topic came up now.  I just started reading JOhn <br/>\nHolt&#39;s &quot;Learning All the Time&quot;, the first part of which deals with <br/>\nreading and writing and specifically with invented spelling.  As a <br/>\nteacher I can say that like everything else the views on approaches <br/>\nlike phonics, invented spelling, etc. is an ever swinging pendelum, <br/>\nconstantly changing.  So the concerns about learning to spell, or <br/>\nwrite, or whatever are completely unfounded.  There was a time about <br/>\n10 yrs. ago that the trend was to immerse a child completely in a <br/>\nprint rich environment and they would learn to read and write.  This <br/>\nwas the &quot;trend&quot; called Whole Language that was occuring while I was <br/>\nin college.  Does this approach sound familiar, I think it was as <br/>\nclose as a school as ever come to unschooling.  But, of course some <br/>\npower at be from above decided it wasn&#39;t working after only a couple <br/>\nof years and the pendelum swung again. My point in all this is that <br/>\neven if your child is in school there&#39;s no more reason to believe <br/>\nthat he will be a better speller.  My husband is a horrible speller <br/>\nand has terrible grammar.  I on the other hand was considered a good <br/>\nspeller growing up, but as an adult I find myself struggling at <br/>\ntimes, both of us grew up in public schools.  <br/>\n<br/>\nThis leads me to my second point.  Many people say that reading <br/>\nhelps you learn to spell.  Maybe for some, but I disagree with that <br/>\nfor me.  I must read the word restaurant several times a day, but <br/>\nstill I find often when I write my spell check catches that I write <br/>\nrestraunt.  So reading it often hasn&#39;t improved my spelling.  I came <br/>\nto have good &quot;English skills&quot; through my mother.  I vividly recall <br/>\nwriting papers in grade school, afterwards my mom would mark with <br/>\nbrackets the areas that had a mistake be it spelling, run-ons, <br/>\npunctuation whatever, and then would hand it back for me to find and <br/>\nfix.  So, again I didn&#39;t learn it through workbooks or school. <br/>\n(Though not exactly the unschooling way either).  Just from what <br/>\nI&#39;ve read I&#39;d reccomend reading &quot;Learning All the Time&quot;.<br/>\n<br/>\nI&#39;d never seen what Jennifer posted about only the first and last <br/>\nletter mattering, but I found it very interesting.  Being a teacher <br/>\nof the deaf I&#39;ve seen some very interesting invented spelling.   <br/>\nOften I get e-mails from deaf adults that my husband can&#39;t decipher <br/>\nb/c of the bad spelling and grammar he&#39;ll ask, &quot;is that English?&quot;  <br/>\nYet these are very intelligient people, some of whom have even <br/>\ntraveled the world.  Doesn&#39;t seem to stop them.<br/>\n<br/>\nJust thought I&#39;d share some thoughts.<br/>\n<br/>\nMisty</div>","specialLinks":[]}],"prevTopicId":11590,"nextTopicId":12422}}