{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":99652232,"authorName":"Lisa McAlister","from":"&quot;Lisa McAlister&quot; &lt;lisamcalister@...&gt;","profile":"mommy2ajmcam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: New member intro--sorry so long!","postDate":"1175083817","msgId":22747,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxOGYwMWM3NzEzMiQwZDBmMDRhMCQ2NDAwYThjMEBENTBZSlYzMT4=","referencesHeader":"PGV1N3UxcCs2NnZhQGVHcm91cHMuY29tPg=="},"prevInTopic":22554,"nextInTopic":0,"prevInTime":22746,"nextInTime":22748,"topicId":22459,"numMessagesInTopic":0,"msgSnippet":"Hi Rebecca--Luling is not far from where I am--maybe 30 miles!  Even though there are not a lot of unschoolers here, I guess I m a little biased, but there are","messageBody":"<div id=\"ygrps-yiv-1638514168\">Hi Rebecca--Luling is not far from where I am--maybe 30 miles!  Even though there are not a lot of unschoolers here, I guess I&#39;m a little biased, but there are so many homeschoolers, and the people around here are so nice.  I know many of my friends who have moved out of state think I&#39;m nuts to like it here, with the heat, humidity, and crooked politics, but I don&#39;t know, it seems like people here are friendlier and are much less judgmental about decisions we make for our family.  Kind of a live-and-let-live attitude.  It&#39;s also a very easy state to unschool in, b/c education is not exactly on the priority list :-)<br/>\nLisa<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: quinnannalisesmom <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\n  Sent: Monday, March 26, 2007 1:51 AM<br/>\n  Subject: [unschoolingbasics] Re: New member intro--sorry so long!<br/>\n<br/>\n<br/>\n  Hi Lisa! I&#39;m new here too. I live in Colorado now, but I grew up in <br/>\n  South Louisiana. Luling to be exact. <br/>\n<br/>\n  Rebecca<br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":294640976,"authorName":"quinnannalisesmom","from":"&quot;quinnannalisesmom&quot; &lt;roteameise@...&gt;","profile":"quinnannalisesmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New member intro--sorry so long!","postDate":"1174895481","msgId":22554,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGV1N3UxcCs2NnZhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMmMwMWM3NmQ2OCQ3MTI5Y2UyMCQ2NDAwYThjMEBENTBZSlYzMT4="},"prevInTopic":22526,"nextInTopic":22747,"prevInTime":22553,"nextInTime":22555,"topicId":22459,"numMessagesInTopic":0,"msgSnippet":"Hi Lisa!  I m new here too.  I live in Colorado now, but I grew up in South Louisiana.  Luling to be exact. Rebecca","messageBody":"<div id=\"ygrps-yiv-1890970735\">Hi Lisa!  I&#39;m new here too.  I live in Colorado now, but I grew up in <br/>\nSouth Louisiana.  Luling to be exact. <br/>\n<br/>\nRebecca</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: New member intro--sorry so long!","postDate":"1174845963","msgId":22526,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGV1NmRtYittZjY2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMmMwMWM3NmQ2OCQ3MTI5Y2UyMCQ2NDAwYThjMEBENTBZSlYzMT4="},"prevInTopic":22475,"nextInTopic":22554,"prevInTime":22525,"nextInTime":22527,"topicId":22459,"numMessagesInTopic":0,"msgSnippet":"... Its good that you know its your issue. Something that helped *me* move past being irritated by the sound of the tv and the sound of the heavy- metal music","messageBody":"<div id=\"ygrps-yiv-1607127070\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Lisa McAlister&quot; <br/>\n&lt;lisamcalister@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;We do have<br/>\n&gt;tvs, but no cable and it is not limited per se--I just can&#39;t stand <br/>\n&gt;the racket of<br/>\n&gt;it in the early<br/>\n&gt;morning, so I don&#39;t let them turn it on until after lunch b/c of my <br/>\n&gt;issues with<br/>\n&gt;the irritating racket it makes<br/>\n<br/>\n </span></blockquote>Its good that you know its your issue. Something that helped *me* move <br/>\npast being irritated by the sound of the tv and the sound of the heavy-<br/>\nmetal music my stepson loves is to think to myself &quot;this is the sound <br/>\nof my kid doing something that makes him/her happy&quot;. <br/>\n<br/>\n---Meredith (Mo 5, Ray 13)</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] New member intro--sorry so long!","postDate":"1174738162","msgId":22475,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENDQTFFRjhCLTU3MjEtNDM3NS1BMTgxLUJDNUFBQkNBOEJEREBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwMmMwMWM3NmQ2OCQ3MTI5Y2UyMCQ2NDAwYThjMEBENTBZSlYzMT4=","referencesHeader":"PDAwMmMwMWM3NmQ2OCQ3MTI5Y2UyMCQ2NDAwYThjMEBENTBZSlYzMT4="},"prevInTopic":22459,"nextInTopic":22526,"prevInTime":22474,"nextInTime":22476,"topicId":22459,"numMessagesInTopic":0,"msgSnippet":"... I think a more relationship building approach is to present the problem and ask for solutions. When we pick a solution and impose it, it often turns the","messageBody":"<div id=\"ygrps-yiv-1906848582\">On Mar 23, 2007, at 12:28 PM, Lisa McAlister wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I just can&#39;t stand the racket of it in the early<br/>\n&gt; morning, so I don&#39;t let them turn it on until after lunch<br/>\n<br/>\n </span></blockquote>I think a more relationship building approach is to present the  <br/>\nproblem and ask for solutions. When we pick a solution and impose it,  <br/>\nit often turns the children into a problem because they don&#39;t  <br/>\nnecessarily want to comply!<br/>\n<br/>\n*Sometimes* it&#39;s good to examine a problem we&#39;re having and recognize  <br/>\nthat it is *our* problem and not something to impose on others. We  <br/>\ncan learn to deal with it. Or find ways to minimize it.<br/>\n<br/>\nOr we can ask for help in solving it. By imposing a solution you&#39;re  <br/>\nsaying you don&#39;t trust that your kids care enough about you to help  <br/>\nyou. It&#39;s an effective technique to help someone towards *not* caring!<br/>\n<br/>\nIf your husband needed quiet for an hour when he got home and laid  <br/>\ndown rules and forced compliance with those rules, would you feel  <br/>\nmore like being quiet for him?<br/>\n<br/>\nWhat if he said he needed quiet and asked for help? What if he was  <br/>\nconstantly evaluating to see what worked and was being sensitive to  <br/>\nothers needs as well?<br/>\n<br/>\nWhich person would you want to help more?<br/>\n<br/>\nIf you trust them to want to help -- though they may need lots of  <br/>\nhelp remembering and lots of help working through the various  <br/>\nsolutions they come up with (treating them as though they&#39;re doing  <br/>\nthe best they can when they forget helps loads) -- they might come up  <br/>\nwith something more creative than you have. Maybe wireless  <br/>\nheadphones. Maybe headphones for you so you can listen to something  <br/>\nsoothing. Or something even more creative :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I spend way too much money on art supplies, as they all love to  <br/>\n&gt; draw, paint, color, etc.<br/>\n<br/>\n </span></blockquote>Why is it too much for something they enjoy? :-) Just something to  <br/>\nthink about.<br/>\n<br/>\nIf they were in school you&#39;d be spending a lot of money for stuff  <br/>\nthey hated! (It&#39;s surprising the amount of money it costs to send  <br/>\nkids to &quot;free&quot; public school: clothes, lunch money, field trip money,  <br/>\nsupplies (at many schools), back packs ...)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":99652232,"authorName":"Lisa McAlister","from":"&quot;Lisa McAlister&quot; &lt;lisamcalister@...&gt;","profile":"mommy2ajmcam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"New member intro--sorry so long!","postDate":"1174667290","msgId":22459,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmMwMWM3NmQ2OCQ3MTI5Y2UyMCQ2NDAwYThjMEBENTBZSlYzMT4="},"prevInTopic":0,"nextInTopic":22475,"prevInTime":22458,"nextInTime":22460,"topicId":22459,"numMessagesInTopic":0,"msgSnippet":"Hi everyone, I joined this list a few days ago and am delighted to find such a group! I have been married to dh Herman for 21 years, we three children, Andrew","messageBody":"<div id=\"ygrps-yiv-694635728\">Hi everyone,<br/>\nI joined this list a few days ago and am delighted to find such a group! I have been married to dh Herman for 21 years, we three children, Andrew 10, Claire 6 and Neil 3, and have been homeschooling/unschooling since birth.  We have a baby due in about 4 weeks.  Unschooling our kids just kind of evolved--Andrew was very high maintenance from birth (I think a traumatic c-section and separation had a lot to do with his early personality).  At the age of 5, I could not fathom him getting on a bus and spending 8 hours away from me at the local public school!  But this is what &quot;everyone&quot; does around here.  I knew he wouldn&#39;t go for it, and after spending the last 5 years letting go of everything I ever thought I knew about parenting, we just chose to keep him home, and carry on with our lives.  I discovered John Holt and thus began my journey in deschooling.  It just made so much sense that children learn how to walk, talk, eat, etc. without any help from us, why should that stop at the magical age of 5??<br/>\n<br/>\nI am a member of two wonderful homeschool groups and my children and I are very close friends with many members.  We enjoy a rich social life as part of these groups.  However, we are the *only* unschoolers.  I kind of keep a low profile, not wanting to get into philosophical arguments with anyone about the &quot;right&quot; way to do things.  Everyone is doing what they believe is right for their family, including us.  But it does get a little lonely, especially when curriculum discussions come =<br/>\nup, and they frequently do.  I try to &quot;zone out&quot; and think about how happy I am to not be constantly at odds with my kids, making them sit and do their work for the reward of free play, like most do.  At the moment, they are all gathered around the kitchen table playing Star Wars with legos and getting along (they fight alot LOL), so I&#39;m not messing with that!! <br/>\n<br/>\nDoubts do creep in sometimes, and I begin to worry that I&#39;m doing some experiment with my children that will ultimately fail them when they become adults.  But, on the flip side, like someone recently posted, I really don&#39;t attribute anything I learned in school to my success in college or in life in general.  I guess in my heart I know that they can succeed at anything they *really* want, they just have to want it badly enough.  I got my undergraduate and masters degrees while working as a part-time clerk at a hardware store.  I didn&#39;t start college until 3 years after my husband and I were married, and, did it with *no debt!*  not to mention, I never took all the college prep stuff in school.  Why can&#39;t my children do the same?<br/>\n<br/>\nAnyhow, just some other aside info about us--we are Catholic and very active in our church, we love to garden and live on 11 acres in the swamp in South Louisiana--chickens are our next project, lol.  I am a La Leche League leader, if anyone needs any off-list breastfeeding help ;-), my dh works in a chemical plant.,  Our kids aren&#39;t vaccinated, and we try to eat very healthy.  We do have tvs, but no cable and it is not limited per se--I just can&#39;t stand the racket of it in the early <br/>\nmorning, so I don&#39;t let them turn it on until after lunch b/c of my issues with the irritating racket it makes :-)  Guess that&#39;s limiting, but I just can&#39;t stand it myself, and I guess I impose that on my kids.  They usually watch the one upstairs, but I can still hear it.  However, they don&#39;t really like being upstairs--afraid they are going to miss something, so they don&#39;t watch much anyhow.  We don&#39;t have video games either, mainly as a money-saving thing, but they do enjoy playing them at friend&#39;s houses. They like to fish in our little pond.  Andrew is into whatever sport I&#39;m williing to shuffle him to--he is playing baseball and on swim team now and has been into watching MASH and learning about the Korean War.  Claire likes ballet and swim team and you  never see her without one of our 4 cats, or playing with our black lab Maggie, or chasing a toad.  Neil is obsessed with light sabers and Star Wars.  .We have PE twice a week at the local Y and their instructor is wonderful at integrating the kids of all ages--3 yo up to teens--into the games.  They really look forward to PE. I also like to quilt and I make baby slings to sell, usually only when I&#39;m &quot;advertising&quot; by packing a baby around in one, haha!  We check out tons of books from the library and read aloud a lot.  We do have some curriculum around--yikes!  But they do ask for it sometimes, and will sometimes work on stuff for several weeks, until something more exciting crops up!  Andrew is currently using the Italic handwriting series to improve his handwriting--it was starting to bother him, and totally self initiated.  I spend way too much money on art supplies, as they all love to draw, paint, color, etc.<br/>\n<br/>\nSo, that&#39;s us.  I look forward to reading more, it really is helping me maintain my confidence in the way we are doing things amid all the wonderful &quot;school at home&quot; families we hang out with!<br/>\n<br/>\nLisa in South Louisiana<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":22522,"nextTopicId":22577}}