{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":163221353,"authorName":"Tina","from":"&quot;Tina&quot; &lt;zoocrew@...&gt;","profile":"tina010871","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"&quot;Funny&quot; Unschooling Moments","postDate":"1124740689","msgId":6222,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRlZGFvaCtyNmJpQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":6221,"nextInTime":6223,"topicId":6222,"numMessagesInTopic":0,"msgSnippet":"As an unschooler I ve made an effort to see the fun and *learning* in every moment.  Lately, Adrian has had a few funny moments.  I thought some of you may","messageBody":"<div id=\"ygrps-yiv-1232202454\">As an unschooler I&#39;ve made an effort to see the fun and *learning* <br/>\nin every moment.  Lately, Adrian has had a few &quot;funny&quot; moments.  I <br/>\nthought some of you may find them humorous as well, any educational <br/>\ngain is a bi-product.  :)  <br/>\n<br/>\nMoment #1 - Adrian accompanied me on my vending machine route last <br/>\nweek.  I&#39;ve been in this habit of regularly checking his hair and <br/>\nlooking in his ears, one time I found a finger nail...go figure.  <br/>\nWell, this time I just happened to look over while we were at a red <br/>\nlight and noticed that there was something completely blocking his <br/>\near canal.  When we got home I looked further and could not figure <br/>\nwhat it could be.  <br/>\n<br/>\nThis quickly turned into a &quot;science experiment&quot;.  First we tried <br/>\ngetting it to move using peroxide.  The theory was the bubbles would <br/>\nhelp it move to the entrance of the ear canal.  Well, It did move, <br/>\nbut every time I tried to grab the object it would fall back in the <br/>\near.  <br/>\n<br/>\nAfter several attmpts, and not wanting to cause injury, we moved on <br/>\nto asking an &quot;expert&quot;.  That expert would be my good friend of 20+ <br/>\nyears who is a mother of six and someone we refer to when in need of <br/>\nhome remedies.  Our expert suggested that we flush the ear with <br/>\nwater, as that is what would be done in a doctor&#39;s office.  <br/>\n<br/>\nWe used a sqeezable bulb and squirted warm water into the ear as he <br/>\nleaned over the sink.  It worked.  Guess what came out?  A LEMON <br/>\nSEED!  Neither of us are quite certain as to how it got in his ear.  <br/>\nHe is 11 years old and knows the &quot;dangers&quot; of inserting foreign <br/>\nobjects into ears.  <br/>\n<br/>\nAfter further research we  discovered that a much younger child at <br/>\none time had stuck an orange seed up his nose so far and for so long <br/>\nthat it actually sprouted.  AND, we also discovered that Battleship <br/>\npieces inserted into each ear canal at age three and discovered at <br/>\nage nine do no real damage to one&#39;s ears.<br/>\n<br/>\nMoment #2 - This could be considered a follow up &quot;experiment&quot; to <br/>\nan &quot;experiment&quot; that took place a few years ago.  Adrian is very <br/>\nfond of pepperoncini peppers and eats them on a regular basis.  A <br/>\nfew years ago he discovered that pepper juice in one&#39;s eye is VERY <br/>\npainful.  The easiest remedy is to run to the nearest swimming pool <br/>\nand open your eyes under water for several minutes.  <br/>\n<br/>\nJust yesterday in the follow up &quot;experiment&quot; it was discovered that <br/>\npepper juice up the nose is not quite as painful as pepper juice in <br/>\nthe eye.  This is not to say that it is not painful, as it very well <br/>\nis.  The easiest remedy discovered is to run to the nearest sink.  <br/>\nQuickly run warm water, place your nostrils in the running water and <br/>\nsuck the water into your nose.  Blow the water out your nose.  <br/>\nRepeat until pain is relieved.<br/>\n<br/>\nThe above &quot;experiments&quot; were unplanned.  There was no curriculum <br/>\ninvolved, and were spontaneous events that occured through <br/>\nstrewing.  No one was permanently injured, and we have all had a few <br/>\ngood laughs.  Upon close examination there was several areas of <br/>\nlearning covered if one was so inclined to categorize the events.  <br/>\nYou wouldn&#39;t, or rather you just may, believe the conversations that <br/>\nhave come of these events.  See...learning really does occur in <br/>\neveryday life.  :)<br/>\n<br/>\nHaving fun in the moment...<br/>\n<br/>\nTina and Adrian</div>","specialLinks":[]}],"prevTopicId":6164,"nextTopicId":6221}}