{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:When do I help 4 yo. dd deal with 8 yo. dd shaming, criticism, namec","postDate":"1186189401","msgId":25468,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5MGo4cCtvanRyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgwMzI2RDIzOEQ2RDQ4NzdCRkY2MDk2QTYyNjc4MDI2QE1ZSFA+"},"prevInTopic":25460,"nextInTopic":0,"prevInTime":25467,"nextInTime":25469,"topicId":25460,"numMessagesInTopic":0,"msgSnippet":"~~Marla - when my kids have fought in a manner that is plain old mean - I grab them both and put them on my lap (harder to do these days) wrap my arms around","messageBody":"<div id=\"ygrps-yiv-1179586060\">~~Marla - when my kids have fought in a manner that is plain old mean<br/>\n- I grab them both and put them on my lap (harder to do these days)<br/>\nwrap my arms around them and tell them how much I love both of them. ~~<br/>\n<br/>\nI love this!<br/>\n<br/>\nThat works sometimes around here, depending on the intensity level and<br/>\nwhat exactly is unfolding. The times I&#39;ve done that, it usually<br/>\ndevolves into giggles or &quot;group hug&quot; or something similar and then<br/>\neveryone is in a better place to discuss how they are feeling.<br/>\n<br/>\nI think hugs and love can work great when anger starts to well up.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":94040812,"authorName":"Lisa Heyman","from":"&quot;Lisa Heyman&quot; &lt;Lmanathome@...&gt;","profile":"lmanathome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:When do I help 4 yo. dd deal with 8 yo. dd shaming, criticism, namec","postDate":"1186164444","msgId":25460,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExNS1EQVYxMTFDNUU3QkYxODkzQzNENkQyQTdERDFFQTBAcGh4LmdibD4="},"prevInTopic":0,"nextInTopic":25468,"prevInTime":25459,"nextInTime":25461,"topicId":25460,"numMessagesInTopic":0,"msgSnippet":"Marla - when my kids have fought in a manner that is plain old mean - I grab them both and put them on my lap (harder to do these days) wrap my arms around","messageBody":"<div id=\"ygrps-yiv-953855548\">Marla - when my kids have fought in a manner that is plain old mean - I grab<br/>\nthem both and put them on my lap (harder to do these days) wrap my arms<br/>\naround them and tell them how much I love both of them.  And if that is not<br/>\nenough to diffuse the moment, I will, like Ren, say that I don&#39;t want anyone<br/>\nto talk to any one of my kids in that way.  They both feel defended and<br/>\nloved at the same time.  And from there we can focus on a solution.<br/>\n<br/>\n <br/>\n<br/>\nI wonder if your older dd needs help reframing her words so that when she is<br/>\nfeeling immense anger or frustration with her younger sib that is expressed<br/>\nas an &#39;I hate you&#39; you can help to turn it around by acknowledging how much<br/>\nshe hates the situation.  I wouldn&#39;t attempt to devalue her feeling by a<br/>\ncorrective statement like, &quot;you don&#39;t hate your sib, you hate the<br/>\nsituation.&quot;  Because her truth in that moment is that her frustration and<br/>\nanger has her feeling hatred toward her sib.  This is a horrible thing to<br/>\nhear from your child about another one of your children.but she needs<br/>\nsomething big from you here.because I am guessing that hating her sib really<br/>\ndoesn&#39;t feel good to her in her heart as well.  So by you acknowledging how<br/>\nmuch she hates the situation (perhaps feeling powerless) can help her center<br/>\nher feelings to thoughts that can then be expressed in a more rational<br/>\nway.maybe.<br/>\n<br/>\n <br/>\n<br/>\n&lt;&lt;So how do I deal with her telling her 4 yo. dd that if she eats<br/>\nanother popsicle she&#39;ll get fat (when we are trying to not control the<br/>\nfood they eat, other than their choices come from what we have<br/>\navailable at the moment) &gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nWhen a child says something shaming to another child I might respond by<br/>\nsaying something like, &quot;I don&#39;t agree,&quot;  or &quot;now why would you think<br/>\nsomething like that?&quot; in a very neutral way.  Tone is everything.  Think -<br/>\n&quot;gosh - that surprises me - I don&#39;t understand it.&quot;  In your situation I am<br/>\nwondering if your older dd is conscientious about her body weight (some<br/>\nunderlying message happening here from somewhere) that she is transferring<br/>\nonto her sibling.  Is your older dd feeling frustrated by her own food<br/>\nchoices and asking for some help or guidance?<br/>\n<br/>\n <br/>\n<br/>\n&lt;&lt; or she calls her stupid and tells her to shut<br/>\nup for singing too long?&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\n&quot;Please don&#39;t call her stupid,&quot; is a reasonable response - again - tone is<br/>\neverything - berating your older dd is antithetical to the point.  Perhaps<br/>\nstroke your older dd&#39;s head while saying &quot;don&#39;t speak to her that way.&quot;   AS<br/>\nto the singing too long.this is where maybe your instigating a creative<br/>\nproblem solving conversation to make the environment comfortable for<br/>\neveryone  - include both sibs in the conversation as to what solution would<br/>\nwork for everyone.  You are as important as they are as to your comfort<br/>\nlevel in your environment.  <br/>\n<br/>\n <br/>\n<br/>\nWhile it may seem easier to solve conflict by separating the girls - I don&#39;t<br/>\nagree that this is really the best solution in the long the run.  It doesn&#39;t<br/>\nhelp them to recognize each other, the struggles they feel and come to some<br/>\nhigher level of being together if the conflicts are not solved together.<br/>\nLast year I had a conflict with a colleague and when I approached the<br/>\nprogram director for assistance she stated that it&#39;s obvious we two had<br/>\ncommunication problems and that she felt for now we shouldn&#39;t communicate<br/>\nwith one another.  Well that surely didn&#39;t solve anything.<br/>\n<br/>\n <br/>\n<br/>\nAs for not intervening.once I have intervened and the girls are both in a<br/>\nrational state they do communicate and do get to a level place without me<br/>\nhaving to say much more than what I&#39;ve stated above.  I have always said and<br/>\nstill believe the kids come up with better solutions than the limits of my<br/>\nbroad experience can imagine.  They are not restricted by the confines of<br/>\nexperience!!!<br/>\n<br/>\n <br/>\n<br/>\nHope this helps in some small way.<br/>\n<br/>\nLisa Heyman<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":25435,"nextTopicId":25473}}