{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":197731387,"authorName":"Marieke Willis","from":"Marieke Willis &lt;luuknam@...&gt;","profile":"luuknam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Help with Playing","postDate":"1169326556","msgId":20853,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2NTIyOS4xNjc0NC5xbUB3ZWI1MzAxMy5tYWlsLnlhaG9vLmNvbT4=","inReplyToHeader":"PDU2Mzk0ODU1MDcwMTIwMTAyMm4zNjlkNDg1M3MzYjA4YjdiODdmZDI2OGMwQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":20850,"nextInTopic":0,"prevInTime":20852,"nextInTime":20854,"topicId":20828,"numMessagesInTopic":0,"msgSnippet":"... We re living in a relatively small apartment too, but when I started looking into house prices last fall I was shocked at how cheap we d be able to buy","messageBody":"<div id=\"ygrps-yiv-513051826\">--- Carrie Yandell &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cyandell@...\">cyandell@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; He IS very active and we live in a small apartment with<br/>\n&gt; no yard so going out is essential if at all possible! <br/>\n<br/>\n </span></blockquote>We&#39;re living in a relatively small apartment too, but when I started<br/>\nlooking into house prices last fall I was shocked at how cheap we&#39;d be<br/>\nable to buy something, if only we&#39;d be willing to a) commute and b) fix<br/>\nit up. So we&#39;re currently in the process of buying an 830 sq ft house<br/>\njust north of Dallas for $13,000 on a 0.76 acre lot in a nice little<br/>\nvillage. We&#39;ll have to spend over $10,000 fixing it up, but that still<br/>\nmakes the house only something like $25,000, which is pretty cheap when<br/>\ncompared to our apartment cost of $618 a month (which will be increased<br/>\nthis summer to $680 a month). Now, the apartment includes water (but<br/>\nnot electricity), but still... What I&#39;m basically saying is that you<br/>\nmight be surprised at what y&#39;all might be able to afford if you&#39;re<br/>\nwilling to commute some. <br/>\n<br/>\nJust a thought,<br/>\n<br/>\nMarieke<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\nNo need to miss a message. Get email on-the-go <br/>\nwith Yahoo! Mail for Mobile. Get started.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mobile.yahoo.com/mail\">http://mobile.yahoo.com/mail</a></div>","specialLinks":[]},{"userId":181212675,"authorName":"Mindy Evans","from":"Mindy Evans &lt;mindyevans@...&gt;","profile":"sethnmommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:Help with Playing","postDate":"1169317752","msgId":20850,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI1MTYxMi43NDk1Ny5xbUB3ZWI4MTAxMC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":20849,"nextInTopic":20853,"prevInTime":20849,"nextInTime":20851,"topicId":20828,"numMessagesInTopic":0,"msgSnippet":"You know, from your post, it sounds like he is perfectly content. Just because you are bored, doesn t mean he is. My son ALWAYS smashed up anything I made","messageBody":"<div id=\"ygrps-yiv-1231559787\">You know, from your post, it sounds like he is perfectly content. Just because &quot;you&quot; are bored, doesn&#39;t mean he is. My son ALWAYS smashed up anything I made with play dough until he was about 4-5ish. <br/>\n  I was pretty bored too, but my son was perfectly content to just have me there, while he was doing his &quot;thing&quot; and to engage me when he wanted me to do something. He had his own way of doing things too, and didn&#39;t like it when I did things different. He would often tell, &quot;I want to do it MY way&quot; when I would try to show him how to do something. I wouldn&#39;t worry so much, the boredom only last for a little while (even thought right now it seems like FOREVER...). Soon enough he will be engaged in things that will interest you more. At 6 my DS now asks me how to do things, he gets frustrated sometimes because he can&#39;t do it and will revert to his way, but then I catch him trying it on his own later. ( hitting a birdie with a racket the right way, throwing a baseball the &quot;right&quot; way.) <br/>\n  He just has his own ideas, and that is okay with me. It used to frustrate me, but now I see he was trying to &quot;figure it out&quot; without my leading. That can be a good thing, they are thinking ahead, figuring things out. It makes for a great skill later in life. <br/>\n<br/>\n<br/>\nGod Bless You and yours <br/>\nMindy Evans <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mindyevans@...\">mindyevans@...</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210732740,"authorName":"Carrie Yandell","from":"&quot;Carrie Yandell&quot; &lt;cyandell@...&gt;","profile":"carrieyandell","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Help with Playing","postDate":"1169317349","msgId":20849,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU2Mzk0ODU1MDcwMTIwMTAyMm4zNjlkNDg1M3MzYjA4YjdiODdmZDI2OGMwQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGVvczU1YytnZzRsQGVHcm91cHMuY29tPg==","referencesHeader":"PGVvcGR1YytxY2lnQGVHcm91cHMuY29tPiA8ZW9zNTVjK2dnNGxAZUdyb3Vwcy5jb20+"},"prevInTopic":20840,"nextInTopic":20850,"prevInTime":20848,"nextInTime":20850,"topicId":20828,"numMessagesInTopic":0,"msgSnippet":"Thanks everyone for the feedback.. I ve had a lot to think about yesterday and this morning! To answer some questions, we definitely do do a lot of other","messageBody":"<div id=\"ygrps-yiv-218615235\">Thanks everyone for the feedback.. I&#39;ve had a lot to think about<br/>\nyesterday and this morning!<br/>\n<br/>\nTo answer some questions, we definitely do do a lot of other things<br/>\naround the house, cleaning, cooking etc. One of Nathan&#39;s favorite<br/>\nthings in the whole world is cleaning windows :) When he was itty<br/>\nbitty, I was complaining to a friend that I didn&#39;t know what to &quot;do<br/>\nwith&quot; him, and she advised to just do your normal things, cleaning,<br/>\ncooking, whatever, with baby in the sling right along with you. So I<br/>\ndid and it was brilliant and we&#39;ve done that ever since! Turns out she<br/>\nis an unschooler although I didn&#39;t know what that meant at the time :)<br/>\n<br/>\nLately my husband has been out of town or working late, which means<br/>\nit&#39;s 12-14 hours of just Nathan and I.. which is a long day. Even a<br/>\nday of going out, fixing meals, doing a little cleaning, going for a<br/>\nwalk, and watching a movie is still long and trains and playdough are<br/>\nhis favorite things at the moment so he&#39;ll want to do those for a good<br/>\nhour or more. He IS very active and we live in a small apartment with<br/>\nno yard so going out is essential if at all possible! Although we&#39;ve<br/>\nbeen doing a lot of bed jumping lately :)<br/>\n<br/>\nAnother thing I should have mentioned which may have something to do<br/>\nwith all of this is that I&#39;m 20 weeks pregnant and Nathan knows<br/>\nsomething&#39;s up. He&#39;s &quot;clingier&quot; (although I dislike that phrase) and<br/>\nhas less independent play than he used to during the day when it&#39;s<br/>\njust me. When my husband is at home, there&#39;s a computer right next to<br/>\nthe train table and my husband can happily play games on the computer<br/>\nwhile Nathan plays with the trains with apparently few problems. My<br/>\nhusband can do whatever he wants with the playdough. The ironic thing<br/>\nis that my husband *does* try and &quot;teach&quot; him things which drives me<br/>\nbonkers and Nathan never shows any interest.<br/>\n<br/>\nI don&#39;t think I&#39;m trying to show or teach anything.. although it&#39;s<br/>\npossible. The suggestion to be more &quot;in the moment&quot; is something I had<br/>\nforgotten and will work on. I&#39;ve kind of gotten in the habit of making<br/>\nthings I&#39;m doing more fun for my son so we can do it together.. like<br/>\nwhen I do scrapbooking or making cards, I have some toy stamps and<br/>\nwashable ink that DS loves to play with and stamp right along with me.<br/>\nSo making a dinosaur was an extension of that, I think. I&#39;ll ahve to<br/>\npay more attention. I LOVE the suggestion of getting it out myself to<br/>\nplay first. That will be fun to try.<br/>\n<br/>\nThe main differences between going out and staying in is that we<br/>\nusually go somewhere where he can run around and expend some energy.<br/>\nPlus I don&#39;t feel the pressure to be incredibly entertaining -- I<br/>\nthink that&#39;s pressure I must be putting on myself. Maybe Nathan does<br/>\njust want me to be there. I&#39;ll have to try just talking more too as<br/>\nalso suggested.<br/>\n<br/>\nIt&#39;s strange, I do remember playing as a child -- I have a younger<br/>\nbrother and I remember our room being full of animals and cars and<br/>\nbarbies and GI Joe in strategic locations and I know we played with<br/>\nthem... but I don&#39;t remember how or what we were doing exactly. I<br/>\nguess I&#39;ve felt there&#39;s something wrong with me for feeling lost or<br/>\nnot doing what was expected of me. Maybe I need to just chill out :)<br/>\n<br/>\nI&#39;m glad I&#39;m not the only one! Thanks again,<br/>\nCarrie</div>","specialLinks":[]},{"userId":268622920,"authorName":"Amy Mason","from":"Amy Mason &lt;doodlemakers@...&gt;","profile":"doodlemakers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Help with Playing","postDate":"1169305273","msgId":20840,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1QjIyRUI5LjIwNjAwMDVAYWRlbHBoaWEubmV0Pg==","inReplyToHeader":"PDAwNTcwMWM3M2M5OSRkMDk3Y2E2MCQ2NTAyYThjMEB5b3VydzA0Z3R4bGQ2Nz4=","referencesHeader":"PDAwNTcwMWM3M2M5OSRkMDk3Y2E2MCQ2NTAyYThjMEB5b3VydzA0Z3R4bGQ2Nz4="},"prevInTopic":20839,"nextInTopic":20849,"prevInTime":20839,"nextInTime":20841,"topicId":20828,"numMessagesInTopic":0,"msgSnippet":"I love to play because I still have vivid memories of being a kid but I do still get tired (bored) of playing with my four kids.  I play a lot individually","messageBody":"<div id=\"ygrps-yiv-1110129858\">I love to play because I still have vivid memories of being a kid but I <br/>\ndo still get tired (bored) of playing with my four kids.  I play a lot <br/>\nindividually whatever they have in mind or we all play with one chosen <br/>\ntheme of toys but when I have had enough of imagining time I suggest a <br/>\ngame...we love board games in this house and it&#39;s a great way to include <br/>\ndad and for me to get away from pretend for a while.  Even as young as <br/>\nyour child there are games you can play with him.  When it was just my <br/>\nfirst we were playing memory and Teletubbies game and others.  And like <br/>\nthe last poster suggested...when I get tired of playing something...I <br/>\nexcuse myself to go do the dishes or laundry and my children usually <br/>\njust keep on going without me.  It gives me a little break and then I&#39;m <br/>\nfresh to join in again in a few minutes.<br/>\nAmy</div>","specialLinks":[]},{"userId":193064123,"authorName":"Nance Confer","from":"&quot;Nance Confer&quot; &lt;marbleface@...&gt;","profile":"nanceconfer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Help with Playing","postDate":"1169300972","msgId":20839,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNTcwMWM3M2M5OSRkMDk3Y2E2MCQ2NTAyYThjMEB5b3VydzA0Z3R4bGQ2Nz4="},"prevInTopic":20838,"nextInTopic":20840,"prevInTime":20838,"nextInTime":20840,"topicId":20828,"numMessagesInTopic":0,"msgSnippet":"I just get bored :( I feel like I m boring and just not understanding what it is that he wants from me. ********* Hurray! The truth has been spoken! Playing","messageBody":"<div id=\"ygrps-yiv-739959507\">I just get bored :( I feel like I&#39;m boring and just not understanding<br/>\nwhat it is that he wants from me.<br/>\n<br/>\n*********<br/>\n<br/>\nHurray! The truth has been spoken! Playing with a young (or even older) child can be boring. <br/>\n<br/>\nAs a matter of fact, much of parenthood is boring. <br/>\n<br/>\nBut all necessary -- changing diapers and picking up toys and cooking the same meals over and over and playing the same games (just so and no other way :) ) -- all needed.<br/>\n<br/>\nFor a short time. <br/>\n<br/>\nAnd then the next set of less-than-scintillating activities are needed.<br/>\n<br/>\nNot by you, necessarily. But by your precious child. <br/>\n<br/>\nSo, you get on with it. Play the next game of &quot;knock down the blocks&quot; or peek-a-boo or Chutes & Ladders or paint your fingernails cool colors (my DD now) or look how hard I can kick this target (my DS now).<br/>\n<br/>\nAnd it goes on from here, I assume. <br/>\n<br/>\nAnd then, poof, they are adults who are actually quite engaging. And, you know, they already are -- some of the time. When they reach a certain age and their interests overlap with mine and the mood strikes, we actually have quite interesting conversations.<br/>\n<br/>\nBut, at 26 months? The days can get long. It&#39;s not you. It happens. <br/>\n<br/>\nWhat to do about it? Have fun when you can, relax, suck it up, realize this time goes by quickly, get out, get yourself a hobby -- I&#39;m a reader and by now the kids are used to seeing me with a book in front of my face, etc.<br/>\n<br/>\nMy two cents. :)<br/>\n<br/>\nNance<br/>\n<br/>\nCocking A Snook<br/>\nA Blog for Thinking Parents<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://cockingasnook.wordpress.com/\">http://cockingasnook.wordpress.com/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":278107510,"authorName":"alisonslp","from":"&quot;alisonslp&quot; &lt;alisonslp@...&gt;","profile":"alisonslp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with Playing","postDate":"1169266668","msgId":20838,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVvczU1YytnZzRsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVvcGR1YytxY2lnQGVHcm91cHMuY29tPg=="},"prevInTopic":20832,"nextInTopic":20839,"prevInTime":20837,"nextInTime":20839,"topicId":20828,"numMessagesInTopic":0,"msgSnippet":"how often and for how long does he want you to play with him? Is he content to play on his own as well? If not, I d work towards that. Play with him for a","messageBody":"<div id=\"ygrps-yiv-2002889499\">how often and for how long does he want you to play with him? Is he<br/>\ncontent to play on his own as well? If not, I&#39;d work towards that.<br/>\nPlay with him for a while and then excuse yourself to do a daily<br/>\nroutine - but be available to him and also invite him to help you. I<br/>\nremember that my kids loved helping me at that age. No matter what<br/>\nthey were doing, if they heard/saw me busy with something, they&#39;d want<br/>\nto jump right in. And I&#39;d find ways to have them help me as best I<br/>\ncould. They became independent players very early on because I gave<br/>\nthem the space to explore on their own. As long as you make yourself<br/>\navailable when he seems to be looking for it, it&#39;s fine to let him<br/>\nexplore on his own.  It&#39;s also ok to guide his play so that he&#39;s more<br/>\naccepting of your &quot;needs&quot; too - &quot; I really want to make a dinosaur so<br/>\nit can watch us, but I will make a snake for you after this.&quot; He *may*<br/>\nbe getting upset and trying to control the situation because he feels<br/>\nyou are trying to take away from his thoughts (mommy wants me to make<br/>\na dino), even if this isn&#39;t your intention. But if you make it clear<br/>\n(through your actions), that you are playing for yourself, not to<br/>\n&quot;show&quot; him something he may be more accepting. Also, this may work<br/>\nbetter if he sees you initiating the activity, without inviting him<br/>\nin. For example, start playing with the trains your way - if he&#39;s<br/>\ninterested in what you are doing, he will join in, if not, that&#39;s ok too. <br/>\n<br/>\nAlison</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help with Playing","postDate":"1169226243","msgId":20832,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVvcXRtMysyMjBsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVvcGR1YytxY2lnQGVHcm91cHMuY29tPg=="},"prevInTopic":20828,"nextInTopic":20838,"prevInTime":20831,"nextInTime":20833,"topicId":20828,"numMessagesInTopic":0,"msgSnippet":"... good ... Hi, Carrie, I m Meredith, mom to Morgan, who is 5 and stepmom to Rayan, 13. I m not a very good playmate either! Although I ve gotten better. But","messageBody":"<div id=\"ygrps-yiv-327295405\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Carrie&quot; &lt;cyandell@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I hope this doesn&#39;t sound too silly, but I fear I am not a very <br/>\n </span></blockquote>good<br/>\n<blockquote><span title=\"ireply\"> &gt; playmate. My son is 26mo and my only child.<br/>\n<br/>\n </span></blockquote>Hi, Carrie, I&#39;m Meredith, mom to Morgan, who is 5 and stepmom to <br/>\nRayan, 13. I&#39;m not a very good playmate either! Although I&#39;ve gotten <br/>\nbetter. But playing is a long way from the only thing I do with my <br/>\nkids so I have some questions for you (to consider, not something <br/>\nyou *have* to answer on the board). <br/>\n<br/>\nOne thing that wasn&#39;t terribly clear from your post is how much one-<br/>\non-one playing your son actually wants from you - some kids like <br/>\nmore than others. Can you fill up his need to connect with mom <br/>\nverbally? Ask him questions and talk to him about what he&#39;s doing or <br/>\ntalk about what *you* are doing. <br/>\n<br/>\nIt also wasn&#39;t clear to me if playing with your son was the main way <br/>\ny&#39;all are interacting. Are you inviting him to do other things <br/>\naround the home with you? He&#39;s at an age when kids are often <br/>\nfacinated by the adult world and really excited to take part any way <br/>\nthey can. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We do some things very well -- We do very well going out and DOING<br/>\n&gt; things -- we spent four hours at the science museum yesterday which<br/>\n&gt; was awesome.<br/>\n<br/>\n </span></blockquote>Do you have a sense of what makes &quot;going out&quot; different? Is it the <br/>\nchange of scenery, the other people, or the kinds of activities? The <br/>\nexamples you give of playing at home were kind of stationary. I have <br/>\ntwo really active kids, so my inclination is to wonder if y&#39;all need <br/>\nmore whole-body kinds of things to do at home - more opportunities <br/>\nto run or jump or climb or whatever. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; my son seems very particular about how he wants things to work. <br/>\n </span></blockquote>Which<br/>\n<blockquote><span title=\"ireply\"> &gt; can make it really tedious for me after a while. With playdough, <br/>\n </span></blockquote>I&#39;m<br/>\n<blockquote><span title=\"ireply\"> &gt; not &quot;allowed&quot; to make my own things <br/>\n<br/>\n </span></blockquote>Try thinking of this from a different angle - your ds has his own <br/>\nideas about what he wants to do, make, explore and learn about while <br/>\nhe&#39;s working with playdough. Great! He doesn&#39;t need the &quot;more&quot; you <br/>\nare offerring him - in a sense, you are trying to teach him <br/>\nsomething while he&#39;s busy learning something else. Make snakes. Try <br/>\ntalking to him about the snakes - does he want long ones or short? <br/>\nfat or skinny? Do the snakes have names or are they intended as <br/>\nparts for something else?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m also a bit baffled about the internal &quot;rules&quot; he seems to have.<br/>\n<br/>\n </span></blockquote>Reading your description, I don&#39;t see him having &quot;rules&quot; - I see mom <br/>\nhaving expectations that don&#39;t line up with a child&#39;s needs in the <br/>\nmoment.<br/>\n<br/>\nI haven&#39;t read Playful Parenting, so I don&#39;t really know what it has <br/>\nto say about playing with children.<br/>\n<br/>\nIt sounds to me like you are thinking of play as though you &quot;should&quot; <br/>\nbe able to play like a child and enjoy playing. That&#39;s an idea you <br/>\nmay need to let go for awhile. Focus on enjoying Mom Things about <br/>\nspending time with your kid. Look at him and think happy mom-<br/>\nthoughts about how much you love him. Watch the way his little hands <br/>\nwork and marvel. Revel in the fact that you have Time, right Now! to <br/>\nspend with your little guy. Use the long moments as a spiritual <br/>\ndiscipline, like meditation. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t WANT to be boring <br/>\n<br/>\n </span></blockquote>Is your son bored? I hear you saying *you* are bored, but he seems <br/>\nto have plenty of ideas about what he want to do and even how he <br/>\nwants to go about doing it! Maybe the shift you need is to find more <br/>\nways to fill up your own need for mental stimulation while also <br/>\nspending time with a very young child. That&#39;s challenging. One of my <br/>\nstrategies has been to switch my favorite message boards to digest <br/>\nform. That makes it easier to print out the day&#39;s messages so I can <br/>\npick them up and put them down, make notes in the margin, even hand-<br/>\nwrite replies on the backs. Its a little easier to set down than <br/>\nknitting (although I also recommend knitting in the round as easier <br/>\nto put down!). Uses a lot of paper sometimes, though!<br/>\n<br/>\n---Meredith (Mo 5, Ray 13)</div>","specialLinks":[]},{"userId":210732740,"authorName":"Carrie","from":"&quot;Carrie&quot; &lt;cyandell@...&gt;","profile":"carrieyandell","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Help with Playing","postDate":"1169177356","msgId":20828,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVvcGR1YytxY2lnQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":20832,"prevInTime":20827,"nextInTime":20829,"topicId":20828,"numMessagesInTopic":0,"msgSnippet":"Hello all, I hope this doesn t sound too silly, but I fear I am not a very good playmate. My son is 26mo and my only child. I recently read Playful Parenting","messageBody":"<div id=\"ygrps-yiv-76530361\">Hello all,<br/>\n<br/>\nI hope this doesn&#39;t sound too silly, but I fear I am not a very good<br/>\nplaymate. My son is 26mo and my only child.<br/>\n<br/>\nI recently read Playful Parenting which has helped a bit in<br/>\nunderstanding more about why and how playing can be helpful. But I<br/>\nalso think that book is geared towards older kids and I&#39;m feeling..<br/>\nhelpless and boring right now. I feel sorry for my son stuck with me<br/>\nas a playmate sometimes!<br/>\n<br/>\nWe do some things very well -- We do very well going out and DOING<br/>\nthings -- we spent four hours at the science museum yesterday which<br/>\nwas awesome. We have a weekly playgroup which is sometimes good and<br/>\nsometimes not so much. I love crafty things so sometimes we&#39;ll stamp<br/>\nand cut up paper and play with yarn and things like that. <br/>\n<br/>\nOther things though I&#39;m at a loss. For example, my son loves<br/>\nplaydough. You&#39;d think this would be right up this alley except that<br/>\nmy son seems very particular about how he wants things to work. Which<br/>\ncan make it really tedious for me after a while. With playdough, I&#39;m<br/>\nnot &quot;allowed&quot; to make my own things -- that&#39;s my word for it. If I try<br/>\nto make creatures (like dinosaurs since he likes dinosaur books) he&#39;ll<br/>\ndestroy them before I get a chance to even show him what I was doing.<br/>\nHe will give me pieces and tell me to make snakes. We use cookie<br/>\ncutters too, but I&#39;m not allowed to pick them out OR put them in the<br/>\nplaydough. I&#39;m only allowed to roll it out for him.<br/>\n<br/>\nHe also really loves trains and we have one of those train tables with<br/>\nsome trains. I have figured out one way to play with these, which is I<br/>\nam assigned some trains and I get to chase him around the table with<br/>\nthese. This is fun for a little while but I get tired of it loooong<br/>\nbefore he does. Sometimes I can play for 15 minutes or so and then<br/>\nI&#39;ll say I&#39;m taking a break and knit or something while he plays by<br/>\nhimself. But he soon wants me to play again and...<br/>\n<br/>\nI just get bored :( I feel like I&#39;m boring and just not understanding<br/>\nwhat it is that he wants from me. I also get frustrated because it&#39;s<br/>\noften a very long day with just the two of us and I of course have<br/>\nthings I like to do, like knit or check my email, and I need time to<br/>\nrecharge my own batteries, but often don&#39;t get it.<br/>\n<br/>\nI don&#39;t WANT to be boring but I&#39;m having a hard time playing things<br/>\nlike these when we&#39;re home for extended periods (which has been more<br/>\noften lately with roads closed and such). I&#39;ve purchased some &quot;idea&quot;<br/>\nbooks recently which have some ideas that I&#39;m hoping to introduce as<br/>\nplay options. My son refuses to do anything involving &quot;instructions&quot;<br/>\n-- which is fine, but that seems to be a lot of the advice I&#39;m<br/>\ngetting. He won&#39;t sit around in a circle or anything like that.<br/>\n<br/>\nI&#39;m also a bit baffled about the internal &quot;rules&quot; he seems to have.<br/>\nWe&#39;ve never attended a class with rules and I&#39;m a very flexible<br/>\nperson. We don&#39;t have many rules, in fact the only one I can think of<br/>\nis you have to be in the carseat when we&#39;re driving. <br/>\n<br/>\nI&#39;m starting to ramble, so I&#39;ll close now. I hope all of these makes<br/>\nsome sense. As usual I know that when I feel like something is wrong,<br/>\nit&#39;s usually me that needs a new perspective and new ideas. You all<br/>\nare a great list for those!<br/>\n<br/>\nThanks,<br/>\nCarrie</div>","specialLinks":[]}],"prevTopicId":20822,"nextTopicId":20883}}