{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":161134106,"authorName":"Shannon","from":"&quot;Shannon&quot; &lt;ksbell@...&gt;","profile":"ksbell315","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What if she wants to go to school?","postDate":"1237121998","msgId":38942,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdwaXU0ZStqaWY5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE5NDk1OTM0NTUtMTIzNzA3NjEyMy1jYXJkaHVfZGVjb21ib2J1bGF0b3JfYmxhY2tiZXJyeS5yaW0ubmV0LTE2MTY1MzY2MzAtQGJ4ZTEwMTIuYmlzeC5wcm9kLm9uLmJsYWNrYmVycnk+"},"prevInTopic":38914,"nextInTopic":0,"prevInTime":38941,"nextInTime":38943,"topicId":38890,"numMessagesInTopic":0,"msgSnippet":"Thanks for the replies.  If she does go and ends up being completely miserable, of course I won t force her to continue.  At this point, she is very determined","messageBody":"<div id=\"ygrps-yiv-1183497507\">Thanks for the replies.  If she does go and ends up being completely miserable, of course I won&#39;t force her to continue.  At this point, she is very determined to go back.  It makes me sad, because I have really been enjoying the last few months with her, but we still have 5 months until school starts.  It is a really wonderful school and the staff truly has the best interests of the kids at heart.  I plan to speak with her new teachers before school starts about the problems she had last year, and make it clear that I won&#39;t allow her to suffer like that this time around.</div>","specialLinks":[]},{"userId":179855323,"authorName":"Betj","from":"&quot;Betj&quot; &lt;bkind28@...&gt;","profile":"bkind28","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What if she wants to go to school?","postDate":"1237076125","msgId":38914,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5NDk1OTM0NTUtMTIzNzA3NjEyMy1jYXJkaHVfZGVjb21ib2J1bGF0b3JfYmxhY2tiZXJyeS5yaW0ubmV0LTE2MTY1MzY2MzAtQGJ4ZTEwMTIuYmlzeC5wcm9kLm9uLmJsYWNrYmVycnk+","inReplyToHeader":"PGdwZHB0MSt1Njk4QGVHcm91cHMuY29tPg==","referencesHeader":"PGdwZHB0MSt1Njk4QGVHcm91cHMuY29tPg=="},"prevInTopic":38902,"nextInTopic":38942,"prevInTime":38913,"nextInTime":38915,"topicId":38890,"numMessagesInTopic":0,"msgSnippet":"I had my son out of school unschooling 6 wks last year and he s back in school by choice. We just work on unschooling ideas at home. He has ADHD but tests in","messageBody":"<div id=\"ygrps-yiv-21704675\">I had my son out of school unschooling 6 wks last year and he&#39;s back in school by choice. We just work on unschooling ideas at home. He has ADHD but tests in the &quot;gifted&quot; range and likes the stimulation. I don&#39;t push for A&#39;s, don&#39;t force bedtime, don&#39;t limit his video games and such. It works for us. \r<br/>\nSent from my Verizon Wireless BlackBerry\r<br/>\n\r<br/>\n-----Original Message-----\r<br/>\nFrom: &quot;Shannon&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ksbell@...\">ksbell@...</a>&gt;\r<br/>\n\r<br/>\nDate: Fri, 13 Mar 2009 14:17:05 \r<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;\r<br/>\nSubject: [unschoolingbasics] What if she wants to go to school?\r<br/>\n\r<br/>\n\r<br/>\nWe&#39;ve been exploring unschooling for about 2 months now.  DD is 4, and she went to a very progressive preschool for 1.5 years.  She has been out of that school for about 3 months now, and the changes in her personality are noticeable and very positive, from my perspective.\r<br/>\n\r<br/>\nHer school called yesterday to ask if we were interested in next year.  Public schools start at 4 here (pre-K), and this school has a pre-K and K program.  The main reason I pulled her out of the preschool program was financial, but the state subsidizes pre-K and K, and we are eligible to apply for a scholarship, so the financial problem won&#39;t be there.  But I need to decide in the next week or so if I want to enroll her or not, so they can give our spot to someone else if not.\r<br/>\n\r<br/>\nShe says she wants to go, and that she misses her friends.  I plan to have many conversations with her over the next week to help us make the right decision.  I found out that one little girl who bullied her (through exclusion) will be in the class next year, and I have told her this.  I have also reminded her that if she does go back to school, we will have to start having a bedtime again, which is something we have given her more control over since she hasn&#39;t been in school.  I don&#39;t want to forbid her from going if she really wants to do it, but if she does go, we have to make a commitment to go for at least a semester.  The school is a laboratory school for the university&#39;s early childhood ed program, and they have a harder time filling the slots for the older class.  I have been completely open with the school&#39;s administrator about what we are doing, and I feel comfortable going in to speak with the teachers and the director about the problems we had last semester.\r<br/>\n\r<br/>\nSo what have other parents done when faced with a similar situation?  If this was regular public school, I would be fine with sending her and letting her see for herself if it is the right place for her.  But I can&#39;t send her and then pull her out 6 weeks later, due to the nature of the lab school.\r<br/>\n\r<br/>\nThanks in advance for any perspective you all can give me!\r<br/>\n\r<br/>\nShannon\r<br/>\n\r<br/>\n\r<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"N CONFER","from":"N CONFER &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"What if she wants to go to school?","postDate":"1237033525","msgId":38902,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMwNTA5Mi4yMTA4NS5xbUB3ZWI4MzgwNy5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":38900,"nextInTopic":38914,"prevInTime":38901,"nextInTime":38903,"topicId":38890,"numMessagesInTopic":0,"msgSnippet":"But I can t send her and then pull her out 6 weeks later, due to the nature of the lab school. Of course you can. But the question is how to honor the wishes","messageBody":"<div id=\"ygrps-yiv-750909290\">&quot;But I can&#39;t send her and then pull her out 6 weeks later, due to the nature of the lab school.&quot;<br/>\n<br/>\nOf course you can.<br/>\n<br/>\nBut the question is how to honor the wishes of your 4-yo daughter. And what the reality is as opposed to her idealized version of school being about &quot;friends.&quot;<br/>\n<br/>\nI&#39;d let her go if she wants to but assure her that if, at any time, she wants to stop going, she can. <br/>\n<br/>\nMy 14-yo daughter (I know, not the same) has talked about going to high school. But one of her first questions was if she had to finish the semester if she didn&#39;t like it. I assured her she didn&#39;t have to finish the day! Which I think will make it easier for her to try this, to me, dumb thing but that&#39;s OK. Better that than forcing a decision based on false info.<br/>\n<br/>\nAnyway, back to you. It&#39;s much harder with a younger child. TV makes school look great. And Pre-K may be great. It&#39;s got to be better than the later years, filled with drill and tests. <br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":184269211,"authorName":"rebecca de","from":"rebecca de &lt;rebeccadehate@...&gt;","profile":"rebeccadehate","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] What if she wants to go to school?","postDate":"1237006812","msgId":38900,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1MTQyMi40NDMxMS5xbUB3ZWI1NjEwMi5tYWlsLnJlMy55YWhvby5jb20+","inReplyToHeader":"PGdwZHB0MSt1Njk4QGVHcm91cHMuY29tPg=="},"prevInTopic":38894,"nextInTopic":38902,"prevInTime":38899,"nextInTime":38901,"topicId":38890,"numMessagesInTopic":0,"msgSnippet":"Shannon,     Ok I m going to share with you my experience and maybe from this you can find some answers?  Anyway I sent my child to head start --awful ,","messageBody":"<div id=\"ygrps-yiv-313759791\">Shannon,<br/>\n    Ok I&#39;m going to share with you my experience and maybe from this you can find some answers?  Anyway I sent my child to head start --awful , crying to go on bus etc. stopped after about a week or 2?  sent to kindergarten last year and my boy was just turning 5 .... He came home angry after school, sometimes getting him to go was difficult , just emotionally he was not -- I kept explaining he could homeschool.  Mid-January I basically forced him on the bus crying one morning(because I felt he started he needed to go.. .blah, blah -- I needed more unschooling obviously)  vowed I would not do this anymore and told him that night he did not have to go anymore if he didn&#39;t want to... so when I woke him up he said he wanted to stay home and homeschool -- we let go...   didn&#39;t call the school for a few days to see if he changed his mind --- and he didn&#39;t.  Soooo we found homeschool/unschooler group to get involved with this last summer, went to<br/>\n unschooling conference in sept and  I was still wishy washy myself, insecure in my decision, kept bouncing it back in forth to my son that he could go to school or stay home?   Again we put him into school because he kept exploding at me that he wanted to &quot;just go to school&quot; ... Now here we are half way through , i&#39;ve been verbally attacked by my sister because I let him stay home to often and I already see him not as enthused about going.  Asks to stay home, ask to home school,  etc... Plus , I try to be &#39;involved&#39; in school as much as I can, volunteer for a whole day in his class and he loves those days...  And one thing I know for sure --- I Am unschooling him next year and there out....I&#39;ve realized that it feels like no fun, he&#39;s not smiling as much about school, most of his likes for school are just the &#39;fun&#39; things any how, recess, lunch, music, gym.  And I can give him all of these things and more unschooling.  I realized that even<br/>\n though I want him to have the &quot;say&quot; , I really don&#39;t think he realized again how long a year in school was... now ( even though many unschooler will scuff at this) I am encouraging him to finish the kindergarten year out and even he says lets finish but next year lets homeschool.  ( let me make note here though that I am a single mom and I do have to deal with his dad on the issue -- whom wants him to go to school -- however he didn&#39;t give me a hard time last year when I pulled him out so?? not sure why I worry at all...)  <br/>\n<br/>\nWell, hopefully that wasn&#39;t just a release /babble session on my part.  I just truly suggest you just jump out of school and unschool if it feels right.  She is only 4 let her be a child , let her play and learn naturally.  Try to let go that we have to prepare them for the &#39;future&#39; and early education is the best -- this is the media, the government and societal pressure..  <br/>\n(gosh I feel like I&#39;m talking to myself :)    <br/>\n<br/>\nwhat 6 weeks away from structured play, and learning really going to hurt.  The more I open my eyes I recognize how often my children really learn without in real formal training.  It&#39;s amazing.  <br/>\n<br/>\nI have rode the school/ unschooling bus and it isn&#39;t fun... I&#39;m frustrated with the schools because of the business/curriculum agenda (even the teachers are frustrated and unhappy ) imagine how the children feel ... i here you say it&#39;s a school lab and I&#39;m sure it is fun but as soon as you stick her in a real public school or even private school it will most likely not be as exciting.  <br/>\n   I want my boys to be free , free to learn at thier pace, thier interests, their agenda... they can&#39;t have that in school -- its&#39; everyone else agenda -- according to ??? <br/>\n    I am realizing as a 40 year old women that much of what I learned at home (pretty structured, traditional, mainstream home) , at school and college has not taught me anything about me&gt;  what my passions are, my desires, my dreams... I do not want this for my children and I feel that allowing them freedom early on will enable them to become stronger adults. <br/>\n<br/>\nmake sense??? <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Fri, 3/13/09, Shannon &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ksbell@...\">ksbell@...</a>&gt; wrote:<br/>\nFrom: Shannon &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ksbell@...\">ksbell@...</a>&gt;<br/>\nSubject: [unschoolingbasics] What if she wants to go to school?<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Friday, March 13, 2009, 10:17 AM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n            We&#39;ve been exploring unschooling for about 2 months now.  DD is 4, and she went to a very progressive preschool for 1.5 years.  She has been out of that school for about 3 months now, and the changes in her personality are noticeable and very positive, from my perspective.<br/>\n<br/>\n<br/>\n<br/>\nHer school called yesterday to ask if we were interested in next year.  Public schools start at 4 here (pre-K), and this school has a pre-K and K program.  The main reason I pulled her out of the preschool program was financial, but the state subsidizes pre-K and K, and we are eligible to apply for a scholarship, so the financial problem won&#39;t be there.  But I need to decide in the next week or so if I want to enroll her or not, so they can give our spot to someone else if not.<br/>\n<br/>\n<br/>\n<br/>\nShe says she wants to go, and that she misses her friends.  I plan to have many conversations with her over the next week to help us make the right decision.  I found out that one little girl who bullied her (through exclusion) will be in the class next year, and I have told her this.  I have also reminded her that if she does go back to school, we will have to start having a bedtime again, which is something we have given her more control over since she hasn&#39;t been in school.  I don&#39;t want to forbid her from going if she really wants to do it, but if she does go, we have to make a commitment to go for at least a semester.  The school is a laboratory school for the university&#39;s early childhood ed program, and they have a harder time filling the slots for the older class.  I have been completely open with the school&#39;s administrator about what we are doing, and I feel comfortable going in to speak with the teachers and the director about the problems we<br/>\n had last semester.<br/>\n<br/>\n<br/>\n<br/>\nSo what have other parents done when faced with a similar situation?  If this was regular public school, I would be fine with sending her and letting her see for herself if it is the right place for her.  But I can&#39;t send her and then pull her out 6 weeks later, due to the nature of the lab school.<br/>\n<br/>\n<br/>\n<br/>\nThanks in advance for any perspective you all can give me!<br/>\n<br/>\n<br/>\n<br/>\nShannon<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n      <br/>\n<br/>\n    <br/>\n    <br/>\n\t<br/>\n\t <br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t<br/>\n<br/>\n<br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What if she wants to go to school?","postDate":"1236979590","msgId":38894,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdwZWoyNis3OGVlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdwZHB0MSt1Njk4QGVHcm91cHMuY29tPg=="},"prevInTopic":38890,"nextInTopic":38900,"prevInTime":38893,"nextInTime":38895,"topicId":38890,"numMessagesInTopic":0,"msgSnippet":"... ****************** A young child isn t going to be able to conceptualize this kind of time commitment - at 4, your dd is still very based in the present.","messageBody":"<div id=\"ygrps-yiv-615489616\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Shannon&quot; &lt;ksbell@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t want to forbid her from going if she really wants to do it, but if she does go, we have to make a commitment to go for at least a semester. <br/>\n </span></blockquote>******************<br/>\n<br/>\nA young child isn&#39;t going to be able to conceptualize this kind of time commitment - at 4, your dd is still very based in the present. So its not reasonable to expect her to be part of the &quot;we&quot; who is making the commitment. The question is, if she&#39;s unhappy, are you willing to force her to go, day after day, for the whole semester?<br/>\n<br/>\nIf she&#39;s missing friends, find her more opportunities to socialize. Find playgroups, clubs, dance or music lessons, homeschool groups or even other adults to socialize with. If you think school is worth trying, by all means try the public school where you don&#39;t feel &quot;locked in&quot;. <br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":161134106,"authorName":"Shannon","from":"&quot;Shannon&quot; &lt;ksbell@...&gt;","profile":"ksbell315","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"What if she wants to go to school?","postDate":"1236953825","msgId":38890,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdwZHB0MSt1Njk4QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":38894,"prevInTime":38889,"nextInTime":38891,"topicId":38890,"numMessagesInTopic":0,"msgSnippet":"We ve been exploring unschooling for about 2 months now.  DD is 4, and she went to a very progressive preschool for 1.5 years.  She has been out of that school","messageBody":"<div id=\"ygrps-yiv-409219892\">We&#39;ve been exploring unschooling for about 2 months now.  DD is 4, and she went to a very progressive preschool for 1.5 years.  She has been out of that school for about 3 months now, and the changes in her personality are noticeable and very positive, from my perspective.<br/>\n<br/>\nHer school called yesterday to ask if we were interested in next year.  Public schools start at 4 here (pre-K), and this school has a pre-K and K program.  The main reason I pulled her out of the preschool program was financial, but the state subsidizes pre-K and K, and we are eligible to apply for a scholarship, so the financial problem won&#39;t be there.  But I need to decide in the next week or so if I want to enroll her or not, so they can give our spot to someone else if not.<br/>\n<br/>\nShe says she wants to go, and that she misses her friends.  I plan to have many conversations with her over the next week to help us make the right decision.  I found out that one little girl who bullied her (through exclusion) will be in the class next year, and I have told her this.  I have also reminded her that if she does go back to school, we will have to start having a bedtime again, which is something we have given her more control over since she hasn&#39;t been in school.  I don&#39;t want to forbid her from going if she really wants to do it, but if she does go, we have to make a commitment to go for at least a semester.  The school is a laboratory school for the university&#39;s early childhood ed program, and they have a harder time filling the slots for the older class.  I have been completely open with the school&#39;s administrator about what we are doing, and I feel comfortable going in to speak with the teachers and the director about the problems we had last semester.<br/>\n<br/>\nSo what have other parents done when faced with a similar situation?  If this was regular public school, I would be fine with sending her and letting her see for herself if it is the right place for her.  But I can&#39;t send her and then pull her out 6 weeks later, due to the nature of the lab school.<br/>\n<br/>\nThanks in advance for any perspective you all can give me!<br/>\n<br/>\nShannon</div>","specialLinks":[]}],"prevTopicId":38939,"nextTopicId":38922}}