{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":145604420,"authorName":"Cheryl Morkan","from":"&quot;Cheryl Morkan&quot; &lt;Luckiebyrd@...&gt;","profile":"luckiebyrd2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Mindfulness","postDate":"1087559114","msgId":802,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNhdWtrYSs0bWdtQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":801,"nextInTime":803,"topicId":802,"numMessagesInTopic":0,"msgSnippet":"This book isn t specifically a parenting book.  Instead it can be applied to every aspect of our lives.  It seems like many of you know these principles","messageBody":"<div id=\"ygrps-yiv-1155649521\">This book isn&#39;t specifically a parenting book.  Instead it can be <br/>\napplied to every aspect of our lives.  It seems like many of you know <br/>\nthese principles intuitively, but for those of us who don&#39;t this book <br/>\nis clearly written and transforming.  Just thought I&#39;d share.<br/>\n<br/>\nCheryl<br/>\n<br/>\nExcerpt from Mindfulness By Ellen J. Langer<br/>\n<br/>\n\t&quot;Openness, not only to new information, but to different <br/>\npoints of view is also an important feature of mindfulness.  For <br/>\nyears, social psychologists have written about the differences <br/>\nbetween the perspective of an actor and that of an observer.  For <br/>\ninstance, we are likely to blame circumstances for our own negative <br/>\nbehavior: `The subway made me late&#39;.  If the very same behavior is <br/>\nengaged in by someone else, however, we tend to blame that <br/>\nindividual: `He is chronically behind schedule.&#39;<br/>\n\t&quot;Once we become mindfully aware of views other than our own, <br/>\nwe start to realize that there are as many different views as there <br/>\nare different observers.  Such awareness is potentially liberating.  <br/>\nFor instance, imagine that someone has just told you that you are <br/>\nrude.  You thought you were being frank.  If there is only one <br/>\nperspective, you can&#39;t be both right.  But with an awareness of many <br/>\nperspectives, you could accept that you are both right and <br/>\nconcentrate on whether your remarks had the effect that you actually <br/>\nwanted to produce.  If we cling to our own point of view, we may be <br/>\nblind to our impact on others; if we are too vulnerable to other <br/>\npeople&#39;s definitions of our behavior, we may feel undermined, for <br/>\nobservers are typically less flattering of us than we are of <br/>\nourselves.  It is easy to see that any single gesture, remark, or act <br/>\nbetween people can have at least two interpretations: spontaneous <br/>\nversus impulsive; consistent versus rigid; softhearted versus weak; <br/>\nintense versus overemotional; and so on.<br/>\n\t&quot;This list should not give the impression that for every act <br/>\nthere are two set, polarized interpretations.  As we said, there are <br/>\npotentially as many interpretations as there are observers.  Every <br/>\nidea, person or object is potentially simultaneously many things <br/>\ndepending on the perspective from which it is viewed.  A steer is <br/>\nsteak to a rancher, a sacred object to a Hindu, and a collections of <br/>\ngenes and proteins to a molecular biologist.  Nor does being mindful <br/>\nmean that we can plan certain defined ways of interacting with others <br/>\nthat will produce certain outcomes; rather, it means that we remain <br/>\naware that the various possible perspectives will never be exhausted.&quot;</div>","specialLinks":[]}],"prevTopicId":797,"nextTopicId":794}}