{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":18,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Reframing","postDate":"1296164019","msgId":46031,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGloc29iaiszM2RmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PERENUQ3OUI1LUU0RTUtNDRFQS04MEIyLTU3RTNFMTAxMTNGQ0B2ZXJpem9uLm5ldD4="},"prevInTopic":46029,"nextInTopic":0,"prevInTime":46030,"nextInTime":46032,"topicId":45998,"numMessagesInTopic":0,"msgSnippet":"... I want to clarify this a little, because Schuyler made a comment that can be read as a direct contradiction, suggesting a greater focus on details, rather","messageBody":"<div id=\"ygrps-yiv-1908376821\">Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I think where you&#39;re having problems is that you&#39;re here to discuss  <br/>\n&gt; *your* problem. But the list exists to discuss *ideas* that help and  <br/>\n&gt; hinder joyful living and learning. Can you picture the difference?<br/>\n<br/>\n </span></blockquote>I want to clarify this a little, because Schuyler made a comment that can be read as a direct contradiction, suggesting a greater focus on details, rather than philosophy ;) <br/>\n<br/>\nIt&#39;s challenging to discuss unschooling in vague, theoretical terms because so much of how unschooling works comes down to details. So it can help to get down into those details - what happened first? Wait, what happened the hour before that? - because those details will frame out how your principles come into play. And yet, most of the people reading won&#39;t have the same, exact problem in the same, exact way. So details are pulled out in order to clarify how some pretty high falutin&#39; ideals actually work in real life. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Reframing","postDate":"1296156681","msgId":46029,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGloc2g2OStyY3UxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI5REEyMTEyLTJBREUtNDM1NC05MzExLUUyNkZFQTA4QTA1M0B5YWhvby5jb20+"},"prevInTopic":46028,"nextInTopic":46031,"prevInTime":46028,"nextInTime":46030,"topicId":45998,"numMessagesInTopic":0,"msgSnippet":"... ******************** Something that can help is to see momentary joys rather than look for whole days of joy. Every moment you have the opportunity to","messageBody":"<div id=\"ygrps-yiv-2118432309\">mama_Agnieszka &lt;mama_agnieszka@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; &gt; Find a way to find your joy.<br/>\n&gt; &gt; <br/>\n&gt; Yes, that is the key.  And often times I do.  But &quot;dry&quot; times happen, too.  I am realizing that that&#39;s just it.  There is a time for everything and right is different from what it was 1 year ago or what will be two weeks from now.<br/>\n </span></blockquote>********************<br/>\n<br/>\nSomething that can help is to see momentary joys rather than look for whole days of joy. Every moment you have the opportunity to reframe, too, to shift more toward joy or contentment. <br/>\n<br/>\nIf you&#39;re stringing all your unhappy moments together in your mind, it will seem like your days are unhappy. When you reflect, you can choose to string together the pleasant moments instead, and see your life in a more positive vein. In the moment, when you realize you&#39;re bored or unhappy, you can choose another direction for your thoughts and perceptions. You don&#39;t have to focus on your boredom, you can shift your attention to the way the light gleams off your child&#39;s hair, or the way their faces look when they&#39;re intent, or emotional. You can make those long, &quot;dry&quot; days into a series of chances to savor the moment - which will in turn become a series of fond memories to recollect later, when they&#39;re older. <br/>\n<br/>\nThere&#39;s a point where this all starts to slip over into psychology and spirituality - how do you go about loving your life? That&#39;s not a question that others can necessarily answer for you ;) but it could be something to add to your list of things to read and think about and practice. More than one unschooler over the years has described unschooling as a kind of spiritual practice. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Reframing","postDate":"1296155938","msgId":46028,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGloc2dmMitnMG52QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEYzOEQ0QjMwLTcwOEYtNEREQy05OTRGLUM3MTQ2QjUzRjM3QkB5YWhvby5jb20+"},"prevInTopic":46027,"nextInTopic":46029,"prevInTime":46027,"nextInTime":46029,"topicId":45998,"numMessagesInTopic":0,"msgSnippet":"... **************** I m sorry, I wasn t clear - I meant your kids can be one of your passions, not that they somehow should be included in all your interests.","messageBody":"<div id=\"ygrps-yiv-1143533079\">mama_Agnieszka &lt;mama_agnieszka@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Is it possible for your kids to be part of all your passions?  Can all of an adult&#39;s interests and passions include children?  It would really depend on what these are.<br/>\n </span></blockquote>****************<br/>\n<br/>\nI&#39;m sorry, I wasn&#39;t clear - I meant your kids can be one of your passions, not that they somehow should be included in all your interests. Its good to invite them, for sure! Just as good (in some cases better) to allow your passion for your children to bring you into their world, their interests, and to see that exploration as an aspect of one of your passions. Is that clearer or am I making a mess of this? Because I&#39;m passionate about my kids, I can see engaging with them as something that fills me up, too - I&#39;m doing something I value deeply, even if it only &quot;looks&quot; like playing. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I have one niggling question.  This came up in another discussion - is it really okay to bring my selfish ideas into the mix?  I guess I&#39;m considering the fact that I am the adult here and putting my selfish reasons for doing things this way could be misconstrued as putting myself first...<br/>\n </span></blockquote>********************<br/>\n<br/>\nA little bit of selfishness can be a good thing, though - it can keep you from going too far into martyrdom if you&#39;re inclined in that direction, for instance: &quot;poor me, I never get what *I* want&quot;. Its okay to see doing things with and for your kids as a way of filling up your own desires - in fact, it can be really helpful in terms of feeling good about your life. <br/>\n<br/>\nI think maybe you&#39;re contrasting what I&#39;m writing here to another thread where a mom started out by saying she couldn&#39;t wait to do more of the things she wanted to do with her kids? That&#39;s a different kind of selfishness, of seeing kids as tools for personal fulfilment and blaming them, unconsciously, when that fulfilment is lacking. <br/>\n<br/>\nWhen my kids were little and I chafed at the hours and hours spent in their company, I&#39;d remind myself that I wanted that life. Not in a &quot;what was I thinking?&quot; way, but so that I could stop and savor the very moments (hours) I was resisting. I was living my dream! I could celebrate that success rather than wishing I could move on to the next part of the dream where they can drive me around and read to me while I knit and sew to me heart&#39;s delight (and when I&#39;m old and can&#39;t drive I hope to remember I want that, too ;)).<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":124256069,"authorName":"Bun","from":"&quot;Bun&quot; &lt;alohabun@...&gt;","profile":"alohabun","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Reframing","postDate":"1296149876","msgId":46027,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGloc2FoaytvOHMxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlocWh0cit0dGdoQGVHcm91cHMuY29tPg=="},"prevInTopic":46025,"nextInTopic":46028,"prevInTime":46026,"nextInTime":46028,"topicId":45998,"numMessagesInTopic":0,"msgSnippet":"... Keep a notebook or pen and paper handy.  Write the positive things down (as simple as they might be) as you notice them.  Look them over at the end of the","messageBody":"<div id=\"ygrps-yiv-250687094\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Agnieszka&quot; &lt;mama_agnieszka@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I&#39;d like to be in a place like what Connie describes.  I don&#39;t have a way to get myself there as of yet. <br/>\n<br/>\n </span></blockquote>Keep a notebook or pen and paper handy.  Write the positive things down (as simple as they might be) as you notice them.  Look them over at the end of the day.  <br/>\nLaurie</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Reframing","postDate":"1296126322","msgId":46025,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwNjIwLjQwMTUyLnFtQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGlocWV2ZytpMGpyQGVHcm91cHMuY29tPg==","referencesHeader":"PGlocWV2ZytpMGpyQGVHcm91cHMuY29tPg=="},"prevInTopic":46024,"nextInTopic":46027,"prevInTime":46024,"nextInTime":46026,"topicId":45998,"numMessagesInTopic":0,"msgSnippet":"Hmmm.  I chose to have my son.  I did not choose for him to have  chronic constipation which keeps him up night after night.  I chose to  see a doctor and a","messageBody":"<div id=\"ygrps-yiv-182167784\">&quot;Hmmm.  I chose to have my son.  I did not choose for him to have  chronic <br/>\nconstipation which keeps him up night after night.  I chose to  see a doctor and <br/>\na naturopath to address the problem.  I did not choose  that the issue is taking <br/>\na long time to resolve.  I chose to do  everything in my power to help him.  I <br/>\ndid not choose the outcomes of  that effort.&quot;<br/>\n<br/>\nBut it isn&#39;t just your actions that you get to choose, it is also your <br/>\nperspective. The more you can find the positive, the more Pollyanna-ish you can <br/>\nbe about the experience, the easier it is to find the less depressive outlook. <br/>\nIt takes practice, but every time you look for a silver lining you will get <br/>\nbetter at it. There isn&#39;t a quick turning to the light from which there will be <br/>\nno turning. There is only small steps toward looking for the more uplifting <br/>\noutlook. <br/>\n<br/>\n<br/>\n&quot;Hmmm.  The moments when I feel &quot;trapped&quot; will not be solved by my children&#39;s <br/>\nattendance at school. &quot;<br/>\n<br/>\nProbably not. Probably, if you have a tendency to feeling &quot;trapped&quot; you will <br/>\nfeel trapped whether they are in school or not. It is probably not the <br/>\ncircumstances that you are in as much as it is the sense that something external <br/>\ncould fix this for you. If you can start from what you&#39;ve written it may help <br/>\nyou to move forward, with small steps, to a point where you can try and see your <br/>\nlife less as a prison. <br/>\n<br/>\n<br/>\n&quot;When  my child is not able to sleep peacefully and I feel exhausted, I often  <br/>\nchoose to make our days easier so as to allow our tiredness the space to  just <br/>\nbe. &quot;<br/>\n<br/>\nThat&#39;s an absolutely good thing. Lots of gentle things to do on days when you <br/>\nare feeling more fragile. When any of you is feeling more fragile. <br/>\n<br/>\n<br/>\n&quot;When my children disagree and argue with each other  and I am already <br/>\nphysically exhausted and find it difficult to be  emotionally strong for them, I <br/>\noften choose to take the time to speak  with each child separately in order to <br/>\nprevent the situation from  escalating.&quot;<br/>\n<br/>\nI&#39;ve always worked to help Simon and Linnaea work through differences. Sometimes <br/>\nseparate conversations help, sometimes a few words or a distraction is enough. <br/>\n<br/>\n<br/>\n&quot;What I am thinking though is, I do not have control  over my children&#39;s <br/>\nsleeplessness, health issues, or arguing and  disagreeing. &quot;<br/>\n<br/>\nI have a fair bit of control over some aspects of those things. The later two <br/>\nparticularly. I am amazingly good, with being present, at helping Simon and <br/>\nLinnaea to not come to blows and to help them to move away from tension. It <br/>\ndoesn&#39;t mean I&#39;m perfect, but I have found that just being there with them and <br/>\nmaking sure that things like hunger and thirst and boredom aren&#39;t playing a role <br/>\nhas really made a big difference. <br/>\n<br/>\n<br/>\nBut more than that I have control over how I respond to any of those things. If <br/>\nSimon or Linnaea can&#39;t sleep, I have laid with them and watched movies on our <br/>\nportable DVD player or laptop computer, or told them stories, or run a warm bath <br/>\nfor them or done whatever else would help. And I&#39;ve dozed into the next day, or <br/>\nset up a room where they could play safely while I slept on a blanket nest in <br/>\nfront of the door. If Simon or Linnaea are sick I&#39;ve done what I can to make <br/>\nthem comfortable. I&#39;ve worked to make whomever comfortable while still <br/>\nmaintaining the life of the other child. And it takes juggling and sometimes I <br/>\nwould lean against the wall and breathe and breathe again, but looking for the <br/>\nbright, the happy, the good moment has helped more and more and more. Far more <br/>\nthan dwelling on the moments when I felt trapped, lost, useless. <br/>\n<br/>\n<br/>\nThe darker moments don&#39;t make anything better or more valuable for me. They just <br/>\nmake good things crap. And while I still have them and presume that I will have <br/>\nthem for the rest of my life, I work to not let them define my world view. I can <br/>\ncontrol my perspective, even if it is only a slow process, even if there are <br/>\nmoments where I feel like I&#39;m starting all over again. Knowing that I feel <br/>\nbetter when I look for the better thing, when I make the better choice, when I <br/>\nturn toward the light, helps me to do it again the next time. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Reframing","postDate":"1296120162","msgId":46024,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3NTU1MC4xOTk5MS5xbUB3ZWI4NjIwMS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDIwRkVCQ0JFLUI5RDYtNDBGMi05RjM0LTJFMDgyNzkxRTAxMUB5YWhvby5jb20+","referencesHeader":"PGlocGx2dCtpaWo0QGVHcm91cHMuY29tPiA8ODIxOTQ2LjQ0NjM4LnFtQHdlYjg2MjAyLm1haWwuaXJkLnlhaG9vLmNvbT4gPDIwRkVCQ0JFLUI5RDYtNDBGMi05RjM0LTJFMDgyNzkxRTAxMUB5YWhvby5jb20+"},"prevInTopic":46023,"nextInTopic":46025,"prevInTime":46023,"nextInTime":46025,"topicId":45998,"numMessagesInTopic":0,"msgSnippet":"... Nor was my posting a request that you do.  Have I given you that impression at some point?  I would appreciate where and how I have done so. ... You ve","messageBody":"<div id=\"ygrps-yiv-212688232\"><blockquote><span title=\"ireply\">&gt; I can&#39;t make your life good for you.<br/>\n&gt; <br/>\n </span></blockquote>Nor was my posting a request that you do.  Have I given you that impression at <br/>\nsome point?  I would appreciate where and how I have done so.<br/>\n------------<br/>\n<br/>\nYou&#39;ve asked more than a couple of times if this is a discussion list. I assume <br/>\nit is questions like this one that you feel are discussion points that are <br/>\nreasonable. I think this is a perfect example of how not to use this list. <br/>\n<br/>\n<br/>\nMy statement wasn&#39;t clear. Before I posted, as I reread my post, I did pause <br/>\nover those words.It would have helped if I&#39;d added something akin to the line <br/>\n&quot;only you can look for the good in your life.&quot;  So, for clarity, let me add that <br/>\nnow. <br/>\n<br/>\n<br/>\nHowever you pulled those words out to demonstrate my lack of understanding of <br/>\nyou personally instead of my lack of clarity. Truth is I don&#39;t know you. And <br/>\neven if I did know you, my storytelling approach to writing would have had the <br/>\nsame message. To make your life good, look for the good in your life. Look for <br/>\nthe little feet to tickle. Look for the little moments of joy. Look for the <br/>\nsmall bits of pleasure and weave them into a bigger tapestry of joy. But it <br/>\nisn&#39;t about you. It may feel like I&#39;m talking about your life as though I <br/>\npresume to sit on judgement on it, but I&#39;m not. I&#39;m just talking about what I <br/>\nread and what I see in your writing. I&#39;m writing about what I know about <br/>\nunschooling. I&#39;m writing about what has helped not only my life and perspective <br/>\nbut other people whose writing I&#39;ve read or whose conversations I&#39;ve shared. <br/>\n<br/>\n<br/>\nIf what I write doesn&#39;t work for you, ignore it. If the way I write makes you <br/>\nangry, it may be better not to ever read it. Block me from ever appearing in <br/>\nyour e-mail if it helps to make this list more useful to you. Spending the time <br/>\nto rally against me may take energy away from what you want to be doing. I wrote <br/>\nmay, I wrote if; in no way am I exhorting you to change in any way you don&#39;t <br/>\nwant to change. This isn&#39;t an either/or statement, just a look there are more <br/>\nchoices than you may have noticed redirection. <br/>\n<br/>\n<br/>\nAs an addendum, as a suggestion for otherwise, it may help you more if you ask <br/>\nfor specific things rather than general philosophy. Things to do after a night <br/>\nspent awake with a 1 year old boy, for example, or how to handle when small <br/>\nsiblings quarrel, or what would help in this situation...? The folks on this <br/>\nlist are phenomenal at brainstorming. Really good at giving lists of ideas and <br/>\noptions that can help in real concrete ways. And those concrete things can <br/>\nchange your perspective in real and affirming ways. If you can implement things, <br/>\nif you can see options instead of something thrust upon you, you may feel you <br/>\nhave so much more power over your own life. It can really help. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Reframing","postDate":"1296100711","msgId":46023,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERENUQ3OUI1LUU0RTUtNDRFQS04MEIyLTU3RTNFMTAxMTNGQ0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGlocWh0cit0dGdoQGVHcm91cHMuY29tPg==","referencesHeader":"PGlocWh0cit0dGdoQGVHcm91cHMuY29tPg=="},"prevInTopic":46022,"nextInTopic":46024,"prevInTime":46022,"nextInTime":46024,"topicId":45998,"numMessagesInTopic":0,"msgSnippet":"... It s a group to discuss what helps and what hinders the flow of unschooling. If someone has a *primary* goal other than their kids joyful living and","messageBody":"<div id=\"ygrps-yiv-506155041\">On Jan 26, 2011, at 8:31 PM, Agnieszka wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I want to clarify this finally, if I can. Is this a discussion  <br/>\n&gt; group? Can we discuss differing points?<br/>\n<br/>\n </span></blockquote>It&#39;s a group to discuss what helps and what hinders the flow of  <br/>\nunschooling.<br/>\n<br/>\nIf someone has a *primary* goal other than their kids joyful living  <br/>\nand learning, unschooling with that other goal wouldn&#39;t be useful to  <br/>\ndiscuss since the list promises to focus on discussing what helps and  <br/>\nwhat hinders kids joyful living and learning.<br/>\n<br/>\nA specific example might be if someone were into natural living and  <br/>\nunschooling was the natural learning part of their life. For them,  <br/>\nnatural living trumps unschooling. When their desire for a natural (TV  <br/>\nfree, artificial food free) life clashed with their kids desire to  <br/>\nexplore Fruit Loops and Jersey Shore, they natural life would trump it.<br/>\n<br/>\nDoes that help? Or can you give me examples of what you mean by  <br/>\n&quot;differing points&quot;?<br/>\n<br/>\nI think where you&#39;re having problems is that you&#39;re here to discuss  <br/>\n*your* problem. But the list exists to discuss *ideas* that help and  <br/>\nhinder joyful living and learning. Can you picture the difference?<br/>\n<br/>\nThe idea the list operates around is to help you and anyone else with  <br/>\nsimilar problems step back away from the details and see a bigger  <br/>\npicture. To see how one part affects many parts. To see how a part way  <br/>\nover there can be affecting this part.<br/>\n<br/>\nOh, maybe this analogy will help. The list exists to help people  <br/>\nunderstand what makes Jaguar car engines run smoothly and what can get  <br/>\nin the way of them running smoothly. The goal is to help them build a  <br/>\nholistic understanding of how everything works together so they can  <br/>\nkeep their own particular year and configuration of Jaguar engine  <br/>\nrunning smoothly.<br/>\n<br/>\nIf someone posts about their particular issue about a clogged fuel  <br/>\nline in their 1953 XK120 Jaguar, the discussion will be about the  <br/>\nbigger picture of ideas that will help someone keep all their lines  <br/>\nfree flowing, and ideas about how the various kinds of gasoline effect  <br/>\nthe engine, and ideas about how driving practices can have an effect  <br/>\non fuel.<br/>\n<br/>\nSome people just want the simple answer of what to do about their  <br/>\nclogged fuel line. They want only the pieces that will directly help  <br/>\nthem with their problem.<br/>\n<br/>\nIf an unschooling poster just wants the bits that apply to reading, or  <br/>\nthe bits that apply to feeling unfulfilled, they will likely find this  <br/>\nlist frustrating. It&#39;s because this list is geared toward people who  <br/>\nare curious about the big picture. It&#39;s for people who find themselves  <br/>\nhungry to build an understanding of the philosophy and how the  <br/>\nprinciples make it all work.<br/>\n<br/>\nAnd I&#39;m not saying that in a people like that are superior way. It&#39;s  <br/>\njust that this list feeds people who have that particular hunger. When  <br/>\nI first started reading about unschooling on a board similar to this  <br/>\nlist, I couldn&#39;t stop. The list was churning out what I was hungry for.<br/>\n<br/>\nBut the people who came looking for a fix to their clogged fuel line,  <br/>\nnot wanting to be told the crap gas they were using was the ultimate  <br/>\nproblem and would be causing other problems soon, didn&#39;t like it at all.<br/>\n<br/>\nYou may be open to ideas beyond clogged fuel lines, but when the  <br/>\ndiscussion draws back to bigger issues that connect to clogged fuel  <br/>\nlines that may apply to you or to others with clogged fuel lines, you  <br/>\nkeep pulling the discussion back and focusing on your particular fuel  <br/>\nline.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Reframing","postDate":"1296096206","msgId":46022,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0NENCQTI2QTdGRjQzRkQ5RkI2RjgyRTIxRjJENjBDQENvbm5pZVBDPg==","inReplyToHeader":"PGlocWh0cit0dGdoQGVHcm91cHMuY29tPg==","referencesHeader":"PGlocWh0cit0dGdoQGVHcm91cHMuY29tPg=="},"prevInTopic":46021,"nextInTopic":46023,"prevInTime":46021,"nextInTime":46023,"topicId":45998,"numMessagesInTopic":0,"msgSnippet":"... Yes, you do have a way to get there. I didn t get there all at once. I got there by focusing on the little bitty stuff. I got there by making different","messageBody":"<div id=\"ygrps-yiv-1692598042\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;I&#39;d like to be in a place like what Connie describes. I don&#39;t have a way to get myself there as of yet. There are many choices that I have made to be here and now with my children. I also see that there are many things that just happen as part of life: my son&#39;s sleeplessness or tummy problems, my own postpartum depression and anxiety. I have trouble seeing how I can interpret those experiences as being within my control. Part of the trouble with depression, too, is that it makes positive interpretation challenging.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Yes, you do have a way to get there. I didn&#39;t get there all at once. I got there by focusing on the little bitty stuff. I got there by making different choices. I got there by making very deliberate choices on may part. <br/>\n<br/>\nYes, your son is sleepless and has tummy problems. You can choose to be thankful that you have a son that isn&#39;t dead. You can choose to be thankful that you have enough health to be able to walk the floors with him. You can pick apart that situation and find all kinds of things to appreciate and be thankful for on some level. It is really hard to see that if you are used to feeling powerless. You feel powerless so that feeds your depression, which feeds your feelings of being in a prison, which makes it hard for you to be a parent of any kind. It is hard enough for a parent that isn&#39;t depressed to find the positive in some situations. I can only imagine how hard it would be for you to find the positive. <br/>\n<br/>\nThe people on this list are trying to hold your thoughts up to examination and tell you, &quot;YOU HAVE THE POWER&quot;. Unless you can see that you are a powerful person that has the ability, right now, to make different choices, then we are wasting our breath. Until you realize that it is up to you to make a difference, then we can&#39;t really help you. If you are depressed and anxious, then unschooling may not be the best path for you. Or, if you do continue to unschool, it might be helpful to find a way for you to get some kind of a break. You need a break from your kids and your kids need a break from you. It is not healthy for kids to be around somebody that is depressed and anxious all day, every day. <br/>\n<br/>\nIf you need time away from your kids, so you can sleep and deal with your depression, then find a way to make it happen. Are you seeking help for your depression and anxiety? You may not be able to control the fact that you have those things but you can seek treatment. You can take baby steps to get where you want to go. Don&#39;t look at where I am because that can be too overwhelming. Find one thing positive that you can do each day. At one point, I did this exercise with myself that made a huge difference. Every time I had a negative thought, I would go look up a positive quote to negate my negative thought and post it on my Facebook page. There for a while, I was driving my friends crazy with all of my positive and upbeat posts. I wasn&#39;t really feeling those things but it was a great way for me to change my internal dialogue. What started out as an exercise for me to get rid of the negative thoughts has been awesome because now when I post positive things, I really feel them and think them. I had to change my own focus. I had to realize just how negative I had become. <br/>\n<br/>\nI seem to recall that you said that you liked to study religion and philosophy. There are discussion lists where you can talk about those topics with other people that are interested in them. My husband likes to study religion and philosophy so he looks for books that he can order on Amazon and reads them whenever he gets a chance. My husband has found some really interesting philosophy books like Anime and Philosophy. We are always looking for ways of tying our interests and our kids interests together. <br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Reframing","postDate":"1296095549","msgId":46021,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5MTQ1NS45NDQ0OS5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDIwRkVCQ0JFLUI5RDYtNDBGMi05RjM0LTJFMDgyNzkxRTAxMUB5YWhvby5jb20+","referencesHeader":"PGlocGx2dCtpaWo0QGVHcm91cHMuY29tPiA8ODIxOTQ2LjQ0NjM4LnFtQHdlYjg2MjAyLm1haWwuaXJkLnlhaG9vLmNvbT4gPDIwRkVCQ0JFLUI5RDYtNDBGMi05RjM0LTJFMDgyNzkxRTAxMUB5YWhvby5jb20+"},"prevInTopic":46020,"nextInTopic":46022,"prevInTime":46020,"nextInTime":46022,"topicId":45998,"numMessagesInTopic":0,"msgSnippet":"   There has","messageBody":"<div id=\"ygrps-yiv-7884026\"> <br/>\n&lt;&lt;&lt;  No, not at all. We have each other in our lives. And actually, it hardly <br/>\neven matters whether there was anything accidental about it! &gt;&gt;&gt;<br/>\n<br/>\nThere has been a long thread about how the words you use make the picture for <br/>\nthe ones reading them.<br/>\nThere are many parents that became parents as an accident or had a kid but it <br/>\nwas not wanted. Many of them resent their children because of it.<br/>\n Maybe it sounded like you do because of your choice of words.<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;The point is that we have each other here and now, no matter if we planned <br/>\nevery step along the way or not. But, I am curious, how did a factual statement <br/>\nbecome so loaded for you?&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nAgain it about how you painted the picture. IT may not be the picture you want <br/>\nto paint but that is how some will read it.<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;I appreciate that this is your experience. What is your intention in sharing <br/>\nit with me? &gt;&gt;&gt;&gt;<br/>\n<br/>\nI can answer that because I got what Schuyler wrote and you did not as you are <br/>\nbeing very defensive. <br/>\n<br/>\n Schuyler was showing you how you can see it with a different attitude and <br/>\ndifferent eyes.<br/>\nHow it is a choice. You can choose to see your children in a different light, <br/>\nyou can make choices. You can choose &#39;<br/>\nto see them like the wonder they are and choose to make them your passion for <br/>\nthe moment.<br/>\nThey will grow so fast.<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;If you were to take your example one step further you would be saying that <br/>\nyou chose to meet and fall in love with the man that is your husband. Is it <br/>\npossible to plan and intend that rather crucial step in having your current <br/>\nlife? It&#39;s possible to hope to meet someone special - but to plan it? And to <br/>\nplan on falling in love with that particular person? I&#39;m sure countless people <br/>\nhave tried...&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nActually Schuyler and I have had this conversation before, and correct me if I <br/>\nam wrong Schuyler, but we agree that the love we feel for our partners is a <br/>\nchoice, just like it is a choice if we unschoo or not, make our children a <br/>\npriority or our passion or not. It is a choice you make everyday. You can choose <br/>\na different path.<br/>\nBut when someone feel they have no choice they will not be happy about it.<br/>\n<br/>\n&lt;&lt;&lt;I am genuinely happy that you have achieved an approach that has been so <br/>\npositive for you. It is your interpretation of your exerience and it really <br/>\nworked for you then, and works for you now. Is your intention in sharing this to <br/>\nshow how I might benefit from the same perspective or interpretation of my life? <br/>\nHow do you think your experience can help my unschooling.&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n <br/>\nReally? How is making our children;s life sweet and choosing to see our children <br/>\nthe way Schuyler does not going to help unschooling??? If you are home and you <br/>\nrather be someone else how is that good for your children???<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Reframing","postDate":"1296094771","msgId":46020,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlocWtuaitwdXAyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlocGx2dCtpaWo0QGVHcm91cHMuY29tPg=="},"prevInTopic":46016,"nextInTopic":46021,"prevInTime":46018,"nextInTime":46021,"topicId":45998,"numMessagesInTopic":0,"msgSnippet":"A, I wonder if you had a job outside the home before you had the three kids? I wonder this because I think you may think it is more than it actually is. Going","messageBody":"<div id=\"ygrps-yiv-215088164\">A, I wonder if you had a job outside the home before you had the three kids?<br/>\n<br/>\nI wonder this because I think you may think it is more than it actually is. Going off to work every day isn&#39;t all it&#39;s cracked up to be. I do not envy DH that. Even on the worst day at home, I don&#39;t have that in my life and can be thankful for it.<br/>\n<br/>\nBut I did. For a long while. I worked at various administrative jobs and supported myself and then the two of us both worked. That was all pre-kids.<br/>\n<br/>\nThis is sooooo much better. <br/>\n<br/>\nUnless you&#39;ve got some fabulous career waiting on you? <br/>\n<br/>\nOr are you picturing deep discussions with the local book club? Or . . . what is it exactly that you want?<br/>\n<br/>\nI think this is where you started last time and the list got all tangled up in the &quot;putting Mom last&quot; idea, martyrdom and other things. <br/>\n<br/>\nDays at home can be excruciatingly dull. If you are looking to be somewhere else, especially. It&#39;s not a glamorous thing, being with small children. But it can be a satisfying, lovely thing, if you figure out what you are missing, let it go or figure out a way to get it, and get on with enjoying the life you have instead of missing one you don&#39;t.<br/>\n<br/>\nMy break from our 4-year-old nephew will be tomorrow. Just a different sort of day when I won&#39;t be watching him for the bulk of the day. My plan? To get the taxes done. Glamorous, huh? :) But it needs doing and I need the refund so I am looking forward to it. Small goals? Different from the grand ideas you seem to crave but. . .<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Agnieszka&quot; &lt;mama_agnieszka@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I posted a while ago about craving intellectual stimulation when I&#39;m surrounded by my 6, 4.5 and 1 year olds...  The fantasy of a career nags at me.  Conversations and explorations...or even just quiet time to think through something I&#39;m interested in.  I&#39;m not able to pursue finding my passions and actually pursuing them because I can&#39;t think!  <br/>\n&gt;  <br/>\n&gt; I realize that these things will come in time but for now I find myself envious of my husband career, envious even of a friggin&#39; mail carrier because they have quiet and can walk at a nice pace. :-)  <br/>\n&gt; <br/>\n&gt; Telling myself that this will pass isn&#39;t helping because I am also very aware that anything could happen between now and tomorrow... and investing myself in a future that may not happen, waiting for things &quot;when the kids are grown&quot; is a rather useless approach...<br/>\n&gt; <br/>\n&gt; So, what would you suggest? </span></blockquote></div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Reframing","postDate":"1296090125","msgId":46016,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZCMDA0QzQ0NjdFMzQ4MUU4NENDQzBCRTMzNjhEN0Q4QENvbm5pZVBDPg==","inReplyToHeader":"PDI5REEyMTEyLTJBREUtNDM1NC05MzExLUUyNkZFQTA4QTA1M0B5YWhvby5jb20+","referencesHeader":"PGlocGx2dCtpaWo0QGVHcm91cHMuY29tPiA8OUIyOTUxNkVFQkIyNEEyRDkyMkYzQTU4OUNFOERCRTdAQ29ubmllUEM+IDwyOURBMjExMi0yQURFLTQzNTQtOTMxMS1FMjZGRUEwOEEwNTNAeWFob28uY29tPg=="},"prevInTopic":46015,"nextInTopic":46020,"prevInTime":46015,"nextInTime":46018,"topicId":45998,"numMessagesInTopic":0,"msgSnippet":"From: mama_Agnieszka Sent: Wednesday, January 26, 2011 5:13 PM To: unschoolingbasics@yahoogroups.com Subject: Re: [unschoolingbasics] Reframing ... There are","messageBody":"<div id=\"ygrps-yiv-1882271937\">From: mama_Agnieszka <br/>\nSent: Wednesday, January 26, 2011 5:13 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSubject: Re: [unschoolingbasics] Reframing<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;Hmmm. I don&#39;t think that the fact that sometimes doing the work of parenting is emotionally exhausting means that I don&#39;t enjoy the kids!! Seems a pretty drastic conclusion to make. Is it really a choice between &quot;love every split second of being with your children&quot; or &quot;hand them off to someone else&quot;? Why?&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>There are more choices than that but your e-mail came across as kind of negative and it didn&#39;t sound like there was much positive. Sure, it can be exhausting but I have found ways to enjoy being exhausted. I know that sounds weird but I have experienced such a drastic shift in perspective that even when my kids are sapping all of my energy, I am able to find something positive. I am able to find something joyful. I don&#39;t know you and I don&#39;t know what kinds of small things feed your soul. When I find myself getting too exhausted, I find comfort in the idea that I have the luxury to be able to be home with my kids. I also work from home so that feeds some of the other areas of my soul. Look for small things in the midst of the chaos when you are emotionally exhausted. Give yourself permission to have a pajama day where you sit around snuggling with your kids. The more I think about it, the more I think that it is a good idea to love every second of being with your children. <br/>\n<br/>\nMaybe this isn&#39;t helpful to you but sometimes I think of how lucky I am to get to be with my children. Some moms don&#39;t have that kind of choice because they are single moms. Some moms don&#39;t have the option of being with their children because their children have passed away. Some parents don&#39;t get to be with their kids because of divorce or large geographic separations. A friend of mine had her baby taken when he was 6 weeks old. The father took the baby and ran off to another state. It took her over a year and a half to find her baby and get him back. So, with all that in mind, I do enjoy every split second of being with my children. Even when they piss me off, I enjoy it. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Are there sitters (or parents) who always unequivocally enjoy every moment of being with a screaming toddler at 3 AM and 4 AM and 5 AM... or two bickering children who need help sorting out their disagreement at 7 AM? I find that an unreal expectation.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I have four kids so I know that it can be rough. It can be really hard when one kid doesn&#39;t go to bed until 3 AM only to have another one wake up crying at 4 AM. Am I happy every second of the day? No, I am not happy. Am I thankful to have the choice to be able to be with my kids? Yes. I am very thankful. Part of being thankful is to relish the good moments and work through the bad ones so that I can get to the next good one. There are some days that I feel like I am hanging on by a thread so that I can get to the next good moment. If you aren&#39;t watching for those good moments, you might miss them because you are too busy focusing on the bad ones. It took me a while to figure that one out. <br/>\n<br/>\nAlso, make sure that your expectations are realistic. You have 3 children. Things aren&#39;t going to be all roses and sunshine. It takes a lot of work to keep three children fed and clothed. There are a lot of strategies that you can use to make your life easier but even with all of the advanced planning, there are still going to be rough spots. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;My point is that I find things to be more complex than the choice between enjoying my children and enjoying myself. I&#39;m looking for a way towards both, and sometimes it does not come naturally to me.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Why do you think it is more complex than that? Are you unable to find joy in your children? I enjoy myself when my kids are having fun and are happy. Sometimes, I am in the middle of their activities and am enjoying things directly and sometimes I am enjoying their joy by sitting on the computer and feeding my soul while they are happily playing. This evening after getting out of the bath, the girls were cold and cranky and were fighting with each other because they all wanted me to take care of them first. I tried to multitask and work through their tears. I wouldn&#39;t say that I enjoyed the tears but I knew that they wouldn&#39;t last forever. I knew that at some point, they would be happy again. After I got each of them dressed, I kissed and hugged them. My 6 year old finished up herself and offered to sit on the couch and cuddle with her sisters so they could all warm up together. By the time I finished with them all, they were cuddled up in a nice little pile on the couch smiling. I was going to sit with them but they didn&#39;t leave enough room for me. So, I went on my way to do something else. <br/>\n<br/>\nWhat brings you joy today, may not bring you joy tomorrow. What brings you joy right this second, may not bring you joy two seconds from now. I try not to worry too much about it because I have tried to find ways of finding joy in my life even when it seems like the walls are falling in around me. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Yes, absolutely... What I&#39;m realizing is that even the most brilliant arrangements can become prisons at times... So, it isn&#39;t so much about automatically changing the external circumstances...&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Exactly, but sometimes, it is easier to change the internal when you realize that the external circumstances are a result of a series of choices. It is easier to avoid being in prison if you always remind yourself that you are the one that keeps the key to the prison.<br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\nReply to sender | Reply to group | Reply via web post | Start a New Topic <br/>\nMessages in this topic (11) <br/>\nRecent Activity: a.. New Members 9 <br/>\nVisit Your Group <br/>\n Switch to: Text-Only, Daily Digest • Unsubscribe • Terms of Use.<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":209361242,"authorName":"JJ","from":"&quot;JJ&quot; &lt;jrossedd@...&gt;","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Reframing","postDate":"1296089246","msgId":46015,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlocWZhdStsbTU5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwRkVCQ0JFLUI5RDYtNDBGMi05RjM0LTJFMDgyNzkxRTAxMUB5YWhvby5jb20+"},"prevInTopic":46011,"nextInTopic":46016,"prevInTime":46014,"nextInTime":46016,"topicId":45998,"numMessagesInTopic":0,"msgSnippet":"This kind of childish game really is beneath the list imo. Can someone make it stop?","messageBody":"<div id=\"ygrps-yiv-660726613\">This kind of childish game really is beneath the list imo. Can someone make it stop?<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, mama_Agnieszka &lt;mama_agnieszka@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi!<br/>\n&gt; <br/>\n&gt; On 2011-01-26, at 11:41 AM, Schuyler &lt;s.waynforth@...&gt; wrote:<br/>\n&gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; &quot;We have a 1 year old in our house&quot; reads like it was an accident.<br/>\n&gt; &gt; <br/>\n&gt; <br/>\n&gt; No, not at all.  We have each other in our lives.  And actually, it hardly even matters whether there was anything accidental about it! <br/>\n&gt; <br/>\n&gt; The point is that we have each other here and now, no matter if we planned every step along the way or not.  But, I am curious, how did a factual statement become so loaded for you?<br/>\n&gt; <br/>\n&gt; &gt; I don&#39;t happen to have a 10 year old and a 13 year old in my house. David and I <br/>\n&gt; &gt; had sex a while back, twice, and chose to give birth to the products of those <br/>\n&gt; &gt; unions.<br/>\n&gt; &gt; <br/>\n&gt; <br/>\n&gt; I appreciate that this is your experience.  What is your intention in sharing it with me?  If you were to take your example one step further you would be saying that you chose to meet and fall in love with the man that is your husband.  Is it possible to plan and intend that rather crucial step in having your current life? It&#39;s possible to hope to meet someone special - but to plan it? And to plan on falling in love with that particular person?  I&#39;m sure countless people have tried...<br/>\n&gt; <br/>\n&gt; &gt; When they were born I chose to nurse first Simon and then, 3 years <br/>\n&gt; &gt; later, Linnaea. I chose to co-sleep, I chose to go slower in my days and to take <br/>\n&gt; &gt; ages longer to walk to the store. I chose each and every day not to run <br/>\n&gt; &gt; screaming from the house and to instead turn more and more to them. I still <br/>\n&gt; &gt; choose that. I still choose to sit with them, to talk with them, to play with <br/>\n&gt; &gt; them. When Linnaea is feeling antsy and funky and grouchy, I sit with her and we <br/>\n&gt; &gt; figure out things that help and try and avoid things that hinder. When Simon is <br/>\n&gt; &gt; feeling cuddly and loving and needy, we cuddle and love and talk and watch Deep <br/>\n&gt; &gt; Space 9 together. <br/>\n&gt; &gt; <br/>\n&gt; &gt; They went from 1 to 2 to 3 to 4. Each year, each month, each week, each day, <br/>\n&gt; &gt; each moment I chose to be with them. I didn&#39;t see it as a Sisyphean project that <br/>\n&gt; &gt; would leave me exhausted every night. I thought about it, as much as I could, as <br/>\n&gt; &gt; a pleasure, as a luxury, as a phenomenal gift to me. I didn&#39;t see it as <br/>\n&gt; &gt; something that was draining the life and creativity out of me, mostly. Mostly I <br/>\n&gt; &gt; saw it as joy and laughter and the sweetest life I could possibly live. <br/>\n&gt; &gt; <br/>\n&gt; I am genuinely happy that you have achieved an approach that has been so positive for you.  It is your interpretation of your exerience and it really worked for you then, and works for you now. Is your intention in sharing this to show how I might benefit from the same perspective or interpretation of my life?  How do you think your experience can help my unschooling.<br/>\n&gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; if you do find that the grass is greener, if you do find that putting your 1 <br/>\n&gt; &gt; year old, your 4 and a 1/2 year old, your 6 year old in some kind of other care <br/>\n&gt; &gt; system, school and daycare, is the better option for you personally, then that <br/>\n&gt; &gt; may be the answer for you. <br/>\n&gt; &gt; <br/>\n&gt; I&#39;m wondering whether those are truly the only alternatives: think this way and unschool OR find a different care system for my children... I&#39;m wondering if there truly are no other alternatives...<br/>\n&gt; &gt; <br/>\n&gt; &gt; I can&#39;t make your life good for you.<br/>\n&gt; &gt; <br/>\n&gt; Nor was my posting a request that you do.  Have I given you that impression at some point?  I would appreciate where and how I have done so.<br/>\n&gt; <br/>\n&gt; &gt; Maybe the striving for your own human <br/>\n&gt; &gt; capital is too great for you to be happy with your children.<br/>\n&gt; &gt; <br/>\n&gt; That is a valid question, one I am working to understand and answer.  It is quite complex for me.  Perhaps if I had already figured it out I wouldn&#39;t be posting about my dilemma here...<br/>\n&gt; <br/>\n&gt; &gt; I think it is <br/>\n&gt; &gt; possible to make a happy home without being home all the time. I just couldn&#39;t <br/>\n&gt; &gt; be happier than I am if I were working away from home, and I am lucky enough to <br/>\n&gt; &gt; be able to be with Simon and Linnaea as much as they will have me. <br/>\n&gt; &gt; <br/>\n&gt; <br/>\n&gt; And I think that it&#39;s fantastic for you!  <br/>\n&gt; <br/>\n&gt; I&#39;m in a different place in my life, striving to find a balance between meeting my needs and wants ad those of my children... and facing the truth that our needs and wants are different AND I am not sure that I can actively and willfully change my needs to fall in line with theirs...  But, I don&#39;t trust my reading of this entirely...  So, I asked for help with reframing.<br/>\n&gt; <br/>\n&gt; A. <br/>\n&gt; &gt; <br/>\n&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Reframing","postDate":"1296085370","msgId":46011,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxOEQwRkIzLTY3QTQtNEVENi1CMTA4LUNFODZERDkyQUJFQ0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDIwRkVCQ0JFLUI5RDYtNDBGMi05RjM0LTJFMDgyNzkxRTAxMUB5YWhvby5jb20+","referencesHeader":"PGlocGx2dCtpaWo0QGVHcm91cHMuY29tPiA8ODIxOTQ2LjQ0NjM4LnFtQHdlYjg2MjAyLm1haWwuaXJkLnlhaG9vLmNvbT4gPDIwRkVCQ0JFLUI5RDYtNDBGMi05RjM0LTJFMDgyNzkxRTAxMUB5YWhvby5jb20+"},"prevInTopic":46006,"nextInTopic":46015,"prevInTime":46010,"nextInTime":46013,"topicId":45998,"numMessagesInTopic":0,"msgSnippet":"... Schuyler saw in the way you worded your view of kids being in your life some possible underlying thoughts you might not be aware of. She offered hers for","messageBody":"<div id=\"ygrps-yiv-709279487\">On Jan 26, 2011, at 5:34 PM, mama_Agnieszka wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  But, I am curious, how did a factual statement become so loaded for  <br/>\n&gt; you?<br/>\n<br/>\n </span></blockquote>Schuyler saw in the way you worded your view of kids being in your  <br/>\nlife some possible underlying thoughts you might not be aware of. She  <br/>\noffered hers for you to look inward at yourself to see why you said  <br/>\n&quot;We have a 1 year old in our house.&quot;<br/>\n<br/>\nPeople will be more likely to word it that way for a cold or something  <br/>\nthey didn&#39;t choose to bring into the house.<br/>\n<br/>\nSchuyler offered her thoughts because she believed it might help you  <br/>\nlook at the idea in a way that might shed some light on thoughts you  <br/>\ndidn&#39;t realize were there.<br/>\n<br/>\nIf you look at it and it doesn&#39;t fit, then it doesn&#39;t.<br/>\n<br/>\nBut this list exists to do that, to shine lights on thoughts. Please,  <br/>\nplease try to understand the ways this list is different. You keep  <br/>\nbumping up against people doing what the list promises it will do for  <br/>\nposters and then questioning why it&#39;s happening.<br/>\n<br/>\nThe list exists to analyze what people send to the list in order to  <br/>\nhelp them think more clearly about the issues that come up in their  <br/>\nfamilies.<br/>\n<br/>\nThe list operates this way because the owners found they learned about  <br/>\nunschooling best that way. Not everyone does learn best that way and  <br/>\nother styles of lists are out there that will fit other styles of  <br/>\nlearning better.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I appreciate that this is your experience. What is your intention in  <br/>\n&gt; sharing it with me?<br/>\n<br/>\n<br/>\n </span></blockquote>To help you see more clearly what is choice and what isn&#39;t. People too  <br/>\noften *automatically* word it that life happens *to* them without  <br/>\nconsciously thinking about whether or not there were choices involved.<br/>\n<br/>\nToo often people will not see choice because they don&#39;t like the other  <br/>\nchoices available to them. But if they don&#39;t see the choices they have  <br/>\nwhen there are choices, they can feel trapped.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  If you were to take your example one step further you would be  <br/>\n&gt; saying that you chose to meet and fall in love with the man that is  <br/>\n&gt; your husband.<br/>\n<br/>\n<br/>\n </span></blockquote>The point is that far more in life is a choice that what people see.<br/>\n<br/>\nIt is a choice to date, though.<br/>\n<br/>\nGetting married when love happens is a choice.<br/>\n<br/>\nHaving sex in marriage is a choice.<br/>\n<br/>\nNot to use birth control is a choice.<br/>\n<br/>\nGetting pregnant is a choice.<br/>\n<br/>\nChoosing to keep the baby is a choice.<br/>\n<br/>\nBabies don&#39;t just happen to people. There are loads of choices that  <br/>\ncome before a baby arrives.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is your intention in sharing this to show how I might benefit from  <br/>\n&gt; the same perspective or interpretation of my life? How do you think  <br/>\n&gt; your experience can help my unschooling.<br/>\n<br/>\n<br/>\n </span></blockquote>Exactly. A shift in perspective can -- not always but can --  <br/>\ncompletely change how someone feels about something and how they react  <br/>\nto it. I can look out the window and groan at the snow. Or I can see  <br/>\nhow pretty they are and how white everything is turning. I can  <br/>\nappreciate having a warm house to return to after shoveling. I can  <br/>\ntake a break and watch the snow as I shovel. I can use the shovel I  <br/>\nlike rather than the one that irritates me :-) I can think about how  <br/>\nmy husband will appreciate that I was thinking about him and shoveled  <br/>\nthe walk and end of the driveway for him.<br/>\n<br/>\nThose positive thoughts can take conscious effort when something comes  <br/>\nwith built in bad parts.<br/>\n<br/>\nAnd some people find it helpful that this list reminds them to see  <br/>\ntheir children in positive lights.<br/>\n<br/>\nIf it&#39;s not helpful for you, then let it go. The message might help  <br/>\nsomeone else who&#39;s reading.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; if you do find that putting your 1<br/>\n&gt; &gt; year old, your 4 and a 1/2 year old, your 6 year old in some kind  <br/>\n&gt; of other care<br/>\n&gt; &gt; system, school and daycare, is the better option for you  <br/>\n&gt; personally, then that<br/>\n&gt; &gt; may be the answer for you.<br/>\n&gt;<br/>\n&gt; I&#39;m wondering whether those are truly the only alternatives: think  <br/>\n&gt; this way and unschool OR find a different care system for my  <br/>\n&gt; children... I&#39;m wondering if there truly are no other alternatives...<br/>\n<br/>\n </span></blockquote>It&#39;s important to see that she didn&#39;t word it as either/or. And yet  <br/>\nthat&#39;s how you interpreted it. That&#39;s how your thoughts drifted.<br/>\n<br/>\nIt might be worth examining why.<br/>\n<br/>\nIt might mean nothing. It might mean something that could help you  <br/>\nthink more clearly about unschooling and parenting issues.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m in a different place in my life, striving to find a balance  <br/>\n&gt; between meeting my needs and wants ad those of my children..<br/>\n<br/>\n<br/>\n </span></blockquote>But Schuyler&#39;s different place came about by choices to deliberately  <br/>\nshift her thinking so she could be more at peace with her family. Not  <br/>\nstuff down the feelings. But choose to find ways to see and feel the  <br/>\npositive in what her life offered.<br/>\n<br/>\n*That&#39;s* the point she&#39;s trying to make. No one can make that shift  <br/>\nfor you. It&#39;s deliberate work you&#39;ll need to do. And the shift is  <br/>\nunlikely to come from one different choice. It will more likely be  <br/>\nmany deliberate choices that will make a difference.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; AND I am not sure that I can actively and willfully change my needs  <br/>\n&gt; to fall in line with theirs.<br/>\n<br/>\n<br/>\n </span></blockquote>And if you can&#39;t then perhaps school is a better -- not only! -- option.<br/>\n<br/>\nSometimes that realization helps people get that &quot;Aha!&quot; feeling. THey  <br/>\nrealize they aren&#39;t trapped by a collection of events that just  <br/>\nhappened that the have no control over. There is choice in how we  <br/>\nthink and view life.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Reframing","postDate":"1296072972","msgId":46006,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3NjYwMC43OTcxMy5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGlocGx2dCtpaWo0QGVHcm91cHMuY29tPg==","referencesHeader":"PGlocGx2dCtpaWo0QGVHcm91cHMuY29tPg=="},"prevInTopic":46004,"nextInTopic":46011,"prevInTime":46005,"nextInTime":46010,"topicId":45998,"numMessagesInTopic":0,"msgSnippet":"No. You don t need to move her beyond avoiding challenges. Growth and development will play a major role in helping her to move through things without you","messageBody":"<div id=\"ygrps-yiv-2043676940\">No. You don&#39;t need to move her beyond avoiding challenges. Growth and <br/>\ndevelopment will play a major role in helping her to move through things without <br/>\nyou needing to nudge her along. It&#39;s almost always good to help folks do <br/>\nsomething they want to do, and it is rarely good to push someone to do something <br/>\nthey really don&#39;t want to do or don&#39;t feel ready to do. <br/>\n<br/>\n<br/>\nThinking of school. I went to a nature centre programme set up for children <br/>\nyesterday. Linnaea has been wanting to go out and do more and someone we know <br/>\norganises a nature programme once a term for home-educated children. It was <br/>\nabout how animals deal with winter. I was stunned. I haven&#39;t been around this <br/>\nsort of &quot;school&quot; experience for a long time, Simon&#39;s never really enjoyed <br/>\nclasses and Linnaea has never really been interested in less than specific kinds <br/>\nof things. But the structure of the whole experience was fascinating. I learned <br/>\nso much about why school is almost a novel environment in my 4 hours at the <br/>\nnature centre. The lead educational officer was somewhat condescending, she, it <br/>\nfelt to me, had read something about how learning needed to be fun so all the <br/>\n&quot;learning moments&quot; were framed with competitive challenges between groups. It <br/>\ntook a lot of mental squinting on my part to see how the &quot;learning moments&#39; were <br/>\napplicable to the gist of wintering animals. <br/>\n<br/>\n<br/>\nThere was a more secondary educational leader and he was much more willing to <br/>\ndiscuss things. He was willing to allow a conversation to distract him from the <br/>\ncourse of study at hand. He was willing to exchange ideas. But when he had a <br/>\nspecific answer to a question in mind, the other answers weren&#39;t right. <br/>\n<br/>\n<br/>\nI don&#39;t know. It is strange to imagine that schooling such as that produces <br/>\nanything but wasted time. I&#39;m guessing that for these educational officers the <br/>\nfolks they are working to educate aren&#39;t coming to them of their own free will. <br/>\nI&#39;m guessing that you have to juggle and dance and sing a lot more to get folks <br/>\ninterested in the content, maybe, of what you are working to impart if your <br/>\naudience hasn&#39;t volunteered to come and here you talk. I think, unfortunately, <br/>\nit does a huge disservice to the subject matter to make it all about the &quot;fun&quot; <br/>\nthat can be had using a pipette to transfer water from a larger bowl to a <br/>\nsmaller bowl in a race for most water transferred in two minutes and not about <br/>\nthe idea of, well, no, that one I couldn&#39;t figure out how it applied. <br/>\n<br/>\n<br/>\nLinnaea thought the best bit of the experience was walking outside in a place <br/>\nshe hadn&#39;t been for a while. She had hoped to plant trees as conservation was <br/>\npart of the commitment to going, but the rain came and washed that away. Simon <br/>\nwasn&#39;t so keen. But when we got home Linnaea, independently, no prodding, no <br/>\nnudging, looked up some of the things that had come up. As did I, without any <br/>\nnudging.<br/>\n<br/>\nI wanted to know more. I wanted to know if ducks like rain. Apparently they like <br/>\na shower over a bath, but I&#39;m not sure if the water is warm or cold. Maybe I&#39;ll <br/>\nlook the actual study up instead of just the newspaper articles that were <br/>\ndecrying the horrible misuse of taxpayers money for a study as ludicrous as one <br/>\nexploring whether or not ducks like water. I wanted to know how birds migrate, <br/>\ndo they truly use the stars to guide them or is it more or less than that. <br/>\nSchool and testing has nothing to do with my curiosity. If anything school and <br/>\ntesting stymies it. It directs it down the pathways it/they feel are valuable <br/>\nand nods politely at a distraction while quickly moving things forward down the <br/>\ncurriculum&#39;s predesignated road. I prefer my ambly way. I prefer following my <br/>\nown thoughts and ideas and moving along in a circuitous mental road less <br/>\ntravelled.  I don&#39;t get many gold stars this way, but I sure learn a lot. <br/>\n<br/>\n<br/>\nOh, and schools fail folks. I failed a few classes. Apparently that was my fault <br/>\nand had nothing to do with a system that wasn&#39;t particularly skilled at passing <br/>\non the knowledge that it assured the taxpayers it was capable of doing. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Agnieszka &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mama_agnieszka@...\">mama_agnieszka@...</a>&gt;<br/>\n<br/>\nOne thing that worries me - please dissect this all you want - is that if my <br/>\nchild has a certain limit in terms what she is comfortable with undertaking... <br/>\nif she is only comfortable with avoiding challenges for example, do I have a <br/>\npart of play to move her beyond that?  We talked about this briefly here on this <br/>\ngroup - support, people argued, stands in the way of change.  So, is my job to <br/>\nsupport her in avoiding challenges or is it to somehow invite or suggest or <br/>\nsomething... towards change? <br/>\n<br/>\n<br/>\nAnd a bigger question, I think is, what makes us do things that are hard?  what <br/>\nmakes us pursue challenges?  Is it internal pressure or pressure from the <br/>\noutside??  What role do I play, as the parent, in developing the desire in my <br/>\nchild to pursue challenge??<br/>\n<br/>\nSchooling and testing are a very powerful motivator for people to undertake <br/>\nchallenging things.  There is this constant development UP through the levels.  <br/>\nThis is prods people along and motivates them to advance.  And just the <br/>\nsatisfaction of having undertaking a challenge - even if not successfully - is <br/>\nan awesome experience (like, when I decided to have my three kids at home <br/>\nwithout meds - that was one heck of a challenge!).  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Reframing","postDate":"1296070073","msgId":46004,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlCMjk1MTZFRUJCMjRBMkQ5MjJGM0E1ODlDRThEQkU3QENvbm5pZVBDPg==","inReplyToHeader":"PGlocGx2dCtpaWo0QGVHcm91cHMuY29tPg==","referencesHeader":"PGlocGx2dCtpaWo0QGVHcm91cHMuY29tPg=="},"prevInTopic":46003,"nextInTopic":46006,"prevInTime":46003,"nextInTime":46005,"topicId":45998,"numMessagesInTopic":0,"msgSnippet":"... Maybe you need to make your house more child friendly. One year olds get into things because they are curious. If you feel like you have to chase him","messageBody":"<div id=\"ygrps-yiv-1930825747\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;The one year old gets into everything and so I chase him around.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Maybe you need to make your house more child friendly. One year olds get into things because they are curious. If you feel like you have to chase him around to keep him out of stuff, then maybe you need to figure out ways to make your house safer and easier to explore.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;My job is to make the food ready, the clothes ready, the snacks ready... and to get loads of books and art supplies and fun toys... So, that&#39;s what I do. The emotional disciplining aspect of parenting is exhausting. The conversations about things the kids want to know are interesting but they don&#39;t happen often.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>If you don&#39;t enjoy being with your kids, then maybe you could find a babysitter or somebody that might enjoy being with them so that you could go to work. Nobody has to unschool. My big sister sends her kids to school because she has to work. There is nothing wrong with going to work and letting your kids be in the company of people that truly enjoy being with them. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;But we do nothing about science or math or other &quot;subjects&quot;...&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Do you ever invite the kids to cook with you or play with you? Do you have play doh where you can build things? Do you have legos that they can build stuff out of? Are there books available for them to read and manipulate? One of the things about unschooling is that life isn&#39;t broken down into subjects. If you are concerned about the different subjects, look at what you are doing in the course of a day. There is a good chance that you have done something that qualifies as one of the &quot;schooly&quot; subjects.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;How can I, as a parent, create an environment where the kids are pursuing possibilities and undertaking challenges... when I feel stagnant and envious of mail carrier because she gets to walk around in quiet...&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Find a way to find your joy. If you want to get a job, then go look for job opportunities. You can do all kinds of cool research on the internet. There are tons of Yahoo discussion groups on just about any topic. Do your homework and find out what it would take to go to work? If you see being with your kids as a choice rather than as some kind of prison sentence, that might make it a lot easier to handle.<br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":300129699,"authorName":"Stephanie Kimball","from":"Stephanie Kimball &lt;kimball.stephanie@...&gt;","profile":"sksundancer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Reframing","postDate":"1296068621","msgId":46003,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwNTY2MzRFLUQ3OEYtNDFBNy05NTgzLUY2OEIyQUUyQ0U3QUBnbWFpbC5jb20+","inReplyToHeader":"PGlocGx2dCtpaWo0QGVHcm91cHMuY29tPg==","referencesHeader":"PGlocGx2dCtpaWo0QGVHcm91cHMuY29tPg=="},"prevInTopic":46002,"nextInTopic":46004,"prevInTime":46002,"nextInTime":46004,"topicId":45998,"numMessagesInTopic":0,"msgSnippet":"I don t think I ve ever replied to a post here -- I lurk and absorb! And I m sure the many voices of experience will have much wisdom to offer on your bigger","messageBody":"<div id=\"ygrps-yiv-1908999023\">I don&#39;t think I&#39;ve ever replied to a post here -- I lurk and absorb!   <br/>\nAnd I&#39;m sure the many voices of experience will have much wisdom to  <br/>\noffer on your bigger questions (which I look forward to reading and  <br/>\nabsorbing, too...)<br/>\n<br/>\n...but I want to throw out a couple observations in response to your  <br/>\nconcerns about undertaking challenges.<br/>\n<br/>\nI have homeschooled my 2 kids all their lives, gradually drifting  <br/>\ntoward unschooling without knowing what it was called, and finally, in  <br/>\nthe last 12-18 months, embracing it more and more fully.   Here are a  <br/>\ncouple of snapshots.<br/>\n<br/>\nAround 18 months ago I felt some pressure to show that my kids were  <br/>\ndoing  &quot;schooly&quot;  things on a regular basis, in order to justify my  <br/>\ncontinuing to be at home with them.  I required DS and DD (9 and 6 at  <br/>\nthe time) to do some form of reading, writing and math each day, and  <br/>\nrecord what they&#39;d done in a special book.  DD enjoyed it, but DS  <br/>\nbalked.  He hated it, even though he typically read every day anyway,  <br/>\nand I made it clear that I was satisfied even if he did just one page  <br/>\nof math problems and 1 sentence (!) in his journal.  This turned into  <br/>\na daily fight, and eventually I came to my senses and dropped it.  DD  <br/>\ncontinued to ask for math problems, and occasionally wrote in her  <br/>\njournal.  DS refused to do anything.  I was glad that our relationship  <br/>\nslowly improved (daily fights are exhausting! and icky!!)  but was  <br/>\nworried that he&#39;d never learn to write, or never learn to  &quot;push&quot;   <br/>\nhimself.<br/>\n<br/>\nFast forward 1 year:   I participated in National Novel Writing Month  <br/>\nlast November for the 3rd consecutive year, and to my surprise, DS   <br/>\n*voluntarily* did too.  I did not push him, he set his own word count  <br/>\ngoal, he figured out how many words he needed to write each day to  <br/>\ncomplete HIS goal by the end of the month, and he did it.  I don&#39;t  <br/>\nthink I ever reminded him, let alone nagged him, to get it done.  Not  <br/>\nonly that, he enjoyed it.  And, to my huge surprise, he&#39;s a remarkably  <br/>\ngood writer!  All this happened without me ever teaching him how to  <br/>\nwrite a sentence or a paragraph, or even (except for that one brief,  <br/>\nmiserable interlude) requiring him to try writing, or practice, or  <br/>\nwhatever.<br/>\n<br/>\n(BTW, it would also be fine with me if it had not turned out that  <br/>\nway.  I didn&#39;t stop pushing as a sneaky way to get him to do it  <br/>\nanyway.  I stopped because it was damaging our relationship, and then  <br/>\ngradually realized that my agenda was counter-productive and  <br/>\ninappropriate in other ways too.)<br/>\n<br/>\nSimilarly, I got pretty tense about his dad  &quot;indulging&quot;  him with an  <br/>\nold laptop computer at what seemed to me a young age.  This was a few  <br/>\nyears ago when I was intent on him  &quot;succeeding&quot;  in conventional  <br/>\nschooly ways -- it seemed to me that computer time would take away  <br/>\nfrom his book-reading time and other interests, all of which seemed  <br/>\ninherently more worthy ways to spend his time.  Again, for a brief  <br/>\nperiod I tried to control his time, declaring that he could only use  <br/>\nthe computer for a certain number of hours a day, and pushing him to  <br/>\ndo more  &quot;challenging&quot;  things instead.....   Fortunately, again, I  <br/>\nbacked off that quickly, and somehow fended off friends&#39; comments  <br/>\nabout his  &quot;obsession&quot;  with computers, and ignored my own fears that  <br/>\nthey might be right, and instead let him follow his passion.  He is 10  <br/>\nnow, and a few weeks ago he upgraded my laptop for me (patiently  <br/>\nexplaining what I needed to make it work better, showing me where to  <br/>\norder it online, installing it when it arrived...); he diagnoses  <br/>\nfriends&#39; computer troubles; he has plans to start a refurbished  <br/>\ncomputer business.   I never once pushed him to do or learn any of  <br/>\nthis stuff.  I didn&#39;t teach him the parts of a computer, how things go  <br/>\ntogether, how to troubleshoot, etc.  (I don&#39;t even KNOW these  <br/>\nthings!!!!)<br/>\n<br/>\nOn the surface, my kid probably looks  &quot;lazy&quot;  and  &quot;undisciplined.&quot;   <br/>\nHe hates being taught things.  He hates schedules.  For the most part,  <br/>\nhe doesn&#39;t like competing, he doesn&#39;t like being compared to others or  <br/>\nto a set of expectations.  But he DOES stuff.  When he&#39;s ready, when  <br/>\nhe&#39;s moved.  I am (finally) learning to trust that.<br/>\n<br/>\nMaybe the conventional wisdom that kids need structure, challenges,  <br/>\nexternally imposed goals and schedules, etc. in order to succeed is  <br/>\ntrue for some, I don&#39;t know.  What I&#39;ve learned is that space, time,  <br/>\nfreedom to explore, confidence, and opportunities are what some kids  <br/>\nneed, in order to imagine possibilities, try things out, decide what  <br/>\nthey want to do for themselves, and do it.  I&#39;m glad for the chance to  <br/>\nprovide that!<br/>\n<br/>\nstephanie<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jan 26, 2011, at 12:34 PM, Agnieszka wrote:<br/>\n<br/>\n&gt; One thing that worries me - please dissect this all you want - is  <br/>\n&gt; that if my child has a certain limit in terms what she is  <br/>\n&gt; comfortable with undertaking... if she is only comfortable with  <br/>\n&gt; avoiding challenges for example, do I have a part of play to move  <br/>\n&gt; her beyond that? We talked about this briefly here on this group -  <br/>\n&gt; support, people argued, stands in the way of change. So, is my job  <br/>\n&gt; to support her in avoiding challenges or is it to somehow invite or  <br/>\n&gt; suggest or something... towards change?<br/>\n&gt;<br/>\n&gt; And a bigger question, I think is, what makes us do things that are  <br/>\n&gt; hard? what makes us pursue challenges? Is it internal pressure or  <br/>\n&gt; pressure from the outside?? What role do I play, as the parent, in  <br/>\n&gt; developing the desire in my child to pursue challenge??<br/>\n&gt;<br/>\n&gt; Schooling and testing are a very powerful motivator for people to  <br/>\n&gt; undertake challenging things. There is this constant development UP  <br/>\n&gt; through the levels. This is prods people along and motivates them to  <br/>\n&gt; advance. And just the satisfaction of having undertaking a challenge  <br/>\n&gt; - even if not successfully - is an awesome experience (like, when I  <br/>\n&gt; decided to have my three kids at home without meds - that was one  <br/>\n&gt; heck of a challenge!).<br/>\n&gt;<br/>\n&gt; I&#39;m worried that my kids won&#39;t push themselves. It&#39;s not that I want  <br/>\n&gt; them to succeed in the conventional sense... but I want them to feel  <br/>\n&gt; DAMN GOOD about themselves and about what they can do, and to able  <br/>\n&gt; to imagine themselves accomplishing a possibility and going for it.<br/>\n&gt;<br/>\n&gt; How can I, as a parent, create an environment where the kids are  <br/>\n&gt; pursuing possibilities and undertaking challenges... when I feel  <br/>\n&gt; stagnant and envious of mail carrier because she gets to walk around  <br/>\n&gt; in quiet...<br/>\n&gt;<br/>\n&gt; A.<br/>\n&gt;<br/>\n&gt; Looking forward to your thoughts,<br/>\n&gt; Agnieszka<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Reframing","postDate":"1296067282","msgId":46002,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgyMTk0Ni40NDYzOC5xbUB3ZWI4NjIwMi5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGlocGx2dCtpaWo0QGVHcm91cHMuY29tPg==","referencesHeader":"PGlocGx2dCtpaWo0QGVHcm91cHMuY29tPg=="},"prevInTopic":46001,"nextInTopic":46003,"prevInTime":46001,"nextInTime":46003,"topicId":45998,"numMessagesInTopic":0,"msgSnippet":"We have a 1 year old in our house reads like it was an accident. Like it wasn t a child you chose to have or one that you get to choose to spend day after","messageBody":"<div id=\"ygrps-yiv-2122772401\">&quot;We have a 1 year old in our house&quot; reads like it was an accident. Like it <br/>\nwasn&#39;t a child you chose to have or one that you get to choose to spend day <br/>\nafter day with. It helps a lot, it helps me a lot and has proven to be <br/>\nincredibly useful in the past, to see exactly how much I am choosing this life <br/>\nthat I lead. <br/>\n<br/>\n<br/>\nI don&#39;t happen to have a 10 year old and a 13 year old in my house. David and I <br/>\nhad sex a while back, twice, and chose to give birth to the products of those <br/>\nunions. When they were born I chose to nurse first Simon and then, 3 years <br/>\nlater, Linnaea. I chose to co-sleep, I chose to go slower in my days and to take <br/>\nages longer to walk to the store. I chose each and every day not to run <br/>\nscreaming from the house and to instead turn more and more to them. I still <br/>\nchoose that. I still choose to sit with them, to talk with them, to play with <br/>\nthem. When Linnaea is feeling antsy and funky and grouchy, I sit with her and we <br/>\nfigure out things that help and try and avoid things that hinder. When Simon is <br/>\nfeeling cuddly and loving and needy, we cuddle and love and talk and watch Deep <br/>\nSpace 9 together. <br/>\n<br/>\n<br/>\nThey went from 1 to 2 to 3 to 4. Each year, each month, each week, each day, <br/>\neach moment I chose to be with them. I didn&#39;t see it as a Sisyphean project that <br/>\nwould leave me exhausted every night. I thought about it, as much as I could, as <br/>\na pleasure, as a luxury, as a phenomenal gift to me. I didn&#39;t see it as <br/>\nsomething that was draining the life and creativity out of me, mostly. Mostly I <br/>\nsaw it as joy and laughter and the sweetest life I could possibly live. <br/>\n<br/>\n<br/>\nI think, perhaps, that you are painting a rosier picture of the other options. I <br/>\nthink that it is easy to imagine how much better something else might be, but if <br/>\nyou really were to think about it, really dwell on the details, use a microscope <br/>\nto explore the minutia, you would find that the grass isn&#39;t really greener. And <br/>\nif you do find that the grass is greener, if you do find that putting your 1 <br/>\nyear old, your 4 and a 1/2 year old, your 6 year old in some kind of other care <br/>\nsystem, school and daycare, is the better option for you personally, then that <br/>\nmay be the answer for you. <br/>\n<br/>\n<br/>\nYesterday I was around a toddler. I am not around toddlers very often these <br/>\ndays, but yesterday I was gifted with a few moments in the presence of a smiley, <br/>\nexploring, toddler. I found myself absolutely drawn to his little socked feet. <br/>\nAnd I could see my Linnaea&#39;s feet in her socks with English words that the <br/>\nJapanese thought would sell socks written on the soles, oh I can&#39;t quite <br/>\nremember the words, I have the socks still, though. I could see my little girl, <br/>\nmy little running and moving all the time, with the most amazing butt muscles, <br/>\ngirl in this little boy toddling about the nature centre. I wouldn&#39;t trade her <br/>\nfor that little boy, but I would love to tickle her baby feet again, to brush oh <br/>\nso gently along the arch of her foot and make her giggle with joy. And I&#39;ve had <br/>\nthe pleasure, the privilege of spending nearly all of her moments in her <br/>\npresence. <br/>\n<br/>\n<br/>\nI can&#39;t make your life good for you. Maybe the striving for your own human <br/>\ncapital is too great for you to be happy with your children. I think it is <br/>\npossible to make a happy home without being home all the time. I just couldn&#39;t <br/>\nbe happier than I am if I were working away from home, and I am lucky enough to <br/>\nbe able to be with Simon and Linnaea as much as they will have me. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Reframing","postDate":"1296066473","msgId":46001,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlocHAzOSt0Y3JAZUdyb3Vwcy5jb20+","inReplyToHeader":"PGlocGx2dCtpaWo0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":46002,"prevInTime":46000,"nextInTime":46002,"topicId":45998,"numMessagesInTopic":0,"msgSnippet":"... ************* Are your children not included in your passions? That s something to think about (in bits and pieces as you have time ;)). It can be good to","messageBody":"<div id=\"ygrps-yiv-207761052\">&quot;Agnieszka&quot; &lt;mama_agnieszka@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;m not able to pursue finding my passions and actually pursuing them because I can&#39;t think!  <br/>\n </span></blockquote>*************<br/>\n<br/>\nAre your children not included in your passions? That&#39;s something to think about (in bits and pieces as you have time ;)). It can be good to reconnect with what drew you to the lifestyle you&#39;ve chosen. Why did you want three kids? Why did you want to be home with them in the first place? Don&#39;t settle for the idyllic reasons, though - look for the Selfish reasons. What did You hope to get from being a mom? Those selfish reasons can help you through the rough patches, sometimes. <br/>\n<br/>\nWith three kids at home, including a toddler, finding time for anything other than parenting is going to be a logistical puzzle. How do you best handle logistical issues? I&#39;m a list maker, so that&#39;s where *I* would start - making up lists of ideas, projects, things to read, and then break all that down into &quot;bite sized portions&quot;, things you can juggle into your busy chasing-after-a-toddler-while-helping-two-other-kids life. You might find a night out each week could be helpful, too - take a class or join a club, go to the gym or even the library for a couple hours. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;The emotional disciplining aspect of parenting is exhausting. <br/>\n<br/>\n </span></blockquote>It could also help to acknowledge just how hard you&#39;re working in that regard. Take some time to pat yourself on the back and celebrate your successes! You&#39;re learning some valuable skills!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;We do go to museums and science center and zoo and gymnastics class, swim class, art class, dance class...  But we do nothing about science or math or other &quot;subjects&quot;...<br/>\n </span></blockquote>*****************<br/>\n<br/>\n&quot;Subjects&quot; are just a way of breaking life down into teachable portions, so as an unschooler, they aren&#39;t something you need. If it helps, though, going to a swim class is science and math and literature (yes, really! name three novels that use water as a plot device or metaphor). That&#39;s three &quot;subjects&quot; covered in just one of the things you listed above. Basic academic skills really Are basic - your kids will learn them because they&#39;re very useful. Don&#39;t worry about adding to that. Focus on what interests them, what lights them up, and look for ways to add to those instead. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;if my child has a certain limit in terms what she is comfortable with undertaking... if she is only comfortable with avoiding challenges for example, do I have a part of play to move her beyond that? <br/>\n </span></blockquote>************************<br/>\n<br/>\nYes, your role is to support her where she is so that she knows her boundaries and needs are important. You Want her to listen to that little voice inside that says &quot;this might not be a good idea&quot;! You&#39;ll REally want her to listen to that voice when she&#39;s a teenager, I promise you! So support that voice, now. Its okay to wait, to watch and think and find her own path forward. <br/>\n<br/>\nSome people learn by jumping into the middle of things and floundering around and others by holding back and observing - and the interesting thing is, each person will learn *some* things one way and some the other. Ray jumps into the middle of social situations and very physical situations and figures things out from there, but needs to observe problem-solving in order to understand patterns of reasoning. Mo plunges into problem solving, but observes social situations carefully for a long time before moving in. Physical things she&#39;ll sometimes watch another person first and other times jump right in. So maybe there are times your daughter needs to stop and observe. Pushing her forward will interfere with her ability to learn!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And a bigger question, I think is, what makes us do things that are hard?  what makes us pursue challenges?  Is it internal pressure or pressure from the outside??<br/>\n </span></blockquote>**************************<br/>\n<br/>\nThis is something I wrote about fairly recently, wrt artistic challenges, so I&#39;ll link the article:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://enjoylifeunschooling.com/2011/01/origami-lesson/\">http://enjoylifeunschooling.com/2011/01/origami-lesson/</a><br/>\n<br/>\nOver and over I&#39;ve seen my kids push themselves to achieve their own goals - in games, in skateboarding, in blacksmithing, in sculpture, in programming. Yesterday Mo was nearly in tears b/c she couldn&#39;t find the command she wanted in a program she was building, but refused all assistance - she wanted to Do It. And she did. In the same day, Ray helped load 2800 lbs of concrete and then bicycled through the snow to learn how to skin a deer. Unschooling kids, with no-one pushing them, not only rise to challenges but create new and exciting challenges for themselves. Its pretty amazing to watch. <br/>\n<br/>\n---Meredith (Mo 9, Ray 17)</div>","specialLinks":[]}],"prevTopicId":46026,"nextTopicId":46044}}