{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] can single parents unschool","postDate":"1267711152","msgId":43281,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMTAwMzA0MDU1OW42MjRlYWEzaDkyMzdjMjg4NTNmZDAwMmNAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGhtZGhsNCsya3ZmQGVHcm91cHMuY29tPg==","referencesHeader":"PGhtZGhsNCsya3ZmQGVHcm91cHMuY29tPg=="},"prevInTopic":43265,"nextInTopic":0,"prevInTime":43280,"nextInTime":43282,"topicId":43264,"numMessagesInTopic":0,"msgSnippet":"... ***I can t tell you if it is right for you but it worked really well for me and my child.  I wrote a post about it some time back, ","messageBody":"<div id=\"ygrps-yiv-1803502906\">On Sun, Feb 28, 2010 at 5:48 AM, gemlily14 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gemlily14@...\">gemlily14@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Hi, new to this group.<br/>\n&gt; My kids are just getting to school age, and unsure if it is the right<br/>\n&gt; option for them.<br/>\n&gt; I am a single parent and was wondering if their are other single parents<br/>\n&gt; that unschool.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>***I can&#39;t tell you if it is right for you but it worked really well for me<br/>\nand my child.  I wrote a post about it some time back,<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://bearthmama.com/?p=62\">http://bearthmama.com/?p=62</a><br/>\n<br/>\nSomethings that really helped me was an amazing support system and I kept my<br/>\nchild as the number one priority the whole time. If things (or a sitter)<br/>\nwasn&#39;t working I changed it up. I sought out solutions with her. If at any<br/>\ntime school would have been a better option I would have been open to that.<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Not sure how I would balance the need to work and being home with the kids.<br/>\n&gt; Currently finishing my own studies, which has been fairly flexible with the<br/>\n&gt; kids, but work when I start wont be.<br/>\n&gt;<br/>\n&gt; ****What will you be doing for a job? What kind of hours will you be<br/>\n&gt; needing to work? What are all your options?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>When I had my daughter I knew that I would likely be single very quickly :-)<br/>\nI started looking for options that kept me with her and brought in enough<br/>\nmoney to support us. Her father never supported us. I worked as a nanny so I<br/>\ncould be with her. When she was a little older I became certified in<br/>\nchildbirth education so I could teach 1-2xs a week and be with her the<br/>\nmajority of the time. When she was even older I started attending births as<br/>\na doula, just enough to cover our expenses that I kept purposefully low to<br/>\nbe with her as much as possible. It wasn&#39;t until she was 4.5 that she was<br/>\nready for me to be gone for longer periods of time. I generally still worked<br/>\njobs that would keep me with her as much as possible. ANd I found really fun<br/>\noptions for her when I was gone. Childcare was at times another full time<br/>\njob!<br/>\n<br/>\nBest Wishes,<br/>\nFaith<br/>\n-- <br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":400494348,"authorName":"dana.stewart@rocketmail.com","from":"dana.stewart@...","profile":"dana.stewart@rocketmail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] can single parents unschool","postDate":"1267369350","msgId":43265,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjQ3MzA5OS0xMjY3MzY5Mzg3LWNhcmRodV9kZWNvbWJvYnVsYXRvcl9ibGFja2JlcnJ5LnJpbS5uZXQtODc5MzY3NDcxLUBiZGE5NTcuYmlzeC5wcm9kLm9uLmJsYWNrYmVycnk+","inReplyToHeader":"PGhtZGhsNCsya3ZmQGVHcm91cHMuY29tPg==","referencesHeader":"PGhtZGhsNCsya3ZmQGVHcm91cHMuY29tPg=="},"prevInTopic":43264,"nextInTopic":43281,"prevInTime":43264,"nextInTime":43266,"topicId":43264,"numMessagesInTopic":0,"msgSnippet":"I homeschooled/unschooled for about two years as a sinlge parent (now I m married and my husband is going to stay home with my son and our new baby on the way,","messageBody":"<div id=\"ygrps-yiv-1947030190\">I homeschooled/unschooled for about two years as a sinlge parent (now I&#39;m married and my husband is going to stay home with my son and our new baby on the way, hurray:-) It was definitely a challenge but soooo worth it! People often asked me how I did it but my son was so miserable at school and I was pouring so much energy into trying to make things better for him there and to compensate/lift him out of the ditch every single day after school that juggling having him home was truly not any harder (and was a gazillion time more rewarding). <br/>\n<br/>\nI&#39;m lucky because I can do a lot of my job from home (I teach at a university, but don&#39;t need to be on campus all the time), so I really needed coverage only about 2 1/2 days a week. For those times, I found sitters (college students and a neighbor/close friend). I also worked out trades, which were great because they were free. I scheduled one of my classes for Tuesday evenings, and I watched a neighbor&#39;s kid (who goes to school)after school on Thursdays, through dinnertime, and they watched my son after school hours on Tuesdays through dinner. Often times I was able to make trades with other HSing moms for taking kids to planned activities or classes that our kids were in together (eg, I&#39;ll take your kids to Shakespeare group on Monday afternoons and you take mine to Spanish and swimming class on Fridays). Or your kids come over to play at my house once a week for a few hours and then vice versa.<br/>\n<br/>\nWhat was crucial was having a whole network of people to count on, because at any given time your arrangements for that day could fall through (sitter comes down with bronchitis, etc) or something might suddenly come up at work (you get called in for a last-minute emergency mtg, or you get held up and can&#39;t make it home before the sitter has to leave). If you don&#39;t have any family around (I do not), try to find someone you can count on in an emergency. My next-door neighbors are retired and always seem happy to help out in an emergency. I was very sparing in my use of this alternative--I mean I reserved it only for true emergencies (enough of which did come up! At least once a month), because I didn&#39;t ever want them to feel I was dumping on them.<br/>\n<br/>\nSo, I would say that jobs with flexible hours are the best! Also, if you can work during &quot;after-school&quot; hours, you might be able to find an after-school program in your area that you like--generally *much* cheaper than sitters. Our local children&#39;s museum/science ctr has such a program, for example, as does our YMCA. You want to check out any such programs carefully, though, to make sure that you and your kids like the staff and that you approve of the way they run things (eg, enough supervision that you know your kids aren&#39;t going to get bullied or something, but not so much that they&#39;re making your kids do activities you and kids aren&#39;t interested in). If you work evenings (and possibly weekends), in some ways it&#39;s easier to do trades because it opens up the possibilities of child-care trading with other working parents and with working parents of schooled kids (most school days end way before the work day, so many woring parents--single or not--do need help with childcare on even a daily basis).<br/>\n<br/>\nIt is a lot of responsibility to shoulder but it really is possible. And so worth it, even if most people you know think you&#39;re nuts for doing it :-)  I would not have changed it, because it has enabled my son to thrive whereas before he was miserable. When I&#39;m working in the other room (even if I&#39;m stressed out about work), and I hear him singing and playing so happily in his room, it always reminds me how worth it it is!<br/>\n<br/>\nHTH,<br/>\nDana in NYS<br/>\n<br/>\nSent from my Verizon Wireless BlackBerry<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: &quot;gemlily14&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gemlily14@...\">gemlily14@...</a>&gt;<br/>\nDate: Sun, 28 Feb 2010 10:48:04 <br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nSubject: [unschoolingbasics] can single parents unschool<br/>\n<br/>\nHi, new to this group.<br/>\nMy kids are just getting to school age, and unsure if it is the right option for them. <br/>\nI am a single parent and was wondering if their are other single parents that unschool. Not sure how I would balance the need to work and being home with the kids. Currently finishing my own studies, which has been fairly flexible with the kids, but work when I start wont be.<br/>\n<br/>\nany advice would be great,<br/>\nthanks<br/>\ngem<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":435652323,"authorName":"gemlily14","from":"&quot;gemlily14&quot; &lt;gemlily14@...&gt;","profile":"gemlily14","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"can single parents unschool","postDate":"1267354084","msgId":43264,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhtZGhsNCsya3ZmQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":43265,"prevInTime":43263,"nextInTime":43265,"topicId":43264,"numMessagesInTopic":0,"msgSnippet":"Hi, new to this group. My kids are just getting to school age, and unsure if it is the right option for them. I am a single parent and was wondering if their","messageBody":"<div id=\"ygrps-yiv-1421681557\">Hi, new to this group.<br/>\nMy kids are just getting to school age, and unsure if it is the right option for them. <br/>\nI am a single parent and was wondering if their are other single parents that unschool. Not sure how I would balance the need to work and being home with the kids. Currently finishing my own studies, which has been fairly flexible with the kids, but work when I start wont be.<br/>\n<br/>\nany advice would be great,<br/>\nthanks<br/>\ngem</div>","specialLinks":[]}],"prevTopicId":43267,"nextTopicId":6315}}