{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":257390633,"authorName":"Maisha Khalfani","from":"&quot;Maisha Khalfani&quot; &lt;earthspirit393@...&gt;","profile":"earthspirit393","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"learning and growing","postDate":"1152670883","msgId":15641,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExMC1EQVYxMTEzRkJDRUNDNzI0NzczOEU0REY5OTY5MEBwaHguZ2JsPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":15640,"nextInTime":15642,"topicId":15641,"numMessagesInTopic":0,"msgSnippet":"I ve been behind on lots of threads because we were without internet for a while (part of our financial woes, but that s neither here nor there).  I m reading","messageBody":"<div id=\"ygrps-yiv-435601711\">I&#39;ve been behind on lots of threads because we were without internet for a while (part of our financial woes, but that&#39;s neither here nor there).  I&#39;m reading a lot of the messages about how people are upset with this list.  In all honesty, there are times when I&#39;ve been upset with some of the emails that I&#39;ve received either directed towards myself or others.<br/>\n<br/>\nHowever.....I&#39;ve realized something about our culture: we thrive on  hearing about the &quot;bad stuff&quot; that others experience.  We love to hear about how other people make mistakes, how they fall on their faces.  It&#39;s in the news, the entertainment shows, etc.  We don&#39;t want to hear how it &quot;worked out&quot;.  No, we want to hear about how it failed.  Especially if we still aren&#39;t certain that it works.<br/>\n<br/>\nWe are also quick to look up to others and put them on pedestals, as though they&#39;ve achieved a level of being that&#39;s just so beyond our reach.  I think the moderators of this list are regular folks, who have decided to walk down a path of living, and created this list to invite others to that path.  They are just as human as the rest of us, and have their good days and their bad days.  And we &quot;look up&quot; to them as though they have all the answers, and they don&#39;t.  They have what has worked for them, and they share that with us.  And because we think they are &quot;up there&quot; somewhere, we want to hear all about how they have fallen, how they have screwed up, etc.<br/>\n<br/>\nI&#39;m sorry if I&#39;m rambling here.  It&#39;s just that I&#39;m struggling with this RU thing myself.  My husband is kind of on board, but not for the most part   so that&#39;s a struggle as well.  I come to this board to hear about what works.  To hear about what I can do to change myself, and no one else.  I am grateful for this list, and for even finding out what RU is to begin with.  I know I will be challenged.  I know I will have my world turned upside down.  I&#39;m prepared for that, and I welcome it so that I can learn more.  Now I&#39;m an adult so I know I can take it or leave it.  No one is forcing me to stay on this list, or to use the advice given.  It&#39;s my choice.<br/>\n<br/>\nHey, maybe the moderators should put that in the description for this list <br/>\n<br/>\nMaisha Khalfani<br/>\nKhalfani Family Adventures<br/>\nhttp://khalfanifamilyadventures.blogspot.com&lt;http://khalfanifamilyadventures.blogspot.com/&gt;<br/>\nEarthSpirit Readings<br/>\nhttp://www.geocities.com/maitai373/EarthSpirit.html&lt;http://www.geocities.com/maitai373/EarthSpirit.html&gt;<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":15636,"nextTopicId":15487}}