{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":18,"messages":[{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Is this normal?","postDate":"1224979213","msgId":36748,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdlMGJ1ZCttc2E0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwY2IwMWM5MzQ5NyQ3ZTVkZWFjMCQ2NDAwYThjMEB5b3VyNGRhY2QwZWE3NT4="},"prevInTopic":36697,"nextInTopic":0,"prevInTime":36747,"nextInTime":36749,"topicId":36658,"numMessagesInTopic":0,"msgSnippet":"... it in this ... This is tricky - you want to inspire and support a love of learning, right? but every time to start thinking okay, how can I build on ","messageBody":"<div id=\"ygrps-yiv-1385771993\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Nelson and Kelly&quot; &lt;nel-<br/>\nkel@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;How can I build off of this<br/>\n&gt; passion in the things he NEEDS to know to go to college and make <br/>\n </span></blockquote>it in this<br/>\n<blockquote><span title=\"ireply\"> &gt; society?<br/>\n<br/>\n </span></blockquote>This is tricky - you want to inspire and support a love of learning, <br/>\nright? but every time to start thinking &quot;okay, how can I &quot;build&quot; on <br/>\nthis so that...&quot; you step right in between learning and love. Take a <br/>\nbreath and step back instead. Look at the learning that&#39;s happening <br/>\nRight Now - don&#39;t worry if it seems to be something small or <br/>\ndisconnected from &quot;academic&quot; learning. Ultimately all learning is <br/>\nabout making hundreds of thousands of tiny connections. Before your <br/>\nkids ever went to school you may have watched them learn and learn <br/>\nand learn a thousand tiny things a day and were amazed - but school <br/>\nshattered that process into dull memorization of random glop. Now <br/>\nyou have the wonderful opportunity to see that magic again - but to <br/>\n*see* it, you have to believe its possible for your kids to learn as <br/>\neffortlessly as they did when they were babies. It *is* possible! <br/>\nThey&#39;re doing it now.<br/>\n<br/>\nPassion is one of the responses to that effortless learning process. <br/>\nHooray! Your kids are still passionate! They still remember the most <br/>\nimportant thing about learning - that its fun and exciting and <br/>\nstimulating. That it can absorb them for hours. Woopee! See what <br/>\nexcites them and look for ways to support it. Right now that might <br/>\nsimply mean bringing snacks to your gamer and sitting and watching <br/>\nhim play now and then so you can talk sensibly with him about his <br/>\npassion. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My twins really struggle academically, but in the outdoors they <br/>\n </span></blockquote>excel.  They<br/>\n<blockquote><span title=\"ireply\"> &gt; love to build camp fires and are very good at problem solving<br/>\n<br/>\n </span></blockquote>Wow, problem solving - do you know how many teachers, especially <br/>\nmath teachers, would Loooooove to be able to say their students were <br/>\nlearning how to solve problems well? How lucky you are to have such <br/>\nfabulous kids!<br/>\n<br/>\nWhat do most adults do when they run into a problem they can&#39;t <br/>\nhandle? ask a friend or a sales clerk or hire a professional for <br/>\nhelp. *That&#39;s* probably one of the most valuble pieces of problem <br/>\nsolving to learn - who to ask when you can&#39;t figure something out. <br/>\nNow that your kids aren&#39;t in school, you get to help them do that, <br/>\ngrown-up style. Mom, how do I do this? Well, this is what *I* do. -<br/>\nOr- Um...I dunno, lets call dad at work and see if he knows. -Or- <br/>\nHmmm, maybe we can google it.... You don&#39;t have to turn it into some <br/>\nkind of teaching moment - like Joyce said about &quot;introducing&quot; <br/>\nthings: do what you&#39;d do with a friend. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I would rather<br/>\n&gt; say they just learn things differently!<br/>\n<br/>\n </span></blockquote>Yes!<br/>\nIf you want more ideas about some of the different ways people learn <br/>\nhere&#39;s a page on the Theory of Multiple Intelligences:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/intelligences/\">http://sandradodd.com/intelligences/</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They would LOVE to be out in wide open spaces with lots of options <br/>\n </span></blockquote>for<br/>\n<blockquote><span title=\"ireply\"> &gt; airsoft wars, army guys and camping.<br/>\n<br/>\n </span></blockquote>This seems like the biggest thing you need to actively work on - <br/>\nfinding more ways for them to fill their &quot;outdoors&quot; cup. I have the <br/>\nopposite challenge, I live deep in the country with a teen who loves <br/>\nto socialize. So we work to find him ways and places to meet and <br/>\nhang out and get his social needs met. It helps me, especially when <br/>\ngas prices soar and everthing Ray wants to do involves driving <br/>\nsomewhere, to remember that this is how he best learns about the <br/>\nworld. You can look at going camping (or whatever you choose to do) <br/>\nin the same way - this is what your guys need so they can be <br/>\nlearning at their absolute best. <br/>\n<br/>\nCheck your local lists for any fall/winter unschoolers camping <br/>\ntrips! <br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":311569849,"authorName":"Dawn Booth","from":"Dawn Booth &lt;heavenscent_angel222@...&gt;","profile":"duncanbabe222","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: Is this normal?","postDate":"1224797914","msgId":36697,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJMVTExNS1XMzJENUVDOTc5QUJENDVEODAxQjJEMUJEMjgwQHBoeC5nYmw+","inReplyToHeader":"PGdkcWdpbCtpc2hnQGVHcm91cHMuY29tPg==","referencesHeader":"PGdkb3A5ditsYW5nQGVHcm91cHMuY29tPiA8Z2RxZ2lsK2lzaGdAZUdyb3Vwcy5jb20+"},"prevInTopic":36691,"nextInTopic":36748,"prevInTime":36696,"nextInTime":36698,"topicId":36658,"numMessagesInTopic":0,"msgSnippet":"Hello Amberlee, Gosh your attitude towards your child s self learning is contagious, and I thank you for that. I have a 13 year boy, and he learns so much","messageBody":"<div id=\"ygrps-yiv-1518614932\">Hello Amberlee, Gosh your attitude towards your child&#39;s self learning is contagious, and I thank you for that.<br/>\nI have a 13 year boy, and he learns so much through ps2, I am amazed at his reading ability and I am proud <br/>\nto say hes done it all himself.<br/>\nHe hates writing BUT- I do see him on odd occasions searching the internet for the cheats, and when some sites don&#39;t print out what he wants, he will write them down, so there are alternatives to them getting to experience <br/>\nwriting skills, And in New Zealand we have the wonderful online auctions called trade me which is similar to your E-Bay, anyway there&#39;s reading , budgeting skills they learn , not to mention finding info on their favourite items.<br/>\nIts so sad to know just how much conditioning everyone  carries with us  from our upbringings. <br/>\nI am learning everyday through my own life experiences where and when to cut the cords to all that conditioning. and to develope new skills for  myself and my boy.<br/>\nWe are so lucky in life to be able to offer our kids the chance to be Unschooled. <br/>\nSmiles and happiness to those who unschool. <br/>\nfrom Dawn Booth of New Zealand<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nBuy, rent, invest property online today.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://a.ninemsn.com.au/b.aspx?URL=http%3A%2F%2Fwww%2Eallrealestate%2Eco%2Enz%2Freview%2Fhome%2Dbuying%2Dinfo%2Ehtml%3Frsf%3Dmsnnz%5Ftextlink&_t=26000&_r=REA_NZ_tagline&_m=EXT\">http://a.ninemsn.com.au/b.aspx?URL=http%3A%2F%2Fwww%2Eallrealestate%2Eco%2Enz%2Freview%2Fhome%2Dbuying%2Dinfo%2Ehtml%3Frsf%3Dmsnnz%5Ftextlink&_t=26000&_r=REA_NZ_tagline&_m=EXT</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":301158115,"authorName":"amberlee_b","from":"&quot;amberlee_b&quot; &lt;amberlee16@...&gt;","profile":"amberlee_b","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Is this normal?","postDate":"1224787349","msgId":36691,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdkcWdpbCtpc2hnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdkb3A5ditsYW5nQGVHcm91cHMuY29tPg=="},"prevInTopic":36676,"nextInTopic":36697,"prevInTime":36690,"nextInTime":36692,"topicId":36658,"numMessagesInTopic":0,"msgSnippet":"Let me give you an example of video games and movies as a jumping off point.  My oldest is almost 13 and is completely obsessed with superheros and comic","messageBody":"<div id=\"ygrps-yiv-1990291796\">Let me give you an example of video games and movies as a jumping off<br/>\npoint.  My oldest is almost 13 and is completely obsessed with<br/>\nsuperheros and comic books.  He loves the spiderman video game and<br/>\nwhen we decided to unschool everything and not just what they were<br/>\nlearning he wanted to play 24/7.  The only reason he chose not to was<br/>\nhe felt it was fair to let his younger siblings have the opportunity<br/>\nto use the PS2.  They worked out a plan among themselves.  If one of<br/>\nthe others wished to play they would let him finish or pass what he<br/>\nwas trying to do first.<br/>\n<br/>\nIf it wasn&#39;t the video games it was movies.  We have watched (some<br/>\nmultiple times) Spiderman I and II, X-Men I and II, Hellboy, Iron Man,<br/>\nand a handful of other movies.  After watching Iron Man 3 times (once<br/>\nin the cheap seats theater)the change happened.  No, I don&#39;t mean his<br/>\nvoice dropped, although he is working on that one.  He stopped<br/>\nwatching movies.  For the last 2 weeks he has been creating, building,<br/>\nrecycling.  I can&#39;t wait to take photos and put them on the RUN ning<br/>\nto show you what he has created.  I am amazed.  It began with an Iron<br/>\nMan suit, he only got part of it finished when he found an Optimus<br/>\nPrime mask at the thrift store for $3.  It still works!!  This week he<br/>\nworked endlessly building the suit out of cardboard for his Halloween<br/>\ncostume.  I haven&#39;t done anything on it, wouldn&#39;t have the first clue<br/>\nhow to do it...but he has been working on it, details and all.  We<br/>\nplan to start base painting it so we can spray paint it metallic<br/>\ncolors.  All those times watching the movies and old TV episodes via<br/>\nYouTube have him using engineering, creativity, measuring, math and<br/>\nmore for the coolest project I have had the experience to witness.<br/>\n<br/>\nDid he completely stop with movies this week?  No-the Hulk came out on<br/>\nRedbox so his dad and I watched together (it gave him a break from<br/>\ntape and cardboard).  His mind is spinning in a different direction<br/>\nwith it now.  He has to create till it is finished with limited breaks<br/>\nor he will forget what he wants to do and how.<br/>\n<br/>\nThis is how the brain works.  Some people need multiple breaks, others<br/>\n thrive on uninterrupted sessions hours on end.  He wouldn&#39;t get that<br/>\nin school.  Every 50 minutes something new.  He wouldn&#39;t do well in<br/>\nspurts like that.  Just as he would start wrapping his brain around<br/>\nsomething POOF and on to the next subject.<br/>\n<br/>\nToday he is volunteering at the library...he also thanked me for the<br/>\ntime he has had to create.  it is pretty cool... :)<br/>\n<br/>\nHang in there and let them wear themselves out with the games.  It<br/>\nwill lead to other things. <br/>\n<br/>\nHuggs,<br/>\nAmberlee</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Is this normal?","postDate":"1224757015","msgId":36675,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwNUEzNzkxLUZFQTEtNDE2Ny1CM0EzLUQ2NjYwMUVERDRGQkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDAwY2IwMWM5MzQ5NyQ3ZTVkZWFjMCQ2NDAwYThjMEB5b3VyNGRhY2QwZWE3NT4=","referencesHeader":"PDAwY2IwMWM5MzQ5NyQ3ZTVkZWFjMCQ2NDAwYThjMEB5b3VyNGRhY2QwZWE3NT4="},"prevInTopic":36674,"nextInTopic":36676,"prevInTime":36674,"nextInTime":36676,"topicId":36658,"numMessagesInTopic":0,"msgSnippet":"... How do you introduce something to a friend? For one, I m betting you re not thinking This would be good for her. She needs this for life. How can I get","messageBody":"<div id=\"ygrps-yiv-1089778990\">On Oct 22, 2008, at 6:42 PM, Nelson and Kelly wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How do our more experienced unschoolers introduce new concepts?<br/>\n<br/>\n </span></blockquote>How do you introduce something to a friend?<br/>\n<br/>\nFor one, I&#39;m betting you&#39;re not thinking &quot;This would be good for her.  <br/>\nShe needs this for life. How can I get this into her?&quot; as parents do  <br/>\nwith kids.<br/>\n<br/>\nFor another, if she shows no interest, you might be disappointed but  <br/>\nI bet you move on. Perhaps find another friend who will like it.<br/>\n<br/>\nThere are a million ideas and things to do and things to see and  <br/>\nexperience out there in the world. If they choose one, like spiders,  <br/>\nthey&#39;re not doing another, like Abraham Lincoln and whales and Legos  <br/>\nand Hardy Boys.<br/>\n<br/>\nTreat anything new like a new video game. Show it to them. If they&#39;re  <br/>\ninterested, pursue it. If not, move on. Don&#39;t get personally invested  <br/>\nin anyone thing. If it&#39;s important, the opportunity will come again.  <br/>\nIf it doesn&#39;t show up again, then it&#39;s not really a part of life, is it?<br/>\n<br/>\nThink of it this way. Kids will give us a few opportunities to  <br/>\npressure them into trying something. The more often they like what we  <br/>\nurged them to try, the more they&#39;ll trust us and give us the benefit  <br/>\nof the doubt when we say &quot;I think you&#39;ll like this.&quot; But if we blow  <br/>\nit on something we think is important and turns out dull, they&#39;re  <br/>\ngoing to trust us less the next time.<br/>\n<br/>\nThey&#39;ll give you a handful of Trust Mes. Don&#39;t squander them ;-) And  <br/>\nthe bonus is if you nail a Trust Me, they&#39;ll give you more. :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How do you deal with video games? If I allowed my boys they would  <br/>\n&gt; be on<br/>\n&gt; 24/7!!<br/>\n<br/>\n </span></blockquote>Read here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/ifilet\">http://sandradodd.com/ifilet</a><br/>\n<br/>\nYes, I know it&#39;s an exaggeration. Yes, I know you&#39;re convinced they  <br/>\nwould play from the moment they get up to the moment they fall over  <br/>\nexhausted.<br/>\n<br/>\nBut what I know (not just guess!) from the personal experience of  <br/>\nhundreds of unschoolers who were just as convinced by their  <br/>\nchildren&#39;s behavior is that you are creating that hunger by limiting  <br/>\nvideo games.<br/>\n<br/>\nIf you lift the controls, yes, they will play for hours and hours for  <br/>\ndays. They will fear the controls will return so they will need to  <br/>\ngorge on what was limited. But if you hold on through the hard part,  <br/>\nthey will slow down. Once they are confident they can set the game  <br/>\ndown and then pick it up anytime they want, they will be able to let  <br/>\ngo. They will move onto other things. They won&#39;t give up games  <br/>\nentirely. The may play more, perhaps a lot more, than you would let  <br/>\nthem. (Prepuberty years tend to be the time when they do play video  <br/>\ngames a lot and watch a lot of tv. It&#39;s a mental transition period  <br/>\nbetween child interests and more grown up interests.) A new game will  <br/>\nget them excited again.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My oldest has a new passion from his xbox game forza, he is<br/>\n&gt; phenomenal with cars, their makes, models, capabilities, but how do I<br/>\n&gt; guarantee that he is getting a &quot;real&quot; education?<br/>\n<br/>\n </span></blockquote>How do you know it isn&#39;t a real education?<br/>\n<br/>\nHow do you know that schools provide real educations?<br/>\n<br/>\nThose sound like idiotic questions, but once you&#39;ve stepped far  <br/>\nenough away from schoolish methods and have seen what real learning  <br/>\nlooks like -- and trusted it! --, school looks like kids being force  <br/>\nfed predigested pabulum and real learning looks like a smorgasbord  <br/>\nthat&#39;s out all the time for them to explore a world of food from.<br/>\n<br/>\nHow easily did your kids pick up English as toddlers? How easily did  <br/>\nyou pick up a foreign language in school? Which was real learning?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How can I build off of this<br/>\n&gt; passion in the things he NEEDS to know to go to college and make it  <br/>\n&gt; in this<br/>\n&gt; society?<br/>\n<br/>\n </span></blockquote>Does he need what schools provide to get into college?<br/>\n<br/>\nThat&#39;s something most people don&#39;t even question. We assume that  <br/>\ncolleges are dictating what they want kids to know. But really  <br/>\ncolleges are complaining that kids aren&#39;t prepared!<br/>\n<br/>\nWhat colleges *really* want -- but can&#39;t get from kids coming out of  <br/>\nhigh school -- are kids who are passionate about their field of  <br/>\nstudy. What they want are kids who do have the ability to absorb  <br/>\nknowledge the way colleges present it. The first is the most  <br/>\nimportant since it will drive kids past the tedious parts of the second.<br/>\n<br/>\nWhy try to make your kids look like schooled kids when you can help  <br/>\nthem explore their passions and they&#39;ll stand out even more?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My twins really struggle academically, but in the outdoors they  <br/>\n&gt; excel.  They<br/>\n&gt; love to build camp fires and are very good at problem solving, but  <br/>\n&gt; math!,<br/>\n&gt; forget it! They HATE IT!<br/>\n<br/>\n </span></blockquote>I bet they know more math than you can see. I bet what they hate is  <br/>\nmath that&#39;s pulled out of context and being forced to do problems  <br/>\nthat have no meaning.<br/>\n<br/>\nIf you&#39;re in a store with $22 and want to feed the family dinner with  <br/>\nenough left over for a latte you haven&#39;t had for 3 weeks, *that&#39;s*  <br/>\nreal math. If you&#39;re told to do 22-4.95-8.32-3.99 that&#39;s a problem  <br/>\nthat ends in the trash whether you get the answer right or not. Even  <br/>\nif those numbers were one of the options you ran through for the  <br/>\nfirst scenario, with the second you aren&#39;t buying real food, there  <br/>\nwon&#39;t be a real latte at the end, you won&#39;t get to decide if you&#39;d  <br/>\nrather have the asparagus and skip the syrup or the green beans and  <br/>\nget the syrup.<br/>\n<br/>\nDown below is something I wrote yesterday about math for a local list.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I want my boys to have a renewed love for learning, they are better  <br/>\n&gt; than<br/>\n&gt; when they were in PS, but still we live in the city, not lots of  <br/>\n&gt; space.<br/>\n&gt;<br/>\n&gt; They would LOVE to be out in wide open spaces with lots of options for<br/>\n&gt; airsoft wars, army guys and camping.<br/>\n<br/>\n </span></blockquote>People move to different towns to get their talented kids on better  <br/>\nsports teams.<br/>\n<br/>\nIf you lived out in the boonies and your kids were showing monstrous  <br/>\ntalent for classical piano with only one old lady teacher within 100  <br/>\nmiles, wouldn&#39;t that seem incentive to move?<br/>\n<br/>\nYour kids have one chance at childhood. If they&#39;re genius lies in the  <br/>\noutdoors, isn&#39;t it the same as trapping them far from people with  <br/>\ntalent and resources who could nurture their talents?<br/>\n<br/>\nI think we all have it in the back of our minds that the only reason  <br/>\nto move is for dad or mom to get a job. But why should that be? We  <br/>\nonly get one chance at life. Why should that chance be as a slave to  <br/>\nthe location of a company that said yes, come work for us? Why can&#39;t  <br/>\ndreams be the driving force? Mostly because society says, no, don&#39;t  <br/>\ntake chances. Take the safe route. And at the end of the safe route  <br/>\nwe get to say &quot;I survived life until it ended.&quot; Is getting through  <br/>\nlife safely the point?<br/>\n<br/>\nYou don&#39;t need to tell me why that won&#39;t work. The list is about  <br/>\nideas. You don&#39;t need a list to support &quot;No, I can&#39;t.&quot; But if the  <br/>\nidea intrigues you and you&#39;d like to explore it, I&#39;m sure there are  <br/>\nplenty of people here who have the wisdom of experience for &quot;I did do  <br/>\nit.&quot;<br/>\n<br/>\n=============<br/>\nThe math post from another list:<br/>\n<br/>\nThe problem with school type math (like workbooks) is that it begins  <br/>\nwith the abstract with the hope that kids will grasp the concrete.  <br/>\nIt&#39;s not that educators want to be difficult. It&#39;s that it&#39;s really  <br/>\nhard to teach how numbers are fluid, how math is just a way of  <br/>\ndescribing the world. And it&#39;s even harder to test. (And schools must  <br/>\ntest in order to prove to the state and parents that they&#39;re  <br/>\naccomplishing something.) So educators *can&#39;t* teach in ways that  <br/>\nhelp kids grasp how numbers work because they have to test :-/<br/>\n<br/>\nUnfortunately lots of software just takes school math and jazzes it  <br/>\nup because the goal for most parents isn&#39;t understanding math but to  <br/>\nboost kids grades. Not, of course, because parents don&#39;t care but  <br/>\nbecause they assume understanding and good grades are the same thing.  <br/>\n(Why wouldn&#39;t they? I&#39;m sure math teachers are just as convinced.)<br/>\n<br/>\nAn analogy I often use is that school math is like teaching kids  <br/>\nsentence structure and vocabulary of a language they&#39;ve never heard.  <br/>\nWhen math is taken out of context, it becomes little more than a  <br/>\nbunch of rules and memorization divorced from the real world.<br/>\n<br/>\nThat&#39;s why lots of people have problems with math in school. Not  <br/>\nbecause they&#39;re dumb. Not because they don&#39;t apply themselves. Not  <br/>\neven because math is hard! (It isn&#39;t.) But because schools need to  <br/>\nuse a method that&#39;s practically impossible to learn from in order to  <br/>\ntest.<br/>\n<br/>\n(BTW, I don&#39;t say that because I hated math. I actually liked school  <br/>\nmath. It was like puzzles to me. I went on to get a degree in  <br/>\nengineering because I liked and was good at school math. I was  <br/>\nabsolutely convinced that the math I went through couldn&#39;t be learned  <br/>\nby living life. It wasn&#39;t until my daughter was middle schoolish age  <br/>\nand I could see how she was using math in her play that I finally  <br/>\ngrasped the difference between abstract contextless school math and  <br/>\nreal world math.)<br/>\n<br/>\nWith only the example of school to go by, people are absolutely  <br/>\npositively convinced that learning math takes hours a week. So it&#39;s  <br/>\nuseful to know that unschooled kids spend minutes a week and learn  <br/>\nmath anyway. That&#39;s because unschooled kids use math concepts as  <br/>\ntools to pull information they need out of their worlds. They learn  <br/>\nmath as a side effect of using it. Just as they learned how to speak,  <br/>\njust by using it as a tool to get what they wanted.<br/>\n<br/>\nMy daughter learned percentages not by studying them as an abstract  <br/>\nconcept and practicing with contextless problems (eg, what&#39;s 17.4% of  <br/>\n193?) but by seeing them used and using them to extract information  <br/>\nshe needed. I honestly can&#39;t say enough good about video games and  <br/>\nmath :-) Art programs. Allowance. Measuring. Sorting and ordering  <br/>\ncollections. Shopping. Cooking. None of this was done to teach math.  <br/>\nMath was just used in the process. The purpose of cooking was to make  <br/>\ncookies and such :-) In the process sometimes we&#39;d be doubling or a  <br/>\nmeasuring cup was dirty and we needed to cobble together a half cup  <br/>\nwith only a quarter cup measure available and so on. Math was never a  <br/>\ngoal but it was very often a tool that got used.<br/>\n<br/>\nAt 13 she decided to take the college statistics course her dad  <br/>\nteaches. While she did have him available to ask for help on  <br/>\nhomework, she did the tests like everyone else and was at the top of  <br/>\nher class. She took 4 more college classes (two without him. though  <br/>\nagain he helped with homework) and also did very well. That&#39;s *not*  <br/>\nmeant to imply that anyone can plunk their kid down in front of video  <br/>\ngames and have them take college math at 13 ;-) The goal of  <br/>\nunschooling is for kids to explore what they enjoy, not to ace  <br/>\ncollege courses. And yet that can happen anyway. It does mean that  <br/>\nwith nothing more than using math as a tool over the years, that my  <br/>\ndaughter was able to apply her knowledge in a math course when lots  <br/>\nof the kids with 12+ years of school math couldn&#39;t. She&#39;s not a math  <br/>\nhead, doing math puzzles under the covers at night ;-) She&#39;s more of  <br/>\nan art head but she did think it was fun.<br/>\n<br/>\nI don&#39;t throw that out there to convince you to drop all math  <br/>\nprograms. Unless someone has fully embraced unschooling, unschooling  <br/>\nmath is probably a recipe for ulcers ;-) I do throw it out because  <br/>\nwithout that information, it seems like schools hold the only truth  <br/>\nthere is about teaching math: that it&#39;s hard and takes hours. Nothing  <br/>\ncould be further from the truth. What schools do is practically  <br/>\nimpossible and it&#39;s no wonder that they not only don&#39;t do well but  <br/>\nchurn out loads of kids that hate and fear math. Math isn&#39;t as hard  <br/>\nas schools make it. Unfortunately learning math by living life looks  <br/>\nnothing like doing school math -- it looks way more like playing  <br/>\nvideo games ;-) -- so it can make parents nervous.<br/>\n<br/>\n(The amount of math and the depth of math needed for video games is  <br/>\nincredible. Schools can&#39;t touch the type of math (strategy in  <br/>\nparticular) that video games use because it&#39;s hard to test. The  <br/>\nfoundation of video games is math. The strategies necessary to beat  <br/>\nthem use mathematical thinking. It doesn&#39;t look like school math  <br/>\nbecause it&#39;s real math :-) Of course video games are more than just  <br/>\nmath. They&#39;re more like microcosms of the world where all sorts of  <br/>\ntools get used ;-) Sandra Dodd has collected a lot of good  <br/>\ninformation about video games if anyone&#39;s curious:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/videogames)\">http://sandradodd.com/videogames)</a><br/>\n<br/>\nFinally I can get to recommendations. There are several math programs  <br/>\nused by relaxed homeschoolers at:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.fun-books.com/mathematics.htm\">http://www.fun-books.com/mathematics.htm</a><br/>\n<br/>\nMiquon workbooks -- I like the layout of these. They do a decent job  <br/>\nof presenting the idea of numbers as fluid and that there being more  <br/>\nthan one way to arrive at an answer. Lots of relaxed homeschoolers  <br/>\nuse them. (Kat did a couple of pages but was never one for &quot;Here, do  <br/>\nthis,&quot; kind of work so, except for 2 months of 2nd grade, those few  <br/>\npage were the extent of her formal math. ;-)<br/>\n<br/>\nZoombinis - Just a wonderful piece of software. And not a single  <br/>\nnumber! Kids play with math concepts and come up with strategies to  <br/>\nmove the Zoombinis along to a safe place. There are at least two of  <br/>\nprograms, both equally wonderful. You don&#39;t need one to play the other.<br/>\n<br/>\nChildren&#39;s science museum in Acton. They&#39;ve got great math toys :-)<br/>\n<br/>\nIf anyone&#39;s curious about the fun of math (as well as unschooling  <br/>\nmath), Sandra Dodd has a really good page:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/math/\">http://sandradodd.com/math/</a><br/>\n<br/>\nI have some stuff too, answers to common questions about math (and  <br/>\nother stuff):<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com\">http://joyfullyrejoycing.com</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":334703817,"authorName":"cary.seston","from":"&quot;cary.seston&quot; &lt;cary.seston@...&gt;","profile":"cary.seston","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Is this normal?","postDate":"1224730751","msgId":36676,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdkb3A5ditsYW5nQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDQjAyOEZFMzc3RkVEQy0xN0VDLTI0MDdAd2VibWFpbC1tZTE5LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":36675,"nextInTopic":36691,"prevInTime":36675,"nextInTime":36677,"topicId":36658,"numMessagesInTopic":0,"msgSnippet":"Maybe everyone understands unschooling, and  ... Kelly~ This is not a funny joke. Cary  rookie RUer since Feb 2008","messageBody":"<div id=\"ygrps-yiv-1122883981\">Maybe everyone understands unschooling, andÂ <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; we&#39;re not needed any more? &lt;g&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Kelly~<br/>\nThis is not a funny joke.<br/>\n<br/>\nCary &lt;g&gt;<br/>\nrookie RUer since Feb 2008</div>","specialLinks":[]},{"userId":140885507,"authorName":"Kathleen Gehrke","from":"&quot;Kathleen Gehrke&quot; &lt;gehrkes@...&gt;","profile":"gehrkes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Video games 24/7 and welcome Kelly!","postDate":"1224729483","msgId":36674,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdkb28yYithMmdrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwY2IwMWM5MzQ5NyQ3ZTVkZWFjMCQ2NDAwYThjMEB5b3VyNGRhY2QwZWE3NT4="},"prevInTopic":36673,"nextInTopic":36675,"prevInTime":36673,"nextInTime":36675,"topicId":36658,"numMessagesInTopic":0,"msgSnippet":"... I ... First let me tell you  some of my kids learned to read and then write from video games. The key for us to to have a passion about the information we","messageBody":"<div id=\"ygrps-yiv-1411383969\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Nelson and Kelly&quot; &lt;nel-<br/>\nkel@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; My oldest has a new passion from his xbox game forza, he is<br/>\n&gt; phenomenal with cars, their makes, models, capabilities, but how do <br/>\n </span></blockquote>I<br/>\n<blockquote><span title=\"ireply\"> &gt; guarantee that he is getting a &quot;real&quot; education? <br/>\n<br/>\n </span></blockquote>First let me tell you  some of my kids learned to read and then write <br/>\nfrom video games. <br/>\n<br/>\nThe key for us to to have a passion about the information we are <br/>\ntaking in. Then you want to take it to the next level, meaning get as <br/>\nmuch information as possible, or perhaps go onto to another interest.<br/>\n<br/>\nWhat we have found is that life and a real education are really one <br/>\nin the same. My kids can talk politics, the environment. They can <br/>\ncook gourmet, play the guitar, do crafting like no ones business. <br/>\nThey appreciate art, history and sciences. BUT they are not seperated <br/>\nout. They are a reflection of a full life. That is the real education.<br/>\n<br/>\nI also have several children that would be identified as special <br/>\nneeds. I choose to identify all my children as individuals. There is <br/>\nno perfect time to learn AB or C. Each of them have perfect, perfect <br/>\nperfect timing for them. <br/>\n<br/>\nOh and by the way they might initially play video games 24/7. When no <br/>\none is rushing them off. They might learn really important concepts <br/>\nthere. Then they might jump on a trampoline or watch the stars or <br/>\nbuild a fire. They might meet new friends at the park or train a dog, <br/>\nor dance like the guy on YouTube. <br/>\n<br/>\nAn unschooling life is RICH. It is a perfect education.<br/>\n<br/>\nWELCOME,<br/>\nKathleen</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Is this normal?","postDate":"1224728443","msgId":36673,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEyNjFGMjlCLURFRDgtNEI4Ni1BM0VCLTM5QzYyOTBGMTVBNUBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDIwMDgxMDIyMjEwMTUxLjFWWTlMLjQ4MTAzNS5yb290QG1wMTY+","referencesHeader":"PDIwMDgxMDIyMjEwMTUxLjFWWTlMLjQ4MTAzNS5yb290QG1wMTY+"},"prevInTopic":36672,"nextInTopic":36674,"prevInTime":36672,"nextInTime":36674,"topicId":36658,"numMessagesInTopic":0,"msgSnippet":"Welcome, Michelle, Maybe some of your questions will be answered here: http://joyfullyrejoycing.com/unschooling/firstquestions.html ","messageBody":"<div id=\"ygrps-yiv-1169892404\">Welcome, Michelle,<br/>\n<br/>\nMaybe some of your questions will be answered here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/unschooling/firstquestions.html\">http://joyfullyrejoycing.com/unschooling/firstquestions.html</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/unschooling/howto.html\">http://joyfullyrejoycing.com/unschooling/howto.html</a><br/>\n<br/>\nor here (on Sandra Dodd&#39;s great site, but written by this list&#39;s co- <br/>\nowner):<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/kellylovejoy/stages\">http://sandradodd.com/kellylovejoy/stages</a><br/>\n<br/>\nFor an excellent book that is easy to read and *get*, especially for  <br/>\nspouses, I&#39;d recommend &quot;Parenting a Free Child - An Unschooled Life&quot;  <br/>\nby Rue Kream (a moderator of this list &lt;g&gt;).  http:// <br/>\nwww.freechild.info/.<br/>\n<br/>\nI would also suggest just reading here at the group for awhile, say a  <br/>\ncouple of weeks or so. If there isn&#39;t enough &quot;traffic,&quot; search the  <br/>\narchives on the Yahoo site for issues you might like some discussion  <br/>\non. It&#39;s a handy strategy for any newbie, to get the flavor of the list.<br/>\n<br/>\nThen, fire away with your questions!<br/>\n<br/>\nRobin B.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Oct 22, 2008, at 6:01 PM, Mike and Michelle wrote:<br/>\n<br/>\n&gt;<br/>\n&gt; Hi Everyone!<br/>\n&gt; I am also new to the group. My name is Michelle and I am Mom to 7  <br/>\n&gt; awesome children. We currently have two graduating this year :(, one  <br/>\n&gt; in 4th grade, one in 6th grade, 2 1/2 year old twins and a 1 year  <br/>\n&gt; old. We currently only homeschool one of the seniors, Andrea. Our  <br/>\n&gt; 4th and 6th graders live with my ex-husband during the school year  <br/>\n&gt; and attend a public school. I tried to talk my ex-husband into  <br/>\n&gt; letting me homeschool them (we homeschooled while we were married),  <br/>\n&gt; but he wouldn&#39;t go for it :( I have gone from an EXTREMELY  <br/>\n&gt; structured packaged curriculum, to Charlotte Mason with Andrea. We  <br/>\n&gt; both disliked (I don&#39;t think that word is quite strong enough) the  <br/>\n&gt; structured method. She isn&#39;t minding the Charlotte Mason approach  <br/>\n&gt; this year, but she can&#39;t stand the structured math, government, etc.  <br/>\n&gt; She is to the point where she doesn&#39;t even do it anymore! I have  <br/>\n&gt; actually stopped hounding her about it and am feeling better and  <br/>\n&gt; better about that decision the more I read about unschooling. She  <br/>\n&gt; will, however, work on the area&#39;s she does enjoy like psychology,  <br/>\n&gt; french, citizenship (Charlotte Mason&#39;s book Ourselves) and bible  <br/>\n&gt; study (which she gets up and does every morning). We had considered  <br/>\n&gt; the classical method with the younger three and are currently using  <br/>\n&gt; some of the montessori method with them ( in an informal way).<br/>\n&gt; What&#39;s really funny is, now that I&#39;m reading everything I can get my  <br/>\n&gt; hands on about unschooling, I&#39;m seeing everything my kids do in a  <br/>\n&gt; different light. I have moved some of the montessori out and about  <br/>\n&gt; for them to use without &quot;presentations&quot; as they wish. And like I  <br/>\n&gt; said I&#39;m not hounding my daughter anymore. I feel so much better, so  <br/>\n&gt; relaxed! I&#39;m actually enjoying myself with all 4 that are home with  <br/>\n&gt; me during the day :)<br/>\n&gt; I just checked out another book tonight, so I&#39;m going to go read  <br/>\n&gt; more. The only thing that concerns me is getting daddy on board! He  <br/>\n&gt; may be a little harder to convince, we&#39;ll see!<br/>\n&gt; Well, sorry this was so long! I&#39;m really excited about this and  <br/>\n&gt; can&#39;t wait to see where it leads us as a family! Hopefully you  <br/>\n&gt; ladies (and gents) won&#39;t mind my questions:)<br/>\n&gt; I&#39;m off to do some more reading!<br/>\n&gt; Michelle<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":277863440,"authorName":"Mike and Michelle","from":"Mike and Michelle &lt;mhadd015@...&gt;","profile":"myangeland6blessings","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"[unschoolingbasics] Re: Is this normal?","postDate":"1224723711","msgId":36672,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDgxMDIyMjEwMTUxLjFWWTlMLjQ4MTAzNS5yb290QG1wMTY+","inReplyToHeader":"PGdkbzk0ais0NjVwQGVHcm91cHMuY29tPg=="},"prevInTopic":36670,"nextInTopic":36673,"prevInTime":36671,"nextInTime":36673,"topicId":36658,"numMessagesInTopic":0,"msgSnippet":"Hi Everyone! I am also new to the group. My name is Michelle and I am Mom to 7 awesome children. We currently have two graduating this year :(, one in 4th","messageBody":"<div id=\"ygrps-yiv-368091999\">Hi Everyone!<br/>\nI am also new to the group. My name is Michelle and I am Mom to 7 awesome children. We currently have two graduating this year :(, one in 4th grade, one in 6th grade, 2 1/2 year old twins and a 1 year old. We currently only homeschool one of the seniors, Andrea. Our 4th and 6th graders live with my ex-husband during the school year and attend a public school. I tried to talk my ex-husband into letting me homeschool them (we homeschooled while we were married), but he wouldn&#39;t go for it :( I have gone from an EXTREMELY structured packaged curriculum, to Charlotte Mason with Andrea. We both disliked (I don&#39;t think that word is quite strong enough) the structured method. She isn&#39;t minding the Charlotte Mason approach this year, but she can&#39;t stand the structured math, government, etc. She is to the point where she doesn&#39;t even do it anymore! I have actually stopped hounding her about it and am feeling better and better about that decision the more I read about unschooling. She will, however, work on the area&#39;s she does enjoy like psychology, french, citizenship (Charlotte Mason&#39;s book Ourselves) and bible study (which she gets up and does every morning). We had considered the classical method with the younger three and are currently using some of the montessori method with them ( in an informal way).<br/>\nWhat&#39;s really funny is, now that I&#39;m reading everything I can get my hands on about unschooling, I&#39;m seeing everything my kids do in a different light. I have moved some of the montessori out and about for them to use without &quot;presentations&quot; as they wish. And like I said I&#39;m not hounding my daughter anymore. I feel so much better, so relaxed! I&#39;m actually enjoying myself with all 4 that are home with me during the day :)<br/>\nI just checked out another book tonight, so I&#39;m going to go read more. The only thing that concerns me is getting daddy on board! He may be a little harder to convince, we&#39;ll see!<br/>\nWell, sorry this was so long! I&#39;m really excited about this and can&#39;t wait to see where it leads us as a family! Hopefully you ladies (and gents) won&#39;t mind my questions:)<br/>\nI&#39;m off to do some more reading!<br/>\nMichelle<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Is this normal?","postDate":"1224719711","msgId":36670,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgxMDIyMTY1NWs2YWY0ZjF1ZDIxYTFjNDRiN2NkM2QxNkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDAwY2IwMWM5MzQ5NyQ3ZTVkZWFjMCQ2NDAwYThjMEB5b3VyNGRhY2QwZWE3NT4=","referencesHeader":"PDAwY2IwMWM5MzQ5NyQ3ZTVkZWFjMCQ2NDAwYThjMEB5b3VyNGRhY2QwZWE3NT4="},"prevInTopic":36668,"nextInTopic":36672,"prevInTime":36669,"nextInTime":36671,"topicId":36658,"numMessagesInTopic":0,"msgSnippet":"For math, read here: http://joyfullyrejoycing.com/academics/math/unschoolingmath.html A couple of places for reading about video games (to start with; there s ","messageBody":"<div id=\"ygrps-yiv-6084855\">For math, read here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/academics/math/unschoolingmath.html\">http://joyfullyrejoycing.com/academics/math/unschoolingmath.html</a><br/>\n<br/>\nA couple of places for reading about video games (to start with; there&#39;s<br/>\nlots more than this):<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tinyurl.com/6mu72a\">http://tinyurl.com/6mu72a</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/ifilet\">http://sandradodd.com/ifilet</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/videogames\">http://sandradodd.com/videogames</a><br/>\n<br/>\nAnd welcome to unschooling, Kelly.  You gonna love it.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 10/22/08, Nelson and Kelly &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nel-kel@...\">nel-kel@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I am new to this group, let me introduce my family.<br/>\n&gt;<br/>\n&gt; My name is Kelly, my husband, Nelson and I have been married for 17 years.<br/>\n&gt; We have 3 boys, Anthony 13yrs old, Benjamin and Christopher are 11 yrs old.<br/>\n&gt;<br/>\n&gt; Our boys have always been in public school until March of 2007. Anthony was<br/>\n&gt; finishing up 6th grade, Benjamin and Christopher were in 3rd grade. We had<br/>\n&gt; been praying for months about taking them out of school and homeschooling.<br/>\n&gt; After our twins were crying for several nights and several mornings before<br/>\n&gt; school, we knew that we had to do something about their misery. WE pulled<br/>\n&gt; them out and unschooled for many, many months! It was very freeing and<br/>\n&gt; relaxing. I was recovering from a total hysterectomy. Lots of changes in<br/>\n&gt; our home!!<br/>\n&gt;<br/>\n&gt; Our twins have really suffered from learning disabilities, I would rather<br/>\n&gt; say they just learn things differently! They were crying every night and<br/>\n&gt; morning before school because they were being told that if they did not<br/>\n&gt; learn their multiplication facts they would fail 4th grade! HELLO!! They<br/>\n&gt; were still in 3rd and they are telling them they are going to fail the<br/>\n&gt; FOLLOWING year!<br/>\n&gt;<br/>\n&gt; We have recently started researching unschooling, what a wonderful concept!<br/>\n&gt; I have been leaning towards this method for quite some time without<br/>\n&gt; realizing it, but have begun to search and read more about it, how it works<br/>\n&gt; and the outcomes.<br/>\n&gt;<br/>\n&gt; How do our more experienced unschoolers introduce new concepts?<br/>\n&gt; How do you deal with video games? If I allowed my boys they would be on<br/>\n&gt; 24/7!! My oldest has a new passion from his xbox game forza, he is<br/>\n&gt; phenomenal with cars, their makes, models, capabilities, but how do I<br/>\n&gt; guarantee that he is getting a &quot;real&quot; education? How can I build off of<br/>\n&gt; this<br/>\n&gt; passion in the things he NEEDS to know to go to college and make it in this<br/>\n&gt; society?<br/>\n&gt;<br/>\n&gt; My twins really struggle academically, but in the outdoors they excel. They<br/>\n&gt; love to build camp fires and are very good at problem solving, but math!,<br/>\n&gt; forget it! They HATE IT!<br/>\n&gt;<br/>\n&gt; I want my boys to have a renewed love for learning, they are better than<br/>\n&gt; when they were in PS, but still we live in the city, not lots of space.<br/>\n&gt;<br/>\n&gt; They would LOVE to be out in wide open spaces with lots of options for<br/>\n&gt; airsoft wars, army guys and camping.<br/>\n&gt;<br/>\n&gt; I have really enjoyed reading about your lives and how you unschool.<br/>\n&gt;<br/>\n&gt; I would LOVE to get some input and advice on how to begin this new, totally<br/>\n&gt; unfamiliar territory.<br/>\n&gt;<br/>\n&gt; God bless,<br/>\n&gt;<br/>\n&gt; Kelly in FL<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":274890364,"authorName":"Nelson and Kelly","from":"&quot;Nelson and Kelly&quot; &lt;nel-kel@...&gt;","profile":"nelgkel","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Is this normal?","postDate":"1224715361","msgId":36668,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwY2IwMWM5MzQ5NyQ3ZTVkZWFjMCQ2NDAwYThjMEB5b3VyNGRhY2QwZWE3NT4="},"prevInTopic":36667,"nextInTopic":36670,"prevInTime":36667,"nextInTime":36669,"topicId":36658,"numMessagesInTopic":0,"msgSnippet":"I am new to this group, let me introduce my family. My name is Kelly, my husband, Nelson and I have been married for 17 years. We have 3 boys, Anthony 13yrs","messageBody":"<div id=\"ygrps-yiv-633524235\">I am new to this group, let me introduce my family.<br/>\n<br/>\nMy name is Kelly, my husband, Nelson and I have been married for 17 years.<br/>\nWe have 3 boys, Anthony 13yrs old, Benjamin and Christopher are 11 yrs old.<br/>\n<br/>\nOur boys have always been in public school until March of 2007.  Anthony was<br/>\nfinishing up 6th grade, Benjamin and Christopher were in 3rd grade.  We had<br/>\nbeen praying for months about taking them out of school and homeschooling.<br/>\nAfter our twins were crying for several nights and several mornings before<br/>\nschool, we knew that we had to do something about their misery.  WE pulled<br/>\nthem out and unschooled for many, many months!  It was very freeing and<br/>\nrelaxing.  I was recovering from a total hysterectomy. Lots of changes in<br/>\nour home!!<br/>\n<br/>\nOur twins have really suffered from learning disabilities, I would rather<br/>\nsay they just learn things differently!  They were crying every night and<br/>\nmorning before school because they were being told that if they did not<br/>\nlearn their multiplication facts they would fail 4th grade! HELLO!! They<br/>\nwere still in 3rd and they are telling them they are going to fail the<br/>\nFOLLOWING year!<br/>\n<br/>\nWe have recently started researching unschooling, what a wonderful concept!<br/>\nI have been leaning towards this method for quite some time without<br/>\nrealizing it, but have begun to search and read more about it, how it works<br/>\nand the outcomes.  <br/>\n<br/>\n <br/>\n<br/>\nHow do our more experienced unschoolers introduce new concepts?<br/>\nHow do you deal with video games? If I allowed my boys they would be on<br/>\n24/7!! My oldest has a new passion from his xbox game forza, he is<br/>\nphenomenal with cars, their makes, models, capabilities, but how do I<br/>\nguarantee that he is getting a &quot;real&quot; education? How can I build off of this<br/>\npassion in the things he NEEDS to know to go to college and make it in this<br/>\nsociety?<br/>\n<br/>\nMy twins really struggle academically, but in the outdoors they excel.  They<br/>\nlove to build camp fires and are very good at problem solving, but math!,<br/>\nforget it! They HATE IT! <br/>\n<br/>\nI want my boys to have a renewed love for learning, they are better than<br/>\nwhen they were in PS, but still we live in the city, not lots of space.<br/>\n<br/>\nThey would LOVE to be out in wide open spaces with lots of options for<br/>\nairsoft wars, army guys and camping.<br/>\n<br/>\n <br/>\n<br/>\nI have really enjoyed reading about your lives and how you unschool.<br/>\n<br/>\nI would LOVE to get some input and advice on how to begin this new, totally<br/>\nunfamiliar territory.<br/>\n<br/>\n <br/>\n<br/>\nGod bless, <br/>\n<br/>\nKelly in FL<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Is this normal?","postDate":"1224714195","msgId":36667,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdkbzk0ais0NjVwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdkbms2bis2MXA0QGVHcm91cHMuY29tPg=="},"prevInTopic":36665,"nextInTopic":36668,"prevInTime":36666,"nextInTime":36668,"topicId":36658,"numMessagesInTopic":0,"msgSnippet":"FWIW, some of the other high volume boards are quiet too, right now. Something in the solar wind I suppose ;)","messageBody":"<div id=\"ygrps-yiv-1850556176\">FWIW, some of the other &quot;high volume&quot; boards are quiet too, right now. <br/>\nSomething in the solar wind I suppose ;)<br/>\n---Meredith</div>","specialLinks":[]},{"userId":122460111,"authorName":"Tammy Curry","from":"Tammy Curry &lt;mamabeart00@...&gt;","profile":"mamabeart00","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Is this normal?","postDate":"1224707047","msgId":36663,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwNDc5NC4xMzg5Ny5xbUB3ZWI0NTMxNC5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":36662,"nextInTopic":36665,"prevInTime":36662,"nextInTime":36664,"topicId":36658,"numMessagesInTopic":0,"msgSnippet":"I have seen this list swamp me with email and other times it is quiet. I know for us we have a bout of the flu going around and have been resting today anyway,","messageBody":"<div id=\"ygrps-yiv-1731478988\">I have seen this list swamp me with email and other times it is quiet. I know for us we have a bout of the flu going around and have been resting today anyway, I am only online because I have my own classes to log into today to turn in a project. Is it possible to let college prof&#39;s in on the unschooling method?<br/>\n<br/>\nTammy<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Is this normal?","postDate":"1224702160","msgId":36662,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQjAyOEZFMzc3RkVEQy0xN0VDLTI0MDdAd2VibWFpbC1tZTE5LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":36661,"nextInTopic":36663,"prevInTime":36661,"nextInTime":36663,"topicId":36658,"numMessagesInTopic":0,"msgSnippet":"... From: April Driggers  I was thinking the same thing -=-=-=-=- A list is only as active as its members. Do you have a question?","messageBody":"<div id=\"ygrps-yiv-15965879\">-----Original Message-----<br/>\n<br/>\nFrom: April Driggers &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aprildriggers@...\">aprildriggers@...</a>&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI was thinking the same thing<br/>\n<br/>\n<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nA list is only as active as its members.<br/>\n<br/>\nDo you have a question? Concern?<br/>\n<br/>\nAre you pro-spanking? Pro-control? <br/>\n<br/>\nAre you struggling with bedtimes? With food issues?<br/>\n<br/>\nAre you looking for a conference? Unschooling friends?<br/>\n<br/>\nDo you have a husband who is not on board? Do your in-laws just not understand?<br/>\n<br/>\nDo you think children need to be taught responsibility?<br/>\n<br/>\nWhat about math? Reading? Socialization?<br/>\n<br/>\nCan you see the learning in everything? Maybe everyone understands unschooling, and <br/>\n<br/>\nwe&#39;re not needed any more? &lt;g&gt; <br/>\n<br/>\n<br/>\n<br/>\n<br/>\nStart a topic. People will respond.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nKeep in mind, though, that some are busy traveling. Some are cleaning out closets and sorting <br/>\n<br/>\nsummer/winter clothes. Some are gardening. Some are planning conferences or gatherings. Some <br/>\n<br/>\nare playing YuGiOh! or Barbies with their kids. Some are designing and making Halloween<br/>\n<br/>\ncostumes. Some are baking gingerbread. Some have a new puppy or a new rat. Some are raking <br/>\n<br/>\nup giant piles of leaves to jump in. Some are painting a mural.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nBut...if there&#39;s an interesting topic, they&#39;ll stop and post. I promise. &lt;G&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Is this normal?","postDate":"1224702089","msgId":36661,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQjAyOEZCOTlEMzBCOC0xN0VDLTIzRDlAd2VibWFpbC1tZTE5LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PEE1QkMxMTMxODM2RDRFMjlBNUJENzA1RDkwNjQyNkVGQEhvbWU+","referencesHeader":"PGdkbms2bis2MXA0QGVHcm91cHMuY29tPiA8QTVCQzExMzE4MzZENEUyOUE1QkQ3MDVEOTA2NDI2RUZASG9tZT4="},"prevInTopic":36660,"nextInTopic":36662,"prevInTime":36660,"nextInTime":36662,"topicId":36658,"numMessagesInTopic":0,"msgSnippet":"... From: April Driggers  I was thinking the same thing -=-=-=-=- A list is only as active as its members. Do you have a question?","messageBody":"<div id=\"ygrps-yiv-746146451\">-----Original Message-----<br/>\nFrom: April Driggers &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aprildriggers@...\">aprildriggers@...</a>&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI was thinking the same thing<br/>\n<br/>\n<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nA list is only as active as its members.<br/>\n<br/>\nDo you have a question? Concern?<br/>\n<br/>\nAre you pro-spanking? Pro-control? <br/>\n<br/>\nAre you struggling with bedtimes? With food issues?<br/>\n<br/>\nAre you looking for a conference? Unschooling friends?<br/>\n<br/>\nDo you have a husband who is not on board? Do your in-laws just not understand?<br/>\n<br/>\nDo you think children need to be taught responsibility?<br/>\n<br/>\nWhat about math? Reading? Socialization?<br/>\n<br/>\nCan you see the learning in everything? Maybe everyone understands unschooling, and <br/>\n<br/>\nwe&#39;re not needed any more? &lt;g&gt; <br/>\n<br/>\n<br/>\n<br/>\n<br/>\nStart a topic. People will respond.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nKeep in mind, though, that some are busy traveling. Some are cleaning out closets and sorting <br/>\n<br/>\nsummer/winter clothes. Some are gardening. Some are planning conferences or gatherings. Some <br/>\n<br/>\nare playing YuGiOh! or Barbies with their kids. Some are designing and making Halloween<br/>\n<br/>\ncostumes. Some are baking gingerbread. Some have a new puppy or a new rat. Some are raking <br/>\n<br/>\nup giant piles of leaves to jump in. Some are painting a mural.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nBut...if there&#39;s an interesting topic, they&#39;ll stop and post. I promise. &lt;G&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193844353,"authorName":"Nicole Willoughby","from":"Nicole Willoughby &lt;cncnawilloughby@...&gt;","profile":"cncnawilloughby","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Is this normal?","postDate":"1224701407","msgId":36660,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2MDI5LjI3MDc3LnFtQHdlYjMxOTExLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PEE1QkMxMTMxODM2RDRFMjlBNUJENzA1RDkwNjQyNkVGQEhvbWU+"},"prevInTopic":36659,"nextInTopic":36661,"prevInTime":36659,"nextInTime":36661,"topicId":36658,"numMessagesInTopic":0,"msgSnippet":"I think there are at lot like me that do a lot more reading than talking :) Posts seem to come in waves though. Nicole Don t worry that children never listen","messageBody":"<div id=\"ygrps-yiv-1871993890\">I think there are at lot like me that do a lot more reading than talking :) <br/>\n<br/>\nPosts seem to come in waves though. <br/>\n <br/>\n<br/>\nNicole <br/>\n<br/>\nDon&#39;t worry that children never listen to you : worry that they are always watching you--Robert Fulghum <br/>\n<br/>\n       <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":178047463,"authorName":"April Driggers","from":"&quot;April Driggers&quot; &lt;aprildriggers@...&gt;","profile":"aprilrd1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Is this normal?","postDate":"1224700169","msgId":36659,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE1QkMxMTMxODM2RDRFMjlBNUJENzA1RDkwNjQyNkVGQEhvbWU+","inReplyToHeader":"PGdkbms2bis2MXA0QGVHcm91cHMuY29tPg==","referencesHeader":"PGdkbms2bis2MXA0QGVHcm91cHMuY29tPg=="},"prevInTopic":36658,"nextInTopic":36660,"prevInTime":36658,"nextInTime":36660,"topicId":36658,"numMessagesInTopic":0,"msgSnippet":"I was thinking the same thing _____ From: unschoolingbasics@yahoogroups.com [mailto:unschoolingbasics@yahoogroups.com] On Behalf Of Erin Sent: Wednesday,","messageBody":"<div id=\"ygrps-yiv-867855300\">I was thinking the same thing<br/>\n<br/>\n <br/>\n<br/>\n  _____  <br/>\n<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>] On Behalf Of Erin<br/>\nSent: Wednesday, October 22, 2008 11:26 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: [unschoolingbasics] Is this normal?<br/>\n<br/>\n <br/>\n<br/>\nWith over 2000 members I thought this list would be really active. Is <br/>\nit normal for there to be so little activity? <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Is this normal?","postDate":"1224695789","msgId":36665,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQjAyODEwRUFGQTEwMC0xN0VDLTE5RTNAd2VibWFpbC1tZTE5LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PGdkbms2bis2MXA0QGVHcm91cHMuY29tPg==","referencesHeader":"PGdkbms2bis2MXA0QGVHcm91cHMuY29tPg=="},"prevInTopic":36663,"nextInTopic":36667,"prevInTime":36664,"nextInTime":36666,"topicId":36658,"numMessagesInTopic":0,"msgSnippet":"... From: Erin  With over 2000 members I thought this list would be really active.  Is it normal for there to be so little activity?","messageBody":"<div id=\"ygrps-yiv-1629549445\">-----Original Message-----<br/>\n<br/>\n<br/>\nFrom: Erin &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:theburkemommy@...\">theburkemommy@...</a>&gt;<br/>\n<br/>\n<br/>\n<br/>\nWith over 2000 members I thought this list would be really active.  Is <br/>\nit normal for there to be so little activity?  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-=-=-=-=-=-=-<br/>\n<br/>\nBelow is the number of posts per month since the group was formed in May of 2004.<br/>\n<br/>\nMy only warning is to be careful what you wish for. &lt;G&gt;<br/>\n<br/>\nTypically, the lists ebb and flow. I kind of look forward to the quiet days. &lt;g&gt; So far, <br/>\n<br/>\nthis has been an abnormally slow month. But inevitably, someone will ask about discipline or<br/>\n<br/>\nreading or bedtimes or math, and it will pick up. &lt;G&gt;<br/>\n<br/>\nI suggest to just enjoy the down time. &lt;BWG&gt;<br/>\n<br/>\nBut if you have something you&#39;d like addressed, please post!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nJan<br/>\n<br/>\nFeb<br/>\n<br/>\nMar<br/>\n<br/>\nApr<br/>\n<br/>\nMay<br/>\n<br/>\nJun<br/>\n<br/>\nJul<br/>\n<br/>\nAug<br/>\n<br/>\nSep<br/>\n<br/>\nOct<br/>\n<br/>\nNov<br/>\n<br/>\nDec<br/>\n<br/>\n<br/>\n<br/>\n2008<br/>\n<br/>\n579<br/>\n<br/>\n1077<br/>\n<br/>\n1108<br/>\n<br/>\n852<br/>\n<br/>\n1011<br/>\n<br/>\n973<br/>\n<br/>\n728<br/>\n<br/>\n622<br/>\n<br/>\n664<br/>\n<br/>\n353<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n2007<br/>\n<br/>\n984<br/>\n<br/>\n630<br/>\n<br/>\n1115<br/>\n<br/>\n627<br/>\n<br/>\n629<br/>\n<br/>\n659<br/>\n<br/>\n583<br/>\n<br/>\n686<br/>\n<br/>\n496<br/>\n<br/>\n892<br/>\n<br/>\n670<br/>\n<br/>\n560<br/>\n<br/>\n<br/>\n<br/>\n2006<br/>\n<br/>\n1028<br/>\n<br/>\n647<br/>\n<br/>\n887<br/>\n<br/>\n1448<br/>\n<br/>\n1154<br/>\n<br/>\n1362<br/>\n<br/>\n871<br/>\n<br/>\n940<br/>\n<br/>\n669<br/>\n<br/>\n1034<br/>\n<br/>\n743<br/>\n<br/>\n709<br/>\n<br/>\n<br/>\n<br/>\n2005<br/>\n<br/>\n317<br/>\n<br/>\n139<br/>\n<br/>\n380<br/>\n<br/>\n94<br/>\n<br/>\n105<br/>\n<br/>\n140<br/>\n<br/>\n221<br/>\n<br/>\n543<br/>\n<br/>\n476<br/>\n<br/>\n429<br/>\n<br/>\n685<br/>\n<br/>\n628<br/>\n<br/>\n<br/>\n<br/>\n2004<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n138<br/>\n<br/>\n1145<br/>\n<br/>\n1121<br/>\n<br/>\n600<br/>\n<br/>\n370<br/>\n<br/>\n536<br/>\n<br/>\n293<br/>\n<br/>\n308<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":334729351,"authorName":"Erin","from":"&quot;Erin&quot; &lt;theburkemommy@...&gt;","profile":"theburkemommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Is this normal?","postDate":"1224692759","msgId":36658,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdkbms2bis2MXA0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":36659,"prevInTime":36657,"nextInTime":36659,"topicId":36658,"numMessagesInTopic":0,"msgSnippet":"With over 2000 members I thought this list would be really active.  Is it normal for there to be so little activity?","messageBody":"<div id=\"ygrps-yiv-1601360415\">With over 2000 members I thought this list would be really active.  Is <br/>\nit normal for there to be so little activity?</div>","specialLinks":[]}],"prevTopicId":36738,"nextTopicId":36679}}