{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":237503152,"authorName":"barndogzzz@wmconnect.com","from":"barndogzzz@...","profile":"artofthefire","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE:  DH","postDate":"1147708341","msgId":13181,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyNS4xMDhkZmZhLjMxOTlmZGI1QHdtY29ubmVjdC5jb20+"},"prevInTopic":1070,"nextInTopic":0,"prevInTime":13180,"nextInTime":13182,"topicId":990,"numMessagesInTopic":0,"msgSnippet":"... this already, please ignore. We go through bouts of this in our home. Our kids are up late too and dh is the only one with an actual schedule who has to go","messageBody":"<div id=\"ygrps-yiv-1914034298\"><blockquote><span title=\"ireply\">&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kjl8@...\">kjl8@...</a> (Kiersten Pasciak) on 5/14/2006 8:50:45 PM Eastern Daylight <br/>\n </span></blockquote>Time wrote :  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&quot;I haven&#39;t gotten throught the whole thread yet, so if someone has said <br/>\n </span></blockquote>this already, please ignore. We go through bouts of this in our home. Our kids <br/>\nare up late too and dh is the only one with an actual schedule who has to go to <br/>\nwork. I think it is difficult for him to be the one on the schedule and not <br/>\nget down time (or cave time as it&#39;s called in the Mars/Venus books)&lt;&lt;&quot;<br/>\n<br/>\n***LOL, I love the term &quot;cave time&quot;. I have to agree with you. I&#39;m sure it <br/>\nwould be frustrating to get up really early, go to work all day, and (possibly) <br/>\ncome home to someone (or your whole family!!!? huh???!!!) not being respectful <br/>\nof that alone time or your sleep time, etc.?! Wow, how unkind! I wouldn&#39;t do <br/>\nthat to my dh or my kids and he, would never do that to us. That would just <br/>\nnot be cool to do to someone that you love and respect. Being that this is a <br/>\n&quot;family&quot; (including dh) and we are trying to respect each other in this family, <br/>\nour dd&#39;s wouldn&#39;t want to do that to their Dad either! ****<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; His frustration may really mean he wants more time with you. &lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>**** That&#39;s probably got a lot to do with it. But, is there ever that much <br/>\nalone time when your kids are young?! :o) Unschooling or not, when kids are <br/>\nyoung, they are busy and in need! :o) I know when our kids were younger (they are <br/>\n11& 12 at home & 21 on his own now) having some nice alone time (or a decent <br/>\nnights sleep for that matter!) was easier said than done! But we both needed <br/>\nthat time, it was and still is a mutual thing. &lt;g!&gt; We love down time/alone time <br/>\naround here and our kids are aware of that, (they like it too) but, not b/c <br/>\nwe *tell* them, &quot;HEY, WE WANT ALONE/DOWN TIME!&quot;. It&#39;s b/c they just *know* from <br/>\ngrowing within the family. We each enjoy time as a family, alone time, and <br/>\n(for dh and I) time as a couple. Heck, the girls like time alone with each other <br/>\ntoo. It&#39;s all a part of life for us and the girls don&#39;t know any other way. <br/>\nIt&#39;s just normal, not a *fight* or *argument* to *get* alone time or sleep time <br/>\nfor that matter! (ick! that would suck if I felt I had to argue or complain <br/>\nfor a good nights sleep, etc.)<br/>\n<br/>\nWe have always loved when the girls come in our room and chill out with us. <br/>\n(they were just in there with us last night and one ended up crashing on the <br/>\nfloor pillows) BUT, they LOVE to chill out in their own rooms also, a lot of <br/>\ntimes alone so they can *relate* to what &quot;alone time&quot;, &quot;down time&quot; or &quot;sleep <br/>\ntime&quot; means for a person. <br/>\nI guess you just have to work at all this &quot;being a family business&quot; one day <br/>\nat a time and try to grow towards a common ground for everyone concerned. Some <br/>\ngood things just take time. ****<br/>\n<br/>\nNancy<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":125789604,"authorName":"Onesnotenough@aol.com","from":"Onesnotenough@...","profile":"justlikemama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] DH","postDate":"1088219167","msgId":1070,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhNy4yNTYzZWNiYy4yZTBlNDIxZkBhb2wuY29tPg=="},"prevInTopic":1056,"nextInTopic":13181,"prevInTime":1069,"nextInTime":1071,"topicId":990,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/25/2004 3:53:29 PM Central Daylight Time, blvarga@comcast.net writes: My son  cooks because he wants to be a chef.  We never force him to","messageBody":"<div id=\"ygrps-yiv-614203584\">In a message dated 6/25/2004 3:53:29 PM Central Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:blvarga@...\">blvarga@...</a> writes:<br/>\n<br/>\nMy son  cooks<br/>\nbecause he wants to be a chef.  We never force him to cook, but  fortunately<br/>\nhe loves it and won&#39;t let me in the kitchen, because that is  his space.  We<br/>\nare very blessed to have a child that loves to cook and  is very gifted it<br/>\nthat area.  Is there something your son would enjoy  doing to help, so it<br/>\ndidn&#39;t seem like work?<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nYes, he loves to cook too!  Woke up to eggs and toast already  made this <br/>\nmorning!  He does seem to be taking over my kitchen, like you son  has.  And if he <br/>\ndoes, I won&#39;t mind a bit!<br/>\n <br/>\n <br/>\n&quot;...since  we can&#39;t know what knowledge will be most needed in the future, it <br/>\nis senseless  to try to teach it in advance. Instead, we should try to turn <br/>\nout people who  love learning so much and learn so well that they will be able <br/>\nto learn whatever  needs to be learned.&quot;<br/>\n-- _John  Holt_ (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.quoteworld.org/author.php?thetext=John+Holt)\">http://www.quoteworld.org/author.php?thetext=John+Holt)</a> <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":176100470,"authorName":"Betsy Varga","from":"&quot;Betsy Varga&quot; &lt;blvarga@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] DH","postDate":"1088195229","msgId":1056,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENIRUlLT0pLQlBLRUtQR0JNT01FTUVNUENKQUEuYmx2YXJnYUBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDFkMy4yNDZiNjk3ZS4yZTBjOTBlZEBhb2wuY29tPg=="},"prevInTopic":990,"nextInTopic":1070,"prevInTime":1055,"nextInTime":1057,"topicId":990,"numMessagesInTopic":0,"msgSnippet":"Our family tries to make unschooling a journey for all of us.  If our children help us around the house, we have more time to give them the attention they want","messageBody":"<div id=\"ygrps-yiv-1422162154\">Our family tries to make unschooling a journey for all of us.  If our<br/>\nchildren help us around the house, we have more time to give them the<br/>\nattention they want and need.  My husband works all day outside of the home.<br/>\nI have a chronic illness, so we need our children&#39;s help.  We do not expect<br/>\na lot, but we are asking for mutual respect and picking up after themselves.<br/>\nWe all need to be encouraged by helping each other.  We all need some<br/>\nnurturing in our relationships, both adults and children.  If my husband<br/>\nworks all day and then does everything around the house it would be unfair<br/>\nto him and I think he would become very tired and discouraged, maybe even<br/>\ndepressed.<br/>\n<br/>\nWe own ten acres of land and have many pets.  We require our children to<br/>\nfeed and care for the pets because the consequence would be traumatic, not a<br/>\nlearning process.  They know that their father works all day to provide for<br/>\nthem and does not have time to do everything without some help.  The<br/>\nchildren do have a choice to find homes for the animals if they do not want<br/>\nto care for them.  We do help them with chores if they ask for our help.<br/>\n<br/>\nMy mother grew-up here and she had some chickens when she was a child.  For<br/>\nwhatever reason, she did not feed them and the adults thought she would<br/>\nlearn responsibility from the experience.  The chicks died and my mother did<br/>\nnot learn anything really, but the sadness of the event stuck with her for<br/>\nher entire life.<br/>\n<br/>\nSomething&#39;s just need to be done, but it is good to help children feel a<br/>\nsince of co-operation, mutual respect and some choices in the matter.  Maybe<br/>\nif your son could choose from a list of chores or choose to get it done<br/>\nbefore dad gets home, maybe a race against time or as a surprise for his<br/>\nfather.  I wonder why he cries?  Is he afraid, confused or frustrated?<br/>\nCould you go out with them and make it a fun family affair?<br/>\n<br/>\nI read a book about five love languages (words of affirmation, physical<br/>\ntouch, quality time, acts of service, and gifts).<br/>\nMaybe one child enjoys the quality time with dad while the other child does<br/>\nnot feel that his needs are being met.<br/>\n<br/>\nWe have spent a lot of time with two Amish families.  Children start helping<br/>\nout as soon as they can walk.  It is amazing how the children co-operate<br/>\nbecause they are included in the work.  The parents use love, direction and<br/>\nconstant attention, but I never see them punished or forced to work.  The<br/>\nchildren seem to know there part in the family and help out willingly.<br/>\n<br/>\nWe request our children&#39;s help and do not demand it.  Sometimes they just<br/>\nneed a little time and then they are willing help out.  Their rooms and<br/>\ntheir laundry is up to them, they deal with those things when they see fit.<br/>\nThe pets are non-negotiable, because they are dependents.  My son cooks<br/>\nbecause he wants to be a chef.  We never force him to cook, but fortunately<br/>\nhe loves it and won&#39;t let me in the kitchen, because that is his space.  We<br/>\nare very blessed to have a child that loves to cook and is very gifted it<br/>\nthat area.  Is there something your son would enjoy doing to help, so it<br/>\ndidn&#39;t seem like work?</div>","specialLinks":[]},{"userId":125789604,"authorName":"Onesnotenough@aol.com","from":"Onesnotenough@...","profile":"justlikemama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"DH","postDate":"1088108269","msgId":990,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkMy4yNDZiNjk3ZS4yZTBjOTBlZEBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":1056,"prevInTime":989,"nextInTime":991,"topicId":990,"numMessagesInTopic":0,"msgSnippet":"First of all alittle background so you all can understand what I m talking about! We have 10 acres of land.  My DH works a lot of hours to make  up for my not","messageBody":"<div id=\"ygrps-yiv-1318601054\">First of all alittle background so you all can understand what I&#39;m talking  <br/>\nabout!<br/>\n  We have 10 acres of land.  My DH works a lot of hours to make  up for my <br/>\nnot working (out of the house that is)!  We have 5 horses, lots  of chickens, <br/>\ncats, a dog, turtles, a cow and a now nonresident 4 ft snake that  they found <br/>\nunder a board yesterday.  He is happily alive down the road AWAY  from my house!<br/>\n  Anyway, we need our boys help.  10 acres might not seem like a  lot, but <br/>\nwhen there are things to be done, it has to be done.  And some  nights ds11 just <br/>\ndoes not want to do anything to help anyone.   On the  other hand ds6 shadows <br/>\nhis dad!  The fact that Kaleb won&#39;t help upsets my  husband, around here, <br/>\nkids are expected to work.  That is not my  opinion.  When DH is at work, I don&#39;t <br/>\nforce the boys to do anything.   I might ask, but if they aren&#39;t up to it, <br/>\nthen fine.  But DH on the other  hand, tells them they have to help, and it is <br/>\ngetting to be really hard on me to  have to watch this go on.  Its not like it <br/>\nhappens every single day, and  he&#39;s not mean or abusive, but he&#39;s going <br/>\nagainst what I am doing here.  I  talked to him about unschooling these guys almost <br/>\na year ago when we decided  this was going to be the way to go.  I TRY to <br/>\ninitiate conversations on how  unschooling works, and either he just isnt&#39; <br/>\ninterested or he&#39;s leaving it all up  to me, either way, as long as he doesn&#39;t need <br/>\ntheir help he is very supportive  (even though he appears to be clueless)!  <br/>\nHe&#39;s a very gentle man, I have to  say that for him.  A wonderful father too.  <br/>\nBut I hate to see Kaleb  cry when he has to go out and work.   I don&#39;t even know <br/>\nwhat question  to ask.  So I&#39;ll leave it at HELP!<br/>\nthanks<br/>\nSyndi  <br/>\n <br/>\n&quot;...since  we can&#39;t know what knowledge will be most needed in the future, it <br/>\nis senseless  to try to teach it in advance. Instead, we should try to turn <br/>\nout people who  love learning so much and learn so well that they will be able <br/>\nto learn whatever  needs to be learned.&quot;<br/>\n-- _John  Holt_ (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.quoteworld.org/author.php?thetext=John+Holt)\">http://www.quoteworld.org/author.php?thetext=John+Holt)</a> <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":13179,"nextTopicId":13090}}