{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":43,"messages":[{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238801943","msgId":39298,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyNjZtbis1M3FpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY1Mjg2LjUxMjcxLnFtQHdlYjUyMDA3Lm1haWwucmUyLnlhaG9vLmNvbT4="},"prevInTopic":39297,"nextInTopic":39300,"prevInTime":39297,"nextInTime":39299,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"... ******************** Okay, you ve changed arguements. No One is talking about abuse - we re talking about displaying conventional forms of politeness. If","messageBody":"<div id=\"ygrps-yiv-1546246874\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Amy &lt;quinlonsma@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; &gt; I think there is a subtle distinction between what some may consider &quot;not being nice&quot; and abuse. I have absolutely no qualms whatsoever about rushing to the side of a tired or overstimulated or off mood person to help them get their needs met. I do not allow anyone (even my own mother) to scream at me, kick me, hit me, bite me, in order for me to go get them something.<br/>\n </span></blockquote>********************<br/>\n<br/>\nOkay, you&#39;ve changed arguements. No One is talking about abuse - we&#39;re talking about displaying conventional forms of politeness. If you want to talk abuse within that context, people can be plenty mean and rotten with a Please or Thank You on their lips. Where I live (TN), the absolute meannest thing you can say is &quot;Bless your heart.&quot; <br/>\n<br/>\nIn any case, no one is trying to argue that physical violence is merely un-gracious.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When my children are simply out of sorts and yell at me to get them something...<br/>\n </span></blockquote>****************<br/>\n<br/>\nWe&#39;re not talking about yelling, either - you gave a good example of meeting the needs of overstimulated kids, for sure. But the scenario you threw out the first time was a child saying &quot;I want ice cream&quot; - not overstimulated, not freaking out, not mean, not abusive. Maybe all wrapped up in what he or she is doing and so not being as gracious as possible - its Okay for kids to not always be as gracious as possible. They get better at being consistently gracious when they live in an environment where graciousness is a regular occurrance. More than modelling, the graciousness meets some of their emotional needs and makes it Easier for them to be gracious, themselves. Replying by saying &quot;oh, you want ice cream, great&quot; doesn&#39;t meet any needs, doesn&#39;t help anything, doesn&#39;t even model anything but being snarky to a loved one.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I want to address the topic of natural consequences. If you change the natural consequence of your childs action in the name of &quot;safety&quot; or &quot;respect&quot; are you really unschooling them? Or are you creating a false sense of the world around them just as surely as if you had created a punishment for them for something you felt was out of line?<br/>\n </span></blockquote>**************************<br/>\n<br/>\nThis is where its really important to have a good grasp of your own guiding principles - those values that actually motivate your behavior. When you clear the way to live by your principles, some of your reactions will change. That&#39;s a good thing - its you being more true to your self. But it complicates the whole question of &quot;natural consequences&quot; because some &quot;natural&quot; reactions are animal reactions and some are habits, knee-jerk reactions of thought and feeling. Part of clearing the way to live by your principles involves learning to Not default to those more basic reactions.<br/>\n<br/>\nOkay, this is all very theoretical, let me try to give an example of what I mean. My frustration is sometimes a natural consequence of my kids&#39; actions - but I also have a very strong guiding principle of kindness. Sometimes its Kind to let my kids know the extent of my frustration. Its useful information about me, about the world and how their behavior effects other people. Other times my frutration isn&#39;t a terribly kind or useful piece of information. Then its better if I take some deep breaths and Deal without dishing my own issues up to my kids. In either case, I&#39;m expressing my deepest intent of being kind to the people around me - but in one case I&#39;m providing a &quot;natural consequence&quot; and in another, I&#39;m not. <br/>\n<br/>\nThe result of being true to principles, rather than relying on rules or even guidelines like &quot;natural consequences&quot; is that you end up being more consistent in ways that are more tangible. That sounds backwards, doesn&#39;t it? But its something I&#39;ve seen over and over in my family, at work, and heard many similar stories from other longtime unschoolers. Kindness is a tangible thing - its gentle words and hands and food and hugs when they&#39;re needed and feeling confident and loved and supported. All those things are tangible - felt in the body itself. And when That is consistent, then kids (and adults too) feel loved and respected and able to be kind in return. <br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238799655","msgId":39297,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyNjRmNytmbW5mQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE4OTc3LjcyNzY2LnFtQHdlYjUyMDExLm1haWwucmUyLnlhaG9vLmNvbT4="},"prevInTopic":39295,"nextInTopic":39298,"prevInTime":39296,"nextInTime":39298,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"... *************************** There are people I don t hang out with very much anymore, at least when the kids are with me, bc they re rude to my kids. I","messageBody":"<div id=\"ygrps-yiv-1832608575\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Amy &lt;quinlonsma@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Is the best parenting scenario to remove all such people from our childrens world or to teach them how to interact with such people while retaining their dignity and true selves? I&#39;m really asking as I haven&#39;t quite come to my own conclusion here.<br/>\n </span></blockquote>***************************<br/>\n<br/>\nThere are people I don&#39;t hang out with very much anymore, at least when the kids are with me, bc they&#39;re rude to my kids. I stay away from people who piss Me off, why shouldn&#39;t my kids have the same option? <br/>\n<br/>\nThat being said, there are plenty of people in the world who are rude to children (or just plain rude). We don&#39;t live in a bubble, so my kids get to meet people who are condescending or didactic or try to order them around or quiz them on a fairly regular basis. I help the kids out as best I can, stepping in when necessary, diffusing the situation, changing the subject, even &quot;getting into it&quot; with the other adult sometimes (which I Don&#39;t recommend, but it happens). My kids have learned many of the same skills - they&#39;re great at changing the subject and finding ways to diffuse situations where adults are being weird. They have great initiative and problem solving skills and they know I&#39;ve &quot;got their back&quot; so to speak. They also know that I can make a royal mess of things in their defense! So they&#39;ve seen a whole lot of social problem solving, and will see plenty more, I&#39;m sure. They aren&#39;t &quot;sheltered&quot; in that sense - I just don&#39;t dump them in situations that we all know up front will be unpleasant. <br/>\n<br/>\nIts an example of the principle of setting kids up for success whenever possible. Kids learn more and better social skills by witnessing a higher percentage of graciousness and kindness and active courtesy all &#39;round than they do from having adults be rude to them for the sake of &quot;teaching courtesy&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Yet, they are also being exposed to the idea that there are different behaviours expected in different places. This occurs for us as a family when we take our children (ages 4 and 6) to theater performances or out to restaurants. If they are feeling rambunctious, I happily get up and take them outside.<br/>\n </span></blockquote>*****************************************<br/>\n<br/>\nWe do this too. I also try to let the kids know about expectations beforehand - movies and theater have an expectation of quiet, that sort of thing. That&#39;s more of the same principle of setting things up for success.<br/>\n<br/>\nAt the same time, there are places we don&#39;t go very often bc I know its a strain, at best, for my kids to Meet the expectations of the space. We didn&#39;t take Ray grocery shopping for years bc he just couldn&#39;t meet the expectations of stores - not climbing the shelves and displays was just more than he could handle without having someone to race up and down the aisles with... and that really makes it hard to shop. I don&#39;t take Mo to libraries anymore when other children are likely to be present bc she reads to other children and in our small town libraries that&#39;s a problem for reasons that escape me entirely. <br/>\n<br/>\nNow that he&#39;s 15, Ray doesn&#39;t have any problem going grocery shopping or even to exciting places like Home Depot without climbing the displays - so its not like he never learned how to behave. But he didn&#39;t have to have the experience of being told &quot;don&#39;t do that&quot; a zillion times to learn it. When he was ready, we could say &quot;the people who work here get nervous when customers do things like that&quot; and that was enough. <br/>\n<br/>\nTo a large extent, courtesy, true courtesty anyway, is a function of empathy. That&#39;s something that can&#39;t be taught, but it can be nurtured. The more one has a sense of innate personal worth, the more readily that empathy is accessible and the more one behaves graciously. That&#39;s true of kids and adults. <br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238797543","msgId":39295,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyNjJkNytobmZzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc3MDM2My4xNzExOS5xbUB3ZWI1MjAwOS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":39287,"nextInTopic":39297,"prevInTime":39294,"nextInTime":39296,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"... ********************************* Relationships can exist without manipulation. They can. Certainly its possible to view every human interaction as being","messageBody":"<div id=\"ygrps-yiv-420329058\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Amy &lt;quinlonsma@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Yes, both of us are being manipulative, not in a bad way, in a learning way. They are manipulating me into handing them ice cream and I am manipulating them into speaking to me in a way fitting of a person they love and respect. I speak to them with exactly the same love and respect.<br/>\n </span></blockquote>*********************************<br/>\n<br/>\nRelationships can exist without manipulation. They can. Certainly its possible to view every human interaction as being about power, or manipulation, or control - but its equally possible to see human interactions from a different viewpoint, one with no locus of control at all. Radical unschooling contains a whole different paradigm of human relationships, starting with parents and children, but expanding beyond that. Beyond power or control or manipulation, love and respect still exist, but they look a little different. They&#39;re gentler things in many ways. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Fortunately for my children what works in my house also works out in the world at large. <br/>\n </span></blockquote>**************************<br/>\n<br/>\nI work in a factory and on construction sites - not exactly models of a gentle environment. But even there, I&#39;ve found its possible to have interactions that weren&#39;t about manipulation but mutual supportiveness. I&#39;ve also seen coworkers bring power trips and sneakiness to work with them and *create* a need for regulation. Now that those particular coworkers are gone, the rules have all been rolled back to &quot;do what seems right&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think our major disagreement isn&#39;t in the Childs behavior but in the Doctors. I see his request for her to say please as gentle reminder, a courtesy, teaching her that there is a way to phrase her desires that will garner the help she wants in reaching her goals.<br/>\n </span></blockquote>*******************************<br/>\n<br/>\nIts absolutely possible for children to learn courtesy without the kinds of tactics the doctor in question used. Its Not necessary to teach courtesy - kids really do learn it from seeing it used between adults and used By adults To Children. <br/>\n<br/>\nNow, I don&#39;t expect every random stranger my kids meet to understand that, but I do look for ways to help my kids out of situations like Marla&#39;s example (Love the stickers in the purse idea!). Its always better when I can say &quot;we don&#39;t have that rule&quot; and the other adult accepts that - that&#39;s courtesy. I don&#39;t shove my parenting philosophy down the throat of everyone I meet and I don&#39;t appreciate it when others do it to me. Even if the doctor doesn&#39;t respect the humanity of children, he might at least be expected to respect others&#39; parenting decisions. <br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":139413400,"authorName":"Amy","from":"Amy &lt;quinlonsma@...&gt;","profile":"quinlonsma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238789785","msgId":39287,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyMDMwMS41ODkzNi5xbUB3ZWI1MjAxMS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGdyNWc2MitjNjZsQGVHcm91cHMuY29tPg=="},"prevInTopic":39280,"nextInTopic":39295,"prevInTime":39286,"nextInTime":39288,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"~~There are two theories I have about that: 1. You live in a different location than I do and your local customs and social contract are different than where","messageBody":"<div id=\"ygrps-yiv-1438197340\">&quot;&quot;~~There are two theories I have about that:<br/>\n<br/>\n<br/>\n1. You live in a different location than I do and your local customs and social contract are different than where I live.~~<br/>\n<br/>\n<br/>\n&quot;I live in the South, where manners are HIGHLY valuable and children<br/>\nare &quot;taught&quot; constantly. None of my very southern friends have ever<br/>\nfelt a need to make me say &quot;please&quot; nor have I ever witnessed adults<br/>\nacting in such a way to anyone that isn&#39;t in the child category.<br/>\n<br/>\n<br/>\n<br/>\nI would love to hear an example of how adults correct each other or try<br/>\nto manipulate a &quot;please&quot; from each other. I&#39;ve lived and traveled all<br/>\nover this country for almost 40 years and never witnessed that kind of<br/>\nbehavior amongst adults. I would think that would be highly unusual.&quot;&quot;<br/>\n<br/>\n<br/>\n<br/>\nThen using Oocums razor the second theory most likely applies.<br/>\n<br/>\nI live and have grown up in Orange County, California. Everywhere from Diners to Gas Stations to parties of friends I have been reminded to say please or ask nicely. Still happens on a fairly regular basis. Occasionally it comes across as manipulative but usually it&#39;s just a friendly reminder when I&#39;m in a bit of rush or out of sorts. I also tend to lose my ability to notice my volume when I&#39;m tired, if I stay out late at least once during the night someone will come over and either gently touch my arm and tell me I&#39;m being loud or ask me to be quieter. Happens.<br/>\n<br/>\nLove and Laughter,<br/>\n<br/>\nAmy<br/>\n<br/>\nsnugglebugg.com/sagepixie <br/>\n<br/>\n<br/>\n<br/>\n&quot;Song for a Fifth Child.&quot;<br/>\n<br/>\n<br/>\n<br/>\nMother, oh Mother,<br/>\n<br/>\ncome shake out your cloth,<br/>\n<br/>\nempty the dustpan,<br/>\n<br/>\npoison the moth,<br/>\n<br/>\nhang out the washing<br/>\n<br/>\nand butter the bread,<br/>\n<br/>\nsew on a button and make up a bed.<br/>\n<br/>\n<br/>\n<br/>\nWhere is the mother whose house<br/>\n<br/>\nis so shocking?<br/>\n<br/>\nShe&#39;s up in the nursery,<br/>\n<br/>\nblissfully rocking.<br/>\n<br/>\nOh, I&#39;ve grown shiftless as Little<br/>\n<br/>\nBoy Blue (lullaby, rockaby, lullaby loo).<br/>\n<br/>\n<br/>\n<br/>\nDishes are waiting and bills are past due<br/>\n<br/>\n(pat-a-cake, darling, and peek, peekaboo).<br/>\n<br/>\nThe shopping&#39;s not done<br/>\n<br/>\nand there&#39;s nothing for stew<br/>\n<br/>\nand out in the yard there&#39;s a hullabaloo<br/>\n<br/>\nbut I&#39;m playing Kanga and this is my Roo.<br/>\n<br/>\nLook! Aren&#39;t her eyes the most wonderful hue?<br/>\n<br/>\n(lullaby, rockaby, lullaby loo).<br/>\n<br/>\n<br/>\n<br/>\nThe cleaning and scrubbing<br/>\n<br/>\nwill wait till tomorrow,<br/>\n<br/>\nfor children grow up,<br/>\n<br/>\nas I&#39;ve learned to my sorrow.<br/>\n<br/>\nSo quiet down, cobwebs.<br/>\n<br/>\nDust go to sleep.<br/>\n<br/>\nI&#39;m rocking my baby and babies don&#39;t keep&#39;<br/>\n<br/>\n<br/>\n<br/>\n~Ruth Hulburt Hamilton~<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Fri, 4/3/09, Ren Allen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt; wrote:<br/>\nFrom: Ren Allen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt;<br/>\nSubject: [unschoolingbasics] Re: Forcing a &quot;please&quot; or an &quot;ask nicely&quot;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Friday, April 3, 2009, 10:14 AM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n            ~~There are two theories I have about that:<br/>\n<br/>\n1. You live in a diffent location than I do and your local customs and social contract are different than where I live.~~<br/>\n<br/>\n<br/>\n<br/>\nI live in the South, where manners are HIGHLY valuable and children are &quot;taught&quot; constantly. None of my very southern friends have ever felt a need to make me say &quot;please&quot; nor have I ever witnessed adults acting in such a way to anyone that isn&#39;t in the child category.<br/>\n<br/>\n<br/>\n<br/>\nI would love to hear an example of how adults correct each other or try to manipulate a &quot;please&quot; from each other. I&#39;ve lived and traveled all over this country for almost 40 years and never witnessed that kind of behavior amongst adults. I would think that would be highly unusual.<br/>\n<br/>\n<br/>\n<br/>\nRen<br/>\n<br/>\nradicalunschooling. blogspot. com<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n      <br/>\n<br/>\n    <br/>\n    <br/>\n\t<br/>\n\t <br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t<br/>\n<br/>\n<br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238779652","msgId":39280,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyNWd1NCtrcHJuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ5ZDY0NTg1LjFhYmQ2MDBhLjIyMzEuZmZmZmFlYzRAbXguZ29vZ2xlLmNvbT4="},"prevInTopic":39278,"nextInTopic":39287,"prevInTime":39279,"nextInTime":39281,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"~~ Just let go of any idea of Natural Consequences. You won t find many people here who want to discuss it, because it s just a mainstream way for people to","messageBody":"<div id=\"ygrps-yiv-720330241\">~~<br/>\nJust let go of any idea of Natural Consequences. You won&#39;t find many people here who want to discuss it, because it&#39;s just a mainstream way for people to coercively train/teach/mold their children without the guilt baggage that comes with *knowing* that punishments and rewards harm children but *using* them anyway.~~<br/>\n<br/>\n<br/>\nYes, a real, true natural consequence happens all by itself, without anyone thinking it up. When people talk about &quot;natural consequences&quot; in parenting circles, it&#39;s usually just another form  of punishment, all dressed up as &quot;progressiveness&quot;. <br/>\n<br/>\nLife has all sorts of struggles and difficulties built right into it. Fostering joy and partnering with our children helps them be better equipped for dealing with life&#39;s bumps and bruises. <br/>\n<br/>\nWhen life throws a curveball, there&#39;s opportunities to discuss ways of dealing with it. The more gracefully and mindfully WE deal with tough times, the more our children learn about it. They watch us. So if you want mindful, positive children, BE mindful and positive yourself. <br/>\n<br/>\nI wouldn&#39;t want my dh punishing me with &quot;natural consequences&quot; when I screw up. I certainly don&#39;t want to treat my children that way. If we worry about what our children are learning, we only need look at ourselves, what our lives look like, how we act and what we&#39;re modeling for them. <br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":291997784,"authorName":"Brad Holcomb","from":"&quot;Brad Holcomb&quot; &lt;list.brad@...&gt;","profile":"bholcomb48","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238779265","msgId":39278,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5ZDY0NTg1LjFhYmQ2MDBhLjIyMzEuZmZmZmFlYzRAbXguZ29vZ2xlLmNvbT4=","inReplyToHeader":"PDY1Mjg2LjUxMjcxLnFtQHdlYjUyMDA3Lm1haWwucmUyLnlhaG9vLmNvbT4=","referencesHeader":"PDQ5ZDRiODk3LjE2MDc4ZTBhLjM1MTcuZmZmZjlhYTRAbXguZ29vZ2xlLmNvbT4gPDY1Mjg2LjUxMjcxLnFtQHdlYjUyMDA3Lm1haWwucmUyLnlhaG9vLmNvbT4="},"prevInTopic":39277,"nextInTopic":39280,"prevInTime":39277,"nextInTime":39279,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"... an ... Yes, and Natural Consequences = Behavior Modification = Control = Coercion = Manipulation And none of those have anything at all to do with","messageBody":"<div id=\"ygrps-yiv-1585975418\"><blockquote><span title=\"ireply\">&gt; This could be construed as deliberate manipulation and if I had planned to<br/>\n<br/>\n&gt; scream Ouch! startle my child remove them from the breast and sooth with<br/>\n </span></blockquote>an <br/>\n<blockquote><span title=\"ireply\"> &gt; explanation about being nice that would be true, however, it wasn&#39;t. The <br/>\n&gt; scenario played out from my honest gut reaction. To my understanding that <br/>\n&gt; puts it in the area of natural consequences.<br/>\n<br/>\n </span></blockquote>Yes, and Natural Consequences = Behavior Modification = Control = Coercion =<br/>\nManipulation<br/>\n<br/>\nAnd none of those have anything at all to do with Unschooling.  They will<br/>\nimpede anyone&#39;s best efforts to unschool.<br/>\n<br/>\nWhen someone bites you, saying Ouch is natural, yes.  Anything after that<br/>\nOuch has a strong potential to be coercive.  Babies don&#39;t like to hurt their<br/>\nmommy.  Our 6 month old bites my wife occasionally.  When it happens, she<br/>\nsays Ouch, helps baby relatch, and moves on, without lecturing the child on<br/>\nwhat it means to nurse &quot;kindly&quot;.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If you change the natural consequence of your childs action in the name <br/>\n&gt; of &quot;safety&quot; or &quot;respect&quot; are you really unschooling them? Or are you<br/>\n </span></blockquote>creating <br/>\n<blockquote><span title=\"ireply\"> &gt; a false sense of the world around them just as surely as if you had<br/>\n </span></blockquote>created a <br/>\n<blockquote><span title=\"ireply\"> &gt; punishment for them for something you felt was out of line?<br/>\n<br/>\n </span></blockquote>Just let go of any idea of Natural Consequences.  You won&#39;t find many people<br/>\nhere who want to discuss it, because it&#39;s just a mainstream way for people<br/>\nto coercively train/teach/mold their children without the guilt baggage that<br/>\ncomes with *knowing* that punishments and rewards harm children but *using*<br/>\nthem anyway.  I think that reading Alfie Kohn&#39;s book Punished by Rewards<br/>\nwould help your thinking in this area a LOT.  The first sentence in the<br/>\nquote above shows how muddy and misguided Natural Conseqence thinking is.<br/>\nIf I could &quot;change the natural consequence&quot; of my child&#39;s action, what is it<br/>\nthat&#39;s making it &quot;natural&quot;?????  If you can &quot;change the consequence&quot;, how is<br/>\nthat not another way of saying that YOU decide the appropriate consequence<br/>\n(punishment or reward) depending on your own beliefs and morals and world<br/>\nview?  Unschoolers recognize that true &quot;natural consequences&quot; are<br/>\nobjectively &quot;natural&quot;.  Skinned knees from a fall off a skateboard is a<br/>\nnatural consequence.  That&#39;s a solo act by my child, no input on my part.<br/>\nOnce the parental actors are involved, choosing and deciding on the best<br/>\n&quot;natural&quot; consequence, it&#39;s simply coercive living with a fancy feel-good<br/>\nname.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I wonder if this bubble is appropriate or if like the Prince/Princess <br/>\n&gt; kept in the castle my children will feel horribly mislead as to the<br/>\n </span></blockquote>reality <br/>\n<blockquote><span title=\"ireply\"> &gt; of the world at large?<br/>\n<br/>\n </span></blockquote>So we should punish our kids a little bit sometimes so they&#39;ll be used to it<br/>\nwhen they&#39;re out there on their own?  The majority of society believes that.<br/>\nBut definitely not Unschoolers.  We choose joy over fears and concerns about<br/>\nhow the future might look.  Tomorrow doesn&#39;t exist.  When you get there,<br/>\nit&#39;s Today.  We never see tomorrow.  We make joyful choices in our<br/>\ninteractions TODAY, trusting that it&#39;s the most JOYFUL and most FUN way to<br/>\ndeal with a simple natural consequence of life:  our complete inability to<br/>\npredict the future.  There is no &quot;world at large&quot; that my son will<br/>\nexperience someday.  He&#39;s living in his &quot;world at large&quot; right now, daily.<br/>\nHe&#39;s a full-bore human being experiencing life, today, now.  I&#39;m not<br/>\npreparing him for a later nebulous/maybe/what-if reality.  <br/>\n<br/>\n<br/>\nRobyn Coburn said the following about unschooling, and I love these words so<br/>\nmuch I have them printed and taped to my wall above my PC so I can marinate<br/>\nin them frequently (I&#39;m pretty sure I found the quote on sandradodd.com a<br/>\nfew months back):<br/>\n<br/>\n&quot;The idea of Unschooling is for parents to be the facilitators of options,<br/>\nthe openers of doors, the creators of environments of freedom, and the<br/>\nguardians of choice, not the installers of roadblocks and barriers.<br/>\nUnschoolers are making the huge and wonderful choice to renounce our legal<br/>\nentitlements to be the authoritarian controllers of our children&#39;s lives,<br/>\nand instead choose to be their partners.&quot;<br/>\n<br/>\n<br/>\nIf you want to delve into unschooling thought more, an excellent way to do<br/>\nit is to go to this page:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com\">http://joyfullyrejoycing.com</a><br/>\n<br/>\nOn the top right, there&#39;s a &quot;Go to a random page&quot; link.  Click it, and keep<br/>\nclicking it, every chance you get.  Every time you feel the urge to write to<br/>\nthis group and defend or justify your current ways of being with your kids,<br/>\njust go read another random page at Joyce&#39;s site. <br/>\nOnce you think you&#39;ve read everything at that site, go here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/random\">http://sandradodd.com/random</a><br/>\n<br/>\n<br/>\n<br/>\n--<br/>\nBrad in Boulder, CO<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://holcombs.org\">http://holcombs.org</a></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238778882","msgId":39277,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyNWc2MitjNjZsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE4OTc3LjcyNzY2LnFtQHdlYjUyMDExLm1haWwucmUyLnlhaG9vLmNvbT4="},"prevInTopic":39270,"nextInTopic":39278,"prevInTime":39276,"nextInTime":39278,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"~~There are two theories I have about that: 1. You live in a diffent location than I do and your local customs and social contract are different than where I","messageBody":"<div id=\"ygrps-yiv-1522180646\">~~There are two theories I have about that:<br/>\n1. You live in a diffent location than I do and your local customs and social contract are different than where I live.~~<br/>\n<br/>\nI live in the South, where manners are HIGHLY valuable and children are &quot;taught&quot; constantly. None of my very southern friends have ever felt a need to make me say &quot;please&quot; nor have I ever witnessed adults acting in such a way to anyone that isn&#39;t in the child category.<br/>\n<br/>\nI would love to hear an example of how adults correct each other or try to manipulate a &quot;please&quot; from each other. I&#39;ve lived and traveled all over this country for almost 40 years and never witnessed that kind of behavior amongst adults. I would think that would be highly unusual.<br/>\n<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":291997784,"authorName":"Brad Holcomb","from":"&quot;Brad Holcomb&quot; &lt;list.brad@...&gt;","profile":"bholcomb48","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238776160","msgId":39270,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5ZDYzOTY2LjFlMDc4ZTBhLjYxYjIuZmZmZmYxMjJAbXguZ29vZ2xlLmNvbT4=","inReplyToHeader":"PDE4OTc3LjcyNzY2LnFtQHdlYjUyMDExLm1haWwucmUyLnlhaG9vLmNvbT4=","referencesHeader":"PGdyMml0cytlajJsQGVHcm91cHMuY29tPiA8MTg5NzcuNzI3NjYucW1Ad2ViNTIwMTEubWFpbC5yZTIueWFob28uY29tPg=="},"prevInTopic":39267,"nextInTopic":39277,"prevInTime":39269,"nextInTime":39271,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"... matter. ... By whom?  By you and your husband?  Not by me.  Disrespect is disrespect. ... was doing her ... You re not out on any limb at all.  You re very","messageBody":"<div id=\"ygrps-yiv-737396374\"><blockquote><span title=\"ireply\">&gt; I&#39;m not defending disrespectful treatment of children or anyone for that<br/>\n </span></blockquote>matter. <br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m acknowledging that it exists, <br/>\n&gt; and that it&#39;s not always viewed as being disrespectful. <br/>\n<br/>\n </span></blockquote>By whom?  By you and your husband?  Not by me.  Disrespect is disrespect.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m going out on limb here but I would bet that the Doctor really felt he<br/>\n </span></blockquote>was doing her <br/>\n<blockquote><span title=\"ireply\"> &gt; daughter a service by reminding her to say please. <br/>\n<br/>\n </span></blockquote>You&#39;re not out on any limb at all.  You&#39;re very close to the mainstream<br/>\ntrunk of the tree.  But the end does NOT justify the means.  In this<br/>\nscenario, the doctor was being manipulative.  He was trying to get the<br/>\ndaughter to do a trained-animal act.  Manipulation is disrespectful.  The<br/>\ndegree to which you manipulate someone is the degree to which you disrespect<br/>\nthem.  My parents truly, intensely, honestly believed that spanking me was<br/>\ndoing me a great service.  It was saving me from embarrassing them in<br/>\npublic, getting into trouble, or being a sinner that might end up in hell.<br/>\nTheir &quot;end&quot; goal was completely justified in their mind, so they could use<br/>\nwhatever means necessary to achieve that goal.  And in the process they<br/>\ndisrespected me, a lot.  My desires and learning needs were rarely<br/>\nconsidered.  It wasn&#39;t kind, and it didn&#39;t help me much, and in many ways<br/>\nI&#39;m still undoing the damage, 25 years after leaving their home at age 17.<br/>\nInteractions in your home that have the intention of molding or &quot;teaching&quot;<br/>\nyour child to behave a certain way to meet your (or society&#39;s) expectations<br/>\nis doing damage to your child and to your relationship with your child.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is the best parenting scenario to remove all such people from our <br/>\n&gt; childrens world or to teach them how to interact with such people <br/>\n&gt; while retaining their dignity and true selves? I&#39;m really asking as <br/>\n&gt; I haven&#39;t quite come to my own conclusion here.<br/>\n<br/>\n </span></blockquote>As you discover unschooling more, you&#39;ll understand that unschoolers only<br/>\nvery rarely use the verb &quot;to teach&quot;.  Anytime you find yourself saying it,<br/>\nif you&#39;ll substitute the verb &quot;to learn&quot;, your progress toward understanding<br/>\nunschooling will be much quicker.  I don&#39;t &quot;teach&quot; my child how to interact<br/>\nwith people.  He learns it.  I can&#39;t &quot;teach&quot; him this in the same way I<br/>\ncan&#39;t &quot;teach&quot; him to walk or talk or throw a toy or put on his shirt.  He<br/>\nwatched others doing it (including me) and he learned how to do these things<br/>\nin his own way, at his own time.  Anytime you use the word &quot;teach&quot;, it has a<br/>\ntop-down, &quot;I know more than you, and I want to impart my knowledge to you so<br/>\nyou&#39;ll retain it and act in the ways I find acceptable.&quot;  Teaching is icky<br/>\nand schoolish.  If a friend, or even my own wife, tries to &quot;teach&quot; me a<br/>\nlesson they think is important, it&#39;s going to create space and friction in<br/>\nthe relationship.  Kids are no different.  Unschooling looks for the ways to<br/>\neliminate space...to foster closer, intimate, open relationships where<br/>\ncommunication can flow easily.  I am not my son&#39;s teacher.  I am not my<br/>\nson&#39;s boss.  I am his partner, guide, and helper.  I have 38 more years of<br/>\nexperience on this planet than he does, so there are many things I can help<br/>\nhim with.  The key is that I give him this help when he wants it, now when I<br/>\n(or society, or any &quot;social&quot; or &quot;community&quot; contracts, or any other external<br/>\nexpectations) wants it.  And, moment to moment, so far in his 4 years I<br/>\nthink that I, personally, have learned far more *from him* than he&#39;s learned<br/>\nfrom me.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am proposing that if you do not treat each other in your <br/>\n&gt; family with the level of respect and politeness that is inherent in the <br/>\n&gt; social contract that is followed in your community that there will be <br/>\n&gt; natural consequences to your children when they are not aware or able <br/>\n&gt; to behave in a way that is deemed approriate. I feel that&#39;s it&#39;s unfair <br/>\n&gt; to not teach your children that there are expected behaviours inherent <br/>\n&gt; in certain situations. <br/>\n<br/>\n </span></blockquote>This type of thinking is not helpful to unschooling.  Not in any way at all.<br/>\nIt&#39;s yet another example of &quot;the end justifies the means&quot;.  It&#39;s a quick<br/>\nslippery slope from &quot;natural consequences&quot; to spankings with a belt.  My<br/>\nparents spanked me with love and the authority of God, doing their best to<br/>\nmold me since they believed it was necessary.  Children do not need<br/>\nmolding!!  Children need love and help.  Let go of any thoughts about<br/>\n&quot;natural consequences&quot;, because it&#39;s simply one more mainstream euphemism<br/>\nfor &quot;teaching a lesson&quot;.  The father who runs over his kid&#39;s bicycle with<br/>\nhis car instead of looking behind the car before cranking it can easily<br/>\njustify it, saying that the broken bike is a &quot;natural consequence&quot; of the<br/>\nchild irresponsibly leaving the bicycle behind the car.  &quot;If I hadn&#39;t run<br/>\nover my kid&#39;s bicycle, he&#39;d have left something else (maybe bigger or more<br/>\nexpensive or more important) behind the car at a later point.  So by me<br/>\nbeing coercive and unkind now, I&#39;m teaching him how to act more responsibly<br/>\nin the future.&quot;  Our societal ideas of &quot;natural consequences&quot; are icky and<br/>\nmean and disrespectful.  It&#39;s in the exact same category as timeouts or any<br/>\nother &quot;kinder, gentler&quot; form of coercion, manipulation, and &quot;children are<br/>\nnot fully humans yet so we have to mold them&quot; thinking.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I believe their are plenty of ways to teach <br/>\n&gt; politeness without manipulation.<br/>\n<br/>\n </span></blockquote>One unschooling way to say this would be:<br/>\nThere are plenty of ways for my children to learn politeness without me<br/>\nimposing onto them my fears about failing to meet a social contract or<br/>\nexpectation.<br/>\n<br/>\nBehavior is communication.  Trying to change my child&#39;s behavior is usually<br/>\nan attempt to stifle communication that I am not ready or willing to hear.<br/>\nListening to and observing the behavior helps me understand the underlying<br/>\ndesires my child has, that he doesn&#39;t have the English vocabulary to<br/>\ncommunicate to me.  It&#39;s incredibly easy to give the benefit of the doubt to<br/>\nan infant who can&#39;t speak at all, and whose crying or writhing we listen to,<br/>\nand we easily meet their needs for warmth or food or whatever.  When your<br/>\nchild is 4 or 6, their communication via behavior is just as critical.<br/>\nListen to it, instead of requiring them to change it so they fit into any<br/>\nkind of parental or societal mold. <br/>\n<br/>\n-=b.<br/>\n<br/>\n<br/>\n<br/>\n--<br/>\nBrad in Boulder, CO<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://holcombs.org\">http://holcombs.org</a></div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Re: Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238762637","msgId":39267,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkwNDAzMDU0M281MTA3MjZhMWkzNjMxZTlhN2EzOThjMmFjQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDc3MDM2My4xNzExOS5xbUB3ZWI1MjAwOS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PGdyMTR1cisxZnZyQGVHcm91cHMuY29tPgkgPDc3MDM2My4xNzExOS5xbUB3ZWI1MjAwOS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":39260,"nextInTopic":39270,"prevInTime":39266,"nextInTime":39268,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"... ********I feel like withholding is manipulation.  Trying to manipulate someone s actions is coercion. This pertains to the words used not the OP situation.","messageBody":"<div id=\"ygrps-yiv-1481953598\"><blockquote><span title=\"ireply\">&gt; He didn&#39;t force her to say something she didn&#39;t want to. Not giving her a<br/>\n&gt; sticker is not forcing anything, it&#39;s withholding.<br/>\n&gt; He did give the sticker to the Mother after she asked him politely.<br/>\n&gt; It is common for people to treat both adults and children in this way. It&#39;s<br/>\n&gt; called manipulation and it&#39;s rife in our society.<br/>\n&gt; I do see adults hold things out and say &quot;Say please and I&#39;ll give it to<br/>\n&gt; you.&quot; those adults are being condescending and that&#39;s on the gracious end of<br/>\n&gt; manipulation. Usually an adult who is demanding and rude is not given the<br/>\n&gt; courtesy of a reminder to be polite they are simply told &quot;No&quot;.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>********I feel like withholding is manipulation.  Trying to manipulate<br/>\nsomeone&#39;s actions is coercion. This pertains to the words used not the OP<br/>\nsituation.<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Again force and withholding two different things. Children are still<br/>\n&gt; learning how to navigate proper etiquette in society and therefore are given<br/>\n&gt; more opportunities for learning and practice than an adult is. They are<br/>\n&gt; given a grace period that an adult has already passed.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>***I disagree on two parts. One, I think force and withholding are both<br/>\ntools of manipulation. Two, I think that there are different social<br/>\nexpectations for children and adults. Adults can ask in a polite was without<br/>\n&quot;magic&quot; words and are respected. It is much more typical for a children to<br/>\nbe asked to say &quot;please&quot; &quot;thank you&quot; &quot;your welcome&quot; etc.<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; I think our major disagreement isn&#39;t in the Childs behavior but in the<br/>\n&gt; Doctors. I see his request for her to say please as gentle reminder, a<br/>\n&gt; courtesy, teaching her that there is a way to phrase her desires that will<br/>\n&gt; garner the help she wants in reaching her goals.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>***** A gentle reminder would be, Sweetie I really liked to be asked using a<br/>\nkind voice and with a please and a thank you.<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=--=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; You see it as overly manipulative and rude. As nether of us was actually<br/>\n&gt; there it&#39;s impossible to say who&#39;s right.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>**** I don&#39;t necssarily think that Dr was being rude. However, withholding a<br/>\nprize is manipulation. I feel the parent or Dr could have given the child a<br/>\nmore straight forward cue in navigating the situation.<br/>\n-=-=-=-=-=-=--=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; When my children tell me; &quot;I want ice cream.&quot; I say &quot;Great! Thanks for<br/>\n&gt; telling me&quot; IF there&#39;s ice cream in the freezer they are welcome to it. If<br/>\n&gt; there&#39;s not or they need help, they come back to me and ASK &quot;Can you help me<br/>\n&gt; get ice cream?&quot;<br/>\n&gt; A statement of want is not the same as a request for help.<br/>\n&gt; IF my children say &quot;Get me ice cream.&quot; or in Oobie speak &quot;ICE CREAM &lt;point<br/>\n&gt; point&gt;&quot; I say &quot;I&#39;m not going to help you when you speak to me like that.<br/>\n&gt; Would you like to try again?&quot;<br/>\n&gt;<br/>\n<br/>\n&gt; Yes, both of us are being manipulative, not in a bad way, in a learning<br/>\n&gt; way. They are manipulating me into handing them ice cream and I am<br/>\n&gt; manipulating them into speaking to me in a way fitting of a person they love<br/>\n&gt; and respect. I speak to them with exactly the same love and respect. Kids do<br/>\n&gt; what works. Fortunately for my children what works in my house also works<br/>\n&gt; out in the world at large.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>****It is very different in my house. I have no expectation of certain<br/>\nwords. I am happy to help people when and how they need it.<br/>\n<br/>\nI don&#39;t require my kids to jump through hoops to get help. I might offer or<br/>\nI might suggest or problem solve depending on the situation. I may ask if<br/>\nthey can ask me. But I would be getting them ice cream (or whatever) not<br/>\nwithholding it until they complied with my demands. Sometimes I say things<br/>\nlike &quot;I want ice cream.&quot; I try to be empathetic but I don&#39;t say that to<br/>\nmanipulate anyone. I know I have asked my children to &quot;get me ice cream (or<br/>\nwhatever) when they are getting some for them self. I may not have used the<br/>\nword please but the sentiment of love and respect is there. I don&#39;t think we<br/>\nneed to special word to convey the message of appreciation. I don&#39;t know<br/>\nwhat Oobie speak is, I know that my kids have chanted &quot;ice cream, ice cream,<br/>\nice cream!&quot; and I joyfully got it as part of a game. I didn&#39;t find it rude.<br/>\nI don&#39;t tell my kids I wouldn&#39;t help them until they comply with my<br/>\npreferred way of speaking. If I find that a child was be discourteous<br/>\n(courtesy is one of our principles) I would talk to them about it, but not<br/>\nin the situation.<br/>\n<br/>\nI feel I can express my displeasure without withholding or using coercion.<br/>\nIt can be hard at first because this goes against mainstream tactics. It<br/>\ntakes a faith that your children want to be couteous and respectful.<br/>\n<br/>\nFaith<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":139413400,"authorName":"Amy","from":"Amy &lt;quinlonsma@...&gt;","profile":"quinlonsma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238712384","msgId":39256,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4OTc3LjcyNzY2LnFtQHdlYjUyMDExLm1haWwucmUyLnlhaG9vLmNvbT4=","inReplyToHeader":"PGdyMml0cytlajJsQGVHcm91cHMuY29tPg=="},"prevInTopic":39255,"nextInTopic":39260,"prevInTime":39255,"nextInTime":39257,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"If you re here to defend mainstream treatment of children, be prepared for an in-depth discussion. This list exists to examine the treatment of children and","messageBody":"<div id=\"ygrps-yiv-1564611526\">&quot;If you&#39;re here to defend mainstream treatment of children, be prepared<br/>\nfor an in-depth discussion. This list exists to examine the treatment<br/>\nof children and discuss ways that can foster MORE respect, more<br/>\nkindness and more partnership oriented relationships with children.&quot;<br/>\n<br/>\nI&#39;m not defending disrespectful treatment of children or anyone for that matter. I&#39;m acknowledging that it exists, and that it&#39;s not always viewed as being disrespectful. I&#39;m going out on limb here but I would bet that the Doctor really felt he was doing her daughter a service by reminding her to say please. <br/>\n<br/>\nIs the best parenting scenario to remove all such people from our childrens world or to teach them how to interact with such people while retaining their dignity and true selves? I&#39;m really asking as I haven&#39;t quite come to my own conclusion here.<br/>\n<br/>\n*Granted I think 5 is young to be pushed out into the world without a mediator IF I had been in that situation I would have been on my knees in front of my daughter at eye level and been actively mediating between the Doctor and her. My husband and I choose to treat each person in our family with a high degree of politeness and respect and so this particular incident hasn&#39;t come up in this way for us. <br/>\n<br/>\n** Doctor offices beget the issue of personal space for us. I state my expectation that each of the staff introduce themselves to my children, explain what they are doing as they are doing it to my children and ask my childrens permission before touching them in any way. If my children refuse the staff to touch them I ask if I can hold the stethoscope or whatever and if the nurse refuses then we skip that part of the exam.<br/>\n<br/>\n<br/>\n*********<br/>\n<br/>\n&quot;Trying to force a &quot;please&quot; is so rude really. I&#39;m trying to think of a<br/>\nSINGLE incident as an adult, in which someone tried to make me say<br/>\n&quot;please&quot; for any reason whatsover. I can&#39;t think of ONE.<br/>\n<br/>\n<br/>\n<br/>\nAt work, if I want a mint that a co-worker might have (thinking of an<br/>\nexample that comes up frequently) the exchange usually goes something<br/>\nlike: &quot;Hey Misty, can I have one of your mints?&quot;<br/>\n<br/>\n&quot;sure, go ahead&quot;<br/>\n<br/>\n&quot;Thanks!&quot;<br/>\n<br/>\n<br/>\n<br/>\nNObody manipulates anyone to ask a certain way. It&#39;s really NOT<br/>\nacceptable for adults to treat each other that way in our society. If<br/>\nan adult withheld something from another adult and tried to extract a<br/>\n&quot;please&quot; it would seem VERY strange.&quot;<br/>\n<br/>\n<br/>\nThat is your experience and you are blessed to have had it. That is not my experience. Happened to me all the time. Still occasionally happens to me. I&#39;m 35 yrs old.<br/>\n<br/>\nThere are two theories I have about that: <br/>\n1. You live in a diffent location than I do and your local customs and social contract are different than where I live.<br/>\n<br/>\n2. I am/was possibly such a rude and insufferable bitch that people feel/felt compelled to go out of their way to correct me.<br/>\n<br/>\nI&#39;m willing to entertain either one as equally as possible.<br/>\n<br/>\n*******<br/>\n<br/>\n&quot;Children are often treated as inferior beings, who need to be molded<br/>\nand &quot;taught&quot; but we&#39;re here to talk about a different way to BE and<br/>\nlive with children. Trying to manipulate manners is just one such thing<br/>\nwe question and try to find better solutions for.&quot;<br/>\n<br/>\nSadly true. I am proposing that if you do not treat each other in your family with the level of respect and politeness that is inherent in the social contract that is followed in your community that there will be natural consequences to your children when they are not aware or able to behave in a way that is deemed approriate. I feel that&#39;s it&#39;s unfair to not teach your children that there are expected behaviours inherent in certain situations. My childrens Grandparents take them to church occasionally and they have learned that there is an expected way for them to act in certain places of the church. The Mormon church is extremely family oriented, they provide places for children to run amok during services so I have no qualms with my children going there. <br/>\nI know they will be treated kindly and with respect to their needs. Yet, they are also being exposed to the idea that there are different behaviours expected in different places. This occurs for us as a family when we take our children (ages 4 and 6) to theater performances or out to restaurants. If they are feeling rambunctious, I happily get up and take them outside. For the past few years my daughter has been enamored with tea parties, I happily go all out bringing out small glass teapots, cubed sugar in crystal bowls with tongs, small glass cups and cloth tablecloths and napkins for your lap. We put on costumes and airs, we act overly pompous and overly polite, we pretend to gossip and giggle. Now I&#39;ve started to take my little 4 yr old to actual tea houses and she LOVES IT! <br/>\n<br/>\nI believe their are plenty of ways to teach politeness without manipulation.<br/>\n<br/>\n<br/>\nLove and Laughter,<br/>\n<br/>\nAmy<br/>\n<br/>\nsnugglebugg.com/sagepixie <br/>\n<br/>\n<br/>\n<br/>\n&quot;Song for a Fifth Child.&quot;<br/>\n<br/>\n<br/>\n<br/>\nMother, oh Mother,<br/>\n<br/>\ncome shake out your cloth,<br/>\n<br/>\nempty the dustpan,<br/>\n<br/>\npoison the moth,<br/>\n<br/>\nhang out the washing<br/>\n<br/>\nand butter the bread,<br/>\n<br/>\nsew on a button and make up a bed.<br/>\n<br/>\n<br/>\n<br/>\nWhere is the mother whose house<br/>\n<br/>\nis so shocking?<br/>\n<br/>\nShe&#39;s up in the nursery,<br/>\n<br/>\nblissfully rocking.<br/>\n<br/>\nOh, I&#39;ve grown shiftless as Little<br/>\n<br/>\nBoy Blue (lullaby, rockaby, lullaby loo).<br/>\n<br/>\n<br/>\n<br/>\nDishes are waiting and bills are past due<br/>\n<br/>\n(pat-a-cake, darling, and peek, peekaboo).<br/>\n<br/>\nThe shopping&#39;s not done<br/>\n<br/>\nand there&#39;s nothing for stew<br/>\n<br/>\nand out in the yard there&#39;s a hullabaloo<br/>\n<br/>\nbut I&#39;m playing Kanga and this is my Roo.<br/>\n<br/>\nLook! Aren&#39;t her eyes the most wonderful hue?<br/>\n<br/>\n(lullaby, rockaby, lullaby loo).<br/>\n<br/>\n<br/>\n<br/>\nThe cleaning and scrubbing<br/>\n<br/>\nwill wait till tomorrow,<br/>\n<br/>\nfor children grow up,<br/>\n<br/>\nas I&#39;ve learned to my sorrow.<br/>\n<br/>\nSo quiet down, cobwebs.<br/>\n<br/>\nDust go to sleep.<br/>\n<br/>\nI&#39;m rocking my baby and babies don&#39;t keep&#39;<br/>\n<br/>\n<br/>\n<br/>\n~Ruth Hulburt Hamilton~<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":139413400,"authorName":"Amy","from":"Amy &lt;quinlonsma@...&gt;","profile":"quinlonsma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238708922","msgId":39260,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1Mjg2LjUxMjcxLnFtQHdlYjUyMDA3Lm1haWwucmUyLnlhaG9vLmNvbT4=","inReplyToHeader":"PDQ5ZDRiODk3LjE2MDc4ZTBhLjM1MTcuZmZmZjlhYTRAbXguZ29vZ2xlLmNvbT4="},"prevInTopic":39256,"nextInTopic":39267,"prevInTime":39259,"nextInTime":39261,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"How do you require them to speak to you nicely? If they re not in the mood to be nice, you don t give them what they ask? You give it to them, but with a","messageBody":"<div id=\"ygrps-yiv-1381157802\">&quot;How do you &quot;require&quot; them to speak to you nicely? If they&#39;re not in the<br/>\nmood to be nice, you don&#39;t give them what they ask? You give it to<br/>\nthem, but with a reminder to ask nicely next time?&quot;<br/>\n<br/>\nI think there is a subtle distinction between what some may consider &quot;not being nice&quot; and abuse. I have absolutely no qualms whatsoever about rushing to the side of a tired or overstimulated or off mood person to help them get their needs met. I do not allow anyone (even my own mother) to scream at me, kick me, hit me, bite me, in order for me to go get them something. This first came up for me as a parent when my children where months old breast feeding and got teeth in. Occasionally they would become over excited, angry or sometimes just a burst of fiesty and bite me hard while breastfeeding, I would OUCH! (as a natural reaction not a manipulative ploy) remove my breast from their mouth and say in a firm but gentle voice that when you love someone you treat them with kindness, that I do not like to be bitten, biting is not being kind. What happened from an outside perspective is that IF you bite Mommy you don&#39;t get your num nums. After a few times I<br/>\n didn&#39;t get bit anymore. <br/>\nThis could be construed as deliberate manipulation and if I had planned to scream Ouch! startle my child remove them from the breast and sooth with an explanation about being nice that would be true, however, it wasn&#39;t. The scenario played out from my honest gut reaction. To my understanding that puts it in the area of natural consequences.<br/>\n<br/>\nWhen my children are simply out of sorts and yell at me to get them something... I can&#39;t think of a time that they did that recently... Ok last night they were both over tired, screaming and chasing each other through the house and literally running into walls out of tiredness. My husband and I had decided to watch a movie together and didn&#39;t realize that it was a 2 hr movie and not a 1hr movie. We were all well beyond tired. I had missed their cues. I had not been attentive enough and now I had to help them transition into sleep mode. I caught the youngest one to check her head after she had bounced off a wall and said probably too loudly &quot;That&#39;s it! No more tag!&quot; My husband came around the corner and said &quot;Amy, they are really tired, you are really tired.&quot; I immediately changed my tone and said &quot;Lets play GO TO SLEEP!&quot; at which my children laughed. We made a game out of making up the bed (as it had recently been torn apart in play) We made a game out<br/>\n of brushing their teeth. We sang a song about picking out books to read. Then I snuggled in between them while I read and then until after they fell well asleep. <br/>\n<br/>\n&quot;I&#39;ve noticed that when my 4 y/o son is in a mood where he&#39;s less likely<br/>\nto say Please or Thank You, or is simply busy with his play or other<br/>\nthings and too distracted to say Please, that&#39;s the time that me acting<br/>\n*more* quickly and *more* friendly when he asks for something<br/>\nstrengthens our relationship and keeps communication open and flowing.<br/>\nBehavior is communication of my son&#39;s internal world, so I have no<br/>\ndesire to squelch negativity or mold him to act the way I want.<br/>\n<br/>\n<br/>\n<br/>\nThe above quote struck me as similar to &quot;I reward good behavior with<br/>\nfaster and more friendly service, and punish poor behavior by<br/>\nresponding more slowly with non-friendly service.&quot; I&#39;m not sure if that<br/>\nwas the writer&#39;s intent. If so, it could have a negative effect in your<br/>\nrelationships and hinder unschooling. It feels like behavior<br/>\nmodification techniques on some level, to me.&quot;<br/>\n<br/>\nI&#39;ve never required my children to say please. I do let them know that a please is appreciated. We do also call it a &#39;magic word&#39; because it can, out in the big wide world, change a no to yes. Also from the time my children were infants and I was holding up toys for them to choose, I would say &quot;Yes, Please&quot; or &quot;No, Thank you&quot; it has always been part of the response. It is how we speak in our house. When I ask my husband to grab me something while he&#39;s in the kitchen I say &quot;Honey, could you please...&quot; and when he brings me something I say thank you. When I ask the kids to grab something I say &quot;Darling, could you please...&quot; and then &quot;thank you&quot;<br/>\n<br/>\nMy children are never asked to repress their feelings. If they are angry they can be angry, or sad, or whatever. They do occasionally yell at me and I do occasionally yell at them, and then we apologize because yelling at someone is not very loving and I love them. I&#39;ve never asked my children to apologize to me for yelling at me but they always do because I always have to them.<br/>\n<br/>\nI am all for treating my children with loving kindess. I try very hard not to impose consequences upon them. They have complete freedom to eat, sleep, paint, scream and yell and snuggle as they feel the need. I do my best to help them recognize their own feelings and symptoms of being hungry or tired. If they have been playing and are getting cranky I will bring them a snack and notice out loud that sometimes when I get hungry I also get grumpy. When they are getting sleepy I say &quot;Hey&#39; you seem to be yawning and rubbing your eyes, are you feeling sleepy? do you want to go to bed and snuggle or do you want to rest out here in the living room?&quot; when they are getting angry I say &quot;My your voice is getting loud and your hands are clenched into balls you seem angry.Can I help you with something?&quot;<br/>\n<br/>\nContext is very important when we have these discussions. Behavior modification techniques were developed from watching cause and effect during interpersonal relationships between people. Behavior modification techniques fail because they take the underlying respect and love that drove those natural behaviors and distorts it with manipulation.<br/>\n<br/>\nI want to address the topic of natural consequences. If you change the natural consequence of your childs action in the name of &quot;safety&quot; or &quot;respect&quot; are you really unschooling them? Or are you creating a false sense of the world around them just as surely as if you had created a punishment for them for something you felt was out of line?<br/>\n<br/>\nI have gone out of my way to surround myself and my children with people who treat us with kindness and respect. This has occured naturally as a response to not allowing people to treat me with what I believe is abuse. I have done this so effectively that on the chance encounter I have with someone who believes that saying &quot;Hey Jerkface, Whatcha been up to?&quot; is a proper way to great friends or family member I am shocked and appalled. If it weren&#39;t for those random encounters I would have forgotten that some people use abusive language and hitting each other as terms of endearment. I wonder if this bubble is appropriate or if like the Prince/Princess kept in the castle my children will feel horribly mislead as to the reality of the world at large?<br/>\n<br/>\n<br/>\nLove and Laughter,<br/>\n<br/>\nAmy<br/>\n<br/>\nsnugglebugg.com/sagepixie <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238708257","msgId":39255,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyM2I3MSsyN2psQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdxdTg1bStjbG41QGVHcm91cHMuY29tPg=="},"prevInTopic":39254,"nextInTopic":39256,"prevInTime":39254,"nextInTime":39256,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"The dr. said for her to say the magic word.  I told him that we didn t believe in a magic word, but that we modeled ways to ask and that that was it. ****** I","messageBody":"<div id=\"ygrps-yiv-624468455\">The dr. said for her to say the magic word.  I told him that we didn&#39;t believe in a magic word, but that we modeled ways to ask and that that was it.  <br/>\n<br/>\n******<br/>\nI have a problem with the statement &quot;we don&#39;t believe in a magic word&quot;.  YOU don&#39;t believe in a magic word.  But you&#39;re doctor does. What about Abracadabra? Is that a magic word? Who knows what your daughter thinks of magic words.  <br/>\n<br/>\nI simply would have said something like &quot;oh... I don&#39;t think I&#39;ve ever referred to it that way, she might not know what your asking.&quot;  You know, or let her know that he was asking her to say please.  Really it is up to your daughter whether she wants to say please or not.  When you said &quot;we don&#39;t believe&quot; you projected onto her that it would not be good to say &quot;please&quot; even though she may have been perfectly fine with his request.  I suppose it depends how badly she wanted that sticker.  <br/>\n<br/>\nThe doctor wasn&#39;t asking you what you believe.  He was asking your daughter to say please.  As condescending as it may have seemed to you, it is very common behavior in society and you will likely come across it again.  <br/>\n<br/>\nYou should be helping your daughter make choices based on information.  &quot;Dr. is asking you to say please if you want his sticker&quot;.  If she doesn&#39;t want to say please, that is her right.  If he doesn&#39;t want to give up the sticker, that is his.  While it does seem silly to me for the doctor to require a please, you really complicated what sounds like a very simple situation. <br/>\n******</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238705502","msgId":39254,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBNTNFNkI5ODEwNzRCRDhCOUVBQ0IzNjQ3NkMyMUM0QGJpZ3N1cnByaXNlPg==","referencesHeader":"PDEyMzg1Nzk0NjYuNDI0Ljk0NzQyLm00NUB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":39251,"nextInTopic":39255,"prevInTime":39253,"nextInTime":39255,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"***This dr. has too many positives to get rid of him, but he wasn t respectful of dd.*** And if you tried to argue him out of his belief that wasn t respectful","messageBody":"<div id=\"ygrps-yiv-860105708\">***This dr. has too many positives to get rid of him, but he wasn&#39;t respectful of dd.*** <br/>\n<br/>\nAnd if you tried to argue him out of his belief that wasn&#39;t respectful either. <br/>\n<br/>\nIt&#39;s his sticker, and if you want it, you get it under his conditions.   Other people don&#39;t *have to* give you or your daughter gifts or rewards under *your* conditions.   There is no part of the unschooling philosophy that exempts unschoolers or their kids from common courtesy. &lt;g&gt;<br/>\n<br/>\n***Any ideas on how to deal with this issue in the future (it&#39;s happened before, it just really persisted for too long). ***<br/>\n<br/>\nTell your daughter that if she wants a sticker, the doctor expects her to say &quot;please.&quot;   It&#39;s a good thing to know as most of the people she will meet her whole life long will have a similar expectation.     <br/>\n<br/>\nThe subject line is &quot;forcing a &quot;please...&quot;   There was no force.  She could have declined the sticker.  (In which case it would have been polite to say &quot;no, thank you.&quot; )&lt;g&gt;<br/>\n<br/>\nYou might stop and get some stickers on your way to the doctor&#39;s office next time so that a sticker from the doctor isn&#39;t an issue. <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238683388","msgId":39251,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyMml0cytlajJsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc3MDM2My4xNzExOS5xbUB3ZWI1MjAwOS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":39249,"nextInTopic":39254,"prevInTime":39250,"nextInTime":39252,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"~~He didn t force her to say something she didn t want to. Not giving her a sticker is not forcing anything, it s withholding.~~ I should have said TRYING to","messageBody":"<div id=\"ygrps-yiv-1933613124\">~~He didn&#39;t force her to say something she didn&#39;t want to. Not giving her a sticker is not forcing anything, it&#39;s withholding.~~<br/>\n<br/>\n<br/>\nI should have said &quot;TRYING to force it&quot;. Bribery isn&#39;t a great way to &quot;teach&quot; manners. <br/>\n<br/>\nIf you&#39;re here to defend mainstream treatment of children, be prepared for an in-depth discussion. This list exists to examine the treatment of children and discuss ways that can foster MORE respect, more kindness and more partnership oriented relationships with children.<br/>\n<br/>\nTrying to force a &quot;please&quot; is so rude really. I&#39;m trying to think of a SINGLE incident as an adult, in which someone tried to make me say &quot;please&quot; for any reason whatsover. I can&#39;t think of ONE.<br/>\n<br/>\nAt work, if I want a mint that a co-worker might have (thinking of an example that comes up frequently) the exchange usually goes something like: &quot;Hey Misty, can I have one of your mints?&quot;<br/>\n&quot;sure, go ahead&quot;<br/>\n&quot;Thanks!&quot;<br/>\n<br/>\nNObody manipulates anyone to ask a certain way. It&#39;s really NOT acceptable for adults to treat each other that way in our society. If an adult withheld something from another adult and tried to extract a &quot;please&quot; it would seem VERY strange.<br/>\n<br/>\nChildren are often treated as inferior beings, who need to be molded and &quot;taught&quot; but we&#39;re here to talk about a different way to BE and live with children. Trying to manipulate manners is just one such thing we question and try to find better solutions for.<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238682840","msgId":39249,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyMmljbytsbW5uQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ5ZDRiODk3LjE2MDc4ZTBhLjM1MTcuZmZmZjlhYTRAbXguZ29vZ2xlLmNvbT4="},"prevInTopic":39248,"nextInTopic":39251,"prevInTime":39248,"nextInTime":39250,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"~~The above quote struck me as similar to I reward good behavior with faster and more friendly service, and punish poor behavior by responding more slowly","messageBody":"<div id=\"ygrps-yiv-381904903\">~~The above quote struck me as similar to &quot;I reward good behavior with faster and more friendly service, and punish poor behavior by responding more slowly with bnon-friendly service.&quot; ~~<br/>\n<br/>\n<br/>\nI agree Brad.<br/>\nOften the child who is grumpy or acting &quot;rudely&quot; is the child that needs the most kindness, the most patient/friendly parent. Rewards and punishments are harmful and aren&#39;t the best way to foster healthy relationships.<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":291997784,"authorName":"Brad Holcomb","from":"&quot;Brad Holcomb&quot; &lt;list.brad@...&gt;","profile":"bholcomb48","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238677646","msgId":39247,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5ZDRiODk3LjE2MDc4ZTBhLjM1MTcuZmZmZjlhYTRAbXguZ29vZ2xlLmNvbT4=","inReplyToHeader":"PDk5NTI1Ni41MTY5LnFtQHdlYjUyMDEyLm1haWwucmUyLnlhaG9vLmNvbT4=","referencesHeader":"PGdxdTg1bStjbG41QGVHcm91cHMuY29tPiA8OTk1MjU2LjUxNjkucW1Ad2ViNTIwMTIubWFpbC5yZTIueWFob28uY29tPg=="},"prevInTopic":39245,"nextInTopic":39248,"prevInTime":39246,"nextInTime":39248,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"... How do you require them to speak to you nicely?  If they re not in the mood to be nice, you don t give them what they ask?  You give it to them, but with","messageBody":"<div id=\"ygrps-yiv-2127461508\"><blockquote><span title=\"ireply\">&gt; I do not require my children to ALWAYS say please to me when asking <br/>\n&gt; for something, but I do require that they speak to me nicely. <br/>\n<br/>\n<br/>\n </span></blockquote>How do you &quot;require&quot; them to speak to you nicely?  If they&#39;re not in the mood to be nice, you don&#39;t give them what they ask?  You give it to them, but with a reminder to ask nicely next time?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This is my personal standard. It is not child specific. However, <br/>\n&gt; when someone asks me to do something for them and says please <br/>\n&gt; they do get faster friendly service from me.<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;ve noticed that when my 4 y/o son is in a mood where he&#39;s less likely to say Please or Thank You, or is simply busy with his play or other things and too distracted to say Please, that&#39;s the time that me acting *more* quickly and *more* friendly when he asks for something strengthens our relationship and keeps communication open and flowing.  Behavior is communication of my son&#39;s internal world, so I have no desire to squelch negativity or mold him to act the way I want.<br/>\n<br/>\nThe above quote struck me as similar to &quot;I reward good behavior with faster and more friendly service, and punish poor behavior by responding more slowly with non-friendly service.&quot;   I&#39;m not sure if that was the writer&#39;s intent.  If so, it could have a negative effect in your relationships and hinder unschooling.  It feels like behavior modification techniques on some level, to me.<br/>\n<br/>\n-=b.</div>","specialLinks":[]},{"userId":193064123,"authorName":"N CONFER","from":"N CONFER &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238674857","msgId":39245,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0ODgyMy41MDEzLnFtQHdlYjgzODE2Lm1haWwuc3AxLnlhaG9vLmNvbT4="},"prevInTopic":39241,"nextInTopic":39247,"prevInTime":39244,"nextInTime":39246,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"Oh, I like this solution! No thanks, we have our own. Much better than the answer I was thinking of -- telling the doctor where to stick his sticker. Nance ","messageBody":"<div id=\"ygrps-yiv-1436355628\">Oh, I like this solution! &quot;No thanks, we have our own.&quot; <br/>\n<br/>\nMuch better than the answer I was thinking of -- telling the doctor where to stick his sticker.<br/>\n<br/>\nNance<br/>\n<br/>\n*********<br/>\n<br/>\n<br/>\nMarla~<br/>\n<br/>\n<br/>\n<br/>\nWhat if you bring your *own* stash of stickers, and at the <br/>\n<br/>\nend of a next visit, sweetly offer one to dd?  <br/>\n<br/>\n<br/>\n<br/>\nYMMV,<br/>\n<br/>\n<br/>\n<br/>\nKelly Sturman<br/>\n<br/>\nhttp://kelly- livingjoyfully. blogspot. com<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":139413400,"authorName":"Amy","from":"Amy &lt;quinlonsma@...&gt;","profile":"quinlonsma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238645739","msgId":39248,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3MDM2My4xNzExOS5xbUB3ZWI1MjAwOS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGdyMTR1cisxZnZyQGVHcm91cHMuY29tPg=="},"prevInTopic":39247,"nextInTopic":39249,"prevInTime":39247,"nextInTime":39249,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"She didn t ask for the gift, he offered it yet wanted a forced please along with it...not much of a gift is it? That s not how I read the story from the","messageBody":"<div id=\"ygrps-yiv-418720886\">&quot;She didn&#39;t ask for the gift, he offered it yet wanted a forced &quot;please&quot; along with it...not much of a gift is it?&quot;<br/>\n<br/>\nThat&#39;s not how I read the story from the original poster. If he had offered her the sticker then she wouldn&#39;t be asking for it at all, she would be in the position to say &quot;Thank you for the gift&quot;<br/>\n<br/>\nOriginal poster quote <br/>\n&quot;my dd said she wanted a sticker (as is the normal ending of every visit). The dr. said for her to say the magic word. I told him that we didn&#39;t believe in a magic word, but that we modeled ways to ask and that that was it. He persisted and wouldn&#39;t give her a sticker unless she asked &quot;nicely.&quot; This went back and forth several times (I&#39;m talking several minutes) until he finally gave me a sticker for asking nicely.&quot;<br/>\n<br/>\n*******<br/>\n<br/>\n&quot;You don&#39;t see a problem with forcing a child to say something when they<br/>\ndon&#39;t feel like it? REally? If it&#39;s ok to treat a child that way, they<br/>\nit would be acceptable to treat an adult that way. YOu don&#39;t see adults<br/>\nholding things out and saying &quot;say please and I&#39;ll give it to you&quot;.<br/>\n<br/>\nIcky.&quot;<br/>\n<br/>\nHe didn&#39;t force her to say something she didn&#39;t want to. Not giving her a sticker is not forcing anything, it&#39;s withholding.<br/>\nHe did give the sticker to the Mother after she asked him politely.<br/>\nIt is common for people to treat both adults and children in this way. It&#39;s called manipulation and it&#39;s rife in our society.<br/>\nI do see adults hold things out and say &quot;Say please and I&#39;ll give it to you.&quot; those adults are being condescending and that&#39;s on the gracious end of manipulation. Usually an adult who is demanding and rude is not given the courtesy of a reminder to be polite they are simply told &quot;No&quot;.<br/>\n<br/>\n*******<br/>\n<br/>\n&quot;I certainly wouldn&#39;t say &quot;please&quot; if someone tried to force it upon me!<br/>\n<br/>\nChildren learn these societal expectations just fine...eventually.<br/>\nBeing treated rudely in order to learn manners is ridiculous. People<br/>\nreally should think more about how they&#39;d treat an adult friend and if<br/>\nit would seem uncomfortable to treat a friend that way, don&#39;t treat a<br/>\nchild in the same manner. <br/>\n<br/>\n<br/>\n<br/>\nNot because children are adults, nor should they be expected to<br/>\nact/think as such. But because they deserve the same respect and<br/>\ndignity as adults.&quot;<br/>\n<br/>\nYou would be making an informed decision. You are completely aware of the inherent social contract in the community you live in. You can also discern when a &quot;Please&quot; is appropriate or not and when someone is aggressively manipulating you. Again force and withholding two different things. Children are still learning how to navigate proper etiquette in society and therefore are given more opportunities for learning and practice than an adult is. They are given a grace period that an adult has already passed.<br/>\n<br/>\nI think our major disagreement isn&#39;t in the Childs behavior but in the Doctors. I see his request for her to say please as gentle reminder, a courtesy, teaching her that there is a way to phrase her desires that will garner the help she wants in reaching her goals.<br/>\n<br/>\nYou see it as overly manipulative and rude. As nether of us was actually there it&#39;s impossible to say who&#39;s right.<br/>\n<br/>\nWhen my children tell me; &quot;I want ice cream.&quot; I say &quot;Great! Thanks for telling me&quot; IF there&#39;s ice cream in the freezer they are welcome to it. If there&#39;s not or they need help, they come back to me and ASK &quot;Can you help me get ice cream?&quot; <br/>\nA statement of want is not the same as a request for help. <br/>\nIF my children say &quot;Get me ice cream.&quot; or in Oobie speak &quot;ICE CREAM &lt;point point&gt;&quot; I say &quot;I&#39;m not going to help you when you speak to me like that. Would you like to try again?&quot;<br/>\nYes, both of us are being manipulative, not in a bad way, in a learning way. They are manipulating me into handing them ice cream and I am manipulating them into speaking to me in a way fitting of a person they love and respect. I speak to them with exactly the same love and respect. Kids do what works. Fortunately for my children what works in my house also works out in the world at large. <br/>\n<br/>\n<br/>\nLove and Laughter,<br/>\n<br/>\nAmy<br/>\n<br/>\nsnugglebugg.com/sagepixie <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":77228268,"authorName":"Marla B.","from":"&quot;Marla B.&quot; &lt;marla@...&gt;","profile":"hilltowner4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238636780","msgId":39241,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyMTVkYys2YWJwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdxdWlpMSs3b3FhQGVHcm91cHMuY29tPg=="},"prevInTopic":39240,"nextInTopic":39245,"prevInTime":39240,"nextInTime":39242,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"Awesome idea, Kelly!  That s something I will definitely do next time. Thanks! Marla","messageBody":"<div id=\"ygrps-yiv-2128942846\">Awesome idea, Kelly!  That&#39;s something I will definitely do next time.<br/>\n<br/>\nThanks!<br/>\n<br/>\nMarla<br/>\n<br/>\n<br/>\n<br/>\na--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;kelly_sturman&quot; &lt;kelly_sturman@...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; Marla~<br/>\n&gt; <br/>\n&gt; What if you bring your *own* stash of stickers, and at the <br/>\n&gt; end of a next visit, sweetly offer one to dd?  <br/>\n&gt; <br/>\n&gt; YMMV,<br/>\n&gt; <br/>\n&gt; Kelly Sturman<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://kelly-livingjoyfully.blogspot.com\">http://kelly-livingjoyfully.blogspot.com</a><br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Marla B.&quot; &lt;marla@&gt; wrote:<br/>\n&gt; &gt; Any ideas on how to deal with this issue in the future (it&#39;s happened before, it just really persisted for too long).  I tried to explain our philosophy, but didn&#39;t do the best job of it.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Thanks!<br/>\n&gt; &gt; <br/>\n&gt; &gt; Marla<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238636315","msgId":39240,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyMTR1cisxZnZyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk5NTI1Ni41MTY5LnFtQHdlYjUyMDEyLm1haWwucmUyLnlhaG9vLmNvbT4="},"prevInTopic":39239,"nextInTopic":39241,"prevInTime":39239,"nextInTime":39241,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"~~ I don t see the problem here. The Doctor had a prerequisite for giving out presents; that he be asked in a manner he felt was polite. Specifically, for","messageBody":"<div id=\"ygrps-yiv-119768417\">~~<br/>\nI don&#39;t see the problem here.<br/>\n<br/>\nThe Doctor had a prerequisite for giving out presents; that he be asked in a manner he felt was polite. Specifically, for people to say &#39;please&#39; when asking him for a gift.<br/>\n<br/>\nYour daughter didn&#39;t say please. She still wanted the sticker.~~<br/>\n<br/>\nShe didn&#39;t ask for the gift, he offered it yet wanted a forced &quot;please&quot; along with it...not much of a gift is it?<br/>\n<br/>\nYou don&#39;t see a problem with forcing a child to say something when they don&#39;t feel like it? REally? If it&#39;s ok to treat a child that way, they it would be acceptable to treat an adult that way. YOu don&#39;t see adults holding things out and saying &quot;say please and I&#39;ll give it to you&quot;.<br/>\nIcky.<br/>\n<br/>\nThe best thing in that situation would have been for the doctor to accept the mother&#39;s &quot;please&quot; in place of the child&#39;s. The child is having the societal expectation modeled yet being respected for exactly where she was at in the moment. I certainly wouldn&#39;t say &quot;please&quot; if someone tried to force it upon me!<br/>\n<br/>\nChildren learn these societal expectations just fine...eventually. Being treated rudely in order to learn manners is ridiculous.  People really should think more about how they&#39;d treat an adult friend and if it would seem uncomfortable to treat a friend that way, don&#39;t treat a child in the same manner. <br/>\n<br/>\nNot because children are adults, nor should they be expected to act/think as such. But because they deserve the same respect and dignity as adults.<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":124256069,"authorName":"Laurie Wolfrum","from":"Laurie Wolfrum &lt;alohabun@...&gt;","profile":"alohabun","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238631030","msgId":39239,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyOTM1Ny40ODcyNi5xbUB3ZWI1MTkwOC5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":39237,"nextInTopic":39240,"prevInTime":39238,"nextInTime":39240,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"It seems your child s dr will continue to require a please for the sticker.  Although I totally agree with parents modeling manners (not telling them to","messageBody":"<div id=\"ygrps-yiv-1520271929\">It seems your child&#39;s dr will continue to require a &quot;please&quot; for the sticker.  Although I totally agree with parents modeling &quot;manners&quot; (not telling them to say please/thank you) there are people out there in our culture who will require a &quot;please&quot; in order to get something (these people usually seem to do it to kids which is so insulting).  What can we do?  We can show our kids how we handle situations like this where people have different opinions, values, etc than ourselves.  <br/>\n<br/>\nExplain that many people in our culture like using/hearing a thank you and please and how some people expect it (especially with kids for some reason....perhaps they think they are &quot;teaching&quot; our kids manners??  And yet demanding children to say certain words is not teaching anything kind!).  Others are happy to provide or help by a sincere request even w/o a &quot;please.&quot;  Before the next appointment go over that again and explain to your daughter that her dr requires a &quot;please&quot; to get a sticker.  Explain why you don&#39;t like the dr doing that.  But do give your child a choice whether or not she wants to jump through hoops to get the sticker.  You could even tell your daughter that *you* would decide not to have a sticker if it was required that you say please.  You could even tell your daughter that you will buy her a special sticker after the appointment instead if she wishes or just bring one to the appointment.  <br/>\n<br/>\nLaurie</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Re: Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238628908","msgId":39228,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkwNDAxMTYzNWg0OTY1ODVmN245NzM5MGM0YzhjYWVmNjY5QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdyMHQzMCt2ZjU3QGVHcm91cHMuY29tPg==","referencesHeader":"PDQ5ZDM4Mzg0LjE0YmU2MDBhLjUxNzIuNzkzN0BteC5nb29nbGUuY29tPgkgPGdyMHQzMCt2ZjU3QGVHcm91cHMuY29tPg=="},"prevInTopic":39227,"nextInTopic":39230,"prevInTime":39227,"nextInTime":39229,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"... I don t feel I was arguing with him, I was just supporting my dd s needs and just giving him some insight into how we did things differently. I wasn t ","messageBody":"<div id=\"ygrps-yiv-438562150\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Having my child as an audience while<br/>\n&gt; I argue with someone is Modeling how to argue with someone.<br/>\n<br/>\n </span></blockquote>I don&#39;t feel I was arguing with him, I was just supporting my dd&#39;s needs and<br/>\njust giving him some insight into how we did things differently. I wasn&#39;t<br/>\nasking him to change his beliefs (I would never do that of anyone unless<br/>\nthey were physically hurting someone or something like that), but maybe<br/>\nrespect those of me and my 5 yo., even if ours are different.<br/>\n<br/>\n*** I am thinking that there are a few other ways to support your dd without<br/>\ninvolving the doctor. One being to speak directly to your child about the<br/>\nsituation. Tell you child what the doctor expects of her. Allow her to work<br/>\nthrough and decide whether she wants to performs as asked.<br/>\n<br/>\nI would not let it drag on between them too long. She is too young and needs<br/>\nyou guidance. I think living your principles come through loud and clear, no<br/>\nneed to lecture the doctor (or anyone)<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Putting energy into converting another person to my beliefs and ways seems<br/>\n&gt; like energy better spent on inquiring into my own reaction to what I see<br/>\n </span></blockquote>in<br/>\n<blockquote><span title=\"ireply\"> &gt; them. Every person in my world is a mirror into myself. I have spent a<br/>\n&gt; *TON* of time in my life trying to Fix the Mirror by helping the other<br/>\n&gt; person see the error of their way, just as you were doing with your family<br/>\n&gt; doctor. Turns out, it&#39;s none of my business what they believe and how they<br/>\n&gt; act, and my attempts to Fix the Mirror were simply ways to avoid looking<br/>\n </span></blockquote>at<br/>\n<blockquote><span title=\"ireply\"> &gt; my own inner Self, blaming the other for the image of me that I wasn&#39;t<br/>\n&gt; enjoying.<br/>\n<br/>\n </span></blockquote>I totally agree. I think everyone has a right to their own beliefs, that&#39;s<br/>\nfine with me. Some of my closest friends are mom&#39;s of public schoolers. I<br/>\ndon&#39;t care what they believe, as long as it isn&#39;t hurting someone in an<br/>\nabusive way. I&#39;m also a unitarian universalist, so I really am open to<br/>\neveryones ideals. I don&#39;t want people forcing theirs on me and I wouldn&#39;t<br/>\nforce mine on them. As I said, I don&#39;t think I was trying to convert him,<br/>\njust giving him insight so he may better understand me and my child.<br/>\n<br/>\n*** perhaps this would be better done outside the heat of the moment. I<br/>\nwould have intervened and spoke directly to my child. I find it more helpful<br/>\nto guide my children through understanding other peoples ways then trying to<br/>\nget them to understand mine. If it is really bad (and you say it isn&#39;t) I<br/>\nend the relationship.<br/>\n<br/>\nFaith<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238628383","msgId":39227,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkwNDAxMTYyNm01ZjQzMmQ3N3Y2ZWE1MjBhYjIwMjA2ZjBmQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdxdTg1bStjbG41QGVHcm91cHMuY29tPg==","referencesHeader":"PGdxdTg1bStjbG41QGVHcm91cHMuY29tPg=="},"prevInTopic":39226,"nextInTopic":39228,"prevInTime":39226,"nextInTime":39228,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"Today, my 5 yo. had a dr.s visit for an eye irritation (and no, it was not from falling off the roof LOL, just kidding). We ve been going to this dr. since my","messageBody":"<div id=\"ygrps-yiv-503993948\">Today, my 5 yo. had a dr.s visit for an eye irritation (and no, it was not<br/>\nfrom falling off the roof LOL, just kidding). We&#39;ve been going to this dr.<br/>\nsince my first child was 7 days old. We really like him and his attitude.<br/>\nHe&#39;s very gentle and open-minded about most things (such as vaccines and<br/>\nsuch). He also has no wait, is nearby (living out in the country this is<br/>\nimpt.), and gives you all the time you need (really). However, today after<br/>\nabout 20 minutes or more of eye tests (covering eyes, reading letters, etc.)<br/>\nmy dd said she wanted a sticker (as is the normal ending of every visit).<br/>\nThe dr. said for her to say the magic word. I told him that we didn&#39;t<br/>\nbelieve in a magic word, but that we modeled ways to ask and that that was<br/>\nit. He persisted and wouldn&#39;t give her a sticker unless she asked &quot;nicely.&quot;<br/>\nThis went back and forth several times (I&#39;m talking several minutes) until<br/>\nhe finally gave me a sticker for asking nicely.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n***I agree that  saying &quot;please&quot; and being polite and respectful is a<br/>\nwonderful way to be.  I try my best to be that way. I hope that my children<br/>\nsee that and choose to be that way as well. I find it very helpful in<br/>\ncommunicating with others. I want them to succeed and feel comfortable<br/>\nrelating socially.<br/>\n<br/>\nI give my children information. I let them know that some people need to<br/>\nhear certain words or phrases to feel respected. &quot;Please&quot; &quot;your welcome&quot;<br/>\n&quot;thank you&quot; etc. I try to help them understand that those are words that<br/>\npeople understand to mean certain things (and I tell them what they mean). I<br/>\ndon&#39;t force or coerce my children into saying them.<br/>\n<br/>\nIn this situation I would have first said &quot;please&quot; for my child or asked the<br/>\nDr. if he meant &quot;please?&quot;<br/>\nIf that didn&#39;t work for the doctor, I would have explained quietly to my<br/>\nchild that some people feel like &quot;please&quot; is a magic word to show them that<br/>\nthe person who wants something is being courteous. I would have allowed my<br/>\nchild to think that over and decide whether they wanted to do that for a<br/>\nsticker. I would have perhaps offered to get my child a sticker elsewhere,<br/>\nif they felt uncomfortable saying &quot;please&quot; in this situation.<br/>\nIf they chose to or not that would have been fine. I would have explained to<br/>\nmy child later in the car or at home more in depth if they wanted or needed<br/>\nme to.<br/>\nAs long as the Dr wasn&#39;t saying anything harmful to my child I would not<br/>\nhave said anything to him. I have always tried to keep things between me and<br/>\nmy kids. I am concerned about my children&#39;s well being not the Dr.&#39;s<br/>\nphilosophies. I don&#39;t try to change people (anymore). I want my children to<br/>\nhave the skills to cope in many situations and I am right there with them<br/>\nthrough each incident.<br/>\n<br/>\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=--=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This dr. has too many positives to get rid of him, but he wasn&#39;t respectful<br/>\n&gt; of dd. Any ideas on how to deal with this issue in the future (it&#39;s happened<br/>\n&gt; before, it just really persisted for too long). I tried to explain our<br/>\n&gt; philosophy, but didn&#39;t do the best job of it.<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>***I think he was condescending in talking like that but I don&#39;t think that<br/>\nhis intentions were to harm her. I am not sure what you were trying to prove<br/>\nby saying anything to him. I may have spoke to him privately but not in<br/>\nfront of my child. I try to be courteous of where people are in there life.<br/>\n<br/>\nIf this were a family member and this happened frequently, I may use a<br/>\ndifferent approach.<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt;<br/>\n </span></blockquote>Thanks<br/>\nFaith<br/>\n<br/>\n<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":77228268,"authorName":"Marla B.","from":"&quot;Marla B.&quot; &lt;marla@...&gt;","profile":"hilltowner4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238628256","msgId":39226,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyMHQzMCt2ZjU3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ5ZDM4Mzg0LjE0YmU2MDBhLjUxNzIuNzkzN0BteC5nb29nbGUuY29tPg=="},"prevInTopic":39225,"nextInTopic":39227,"prevInTime":39225,"nextInTime":39227,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"... I did say please to the dr, but he would only accept it from my dd. ... I don t feel I was arguing with him, I was just supporting my dd s needs and just","messageBody":"<div id=\"ygrps-yiv-391214800\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; Next time, just say Please on behalf of your child and be done with it. <br/>\n<br/>\n </span></blockquote>I did say please to the dr, but he would only accept it from my dd. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Having my child as an audience while<br/>\n&gt; I argue with someone is Modeling how to argue with someone.<br/>\n<br/>\n </span></blockquote>I don&#39;t feel I was arguing with him, I was just supporting my dd&#39;s needs and just giving him some insight into how we did things differently.  I wasn&#39;t asking him to change his beliefs (I would never do that of anyone unless they were physically hurting someone or something like that), but maybe respect those of me and my 5 yo., even if ours are different.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Why do you think the doctor would be interested in hearing, much less<br/>\n&gt; adopting, your philosophy, personal beliefs, and views of how life &quot;should&quot;<br/>\n&gt; work or how people &quot;should&quot; ask for and receive gifts or rewards?<br/>\n<br/>\n </span></blockquote>As I said above, I didn&#39;t need him to adopt my values, though maybe I have to reread my original post, as maybe I implied that, though I didn&#39;t mean to.  I just felt I was helping him by letting him know where my dd was coming from.<br/>\n<br/>\n  Getting<br/>\n<blockquote><span title=\"ireply\"> &gt; into that missionary/preacher/teacher mentality doesn&#39;t serve the doctor, or<br/>\n&gt; you.  And it definitely doesn&#39;t help your child learn how to interact with<br/>\n&gt; others nicely, lovingly, and peacefully.<br/>\n<br/>\n </span></blockquote>I admit, you&#39;re pointing out the missionary, preacher/ teacher mentality is helpful.  I think I did speak of these things in a kind and thoughtful way, though. But I will consider this more in the future.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Putting energy into converting another person to my beliefs and ways seems<br/>\n&gt; like energy better spent on inquiring into my own reaction to what I see in<br/>\n&gt; them.   Every person in my world is a mirror into myself.  I have spent a<br/>\n&gt; *TON* of time in my life trying to Fix the Mirror by helping the other<br/>\n&gt; person see the error of their way, just as you were doing with your family<br/>\n&gt; doctor.  Turns out, it&#39;s none of my business what they believe and how they<br/>\n&gt; act, and my attempts to Fix the Mirror were simply ways to avoid looking at<br/>\n&gt; my own inner Self, blaming the other for the image of me that I wasn&#39;t<br/>\n&gt; enjoying.  <br/>\n<br/>\n </span></blockquote>I totally agree.  I think everyone has a right to their own beliefs, that&#39;s fine with me.  Some of my closest friends are mom&#39;s of public schoolers.  I don&#39;t care what they believe, as long as it isn&#39;t hurting someone in an abusive way.  I&#39;m also a unitarian universalist, so I really am open to everyones ideals.  I don&#39;t want people forcing theirs on me and I wouldn&#39;t force mine on them.  As I said, I don&#39;t think I was trying to convert him, just giving him insight so he may better understand me and my child.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;A great book to help with more intense personal inquiry is Byron Katie&#39;s<br/>\n&gt; Loving What Is.  <br/>\n<br/>\n </span></blockquote>I agree, it is a wonderful book!<br/>\n<br/>\nThanks for all your ideas!<br/>\n<br/>\nMarla</div>","specialLinks":[]},{"userId":284534827,"authorName":"Jeff Sabo","from":"Jeff Sabo &lt;freeboysdad@...&gt;","profile":"freeboysdad","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238600498","msgId":39236,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1MzI1NC41NTU4Mi5xbUB3ZWI1NTgwNC5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":39232,"nextInTopic":39237,"prevInTime":39235,"nextInTime":39237,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"Wouldn t simply stating something like our family prefers not to put conditions on gifts work? We ve done this plenty of times in similar situations, and","messageBody":"<div id=\"ygrps-yiv-1422236483\">Wouldn&#39;t simply stating something like &quot;our family prefers not to put conditions on gifts&quot; work? We&#39;ve done this plenty of times in similar situations, and it&#39;s hard for the offerer to refute. When we do this, Idon&#39;t see it as an attempt to convince or influence the doctor/teacher/cashier/whatever about the validity of my belief system, but as a simple statement of our beliefs. I should be able to tell someone &quot;I don&#39;t eat meat&quot; without getting into an argument about the benefits of being a vegetarian. <br/>\n<br/>\nPersonally, I wouldn&#39;t want to model &quot;please&quot; and &quot;thank you&quot; unless I was authentically thankful about something; otherwise, it seems a bit manipulative, I think. We&#39;ve been in this exact situation before and have never handled as well initially as we wanted to, but pulling the person aside and telling them that we prefer to gift unconditionally is where we often end up. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Tue, 3/31/09, Marla B. &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marla@...\">marla@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: Marla B. &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marla@...\">marla@...</a>&gt;<br/>\nSubject: [unschoolingbasics] Forcing a &quot;please&quot; or an &quot;ask nicely&quot;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Tuesday, March 31, 2009, 4:15 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nToday, my 5 yo. had a dr.s visit for an eye irritation (and no, it was not from falling off the roof LOL, just kidding). We&#39;ve been going to this dr. since my first child was 7 days old. We really like him and his attitude. He&#39;s very gentle and open-minded about most things (such as vaccines and such). He also has no wait, is nearby (living out in the country this is impt.), and gives you all the time you need (really). However, today after about 20 minutes or more of eye tests (covering eyes, reading letters, etc.) my dd said she wanted a sticker (as is the normal ending of every visit). The dr. said for her to say the magic word. I told him that we didn&#39;t believe in a magic word, but that we modeled ways to ask and that that was it. He persisted and wouldn&#39;t give her a sticker unless she asked &quot;nicely.&quot; This went back and forth several times (I&#39;m talking several minutes) until he finally gave me a sticker for asking nicely. <br/>\n<br/>\nThis dr. has too many positives to get rid of him, but he wasn&#39;t respectful of dd. Any ideas on how to deal with this issue in the future (it&#39;s happened before, it just really persisted for too long). I tried to explain our philosophy, but didn&#39;t do the best job of it.<br/>\n<br/>\nThanks!<br/>\n<br/>\nMarla<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":291997784,"authorName":"Brad Holcomb","from":"&quot;Brad Holcomb&quot; &lt;list.brad@...&gt;","profile":"bholcomb48","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238598524","msgId":39225,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5ZDM4Mzg0LjE0YmU2MDBhLjUxNzIuNzkzN0BteC5nb29nbGUuY29tPg==","inReplyToHeader":"PGdxdTg1bStjbG41QGVHcm91cHMuY29tPg==","referencesHeader":"PGdxdTg1bStjbG41QGVHcm91cHMuY29tPg=="},"prevInTopic":39217,"nextInTopic":39226,"prevInTime":39224,"nextInTime":39226,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"... it. ... Next time, just say Please on behalf of your child and be done with it.  If someone does something nice for your daughter, just say Thank You on","messageBody":"<div id=\"ygrps-yiv-517388136\"><blockquote><span title=\"ireply\">&gt; The dr. said for her to say the magic word. I told him that we didn&#39;t <br/>\n&gt; believe in a magic word, but that we modeled ways to ask and that that was<br/>\n </span></blockquote>it. <br/>\n<blockquote><span title=\"ireply\"> &gt; He persisted and wouldn&#39;t give her a sticker unless she asked &quot;nicely.&quot; <br/>\n&gt; This went back and forth several times (I&#39;m talking several minutes) until<br/>\n<br/>\n&gt; he finally gave me a sticker for asking nicely.<br/>\n<br/>\n<br/>\n </span></blockquote>Next time, just say Please on behalf of your child and be done with it.  If<br/>\nsomeone does something nice for your daughter, just say Thank You on her<br/>\nbehalf, before it even gets to the person saying, &quot;What do you say?&quot; to your<br/>\nchild, prodding them for a Thank You.   That&#39;s Modeling, in my understanding<br/>\nof the word.  I&#39;m Modeling how to ask nicely when I ask my child nicely to<br/>\nget me a glass of water, or to turn down the TV volume, or when I ask my<br/>\nwife nicely to help me cook something.  Having my child as an audience while<br/>\nI argue with someone is Modeling how to argue with someone.<br/>\n<br/>\nWhy do you think the doctor would be interested in hearing, much less<br/>\nadopting, your philosophy, personal beliefs, and views of how life &quot;should&quot;<br/>\nwork or how people &quot;should&quot; ask for and receive gifts or rewards?  Getting<br/>\ninto that missionary/preacher/teacher mentality doesn&#39;t serve the doctor, or<br/>\nyou.  And it definitely doesn&#39;t help your child learn how to interact with<br/>\nothers nicely, lovingly, and peacefully.<br/>\n<br/>\nPutting energy into converting another person to my beliefs and ways seems<br/>\nlike energy better spent on inquiring into my own reaction to what I see in<br/>\nthem.   Every person in my world is a mirror into myself.  I have spent a<br/>\n*TON* of time in my life trying to Fix the Mirror by helping the other<br/>\nperson see the error of their way, just as you were doing with your family<br/>\ndoctor.  Turns out, it&#39;s none of my business what they believe and how they<br/>\nact, and my attempts to Fix the Mirror were simply ways to avoid looking at<br/>\nmy own inner Self, blaming the other for the image of me that I wasn&#39;t<br/>\nenjoying.  My child has witnessed me modeling missionary/preacher/teacher<br/>\nmode far too many times...but less and less lately, thankfully.<br/>\n<br/>\nA great book to help with more intense personal inquiry is Byron Katie&#39;s<br/>\nLoving What Is.  It&#39;s astounding the growth and understanding and healing<br/>\nI&#39;m reaching as I learn to mind my own business and stop trying to show<br/>\nothers I&#39;m right, or more aware, or in any way farther along the path than<br/>\nthey are, in any area of life.  This book has been absolutely essential in<br/>\ndeschooling myself.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Loving-What-Four-Questions-Change/dp/1400045371\">http://www.amazon.com/Loving-What-Four-Questions-Change/dp/1400045371</a><br/>\n<br/>\n<br/>\n-=b.<br/>\n<br/>\n<br/>\n--<br/>\nBrad in Boulder, CO<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://holcombs.org\">http://holcombs.org</a></div>","specialLinks":[]},{"userId":351836297,"authorName":"amandabpearl","from":"&quot;amandabpearl&quot; &lt;amanda@...&gt;","profile":"amandabpearl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238584308","msgId":39237,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdxdmk1aytiZW5oQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdxdTg1bStjbG41QGVHcm91cHMuY29tPg=="},"prevInTopic":39236,"nextInTopic":39239,"prevInTime":39236,"nextInTime":39238,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"Maybe for this specific situation, you could visit the store immediately pre or post visit and let her choose her own stickers, or if you live in a remote area","messageBody":"<div id=\"ygrps-yiv-1150185897\">Maybe for this specific situation, you could visit the store immediately pre or post visit and let her choose her own stickers, or if you live in a remote area where that&#39;s not possible, just keep some stickers around the house for her, and bring them to the visit with you...not sure how to deal with the Dr issue, since you&#39;ve explained it to him before; maybe talk to him about it before the consult begins and not in front of your daughter, so that he doesn&#39;t feel like he&#39;s being &quot;ganged up on&quot; (even though he&#39;s obviously not) or in a power struggle...</div>","specialLinks":[]},{"userId":305056215,"authorName":"kelly_sturman","from":"&quot;kelly_sturman&quot; &lt;kelly_sturman@...&gt;","profile":"kelly_sturman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238551937","msgId":39230,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdxdWlpMSs3b3FhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdxdTg1bStjbG41QGVHcm91cHMuY29tPg=="},"prevInTopic":39228,"nextInTopic":39232,"prevInTime":39229,"nextInTime":39231,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"Marla~ What if you bring your *own* stash of stickers, and at the end of a next visit, sweetly offer one to dd? YMMV, Kelly Sturman ","messageBody":"<div id=\"ygrps-yiv-138183210\">Marla~<br/>\n<br/>\nWhat if you bring your *own* stash of stickers, and at the <br/>\nend of a next visit, sweetly offer one to dd?  <br/>\n<br/>\nYMMV,<br/>\n<br/>\nKelly Sturman<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://kelly-livingjoyfully.blogspot.com\">http://kelly-livingjoyfully.blogspot.com</a><br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Marla B.&quot; &lt;marla@...&gt; wrote:<br/>\n&gt; Any ideas on how to deal with this issue in the future (it&#39;s happened before, it just really persisted for too long).  I tried to explain our philosophy, but didn&#39;t do the best job of it.<br/>\n&gt; <br/>\n&gt; Thanks!<br/>\n&gt; <br/>\n&gt; Marla<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":139413400,"authorName":"Amy","from":"Amy &lt;quinlonsma@...&gt;","profile":"quinlonsma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238551845","msgId":39232,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk5NTI1Ni41MTY5LnFtQHdlYjUyMDEyLm1haWwucmUyLnlhaG9vLmNvbT4=","inReplyToHeader":"PGdxdTg1bStjbG41QGVHcm91cHMuY29tPg=="},"prevInTopic":39230,"nextInTopic":39236,"prevInTime":39231,"nextInTime":39233,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"I don t see the problem here. The Doctor had a prerequisite for giving out presents; that he be asked in a manner he felt was polite. Specifically, for people","messageBody":"<div id=\"ygrps-yiv-1408566769\">I don&#39;t see the problem here. <br/>\n<br/>\nThe Doctor had a prerequisite for giving out presents; that he be asked in a manner he felt was polite. Specifically, for people to say &#39;please&#39; when asking him for a gift.<br/>\n<br/>\nYour daughter didn&#39;t say please. She still wanted the sticker.<br/>\n<br/>\nYou asked him to please give you a sticker, he gave you the sticker, you gave the sticker to your daughter.<br/>\n<br/>\nPoliteness is part of our social contract. He was not rude or mean to your child, he was amiable to you modeling polite behavior to get what your daughter wanted.<br/>\n<br/>\nI do not require my children to ALWAYS say please to me when asking for something, but I do require that they speak to me nicely. This is my personal standard. It is not child specific. However, when someone asks me to do something for them and says please they do get faster friendly service from me. To me, this is human nature and my children have picked up on it.<br/>\n<br/>\nWhen we are out in public and my children want something from someone who seems reticent I will throw out the parental &quot;Remember to ask nicely and say please&quot; and almost without failure the reluctant person happily becomes my partner in modeling polite behavior to my children. <br/>\n<br/>\nI have made it a point while waiting in line, generally out in public and even in movies; to point out children modeling different behaviors and their rates of success in getting what they wanted.<br/>\n<br/>\nI&#39;ve discovered it&#39;s even a common theme in childrens&#39; fairy tales. If you take notice the impolite child often comes to harm.<br/>\n<br/>\nInstructions<br/>\nby Neil Gaiman<br/>\n<br/>\nTouch the wooden gate in the wall you never saw before.<br/>\n<br/>\nSay &quot;please&quot; before you open the latch,<br/>\n<br/>\ngo through,<br/>\n<br/>\nwalk down the path.<br/>\n<br/>\nA red metal imp hangs from the green-painted front door,<br/>\n<br/>\nas a knocker,<br/>\n<br/>\ndo not touch it; it will bite your fingers.<br/>\n<br/>\nWalk through the house. Take nothing. Eat nothing.<br/>\n<br/>\nHowever, if any creature tells you that it hungers,<br/>\n<br/>\nfeed it.<br/>\n<br/>\nIf it tells you that it is dirty,<br/>\n<br/>\nclean it.<br/>\n<br/>\nIf it cries to you that it hurts,<br/>\n<br/>\nif you can,<br/>\n<br/>\nease its pain.<br/>\n<br/>\nFrom the back garden you will be able to see the wild wood.<br/>\n<br/>\nThe deep well you walk past leads to Winter&#39;s realm;<br/>\n<br/>\nthere is another land at the bottom of it.<br/>\n<br/>\nIf you turn around here,<br/>\n<br/>\nyou can walk back, safely;<br/>\n<br/>\nyou will lose no face. I will think no less of you.<br/>\n<br/>\nOnce through the garden you will be in the wood.<br/>\n<br/>\nThe trees are old. Eyes peer from the under-<br/>\n<br/>\ngrowth.<br/>\n<br/>\nBeneath a twisted oak sits an old woman. She may ask for something;<br/>\n<br/>\ngive it to her. <br/>\n<br/>\nShe will point the way to the castle.<br/>\n<br/>\nInside it are three princesses.<br/>\n<br/>\nDo not trust the youngest. Walk on.<br/>\n<br/>\nIn the clearing beyond the castle the twelve months sit about a fire,<br/>\n<br/>\nwarming their feet, exchanging tales.<br/>\n<br/>\nThey may do favors for you, if you are polite.<br/>\n<br/>\nYou may pick strawberries in December&#39;s frost.<br/>\n<br/>\nTrust the wolves, but do not tell them where<br/>\n<br/>\nyou are going.<br/>\n<br/>\nThe river can be crossed by the ferry. The ferry-<br/>\n<br/>\nman will take you.<br/>\n<br/>\n(The answer to his question is this:<br/>\n<br/>\nIf he hands the oar to his passenger, he will be free to<br/>\n<br/>\nleave the boat.<br/>\n<br/>\nOnly tell him this from a safe distance.)<br/>\n<br/>\nIf an eagle gives you a feather, keep it safe.<br/>\n<br/>\nRemember: that giants sleep too soundly; that<br/>\n<br/>\nwitches are often betrayed by their appetites;<br/>\n<br/>\ndragons have one soft spot, somewhere, always;<br/>\n<br/>\nhearts can be well-hidden,<br/>\n<br/>\nand you betray them with your tongue.<br/>\n<br/>\nDo not be jealous of your sister.<br/>\n<br/>\nKnow that diamonds and roses<br/>\n<br/>\nare as uncomfortable when they tumble from<br/>\n<br/>\none&#39;s lips as toads and frogs:<br/>\n<br/>\ncolder, too, and sharper, and they cut.<br/>\n<br/>\nRemember your name.<br/>\n<br/>\nDo not lose hope  what you seek will be found.<br/>\n<br/>\nTrust ghosts. Trust those that you have helped<br/>\n<br/>\nto help you in their turn.<br/>\n<br/>\nTrust dreams.<br/>\n<br/>\nTrust your heart, and trust your story.<br/>\n<br/>\nWhen you come back, return the way you came.<br/>\n<br/>\nFavors will be returned, debts will be repaid.<br/>\n<br/>\nDo not forget your manners.<br/>\n<br/>\nDo not look back.<br/>\n<br/>\nRide the wise eagle (you shall not fall).<br/>\n<br/>\nRide the silver fish (you will not drown).<br/>\n<br/>\nRide the grey wolf (hold tightly to his fur).<br/>\n<br/>\nThere is a worm at the heart of the tower; that is<br/>\n<br/>\nwhy it will not stand.<br/>\n<br/>\nWhen you reach the little house, the place your journey started,<br/>\n<br/>\nyou will recognize it, although it will seem<br/>\n<br/>\nmuch smaller than you remember.<br/>\n<br/>\nWalk up the path, and through the garden gate<br/>\n<br/>\nyou never saw before but once.<br/>\n<br/>\nAnd then go home. Or make a home.<br/>\n<br/>\nAnd rest.<br/>\n<br/>\nLove and Laughter,<br/>\n<br/>\nAmy<br/>\n<br/>\nsnugglebugg.com/sagepixie <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":77228268,"authorName":"Marla B.","from":"&quot;Marla B.&quot; &lt;marla@...&gt;","profile":"hilltowner4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Forcing a &quot;please&quot; or an &quot;ask nicely&quot;","postDate":"1238541302","msgId":39217,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdxdTg1bStjbG41QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":39225,"prevInTime":39216,"nextInTime":39218,"topicId":39217,"numMessagesInTopic":0,"msgSnippet":"Today, my 5 yo. had a dr.s visit for an eye irritation (and no, it was not from falling off the roof LOL, just kidding).  We ve been going to this dr. since my","messageBody":"<div id=\"ygrps-yiv-1584716862\">Today, my 5 yo. had a dr.s visit for an eye irritation (and no, it was not from falling off the roof LOL, just kidding).  We&#39;ve been going to this dr. since my first child was 7 days old.  We really like him and his attitude.  He&#39;s very gentle and open-minded about most things (such as vaccines and such).  He also has no wait, is nearby (living out in the country this is impt.), and gives you all the time you need (really).  However, today after about 20 minutes or more of eye tests (covering eyes, reading letters, etc.) my dd said she wanted a sticker (as is the normal ending of every visit).  The dr. said for her to say the magic word.  I told him that we didn&#39;t believe in a magic word, but that we modeled ways to ask and that that was it.  He persisted and wouldn&#39;t give her a sticker unless she asked &quot;nicely.&quot;  This went back and forth several times (I&#39;m talking several minutes) until he finally gave me a sticker for asking nicely.  <br/>\n<br/>\nThis dr. has too many positives to get rid of him, but he wasn&#39;t respectful of dd.  Any ideas on how to deal with this issue in the future (it&#39;s happened before, it just really persisted for too long).  I tried to explain our philosophy, but didn&#39;t do the best job of it.<br/>\n<br/>\nThanks!<br/>\n<br/>\nMarla</div>","specialLinks":[]}],"prevTopicId":39235,"nextTopicId":39259}}