{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":299628024,"authorName":"Mark V Fullerton","from":"&quot;Mark V Fullerton&quot; &lt;markvictorfullerton@...&gt;","profile":"markvictorfullerton","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: ???&#39;s, how to develop faith about unschooling math....","postDate":"1201209663","msgId":28981,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZuYXZmditpa3A1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZtcWlnMStuaDNlQGVHcm91cHMuY29tPg=="},"prevInTopic":28944,"nextInTopic":0,"prevInTime":28980,"nextInTime":28982,"topicId":28906,"numMessagesInTopic":0,"msgSnippet":"You might want to make a distinction between having faith and feeling confident . I would describe confidence as arising from having evidence that you are","messageBody":"<div id=\"ygrps-yiv-1414645587\">You might want to make a distinction between &quot;having faith&quot; <br/>\nand &quot;feeling confident&quot;.<br/>\nI would describe confidence as arising from having evidence that you <br/>\nare able to move toward or create the kind of life that you want; <br/>\nhaving faith means to me that you have the belief that the nature of <br/>\nlife is such that whatever happens or comes your way, you will be <br/>\nable to derive at least some good from it.<br/>\nI understand the &quot;progress reports&quot; that you are being asked for - <br/>\nwhile not actually requiring you to provide &quot;evidence of progress&quot; - <br/>\nas suggestive that the authorities are actually already partly <br/>\nconfident that you can provide a healthy learning environment for <br/>\nyour children; all they are really trying to do is check <br/>\nfor &quot;negative evidence&quot;, something that would raise alarms, like a <br/>\nparent that refuses to communicate with authorities and isolates <br/>\ntheir children from any contact with others. By presuming this kind <br/>\nof positive intent on their part it becomes easier and more <br/>\ncomfortable to communicate with them; you are no longer trying to <br/>\njustify yourself, but rather simply seeking to reassure them. And <br/>\nsince the person you will be dealing with is likely to have <br/>\nrelatively little experience with unschooling, they may actually be <br/>\nquite fascinated by whatever experiences you would be willing to <br/>\nshare with them. This then could actually become an experience you <br/>\ncould look forward to - its an opportunity to practice expressing <br/>\nwhat the philosophy of unschooling is to someone unfamiliar with it, <br/>\nand perhaps succeed in bringing one more person into the unschooling <br/>\ncommunity. Personally I often begin with the analogy: think of a <br/>\npublic school classroom being improved by dramatically reducing the <br/>\nclass sizes, and introducing individualized instruction, while <br/>\nproviding much greater access to the world and time for uninterrupted <br/>\nmusing, pondering, and reflection. Put it that way and everyone will <br/>\nfind it attractive, but seemingly impossible to provide.Then point <br/>\nout how similar that is to the kind of learning environment that you <br/>\nare attempting to provide for your own children, together perhaps <br/>\nwith other homeschooling parents. They&#39;re not likely to &quot;get&quot; <br/>\nimmediately the distinction between teaching and sharing/facilitating <br/>\ninterests, but you don&#39;t need to bring them quite that far to feel <br/>\nthat you&#39;ve met a possible friend rather than an adversary.<br/>\nI might add that many people who are not unschooling experience the <br/>\nword as rather negative and challenging or threatening - I choose to <br/>\nexplain it by saying that it just means the process of letting go of <br/>\nharmful assumptions about education and harmful attitudes toward <br/>\nchildren.<br/>\nI very much doubt that this was your main source of anxiety and <br/>\nconfusion, but by addressing this one issue fully and completely I <br/>\nthink you may be more able to tune in to the nature of your anxiety <br/>\nconnected to learning and teaching arithmetic.<br/>\nI might add that I once saw on Oprah three adults who had successful <br/>\ncareers and lives and who were now confessing that they never learned <br/>\nhow to read. The audience applauded them for finally confessing their <br/>\nshame and for somewhat painfully submitting to the process of being <br/>\ntaught, and happy that they reported making progress. Somehow no one <br/>\nsaw fit to comment that apparently one can become perfectly <br/>\nsuccessful without knowing how to read!<br/>\nIf your daughter can sing like Madonna and is a good judge of people, <br/>\nshe can always hire someone else to manage her finances and to do any <br/>\narithmetic that might be necessary. ^_^.<br/>\n<br/>\n- Mark V.<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Tina Bragdon&quot; <br/>\n&lt;jamesandtina942@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Hi, I am asking these questions as I know many of you have older <br/>\n&gt; children than mine and the benefit of time and experience, and also <br/>\n&gt; asking them in light of &quot;strewing&quot; and if it is manipulative, about <br/>\n&gt; teaching vs being a facilitator, and of having faith that <br/>\n </span></blockquote>unschooling <br/>\n<blockquote><span title=\"ireply\"> &gt; will be &quot;enough&quot; if that makes any sense.<br/>\n&gt; <br/>\n&gt; I am having a hard time overcoming my math fears and trying to <br/>\n </span></blockquote>relax <br/>\n<blockquote><span title=\"ireply\"> &gt; about it, especially now that dd is of mandatory school age in my <br/>\n&gt; province and I have to submit progress reports (no <br/>\n </span></blockquote>actual &quot;evidence&quot;) <br/>\n<blockquote><span title=\"ireply\"> &gt; twice a year.  It has just made my fears hit more close to home.  <br/>\n&gt; It&#39;s <br/>\n&gt; not that I am trying to relax from a curriculum I have imposed (we <br/>\n&gt; have <br/>\n&gt; not used any), it&#39;s that I feel so confused and unsure trying to <br/>\n </span></blockquote>sort <br/>\n<blockquote><span title=\"ireply\"> &gt; out the whole math thing in my mind that I feel I haven&#39;t done near <br/>\n&gt; as <br/>\n&gt; much as I could in helping my kids discover the patterns, <br/>\n&gt; relationships, games, etc that so many unschoolers say math is.<br/>\n&gt; <br/>\n&gt; I am in the process of reading Math Power by Patricia Kenschaft <br/>\n </span></blockquote>after <br/>\n<blockquote><span title=\"ireply\"> &gt; hearing Pam Sooroshian talk about it on tape.  It has been great in <br/>\n&gt; showing me about the &quot;language&quot; of math, incorporating it in real <br/>\n&gt; life, <br/>\n&gt; etc, and doing this seems so &quot;easy&quot; with ds as he has recently <br/>\n </span></blockquote>become <br/>\n<blockquote><span title=\"ireply\"> &gt; very interested in counting everything, the clock, obviously <br/>\n </span></blockquote>DELIGHTS <br/>\n<blockquote><span title=\"ireply\"> &gt; in numbers/quantity and how it can change, all that sort of stuff, <br/>\n&gt; and <br/>\n&gt; due to reading this book I feel more able to &quot;facilitate&quot; an <br/>\n </span></blockquote>explore <br/>\n<blockquote><span title=\"ireply\"> &gt; this with him.  It feels &quot;natural&quot; to point it out to him.<br/>\n&gt; <br/>\n&gt; With dd however I feel like I missed that boat in a way as (ok, I <br/>\n&gt; know <br/>\n&gt; it is a schooly comparison but it is for puroposes of illustration <br/>\n&gt; for <br/>\n&gt; you all) she would maybe have a kindy-gr 1 level of understanding <br/>\n </span></blockquote>in <br/>\n<blockquote><span title=\"ireply\"> &gt; math, I know it is just from talking about what we see in everyday <br/>\n&gt; life, cooking, reading a book, she knows &quot;intuitively&quot; somehow what <br/>\n&gt; is <br/>\n&gt; bigger, which thing is 3rd in line, etc and that has all &quot;gelled&quot; <br/>\n&gt; over <br/>\n&gt; a period of the last few years, but I guess I have <br/>\n </span></blockquote>nothing &quot;ongoing&quot; <br/>\n<blockquote><span title=\"ireply\"> &gt; at <br/>\n&gt; the moment to show me how unschooling math &quot;works&quot;, or how she can <br/>\n&gt; get <br/>\n&gt; farther along in it.  With reading for example, I can see how all <br/>\n </span></blockquote>the <br/>\n<blockquote><span title=\"ireply\"> &gt; playing Starfall she was attracted to and being read to and <br/>\n </span></blockquote>fiddling <br/>\n<blockquote><span title=\"ireply\"> &gt; with alphabet letters <br/>\n&gt; on the fridge and CONSTANTLY asking what things say has led to her <br/>\n&gt; reading, and the same now slowly with writing and spelling, because <br/>\n&gt; she &quot;needs&quot; them to for the things she wants to do (write on her <br/>\n&gt; pictures, do a comic strip and such) My faith in her reading <br/>\n </span></blockquote>without <br/>\n<blockquote><span title=\"ireply\"> &gt; lessons developed at the same time I could see reading happening, <br/>\n </span></blockquote>one <br/>\n<blockquote><span title=\"ireply\"> &gt; feeding off the other y&#39;know?<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I know this is all because dd is &quot;school age&quot; now.  I also have a <br/>\n&gt; hard <br/>\n&gt; time not fretting about the arithmetic/4 basic operations aspect of <br/>\n&gt; math.  Yes I know dd ps&#39;ed peers play with blocks and rods, etc BUT <br/>\n&gt; with the agenda and learning objectives the teacher expects of <br/>\n </span></blockquote>them  <br/>\n<blockquote><span title=\"ireply\"> &gt; I <br/>\n&gt; remember drill and being expected to memorize and crying becuse I <br/>\n&gt; could not understand the &quot;why&quot; of borrowing!  Does a gr 2&#39;er need <br/>\n </span></blockquote>to <br/>\n<blockquote><span title=\"ireply\"> &gt; mememorize addition facts or just understand what it is? I have in <br/>\n&gt; all <br/>\n&gt; my reading online about unschooling math rarely seen the whole <br/>\n&gt; competency and speed at &quot;computing&quot; issue addressed, especially <br/>\n </span></blockquote>with <br/>\n<blockquote><span title=\"ireply\"> &gt; older unschoolers.  I guess I am thinking does playing dice for <br/>\n </span></blockquote>YEARS <br/>\n<blockquote><span title=\"ireply\"> &gt; teach you enough math to get by as an adult (the everday consumer <br/>\n&gt; math, <br/>\n&gt; not algebra or anything!)  <br/>\n&gt; <br/>\n&gt; Yes, you hear stories of unschoolers being shown what &quot;long <br/>\n </span></blockquote>division&quot; <br/>\n<blockquote><span title=\"ireply\"> &gt; is at 13 because it just &quot;came up&quot; and then they &quot;get it&quot; without <br/>\n </span></blockquote>all <br/>\n<blockquote><span title=\"ireply\"> &gt; those years of school math drill, but does being shown it once or <br/>\n&gt; twice <br/>\n&gt; lead to skill? Does it need to? I just remember all those years of <br/>\n&gt; being made to practice over and over again.  Again this is <br/>\n </span></blockquote>something <br/>\n<blockquote><span title=\"ireply\"> &gt; I have never <br/>\n&gt; seen addressed online by my fellow unschoolers.<br/>\n&gt; <br/>\n&gt; DD can sense any sort of &quot;this is meant to teach you...&#39;this&#39;&quot; I <br/>\n&gt; think.  I have so many sites bookmarked, I have so many books like <br/>\n&gt; Family Math for Young Children, Games for Math by Penny Kaye <br/>\n </span></blockquote>sitting <br/>\n<blockquote><span title=\"ireply\"> &gt; on <br/>\n&gt; the shelf pretty much unused because I can&#39;t balance the just doing <br/>\n&gt; it <br/>\n&gt; with her because it is &quot;neat&quot; and a fun game, with the fear that if <br/>\n&gt; she <br/>\n&gt; doesn&#39;t &quot;practice&quot; or do the &quot;dice game&quot; enough she won&#39;t &quot;have her <br/>\n&gt; facts down&quot;. I see so many math things like computer games, <br/>\n&gt; workbooks, <br/>\n&gt; etc that are thinly disguised drill, like those dollar-store-books <br/>\n&gt; that <br/>\n&gt; have comparing numbers of 3 types of toys and drawing a circle <br/>\n </span></blockquote>graph <br/>\n<blockquote><span title=\"ireply\"> &gt; (gr 2 curriculum in my province BTW), or adding 45+3 in picture <br/>\n&gt; form.  <br/>\n&gt; My dd would look at something like that and thing &quot;what the heck <br/>\n&gt; for?&quot;  <br/>\n&gt; Is that even relevant to a 7 yr old? LOL even a writing workbook <br/>\n&gt; given <br/>\n&gt; to her by my MIL turned her off, I didn&#39;t care and just let her go <br/>\n </span></blockquote>at <br/>\n<blockquote><span title=\"ireply\"> &gt; it on blank paper and she learned to write, it&#39;s like she sees <br/>\n&gt; the &quot;expectations&quot; of workbooks and the more structured stuff loud <br/>\n&gt; and <br/>\n&gt; clear.<br/>\n&gt; <br/>\n&gt; Where does introducing stuff fall into place in light of being an <br/>\n&gt; unschooler?  What about strewing?  I know bigger numbers have come <br/>\n </span></blockquote>up <br/>\n<blockquote><span title=\"ireply\"> &gt; in our lives, do I get Cusinaire rods or something, not to do <br/>\n&gt; the exercises &quot;everyday at the same time&quot; like my structured hs-ing <br/>\n&gt; friends do but to <br/>\n&gt; have as a resource around to show her place value or comparing 10 <br/>\n </span></blockquote>to <br/>\n<blockquote><span title=\"ireply\"> &gt; 100 say if it came up, just to &quot;have it there?&quot;  OR would that be <br/>\n </span></blockquote>too <br/>\n<blockquote><span title=\"ireply\"> &gt; much manipulation and expectation?  I guess I am having a hard time <br/>\n&gt; having &quot;resources&quot; around without the fears and concerns she is <br/>\n&gt; not &quot;using&quot; it if that makes any sense.<br/>\n&gt; <br/>\n&gt; Sorry this is so long and so jumbled as I pour this out.  I am so <br/>\n&gt; confused in this area.  I am looking for personal stories <br/>\n </span></blockquote>especially <br/>\n<blockquote><span title=\"ireply\"> &gt; from you with older kids, and for a kick in the butt, and for <br/>\n&gt; suggestion as to how to relax.<br/>\n&gt; <br/>\n&gt; Tina, dp James, dd Stephanie (7) and ds Jonathan (4) here in <br/>\n </span></blockquote>Manitoba <br/>\n<blockquote><span title=\"qreply\"> &gt; Canada<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":332740296,"authorName":"Karen Sirotkin","from":"&quot;Karen Sirotkin&quot; &lt;kfsirotkin@...&gt;","profile":"kfsirotkin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Unschooling math","postDate":"1200929495","msgId":28944,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxYTEwMWM4NWM0MiRiNWY0ZGVlMCQwMzAxYThjMEBNaWtlPg==","inReplyToHeader":"PDc0NEFDODUwLTY2QjQtNDlBRS05RkJFLTYxRDU3NEJEQTQyM0B2ZXJpem9uLm5ldD4=","referencesHeader":"PDAwNGYwMWM4NWEwMyQ1YWUzYTgxMCQ4MjAwYThjMEBhbGllbj4gPDc0NEFDODUwLTY2QjQtNDlBRS05RkJFLTYxRDU3NEJEQTQyM0B2ZXJpem9uLm5ldD4="},"prevInTopic":28942,"nextInTopic":28981,"prevInTime":28943,"nextInTime":28945,"topicId":28906,"numMessagesInTopic":0,"msgSnippet":"... .  Thank you for","messageBody":"<div id=\"ygrps-yiv-1059969464\"><blockquote><span title=\"ireply\">&gt;It&#39;s because schools must demonstrate that they&#39;re <br/>\n&gt;accomplishing their goals of teaching and to do that they need to <br/>\n&gt;test. But testing understanding is very very difficult. Testing <br/>\n&gt;memorization, on the other hand, is relatively easy. They&#39;re trapped <br/>\n&gt;using methods that make real learning very difficult but allow them <br/>\n&gt;to show learning happens.<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>.<br/>\n<br/>\n <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://geo.yahoo.com/serv?s=97359714/grpId=12789513/grpspId=1705081972/msgI\">http://geo.yahoo.com/serv?s=97359714/grpId=12789513/grpspId=1705081972/msgI</a><br/>\nd=28941/stime=1200913296/nc1=5008812/nc2=4025338/nc3=5170415&gt; <br/>\nThank you for that whole post, Joyce!  How very true!  I was a teacher for<br/>\n12 years, and ultimately left the profession because I couldn&#39;t reconcile<br/>\nwithin myself the huge gap between what my expertise (and research, and<br/>\n-yes- college education) had taught me about how children learn and what the<br/>\nschools did to &quot;teach&quot; the various subjects!  And it isn&#39;t like I don&#39;t<br/>\nunderstand the huge difficulty that is place before the teachers when they<br/>\nhave 30+ kids to a classroom.  But I don&#39;t think that excuses doing what is<br/>\n*easy* over doing what is right  (I actually had an administrator scold me<br/>\nfor creating a curriculum that was individualized to each student-because it<br/>\nwas *too much work* --for ME, not the kids!  Ugh!).<br/>\n<br/>\n <br/>\n<br/>\nAnyway, this post came at a great time for my family.  My husband and I are<br/>\nin the process of deschooling ourselves and entering into unschooling our 3<br/>\nof our children.  My husband and I talk about this topic of unschooling math<br/>\noften.  His concern is what if Jonah (8- and the oldest who will be<br/>\nunschooled) in his teens (or pre-teens-or whenever) decides on a career path<br/>\nthat he did not consider in his *early years* and now he is without the<br/>\nbasics he needs to follow that path later on.  Now understand-my husband is<br/>\nan engineer and knew he wanted to be an engineer pretty early on in his high<br/>\nschool years.  I, on the other hand, have been a retail manager, a teacher,<br/>\na graphic artist, and now a massage therapist and reiki practitioner-and I<br/>\nstill haven&#39;t *decided* what I want to be when I grow up!!!!  In most cases,<br/>\nreminding him of that I have repackaged my own career(s) as the interests<br/>\nstrike me, and that I had no medical/science basics when I decided on this<br/>\nlast career-and yet here I am!-has helped him understand that life and goals<br/>\ndo not look a certain way.  <br/>\n<br/>\n <br/>\n<br/>\nKaren <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: ???&#39;s, how to develop faith about unschooling math....","postDate":"1200924428","msgId":28942,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1Mzk1MEFBQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":28941,"nextInTopic":28944,"prevInTime":28941,"nextInTime":28943,"topicId":28906,"numMessagesInTopic":0,"msgSnippet":"Exactly - it s about strewing things that are interesting in and of themselves, not strewing subjects . Even though DS knows that math exists (sometimes","messageBody":"<div id=\"ygrps-yiv-777177721\">Exactly - it&#39;s about strewing things that are interesting in and of<br/>\nthemselves, not strewing &quot;subjects&quot;. Even though DS knows that &quot;math&quot;<br/>\nexists (sometimes we&#39;ll kid as we walk through the &quot;homeschooling&quot;<br/>\nsection of the bookstore &quot;are you SURE you don&#39;t want a math workbook?&quot;<br/>\nBWG), basically we just call it &quot;numbers&quot;. He&#39;s stretching his numbers a<br/>\nbit now because he&#39;s decided he wants to play cribbage with me and DH<br/>\nso, while it&#39;s not huge numbers, it is calculating running totals and<br/>\nseeing patterns on the fly. yesterday, he won a game with no assistance<br/>\nfrom us (he used to want one of us to &#39;coach&#39; him while he played the<br/>\nother). Numbers are everywhere really - calculating how many more points<br/>\nto level up in a game, figuring up how much money he has and how much he<br/>\nneeds to get something he wants, measuring, percentages (how much tax on<br/>\nthat thing he wants to buy, what is a &#39;tip&#39; and how do you figure it<br/>\nout), all sorts of things use numbers every day. Just as you can&#39;t put a<br/>\nwhite sock in with a brand new red sweatshirt without the sock getting<br/>\nat least a bit pink, so too you can&#39;t have a kid out and about in this<br/>\nwide world without getting at least a little bit of numeracy (the<br/>\nnumber/math version of literacy).<br/>\n<br/>\nDeb <br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] ???&#39;s, how to develop faith about unschooling math....","postDate":"1200913293","msgId":28941,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0NEFDODUwLTY2QjQtNDlBRS05RkJFLTYxRDU3NEJEQTQyM0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDAwNGYwMWM4NWEwMyQ1YWUzYTgxMCQ4MjAwYThjMEBhbGllbj4=","referencesHeader":"PDAwNGYwMWM4NWEwMyQ1YWUzYTgxMCQ4MjAwYThjMEBhbGllbj4="},"prevInTopic":28932,"nextInTopic":28942,"prevInTime":28940,"nextInTime":28942,"topicId":28906,"numMessagesInTopic":0,"msgSnippet":"... And unschooled kids shouldn t be cooking *in order* to pick up fractions, they should be cooking because they want to cook. Learning about numbers happens","messageBody":"<div id=\"ygrps-yiv-671676363\">On Jan 18, 2008, at 1:53 PM, Michelle Thedaker wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If you<br/>\n&gt; daughter doesn&#39;t care about measuring cooking ingredients in order  <br/>\n&gt; to pick<br/>\n&gt; up fractions and volumes and such, so what?<br/>\n<br/>\n </span></blockquote>And unschooled kids shouldn&#39;t be cooking *in order* to pick up  <br/>\nfractions, they should be cooking because they want to cook. Learning  <br/>\nabout numbers happens as a side effect.<br/>\n<br/>\nThink of it this way: Do kids learn English in order to learn nouns  <br/>\nand verbs? Or do they unconsciously pick up nouns and verbs as a side  <br/>\neffect of using English to get what they want. If you ask them, they  <br/>\nmay not know what a noun is, but I&#39;m betting they never say &quot;Cat the  <br/>\npet black.&quot;! ;-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I memorized the times tables as a<br/>\n&gt; kid (ugh!!!) but I often do not remember what a certain answer is  <br/>\n&gt; for a<br/>\n&gt; multiplication question in real life.<br/>\n<br/>\n </span></blockquote>Exactly. Like with English kids will pick up an understanding of how  <br/>\nnumbers work as they use them for what they want to do.<br/>\n<br/>\nUnlike school where being able to demonstrate that you&#39;ve memorized  <br/>\nhow to manipulate numbers is important, in real life figuring out a  <br/>\nway to get to where you want to be is is what&#39;s important. By doing  <br/>\nthat kids build an understanding of how English and numbers and the  <br/>\nworld in general works that&#39;s constantly being reworked and refined  <br/>\nas their understanding grows.<br/>\n<br/>\nSchools *hope* kids pick up understanding after tedious hours of  <br/>\npractice, but they can&#39;t guarantee it. It&#39;s not because schools are  <br/>\nmean ;-) It&#39;s because schools must demonstrate that they&#39;re  <br/>\naccomplishing their goals of teaching and to do that they need to  <br/>\ntest. But testing understanding is very very difficult. Testing  <br/>\nmemorization, on the other hand, is relatively easy. They&#39;re trapped  <br/>\nusing methods that make real learning very difficult but allow them  <br/>\nto show learning happens.<br/>\n<br/>\n  In fact, it seems from all the math phobia, that what schools teach  <br/>\nkids best is that math is hard and boring and something to be  <br/>\navoided. And by avoiding math in real life, they miss out on  <br/>\nopportunities to understand how numbers work.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185550057,"authorName":"Joanne","from":"&quot;Joanne&quot; &lt;billyandjoanne@...&gt;","profile":"billyandjoanne","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: ???&#39;s, how to develop faith about unschooling math....","postDate":"1200802938","msgId":28932,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZtdWk5cStsMnBxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZtcWlnMStuaDNlQGVHcm91cHMuY29tPg=="},"prevInTopic":28927,"nextInTopic":28941,"prevInTime":28931,"nextInTime":28933,"topicId":28906,"numMessagesInTopic":0,"msgSnippet":"One of the issues of Unschooling Voices (the unschooling blog carnival) was on unschooling math. Here s the link: http://tinyurl.com/26pt6x Scroll down...it s","messageBody":"<div id=\"ygrps-yiv-159425478\">One of the issues of Unschooling Voices (the unschooling blog carnival) <br/>\nwas on unschooling math. Here&#39;s the link:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tinyurl.com/26pt6x\">http://tinyurl.com/26pt6x</a><br/>\n<br/>\nScroll down...it&#39;s issue #4. <br/>\n<br/>\n~~*~~ Joanne ~~*~~<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://anunschoolinglife.blogspot.com/\">http://anunschoolinglife.blogspot.com/</a></div>","specialLinks":[]},{"userId":299286442,"authorName":"Cameron Parham","from":"Cameron Parham &lt;acsp2205@...&gt;","profile":"acsp2205","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: ???&#39;s, how to develop faith about unschooling math....","postDate":"1200771617","msgId":28927,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3Njk4MS45NDY5MC5xbUB3ZWI1OTIwMi5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":28924,"nextInTopic":28932,"prevInTime":28926,"nextInTime":28928,"topicId":28906,"numMessagesInTopic":0,"msgSnippet":"Dana,  I love it when I get the exact answer I wanted! This feels in synch and right. Thank you so much! I guess that I am still new enough to need the","messageBody":"<div id=\"ygrps-yiv-1242703245\">Dana,  I love it when I get the exact answer I wanted! This feels &#39;in synch&#39; and right. Thank you so much! I guess that I am still new enough to need the reassurance you gave.  Funny thing is, my kids are so good at knowing what they want, that the contived strewing never works.  I know this. I wasn&#39;t even tempted to do it, simply because I have finally realized it never works. I guess I just needed some affirmation!  Thanks so much!!  Cameron <br/>\n<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: dana_burdick &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:DanaBurdick@...\">DanaBurdick@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Saturday, January 19, 2008 10:50:16 AM<br/>\nSubject: [unschoolingbasics] Re: ???&#39;s, how to develop faith about unschooling math....<br/>\n<br/>\n=======<br/>\nHowever, I am having trouble with strewing their path with math.<br/>\n=======<br/>\n<br/>\nIt might be helpful to think of strewing their path with things you <br/>\nfind interesting or things that you think they may find interesting, <br/>\nrather than strewing `math&#39;. When you strew, strew something that is <br/>\na little closer to your kids&#39; existing interests/passions. If you <br/>\nchose to dissect any one interest, you could probably segment it into <br/>\nschool subjects such as math or English, but it&#39;s rather anemic to <br/>\nreduce the world to five or so categories; especially, when learning <br/>\nis all about making many many connections from all that you are <br/>\nsurrounded by.<br/>\n<br/>\nMy son recently has been very passionate about Star Wars. Anything <br/>\nand everything is Star Wars these days. We started out with the <br/>\nmovie marathon where we watched all six films. He then proceeded to <br/>\nwrite a bit of an introduction for a role playing game based on Lego <br/>\nStar Wars. One day I was at the music store getting some stuff for <br/>\nmyself. I offered to get some Star Wars music to play for him on the <br/>\npiano. He decided he wanted to try playing it himself. My son had <br/>\nnot taken a single lesson in piano and had not shown any interest at <br/>\nall until that day. If I had thought about strewing writing so he <br/>\nwould write he would have never produced the wonderful Star Wars <br/>\nintro for his game. If I had strewn the piano and said here you <br/>\nmight learn some notes, he wouldn&#39;t have even glanced at the thing. <br/>\nAs far as he was concerned, his writing was a means to tell his <br/>\nstory. Learning how to play the piano was merely a means to play his <br/>\nStar Wars music. Since then, he has learned other piano pieces. <br/>\nPlaying the piano has now become an interest in itself.<br/>\n<br/>\nAs a math example, my daughter resists any math games for math&#39;s <br/>\nsake. For her, Webkinz has been the passion recently. She has <br/>\nlearned a lot about arithmetic via this game. She watches her money <br/>\nand spends it very carefully. She has learned how to read numbers <br/>\ninto the thousands. She has learned how to subtract from these <br/>\nlarger numbers. And, this is just from my cursory observation. Who <br/>\nknows what other connections that she has made. If I would have <br/>\nsaid, `Here&#39;s a game that might help you learn math,&#39; she would not <br/>\nhave been very excited. But instead I said, `Look here honey, isn&#39;t <br/>\nthis a cute animal? Oh, it says here on this tag that you can play <br/>\nwith him on the computer too. Would you like to get it?&#39; Well duh, <br/>\nwho can resist that? Ok, maybe my son, but you get the point.<br/>\n<br/>\nI am guilty of strewing writing for my son and strewing math for my <br/>\ndaughter. It worked to undermine our relationship every time. When <br/>\nmy motives behind strewing shifted from fear of them learning school <br/>\nsubjects to serving them and their interests, everything changed.<br/>\n<br/>\nBy the way, we are currently doing math every night after dinner. We <br/>\nget out the Visual Brainstorms Cards (math puzzles not arithmetic. By <br/>\nMartin Gardner) and try to solve a problem together as a family. <br/>\nThe kids are the ones who jump up and grab the set of cards and ask <br/>\nif we can do one. They don&#39;t see it as math. They see it as time <br/>\nspent together having a fun challenge. There is no way that I could <br/>\nhave _made_ that happen. It&#39;s a certain magic that follows strewing <br/>\nwhen the motives are free of fear. It is also unique to our family, <br/>\nour kids, their ages, and the exact circumstances. I didn&#39;t strew <br/>\nthe cards the first night we played with them; I was actually in the <br/>\nmiddle of going through a bunch of junk on our bookcase. The cards <br/>\njust happen to be out. I think the scary thing is that these things <br/>\nseem so incidental and cannot be controlled. I like to think of this <br/>\nway, like the stock market, prices may vary, but generally over the <br/>\nlong haul you get good return on your investment.<br/>\n<br/>\n-Dana<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":156418579,"authorName":"dana_burdick","from":"&quot;dana_burdick&quot; &lt;DanaBurdick@...&gt;","profile":"dana_burdick","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: ???&#39;s, how to develop faith about unschooling math....","postDate":"1200765016","msgId":28924,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZtdGQ4bytjcGl1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY0MzA2OS4zMDYzMy5xbUB3ZWI1OTIwOS5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":28920,"nextInTopic":28927,"prevInTime":28923,"nextInTime":28925,"topicId":28906,"numMessagesInTopic":0,"msgSnippet":"======= However, I am having trouble with strewing their path with math. ======= It might be helpful to think of strewing their path with things you find","messageBody":"<div id=\"ygrps-yiv-1324050167\">=======<br/>\nHowever, I am having trouble with strewing their path with math.<br/>\n=======<br/>\n<br/>\nIt might be helpful to think of strewing their path with things you <br/>\nfind interesting or things that you think they may find interesting, <br/>\nrather than strewing `math&#39;.  When you strew, strew something that is <br/>\na little closer to your kids&#39; existing interests/passions.  If you <br/>\nchose to dissect any one interest, you could probably segment it into <br/>\nschool subjects such as math or English, but it&#39;s rather anemic to <br/>\nreduce the world to five or so categories; especially, when learning <br/>\nis all about making many many connections from all that you are <br/>\nsurrounded by.<br/>\n<br/>\nMy son recently has been very passionate about Star Wars.  Anything <br/>\nand everything is Star Wars these days.  We started out with the <br/>\nmovie marathon where we watched all six films.  He then proceeded to <br/>\nwrite a bit of an introduction for a role playing game based on Lego <br/>\nStar Wars.  One day I was at the music store getting some stuff for <br/>\nmyself.  I offered to get some Star Wars music to play for him on the <br/>\npiano.  He decided he wanted to try playing it himself.  My son had <br/>\nnot taken a single lesson in piano and had not shown any interest at <br/>\nall until that day.  If I had thought about strewing writing so he <br/>\nwould write he would have never produced the wonderful Star Wars <br/>\nintro for his game.  If I had strewn the piano and said here you <br/>\nmight learn some notes, he wouldn&#39;t have even glanced at the thing.  <br/>\nAs far as he was concerned, his writing was a means to tell his <br/>\nstory.  Learning how to play the piano was merely a means to play his <br/>\nStar Wars music.  Since then, he has learned other piano pieces.  <br/>\nPlaying the piano has now become an interest in itself.<br/>\n<br/>\nAs a math example, my daughter resists any math games for math&#39;s <br/>\nsake.   For her, Webkinz has been the passion recently.  She has <br/>\nlearned a lot about arithmetic via this game.  She watches her money <br/>\nand spends it very carefully.  She has learned how to read numbers <br/>\ninto the thousands.  She has learned how to subtract from these <br/>\nlarger numbers.  And, this is just from my cursory observation.  Who <br/>\nknows what other connections that she has made.  If I would have <br/>\nsaid, `Here&#39;s a game that might help you learn math,&#39; she would not <br/>\nhave been very excited.  But instead I said, `Look here honey, isn&#39;t <br/>\nthis a cute animal?  Oh, it says here on this tag that you can play <br/>\nwith him on the computer too.  Would you like to get it?&#39;   Well duh, <br/>\nwho can resist that?  Ok, maybe my son, but you get the point.<br/>\n<br/>\nI am guilty of strewing writing for my son and strewing math for my <br/>\ndaughter.  It worked to undermine our relationship every time.  When <br/>\nmy motives behind strewing shifted from fear of them learning school <br/>\nsubjects to serving them and their interests, everything changed.<br/>\n<br/>\nBy the way, we are currently doing math every night after dinner.  We <br/>\nget out the Visual Brainstorms Cards (math puzzles not arithmetic. By <br/>\nMartin Gardner) and try to solve a problem together as a family.   <br/>\nThe kids are the ones who jump up and grab the set of cards and ask <br/>\nif we can do one.  They don&#39;t see it as math.  They see it as time <br/>\nspent together having a fun challenge.  There is no way that I could <br/>\nhave _made_ that happen.  It&#39;s a certain magic that follows strewing <br/>\nwhen the motives are free of fear.   It is also unique to our family, <br/>\nour kids, their ages, and the exact circumstances.  I didn&#39;t strew <br/>\nthe cards the first night we played with them; I was actually in the <br/>\nmiddle of going through a bunch of junk on our bookcase.   The cards <br/>\njust happen to be out.  I think the scary thing is that these things <br/>\nseem so incidental and cannot be controlled.  I like to think of this <br/>\nway, like the stock market, prices may vary, but generally over the <br/>\nlong haul you get good return on your investment.<br/>\n<br/>\n-Dana</div>","specialLinks":[]},{"userId":299286442,"authorName":"Cameron Parham","from":"Cameron Parham &lt;acsp2205@...&gt;","profile":"acsp2205","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] ???&#39;s, how to develop faith about unschooling math....","postDate":"1200750707","msgId":28920,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY0MzA2OS4zMDYzMy5xbUB3ZWI1OTIwOS5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":28914,"nextInTopic":28924,"prevInTime":28919,"nextInTime":28921,"topicId":28906,"numMessagesInTopic":0,"msgSnippet":"Tina,  this really resonated with me. I am like a poster-child to show that we probably will all learn the kind of math we need or want when we find that we","messageBody":"<div id=\"ygrps-yiv-2139245764\">Tina,  this really resonated with me. I am like a poster-child to show that we probably will all learn the kind of math we need or want when we find that we need or want it. That totally played out in my life. And the math I do know sure didn&#39;t come from school, just the fear of it.  So I am not tempted to think that my kids need formal lessons.  However, I am having trouble with strewing their path with math.  Like Tina says below, my kids can smell anything meant to teach them immediately, and of course I don&#39;t even want to sneak anything by them.  So if I suggest any games (like those from Pam Sorooshian&#39;s site) they refuse immediately.  And I honor their right to refuse, and it just passes on.  But they really never even let me show them any of it.  I guess my question is....it&#39;s my perception that with this situation, the right thing to do is let it drop, figuring that if and when they need this knowlege they&#39;ll search it out.  OK, that&#39;s great.  As<br/>\n long as I am not letting them down by failing to figure out how to gracefully strew their path. That&#39;s part of what I thought Tina was asking...how hard do you try to strew a path when they aren&#39;t looking at the path?  Isn&#39;t the answer that we must let them look where THEY are looking? I hope this was clear!  Thanks.... Cameron<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: Tina Bragdon &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jamesandtina942@...\">jamesandtina942@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Friday, January 18, 2008 9:01:05 AM<br/>\nSubject: [unschoolingbasics] ???&#39;s, how to develop faith about unschooling math....<br/>\n<br/>\nHi, I am asking these questions as I know many of you have older <br/>\nchildren than mine and the benefit of time and experience, and also <br/>\nasking them in light of &quot;strewing&quot; and if it is manipulative, about <br/>\nteaching vs being a facilitator, and of having faith that unschooling <br/>\nwill be &quot;enough&quot; if that makes any sense.<br/>\n<br/>\nI am having a hard time overcoming my math fears and trying to relax <br/>\nabout it, especially now that dd is of mandatory school age in my <br/>\nprovince and I have to submit progress reports (no actual &quot;evidence&quot;) <br/>\ntwice a year. It has just made my fears hit more close to home. <br/>\nIt&#39;s <br/>\nnot that I am trying to relax from a curriculum I have imposed (we <br/>\nhave <br/>\nnot used any), it&#39;s that I feel so confused and unsure trying to sort <br/>\nout the whole math thing in my mind that I feel I haven&#39;t done near <br/>\nas <br/>\nmuch as I could in helping my kids discover the patterns, <br/>\nrelationships, games, etc that so many unschoolers say math is.<br/>\n<br/>\nI am in the process of reading Math Power by Patricia Kenschaft after <br/>\nhearing Pam Sooroshian talk about it on tape. It has been great in <br/>\nshowing me about the &quot;language&quot; of math, incorporating it in real <br/>\nlife, <br/>\netc, and doing this seems so &quot;easy&quot; with ds as he has recently become <br/>\nvery interested in counting everything, the clock, obviously DELIGHTS <br/>\nin numbers/quantity and how it can change, all that sort of stuff, <br/>\nand <br/>\ndue to reading this book I feel more able to &quot;facilitate&quot; an explore <br/>\nthis with him. It feels &quot;natural&quot; to point it out to him.<br/>\n<br/>\nWith dd however I feel like I missed that boat in a way as (ok, I <br/>\nknow <br/>\nit is a schooly comparison but it is for puroposes of illustration <br/>\nfor <br/>\nyou all) she would maybe have a kindy-gr 1 level of understanding in <br/>\nmath, I know it is just from talking about what we see in everyday <br/>\nlife, cooking, reading a book, she knows &quot;intuitively&quot; somehow what <br/>\nis <br/>\nbigger, which thing is 3rd in line, etc and that has all &quot;gelled&quot; <br/>\nover <br/>\na period of the last few years, but I guess I have nothing &quot;ongoing&quot; <br/>\nat <br/>\nthe moment to show me how unschooling math &quot;works&quot;, or how she can <br/>\nget <br/>\nfarther along in it. With reading for example, I can see how all the <br/>\nplaying Starfall she was attracted to and being read to and fiddling <br/>\nwith alphabet letters <br/>\non the fridge and CONSTANTLY asking what things say has led to her <br/>\nreading, and the same now slowly with writing and spelling, because <br/>\nshe &quot;needs&quot; them to for the things she wants to do (write on her <br/>\npictures, do a comic strip and such) My faith in her reading without <br/>\nlessons developed at the same time I could see reading happening, one <br/>\nfeeding off the other y&#39;know?<br/>\n<br/>\nI know this is all because dd is &quot;school age&quot; now. I also have a <br/>\nhard <br/>\ntime not fretting about the arithmetic/4 basic operations aspect of <br/>\nmath. Yes I know dd ps&#39;ed peers play with blocks and rods, etc BUT <br/>\nwith the agenda and learning objectives the teacher expects of them <br/>\nI <br/>\nremember drill and being expected to memorize and crying becuse I <br/>\ncould not understand the &quot;why&quot; of borrowing! Does a gr 2&#39;er need to <br/>\nmememorize addition facts or just understand what it is? I have in <br/>\nall <br/>\nmy reading online about unschooling math rarely seen the whole <br/>\ncompetency and speed at &quot;computing&quot; issue addressed, especially with <br/>\nolder unschoolers. I guess I am thinking does playing dice for YEARS <br/>\nteach you enough math to get by as an adult (the everday consumer <br/>\nmath, <br/>\nnot algebra or anything!) <br/>\n<br/>\nYes, you hear stories of unschoolers being shown what &quot;long division&quot; <br/>\nis at 13 because it just &quot;came up&quot; and then they &quot;get it&quot; without all <br/>\nthose years of school math drill, but does being shown it once or <br/>\ntwice <br/>\nlead to skill? Does it need to? I just remember all those years of <br/>\nbeing made to practice over and over again. Again this is something <br/>\nI have never <br/>\nseen addressed online by my fellow unschoolers.<br/>\n<br/>\nDD can sense any sort of &quot;this is meant to teach you...&#39;this&#39; &quot; I <br/>\nthink. I have so many sites bookmarked, I have so many books like <br/>\nFamily Math for Young Children, Games for Math by Penny Kaye sitting <br/>\non <br/>\nthe shelf pretty much unused because I can&#39;t balance the just doing <br/>\nit <br/>\nwith her because it is &quot;neat&quot; and a fun game, with the fear that if <br/>\nshe <br/>\ndoesn&#39;t &quot;practice&quot; or do the &quot;dice game&quot; enough she won&#39;t &quot;have her <br/>\nfacts down&quot;. I see so many math things like computer games, <br/>\nworkbooks, <br/>\netc that are thinly disguised drill, like those dollar-store- books <br/>\nthat <br/>\nhave comparing numbers of 3 types of toys and drawing a circle graph <br/>\n(gr 2 curriculum in my province BTW), or adding 45+3 in picture <br/>\nform. <br/>\nMy dd would look at something like that and thing &quot;what the heck <br/>\nfor?&quot; <br/>\nIs that even relevant to a 7 yr old? LOL even a writing workbook <br/>\ngiven <br/>\nto her by my MIL turned her off, I didn&#39;t care and just let her go at <br/>\nit on blank paper and she learned to write, it&#39;s like she sees <br/>\nthe &quot;expectations&quot; of workbooks and the more structured stuff loud <br/>\nand <br/>\nclear.<br/>\n<br/>\nWhere does introducing stuff fall into place in light of being an <br/>\nunschooler? What about strewing? I know bigger numbers have come up <br/>\nin our lives, do I get Cusinaire rods or something, not to do <br/>\nthe exercises &quot;everyday at the same time&quot; like my structured hs-ing <br/>\nfriends do but to <br/>\nhave as a resource around to show her place value or comparing 10 to <br/>\n100 say if it came up, just to &quot;have it there?&quot; OR would that be too <br/>\nmuch manipulation and expectation? I guess I am having a hard time <br/>\nhaving &quot;resources&quot; around without the fears and concerns she is <br/>\nnot &quot;using&quot; it if that makes any sense.<br/>\n<br/>\nSorry this is so long and so jumbled as I pour this out. I am so <br/>\nconfused in this area. I am looking for personal stories especially <br/>\nfrom you with older kids, and for a kick in the butt, and for <br/>\nsuggestion as to how to relax.<br/>\n<br/>\nTina, dp James, dd Stephanie (7) and ds Jonathan (4) here in Manitoba <br/>\nCanada<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] ???&#39;s, how to develop faith about unschooling math....","postDate":"1200708064","msgId":28914,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxRTY0NzE5LTFGNDEtNDEyQi1BMkZGLTMxNTI1OUJEQkQzMEBtYWMuY29tPg==","inReplyToHeader":"PGZtcWlnMStuaDNlQGVHcm91cHMuY29tPg==","referencesHeader":"PGZtcWlnMStuaDNlQGVHcm91cHMuY29tPg=="},"prevInTopic":28910,"nextInTopic":28920,"prevInTime":28913,"nextInTime":28915,"topicId":28906,"numMessagesInTopic":0,"msgSnippet":"... 13 years of drill doesn t lead many of schooled kids to skill. It leads MANY of them to avoidance, confusion, embarrassment, stress, and fear. Really and","messageBody":"<div id=\"ygrps-yiv-1099405083\">On Jan 18, 2008, at 8:01 AM, Tina Bragdon wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Yes, you hear stories of unschoolers being shown what &quot;long division&quot;<br/>\n&gt; is at 13 because it just &quot;came up&quot; and then they &quot;get it&quot; without all<br/>\n&gt; those years of school math drill, but does being shown it once or<br/>\n&gt; twice<br/>\n&gt; lead to skill?<br/>\n<br/>\n </span></blockquote>13 years of drill doesn&#39;t lead many of schooled kids to &quot;skill.&quot;<br/>\n<br/>\nIt leads MANY of them to avoidance, confusion, embarrassment, stress,  <br/>\nand fear.<br/>\n<br/>\n<br/>\nReally and truly - if you live an active life, and if you don&#39;t avoid  <br/>\nanything that looks like math to you, the kids WILL pick it up.<br/>\n<br/>\nBut, if it worries you, then play games. You can come up with all  <br/>\nkinds of fun games that support learning math - introduce the games  <br/>\nand then follow your daughter&#39;s lead - if the games are fun, then fine  <br/>\n- keep playing. If he&#39;s bored, then your game isn&#39;t appropriately  <br/>\nchallenging and if it is too hard or something she&#39;s not  <br/>\ndevelopmentally ready for yet, she&#39;ll show it by not wanting to play.<br/>\n<br/>\nThere is truly no timetable that matters. Just immerse them in a world  <br/>\nthat includes real math and they&#39;ll soak it up.<br/>\n<br/>\nPlay:<br/>\n<br/>\nboard games (Clue, Monopoly, Sorry, Chutes and Ladders), dice games,  <br/>\ncard games, finger games, physical games, strategy games (Penne,  <br/>\nBlokus, Othello, Ingenious), visual games ( SET).<br/>\n<br/>\nGo look here - I have written up a bit of stuff about games and math -  <br/>\nthere are dice games, paper and pencil games, coins games, and more.<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://homepage.mac.com/pamsoroosh/iblog/math/C1352236368/index.html\">http://homepage.mac.com/pamsoroosh/iblog/math/C1352236368/index.html</a>&gt;<br/>\n<br/>\nFocus on having fun playing the games. You can&#39;t control the learning  <br/>\nanyway, you can only provide a rich and stimulating environment in  <br/>\nwhich learning will naturally flourish.<br/>\n<br/>\n-pam<br/>\n<br/>\n-pam<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":156418579,"authorName":"dana_burdick","from":"&quot;dana_burdick&quot; &lt;DanaBurdick@...&gt;","profile":"dana_burdick","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: ???&#39;s, how to develop faith about unschooling math....","postDate":"1200683277","msgId":28910,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZtcXRlZCtnZjZjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZtcWlnMStuaDNlQGVHcm91cHMuY29tPg=="},"prevInTopic":28909,"nextInTopic":28914,"prevInTime":28909,"nextInTime":28911,"topicId":28906,"numMessagesInTopic":0,"msgSnippet":"It sounds like you have a lot of information about math learning and lots of resources for your kids, yet you are still not satisfied. Maybe it will help to","messageBody":"<div id=\"ygrps-yiv-1358622092\">It sounds like you have a lot of information about math learning and <br/>\nlots of resources for your kids, yet you are still not satisfied.    <br/>\nMaybe it will help to think more in depth about your own math <br/>\nexperience.<br/>\n<br/>\n=========<br/>\nI remember drill and being expected to memorize and crying becuse I<br/>\ncould not understand the &quot;why&quot; of borrowing! Does a gr 2&#39;er need to<br/>\nmememorize addition facts or just understand what it is? I have in<br/>\nall my reading online about unschooling math rarely seen the whole<br/>\ncompetency and speed at &quot;computing&quot; issue addressed, especially with<br/>\nolder unschoolers.<br/>\n==========<br/>\nOthers may give their opinion of the importance of computing speed, <br/>\nbut if you look at how you do math in your own life, you may be able <br/>\nto answer your own question.  Your fear of math or fear of your <br/>\ndaughter learning math or both seems to be clouding your own <br/>\nobservation of how YOU use math now, today.  Do you have to have fast <br/>\ncomputing speed in anything you do?  What depth of understanding do <br/>\nYOU have about borrowing?  Does this knowledge or lack thereof affect <br/>\nyour daily life?  Does your daughter&#39;s knowledge of addition facts <br/>\naffect her daily life, today, at age 8?<br/>\n<br/>\nIn high school I worked at a fabric store.  Something was always on <br/>\nsale and invariably some little old lady would come in wanting fabric <br/>\nfor a quilt.  She would want an eighth of a yard of the lovely blue <br/>\ncalico for 4.99/yd at 30% off and a quarter yard of the chintz for <br/>\n3.49/yd at 25% percent off.  After cutting about five different types <br/>\nof fabric like this, she would remember at the last minute that she <br/>\nhad her frequent buyer card that would give her an extra 10% on the <br/>\nwhole lot.  I would have to do all this calculation without a <br/>\ncalculator, while the customer chatted with me and three others <br/>\nwaited in line.  I learned how to take percentages in school, but <br/>\nnothing could have prepared me for doing that job, short of doing <br/>\nit.  I quit my job at the fabric store when I went off to college.  <br/>\nIn college I decided to get a degree in math.  I did some pretty <br/>\nabstract stuff. Addition facts and my skills I had learned at the <br/>\nfabric store were useless.  When I got out of school and became an <br/>\nengineer, I used some pretty sophisticated math which still didn&#39;t <br/>\nrequire any addition facts, nor any facility at computing numbers <br/>\nquickly.  Fast computation was the computer&#39;s job, thank you very <br/>\nmuch.  When I left work to be home full time, I no longer needed the <br/>\nabstract/sophisticated stuff.   Much of it is long forgotten (Fancy <br/>\nnumerical analysis is somehow lost on that laundry. LOL )  Recently I <br/>\nhave been cooking a lot.  I just got a cook book from Australia which <br/>\nhas metric measurements.  I&#39;m learning to do conversions again, <br/>\nsomething I haven&#39;t done since high school.  Throughout my life, I <br/>\nhave always learned and used the math I needed at the time.  The <br/>\ndrilling preparation in school really wasn&#39;t useful for me.  The <br/>\nfabric store was definitely the biggest example of that.<br/>\n<br/>\nSo.that&#39;s why I suggest asking yourself how you have learned and <br/>\nused math in your own life.  If you can remember back when you were <br/>\nyour daughter&#39;s age, besides the drilling in school, what kind of <br/>\nmath did you use?<br/>\n<br/>\nOh, by the way, if you are thinking that I&#39;m just one of those lucky <br/>\nones who just `got&#39; math.  I was put in a remedial math group in <br/>\nsecond grade.  Go figure.<br/>\n<br/>\n-Dana<br/>\nBy the way, my DH grew up in Manatoba</div>","specialLinks":[]},{"userId":65697424,"authorName":"Michelle Thedaker","from":"&quot;Michelle Thedaker&quot; &lt;pamperedthed@...&gt;","profile":"pamperedthed","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] ???&#39;s, how to develop faith about unschooling math....","postDate":"1200682383","msgId":28909,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNGYwMWM4NWEwMyQ1YWUzYTgxMCQ4MjAwYThjMEBhbGllbj4=","inReplyToHeader":"PGZtcWlnMStuaDNlQGVHcm91cHMuY29tPg=="},"prevInTopic":28906,"nextInTopic":28910,"prevInTime":28908,"nextInTime":28910,"topicId":28906,"numMessagesInTopic":0,"msgSnippet":"Tina, I ve been thinking about math and learning specific facts, etc. for a few days, and would like to share my rambling thoughts.  They seem to go along with","messageBody":"<div id=\"ygrps-yiv-1114102097\">Tina,<br/>\n<br/>\n <br/>\n<br/>\nI&#39;ve been thinking about math and learning specific facts, etc. for a few<br/>\ndays, and would like to share my rambling thoughts.  They seem to go along<br/>\nwith your questions, perhaps we can come up with some answers together. :-)<br/>\n<br/>\n <br/>\n<br/>\nThe more I embrace the idea of my kids just *living*, as opposed to them<br/>\nconstantly learning, the easier the whole thing becomes for me.  I think the<br/>\nunschooling community talks about natural math in order to illustrate what<br/>\n*can* be learned naturally (which is everything!), instead of it being a<br/>\nchecklist of things that your child *should* be learning naturally.  If you<br/>\ndaughter doesn&#39;t care about measuring cooking ingredients in order to pick<br/>\nup fractions and volumes and such, so what?  If there comes a time in her<br/>\nlife when she needs to know those things in order to do something she wants<br/>\nto do, she&#39;ll learn it.  If she doesn&#39;t ever need it, why should she know<br/>\nabout it?  I imagine there are oodles of math concepts which I know nothing<br/>\nabout, but it doesn&#39;t hinder my life currently.  If it ever came up, I&#39;d<br/>\nlearn the new stuff I needed to know.<br/>\n<br/>\n <br/>\n<br/>\nAs far as drilling and memorization, again, if someone finds that they would<br/>\nlike to have faster access to number results than they currently do, they<br/>\ncan easily find ways to speed their thinking.  But why make those<br/>\ncalcuations quickly if you don&#39;t need to?  I memorized the times tables as a<br/>\nkid (ugh!!!) but I often do not remember what a certain answer is for a<br/>\nmultiplication question in real life.  Certainly I understand what<br/>\nmultiplication is and how it works, so it&#39;s quick work to figure out what I<br/>\nneed to know.  If I had an activity (job, hobby, etc.) that used<br/>\nmultiplication often, I&#39;d likely put some effort toward speeding up my<br/>\ncalculating skills.  No difficulty there, no stress or feeling bad that I<br/>\ncouldn&#39;t do it before.  Just something new to figure out.<br/>\n<br/>\n <br/>\n<br/>\nYou might also want to cut yourself some slack on the differing interest in<br/>\nnumbers between your son and daughter.  Some people love numbers and working<br/>\nthem, some don&#39;t.  Something very funny just happened with my kids (while I<br/>\nwas typing this!) that illustrates this perfectly.  They are playing a game<br/>\non the Xbox, and on that system many games have &quot;achievements&quot; which you can<br/>\nearn for doing certain parts of the game in certain ways.  My older son (8.5<br/>\nyears) adores this and finds it very important to play just the right way in<br/>\norder to unlock the achievements.  My 4.5yo son doesn&#39;t care at all, doesn&#39;t<br/>\neven really understand what it&#39;s all about.  So they are playing together<br/>\nright now, and screaming at each other about what characters to play.  Turns<br/>\nout the 8.5yo wanted to unlock an achievement for the 4.5yo, and was being<br/>\nvery insistent about doing the game a certain way.  I pointed out to him<br/>\nthat not everyone is interested in the same things, and what is of paramount<br/>\nimportance to him might be meangingless for someone else.  He was stunned.<br/>\nWe don&#39;t all want the same things?  Wow, that&#39;s hard to grasp.  I think we<br/>\nall fall into that trap of thinking on occaision. :-)<br/>\n<br/>\n <br/>\n<br/>\nTo make it all more complicated, when you are required to report a child&#39;s<br/>\nlearning to an authority figure this becomes more stressful than it really<br/>\nneeds to be.  That&#39;s where the fear based thinking comes up, and we start<br/>\npushing for our kids to live in ways that are easily documented and<br/>\nconvenient for other people.  But life isn&#39;t like that.  It&#39;s like when my<br/>\nkids were babies and I breastfed them to sleep.  This drove my mom crazy<br/>\nbecause when they stayed with her for a few hours, she found putting them<br/>\ndown for a nap (which she felt they needed at a certain time) was very<br/>\ndifficult, since they were accustomed to nursing to sleep.  She made a big<br/>\nargument for why I should teach them to fall asleep on their own, trying to<br/>\nmake it sound like it was for the child&#39;s benefit.  When really it was for<br/>\n*her* convenience!  I made that clear to her, and she eventually got the<br/>\nidea.  I think reporting our children&#39;s learning is very much like this.  If<br/>\nthey would just do seatwork in a planned way, it was make the reporting so<br/>\nmuch easier!  But that&#39;s for someone else&#39;s convenience, not for my child&#39;s<br/>\nbenefit.  So I figure out the little subject chart as best I can, making it<br/>\na game for myself.  But I work very hard on my own thinking so that I won&#39;t<br/>\nforce my kids into something &quot;educational&quot; so that I can write it on the<br/>\nchart.<br/>\n<br/>\n <br/>\n<br/>\nMy lord, I&#39;ve written a novel here!  But hopefully this will open more ideas<br/>\nfrom everyone on how we think about all of this and how to calm down about<br/>\nit!<br/>\n<br/>\n <br/>\n<br/>\nShell<br/>\n<br/>\n <br/>\n<br/>\n  _____  <br/>\n<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>] On Behalf Of Tina Bragdon<br/>\nSent: Friday, January 18, 2008 8:01 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSubject: [unschoolingbasics] ???&#39;s, how to develop faith about unschooling<br/>\nmath....<br/>\n<br/>\n <br/>\n<br/>\nHi, I am asking these questions as I know many of you have older <br/>\nchildren than mine and the benefit of time and experience, and also <br/>\nasking them in light of &quot;strewing&quot; and if it is manipulative, about <br/>\nteaching vs being a facilitator, and of having faith that unschooling <br/>\nwill be &quot;enough&quot; if that makes any sense.<br/>\n<br/>\nI am having a hard time overcoming my math fears and trying to relax <br/>\nabout it, especially now that dd is of mandatory school age in my <br/>\nprovince and I have to submit progress reports (no actual &quot;evidence&quot;) <br/>\ntwice a year. It has just made my fears hit more close to home. <br/>\nIt&#39;s <br/>\nnot that I am trying to relax from a curriculum I have imposed (we <br/>\nhave <br/>\nnot used any), it&#39;s that I feel so confused and unsure trying to sort <br/>\nout the whole math thing in my mind that I feel I haven&#39;t done near <br/>\nas <br/>\nmuch as I could in helping my kids discover the patterns, <br/>\nrelationships, games, etc that so many unschoolers say math is.<br/>\n<br/>\nI am in the process of reading Math Power by Patricia Kenschaft after <br/>\nhearing Pam Sooroshian talk about it on tape. It has been great in <br/>\nshowing me about the &quot;language&quot; of math, incorporating it in real <br/>\nlife, <br/>\netc, and doing this seems so &quot;easy&quot; with ds as he has recently become <br/>\nvery interested in counting everything, the clock, obviously DELIGHTS <br/>\nin numbers/quantity and how it can change, all that sort of stuff, <br/>\nand <br/>\ndue to reading this book I feel more able to &quot;facilitate&quot; an explore <br/>\nthis with him. It feels &quot;natural&quot; to point it out to him.<br/>\n<br/>\nWith dd however I feel like I missed that boat in a way as (ok, I <br/>\nknow <br/>\nit is a schooly comparison but it is for puroposes of illustration <br/>\nfor <br/>\nyou all) she would maybe have a kindy-gr 1 level of understanding in <br/>\nmath, I know it is just from talking about what we see in everyday <br/>\nlife, cooking, reading a book, she knows &quot;intuitively&quot; somehow what <br/>\nis <br/>\nbigger, which thing is 3rd in line, etc and that has all &quot;gelled&quot; <br/>\nover <br/>\na period of the last few years, but I guess I have nothing &quot;ongoing&quot; <br/>\nat <br/>\nthe moment to show me how unschooling math &quot;works&quot;, or how she can <br/>\nget <br/>\nfarther along in it. With reading for example, I can see how all the <br/>\nplaying Starfall she was attracted to and being read to and fiddling <br/>\nwith alphabet letters <br/>\non the fridge and CONSTANTLY asking what things say has led to her <br/>\nreading, and the same now slowly with writing and spelling, because <br/>\nshe &quot;needs&quot; them to for the things she wants to do (write on her <br/>\npictures, do a comic strip and such) My faith in her reading without <br/>\nlessons developed at the same time I could see reading happening, one <br/>\nfeeding off the other y&#39;know?<br/>\n<br/>\nI know this is all because dd is &quot;school age&quot; now. I also have a <br/>\nhard <br/>\ntime not fretting about the arithmetic/4 basic operations aspect of <br/>\nmath. Yes I know dd ps&#39;ed peers play with blocks and rods, etc BUT <br/>\nwith the agenda and learning objectives the teacher expects of them <br/>\nI <br/>\nremember drill and being expected to memorize and crying becuse I <br/>\ncould not understand the &quot;why&quot; of borrowing! Does a gr 2&#39;er need to <br/>\nmememorize addition facts or just understand what it is? I have in <br/>\nall <br/>\nmy reading online about unschooling math rarely seen the whole <br/>\ncompetency and speed at &quot;computing&quot; issue addressed, especially with <br/>\nolder unschoolers. I guess I am thinking does playing dice for YEARS <br/>\nteach you enough math to get by as an adult (the everday consumer <br/>\nmath, <br/>\nnot algebra or anything!) <br/>\n<br/>\nYes, you hear stories of unschoolers being shown what &quot;long division&quot; <br/>\nis at 13 because it just &quot;came up&quot; and then they &quot;get it&quot; without all <br/>\nthose years of school math drill, but does being shown it once or <br/>\ntwice <br/>\nlead to skill? Does it need to? I just remember all those years of <br/>\nbeing made to practice over and over again. Again this is something <br/>\nI have never <br/>\nseen addressed online by my fellow unschoolers.<br/>\n<br/>\nDD can sense any sort of &quot;this is meant to teach you...&#39;this&#39;&quot; I <br/>\nthink. I have so many sites bookmarked, I have so many books like <br/>\nFamily Math for Young Children, Games for Math by Penny Kaye sitting <br/>\non <br/>\nthe shelf pretty much unused because I can&#39;t balance the just doing <br/>\nit <br/>\nwith her because it is &quot;neat&quot; and a fun game, with the fear that if <br/>\nshe <br/>\ndoesn&#39;t &quot;practice&quot; or do the &quot;dice game&quot; enough she won&#39;t &quot;have her <br/>\nfacts down&quot;. I see so many math things like computer games, <br/>\nworkbooks, <br/>\netc that are thinly disguised drill, like those dollar-store-books <br/>\nthat <br/>\nhave comparing numbers of 3 types of toys and drawing a circle graph <br/>\n(gr 2 curriculum in my province BTW), or adding 45+3 in picture <br/>\nform. <br/>\nMy dd would look at something like that and thing &quot;what the heck <br/>\nfor?&quot; <br/>\nIs that even relevant to a 7 yr old? LOL even a writing workbook <br/>\ngiven <br/>\nto her by my MIL turned her off, I didn&#39;t care and just let her go at <br/>\nit on blank paper and she learned to write, it&#39;s like she sees <br/>\nthe &quot;expectations&quot; of workbooks and the more structured stuff loud <br/>\nand <br/>\nclear.<br/>\n<br/>\nWhere does introducing stuff fall into place in light of being an <br/>\nunschooler? What about strewing? I know bigger numbers have come up <br/>\nin our lives, do I get Cusinaire rods or something, not to do <br/>\nthe exercises &quot;everyday at the same time&quot; like my structured hs-ing <br/>\nfriends do but to <br/>\nhave as a resource around to show her place value or comparing 10 to <br/>\n100 say if it came up, just to &quot;have it there?&quot; OR would that be too <br/>\nmuch manipulation and expectation? I guess I am having a hard time <br/>\nhaving &quot;resources&quot; around without the fears and concerns she is <br/>\nnot &quot;using&quot; it if that makes any sense.<br/>\n<br/>\nSorry this is so long and so jumbled as I pour this out. I am so <br/>\nconfused in this area. I am looking for personal stories especially <br/>\nfrom you with older kids, and for a kick in the butt, and for <br/>\nsuggestion as to how to relax.<br/>\n<br/>\nTina, dp James, dd Stephanie (7) and ds Jonathan (4) here in Manitoba <br/>\nCanada<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224117939,"authorName":"Tina Bragdon","from":"&quot;Tina Bragdon&quot; &lt;jamesandtina942@...&gt;","profile":"crazycanuckgurl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"???&#39;s, how to develop faith about unschooling math....","postDate":"1200672065","msgId":28906,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZtcWlnMStuaDNlQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":28909,"prevInTime":28905,"nextInTime":28907,"topicId":28906,"numMessagesInTopic":0,"msgSnippet":"Hi, I am asking these questions as I know many of you have older children than mine and the benefit of time and experience, and also asking them in light of","messageBody":"<div id=\"ygrps-yiv-1997666785\">Hi, I am asking these questions as I know many of you have older <br/>\nchildren than mine and the benefit of time and experience, and also <br/>\nasking them in light of &quot;strewing&quot; and if it is manipulative, about <br/>\nteaching vs being a facilitator, and of having faith that unschooling <br/>\nwill be &quot;enough&quot; if that makes any sense.<br/>\n<br/>\nI am having a hard time overcoming my math fears and trying to relax <br/>\nabout it, especially now that dd is of mandatory school age in my <br/>\nprovince and I have to submit progress reports (no actual &quot;evidence&quot;) <br/>\ntwice a year.  It has just made my fears hit more close to home.  <br/>\nIt&#39;s <br/>\nnot that I am trying to relax from a curriculum I have imposed (we <br/>\nhave <br/>\nnot used any), it&#39;s that I feel so confused and unsure trying to sort <br/>\nout the whole math thing in my mind that I feel I haven&#39;t done near <br/>\nas <br/>\nmuch as I could in helping my kids discover the patterns, <br/>\nrelationships, games, etc that so many unschoolers say math is.<br/>\n<br/>\nI am in the process of reading Math Power by Patricia Kenschaft after <br/>\nhearing Pam Sooroshian talk about it on tape.  It has been great in <br/>\nshowing me about the &quot;language&quot; of math, incorporating it in real <br/>\nlife, <br/>\netc, and doing this seems so &quot;easy&quot; with ds as he has recently become <br/>\nvery interested in counting everything, the clock, obviously DELIGHTS <br/>\nin numbers/quantity and how it can change, all that sort of stuff, <br/>\nand <br/>\ndue to reading this book I feel more able to &quot;facilitate&quot; an explore <br/>\nthis with him.  It feels &quot;natural&quot; to point it out to him.<br/>\n<br/>\nWith dd however I feel like I missed that boat in a way as (ok, I <br/>\nknow <br/>\nit is a schooly comparison but it is for puroposes of illustration <br/>\nfor <br/>\nyou all) she would maybe have a kindy-gr 1 level of understanding in <br/>\nmath, I know it is just from talking about what we see in everyday <br/>\nlife, cooking, reading a book, she knows &quot;intuitively&quot; somehow what <br/>\nis <br/>\nbigger, which thing is 3rd in line, etc and that has all &quot;gelled&quot; <br/>\nover <br/>\na period of the last few years, but I guess I have nothing &quot;ongoing&quot; <br/>\nat <br/>\nthe moment to show me how unschooling math &quot;works&quot;, or how she can <br/>\nget <br/>\nfarther along in it.  With reading for example, I can see how all the <br/>\nplaying Starfall she was attracted to and being read to and fiddling <br/>\nwith alphabet letters <br/>\non the fridge and CONSTANTLY asking what things say has led to her <br/>\nreading, and the same now slowly with writing and spelling, because <br/>\nshe &quot;needs&quot; them to for the things she wants to do (write on her <br/>\npictures, do a comic strip and such) My faith in her reading without <br/>\nlessons developed at the same time I could see reading happening, one <br/>\nfeeding off the other y&#39;know?<br/>\n<br/>\n<br/>\nI know this is all because dd is &quot;school age&quot; now.  I also have a <br/>\nhard <br/>\ntime not fretting about the arithmetic/4 basic operations aspect of <br/>\nmath.  Yes I know dd ps&#39;ed peers play with blocks and rods, etc BUT <br/>\nwith the agenda and learning objectives the teacher expects of them  <br/>\nI <br/>\nremember drill and being expected to memorize and crying becuse I <br/>\ncould not understand the &quot;why&quot; of borrowing!  Does a gr 2&#39;er need to <br/>\nmememorize addition facts or just understand what it is? I have in <br/>\nall <br/>\nmy reading online about unschooling math rarely seen the whole <br/>\ncompetency and speed at &quot;computing&quot; issue addressed, especially with <br/>\nolder unschoolers.  I guess I am thinking does playing dice for YEARS <br/>\nteach you enough math to get by as an adult (the everday consumer <br/>\nmath, <br/>\nnot algebra or anything!)  <br/>\n<br/>\nYes, you hear stories of unschoolers being shown what &quot;long division&quot; <br/>\nis at 13 because it just &quot;came up&quot; and then they &quot;get it&quot; without all <br/>\nthose years of school math drill, but does being shown it once or <br/>\ntwice <br/>\nlead to skill? Does it need to? I just remember all those years of <br/>\nbeing made to practice over and over again.  Again this is something <br/>\nI have never <br/>\nseen addressed online by my fellow unschoolers.<br/>\n<br/>\nDD can sense any sort of &quot;this is meant to teach you...&#39;this&#39;&quot; I <br/>\nthink.  I have so many sites bookmarked, I have so many books like <br/>\nFamily Math for Young Children, Games for Math by Penny Kaye sitting <br/>\non <br/>\nthe shelf pretty much unused because I can&#39;t balance the just doing <br/>\nit <br/>\nwith her because it is &quot;neat&quot; and a fun game, with the fear that if <br/>\nshe <br/>\ndoesn&#39;t &quot;practice&quot; or do the &quot;dice game&quot; enough she won&#39;t &quot;have her <br/>\nfacts down&quot;. I see so many math things like computer games, <br/>\nworkbooks, <br/>\netc that are thinly disguised drill, like those dollar-store-books <br/>\nthat <br/>\nhave comparing numbers of 3 types of toys and drawing a circle graph <br/>\n(gr 2 curriculum in my province BTW), or adding 45+3 in picture <br/>\nform.  <br/>\nMy dd would look at something like that and thing &quot;what the heck <br/>\nfor?&quot;  <br/>\nIs that even relevant to a 7 yr old? LOL even a writing workbook <br/>\ngiven <br/>\nto her by my MIL turned her off, I didn&#39;t care and just let her go at <br/>\nit on blank paper and she learned to write, it&#39;s like she sees <br/>\nthe &quot;expectations&quot; of workbooks and the more structured stuff loud <br/>\nand <br/>\nclear.<br/>\n<br/>\nWhere does introducing stuff fall into place in light of being an <br/>\nunschooler?  What about strewing?  I know bigger numbers have come up <br/>\nin our lives, do I get Cusinaire rods or something, not to do <br/>\nthe exercises &quot;everyday at the same time&quot; like my structured hs-ing <br/>\nfriends do but to <br/>\nhave as a resource around to show her place value or comparing 10 to <br/>\n100 say if it came up, just to &quot;have it there?&quot;  OR would that be too <br/>\nmuch manipulation and expectation?  I guess I am having a hard time <br/>\nhaving &quot;resources&quot; around without the fears and concerns she is <br/>\nnot &quot;using&quot; it if that makes any sense.<br/>\n<br/>\nSorry this is so long and so jumbled as I pour this out.  I am so <br/>\nconfused in this area.  I am looking for personal stories especially <br/>\nfrom you with older kids, and for a kick in the butt, and for <br/>\nsuggestion as to how to relax.<br/>\n<br/>\nTina, dp James, dd Stephanie (7) and ds Jonathan (4) here in Manitoba <br/>\nCanada</div>","specialLinks":[]}],"prevTopicId":28945,"nextTopicId":28985}}