{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Anybody willing to help me with unschooling a reluctant teen in MN?","postDate":"1305298991","msgId":46703,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlxamg3Zis2YWtnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlxaGU3Mys4cTNyQGVHcm91cHMuY29tPg=="},"prevInTopic":46702,"nextInTopic":0,"prevInTime":46702,"nextInTime":46704,"topicId":46697,"numMessagesInTopic":0,"msgSnippet":"... ********************* How old are you kids? Sounds like one is (hmmm, gotta do the math) 16, one older, at least one young child - any others? If you have","messageBody":"<div id=\"ygrps-yiv-1537886798\">&quot;Heidi&quot; &lt;hotcoolings@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; So I think about how I would LIKE us to be--relaxed more, child-led, but I have a hard time letting go and trusting that my children will be able to meet graduation standards.  How are you guys getting past that stress?<br/>\n </span></blockquote>*********************<br/>\n<br/>\nHow old are you kids? Sounds like one is (hmmm, gotta do the math) 16, one older, at least one young child - any others? If you have teens, their educational priorities are pretty important - to them graduation is looming and they are panicking that you aren&#39;t providing enough help. If your kids don&#39;t seem like they want to unschool, it won&#39;t help to look for ways to convince them - they&#39;re likely to think you&#39;ve either given up on them or gone off the deep end. Looking into getting them a tutor would likely be your best bet if you no longer have time to actively home-educate.<br/>\n<br/>\nIf you *do* have time to be home with them, look into home-ed options that allow them to build more independence. This isn&#39;t a good place to ask about that! Try looking at some eclectic home-ed sites.<br/>\n<br/>\nIf you have younger kids, look into the standards for whatever year they are now - are they more-or-less on track with that? If they are, then take a breath and step back from academics for awhile. Tell them you want to take a break from all that and re-think how you want to homeschool in the future. Spend the summer reading about unschooling and doing lots and lots of fun, summer-vacationy things with your family. Then in the fall you&#39;ll be better set up for thinking and talking clearly about how people really learn. <br/>\n<br/>\nIf you want to be more relaxed, look for ways to say yes more. Look for ways to be kinder and more thoughtful to your kids. Try harder to see things from their point of view, even if yo don&#39;t agree with it. Treat them as friends - good friends whose thoughts and feelings you value, and be the best possible friend you can to them. <br/>\n<br/>\nDon&#39;t dive into unschooling all at once, ease in! You can start with tv and games, since they&#39;ve been exploring that area, and stepping back from your time limits when you&#39;re home. Hang out with your kids while they&#39;re playing games - not all day long, but drop in with a snack, watch for awhile, applaud some successes and commiserate over some losses. Do the same when kids are watching shows and movies - drop in and socialize. Use the time to touch base and connect a little more. Other than that, look for plenty of other ways to connect with your kids - what do they like to do? Do more With them. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"kids need more attention","postDate":"1305297494","msgId":46702,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlxamZvbStvMjk4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlxaGU3Mys4cTNyQGVHcm91cHMuY29tPg=="},"prevInTopic":46699,"nextInTopic":46703,"prevInTime":46701,"nextInTime":46703,"topicId":46697,"numMessagesInTopic":0,"msgSnippet":"... ***************** If you ve been leaving your kids alone for hours and hours at a time and not finding ways to make that up to them later, then he has a","messageBody":"<div id=\"ygrps-yiv-662846501\">&quot;Heidi&quot; &lt;hotcoolings@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I think he gave up asking me for help with his school (kind of a good thing for independence), but he even frustratedly exclaimed one day:  &quot;It isn&#39;t like you care if I get it done, anyway!&quot;.  <br/>\n </span></blockquote>*****************<br/>\n<br/>\nIf you&#39;ve been leaving your kids alone for hours and hours at a time and not finding ways to make that up to them later, then he has a point. It doesn&#39;t sound like you have been unschooling at all just letting things slide - and that&#39;s not good for your kids. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; While I trust their judgement in the videos, our &quot;2 hour per day&quot; limit of screentime excelled probably 6 hours some days!  I am ashamed--not that I feel that NOBODY should do this, but I don&#39;t want it for my children.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nIf tv and games have been limited, its perfectly reasonable for them to use this opportunity to pack in as much of those things as they possibly can. That&#39;s a natural effect of limits, they make whatever is limited more valuable. And since you aren&#39;t unschooling (maybe deschooling, maybe just letting things slide) they know they need to get as much as they can, too. They don&#39;t know when you&#39;ll suddenly put the breaks on again. If they build up a degree of trust that the rules won&#39;t come crashing down on them, that they really are the authors of their own decisions, then its likely they&#39;ll watch less tv and play less games eventually, unless they find a passion for something in particular. <br/>\n<br/>\nBut if you really want them to do something else, you need to make other things More appealing than this marvelous luxury item. That requires direct presence and engagement on your part. <br/>\n<br/>\nIt might be better, rather than thinking about unschooling, to think of this as a transitional period for your family while you figure out how to integrate a new child into the mix. It sounds like you need more help - either to help you with the new child or to help with the other kids or some combination. That could be a mothers&#39; helper, a nanny, a tutor, someone to take the new child to appointments, even school could be part of the solution - either for one of your older kids or the new child or some combination. <br/>\n<br/>\nMaybe one or more of your kids will eventually find unschooling a valuable part of his or her life, but if one of your kids is saying &quot;you don&#39;t care about me&quot; then it is imperative that you deal with That issue right away! Love is meaningless if your child doesn&#39;t feel it flowing from you in tangible ways. <br/>\n<br/>\nI&#39;ll answer other parts of this in another post, as they&#39;re sort of a different topic. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Anybody willing to help me with unschooling a reluctant teen in MN?","postDate":"1305241351","msgId":46699,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUwMkI2OUQwLUVGM0MtNDJBRS1CNjM2LTA4ODc3OTdGMThCMUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGlxaGU3Mys4cTNyQGVHcm91cHMuY29tPg==","referencesHeader":"PGlxaGU3Mys4cTNyQGVHcm91cHMuY29tPg=="},"prevInTopic":46698,"nextInTopic":46702,"prevInTime":46698,"nextInTime":46700,"topicId":46697,"numMessagesInTopic":0,"msgSnippet":"... Radical unschooling is extending the principles of unschooling into parenting, not extreme not doing school. ... It sounds like you re putting your","messageBody":"<div id=\"ygrps-yiv-1063186829\">On May 12, 2011, at 3:59 PM, Heidi wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; this past year would have to be considered RADICAL unschooling<br/>\n<br/>\n<br/>\n </span></blockquote>Radical unschooling is extending the principles of unschooling into  <br/>\nparenting, not extreme &quot;not doing school.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Now, the 10th grade boy is uptight. Although he&#39;d rather do NOTHING  <br/>\n&gt; all day, he wants to be accountable to graduation standards for our  <br/>\n&gt; state. I think he gave up asking me for help with his school (kind  <br/>\n&gt; of a good thing for independence), but he even frustratedly  <br/>\n&gt; exclaimed one day: &quot;It isn&#39;t like you care if I get it done, anyway!&quot;<br/>\n<br/>\n </span></blockquote>It sounds like you&#39;re putting your desires for him ahead of his for  <br/>\nhimself. How is that different than parents sending their kids to  <br/>\nschool against their wishes? The schooling parents believe they&#39;re  <br/>\ndoing what&#39;s best for their kids so they make the kids comply. No  <br/>\nmatter how great the thing someone&#39;s being made to do, if they don&#39;t  <br/>\nhave a choice, the benefits pretty much evaporate.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What I would like<br/>\n<br/>\n<br/>\n </span></blockquote>What would he like?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  but I have a hard time letting go and trusting that my children  <br/>\n&gt; will be able to meet graduation standards. How are you guys getting  <br/>\n&gt; past that stress?<br/>\n<br/>\n </span></blockquote>The goal of unschooling isn&#39;t meeting some external &quot;graduation  <br/>\nstandards&quot;. Part of the process of any form of homeschooling is  <br/>\nmeeting the letter of the law in your state.<br/>\n<br/>\nWhen he&#39;s beyond the age range for public school, you can declare him  <br/>\ngraduated.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; While I trust their judgement in the videos, our &quot;2 hour per day&quot;  <br/>\n&gt; limit of screentime excelled probably 6 hours some days! I am  <br/>\n&gt; ashamed--not that I feel that NOBODY should do this, but I don&#39;t  <br/>\n&gt; want it for my children.<br/>\n<br/>\n </span></blockquote>If kids are choosing learning from movies, video games and so forth  <br/>\nfrom a rich environment with an attentive mother, then that&#39;s what  <br/>\nthey need for learning. It&#39;s how they learn best.<br/>\n<br/>\nBut what it sounds like is they chose movies as the best option in an  <br/>\nenvrionment where you weren&#39;t there to help them and keep things  <br/>\nrunning through their lives, opening doors, bringing things to them,  <br/>\nbringing them to things.<br/>\n<br/>\nYour family did what it had to do while your child was sick. And I&#39;m  <br/>\nsure they learned tons! (Many unschoolers have had ended up  <br/>\nunschooling because of similar experiences with medical issues that  <br/>\nleft them finding things to do while parents were occupied.) But mom  <br/>\nleaving kids to explore all on their own shouldn&#39;t be seen as  <br/>\nunschooling. Unschooling is being more connect, more in tune with your  <br/>\nkids and their interests. It&#39;s very definitely not hands off!<br/>\n<br/>\nUnschooling is often about coming at things sideways rather than a  <br/>\ndirect path. We don&#39;t get kids to be polite by making them be polite.  <br/>\nUschooling parents immerse kids in a home where the parents are polite  <br/>\n(especially with them) because the parents value it.<br/>\n<br/>\nIf you want him to value following his interests, you need to support  <br/>\nhis interests. Help him explore all his interests. Open lots of doors  <br/>\nrather than trying to steer him towards particular doors, especially  <br/>\nnot closing off doors he thinks are right.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Anybody willing to help me with unschooling a reluctant teen in MN?","postDate":"1305237463","msgId":46698,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlxaGw0bitwbG51QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlxaGU3Mys4cTNyQGVHcm91cHMuY29tPg=="},"prevInTopic":46697,"nextInTopic":46699,"prevInTime":46697,"nextInTime":46699,"topicId":46697,"numMessagesInTopic":0,"msgSnippet":"It sounds like a pretty horrible idea to me. Can you sit down and talk to him and get a plan together that he wants and that you can live with? Can you find","messageBody":"<div id=\"ygrps-yiv-591361458\">It sounds like a pretty horrible idea to me. Can you sit down and talk to him and get a plan together that he wants and that you can live with?<br/>\n<br/>\nCan you find out what the options are for high schoolers in your area beyond using a curriculum or not? Virtual school? Dual enrollment? Volunteering? <br/>\n<br/>\nAnd find out if you really need to worry about meeting high school standards -- public high school rules don&#39;t necessarily apply to hsers, depending on your state.<br/>\n<br/>\nAnd Google Valerie Moon&#39;s website -- Military Homeschoolers or something like that -- and find out what he will need if the military is a real choice.<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Heidi&quot; &lt;hotcoolings@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; All of our children have been homeschooled.  None of honestly been &quot;unschooled&quot;, although this past year would have to be considered RADICAL unschooling.  We adopted a special needs child who has ended up being an incredible amount of work, and many, many appointments outside the home this school year.<br/>\n&gt; <br/>\n&gt; Enter UNSCHOOLING:  an unschooling friend of mine with very small children, reminded me that basically, that was what happened this year anyway!  LOL!  All kidding aside I am a rule follower--so it is hard to not have anything to say we really &quot;did&quot;.  We did not finish ONE curriculum item this year.  My kids ended up spending a lot of time hanging around, and I am pretty certain but never asked:  video games and lots of NetFlix while I was gone.  While I trust their judgement in the videos, our &quot;2 hour per day&quot; limit of screentime excelled probably 6 hours some days!  I am ashamed--not that I feel that NOBODY should do this, but I don&#39;t want it for my children.<br/>\n&gt; <br/>\n&gt; Now, the 10th grade boy is uptight.  Although he&#39;d rather do NOTHING all day, he wants to be accountable to graduation standards for our state.  I think he gave up asking me for help with his school (kind of a good thing for independence), but he even frustratedly exclaimed one day:  &quot;It isn&#39;t like you care if I get it done, anyway!&quot;.  <br/>\n&gt; <br/>\n&gt; What I would like is when he is in 11th grade next year, provide materials for graduation standards that are more interesting to stay with for both of us (when on the few times per week I can do things like science with him).  But when I mention unschooling--he panics because he has &quot;heard of them&quot; (unschoolers), and it was always in a negative tone.  <br/>\n&gt; <br/>\n&gt; He wishes to go to college, possibly military but definitely college, and would like to go for law enforcement or something related to it.  His older sister keeps reminding him, &#39;Make Mom teach you about writing reports and essays, because I had to learn it on my own!&#39;.  When I mentioned that to my unschooling friend with small children, she stated, &quot;I was an English major and NONE of us college freshmen knew how to write an essay, and we were from public school!&quot;.  <br/>\n&gt; <br/>\n&gt; So I think about how I would LIKE us to be--relaxed more, child-led, but I have a hard time letting go and trusting that my children will be able to meet graduation standards.  How are you guys getting past that stress?  <br/>\n&gt; <br/>\n&gt; Any suggestions on what I could do for my 16 year old, to unschool him without him understanding that is where we are?  LOL!<br/>\n&gt; <br/>\n&gt; Heidi in MN<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":223800287,"authorName":"Heidi","from":"&quot;Heidi&quot; &lt;hotcoolings@...&gt;","profile":"hotcoolings","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Anybody willing to help me with unschooling a reluctant teen in MN?","postDate":"1305230371","msgId":46697,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlxaGU3Mys4cTNyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":46698,"prevInTime":46696,"nextInTime":46698,"topicId":46697,"numMessagesInTopic":0,"msgSnippet":"All of our children have been homeschooled.  None of honestly been unschooled , although this past year would have to be considered RADICAL unschooling.  We","messageBody":"<div id=\"ygrps-yiv-754683010\">All of our children have been homeschooled.  None of honestly been &quot;unschooled&quot;, although this past year would have to be considered RADICAL unschooling.  We adopted a special needs child who has ended up being an incredible amount of work, and many, many appointments outside the home this school year.<br/>\n<br/>\nEnter UNSCHOOLING:  an unschooling friend of mine with very small children, reminded me that basically, that was what happened this year anyway!  LOL!  All kidding aside I am a rule follower--so it is hard to not have anything to say we really &quot;did&quot;.  We did not finish ONE curriculum item this year.  My kids ended up spending a lot of time hanging around, and I am pretty certain but never asked:  video games and lots of NetFlix while I was gone.  While I trust their judgement in the videos, our &quot;2 hour per day&quot; limit of screentime excelled probably 6 hours some days!  I am ashamed--not that I feel that NOBODY should do this, but I don&#39;t want it for my children.<br/>\n<br/>\nNow, the 10th grade boy is uptight.  Although he&#39;d rather do NOTHING all day, he wants to be accountable to graduation standards for our state.  I think he gave up asking me for help with his school (kind of a good thing for independence), but he even frustratedly exclaimed one day:  &quot;It isn&#39;t like you care if I get it done, anyway!&quot;.  <br/>\n<br/>\nWhat I would like is when he is in 11th grade next year, provide materials for graduation standards that are more interesting to stay with for both of us (when on the few times per week I can do things like science with him).  But when I mention unschooling--he panics because he has &quot;heard of them&quot; (unschoolers), and it was always in a negative tone.  <br/>\n<br/>\nHe wishes to go to college, possibly military but definitely college, and would like to go for law enforcement or something related to it.  His older sister keeps reminding him, &#39;Make Mom teach you about writing reports and essays, because I had to learn it on my own!&#39;.  When I mentioned that to my unschooling friend with small children, she stated, &quot;I was an English major and NONE of us college freshmen knew how to write an essay, and we were from public school!&quot;.  <br/>\n<br/>\nSo I think about how I would LIKE us to be--relaxed more, child-led, but I have a hard time letting go and trusting that my children will be able to meet graduation standards.  How are you guys getting past that stress?  <br/>\n<br/>\nAny suggestions on what I could do for my 16 year old, to unschool him without him understanding that is where we are?  LOL!<br/>\n<br/>\nHeidi in MN</div>","specialLinks":[]}],"prevTopicId":46625,"nextTopicId":46704}}