{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":172077574,"authorName":"Robin LaRoy","from":"Robin LaRoy &lt;robinlaroy@...&gt;","profile":"robinlaroy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Just starting out...","postDate":"1270467593","msgId":43573,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU1NTAzLjg4NDEzLnFtQHdlYjUwODA3Lm1haWwucmUyLnlhaG9vLmNvbT4=","inReplyToHeader":"PDc1NTYwNThGNjY2RjQzMjM5NTkwN0JENzlDNjdDMTM0QGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PGhwNWQzMStwdWZ2QGVHcm91cHMuY29tPiA8NzU1NjA1OEY2NjZGNDMyMzk1OTA3QkQ3OUM2N0MxMzRAZGVib3JhaDQzZjEzZmQ+"},"prevInTopic":43571,"nextInTopic":0,"prevInTime":43572,"nextInTime":43574,"topicId":43566,"numMessagesInTopic":0,"msgSnippet":"Wow...  Thanks for all the responses.  They are helping. Deb, what you said was really great. Unschooled kids can avoid people who are critical of them.  Kids","messageBody":"<div id=\"ygrps-yiv-481698210\">Wow...  Thanks for all the responses.  They are helping.  <br/>\n<br/>\nDeb, what you said was really great. <br/>\n&quot;Unschooled kids can avoid people who are critical of them.  Kids in <br/>\nschool can&#39;t.  If a kid is the target of bullies in school there&#39;s nothing he can do <br/>\nabout it.   Kids who don&#39;t go to school never have to be forced into a <br/>\nsituation where they have to deal with bullies.&quot;<br/>\n<br/>\nIt&#39;s great to think of it this way.  I mean even if we join a sports team or art class, etc, down the road, if feel strange about J or S being homeschooled, we aren&#39;t stuck in that class like we would be at school.  <br/>\n<br/>\n&quot;Your kids are really young.  If they want to play sports there may be <br/>\nhomeschool group sports in your area or they might choose school.   Kids don&#39;t have to go to school all along to play football on a high school <br/>\nteam when they&#39;re fifteen, they can go to school when they&#39;re fifteen.&quot;<br/>\n<br/>\nAnd I keep telling him this, too.  Because right now I haven&#39;t even gotten into unschooling with him, just homeschooling.  I don&#39;t think he could handle fully grasping unschooling right now.  But I say, this isn&#39;t a choice we are making now and continuing through high school graduation.  This is a choice we can make all the time and at any time we can choose that it isn&#39;t right for us anymore and enroll the kids in public school at ANY time.  <br/>\n<br/>\nAnd Bonni mentioned:<br/>\n&quot;Can you find other unschoolers that you can invite over? Maybe <br/>\nhomeschoolers? Be patient. Don&#39;t talk to him as if you have all the <br/>\nanswers. Mine hates when we argue about something and I *know* I&#39;m <br/>\nright. I don&#39;t know I&#39;m right, but I do feel very strongly about it.&quot;<br/>\n<br/>\nWe do know a few homeschoolers and some of them are on the unschooling path and on this list I think. :)  But the group of moms I usually that I hang out with isn&#39;t a mainstream group of mamas and sometimes I think my DH just wants to be middle ground.  Honestly, I think he is still impacted by his high school years of staying in middle group because it was the safest place to be.  He wasn&#39;t popular, but he also wasn&#39;t criticized. And he was an excellent baseball player.  I am trying to figure out ways to encourage him to actually explore why he feels the way he does. <br/>\n<br/>\nAnd Meredith said...<br/>\n&quot;Check with other area homeschoolers and find out what they do. It <br/>\nvaries. In my area homeschoolers often try out for and join sports teams at the private schools. In other areas public schools are required to <br/>\nlet homeschoolers in the same district join extracurricular activities. And in some <br/>\nplaces there are groups set up by and for homeschoolers.&quot;<br/>\n<br/>\nI think I will send an email out to the local homeschool group and see if I can find a few examples of high school aged kids playing sports.  I only know homeschoolers with elementary and young middle school aged kids.  Maybe finding a few families dealing with the sports and extra curricular activity problem and see how they are managing would help him.  <br/>\n<br/>\nAnd Nance...<br/>\n&quot;Only our personal experience, but the only &quot;stigma&quot; DD has experienced <br/>\nafter unschooling her way through life until she decided to go to public school this year -- 9th grade -- is that she is seen as bright and <br/>\nambitious because she actually does her school work and cares about <br/>\ndoing it well. &quot;<br/>\n<br/>\nI am glad to see someone starting public school in 9th grade and doing well.  It&#39;s good to know that is an option.  I think that will mean a lot to DH.<br/>\n<br/>\nThanks for all your help!<br/>\n<br/>\nAnyone have any great books they recommend for DH to read, or even better a podcast or something he can listen to on the way to work?<br/>\n<br/>\nRobin<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Just starting out...","postDate":"1270394655","msgId":43571,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1NTYwNThGNjY2RjQzMjM5NTkwN0JENzlDNjdDMTM0QGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PGhwNWQzMStwdWZ2QGVHcm91cHMuY29tPg=="},"prevInTopic":43570,"nextInTopic":43573,"prevInTime":43570,"nextInTime":43572,"topicId":43566,"numMessagesInTopic":0,"msgSnippet":"***What did you do to convince your partner ...*** David (dh) and I started together with the idea that we wouldn t make Dylan go to school.   I was the one","messageBody":"<div id=\"ygrps-yiv-1036664565\">***What did you do to convince your partner ...***<br/>\n<br/>\nDavid (dh) and I started together with the idea that we wouldn&#39;t make Dylan go to school.   I was the one home with Dylan all the time so what we did instead of school was left to me.  David had doubts about unschooling, questions, concerns.  There were things that made him uncomfortable.   David has gone along peaceably with unschooling all these years.  That little boy we didn&#39;t send to Kindergarten will be eighteen in May. <br/>\n<br/>\nLearn all you can about unschooling.  Really understand how learning happens.  Your confidence will help your partner have confidence in you.<br/>\nBe a logical person, be rational, don&#39;t ask your partner to have faith in your crazy ideas, provide evidence that your ideas, while unusual, are not crazy at all. <br/>\nWhen your partner has concerns listen to them and do something to alleviate them.   If your partner thinks the kids aren&#39;t doing enough, get out and do more.  Go to the park, play in the yard, build something, paint something, plant something, dig something.  <br/>\nShare good things.  Talk about what the kids are doing.  Share good articles or email list posts.  Share good bits from books. <br/>\nDon&#39;t give your partner a reason to be worried.   Be happy yourself, be ambitious and active.   Be positive.  Be interesting and be interested.  <br/>\nIf you want your partner to trust you to make this pretty unusual choice for your kids you have to face up to the responsibility of that.   If you&#39;re a mess emotionally or if you&#39;re not happy or motivated then you can&#39;t help your partner be comfortable with unschooling and you can&#39;t be a good unschooling mom.   So, a really important part of this is taking responsibility.   If you&#39;re going to keep your kids out of school, home has to be better than school and it&#39;s up to you to make sure your partner can see that it&#39;s better.  <br/>\n<br/>\n***He isn&#39;t worried about the kids learning their abc&#39;s etc, but more about school sports teams...***<br/>\n<br/>\nYour kids are really young.  If they want to play sports there may be homeschool group sports in your area or they might choose school.   Kids don&#39;t have to go to school all along to play football on a high school team when they&#39;re fifteen, they can go to school when they&#39;re fifteen. &lt;g&gt; <br/>\n<br/>\n*** and the kids being stigmatized for being homeschooled.***<br/>\n<br/>\nBy other kids, do you mean?  That didn&#39;t happen to Dylan.   Kids were mostly curious and envious of the idea of a life without school.   Relatives were critical in the beginning and the children of the critical relatives were critical (mostly because they heard what their parents said about us)  but other kids, kids in Karate classes (or whatever) were cool with it.    He had more comments on his long hair than on not attending school. &lt;g&gt;  <br/>\n<br/>\nUnschooled kids can avoid people who are critical of them.  Kids in school can&#39;t.  If a kid is the target of bullies in school there&#39;s nothing he can do about it.   Kids who don&#39;t go to school never have to be forced into a situation where they have to deal with bullies.  <br/>\n<br/>\nAdults (who weren&#39;t related to us) were seldom critical.  It helped that homeschooled kids were winning spelling bees and geography bees in those days,   People were thinking homeschooled kids were &quot;ahead&quot; of public schooled kids.   I don&#39;t know what people think these days, it&#39;s been so long since we&#39;ve been questioned about what we do.   But generally, people in the community who see your happy kids frequently are going to think they&#39;re ok.  Our experience was that people in the community were really eager to share with Dylan because he seemed so eager to hear what they had to share.    He had special privileges at the bookstore, got to dig through the boxes of new books in the back room, had certain authors saved especially for him, etc.  I think the librarian called him at least once a week to offer some new thing she had.  The county extension agent called him if he found a cool bug, the vet called him when something interesting was going on.  The lady who owned the flower shop would let him hold her Cockatiels.  Your kids will have the opportunity to make friends with all kinds of people of all ages, not just kids their own age who are stuck in school all day.  <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":191799655,"authorName":"b prince","from":"b prince &lt;flyingtwinsmom@...&gt;","profile":"flyingtwinsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Just starting out...","postDate":"1270341107","msgId":43570,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyOTI4Mi45NjI3NC5xbUB3ZWI1NDYwNi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":43569,"nextInTopic":43571,"prevInTime":43569,"nextInTime":43571,"topicId":43566,"numMessagesInTopic":0,"msgSnippet":"R  said on Fri, April 2, 2010 2:29:53 PM **What did you do to convince your partner or what did your partner do that convinced you this","messageBody":"<div id=\"ygrps-yiv-1870780154\">R &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robinlaroy@...\">robinlaroy@...</a>&gt; said on Fri, April 2, 2010 2:29:53 PM<br/>\n**What did you do to convince your partner or what did your partner do <br/>\nthat convinced you this was the right choice for your family?<br/>\n    I can&#39;t say that I&#39;ve totally convinced my dh that unschooling is right. We have always homeschooled our girls. He has had his doubts a few times about that but something will always happen that shows him it&#39;s working out. It&#39;s never been academics though. It&#39;s always been something in the way of relating to other people. For instance, our girls are never afraid to ask a store associate for help. They play with every age all the same. These are things that we don&#39;t see with school children around here. <br/>\n<br/>\n**  Or any words of advice for someone in this situation?** <br/>\nCan you find other unschoolers that you can invite over? Maybe homeschoolers? Be patient. Don&#39;t talk to him as if you have all the answers. Mine hates when we argue about something and I *know* I&#39;m right. I don&#39;t know I&#39;m right, but I do feel very strongly about it. I think more or less, right now, my dh trusts me to do what is best for them. At some point, he may decide that he feels strongly about them going to school. I tend to share little bits of conversations with him about how great homeschooling, and now unschooling, is for the kids. Oh, and I especially like sharing the negative things I hear on the news or in our local paper, about the schools. LOL <br/>\n<br/>\n**I think right now my DH&#39;s sticking points are more extra curricular than academic.  He isn&#39;t worried about the kids learning their abc&#39;s etc, <br/>\nbut more about school sports teams and the kids being stigmatized for <br/>\nbeing homeschooled.  Any thoughts?**<br/>\n    Well, I&#39;ll suggest again that you find local contacts to meet and set up play days. We also enrolled ours in swimming lessons and the county soccer program. These are things they wanted to do though. We didn&#39;t force any of it. The swim lessons actually had other homeschoolers there. From the soccer, we have seen that there are mean kids just as much as there are nice kids. Some think my girls are weird for being homeschooled and &quot;behind&quot; in academics, but others tell my girls they wished they were homeschooled. It does take work on your part to find things though. I&#39;ve had to go out of my comfort zone to find other homeschool families to invite over and it took lots of research to find the swim lessons. I really had to start digging into what was afford and realize that I may have to drive a distance in order to do things.<br/>\n    The other thought that occurs to me is that school stigmatizes many more children for a much longer time than being homeschooled does. I was part of the &quot;in&quot; crowd in school, but I was on the outside edge of that. I never liked being thought of as part of the crowd. Those above me on the social rank thought I was beneath them and those not in the in crowd just thought I was as a snob. I was so glad when all that was over. For dh, it was the other way around. He still has emotional scars from being part of the out crowd. Although what&#39;s so funny is we&#39;ve now moved back to his home town and he runs into people that would have nothing to do with him in school and they act like best friends. My kids will get to avoid all that.  <br/>\nBonni<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Just starting out...","postDate":"1270297366","msgId":43569,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhwN2J1bStraXY2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhwNWQzMStwdWZ2QGVHcm91cHMuY29tPg=="},"prevInTopic":43568,"nextInTopic":43570,"prevInTime":43568,"nextInTime":43570,"topicId":43566,"numMessagesInTopic":0,"msgSnippet":"Oh, sports. DS is the one doings sports around here. He is now, at 16, a 3rd degree black belt in Tae Kwon Do. And has been able to go to classes whenever he","messageBody":"<div id=\"ygrps-yiv-1377669217\">Oh, sports.<br/>\n<br/>\nDS is the one doings sports around here. He is now, at 16, a 3rd degree black belt in Tae Kwon Do. And has been able to go to classes whenever he wanted to since he was 6 and we started hsing.<br/>\n<br/>\nAnd there are team sports available in the community that he could have participated in along the way. Or he could have participated in the team sports at the local public school. <br/>\n<br/>\nEach state has different laws about what is available and each community has its own resources.<br/>\n<br/>\nInstead of these things being packaged for you, as a hser you have to research what&#39;s available, talking with other hsers in your area and figuring out what fits you.<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;R&quot; &lt;robinlaroy@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi!  <br/>\n&gt; <br/>\n&gt; My name is Robin and I am mom to J (3.5 yrs) and S(11 mos.).  I have been lurking on this list for a little while.  I am really interested in homeschooling and unschooling specifically, but my husband is not on the same page.  I was wondering if anyone else on here was in the same boat at some point.  What did you do to convince your partner or what did your partner do that convinced you this was the right choice for your family?  What was the turning point in his/her/your decision?  Or any words of advice for someone in this situation?<br/>\n&gt; <br/>\n&gt; I think right now my DH&#39;s sticking points are more extra curricular than academic.  He isn&#39;t worried about the kids learning their abc&#39;s etc, but more about school sports teams and the kids being stigmatized for being homeschooled.  Any thoughts?<br/>\n&gt; <br/>\n&gt; Thanks!<br/>\n&gt; Robin<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Just starting out...","postDate":"1270297138","msgId":43568,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhwN2JuaSs1cXFoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhwNW5lays2cWdkQGVHcm91cHMuY29tPg=="},"prevInTopic":43567,"nextInTopic":43569,"prevInTime":43567,"nextInTime":43569,"topicId":43566,"numMessagesInTopic":0,"msgSnippet":"Only our personal experience, but the only stigma DD has experienced after unschooling her way through life until she decided to go to public school this","messageBody":"<div id=\"ygrps-yiv-1460029664\">Only our personal experience, but the only &quot;stigma&quot; DD has experienced after unschooling her way through life until she decided to go to public school this year -- 9th grade -- is that she is seen as bright and ambitious because she actually does her school work and cares about doing it well. She&#39;s already looking at transferring to a charter school at the local community college and then dual enrollment at the CC because of the almost complete lack of content in her classes in high school, compared to her experience as an unschooler.<br/>\n<br/>\nIt&#39;s not for everybody but it is a wonderful way to live and learn for many of us. What&#39;s the worst that could happen? Your children could learn to think and learn independently and be &quot;stigmatized&quot; for that. :)<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;R&quot; &lt;robinlaroy@&gt; wrote:<br/>\n&gt; &gt;He isn&#39;t worried about the kids learning their abc&#39;s etc, but more about school sports teams<br/>\n&gt; *****************<br/>\n&gt; <br/>\n&gt; Check with other area homeschoolers and find out what they do. It varies. In my area homeschoolers often try out for and join sports teams at the private schools. In other areas public schools are required to let homeschoolers in the same district join extracurricular activities. And in some places there are groups set up by and for homeschoolers. <br/>\n&gt; <br/>\n&gt; Plus, home/ unschoolers always have the option of going to school! Its not like going to school is some kind of one time offer.<br/>\n&gt; <br/>\n&gt; &gt;&gt;kids being stigmatized for being homeschooled.<br/>\n&gt; <br/>\n&gt; You might point out allllllll the ways kids are stigmatized for random difference in school itself. One of the benefits of homeschooling is that kids don&#39;t have to deal with that all day long. If they&#39;re in sports or whatever, they *only* have to deal with it when they&#39;re at practice or playing the game, rather than eight hours a day, five days a week. <br/>\n&gt; <br/>\n&gt; ---Meredith (Mo 8, Ray 16)<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Just starting out...","postDate":"1270243604","msgId":43567,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhwNW5lays2cWdkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhwNWQzMStwdWZ2QGVHcm91cHMuY29tPg=="},"prevInTopic":43566,"nextInTopic":43568,"prevInTime":43566,"nextInTime":43568,"topicId":43566,"numMessagesInTopic":0,"msgSnippet":"... ***************** Check with other area homeschoolers and find out what they do. It varies. In my area homeschoolers often try out for and join sports","messageBody":"<div id=\"ygrps-yiv-1345909095\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;R&quot; &lt;robinlaroy@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;He isn&#39;t worried about the kids learning their abc&#39;s etc, but more about school sports teams<br/>\n </span></blockquote>*****************<br/>\n<br/>\nCheck with other area homeschoolers and find out what they do. It varies. In my area homeschoolers often try out for and join sports teams at the private schools. In other areas public schools are required to let homeschoolers in the same district join extracurricular activities. And in some places there are groups set up by and for homeschoolers. <br/>\n<br/>\nPlus, home/ unschoolers always have the option of going to school! Its not like going to school is some kind of one time offer.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;kids being stigmatized for being homeschooled.<br/>\n<br/>\n </span></blockquote>You might point out allllllll the ways kids are stigmatized for random difference in school itself. One of the benefits of homeschooling is that kids don&#39;t have to deal with that all day long. If they&#39;re in sports or whatever, they *only* have to deal with it when they&#39;re at practice or playing the game, rather than eight hours a day, five days a week. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":172077574,"authorName":"R","from":"&quot;R&quot; &lt;robinlaroy@...&gt;","profile":"robinlaroy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Just starting out...","postDate":"1270232993","msgId":43566,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhwNWQzMStwdWZ2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":43567,"prevInTime":43565,"nextInTime":43567,"topicId":43566,"numMessagesInTopic":0,"msgSnippet":"Hi! My name is Robin and I am mom to J (3.5 yrs) and S(11 mos.).  I have been lurking on this list for a little while.  I am really interested in homeschooling","messageBody":"<div id=\"ygrps-yiv-1987469928\">Hi!  <br/>\n<br/>\nMy name is Robin and I am mom to J (3.5 yrs) and S(11 mos.).  I have been lurking on this list for a little while.  I am really interested in homeschooling and unschooling specifically, but my husband is not on the same page.  I was wondering if anyone else on here was in the same boat at some point.  What did you do to convince your partner or what did your partner do that convinced you this was the right choice for your family?  What was the turning point in his/her/your decision?  Or any words of advice for someone in this situation?<br/>\n<br/>\nI think right now my DH&#39;s sticking points are more extra curricular than academic.  He isn&#39;t worried about the kids learning their abc&#39;s etc, but more about school sports teams and the kids being stigmatized for being homeschooled.  Any thoughts?<br/>\n<br/>\nThanks!<br/>\nRobin</div>","specialLinks":[]}],"prevTopicId":43564,"nextTopicId":43574}}