{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":220957185,"authorName":"freida","from":"&quot;freida&quot; &lt;fis1965@...&gt;","profile":"fis1965","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Earrings for boys","postDate":"1176085301","msgId":23080,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGV2Yzd2bCtvdjdiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGV2OGY0cCtvbDcyQGVHcm91cHMuY29tPg=="},"prevInTopic":23073,"nextInTopic":0,"prevInTime":23079,"nextInTime":23081,"topicId":23051,"numMessagesInTopic":0,"msgSnippet":"In todays world people are homophobic with an Puritan based society. When my son was 9 he wanted to have his ear pierced and I told him he could when he turn","messageBody":"<div id=\"ygrps-yiv-697366619\">In todays world people are homophobic with an Puritan based society.<br/>\nWhen my son was 9 he wanted to have his ear pierced and I told him he<br/>\ncould when he turn 13 . This way he would have a few years to think<br/>\nabout it before we have it done. I also knew that his father would<br/>\nhave a issue with it. Since he was raised in a Baptist background. I<br/>\nnever told his dad. So on Logan&#39;s birthday he reminded me that he<br/>\nwanted his ear pierced.  So off we went and his dad called home to say<br/>\nHappy Birthday to Logan and the other boys told him where we went. So<br/>\nI had to listen to him when we got home. He accused me if the boys<br/>\nwanted to drink beer that I would buy it for him. I ended up  saying<br/>\nthat kids has no real control in their life that hair and having their<br/>\near pierced was minor.<br/>\n\tLogan also did Ballet and tap, that was another issue with poor old<br/>\ndad. You should of saw him when I bought Logan a Native American and a<br/>\nHorse. The problem was that the only ones that I could find was in the<br/>\ngirls section and the boxes were pink. The in-laws also had a issue<br/>\nwith it. I ended up changing a lot of the families programmed thought<br/>\npatterns. When Logan turn 8 paternal grandmother bought him a doll.<br/>\nFunny that there was no comment on that.  <br/>\n\tMy other son when he was 5 wanted finger nail polish and when my ex<br/>\nasked me what he wanted I told him about a turn table that had<br/>\nsprinkles, files and polish. He had major issues with that even saying<br/>\nthat i was going to turn the boy gay. Little Colby did get some nail<br/>\npolish in his sock for Christmas. You never saw a happy kid. Father&#39;s<br/>\nface was not happy when Colby showed him, but that was that. <br/>\n\tToday my three sons are 18,17 and 15. they are handsome lads two with<br/>\nlong hair and the eldest did have long hair but now it is cut real<br/>\nshort. I work hard on them being happy with themselves since in this<br/>\nworld kids have issues with self-esteem.<br/>\n<br/>\njust my thoughts<br/>\nfreida</div>","specialLinks":[]},{"userId":232954138,"authorName":"tag23x2","from":"&quot;tag23x2&quot; &lt;tag23x2@...&gt;","profile":"tag23x2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Earrings for boys","postDate":"1176071669","msgId":23073,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGV2YnFsbCtrNnExQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGV2OGY0cCtvbDcyQGVHcm91cHMuY29tPg=="},"prevInTopic":23070,"nextInTopic":23080,"prevInTime":23072,"nextInTime":23074,"topicId":23051,"numMessagesInTopic":0,"msgSnippet":"... I have 2 sons who both have their ears pierced.  My oldest is now 17, but did his 1st piercing when he was about 9 yrs. old; he now has 2 in each ear &","messageBody":"<div id=\"ygrps-yiv-1450866539\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Alice&quot; &lt;thesackmans@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; My 9 yr son wants to get his ears pierced. <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I have 2 sons who both have their ears pierced.  My oldest is now 17, <br/>\nbut did his 1st piercing when he was about 9 yrs. old; he now has 2 in <br/>\neach ear & started with plain gold studs, then hoops, & now diamonds.  <br/>\nLooks very nice...not girlish at all.  My younger son is now 12 (today) <br/>\n& got his ear pierced at 5 yrs. old....could be because of his brother, <br/>\nbut he wanted it done, so we let him.  He&#39;s now thinking about getting <br/>\nhis other ear done too...but when he decides for sure we&#39;ll take him.  <br/>\nAs long as our kids know all the facts first, they are able to decide <br/>\nfor themselves....& we allow them to.  ***One tip though...my older son <br/>\ngot 2 holes pierced in the same ear on the same day, & he does not <br/>\nrecommend that at all...too painful!<br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":279433414,"authorName":"Carrie Kimball","from":"&quot;Carrie Kimball&quot; &lt;ckmidwife@...&gt;","profile":"lelania1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:Earrings for boys","postDate":"1176043353","msgId":23068,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDcwMWM3NzllYyQyNTU5NzE5MCQzMzAwYThjMEBLaW1iYWxsRmFtaWx5Pg=="},"prevInTopic":23067,"nextInTopic":23070,"prevInTime":23067,"nextInTime":23069,"topicId":23051,"numMessagesInTopic":0,"msgSnippet":"Hi Alice, I am glad to hear you getting to the heart of your internal fears and blocks with parenting on this issue. For me, that is the most beneficial part","messageBody":"<div id=\"ygrps-yiv-1142257551\">Hi Alice,<br/>\n    I am glad to hear you getting to the heart of your internal fears and blocks with parenting on this issue. For me, that is the most beneficial part of this style of parenting is that it makes me really look at where my hesitations and reactions are coming from. I don&#39;t get the whole &quot;army&quot; thing, primarily because your home isn&#39;t the army. Things make sense it different contexts, so what goes on in the military or any job doesn&#39;t need to go on in a family. If what is really going on with DH is that the intense homphobia and sexism present in the military (as well as everywhere else) that is still unfortunately tolerated there, is creeping in and making him either fear the responses his son will get (because he sees it happen a lot), or feel those emotions toward his son (because the response is conditioned), then that is definately something to explore and work with as a couple. Irrespective of ones beliefs about gender and sexual orientation, like any area of our kids lives, imposing our fear based values and judgments causes them distress and makes for an alienated relationship.<br/>\n    My kids dad is on first glance a pretty sensitive new age guy whose good with the gay. But having two sons has brought out very intense and untapped emotions for him around gender expression and homophobia. He has found himself saying things to them about their clothing choices, or expressions of wants materially (including earrings) that are extremly sexist or heterosexist, and we try and be gentle with each other around that since it is nearly impossible to grow up here and not be socialized to experience discomfort with gender variances and anything except monogomous heterosexuality. <br/>\n    Humans experience a wide range of behaviors, and not all of them fit with their cultures present dictates around gender norms. It helps to think in terms of three different things: Gender identification- what you identify your gender to be, gender expression- what you feel most comfortable expressing as a gendered behavioral or asthetic sense, and sexual orientation- the gender of people who you partner with or have sex with. And even this dileniation is narrow because people are attracted to specific gender expressions as well. Some women are attracted to males, but ones who are very femme for example. And it is also important to see that these things exist on a continuum and change throughout the life cycle. While the culture pushes people to behave consistently a specific way, peoples desires, fantasies and needs really vary a lot over the course of a long life. The primary model for understanding the laws of the univers have been dichotomies- either or&#39;s. This or that. What many of us have come to realize, is that what is true for us is all of it some of the time. We feel like dressing this way over here, and that way over there. We fall for and enjoy dating this person here, and someone totally different over there. It&#39;s really the idea that everyone has to partition into camps with definitions that is the problem, and babies are born knowing this, and when raised freely, show that fluidity throught childhood too.<br/>\n    The reason I bring all this up, is that it helps to recognize that how someone expresses their gender isn&#39;t the same as their gender identity or their sexual orientation, and when boys especially act in ways that are culturally identified with &quot;femininity&quot;, the trigger point is sometimes that this means they are gay, or that they are actually wanting to be women. And it doesn&#39;t. Either of those possibilities may also exist in a person, but they are not givens. Most people probably think &quot;of course!&quot; when they hear this, but actually, we can know things cognitively and then experience it a whole different way when confronted with it in our kids.<br/>\n<br/>\n    I live in a really really queer community. Most everyone we know is either gender queer- androgenous, transgendered or sexually queer. And people have a really wide variance for expressing their identified genders that makes it hard to know what anyones chosen pronouns might be. It might seem in light of this that my kids expressions of gender variance would be easy for me, but not so. I feel fear, I say ridiculous things to them, I find myself slacking on consiously choosing books that present a less narrow perspective of the world. And I feel fear a lot about wanting my kids lives to be easy, and knowing that if they are trans, or gay, or neither but behave too sensitively even, then the external world will be cruel and harsh to them in some ways I want to spare them from. I see sometimes that what I say and do comes from that head space, and then I can stop and recognize the absurdity of it. The truth that life will sometimes be hard for everyone, and that it will be hardest actually for people who feel they are trapped inside bodies or lives they hate and don&#39;t feel real in. That this would be the wore fate actually. And then there is the reality that I am not in charge anyway. Probably 90% of the folks I know who are trans grew up in very heterosexist and gender normative nuclear families with religious training. They ended up who they are anyway, but with really estarnged or not present relationships with their families. So I don&#39;t believe that I can actually affect this beyond giving the message of unconditional love and acceptance. <br/>\n<br/>\nIt seems like a long way to go from an earring, but with parenting, the nerves that are touched are always much much deeper than the surface:)<br/>\ncarrie<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":220662483,"authorName":"Alice","from":"&quot;Alice&quot; &lt;thesackmans@...&gt;","profile":"alice_in_idaho","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Earrings for boys","postDate":"1176041491","msgId":23067,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGV2YXQ2ais5bnFjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDOTQ3NEJDNERDNTRBNC05QjAtODc3NkB3ZWJtYWlsLWRlMjAuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":23066,"nextInTopic":23068,"prevInTime":23066,"nextInTime":23068,"topicId":23051,"numMessagesInTopic":0,"msgSnippet":"Well, my ds and I talked about earrings and about how male earrings often send messages.  We talked about what message he wanted to send and of course he had","messageBody":"<div id=\"ygrps-yiv-1008072389\">Well, my ds and I talked about earrings and about how male earrings<br/>\noften send messages.  We talked about what message he wanted to send<br/>\nand of course he had the option to just do whatever kind of earrings<br/>\nhe wants and to hell with the &quot;message&quot;.  He finally opted for a<br/>\nsingle CZ in his left ear which he is very happy with.  And dad was<br/>\nfine with it.  So everyone is happy.<br/>\n<br/>\nLike many of you said, I truly value my relationship with him over any<br/>\npiercing or self-expression.  I would never ever want him to have to<br/>\nhide something from me or feel that I valued him less because of<br/>\nsomething he did.  <br/>\n<br/>\nIf it were just us and other unschoolers in the world, my dh and I<br/>\nprobably wouldn&#39;t have batted an eyelid over the piercing.  I think<br/>\nour fear was based more on what kind of flak *we* would get from other<br/>\nparents for &quot;letting&quot; our son pierce his ear!  It seems to me that as<br/>\nthe kids start approaching their teen years and becoming adults, our<br/>\nsociety expects parents to start &quot;cracking down&quot; and really<br/>\ncontrolling their lives so they don&#39;t &quot;run amok&quot;.  I don&#39;t know any<br/>\nother 9 yo boys who have their ears pierced.  Usually for males, this<br/>\nis something they do on their own perhaps in direct defiance of their<br/>\nparents.  So I guess I was just afraid for me!  Afraid that other<br/>\nparents were going to wonder what kind of mom I am for letting my son<br/>\npierce his ear so young.  I know it is dumb.  <br/>\n<br/>\nBut you know what?  I am really glad that we found unschooling so that<br/>\nwhen my son asks to get his ear pierced, we can go out and have a good<br/>\ntime doing it and the only thing bothering me is a little niggling<br/>\nfear that other people are going to think bad about me.  That is such<br/>\na small fear and easy to get over compared to all the traditional<br/>\nhouseholds out there that would have seen their&#39;s son&#39;s request as<br/>\nevidence that he is going astray.  And they would not only fear what<br/>\nother people think but a whole slew of other things too.  Which would<br/>\nhave resulted in a big argument that would have diminished their<br/>\nrelationship instead of strenghtening it.  I am glad that I don&#39;t have<br/>\nto live my life in fear.  I am glad that I can love my son for who he<br/>\nis, piercings and all. <br/>\n<br/>\n-Alice<br/>\njoyfully living in North Idaho with Ordell, Andrew 9, Audrey 6, Megan<br/>\n17,</div>","specialLinks":[]},{"userId":96545052,"authorName":"marji","from":"marji &lt;marji@...&gt;","profile":"gaia10921","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Earrings for boys","postDate":"1176036688","msgId":23066,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwNDA4MTI1MS5sMzhDcFpwVDAxNjEwMUBvbXI0Lm5ldHdvcmtzb2x1dGlvbnNlbWFpbC5jb20+","inReplyToHeader":"PDIwMDcwNDA3MTkwODE0LjkzNjcucW1haWxAd2ViMzQyMDQubWFpbC5tdWQueWFob28uY29tPg==","referencesHeader":"PDIwMDcwNDA3MTkwODE0LjkzNjcucW1haWxAd2ViMzQyMDQubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":23063,"nextInTopic":23067,"prevInTime":23065,"nextInTime":23067,"topicId":23051,"numMessagesInTopic":0,"msgSnippet":"... Liam (now 12) got his ear pierced the first time at 9 or 10.  It closed up spontaneously and he had it re-pierced last year when he was 11 (which amazed me","messageBody":"<div id=\"ygrps-yiv-1248241177\"><blockquote><span title=\"ireply\">&gt;Anyway, we are all trying to reach a consensus<br/>\n&gt;about this and what type of earrings to get that would look boyish. I<br/>\n&gt;guess I also have a lot of fears of my son looking girlish! ...<br/>\n&gt;I always think of teen boys getting piercings, not 9 yo....<br/>\n<br/>\n </span></blockquote>Liam (now 12) got his ear pierced the first time at 9 or 10.  It <br/>\nclosed up spontaneously and he had it re-pierced last year when he <br/>\nwas 11 (which amazed me that he would do it again &#39;cause it *did* <br/>\nsmart when he first did it).  His decision to re-pierce demonstrated <br/>\nto me his strong desire to have a pierced ear.<br/>\n<br/>\nWe have been able to find him really cool earrings that he loves <br/>\n(right now, he&#39;s wearing a sort of black-and-white skull), but we&#39;ve <br/>\nfound lightning bolts and swords and also just a clear, colored stone <br/>\nto wear.  I&#39;m really happy for him.<br/>\n<br/>\nI think it&#39;s important to understand that your fears (looking <br/>\ngirlish, etc.) are yours, and it would be good if you could recognize <br/>\nthat and not pass them on to your son.  One of the best things I have <br/>\nheard to do in almost any situation is to ask myself this <br/>\nquestion:  &quot;How can I best support my son?&quot;  Certainly, laying my own <br/>\nfears on him is not what I would consider to be supportive.  So, any <br/>\nqualms I may have about something he wants to do, I deal with on my <br/>\nown and I hold that up to that question:  How can I best support Liam <br/>\nthrough this?<br/>\n<br/>\nIf there is an obvious serious safety issue, I know that supporting <br/>\nhim best would be helping him understand the risks *and* helping him <br/>\nmitigate them, if he still wants to go forward.  I *trust* him to <br/>\nknow that he does not want to injure himself, and we research stuff <br/>\ntogether, and whatever he does, he does so with fully informed consent.<br/>\n<br/>\nMore than gaining pierced ears, he gains the experience of learning <br/>\nhow to research his options and make informed choices.  He also <br/>\ntrusts me to support him.  I don&#39;t remember feeling that way towards <br/>\nmy folks when I was a kid; their default response was set to &quot;no.&quot;<br/>\n<br/>\nThe *best* part about this is that he does things for the right <br/>\nreasons:  He wants to.  A wrong reason would be *because* I say <br/>\nno.  The wrong reason would be to prove to me that I have no <br/>\nauthority of him or his body.  That would lead to him sneaking around <br/>\nbehind my back (as I did with my folks) because I&#39;m blocking his <br/>\npath, thereby actually *encouraging* him to go underground to get <br/>\nwhat he wants.  That doesn&#39;t make a good environment for unschooling, <br/>\nin my opinion.<br/>\n<br/>\nAnywho, that&#39;s my two cents on the subject.  I hope that helps!<br/>\n<br/>\n<br/>\nMarji, who apologizes if this answer is redundant; I&#39;m seriously <br/>\nbacked up on reading email so someone else may have already put this <br/>\nout there, and probably more eloquently and concisely than I did!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":110899439,"authorName":"Sharissa13","from":"Sharissa13 &lt;sharissa13@...&gt;","profile":"sharissa13","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:Earrings for boys","postDate":"1176001116","msgId":23070,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyMjkwOC41ODMwLnFtQHdlYjM2MTAzLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":23068,"nextInTopic":23073,"prevInTime":23069,"nextInTime":23071,"topicId":23051,"numMessagesInTopic":0,"msgSnippet":"My husband and I own a tattoo shop, so I m somewhat lenient on the piercing issue. Someone else did bring up a good point though... if we try to control what","messageBody":"<div id=\"ygrps-yiv-1537828878\">My husband and I own a tattoo shop, so I&#39;m somewhat<br/>\nlenient on the piercing issue. Someone else did bring<br/>\nup a good point though... if we try to control what we<br/>\nallow them to put on their bodies, it could really<br/>\nbackfire. In our tattoo shop, we get people who don&#39;t<br/>\nwant to pay $200 for a tattoo that someone in some<br/>\napartment offered to do for $50. At the very least,<br/>\nyour tattoo might not come out the way you want it to.<br/>\nWorse, you could get scarring. Even worse yet,<br/>\ncontract a blood-born disease.<br/>\n<br/>\nGranted, this is much less an issue with piercings.<br/>\nBut... piercings aren&#39;t permanent. Your 9 year old<br/>\nmight decide in a few years he doesn&#39;t want his ears<br/>\npierced anymore. And it&#39;s as simple as taking the<br/>\njewelry out, and letting the holes close up.<br/>\n<br/>\nBut, if it were *my* child...unless he had a really<br/>\ngood reason for wanting his ears pierced (one that he<br/>\ncould convince his dad with), I&#39;d probably tell him to<br/>\nwait a few years. Maybe as a birthday present for a 12<br/>\nor 13th birthday.<br/>\n<br/>\nI don&#39;t even want to think about what my kids are<br/>\ngoing to do with tattoos once they get older. Both my<br/>\nDH and I have several tattoos. And my 5 year old is<br/>\nwell known for having full sleeve tattoos of Sharpie<br/>\nmarkers on various occasions. <br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\nExpecting? Get great news right away with email Auto-Check. <br/>\nTry the Yahoo! Mail Beta.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://advision.webevents.yahoo.com/mailbeta/newmail_tools.html\">http://advision.webevents.yahoo.com/mailbeta/newmail_tools.html</a></div>","specialLinks":[]},{"userId":282257979,"authorName":"Wildflower Car","from":"&quot;Wildflower Car&quot; &lt;unschoolfool@...&gt;","profile":"red_olive5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Earrings for boys","postDate":"1176000447","msgId":23063,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEwOC1GMTQyRjNFRDAyQzY5NTk5RTFCMzkzRkNBNUEwQHBoeC5nYmw+","inReplyToHeader":"PDIwMDcwNDA3MjIzMTEzLjQ0Nzg5LnFtYWlsQHdlYjUzODA3Lm1haWwucmUyLnlhaG9vLmNvbT4="},"prevInTopic":23058,"nextInTopic":23066,"prevInTime":23062,"nextInTime":23064,"topicId":23051,"numMessagesInTopic":0,"msgSnippet":"Most of my brothers, my husband and most of our male peers have had their ears pierced at one point or another. Some still keep earrings in, and some don t.  I","messageBody":"<div id=\"ygrps-yiv-1080241732\">Most of my brothers, my husband and most of our male peers have had their <br/>\nears pierced at one point or another. Some still keep earrings in, and some <br/>\ndon&#39;t.  I think it is perfectly fine if that&#39;s what they want.<br/>\n<br/>\nWildflower<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;From: Sylvia Toyama &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sylgt04@...\">sylgt04@...</a>&gt;<br/>\n&gt;Reply-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n&gt;To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n&gt;Subject: Re: [unschoolingbasics] Earrings for boys<br/>\n&gt;Date: Sat, 7 Apr 2007 15:31:13 -0700 (PDT)<br/>\n&gt;<br/>\n&gt;Anyway, I think I am just trying to sort through my own feelings and fears <br/>\n&gt;so they don&#39;t get in the way of my son expressing himself. So if anyone has <br/>\n&gt;any thoughts, advice and reassurance, I would appreciate it!<br/>\n&gt;<br/>\n&gt;   ****<br/>\n&gt;   Will had one ear pierced at 11yo.   It was an adoption gift to him from <br/>\n&gt;us when Gary adopted him (Will&#39;s from my first marriage).  He wore an <br/>\n&gt;earring for about 4 yrs, then he did a couple of years in high school JROTC <br/>\n&gt;and the earring wasn&#39;t allowed by them, so he let it grow over.<br/>\n&gt;<br/>\n&gt;   At 17 he got his first tattoo, with our consent.  He was visiting my <br/>\n&gt;sister and a friend who is a tattoo artist did a beautiful (and big) <br/>\n&gt;chinese dragon on his lower right leg.  It goes from knee to ankle, and <br/>\n&gt;almost all the way around his leg from calf to shin in some places.  It is <br/>\n&gt;an awesome tatt!  Took three daily sessions to finish -- my sister says <br/>\n&gt;Will swore and sweated his way thru most of the &#39;coloring&#39; sessions on days <br/>\n&gt;2 & 3!  He came home very happy with it. He has since added another smaller <br/>\n&gt;one, just above his ankle bone, inside, on the same leg and is saving his <br/>\n&gt;money for one more, a band name if I remember correctly.<br/>\n&gt;<br/>\n&gt;   With both the piercing and the tattoo, Will thought and planned in <br/>\n&gt;depth.  I remember several days over which ear to pierce and which stud he <br/>\n&gt;wanted.  He took care of it all himself and never had any problems.  He and <br/>\n&gt;I talked over several weeks about where/what to get for his tattoo.  He <br/>\n&gt;wanted one that wouldn&#39;t be impossible to hide -- no neck or lower arm <br/>\n&gt;tattoos -- but would be easy to show to others when he wanted to. He <br/>\n&gt;thought about the stomach, but heard that really hurts; the back, but <br/>\n&gt;wanted to be able to see it himself, etc.  He chose the lower leg, figuring <br/>\n&gt;that if someday he gets a job where tattoos are okay, it&#39;ll be one where he <br/>\n&gt;can wear shorts -- if he gets an office job someday, he&#39;d like to be able <br/>\n&gt;to roll up his sleeves or unbutton a collar without exposing the tattoos.  <br/>\n&gt;Again, he was responsible for the after-care, going thru lots of <br/>\n&gt;lotion/cream in the weeks after the tattoo, but it is a pretty one!<br/>\n&gt;<br/>\n&gt;   Gary was initially not thrilled about the ear piercing, and isn&#39;t a <br/>\n&gt;tattoo guy himself, so ihe didn&#39;t understand why Will would do those, but <br/>\n&gt;he was fine with it. We were both pleased to see how much thought Will gave <br/>\n&gt;to the whole process.  When it was all healed,  looking at the tattoo was <br/>\n&gt;intriguing to everyone -- even my mil had to have a peek when she visited a <br/>\n&gt;couple of months later.<br/>\n&gt;<br/>\n&gt;   On reading Kelly&#39;s post about Carly&#39;s tatt -- I have to wonder about <br/>\n&gt;those lower back tattoos.  I know that&#39;s a popular place, and I guess with <br/>\n&gt;the current crop-tops they&#39;re a popular look, but it just seems a strange <br/>\n&gt;place to me!  Then again, I have no tattoos -- I&#39;m a needle wimp and worry <br/>\n&gt;I&#39;d be allergic to the ink.  I ampretty sure, tho, that I&#39;ll go along for a <br/>\n&gt;piercing when the tattoo trip happens at the conference.<br/>\n&gt;<br/>\n&gt;   I agree with Kelly -- our kids&#39; bodies aren&#39;t ours.  For me it&#39;s not <br/>\n&gt;about allowing them to do what they want, but my respect for their <br/>\n&gt;sovereignty that&#39;s most important.<br/>\n&gt;<br/>\n&gt;   Sylvia<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;           Gary (dh)<br/>\n&gt;   Will (22) Andy (10-1/2) and Dan (6)<br/>\n&gt;<br/>\n&gt;       A friend is someone who knows your song, and sings it to you when <br/>\n&gt;you�ve forgotten it yourself.<br/>\n&gt;~Alan Cohen<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;   <a rel=\"nofollow\" target=\"_blank\" href=\"http://ourhapahome.blogspot.com\">http://ourhapahome.blogspot.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;---------------------------------<br/>\n&gt;Don&#39;t get soaked.  Take a quick peek at the forecast<br/>\n&gt;  with theYahoo! Search weather shortcut.<br/>\n&gt;<br/>\n&gt;[Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>_________________________________________________________________<br/>\nThe average US Credit Score is 675. The cost to see yours: $0 by Experian. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.freecreditreport.com/pm/default.aspx?sc=660600&bcd=EMAILFOOTERAVERAGE\">http://www.freecreditreport.com/pm/default.aspx?sc=660600&bcd=EMAILFOOTERAVERAGE</a></div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Earrings for boys","postDate":"1175985073","msgId":23058,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwNDA3MjIzMTEzLjQ0Nzg5LnFtYWlsQHdlYjUzODA3Lm1haWwucmUyLnlhaG9vLmNvbT4=","inReplyToHeader":"PDhDOTQ3NEJDNERDNTRBNC05QjAtODc3NkB3ZWJtYWlsLWRlMjAuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":23057,"nextInTopic":23063,"prevInTime":23057,"nextInTime":23059,"topicId":23051,"numMessagesInTopic":0,"msgSnippet":"Anyway, I think I am just trying to sort through my own feelings and fears so they don t get in the way of my son expressing himself. So if anyone has any","messageBody":"<div id=\"ygrps-yiv-265611527\">Anyway, I think I am just trying to sort through my own feelings and fears so they don&#39;t get in the way of my son expressing himself. So if anyone has any thoughts, advice and reassurance, I would appreciate it!<br/>\n<br/>\n  ****<br/>\n  Will had one ear pierced at 11yo.   It was an adoption gift to him from us when Gary adopted him (Will&#39;s from my first marriage).  He wore an earring for about 4 yrs, then he did a couple of years in high school JROTC and the earring wasn&#39;t allowed by them, so he let it grow over.  <br/>\n   <br/>\n  At 17 he got his first tattoo, with our consent.  He was visiting my sister and a friend who is a tattoo artist did a beautiful (and big) chinese dragon on his lower right leg.  It goes from knee to ankle, and almost all the way around his leg from calf to shin in some places.  It is an awesome tatt!  Took three daily sessions to finish -- my sister says Will swore and sweated his way thru most of the &#39;coloring&#39; sessions on days 2 & 3!  He came home very happy with it. He has since added another smaller one, just above his ankle bone, inside, on the same leg and is saving his money for one more, a band name if I remember correctly.<br/>\n   <br/>\n  With both the piercing and the tattoo, Will thought and planned in depth.  I remember several days over which ear to pierce and which stud he wanted.  He took care of it all himself and never had any problems.  He and I talked over several weeks about where/what to get for his tattoo.  He wanted one that wouldn&#39;t be impossible to hide -- no neck or lower arm tattoos -- but would be easy to show to others when he wanted to. He thought about the stomach, but heard that really hurts; the back, but wanted to be able to see it himself, etc.  He chose the lower leg, figuring that if someday he gets a job where tattoos are okay, it&#39;ll be one where he can wear shorts -- if he gets an office job someday, he&#39;d like to be able to roll up his sleeves or unbutton a collar without exposing the tattoos.  Again, he was responsible for the after-care, going thru lots of lotion/cream in the weeks after the tattoo, but it is a pretty one!<br/>\n   <br/>\n  Gary was initially not thrilled about the ear piercing, and isn&#39;t a tattoo guy himself, so ihe didn&#39;t understand why Will would do those, but he was fine with it. We were both pleased to see how much thought Will gave to the whole process.  When it was all healed,  looking at the tattoo was intriguing to everyone -- even my mil had to have a peek when she visited a couple of months later.  <br/>\n   <br/>\n  On reading Kelly&#39;s post about Carly&#39;s tatt -- I have to wonder about those lower back tattoos.  I know that&#39;s a popular place, and I guess with the current crop-tops they&#39;re a popular look, but it just seems a strange place to me!  Then again, I have no tattoos -- I&#39;m a needle wimp and worry I&#39;d be allergic to the ink.  I ampretty sure, tho, that I&#39;ll go along for a piercing when the tattoo trip happens at the conference.<br/>\n   <br/>\n  I agree with Kelly -- our kids&#39; bodies aren&#39;t ours.  For me it&#39;s not about allowing them to do what they want, but my respect for their sovereignty that&#39;s most important.<br/>\n   <br/>\n  Sylvia<br/>\n   <br/>\n<br/>\n<br/>\n          Gary (dh)<br/>\n  Will (22) Andy (10-1/2) and Dan (6) <br/>\n   <br/>\n      A friend is someone who knows your song, and sings it to you when youve forgotten it yourself.<br/>\n~Alan Cohen<br/>\n<br/>\n   <br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://ourhapahome.blogspot.com\">http://ourhapahome.blogspot.com</a><br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n---------------------------------<br/>\nDon&#39;t get soaked.  Take a quick peek at the forecast <br/>\n with theYahoo! Search weather shortcut.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":222220143,"authorName":"Ginger Sabo","from":"Ginger Sabo &lt;kaikade@...&gt;","profile":"kaikade","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Earrings for boys","postDate":"1175972894","msgId":23056,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwNDA3MTkwODE0LjkzNjcucW1haWxAd2ViMzQyMDQubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":23053,"nextInTopic":23057,"prevInTime":23055,"nextInTime":23057,"topicId":23051,"numMessagesInTopic":0,"msgSnippet":"Will he be any different when you look in his eyes?  For me, both me and my husband were military, it matters not what the outside has.  If he had a huge","messageBody":"<div id=\"ygrps-yiv-563209800\">Will he be any different when you look in his eyes?  For me, both me and my husband were military, it matters not what the outside has.  If he had a huge visible scar or birth mark, would that change him?  If he was missing an ear, would that change who he is?  Those things are far more permanent than earrings.  My hubby and I both have had earrings, and at present, don&#39;t wear them.  No one sees it, so it &quot;never happened&quot; as far as the public is concerned.  I guess what I&#39;m really trying to say is what Kelly did - he will have more ability to know what he wants to do with his body when he has jurisdiction over it.  Out of all the &#39;crazy&#39; things kids may want to do, earrings dont&#39; rank high as a concern.  They can be taken out and it&#39;s back to &#39;normal&#39;.<br/>\n<br/>\nI personally like saphire or ruby...<br/>\n <br/>\nIn Peace,<br/>\nGinger<br/>\nKai(8) - who has long hair and Kade(5) - who usually runs around the neighborhood naked.<br/>\n<br/>\nLOVE has impact.<br/>\n<br/>\n&quot;It&#39;s not our differences that divide us. It is our inability to recognize, accept and celebrate those differences.&quot; - Audre Lorde<br/>\n<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: Alice &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:thesackmans@...\">thesackmans@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Saturday, April 7, 2007 10:59:21 AM<br/>\nSubject: [unschoolingbasics] Earrings for boys<br/>\n<br/>\nMy 9 yr son wants to get his ears pierced. My dh is not too happy<br/>\nabout this (he is a military man and piercings just strike him the<br/>\nwrong way). My ds wants both of his ears pierced because he figures<br/>\nwhy not go for broke and just get them both done at the same time. <br/>\n(my dd 6 just got both of her ears pierced - which my dh was not too<br/>\nhappy about either) Anyway, we are all trying to reach a consensus<br/>\nabout this and what type of earrings to get that would look boyish. I<br/>\nguess I also have a lot of fears of my son looking girlish! Isn&#39;t<br/>\nthat sad?! My son has always dressed and styled his own way and has<br/>\nalways loved jewelry, so I guess I shouldn&#39;t be surprised that he<br/>\nwants to get piercings. I guess the piercing thing caught us/me off<br/>\nguard - I always think of teen boys getting piercings, not 9 yo. We<br/>\nhave teens in the house (with lots of piercings and tattoos) so I am<br/>\nthinking that probably has a strong influence.<br/>\n<br/>\nAnyway, I think I am just trying to sort through my own feelings and<br/>\nfears so they don&#39;t get in the way of my son expressing himself. So<br/>\nif anyone has any thoughts, advice and reassurance, I would appreciate it!<br/>\n<br/>\n-alice<br/>\njoyfully living with dh Ordell, dear niece Megan 17, ds Andrew 9, dd<br/>\nAudrey 6, and various other wonderful people who come and go in our<br/>\nvery busy house<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n____________________________________________________________________________________<br/>\n8:00? 8:25? 8:40? Find a flick in no time <br/>\nwith the Yahoo! Search movie showtime shortcut.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tools.search.yahoo.com/shortcuts/#news\">http://tools.search.yahoo.com/shortcuts/#news</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180989559,"authorName":"TheLerews@comcast.net","from":"TheLerews@...","profile":"bjlerew66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Earrings for boys","postDate":"1175971682","msgId":23057,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA0MDcyMDA3MTg0OC4yODA0NC40NjE3RTc2MjAwMEQzQzkxMDAwMDZEOEMyMjE2NTU0ODg2QUNBOUJBQURCQUI0QkFCOEFCQGNvbWNhc3QubmV0Pg=="},"prevInTopic":23056,"nextInTopic":23058,"prevInTime":23056,"nextInTime":23058,"topicId":23051,"numMessagesInTopic":0,"msgSnippet":"Anyway, I think I am just trying to sort through my own feelings and fears so they don t get in the way of my son expressing himself.  So if anyone has any","messageBody":"<div id=\"ygrps-yiv-2136166604\">Anyway, I think I am just trying to sort through my own feelings and<br/>\nfears so they don&#39;t get in the way of my son expressing himself.  So<br/>\nif anyone has any thoughts, advice and reassurance, I would appreciate <br/>\nit!<br/>\n<br/>\n-My only concern would be regarding whether some of the younger children have a true understanding that they are doing something to alter their bodies permanently (?).  I suppose my fear would be that my child would resent me later for NOT discouraging them from doing something to permanently change their bodies when they were not old enough to really know what &#39;permanent&#39; means.  (they might think they know, but....I would be skeptical about my own boys because as it is now, they often change their minds about things at the drop of a hat ;  what foods they like, what toys they like, what hairstyle, etc.,... its all fine because we can easily change these things without a problem).  On the other hand, the earrings can be taken out forever if your son changes his mind and the old earrings holes will be barely noticeable.  - Good luck :-)   Paula<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Earrings for boys","postDate":"1175964537","msgId":23053,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOTQ3NEJDNERDNTRBNC05QjAtODc3NkB3ZWJtYWlsLWRlMjAuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PGV2OGY0cCtvbDcyQGVHcm91cHMuY29tPg==","referencesHeader":"PGV2OGY0cCtvbDcyQGVHcm91cHMuY29tPg=="},"prevInTopic":23051,"nextInTopic":23056,"prevInTime":23052,"nextInTime":23054,"topicId":23051,"numMessagesInTopic":0,"msgSnippet":"... From: thesackmans@adelphia.net Anyway, I think I am just trying to sort through my own feelings and fears so they don t get in the way of my son expressing","messageBody":"<div id=\"ygrps-yiv-1730318062\">-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:thesackmans@...\">thesackmans@...</a><br/>\n<br/>\nAnyway, I think I am just trying to sort through my own feelings and<br/>\nfears so they don&#39;t get in the way of my son expressing himself.  So<br/>\nif anyone has any thoughts, advice and reassurance, I would appreciate <br/>\nit!<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nYou know, everything&#39;s relative. &lt;g&gt;<br/>\n<br/>\nHaving a teen (granted, much older!) who got pierced for the first time <br/>\nlast year---it really seems like NOTHING now that he&#39;s contemplating <br/>\nthe tattoo thang next week. Two friends are going; they will all get <br/>\nthe same &#39;ttoo.<br/>\n<br/>\nI know several littluns with piercings. Duncan, at 11, says he wants no <br/>\none &quot;mutilating&quot; *his* body. But we also know that could change at any <br/>\ntime.<br/>\n<br/>\nMy husband&#39;s military too, but he&#39;s just learned to &quot;go with the flow&quot; <br/>\nabout the long hair and earrings and possible tattoos. He&#39;s even <br/>\nembraced them wholly. &lt;g&gt; These are NOT *our* bodies. Their bodies <br/>\nbelong to themselves.<br/>\n<br/>\nMy niece and Cam&#39;s girlfriend wanted tattoos and piercings that were <br/>\n&quot;forbidden.&quot; Guess what? Lauren and Carly both got their tongues <br/>\npierced so that their parents would notice---and they didn&#39;t for months <br/>\nand months because the girls avoided speaking directly to their <br/>\nparents. As soon as she turned 18, Lauren got her last name (Lovejoy) <br/>\ntattooed down her back in Chinese characters (it&#39;s actually very <br/>\npretty---just HUGE). Carly turned 18 last November and is getting &quot;This <br/>\ntoo shall pass&quot; tattooed on her lower back next week. Yes, the irony <br/>\nthat that is the ONLY thing that will last is not lost on me either. <br/>\n&lt;g&gt; That&#39;s what Cameron&#39;s considering as well. The *good* thing is that <br/>\nhe&#39;s seriously *considering* it---not just running off to do it because <br/>\nhe&#39;s legally old enough to!<br/>\n<br/>\nIf we don&#39;t &quot;allow&quot; them to direct their bodies, they will end up doing <br/>\nthings they may regret later. But if they are empowered to know that <br/>\ntheir bodies are their own---even at a very young age, they may still <br/>\nget the tatts and piercings, but it will be a *choice*, an action---not <br/>\na REaction.<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.LiveandLearnConference.org\">http://www.LiveandLearnConference.org</a><br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nAOL now offers free email to everyone.  Find out more about what&#39;s free <br/>\nfrom AOL at AOL.com.</div>","specialLinks":[]},{"userId":220662483,"authorName":"Alice","from":"&quot;Alice&quot; &lt;thesackmans@...&gt;","profile":"alice_in_idaho","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Earrings for boys","postDate":"1175961561","msgId":23051,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGV2OGY0cCtvbDcyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":23053,"prevInTime":23050,"nextInTime":23052,"topicId":23051,"numMessagesInTopic":0,"msgSnippet":"My 9 yr son wants to get his ears pierced. My dh is not too happy about this (he is a military man and piercings just strike him the wrong way).  My ds wants","messageBody":"<div id=\"ygrps-yiv-2139898520\">My 9 yr son wants to get his ears pierced. My dh is not too happy<br/>\nabout this (he is a military man and piercings just strike him the<br/>\nwrong way).  My ds wants both of his ears pierced because he figures<br/>\nwhy not go for broke and just get them both done at the same time. <br/>\n(my dd 6 just got both of her ears pierced - which my dh was not too<br/>\nhappy about either)  Anyway, we are all trying to reach a consensus<br/>\nabout this and what type of earrings to get that would look boyish.  I<br/>\nguess I also have a lot of fears of my son looking girlish!  Isn&#39;t<br/>\nthat sad?!  My son has always dressed and styled his own way and has<br/>\nalways loved jewelry, so I guess I shouldn&#39;t be surprised that he<br/>\nwants to get piercings.  I guess the piercing thing caught us/me off<br/>\nguard - I always think of teen boys getting piercings, not 9 yo.  We<br/>\nhave teens in the house (with lots of piercings and tattoos) so I am<br/>\nthinking  that probably has a strong influence.<br/>\n<br/>\nAnyway, I think I am just trying to sort through my own feelings and<br/>\nfears so they don&#39;t get in the way of my son expressing himself.  So<br/>\nif anyone has any thoughts, advice and reassurance, I would appreciate it!<br/>\n<br/>\n-alice<br/>\njoyfully living with dh Ordell, dear niece Megan 17, ds Andrew 9, dd<br/>\nAudrey 6, and various other wonderful people who come and go in our<br/>\nvery busy house</div>","specialLinks":[]}],"prevTopicId":12280,"nextTopicId":23084}}