{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: wondering what to say/do","postDate":"1222991614","msgId":36335,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdjM210dStzMDlpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdjMTVwayttdTQzQGVHcm91cHMuY29tPg=="},"prevInTopic":36333,"nextInTopic":0,"prevInTime":36334,"nextInTime":36336,"topicId":36326,"numMessagesInTopic":0,"msgSnippet":"... lots ... Yup, they re 4 alright ;) Busy busy busy all day long. Whew. As overwhelmed as you are now, take a moment every day to enjoy their energy and","messageBody":"<div id=\"ygrps-yiv-1617996197\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;lisa_mc_connell&quot; <br/>\n&lt;mmlisa2@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Both my boys cruise through the house during the day and play w/ <br/>\n </span></blockquote>lots<br/>\n<blockquote><span title=\"ireply\"> &gt; of different things.<br/>\n<br/>\n </span></blockquote>Yup, they&#39;re 4 alright ;) Busy busy busy all day long. Whew. As <br/>\noverwhelmed as you are now, take a moment every day to enjoy their <br/>\nenergy and enthusiasm. This is why you&#39;re a mom, right? So you can <br/>\nwatch exactly this kind of excitment in living/learning/being <br/>\ncrusing through your home at 100mph. Take a few seconds at least, <br/>\nevery day, to remember that, and relish these moments.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; For instance, they will grab a bag of toys w/<br/>\n&gt; small parts, dump them out, look at them for a second, and then <br/>\n </span></blockquote>move<br/>\n<blockquote><span title=\"ireply\"> &gt; on to something else. They will grab something as they are moving<br/>\n&gt; through the house and bring it to a different spot and drop it <br/>\n </span></blockquote>there.<br/>\n<br/>\nThey are busy people! They want nine different things at once, right <br/>\nnow! and a moment later nine other different things. That&#39;s who they <br/>\nare right now. When Mo was that age I described her as &quot;my high <br/>\nspeed car chase&quot;. When Ray was that age I felt like I was living <br/>\nwith a cartoon character like the Road Runner or... oh, what&#39;s that <br/>\nmouse&#39;s name...? Speedy Gonzales!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They take their shoes off wherever they are and leave them there.<br/>\n<br/>\n </span></blockquote>Mo&#39;s 7 and she&#39;s just getting the whole &quot;this is where shoes go&quot; <br/>\nthing. I just pick them up and put them on the shelf so *I* can find <br/>\nthem when we go out again.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They<br/>\n&gt; picked a bunch of veggies from the garden today, brought them and <br/>\n </span></blockquote>put<br/>\n<blockquote><span title=\"ireply\"> &gt; them on the kitchen table. Then throughout the day, they stopped by<br/>\n&gt; and picked a part different veggies to see what was inside and now <br/>\n </span></blockquote>our<br/>\n<blockquote><span title=\"ireply\"> &gt; table is covered w/ pepper seeds and skins and mashed tomatoes.<br/>\n<br/>\n </span></blockquote>OMG this is such a fantastic example of the way kids learn at this <br/>\nage! They step away and come back to ideas over and over and over. <br/>\nThat&#39;s a learning style that, for many people, continues throughout <br/>\nlife. At this age in particular it plays out in very physical ways - <br/>\nexactly like you describe here. They&#39;re really doing the same thing <br/>\nwhen they dump a box of toys - or a shelf of books - on the floor. <br/>\nThey come back, look at the same pile a different way and move on, <br/>\nonly to come back again later. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So recently I have been saying, &quot;let&#39;s pick this up if you don&#39;t <br/>\n </span></blockquote>want<br/>\n<blockquote><span title=\"ireply\"> &gt; to play with it&quot;<br/>\n<br/>\n </span></blockquote>Cleanup is really really low on their agenda right now. If you are <br/>\ncleaning and it looks like fun and they aren&#39;t in the middle of <br/>\nthirty other things, they might stop and help for a moment or two. <br/>\nBeyond that they just don&#39;t get why you want to clean. Just bc they <br/>\naren&#39;t playing with something right This second doesn&#39;t mean they <br/>\nwon&#39;t come back to it in two more seconds, after all. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I think the difference now<br/>\n&gt; is that I see them as more aware and the behavior to me is coming<br/>\n&gt; across as disrespectful.<br/>\n<br/>\n </span></blockquote>They aren&#39;t intending to be disrespectful. They don&#39;t have much <br/>\nconcept of Others&#39; perspectives at this point, or that mom&#39;s might <br/>\nbe radically different from theirs. Telling them your perspective <br/>\nwon&#39;t help, either. As the adult, you have to be the one to see <br/>\ntheir side, bc they *can&#39;t* see yours - they&#39;ve never been adults,  <br/>\nmuch less moms ;) Try to see the mess as evidence of exuberant <br/>\nliving and learning. They are sharing their joy with you! Its just <br/>\nsort of inconvenient at times.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; If they were doing these types of things at a friend&#39;s house, I <br/>\n </span></blockquote>would<br/>\n<blockquote><span title=\"ireply\"> &gt; definitely encourage them to do otherwise<br/>\n<br/>\n </span></blockquote>If it were an issue with a friend, I&#39;d clean up behind my kids. And <br/>\nmeet somewhere other than her house next time! Seriously, last year <br/>\nwhen I went to L&L I spent a lot of time cleaning the commmon area <br/>\nof my lodge - Mo likes to cut things out of paper and the place <br/>\nwould have been wall to wall trimmings in no time! I&#39;d do that <br/>\nanywhere a mess wouldn&#39;t be okay. But I also try to avoid putting my <br/>\nkids in situations where its not okay to be messy.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Another thing that is frustrating me is that they are both enjoying<br/>\n&gt; playing while eating a meal and it&#39;s causing dishes/glasses to <br/>\n </span></blockquote>break,<br/>\n<blockquote><span title=\"ireply\"> &gt; food spilled on cushions, and quite a mess to clean up after our <br/>\n </span></blockquote>meal.<br/>\n<br/>\nPlastic dishes and cups! Big vinyl table cloths! Throw-covers over <br/>\nall the furniture! I&#39;ve known families who ate for a time picnic-<br/>\nstyle on a table cloth on the floor. I have some little plastic <br/>\ntables designed as lawn furniture that I use for snacks in the <br/>\nliving room and bedroom. I try to keep food on tables so playing can <br/>\nhappen on the floor and other furniture. <br/>\n<br/>\nAnother thought to consider is drop the idea of &quot;meals&quot; for the <br/>\nkids. Bring them small snacks periodically throughout the day. The <br/>\nmesses will be corespondingly smaller.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I<br/>\n&gt; have asked them not to play while we are eating <br/>\n<br/>\n </span></blockquote>That&#39;s like asking them not to think and learn. That sounds harsh, <br/>\nbut playing is how they learn, its how they process every bit of <br/>\ninformation, including information about food and eating and their <br/>\nbodies. Mo sometimes is so busy playing she&#39;ll forget to eat unless <br/>\nI can make food part of the fun - I&#39;ve served snacks *in* toys! <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I<br/>\n&gt; feel like up until this time last year when I became pregnant, I<br/>\n&gt; totally got this unschooling philosophy and was able to live it. <br/>\n<br/>\n </span></blockquote>Yup, somewhere between 3 and 5 parenting changes in a big way. Kids <br/>\nsuddenly have a lot more drive and desire for autonomy - and they <br/>\nget Faster. They&#39;ll slow down, but maybe not for ten years or so, so <br/>\nits good to shift your expectations. Otherwise you could be in for <br/>\nten years of No! and Stop! If you can shift those expectations and <br/>\nlook at your guys as delightful, joyful whirlwinds of passion and <br/>\nverve, it will be much much easier to pick up the daily evidence of <br/>\ntheir enthusiasm.<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":274026229,"authorName":"logan_rose_porter","from":"&quot;logan_rose_porter&quot; &lt;logan_rose_porter@...&gt;","profile":"logan_rose_porter","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: wondering what to say/do","postDate":"1222954541","msgId":36333,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdjMmluZCtkazE2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDUyNDEzLjM2MDUyLnFtQHdlYjU0MTAyLm1haWwucmUyLnlhaG9vLmNvbT4="},"prevInTopic":36331,"nextInTopic":36335,"prevInTime":36332,"nextInTime":36334,"topicId":36326,"numMessagesInTopic":0,"msgSnippet":"One thing that has helped me is really simplifying the amount of stuff we have. It makes you feel a lot more tidy and organized. And there s less for the kids","messageBody":"<div id=\"ygrps-yiv-55725028\">One thing that has helped me is really simplifying the amount of stuff we have. It makes you <br/>\nfeel a lot more tidy and organized. And there&#39;s less for the kids to throw all around the place <br/>\n:P</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] wondering what to say/do","postDate":"1222952374","msgId":36331,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgxMDAyMDU1OXM0MzhhMmIwOG84YzljM2JkYTM3ZThiYjk0QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdjMTVwayttdTQzQGVHcm91cHMuY29tPg==","referencesHeader":"PGdjMTVwayttdTQzQGVHcm91cHMuY29tPg=="},"prevInTopic":36328,"nextInTopic":36333,"prevInTime":36330,"nextInTime":36332,"topicId":36326,"numMessagesInTopic":0,"msgSnippet":"THIS IS LONG..... so if you want to save it to come back to later here it is. ... playing this way since the beginning--but I think the difference now is that","messageBody":"<div id=\"ygrps-yiv-897833733\">THIS IS LONG..... so if you want to save it to come back to later here it<br/>\nis.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;I am feeling really triggered by this--although I guess they have been<br/>\n </span></blockquote>playing this way since the beginning--but I think the difference now<br/>\nis that I see them as more aware and the behavior to me is coming<br/>\nacross as disrespectful.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nI thought it was interesting that you said you expected more of them now.<br/>\nThan when they were infants and tinier tots?  At 4, they&#39;ve only just<br/>\n*begun* to move beyond those stages.  Karl is 5 now, and he still leaves<br/>\nstuff out and I still pick it up.  Occasionally he has handed me things or<br/>\nput toys up.  He&#39;s a real one for focusing for hours and hours and hours.<br/>\nBreaking into his concentrated play and interrupting him was not usually<br/>\nvery successful.  He&#39;s more aware now but often he&#39;s locked into it,<br/>\nenthralled by whatever he&#39;s doing.  It might take several tries to get his<br/>\nattention.<br/>\n<br/>\nIt used to really *BUG* me that he couldn&#39;t be interrupted but he expected<br/>\nimmediate attention from me.  I&#39;ve gotten over that and it took a lot of<br/>\nrethinking on my part to understand that he&#39;s still not aware of others the<br/>\nway an adult would be, although he is beginning to be just a little more<br/>\naware.  I say something about it occasionally.  If I said it everyday, he<br/>\nwould tune me out (he has when I&#39;ve gotten naggy).  I cut nagging out<br/>\nbecause I don&#39;t want Karl to tune me out, and I save it for those infrequent<br/>\nreally rare times when I *really* want his attention.  And even there I&#39;m<br/>\ncareful how I do it.  I used to yell a lot (some people seethe inside<br/>\ninstead).<br/>\n<br/>\nUnschooling has helped me learn why resentment is not the approach to take<br/>\nand what to do about it.  When we&#39;re unable to behave ourselves and ask and<br/>\ntake no for an answer, we&#39;re only *assuring* that our kids are learning to<br/>\ndo the same thing.  NOT how to be patient, ask politely, and accept the<br/>\ndecisions of others with grace.  When we have a lot of needs for immediate<br/>\ngratification that we treat with urgency, that&#39;s how our kids will be too.<br/>\nRealizing that you can gladly handle your own needs for a clean house will<br/>\ncreate a household where kids will eventually know how to do the same.<br/>\n<br/>\nMesses were definitely a trigger for me... especially spills!!!  At first, I<br/>\nwas so awful when Karl spilled things.  I cringe to remember it.  One of the<br/>\nthings that helped me when I started out with unschooling (before Karl was<br/>\nborn actually) was to read the archives.  The going advice seemed to be to<br/>\nrephrase that word &quot;mess.&quot;  To call them --creative endeavors-- or<br/>\n--deconstructive explorations--.  That children are always trying to find<br/>\ngreater and easier access to the objects and stuff in their world.  That<br/>\nthey are absolutely driven to explore everything all day long.<br/>\n<br/>\nReally *see* their goals.  Their goals aren&#39;t to make messes and drive mommy<br/>\nnuts.  Their goals are to explore, to welcome mistakes as opportunites to<br/>\nferret out information about their world, and to have fun and play ALL the<br/>\ntime.  Their goals are not exclusive of doing things for mommy sometimes.<br/>\nKarl does things for me without any ulterior motive behind it.  I&#39;m not used<br/>\nto that from adults so getting that kind of unconditional sweetness from<br/>\nKarl has been a real eye opener for me on the true nature of people the way<br/>\ntheir supposed to be.  He&#39;s open in a way that I didn&#39;t grow up to be.  I&#39;ve<br/>\nlearned a lot from him about unconditional love.<br/>\n<br/>\nRemoving a bunch of books and leaving them seems senseless to an adult.<br/>\nMaybe the kids were pretending the books were a secret door or contained a<br/>\nspecial key while playing detective together.  Putting the books back on the<br/>\nshelf wouldn&#39;t be part of that (and have you noticed cleanup and going to<br/>\nthe bathroom aren&#39;t typically part of the story in movies or tv or books?).<br/>\n<br/>\n<br/>\nIs cleaning interesting to you?  It&#39;s just one of those things, isn&#39;t it?<br/>\nBy and large, cleanup would go best if you expect to be doing most of it.<br/>\nYou can ask for help.  Don&#39;t say: Clean up this mess or this room.  That&#39;s<br/>\ntoo much.  You might have more chance of getting help if you ask for less<br/>\ncomprehensive help.  Pulling books off a shelf is much easier than lining<br/>\nthem back up on the shelf.  That&#39;s not something Karl could have done at 4<br/>\nwithout a lot of dawdly effort.  It seems easy to an adult but that&#39;s<br/>\nbecause we have long arms and can hold books to the shelf while grabbing<br/>\nmore off the floor to put up.  Even if kids have things in easy reach, if<br/>\nthe &quot;put up&quot; is trouble and aggravation in their eyes, they won&#39;t be able to<br/>\nslip into that &quot;let&#39;s have fun helping mommy&quot; mode.<br/>\n<br/>\nYou can sometimes successfully engage your children in clean up games.<br/>\nDepends on the dynamics of your family and the personalities involved.<br/>\nThrowing stuff in a big laundry basket to gather them in one place might be<br/>\nfun.  But be ok with &quot;no&quot; or running into the scenarios where the child<br/>\nzones out from one sphere and gets into yet another play theme.<br/>\n<br/>\nPlay is children&#39;s work and they take it seriously.  Take it seriously too<br/>\nand when you clean, do it with the idea that you are clearing the way for<br/>\nfurther exploration.<br/>\n<br/>\nI sympathize with you.  I only have one kid and it&#39;s *plenty* to keep up<br/>\nwith.  Two going at it is a LOT more work, and you&#39;re a new mommy again too<br/>\nso you are probably (if you&#39;re like me) feeling robbed of your new one&#39;s<br/>\nspecial times.<br/>\n<br/>\nSome of this entails letting go of the idea of having a clean house for a<br/>\nwhile because your kids are really only young for just a very short time<br/>\n(even it if seems like ages right now) and if you&#39;re like many unschooling<br/>\nmoms you&#39;ll miss these years someday.<br/>\n<br/>\nPut it like this.. having wonderful relationships with your kids is a very<br/>\nworthy reason to lose a clean house.  Be glad to have this time with your<br/>\nkids now.  It&#39;s not guaranteed that your kids will even survive to<br/>\nadulthood.  If they do, they will eventually go on to make their way in the<br/>\nworld.  At some point, if you live long enough, you can make the clean house<br/>\nto live in again and have memories of your kids to look back on.  If you<br/>\nplay it right, you&#39;ll end up being friends with them too.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 10/1/08, lisa_mc_connell &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mmlisa2@...\">mmlisa2@...</a>&gt; wrote:<br/>\n&gt; Hi All,<br/>\n&gt;<br/>\n&gt;  I am wondering about how to approach certain situations w/ my almost 4<br/>\n&gt;  year old twins who are my oldest. I also have a 6 week old baby. I<br/>\n&gt;  feel like up until this time last year when I became pregnant, I<br/>\n&gt;  totally got this unschooling philosophy and was able to live it. Then<br/>\n&gt;  I got pregnant, I didn&#39;t have as much energy and was sick in the<br/>\n&gt;  beginning, plus the boys are older and at different stages<br/>\n&gt;  developmentally, and I feel as if I have become lost and slipped into<br/>\n&gt;  a more authoritarian parenting style. I don&#39;t like it!<br/>\n&gt;<br/>\n&gt;  So here are a few situations.<br/>\n&gt;<br/>\n&gt;  Both my boys cruise through the house during the day and play w/ lots<br/>\n&gt;  of different things. For instance, they will grab a bag of toys w/<br/>\n&gt;  small parts, dump them out, look at them for a second, and then move<br/>\n&gt;  on to something else. They will grab something as they are moving<br/>\n&gt;  through the house and bring it to a different spot and drop it there.<br/>\n&gt;  They take their shoes off wherever they are and leave them there. They<br/>\n&gt;  picked a bunch of veggies from the garden today, brought them and put<br/>\n&gt;  them on the kitchen table. Then throughout the day, they stopped by<br/>\n&gt;  and picked a part different veggies to see what was inside and now our<br/>\n&gt;  table is covered w/ pepper seeds and skins and mashed tomatoes.they<br/>\n&gt;  will go to a bookshelf and take all of the books down for no apparent<br/>\n&gt;  reason and then run off to do something else.<br/>\n&gt;<br/>\n&gt;  So these are just some of the examples of the way they play and then<br/>\n&gt;  multiply this by 100 for a full day in the house.<br/>\n&gt;<br/>\n&gt;  So recently I have been saying, &quot;let&#39;s pick this up if you don&#39;t want<br/>\n&gt;  to play with it&quot; and repeat that until they seem to hear me. If they<br/>\n&gt;  decide to do it, great, but if not, I don&#39;t force them to do it, but i<br/>\n&gt;  have to admit ifeel resentful. But I do feel like I am constantly<br/>\n&gt;  asking them to pick up or let&#39;s leave our shoes in the mudroom or<br/>\n&gt;  let&#39;s put our bikes away before we go inside, etc. I feel like I am<br/>\n&gt;  &quot;nagging&quot; them a lot.<br/>\n&gt;<br/>\n&gt;  Should I even be saying this stuff to them? They don&#39;t seem to even<br/>\n&gt;  get the concept and then I can see there is some guilt if they forget<br/>\n&gt;  to say take their shoes off when they come inside or they make a<br/>\n&gt;  &quot;mess&quot; etc.<br/>\n&gt;<br/>\n&gt;  I am feeling really triggered by this--although I guess they have been<br/>\n&gt;  playing this way since the beginning--but I think the difference now<br/>\n&gt;  is that I see them as more aware and the behavior to me is coming<br/>\n&gt;  across as disrespectful. I feel really critical of it and resentful.<br/>\n&gt;  Is this just the way that they play? Is it normal?<br/>\n&gt;<br/>\n&gt;  I don&#39;t have the time or the energy now to pick up as much and I feel<br/>\n&gt;  I guess as if I have had it w/ having a messy house. I feel like I<br/>\n&gt;  follow them through the house and pick up stuff all day long! I know<br/>\n&gt;  this is my issue because I am the type of person that cleans as I go<br/>\n&gt;  when I cook and like to have things orderly in general, but is it okay<br/>\n&gt;  to ask them for help?<br/>\n&gt;<br/>\n&gt;  If they were doing these types of things at a friend&#39;s house, I would<br/>\n&gt;  definitely encourage them to do otherwise, so I am wondering why I<br/>\n&gt;  should let them do it at my house when it creates a lot of work for me<br/>\n&gt;  in the end?<br/>\n&gt;<br/>\n&gt;  Another thing that is frustrating me is that they are both enjoying<br/>\n&gt;  playing while eating a meal and it&#39;s causing dishes/glasses to break,<br/>\n&gt;  food spilled on cushions, and quite a mess to clean up after our meal.<br/>\n&gt;  Arghh, i feel so frustrated by it and am really triggered by it! I<br/>\n&gt;  have asked them not to play while we are eating and explained my<br/>\n&gt;  reasons, but the kids just want to play! So maybe I should have them<br/>\n&gt;  eat at another table that I can set up where they can&#39;t stain cushions<br/>\n&gt;  and give them dishes/glasses that are not breakable?<br/>\n&gt;<br/>\n&gt;  I feel like I could answer my own questions and now they seem a bit<br/>\n&gt;  simple, but still I would love your opinions about this, plus I am<br/>\n&gt;  going to post another topic about sleep!<br/>\n&gt;<br/>\n&gt;  thanks,<br/>\n&gt;  lisa<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":215778715,"authorName":"Jodi Bezzola","from":"Jodi Bezzola &lt;jodibezzola@...&gt;","profile":"jodibezzola","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] wondering what to say/do","postDate":"1222926071","msgId":36328,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUyNDEzLjM2MDUyLnFtQHdlYjU0MTAyLm1haWwucmUyLnlhaG9vLmNvbT4=","inReplyToHeader":"PGdjMTVwayttdTQzQGVHcm91cHMuY29tPg=="},"prevInTopic":36326,"nextInTopic":36331,"prevInTime":36327,"nextInTime":36329,"topicId":36326,"numMessagesInTopic":0,"msgSnippet":"...   ~~I am wondering about how to approach certain situations w/ my almost 4 year old twins who are my oldest.~~   I have almost 4 year old twin girls! ","messageBody":"<div id=\"ygrps-yiv-557924895\"><blockquote><span title=\"qreply\">--- On Wed, 10/1/08, lisa_mc_connell &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mmlisa2@...\">mmlisa2@...</a>&gt; wrote:<br/>\n <br/>\n~~I am wondering about how to approach certain situations w/ my almost 4<br/>\nyear old twins who are my oldest.~~<br/>\n <br/>\nI have almost 4 year old twin girls!  But I don&#39;t have a baby.  I&#39;m actually thinking about having another baby :).<br/>\n <br/>\n~~Both my boys cruise through the house during the day and play w/ lots<br/>\nof different things. For instance, they will grab a bag of toys w/<br/>\nsmall parts, dump them out, look at them for a second, and then move<br/>\non to something else. They will grab something as they are moving<br/>\nthrough the house and bring it to a different spot and drop it there.<br/>\nThey take their shoes off wherever they are and leave them there. They<br/>\npicked a bunch of veggies from the garden today, brought them and put<br/>\nthem on the kitchen table. Then throughout the day, they stopped by<br/>\nand picked a part different veggies to see what was inside and now our<br/>\ntable is covered w/ pepper seeds and skins and mashed tomatoes.they<br/>\nwill go to a bookshelf and take all of the books down for no apparent<br/>\nreason and then run off to do something else.~~<br/>\n <br/>\nWow, does this sound familiar!  This is *exactly* how my girls move through their day in the house.  If I don&#39;t want cleanup to take me a looooong time after they go to bed, I do the same thing and pick up after them all day long.  We don&#39;t spend every day at home though, we are out and about ALOT so they can run off steam outside.  For instance today we went to a lake with a friend and her son, and they played HARD at the beach from 2 p.m.ish until almost 7 p.m. when we headed home because it was getting dark.  It wouldn&#39;t work for us to stay home every day, they are just filled with too much energy for that.  I know you have a small baby, but perhaps you could put your baby in a sling/carrier of some sort and get out and about more?  I&#39;m not sure where you live, but here there are lots of choices of things to do where they can run and play and I can run and play with them, or sit if I need to.<br/>\n<br/>\n~~So recently I have been saying, &quot;let&#39;s pick this up if you don&#39;t want<br/>\nto play with it&quot; and repeat that until they seem to hear me. If they<br/>\ndecide to do it, great, but if not, I don&#39;t force them to do it, but i<br/>\nhave to admit ifeel resentful. But I do feel like I am constantly<br/>\nasking them to pick up or let&#39;s leave our shoes in the mudroom or<br/>\nlet&#39;s put our bikes away before we go inside, etc. I feel like I am<br/>\n&quot;nagging&quot; them a lot.~~<br/>\n <br/>\nFor me, I often ask for their help, and often I just wait until they go to bed and pick up later.  I keep baskets in every room except our office to be able to quickly and easily pick up.  Then once in awhile I sort out all the bits and pieces so they can start fresh again.  One of my girls *loves* to dump things out just for the sake of dumping, so I&#39;ve chosen not to have lots of small things like puzzles with lots of pieces, tiny lego, etc.  They have tons of fun with what we have, and then they use their imaginations a lot also with just about any item they find in the house.<br/>\n<br/>\n~~Should I even be saying this stuff to them? They don&#39;t seem to even<br/>\nget the concept and then I can see there is some guilt if they forget<br/>\nto say take their shoes off when they come inside or they make a<br/>\n&quot;mess&quot; etc.~~<br/>\n <br/>\nIt&#39;s completely okay for you to ask for help, but be aware that they also have the right to say no.  Remember that you&#39;re modelling what *you* want (cleaning up and having an orderly house), and since your 4 year olds seem alot like mine, I would suspect that they could care less if the house was tidy!  It can make all the difference in the world how things are said to our kids, like, &#39;remember, it&#39;s so helpful if you take your shoes off when you come in the house because you&#39;re helping to keep our carpets clean&#39;.  I do lots of modelling and talking throughout the day, and the results of all that I might not see for years yet! <br/>\n<br/>\n~~I am feeling really triggered by this--although I guess they have been<br/>\nplaying this way since the beginning--but I think the difference now<br/>\nis that I see them as more aware and the behavior to me is coming<br/>\nacross as disrespectful. I feel really critical of it and resentful.~~<br/>\n <br/>\nBe very cautious about giving meaning in what they&#39;re doing to have anything to do with you.  They aren&#39;t snubbing their noses at you and your efforts by not &#39;getting it&#39; about cleaning up, because this isn&#39;t their issue yet!  They may or may not grow up to be orderly guys, but for now, this is your issue.  What about it is triggering you?  Are you taking it personally?  What do you hear that it says about you?  This is your opportunity to question and examine why you think what you think, feel what you feel, and believe what you believe.  Welcome to personal growth 1001 via radical unschooling! &lt;G&gt;.  I have had fun lately changing my attitude about &#39;mess&#39;.  Often still I&#39;ll start grumbling and pouting about it and then I&#39;ll remember, &#39;oh yeah, I don&#39;t feel this way anymore&#39; &lt;g&gt;.  It&#39;s a *process*.  The main thing is that you&#39;re here asking questions and being willing to look at what it means for *you*.<br/>\n<br/>\n~~Is this just the way that they play? Is it normal?~~<br/>\n <br/>\nYep.  They&#39;re totally normal.  Darn, huh? &lt;g&gt;.  I thought for a long time it would be so much easier if I just saw this as my kids problem to fall into line and not my issue at all.  And that&#39;s the way most parents out there parent.  And we know a better way.<br/>\n<br/>\n~~I don&#39;t have the time or the energy now to pick up as much and I feel<br/>\nI guess as if I have had it w/ having a messy house. I feel like I<br/>\nfollow them through the house and pick up stuff all day long! I know<br/>\nthis is my issue because I am the type of person that cleans as I go<br/>\nwhen I cook and like to have things orderly in general, but is it okay<br/>\nto ask them for help?~~<br/>\n <br/>\nI tidy as I go as well just to feel I&#39;m keeping my nose above water.  And some days I let it go.  And it&#39;s all okay.  And of course it&#39;s okay to ask for help, as long as you aren&#39;t placing a load of expectation and guilt on them if they say no.  They&#39;re FOUR.  <br/>\n<br/>\n~~If they were doing these types of things at a friend&#39;s house, I would<br/>\ndefinitely encourage them to do otherwise, so I am wondering why I<br/>\nshould let them do it at my house when it creates a lot of work for me<br/>\nin the end?~~<br/>\n <br/>\nBecause it&#39;s their house too.  And you chose to invite them into your home.  And now you&#39;re the adult and you get to suck it up and do most of the work.  For a very short season.  That&#39;s what I&#39;m really coming to understand down to my bones the last few months, is this season while they&#39;re so little is really so very short.  A mom here lost her daughter way too young and I&#39;ve heard her say she would give anything to have her socks to pick up again.  Change your perspective.  It uses up ALOT of energy being resentful, believe me I know, I lived there for years.<br/>\n<br/>\n~~Another thing that is frustrating me is that they are both enjoying<br/>\nplaying while eating a meal and it&#39;s causing dishes/glasses to break,<br/>\nfood spilled on cushions, and quite a mess to clean up after our meal.<br/>\nArghh, i feel so frustrated by it and am really triggered by it! I<br/>\nhave asked them not to play while we are eating and explained my<br/>\nreasons, but the kids just want to play! So maybe I should have them<br/>\neat at another table that I can set up where they can&#39;t stain cushions<br/>\nand give them dishes/glasses that are not breakable?~~<br/>\n <br/>\nI see alot of this as setting them up to win/fail.  Right now it seems you&#39;re kind of setting them up to fail.  I asked my girls what it would take for them to love eating in the kitchen.  They said they wanted a table and chairs *their* size, so we went out and found one.  Then we went to Ikea and they picked out bright coloured, fun, PLASTIC dishes.  They are starting to do well with breakable stuff, but just starting.  Do you have cushions on your chairs for 4 year olds to eat on?  There&#39;s a recipe for them to fail right there.  Get creative and think of ways you can set them up to WIN!<br/>\n<br/>\n~~I feel like I could answer my own questions and now they seem a bit<br/>\nsimple, but still I would love your opinions about this, plus I am<br/>\ngoing to post another topic about sleep!~~<br/>\n <br/>\nIf you go into the archives, you&#39;ll find lots and lots about sleep.  I asked alot of questions last year when we were just starting out.  And I&#39;m sure there are lots of others too.  <br/>\n <br/>\nJodi<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":121761850,"authorName":"lisa_mc_connell","from":"&quot;lisa_mc_connell&quot; &lt;mmlisa2@...&gt;","profile":"lisa_mc_connell","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"wondering what to say/do","postDate":"1222908532","msgId":36326,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdjMTVwayttdTQzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":36328,"prevInTime":36325,"nextInTime":36327,"topicId":36326,"numMessagesInTopic":0,"msgSnippet":"Hi All, I am wondering about how to approach certain situations w/ my almost 4 year old twins who are my oldest. I also have a 6 week old baby. I feel like up","messageBody":"<div id=\"ygrps-yiv-328689933\">Hi All,<br/>\n<br/>\nI am wondering about how to approach certain situations w/ my almost 4<br/>\nyear old twins who are my oldest. I also have a 6 week old baby. I<br/>\nfeel like up until this time last year when I became pregnant, I<br/>\ntotally got this unschooling philosophy and was able to live it. Then<br/>\nI got pregnant, I didn&#39;t have as much energy and was sick in the<br/>\nbeginning, plus the boys are older and at different stages<br/>\ndevelopmentally, and I feel as if I have become lost and slipped into<br/>\na more authoritarian parenting style. I don&#39;t like it!<br/>\n<br/>\nSo here are a few situations.<br/>\n<br/>\nBoth my boys cruise through the house during the day and play w/ lots<br/>\nof different things. For instance, they will grab a bag of toys w/<br/>\nsmall parts, dump them out, look at them for a second, and then move<br/>\non to something else. They will grab something as they are moving<br/>\nthrough the house and bring it to a different spot and drop it there.<br/>\nThey take their shoes off wherever they are and leave them there. They<br/>\npicked a bunch of veggies from the garden today, brought them and put<br/>\nthem on the kitchen table. Then throughout the day, they stopped by<br/>\nand picked a part different veggies to see what was inside and now our<br/>\ntable is covered w/ pepper seeds and skins and mashed tomatoes.they<br/>\nwill go to a bookshelf and take all of the books down for no apparent<br/>\nreason and then run off to do something else.<br/>\n<br/>\nSo these are just some of the examples of the way they play and then<br/>\nmultiply this by 100 for a full day in the house.<br/>\n<br/>\nSo recently I have been saying, &quot;let&#39;s pick this up if you don&#39;t want<br/>\nto play with it&quot; and repeat that until they seem to hear me. If they<br/>\ndecide to do it, great, but if not, I don&#39;t force them to do it, but i<br/>\nhave to admit ifeel resentful. But I do feel like I am constantly<br/>\nasking them to pick up or let&#39;s leave our shoes in the mudroom or<br/>\nlet&#39;s put our bikes away before we go inside, etc. I feel like I am<br/>\n&quot;nagging&quot; them a lot.<br/>\n<br/>\nShould I even be saying this stuff to them? They don&#39;t seem to even<br/>\nget the concept and then I can see there is some guilt if they forget<br/>\nto say take their shoes off when they come inside or they make a<br/>\n&quot;mess&quot; etc. <br/>\n<br/>\nI am feeling really triggered by this--although I guess they have been<br/>\nplaying this way since the beginning--but I think the difference now<br/>\nis that I see them as more aware and the behavior to me is coming<br/>\nacross as disrespectful. I feel really critical of it and resentful.<br/>\nIs this just the way that they play? Is it normal? <br/>\n<br/>\nI don&#39;t have the time or the energy now to pick up as much and I feel<br/>\nI guess as if I have had it w/ having a messy house. I feel like I<br/>\nfollow them through the house and pick up stuff all day long! I know<br/>\nthis is my issue because I am the type of person that cleans as I go<br/>\nwhen I cook and like to have things orderly in general, but is it okay<br/>\nto ask them for help?<br/>\n<br/>\nIf they were doing these types of things at a friend&#39;s house, I would<br/>\ndefinitely encourage them to do otherwise, so I am wondering why I<br/>\nshould let them do it at my house when it creates a lot of work for me<br/>\nin the end?<br/>\n<br/>\nAnother thing that is frustrating me is that they are both enjoying<br/>\nplaying while eating a meal and it&#39;s causing dishes/glasses to break,<br/>\nfood spilled on cushions, and quite a mess to clean up after our meal.<br/>\nArghh, i feel so frustrated by it and am really triggered by it! I<br/>\nhave asked them not to play while we are eating and explained my<br/>\nreasons, but the kids just want to play! So maybe I should have them<br/>\neat at another table that I can set up where they can&#39;t stain cushions<br/>\nand give them dishes/glasses that are not breakable?<br/>\n<br/>\nI feel like I could answer my own questions and now they seem a bit<br/>\nsimple, but still I would love your opinions about this, plus I am<br/>\ngoing to post another topic about sleep!<br/>\n<br/>\nthanks,<br/>\nlisa</div>","specialLinks":[]}],"prevTopicId":36319,"nextTopicId":36336}}