{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":49,"messages":[{"userId":238615405,"authorName":"Kelli Johnston","from":"Kelli Johnston &lt;KelliJohnston@...&gt;","profile":"kaipelesmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Re: feeling unmotivated","postDate":"1216994149","msgId":34780,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExMi1XNTE3NjE0MzJEMjJEQkNBNjc5NTYzNkFEODYwQHBoeC5nYmw+","inReplyToHeader":"PEYwNkYzNzlFLTRBMjUtNERDRS04MjAyLUU2NDAyQkNDMDk0QkBtYWMuY29tPg==","referencesHeader":"PDQ1NDUwNi40MjQ5OS5xbUB3ZWI1MjUwOS5tYWlsLnJlMi55YWhvby5jb20+IDxnNmJjNTIrb21xcEBlR3JvdXBzLmNvbT4gPEJBWTExMi1XODEyMjc5QUY2Mjk0MUI2Mzc3NkQ5QUQ4NjBAcGh4LmdibD4gIDxGMDZGMzc5RS00QTI1LTREQ0UtODIwMi1FNjQwMkJDQzA5NEJAbWFjLmNvbT4="},"prevInTopic":34779,"nextInTopic":34787,"prevInTime":34779,"nextInTime":34781,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"Thanks Pam! I will check out the campout. I think it might have already happened? Ha, well maybe I will plan one in a couple of years ;)Kelli EMAILING FOR THE","messageBody":"<div id=\"ygrps-yiv-1049982495\">Thanks Pam! I will check out the campout. I think it might have already happened?<br/>\n <br/>\nHa, well maybe I will plan one in a couple of years ;)Kelli<br/>\n<br/>\n<br/>\n<br/>\n EMAILING FOR THE GREATER GOODJoin me<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.comFrom\">unschoolingbasics@yahoogroups.comFrom</a>: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>: Thu, 24 Jul 2008 23:54:21 -0700Subject: Re: [unschoolingbasics] Re: feeling unmotivated<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nOn Jul 24, 2008, at 7:53 PM, Kelli Johnston wrote:&gt; We are in CA so if anyone knows of one in the state, let me know.Santa Barbara would be a awesome place for a conference. Why don&#39;t you plan one? &lt;G&gt;HSC&#39;s conference in Sacramento seems to be significantly more unschoolish than the CHN expo and it is really a blast. This&#39;ll be my 12th HSC conference. And there are a bunch of us radical unschoolers who are regulars at the HSC conference.HSC usually has a campout at Refugio (just north of Santa Barbara) every year - the people who go tend to be unschoolers.-pam <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: feeling unmotivated","postDate":"1216968861","msgId":34779,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYwNkYzNzlFLTRBMjUtNERDRS04MjAyLUU2NDAyQkNDMDk0QkBtYWMuY29tPg==","inReplyToHeader":"PEJBWTExMi1XODEyMjc5QUY2Mjk0MUI2Mzc3NkQ5QUQ4NjBAcGh4LmdibD4=","referencesHeader":"PDQ1NDUwNi40MjQ5OS5xbUB3ZWI1MjUwOS5tYWlsLnJlMi55YWhvby5jb20+IDxnNmJjNTIrb21xcEBlR3JvdXBzLmNvbT4gPEJBWTExMi1XODEyMjc5QUY2Mjk0MUI2Mzc3NkQ5QUQ4NjBAcGh4LmdibD4="},"prevInTopic":34778,"nextInTopic":34780,"prevInTime":34778,"nextInTime":34780,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"... Santa Barbara would be a awesome place for a conference. Why don t you plan one?  HSC s conference in Sacramento seems to be significantly more ","messageBody":"<div id=\"ygrps-yiv-953047692\">On Jul 24, 2008, at 7:53 PM, Kelli Johnston wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We are in CA so if anyone knows of one in the state, let me know.<br/>\n<br/>\n<br/>\n </span></blockquote>Santa Barbara would be a awesome place for a conference. Why don&#39;t you  <br/>\nplan one? &lt;G&gt;<br/>\n<br/>\nHSC&#39;s conference in Sacramento seems to be significantly more  <br/>\nunschoolish than the CHN expo and it is really a blast. This&#39;ll be my  <br/>\n12th HSC conference. And there are a bunch of us radical unschoolers  <br/>\nwho are regulars at the HSC conference.<br/>\n<br/>\nHSC usually has a campout at Refugio (just north of Santa Barbara)  <br/>\nevery year - the people who go tend to be unschoolers.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":238615405,"authorName":"Kelli Johnston","from":"Kelli Johnston &lt;KelliJohnston@...&gt;","profile":"kaipelesmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: feeling unmotivated","postDate":"1216954392","msgId":34778,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExMi1XODEyMjc5QUY2Mjk0MUI2Mzc3NkQ5QUQ4NjBAcGh4LmdibD4=","inReplyToHeader":"PGc2YmM1MitvbXFwQGVHcm91cHMuY29tPg==","referencesHeader":"PDQ1NDUwNi40MjQ5OS5xbUB3ZWI1MjUwOS5tYWlsLnJlMi55YWhvby5jb20+IDxnNmJjNTIrb21xcEBlR3JvdXBzLmNvbT4="},"prevInTopic":34777,"nextInTopic":34779,"prevInTime":34777,"nextInTime":34779,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"Thank you Caren! Your post was right up my alley. I really appreciate it :) Now I just need to figure out how to get to a conference! We are in CA so if anyone","messageBody":"<div id=\"ygrps-yiv-318847289\">Thank you Caren! Your post was right up my alley. I really appreciate it :) Now I just need to figure out how to get to a conference! We are in CA so if anyone knows of one in the state, let me know. We are going to the CHN homeschooling conference (And apparently there are unschooling speakers) but I would love to go to one that was *for* unschoolers but I doubt I could fly out of town for it next year (we have a few trips planned for weddings already).<br/>\n <br/>\nOn a weird side note, I really feel like unschooling was where I have been headed all along and things have just taken me here. I have had a very intense journey into motherhood. My son challenged me in so many ways. I had a very odd experience with a psychic at a party when my son was 1.5. It was a family party where a friend of a family friend came and apparently was a psychic. She came up to me and said that my son had &quot;spoken&quot; to her (he was non verbal at the time) and said that needed me to know that he needs a very different path in life. That he will not be ok doing the mainstream thing...that he will be considered not normal and won&#39;t easily conform to what traditional school expects of him. She said that he needed something alternative so that he could follow his own unique path and that if we went down the traditional path that it could be very difficult and unhappy. I haven&#39;t made any real decisions based on what she has said but it has been in my mind whenever I am scared to take a jump and do something off the beaten path. Oh and recently a friend of mine (who says she is very spiritually or psychicly sensitive) has said that my son visits her in dreams, lol. Tells her that he is a free spirit and a risk taker and that he appreciates all that I am doing for him. By the way, the funny thing is that I have a 4 year old daughter and NO ONE has said anything about her, lol. Kelli<br/>\n<br/>\n<br/>\n<br/>\n EMAILING FOR THE GREATER GOODJoin me<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.comFrom\">unschoolingbasics@yahoogroups.comFrom</a>: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:carenkh@...\">carenkh@...</a>: Fri, 25 Jul 2008 02:01:06 +0000Subject: [unschoolingbasics] Re: feeling unmotivated<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nThis post reminded me of a dream I had, years and years ago - beforekids, even! After I had experienced a spiritual awakening. In mydream, I was walking with my friends; we were laughing and talking.The feeling of love between us was SO strong... these were mysoul-mate buddies! In our walk, we came to a bridge. When we got toit, all of my friends stopped - they couldn&#39;t go across. The bridgewas for me to cross, alone. I was SO scared! And SO sad. I had to goalone! And my friends would be on this side of the bridge! They werealso sad, but encouraging. It took a bit of doing, but finally,finally, I took those steps onto the bridge. I was completely bymyself. I got part of the way across, and realized - there was no wayI could go back now, I had to go forward, even though I didn&#39;t knowwhat was on the other side. I walked and walked, and finally, made itto the other side of the bridge -- and there were my friends, waitingfor me! Only things were brighter, and happier! We laughed andlaughed. It&#39;s like we had shifted to a &quot;higher&quot; level of reality - butI had to take those steps on faith first.So it might *feel* like you&#39;re isolated and alone - but we&#39;re here!We&#39;re just on the other side of the bridge -- keep walking! Here weare, friends who will encourage your freedom, and freedom for yourkids. Friends who will accept your children for *exactly* who theyare, without fail. Friends who will never, ever, quiz them about math,or ask if they&#39;re reading yet - because we *know* what&#39;s important!Connection, and love, and acceptance. We&#39;ve been here the whole time!Just waiting.I&#39;m getting used to the support offered by an online community - andtake every opportunity I can to revel in face-to-face community! Iknow I&#39;m not alone. I knew that before last year&#39;s Live & LearnConference, but something HUGE shifted after we went (our firstconference) - I think part of it was the boys seeing tons and tons ofpeople living as we do, not just our handful of friends we have closeto us. I had never read unschooling blogs before then, and I didn&#39;ttake part in national unschooling forums or e-mail lists. But afterthat - I needed the connection! And now, it&#39;s people who *aren&#39;t*unschooling that seem odd to me!Welcome home, my friend!peace,Caren--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Natalie Picone-Louro&lt;mothers_dance@...&gt; wrote:&gt;&gt; &lt; I feel like even though I am comfortable in my heart and evenintellectually with unschooling, it is really isolating me from theworld. I sometimes get concerned that it is somehow an unhealthy thingto be going in this direction&gt;&gt; &gt; I so can relate to this. I hate feeling isolated. I like being apartof what goes on in the world around me. I like to think it is apart ofme as well. The I realize how different I am from alot of it and howdifferent it is from me and my family. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":151505017,"authorName":"carenkh","from":"&quot;carenkh&quot; &lt;carenkh@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: feeling unmotivated","postDate":"1216951266","msgId":34777,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc2YmM1MitvbXFwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ1NDUwNi40MjQ5OS5xbUB3ZWI1MjUwOS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":34776,"nextInTopic":34778,"prevInTime":34776,"nextInTime":34778,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"This post reminded me of a dream I had, years and years ago - before kids, even! After I had experienced a spiritual awakening. In my dream, I was walking with","messageBody":"<div id=\"ygrps-yiv-1519968638\">This post reminded me of a dream I had, years and years ago - before<br/>\nkids, even! After I had experienced a spiritual awakening. In my<br/>\ndream, I was walking with my friends; we were laughing and talking.<br/>\nThe feeling of love between us was SO strong... these were my<br/>\nsoul-mate buddies! In our walk, we came to a bridge. When we got to<br/>\nit, all of my friends stopped - they couldn&#39;t go across. The bridge<br/>\nwas for me to cross, alone. I was SO scared! And SO sad. I had to go<br/>\nalone! And my friends would be on this side of the bridge! They were<br/>\nalso sad, but encouraging. It took a bit of doing, but finally,<br/>\nfinally, I took those steps onto the bridge. I was completely by<br/>\nmyself. I got part of the way across, and realized - there was no way<br/>\nI could go back now, I had to go forward, even though I didn&#39;t know<br/>\nwhat was on the other side. I walked and walked, and finally, made it<br/>\nto the other side of the bridge -- and there were my friends, waiting<br/>\nfor me! Only things were brighter, and happier! We laughed and<br/>\nlaughed. It&#39;s like we had shifted to a &quot;higher&quot; level of reality - but<br/>\nI had to take those steps on faith first.<br/>\n<br/>\nSo it might *feel* like you&#39;re isolated and alone - but we&#39;re here!<br/>\nWe&#39;re just on the other side of the bridge -- keep walking! Here we<br/>\nare, friends who will encourage your freedom, and freedom for your<br/>\nkids. Friends who will accept your children for *exactly* who they<br/>\nare, without fail. Friends who will never, ever, quiz them about math,<br/>\nor ask if they&#39;re reading yet - because we *know* what&#39;s important!<br/>\nConnection, and love, and acceptance. We&#39;ve been here the whole time!<br/>\nJust waiting.<br/>\n<br/>\nI&#39;m getting used to the support offered by an online community - and<br/>\ntake every opportunity I can to revel in face-to-face community! I<br/>\nknow I&#39;m not alone. I knew that before last year&#39;s Live & Learn<br/>\nConference, but something HUGE shifted after we went (our first<br/>\nconference) - I think part of it was the boys seeing tons and tons of<br/>\npeople living as we do, not just our handful of friends we have close<br/>\nto us. I had never read unschooling blogs before then, and I didn&#39;t<br/>\ntake part in national unschooling forums or e-mail lists. But after<br/>\nthat - I needed the connection! And now, it&#39;s people who *aren&#39;t*<br/>\nunschooling that seem odd to me!<br/>\n<br/>\nWelcome home, my friend!<br/>\n<br/>\npeace,<br/>\nCaren<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Natalie Picone-Louro<br/>\n&lt;mothers_dance@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &lt; I feel like even though I am comfortable in my heart and even<br/>\n </span></blockquote>intellectually with unschooling, it is really isolating me from the<br/>\nworld. I sometimes get concerned that it is somehow an unhealthy thing<br/>\nto be going in this direction&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;  <br/>\n&gt; I so can relate to this. I hate feeling isolated. I like being apart<br/>\n </span></blockquote>of what goes on in the world around me. I like to think it is apart of<br/>\nme as well.  The I realize how different I am from alot of it and how<br/>\ndifferent it is from me and my family.</div>","specialLinks":[]},{"userId":238615405,"authorName":"Kelli Johnston","from":"Kelli Johnston &lt;KelliJohnston@...&gt;","profile":"kaipelesmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Developing an unschooling group - was Re: feeling unmotivated","postDate":"1216945361","msgId":34776,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExMi1XNDJDOTZERDVBMUE2ODhCODhGQTUzMEFEODYwQHBoeC5nYmw+","inReplyToHeader":"PGc2YWNxMSttZ2djQGVHcm91cHMuY29tPg==","referencesHeader":"PEJBWTExMi1XNDM3QUM4MEI4NDFFMTFCREZFQjk4RUFEODcwQHBoeC5nYmw+IDxnNmFjcTErbWdnY0BlR3JvdXBzLmNvbT4="},"prevInTopic":34774,"nextInTopic":34777,"prevInTime":34775,"nextInTime":34777,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"near Santa Barbara in California...small beach town (thanks for your email btw :))Kelli EMAILING FOR THE GREATER GOODJoin me To:","messageBody":"<div id=\"ygrps-yiv-2094155196\">near Santa Barbara in California...small beach town <br/>\n <br/>\n(thanks for your email btw :))Kelli<br/>\n<br/>\n<br/>\n<br/>\n EMAILING FOR THE GREATER GOODJoin me<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.comFrom\">unschoolingbasics@yahoogroups.comFrom</a>: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mothers_dance@...\">mothers_dance@...</a>: Thu, 24 Jul 2008 17:06:09 +0000Subject: [unschoolingbasics] Developing an unschooling group - was Re: feeling unmotivated<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nwhere do you live?--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Kelli Johnston &lt;KelliJohnston@...&gt; wrote:&gt;&gt; &gt; This was very motivating for me. I really need to find a good homeschooling group for us and stick to it. I have had some bad experiences with groups that has made it very difficult to motivate, lol. Kelli&gt; &gt; &gt; &gt; EMAILING FOR THE GREATER GOODJoin me&gt; &gt; To: unschoolingbasics@...: pamsoroosh@...: Wed, 23 Jul 2008 09:46:04 -0700Subject: [unschoolingbasics] Developing an unschooling group - was Re: feeling unmotivated&gt; &gt; &gt; &gt; &gt; I just wanted to mention that it is a challenge to develop and maintain an unschooling group. It takes some level of commitment. I did it - because it was important to two of my three kids who really craved an active social life. It meant that we went to the park EVERY week - we didn&#39;t decide not to go one day because we all felt like doing something else, we scheduled around those park days because we recognized that our regular attendance was sort of the glue that held the group together.When people knew, for sure, we&#39;d be there, they&#39;d get in the habit of coming, most of the time, too. So there was usually a group - and, in particular, the kids my kids especially liked to play with would come more often since they knew mine would for sure be there.But what I saw over the years was that a family would come once or twice, the kids wouldn&#39;t click right away and they wouldn&#39;t come back. It often happened that the kid they might have really clicked with wasn&#39;t there that day so they never got a chance to meet. Or they&#39;d notice there weren&#39;t other kids of their child&#39;s gender and age, and they&#39;d be disappointed and not come back. Sometimes they&#39;d come sporadically - but there would be weeks in between those times. The kids would never really connect with the other kids and they&#39;d stop coming, eventually.When people kept on coming, the kids eventually would become part of the ongoing games that were played every week and over time they&#39;d click more and more and maybe make some special friends. It is always a little hard to &quot;break into&quot; a group that has been meeting together for a long time. If someone would just come back every week, for several weeks in a row, they&#39;d usually find they felt a lot more comfortable.Some people would come and make some specific efforts to connect. One girl wasn&#39;t finding it easy to make friends and she started bringing different stuff to the park that would be interesting to other kids - I mean, she actually brought her pet rat, for example, and her little kittens. Those were enough to attract other kids to her and to give them something to talk about together and that broke the ice. These days, years later, she&#39;s got a nice group of teenage unschoolers to socialize with - and it developed out of those park days.My youngest daughter has a great group of unschoolers to hang out with - these are friends she originally made through our unschoolers park day, too. They are almost all older boys - she&#39;s 17, they are boys from 15 to 23 years old. They play D&D and board games and do martial arts, go to movies, go to the beach, and other stuff. She&#39;s very very happy with her social life.It really took work and commitment to create and maintain a group that worked for us. But it also took an open mind and a willingness to entirely drop all age and gender expectations.Like I said, I had two girls who really wanted that ongoing social group - it was a really significant part of their lives. The third one enjoyed it, but didn&#39;t really &quot;need&quot; it as much. So it was worth it to me to be someone who really nurtured the group.-pamOn Jul 23, 2008, at 7:39 AM, k wrote:&gt; Hey. I know the feeling. Local people closeby enough to see about &gt; once a&gt; week or thereabouts... that&#39;s hard to come by for a lot of us &gt; unschoolers.&gt; We go once in a while if Karl is feeling up to it. Lately he&#39;s been &gt; opting&gt; for computer stuff rather than going to a group of people he&#39;s not yet&gt; familiar with and which doesn&#39;t have many boys in the first place... &gt; none&gt; are his age or even close. It&#39;s pretty much girls and a couple of &gt; rough&gt; older boys recently out of school were there last time. &gt; &gt; &gt; &gt; &gt; &gt; &gt; [Non-text portions of this message have been removed]&gt; <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":328087230,"authorName":"Melissa","from":"&quot;Melissa&quot; &lt;ckent001@...&gt;","profile":"ckent9511","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: feeling unmotivated","postDate":"1216919565","msgId":34773,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc2YWQ2ZCtrb2FjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTExMi1XN0FGRkIyQkUwOTAyRjVEMzk5NzBCQUQ4NzBAcGh4LmdibD4="},"prevInTopic":34772,"nextInTopic":34774,"prevInTime":34772,"nextInTime":34774,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"Thank you for your post Kelli.  I also feel unmotivated and it has lead to guilt. I was too afraid to admit my feelings, but feel so much comfort in knowing","messageBody":"<div id=\"ygrps-yiv-185876191\">Thank you for your post Kelli.  I also feel unmotivated and it has <br/>\nlead to guilt. I was too afraid to admit my feelings, but feel so <br/>\nmuch comfort in knowing other people have been through this too.  I <br/>\nappreciate all the responses.   Thank you all.<br/>\nMelissa-Ocala FL--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Kelli <br/>\nJohnston &lt;KelliJohnston@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; Thanks Natalie :) I do have some friends but I am noticing that the <br/>\n </span></blockquote>few close friends I have are sorta feeling more and more distant <br/>\nbecause of the school thing. They are sending their children to <br/>\nschool this coming year so we are very much in different places and <br/>\nvery much involved in the reward type parenting. I think you might be <br/>\nright about rebelling. I feel like even though I am comfortable in my <br/>\nheart and even intellectually with unschooling, it is really <br/>\nisolating me from the world. I sometimes get concerned that it is <br/>\nsomehow an unhealthy thing to be going in this direction....like <br/>\nsomehow I am purposely finding something that will make me so <br/>\ndifferent from everyone else that I don&#39;t have to deal with anyone, <br/>\nlol. I guess this would be more realistic if unschooling was less <br/>\nkindness and more danger :).Kelli<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  EMAILING FOR THE GREATER GOODJoin me<br/>\n&gt; <br/>\n&gt; To: unschoolingbasics@...: mothers_dance@...: Wed, 23 Jul 2008 <br/>\n </span></blockquote>21:32:19 +0000Subject: [unschoolingbasics] Re: feeling unmotivated<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I am going through the same thing. I come in and out of it. I don&#39;t <br/>\n </span></blockquote>feel motivated to do anything and I would much rather stay home then <br/>\ngo anywhere. And eventhough I am pregnant with my third, I don&#39;t have <br/>\nthe energy, it is too hot outside, going anywhere bymyself with <br/>\nspirited 5 yr old and very strong minded almost 2 yr old and pregnant <br/>\nis very hard for me. I too wait for my partner to do bug outings, and <br/>\nhaving the company feels really good. I have noticed for me that when <br/>\nI am feeling down on myself or lonely I get this way. Right now I am <br/>\nemotional and harmonal it is a little crazy, but it still happened <br/>\neven when I wasn&#39;t pregnant. There aren&#39;t unschoolers that are at <br/>\narms reach and we have lived here for a year and so our, my cirlce is <br/>\nstill being established. It is a slow process. I trust it will all be <br/>\nok. I don&#39;t know if this is making any sense..pregnant brain..lolbut <br/>\nwhen my energy is heavy everything around me is heavy then I start to <br/>\n2nd guess what I am doing from the influences I do have around me. <br/>\nBut when I am able to release that energy, it does clear up for me <br/>\nand I am more motivated to do things. I find it easier to release <br/>\nwhen I surrender to the feelings rather then being hard on myself <br/>\nabout it. Be gentle with yourself and find your compassion for <br/>\nyourself as well. Sounds like a lot has happended this past year and <br/>\nmaybe from having to do so much of what you didn&#39;t want to do, maybe <br/>\nyou are rebelling, and maybe that is just what you need to do. Try to <br/>\ngive yourself the permission to be here. Not having support really <br/>\ncan unmotivate me as well. But I had reach out, and that is what you <br/>\nare doing now, reaching out. If your children are so zoned into what <br/>\nthey are doing that sounds awsome to me. And maybe when you paint <br/>\ndon&#39;t invite them, just paint for yourself and see what happens..Do <br/>\nyou have close women friends around you..Maybe there are needs that <br/>\nyou have for yourself that aren&#39;t being met as well. I feel like I am <br/>\na better mother when I am a better woman. That is what works for me. <br/>\nTake care.Natalie--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Kelli <br/>\nJohnston &lt;KelliJohnston@&gt; wrote:&gt;&gt; &gt; Hi, I was wondering if anyone <br/>\ncould shed some light on how to get motivated to create an exciting <br/>\neducational environment for my kids. They are pretty young still (5 & <br/>\n4). We get out to the beach and the park a couple times a week but <br/>\nother than that we stay home most of the day. Our weekends are pretty <br/>\npacked so once the week rolls around, I feel pretty tired and <br/>\nunmotivated! I know that the kids are learning a lot doing what they <br/>\nare doing (mostly imaginary play, drawing/painting, playing in the <br/>\nyard, watching tv, and using the computer) but I feel like I should <br/>\nbe exposing them more to stuff outside of the house (museums, parks, <br/>\nhikes, etc) or having more materials around the house that could <br/>\nspark interest. I keep thinking that today is the day that I will <br/>\nmotivate or even trying to schedule myself but I find myself <br/>\nrebelling against myself, lol. Anyone have any suggestions? Should I <br/>\njust let it be and de-school for a while (my 5 year old was on a <br/>\ncurriculum last year which was stressful for all of us) or push <br/>\nmyself until it feels more natural? I am not talking about forcing <br/>\nanything on them...just offering more options than what is <br/>\nimmediately in front of them that they are aware of.Kelli&gt; &gt; &gt; &gt; <br/>\nEMAILING FOR THE GREATER GOODJoin me&gt; &gt; [Non-text portions of this <br/>\nmessage have been removed]&gt; <br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":187978159,"authorName":"Natalie","from":"&quot;Natalie&quot; &lt;mothers_dance@...&gt;","profile":"mothers_dance","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Developing an unschooling group - was Re: feeling unmotivated","postDate":"1216919169","msgId":34774,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc2YWNxMSttZ2djQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTExMi1XNDM3QUM4MEI4NDFFMTFCREZFQjk4RUFEODcwQHBoeC5nYmw+"},"prevInTopic":34773,"nextInTopic":34776,"prevInTime":34773,"nextInTime":34775,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"where do you live? ... homeschooling group for us and stick to it. I have had some bad experiences with groups that has made it very difficult to motivate, ","messageBody":"<div id=\"ygrps-yiv-1842894894\">where do you live?<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Kelli Johnston <br/>\n&lt;KelliJohnston@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; This was very motivating for me. I really need to find a good <br/>\n </span></blockquote>homeschooling group for us and stick to it. I have had some bad <br/>\nexperiences with groups that has made it very difficult to motivate, <br/>\nlol. Kelli<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  EMAILING FOR THE GREATER GOODJoin me<br/>\n&gt; <br/>\n&gt; To: unschoolingbasics@...: pamsoroosh@...: Wed, 23 Jul 2008 <br/>\n </span></blockquote>09:46:04 -0700Subject: [unschoolingbasics] Developing an unschooling <br/>\ngroup - was Re: feeling unmotivated<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I just wanted to mention that it is a challenge to develop and <br/>\n </span></blockquote>maintain an unschooling group. It takes some level of commitment. I <br/>\ndid it - because it was important to two of my three kids who really <br/>\ncraved an active social life. It meant that we went to the park EVERY <br/>\nweek - we didn&#39;t decide not to go one day because we all felt like <br/>\ndoing something else, we scheduled around those park days because we <br/>\nrecognized that our regular attendance was sort of the glue that held <br/>\nthe group together.When people knew, for sure, we&#39;d be there, they&#39;d <br/>\nget in the habit of coming, most of the time, too. So there was <br/>\nusually a group - and, in particular, the kids my kids especially <br/>\nliked to play with would come more often since they knew mine would <br/>\nfor sure be there.But what I saw over the years was that a family <br/>\nwould come once or twice, the kids wouldn&#39;t click right away and they <br/>\nwouldn&#39;t come back. It often happened that the kid they might have <br/>\nreally clicked with wasn&#39;t there that day so they never got a chance <br/>\nto meet. Or they&#39;d notice there weren&#39;t other kids of their child&#39;s <br/>\ngender and age, and they&#39;d be disappointed and not come back. <br/>\nSometimes they&#39;d come sporadically - but there would be weeks in <br/>\nbetween those times. The kids would never really connect with the <br/>\nother kids and they&#39;d stop coming, eventually.When people kept on <br/>\ncoming, the kids eventually would become part of the ongoing games <br/>\nthat were played every week and over time they&#39;d click more and more <br/>\nand maybe make some special friends. It is always a little hard <br/>\nto &quot;break into&quot; a group that has been meeting together for a long <br/>\ntime. If someone would just come back every week, for several weeks <br/>\nin a row, they&#39;d usually find they felt a lot more comfortable.Some <br/>\npeople would come and make some specific efforts to connect. One girl <br/>\nwasn&#39;t finding it easy to make friends and she started bringing <br/>\ndifferent stuff to the park that would be interesting to other kids - <br/>\nI mean, she actually brought her pet rat, for example, and her little <br/>\nkittens. Those were enough to attract other kids to her and to give <br/>\nthem something to talk about together and that broke the ice. These <br/>\ndays, years later, she&#39;s got a nice group of teenage unschoolers to <br/>\nsocialize with - and it developed out of those park days.My youngest <br/>\ndaughter has a great group of unschoolers to hang out with - these <br/>\nare friends she originally made through our unschoolers park day, <br/>\ntoo. They are almost all older boys - she&#39;s 17, they are boys from 15 <br/>\nto 23 years old. They play D&D and board games and do martial arts, <br/>\ngo to movies, go to the beach, and other stuff. She&#39;s very very happy <br/>\nwith her social life.It really took work and commitment to create and <br/>\nmaintain a group that worked for us. But it also took an open mind <br/>\nand a willingness to entirely drop all age and gender <br/>\nexpectations.Like I said, I had two girls who really wanted that <br/>\nongoing social group - it was a really significant part of their <br/>\nlives. The third one enjoyed it, but didn&#39;t really &quot;need&quot; it as much. <br/>\nSo it was worth it to me to be someone who really nurtured the group.-<br/>\npamOn Jul 23, 2008, at 7:39 AM, k wrote:&gt; Hey. I know the feeling. <br/>\nLocal people closeby enough to see about &gt; once a&gt; week or <br/>\nthereabouts... that&#39;s hard to come by for a lot of us &gt; unschoolers.&gt; <br/>\nWe go once in a while if Karl is feeling up to it. Lately he&#39;s been &gt; <br/>\nopting&gt; for computer stuff rather than going to a group of people <br/>\nhe&#39;s not yet&gt; familiar with and which doesn&#39;t have many boys in the <br/>\nfirst place... &gt; none&gt; are his age or even close. It&#39;s pretty much <br/>\ngirls and a couple of &gt; rough&gt; older boys recently out of school were <br/>\nthere last time. <br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":187978159,"authorName":"Natalie Picone-Louro","from":"Natalie Picone-Louro &lt;mothers_dance@...&gt;","profile":"mothers_dance","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: feeling unmotivated","postDate":"1216919049","msgId":34772,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1NDUwNi40MjQ5OS5xbUB3ZWI1MjUwOS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":34767,"nextInTopic":34773,"prevInTime":34771,"nextInTime":34773,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-2028375416\">&lt; I feel like even though I am comfortable in my heart and even intellectually with unschooling, it is really isolating me from the world. I sometimes get concerned that it is somehow an unhealthy thing to be going in this direction&gt;<br/>\n <br/>\nI so can relate to this. I hate feeling isolated. I like being apart of what goes on in the world around me. I like to think it is apart of me as well.  The I realize how different I am from alot of it and how different it is from me and my family. It is all part of the process though, detatching ourselves to what we thought we were or are supposed to be doing, hanging out with, involved in....and so on. It feels so much better to be and feel safe and just do what is known and accepted. Coming from a family of needing their acceptance all the time I found myslef having a very hard time transitioning to this lifestyle because people around me didn&#39;t accept it or me b/c of it. I got caught up in it. And I wanted to be included, not excluded. I felt isolated and it scared me..I too felt this may be unhealthy..that is the deschooling.<br/>\nThen the better part of me who was bold and ballsy (sp?) and didn&#39;t give a shit what others thought, I became empowered...Quite honestly now I am feeling empowered again talking baout it with you..b/c I am in the same place. I was sitting in my thoughts that can over power me which isn&#39;t good but as soon as I express them I was able to release them and be empowered once again. Thank you for that gift. thank you for reminding me.<br/>\nLike you siad you feel it in your heart and you trust that it is right...living outside the box from mainstreem can be scary and isolating, it may feel this way for a while. Trust your choices and try to surround yourself with people that support you and not judge you. Establish your own community...go to conferences and be with your new family..That is what it feels like to me, my chosen family.<br/>\nLovingly, Natalie<br/>\n<br/>\nVisit our blog:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://twodancingpepitas.blogspot.com/\">http://twodancingpepitas.blogspot.com/</a><br/>\n<br/>\nOur deepest fear is not that we are inadequate. Our deepest fear is <br/>\nthat we are powerful beyond measure. <br/>\n- Marianne Williamson<br/>\n<br/>\n&quot;You know you are face-to-face with the unfinished business of your own childhood when you respond with strong negative feelings to your child&#39;s behavior.&quot; (Hendrix and Hunt, 1997)<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":238615405,"authorName":"Kelli Johnston","from":"Kelli Johnston &lt;KelliJohnston@...&gt;","profile":"kaipelesmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Developing an unschooling group - was Re: feeling unmotivated","postDate":"1216907106","msgId":34767,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExMi1XNDM3QUM4MEI4NDFFMTFCREZFQjk4RUFEODcwQHBoeC5nYmw+","inReplyToHeader":"PEQzNEZEM0YzLTIwRTEtNERDNS05Q0RFLTM0RkJBRTEyQUYyNEBtYWMuY29tPg==","referencesHeader":"PEJBWTExMi1XMjQxNDI4MDAxQzhEN0Y1MDgxQzk4QUFEODUwQHBoeC5nYmw+IDxnNjc4ZWYrcDdrb0BlR3JvdXBzLmNvbT4gIDwzYTkzZmZmMTA4MDcyMzA3MTNqMWVkZTBlN2J4YWEwYWYzZDdmMjMzMGM1NEBtYWlsLmdtYWlsLmNvbT4gIDxCQVkxMTItVzM0MzgwM0I1RDk3MTQyQ0M5Rjk3OTFBRDg0MEBwaHguZ2JsPiAgPDNhOTNmZmYxMDgwNzIzMDczOXYzMzM0ZjYzYms3YTY2YzE1MTQ3NWEwODljQG1haWwuZ21haWwuY29tPiAgPEQzNEZEM0YzLTIwRTEtNERDNS05Q0RFLTM0RkJBRTEyQUYyNEBtYWMuY29tPg=="},"prevInTopic":34766,"nextInTopic":34772,"prevInTime":34766,"nextInTime":34768,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"This was very motivating for me. I really need to find a good homeschooling group for us and stick to it. I have had some bad experiences with groups that has","messageBody":"<div id=\"ygrps-yiv-1300877140\">This was very motivating for me. I really need to find a good homeschooling group for us and stick to it. I have had some bad experiences with groups that has made it very difficult to motivate, lol. Kelli<br/>\n<br/>\n<br/>\n<br/>\n EMAILING FOR THE GREATER GOODJoin me<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.comFrom\">unschoolingbasics@yahoogroups.comFrom</a>: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>: Wed, 23 Jul 2008 09:46:04 -0700Subject: [unschoolingbasics] Developing an unschooling group - was Re: feeling unmotivated<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI just wanted to mention that it is a challenge to develop and maintain an unschooling group. It takes some level of commitment. I did it - because it was important to two of my three kids who really craved an active social life. It meant that we went to the park EVERY week - we didn&#39;t decide not to go one day because we all felt like doing something else, we scheduled around those park days because we recognized that our regular attendance was sort of the glue that held the group together.When people knew, for sure, we&#39;d be there, they&#39;d get in the habit of coming, most of the time, too. So there was usually a group - and, in particular, the kids my kids especially liked to play with would come more often since they knew mine would for sure be there.But what I saw over the years was that a family would come once or twice, the kids wouldn&#39;t click right away and they wouldn&#39;t come back. It often happened that the kid they might have really clicked with wasn&#39;t there that day so they never got a chance to meet. Or they&#39;d notice there weren&#39;t other kids of their child&#39;s gender and age, and they&#39;d be disappointed and not come back. Sometimes they&#39;d come sporadically - but there would be weeks in between those times. The kids would never really connect with the other kids and they&#39;d stop coming, eventually.When people kept on coming, the kids eventually would become part of the ongoing games that were played every week and over time they&#39;d click more and more and maybe make some special friends. It is always a little hard to &quot;break into&quot; a group that has been meeting together for a long time. If someone would just come back every week, for several weeks in a row, they&#39;d usually find they felt a lot more comfortable.Some people would come and make some specific efforts to connect. One girl wasn&#39;t finding it easy to make friends and she started bringing different stuff to the park that would be interesting to other kids - I mean, she actually brought her pet rat, for example, and her little kittens. Those were enough to attract other kids to her and to give them something to talk about together and that broke the ice. These days, years later, she&#39;s got a nice group of teenage unschoolers to socialize with - and it developed out of those park days.My youngest daughter has a great group of unschoolers to hang out with - these are friends she originally made through our unschoolers park day, too. They are almost all older boys - she&#39;s 17, they are boys from 15 to 23 years old. They play D&D and board games and do martial arts, go to movies, go to the beach, and other stuff. She&#39;s very very happy with her social life.It really took work and commitment to create and maintain a group that worked for us. But it also took an open mind and a willingness to entirely drop all age and gender expectations.Like I said, I had two girls who really wanted that ongoing social group - it was a really significant part of their lives. The third one enjoyed it, but didn&#39;t really &quot;need&quot; it as much. So it was worth it to me to be someone who really nurtured the group.-pamOn Jul 23, 2008, at 7:39 AM, k wrote:&gt; Hey. I know the feeling. Local people closeby enough to see about &gt; once a&gt; week or thereabouts... that&#39;s hard to come by for a lot of us &gt; unschoolers.&gt; We go once in a while if Karl is feeling up to it. Lately he&#39;s been &gt; opting&gt; for computer stuff rather than going to a group of people he&#39;s not yet&gt; familiar with and which doesn&#39;t have many boys in the first place... &gt; none&gt; are his age or even close. It&#39;s pretty much girls and a couple of &gt; rough&gt; older boys recently out of school were there last time. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":238615405,"authorName":"Kelli Johnston","from":"Kelli Johnston &lt;KelliJohnston@...&gt;","profile":"kaipelesmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: feeling unmotivated","postDate":"1216907019","msgId":34766,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExMi1XN0FGRkIyQkUwOTAyRjVEMzk5NzBCQUQ4NzBAcGh4LmdibD4=","inReplyToHeader":"PGc2ODgxMys2MXVpQGVHcm91cHMuY29tPg==","referencesHeader":"PEJBWTExMi1XMTNDOUJFRkFGQjcyMzEwMTU5MTg0REFEODUwQHBoeC5nYmw+IDxnNjg4MTMrNjF1aUBlR3JvdXBzLmNvbT4="},"prevInTopic":34762,"nextInTopic":34767,"prevInTime":34765,"nextInTime":34767,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"Thanks Natalie :) I do have some friends but I am noticing that the few close friends I have are sorta feeling more and more distant because of the school","messageBody":"<div id=\"ygrps-yiv-1854033147\">Thanks Natalie :) I do have some friends but I am noticing that the few close friends I have are sorta feeling more and more distant because of the school thing. They are sending their children to school this coming year so we are very much in different places and very much involved in the reward type parenting. I think you might be right about rebelling. I feel like even though I am comfortable in my heart and even intellectually with unschooling, it is really isolating me from the world. I sometimes get concerned that it is somehow an unhealthy thing to be going in this direction....like somehow I am purposely finding something that will make me so different from everyone else that I don&#39;t have to deal with anyone, lol. I guess this would be more realistic if unschooling was less kindness and more danger :).Kelli<br/>\n<br/>\n<br/>\n<br/>\n EMAILING FOR THE GREATER GOODJoin me<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.comFrom\">unschoolingbasics@yahoogroups.comFrom</a>: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mothers_dance@...\">mothers_dance@...</a>: Wed, 23 Jul 2008 21:32:19 +0000Subject: [unschoolingbasics] Re: feeling unmotivated<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI am going through the same thing. I come in and out of it. I don&#39;t feel motivated to do anything and I would much rather stay home then go anywhere. And eventhough I am pregnant with my third, I don&#39;t have the energy, it is too hot outside, going anywhere bymyself with spirited 5 yr old and very strong minded almost 2 yr old and pregnant is very hard for me. I too wait for my partner to do bug outings, and having the company feels really good. I have noticed for me that when I am feeling down on myself or lonely I get this way. Right now I am emotional and harmonal it is a little crazy, but it still happened even when I wasn&#39;t pregnant. There aren&#39;t unschoolers that are at arms reach and we have lived here for a year and so our, my cirlce is still being established. It is a slow process. I trust it will all be ok. I don&#39;t know if this is making any sense..pregnant brain..lolbut when my energy is heavy everything around me is heavy then I start to 2nd guess what I am doing from the influences I do have around me. But when I am able to release that energy, it does clear up for me and I am more motivated to do things. I find it easier to release when I surrender to the feelings rather then being hard on myself about it. Be gentle with yourself and find your compassion for yourself as well. Sounds like a lot has happended this past year and maybe from having to do so much of what you didn&#39;t want to do, maybe you are rebelling, and maybe that is just what you need to do. Try to give yourself the permission to be here. Not having support really can unmotivate me as well. But I had reach out, and that is what you are doing now, reaching out. If your children are so zoned into what they are doing that sounds awsome to me. And maybe when you paint don&#39;t invite them, just paint for yourself and see what happens..Do you have close women friends around you..Maybe there are needs that you have for yourself that aren&#39;t being met as well. I feel like I am a better mother when I am a better woman. That is what works for me. Take care.Natalie--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Kelli Johnston &lt;KelliJohnston@...&gt; wrote:&gt;&gt; &gt; Hi, I was wondering if anyone could shed some light on how to get motivated to create an exciting educational environment for my kids. They are pretty young still (5 & 4). We get out to the beach and the park a couple times a week but other than that we stay home most of the day. Our weekends are pretty packed so once the week rolls around, I feel pretty tired and unmotivated! I know that the kids are learning a lot doing what they are doing (mostly imaginary play, drawing/painting, playing in the yard, watching tv, and using the computer) but I feel like I should be exposing them more to stuff outside of the house (museums, parks, hikes, etc) or having more materials around the house that could spark interest. I keep thinking that today is the day that I will motivate or even trying to schedule myself but I find myself rebelling against myself, lol. Anyone have any suggestions? Should I just let it be and de-school for a while (my 5 year old was on a curriculum last year which was stressful for all of us) or push myself until it feels more natural? I am not talking about forcing anything on them...just offering more options than what is immediately in front of them that they are aware of.Kelli&gt; &gt; &gt; &gt; EMAILING FOR THE GREATER GOODJoin me&gt; &gt; [Non-text portions of this message have been removed]&gt; <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Developing an unschooling group - was Re: feeling unmotivated","postDate":"1216866412","msgId":34754,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgwNzIzMTkyNnI1ZGUxZjg5NHM0Zjg1NDExMDliYmU2ODUxQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEQzNEZEM0YzLTIwRTEtNERDNS05Q0RFLTM0RkJBRTEyQUYyNEBtYWMuY29tPg==","referencesHeader":"PEJBWTExMi1XMjQxNDI4MDAxQzhEN0Y1MDgxQzk4QUFEODUwQHBoeC5nYmw+CSA8ZzY3OGVmK3A3a29AZUdyb3Vwcy5jb20+CSA8M2E5M2ZmZjEwODA3MjMwNzEzajFlZGUwZTdieGFhMGFmM2Q3ZjIzMzBjNTRAbWFpbC5nbWFpbC5jb20+CSA8QkFZMTEyLVczNDM4MDNCNUQ5NzE0MkNDOUY5NzkxQUQ4NDBAcGh4LmdibD4JIDwzYTkzZmZmMTA4MDcyMzA3Mzl2MzMzNGY2M2JrN2E2NmMxNTE0NzVhMDg5Y0BtYWlsLmdtYWlsLmNvbT4JIDxEMzRGRDNGMy0yMEUxLTREQzUtOUNERS0zNEZCQUUxMkFGMjRAbWFjLmNvbT4="},"prevInTopic":34753,"nextInTopic":34761,"prevInTime":34753,"nextInTime":34755,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"Hi Pam.  I didn t realize until the end of your post that part of an earlier post of mine was a takeoff point.  I ve heard how this is similar for alot of","messageBody":"<div id=\"ygrps-yiv-675438897\">Hi Pam.  I didn&#39;t realize until the end of your post that part of an earlier<br/>\npost of mine was a takeoff point.  I&#39;ve heard how this is similar for alot<br/>\nof unschoolers, and I know I&#39;m not the only one who goes through this<br/>\nstuff.  What you wrote is for many people trying to help their children<br/>\ndevelop happy social outlets, and it sure applies to a lot more people than<br/>\njust me.<br/>\n<br/>\nAnyway as I read it I thought.... wow, just what I needed to hear and<br/>\nconfirm for myself.  Thanks.  I know that things will look brighter if we<br/>\njust keep it up.<br/>\n<br/>\nI went to park day today.  I have tried to carefully  -strategically-  plan<br/>\nwhen and how I encourage Karl to branch out more.  He is a mixture of<br/>\nextrovert / introvert, like most of us.  When he was younger he was ever so<br/>\nmuch more extroverted than he is now, and in the last couple of years he&#39;s<br/>\nhad some pretty serious setbacks... shocks about people Karl considered to<br/>\nbe friends or potential friends.  Since his dad and I were separated for<br/>\nwell over a year, I wasn&#39;t around for a lot of what went down.  Lots of<br/>\nbabysitters and babysitter&#39;s children.  So there&#39;s recovery or is it just<br/>\nnew ground to open up?<br/>\n<br/>\nOne other practical reason I haven&#39;t gone every single week is our car<br/>\ndoesn&#39;t have air and it&#39;s so hot to drive for something like 45 minutes one<br/>\nway to the park.  Not only was Karl trying to contain nervousness but he was<br/>\njust miserably hot.  Thankfully there&#39;s plenty of shade at the park, but the<br/>\nheat sort of took it out of him before he even arrived.  I don&#39;t think he<br/>\nfelt his best.  But there was two other boys there as well as a girl his age<br/>\nwho had been there when we went last month.<br/>\n<br/>\nSo I feel more hopeful.  I do feel a bit concerned though about a snippet<br/>\nI&#39;ve heard twice now in our group.  A comment about teenage boys and girls<br/>\nat an overnight church camp/cabin outing.  I don&#39;t know if this means that<br/>\nin some people&#39;s opinion, girls and boys aren&#39;t supposed to be friends or if<br/>\nthey&#39;re not to be trusted off by themselves or what.  I&#39;m wondering if it<br/>\nportends something I don&#39;t want or if there&#39;s anything I can gently say or<br/>\nquery on about it.  I don&#39;t feel like I know enough to know what to ask<br/>\nreally.  We hardly can say we know each other.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 7/23/08, Pamela Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   I just wanted to mention that it is a challenge to develop and<br/>\n&gt; maintain an unschooling group. It takes some level of commitment. I<br/>\n&gt; did it - because it was important to two of my three kids who really<br/>\n&gt; craved an active social life. It meant that we went to the park EVERY<br/>\n&gt; week - we didn&#39;t decide not to go one day because we all felt like<br/>\n&gt; doing something else, we scheduled around those park days because we<br/>\n&gt; recognized that our regular attendance was sort of the glue that held<br/>\n&gt; the group together.<br/>\n&gt;<br/>\n&gt; When people knew, for sure, we&#39;d be there, they&#39;d get in the habit of<br/>\n&gt; coming, most of the time, too. So there was usually a group - and, in<br/>\n&gt; particular, the kids my kids especially liked to play with would come<br/>\n&gt; more often since they knew mine would for sure be there.<br/>\n&gt;<br/>\n&gt; But what I saw over the years was that a family would come once or<br/>\n&gt; twice, the kids wouldn&#39;t click right away and they wouldn&#39;t come back.<br/>\n&gt; It often happened that the kid they might have really clicked with<br/>\n&gt; wasn&#39;t there that day so they never got a chance to meet. Or they&#39;d<br/>\n&gt; notice there weren&#39;t other kids of their child&#39;s gender and age, and<br/>\n&gt; they&#39;d be disappointed and not come back. Sometimes they&#39;d come<br/>\n&gt; sporadically - but there would be weeks in between those times. The<br/>\n&gt; kids would never really connect with the other kids and they&#39;d stop<br/>\n&gt; coming, eventually.<br/>\n&gt;<br/>\n&gt; When people kept on coming, the kids eventually would become part of<br/>\n&gt; the ongoing games that were played every week and over time they&#39;d<br/>\n&gt; click more and more and maybe make some special friends. It is always<br/>\n&gt; a little hard to &quot;break into&quot; a group that has been meeting together<br/>\n&gt; for a long time. If someone would just come back every week, for<br/>\n&gt; several weeks in a row, they&#39;d usually find they felt a lot more<br/>\n&gt; comfortable.<br/>\n&gt;<br/>\n&gt; Some people would come and make some specific efforts to connect. One<br/>\n&gt; girl wasn&#39;t finding it easy to make friends and she started bringing<br/>\n&gt; different stuff to the park that would be interesting to other kids -<br/>\n&gt; I mean, she actually brought her pet rat, for example, and her little<br/>\n&gt; kittens. Those were enough to attract other kids to her and to give<br/>\n&gt; them something to talk about together and that broke the ice. These<br/>\n&gt; days, years later, she&#39;s got a nice group of teenage unschoolers to<br/>\n&gt; socialize with - and it developed out of those park days.<br/>\n&gt;<br/>\n&gt; My youngest daughter has a great group of unschoolers to hang out with<br/>\n&gt; - these are friends she originally made through our unschoolers park<br/>\n&gt; day, too. They are almost all older boys - she&#39;s 17, they are boys<br/>\n&gt; from 15 to 23 years old. They play D&D and board games and do martial<br/>\n&gt; arts, go to movies, go to the beach, and other stuff. She&#39;s very very<br/>\n&gt; happy with her social life.<br/>\n&gt;<br/>\n&gt; It really took work and commitment to create and maintain a group that<br/>\n&gt; worked for us. But it also took an open mind and a willingness to<br/>\n&gt; entirely drop all age and gender expectations.<br/>\n&gt;<br/>\n&gt; Like I said, I had two girls who really wanted that ongoing social<br/>\n&gt; group - it was a really significant part of their lives. The third one<br/>\n&gt; enjoyed it, but didn&#39;t really &quot;need&quot; it as much. So it was worth it to<br/>\n&gt; me to be someone who really nurtured the group.<br/>\n&gt;<br/>\n&gt; -pam<br/>\n&gt;<br/>\n&gt; On Jul 23, 2008, at 7:39 AM, k wrote:<br/>\n&gt;<br/>\n&gt; &gt; Hey. I know the feeling. Local people closeby enough to see about<br/>\n&gt; &gt; once a<br/>\n&gt; &gt; week or thereabouts... that&#39;s hard to come by for a lot of us<br/>\n&gt; &gt; unschoolers.<br/>\n&gt; &gt; We go once in a while if Karl is feeling up to it. Lately he&#39;s been<br/>\n&gt; &gt; opting<br/>\n&gt; &gt; for computer stuff rather than going to a group of people he&#39;s not yet<br/>\n&gt; &gt; familiar with and which doesn&#39;t have many boys in the first place...<br/>\n&gt; &gt; none<br/>\n&gt; &gt; are his age or even close. It&#39;s pretty much girls and a couple of<br/>\n&gt; &gt; rough<br/>\n&gt; &gt; older boys recently out of school were there last time.<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":274933479,"authorName":"lyeping2607","from":"&quot;lyeping2607&quot; &lt;lyeping2607@...&gt;","profile":"lyeping2607","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: feeling unmotivated","postDate":"1216855681","msgId":34762,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc2OGVxMSs3MzZnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTExMi1XNDRFOUE3NDNBMURBMDgwQTBFRjlEMUFEODQwQHBoeC5nYmw+"},"prevInTopic":34761,"nextInTopic":34766,"prevInTime":34761,"nextInTime":34763,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"Hi Kelli, My nearly 8 yrs old son is also on the spectrum- asperger, on the mild side. When we first started homeschooling 18 months ago, we went to every","messageBody":"<div id=\"ygrps-yiv-1707235819\">Hi Kelli,<br/>\n <br/>\nMy nearly 8 yrs old son is also on the spectrum- asperger, on the <br/>\nmild side. When we first started homeschooling 18 months ago, we <br/>\nwent to every activity, every musuem visit, every homeschooling <br/>\nsocial group. Me and son were really enthusiatic about it, until few <br/>\nmonths later, son had enough and started resisting going anywhere. <br/>\nAs for me, I was too worried about slacking, and insist on keeping <br/>\nthe schedule. After a while, it was no longer fun and it became a <br/>\nburden having to convince son to go anywhere, I was still trying to <br/>\ngather enough energy to organise this, and planning that. In truth, <br/>\ni was struggling to come up with new ideas, trying to entice son <br/>\nwith this new place or that new activity. Everything just seems <br/>\nharder when you&#39;re planning something, and the other party is just <br/>\nnot responding!!! I had no choice but to let go because I just burnt <br/>\nout-no more enthusiam left!and I gave in. It was so easy to just <br/>\ngive in and not do anything or any schedule at all. We even stop <br/>\nlooking at the clock!  <br/>\n<br/>\nThen I realised life is so much easier and happier if I just do what <br/>\nI want. Then I realised that my son was just as happy, being left to <br/>\nhis own device. So nowadays, me and son spend most of our days at <br/>\nhome, minding our own business. I do my things like check my emails, <br/>\nread my books/ magazines, cook meals, clean house, on the phone etc <br/>\netc etc. He&#39;s mostly on his computer games, on the net, watching tv, <br/>\nplaying PS2, playing lego/ bionicle/ transformer. Occasionally he <br/>\ndecides he fancy cake, so we&#39;ll bake a cake. Occasionally he decides <br/>\nthat he wants to play with &quot;a&quot; friend, so we&#39;ll phone some friends <br/>\nto arrange for some play dates. Sometimes, i suggest a swim, so <br/>\nwe&#39;ll drive to the nearby community pool. On the rare occasion, we <br/>\nmight go swimming twice a week just because we feel like it, or like <br/>\nlast week, we&#39;ve decided we&#39;re gonna watch Kung Fu Panda on Monday, <br/>\nthen Indiana Jones on Tuesday. We can go on for weeks, not leaving <br/>\nthe house for any meeting or activities or meeting anyone, other <br/>\nthan just our daily walk for fresh air. Currently we have drop out <br/>\nfrom most of our HEing group activities (we used to attend about 2 <br/>\nper week with different groups) to only 2 a month.  <br/>\n<br/>\nI do suggest things to do, but only when I feel like it. So this <br/>\nway, I&#39;ll enjoy doing it, but if son doesn&#39;t want to, that&#39;s fine <br/>\nwith me too. Son do suggest things to do too, like visiting ToyRUss <br/>\nLOL!. We give ourselves the excuse (me to get a new book, son to use <br/>\nthe community computer despite the fact we have 2 laptops and 1 <br/>\ndesktop at home!!) to visit the library everyday, for the library is <br/>\nreally just a few blocks away from our house. Or we&#39;ll walk a little <br/>\nbit further to the supermart and buy ourselves a little treat-ice <br/>\ncream, magazine, a cupcake. But whatever it is, there has to be some <br/>\nincentive to either party. <br/>\n<br/>\nThis week, it&#39;s today Wednesday, and we&#39;ve never ventured out of the <br/>\nhouse since Sunday. This is because son had a friend sleeping over <br/>\nlast weekend, which meant we spend the weekend doing alot <br/>\nof &quot;outdoor&quot; things that we don&#39;t normally do, so we&#39;re kinda re-<br/>\ncuperating. I&#39;ll have to say we stand more chance doing something <br/>\noutdoorsy during the weekend when hubby is around. <br/>\n<br/>\nEven tho me and son is on parellel existance, going about our own <br/>\nactivities, we do constantly connect. I&#39;m connecting by sitting next <br/>\nto him when he plays his playstation or watching tv with me reading <br/>\nmy book. We&#39;re connecting when he shows me what lego set he build. <br/>\nWe&#39;re connecting when I&#39;ve put the Abba on for the 10th time and <br/>\nhe&#39;s telling me he&#39;s sick of listening to it since this morning LOL! <br/>\nSon suggest a different song, so he logs into his list of favourite <br/>\nYouTube movies and plays one of the movie for me to listen to. Lots <br/>\nof connectiion going on, and quite alot of it is not verbal. I paint <br/>\nbut son don&#39;t because he deosn&#39;t like the feels of paint on his <br/>\nfingers, so he&#39;ll give me a nonstop running commentary of why he <br/>\nhates the feel of the paint, so that&#39;s fine with me. But he loves <br/>\nplaydough, so he&#39;ll explain what he likes about playdough. We makes <br/>\nour own playdough quite often. But we both like doing his pc lessons <br/>\ntogether, him typing and me on &quot;calculator standby duty&quot;, just <br/>\nincase we come across a multiplication that he doesn&#39;t know. <br/>\n<br/>\nYou&#39;re saying-do you wait for the enthusiasm to happen naturally? <br/>\nAbsolutely! I&#39;ve learnt that everything will become easier and more <br/>\nenjoyable when everyone is happy doing it.<br/>\n<br/>\nAs for my aspie kid, i find that alot of of his learning is of <br/>\nasyncrony, meaning somethings that he should have been aware of <br/>\nyears ago, is only making sense now, like learning to stand in a <br/>\nqueue, because he nows understand the purpose of it. So it wasn&#39;t <br/>\nfair to push him to do things that he wasn&#39;t ready for. Perhaps it <br/>\nmight be of the same nature for your kid. So, don&#39;t worry about not <br/>\nexposing them to lots of things. You have plenty of time to do it, <br/>\nwhen they TELL you they are ready for it. <br/>\n<br/>\nSo for now, maybe time to conserve your energy and enthusiam for the <br/>\ntime when you need it most- when your children decides they wants <br/>\nmore. So for now, perhaps an opportunity to just be by their side, <br/>\nobserving what might make them tick?  Or indulge yourself, do <br/>\nsomething you like, alongside your children who seems so happy and <br/>\ncontent doing what they are doing.  <br/>\n   <br/>\nHope I&#39;m of help. All the best deschooling/ unschooling.  <br/>\nWith best regards,<br/>\nSharonC.</div>","specialLinks":[]},{"userId":187978159,"authorName":"Natalie","from":"&quot;Natalie&quot; &lt;mothers_dance@...&gt;","profile":"mothers_dance","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: feeling unmotivated","postDate":"1216848739","msgId":34761,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc2ODgxMys2MXVpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTExMi1XMTNDOUJFRkFGQjcyMzEwMTU5MTg0REFEODUwQHBoeC5nYmw+"},"prevInTopic":34754,"nextInTopic":34762,"prevInTime":34760,"nextInTime":34762,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"I am going through the same thing. I come in and out of it. I don t feel motivated to do anything and I would much rather stay home then go anywhere. And","messageBody":"<div id=\"ygrps-yiv-856885342\">I am going through the same thing. I come in and out of it. I don&#39;t <br/>\nfeel motivated to do anything and I would much rather stay home then <br/>\ngo anywhere. And eventhough I am pregnant with my third, I don&#39;t have <br/>\nthe energy, it is too hot outside, going anywhere bymyself with <br/>\nspirited 5 yr old and very strong minded almost 2 yr old and pregnant <br/>\nis very hard for me. I too wait for my partner to do bug outings, and <br/>\nhaving the company feels really good. I have noticed for me that when <br/>\nI am feeling down on myself or lonely I get this way. Right now I am <br/>\nemotional and harmonal it is a little crazy, but it still happened <br/>\neven when I wasn&#39;t pregnant. There aren&#39;t unschoolers that are at <br/>\narms reach and we have lived here for a year and so our, my cirlce is <br/>\nstill being established. It is a slow process. I trust it will all be <br/>\nok. <br/>\nI don&#39;t know if this is making any sense..pregnant brain..lol<br/>\nbut when my energy is heavy everything around me is heavy then I <br/>\nstart to 2nd guess what I am doing from the influences I do have <br/>\naround me. But when I am able to release that energy, it does clear <br/>\nup for me and I am more motivated to do things. I find it easier to <br/>\nrelease when I surrender to the feelings rather then being hard on <br/>\nmyself about it. <br/>\nBe gentle with yourself and find your compassion for yourself as <br/>\nwell. Sounds like a lot has happended this past year and maybe from <br/>\nhaving to do so much of what you didn&#39;t want to do, maybe you are <br/>\nrebelling, and maybe that is just what you need to do. Try to give <br/>\nyourself the permission to be here. Not having support really can <br/>\nunmotivate me as well. But I had reach out, and that is what you are <br/>\ndoing now, reaching out. <br/>\nIf your children are so zoned into what they are doing that sounds <br/>\nawsome to me. And maybe when you paint don&#39;t invite them, just paint <br/>\nfor yourself and see what happens..<br/>\nDo you have close women friends around you..Maybe there are needs <br/>\nthat you have for yourself that aren&#39;t being met as well. I feel like <br/>\nI am a better mother when I am a better woman. That is what works for <br/>\nme. <br/>\nTake care.<br/>\nNatalie<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Kelli Johnston <br/>\n&lt;KelliJohnston@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; Hi, I was wondering if anyone could shed some light on how to get <br/>\n </span></blockquote>motivated to create an exciting educational environment for my kids. <br/>\nThey are pretty young still (5 & 4). We get out to the beach and the <br/>\npark a couple times a week but other than that we stay home most of <br/>\nthe day. Our weekends are pretty packed so once the week rolls <br/>\naround, I feel pretty tired and unmotivated! I know that the kids are <br/>\nlearning a lot doing what they are doing (mostly imaginary play, <br/>\ndrawing/painting, playing in the yard, watching tv, and using the <br/>\ncomputer) but I feel like I should be exposing them more to stuff <br/>\noutside of the house (museums, parks, hikes, etc) or having more <br/>\nmaterials around the house that could spark interest. I keep thinking <br/>\nthat today is the day that I will motivate or even trying to schedule <br/>\nmyself but I find myself rebelling against myself, lol. Anyone have <br/>\nany suggestions? Should I just let it be and de-school for a while <br/>\n(my 5 year old was on a curriculum last year which was stressful for <br/>\nall of us) or push myself until it feels more natural? I am not <br/>\ntalking about forcing anything on them...just offering more options <br/>\nthan what is immediately in front of them that they are aware of.Kelli<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  EMAILING FOR THE GREATER GOODJoin me<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Developing an unschooling group - was Re: feeling unmotivated","postDate":"1216831564","msgId":34753,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQzNEZEM0YzLTIwRTEtNERDNS05Q0RFLTM0RkJBRTEyQUYyNEBtYWMuY29tPg==","inReplyToHeader":"PDNhOTNmZmYxMDgwNzIzMDczOXYzMzM0ZjYzYms3YTY2YzE1MTQ3NWEwODljQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PEJBWTExMi1XMjQxNDI4MDAxQzhEN0Y1MDgxQzk4QUFEODUwQHBoeC5nYmw+IDxnNjc4ZWYrcDdrb0BlR3JvdXBzLmNvbT4gPDNhOTNmZmYxMDgwNzIzMDcxM2oxZWRlMGU3YnhhYTBhZjNkN2YyMzMwYzU0QG1haWwuZ21haWwuY29tPiA8QkFZMTEyLVczNDM4MDNCNUQ5NzE0MkNDOUY5NzkxQUQ4NDBAcGh4LmdibD4gPDNhOTNmZmYxMDgwNzIzMDczOXYzMzM0ZjYzYms3YTY2YzE1MTQ3NWEwODljQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":34752,"nextInTopic":34754,"prevInTime":34752,"nextInTime":34754,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"I just wanted to mention that it is a challenge to develop and maintain an unschooling group. It takes some level of commitment. I did it - because it was","messageBody":"<div id=\"ygrps-yiv-238791757\">I just wanted to mention that it is a challenge to develop and  <br/>\nmaintain an unschooling group. It takes some level of commitment. I  <br/>\ndid it - because it was important to two of my three kids who really  <br/>\ncraved an active social life. It meant that we went to the park EVERY  <br/>\nweek - we didn&#39;t decide not to go one day because we all felt like  <br/>\ndoing something else, we scheduled around those park days because we  <br/>\nrecognized that our regular attendance was sort of the glue that held  <br/>\nthe group together.<br/>\n<br/>\nWhen people knew, for sure, we&#39;d be there, they&#39;d get in the habit of  <br/>\ncoming, most of the time, too. So there was usually a group - and, in  <br/>\nparticular, the kids my kids especially liked to play with would come  <br/>\nmore often since they knew mine would for sure be there.<br/>\n<br/>\nBut what I saw over the years was that a family would come once or  <br/>\ntwice, the kids wouldn&#39;t click right away and they wouldn&#39;t come back.  <br/>\nIt often happened that the kid they might have really clicked with  <br/>\nwasn&#39;t there that day so they never got a chance to meet. Or they&#39;d  <br/>\nnotice there weren&#39;t other kids of their child&#39;s gender and age, and  <br/>\nthey&#39;d be disappointed and not come back. Sometimes they&#39;d come  <br/>\nsporadically - but there would be weeks in between those times. The  <br/>\nkids would never really connect with the other kids and they&#39;d stop  <br/>\ncoming, eventually.<br/>\n<br/>\nWhen people kept on coming, the kids eventually would become part of  <br/>\nthe ongoing games that were played every week and over time they&#39;d  <br/>\nclick more and more and maybe make some special friends. It is always  <br/>\na little hard to &quot;break into&quot; a group that has been meeting together  <br/>\nfor a long time. If someone would just come back every week, for  <br/>\nseveral weeks in a row, they&#39;d usually find they felt a lot more  <br/>\ncomfortable.<br/>\n<br/>\nSome people would come and make some specific efforts to connect. One  <br/>\ngirl wasn&#39;t finding it easy to make friends and she started bringing  <br/>\ndifferent stuff to the park that would be interesting to other kids -  <br/>\nI mean, she actually brought her pet rat, for example, and her little  <br/>\nkittens. Those were enough to attract other kids to her and to give  <br/>\nthem something to talk about together and that broke the ice. These  <br/>\ndays, years later, she&#39;s got a nice group of teenage unschoolers to  <br/>\nsocialize with - and it developed out of those park days.<br/>\n<br/>\nMy youngest daughter has a great group of unschoolers to hang out with  <br/>\n- these are friends she originally made through our unschoolers park  <br/>\nday, too. They are almost all older boys - she&#39;s 17, they are boys  <br/>\nfrom 15 to 23 years old. They play D&D and board games and do martial  <br/>\narts, go to movies, go to the beach, and other stuff. She&#39;s very very  <br/>\nhappy with her social life.<br/>\n<br/>\nIt really took work and commitment to create and maintain a group that  <br/>\nworked for us. But it also took an open mind and a willingness to  <br/>\nentirely drop all age and gender expectations.<br/>\n<br/>\nLike I said, I had two girls who really wanted that ongoing social  <br/>\ngroup - it was a really significant part of their lives. The third one  <br/>\nenjoyed it, but didn&#39;t really &quot;need&quot; it as much. So it was worth it to  <br/>\nme to be someone who really nurtured the group.<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jul 23, 2008, at 7:39 AM, k wrote:<br/>\n<br/>\n&gt; Hey.  I know the feeling.  Local people closeby enough to see about  <br/>\n&gt; once a<br/>\n&gt; week or thereabouts... that&#39;s hard to come by for a lot of us  <br/>\n&gt; unschoolers.<br/>\n&gt; We go once in a while if Karl is feeling up to it.  Lately he&#39;s been  <br/>\n&gt; opting<br/>\n&gt; for computer stuff rather than going to a group of people he&#39;s not yet<br/>\n&gt; familiar with and which doesn&#39;t have many boys in the first place...  <br/>\n&gt; none<br/>\n&gt; are his age or even close.  It&#39;s pretty much girls and a couple of  <br/>\n&gt; rough<br/>\n&gt; older boys recently out of school were there last time. </span></blockquote></div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: feeling unmotivated","postDate":"1216830224","msgId":34752,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZDQUY0Q0FDLTA2NUEtNDhFRC05QjZGLTdCRUIxODMzMTU1RkBtYWMuY29tPg==","inReplyToHeader":"PEJBWTExMi1XNDRFOUE3NDNBMURBMDgwQTBFRjlEMUFEODQwQHBoeC5nYmw+","referencesHeader":"PEJBWTExMi1XMjQxNDI4MDAxQzhEN0Y1MDgxQzk4QUFEODUwQHBoeC5nYmw+IDxnNjc4ZWYrcDdrb0BlR3JvdXBzLmNvbT4gPEJBWTExMi1XNDRFOUE3NDNBMURBMDgwQTBFRjlEMUFEODQwQHBoeC5nYmw+"},"prevInTopic":34751,"nextInTopic":34753,"prevInTime":34751,"nextInTime":34753,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"... Oh Kelli. My heart just goes out to you. I can tell from reading your posts that you want so much to be a great mom to them and you re kind of anxious","messageBody":"<div id=\"ygrps-yiv-1357720562\">On Jul 23, 2008, at 7:18 AM, Kelli Johnston wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There is a part of me that is really burnt out. I feel happy in my  <br/>\n&gt; heart to be letting go of these therapies but also very scared that  <br/>\n&gt; I am doing the &quot;wrong&quot; thing since it has been engraved into my  <br/>\n&gt; brain that it is &quot;what he needs&quot; as a child on the spectrum. He is  <br/>\n&gt; doing so so well in my eyes and<br/>\n&gt; was re-evaluated recently and they said he mostly like didn&#39;t have  <br/>\n&gt; autism but some form of aspergers (probably mild). I am just ready  <br/>\n&gt; to accept him for who he is and sick of &quot;targeting&quot; behavior like he  <br/>\n&gt; is a trained seal. Though a lot of this has probably strained our  <br/>\n&gt; relationship and I just want to find a way to feel comfortable in  <br/>\n&gt; all of this.Kelli<br/>\n<br/>\n </span></blockquote>Oh Kelli. My heart just goes out to you. I can tell from reading your  <br/>\nposts that you want so much to be a great mom to them and you&#39;re kind  <br/>\nof anxious about being that.<br/>\n<br/>\nNOTHING is more important than your relationship, everything else  <br/>\nbuilds on that, so I really want to applaud your decision to focus on  <br/>\ndeveloping a deeper connection - that&#39;s really important.<br/>\n<br/>\nTargeting &quot;behavior&quot; - I&#39;m guessing he&#39;s been subject to lots of  <br/>\nbehavior modification techniques. It&#39;ll be hard for you to stop  <br/>\nthinking that way, but very very worth it. &quot;Training&quot; children, as if  <br/>\nthey are pets, is not conducive to establishing strong and healthy  <br/>\nrelationships between adults and children.<br/>\n<br/>\nOn the other hand, if the kids are happily playing together, that&#39;s  <br/>\nnot the time to interfere in order to push your own agenda. Instead,  <br/>\nfind ways to make the times you DO spend together really super filled  <br/>\nwith joy.<br/>\n<br/>\nYou said you talk during meals - so maybe you can find some ways to  <br/>\nmake meal times really a high point of the day.  I get the feeling  <br/>\nyou&#39;re just really not that much fun to be around - otherwise they&#39;d  <br/>\nwant to be involved with you more. It might be a little contrived, for  <br/>\na while, but I&#39;m thinking you could get a book of jokes and, at each  <br/>\nmeal, you could tell jokes from the book. Get a book that has jokes  <br/>\nthat are age appropriate - there are zillions of joke books out there.<br/>\n<br/>\nMaybe you could rent some really great videos that you and the kids  <br/>\nwould enjoy together - that joint experience is good for bonding.<br/>\n<br/>\nAlso, do they like to play little kid board games? You could get  <br/>\nCandyLand and Chutes and Ladders - really inexpensive games. Just  <br/>\ninvite them to come play with you.<br/>\n<br/>\nWe used to have pattern blocks that sat out on the coffee table - my  <br/>\nhusband and I would play with them and the kids would sometimes join  <br/>\nin and all of a sudden, there we&#39;d be, having a really sweet parent- <br/>\nchild experience.<br/>\n<br/>\nSometimes you need to set the stage - sometimes you need props. But,  <br/>\nremember to start where you are right now - build on what IS working  <br/>\nwell and slowly let more things develop naturally.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":274176358,"authorName":"One of the Wechts","from":"&quot;One of the Wechts&quot; &lt;erw@...&gt;","profile":"usoah1841","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] Re: feeling unmotivated","postDate":"1216825335","msgId":34751,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYmUwMWM4ZWNkNSQxYzAyOTZhMCQ2YTAxYThjMEBNVVNJQ1JPT00+","referencesHeader":"PEJBWTExMi1XMjQxNDI4MDAxQzhEN0Y1MDgxQzk4QUFEODUwQHBoeC5nYmw+IDxnNjc4ZWYrcDdrb0BlR3JvdXBzLmNvbT4gIDwzYTkzZmZmMTA4MDcyMzA3MTNqMWVkZTBlN2J4YWEwYWYzZDdmMjMzMGM1NEBtYWlsLmdtYWlsLmNvbT4gPEJBWTExMi1XMzQzODAzQjVEOTcxNDJDQzlGOTc5MUFEODQwQHBoeC5nYmw+"},"prevInTopic":34750,"nextInTopic":34752,"prevInTime":34750,"nextInTime":34752,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1247990872\">&lt; I just feel like since we are &quot;homeschooling&quot; we should be doing something <br/>\nmore substantial but maybe that is more of me having to let go a bit of what <br/>\nI think school should be. I don&#39;t know anyone locally that is an <br/>\nunschooler...in fact there are very few secular homeschoolers at all. I <br/>\ndon&#39;t really have a support system so I feel like I am taking a jump of a <br/>\ncliff here. &gt;  Kelli<br/>\n**************************************************************************************<br/>\n<br/>\nRegarding that schooly self at work...<br/>\n<br/>\nOne thing that helped me with the transition was to first consider what the <br/>\nkids would be doing in a traditional school setting.<br/>\nIn preschool/K, it would be colors and clay and &quot;stations&quot; and the field <br/>\ntrip to the fire station and the letter of the day and naps...<br/>\n<br/>\nAny home setting could match this level of &quot;education&quot; without much effort.<br/>\nAnything you do above and beyond is a bonus.<br/>\n<br/>\nNow I admit that this is not a high standard to shoot for : )  and that is <br/>\nNOT my point,<br/>\nbut maybe it will put it back into perspective a little.<br/>\n<br/>\nThink of all the fun things that you all do, even on the weekends.<br/>\nMaybe make a list. I bet it will impress you!<br/>\nNow think of the decreased stress to their<br/>\nlittle bodies and souls as they go about their day learning in freedom and <br/>\nlove.<br/>\nHow cool is that!<br/>\n<br/>\nI didn&#39;t bring my kids out of school until my youngest was 5.<br/>\nNow, 7+ years later, my kids are doing great!<br/>\nYou are way ahead of the game!<br/>\n<br/>\nIf you have not read John Holt and Frank Smith please do!<br/>\n<br/>\nBeth in MD<br/>\nMom to 19yos, 16yos, 12yod</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: feeling unmotivated","postDate":"1216823971","msgId":34750,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgwNzIzMDczOXYzMzM0ZjYzYms3YTY2YzE1MTQ3NWEwODljQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEJBWTExMi1XMzQzODAzQjVEOTcxNDJDQzlGOTc5MUFEODQwQHBoeC5nYmw+","referencesHeader":"PEJBWTExMi1XMjQxNDI4MDAxQzhEN0Y1MDgxQzk4QUFEODUwQHBoeC5nYmw+CSA8ZzY3OGVmK3A3a29AZUdyb3Vwcy5jb20+CSA8M2E5M2ZmZjEwODA3MjMwNzEzajFlZGUwZTdieGFhMGFmM2Q3ZjIzMzBjNTRAbWFpbC5nbWFpbC5jb20+CSA8QkFZMTEyLVczNDM4MDNCNUQ5NzE0MkNDOUY5NzkxQUQ4NDBAcGh4LmdibD4="},"prevInTopic":34749,"nextInTopic":34751,"prevInTime":34749,"nextInTime":34751,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"Hey.  I know the feeling.  Local people closeby enough to see about once a week or thereabouts... that s hard to come by for a lot of us unschoolers. We go","messageBody":"<div id=\"ygrps-yiv-1163785859\">Hey.  I know the feeling.  Local people closeby enough to see about once a<br/>\nweek or thereabouts... that&#39;s hard to come by for a lot of us unschoolers.<br/>\nWe go once in a while if Karl is feeling up to it.  Lately he&#39;s been opting<br/>\nfor computer stuff rather than going to a group of people he&#39;s not yet<br/>\nfamiliar with and which doesn&#39;t have many boys in the first place... none<br/>\nare his age or even close.  It&#39;s pretty much girls and a couple of rough<br/>\nolder boys recently out of school were there last time.<br/>\n<br/>\nHere&#39;s something I thought was very encouraging.... I like these emails I<br/>\nget for the Daily Groove (Scott Noelle writes them).  I thought this one was<br/>\napt for our discussion here about connecting more closely with our<br/>\nchildren.  Here he has reframed a typically negative idea into a very<br/>\ndifferent and positive context:<br/>\n<br/>\n<br/>\n:: The Joy of Manipulation ::<br/>\n<br/>\nThe word *manipulate* means &quot;to handle skillfully.&quot;<br/>\nSince the main function of childhood is learning how<br/>\nto handle life skillfully, a &quot;manipulative&quot; child is<br/>\nonly doing what comes naturally.<br/>\n<br/>\nA good relationship is one in which both parties can<br/>\nmanipulate each other in ways they both enjoy. They<br/>\ndance with one mind, like Fred Astaire and Ginger<br/>\nRogers. It&#39;s called *attunement*.<br/>\n<br/>\nWhen you and your child are well-attuned, the<br/>\nmanipulation can be so subtle that all you notice is<br/>\nthe pleasure of your connection. But when you&#39;re<br/>\ndistracted or stressed, your child will escalate to<br/>\nunsubtle, unpleasant cues like crying or whining --<br/>\nwhatever it takes to get your attention.<br/>\n<br/>\nConventional (adversarial) parenting advice says you<br/>\nmustn&#39;t &quot;give in&quot; to such manipulation. The parent<br/>\n&quot;wins&quot; when the child gives up hope.<br/>\n<br/>\nWhen you understand that unpleasant manipulation is a<br/>\nsymptom of failed attunement, the path becomes clear:<br/>\n<br/>\n   * Align with your Self.<br/>\n   * Attune with your child.<br/>\n   * Focus on the pleasure of connecting.<br/>\n   * Everyone wins.<br/>\n<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 7/23/08, Kelli Johnston &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:KelliJohnston@...\">KelliJohnston@...</a>&gt; wrote:<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; Katherine, that is an interesting point. This has given me a lot to think<br/>\n&gt;&gt; about. I don&#39;t necessarily want to pretend I am someone I am not but at the<br/>\n&gt;&gt; same time don&#39;t want things to not happen just because the assumption is<br/>\n&gt;&gt; that I wouldn&#39;t be up for it. I guess there should be some middle ground? I<br/>\n&gt;&gt; don&#39;t really feel like I am saying &quot;no&quot; but because of our history in a way,<br/>\n&gt;&gt; my son&#39;s whole life was one big NO by avoidance or having to do other<br/>\n&gt;&gt; mandatory things. We have been doing a lot with them on the weekends because<br/>\n&gt;&gt; my husband is around and I feel like I have more help. I mean maybe that is<br/>\n&gt;&gt; enough in some ways. I just feel like since we are &quot;homeschooling&quot; we should<br/>\n&gt;&gt; be doing something more substantial but maybe that is more of me having to<br/>\n&gt;&gt; let go a bit of what I think school should be. I don&#39;t know anyone locally<br/>\n&gt;&gt; that is an unschooler...in fact there are very few secular homeschoolers at<br/>\n&gt;&gt; all. I don&#39;t really have a support system so I feel like I am taking a jump<br/>\n&gt;&gt; of a cliff here. Kelli<br/>\n&gt;&gt;<br/>\n&gt;&gt; EMAILING FOR THE GREATER GOOD Join me<br/>\n&gt;&gt;<br/>\n&gt;&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.comFrom\">unschoolingbasics@yahoogroups.comFrom</a>&lt;unschoolingbasics%40yahoogroups.comFrom&gt;:<br/>\n&gt;&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:katherand@...\">katherand@...</a> &lt;katherand%40gmail.comDate&gt;: Wed, 23 Jul 2008<br/>\n&gt;&gt; 10:13:37 -0400Subject: Re: [unschoolingbasics] Re: feeling unmotivated<br/>\n&gt;&gt;<br/>\n&gt;&gt; We just had a thread in one of the unschooling groups, not this one I<br/>\n&gt;&gt; don&#39;t think. About this very thing.In the past, I&#39;ve not needed to spend as<br/>\n&gt;&gt; much time with Karl because he found plenty to do and did a lot of playing<br/>\n&gt;&gt; all day. But things are changing these days. He has begun to ask for more<br/>\n&gt;&gt; interaction. Not so much with other kids but with *me*. This is not what he<br/>\n&gt;&gt; used to do, so I&#39;m glad for the change.A little background: I grew up very<br/>\n&gt;&gt; isolated with not much to do beyond reading and I&#39;m used to spending a lot<br/>\n&gt;&gt; of time alone because it was reinforced so much of my own childhood. If I<br/>\n&gt;&gt; wanted to go somewhere I knew the answer was always great reluctance<br/>\n&gt;&gt; followed by -no- the standby. I quit asking after a point.Fast forward to<br/>\n&gt;&gt; today. I&#39;m working on changing the habits I formed in childhood. I&#39;m very<br/>\n&gt;&gt; accustomed and even jealous of my time and attention.So with that in mind,<br/>\n&gt;&gt; I&#39;ve begun initiating more enthusiastically to do more stuff that I think<br/>\n&gt;&gt; Karl would be interested in. After a couple of weeks,he&#39;s started saying<br/>\n&gt;&gt; &quot;come on&quot; and lead me off onto one of his imaginary play trips.I think it&#39;s<br/>\n&gt;&gt; possible to dampen a child. For a person with firm habits of introversion or<br/>\n&gt;&gt; that&#39;s just who a person is, concerted determination over about a month can<br/>\n&gt;&gt; form different habits. At least when it comes to our children, try becoming<br/>\n&gt;&gt; an extrovert or just being a little more extroverted.Extroverts might have<br/>\n&gt;&gt; different changes to make. Karl&#39;s dad tends to do for and suggest too much<br/>\n&gt;&gt; for Karl to do, and to be more insistent and take more charge than I ever<br/>\n&gt;&gt; would. So while I don&#39;t have those problems to overcome,I do have something<br/>\n&gt;&gt; I want to change about my relationship with my child.~Katherine<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":238615405,"authorName":"Kelli Johnston","from":"Kelli Johnston &lt;KelliJohnston@...&gt;","profile":"kaipelesmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: feeling unmotivated","postDate":"1216823137","msgId":34749,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExMi1XMzQzODAzQjVEOTcxNDJDQzlGOTc5MUFEODQwQHBoeC5nYmw+","inReplyToHeader":"PDNhOTNmZmYxMDgwNzIzMDcxM2oxZWRlMGU3YnhhYTBhZjNkN2YyMzMwYzU0QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PEJBWTExMi1XMjQxNDI4MDAxQzhEN0Y1MDgxQzk4QUFEODUwQHBoeC5nYmw+CSA8ZzY3OGVmK3A3a29AZUdyb3Vwcy5jb20+ICA8M2E5M2ZmZjEwODA3MjMwNzEzajFlZGUwZTdieGFhMGFmM2Q3ZjIzMzBjNTRAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":34748,"nextInTopic":34750,"prevInTime":34748,"nextInTime":34750,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"Katherine, that is an interesting point. This has given me a lot to think about. I don t necessarily want to pretend I am someone I am not but at the same time","messageBody":"<div id=\"ygrps-yiv-1911973527\">Katherine, that is an interesting point. This has given me a lot to think about. I don&#39;t necessarily want to pretend I am someone I am not but at the same time don&#39;t want things to not happen just because the assumption is that I wouldn&#39;t be up for it. I guess there should be some middle ground? I don&#39;t really feel like I am saying &quot;no&quot; but because of our history in a way, my son&#39;s whole life was one big NO by avoidance or having to do other mandatory things. We have been doing a lot with them on the weekends because my husband is around and I feel like I have more help. I mean maybe that is enough in some ways. I just feel like since we are &quot;homeschooling&quot; we should be doing something more substantial but maybe that is more of me having to let go a bit of what I think school should be. I don&#39;t know anyone locally that is an unschooler...in fact there are very few secular homeschoolers at all. I don&#39;t really have a support system so I feel like I am taking a jump of a cliff here. Kelli<br/>\n<br/>\n<br/>\n<br/>\n EMAILING FOR THE GREATER GOODJoin me<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.comFrom\">unschoolingbasics@yahoogroups.comFrom</a>: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:katherand@...\">katherand@...</a>: Wed, 23 Jul 2008 10:13:37 -0400Subject: Re: [unschoolingbasics] Re: feeling unmotivated<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nWe just had a thread in one of the unschooling groups, not this one I don&#39;tthink. About this very thing.In the past, I&#39;ve not needed to spend as much time with Karl because hefound plenty to do and did a lot of playing all day. But things arechanging these days. He has begun to ask for more interaction. Not so muchwith other kids but with *me*. This is not what he used to do, so I&#39;m gladfor the change.A little background: I grew up very isolated with not much to do beyondreading and I&#39;m used to spending a lot of time alone because it wasreinforced so much of my own childhood. If I wanted to go somewhere I knewthe answer was always great reluctance followed by -no- the standby. I quitasking after a point.Fast forward to today. I&#39;m working on changing the habits I formed inchildhood. I&#39;m very accustomed and even jealous of my time and attention.So with that in mind, I&#39;ve begun initiating more enthusiastically to do morestuff that I think Karl would be interested in. After a couple of weeks,he&#39;s started saying &quot;come on&quot; and lead me off onto one of his imaginary playtrips.I think it&#39;s possible to dampen a child. For a person with firm habits ofintroversion or that&#39;s just who a person is, concerted determination overabout a month can form different habits. At least when it comes to ourchildren, try becoming an extrovert or just being a little more extroverted.Extroverts might have different changes to make. Karl&#39;s dad tends to do forand suggest too much for Karl to do, and to be more insistent and take morecharge than I ever would. So while I don&#39;t have those problems to overcome,I do have something I want to change about my relationship with my child.~KatherineOn 7/23/08, carenkh &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:carenkh@...\">carenkh@...</a>&gt; wrote:&gt;&gt; &quot;My kids rarely ask me to do anything with them so we are doing our&gt; own thing most of the time.&quot;&gt;&gt; &quot;well I am doing a bunch of things for me but I feel like I spend more&gt; times on those things than I do thinking about ways to enlighten my&gt; children.&quot;&gt;&gt; These two things, seen together, raised a little red flag for me. It&#39;s&gt; hard for me to imagine 5 and 4 years olds rarely asking a parent to&gt; join them. I know every child is different, with different needs - but&gt; I&#39;m wondering if you&#39;ve always been available when they&#39;ve asked? Or&gt; have they just stopped asking, because they know you&#39;ll say no? My two&gt; boys are vastly different in terms of their need for interaction, but&gt; at that age, they both wanted me nearby, with my full presence. (not&gt; on the phone, etc.)&gt;&gt; It may be completely innocuous, but just seemed a little odd. It feels&gt; disconnected to me.&gt;&gt; Caren&gt;&gt; &gt;[Non-text portions of this message have been removed] <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":238615405,"authorName":"Kelli Johnston","from":"Kelli Johnston &lt;KelliJohnston@...&gt;","profile":"kaipelesmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: feeling unmotivated","postDate":"1216822692","msgId":34748,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExMi1XNDRFOUE3NDNBMURBMDgwQTBFRjlEMUFEODQwQHBoeC5nYmw+","inReplyToHeader":"PGc2NzhlZitwN2tvQGVHcm91cHMuY29tPg==","referencesHeader":"PEJBWTExMi1XMjQxNDI4MDAxQzhEN0Y1MDgxQzk4QUFEODUwQHBoeC5nYmw+IDxnNjc4ZWYrcDdrb0BlR3JvdXBzLmNvbT4="},"prevInTopic":34746,"nextInTopic":34749,"prevInTime":34747,"nextInTime":34749,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"Thanks for all the help! As for the below...I am not sure? I mean I think that in the past it was different. My son was diagnosed with autism and we went the","messageBody":"<div id=\"ygrps-yiv-551135210\">Thanks for all the help!<br/>\n <br/>\nAs for the below...I am not sure? I mean I think that in the past it was different. My son was diagnosed with autism and we went the early intervention route so honestly we were very disconnected not only because of the autism but because of the many hours that he was in &quot;school&quot; since he was two. This past year we have connected more but he still does a lot of playing on his own and recently he and his sister play for hours by themselves. They ask me for help with things and we have discussions while eating. I mean I am there physically around them but they just don&#39;t involve me in their play or activity much. I would say that i am working on having a better connection with them for sure but most of the time they just get annoyed when I involve myself. For instance, I am a painter so I always ask them if they want to hang out with me while I paint or paint with me (I give them their own canvas) but they aren&#39;t always interested.....I sit down with them and watch their movies or watch them on the computer. I guess I could just actively get more passively involved and see where that goes? <br/>\n <br/>\nI do enjoy how independant they are as I am the type of person that loves when people are around but can feel deflated having a lot of interaction (guess I am an introvert). But I do want to make sure that they are growing up with a healthy exposure to life and learning. We are definitely going through some transitions. My son is slowly moving out of special ed. We have been having many therapists here throughout the week and a home &quot;school year&quot; full of mandatory worksheets and speech in the classroom. The times that we were free and not doing the above was the most relaxed and happiest times of last year. I have decided recently to take a break from all the therapists and just focus on us. There is a part of me that is really burnt out. I feel happy in my heart to be letting go of these therapies but also very scared that I am doing the &quot;wrong&quot; thing since it has been engraved into my brain that it is &quot;what he needs&quot; as a child on the spectrum. He is doing so so well in my eyes and was re-evaluated recently and they said he mostly like didn&#39;t have autism but some form of aspergers (probably mild). I am just ready to accept him for who he is and sick of &quot;targeting&quot; behavior like he is a trained seal. Though a lot of this has probably strained our relationship and I just want to find a way to feel comfortable in all of this.Kelli<br/>\n<br/>\n<br/>\n<br/>\n EMAILING FOR THE GREATER GOODJoin me<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.comFrom\">unschoolingbasics@yahoogroups.comFrom</a>: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:carenkh@...\">carenkh@...</a>: Wed, 23 Jul 2008 12:33:19 +0000Subject: [unschoolingbasics] Re: feeling unmotivated<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&quot;My kids rarely ask me to do anything with them so we are doing ourown thing most of the time.&quot;&quot;well I am doing a bunch of things for me but I feel like I spend moretimes on those things than I do thinking about ways to enlighten mychildren.&quot;These two things, seen together, raised a little red flag for me. It&#39;shard for me to imagine 5 and 4 years olds rarely asking a parent tojoin them. I know every child is different, with different needs - butI&#39;m wondering if you&#39;ve always been available when they&#39;ve asked? Orhave they just stopped asking, because they know you&#39;ll say no? My twoboys are vastly different in terms of their need for interaction, butat that age, they both wanted me nearby, with my full presence. (noton the phone, etc.)It may be completely innocuous, but just seemed a little odd. It feelsdisconnected to me.Caren <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: feeling unmotivated","postDate":"1216822417","msgId":34746,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgwNzIzMDcxM2oxZWRlMGU3YnhhYTBhZjNkN2YyMzMwYzU0QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGc2NzhlZitwN2tvQGVHcm91cHMuY29tPg==","referencesHeader":"PEJBWTExMi1XMjQxNDI4MDAxQzhEN0Y1MDgxQzk4QUFEODUwQHBoeC5nYmw+CSA8ZzY3OGVmK3A3a29AZUdyb3Vwcy5jb20+"},"prevInTopic":34742,"nextInTopic":34748,"prevInTime":34745,"nextInTime":34747,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"We just had a thread in one of the unschooling groups, not this one I don t think.  About this very thing. In the past, I ve not needed to spend as much time","messageBody":"<div id=\"ygrps-yiv-492629094\">We just had a thread in one of the unschooling groups, not this one I don&#39;t<br/>\nthink.  About this very thing.<br/>\n<br/>\nIn the past, I&#39;ve not needed to spend as much time with Karl because he<br/>\nfound plenty to do and did a lot of playing all day.  But things are<br/>\nchanging these days.  He has begun to ask for more interaction.  Not so much<br/>\nwith other kids but with *me*.  This is not what he used to do, so I&#39;m glad<br/>\nfor the change.<br/>\n<br/>\nA little background: I grew up very isolated with not much to do beyond<br/>\nreading and I&#39;m used to spending a lot of time alone because it was<br/>\nreinforced so much of my own childhood.  If I wanted to go somewhere I knew<br/>\nthe answer was always great reluctance followed by -no- the standby.  I quit<br/>\nasking after a point.<br/>\n<br/>\nFast forward to today.  I&#39;m working on changing the habits I formed in<br/>\nchildhood.  I&#39;m very accustomed and even jealous of my time and attention.<br/>\nSo with that in mind, I&#39;ve begun initiating more enthusiastically to do more<br/>\nstuff that I think Karl would be interested in.  After a couple of weeks,<br/>\nhe&#39;s started saying &quot;come on&quot; and lead me off onto one of his imaginary play<br/>\ntrips.<br/>\n<br/>\nI think it&#39;s possible to dampen a child.  For a person with firm habits of<br/>\nintroversion or that&#39;s just who a person is, concerted determination over<br/>\nabout a month can form different habits.  At least when it comes to our<br/>\nchildren, try becoming an extrovert or just being a little more extroverted.<br/>\n<br/>\nExtroverts might have different changes to make.  Karl&#39;s dad tends to do for<br/>\nand suggest too much for Karl to do, and to be more insistent and take more<br/>\ncharge than I ever would.  So while I don&#39;t have those problems to overcome,<br/>\nI do have something I want to change about my relationship with my child.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 7/23/08, carenkh &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:carenkh@...\">carenkh@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   &quot;My kids rarely ask me to do anything with them so we are doing our<br/>\n&gt; own thing most of the time.&quot;<br/>\n&gt;<br/>\n&gt; &quot;well I am doing a bunch of things for me but I feel like I spend more<br/>\n&gt; times on those things than I do thinking about ways to enlighten my<br/>\n&gt; children.&quot;<br/>\n&gt;<br/>\n&gt; These two things, seen together, raised a little red flag for me. It&#39;s<br/>\n&gt; hard for me to imagine 5 and 4 years olds rarely asking a parent to<br/>\n&gt; join them. I know every child is different, with different needs - but<br/>\n&gt; I&#39;m wondering if you&#39;ve always been available when they&#39;ve asked? Or<br/>\n&gt; have they just stopped asking, because they know you&#39;ll say no? My two<br/>\n&gt; boys are vastly different in terms of their need for interaction, but<br/>\n&gt; at that age, they both wanted me nearby, with my full presence. (not<br/>\n&gt; on the phone, etc.)<br/>\n&gt;<br/>\n&gt; It may be completely innocuous, but just seemed a little odd. It feels<br/>\n&gt; disconnected to me.<br/>\n&gt;<br/>\n&gt; Caren<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":151505017,"authorName":"carenkh","from":"&quot;carenkh&quot; &lt;carenkh@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: feeling unmotivated","postDate":"1216816399","msgId":34742,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc2NzhlZitwN2tvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTExMi1XMjQxNDI4MDAxQzhEN0Y1MDgxQzk4QUFEODUwQHBoeC5nYmw+"},"prevInTopic":34736,"nextInTopic":34746,"prevInTime":34741,"nextInTime":34743,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"My kids rarely ask me to do anything with them so we are doing our own thing most of the time. well I am doing a bunch of things for me but I feel like I","messageBody":"<div id=\"ygrps-yiv-2107261011\">&quot;My kids rarely ask me to do anything with them so we are doing our<br/>\nown thing most of the time.&quot;<br/>\n<br/>\n&quot;well I am doing a bunch of things for me but I feel like I spend more<br/>\ntimes on those things than I do thinking about ways to enlighten my<br/>\nchildren.&quot;<br/>\n<br/>\n<br/>\n<br/>\nThese two things, seen together, raised a little red flag for me. It&#39;s<br/>\nhard for me to imagine 5 and 4 years olds rarely asking a parent to<br/>\njoin them. I know every child is different, with different needs - but<br/>\nI&#39;m wondering if you&#39;ve always been available when they&#39;ve asked? Or<br/>\nhave they just stopped asking, because they know you&#39;ll say no? My two<br/>\nboys are vastly different in terms of their need for interaction, but<br/>\nat that age, they both wanted me nearby, with my full presence. (not<br/>\non the phone, etc.)<br/>\n<br/>\nIt may be completely innocuous, but just seemed a little odd. It feels<br/>\ndisconnected to me.<br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":238615405,"authorName":"Kelli Johnston","from":"Kelli Johnston &lt;KelliJohnston@...&gt;","profile":"kaipelesmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: feeling unmotivated","postDate":"1216766093","msgId":34731,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExMi1XMjQxNDI4MDAxQzhEN0Y1MDgxQzk4QUFEODUwQHBoeC5nYmw+","inReplyToHeader":"PGc2NTdhbCtqZ2MxQGVHcm91cHMuY29tPg==","referencesHeader":"PEJBWTExMi1XNTBGMEIyNUI0RTlGM0M1MDJBNzU2QUFEODUwQHBoeC5nYmw+IDxnNjU3YWwramdjMUBlR3JvdXBzLmNvbT4="},"prevInTopic":34730,"nextInTopic":34734,"prevInTime":34730,"nextInTime":34732,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"lol, well I am doing a bunch of things for me but I feel like I spend more times on those things than I do thinking about ways to enlighten my children.Kelli ","messageBody":"<div id=\"ygrps-yiv-2066932048\">lol, well I am doing a bunch of things for me but I feel like I spend more times on those things than I do thinking about ways to enlighten my children.Kelli<br/>\n<br/>\n<br/>\n<br/>\n EMAILING FOR THE GREATER GOODJoin me<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.comFrom\">unschoolingbasics@yahoogroups.comFrom</a>: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:carenkh@...\">carenkh@...</a>: Tue, 22 Jul 2008 18:01:57 +0000Subject: [unschoolingbasics] Re: feeling unmotivated<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nWhat are YOU passionate about? What are YOU interested in? What getsyou out of bed in the morning? Are you happy to be alive? Are you alive?Caren <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: feeling unmotivated","postDate":"1216759793","msgId":34730,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJGNzhGRERGLTVDRkYtNDU5Mi05Q0RELTc0MzZBREY0ODkwM0BtYWMuY29tPg==","inReplyToHeader":"PEJBWTExMi1XNTBGMEIyNUI0RTlGM0M1MDJBNzU2QUFEODUwQHBoeC5nYmw+","referencesHeader":"PEJBWTExMi1XMTNDOUJFRkFGQjcyMzEwMTU5MTg0REFEODUwQHBoeC5nYmw+IDxnNjU0cDIrZ2Rsc0BlR3JvdXBzLmNvbT4gPEJBWTExMi1XNTBGMEIyNUI0RTlGM0M1MDJBNzU2QUFEODUwQHBoeC5nYmw+"},"prevInTopic":34729,"nextInTopic":34731,"prevInTime":34729,"nextInTime":34731,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"... I think it sounds wonderful! Young children will learn so MUCH from the things they do just hanging around the house! If you focus on supporting them in","messageBody":"<div id=\"ygrps-yiv-525074053\">On Jul 22, 2008, at 10:35 AM, Kelli Johnston wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think I am in a little panic that we *seemingly* aren&#39;t doing  <br/>\n&gt; anything. Maybe this is just one of those first steps in trusting  <br/>\n&gt; that everything is going to be ok?Kelli<br/>\n<br/>\n<br/>\n </span></blockquote>I think it sounds wonderful! Young children will learn so MUCH from  <br/>\nthe things they do just hanging around the house! If you focus on  <br/>\nsupporting them in having fun, you&#39;ll automatically support plenty of  <br/>\nlearning!<br/>\n<br/>\nIf they don&#39;t seem to be energetically and enthusiastically enjoying  <br/>\ntheir lives, then THAT is a problem and you might need to jazz up your  <br/>\nhome environment more. That happens to all of us, occasionally. To do  <br/>\nthat, think of two approaches and do both - building on what you know  <br/>\nthey already have enjoyed (if they like to paint, find new kinds of  <br/>\npaint, new ways to paint, etc.) and introduce them to new things that  <br/>\nthey might not think of themselves (you might show them how to play a  <br/>\nnew card game, for example).<br/>\n<br/>\nAlso, if your weekends are packed, as you said, remember that all  <br/>\n&quot;counts&quot; - they are learning all the time.<br/>\n<br/>\nIn fact, just try and stop them! &lt;G&gt;<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":299478581,"authorName":"julie","from":"&quot;julie&quot; &lt;brihanna@...&gt;","profile":"jaysca07","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: feeling unmotivated","postDate":"1216752442","msgId":34736,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc2NTl2cSs0dnYzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTExMi1XMTNDOUJFRkFGQjcyMzEwMTU5MTg0REFEODUwQHBoeC5nYmw+"},"prevInTopic":34735,"nextInTopic":34742,"prevInTime":34735,"nextInTime":34737,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"Kelli I don t know if this is exactly the right answer, however, I also have little ones and so from my point of view....I don t think you have to be","messageBody":"<div id=\"ygrps-yiv-486183607\">Kelli<br/>\n<br/>\nI don&#39;t know if this is exactly the right answer, however, I also have<br/>\nlittle ones and so from my point of view....I don&#39;t think you have to<br/>\nbe constantly exposing them to new stuff.  Right now, in their young<br/>\nlives, what I think (my kids) at least need exposure to is people, and<br/>\nrelationships, and with you with them, that is what they are getting.<br/>\n<br/>\nGoing to parks and beaches several times a week as well as a weekend<br/>\nfull of things to do....they very well may be happy with the down time<br/>\non the days that you are all home.  I know if I did something every<br/>\nday with my little ones, they would be cranky and over stimulated.<br/>\n<br/>\nYou could go someplace or do something every day, but that does not<br/>\nmean it would be meaningful to them, or worth your effort.  <br/>\n<br/>\nRelax, as they get older, and see things on tv, or talk to others<br/>\nabout things, they will ask you about it.  Let them lead you.  I guess<br/>\nif they are BEGGING you to go somewhere, you should probably try to do<br/>\nit with them, but if not, just let them be little and have fun with<br/>\nit.  They have plenty of childhood left!<br/>\n<br/>\nAs I said, I am not too sure if this is the right view on it, as I<br/>\nhave only just (6 months) really gotten into the whole US way of<br/>\nthinking/living, but those are my few cents.<br/>\n<br/>\nGood luck, and enjoy</div>","specialLinks":[]},{"userId":205985732,"authorName":"A Perry","from":"A Perry &lt;ansperry@...&gt;","profile":"ansperry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: feeling unmotivated","postDate":"1216750486","msgId":34735,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk0NDg2My45NDc0LnFtQHdlYjMzMjA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PEJBWTExMi1XNTBGMEIyNUI0RTlGM0M1MDJBNzU2QUFEODUwQHBoeC5nYmw+"},"prevInTopic":34734,"nextInTopic":34736,"prevInTime":34734,"nextInTime":34736,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"Hi Kelli,   I can relate to how you are feeling. It took me almost 6 months to stop feeling the pressure to do something with/for the kids. I love being","messageBody":"<div id=\"ygrps-yiv-199854570\">Hi Kelli,<br/>\n <br/>\nI can relate to how you are feeling. It took me almost 6 months to stop feeling the pressure to &quot;do something&quot; with/for the kids. I love being home, and I could happily putter around the house and gardens for weeks on end. My six year old son is also perfectly content to hang out. I do try to find stuff for my daughter, who is 12, because she seems more restless and wants more outside stuff to do. She has a couple of friends to visit, and that helps.  She also loves going to the bookstore, and that&#39;s something we can all do together that isn&#39;t too taxing.<br/>\n <br/>\nI take my son to the park very rarely, and when I do, it&#39;s just me and him- he has no interest in playing with other kids. I used to worry a little but I got over it, much as I have gotten over the pressure I put on myself to &quot;do things&quot;. <br/>\n <br/>\nIf everyone is content, I think it is wonderful that you are all happy to be home together. You can do so many things at home, too. Some of the things we have going on right now include an ant farm, a fish tank, an ongoing 3-D jigsaw puzzle, the gardens, making jam and canning stuff, some insect eggs on a leaf that we look at several hundred times a day,<br/>\nplaying &quot;band&quot; with our instruments, digging a pond...and this is &quot;extra&quot; stuff, aside from the usual books, tv, video games, cooking, playing board games, building forts, the sand box, the pool...I&#39;ll bet if you started a list of the things you have and the things you do with them, you would be surprised by how full their lives actually are. <br/>\n <br/>\nMaybe once a month go to a play or a museum or something special. We belong to a group that does things once in a while and it helps motivate me to know we have other people going along with us. <br/>\n <br/>\nEnjoy the peace!<br/>\n <br/>\n~Angela<br/>\n <br/>\n <br/>\n-- On Tue, 7/22/08, Kelli Johnston &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:KelliJohnston@...\">KelliJohnston@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Kelli Johnston &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:KelliJohnston@...\">KelliJohnston@...</a>&gt;<br/>\nSubject: RE: [unschoolingbasics] Re: feeling unmotivated<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Tuesday, July 22, 2008, 1:35 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nyeah that sounds like a good idea! I guess part of the problem is that I would rather stay home. I mean maybe they do too but since they are young, it is harder to tell what is my doing and what is there doing. I don&#39;t want to limit them because of my needs but it is hard to get up the energy to do things sometimes. I am not one of those naturally exciting parents with fun ideas. I have this vision that I should be hauling out a big box of crafty stuff or showing them modern art....or just being more proactive in general. My kids rarely ask me to do anything with them so we are doing our own thing most of the time. I mean if I knew that somehow I just needed to force myself for a while? Do others feel this need to expose their children to a lot of things? I think I am in a little panic that we *seemingly* aren&#39;t doing anything. Maybe this is just one of those first steps in trusting that everything is going to be ok?Kelli<br/>\n<br/>\nEMAILING FOR THE GREATER GOODJoin me<br/>\n<br/>\nTo: unschoolingbasics@ yahoogroups. comFrom: carenkh@earthlink. netDate: Tue, 22 Jul 2008 17:18:26 +0000Subject: [unschoolingbasics] Re: feeling unmotivated<br/>\n<br/>\nI wonder if you can make a list of other activities you might do,using pictures (I&#39;m guessing they&#39;re not reading yet!). Just tack itup on the wall, and if something seems interesting to them, they&#39;lllet you know! You may have to visit the place once before, so theyknow what it is, but then, it won&#39;t all be on you to think of things.Some kids are happier at home; it was stressful for my oldest to goplaces until he was older. He didn&#39;t initiate things because he didn&#39;treally want to go! Unfortunately, I wasn&#39;t RU then - he went to schoolfor two years. It&#39;s still rare that he asks to go anywhere - he likesit at home.--- In unschoolingbasics@ yahoogroups. com, Kelli Johnston&lt;KelliJohns ton@...&gt; wrote:&gt;&gt; &gt; Hi, I was wondering if anyone could shed some light on how to getmotivated to create an exciting educational environment for my kids. <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":326249694,"authorName":"Kimberly Slage","from":"&quot;Kimberly Slage&quot; &lt;kimberlyslage@...&gt;","profile":"magnolia_academy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: feeling unmotivated","postDate":"1216749739","msgId":34734,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyMjVmOWVhMDgwNzIyMTEwMmoyNTBiYzUzN3ViYzAyNTVlZWVjOTkyMTMyQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGc2NTRwMitnZGxzQGVHcm91cHMuY29tPg==","referencesHeader":"PEJBWTExMi1XMTNDOUJFRkFGQjcyMzEwMTU5MTg0REFEODUwQHBoeC5nYmw+CSA8ZzY1NHAyK2dkbHNAZUdyb3Vwcy5jb20+"},"prevInTopic":34731,"nextInTopic":34735,"prevInTime":34733,"nextInTime":34735,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"It is so hard sometimes.  I have a 14 and a 8 year old and we go through that sometimes too.  (We spend a lot of time at home.) It seems to me that you already","messageBody":"<div id=\"ygrps-yiv-453830451\">It is so hard sometimes.  I have a 14 and a 8 year old and we go through<br/>\nthat sometimes<br/>\ntoo.  (We spend a lot of time at home.)<br/>\n  It seems to me that you already are keeping<br/>\nthem busy.  Our big outing at times is the library.  We go tons. I joined<br/>\nNetflix this<br/>\nsummer and we get movies all the time and this seems to keep my kids<br/>\noccupied.  It is<br/>\nvery hot out so the limits of course for outside activity are limited. I am<br/>\noriginally from Orlando<br/>\nand we had a pool.  My kids would swim all day back then.  I miss that!<br/>\nHang in there!<br/>\n<br/>\nKimberly<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, Jul 22, 2008 at 12:18 PM, carenkh &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:carenkh@...\">carenkh@...</a>&gt; wrote:<br/>\n<br/>\n&gt;   I wonder if you can make a list of other activities you might do,<br/>\n&gt; using pictures (I&#39;m guessing they&#39;re not reading yet!). Just tack it<br/>\n&gt; up on the wall, and if something seems interesting to them, they&#39;ll<br/>\n&gt; let you know! You may have to visit the place once before, so they<br/>\n&gt; know what it is, but then, it won&#39;t all be on you to think of things.<br/>\n&gt;<br/>\n&gt; Some kids are happier at home; it was stressful for my oldest to go<br/>\n&gt; places until he was older. He didn&#39;t initiate things because he didn&#39;t<br/>\n&gt; really want to go! Unfortunately, I wasn&#39;t RU then - he went to school<br/>\n&gt; for two years. It&#39;s still rare that he asks to go anywhere - he likes<br/>\n&gt; it at home.<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&lt;unschoolingbasics%40yahoogroups.com&gt;,<br/>\n&gt; Kelli Johnston<br/>\n&gt;<br/>\n&gt; &lt;KelliJohnston@...&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Hi, I was wondering if anyone could shed some light on how to get<br/>\n&gt; motivated to create an exciting educational environment for my kids.<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nKimberly Slage<br/>\nwww.magnoliaacademy.weebly.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":151505017,"authorName":"carenkh","from":"&quot;carenkh&quot; &lt;carenkh@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: feeling unmotivated","postDate":"1216749717","msgId":34729,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc2NTdhbCtqZ2MxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTExMi1XNTBGMEIyNUI0RTlGM0M1MDJBNzU2QUFEODUwQHBoeC5nYmw+"},"prevInTopic":34728,"nextInTopic":34730,"prevInTime":34728,"nextInTime":34730,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"What are YOU passionate about? What are YOU interested in? What gets you out of bed in the morning? Are you happy to be alive? Are you alive? Caren","messageBody":"<div id=\"ygrps-yiv-1938043502\">What are YOU passionate about? What are YOU interested in? What gets<br/>\nyou out of bed in the morning? Are you happy to be alive? Are you alive?<br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":238615405,"authorName":"Kelli Johnston","from":"Kelli Johnston &lt;KelliJohnston@...&gt;","profile":"kaipelesmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: feeling unmotivated","postDate":"1216748124","msgId":34728,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExMi1XNTBGMEIyNUI0RTlGM0M1MDJBNzU2QUFEODUwQHBoeC5nYmw+","inReplyToHeader":"PGc2NTRwMitnZGxzQGVHcm91cHMuY29tPg==","referencesHeader":"PEJBWTExMi1XMTNDOUJFRkFGQjcyMzEwMTU5MTg0REFEODUwQHBoeC5nYmw+IDxnNjU0cDIrZ2Rsc0BlR3JvdXBzLmNvbT4="},"prevInTopic":34727,"nextInTopic":34729,"prevInTime":34727,"nextInTime":34729,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"yeah that sounds like a good idea! I guess part of the problem is that I would rather stay home. I mean maybe they do too but since they are young, it is","messageBody":"<div id=\"ygrps-yiv-251835244\">yeah that sounds like a good idea! I guess part of the problem is that I would rather stay home. I mean maybe they do too but since they are young, it is harder to tell what is my doing and what is there doing. I don&#39;t want to limit them because of my needs but it is hard to get up the energy to do things sometimes. I am not one of those naturally exciting parents with fun ideas. I have this vision that I should be hauling out a big box of crafty stuff or showing them modern art....or just being more proactive in general. My kids rarely ask me to do anything with them so we are doing our own thing most of the time. I mean if I knew that somehow I just needed to force myself for a while? Do others feel this need to expose their children to a lot of things? I think I am in a little panic that we *seemingly* aren&#39;t doing anything. Maybe this is just one of those first steps in trusting that everything is going to be ok?Kelli<br/>\n<br/>\n<br/>\n<br/>\n EMAILING FOR THE GREATER GOODJoin me<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.comFrom\">unschoolingbasics@yahoogroups.comFrom</a>: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:carenkh@...\">carenkh@...</a>: Tue, 22 Jul 2008 17:18:26 +0000Subject: [unschoolingbasics] Re: feeling unmotivated<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI wonder if you can make a list of other activities you might do,using pictures (I&#39;m guessing they&#39;re not reading yet!). Just tack itup on the wall, and if something seems interesting to them, they&#39;lllet you know! You may have to visit the place once before, so theyknow what it is, but then, it won&#39;t all be on you to think of things.Some kids are happier at home; it was stressful for my oldest to goplaces until he was older. He didn&#39;t initiate things because he didn&#39;treally want to go! Unfortunately, I wasn&#39;t RU then - he went to schoolfor two years. It&#39;s still rare that he asks to go anywhere - he likesit at home.--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Kelli Johnston&lt;KelliJohnston@...&gt; wrote:&gt;&gt; &gt; Hi, I was wondering if anyone could shed some light on how to getmotivated to create an exciting educational environment for my kids.  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":151505017,"authorName":"carenkh","from":"&quot;carenkh&quot; &lt;carenkh@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: feeling unmotivated","postDate":"1216747106","msgId":34727,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc2NTRwMitnZGxzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTExMi1XMTNDOUJFRkFGQjcyMzEwMTU5MTg0REFEODUwQHBoeC5nYmw+"},"prevInTopic":34726,"nextInTopic":34728,"prevInTime":34726,"nextInTime":34728,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"I wonder if you can make a list of other activities you might do, using pictures (I m guessing they re not reading yet!). Just tack it up on the wall, and if","messageBody":"<div id=\"ygrps-yiv-1383349363\">I wonder if you can make a list of other activities you might do,<br/>\nusing pictures (I&#39;m guessing they&#39;re not reading yet!). Just tack it<br/>\nup on the wall, and if something seems interesting to them, they&#39;ll<br/>\nlet you know! You may have to visit the place once before, so they<br/>\nknow what it is, but then, it won&#39;t all be on you to think of things.<br/>\n<br/>\nSome kids are happier at home; it was stressful for my oldest to go<br/>\nplaces until he was older. He didn&#39;t initiate things because he didn&#39;t<br/>\nreally want to go! Unfortunately, I wasn&#39;t RU then - he went to school<br/>\nfor two years. It&#39;s still rare that he asks to go anywhere - he likes<br/>\nit at home.<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Kelli Johnston<br/>\n&lt;KelliJohnston@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; Hi, I was wondering if anyone could shed some light on how to get<br/>\n </span></blockquote>motivated to create an exciting educational environment for my kids.</div>","specialLinks":[]},{"userId":238615405,"authorName":"Kelli Johnston","from":"Kelli Johnston &lt;KelliJohnston@...&gt;","profile":"kaipelesmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"feeling unmotivated","postDate":"1216746071","msgId":34726,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExMi1XMTNDOUJFRkFGQjcyMzEwMTU5MTg0REFEODUwQHBoeC5nYmw+"},"prevInTopic":0,"nextInTopic":34727,"prevInTime":34725,"nextInTime":34727,"topicId":34726,"numMessagesInTopic":0,"msgSnippet":"Hi, I was wondering if anyone could shed some light on how to get motivated to create an exciting educational environment for my kids. They are pretty young","messageBody":"<div id=\"ygrps-yiv-254962900\">Hi, I was wondering if anyone could shed some light on how to get motivated to create an exciting educational environment for my kids. They are pretty young still (5 & 4). We get out to the beach and the park a couple times a week but other than that we stay home most of the day. Our weekends are pretty packed so once the week rolls around, I feel pretty tired and unmotivated! I know that the kids are learning a lot doing what they are doing (mostly imaginary play, drawing/painting, playing in the yard, watching tv, and using the computer) but I feel like I should be exposing them more to stuff outside of the house (museums, parks, hikes, etc) or having more materials around the house that could spark interest. I keep thinking that today is the day that I will motivate or even trying to schedule myself but I find myself rebelling against myself, lol. Anyone have any suggestions? Should I just let it be and de-school for a while (my 5 year old was on a curriculum last year which was stressful for all of us) or push myself until it feels more natural? I am not talking about forcing anything on them...just offering more options than what is immediately in front of them that they are aware of.Kelli<br/>\n<br/>\n<br/>\n<br/>\n EMAILING FOR THE GREATER GOODJoin me<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":34862,"nextTopicId":34814}}