{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":100519971,"authorName":"Alyce","from":"&quot;Alyce&quot; &lt;alyce13j@...&gt;","profile":"alyce13j","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: The Whole Santa Clause Thing","postDate":"1094171616","msgId":3019,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNoOGU1MCtxMjl0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMTIwMWM0OGY4ZiQ5ODEyNTRkMCQ3MzAyYThjMEAyMDAyZGVza3RvcD4="},"prevInTopic":3006,"nextInTopic":0,"prevInTime":3018,"nextInTime":3020,"topicId":2994,"numMessagesInTopic":0,"msgSnippet":"...  wrote: (like her friend who said that she once saw Santa coming down her chimney) To this day my husband s sister swears she saw Santa in her","messageBody":"<div id=\"ygrps-yiv-373938154\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;catherine aceto&quot; <br/>\n&lt;aceto3@v...&gt; wrote:<br/>\n(like her friend who said that she once saw Santa coming down her <br/>\nchimney) <br/>\n<br/>\nTo this day my husband&#39;s sister swears she saw Santa in her back <br/>\nyard.  She&#39;s 40.  I&#39;m sure not going to argue with her.  I think <br/>\nit&#39;s terrific.  <br/>\n<br/>\nAlyce</div>","specialLinks":[]},{"userId":78615010,"authorName":"mamaaj2000","from":"&quot;mamaaj2000&quot; &lt;mamaaj2000@...&gt;","profile":"mamaaj2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Telling the Truth re Pet Death","postDate":"1094073244","msgId":3006,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNoNWUycytmcjRuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNoMjY0NitrbmJwQGVHcm91cHMuY29tPg=="},"prevInTopic":3005,"nextInTopic":3019,"prevInTime":3005,"nextInTime":3007,"topicId":2994,"numMessagesInTopic":0,"msgSnippet":"Thanks for the advice and support. I haven t had time to write any responses because my dd has decided that sleep is optional!! Argh. I think I m going to talk","messageBody":"<div id=\"ygrps-yiv-1329090686\">Thanks for the advice and support. I haven&#39;t had time to write any <br/>\nresponses because my dd has decided that sleep is optional!! Argh.<br/>\n<br/>\nI think I&#39;m going to talk to ds and just take it one statement at a <br/>\ntime and see how it goes. Gizmo has avoided Mikey since he started <br/>\ncrawling, so Mikey isn&#39;t close to him or really aware of how sick he <br/>\nis.<br/>\n<br/>\nI also have to talk to dh, because he&#39;s thinking about doing this in <br/>\na couple weeks or later and I think we may need to do it much sooner.<br/>\n<br/>\nThanks again,<br/>\naj</div>","specialLinks":[]},{"userId":154422553,"authorName":"Krisula Moyer","from":"&quot;Krisula Moyer&quot; &lt;krisulam@...&gt;","profile":"krisulaula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: The Whole Santa Clause Thing","postDate":"1094055655","msgId":3005,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PElORU5MQU5QUENKSEFJUE9NRklPR0VGQ0NJQUEua3Jpc3VsYW1AdmVyaXpvbi5uZXQ+","inReplyToHeader":"PDEwOTQwMzE0ODUuMjg2Ljg3NjIxLm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":3004,"nextInTopic":3006,"prevInTime":3004,"nextInTime":3006,"topicId":2994,"numMessagesInTopic":0,"msgSnippet":"When my oldest was 2 he started asking, Who is that man with the beard? He noticed the image seemed to be just everywhere (it was December).  We told him","messageBody":"<div id=\"ygrps-yiv-270236920\">When my oldest was 2 he started asking, &quot;Who is that man with the beard?&quot;<br/>\nHe noticed the image seemed to be just everywhere (it was December).  We<br/>\ntold him &quot;That&#39;s Santa Clause - He reminds us to be generous&quot; No mention at<br/>\nthat time about real or not real.  Later we checked out a book from the<br/>\nlibrary about the history of St. Nicholas, which included pictures of the<br/>\nimages as they evolved over time and stories, associated with him in<br/>\ndifferent countries. We borrowed this book many times over the years.<br/>\n We put out shoes on St Nicolas Tag and stockings at Christmas and generally<br/>\nhad a great time with it.  The main point we made with him was that people<br/>\nwould sign Santa&#39;s name when they wanted to be anonymous.  So, if you get a<br/>\npresent from Santa, it&#39;s because someone wanted to make you happy with a<br/>\npresent but didn&#39;t want to tell the secret of who the gift was from.  This<br/>\nworked out well for ds.  He always got it that he shouldn&#39;t spoil the fun by<br/>\nexplaining that Santa is not real.  He got to pretend if he wanted to (he<br/>\nrarely did though) and he could surprise others with gifts &quot;from Santa&quot;.<br/>\nDD went through a time about age 6 when she really believed in Santa and<br/>\nwanted us to as well.  For her, the magical stories and movies on tv were<br/>\nutterly convincing.  We let her believe.  Didn&#39;t spoil her fun but one thing<br/>\nwe were sure not to do was to egg it on.  The aspect of Santa I find<br/>\ndisturbing is where adults manipulate children by telling them bald-faced<br/>\nlies to try to get the kids to behave &quot;or you&#39;ll get a lump of coal&quot;.  Or<br/>\nSanta can see that - you better be good.  I think when the kids put together<br/>\na mythos for themselves about santa that&#39;s much more fun than if the adults<br/>\ntry to &quot;teach&quot; them that he is real and going to elaborate lengths to hold<br/>\nup the myth.  The favorite stories around here about the big guy are the<br/>\nearly ones from Italy and Romania and the modern ones where the love of the<br/>\nparents for the children is highlighted.<br/>\nkrisula</div>","specialLinks":[]},{"userId":129294861,"authorName":"christy_imnotred","from":"&quot;christy_imnotred&quot; &lt;christy_imnotred@...&gt;","profile":"christy_imnotred","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: The Whole Santa Clause Thing","postDate":"1093984903","msgId":3004,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNoMm5xNyttZWdlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEhJRVBLT09FRUlBSUJISFBKRUJQTUVCRERBQUEuc2FsZ2Vub3Zlc2VAd29ybGRuZXQuYXR0Lm5ldD4="},"prevInTopic":3003,"nextInTopic":3005,"prevInTime":3003,"nextInTime":3005,"topicId":2994,"numMessagesInTopic":0,"msgSnippet":"They had this discussion not too long ago on Unschooling Discussion if you want to go look through the archives.  I was one who said that I told my son about","messageBody":"<div id=\"ygrps-yiv-189086061\">They had this discussion not too long ago on Unschooling Discussion <br/>\nif you want to go look through the archives.  I was one who said that <br/>\nI told my son about Santa and the tooth fairy because we don&#39;t really <br/>\nknow for sure they don&#39;t exist.  Just because we haven&#39;t seen them <br/>\ndoesn&#39;t mean they aren&#39;t real.  I&#39;ve never seen an electron or a <br/>\nquark, doesn&#39; mean I don&#39;t believe they are real.  I choose to <br/>\nbelieve Santa and the tooth fairy are real in some way.  So that is <br/>\nwhat I tell my son I believe.  I know they aren&#39;t leaving presents <br/>\nunder the tree or putting money under my son&#39;s pillow but it doesn&#39;t <br/>\nmean they don&#39;t exist.<br/>\n<br/>\nI also believe in fairies in general and my son and I put honey out <br/>\nfor them.  One time we had a beautiful flower grow in the exact spot <br/>\nwe put the honey.  We didn&#39;t plant the flower.  During Yule my son <br/>\ngets presents from Mother Earth.<br/>\n<br/>\nI don&#39;t feel it is lying to him, because I do believe these things <br/>\nexist.  If at some point in his life he decides the evidence isn&#39;t <br/>\nstrong enough to support his believe, that is fine.  It won&#39;t change <br/>\nwhat I believe.<br/>\n<br/>\nChristy</div>","specialLinks":[]},{"userId":149995806,"authorName":"catherine aceto","from":"&quot;catherine aceto&quot; &lt;aceto3@...&gt;","profile":"cat4cat15217","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] The Whole Santa Clause Thing","postDate":"1093980036","msgId":3003,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTIwMWM0OGY4ZiQ5ODEyNTRkMCQ3MzAyYThjMEAyMDAyZGVza3RvcD4=","referencesHeader":"PEhJRVBLT09FRUlBSUJISFBKRUJQTUVCRERBQUEuc2FsZ2Vub3Zlc2VAd29ybGRuZXQuYXR0Lm5ldD4="},"prevInTopic":3002,"nextInTopic":3004,"prevInTime":3002,"nextInTime":3004,"topicId":2994,"numMessagesInTopic":0,"msgSnippet":"We just flat out told Lydia (now almost 7) that some people tell their children that Santa is real, and that it is unkind to tell those children that Santa is","messageBody":"<div id=\"ygrps-yiv-1719602142\">We just flat out told Lydia (now almost 7) that some people tell their children that Santa is real, and that it is unkind to tell those children that Santa is not real - under the general principle of not bursting other people&#39;s bubbles.  It goes along with not expressing her unfavorable opinion of art that other children are proud of and similar issues of celebrating rather than dampening other people&#39;s happiness. <br/>\n<br/>\n She wanted to know why the parents do that, and I told her that the parents thought that would be best, or more fun for the kids, or something like that.  I think she finds it inexplicable, but she finds a lot of things that other people&#39;s parents do inexplicable.  It doesn&#39;t seem to bother her and the only time that it has been an issue was when her friends tell stories designed Lydia clearly knows to be untrue (like her friend who said that she once saw Santa coming down her chimney) (They just agreed to disagree), and the time that a bunch of girls at gymnastics were badgering Lydia to agree to believe in the tooth fairy.   She ended up telling them there was no tooth fairy, which made the gymnastics staff annoyed with her (rolls eyes).  I told her that she didn&#39;t have to engage with people on these questions - and really the best tactic was to agree to disagree.   <br/>\n<br/>\n-Cat <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":31945013,"authorName":"Joan Labbe & Salvatore Genovese","from":"&quot;Joan Labbe & Salvatore Genovese&quot; &lt;salgenovese@...&gt;","profile":"jrl01760","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"The Whole Santa Clause Thing","postDate":"1093979275","msgId":3002,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEhJRVBLT09FRUlBSUJISFBKRUJQTUVCRERBQUEuc2FsZ2Vub3Zlc2VAd29ybGRuZXQuYXR0Lm5ldD4=","inReplyToHeader":"PGNoMjY0NitrbmJwQGVHcm91cHMuY29tPg=="},"prevInTopic":3001,"nextInTopic":3003,"prevInTime":3001,"nextInTime":3003,"topicId":2994,"numMessagesInTopic":0,"msgSnippet":"I m wondering how folks on this list who celebrate Christmas handle the topic of Santa.  I went with my gut instinct when my kids first asked about Santa and","messageBody":"<div id=\"ygrps-yiv-725638717\">I&#39;m wondering how folks on this list who celebrate Christmas handle the<br/>\ntopic of Santa.  I went with my gut instinct when my kids first asked about<br/>\nSanta and told them he was part of the spirit of giving at Christmas time<br/>\nand that he was pretend like Barney...lots of fun to read about him, talk<br/>\nabout him, watch videos about him, but it was mama and daddy putting their<br/>\nactual presents under the tree.  And we have handled the Tooth Fairy thing<br/>\nthe same way - fun but pretend.  It feels better to me to present it this<br/>\nway, they&#39;ve responded fine to it, the only hitch being when other kids<br/>\nbelieve Santa and the tooth fairy are real and I&#39;m not sure what the best<br/>\nway to explain that to my kids is ... I&#39;m pondering saying &quot;Well in that<br/>\nfamily they like to play a game where Santa is real&quot; or something similar.<br/>\nI guess I want to show respect for other family&#39;s choices but explain it in<br/>\na way that makes sense with my decision.  Any ideas or alternate way of<br/>\nhandling this?<br/>\n<br/>\nThanks...<br/>\n<br/>\nJoan<br/>\n<br/>\n************************<br/>\n&quot;I would rather live in a world where my life is surrounded by mystery than<br/>\nlive in a world so small that my mind could comprehend it.&quot;  ... Harry<br/>\nEmerson Fosdick</div>","specialLinks":[]},{"userId":129294861,"authorName":"christy_imnotred","from":"&quot;christy_imnotred&quot; &lt;christy_imnotred@...&gt;","profile":"christy_imnotred","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Telling the Truth re Pet Death","postDate":"1093966790","msgId":3001,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNoMjY0NitrbmJwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNoMDFwdit1ZWdoQGVHcm91cHMuY29tPg=="},"prevInTopic":3000,"nextInTopic":3002,"prevInTime":3000,"nextInTime":3002,"topicId":2994,"numMessagesInTopic":0,"msgSnippet":"We are getting ready to go through this too.  Our dog of 8 years has been diagnosed with nasal carcinoma, he doesn t have long.  Most likely we will end up","messageBody":"<div id=\"ygrps-yiv-766540325\">We are getting ready to go through this too.  Our dog of 8 years has <br/>\nbeen diagnosed with nasal carcinoma, he doesn&#39;t have long.  Most <br/>\nlikely we will end up having to put him down.  I&#39;ve also been <br/>\nwondering how to tell my son, he is almost 5.  He is very attached to <br/>\nthis dog.  I know I have to tell him the truth and be very careful to <br/>\navoid words like putting to sleep.  It is going to be so hard.  I cry <br/>\njust thinking about it.  Good luck.  Let us know what you do and how <br/>\nit goes, any advice will be useful.<br/>\n<br/>\nChristy O</div>","specialLinks":[]},{"userId":31945013,"authorName":"Joan Labbe & Salvatore Genovese","from":"&quot;Joan Labbe & Salvatore Genovese&quot; &lt;salgenovese@...&gt;","profile":"jrl01760","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Telling the Truth re Pet Death","postDate":"1093965264","msgId":3000,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEhJRVBLT09FRUlBSUJISFBKRUJQRUVCQ0RBQUEuc2FsZ2Vub3Zlc2VAd29ybGRuZXQuYXR0Lm5ldD4=","inReplyToHeader":"PGNoMDFwdit1ZWdoQGVHcm91cHMuY29tPg=="},"prevInTopic":2999,"nextInTopic":3001,"prevInTime":2999,"nextInTime":3001,"topicId":2994,"numMessagesInTopic":0,"msgSnippet":"Hi, aj, Sorry to hear you are going through this.  Losing an animal is really hard. We had to put down the cat who was best friend to my husband (had him since","messageBody":"<div id=\"ygrps-yiv-460077710\">Hi, aj,<br/>\n<br/>\nSorry to hear you are going through this.  Losing an animal is really hard.<br/>\nWe had to put down the cat who was best friend to my husband (had him since<br/>\ncollege when the cat was a kitten) when I was 8 mos pregnant with my son.<br/>\nMy daughter was 2.2 yrs old and VERY attached to that cat.  He was a big old<br/>\ntomcat with an amazingly easy disposition and used to let her sit on him and<br/>\n&quot;ride him&quot; - his name was Suji and he was like her brother at the time.  I<br/>\nthink it helped that she went to the vet and was there when the vet talked<br/>\nto us about him - his kidneys had stopped working, he was old, and that&#39;s<br/>\nwhat we reiterated to her.  We had a conversation about how all living<br/>\ncreatures get old and their bodies stop working, and I made sure to throw in<br/>\nthat for people it&#39;s a good long time.<br/>\n<br/>\nI was very hesitant, like you, about how my sensitive daughter would take<br/>\nall this.  Personally I didn&#39;t consider myself all that close to the cat and<br/>\nI sobbed for a day and a half.  My daughter amazed me with the way she<br/>\nhandled it.  She used play acting - pretended she was the vet and re-enacted<br/>\nthe whole trip to the vet experience, giving her cat a checkup.  My daughter<br/>\nalso used to refer to herself a lot in the third person to talk about things<br/>\nshe found difficult (something that evolved out of our storytelling).  She<br/>\nwent through a period where when she called herself &quot;Suji&quot;, the cat&#39;s name,<br/>\nwhen she was doing this.  So she&#39;d say &quot;Suji didn&#39;t like the way that boy<br/>\nwas playing&quot; for instance, meaning herself.  So I came away from the whole<br/>\nthing amazed at my child&#39;s ability to use the tools at her disposal to<br/>\nprocess and handle the event of Suji&#39;s death.  I&#39;d be willing to bet your<br/>\nchild will amaze you also.<br/>\n<br/>\nJoan</div>","specialLinks":[]},{"userId":105977377,"authorName":"Alison Broadbent","from":"Alison Broadbent &lt;abzb@...&gt;","profile":"tttrrrsz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:Telling the Truth re Pet Death","postDate":"1093964343","msgId":2999,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDNkU4MjQ2LUZCNUUtMTFEOC1BM0IzLTAwMEQ5MzUyNDIxQUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":2996,"nextInTopic":3000,"prevInTime":2998,"nextInTime":3000,"topicId":2994,"numMessagesInTopic":0,"msgSnippet":"Hi Aj, I m so sorry to hear about your dear cat.  We had a dog who died when our ds was 9 mos. I do believe that kids take in what they can manage at the time.","messageBody":"<div id=\"ygrps-yiv-1907547456\">Hi Aj,<br/>\n<br/>\nI&#39;m so sorry to hear about your dear cat.  We had a dog who died when <br/>\nour ds was 9 mos. I do believe that kids take in what they can manage <br/>\nat the time.  He has asked about Gus and I told him what happened to <br/>\nhim.  At 3 and 4, he talked about him many times.  I might have said <br/>\nsomething to a friend and then later my ds would say something like, <br/>\n&#39;Gus is just at the vet&#39;s.  He didn&#39;t die.  Sometimes it just takes a <br/>\nlong time for dog&#39;s to get better.&quot;  I guess I would try telling your <br/>\nds what&#39;s going on and follow his lead w/ what he wants to know.<br/>\n<br/>\nI feel for what you&#39;re going through.  It&#39;s so hard. It seems so <br/>\ndifficult to separate our own fears about these things from what an <br/>\nopen child might take them to mean..  Let us know how this goes and <br/>\nknow we&#39;re thinking of you.<br/>\n<br/>\nAlison</div>","specialLinks":[]},{"userId":77817828,"authorName":"LOWRIEK@aol.com","from":"LOWRIEK@...","profile":"nancylowrie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Telling the Truth re Pet Death","postDate":"1093901471","msgId":2996,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlkLjRjZjk2ZWI2LjJlNjRmNjlmQGFvbC5jb20+"},"prevInTopic":2995,"nextInTopic":2999,"prevInTime":2995,"nextInTime":2997,"topicId":2994,"numMessagesInTopic":0,"msgSnippet":"In a message dated 30/08/2004 13:16:00 Pacific Daylight Time, ... How sad for you aj, it has been our experience that our children have been able to handle the","messageBody":"<div id=\"ygrps-yiv-1225298017\">In a message dated 30/08/2004 13:16:00 Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamaaj2000@...\">mamaaj2000@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but I&#39;m worried <br/>\n&gt; about questions about people getting sick enough to be &quot;put down&quot;. <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>How sad for you aj, it has been our experience that our children have been <br/>\nable to handle the truth quite well, when it is given kindly and explained well. <br/>\nWe have been open to discussing the entire aspect of euthanasia of pets with <br/>\nour ds, now8.5, and he has been great with it. We had a small dog that was my <br/>\nson&#39;s, and he had an auto-immune disease, and we had to euthanise him to ease <br/>\nhis suffering, and that ws exactly how we told Tommy , he was there, and we <br/>\nconsulted him about it, and he agreed it was the kindest thing to do. Now he was <br/>\n6 at the time, and chose not to be present for the act. We have had a dog put <br/>\ndown , and telling tommy about it ahead of time gave him time to say good-bye <br/>\nand talk about the dog and what he loved about her, to give her a cookie, and <br/>\nreally grieve without any surprise. <br/>\nThat is what worked for us, and it has set the stage for some really open <br/>\ncommunication about death, dying, and life. He did have some anxiety about us <br/>\ndying, but I think they all go thru that at some point. <br/>\nChildren are remarkable in their capacity to understand and care for pets, <br/>\nthis can be seen as part of that process, I believe.<br/>\nNancy in BC, sorry you are losing a friend.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":190129650,"authorName":"dana tierney","from":"dana tierney &lt;dana.tierney@...&gt;","profile":"danaelyn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Telling the Truth re Pet Death","postDate":"1093897394","msgId":2995,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQyNTUzNmYzMDQwODMwMTMyMzQyNzFjNjZmQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGNoMDFwdit1ZWdoQGVHcm91cHMuY29tPg==","referencesHeader":"PGNoMDFwdit1ZWdoQGVHcm91cHMuY29tPg=="},"prevInTopic":2994,"nextInTopic":2996,"prevInTime":2994,"nextInTime":2996,"topicId":2994,"numMessagesInTopic":0,"msgSnippet":"I think explaining that it is the alternative to a lot of pain may work. My daughter was about 9 when we went through this, though... but she found a cat that","messageBody":"<div id=\"ygrps-yiv-1893233471\">I think explaining that it is the alternative to a lot of pain may<br/>\nwork. My daughter was about 9 when we went through this, though... but<br/>\nshe found a cat that had been hit by a car nd was trynig to nurse it.<br/>\nWhen I found out about this I realized that the cat had a compound<br/>\nfracture at a minimum so we took her to the vet (me debating how much<br/>\nI can afford to spend on a stray cat) and found out that the leg was<br/>\nhopeless and there were unknown internal injuries too. We explained<br/>\nthat the kitty was probably going to die anyway and did not understand<br/>\nanything except that she hurt really bad. My daughter cried a little<br/>\nand asked for time to say goodbye. It seemed to help when I pointed<br/>\nout that at least the kitty died knowing somebody cared about her.<br/>\n<br/>\nHope that helps<br/>\nDana<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, 30 Aug 2004 20:13:51 -0000, mamaaj2000 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamaaj2000@...\">mamaaj2000@...</a>&gt; wrote:<br/>\n&gt; Long before I had kids or had heard of unschooling or the radical<br/>\n&gt; idea of treating kids with respect, I used to flinch at people who<br/>\n&gt; lied to their kids without even considering telling them the truth.<br/>\n&gt; <br/>\n&gt; But...I&#39;m kind of afraid of telling ds (almost 4) that we&#39;re having<br/>\n&gt; one of our cats put to sleep. (Not that I&#39;d use the word &#39;sleep&#39; if I<br/>\n&gt; do explain it.) I guess I&#39;m afraid of him having the idea that we<br/>\n&gt; kill someone if they are too sick. I think he could handle the idea<br/>\n&gt; that Gizmo died because the vet couldn&#39;t save him, but I&#39;m worried<br/>\n&gt; about questions about people getting sick enough to be &quot;put down&quot;.<br/>\n&gt; That seems like a tougher subject.<br/>\n&gt; <br/>\n&gt; Am I wimping out? I don&#39;t know. Dh won&#39;t be able to handle ANY<br/>\n&gt; conversation on the matter (his cat for 15 years, dying of cancer<br/>\n&gt; just like my FIL did), so I&#39;m on my own.<br/>\n&gt; <br/>\n&gt; Maybe there&#39;s a middle ground, like explaining that the vet couldn&#39;t<br/>\n&gt; do anything besides make sure Gizmo wasn&#39;t hurting anymore--leaving<br/>\n&gt; out the fact that we went there knowing what was going to happen.<br/>\n&gt; <br/>\n&gt; Any clear thinking on this subject would be appreciated, because it&#39;s<br/>\n&gt; not the least bit clear in my head right now. I&#39;m just glad I found a<br/>\n&gt; new babysitter last week so that I can drop off the kids and go with<br/>\n&gt; dh to the vet.<br/>\n&gt; <br/>\n&gt; Thanks,<br/>\n&gt; aj<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Yahoo! Groups Links<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":78615010,"authorName":"mamaaj2000","from":"&quot;mamaaj2000&quot; &lt;mamaaj2000@...&gt;","profile":"mamaaj2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Telling the Truth re Pet Death","postDate":"1093896831","msgId":2994,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNoMDFwdit1ZWdoQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":2995,"prevInTime":2993,"nextInTime":2995,"topicId":2994,"numMessagesInTopic":0,"msgSnippet":"Long before I had kids or had heard of unschooling or the radical idea of treating kids with respect, I used to flinch at people who lied to their kids without","messageBody":"<div id=\"ygrps-yiv-1286511271\">Long before I had kids or had heard of unschooling or the radical <br/>\nidea of treating kids with respect, I used to flinch at people who <br/>\nlied to their kids without even considering telling them the truth.<br/>\n<br/>\nBut...I&#39;m kind of afraid of telling ds (almost 4) that we&#39;re having <br/>\none of our cats put to sleep. (Not that I&#39;d use the word &#39;sleep&#39; if I <br/>\ndo explain it.) I guess I&#39;m afraid of him having the idea that we <br/>\nkill someone if they are too sick. I think he could handle the idea <br/>\nthat Gizmo died because the vet couldn&#39;t save him, but I&#39;m worried <br/>\nabout questions about people getting sick enough to be &quot;put down&quot;. <br/>\nThat seems like a tougher subject. <br/>\n<br/>\nAm I wimping out? I don&#39;t know. Dh won&#39;t be able to handle ANY <br/>\nconversation on the matter (his cat for 15 years, dying of cancer <br/>\njust like my FIL did), so I&#39;m on my own.<br/>\n<br/>\nMaybe there&#39;s a middle ground, like explaining that the vet couldn&#39;t <br/>\ndo anything besides make sure Gizmo wasn&#39;t hurting anymore--leaving <br/>\nout the fact that we went there knowing what was going to happen.<br/>\n<br/>\nAny clear thinking on this subject would be appreciated, because it&#39;s <br/>\nnot the least bit clear in my head right now. I&#39;m just glad I found a <br/>\nnew babysitter last week so that I can drop off the kids and go with <br/>\ndh to the vet.<br/>\n<br/>\nThanks,<br/>\naj</div>","specialLinks":[]}],"prevTopicId":3011,"nextTopicId":3020}}