{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":92643757,"authorName":"Leslie530@aol.com","from":"Leslie530@...","profile":"lescather","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: trouble with other kids","postDate":"1149077671","msgId":13808,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1Ny4yNDNjYmJmLjMxYWVlMmE3QGFvbC5jb20+"},"prevInTopic":13796,"nextInTopic":0,"prevInTime":13807,"nextInTime":13809,"topicId":13771,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/30/2006 12:07:56 P.M. Eastern Daylight Time, mfhickman@comcast.net writes: My  thoughts and stories from similar situation here. My son is","messageBody":"<div id=\"ygrps-yiv-1503549764\">In a message dated 5/30/2006 12:07:56 P.M. Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mfhickman@...\">mfhickman@...</a> writes:<br/>\n<br/>\nMy  thoughts and stories from similar situation here. My son is 9 and I still <br/>\nstay  outside and watch him play with anyone. It just is what works for his <br/>\nown  safety. It is not an optional thing.<br/>\n<br/>\nMary<br/>\n<br/>\n<br/>\n<br/>\n*********<br/>\n <br/>\nMary, I have mulled over what you are saying.  I agree with you, but I  <br/>\nrealize I just cannot do it at this time.  My own life is overwhelming to  me and <br/>\nI&#39;ve got much bigger issues to deal with.  This is why is was so  wonderful <br/>\nthat my children could finally play outside without me sitting right  there!  I <br/>\njust need time to focus on other things....seriously.....not just  &quot;me time&quot;.  <br/>\nThe stable future of my family depends on it.  <br/>\n <br/>\nI am keeping my fingers crossed that she will be leaving for the summer in  <br/>\nthe next few days.  If not, I will have to keep working on another plan,  like <br/>\nlimiting her time here to an hour.<br/>\n <br/>\nBTW, she has lived in my neighborhood for 18 months.  In that time,  several <br/>\ncompassionate neighbors had been trying to do as you suggested.   She <br/>\neventually wore them out and they will now only allow Ally limited time with  their <br/>\nown children.  It is easier for them as they are really busy with  after school <br/>\nactivities that keep them away from home.  <br/>\n <br/>\nMore reason to move to acreage in the middle of nowhere!!!<br/>\n <br/>\nThanks everybody.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":202023256,"authorName":"mfhickman@comcast.net","from":"mfhickman@...","profile":"maryhickman517","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: trouble with other kids","postDate":"1149005030","msgId":13796,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA1MzAyMDA2MTYwMy41NTY2LjQ0N0M2Q0U2MDAwNTNDRTMwMDAwMTVCRTIyMDA3MzQ4NDAwMjBFMDMwNTBDMDcwODAwMDNAY29tY2FzdC5uZXQ+"},"prevInTopic":13786,"nextInTopic":13808,"prevInTime":13795,"nextInTime":13797,"topicId":13771,"numMessagesInTopic":0,"msgSnippet":"Hi, A few things I would think about. If her behavior outside your home with your kids is potentially dangerous, find a way to be outside the whole time they","messageBody":"<div id=\"ygrps-yiv-273072145\">Hi,<br/>\n<br/>\nA few things I would think about. <br/>\n<br/>\nIf her behavior outside your home with your kids is potentially dangerous, find a way to be outside the whole time they play, and if you can&#39;t bring your kids in, even if it is for a potty break. I have a son who can not always maintain his peaceful self outside and neighbor kids sometimes trigger him into explosive behavior. As much as I would like to be doing something else sometimes, I have to be an open ear outside because it does help avoid these types of problems. Often I garden, or read a book, or work in my journal, so I am not directly involved in active play. Other times I take the active role and ride bikes too and get to know the other kids. My presence completely changes the dynamics, and really, I have gotten to enjoy this role, it helps my son feel safe and I have gotten to know the kids dynamics on a real level.<br/>\n<br/>\nHer parents do need to know what is going on and maybe they need help too, so finding a way to be a helpful neighbor, concerned, and open might help. Maybe as a whole neighborhood, coming together, with kindness for the child. Also, letting the child know clearly when they have crossed the safety boundries. I find I can comunicate very well with the neighbor kids because I have gotten to know them. Also, maybe invite her over when you have total time to focus, do something fun together to help her have successful visits.<br/>\n<br/>\nWhen she was on the tram, were you watching to see what she did to get thrown out? I bet, if she is at all like my son, she may have challenged herself to get thrown out. I like the contract, but if her family is as you allude, she&#39;ll probably just get in trouble for even being on a tramp. <br/>\n<br/>\nOne other approach, if you know any of the mom&#39;s with kids in school, have them talk with her teacher to see what might be up. The girl who was wild here (they moved) was on a very high level of ritalin and on bipolar meds and I got info about her from a teacher friend which helped me interact with her. When I saw K getting way out of bounds, I knew she was choosing to come off her meds without her parents knowing and it made me way more compassionate towards her. Often what K needed was direct adult 1 on 1 interaction, so if we were outside, I would engage her in dialogue and she would talk a mile a minute and all the kids could play without K doing, saying something inappropriate. And we sent just her home sometimes, because my son could not tolerate her when she got out of control.<br/>\n<br/>\nMy thoughts and stories from similar situation here. My son is 9 and I still stay outside and watch him play with anyone. It just is what works for his own safety. It is not an optional thing.<br/>\n<br/>\nMary<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":218449772,"authorName":"zenmomma@comcast.net","from":"zenmomma@...","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] trouble with other kids","postDate":"1148956760","msgId":13786,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA1MzAyMDA2MDIzOS4xMjI0LjQ0N0JCMDU4MDAwNUNFMzkwMDAwMDRDODIyMDY0MjQ0MTMwRTAzMDMwMTAzMDIwQTk2QGNvbWNhc3QubmV0Pg=="},"prevInTopic":13782,"nextInTopic":13796,"prevInTime":13785,"nextInTime":13787,"topicId":13771,"numMessagesInTopic":0,"msgSnippet":"... If it s unhealthy or unsafe for your children to have her around then I would say yes. I d work with her awhile, informing her of the principles in your","messageBody":"<div id=\"ygrps-yiv-1318032773\"><blockquote><span title=\"ireply\">&gt;&gt;So is it that only  Ally has to leave?&gt;&gt;<br/>\n<br/>\n </span></blockquote>If it&#39;s unhealthy or unsafe for your children to have her around then I would say yes. I&#39;d work with her awhile, informing her of the principles in your home. But I&#39;d also explain that if she can&#39;t be there in a safe manner, she&#39;ll have to go home.<br/>\n<br/>\n--<br/>\n~Mary<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://zenmommasgarden.blogspot.com/\">http://zenmommasgarden.blogspot.com/</a><br/>\n<br/>\n&quot;The miracle is not to walk on water. The miracle is to walk on the<br/>\ngreen earth, dwelling deeply in the present moment and feeling truly<br/>\nalive.&quot;<br/>\n                                   ~Thich Nhat Hanh<br/>\n<br/>\n -------------- Original message ----------------------<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Leslie530@...\">Leslie530@...</a></div>","specialLinks":[]},{"userId":140885507,"authorName":"Kathleen Gehrke","from":"&quot;Kathleen Gehrke&quot; &lt;gehrkes@...&gt;","profile":"gehrkes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: trouble with other kids","postDate":"1148956306","msgId":13782,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1Z2FxaSs5N3F2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ1ZC4yMTRhMjQ3LjMxYWQwMTNiQGFvbC5jb20+"},"prevInTopic":13779,"nextInTopic":13786,"prevInTime":13781,"nextInTime":13783,"topicId":13771,"numMessagesInTopic":0,"msgSnippet":"This is such an interesting thread. I have been the neighborhood house. And we have especially attracted wilder kids at our house. Perhaps because we are a bit","messageBody":"<div id=\"ygrps-yiv-1786978616\">This is such an interesting thread. <br/>\n<br/>\nI have been the neighborhood house. And we have especially attracted <br/>\nwilder kids at our house. Perhaps because we are a bit wild. <br/>\n<br/>\nI think you need to set boundaries you are comfortable with. Like <br/>\nshe can play for an hour and then direct your family to another <br/>\nactivity for a bit. <br/>\n<br/>\nI always looked at it as a chance to do some good modeling. It may <br/>\nbe the way she chooses to be a better parent. But setting boundaries <br/>\nthat work for you is part of that modelling.<br/>\n<br/>\nAs far as picnic on the cars and dangerous activities be very clear <br/>\nwhy that does not work. One danger, two a dent in the car hood would <br/>\nbe costly. Ask where else would be a fun spot for a picnic. <br/>\n<br/>\n<br/>\nAs far as the trampoline, I would be sure to ask her parents to sign <br/>\na release. I would also be certain to say, if she falls out, or off, <br/>\nthat perhaps she needs to do something else for a time.<br/>\n<br/>\nIt becomes very interesting with an unschooling philosophy to <br/>\ncontinue to model and set boundaries where everyone is safe and we <br/>\nare being respected. I have struggled to not be a dormat while still <br/>\nempowering my kids. It seems the ones who try to take advantage are <br/>\noften their schooled friends. <br/>\n<br/>\nI think the secret area is a great chance for a talk. I would be <br/>\nvery clear in front of all of the kids why you think secrets are not <br/>\na good idea. Also how you want to hear what your kids are doing so <br/>\nyou can help them do what they want to do. Just let her know it is <br/>\nyour job as their mom to help them get done the things that they <br/>\nwant to and to make sure everyone is safe doing it. Then talk about <br/>\nwhat kinds of secrets are fun for you, like birthday secrets or <br/>\nparty secrets. <br/>\n<br/>\nAlso it really is okay for you to say not today. But if all the <br/>\nneighborhood kids are out I see your challenge. Perhaps just <br/>\nchanging the pace and playing for a bit and then loading in the car <br/>\nand going for icecream, or to the mall or park to change to pace for <br/>\nyour kids. <br/>\n<br/>\nThose are all my ideas. Toss them all if they do not apply.<br/>\n<br/>\nKathleen</div>","specialLinks":[]},{"userId":92643757,"authorName":"Leslie530@aol.com","from":"Leslie530@...","profile":"lescather","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: trouble with other kids","postDate":"1148954427","msgId":13779,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1ZC4yMTRhMjQ3LjMxYWQwMTNiQGFvbC5jb20+"},"prevInTopic":13778,"nextInTopic":13782,"prevInTime":13778,"nextInTime":13780,"topicId":13771,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/29/2006 9:03:02 P.M. Eastern Daylight Time, trektheory@yahoo.com writes: Do your  kids really want to play with her?  Seriously, they may","messageBody":"<div id=\"ygrps-yiv-395424381\">In a message dated 5/29/2006 9:03:02 P.M. Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:trektheory@...\">trektheory@...</a> writes:<br/>\n<br/>\nDo your  kids really want to play with her?  Seriously, they may not <br/>\nrealize  they have the option not to.  My son used to be like  that.<br/>\n<br/>\nOtherwise -- logical consequences, part of which is letting her  <br/>\nparents know what is going on.  Or only allowing her over WITH one  <br/>\nof her parents to help supervise.  I suspect that they send her over  <br/>\nto play so that they get unpaid babysitting.  I&#39;ve seen it  before.<br/>\n<br/>\n<br/>\n<br/>\n*********<br/>\n <br/>\nYes, they want to play with her.  Wish they didn&#39;t.<br/>\n <br/>\nNever seen her parents up close, wouldn&#39;t know them if they knocked on my  <br/>\ndoor.<br/>\n <br/>\nAs far as damages, she hasn&#39;t done any damage worth getting the parents  <br/>\ninvolved.  But I&#39;ll definitely keep that in mind.<br/>\n <br/>\nMaybe I should ask the parents for babysitting money. Maybe they&#39;ll  tell her <br/>\nshe can&#39;t play over here anymore!!  Perhaps me and the other mom&#39;s  should <br/>\nsend a note saying that since we are watching her, we want to be  paid for it!<br/>\n <br/>\nAnd you are right, Linda.  The minute I heard that she was saying  &quot;don&#39;t <br/>\ntell your mom&quot;, I got even less trustful of this child!  Good idea  about the <br/>\nsecret thing.<br/>\n <br/>\nThanks, Leslie in SC<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":92643757,"authorName":"Leslie530@aol.com","from":"Leslie530@...","profile":"lescather","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] trouble with other kids","postDate":"1148953884","msgId":13778,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyZC4yYjUwYjU1LjMxYWNmZjFjQGFvbC5jb20+"},"prevInTopic":13777,"nextInTopic":13779,"prevInTime":13777,"nextInTime":13779,"topicId":13771,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/29/2006 6:51:48 P.M. Eastern Daylight Time, zenmomma@comcast.net writes: Have you  talked with the girl s parents? Not in an accusing way,","messageBody":"<div id=\"ygrps-yiv-1532830293\">In a message dated 5/29/2006 6:51:48 P.M. Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:zenmomma@...\">zenmomma@...</a> writes:<br/>\n<br/>\nHave you  talked with the girl&#39;s parents? Not in an accusing way, but just to <br/>\nlet them  know what&#39;s been going on? Would they be open to  that?<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n*************<br/>\n <br/>\nThe parents are borderline neglectful.  Some of the neighbors have  tried to <br/>\nspeak to them and haven&#39;t gotten anywhere.  Plus, there is the  suspect of <br/>\nreally bad parenting and no one wants her to get in trouble.<br/>\n <br/>\n***In any case, I&#39;d talk directly with the girl and spell out the kind of  <br/>\nbehavior that&#39;s okay at your home. If she wants to play there, she has to behave <br/>\n along the guidelines of your family. I&#39;d also be around when she&#39;s there  <br/>\nsupervising until you feel comfortable that she gets what is expected of  <br/>\nher.*********<br/>\n <br/>\nTrue.  I guess my problem here is trying to figure out how to define  <br/>\nappropriate behavior to her.  She seems to have few boundaries, I would  have never <br/>\ndreamed how to be proactive about the picnic on the car!  I do  feel like I <br/>\nfollow her around saying &quot;don&#39;t do that&quot;.  She takes everyday  activities and <br/>\nmakes them unsafe.  I have had my trampoline for years, I  have a net and no <br/>\nchild has ever fallen.  She fell off twice in one  day....somehow throwing herself <br/>\nthrough the access flap!!<br/>\n <br/>\nI&#39;m thinking I&#39;ll have to set a time limit on her visits.    Unfortunately, I <br/>\ncannot be outside from 3 to 9 each day!  This is also  difficult as the other <br/>\nneighborhood kids don&#39;t need this type of supervision and  my own kids love <br/>\nbeing with these friends so much!  So is it that only  Ally has to leave?  <br/>\n <br/>\nJoanne, you suggested meeting at a park.  Good idea (which I&#39;ll  remember for <br/>\nthe future) but here the neighborhood kids are all riding  bikes and going <br/>\nfrom house to house to play.  Plus, her parents wouldn&#39;t  take her.<br/>\n <br/>\nA neighbor told me today that she thinks Ally is going to her dad&#39;s house  <br/>\nfor summer break....6 weeks as the kids here are in year round school.   Maybe <br/>\nthat will be enough for some good changes to come!<br/>\n <br/>\nLeslie in SC<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":203677783,"authorName":"trektheory","from":"&quot;trektheory&quot; &lt;trektheory@...&gt;","profile":"trektheory","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: trouble with other kids","postDate":"1148950931","msgId":13777,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1ZzVpaitvMTJsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRhMy4xMzU2YmE3LjMxYWNjYzJiQGFvbC5jb20+"},"prevInTopic":13774,"nextInTopic":13778,"prevInTime":13776,"nextInTime":13778,"topicId":13771,"numMessagesInTopic":0,"msgSnippet":"Do your kids really want to play with her?  Seriously, they may not realize they have the option not to.  My son used to be like that. Otherwise -- logical","messageBody":"<div id=\"ygrps-yiv-1276990722\">Do your kids really want to play with her?  Seriously, they may not <br/>\nrealize they have the option not to.  My son used to be like that.<br/>\n<br/>\nOtherwise -- logical consequences, part of which is letting her <br/>\nparents know what is going on.  Or only allowing her over WITH one <br/>\nof her parents to help supervise.  I suspect that they send her over <br/>\nto play so that they get unpaid babysitting.  I&#39;ve seen it before.<br/>\n<br/>\nIf she damages your car -- might not the parents want to know, since <br/>\nif it was my child (and I can&#39;t imagine him doing destructive things <br/>\nintentionally), I would want to know and to make reparations -- and <br/>\nhave him work it out.<br/>\n<br/>\nBTW, the fact that she told your kids not to tell you something is a <br/>\nhuge red flag.  One thing I read somewhere that I thought was a <br/>\nreally neat way of discussing secrets -- there is no such thing as a <br/>\nsecret you can&#39;t tell anyone.  If it is a surprise for Mom, then you <br/>\ncan share it with Dad or Grandma or some such.  (I know, it veered a <br/>\nbit off the topic, but it reminded me of that, and it is such a <br/>\nreally good way to help them understand the difference between good <br/>\nsecrets and &quot;don&#39;t tell&quot;.<br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":185550057,"authorName":"Joanne","from":"&quot;Joanne&quot; &lt;billyandjoanne@...&gt;","profile":"billyandjoanne","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: trouble with other kids","postDate":"1148944766","msgId":13774,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1ZnZodSthZ2VnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRhMy4xMzU2YmE3LjMxYWNjYzJiQGFvbC5jb20+"},"prevInTopic":13772,"nextInTopic":13777,"prevInTime":13773,"nextInTime":13775,"topicId":13771,"numMessagesInTopic":0,"msgSnippet":"I don t know if this helps but when my kids have friends that are kinda out of control in my house, we get together at a park. That way they get to hang out","messageBody":"<div id=\"ygrps-yiv-1024930174\">I don&#39;t know if this helps but when my kids have friends that are <br/>\nkinda out of control in my house, we get together at a park. That <br/>\nway they get to hang out and my house is not trashed. <br/>\n<br/>\n~ Joanne ~<br/>\nMom to Jacqueline (7), Shawna (10) & Cimion (13)<br/>\nAdopted into our hearts October 30, 2003<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://anunschoolinglife.blogspot.com/\">http://anunschoolinglife.blogspot.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://foreverparents.com\">http://foreverparents.com</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Leslie530@... wrote:<br/>\n&gt;<br/>\n&gt; I seem to be a magnet for the kids that cause chaos.  Right now, <br/>\nthere  is a <br/>\n&gt; neighborhood girl named Ally, 8,  that always seems to cause  <br/>\nproblems.  It <br/>\n&gt; isn&#39;t that she is obviously a problem, but the problems tend  to <br/>\ncome up when <br/>\n&gt; she is around.  I guess you could say she is an instigator,  she <br/>\ndoes not <br/>\n&gt; share.....at all (I&#39;m not kidding), and she will always do  <br/>\nsomething I have just <br/>\n&gt; asked her not to do the moment my back is turned.   She tells my 5 <br/>\nyear old <br/>\n&gt; constantly to &quot;not tell her mommy.&quot;  She has  scratched my car, <br/>\nbroken various <br/>\n&gt; toys and items like fishing poles and plays  very rough games.<br/>\n&gt;  <br/>\n&gt; So far my strategy has to been to not let them play unless I am <br/>\noutside  (she <br/>\n&gt; is no longer allowed in the house as she destroyed it the two <br/>\ntimes she was  <br/>\n&gt; in).  This works OK except she is outside from the minute she is <br/>\nhome from  <br/>\n&gt; school until dark.  She has pretty much been turned away from the <br/>\nother  houses. <br/>\n&gt;  I also thought she was moving this summer, but now I don&#39;t think  <br/>\nshe is.  <br/>\n&gt; So I need a new strategy.<br/>\n&gt;  <br/>\n&gt; I&#39;ve tried to enlist my kid&#39;s help, but they say they just tend to <br/>\nforget  <br/>\n&gt; what is appropriate behavior when she is around.  For instance, my <br/>\ndaughter  <br/>\n&gt; would never eat a wild berry without asking, yet Ally made her eat <br/>\none by  <br/>\n&gt; pestering her until she did it.  My kids would never climb on top <br/>\nof a car  to have <br/>\n&gt; a picnic, yet that is where I found them today.<br/>\n&gt;  <br/>\n&gt; I don&#39;t have these issues with the other neighbor kids.   Any  <br/>\nadvise on how <br/>\n&gt; to keep our happy unschooling family safe from this girl?<br/>\n&gt;  <br/>\n&gt; Thanks, Leslie in SC<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":218449772,"authorName":"zenmomma@comcast.net","from":"zenmomma@...","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] trouble with other kids","postDate":"1148942117","msgId":13772,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA1MjkyMDA2MjIzNS4xODMwLjQ0N0I3NzI1MDAwODZDRDkwMDAwMDcyNjIyMDA3MzQwNzYwRTAzMDMwMTAzMDIwQTk2QGNvbWNhc3QubmV0Pg=="},"prevInTopic":13771,"nextInTopic":13774,"prevInTime":13771,"nextInTime":13773,"topicId":13771,"numMessagesInTopic":0,"msgSnippet":"... Have you talked with the girl s parents? Not in an accusing way, but just to let them know what s been going on? Would they be open to that? In any case,","messageBody":"<div id=\"ygrps-yiv-1192361013\"><blockquote><span title=\"ireply\">&gt;&gt;Any  advise on how to keep our happy unschooling family safe from this girl?&gt;&gt;<br/>\n<br/>\n </span></blockquote>Have you talked with the girl&#39;s parents? Not in an accusing way, but just to let them know what&#39;s been going on? Would they be open to that?<br/>\n<br/>\nIn any case, I&#39;d talk directly with the girl and spell out the kind of behavior that&#39;s okay at your home. If she wants to play there, she has to behave along the guidelines of your family. I&#39;d also be around when she&#39;s there supervising until you feel comfortable that she gets what is expected of her.<br/>\n<br/>\n--<br/>\n~Mary<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://zenmommasgarden.blogspot.com/\">http://zenmommasgarden.blogspot.com/</a><br/>\n<br/>\n&quot;The miracle is not to walk on water. The miracle is to walk on the<br/>\ngreen earth, dwelling deeply in the present moment and feeling truly<br/>\nalive.&quot;<br/>\n                                   ~Thich Nhat Hanh<br/>\n<br/>\n -------------- Original message ----------------------<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Leslie530@...\">Leslie530@...</a></div>","specialLinks":[]},{"userId":92643757,"authorName":"Leslie530@aol.com","from":"Leslie530@...","profile":"lescather","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"trouble with other kids","postDate":"1148940843","msgId":13771,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRhMy4xMzU2YmE3LjMxYWNjYzJiQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":13772,"prevInTime":13770,"nextInTime":13772,"topicId":13771,"numMessagesInTopic":0,"msgSnippet":"I seem to be a magnet for the kids that cause chaos.  Right now, there  is a neighborhood girl named Ally, 8,  that always seems to cause  problems.  It isn t","messageBody":"<div id=\"ygrps-yiv-59835563\">I seem to be a magnet for the kids that cause chaos.  Right now, there  is a <br/>\nneighborhood girl named Ally, 8,  that always seems to cause  problems.  It <br/>\nisn&#39;t that she is obviously a problem, but the problems tend  to come up when <br/>\nshe is around.  I guess you could say she is an instigator,  she does not <br/>\nshare.....at all (I&#39;m not kidding), and she will always do  something I have just <br/>\nasked her not to do the moment my back is turned.   She tells my 5 year old <br/>\nconstantly to &quot;not tell her mommy.&quot;  She has  scratched my car, broken various <br/>\ntoys and items like fishing poles and plays  very rough games.<br/>\n <br/>\nSo far my strategy has to been to not let them play unless I am outside  (she <br/>\nis no longer allowed in the house as she destroyed it the two times she was  <br/>\nin).  This works OK except she is outside from the minute she is home from  <br/>\nschool until dark.  She has pretty much been turned away from the other  houses. <br/>\n I also thought she was moving this summer, but now I don&#39;t think  she is.  <br/>\nSo I need a new strategy.<br/>\n <br/>\nI&#39;ve tried to enlist my kid&#39;s help, but they say they just tend to forget  <br/>\nwhat is appropriate behavior when she is around.  For instance, my daughter  <br/>\nwould never eat a wild berry without asking, yet Ally made her eat one by  <br/>\npestering her until she did it.  My kids would never climb on top of a car  to have <br/>\na picnic, yet that is where I found them today.<br/>\n <br/>\nI don&#39;t have these issues with the other neighbor kids.   Any  advise on how <br/>\nto keep our happy unschooling family safe from this girl?<br/>\n <br/>\nThanks, Leslie in SC<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":13807,"nextTopicId":13735}}