{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":95682545,"authorName":"Rose","from":"&quot;Rose&quot; &lt;rosejansen@...&gt;","profile":"rosejansen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Hello everyone","postDate":"1182737309","msgId":24682,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1bjgydCtrYXJyQGVHcm91cHMuY29tPg=="},"prevInTopic":2560,"nextInTopic":0,"prevInTime":24681,"nextInTime":24683,"topicId":2435,"numMessagesInTopic":0,"msgSnippet":"I know this is kind of OT from specifically unschooling, but we all read and lots of people like to share what they read so I ve started a google group sharing","messageBody":"<div id=\"ygrps-yiv-490447993\">I know this is kind of OT from specifically unschooling, but we all<br/>\nread and lots of people like to share what they read so I&#39;ve started a<br/>\ngoogle group sharing links to websites about reading and reviews of<br/>\nbooks that members have read. I&#39;ve just started it so I have 0<br/>\nmembers, but if anyone is interested in joining you can check it out here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.google.com/group/book-reader-newsletter?hl=en\">http://groups.google.com/group/book-reader-newsletter?hl=en</a><br/>\n<br/>\nI hope that is the right link anyway.<br/>\n<br/>\nI know I haven&#39;t posted on this board for eons but I have been so busy<br/>\ntrying to get my website off the ground that I just haven&#39;t had time<br/>\nfor anything else! I am also discovering all the wonderful things that<br/>\ngoogle has to offer for FREE! If you have a web-based business and<br/>\nwant to know more about google stuff email me.<br/>\n<br/>\nThanks for looking at my group!<br/>\nRose</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Hello everyone","postDate":"1091747727","msgId":2560,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZkLjMwMjNhNjJkLjJlNDQxOThmQGFvbC5jb20+"},"prevInTopic":2451,"nextInTopic":24682,"prevInTime":2559,"nextInTime":2561,"topicId":2435,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/2/2004 1:49:59 PM Eastern Daylight Time, Stormphoenix@juno.com writes: While I  don t know yet if I intend to offer a structured preschool","messageBody":"<div id=\"ygrps-yiv-1402130538\">In a message dated 8/2/2004 1:49:59 PM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Stormphoenix@...\">Stormphoenix@...</a> writes:<br/>\n<br/>\nWhile I  don&#39;t know yet if I intend to offer a structured preschool<br/>\ncurriculum or  definitely go with unschooling, I&#39;m thinking maybe<br/>\nunschooling will be  best.  I have also been collecting and saving up<br/>\nprojects for my son  (such as when you go to a restaurant, and they give<br/>\nyou a little coloring  or activity booklet... I&#39;ve been holding onto<br/>\nthem).  <br/>\n<br/>\nSo I&#39;m  really interested in learning more about unschooling, and<br/>\nparticularly  sharing ideas on how to nurture a preschooler&#39;s development.<br/>\n<br/>\nFinally,  about us - hubby is in the Air Force and I am a writer.  I  enjoy<br/>\nstaying home with our son, and while I don&#39;t get much free time (our  son<br/>\nis a very attached &quot;need machine&quot;, but we&#39;re working on helping him  grow<br/>\nmore independent, without pushing him), I wouldn&#39;t trade motherhood  for<br/>\nthe world!&lt;&lt;&lt;&lt;<br/>\n <br/>\nHi, Wendy---and welcome!<br/>\n <br/>\nYou&#39;ll find all of us here a tad bit biased! &lt;G&gt; We&#39;ll tell you to  drop the <br/>\ncurriculum ideas and focus on the fun!<br/>\n <br/>\nBelow is sometihing I send to unschooling inquiries that come to me in SC.  <br/>\nI&#39;ve sent it here before. It might help you find some answers.<br/>\n <br/>\n~Kelly<br/>\n <br/>\n   <br/>\nUnschooling Basics<br/>\n<br/>\nUnschooling is trusting the  child to learn what he needs to learn when he<br/>\nneeds to learn it. Unschooling  is also sometimes called &quot;natural learning&quot; <br/>\nand<br/>\n&quot;child-led learning&quot; . But  mostly unschooling is NOT school-at home: we do <br/>\nnot<br/>\ntry to replicate school  in our houses. It&#39;s real living in the real<br/>\nworld---for and with a purpose.  You cannot live and not learn---we&#39;re <br/>\nsurrounded by real opportunities every day  to learn. And it&#39;s REAL learning, not <br/>\nsimulated as in<br/>\nschool. Living is  learning is unschooling is living is learning  is<br/>\nunschooling.....<br/>\n<br/>\nThere are several good books on the inanity and  insanity of schools and on<br/>\nthe marvels of unschooling.<br/>\n<br/>\nThe unschooling  &quot;patron saint&quot; is John Holt. He was a school reformer in the<br/>\n70&#39;s who came to  realize that schools are NOT reformable. His most popular<br/>\nbooks are How  Children Fail, How Children Learn, Teach Your Own, and Learning<br/>\nAll the  Time.<br/>\n<br/>\nJohn Taylor Gatto was a NY city and NY state teacher of the year.  He finally<br/>\nquit and started on the speaking circuit. He seems completely  behind<br/>\nunschooling. His two big books are Dumbing Us Down and The Underground  <br/>\nHistory<br/>\nof American Education.<br/>\n<br/>\nFrank Smith has a great little book  called The Book of Learning and<br/>\nForgetting that shows how little one learns  in and remembers from school. He<br/>\npushes REAL learning---for a  purpose.<br/>\n<br/>\nAlfie Kohn&#39;s Punished by Rewards shows the total inanity of  EXtrinsic<br/>\nmotivation (gold stars, grades, etc.) and the attributes of  INtrinsic<br/>\nmotivation.<br/>\n<br/>\nGrace Llewellyn&#39;s The Teenage Liberation  Handbook (How to Quit School and<br/>\nGet a REAL Education) is the &quot;bible&quot; for  unschoolers. It&#39;s a great read for<br/>\nteens, but parents should read it too. Be  SURE not to skip the &quot;cute little<br/>\nstory&quot; at the beginning. Grace also hosts  the &quot;Not Back To School Camp&quot; in <br/>\nthe early<br/>\nfall for teen unschoolers---a  place to meet other unschoolers and share<br/>\npassions and interests.<br/>\n<br/>\nMary  Griffith has two books, The Homeschooling Handbook and The  Unschooling<br/>\nHandbook. The Homeschooling Handbook has many great ideas for  documenting<br/>\nwhat&#39;s being learned; and, since that is a requirement in SC,  it&#39;s very <br/>\nhelpful.<br/>\nBut The Unschooling Handbook is THE handbook for new  unschoolers. In it she<br/>\ngives real life examples and explanations. VERY  understandable. Convinced my<br/>\nhusband that what I was suggesting made sense!  &lt;g&gt;<br/>\n<br/>\nDavid Albert has two: And the Skylark Sings with Me and  Homeschooling and the<br/>\nVoyage of Self-Discovery. Both are witty---and easy  reads.<br/>\n<br/>\nValerie Fitzenreiter has a brand new book that I highly recommend:  The<br/>\nUnprocessed Child: Living Without School. It&#39;s about unschooling her  <br/>\ndaughter,<br/>\nLaurie. I give it as gifts a LOT!<br/>\n <br/>\nMagazines:<br/>\n <br/>\n&quot;Life Learning Magazine&quot; <br/>\n&quot;Growing Without Schooling&quot;, originally  put out by John Holt. No longer in <br/>\nproduction, but back issues available from  &quot;old&quot; unschoolers and from FUNbooks.<br/>\n<br/>\n<br/>\nWebsites:<br/>\n<br/>\n_www.unschooling.com_ (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com/)\">http://www.unschooling.com/)</a>  is THE website  for <br/>\nunschooling. There are other lists<br/>\nthat &quot;say&quot; they unschool; these are  the radicals who KNOW what they are <br/>\ntalking<br/>\nabout. There are essays and FAQs  which you should definitely read first.<br/>\nAfterwards go to the message boards  and read, read, READ! If you have <br/>\nquestions<br/>\nafter reading for a few weeks,  then post---but most things have been <br/>\nexplained<br/>\nbefore, so if you read,  you&#39;ll run across the answers to most of your<br/>\nquestions.<br/>\n<br/>\n<br/>\nThe posters to pay attention to are Sandra Dodd,  Joyce Fetteroll, Pam<br/>\nSorooshian, Anne Ohman, Lyle, and Mary Gold. There are  other wonderful <br/>\nposters, but<br/>\nthese are all radical unschoolers who all have  great ways of expressing <br/>\nthemselves and getting to the nitty gritty of  unschooling. They will all be at the<br/>\nconference in August.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:_UnschoolingDiscussion@yahoogroups.com\">_UnschoolingDiscussion@yahoogroups.com</a>_ <br/>\n(mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>)  is  a great e-list if you prefer your messages in mail form, but <br/>\nthe traffic is  HIGH. 200-400/day on the Discussion list. Unless you&#39;re hard <br/>\ncore, or just  prefer your lists this way, I&#39;d recommend the message boards.<br/>\n <br/>\nThere is also <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:_UnschoolingBasics@yahoogroups.com\">_UnschoolingBasics@yahoogroups.com</a>_ <br/>\n(mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingBasics@yahoogroups.com\">UnschoolingBasics@yahoogroups.com</a>) .  For beginners.<br/>\n<br/>\n_www.SchoolsOutSupport.org_ (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.schoolsoutsupport.org/)\">http://www.schoolsoutsupport.org/)</a>  is the SC  <br/>\nunschooling support group. Membership is<br/>\nfree. It has a message board and  info about laws and local groups. It hosts<br/>\nthe unschooling conference in  August.<br/>\n<br/>\nSandra Dodd is a radical unschooler of three children, 16, 14,  & 12 (I<br/>\nthink). She has her own website that is chocked FULL of essays  and stories <br/>\nabout<br/>\nunschooling. It&#39;s a great place to start. _www.SandraDodd.com/unschooling_ <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com/unschooling)\">http://www.sandradodd.com/unschooling)</a>   She<br/>\nis also the keynote speaker at the August conference.<br/>\n<br/>\nNed  Vare & Luz Shosie have  an<br/>\nalready-graduated-from-college-always-unschooled son. Their website is  full <br/>\nof<br/>\nshort essays on unschooling. They have a<br/>\nnewsletter as well. <br/>\n_<a rel=\"nofollow\" target=\"_blank\" href=\"http://borntoexplore.org/unschool/_\">http://borntoexplore.org/unschool/_</a> (<a rel=\"nofollow\" target=\"_blank\" href=\"http://borntoexplore.org/unschool/)\">http://borntoexplore.org/unschool/)</a> <br/>\n<br/>\nBilly and Nancy Greer own FUN-books---a mail-order catalogue for  unschoolish<br/>\nbooks and games. _www.FUN-Books.com_ (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.fun-books.com/)\">http://www.fun-books.com/)</a>     <br/>\n<br/>\n<br/>\nAnd the conference: Here&#39;s the flyer:<br/>\n<br/>\nSchool&#39;s Out Support&#39;s  Live & Learn Unschooling Conference<br/>\nAugust 22-24 in Columbia, SC at the  Holiday Inn-Coliseum.<br/>\n <br/>\n&lt;&lt;&lt;&lt;THIS YEAR IN PEABODY, MA AUGUST 27-29.  2004. Go To <br/>\n_www.LiveandLearnConference.org_ (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.liveandlearnconference.org/)\">http://www.liveandlearnconference.org/)</a>   &lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nThis conference is a must attend!  Meet other families on the same journey,<br/>\nlisten to inspiring speakers, and  discover the art of unschooling in <br/>\nbeautiful<br/>\ndowntown Columbia, SC. This is a  non-age-discriminatory conference: anyone <br/>\ncan<br/>\nparticipate in any Funshop or  Presentation. Bring the whole family for a<br/>\njoy-filled  weekend!<br/>\n<br/>\nSchool&#39;s Out Support (SOS) is a volunteer-driven, statewide  organization<br/>\nwhose mission is to support and promote unschooling, provide  information,<br/>\nmonitor and influence legislation, offer opportunities for  families to get <br/>\ntogether,<br/>\nand empower families to make the choices that  respect the rights, needs and<br/>\naspirations of their children. SOS welcomes  anyone with an interest in<br/>\nunschooling.<br/>\n<br/>\nSince its inception in April  2001, SOS has supported families that have made<br/>\nthe decision to unschool as  they face difficult questions and challenges.<br/>\nThese families may wonder about  socialization, the legal issues surrounding<br/>\nunschooling, accountability  associations, or integration of John Holt&#39;s<br/>\neducational philosophy into their  everyday lives. Some families may doubt <br/>\ntheir abilities, feel confused and ask  themselves, &quot;Can I really do this?&quot;. SOS <br/>\nencourages<br/>\nparents to trust  themselves and their children to make good decisions and<br/>\nempowers them to  find the support and information they need.<br/>\n<br/>\nOur Presenters<br/>\nFor our  Keynote presenter we are very fortunate to have the popular<br/>\ncontributor to  Unschooling.com message boards, its e-list, AlwaysLearning, <br/>\nand<br/>\nregular  columnist in HEM---unschooling guru, Sandra Dodd. A former middle  <br/>\nschool<br/>\nteacher, Sandra has talked countless families into running away from  school <br/>\nand<br/>\njumping into learning for fun. Her motto: &quot;Everything  Counts!&quot;<br/>\n<br/>\nWe&#39;re also delighted to have Anne Ohman, from the  Unschooling.com message<br/>\nboards, back for a return engagement. She &quot;stole the  show&quot; last year with her<br/>\ndebut and is now in demand at conferences all over  the country. AnneO&#39;s<br/>\npassionate, gentle approach to life and learning  continues to inspire <br/>\nfamilies<br/>\ndaily.<br/>\n<br/>\nPam Sorooshian is well known in  &quot;all the unschooling<br/>\ncircles&quot;---Unschooling.com&#39;s message boards, the  unschoolingdotcom e-list,<br/>\nAlwaysLearning, NHEN, and<br/>\nthe California boards.  When she&#39;s not teaching college level economics and<br/>\nstatistics, Pam&#39;s an  unschooling mom of three teenagers: she&#39;s &quot;been there, <br/>\ndone<br/>\n<br/>\nthat&quot;---and  will surely have a few answers for you!<br/>\n<br/>\nMary Gold is better known as  &quot;Zenmomma&quot;--and you can find her wherever<br/>\nunschooling is a topic! Mary  &quot;preaches&quot; peace and trust and joy---and the <br/>\npure<br/>\ndelight of unschooling her  children. Her encouraging words are music to a<br/>\nstressed<br/>\nparent&#39;s  ears---and she always leaves you knowing that &quot;Life is good!&quot;<br/>\n<br/>\nJim Weiss&#39;  storytelling has captivated and delighted both adults and children<br/>\nwith his  original stories and retellings of classics. To hear him tell a<br/>\nstory is to  be swept into another world. Jim&#39;s award-winning tapes are <br/>\nfavorites<br/>\n<br/>\nin  many homes---including ours!<br/>\n<br/>\nFor more information, contact Kelly Lovejoy  @ (803) 776 4849 or visit our<br/>\nwebsite- <br/>\n_<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.schoolsoutsupport.org/2003conference.html_\">http://www.schoolsoutsupport.org/2003conference.html_</a> <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.schoolsoutsupport.org/2003conference.html)\">http://www.schoolsoutsupport.org/2003conference.html)</a> <br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n--------------------------------------------------<br/>\nYou  may also all me anytime to ask questions or discuss concerns. I truly<br/>\nbelieve  that school is harmful---physically, emotionally, intellectually,  <br/>\nand<br/>\nspiritually. It&#39;s a bad place to spend a childhood.<br/>\n<br/>\n~Kelly Lovejoy  (803) 776-4849<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:_kbcdlovejo@...\">_kbcdlovejo@...</a>_ (mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a>) <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2226881,"authorName":"Wendy L Hawksley","from":"Wendy L Hawksley &lt;Stormphoenix@...&gt;","profile":"stormphenx","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Hello everyone","postDate":"1091554699","msgId":2435,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODAzLjEzMzkwOS4yNDI4LjcuU3Rvcm1waG9lbml4QGp1bm8uY29tPg=="},"prevInTopic":0,"nextInTopic":2436,"prevInTime":2434,"nextInTime":2436,"topicId":2435,"numMessagesInTopic":0,"msgSnippet":"Hello Everyone, My name is Wendy and I am seeking to learn more about unschooling.  We have a son who is 20 months old, and I have begun gathering information ","messageBody":"<div id=\"ygrps-yiv-1616896434\">Hello Everyone,<br/>\n<br/>\nMy name is Wendy and I am seeking to learn more about unschooling.  We<br/>\nhave a son who is 20 months old, and I have begun gathering information<br/>\nabout homeschooling.  Unschooling, in particular, seems like something<br/>\nthat would fit in great with our family!<br/>\n<br/>\nI try to read to our son often and I am always looking for ways to<br/>\nenhance his experience of the world around him.  I am reading a book by<br/>\nBaby Einstein called &quot;Great Minds Start Little&quot;, and it offers some<br/>\nwonderful ideas, which I intend to implement in our home.  I think<br/>\nlearning starts, well, when they are babies!  After all, they are<br/>\nabsorbing everything.<br/>\n<br/>\nWhile I don&#39;t know yet if I intend to offer a structured preschool<br/>\ncurriculum or definitely go with unschooling, I&#39;m thinking maybe<br/>\nunschooling will be best.  I have also been collecting and saving up<br/>\nprojects for my son (such as when you go to a restaurant, and they give<br/>\nyou a little coloring or activity booklet... I&#39;ve been holding onto<br/>\nthem).  <br/>\n<br/>\nSo I&#39;m really interested in learning more about unschooling, and<br/>\nparticularly sharing ideas on how to nurture a preschooler&#39;s development.<br/>\n<br/>\nFinally, about us - hubby is in the Air Force and I am a writer.  I enjoy<br/>\nstaying home with our son, and while I don&#39;t get much free time (our son<br/>\nis a very attached &quot;need machine&quot;, but we&#39;re working on helping him grow<br/>\nmore independent, without pushing him), I wouldn&#39;t trade motherhood for<br/>\nthe world!<br/>\n<br/>\nLooking forward to conversation,<br/>\nWendy Hawksley<br/>\nDelaware<br/>\n<br/>\n________________________________________________________________<br/>\nThe best thing to hit the Internet in years - Juno SpeedBand!<br/>\nSurf the Web up to FIVE TIMES FASTER!<br/>\nOnly $14.95/ month - visit www.juno.com to sign up today!</div>","specialLinks":[]},{"userId":100027905,"authorName":"TreeGoddess","from":"TreeGoddess &lt;treegoddess@...&gt;","profile":"odrade7","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Hello everyone","postDate":"1091534029","msgId":2451,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM4NDJBN0JFLUU1NDMtMTFEOC1CQjcxLTAwMDM5M0E1REE2NkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDIwMDQwODAzLjEzMzkwOS4yNDI4LjcuU3Rvcm1waG9lbml4QGp1bm8uY29tPg==","referencesHeader":"PDIwMDQwODAzLjEzMzkwOS4yNDI4LjcuU3Rvcm1waG9lbml4QGp1bm8uY29tPg=="},"prevInTopic":2441,"nextInTopic":2560,"prevInTime":2450,"nextInTime":2452,"topicId":2435,"numMessagesInTopic":0,"msgSnippet":"... Hi, Wendy! Welcome to the list.  I m Tracy and my DH and I have two children: Aydn is 5yo and Fiona is 3yo.  When Aydn was a little guy we bought all the","messageBody":"<div id=\"ygrps-yiv-1124164304\">On Aug 3, 2004, at 1:38 PM, Wendy L Hawksley wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; [ I enjoy staying home with our son, and while I don&#39;t get much free <br/>\n&gt; time (our son<br/>\n&gt; is a very attached &quot;need machine&quot;, but we&#39;re working on helping him <br/>\n&gt; grow more<br/>\n&gt; independent, without pushing him)<br/>\n<br/>\n </span></blockquote>Hi, Wendy!<br/>\n<br/>\nWelcome to the list.  I&#39;m Tracy and my DH and I have two children:  <br/>\nAydn is 5yo and Fiona is 3yo.  When Aydn was a little guy we bought all <br/>\nthe Baby Einstein videos/DVDs and some of the toys.  It was fun for ME <br/>\nto gather them and imagine all the fun and learning that we&#39;d have <br/>\ntogether &quot;some day&quot;.  In hindsight, the reality was that we could have <br/>\nfun every day and that he&#39;d learn naturally just by living.  I didn&#39;t <br/>\nneed to have an agenda for him at all!  LOL  We still have all the <br/>\nstuff but the kids aren&#39;t really interested in it at all.  I hesitate <br/>\nto pass it along to friends with younger kids in case they want to also <br/>\ndo what I thought I *should* do with them.  Did you follow that <br/>\nsentence?  hehehe<br/>\n<br/>\nAnyway, the quote from you (above) I wanted to address.  &quot;we&#39;re working <br/>\non helping him grow<br/>\nmore independent, without pushing him&quot;  He&#39;s only 20 months, right?  <br/>\nHe&#39;s *supposed to be* dependent on you now.  He&#39;s got YEARS to learn <br/>\nhow to be INdependent -- right around the time that you want him to <br/>\nstay little and be your little boy is the time he&#39;ll be striking out on <br/>\nhis own more often.  Savor the cuddles, and lap time, and nursing, and <br/>\nkisses, and try not to be too eager for him to not need you as much.  <br/>\nMy eldest child is only just 5 and every time he outgrows a shirt or a <br/>\nshoe I get a little melancholy and sentimental and wish there was a <br/>\nswitch I could throw that would keep him from getting any bigger.  I <br/>\nwant to  s t r e t c h  out my time to really &quot;mother&quot; him.  KWIM?  I <br/>\ndon&#39;t want it to end!  ;)<br/>\n<br/>\nHug your little boy and just enjoy him as he is today ... don&#39;t spend <br/>\ntoo much time planning for a day that may not even pan out the way you <br/>\nenvisioned.<br/>\n<br/>\nWarmly,<br/>\n-Tracy-</div>","specialLinks":[]},{"userId":140240070,"authorName":"eriksmama2001","from":"&quot;eriksmama2001&quot; &lt;scubamama@...&gt;","profile":"eriksmama2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"&quot;preschool homeschool&quot; was RE: Hello everyone","postDate":"1091492612","msgId":2441,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNlbWx1NSs1YWNvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDQwODAzLjEzMzkwOS4yNDI4LjcuU3Rvcm1waG9lbml4QGp1bm8uY29tPg=="},"prevInTopic":2437,"nextInTopic":2451,"prevInTime":2440,"nextInTime":2442,"topicId":2435,"numMessagesInTopic":0,"msgSnippet":"This has been such a resource for me. I see that it is copyrighted, I hope that by sharing it I haven t breached anyone s work by sharing it here. Preschool","messageBody":"<div id=\"ygrps-yiv-29136827\">This has been such a resource for me. I see that it is copyrighted, I <br/>\nhope that by sharing it I haven&#39;t breached anyone&#39;s work by sharing <br/>\nit here. <br/>\n <br/>\nPreschool Homeschooling<br/>\nBeverly S. Krueger <br/>\nEager to begin assisting their children down the path of life many <br/>\nyoung parents schedule play dates, attend Mom and baby swim classes, <br/>\nand busily start planning all the necessary activities to give their <br/>\nbaby a head start in life. At this early date they haven&#39;t yet <br/>\nrealized they are trying to speed their way to the moment when that <br/>\nbeloved child leaves their door for a life on their own. Yes, that&#39;s <br/>\na moment all parents want their children to achieve fully prepared <br/>\nfor the vagaries of life, but the closer you get to that moment the <br/>\nmore time you wish you had. By the time your child is sixteen, you <br/>\nfind them running willy nilly towards that goal themselves just when <br/>\nyou&#39;re ready to relax and take it a little slower. <br/>\n<br/>\nWith children ages five through sixteen, I&#39;ve been through the new <br/>\nparent &quot;over achieve for my child&quot; period and now face the &quot;my baby <br/>\nis going to be leaving soon&quot; period. It&#39;s mingled heart ache and joy. <br/>\nThe way I deal with my younger children is also greatly affected by <br/>\nthis new life stage. I&#39;ve started slowing down with them already. <br/>\nRather than push them on to new achievements ahead of the pack, I&#39;m <br/>\ngiving them more time to be the age they are. Rachel needs plenty of <br/>\ntime to play house, sing to her dollies, color, dress up, and create <br/>\nplay dough buffets. She&#39;ll give up all these activities soon enough, <br/>\nbut the timing will be her own, not because I have pushed her into <br/>\nmore &quot;educational&quot; activities.<br/>\n<br/>\nThe concept &quot;educational&quot; activity is in itself restricting. <br/>\nSomewhere along the way we have lost the understanding that the <br/>\nactivities commonly known as &quot;school&quot; are only one form of <br/>\neducational activity. Learning to read, write, and do arithmetic have <br/>\nbeen elevated to such a high plane that the other forms of learning <br/>\nare pushed to the side as unworthy of much dedicated time. In the <br/>\npast preschoolers were not expected to learn to read, and yet today I <br/>\nreceive many requests for help in choosing a reading program for <br/>\nthree or four-year-olds. I&#39;m assured that the child is more than <br/>\nready to take this next step in his educational program. That may <br/>\nwell be, but my response is so what? Assuredly you can start a <br/>\nreading program that requires only 10 minutes a day, and that really <br/>\nisn&#39;t a great chunk of time to whittle out of the child&#39;s daily <br/>\nschedule. But most people that insist on starting their preschooler <br/>\nreading are also working on math, doing science experiments, and <br/>\nfinding all kinds of ways to jumpstart academics. All <br/>\nthis &quot;educational&quot; activity pushes aside the things that a child <br/>\nshould be doing, playing, exploring and discovering life on their own.<br/>\n<br/>\nMost parents would be horrified to realize that they may be <br/>\nunintentionally quashing their child&#39;s creative abilities by <br/>\nconstantly employing them in directed activities. They teach them to <br/>\ncolor in the lines rather than give them art supplies to use as they <br/>\ndecide. Rather than letting them discover ants on their own, they <br/>\ntake them outside for a complete lecture on ants. By the age of two, <br/>\nthey schedule regular dates for their children to play with those <br/>\ntheir own age ignoring the fact that two-year-olds don&#39;t yet play <br/>\nsocially. They tie up all their time in planned activities and events <br/>\nnever allowing children the freedom to discover on their own. <br/>\nCreativity needs room to experiment. If children have no room to do <br/>\ntheir own thing, they will gradually stop thinking in creative ways <br/>\nand look only for the &quot;correct&quot; or &quot;proper&quot; way to do something. They <br/>\nwill turn to their authority, the parent, to tell them what they <br/>\nshould do. Later in life they will turn to other authorities.<br/>\n<br/>\nAdmittedly the over-achieving parent I&#39;ve described is not the norm. <br/>\nBut most of us would recognize those traits in ourselves to one <br/>\ndegree or another. If you&#39;re naturally given to a relaxed mode of <br/>\nlife, don&#39;t pat yourself on the back too hard. Everyone has flaws, <br/>\nit&#39;s just the organizers in life that fall prey to this need to <br/>\norganize their children&#39;s lives to the nth degree. <br/>\n<br/>\nSo what should an over-achieving parent do besides sitting on their <br/>\nhands and screeching occasionally? Organize their children&#39;s things. <br/>\nNo, I don&#39;t mean sort out their closets. I mean actively plan what <br/>\nthings you will place in your child&#39;s environment. Surround your <br/>\nchild with the tools for creative play: blocks, puzzles, dress up <br/>\nclothes, dolls, cars, trucks, toy dishes, stoves, sinks, and brooms. <br/>\nBe discerning in the toys you select. Are they toys that stimulate <br/>\nimaginative play? Avoid electronic toys. Have bins of art supplies, <br/>\nscience supplies, and craft supplies that children can access and use <br/>\nas they desire. If you have room, provide a stack of planks, bricks <br/>\nand boxes for outdoor construction projects. Let your children raid <br/>\nthe linen closet to create their own tents with the dining room <br/>\ntable. Help them string a clothesline to hang curtains for stage <br/>\nproductions. Provide plenty of music tapes and an easy to use tape <br/>\nrecorder. Children will use these tools to build on daily experiences <br/>\nand those special occasions when they make a visit to the zoo, <br/>\nmuseum, or children&#39;s show. The day after their big sister&#39;s car wash <br/>\nyou may find them outside pretending to run their own car wash for <br/>\nall the tricycles in the neighborhood. A visit to the zoo might spark <br/>\nthe creation of their own jungle room using their stuffed animals.<br/>\n<br/>\nAllow children plenty of time to do their own thing. Turn them loose <br/>\nin the back yard to dig, poke and pry keeping an eye on them from a <br/>\ndistance. I promise when some momentous discovery is made they will <br/>\ncome charging back to you to share it. As much fun as it is spending <br/>\ntime doing things with your children, it is equally fun to watch them <br/>\nbusy at their own tasks. Surreptitiously observing your children will <br/>\ngive you priceless memories of inquisitive faces determining that <br/>\nwater runs down hill if you dump your pail out on a sloping yard. <br/>\nThat hands on experience and many others will later confirm the <br/>\nconcept of gravity when they are older.<br/>\n<br/>\nDon&#39;t let what I have said cause you to react too far in the other <br/>\ndirection and avoid doing things with and for your child. Many things <br/>\nthat children learn are learned by observing and following another&#39;s <br/>\nexample. When you&#39;re baking include your children. When you&#39;re <br/>\nfolding laundry let them help. Suggest that your daughter get out her <br/>\nironing board and iron while you iron, too. Give your son a patch of <br/>\nground to grow his own flowers from seed, showing him how to cover <br/>\neach seed with just the right amount of soil and then gently sprinkle <br/>\nthem with water. The daily flow of life in a household is another of <br/>\nthe &quot;educational&quot; arenas that is forgotten in today&#39;s society. <br/>\nPlaying house is one of a preschool child&#39;s delights. It gives them <br/>\nthe opportunity to practice all the tasks they have seen their <br/>\nparents and older siblings do each day. Although they may not <br/>\naccomplish a task as perfectly as you desire, their unabashed <br/>\nenthusiasm for housework will never be greater than at this age. <br/>\nLetting them help you will teach them far more than you imagine. <br/>\nThey&#39;ll be improving their large motor skills, learn to discern <br/>\nsubtle differences (this window is clean, this window has streaks), <br/>\nand learn to order tasks properly. All these things will help them <br/>\nlater when they do finally learn to read.<br/>\n<br/>\nDon&#39;t rush your child through their childhood because you think you <br/>\nare giving them a head start on achieving great things. Academics <br/>\nhave their place in a child&#39;s education, but they shouldn&#39;t be <br/>\nallowed to force out the other important learning that a child needs <br/>\nto do. As parents we want so much for our children that sometimes we <br/>\npush them when it&#39;s better to let them grow at their own pace. The <br/>\nkey is to relax. Relax, that&#39;s a word that you will hear throughout <br/>\nyour homeschooling career. Even after many years of homeschooling and <br/>\nparenting I still find myself needing to be reminded to relax <br/>\noccasionally. It&#39;s hard to imagine now at the outset of your journey <br/>\njust how much you will miss the times when your children came <br/>\ntrouping out in oversized shoes and clothes to invite you to a tea <br/>\nparty in their room. Revel in this time. The future holds equally <br/>\nwonderful treasures, but they will be different treasures.<br/>\n<br/>\n&lt;&gt;Great Stuff for Kids <br/>\nGreen Mountain Blocks Hardwood blocks that come in various shapes. <br/>\nSold in sets for toddlers on up. Sets sell from $25.50 to $68.40. A <br/>\nsuper set is available with 128 blocks and 12 geometric shapes for <br/>\n$168.80. A four block sample is available for $2 shipping and <br/>\nhandling. Green Mountain Blocks, PO Box 146, Danville, VT 05828. <br/>\nPhone: 802-748-6724.<br/>\n<br/>\nBrock Magiscope Technically not a preschool item, but due to cost <br/>\nsomething you should consider saving for. This is the most durable <br/>\nand usable microscope available for children. This scope is <br/>\nconstructed of solid aluminum alloy and tempered brass, with no <br/>\nexposed threads, knobs, gears, or screws. Focusing is simple brass on <br/>\nbrass friction, requiring no grease or maintenance. The entire <br/>\nmicroscope has one moving part. It requires no lamps, cords or <br/>\nbatteries. It&#39;s not something you&#39;ll hand your two year old, but a <br/>\nfour year old could spend a lot of time using it after proper <br/>\ninstruction. Model #70 with 20x magnification is $159. Brock Optical <br/>\nInc. 1-800-780-9111 <br/>\n<br/>\nScooter boards Rainbow Resource Center sells a 12&#39; square durable <br/>\nplastic scooter board with non-marring wheels. It can be used indoors <br/>\nand out. Our children and many of the neighbor&#39;s children have spent <br/>\nhours playing with these boards. Just $14.50 in blue or yellow. Call <br/>\n888-841-3456 for a catalog.<br/>\n<br/>\nLauri Crepe Puzzles Lauri makes a huge variety of puzzles from very <br/>\nsimple puzzles with just a few pieces to large puzzles with nearly <br/>\n100 pieces. We own six or seven different puzzles including a very <br/>\nsimple flower puzzle to an intricate castle puzzle. These puzzles can <br/>\nbe found at most school supply stores. Timberdoodle carries several <br/>\nof the perception puzzles, a noah&#39;s ark puzzle, the fit-a-state <br/>\npuzzle and two different alphabet puzzles. Smaller puzzles are just <br/>\n$5.50 with larger puzzles costing more. Get a Timberdoodle catalog by <br/>\ncalling 360-426-0672.<br/>\n<br/>\nWorld&#39;s Best Bug Jar This sturdy plastic jar has a lid with air holes <br/>\nand 2x magnifying glass. Flip down the top lens for 4x magnification. <br/>\nGet this bug jar for just $2.95 from Tobin&#39;s Lab. Call 800-522-4776 <br/>\nfor a catalog.<br/>\n<br/>\nGiant Floor Puzzles Frank Schaffer makes some really great floor <br/>\npuzzles from five foot long panorama puzzles to rectangular puzzles <br/>\nwith Biblical themes. Farm Country General Store sells ten different <br/>\npuzzles for just $12.50 each. Call 800-551-FARM for a catalog.<br/>\n<br/>\nArt supplies: Crayons, colored pencils, colored chalk, sidewalk <br/>\nchalk, construction paper, drawing paper, tempera paint, paint <br/>\nbrushes of varied sizes, charcoal pencils, glue, pipe cleaners, craft <br/>\nsticks, tissue paper. <br/>\n<br/>\nScience Supplies: Dishpan, plastic beakers, graduated cylinders, <br/>\nmagnifying glass, compass, magnets, tweezer, paper clips, pennies, <br/>\npaper cups, paper plates, cotton balls, scale, balance, children&#39;s <br/>\nmicroscope, meter stick, yard stick, ruler, modeling clay, straws, <br/>\ntoothpicks, balloons, string, rubber bands, sand paper, and a funnel. <br/>\nItems for this box and the art box can often overlap. Use your <br/>\njudgement on which items you add for different age preschoolers. Make <br/>\nsure they have access to non-messy ways of playing with sand and <br/>\nwater. Tobin&#39;s Lab offers science supplies at good prices. Call 800-<br/>\n522-4776 for a catalog.<br/>\n<br/>\nDress up Box: Old shirts, dresses, skirts, pants, belts, hats, <br/>\ngloves, jewelry, ties, scarves and purses. You can obtain many of <br/>\nthese items from sorting through your own closets. For special items <br/>\nlike gold high heels make the rounds of garage sales one weekend. <br/>\nWhat you might consider unbelievably tacky to wear now might be the <br/>\nhighlight of a dress up box. Old formals and suit jackets can be had <br/>\nvery cheaply at garage sales. <br/>\n<br/>\nCopyright ©1998 Beverly S. Krueger</div>","specialLinks":[]},{"userId":78615010,"authorName":"mamaaj2000","from":"&quot;mamaaj2000&quot; &lt;mamaaj2000@...&gt;","profile":"mamaaj2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Hello everyone","postDate":"1091475969","msgId":2437,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNlbTVtMSs2c2Z0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDQwODAzLjEzMzkwOS4yNDI4LjcuU3Rvcm1waG9lbml4QGp1bm8uY29tPg=="},"prevInTopic":2436,"nextInTopic":2441,"prevInTime":2436,"nextInTime":2438,"topicId":2435,"numMessagesInTopic":0,"msgSnippet":"Hi Wendy. I m AJ, mom to ds, 3.5; dd, 19 mo and another on the way. We re down I-95 from you at Andrews AFB--practically neighbors! Mikey was very verbal, very","messageBody":"<div id=\"ygrps-yiv-1650773108\">Hi Wendy. I&#39;m AJ, mom to ds, 3.5; dd, 19 mo and another on the way. <br/>\nWe&#39;re down I-95 from you at Andrews AFB--practically neighbors!<br/>\n<br/>\nMikey was very verbal, very early so I looked into pre-school <br/>\ncurricula, learning activities, etc. But I couldn&#39;t resist pushing a <br/>\nlittle and he learned to push back and resist it like crazy. I know <br/>\nother people who suggest activities and have kids who are thrilled <br/>\nwith it all, so I don&#39;t think it&#39;s necessary bad, just that you have <br/>\nto watch feeling like it&#39;s important and therefore you need <br/>\nto &#39;encourage&#39; a lot. Kids develop skills at different rates. If you <br/>\nplay with them tons, you see where they are and can feel comfortable <br/>\nthat it&#39;s the right place for them!<br/>\n<br/>\n--aj</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Hello everyone","postDate":"1091472589","msgId":2436,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDIwMDQwODAzLjEzMzkwOS4yNDI4LjcuU3Rvcm1waG9lbml4QGp1bm8uY29tPg=="},"prevInTopic":2435,"nextInTopic":2437,"prevInTime":2435,"nextInTime":2437,"topicId":2435,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-2041768930\">&lt;&lt;&lt;My name is Wendy and I am seeking to learn more about unschooling.  We<br/>\nhave a son who is 20 months old, and I have begun gathering information<br/>\nabout homeschooling.  Unschooling, in particular, seems like something<br/>\nthat would fit in great with our family!&gt;&gt;&gt;<br/>\n<br/>\nHave you been to www.naturalchild.org ? Especially since your baby is so<br/>\nyoung you may enjoy some of these articles.<br/>\n<br/>\n&lt;&lt;&lt;I try to read to our son often and I am always looking for ways to<br/>\nenhance his experience of the world around him.  I am reading a book by<br/>\nBaby Einstein called &quot;Great Minds Start Little&quot;, and it offers some<br/>\nwonderful ideas, which I intend to implement in our home.  I think<br/>\nlearning starts, well, when they are babies!  After all, they are<br/>\nabsorbing everything. [snip]...So I&#39;m really interested in learning more<br/>\nabout unschooling, and particularly sharing ideas on how to nurture a<br/>\npreschooler&#39;s development.&gt;&gt;&gt;<br/>\n<br/>\nJust play with him sitting on the floor with plenty of colorful toys of<br/>\ndifferent shapes, textures and noises. Hang out on the grass outdoors. Let<br/>\nhim walk and follow him around. Keep him safe by putting your soft hand over<br/>\nthe sharp corner or piling the pillows below, rather than making him move<br/>\naway or not letting him climb. <br/>\n<br/>\nBeware of programs pushing early academics. The supposed &quot;advantage&quot; doesn&#39;t<br/>\ngenerally last. <br/>\n<br/>\nFor a broad overview of unschooling working try www.sandradodd.com .<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.732 / Virus Database: 486 - Release Date: 7/29/2004</div>","specialLinks":[]}],"prevTopicId":24681,"nextTopicId":24601}}