{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Why Dumb Toys Make Kids Smarter","postDate":"1254605540","msgId":41711,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhhOGZ0NCszajZsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhhNjdrMCt1ZGYyQGVHcm91cHMuY29tPg=="},"prevInTopic":41708,"nextInTopic":0,"prevInTime":41710,"nextInTime":41712,"topicId":41700,"numMessagesInTopic":0,"msgSnippet":"... ********************* I think its important to point out that in most families there s not much distinction between lying to get out of punishment or","messageBody":"<div id=\"ygrps-yiv-426138496\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;jazminway&quot; &lt;dontcall@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I felt a little conflicted about Why Kids Lie. I think the conclusion was that kids need to learn that lying is not okay before the age of 8 or so- before it becomes a habit<br/>\n </span></blockquote>*********************<br/>\n<br/>\nI think its important to point out that in most families there&#39;s not much distinction between &quot;lying&quot; to get out of punishment or evade a rule, and a young child&#39;s natural disconnect with reality. Young children will say things they Wish were true as though they were, and that&#39;s often interpreted as a lie. Older children will sometimes role play various concepts, too, in such a way that parents can see the situation as &quot;lying&quot; - a child pretending to be hurt, for instance, but taking that beyond a moment to days of limping (or whatever) even though the same child will drop the act periodically, when distracted. Kids play with the boundaries of &quot;truth&quot; and &quot;facts&quot; for the same reasons they play with anything else - its how they learn about the world. <br/>\n<br/>\nPointing out a &quot;lie&quot; that&#39;s an example of a young child&#39;s wishful thinking doesn&#39;t really help that child learn about the nature of truth. The child is expressing his or her own, internal truth, even though it may conflict with a more objective measure of facts. Its a way of putting down a child&#39;s emotional state as irrelevant in the face of grown up sensibilities. <br/>\n<br/>\nSome kids are really invested in their own truths, and will defend them against any and all evidence to the contrary - Morgan was one of those kids! We learned not to debate the nature of reality with her. We found it kinder for the universe itself to contradict her whenever possible, rather than us (obviously we&#39;re not talking about anything dangerous!), since she&#39;d argue to the point of complete meltdown with another person, and only be disappointed in the universe.<br/>\n<br/>\nI&#39;m using past tense because this is something she has mostly outgrown - and she&#39;s just 8. Its a developmental issue.<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Why Dumb Toys Make Kids Smarter","postDate":"1254567732","msgId":41708,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY3QzlCNDMyLTUzN0UtNDMzNC05RTc2LTlFOTZBNDkwODc1RkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGhhNnZkZStmdW9AZUdyb3Vwcy5jb20+","referencesHeader":"PGhhNnZkZStmdW9AZUdyb3Vwcy5jb20+"},"prevInTopic":41706,"nextInTopic":41711,"prevInTime":41707,"nextInTime":41709,"topicId":41700,"numMessagesInTopic":0,"msgSnippet":"... At certain ages some kids will change the truth in their telling to play with the concept. Most of that should be treated as the play that it is, but it","messageBody":"<div id=\"ygrps-yiv-179792816\">On Oct 3, 2009, at 3:44 AM, missalexmissalex wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I personally concluded from that that if you minimize the  <br/>\n&gt; situations in which your child will feel a need to lie/be tempted  <br/>\n&gt; to do something that they&#39;ll feel they have to cover up, then the  <br/>\n&gt; less they&#39;ll get used to lying.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>At certain ages some kids will change the truth in their telling to  <br/>\nplay with the concept. Most of that should be treated as the play  <br/>\nthat it is, but it depends on the context.<br/>\n<br/>\nIt helps to picture your own reaction to what a child tells you in  <br/>\nvarious situations. If what he says will get him a reaction that  <br/>\nmakes him uncomfortable, he will probably ponder whether telling the  <br/>\ntruth or telling at all is a good idea or not.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But on the other hand (err, that third one I wished I had) just  <br/>\n&gt; modeling honesty in various situations seems like it might do.<br/>\n<br/>\n </span></blockquote>I think the opposite of lying isn&#39;t honesty. It&#39;s trustworthiness! I  <br/>\ndon&#39;t know that being truthful will make that big of an impact. It&#39;s  <br/>\nsort of the default. But being trustworthy, that&#39;s huge. If you say  <br/>\nyou&#39;ll do something for your child, carry through with it! Tell them  <br/>\nyou want to be someone they can trust.<br/>\n<br/>\nBe someone they can trust then trust -- part of which is not lying --  <br/>\nwill be important to them.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":118247794,"authorName":"missalexmissalex","from":"&quot;missalexmissalex&quot; &lt;missalexmissalex@...&gt;","profile":"missalexmissalex","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Why Dumb Toys Make Kids Smarter","postDate":"1254555886","msgId":41706,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhhNnZkZStmdW9AZUdyb3Vwcy5jb20+","inReplyToHeader":"PGhhNjdrMCt1ZGYyQGVHcm91cHMuY29tPg=="},"prevInTopic":41705,"nextInTopic":41708,"prevInTime":41705,"nextInTime":41707,"topicId":41700,"numMessagesInTopic":0,"msgSnippet":"... See, that s the weird thing. They said the more kids recognize lying, the more they lie. Plus some 3 yos and most 4 yos will lie in a tempting lab","messageBody":"<div id=\"ygrps-yiv-1414975540\"><blockquote><span title=\"ireply\">&gt; I felt a little conflicted about Why Kids Lie. I think the conclusion was that kids need to learn that lying is not okay before the age of 8 or so- before it becomes a habit, <br/>\n<br/>\n </span></blockquote>See, that&#39;s the weird thing. They said the more kids recognize lying, the more they lie. Plus some 3 yos and most 4 yos will lie in a tempting lab situation. BUT I didn&#39;t see any research showing that kids whose parents talk to them about lying younger, lie less. It was a leap for me. I personally concluded from that that if you minimize the situations in which your child will feel a need to lie/be tempted to do something that they&#39;ll feel they have to cover up, then the less they&#39;ll get used to lying. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;and that parents tend not to deal with lying effectively. I got the feeling he was recommending consequences or something (I left the book at work or I&#39;d double check). <br/>\n<br/>\n </span></blockquote>Well, I hope not, since they talk about how it&#39;s been scientifically shown that the threat of punishment is not an effective deterrant, and that harsh punishment just makes kids better liars. <br/>\n<br/>\nI believe their suggestion was that you make a practice of pointing out when your child has lied and asking them to not do it. The actual word was &quot;censure,&quot; On one hand my tendency might be to just not say anything, but on the other, mentioning something gently doesn&#39;t sound so awful. <br/>\n<br/>\nBut on the other hand (err, that third one I wished I had) just modeling honesty in various situations seems like it might do.<br/>\nI think it&#39;s a really nice goal to be both truthful and kind when possible, and that was a nice reminder to stick to it. :)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What did you think of that chapter? <br/>\n<br/>\n </span></blockquote>Well...I am still processing it, really. With just a 2yo at home--who is Just this month starting to say a number of things that are sort of surprisingly untrue...I&#39;m here more in the here-for-the-advice category.  <br/>\n<br/>\nHe&#39;s a direct quote, referencing one of the tempt-kids-to-cheat experiments:<br/>\n&quot;What really works is to tell the child, &#39;I will not be upset with you if you peeked, and if you tell the truth, I will be really happy.&#39; This is an offer of both immunity and a clear route back to good standing.&quot; <br/>\n<br/>\nMore experienced parents, what do you think? <br/>\n <br/>\nBTW, there&#39;s a bunch of other interesting studies on lying in there too. It&#39;s worth reading. <br/>\n<br/>\nAlex<br/>\nmama to Katya, 2 1/4<br/>\n<br/>\n  <br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;missalexmissalex&quot; &lt;missalexmissalex@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; I just read Nutureshock, the new book Po Bronson wrote with his wife, Ashley Merryman, </span></blockquote></div>","specialLinks":[]},{"userId":111129436,"authorName":"jazminway","from":"&quot;jazminway&quot; &lt;dontcall@...&gt;","profile":"jazminway","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Why Dumb Toys Make Kids Smarter","postDate":"1254531520","msgId":41705,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhhNjdrMCt1ZGYyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhhNXNlbStma2NrQGVHcm91cHMuY29tPg=="},"prevInTopic":41701,"nextInTopic":41706,"prevInTime":41704,"nextInTime":41706,"topicId":41700,"numMessagesInTopic":0,"msgSnippet":"I m reading this book too and really enjoying it. Like you said, it s not an unschooling book, but there are little bits that are certainly applicable. One","messageBody":"<div id=\"ygrps-yiv-776291807\">I&#39;m reading this book too and really enjoying it. Like you said, it&#39;s not an unschooling book, but there are little bits that are certainly applicable. One chapter, broadly summarized, is about why sleep is really important. There&#39;s a bit about getting the kids into bed early, but for me the conclusion was- Oh, so that&#39;s why it&#39;s so important to let kids sleep when they need to. <br/>\n<br/>\nIt&#39;s definitely geared towards schooling parents, but I&#39;m only up to The Sibling Effect, so who knows what&#39;s to come. <br/>\n<br/>\nI felt a little conflicted about Why Kids Lie. I think the conclusion was that kids need to learn that lying is not okay before the age of 8 or so- before it becomes a habit, and that parents tend not to deal with lying effectively. I got the feeling he was recommending consequences or something (I left the book at work or I&#39;d double check). I just try to make sure Andrew (5yo) knows I can help him better if he tells me the whole story. I definitely agree with the conclusion that we set the example for them. <br/>\n<br/>\nWhat did you think of that chapter?   <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;missalexmissalex&quot; &lt;missalexmissalex@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I just read Nutureshock, the new book Po Bronson wrote with his wife, Ashley Merryman, and I highly recommend it. While it is not an unschooling book per se, I have been reading a bunch of stuff in this vein for the last 10 years and I learned a lot from this one. To </span></blockquote></div>","specialLinks":[]},{"userId":118247794,"authorName":"missalexmissalex","from":"&quot;missalexmissalex&quot; &lt;missalexmissalex@...&gt;","profile":"missalexmissalex","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Why Dumb Toys Make Kids Smarter","postDate":"1254520086","msgId":41701,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhhNXNlbStma2NrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhhNWhwaCtvdnNwQGVHcm91cHMuY29tPg=="},"prevInTopic":41700,"nextInTopic":41705,"prevInTime":41700,"nextInTime":41702,"topicId":41700,"numMessagesInTopic":0,"msgSnippet":"I just read Nutureshock, the new book Po Bronson wrote with his wife, Ashley Merryman, and I highly recommend it. While it is not an unschooling book per se, I","messageBody":"<div id=\"ygrps-yiv-2092030173\">I just read Nutureshock, the new book Po Bronson wrote with his wife, Ashley Merryman, and I highly recommend it. While it is not an unschooling book per se, I have been reading a bunch of stuff in this vein for the last 10 years and I learned a lot from this one. To oversimplify, it talks about all the newish research that shows that tons of the common beliefs about raising kids are not quite right. The chapters are: The Inverse Power of Praise, The Lost Hour (sleep), Why White Parents Don&#39;t Talk About Race, Why Kids Lie, The Search For Intelligent Life In Kindergarten (gifted testing/programs), The Sibling Effect, The Science of Teen Rebellion (non-judgemental look at how/when teens lie to parents), Can Self-Control Be Taught?, Plays Well With Others, and Why Hannah Talks and Alyssa Doesn&#39;t (language development).<br/>\n<br/>\nAlex<br/>\nmama to Katya, 2 yrs <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;cpaeff&quot; &lt;cpaeff@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; The Daily Beast has published a terrific article by Po Bronson about how<br/>\n&gt; Pokemon cards--and other things kids feel passionate about--are such<br/>\n&gt; valuable learning tools. </span></blockquote></div>","specialLinks":[]},{"userId":300893042,"authorName":"cpaeff","from":"&quot;cpaeff&quot; &lt;cpaeff@...&gt;","profile":"cpaeff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Why Dumb Toys Make Kids Smarter","postDate":"1254509169","msgId":41700,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhhNWhwaCtvdnNwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":41701,"prevInTime":41699,"nextInTime":41701,"topicId":41700,"numMessagesInTopic":0,"msgSnippet":"The Daily Beast has published a terrific article by Po Bronson about how Pokemon cards--and other things kids feel passionate about--are such valuable learning","messageBody":"<div id=\"ygrps-yiv-1816787330\">The Daily Beast has published a terrific article by Po Bronson about how<br/>\nPokemon cards--and other things kids feel passionate about--are such<br/>\nvaluable learning tools. Here&#39;s an excerpt:<br/>\n<br/>\n&quot;Our son taught me an extremely valuable lesson. When it comes to kids,<br/>\nwe often bring moralistic bias to their interests. There&#39;s a<br/>\npervasive tendency in our society to label things as either good for<br/>\nchildren or bad for children. Cultivating children&#39;s natural<br/>\nintrinsic motivation requires abandoning all judgment of good and bad<br/>\ncontent. Society has a long list of subjects that we&#39;ve determined<br/>\nthey should learn. But learning itself is kick-started when enmeshed and<br/>\ninseparable from what a child inherently loves. How many parents are<br/>\nignoring this, pushing flash cards and phonics cards onto their kids,<br/>\nattempting to trigger learning in an amotivational situation?&quot;<br/>\n<br/>\nAnd here&#39;s the link:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.thedailybeast.com/blogs-and-stories/2009-10-01/why-dumb-toys-&#92;\">http://www.thedailybeast.com/blogs-and-stories/2009-10-01/why-dumb-toys-&#92;</a><br/>\nmake-kids-smarter/full/<br/>\n<br/>\nColleen</div>","specialLinks":[]}],"prevTopicId":41709,"nextTopicId":41728}}