{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":446338733,"authorName":"cath01gb","from":"&quot;cath01gb&quot; &lt;cgoudou@...&gt;","profile":"cath01gb","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"spirited child","postDate":"1352546613","msgId":49266,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs3bGRmbCsxaGVsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEY1Qjc4ODQ2LUU5QTMtNDAxRi1BNEYzLUVGMTdGMjk5NDJDOUB2ZXJpem9uLm5ldD4="},"prevInTopic":49168,"nextInTopic":0,"prevInTime":49265,"nextInTime":49267,"topicId":49151,"numMessagesInTopic":0,"msgSnippet":"... Joyce, I can t thank you enough. Last week I received the book, and a now reading it avidly, and finally starting to understand my child is not out of","messageBody":"<div id=\"ygrps-yiv-694255603\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; And Raising Your Spirited Child Rev Ed: A Guide for Parents Whose Child Is More Intense, Sensitive, Perceptive, Persistent, and Energetic by Mary Sheedy Kurcinka<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://amzn.to/IKBN4R\">http://amzn.to/IKBN4R</a><br/>\n&gt;<br/>\n&gt; Joyce<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Joyce, I can&#39;t thank you enough. <br/>\nLast week I received the book, and a now reading it avidly, and finally starting to understand my child is not &quot;out of this world&quot;, hoping that we will struggle less.<br/>\nWe had a hard afternoon last week during a birthday party, where my son lost it completely, and it was hard to get him back... <br/>\nThis book is really helpful in understanding your spirited child&#39;s reaction, and coping with the results... Preventing the worse too...<br/>\nNow I&#39;m on to work on this. It may not solve everything, it may alleviate the outbursts, hopefully (and mine too... actually !)<br/>\nThanks again<br/>\n<br/>\nCath</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Dramatic 5 yr old daughter","postDate":"1350514479","msgId":49168,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs1bmN2ZitpZWhoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs1aTQ3NSthbWFqQGVHcm91cHMuY29tPg=="},"prevInTopic":49158,"nextInTopic":49266,"prevInTime":49167,"nextInTime":49169,"topicId":49151,"numMessagesInTopic":0,"msgSnippet":"... pay more attention to why she is having the melt down, a lot of times I have no clue. ************* To start with, you can pay attention to basics like: is","messageBody":"<div id=\"ygrps-yiv-1291161449\">&quot;sara&quot; &lt;sarajoturtle@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I think I definitely need to<br/>\n </span></blockquote>pay more attention to why she is having the melt down, a lot of times I have no clue. <br/>\n*************<br/>\n<br/>\nTo start with, you can pay attention to basics like: is she hungry? feeling cooped up/ needing to get some exercise? needing attention? tired? There&#39;s even a handy acronym:HALT (hungry, antsy, lonely, tired) to help you remember those. <br/>\n<br/>\nSometimes if you&#39;re aware of things like that, you can head off a melt down before it happens - you see things getting tense and remember the kids are probably hungry so you swoop in with a snack. Or you know someone&#39;s probably tired and suggest something like a movie or a bath... something calming to your specific kids. Or maybe you do a mental check and realize your daughter may need some more attention - it&#39;s entirely possible that&#39;s a huge factor in her big reactions, if she&#39;s not getting enough attention (from her perspective, not yours) and is afraid you don&#39;t take her feelings seriously. All that drama may be her way of saying &quot;You&#39;re Not Seeing/Hearing Me!&quot; <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;She is very demanding, always has to have her way or &quot;IM not playing!&quot; <br/>\n<br/>\n </span></blockquote>You also said her brothers do things she doesn&#39;t like most of the time - that sounds pretty stressful to her! She&#39;s getting the short end of the stick from her perspective. Look for ways to play with her more and let her be in charge of things - do it her way for her so she has some sense of control over her life. <br/>\n<br/>\nAre her brothers older or younger? If they&#39;re older, you may be able to talk with them and ask them to try and do things her way now and then, as a way of keeping the peace. It can&#39;t be pleasant for them to have a sister having a huge melt down! If you&#39;ve treated it as a matter of her &quot;getting her way&quot; in the past, they may need some coaching to Let her get her way as an experiment to see if it makes home life more pleasant. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Dramatic 5 yr old daughter","postDate":"1350424615","msgId":49155,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTA0MjQ2MTUuMzU1OTkuWWFob29NYWlsTmVvQHdlYjgxNTA1Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGs1a2RxMyttMWEyQGVHcm91cHMuY29tPg==","referencesHeader":"PGs1aTQ3NSthbWFqQGVHcm91cHMuY29tPiA8azVrZHEzK20xYTJAZUdyb3Vwcy5jb20+"},"prevInTopic":49154,"nextInTopic":49157,"prevInTime":49154,"nextInTime":49156,"topicId":49151,"numMessagesInTopic":0,"msgSnippet":"Start here: http://sandradodd.com/help Now this pare is great and at the bottom there is a sound file that is awesome:| ","messageBody":"<div id=\"ygrps-yiv-1576761731\">Start here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/help\">http://sandradodd.com/help</a><br/>\n<br/>\n<br/>\nNow this pare is great and at the bottom there is a sound file that is awesome:|<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a><br/>\n<br/>\n<br/>\n<br/>\nand Pam Laricchia has a great series of emails for newbies that I highly recommend together with her book.<br/>\nSign up for the daily emails. I have been getting them and they are wonderful if you are new and even not so new!:|<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.livingjoyfully.ca/\">http://www.livingjoyfully.ca/</a><br/>\n<br/>\n<br/>\nthe link to Exploring Unschooling email series is righ in that page and the link to her book!<br/>\n<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":532015522,"authorName":"luckyinlovemama24","from":"&quot;luckyinlovemama24&quot; &lt;jennamason1984@...&gt;","profile":"luckyinlovemama24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Dramatic 5 yr old daughter","postDate":"1350424433","msgId":49158,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs1a2wxaCs5dmhnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs1a2RxMyttMWEyQGVHcm91cHMuY29tPg=="},"prevInTopic":49157,"nextInTopic":49168,"prevInTime":49157,"nextInTime":49159,"topicId":49151,"numMessagesInTopic":0,"msgSnippet":"I would recommend the following: The Shepherdess, CA Scott -http://www.mostlyformothers.com/theshepherdess.html - more parenting than unschooling, but really","messageBody":"<div id=\"ygrps-yiv-655179422\">I would recommend the following:<br/>\n<br/>\nThe Shepherdess, CA Scott -<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mostlyformothers.com/theshepherdess.html\">http://www.mostlyformothers.com/theshepherdess.html</a> - more parenting than unschooling, but really helpful. <br/>\n<br/>\nThe Big Book of Unschooling, Sandra Dodd - definitive book on all things unschooling. <br/>\n<br/>\nSiblings without Rivalry (not an unschooling book, but I think it would help you with your current situation with your daughter). <br/>\n<br/>\nHTH<br/>\nJenna.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;sara&quot; &lt;sarajoturtle@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Thanks to you both, I will look for those books.  I think I definitely need to pay more attention to why she is having the melt down, a lot of times I have no clue.  I am very new to unschooling so I wouldn&#39;t call myself an unschooler yet, but I would be interested in some suggestions for books for newbies, to help explain some of the basics, and help with every day situations!<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":456069086,"authorName":"mdmullaley","from":"&quot;mdmullaley&quot; &lt;mdmullaley@...&gt;","profile":"mdmullaley","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Dramatic 5 yr old daughter","postDate":"1350423883","msgId":49157,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs1a2tnYitzNmo3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs1aTQ3NSthbWFqQGVHcm91cHMuY29tPg=="},"prevInTopic":49155,"nextInTopic":49158,"prevInTime":49156,"nextInTime":49158,"topicId":49151,"numMessagesInTopic":0,"msgSnippet":"One book that I have found helpful in dealing with my son is called The Whole-Brain Child: 12 Revolutionary Strategies to Nurture Your Child s Developing Mind","messageBody":"<div id=\"ygrps-yiv-80990954\">One book that I have found helpful in dealing with my son is called The Whole-Brain Child: 12 Revolutionary Strategies to Nurture Your Child&#39;s Developing Mind by Daniel J. Siegel, Tina Payne Bryson.<br/>\n<br/>\nHope this helps.<br/>\nMegan<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;sara&quot; &lt;sarajoturtle@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Im having trouble knowing how to deal with my daughter.  She is SO dramatic about things, she is constantly screaming at her brothers for doing something she doesnt like, which is most of the time, no big thing.  She is very demanding, always has to have her way or &quot;IM not playing!&quot; Then if she doesnt get her way she throws HUGE tantrums, where, she hates me, hates her brothers, shes NEVER going to talk to us again etc etc... I dont know what to do when she gets to that point other then send her to her room, at which point her tantrum escalates by like a million!<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":474971233,"authorName":"sara","from":"&quot;sara&quot; &lt;sarajoturtle@...&gt;","profile":"sarajoturtle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Dramatic 5 yr old daughter","postDate":"1350417027","msgId":49154,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs1a2RxMyttMWEyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs1aTQ3NSthbWFqQGVHcm91cHMuY29tPg=="},"prevInTopic":49153,"nextInTopic":49155,"prevInTime":49153,"nextInTime":49155,"topicId":49151,"numMessagesInTopic":0,"msgSnippet":"Thanks to you both, I will look for those books.  I think I definitely need to pay more attention to why she is having the melt down, a lot of times I have no","messageBody":"<div id=\"ygrps-yiv-933527406\">Thanks to you both, I will look for those books.  I think I definitely need to pay more attention to why she is having the melt down, a lot of times I have no clue.  I am very new to unschooling so I wouldn&#39;t call myself an unschooler yet, but I would be interested in some suggestions for books for newbies, to help explain some of the basics, and help with every day situations!</div>","specialLinks":[]},{"userId":482623530,"authorName":"Lesley Cross","from":"Lesley Cross &lt;lesleycross@...&gt;","profile":"decldc1992","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Dramatic 5 yr old daughter","postDate":"1350413950","msgId":49153,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4MDhDQkQ0LURBMUQtNEM0MS05OEQ5LThCNDk4RTUyMDAwREBhdHQubmV0Pg==","inReplyToHeader":"PGs1aTQ3NSthbWFqQGVHcm91cHMuY29tPg==","referencesHeader":"PGs1aTQ3NSthbWFqQGVHcm91cHMuY29tPg=="},"prevInTopic":49152,"nextInTopic":49154,"prevInTime":49152,"nextInTime":49154,"topicId":49151,"numMessagesInTopic":0,"msgSnippet":"The first step is to stop labeling your child as dramatic.  This doesn t help you help her and it s dismissive of her feelings.  She s having big feelings and","messageBody":"<div id=\"ygrps-yiv-379416245\">The first step is to stop labeling your child as dramatic.  This doesn&#39;t help you help her and it&#39;s dismissive of her feelings.  She&#39;s having big feelings and she&#39;s expressing them loudly, and possibly hurtfully.  Her distress increases when you send her to her room because what she needs is not isolation, but proof that someone loves and cares and will be there for her when she&#39;s feeling out of control.  It gets so much scarier to feel like you&#39;re unable to control yourself and also feel like no one has your back...no one cares...no one will help.  <br/>\n<br/>\nAt this point, I&#39;m guessing that your goal is to get her to be quieter and less hurtful when things don&#39;t go her way.  That may not happen.  If your goal becomes to help her feel supported and protect her from her own out of control (out of her own control... not yours) behavior... helping her not get hurt, helping her maintain relationships she&#39;d like to keep, helping her emotions flow past instead of getting stuck.... then there are options.  And when that is addressed the emotions seem to pass more quickly.  In general I don&#39;t like making assumptions about what my children want...but during those times of intense emotions she may not be able to connect with what she really wants/needs...or she&#39;s stuck on a specific WAY that she sees it happening and can&#39;t see it in any other way...I&#39;ll assume that my child does not want to hurt anyone, does not want to be unfair (or be treated unfairly)- I go by what I know of her in &quot;normal&quot; situations.   It usually doesn&#39;t help to look at other options until the emotions have passed...but here it always comes back to finding solutions that work for everyone.  When my own child was 5 I&#39;d boil it all down to &quot;she&#39;d like this, how can we make this happen in a way that feels good to everyone&quot;.  Sometimes the rest of us would brainstorm possibilities while she was still stuck and present them as soon as she could hear them.  I&#39;d try to imagine what she is saying as if it wasn&#39;t being screamed...and translated into what I might say in a similar situation &quot;I don&#39;t like what my brother is doing and I&#39;d like him to stop&quot;.  Sometimes I translate for my kids into language that isn&#39;t emotionally charged  &quot;She doesn&#39;t like that and would like you to stop&quot;- and we whittle down to what the real issue is &quot;oh, it&#39;s the noise? Can you do that in another room?  Or outside?&quot;  Until we find a reasonable and agreeable solution.  Living with other people can be a challenge!<br/>\n<br/>\nIn the mainstream a common response is to take whatever the child wants off the table as an option....it&#39;s often called &quot;consequences&quot; but what it really is is punishment for having big emotions and expressing them.  Here we look for the need inside the desire and simply allow the emotions.  I don&#39;t try to stop them any more than I&#39;d try to stop a thunderstorm....and honestly I don&#39;t have that power any more than I would with a thunderstorm.  But I do address what&#39;s bringing the emotions up.  Sometimes it&#39;s a buildup of stresses that come to a head and it all just needs to release (it&#39;s been weeks since a blow up here, but yesterday my parents left after visiting for nearly 2 weeks......and there were a few other things that just became too much... though my child&#39;s expressed focus was &quot;I&#39;m bored, there isn&#39;t anything to do&quot; and &quot;what I want to do isn&#39;t available to me right now&quot;- which is a sort of default for her- and the whole thing was triggered by some normal everyday question I asked her- she&#39;s 12, I think I asked if she&#39;d empty the dishwasher...and was perfectly willing to accept a no).  Sometimes it IS her brain&#39;s tendency to stick on one specific idea....but that&#39;s decreasing over time.  A neurotypical child (and your child probably is...this honestly sounds pretty standard for a 5yo) will mature out of the screaming pretty quickly...likely when the neurological structures develop that allow her to make logical connections between the things that are happening so that she&#39;s not emotionally overwhelmed by them.  <br/>\n<br/>\nThe books Joyce mentioned are helpful, but are from a mainstream perspective.  Most of the things they suggest, if you&#39;re an unschooler, you&#39;re probably already doing.  For me the relief in them was knowing there were other kids like my kid... and knowing that what we were already doing was the best option anyone had come up with so far....and that this isn&#39;t caused by connected, kind, loving parenting like so many &quot;muggles&quot; would seem to believe....plenty of kids raised in the mainstream are challenged with this as well and frankly are doing much worse because of the attempts to use force and punishment to change their behavior.  What I&#39;m finding most helpful is understanding emotions and the purposes they serve- Karla McLaren writes very eloquently and deeply on emotions and emotional sensitivity.   For whatever reason, some children&#39;s emotions seem amplified.... I&#39;m beginning to suspect that with my own child there are some BIG sensory processing differences that may underlie all of it.   But that may not be your situation at all.   Again, some small kids scream....and 5yo is  a pretty typical age for this.  <br/>\n<br/>\nLesley <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://euphorialifedesignstudio.com\">http://euphorialifedesignstudio.com</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Dramatic 5 yr old daughter","postDate":"1350379489","msgId":49152,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY1Qjc4ODQ2LUU5QTMtNDAxRi1BNEYzLUVGMTdGMjk5NDJDOUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGs1aTQ3NSthbWFqQGVHcm91cHMuY29tPg==","referencesHeader":"PGs1aTQ3NSthbWFqQGVHcm91cHMuY29tPg=="},"prevInTopic":49151,"nextInTopic":49153,"prevInTime":49151,"nextInTime":49153,"topicId":49151,"numMessagesInTopic":0,"msgSnippet":"... Have you read Ross Greene s The Explosive Child? http://amzn.to/JCilMW And Raising Your Spirited Child Rev Ed: A Guide for Parents Whose Child Is More","messageBody":"<div id=\"ygrps-yiv-536175389\">On Oct 15, 2012, at 6:54 PM, sara wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Im having trouble knowing how to deal with my daughter. She is SO dramatic about things<br/>\n<br/>\n<br/>\n </span></blockquote>Have you read Ross Greene&#39;s The Explosive Child?<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://amzn.to/JCilMW\">http://amzn.to/JCilMW</a><br/>\n<br/>\nAnd Raising Your Spirited Child Rev Ed: A Guide for Parents Whose Child Is More Intense, Sensitive, Perceptive, Persistent, and Energetic by Mary Sheedy Kurcinka<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://amzn.to/IKBN4R\">http://amzn.to/IKBN4R</a><br/>\n<br/>\nI&#39;ve heard so may people say they finally get their child after reading it.<br/>\n<br/>\nWhile you&#39;re waiting, if you search for &quot;explosive child&quot; in the archives of the list, that will bring up threads where the book was mentioned that may have some ideas for you.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":474971233,"authorName":"sara","from":"&quot;sara&quot; &lt;sarajoturtle@...&gt;","profile":"sarajoturtle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Dramatic 5 yr old daughter","postDate":"1350341669","msgId":49151,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs1aTQ3NSthbWFqQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":49152,"prevInTime":49150,"nextInTime":49152,"topicId":49151,"numMessagesInTopic":0,"msgSnippet":"Im having trouble knowing how to deal with my daughter.  She is SO dramatic about things, she is constantly screaming at her brothers for doing something she","messageBody":"<div id=\"ygrps-yiv-1363678536\">Im having trouble knowing how to deal with my daughter.  She is SO dramatic about things, she is constantly screaming at her brothers for doing something she doesnt like, which is most of the time, no big thing.  She is very demanding, always has to have her way or &quot;IM not playing!&quot; Then if she doesnt get her way she throws HUGE tantrums, where, she hates me, hates her brothers, shes NEVER going to talk to us again etc etc... I dont know what to do when she gets to that point other then send her to her room, at which point her tantrum escalates by like a million!</div>","specialLinks":[]}],"prevTopicId":49262,"nextTopicId":3027}}