{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":127741792,"authorName":"Hilary Jackson","from":"&quot;Hilary Jackson&quot; &lt;hilary@...&gt;","profile":"hilarylouisejackson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"FW: Great Movie:  Waking Life","postDate":"1119354860","msgId":5669,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{},"prevInTopic":0,"nextInTopic":0,"prevInTime":5668,"nextInTime":5670,"topicId":5669,"numMessagesInTopic":0,"msgSnippet":"Hi There, Just thought I would mention this movie - my husband and I first saw it about 3 years ago and thought it was pretty amazing... even the way the movie","messageBody":"<div id=\"ygrps-yiv-1036447898\">Hi There,<br/>\n <br/>\nJust thought I would mention this movie - my husband and I first saw it<br/>\nabout 3 years ago and thought it was pretty amazing... even the way the<br/>\nmovie has been ptu together (animation on the top of digitally shot scenes)<br/>\nis cool.<br/>\n <br/>\nAnyway - someone just gifted us the DVD, and so it was brought to mind<br/>\nagain. Great if your teen is into philosophy and deep thoughts!  Available<br/>\nat your nearest video store.<br/>\n <br/>\nRegards,  <br/>\nHilary <br/>\nwww.labouroflove.org<br/>\n <br/>\n__________________________________________<br/>\n <br/>\n <br/>\nPS:  Here&#39;s a review:<br/>\n <br/>\nMore than food for thought, Waking Life is a philosophical and visual<br/>\nbanquet for the mind. From scenes of immolation, floating and tango, to<br/>\nmicro-waved burritos and existentialism, Linklater has created a provocative<br/>\nfilm. <br/>\n<br/>\nWe first encounter a boy who floats into the sky unless he holds onto<br/>\nsomething to keep him grounded. In his adult life (played by Wiley Wiggins),<br/>\nwe follow him as he moves in a dreamland from person to person in various<br/>\nscenarios, having never lost his sense of drifting skyward. Early in the<br/>\nfilm he&#39;s in an accident and while part of his time and ours is spent<br/>\nwondering if the reason he can&#39;t wake up is because he&#39;s in a coma and<br/>\nnearing death, most of the film is purely enjoying the visuals and<br/>\nlistening. Typical plot questions are secondary to the exchange of ideas.<br/>\nVarious conversations and monologues about known, personal and questionable<br/>\nphilosophies (many about dreaming and that time before we wake) take shape.<br/>\nA much-needed dose of existentialism colors the rants, raves, and<br/>\nruminations of a unique cast of characters. <br/>\n<br/>\n<br/>\nLinklater digitally shot the film and used a modern version of<br/>\nrotoscoping-in laymen&#39;s terms creating animation from live action by way of<br/>\ntracing. The film was then colored using computer software to create layers<br/>\nof color. The effect is beautiful: impressionism, solarization, by the<br/>\nnumbers cartoon-like, eerily human. The images have a dreamlike quality<br/>\nunlike anything that&#39;s ever been seen. <br/>\n<br/>\n<br/>\nExistentialist philosophy permeates throughout the film. If it&#39;s the belief<br/>\nthat &quot;people have absolute freedom of choice and that the universe is<br/>\nabsurd, with an emphasis on the phenomena of alienation and anxiety&quot;,<br/>\nWiggins embodies it and shows that it&#39;s a hopeful philosophy. As he visits<br/>\nover 20 people, some who see him, some who don&#39;t, all offer him a bone to<br/>\nchew on their way of thinking. Particularly refreshing about the film is<br/>\nthat so many different ideas are offered without shoving anything down the<br/>\nthroat or sounding overly pretentious. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://media.fastclick.net/w/click.here?sid=3971&m=6&c=1\">http://media.fastclick.net/w/click.here?sid=3971&m=6&c=1</a>&gt; <br/>\nLike a dream, the film fluidly moves from idea to idea or scene to scene<br/>\nwithout much explanation but with the implicit acceptance that the state of<br/>\ndreaming allows what reality does not. Watching Julie Delpy and Ethan<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.plume-noire.com/cinema/critiques/trainingday.html\">http://www.plume-noire.com/cinema/critiques/trainingday.html</a>&gt; Hawke<br/>\nreunited and bedroom philosophizing in one scene and then watching two men<br/>\nshoot each other in a bar while discussing the merits of no gun control (&quot;A<br/>\nwell-armed populace is the best defense against tyranny.&quot;) necessitates a<br/>\nsuspension of reality. Steven<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.plume-noire.com/cinema/critiques/traffic.html\">http://www.plume-noire.com/cinema/critiques/traffic.html</a>&gt; Soderbergh<br/>\nappears, as does director Richard Linklater (as a pinball wizard philospher<br/>\nno less).  I might also add it was enjoyable to watch something basically<br/>\nfree of crude product placements or a bad soundtrack trying to promote a<br/>\nbunch of bands with no real tie in to the film. As for the music in the<br/>\nfilm, what could be better than tango to convey the ultimate reverie? <br/>\n<br/>\nA somnambulist walking and floating and meeting people satiates a desire to<br/>\nsee something more than a self-serving gabfest onscreen. A void in film has<br/>\nbeen filled whereby it can and should be used as a forum to discuss culture<br/>\ninstead of just spouting opinions about current non-events based on popular<br/>\nmedia. <br/>\n<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":5611,"nextTopicId":5670}}