{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Divorce or separation and unschooling","postDate":"1159561004","msgId":17670,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVmanV2YyszMWVjQGVHcm91cHMuY29tPg=="},"prevInTopic":17662,"nextInTopic":0,"prevInTime":17669,"nextInTime":17671,"topicId":17660,"numMessagesInTopic":0,"msgSnippet":"Un/homeschooling can continue *if* the other parent will still be cooperative.  YES, for sure. And I love that some couples find ways to be co-parents","messageBody":"<div id=\"ygrps-yiv-991146015\">&quot;Un/homeschooling can<br/>\ncontinue *if* the other parent will still be cooperative. &quot;<br/>\n<br/>\nYES, for sure.<br/>\nAnd I love that some couples find ways to be co-parents without all<br/>\nthe difficulties of typical divorce situations. IF he would agree to<br/>\nlive in the same household and co-parent, that would be ideal.<br/>\n<br/>\nHere&#39;s my story; Dh and I separated when I was 4mos. pregnant with<br/>\nJalen (now 5.5). We had the textbook &quot;perfect&quot; separation. I had my<br/>\nown house, he was planning on buying a house on the same street as<br/>\nsoon as our big house sold. He had the kids every week for at least a<br/>\nnight and day, he ate dinner over at our house occasionally, or came<br/>\nto watch movies with us. We saw him very regularly as he did all of<br/>\nour laundry (we joked and called him the &quot;laundry man&quot;) and picked it<br/>\nup every few days. We spent holidays together as a family. We didn&#39;t<br/>\nfight (disagreed yes), we treated each other kindly and respectfully.<br/>\nHome/unschooling was a non-issue, he was totally supportive. Our<br/>\nfriends were baffled at how we could be such good friends, have fun<br/>\ntogether etc...but still not want to be married.:)<br/>\n<br/>\nIn spite of that &quot;perfect&quot; separation, our children suffered. My<br/>\noldest especially. If I had a 2.5 y.o., I might feel differently about<br/>\nmoving into separate households, because my younger ones don&#39;t<br/>\nremember it as a stressful time at all...they never displayed the<br/>\nstress signs my oldest did. IF you can have an amicable/happy<br/>\nco-parent situation, then two houses CAN work. If there&#39;s any way to<br/>\nkeep the family under one roof though, do it. That&#39;s just my pov. It&#39;s<br/>\nreally hard on kids.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":77669557,"authorName":"gailbrocop@aol.com","from":"gailbrocop@...","profile":"gailbrocop","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Divorce or separation and unschooling","postDate":"1159539019","msgId":17662,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMi4zM2UzOThmYS4zMjRlODM0YkBhb2wuY29tPg=="},"prevInTopic":17660,"nextInTopic":17670,"prevInTime":17661,"nextInTime":17663,"topicId":17660,"numMessagesInTopic":0,"msgSnippet":"Are  there any possibilities for continuing to unschool with separated/divorced  parents?  ====== Joyce s has given a link to some recent discussions about","messageBody":"<div id=\"ygrps-yiv-1502372626\">&quot;Are  there any possibilities for continuing to unschool with <br/>\nseparated/divorced  parents? &quot;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n======<br/>\n <br/>\nJoyce&#39;s has given a link to some recent discussions about this that have  <br/>\nbeen enlightening and a good starting point for reading about both personal  <br/>\nexperiences and recommendations.<br/>\n <br/>\nThe one thing that has not been examined in much detail has been the  <br/>\nfinancial impact of divorce.  The impact emotionally on families is huge  when <br/>\nparents divorce or separate.  It seems that the financial  considerations are often <br/>\noverlooked.  <br/>\n <br/>\nDivorce or separation can mean two households, child support, medical  <br/>\ninsurance issues, both parents having to work, child care expenses, visitation  <br/>\nexpenses, as well as the legal costs incurred.  All these considerations  can <br/>\ndouble if you remarry someone with children.<br/>\n <br/>\nIf you do divorce, it would be helpful to have a good plan and skills to  <br/>\nsupport you and your children AND...you better have learned how to communicate  <br/>\neffectively.  You&#39;ll need it to work out all the problems you&#39;ll face  not only <br/>\nwith your children but with your lawyers and your  ex-husband.  If you <br/>\nremarry, you&#39;ll not only have all the new problems that  come with any relationship <br/>\nbut you&#39;ll now have to communicate with a new spouse,  an ex-wife, <br/>\nstepchildren , new grandparents for your children, more  brothers and sisters-in law and <br/>\nall their children.  I understand  completely how there may be circumstances <br/>\nthat make it very difficult, however,  learning to communicate and create a <br/>\nloving relationship with your current  spouse makes sense from an emotional and <br/>\nfinancial standpoint.<br/>\n <br/>\nGail<br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Divorce or separation and unschooling","postDate":"1159530554","msgId":17660,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVmajE3cSt1aXM0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":17662,"prevInTime":17659,"nextInTime":17661,"topicId":17660,"numMessagesInTopic":0,"msgSnippet":"Are there any possibilities for continuing to unschool with separated/divorced parents?  Only if the ex agrees with it. I have not personally seen the courts","messageBody":"<div id=\"ygrps-yiv-1307940676\">&quot;Are there any possibilities for continuing to unschool with <br/>\nseparated/divorced parents? &quot;<br/>\n<br/>\nOnly if the ex agrees with it.<br/>\nI have not personally seen the courts uphold anyone&#39;s right to even <br/>\nhomeschool in a divorce case where one parent disagrees, though I&#39;ve<br/>\nheard it&#39;s happened rarely.<br/>\nJust remember, that if there is not abuse happening, then whatever<br/>\nissues are at play are going to get WORSE by leaving, not better.<br/>\n<br/>\nWhen you throw yourself on the court system, you lose rights as a<br/>\nparent. You lose more than the choice to homeschool...you lose the<br/>\nright to have your child with you at all times. YOUR idea of splitting<br/>\ntime with the other parent sounds great, but the court may decide (as<br/>\nthey often do now) that you will have him for two weeks and the father<br/>\nwill have him for two. You won&#39;t decide that.<br/>\n<br/>\nI can&#39;t imagine a case where divorce is better than staying (with<br/>\nchildren involved) unless there are abuse issues at play. I&#39;m not<br/>\nsaying a happy relationship isn&#39;t your right, but when children are in<br/>\nthe picture it changes everything in my view. You just lose so much<br/>\nfreedom of choice in a divorce...both parents do.<br/>\n<br/>\nThe only time I&#39;ve seen it work out ok, is when both parents agree on<br/>\nthe separation/divorce and use an arbitrator rather than the court<br/>\nsystem. Not many people are able to put their own personal feelings<br/>\naside and simply do what is best for the whole family unit. If you<br/>\nhave a husband that could, then why not put the same energy and money<br/>\nand emotion in to making it a great relationship?<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]}],"prevTopicId":17612,"nextTopicId":17643}}