{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: New to this group; long-time unschool mom","postDate":"1332782656","msgId":48100,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGprcThvMCt2OG85QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGprbzNjNCt2NXBjQGVHcm91cHMuY29tPg=="},"prevInTopic":48093,"nextInTopic":0,"prevInTime":48099,"nextInTime":48101,"topicId":48078,"numMessagesInTopic":0,"msgSnippet":"... College extension organizations often have basic blacksmithing programs - low cost and open to anyone, essentially, although the limiting factors in","messageBody":"<div id=\"ygrps-yiv-237701179\">&quot;lindaguitar&quot; &lt;lindaguitar@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;How did he find a blacksmith to train him?<br/>\n<br/>\n </span></blockquote>College extension organizations often have basic blacksmithing programs - low cost and open to anyone, essentially, although the limiting factors in ironmongery tends to be strength and stamina. Those aren&#39;t such a big deal for small items, though, and there are metal workers who use metals other than iron, but Ray likes the challenge or hammering the stuff into submission ;)<br/>\n<br/>\nYou can also check and see if there&#39;s a local SCA chapter (Society of Creative Anachronism). That&#39;s where you&#39;re most likely to find sword and knife makers.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; And nowadays, I&#39;m sure that luthiers all use computers or graphing calculators for the calculations.<br/>\n </span></blockquote>***************<br/>\n<br/>\nMy partner, who dropped out of high school and never had much in the way of school math, builds custom electric guitars. He doesn&#39;t use a computer or fancy graphing calculator, he does the math the old fashioned way - and uses a whole lot of jigs, templates, charts and plain ol&#39; experimentation to get the effects he wants. Currently he&#39;s learning the art of building pick-ups because he&#39;s tired of modifying every pick-up he buys to get the sound he (or his customer) wants. Lots of interesting math in electronics. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] New to this group; long-time unschool mom","postDate":"1332765748","msgId":48092,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVBMDU0QUY4LTA5MzEtNDVBNi05RDk3LTk3NjAwRTk3N0MwNEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGprbDEzOSsxcGlrQGVHcm91cHMuY29tPg==","referencesHeader":"PGprbDEzOSsxcGlrQGVHcm91cHMuY29tPg=="},"prevInTopic":48087,"nextInTopic":48093,"prevInTime":48091,"nextInTime":48093,"topicId":48078,"numMessagesInTopic":0,"msgSnippet":"... If your image of math is school math -- as most people s is -- this will seem necessary. If, instead, you grow an understanding of math as how numbers","messageBody":"<div id=\"ygrps-yiv-1854625211\">On Mar 24, 2012, at 1:43 PM, lddixon4 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I will suggest we do something like go over our times tables, do a few math problems, etc.<br/>\n<br/>\n </span></blockquote>If your image of math is school math -- as most people&#39;s is -- this will seem necessary.<br/>\n<br/>\nIf, instead, you grow an understanding of math as how numbers work, then times tables and math problems will look more like exercises dressed up in math clothes.<br/>\n<br/>\nThere are several pages on math here that might help you get a glimmer of the difference.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n<br/>\nScroll down on the left to the math section.<br/>\n<br/>\nBeing strong in school math myself, what helped me understand the difference between what I was good at and real math was seeing how my daughter made numbers work for her without having been taught. It looked nothing like school math but she developed a far better understanding of math concepts that took me into my adult years to finally get, despite -- or because of -- 16 years of classroom math.<br/>\n<br/>\nWhile my daughter Kat&#39;s unschooling years were sprinkled with math ideas like Fibonacci numbers, the foundation of her math was video games and real life where she used numbers to help her make decisions such as how to beat the game and how much more she needed to buy something.<br/>\n<br/>\nExcept for 2 months of 2nd grade, her first exposure to school math was at 14 taking her father&#39;s college statistics class for fun. She chose to sit through the class twice rather than doing something else during the second session he taught. He was handier to ask questions of for her than the other students, but he did have office hours the rest of the students could take advantage of. But she did the homework and tests without any special advantages. And she was always at the top of the class in scores, compared against kids who had over 12 years more than than she did. (I believe most of the students were college sophomores.)<br/>\n<br/>\nWhere the college students excelled was in arithmetic. They had had 12+ years of adding, subtracting, multiplying and dividing. Kat understood the concepts but couldn&#39;t do the arithmetic as quickly as they could and often relied on her calculator. (Now at 20 she does just fine.) The mechanics of arithmetic is lauded because it&#39;s easy to test. But as far as understanding what you&#39;re doing with the numbers, it&#39;s convenient to be able to do the arithmetic without a calculator but counts for nothing in understanding the concepts of math and how numbers work. (I was out of college before it struck me that multiplying was repeated addition, division was repeated subtraction.) It&#39;s rote learning. IT&#39;s mechanics. A calculator can do it. A calculator can&#39;t help you understand a problem and how you can use math to help you make a decision. That&#39;s where real life experience comes in.<br/>\n<br/>\nKat obviously has a brain wired for mathematical thought (though she spends most of her time artistically writing and drawing. As far as I know she&#39;s never done a math puzzle other than a few Sudoku.) Most unschooling kids would not be able to take college statistics at 14. Most wouldn&#39;t want to. The purpose of unschooling is not to prepare kids to take classes but to create an environment that will allow them to grow an understanding of how the world works. If a kid&#39;s interest lies in a direction that a class sounds interesting, unschooling will not only not handicap them but they will more than likely do very well because they&#39;re there out of interest and without 12+ years of baggage that has taught them that classes are dull and to do as little as possible because the grade is what counts.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This is usually met with an &quot;I don&#39;t really want to&quot;, but I just say<br/>\n&gt; &quot;yes, we are&quot;, and it&#39;s really not that big of a deal once we get started.<br/>\n<br/>\n </span></blockquote>If someone&#39;s powerless to change something, is giving up protesting the same as enjoying it? The outside looks the same but what&#39;s going on inside is completely different.<br/>\n<br/>\nKids do laugh and have fun in school. Is that because they&#39;re enjoying themselves or making the best of a bad situation they&#39;re trapped in?<br/>\n<br/>\nHaving real choice -- like being able to say &quot;No, thanks,&quot; -- is a huge part of unschooling.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This is usually met with an &quot;I don&#39;t really want to&quot;,<br/>\n<br/>\n </span></blockquote>If someone wanted to grow a greater dislike of something in someone, the best way to do it would be to keep pressing them to do it against their will.<br/>\n<br/>\nIt&#39;s akin to aversion therapy where negative stimuli accompany a behavior the therapist is trying to stop. If kids are pressed to do math when their initial reaction is one of tedium, they&#39;ll more and more associate numbers with tedium. It&#39;s what happens to many school kids. They have opportunities all around them in real life to absorb how numbers work, but school trains them to avoid what reminds them of the feelings they get when doing math in school.<br/>\n<br/>\nBy making them do math problems against their protests, you are potentially tainting their real life encounters with math, causing them to shut down when they come across what should be their most profound way of absorbing how numbers work.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I usually let them pick what math page/activity/game or even a craft.<br/>\n<br/>\n </span></blockquote>If I give you the choice of liver or kidney, is it really a choice if neither is high on your list of likes and you really want a hamburger?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; SO... I know this is not complete unschooling to some out there ...<br/>\n&gt; I guess I don&#39;t really need to call it anything. It&#39;s just what we do!!!<br/>\n<br/>\n </span></blockquote>You could call it &quot;What works for my family.&quot;<br/>\n<br/>\nYou could also call it eclectic if you needed a search term for Google.<br/>\n<br/>\nIn order to help people unschool, it&#39;s very useful to define what is unschooling and what isn&#39;t. (What they label themselves isn&#39;t important.)<br/>\n<br/>\nIt&#39;s saying &quot;This is the direction that the ideas on this list will help you go.&quot; We can&#39;t directly help people do &quot;what works for my family&quot; because what helps one family will hinder another. But we can help with ideas that move in a particular direction. Then people can pick and choose if their direction is slightly different from unschooling.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: New to this group; long-time unschool mom","postDate":"1332711620","msgId":48093,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGprbzNjNCt2NXBjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGprbnRuaytnbWZuQGVHcm91cHMuY29tPg=="},"prevInTopic":48092,"nextInTopic":48100,"prevInTime":48092,"nextInTime":48094,"topicId":48078,"numMessagesInTopic":0,"msgSnippet":"... That is so cool! How did he find a blacksmith to train him? My daughter is interested in swords, recently. She started writing a fantasy story about a","messageBody":"<div id=\"ygrps-yiv-387303198\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Meredith&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;  ... My stepson .... he&#39;s learning to be an artisan blacksmith and<br/>\n&gt; a bit of wood working, as well, <br/>\n<br/>\n </span></blockquote>That is so cool! How did he find a blacksmith to train him?<br/>\n<br/>\nMy daughter is interested in swords, recently. She started writing a fantasy story about a young woman who inherits a magical sword (which turns out to be Excalibur, I think), and gets transported to another realm where she and the sword are needed to fight off some evil force, or something. (Basically an Arthur/Merlin-legend spin-off.) So, anyway, she started researching types of swords, and I thought that it might be cool if she could study with a sword-smith at some point. There ARE sword-smiths at the Renaissance Festival every year. (My son won a real broadsword in some kind of contest one year!) I don&#39;t know whether any of them live around here. A lot of Ren-Fest merchants and crafts-people tend to travel around the country. (On the other hand, the grandmother of one of my daughter&#39;s friends is a spinner and knitter, and she has a booth with her spinning wheel and yarns at the Ren-Fest every year, but doesn&#39;t travel around to other states for these festivals.)  <br/>\n<br/>\nso he&#39;s learning the math necessary for those trades. Tradesman math<br/>\n<blockquote><span title=\"ireply\"> &gt; isn&#39;t like school math  - it&#39;s real, and that makes a substantial<br/>\n&gt; difference. When there are calculations which need to be fast and<br/>\n&gt; accurate, there are tools to help. That&#39;s a big difference right<br/>\n&gt; there, since schools strongly discourage kids from using tools or<br/>\n&gt; sharing knowledge - it&#39;s called &quot;cheating&quot;. In real life, making<br/>\n&gt; sure you get the right number whatever it takes isn&#39;t cheating,<br/>\n&gt; it&#39;s good sense. <br/>\n<br/>\n </span></blockquote>This is so true!<br/>\n<br/>\nWhen I was 20-21, I took a course at a luthiery school. (Luthiery is building stringed instruments. It was specifically a guitar-building course.) We learned how to calculate the distances between the frets. There were two methods - one was geometric, using a compass and ruler; the other was with a trigonometric formula. (My mother pointed out to me that the use of sine in trigonometry was directly related to sine-waves as in sound-waves, and helped me understand the relationship between the formula and geometric method. It was very cool seeing a practical use for that stuff!) But I could have learned all that stuff just as easily even if I hadn&#39;t learned it in high school. And nowadays, I&#39;m sure that luthiers all use computers or graphing calculators for the calculations. We didn&#39;t have computers back in &#39;82 when I took the course.  <br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: New to this group; long-time unschool mom","postDate":"1332705844","msgId":48087,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGprbnRuaytnbWZuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGprbDEzOSsxcGlrQGVHcm91cHMuY29tPg=="},"prevInTopic":48083,"nextInTopic":48092,"prevInTime":48086,"nextInTime":48088,"topicId":48078,"numMessagesInTopic":0,"msgSnippet":"... **************** There are quite a few stories collected here: http://sandradodd.com/teen/ http://sandradodd.com/teen/college.html ","messageBody":"<div id=\"ygrps-yiv-2122648341\">&quot;lddixon4&quot; &lt;lddixon@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I really think there is much value in hearing from those who have unschooled their grown kids. Please share more about your experiences!<br/>\n </span></blockquote>****************<br/>\n<br/>\nThere are quite a few stories collected here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/teen/\">http://sandradodd.com/teen/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/teen/college.html\">http://sandradodd.com/teen/college.html</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/math/\">http://sandradodd.com/math/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/typical\">http://sandradodd.com/typical</a><br/>\n<br/>\nLots of good stuff.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; How did it come about that your kids learned the higher levels of math that they needed for college?<br/>\n </span></blockquote>****************<br/>\n<br/>\nThe vast majority of college students don&#39;t need &quot;higher levels of math&quot; they just need to fill a math requirement or two. Most kids who graduate high school don&#39;t have &quot;higher levels&quot; of math at all - at best, they&#39;ve fumbled their way through algebra somehow and some will just re-take algebra in college and save themselves some pain. So I wouldn&#39;t sweat about math. Public education does so much to ruin people&#39;s relationship with math that if your child learns nothing at all at home, he or she will actually be ahead of the game. And math is one of the things humans are wired to learn, like language, so learning nothing at all isn&#39;t likely ;)<br/>\n<br/>\nMy stepson (18) was homeschooled and then went to school for a few years (insert tedious custody drama here) before moving in with us full time and unschooling. School scared him about math pretty thoroughly, but after a few years of deschooling he&#39;s confident in his ability to learn whatever he needs to know, math-wise. He&#39;s not currently interested in college - he&#39;s learning to be an artisan blacksmith and a bit of wood working, as well, so he&#39;s learning the math necessary for those trades. Tradesman math isn&#39;t like school math  - it&#39;s real, and that makes a substantial difference. When there are calculations which need to be fast and accurate, there are tools to help. That&#39;s a big difference right there, since schools strongly discourage kids from using tools or sharing knowledge - it&#39;s called &quot;cheating&quot;. In real life, making sure you get the right number whatever it takes isn&#39;t cheating, it&#39;s good sense. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; What were some typical days like for you??<br/>\n<br/>\n </span></blockquote>My stepson&#39;s schedule varies a good bit - he&#39;s hard to keep track of these days. He works various places doing odd jobs, some of those work-trade with local artisans in exchange for learning from them, others strictly for pay. He also makes wood and iron kitchen ware and sells it at assorted events and shows, so when there&#39;s a show on the horizon he tends to focus more heavily on getting product ready. Plus he&#39;s a social guy, and his busy social schedule is more than I can keep track of! <br/>\n<br/>\nMy daughter is 10 and likes a routine. She has a regular round of video games, movies, building, programming, writing, drawing, animating, and jumping on the trampoline (when she also does a good bit of plotting and organizing of ideas). None of this is structured and most of the time it looks nothing at all like schoolish learning, but she&#39;s very literate and highly logical - I&#39;m pretty sure she doesn&#39;t know her times tables, but I&#39;m confident she could derive them if she needed to and didn&#39;t have a calculator handy. She&#39;s like that ;)<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: New to this group; long-time unschool mom","postDate":"1332668669","msgId":48083,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGprbXBkdCtjbGo2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGprbDEzOSsxcGlrQGVHcm91cHMuY29tPg=="},"prevInTopic":48082,"nextInTopic":48087,"prevInTime":48082,"nextInTime":48084,"topicId":48078,"numMessagesInTopic":0,"msgSnippet":"... It always comes back to math - LOL! OK, my son likes math and is good at it. He went through a booklet of pre-algebra problems with me during the first","messageBody":"<div id=\"ygrps-yiv-909434484\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;lddixon4&quot; &lt;lddixon@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I really think there is much value in hearing from those who have<br/>\n&gt; unschooled their grown kids. Please share more about your<br/>\n&gt; experiences! How did it come about that your kids learned the<br/>\n&gt; higher levels of math that they needed for college?? What were some<br/>\n&gt; typical days like for you??<br/>\n<br/>\n </span></blockquote>It always comes back to math - LOL!<br/>\n<br/>\nOK, my son likes math and is good at it. He went through a booklet of pre-algebra problems with me during the first year we homeschooled. We just sat on the couch and went through it together - it was like any other activity-book or puzzle-book, for him. Then he occasionally did some work in a video math course called &quot;Videotext Algebra&quot;, at his leisure, over the next couple of years. So he did choose to use a curriculum for math, for a while. He also enjoyed playing math games on the computer, occasionally. When he was 15, he took a combined geometry/algebra class for homeschoolers, taught in a very creative, artistic, and informal way by a teacher who is a building contractor who happens to love math, and teaches math classes for homeschoolers as a side-job. He is an amazing math teacher, because of his enthusiasm for the subject, and all the cool math-related information he presents. After that, my son took some formal classes in pre-calculus and statistics. If we had lived in another state, where community colleges are open to homeschooled teens, he would have taken those courses for college credit. But he didn&#39;t have that option in our state (GA).<br/>\n<br/>\nMy daughter, on the other hand, has always hated and avoided formal math learning and abstract, irrelevant math problems. She was pretty good at calculating with tangible things, though, for real-life  money purposes, time, coking/baking, measuring, etc. So that was pretty much what we did in the way of math - just talked about math when it came up in real life. She was the purser (treasurer) for her Sea Scout group for a year, when she was 15 or 16. and did all the bookkeeping for fundraising and account records, and helped plan the fundraising activities and the group&#39;s budget, etc.<br/>\n<br/>\nWe have all kinds of math manipulatives around the house, like fraction blocks, which she played with a bit when she was younger. We also have an &quot;algebra balance scale&quot; - a big, colorful plastic hanging/balance scale that came with containers and discs that you can put in them to represent &quot;X&quot;, and ... well, it&#39;s hard to describe, but basically, it was a cool tool to demonstrate simple concepts in algebra, in a very tangible way. So we played with that a few times, and she understood the idea of variables and balancing equations.<br/>\n<br/>\nI occasionally showed her little bits of information about graphing, and about various aspects of geometry. We had a few discussions about negative numbers, exponents and square roots, averages, etc. She wasn&#39;t interested, and didn&#39;t really retain it, but at least she was exposed to the concepts. I also showed her some multiplication tricks, and how to round numbers up or down to estimate totals in your head, etc. (*I* like math, and it&#39;s easy for me to bring math into casual conversations, and to make up math problems/examples on the spur of the moment.)<br/>\n<br/>\nI often estimate the total of my bill payments (out loud), and then have her add up series of numbers from the bills I&#39;ve paid, on the calculator, for me. It&#39;s easier for me to read them aloud to her and have her enter the numbers than for me to have to look back and forth from the bills-paid list to the calculator. (I would lose my place that way.) I would then (out loud) deduct the total of the bills paid from the total we had in our account, to see how much money we had left for the week or two-week period. In other words, I model using real-life math. I did NOT ever ask her to add the list of numbers up manually, but she knows how to do it. The fact is, we HAVE calculators in the computers and in our cell phones - they are convenient tools and we use them. I also show her in the supermarket how to estimate the tax on the groceries, keep a running estimate of the cost of the groceries, and how to figure out the best value of items by unit price.<br/>\n<br/>\nWhen she was 16, she started taking some online high school courses - entirely of her own choice. She was still avoiding math, but she took biology, which required some calculating. Probability, for genetics, and percentages for some other topics and experiments. I showed her how to do the necessary math each time it came up. It didn&#39;t come easily to her, the way it does to my son, but she got it enough to do the assignments. <br/>\n<br/>\nThis year, she finally signed up for a course called &quot;math concepts&quot;, which is basically a review of all of 5th through 10th or 11th grade math. Some of it is review for her, and some is new. Despite her years of math-avoidance, she is doing really well in the course. By the time she takes the SAT or ACT, or the GED tests (I think she&#39;s just going to go for the GED, which is all she needs to enroll in the community college she want to start off in), I think she&#39;ll do well enough in math. <br/>\n<br/>\nShe excels in English, writing/composition, and some areas of science. She reads slowly, because she is dyslexic, but her comprehension is very good. She hasn&#39;t done much reading or watching of documentaries on history or geography, but we do talk about aspects of history from time to time, and we look at the globe anytime a foreign country is mentioned in the news. She knows a lot about s few specific periods of history from some &quot;living history&quot; classes she took with our homeschool group years ago, and from seeing a lot of Shakespeare plays.<br/>\n<br/>\nShe has been taking Japanese as a foreign language for three years now, through the virtual school. She loves Japanese! She is a big fan of several anime series, and sometimes watched episodes on YouTube in Japanese.<br/>\n<br/>\nI know of many unschooled teens who never took any formal courses until they started college, and just learned from books and websites, discussion groups with peers, and real-life activities. But there are plenty of others who, like my kids, decide that they are interested in formal classes when they are 14, 15, or 16. In many states (not GA, unfortunately), homeschooled teens can enroll in community college classes when they are as young as 14. Many unschoolers in those states have taken enough courses during their earlier teen years to enroll in a 4-year university as transfer students - sophomores or juniors - when they are 18! They never have to take the SAT or ACT, or have their parents make them a high school transcript to apply. <br/>\n<br/>\nIf my daughter gets her GED, I won&#39;t have to deal with creating a transcript or a portfolio - which is fine with me! :-)<br/>\n<br/>\nI&#39;ll post a bit about some of our &quot;typical&quot; days in a separate message (later), since this one has gotten long already.<br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":333758624,"authorName":"lddixon4","from":"&quot;lddixon4&quot; &lt;lddixon@...&gt;","profile":"lddixon4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: New to this group; long-time unschool mom","postDate":"1332610985","msgId":48082,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGprbDEzOSsxcGlrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpramk0cityOWcwQGVHcm91cHMuY29tPg=="},"prevInTopic":48078,"nextInTopic":48083,"prevInTime":48081,"nextInTime":48083,"topicId":48078,"numMessagesInTopic":0,"msgSnippet":"I really think there is much value in hearing from those who have unschooled their grown kids. Please share more about your experiences! How did it come about","messageBody":"<div id=\"ygrps-yiv-1166328031\">I really think there is much value in hearing from those who have unschooled their grown kids. Please share more about your experiences! How did it come about that your kids learned the higher levels of math that they needed for college?? What were some typical days like for you??<br/>\n<br/>\nI am a very relaxed homeschooling mom that started with the plan to do typical homeschool, but very much believe in the power of play and delayed academics. This eventually brought me to unschooling- kind of on accident. Most of our days are not academically structured at all. I do love the Waldorf method of life and so we keep a fairly consistant family rhythm to our day. No heavy schedules, just peaceful rhythm. My kids do wake up at their leisure, but for example, after breakfast we always do a chore or two and get dressed for the day. After that they are on their own until I suggest we go outside in the early afternoon. <br/>\nAnyway, once or twice a week for what ends up being no more than 15-30 minutes (because it&#39;s just not natural for us) I will suggest we do something like go over our times tables, do a few math problems, etc.This is usually met with an &quot;I don&#39;t really want to&quot;, but I just say &quot;yes, we are&quot;, and it&#39;s really not that big of a deal once we get started. I usually let them pick what math page/activity/game or even a craft.<br/>\nSO... I know this is not complete unschooling to some out there, but I can&#39;t say we homeschool like the curriculum families either. I guess I don&#39;t really need to call it anything. It&#39;s just what we do!!!<br/>\n<br/>\nI would love to hear how you did it! I can not see life different than what we are doing. We will probably be unschoolers forever! I just don&#39;t believe in a very curriculum based schooling anymore. It is encouraging, however to hear about those with older kids who are experts at doing this. <br/>\n<br/>\nLisa<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;lindaguitar&quot; &lt;lindaguitar@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi Group. :-)<br/>\n&gt; <br/>\n&gt; Someone on my state unschool group referred a newcomer to this group for more information, and, since I love to associate with as many unschool-minded people as possible, I decided to join this group too.<br/>\n&gt; <br/>\n&gt; My kids are 20 and 18. The 20 y.o. (my son) is in college and working p/t. My daughter is still at home, and hoping to start college in the fall. (It just occurred to me, we really need to start dealing with the FAFSA application for her.)<br/>\n&gt; <br/>\n&gt; We took the kids out of school when they were in 3rd and 5th grades. I started off being a lot more skeptical of the public school system and its methods and &quot;have-to&quot;s than most parents, because I did not attend public school as a kid myself. I went to a small private Jewish school that was very different from public schools in a lot of important ways. I had never expected to have to put my kids into the public school system in the first place. But, due to our financial situation, that&#39;s what we ended up doing. Until I just got totally fed up with it and refused to send my kids back there anymore.<br/>\n&gt; <br/>\n&gt; So, I started off doing what I&#39;d call relaxed, eclectic homeschooling. But after a couple of years, if that, we really became full-blown unschoolers. I had a lot of support and encouragement from older unschool moms whose kids were in their teens when we started, and from a really wonderful local homeschool group that included a great variety of different types of homeschoolers, including several unschoolers. And I read a lot about unschooling, even before I took the kids out of public school. One of the reasons we did school-ish stuff at all, at first, was to pacify my husband, who was NOT happy about the idea of homeschooling and had only reluctantly agreed to let us try it. But it didn&#39;t take him too long to see that the less &quot;school&quot; we had in our lives, the less stressful our lives were. And it was obvious that the kids were learning all the time, from everything they did.<br/>\n&gt; <br/>\n&gt; I was never very authoritarian as a parent, either. I always believed that kids deserve to be treated with respect and dignity, and taken seriously, from the time I was a kid myself! My husband has also mostly been pretty easygoing and non-authoritarian, as a dad.<br/>\n&gt; <br/>\n&gt; One of the reasons I like to hang around these unschool groups, in addition to thinking I can help newbies the way the older unschooling moms helped me when I started, is that I babysit for public school children after school, and school just sucks the life and soul right out of them - which is very stressful for me! This year I babysit for two boys, ages 11 and 12, whose parents are ridiculously strict with them, and it just makes me feel terribly conflicted when I&#39;m asked to enforce rules that I believe are bad and unjust. (But that&#39;s a whole other story. I can&#39;t afford to quit, and can&#39;t find another job, so far.) Anyway, hearing from unschoolers - even parents who are willing to CONSIDER unschooling - is like a breath of fresh air and sanity, for me!<br/>\n&gt; <br/>\n&gt; Linda<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"New to this group; long-time unschool mom","postDate":"1332562907","msgId":48078,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpramk0cityOWcwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":48082,"prevInTime":48077,"nextInTime":48079,"topicId":48078,"numMessagesInTopic":0,"msgSnippet":"Hi Group. :-) Someone on my state unschool group referred a newcomer to this group for more information, and, since I love to associate with as many","messageBody":"<div id=\"ygrps-yiv-1463681770\">Hi Group. :-)<br/>\n<br/>\nSomeone on my state unschool group referred a newcomer to this group for more information, and, since I love to associate with as many unschool-minded people as possible, I decided to join this group too.<br/>\n<br/>\nMy kids are 20 and 18. The 20 y.o. (my son) is in college and working p/t. My daughter is still at home, and hoping to start college in the fall. (It just occurred to me, we really need to start dealing with the FAFSA application for her.)<br/>\n<br/>\nWe took the kids out of school when they were in 3rd and 5th grades. I started off being a lot more skeptical of the public school system and its methods and &quot;have-to&quot;s than most parents, because I did not attend public school as a kid myself. I went to a small private Jewish school that was very different from public schools in a lot of important ways. I had never expected to have to put my kids into the public school system in the first place. But, due to our financial situation, that&#39;s what we ended up doing. Until I just got totally fed up with it and refused to send my kids back there anymore.<br/>\n<br/>\nSo, I started off doing what I&#39;d call relaxed, eclectic homeschooling. But after a couple of years, if that, we really became full-blown unschoolers. I had a lot of support and encouragement from older unschool moms whose kids were in their teens when we started, and from a really wonderful local homeschool group that included a great variety of different types of homeschoolers, including several unschoolers. And I read a lot about unschooling, even before I took the kids out of public school. One of the reasons we did school-ish stuff at all, at first, was to pacify my husband, who was NOT happy about the idea of homeschooling and had only reluctantly agreed to let us try it. But it didn&#39;t take him too long to see that the less &quot;school&quot; we had in our lives, the less stressful our lives were. And it was obvious that the kids were learning all the time, from everything they did.<br/>\n<br/>\nI was never very authoritarian as a parent, either. I always believed that kids deserve to be treated with respect and dignity, and taken seriously, from the time I was a kid myself! My husband has also mostly been pretty easygoing and non-authoritarian, as a dad.<br/>\n<br/>\nOne of the reasons I like to hang around these unschool groups, in addition to thinking I can help newbies the way the older unschooling moms helped me when I started, is that I babysit for public school children after school, and school just sucks the life and soul right out of them - which is very stressful for me! This year I babysit for two boys, ages 11 and 12, whose parents are ridiculously strict with them, and it just makes me feel terribly conflicted when I&#39;m asked to enforce rules that I believe are bad and unjust. (But that&#39;s a whole other story. I can&#39;t afford to quit, and can&#39;t find another job, so far.) Anyway, hearing from unschoolers - even parents who are willing to CONSIDER unschooling - is like a breath of fresh air and sanity, for me!<br/>\n<br/>\nLinda</div>","specialLinks":[]}],"prevTopicId":48048,"nextTopicId":48107}}