{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":78282269,"authorName":"Deb","from":"&quot;Deb&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: New Member--Intro :)","postDate":"1229112259","msgId":37303,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdodWc0Mys2YnRqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdodTZxNCszYmU3QGVHcm91cHMuY29tPg=="},"prevInTopic":37300,"nextInTopic":0,"prevInTime":37302,"nextInTime":37304,"topicId":37300,"numMessagesInTopic":0,"msgSnippet":"Hi Tawnya Yup, once you question whether typical schooling is necessary, then you start question all the other conventional wisdom - all the have to","messageBody":"<div id=\"ygrps-yiv-1578955859\">Hi Tawnya<br/>\n<br/>\nYup, once you question whether typical &#39;schooling&#39; is necessary, then <br/>\nyou start question all the other conventional &#39;wisdom&#39; - all <br/>\nthe &quot;have to&quot; stuff laying around in your head, both for you and for <br/>\nyour kids. Kids &quot;have to&quot; x and Moms &quot;have to&quot; y and so on. Dishes, <br/>\nvaccines, bedtimes, bathing, media, on and on it goes. Chipping away <br/>\nlittle by little at the pre-conceived notions and arriving at those <br/>\nthings that you really truly think are important for your own self - <br/>\nwhich may not carry over into things that are important for your <br/>\nkids. A useful question is Why? &quot;I&#39;m doing or asking for or expecting <br/>\nB. Why?&quot; Or, &quot;My child wants to Q. Why not?&quot; There may be real <br/>\nreasons why or why not - we don&#39;t have the money for that right now, <br/>\nit&#39;s 24 degrees outside so going outside in a swimsuit only could be <br/>\na problem, etc. But it doesn&#39;t stop there. It leads to &quot;how&quot; - how <br/>\ncan this need/want be met, what is the root of it, what are our <br/>\noptions (if you can&#39;t think of at least 2 options for just about <br/>\nanything, think some more) Okay so it&#39;s 24 degrees outside and a <br/>\nbathing suit just isn&#39;t going to cut it. We could wear bathing suits <br/>\nunderneath our jackets and sweat pants. We could wear bathing suits <br/>\nin the house and have a picnic in the living room like we do at the <br/>\nbeach. We could wear bathing suits in the tub and play. There&#39;s 3 and <br/>\nthere are probably more as well.<br/>\n<br/>\nYou might try, for yourself, to define what constitutes &quot;working&quot;. In <br/>\nthe conventional sense, what &quot;works&quot; is what makes the kids <br/>\nconveniently manageable for the adults. The kids obey the adults <br/>\nwithout a question; they go to bed when the adults say to, eat when <br/>\nthe adults prepare food, eat what the adults prepare, do the <br/>\nhousehold tasks the adults assign when they are told to, and so on. <br/>\nIf it&#39;s not &#39;working&#39;, there&#39;s usually a &#39;carrot/stick&#39; plan <br/>\nimplemented &quot;do x and you get y, or else you get z&quot; still based on <br/>\nthe adult&#39;s point of view and set of priorities. A change of view <br/>\nmight say that what &#39;works&#39; is that which meets the needs/priorities <br/>\nof the family as a whole, kids included (and maybe especially since <br/>\nthey start out &#39;behind&#39; in terms of access to resources). Often, it <br/>\nis not as convenient for the adults. However, in the big picture, the <br/>\nlong run, the whole enchilada, it seems to me (with my 10 yr old and <br/>\nseeing/knowing the older teens of others) that a smaller <br/>\ninconvenience with a 6 yr old ends up with something that <br/>\nis &quot;working&quot; better when that 6 yr old is 16.<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":328499124,"authorName":"Tawnya Ferdolage","from":"&quot;Tawnya Ferdolage&quot; &lt;tawferdo@...&gt;","profile":"tawferdo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"New Member--Intro :)","postDate":"1229102724","msgId":37300,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdodTZxNCszYmU3QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":37303,"prevInTime":37299,"nextInTime":37301,"topicId":37300,"numMessagesInTopic":0,"msgSnippet":"Hi Everyone, My name is Tawnya and I live in Ventura, CA. My husband, James, and I have three boys who are 8, 4 and almost 2.  I joined this list to see what","messageBody":"<div id=\"ygrps-yiv-873911381\">Hi Everyone,<br/>\n<br/>\nMy name is Tawnya and I live in Ventura, CA. My husband, James, and I <br/>\nhave three boys who are 8, 4 and almost 2.  I joined this list to see <br/>\nwhat &quot;real unschoolers&quot; do.  I am finding out more and more that <br/>\nunschooling is a lifestyle rather than a type of education.  I <br/>\n*think* I am an unschooler at heart who doesn&#39;t know how to get <br/>\nthere....but then I read some stuff here and think it may be way <br/>\noutside of my box...but then I began to question my box...and when I <br/>\nquestion my box, I begin to doubt that what I am currently doing <br/>\nis &quot;working&quot;...and that always leads me back to my inclination to <br/>\ntake the plunge and unschool.  It&#39;s like someone gave this mouse a <br/>\ncookie!  Anyway, only my 8 year old has been *officially* exposed <br/>\nto &quot;academics&quot; as we have enrolled in a ISP charter school a couple <br/>\nof times (one of them currently) and I have had him do &quot;schoolwork&quot; <br/>\nto suffice their requirements.  I seem to be in a cycle that&#39;s just <br/>\nnot working for any of us.  I am also starting to see how making the <br/>\nchoice to use a charter school and jump through their hoops, because <br/>\nthey will cover the expense of some of the things he is really <br/>\ninterested in, is changing the choices we make for our family!  We <br/>\nhave always wanted a big family, but now I question whether or not I <br/>\nshould plan another baby when I already have a hard time keeping up <br/>\nwith &quot;school&quot;..ugh!  I am not sure if this was a question or a vent, <br/>\nbut thanks for discussing and allowing me to read and learn.</div>","specialLinks":[]}],"prevTopicId":37271,"nextTopicId":37306}}