{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How do I get started with a 13-yr old  boy?","postDate":"1228349777","msgId":37143,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdoNzdnaCtxNHI3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdoMmdudis0bTcxQGVHcm91cHMuY29tPg=="},"prevInTopic":37136,"nextInTopic":0,"prevInTime":37142,"nextInTime":37144,"topicId":37132,"numMessagesInTopic":0,"msgSnippet":"... My stepson s mom periodically gets nervous about the whole radical unschooling thing - her other child is in school, and Ray was too, when he lived with","messageBody":"<div id=\"ygrps-yiv-917668677\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Anita&quot; &lt;raininspain@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; What if his father decides he <br/>\n&gt; needs to go back into class again?<br/>\n<br/>\n </span></blockquote>My stepson&#39;s mom periodically gets nervous about the whole radical <br/>\nunschooling thing - her other child is in school, and Ray was too, when <br/>\nhe lived with her, so she&#39;s very much invested in schoolish ideas. So <br/>\nsome of the &quot;documenting&quot; we do is aimed at reassuring her that Ray&#39;s <br/>\ndoing as well as, if not better than, he would in school. We do that by <br/>\nsort of &quot;translating&quot; Ray&#39;s everyday life into educational terms so she <br/>\ncan &quot;see&quot; some of the learning going on.<br/>\n<br/>\n For awhile we did that by means of a blog, but now we&#39;ve switched to <br/>\nmore direct conversations. Does your son&#39;s father live with you? I <br/>\ndidn&#39;t want to assume, since you didn&#39;t refer to him as a husband or <br/>\npartner. If he does, try to tell him at least one thing every day - <br/>\nsome pleasant story about your son&#39;s daily life. It doesn&#39;t have to <br/>\nbe &quot;this is what he learned about today&quot; in fact, its probably better <br/>\nif it isn&#39;t about that. Better to give dad a way to touch base with his <br/>\nson and the family - dads *need* that! It helps them feel like they&#39;re <br/>\na valuble part of the family (I say dads, but it applies to any parent <br/>\nwho works out of the home). If he has computer access at work, email <br/>\nhim or start a blog so he can &quot;check in&quot; with the family from time to <br/>\ntime. Makes sure to send lots of pix!<br/>\n<br/>\nIf you can help you son&#39;s dad feel more involved in his life, he&#39;s far <br/>\nfar less likely to say &quot;back to school!&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;How <br/>\n&gt; do I make sure he gets what he needs? <br/>\n<br/>\n </span></blockquote>Its important to take some time to think about what you think a <br/>\nperson &quot;needs&quot; to live in the world. With all the many varied <br/>\npossibilities stretching out into the future, what does any one person <br/>\nneed? Thats a big, philosophical question! Try to avoid getting <br/>\nsidetracked by worrying about standards and grade-levels <br/>\nand &quot;readiness&quot; as you think about that. The big, philosophical answers <br/>\nyou come up with may seem unsatisfying Because they aren&#39;t going to be <br/>\nthings you can teach or assure. How can you teach self-confidence? How <br/>\ncan you assure integrity? Its so much easier to cling to questions <br/>\nabout science and math and how much foreign language? In the long run, <br/>\nthe answers to those, simpler questions - the academic questions - are <br/>\nthings you can have no way of ever possibly knowing. No crystal ball <br/>\nwill show you your son in twenty years.<br/>\n<br/>\nHow do unschoolers know if our kids are getting what they need? We look <br/>\nat our kids and talk with our kids and play and cuddle and simply Be in <br/>\ntheir precious company. If one of my kids is struggling in some way, <br/>\nI&#39;ll work to help out. Recently both my kids wanted their dad to engage <br/>\nwith them a bit more and each told me in different ways. So I&#39;ve been <br/>\nworking to help that happen - helping build bridges of love and <br/>\ncommunication and trust. All people benefit from those and people of <br/>\nevery age benefit from helping build those kinds of bridges.<br/>\n <br/>\nOne of the advantages of moving to radical unschooling with a teen is <br/>\nyou get to watch him soften. If you give him the opportunity, he&#39;ll <br/>\nslowly shed many of those layers of resistance and indifference that <br/>\nhe&#39;s built up as a kind of coping mechanism in school. To allow that to <br/>\nhappen, you have to shed some of your own layers. Here&#39;s a link to some <br/>\ninformation about deschooling for parents:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; P.S. He is far too internet savvy and I have to keep chasing him away <br/>\n&gt; from the dark side of MySpace.<br/>\n<br/>\n </span></blockquote>Trying to keep him away from things will more likely lead to him being <br/>\nsneaky and &quot;getting in deeper&quot; than he would have otherwise. I don&#39;t <br/>\nknow what you mean by &quot;dark side&quot; entirely, but Ray (now 15) has had <br/>\nhis forays into the world of internet porn. He&#39;s been interested, <br/>\ntitilated, disgusted, scandalized... the whole range of reactions. What <br/>\nhe hasn&#39;t felt a need to do is to look at things he&#39;s not comfortable <br/>\nwith as a way of defying his parents or proving something. He can close <br/>\nthe window and Tell His Dad that he was upset or disgusted or freaked <br/>\nout. <br/>\n<br/>\nIn fact, it was at Ray&#39;s request that we stopped allowing one of our <br/>\nneighbors to check email on our computer - the fellow was looking at <br/>\nsome pretty gross porn sites and Ray happened across them in <br/>\nthe &quot;history&quot; went to look and was horrified - and came straight to me <br/>\nand George. Exactly what you&#39;d want your kid to do, right? But so many <br/>\nkids won&#39;t do that bc they don&#39;t want to face the &quot;tenth degree&quot; of why <br/>\ndid they go to that site? why did they even want to look? Haven&#39;t I <br/>\nwarned you...? <br/>\n<br/>\nDeveloping that kind of relationship, when you&#39;ve been &quot;chasing him <br/>\naway from the dark side&quot; will take more than just throwing up your <br/>\nhands and saying &quot;I can&#39;t stop you!&quot; Find a way to talk with your son <br/>\nabout your concerns *and* let him know that you&#39;re willing to Trust <br/>\nhim. Ask him (maybe in a separate context) if he feels like he&#39;s <br/>\nlacking some resources. Many times kids check out &quot;the dark side&quot; of <br/>\nany of a number of topics bc its an obvious source of information <br/>\n(right or wrong, its a place to start). Consider finding another adult <br/>\nwho&#39;s willing to play mentor to your guy so he has someone other than <br/>\nhis parents he can open up to, ask difficult questions, that sort of <br/>\nthing. Ray has a couple adult friends who act in that capacity. <br/>\nSometimes they pass information on to me and George, sometimes not - <br/>\ninterestingly, sometimes Ray will ask one of his adult friends to <br/>\ndiscuss a topic *for* him, if he&#39;s shy about bringing it up himself. <br/>\n<br/>\nOne of the things that people of all ages need (linking back to that <br/>\npart of your question) is to have some trust - to be able to trust, and <br/>\nto feel trusted. You have a wonderful opportunity to offer that trust <br/>\nto your son. To be a trusted ally and a person who offers up trust as a <br/>\ngift. Bringing more Trust into our kids&#39; lives is a big, big part of <br/>\nwhat allows unschooled teens to be softer, less defensive. <br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] How do I get started with a 13-yr old  boy?","postDate":"1228307854","msgId":37136,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4RENBNjgxLTdEMzctNDYxNC1CNzI0LTE0MkRGNzlDOEIxMEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGdoMmdudis0bTcxQGVHcm91cHMuY29tPg==","referencesHeader":"PGdoMmdudis0bTcxQGVHcm91cHMuY29tPg=="},"prevInTopic":37135,"nextInTopic":37143,"prevInTime":37135,"nextInTime":37137,"topicId":37132,"numMessagesInTopic":0,"msgSnippet":"... Not sure what this is, but whatever it is, it s not going to work. You can t stop an interest by chasing someone away from it. You ll only increase the","messageBody":"<div id=\"ygrps-yiv-615073505\">On Dec 2, 2008, at 12:23 AM, Anita wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; P.S. He is far too internet savvy and I have to keep chasing him away<br/>\n&gt; from the dark side of MySpace.<br/>\n<br/>\n </span></blockquote>Not sure what this is, but whatever it is, it&#39;s not going to work.  <br/>\nYou can&#39;t stop an interest by chasing someone away from it. You&#39;ll  <br/>\nonly increase the curiosity and, worse, you&#39;ll teach him to be sneaky  <br/>\nin order to get to it.<br/>\n<br/>\nControl is an illusion. Kids can learn to act obedient, but will  <br/>\nlearn to do what they want out of parents&#39; sight. Is that what you want?<br/>\n<br/>\nKeep the lines of communication open. Ask what he likes about it  <br/>\nwithout ever saying &quot;but&quot;. Don&#39;t try to dissuade him. Don&#39;t give him  <br/>\nthe idea that you&#39;re gathering ammunition on ways to shut him down  <br/>\nbecause then he&#39;ll shut up. You have the opportunity to be an  <br/>\ninfluence in his life, a trusted person he comes to for advice. If  <br/>\nyou try to control him, he&#39;ll go elsewhere for advice.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How<br/>\n&gt; do I make sure he gets what he needs?<br/>\n<br/>\n </span></blockquote>Needs for what, though? Needs for life or needs for school?<br/>\n<br/>\nWe don&#39;t even question that school is providing what kids need, but  <br/>\nwhat percentage of what you learned in school do you actually need  <br/>\nand use?<br/>\n<br/>\nWhat we need is what helps us explore and further and use our  <br/>\ninterests. And the best way to get it is by exploring our interests.<br/>\n<br/>\nDespite what educators suggest from the ways schools are run, we  <br/>\ndon&#39;t need to learn before we &quot;do&quot;. Humans are hardwired to learn  <br/>\n*by* doing, not before doing. That&#39;s why schools have such a hard  <br/>\ntime teaching. They&#39;re going against our natural ways of learning.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What if his father decides he<br/>\n&gt; needs to go back into class again?<br/>\n<br/>\n </span></blockquote>What if you knew he&#39;d break a leg next year? Would you break it now  <br/>\nso he&#39;d be used to it?<br/>\n<br/>\nI know that sounds sarcastic, but if a child might end up in a place  <br/>\nthat&#39;s not the best, then why disrupt what&#39;s good for what&#39;s bad (and  <br/>\nmight not even happen)?<br/>\n<br/>\nIf it does happen, then you can tackle it at the time. It *doesn&#39;t*  <br/>\ntake 8 years to prepare for 9th grade. If he&#39;s there willingly, he  <br/>\ncan catch up as he goes. If he&#39;s there unwillingly, it will take  <br/>\nlonger, but still not a reason to compromise the right now for an  <br/>\nuncertain future that won&#39;t do him any good.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How can I make sure I provide him<br/>\n&gt; with experiences that I can document for transfer?<br/>\n<br/>\n </span></blockquote>By becoming as well informed as you can about homeschooling laws in  <br/>\nyour state. (Check at http://www.nhen.org) *Don&#39;t* try to make him  <br/>\nlook like a recreation of a schooled child. *Do* make him look like a  <br/>\nchild who is out exploring the world.<br/>\n<br/>\nOne day people are going to look at schools and wonder how anyone  <br/>\ncould possibly learn locked away from the world absorbing predigested  <br/>\ninformation. Unschooled kids are the ones out in the world learning  <br/>\nabout the world hands on. Their education is far superior.<br/>\n<br/>\nHere&#39;s a couple of things to read:<br/>\n<br/>\nhttp://sandradodd.com/schoolchoice<br/>\nhttp://sandradodd.com/joyce/products<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] How do I get started with a 13-yr old  boy?","postDate":"1228289623","msgId":37135,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUzRjA4QUE2LUFCRTctNDFDRi1CQjUxLUM4QTlERDYyMUUyRkBtYWMuY29tPg==","inReplyToHeader":"PGdoMmdudis0bTcxQGVHcm91cHMuY29tPg==","referencesHeader":"PGdoMmdudis0bTcxQGVHcm91cHMuY29tPg=="},"prevInTopic":37132,"nextInTopic":37136,"prevInTime":37134,"nextInTime":37136,"topicId":37132,"numMessagesInTopic":0,"msgSnippet":"... What s that? I m sure people will step in and respond to the rest of your questions, but it is late and I have to go to bed, but I m curious about the","messageBody":"<div id=\"ygrps-yiv-1709893690\">On Dec 1, 2008, at 9:23 PM, Anita wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; P.S. He is far too internet savvy and I have to keep chasing him away<br/>\n&gt; from the dark side of MySpace.<br/>\n<br/>\n </span></blockquote>What&#39;s that?<br/>\n<br/>\nI&#39;m sure people will step in and respond to the rest of your  <br/>\nquestions, but it is late and I have to go to bed, but I&#39;m curious  <br/>\nabout the &quot;dark side of MySpace.&quot;<br/>\n<br/>\nYou might want to mention why you&#39;ve taken him out of school - what  <br/>\nare your reasons for homeschooling?<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":328107268,"authorName":"Anita","from":"&quot;Anita&quot; &lt;raininspain@...&gt;","profile":"rainispain2007","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"How do I get started with a 13-yr old  boy?","postDate":"1228195391","msgId":37132,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdoMmdudis0bTcxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":37135,"prevInTime":37131,"nextInTime":37133,"topicId":37132,"numMessagesInTopic":0,"msgSnippet":"I have a 13-yr old son whose had some classroom school and some homeschooling?  He is currently using a computer-driven program.  How do I make sure he gets","messageBody":"<div id=\"ygrps-yiv-2000645507\">I have a 13-yr old son whose had some classroom school and some <br/>\nhomeschooling?  He is currently using a computer-driven program.  How <br/>\ndo I make sure he gets what he needs?  What if his father decides he <br/>\nneeds to go back into class again?  How can I make sure I provide him <br/>\nwith experiences that I can document for transfer? <br/>\n<br/>\nP.S. He is far too internet savvy and I have to keep chasing him away <br/>\nfrom the dark side of MySpace.</div>","specialLinks":[]}],"prevTopicId":37138,"nextTopicId":37137}}