{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":15,"messages":[{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Food and other issues","postDate":"1253116704","msgId":41477,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDQzYxOEE3N0YzNTQzNUU4RTY1MDMxRkNFRDY0RDk5QGJpZ3N1cnByaXNlPg=="},"prevInTopic":41463,"nextInTopic":0,"prevInTime":41476,"nextInTime":41478,"topicId":41426,"numMessagesInTopic":0,"msgSnippet":"***You all say that you want to teach your children to become independent thinkers and voice their own opinions,*** I don t want to teach my child.   Please","messageBody":"<div id=\"ygrps-yiv-1321775654\">***You all say that you want to teach your children to become independent<br/>\nthinkers and voice their own opinions,***<br/>\n<br/>\nI don&#39;t want to &quot;teach&quot; my child.   Please read here: www.sandradodd.com/teaching/<br/>\n<br/>\nI don&#39;t believe my child needs anyone to &quot;teach&quot; him to think for himself.  He was born with his own brain.  He has his own experiences.   He needs to feel free to think differently from me and his dad.   Do you want to talk about the difference? <br/>\n<br/>\n***as soon as someone comes on here with a different<br/>\nopinion or a different way of doing things, they are bashed.***<br/>\n<br/>\nMaybe you could read the posting guidelines again.  If you disagree with the way other posters are responding to posts, take responsibility and post the way you believe would better contribute to understanding.  <br/>\n<br/>\nPeople who want to offer advice here should be certain it will help people understand unschooling.   If a person is new to the idea of unschooling and offers advice that will muddle understanding then we have a responsibility to point that out.  This list has a specific purpose. <br/>\n<br/>\n***I mean, would you really call your kid sick or tell them<br/>\nthat they have some &quot;sick ways&quot; of doing something? ***<br/>\n<br/>\n If my son showed a child or anyone a gruesome photo they did not want to see I would *absolutely* tell him to stop and never do it again and tell him why.  That&#39;s really twisted.  Seriously. <br/>\n<br/>\n***Seriously, would you<br/>\ntalk to them the same way, or are they your equals but adults are not?***<br/>\n<br/>\nDo you think adults who join a discussion list want to be treated like children?   Do you need me or other posters here to be your mom?  I&#39;m not being snarky, I&#39;m asking pointedly so you can try to make the distinction between discussion on a list with two thousand strangers and what happens at home between mother and child.   <br/>\n<br/>\n***how ARE you going to treat your kids, like you treat some people on<br/>\nhere?***<br/>\n<br/>\nMost and probably all of us are unschooling because we&#39;ve thought a lot about traditional parenting and the importance of living respectfully with children.  Many people here have been writing on lists for years in order to help other people understand the value of living respectfully with their kids.   My kid is not a mother who deliberately controls what her little children see and eat and think in order to make sure they end up thinking exactly like her, so there&#39;s no reason for me to tell him the same things I&#39;d tell that woman.   I don&#39;t need to tell my son not to show little children pictures of dead people.  He already knows that&#39;s abusive.   If all the people who came to this list had the same understanding of the value of unschooling and living respectfully with children that my son has, there&#39;d be no reason to maintain the list. <br/>\n<br/>\nBut some people who come here chose to post without reading the guidelines, or the archives, without much understanding of unschooling or the purpose of the list and so they get information about those things.  <br/>\n<br/>\n***Can we not offer up advice/suggestions without the harshness? ***<br/>\n<br/>\n&quot;We&quot; are all different people with different styles.  Where you see harshness others see honesty, frankness, directness.  If you do not like the way someone is posting, remind yourself you don&#39;t get to control how others chose to respond but you have absolute control over yourself.  Post the way you think is best.  Let others do the same.<br/>\n<br/>\n*** I have very strong opinions on the food issue but have<br/>\nrefrained from even contributing to this because of the level of hostility<br/>\nthat has come with it. It&#39;s just not worth it.***<br/>\n<br/>\nIf your opinion will not help others understand unschooling then it doesn&#39;t belong on this list.  If you don&#39;t understand why controlling food does not contribute positively to unschooling then ask questions.   Questions about how unschooling parents have addressed food concerns belong here.  <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Food and other issues","postDate":"1253098828","msgId":41463,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5ODNBRDM1LTZGOEQtNEY1Ny04MkUxLUQ1RjJFODAxRUYzNEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEI1QzFEMUEyLTI4NDYtNEU0Qy05RDhFLTY0NTc2QzUwMURCRUB2ZXJpem9uLm5ldD4=","referencesHeader":"PDRBQUY5RjVGLjQwMTA4MDVAY29tY2FzdC5uZXQ+IDwwNDVjMDFjYTM2MzQkMWM4N2M2YTAkNTU5NzUzZTAkQGNvbT4gPEI1QzFEMUEyLTI4NDYtNEU0Qy05RDhFLTY0NTc2QzUwMURCRUB2ZXJpem9uLm5ldD4="},"prevInTopic":41462,"nextInTopic":41477,"prevInTime":41462,"nextInTime":41464,"topicId":41426,"numMessagesInTopic":0,"msgSnippet":"... I think one of the things some new people don t realize is that we aren t all equals stumbling along doing the best we can trying to be the best parents we","messageBody":"<div id=\"ygrps-yiv-662398310\">On Sep 16, 2009, at 6:43 AM, Joyce Fetteroll wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But most people don&#39;t have access to a huge<br/>\n&gt; chunk of people who are doing all the things you shouldn&#39;t, examining<br/>\n&gt; the results and tweaking what they&#39;re doing ;-)<br/>\n<br/>\n </span></blockquote>I think one of the things some new people don&#39;t realize is that we  <br/>\naren&#39;t all equals stumbling along doing the best we can trying to be  <br/>\nthe best parents we can be.<br/>\n<br/>\nThat sounds snooty ;-) But we aren&#39;t just guessing. We&#39;re tearing  <br/>\nideas apart and examining them. We&#39;re seeing what happens in real  <br/>\nlife with our own kids and others kids. We&#39;re asking *why*  <br/>\nunschoolers see different results than conventional parents and  <br/>\ndifferent results than 90% of the people say we will. We&#39;re holding  <br/>\nrelationships as the central core of the belief system and finding  <br/>\nways not to compromise that as we fit in the rest of life.<br/>\n<br/>\nIf we tell people that a certain tool they&#39;ve depended on -- like  <br/>\ncontrol, like timeouts, like consequences -- isn&#39;t part of the  <br/>\nrepertoire here, it&#39;s natural for them to assume we then do nothing.<br/>\n<br/>\nIt&#39;s sort of like telling someone in LA that you don&#39;t have a car.  <br/>\nTheir natural first thought might be &quot;So you never leave the house?&quot;  <br/>\nBut the real answer is you might walk. Someone needs to get out  of  <br/>\nthe sprawling city of control and school in order to understand how  <br/>\nto navigate a life where the essentials are in walking distance.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Food and other issues","postDate":"1253097833","msgId":41461,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI1QzFEMUEyLTI4NDYtNEU0Qy05RDhFLTY0NTc2QzUwMURCRUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDA0NWMwMWNhMzYzNCQxYzg3YzZhMCQ1NTk3NTNlMCRAY29tPg==","referencesHeader":"PDRBQUY5RjVGLjQwMTA4MDVAY29tY2FzdC5uZXQ+IDwwNDVjMDFjYTM2MzQkMWM4N2M2YTAkNTU5NzUzZTAkQGNvbT4="},"prevInTopic":41458,"nextInTopic":41462,"prevInTime":41460,"nextInTime":41462,"topicId":41426,"numMessagesInTopic":0,"msgSnippet":"... I think one kind of person accepts they re imperfect and doesn t see their identity tied to their choices. They re willing to hold up their choices and","messageBody":"<div id=\"ygrps-yiv-1738875656\">On Sep 15, 2009, at 2:41 PM, Crystal wrote:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Well, as soon as someone comes on here with a different<br/>\n&gt; opinion or a different way of doing things, they are bashed.<br/>\n<br/>\n </span></blockquote>I think one kind of person accepts they&#39;re imperfect and doesn&#39;t see  <br/>\ntheir identity tied to their choices. They&#39;re willing to hold up  <br/>\ntheir choices and examine them in public to find something better.<br/>\n<br/>\nOther people feel their identity tied to their decisions. When faced  <br/>\nwith questions about their choices, they feel as though they  <br/>\npersonally were being examined and their flaws pointed out.<br/>\n<br/>\nI think part of the problem is that most of us never learned how to  <br/>\nmake decisions. We may have been raised to toe the line our parents  <br/>\nlaid out for us. Going beyond that line can be nerve wracking because  <br/>\nwe don&#39;t know how to look at a situation objectively and weigh the  <br/>\npros and cons to make an informed decision. Many people are relieved  <br/>\nto grasp the solution feels least scary and hope for the best. To ask  <br/>\nthem to question their decision fills them with fear and doubt. But  <br/>\ntheir goal is a protective bubble that keeps away the fears. They  <br/>\ndon&#39;t want to question because they don&#39;t feel confident they can  <br/>\nclearly think through all the factors and learn what they need to  <br/>\nlearn to come up with the right answer.<br/>\n<br/>\nMost of us are like that in some aspects of life. Some people enjoy  <br/>\nthe inner workings of cars. Some would rather hand it over to a  <br/>\nmechanic they hope they can trust and get it fixed.<br/>\n<br/>\nBut here, on this list, the purpose is to examine our choices. We  <br/>\ndiscuss *why* something works; and why something else appears to work  <br/>\nbut is doing silent damage; and why this way will move you toward a  <br/>\nbetter relationship and that way will move you away. We don&#39;t just  <br/>\nopen up the hood, we delve into the inner workings and talk about why  <br/>\nthings work.<br/>\n<br/>\nI think the biggest flaw of conventional parenting is that it treats  <br/>\nkids as though they were alien creatures who work differently than  <br/>\nadults. Conventional parenting has parents treating their kids in  <br/>\nways they would never treat a friend for fear of losing their  <br/>\nfriendship. (Of course<br/>\n<br/>\nBut there *is* a way to be a child&#39;s supporter and help them navigate  <br/>\nthrough their childhood in a way that allows them to blossom into  <br/>\ntrustworthy, competent adults. We don&#39;t need to sacrifice our  <br/>\nrelationships in order to have that. We can put relationship first  <br/>\nand fit everything around that. If someone wants to know how to do  <br/>\nthat, there are people here who&#39;ve figure out how to do that and can  <br/>\nanswer questions. If someone has a need to share their own ideas that  <br/>\nlead away from better relationships, this isn&#39;t the place for it.<br/>\n<br/>\nRachel&#39;s ideas aren&#39;t being dismissed. They&#39;ve been thoroughly  <br/>\nexamined for ways they damage kids and relationships. We have ideas  <br/>\nthat don&#39;t compromise on those, that *also* protects our kids from  <br/>\nreal well examined dangers.<br/>\n<br/>\nIt&#39;s much more comforting to soothe our fears than to examine them.  <br/>\nIt&#39;s reasonable to assume what we fear is more complex than we can  <br/>\nunderstand and so it&#39;s better to be safe and avoid the danger than  <br/>\nsorry. It&#39;s reasonable to fear that kids playing realistic shooting  <br/>\ngames will eventually find the thrill and challenge of the game isn&#39;t  <br/>\nenough. It&#39;s not a great stretch to picture the Columbine shooters as  <br/>\nbeing influenced by the the violent movies they watched and violent  <br/>\nvideo games (like Doom) they played. It&#39;s one of the things that set  <br/>\nthem apart from other students so fear makes us want to connect it.  <br/>\nRaising kids right seems like a crap shoot so we want to control as  <br/>\nmuch as we can.<br/>\n<br/>\nBut control isn&#39;t the answer. Control -- just as with any human being  <br/>\n-- drives them away. (If we have a choice, do we choose a dictator  <br/>\nboss or one who meshes leadership and teamwork?) Thought and  <br/>\nexamination are better. But most people don&#39;t have access to a huge  <br/>\nchunk of people who are doing all the things you shouldn&#39;t, examining  <br/>\nthe results and tweaking what they&#39;re doing ;-) Right here we have a  <br/>\nhuge experiment going on with freedom with video games and food and  <br/>\nlearning. People here have the goal of great relationships and  <br/>\nhelping their kids navigate the world safely and respectfully. It&#39;s  <br/>\nwisdom that anyone examining their fears about the &quot;shouldn&#39;t&quot;s in  <br/>\nlife can tap into if they ask. If someone comes in and insists  <br/>\nviolent video games are so frighteningly dangerous that to keep kids  <br/>\naway she will show her kids pictures of dead children, that idea is  <br/>\nso counter to the reality we see in our own kids that it needs a big  <br/>\n&quot;Whoa!&quot; That&#39;s a great big fear built on nothing but fear. It&#39;s not  <br/>\nsomething that will help anyone build a better relationship with  <br/>\ntheir kids! And if they want to, they need to crawl out of that  <br/>\nprotective bunker and see what the real world looks like.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Food and other issues","postDate":"1253097830","msgId":41462,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVCRjE4RTMyLTdGQUMtNEFCNS05QkRBLUNDQTQzQjJGQjQyNkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDA0NWMwMWNhMzYzNCQxYzg3YzZhMCQ1NTk3NTNlMCRAY29tPg==","referencesHeader":"PDRBQUY5RjVGLjQwMTA4MDVAY29tY2FzdC5uZXQ+IDwwNDVjMDFjYTM2MzQkMWM4N2M2YTAkNTU5NzUzZTAkQGNvbT4="},"prevInTopic":41461,"nextInTopic":41463,"prevInTime":41461,"nextInTime":41463,"topicId":41426,"numMessagesInTopic":0,"msgSnippet":"... I know it s not the point of your post, but we don t teach them. We trust that as we tackle together the bumps in life between them and what they want, as","messageBody":"<div id=\"ygrps-yiv-307571516\">On Sep 15, 2009, at 2:41 PM, Crystal wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You all say that you want to teach your children to become independent<br/>\n&gt; thinkers and voice their own opinions, right?<br/>\n<br/>\n </span></blockquote>I know it&#39;s not the point of your post, but we don&#39;t teach them. We  <br/>\ntrust that as we tackle together the bumps in life between them and  <br/>\nwhat they want, as we trust them to be thinking, loving creatures --  <br/>\neven before they&#39;ve picked up the skills that demonstrate their  <br/>\ncapacity to others, that they will pick up the skills to be more and  <br/>\nmore independent.<br/>\n<br/>\nIt&#39;s an important distinction for unschoolers! Conventional thinking  <br/>\nputs teaching and learning in the same box, emphasizing what&#39;s the  <br/>\nsame about them: both being about changes happening inside the child.  <br/>\nUnschooling thinking puts them in separate boxes to emphasize their  <br/>\ndifferences. Teaching is about moving information into someone else.  <br/>\nLearning is about pulling it in (often without realizing it!)<br/>\n<br/>\nIt helps someone see unschooling clearer if they remove the idea of  <br/>\nteaching from their tool box. It&#39;s not that kids won&#39;t be learning  <br/>\ntons from us! But it helps people learn to reframe the standard  <br/>\nquestions that normally lead to solutions involving pushing  <br/>\ninformation into kids or controlling their behavior. Like &quot;How do I  <br/>\nget them to treat each other nicer?&quot; &quot;How do I get them to eat  <br/>\nhealthier?&quot; &quot;How do I get them to stop watching so much TV?&quot;<br/>\n<br/>\nThe better questions to ask are &quot;How can I help meet their needs?&quot;  <br/>\n&quot;How can I create an environment that makes it easier to choose  <br/>\nwhat&#39;s safe and respectful?&quot; and &quot;How can I stop worrying?&quot; ;-)<br/>\n<br/>\n*Support* lists are where people are nurtured and soothed for where  <br/>\nthey are. By signing onto a *discussion* list, someone is saying  <br/>\n&quot;Help me figure out how to do this.&quot; Support lists are like a chat in  <br/>\na cafe where people compare their aches and pains and soothe each  <br/>\nother. Discussion lists are more like information booths where we  <br/>\nfocus on where someone wants to get in the most efficient way  <br/>\npossible. (That&#39;s not a great analogy because for those who love  <br/>\ndiscussion lists, they feel like a lively cafe where the discussion  <br/>\nis focused and intense. :-)<br/>\n<br/>\nA discussion list is like a when a child decides they need help with  <br/>\nsomething and asks. It would be rude to offer words of support for  <br/>\nhow great they are as human beings. They&#39;re *saying* I&#39;m not getting  <br/>\nthis and need help.<br/>\n<br/>\nI *know* some people are saying: &quot;But the help doesn&#39;t need to be  <br/>\nrude!&quot; ;-) (The help, though, to Rachel at the beginning was patient.  <br/>\nShe was amused by this home&#39;s owner asking her to follow the house  <br/>\nrules. *She* insisted, after Ren asked her to read more and post  <br/>\nless,  that her ideas were more important than the ideas the people  <br/>\non the list had gathered to explore.)<br/>\n<br/>\nAs for the perceived rudeness of responses, what&#39;s hard for many  <br/>\npeople to grasp about discussion lists is that each response is  <br/>\nintended to help anyone who is following a thread, not just the  <br/>\noriginal poster. We&#39;re discussing the ideas people bring up, not  <br/>\nindividuals -- even though someone&#39;s personal experience is used as a  <br/>\nway to discuss broader ideas. To help the people who signed on for  <br/>\nthe purpose of the list, we need to discuss ways around the stumbling  <br/>\nblocks people bring up.<br/>\n<br/>\nMy personal opinion is that support groups feel more helpful than  <br/>\nthey really are. The purpose often is to help people feel better  <br/>\nabout who they are, feel better about not being perfect. But that  <br/>\nhelps them feel better about going with the flow and letting change  <br/>\nhappen slowly. But kids don&#39;t have years to wait while parents learn.  <br/>\nConventional parenting*, conventional schooling is slowly and  <br/>\ninsidiously damaging to children&#39;s psyches and the relationships  <br/>\nbetween them and their parents.<br/>\n<br/>\n(* Maybe it&#39;s better written as protective parenting and prophylactic  <br/>\nschooling, since what Rachel wrote wasn&#39;t conventional but it was  <br/>\nprotective as she presented ways to scare her children away from the  <br/>\nvideo games she believed even were scarier than pictures of dead  <br/>\nchildren. That&#39;s some *big* baggage that&#39;s going to hurt her kids and  <br/>\nher relationship with them if they ever dare think that a violent  <br/>\nvideo game is intriguing.)<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":362437716,"authorName":"Paul & Camille","from":"&quot;Paul & Camille&quot; &lt;morlingfamily@...&gt;","profile":"campaulmace","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] a different kind of parenting","postDate":"1253071858","msgId":41458,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwNURDNEIzRDZCQzRGQzE5NEVEQzVFMTVCQUFCNDAxQHlvdXJxOTRianZ0bDByPg==","referencesHeader":"PGg4cGJudCtzdjcxQGVHcm91cHMuY29tPg=="},"prevInTopic":41453,"nextInTopic":41461,"prevInTime":41457,"nextInTime":41459,"topicId":41426,"numMessagesInTopic":0,"msgSnippet":"I loved that Meredith :) I am new to unschooling, and at first I was reading reading all I could about unschooling .  I had heard it mentioned a number of","messageBody":"<div id=\"ygrps-yiv-1124999279\">I loved that Meredith :)<br/>\n<br/>\nI am new to unschooling, and at first I was reading reading all I could about &#39;unschooling&#39;.  I had heard it mentioned a number of times about the parenting side, but couldnt wrap my head around that really at the time.  As Ive listened in and become more accustom to it all, it has suddenly clicked into place for me and its a really wonderful place to be.  Not only is it more freeing and lovely for my son, but its the same for me.  For example, why have fights over what he wants to eat - you must eat blah blah when hes happy to eat something else.  He does have candy sometimes, but is it all he eats - NO, how could it be, lets face it eating candy all day wouldnt make us feel good.   Actually he will have some new candy and say nope I dont like that - its no different if it is candy or a fruit, he either likes it or he doesnt.  <br/>\n<br/>\nAnyway Im getting off topic here, but Im really enjoying the way the group is, and I dont believe its bashing anyone else by disagreeing with their opinions, for the most part people were trying to help give her a different perspective & help her see the gentler way - However,  I dont think things like cooking kittens on the BBQ, or showing kids pics of dead babies  lying by their slaughtered Moms is ever going to be tolerated anywhere - and it actually IS a sick thought - I know I felt sick.  Im sorry that Rachel didnt listen more and was so upset and defensive; but Im not sorry that people told her how offensive what she said was, because it was.  Also the &#39;bashing&#39; was due to these comments and not before, so in reality Rachel instigated the situation from my POV.<br/>\n<br/>\nCamille<br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":367169565,"authorName":"Melissa Gray","from":"Melissa Gray &lt;melissagr8@...&gt;","profile":"graymamacita","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] a different kind of parenting","postDate":"1253069456","msgId":41453,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1QjQwOENDLTNCMjEtNEJCMC04Mzc5LUMxQjUyMTJDQTVDOEBnbWFpbC5jb20+","inReplyToHeader":"PGg4cGJudCtzdjcxQGVHcm91cHMuY29tPg==","referencesHeader":"PGg4cGJudCtzdjcxQGVHcm91cHMuY29tPg=="},"prevInTopic":41451,"nextInTopic":41458,"prevInTime":41452,"nextInTime":41454,"topicId":41426,"numMessagesInTopic":0,"msgSnippet":"Meredith, Josh really likes the way you said this. He said thanks! I like it to, for what that s worth.  ;-) Melissa Mom to Joshua, Breanna, Emily, Rachel,","messageBody":"<div id=\"ygrps-yiv-46391936\">Meredith,<br/>\nJosh really likes the way you said this. He said thanks!<br/>\nI like it to, for what that&#39;s worth.  ;-)<br/>\n<br/>\nMelissa<br/>\nMom to Joshua, Breanna, Emily, Rachel, Samuel, Daniel, Avari, and  <br/>\nbaby Nathan!<br/>\nWife to Zane<br/>\n<br/>\nblog me at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives.blogspot.com/\">http://startlinglives.blogspot.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://startlinglives365.blogspot.com\">http://startlinglives365.blogspot.com</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sep 15, 2009, at 7:33 PM, plaidpanties666 wrote:<br/>\n<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Crystal&quot; &lt;crystal@...&gt;  <br/>\n&gt; wrote:<br/>\n&gt; &gt;&gt; Well, as soon as someone comes on here with a different<br/>\n&gt; &gt; opinion or a different way of doing things, they are bashed.  <br/>\n&gt; Isn&#39;t that a<br/>\n&gt; &gt; double standard?<br/>\n&gt;<br/>\n&gt; This is one of the reasons its recommended that newcomers to the  <br/>\n&gt; list read for a while before posting - there&#39;s a particular &quot;style&quot;  <br/>\n&gt; to unschooling discussion groups that&#39;s somewhat unique. Its not a  <br/>\n&gt; debate style, nor is it a chat or support-group style. Most often,  <br/>\n&gt; what happens is someone throws out an idea, a scenario or a  <br/>\n&gt; problem, and then group members reframe the situation taking into  <br/>\n&gt; account the possible points of view of the children. Exaclty how  <br/>\n&gt; they phrase that is going to vary depending on individual  <br/>\n&gt; personalities and writing styles, and a certain amount of how its  <br/>\n&gt; read can get lost in the &quot;tone&quot; the reader projects onto the  <br/>\n&gt; writing. Hence the suggestion to pretend any post is being  <br/>\n&gt; delivered kindly, by a good friend. It changes the way you read in  <br/>\n&gt; a Biiiiiiig way.<br/>\n&gt;<br/>\n&gt; Most parenting relies on the assumption that parents must  <br/>\n&gt; periodically be unkind to their children for the sake of the  <br/>\n&gt; wellbeing of those children. A great deal of parenting revolves  <br/>\n&gt; around ideas of &quot;for their own good&quot; and &quot;children Have to learn&quot;.  <br/>\n&gt; Unschooling starts from a totally different perspective. We start  <br/>\n&gt; from the assumption that children Love to learn, that they crave  <br/>\n&gt; learning! So its not a matter of kids Having to learn anything  <br/>\n&gt; specific, its a matter of helping children explore the world in  <br/>\n&gt; ways that let them learn to their hearts content. In the process,  <br/>\n&gt; they Will learn about their bodies, nutrition, food, math,  <br/>\n&gt; sciences, literature, ethics, problem solving, communication,  <br/>\n&gt; courtesy... I could go on and on but you get the idea. We don&#39;t  <br/>\n&gt; have to push one whit of learning on them, they&#39;re grabbing for it  <br/>\n&gt; with both hands all the time.<br/>\n&gt;<br/>\n&gt; How do we, unschooling parents, decide &quot;for their own good&quot; what  <br/>\n&gt; kids should learn and when? We don&#39;t. We don&#39;t Know what&#39;s going to  <br/>\n&gt; be for their own good - but they, surprisingly often, do know. We  <br/>\n&gt; can follow their leads and problem solve with them when what they  <br/>\n&gt; want to learn about has elements of danger in it, for themselves,  <br/>\n&gt; for others, for the world. But above all, we get to do all of this  <br/>\n&gt; as kindly and gently as we possibly can. We get to be sweet and  <br/>\n&gt; caring and say &quot;Yes, let me help you, yes, I want to help, please  <br/>\n&gt; let me be your friend and helper.&quot; We don&#39;t Have to lecture, push,  <br/>\n&gt; demand, or insist on anything the vast majority of the time.<br/>\n&gt;<br/>\n&gt; Its marvelously freeing! But figuring out how that&#39;s possible is  <br/>\n&gt; challenging. Many people come to unschooling still thinking &quot;But  <br/>\n&gt; you gotta make kids do xyz for their own good&quot; - and that gets  <br/>\n&gt; challenged big time the moment they hit one of these lists because  <br/>\n&gt; a dozen, two dozen people suddenly speak up for the kids, saying  <br/>\n&gt; &quot;No, you don&#39;t Have to do that&quot; and &quot;It hurts when you do that.&quot;  <br/>\n&gt; That&#39;s Hard to read. It was Hard for me, when I was first on an  <br/>\n&gt; unschooling list, to read that I might not be the wonderful, kind,  <br/>\n&gt; respectful parent I thought I was. I was mad as hell at Ren and  <br/>\n&gt; everyone else who told me so (for some reason I remember Ren best,  <br/>\n&gt; and I think she said something like &quot;you&#39;re kids aren&#39;t you&quot; Damn  <br/>\n&gt; her ;)). But at the same time, the core ideas stuck with me. I  <br/>\n&gt; Didn&#39;t have to harden my heart every time I saw hurt little kid  <br/>\n&gt; eyes and say to myself &quot;its for their own good.&quot; I could be gentle.<br/>\n&gt;<br/>\n&gt; Its absolutely not necessary to bully kids into eating well. Its  <br/>\n&gt; not necessary to deny kids things they want so that they&#39;ll be good  <br/>\n&gt; people. Its not necessary to scare kids about the world for them to  <br/>\n&gt; develop good ethics. Its absolutly Possible to be courteous and  <br/>\n&gt; gracious and thoughful to children, to help them do and get and be  <br/>\n&gt; whatever they want, and for those children to turn around and be  <br/>\n&gt; gracious and thoughtful and have a strong sense of ethics. That&#39;s  <br/>\n&gt; not an opinion. Its a gift. Its the greatest gift any parent can  <br/>\n&gt; ever receive - the chance to be as good as we want to be with our  <br/>\n&gt; children.<br/>\n&gt;<br/>\n&gt; ---Meredith (Mo 8, Ray 15)<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":210259120,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"a different kind of parenting","postDate":"1253061181","msgId":41451,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4cGJudCtzdjcxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA0NWMwMWNhMzYzNCQxYzg3YzZhMCQ1NTk3NTNlMCRAY29tPg=="},"prevInTopic":41445,"nextInTopic":41453,"prevInTime":41450,"nextInTime":41452,"topicId":41426,"numMessagesInTopic":0,"msgSnippet":"... This is one of the reasons its recommended that newcomers to the list read for a while before posting - there s a particular style to unschooling","messageBody":"<div id=\"ygrps-yiv-955205657\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Crystal&quot; &lt;crystal@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Well, as soon as someone comes on here with a different<br/>\n&gt; opinion or a different way of doing things, they are bashed. Isn&#39;t that a<br/>\n&gt; double standard? <br/>\n<br/>\n </span></blockquote>This is one of the reasons its recommended that newcomers to the list read for a while before posting - there&#39;s a particular &quot;style&quot; to unschooling discussion groups that&#39;s somewhat unique. Its not a debate style, nor is it a chat or support-group style. Most often, what happens is someone throws out an idea, a scenario or a problem, and then group members reframe the situation taking into account the possible points of view of the children. Exaclty how they phrase that is going to vary depending on individual personalities and writing styles, and a certain amount of how its read can get lost in the &quot;tone&quot; the reader projects onto the writing. Hence the suggestion to pretend any post is being delivered kindly, by a good friend. It changes the way you read in a Biiiiiiig way. <br/>\n<br/>\nMost parenting relies on the assumption that parents must periodically be unkind to their children for the sake of the wellbeing of those children. A great deal of parenting revolves around ideas of &quot;for their own good&quot; and &quot;children Have to learn&quot;. Unschooling starts from a totally different perspective. We start from the assumption that children Love to learn, that they crave learning! So its not a matter of kids Having to learn anything specific, its a matter of helping children explore the world in ways that let them learn to their hearts content. In the process, they Will learn about their bodies, nutrition, food, math, sciences, literature, ethics, problem solving, communication, courtesy... I could go on and on but you get the idea. We don&#39;t have to push one whit of learning on them, they&#39;re grabbing for it with both hands all the time. <br/>\n<br/>\nHow do we, unschooling parents, decide &quot;for their own good&quot; what kids should learn and when? We don&#39;t. We don&#39;t Know what&#39;s going to be for their own good - but they, surprisingly often, do know. We can follow their leads and problem solve with them when what they want to learn about has elements of danger in it, for themselves, for others, for the world. But above all, we get to do all of this as kindly and gently as we possibly can. We get to be sweet and caring and say &quot;Yes, let me help you, yes, I want to help, please let me be your friend and helper.&quot; We don&#39;t Have to lecture, push, demand, or insist on anything the vast majority of the time. <br/>\n<br/>\nIts marvelously freeing! But figuring out how that&#39;s possible is challenging. Many people come to unschooling still thinking &quot;But you gotta make kids do xyz for their own good&quot; - and that gets challenged big time the moment they hit one of these lists because a dozen, two dozen people suddenly speak up for the kids, saying &quot;No, you don&#39;t Have to do that&quot; and &quot;It hurts when you do that.&quot; That&#39;s Hard to read. It was Hard for me, when I was first on an unschooling list, to read that I might not be the wonderful, kind, respectful parent I thought I was. I was mad as hell at Ren and everyone else who told me so (for some reason I remember Ren best, and I think she said something like &quot;you&#39;re kids aren&#39;t you&quot; Damn her ;)). But at the same time, the core ideas stuck with me. I Didn&#39;t have to harden my heart every time I saw hurt little kid eyes and say to myself &quot;its for their own good.&quot; I could be gentle. <br/>\n<br/>\nIts absolutely not necessary to bully kids into eating well. Its not necessary to deny kids things they want so that they&#39;ll be good people. Its not necessary to scare kids about the world for them to develop good ethics. Its absolutly Possible to be courteous and gracious and thoughful to children, to help them do and get and be whatever they want, and for those children to turn around and be gracious and thoughtful and have a strong sense of ethics. That&#39;s not an opinion. Its a gift. Its the greatest gift any parent can ever receive - the chance to be as good as we want to be with our children. <br/>\n<br/>\n---Meredith (Mo 8, Ray 15)</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Food and other issues","postDate":"1253057291","msgId":41445,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1NzUxOS45MTUzNC5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGg4cDUydCthYWZrQGVHcm91cHMuY29tPg==","referencesHeader":"PGg4cDUydCthYWZrQGVHcm91cHMuY29tPg=="},"prevInTopic":41444,"nextInTopic":41451,"prevInTime":41444,"nextInTime":41446,"topicId":41426,"numMessagesInTopic":0,"msgSnippet":"This is a list to discuss and learn unschooling and gentle parenting. Ideas that go against it will be put to the test. Would you go to a Vegan list","messageBody":"<div id=\"ygrps-yiv-351725759\">This is a list to discuss and learn unschooling and gentle parenting.<br/>\nIdeas that go against it will be put to the test.<br/>\nWould you go to a Vegan list to defend the idea of eating meat???<br/>\nIf you want to learn more how unschooling kids DON&quot;T just eat Frito Lay products you are very welcome to ask questions.<br/>\nHow about  that?<br/>\nAsk how are kids eat. <br/>\nMy 3 year old today ate Spaghetti Squash , corn on the cob and cherry tomatoes that I picked out of my organic vegetable daughter this morning plus some local chicken I got from the local market.<br/>\nThis minute they are eating a Monkey Platter with a variety of things from Cheez whiz to several fruits and vegetables.<br/>\nI have many, many high processed candy and snacks in my house since my Dh loves them.<br/>\nDo my kids only eat those??/ Absolutely not.<br/>\nMy kids are super healthy, lean and extremely tall for their age. I am only 5&#39;4&quot; and my dh 6&#39;.<br/>\nWhy are our kids so tall, lean and healthy if they can eat all the &quot;junk&quot; they want???<br/>\nAsk us about that!<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n_._,___<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":209361242,"authorName":"jrossedd","from":"&quot;jrossedd&quot; &lt;jrossedd@...&gt;","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and other issues","postDate":"1253056707","msgId":41444,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4cDdjMys1bjl1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNjNjEyMGExMDkwOTE1MTU0NXU3NDFjMDVlZm9mNjJhODI4ZGNjNGQzMDAxQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":41442,"nextInTopic":41445,"prevInTime":41443,"nextInTime":41445,"topicId":41426,"numMessagesInTopic":0,"msgSnippet":"... Oh, you have no idea the *real* level of hostility stirred in longtime unschoolers like me, by that series of opinions being posted here in rapid","messageBody":"<div id=\"ygrps-yiv-2106285445\"><blockquote><span title=\"ireply\">&gt; &gt; Can we not offer up advice/suggestions without the harshness?<br/>\n&gt; &gt; On another note, I have very strong opinions on the food issue but have refrained from even contributing to this because of the level of hostility that has come with it. It&#39;s just not worth it.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Crystal<br/>\n&gt; &gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Oh, you have no idea the *real* level of hostility stirred in longtime unschoolers like me, by that series of &quot;opinions&quot; being posted here in rapid succession.  It&#39;s probably lucky for me and the list, that I was reading on digest!</div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Food and other issues","postDate":"1253054709","msgId":41442,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkwOTE1MTU0NXU3NDFjMDVlZm9mNjJhODI4ZGNjNGQzMDAxQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDA0NWMwMWNhMzYzNCQxYzg3YzZhMCQ1NTk3NTNlMCRAY29tPg==","referencesHeader":"PDRBQUY5RjVGLjQwMTA4MDVAY29tY2FzdC5uZXQ+CSA8MDQ1YzAxY2EzNjM0JDFjODdjNmEwJDU1OTc1M2UwJEBjb20+"},"prevInTopic":41440,"nextInTopic":41444,"prevInTime":41441,"nextInTime":41443,"topicId":41426,"numMessagesInTopic":0,"msgSnippet":"IMO I think that only people with food issues read any hostility. I can hear the love and sweet redirection of perspectives. I think that saying that you are","messageBody":"<div id=\"ygrps-yiv-96510540\">IMO I think that only people with food issues read any hostility. I can hear<br/>\nthe love and sweet redirection of perspectives.<br/>\n<br/>\nI think that saying that you are willing to show your child horrific<br/>\npictures of real violence if they show interest in a video game is abusive.<br/>\nAnd I think that if I had a friend who claimed that they would do that I<br/>\nwould surely say something about it. That is over the top, even for<br/>\nmainstream parenting. That would be horrifically traumatizing.<br/>\n<br/>\nThis is an unschooling board. We are on here because we unschool of because<br/>\nwe are trying to understand unschooling better. They things that Rachel<br/>\nwrote were not along that lines. In my &quot;real&quot; life I have friends who parent<br/>\ndifferent. I don&#39;t question their parenting or call them on things because<br/>\nthey are choosing NOT to unschool. BUT on here ideas that are out of accords<br/>\nwith unschooling are going to be challenged.<br/>\n<br/>\nIs there a particulare comment that you felt bashed someone? If not that<br/>\nperhaps you were also reading into peoples posts.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, Sep 15, 2009 at 2:41 PM, Crystal &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:crystal@...\">crystal@...</a>&gt;wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I don&#39;t post often but follow most threads. I don&#39;t understand something,<br/>\n&gt; maybe some of you could clarify where you are coming from. Here&#39;s the<br/>\n&gt; thing.<br/>\n&gt; You all say that you want to teach your children to become independent<br/>\n&gt; thinkers and voice their own opinions, right? Don&#39;t you think, if you do<br/>\n&gt; this now, they will continue to do that when they get older? So, where am I<br/>\n&gt; headed with this? Well, as soon as someone comes on here with a different<br/>\n&gt; opinion or a different way of doing things, they are bashed. Isn&#39;t that a<br/>\n&gt; double standard? I mean, would you really call your kid sick or tell them<br/>\n&gt; that they have some &quot;sick ways&quot; of doing something? Seriously, would you<br/>\n&gt; talk to them the same way, or are they your equals but adults are not? I<br/>\n&gt; know this sounds harsh coming from emails but I am looking at long term<br/>\n&gt; here, how ARE you going to treat your kids, like you treat some people on<br/>\n&gt; here? I get that it&#39;s awesome to give advice when someone asks for it but<br/>\n&gt; to<br/>\n&gt; do it in such a manner as to belittle them, my &quot;opinion&quot; is that it&#39;s<br/>\n&gt; wrong.<br/>\n&gt; Can we not offer up advice/suggestions without the harshness?<br/>\n&gt;<br/>\n&gt; On another note, I have very strong opinions on the food issue but have<br/>\n&gt; refrained from even contributing to this because of the level of hostility<br/>\n&gt; that has come with it. It&#39;s just not worth it.<br/>\n&gt;<br/>\n&gt; Crystal<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"gruvystarchild","from":"&quot;gruvystarchild&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and other issues","postDate":"1253054365","msgId":41440,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4cDUydCthYWZrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA0NWMwMWNhMzYzNCQxYzg3YzZhMCQ1NTk3NTNlMCRAY29tPg=="},"prevInTopic":41437,"nextInTopic":41442,"prevInTime":41439,"nextInTime":41441,"topicId":41426,"numMessagesInTopic":0,"msgSnippet":"~~Well, as soon as someone comes on here with a different opinion or a different way of doing things, they are bashed. Isn t that a double standard? I mean,","messageBody":"<div id=\"ygrps-yiv-170816571\">~~Well, as soon as someone comes on here with a different<br/>\nopinion or a different way of doing things, they are bashed. Isn&#39;t that a double standard? I mean, would you really call your kid sick or tell them that they have some &quot;sick ways&quot; of doing something?~~<br/>\n<br/>\nIt&#39;s not bashing a person to bash their ideas. I didn&#39;t call HER &quot;sick&quot; I did call the idea of showing a CHILD photos of victims of violence &quot;sick&quot; and yes, I&#39;d tell my kids the same if they thought that was a nice thing to do to an unwilling friend. It&#39;s cruel and parents are cruel if they think that&#39;s a good way to manipulate a child.<br/>\n<br/>\nDid you read her entire post? She wanted to show her CHILDREN a photo of a murdered toddler with the mother in order to &quot;teach&quot; them that violence is bad. To think that a child would have to endure such treatment just for showing interest in a violent video game makes me ill. I think we&#39;re pretty clear in our guidelines that if you advocate spanking or other such mainstream ideas you should be prepared to deal with heavy responses. <br/>\n<br/>\nWe&#39;re not here to promote and tolerate all sorts of different ideas. Where do we state that? We&#39;re here to advocate for gentle parenting and unschooling. I thought the list description was pretty clear.<br/>\n<br/>\nAnd yes, I assume that an adult who has chosen to join a group with a purpose stated up front, is capable of discussion and choosing what they want to share.<br/>\n<br/>\nFor the record, Rachel was asked repeatedly to stop posting and just read for a while (off list...very gently) and chose to completely ignore the suggestion.<br/>\n<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":362437716,"authorName":"Paul & Camille","from":"&quot;Paul & Camille&quot; &lt;morlingfamily@...&gt;","profile":"campaulmace","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unschooling Weight Gain and Math","postDate":"1253041889","msgId":41431,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI3QzBCNjM3NkEzMzQ4QzlCOTY3MjA0Qzg1M0U0NDU1QHlvdXJxOTRianZ0bDByPg==","referencesHeader":"PDRBQUY5RjVGLjQwMTA4MDVAY29tY2FzdC5uZXQ+"},"prevInTopic":41428,"nextInTopic":41437,"prevInTime":41430,"nextInTime":41432,"topicId":41426,"numMessagesInTopic":0,"msgSnippet":"I agree, I was sickened by Rachels final comments before leaving, and agreed with Ren totally. It made me feel so sick in the stomach that she would say such","messageBody":"<div id=\"ygrps-yiv-1299602096\">I agree, I was sickened by Rachels final comments before leaving, and agreed with Ren totally. It made me feel so sick in the stomach that she would say such things.  I also felt for Karen sharing such personal details about her life, and glad that we are for the most part understanding of others views and that we can learn & listen to others views without having to attack and defend ourselves constantly, if we cannot see outside our own enclosed box why are we here?<br/>\n<br/>\nThanks for the discussion though, as I learn and grew much in my parenting views  :)<br/>\n<br/>\n<br/>\nCamille<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":200309204,"authorName":"Crystal","from":"&quot;Crystal&quot; &lt;crystal@...&gt;","profile":"crystal_milliken","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Food and other issues","postDate":"1253040076","msgId":41437,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA0NWMwMWNhMzYzNCQxYzg3YzZhMCQ1NTk3NTNlMCRAY29tPg==","inReplyToHeader":"PDRBQUY5RjVGLjQwMTA4MDVAY29tY2FzdC5uZXQ+","referencesHeader":"PDRBQUY5RjVGLjQwMTA4MDVAY29tY2FzdC5uZXQ+"},"prevInTopic":41431,"nextInTopic":41440,"prevInTime":41436,"nextInTime":41438,"topicId":41426,"numMessagesInTopic":0,"msgSnippet":"I don t post often but follow most threads. I don t understand something, maybe some of you could clarify where you are coming from. Here s the thing. You all","messageBody":"<div id=\"ygrps-yiv-847023622\">I don&#39;t post often but follow most threads. I don&#39;t understand something,<br/>\nmaybe some of you could clarify where you are coming from. Here&#39;s the thing.<br/>\nYou all say that you want to teach your children to become independent<br/>\nthinkers and voice their own opinions, right? Don&#39;t you think, if you do<br/>\nthis now, they will continue to do that when they get older? So, where am I<br/>\nheaded with this? Well, as soon as someone comes on here with a different<br/>\nopinion or a different way of doing things, they are bashed. Isn&#39;t that a<br/>\ndouble standard? I mean, would you really call your kid sick or tell them<br/>\nthat they have some &quot;sick ways&quot; of doing something? Seriously, would you<br/>\ntalk to them the same way, or are they your equals but adults are not? I<br/>\nknow this sounds harsh coming from emails but I am looking at long term<br/>\nhere, how ARE you going to treat your kids, like you treat some people on<br/>\nhere? I get that it&#39;s awesome to give advice when someone asks for it but to<br/>\ndo it in such a manner as to belittle them, my &quot;opinion&quot; is that it&#39;s wrong.<br/>\nCan we not offer up advice/suggestions without the harshness? <br/>\n<br/>\n <br/>\n<br/>\nOn another note, I have very strong opinions on the food issue but have<br/>\nrefrained from even contributing to this because of the level of hostility<br/>\nthat has come with it. It&#39;s just not worth it.<br/>\n<br/>\nCrystal<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":209361242,"authorName":"jrossedd","from":"&quot;jrossedd&quot; &lt;jrossedd@...&gt;","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling Weight Gain and Math","postDate":"1253035294","msgId":41428,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg4b2lldSs5bnBzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRBQUY5RjVGLjQwMTA4MDVAY29tY2FzdC5uZXQ+"},"prevInTopic":41426,"nextInTopic":41431,"prevInTime":41427,"nextInTime":41429,"topicId":41426,"numMessagesInTopic":0,"msgSnippet":"Since I suddenly find myself moved to post, here s another connection to make between food, weight and unschooling math, again from always-unschooled Favorite","messageBody":"<div id=\"ygrps-yiv-1608486970\">Since I suddenly find myself moved to post, here&#39;s another connection to make between food, weight and unschooling math, again from always-unschooled Favorite Daughter in her own words, this time about her body image when she was about 16:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://misedjj.wordpress.com/2006/11/29/paying-homage/\">http://misedjj.wordpress.com/2006/11/29/paying-homage/</a><br/>\n<br/>\n&quot;I am the national average, physiologically, and yet I am an elephant in comparison to almost everyone I know. . .&quot;<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, JRossedd &lt;jrossedd@...&gt; wrote:<br/>\nI wanted to say we&#39;ve been going <br/>\n&gt; through exactly that stage of life the past three years or so </span></blockquote></div>","specialLinks":[]},{"userId":209361242,"authorName":"JRossedd","from":"JRossedd &lt;jrossedd@...&gt;","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Unschooling Weight Gain and Math","postDate":"1253023583","msgId":41426,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBQUY5RjVGLjQwMTA4MDVAY29tY2FzdC5uZXQ+"},"prevInTopic":0,"nextInTopic":41428,"prevInTime":41425,"nextInTime":41427,"topicId":41426,"numMessagesInTopic":0,"msgSnippet":"I read on digest and so just saw Rachel s saddening, offensive posts all in a one big email (over and over and over!) Y all please, PLEASE trim your posts!","messageBody":"<div id=\"ygrps-yiv-1541400943\">I read on digest and so just saw &quot;Rachel&#39;s&quot; saddening, offensive posts <br/>\nall in a one big email (over and over and over!) <br/>\nY&#39;all please, PLEASE trim your posts! :)<br/>\n<br/>\nAbout halfway through the digest found myself cheering Ren:<br/>\n&quot;You&#39;ve got some really big baggage and some really sad and sick ways of <br/>\nviewing children and how to treat them. I was giving you the benefit of <br/>\nthe doubt for a long time in this convo. But this is overboard. Anyone <br/>\nwho would treat a child so horribly is doing something FAR worse than <br/>\nplaying a violent video game.&quot;<br/>\n<br/>\nBy the time I got to the bottom of the digest about unschooling older <br/>\nchildren ready for &quot;school&quot; math conventions, I was not in the right <br/>\nmindset to reply in any detail but I wanted to say we&#39;ve been going <br/>\nthrough exactly that stage of life the past three years or so, and I <br/>\nhave a lot I could add to Pam&#39;s wonderful ideas for young children with <br/>\nmath aptitude.  Also I will be very interested to hear what&#39;s working <br/>\nfor others.  Sometimes (as with my daughter) despite all Pam&#39;s help and <br/>\ncounsel for which I was so grateful -- thanks again Pam! -- it turns out <br/>\nnot to be quite so easy and natural. <br/>\n<br/>\nHere&#39;s how she saw it, in her own words (writing is her major, not math!)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://misedjj.wordpress.com/2008/03/27/well-that-explains-a-lot/\">http://misedjj.wordpress.com/2008/03/27/well-that-explains-a-lot/</a><br/>\n<br/>\nAfter two days of clinical tests, she was documented with a basic <br/>\n&quot;coding disorder&quot; that the college office of disabilities then accepted <br/>\nin lieu of the state law&#39;s required two math courses.  She took extra <br/>\nscience to substitute.  I continue to work hard and mostly succeed, to <br/>\nkeep my own feelings of guilt out of it (both for what I did and did not <br/>\ndo, sigh) and it&#39;s turning into a wonderful success story for her at <br/>\nuniversity. Top of her class, merit scholarships and awards, etc.  She <br/>\ncan do anything she wants. But now she wants graduate degrees and you <br/>\nknow what that means -- somehow getting through the math portion of the <br/>\nGRE.  Here we go again.  :)<br/>\n<br/>\nNow our 14-year-old son who&#39;s also done absolutely no pencil-paper <br/>\narithmetic or math, is beginning to eye community college at 15 or 16, <br/>\nfor histroy and the arts, and he&#39;ll have to pass the college algebra <br/>\nreadiness exam to be admitted.  His dad is pressuring me a bit to more <br/>\nactively help him prepare as with our daughter, so that if there is some <br/>\nspecial need, we&#39;ll know about it sooner and it will be smoother for <br/>\nhim.  So we&#39;ve been watching the &quot;Basic Math&quot; Teaching Company dvds of <br/>\nProfessor Murray H. Siegel that first for our daughter but that never <br/>\nhelped her (but did help us start to realize that despite her overall <br/>\nintelligence and understanding, in basic calculation she is literally <br/>\nunable to keep track of several numbers in her mind at once, to perform <br/>\na multi-step process.)<br/>\n<br/>\nThe dvds seem to work fine for him -- so far at least. Then just <br/>\nyesterday we were experimenting with a dummies-type series called &quot;A <br/>\nBrain-Friendly Guide&quot; I found at Barnes N Noble. This one is &quot;Head First <br/>\nAlgebra  (includes pre-algebra review) by Tracey and Dan Pilone. We&#39;ll see.</div>","specialLinks":[]}],"prevTopicId":41457,"nextTopicId":41429}}