{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:Help! Is This Normal?","postDate":"1187267428","msgId":25814,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1MjYzQUM4QEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":25796,"nextInTopic":0,"prevInTime":25813,"nextInTime":25815,"topicId":25796,"numMessagesInTopic":0,"msgSnippet":"Right now it sounds like they are trying desperately to *connect* with you. That is entirely Normal (whatever Normal is exactly lol). What s wrong with them","messageBody":"<div id=\"ygrps-yiv-434718870\">Right now it sounds like they are trying desperately to *connect* with<br/>\nyou. That is entirely Normal (whatever Normal is exactly lol). What&#39;s<br/>\nwrong with them being interested in paying bills, gardening, or<br/>\nwhatever? Turn your thinking around a bit: if they expressed an interest<br/>\nindependently of vermiculture (That&#39;s such a cool word to start with!),<br/>\nwouldn&#39;t you think &quot;Great, let&#39;s see how we can get that going&quot;? So, why<br/>\nis it that you have a problem with them spending time with BOTH<br/>\nvermiculture AND you? Think of all the families who rarely ever see each<br/>\nother and the parents who one day wish &quot;Gee I wish my kids and I spent<br/>\nmore time together&quot; You&#39;ve GOT that - enjoy! Sooner or later they will<br/>\nbranch out BUT for now they need TIME with YOU. Most of &quot;everyone else&#39;s<br/>\nkids&quot; have been FREE a lot longer than yours. Basically, they&#39;re<br/>\nstocking up on Mom-time - it&#39;s a &#39;famine reaction&#39; - they were away from<br/>\nyou for a long time (if they just left school this past year, they were<br/>\ngone for up to 4 years roughly, correct?) and the spectre of the<br/>\n&#39;famine&#39; coming back (going back to school) is still hanging there, so<br/>\nthey are &quot;feasting&quot; on you. How about -you- branch out a bit? Go ahead<br/>\nand free the TV and see what they enjoy watching then follow those<br/>\nrabbit trails wherever they may lead.<br/>\n <br/>\nDrop the notion of having to do &#39;academic looking&#39; stuff, learning<br/>\nhappens internally - you can&#39;t see it. They&#39;re learning geneology,<br/>\nvermiculture, bill paying (that counts as math BTW lol), whatever<br/>\ndocumentary stuff you&#39;re watching, and so on. How many 7 yr olds even<br/>\nknow what vermiculture is? That&#39;s COOL! In the process, they&#39;re also<br/>\nprobably reading some, calculating some, researching some, thinking a<br/>\nbunch, touching on history and science, and so on. All those &quot;school<br/>\nsubjects&quot; are there - but they&#39;re not divided off into disembodied<br/>\nthings with no connection to real life. They are living life and<br/>\nlearning is part of that. Go enjoy it with your kids.<br/>\n <br/>\nDeb <br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":232999301,"authorName":"mooredlighthouse","from":"&quot;mooredlighthouse&quot; &lt;mooredlighthouse@...&gt;","profile":"mooredlighthouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Help! Is This Normal?","postDate":"1187190946","msgId":25796,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5djViMitmOW9xQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":25814,"prevInTime":25795,"nextInTime":25797,"topicId":25796,"numMessagesInTopic":0,"msgSnippet":"Hello all - I ve been a lurker on this list, but I m pretty sure mine is a question which has not been asked.  First, a little history - The 2006-7 school year","messageBody":"<div id=\"ygrps-yiv-279238620\">Hello all -<br/>\nI&#39;ve been a lurker on this list, but I&#39;m pretty sure mine is a<br/>\nquestion which has not been asked.  First, a little history -<br/>\n<br/>\nThe 2006-7 school year was our first for unschooling our 1,7 & 9<br/>\nyear-olds.  But for the older two, I had the spectre of an unbelieving<br/>\nand uninformed, controlling ex-husband hanging over our heads.  His<br/>\ninsistance that they had to pass a standardized test at the end of the<br/>\nyear haunted and soured our entire experience last year.  Both<br/>\nchildren passed the CAT with flying colors... except my 9-year-old,<br/>\nwho tested below grade level in math (because this child refused to<br/>\nhave anything to do with it).  <br/>\n<br/>\nFor the 2007-8 school year, my husband was able to get a verbal<br/>\nagreement from the ex to let us try it &quot;one more year.&quot;  I hate this<br/>\nmeted out permission, and all feelings of still having my life and my<br/>\nchildren under the control of someone who understands none of it. <br/>\nWe&#39;re planning to branch out into some community activities, namely<br/>\nscouts and  civic theatre.<br/>\n<br/>\nBut here&#39;s my question:  Are my kids just REALLY weird or am I doing<br/>\nsomething wrong?  All three of them seem intensely interested in<br/>\nanything that I am learning.  If I&#39;m paying bills or doing geneology<br/>\nor watching a documentary, that&#39;s where they want to be, like 3 little<br/>\nducks in a row, my velcro shadows.  They don&#39;t like playing outside at<br/>\nall, and it&#39;s hard to persuade them to go there.  Yet when my husband<br/>\nor I are out watering the garden or doing the composting or<br/>\nvermiculture, boom - there they are.  More beloved than the outdoors<br/>\nis the television.  If they could get away with it, they would watch<br/>\nTV all day.  It appears to my husband that all they really do is play<br/>\nand read books and mess up the house.  What&#39;s frustrating for me is<br/>\nthat I thought they would take off with interests of their own, not<br/>\ngrasp onto MY interests as tightly or tighter than I do.  Sometimes I<br/>\nfeel a little suffocated by that, and other times I worry that they<br/>\nare not &quot;blossoming&quot;, &quot;branching out&quot; or &quot;exploring their own<br/>\ninterests&quot; like it seems everyone else&#39;s unschool children do.<br/>\n<br/>\nYou have to understand that I don&#39;t know what NORMAL is - both for<br/>\nwhat is normal for public school life AND for unschooled life.  My 5<br/>\nsiblings and I were raised in an EXTREMELY controlling and unhappy<br/>\nhome, attending public schools and doing well academically but not<br/>\nbeing allowed to have any friends or fun outside of class.  We owned a<br/>\nfamily business and it was work, work, work.  I won&#39;t force my<br/>\nchildren to work so maybe that&#39;s why the bathroom goes for weeks<br/>\nwithout a scrubdown... but my children actually volunteer to do it,<br/>\nand seem to have a ball (don&#39;t worry - we use safe cleaning products -<br/>\nVinegar and Young Living&#39;s  Theives).  I am flabbergasted when my<br/>\nchildren take the initiative like this. I guess I&#39;m worried, though,<br/>\nthat there seems to be no initiative academically.  No devouring of<br/>\nbooks about horses, dinosaurs, Ben Franklin, or whatever.<br/>\n<br/>\nHelp!<br/>\n<br/>\nKatie</div>","specialLinks":[]}],"prevTopicId":25776,"nextTopicId":25815}}