{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Please help re. bullying (sorry - long), Part \t2","postDate":"1238457981","msgId":39195,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMDkwMzMwMTcwNnU2ZWY3Y2M3Zmg3M2Q4NDViYWJlOTkwMWY5QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDA4QzAzMEE2ODgzNDRGMTBCODUxQzI0OEUxNjBCNDc1QHJvYnlQQz4=","referencesHeader":"PDA4QzAzMEE2ODgzNDRGMTBCODUxQzI0OEUxNjBCNDc1QHJvYnlQQz4="},"prevInTopic":39185,"nextInTopic":0,"prevInTime":39194,"nextInTime":39196,"topicId":39185,"numMessagesInTopic":0,"msgSnippet":"If i wanted to pull out my child and I felt that I really needed to and s/he really wanted to I would, regardless of money. I would try to work something out","messageBody":"<div id=\"ygrps-yiv-2105644752\">If i wanted to pull out my child and I felt that I really needed to and s/he<br/>\nreally wanted to I would, regardless of money. I would try to work something<br/>\nout with the school, since it seems that the bullying is a problem no that<br/>\nyou are taking your child out on a whim. If not I would bring my child home<br/>\nand help them heal and continue paying the school.<br/>\n<br/>\nFaith<br/>\n<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://faithvoid.blogspot.com/\">http://faithvoid.blogspot.com/</a><br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":346820406,"authorName":"hunnybunnies5@verizon.net","from":"&lt;hunnybunnies5@...&gt;","profile":"shelleydaez","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Please help re. bullying (sorry - long),  Part 2","postDate":"1238428267","msgId":39185,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA4QzAzMEE2ODgzNDRGMTBCODUxQzI0OEUxNjBCNDc1QHJvYnlQQz4="},"prevInTopic":0,"nextInTopic":39195,"prevInTime":39184,"nextInTime":39186,"topicId":39185,"numMessagesInTopic":0,"msgSnippet":"When I heard what happened, I decided to nip it in the bud by writing an e-mail to Matthew s mother.  I was fed up and frustrated with the bullying that went","messageBody":"<div id=\"ygrps-yiv-1899443997\">When I heard what happened, I decided to nip it in the bud by writing an e-mail to Matthew&#39;s mother.  I was fed up and frustrated with the bullying that went on in the  past, and I was determined not to let it happen again. Unfortunately, I wrote the letter in the heat of anger.  I didn&#39;t know whether the teachers had ever mentioned Matthew&#39;s negative behavior before to his mother.  So I wrote her about the past incidents that had happened between Matthew & Miguel, and the bullying that Matthew had done with other kids as well.  <br/>\n<br/>\nI ended the letter with the following:<br/>\n<br/>\n&quot;Have any of the teachers brought Matthew&#39;s behavior to your attention?  Because it is not only Miguel who has been affected by his behavior.  Yesterday (Monday, 3/16), Miguel also heard Nate tell Miss Colleen (the teacher) that when they were outside, Matthew pushed him aside and slammed the gate on him. <br/>\nI don&#39;t know if you hear a lot of complaints about your son.  I have known two moms in the past, who have about their own sons.  And when someone comes up to them to complain yet again, they shut down or become defensive.  I hope you are not like that.  If I were the parent of an offending child, I would be glad to know what my child had been doing -- for his sake and for the other child&#39;s sake -- so that I can help my child and figure out what he&#39;s going through, if something is stressing him out, for him to act out in such a negative way towards others.  That is our duty as parents.  <br/>\n<br/>\nI would also have my child (if he is the offender) apologize sincerely to the hurt child, and I would also try to alleviate the concerns of the other parent.  I don&#39;t know if this is how you would go about resolving these kinds of situations.  Frankly, it&#39;s unpleasant for me to have to bring this up to you and write a letter like this, because first of all, I don&#39;t know you very well.  And second, I don&#39;t know if you are the type who will:<br/>\n<br/>\na)   respond by talking to your child about the situation, <br/>\n<br/>\nb)   react negatively and start defending your child, or<br/>\n<br/>\nc)   act indifferently and not do anything at all.<br/>\n<br/>\nI have made it clear to Maggie (the head of school) and his teachers that I know it is not the school&#39;s or the teachers&#39; fault for any bullying that takes place in the school.  Another teacher told me that, ultimately, each child brings to school what they have experienced or learned from their families. Each child brings his or her *home* to school.  If there is stress going on in the family or with the child because of certain issues, then the child cannot help but act out the stress in school, where he is for most of the day.<br/>\n<br/>\nI don&#39;t know if you will agree with this, but it makes sense to me.  Fundamentally, it is the family that must address the behavior of their child. The teachers can only do so much.  Please talk to Matthew.  In the last few months, everything was going smoothly, and there were hardly any reports of bullying or meanness.  Miguel was even impressed when Matthew had conducted a beautiful prayer service for the class.  <br/>\n<br/>\nWe hope things will go back to the way they were these last couple of months.  And we hope that there will no longer be any negative encounters between Matthew and Miguel till the end of the schoolyear.  Otherwise, I will have to bring the matter up once again to Maggie, the teachers and you.&quot;<br/>\n<br/>\nShelley Daez<br/>\n<br/>\n(To be continued)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":39169,"nextTopicId":39197}}