{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: I need serious advice!","postDate":"1322650596","msgId":47736,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU2NzVCMjlBLTk4MkYtNDNERS04Nzg3LUVBOEM0N0FBMkYyMkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpiMzltcys0MGc4QGVHcm91cHMuY29tPg==","referencesHeader":"PGpiMzltcys0MGc4QGVHcm91cHMuY29tPg=="},"prevInTopic":47735,"nextInTopic":0,"prevInTime":47735,"nextInTime":47737,"topicId":47697,"numMessagesInTopic":0,"msgSnippet":"... It might help unschooling to flourish to ask her if she has plans for the day. Then support those while also running interesting things through their","messageBody":"<div id=\"ygrps-yiv-2146261370\">On Nov 29, 2011, at 1:53 PM, amy wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have just allowed her to decide what she would like to learn for the day. <br/>\n<br/>\n </span></blockquote>It might help unschooling to flourish to ask her if she has plans for the day. Then support those while also running interesting things through their lives. Which might be a trip somewhere: to the park, to the next town to shop in a grocery store they&#39;ve never been to, to a cupcake shop, to a Salvation Army, to taste some sushi. It might be sharing your favorite childhood movie, or listening to books on tape in the car, or baking cookies. It should also include leaving interesting things around the house for them to pick up or not (strewing). Here&#39;s a page on strewing:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com/strewing\">http://www.sandradodd.com/strewing</a><br/>\n<br/>\nIf you think about it, as an adult, you don&#39;t decide what you&#39;re going to learn today. You might decide what you&#39;re going to *do* and explore something that interests you. You might decide today you&#39;ll figure out how to do something, but it&#39;s rarely so formal as deciding what you&#39;re going to learn.<br/>\n<br/>\nShe needs the freedom to not do things that look don&#39;t look educational. She *will* learn, no matter what she does. :-) But real learning will come from exploring, trying things out to see what happens, doing new things, doing old things to discover new depths. In other words, unschooling will look a lot like playing :-) (Playing in a rich, supportive environment where there are plenty of opportunities to do and try new things.)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I need serious advice!","postDate":"1322607882","msgId":47735,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpiM29lYStkYWlhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpiMzltcys0MGc4QGVHcm91cHMuY29tPg=="},"prevInTopic":47734,"nextInTopic":47736,"prevInTime":47734,"nextInTime":47736,"topicId":47697,"numMessagesInTopic":0,"msgSnippet":"... **************** It s a start - a transitional step closer to unschooling. I m going to stretch your brain a little, if you ll let me. You re still","messageBody":"<div id=\"ygrps-yiv-774543051\">&quot;amy&quot; &lt;amy@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;the last two days I have just allowed her to decide what she would like to learn for the day<br/>\n </span></blockquote>****************<br/>\n<br/>\nIt&#39;s a start - a transitional step closer to unschooling. I&#39;m going to stretch your brain a little, if you&#39;ll let me. <br/>\n<br/>\nYou&#39;re still thinking of learning in terms of knowledge aquisition when that&#39;s really the least part of learning. Learning involves making lots and lots of connections - those connections are where we come by perspective and understanding, humor and even wisdom. Those conncetions are how we grow as people- but you can&#39;t &quot;learn&quot; to grow, and most of the time you don&#39;t see &quot;personal growth&quot; happening until later. You notice it after the fact. <br/>\n<br/>\nYou can, to an extent, choose what to learn, but very very often choosing to Do something Is choosing to learn. So an &quot;next step&quot; toward unschooling would be to drop the word &quot;learn&quot; from that question and ask &quot;what do you want to do?&quot; with the realization that Anything she picks will involve learning. Even daydreaming or watching tv or going to the mall. <br/>\n<br/>\nHere&#39;s a good page if you want to read/think/learn more about how learning happens:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/connections/\">http://sandradodd.com/connections/</a><br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":507060640,"authorName":"amy","from":"&quot;amy&quot; &lt;amy@...&gt;","profile":"amybergsd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I need serious advice!","postDate":"1322592796","msgId":47734,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpiMzltcys0MGc4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwZGMwMWNjYTYzOSQ1MTc2NWQwMCRmNDYzMTcwMCRAY29tPg=="},"prevInTopic":47703,"nextInTopic":47735,"prevInTime":47733,"nextInTime":47735,"topicId":47697,"numMessagesInTopic":0,"msgSnippet":"Thank you thank you all so much for the wonderful words of encouragement and advice! After MUCH thinking through and talking with the hubs, I decided to take","messageBody":"<div id=\"ygrps-yiv-1662869093\">Thank you thank you all so much for the wonderful words of encouragement and advice! <br/>\n<br/>\nAfter MUCH thinking through and talking with the hubs, I decided to take her out of Connections. I filed for the PSA and the last two days I have just allowed her to decide what she would like to learn for the day. She chose to learn about Polar Bears, Nile Crocodiles and Whales. Genus and species, habitat, behaviors and statistics. Today she is watching a documentary about America - 120 years after Columbus. It&#39;s been much less stressful for both of us and she is actually interested in what she has chosen to learn for the day. My two younger girls (2 & 3 years old) are also taking an interest. I&#39;m not sure if I&#39;m doing this child-led learning the right way but hopefully I&#39;m doing something good. I have just decided to let things go and know that even if she doesn&#39;t &quot;learn it all&quot; I have done my best protecting her from all the negative things in public school.  <br/>\n<br/>\nSusan and JRossedd: you said it perfectly! :-)</div>","specialLinks":[]},{"userId":410700632,"authorName":"Susan Lervold","from":"Susan Lervold &lt;susanlervold@...&gt;","profile":"sushieq@rocketmail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I need serious advice!","postDate":"1321651837","msgId":47703,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZGMwMWNjYTYzOSQ1MTc2NWQwMCRmNDYzMTcwMCRAY29tPg=="},"prevInTopic":47702,"nextInTopic":47734,"prevInTime":47702,"nextInTime":47704,"topicId":47697,"numMessagesInTopic":0,"msgSnippet":"Hi Amy (and everybody else)- I ve been lurking for a couple of weeks and this is my first post.  I live in Orange County, CA, and just submitted my first PSA","messageBody":"<div id=\"ygrps-yiv-473972589\">Hi Amy (and everybody else)-<br/>\n<br/>\n <br/>\n<br/>\nI&#39;ve been lurking for a couple of weeks and this is my first post.  I live<br/>\nin Orange County, CA, and just submitted my first PSA on Wednesday, after<br/>\nwithdrawing my 14 year old son from C.H.E.P. (Community Home Education<br/>\nProgram, an independent study charter [public] school in my area), a program<br/>\nwe started early last year.  I&#39;d long admired homeschoolers, but I always<br/>\nthought that I wouldn&#39;t be able to manage it myself-not enough patience, not<br/>\nenough self-control, too short attention span, etc.  During my son&#39;s<br/>\nelementary years at our local public school, he seemed happy enough and<br/>\nenjoyed school.  He excelled academically and was socially successful too,<br/>\nbut I was very unhappy with all the standardized testing, teacher absences<br/>\n(for &quot;in-service meetings, mostly), and in-fighting amongst some of the PTA<br/>\nmoms.  I was also concerned with the ever-increasing &quot;values education&quot;<br/>\nprograms, like sex ed, drug awareness week, anti-bullying week, fitness<br/>\nexpos, and the like.  And then there was the stuff that wasn&#39;t school<br/>\nsanctioned: as early as second grade, my son got a little sex education from<br/>\nanother child that made my hair stand on end, and only got worse as the kids<br/>\ngot older.  I&#39;m no prude (and we&#39;ve always been very frank as far as sex<br/>\ninformation goes), but between the school&#39;s indoctrination and the kids&#39;<br/>\nnonsense (sex, drugs, and ill-treatment of others), by middle school, we&#39;d<br/>\nhad it.<br/>\n<br/>\n <br/>\n<br/>\nChoosing to opt out of the current educational paradigm is very scary; I<br/>\nattended public schools my whole life, as did my folks.  Until recently, in<br/>\nmy mind, there simply was no other way, other than private/parochial school,<br/>\nperhaps.  I still second-guess my decision to homeschool (what if Matt<br/>\ndoesn&#39;t learn anything?  What if he gets...weird?).  It&#39;s still nearly a<br/>\ndaily struggle, but even before I&#39;d found this group, I knew instinctively<br/>\nthat I&#39;m doing the right thing.  For sure.<br/>\n<br/>\n <br/>\n<br/>\nAmy, for what it&#39;s worth, I&#39;ve &quot;unschooled&quot; my kid in California (though<br/>\nonly for a minute so far), and I&#39;m not in jail yet.  It&#39;s a VERY easy<br/>\nprocess, and there&#39;s lots of online help if you need it.  I&#39;d be happy to<br/>\nsend links if you&#39;d like.  I didn&#39;t jump into this lightly, and I feel like<br/>\nI&#39;ve done my homework; in any case, legal problems are the least of my<br/>\nworries.  It&#39;s the other stuff that gets to me, like unintentionally failing<br/>\nmy kid.  I try to remember that, worst case scenario, there&#39;s nothing I can<br/>\ndo to screw up my kid&#39;s entire future...at worst, he&#39;ll have to attend a<br/>\ncouple of years at a junior college before getting into whatever university<br/>\nhe chooses (if he even goes to college-that&#39;s another story altogether).<br/>\nHowever, I suspect that homeschooling will become increasingly legitimized,<br/>\nnot the other way around.  And I remind myself that, if Matt doesn&#39;t learn a<br/>\nTHING at home, at least he&#39;s not being subjected to daily behavior<br/>\nmodification/indoctrination at school!  <br/>\n<br/>\n <br/>\n<br/>\nI have been REALLY impressed by what I&#39;ve read so far from this group.  I<br/>\nshare many of your concerns (in-laws, amount of time spent playing video<br/>\ngames, how to/if to actively try to teach, etc.), and I expect that I&#39;ll<br/>\nhave some questions of my own before too long.  Anyway, I apologize for<br/>\nbeing a bit long-winded this time; I&#39;ll try to keep my posts a little<br/>\nshorter in the future.  But it&#39;s great to meet you, and I look forward to<br/>\nactively participating with the group!<br/>\n<br/>\n <br/>\n<br/>\n--Susan L.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":209361242,"authorName":"JRossedd","from":"JRossedd &lt;jrossedd@...&gt;","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I need serious advice!","postDate":"1321644909","msgId":47702,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFQzZCMzZELjkwNDA1MDFAY29tY2FzdC5uZXQ+"},"prevInTopic":47701,"nextInTopic":47703,"prevInTime":47701,"nextInTime":47703,"topicId":47697,"numMessagesInTopic":0,"msgSnippet":"I would rather take all the money I would need to spend on hiring a private tutor for her to catch up, and spend it on singing lessons and theater training","messageBody":"<div id=\"ygrps-yiv-1269348627\">&quot;I would rather take all the money I would need to spend on hiring a <br/>\nprivate tutor for her to catch up, and spend it on singing lessons and <br/>\ntheater training which is her passion.&quot;<br/>\n<br/>\nLots of us have done that very thing btw: Pam Sorooshian and I (JJ)  are <br/>\njust two I know on this list, who have spent years with multiple kids <br/>\ngrowing up gloriously in musical theatre, without school.  All perfectly <br/>\nlegal (I mention Pam because her family did this in CA; we did it in <br/>\nFlorida&#39;s capital city.)<br/>\n<br/>\nFirst check your own preconceptions (as revealed through subconscious <br/>\nwords you chose) though. It helps to understand the degree to which <br/>\nsinging and music and theatre are best unschooled, not so much to be <br/>\ntaught and trained as to be loved and experienced through deeply <br/>\npersonal connections and relationships. As you say, because it is her <br/>\npassion, the best way to live it and learn it is within the right <br/>\ncommunity of people sharing that passion.<br/>\n<br/>\nWe had a seven-year-old firstborn who developed a passion for musical <br/>\ntheatre and opera. We literally wore out a dvd of the 10th anniversary <br/>\nLes Miserable in Concert, practially using it like a fireplace around <br/>\nwhich we&#39;d gather for mutual warmth every evening. We all knew all the <br/>\nwords and all the harmony parts and sang them in the car, worked the <br/>\nlyrics into conversation as power of story, happy times!<br/>\n<br/>\nThen think real community musical theatre, for instance -- right now! -- <br/>\nrather than school drama and/or private classes and teachers preparing <br/>\nher for years of practice until she might someday get to try it for <br/>\nreal. My daughter spent a couple of years getting known at a musical <br/>\ntheatre dance studio and then started backstage on &quot;running crew&quot; around <br/>\nage 12 or 13, still too young/inexperienced to be cast and obviously <br/>\nwith an immature body and voice. Yet this is wonderful (free!) real <br/>\nmusical theatre right now, not ten years from now when thety grow up, <br/>\nwith whole worlds to learn and connecting to everything else in those <br/>\nworlds.<br/>\n<br/>\nAs a growing teen she did get cast every few shows, when they <br/>\ndesperately needed another boy/man in the ensemble, so she got to play <br/>\nsome characters much more interesting than the stereotypical ingenue <br/>\n(Depression-era carnival roustabout was my favorite, I think, in &quot;Side <br/>\nShow&quot;) and by the time her chest was too developed for boy roles and her <br/>\nvoice was physically developed enough for serious study here at the <br/>\nuniversity, she had almost a dozen shows under her belt on and <br/>\noff-stage, not high school shows but actual community theatre.<br/>\n<br/>\nAt age 16.<br/>\n<br/>\nWe figured she might want to major in musical theatre or voice at the <br/>\nexcellent fine arts programs here, but a funny thing happened on her way <br/>\nthere. She didn&#39;t see the point in doing something she already knew so <br/>\nmuch about, just to earn credit. She wanted degrees that connected to <br/>\n(but not echoed or remediated) what she already knew and loved from her <br/>\ndirect experience of it in the real world. And she already knew everyone <br/>\nin that community, as an equal rather than a student, including <br/>\nprofessors and star performers of all ages.<br/>\n<br/>\nOur son is 16 now and starting private vocal study with the same <br/>\nprofessor,but as a boy he&#39;s been cast since he was 10 and hasn&#39;t had the <br/>\nchance to get backstage much -- they always need his now-booming <br/>\nbaritone in the ensemble. Now that he&#39;s tall and his whiskers are coming <br/>\nin, he&#39;ll soon have a shot at young male named roles. Although as I&#39;ve <br/>\nlearned, baritones aren&#39;t leads as often as they once were. Sidekicks <br/>\nand villains get great songs, too, though. ;-)<br/>\n<br/>\nWhen I write about our unschooling through musical theatre, these are <br/>\nthe things I think about. Here&#39;s a grab bag of my posts (and discussion <br/>\nfollowing each) about our son and daughter, including the first one <br/>\nwhich my daughter wrote herself, at age 18:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://misedjj.wordpress.com/2008/09/30/there-is-nothing-sexier-than-a-baritone/\">http://misedjj.wordpress.com/2008/09/30/there-is-nothing-sexier-than-a-baritone/</a><br/>\n<br/>\nI remember my mom begging me to change the channel when she heard the <br/>\nopening notes of &quot;Bless Your Beautiful Hide <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=iyrYBXuz5YY\">http://www.youtube.com/watch?v=iyrYBXuz5YY</a>&gt;.&quot;<br/>\n<br/>\nHer argument was:<br/>\nIt was heinous that<br/>\na) Howard Keel was roaming the streets looking for a wife simply because <br/>\nshe would be a useful farming asset, and,<br/>\nb) He had reduced the act to such a transactional level that he was <br/>\nequating this theoretical woman with livestock.<br/>\n<br/>\nMy argument was as follows:<br/>\nShut up, Howard Keel is singing. . .<br/>\n<br/>\n. . . after listening to Howard and Ezio for awhile, those leading <br/>\ntenors start to sound pretty whiny and boring.<br/>\n<br/>\n***************************<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://cockingasnook.wordpress.com/2010/10/07/favds-musical-opens-tomorrow-night/\">http://cockingasnook.wordpress.com/2010/10/07/favds-musical-opens-tomorrow-night/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://cockingasnook.wordpress.com/2007/07/04/musical-theatre-our-core-curriculum-today-as-always/\">http://cockingasnook.wordpress.com/2007/07/04/musical-theatre-our-core-curriculum-today-as-always/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://cockingasnook.wordpress.com/2010/02/11/favorite-daughters-upcoming-musical-coverage/\">http://cockingasnook.wordpress.com/2010/02/11/favorite-daughters-upcoming-musical-coverage/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://cockingasnook.wordpress.com/2011/07/14/a-musical-theatre-unschoolers-ode-to-last-harry-potter-premiere/\">http://cockingasnook.wordpress.com/2011/07/14/a-musical-theatre-unschoolers-ode-to-last-harry-potter-premiere/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://cockingasnook.wordpress.com/2008/05/12/what-weve-been-up-to-while-not-in-school/\">http://cockingasnook.wordpress.com/2008/05/12/what-weve-been-up-to-while-not-in-school/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://cockingasnook.wordpress.com/2007/06/11/summer-theatre-real-life-learning-in-real-community/\">http://cockingasnook.wordpress.com/2007/06/11/summer-theatre-real-life-learning-in-real-community/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://cockingasnook.wordpress.com/2006/12/27/sound-is-my-servant/\">http://cockingasnook.wordpress.com/2006/12/27/sound-is-my-servant/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://cockingasnook.wordpress.com/2007/01/22/nudes-and-prudes/\">http://cockingasnook.wordpress.com/2007/01/22/nudes-and-prudes/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://cockingasnook.wordpress.com/2011/05/29/spring-sprang-sprung-doctor-js-kids-bustin-out-all-over/\">http://cockingasnook.wordpress.com/2011/05/29/spring-sprang-sprung-doctor-js-kids-bustin-out-all-over/</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/iyrYBXuz5YY?wmode=opaque","type":"VIDEO"}]},{"userId":223130287,"authorName":"Krisula Moyer","from":"Krisula Moyer &lt;krisula@...&gt;","profile":"krisulaula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I need serious advice!","postDate":"1321642041","msgId":47701,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE0ODRCNTJELTIwRUItNDdFMC04MTk5LTU5REZDMzYxOUEyREBsZW1vbmNyYWIuY29tPg=="},"prevInTopic":47700,"nextInTopic":47702,"prevInTime":47700,"nextInTime":47702,"topicId":47697,"numMessagesInTopic":0,"msgSnippet":"In california, there is a wonderful statewide group with homeschoolers of all sorts including many many unschoolers.  You can find all the information you need","messageBody":"<div id=\"ygrps-yiv-639704542\">In california, there is a wonderful statewide group with homeschoolers of all sorts including many many unschoolers.  You can find all the information you need here:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hsc.org/choices.php\">http://www.hsc.org/choices.php</a>  There is a FAQ page there that might be helpful and join the yahoo group:   HSC - The HomeSchool Association of California  and ask this question there.  It is very easy to homeschool in CA.  There is no need to suffer with curriculum or an umbrella/charter school that&#39;s not working for you.  <br/>\nKrisula<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I need serious advice!","postDate":"1321634121","msgId":47700,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4MzUxNUY0N0RAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":47699,"nextInTopic":47701,"prevInTime":47699,"nextInTime":47701,"topicId":47697,"numMessagesInTopic":0,"msgSnippet":"In CA, you can file an affidavit and become your own private school - then you can do things however you want, without any of the school district regulations","messageBody":"<div id=\"ygrps-yiv-1007749676\">In CA, you can file an affidavit and become your own private school - then you can do things however you want, without any of the school district regulations and curricula. Details on that are best left to local homeschoolers/websites. So long as you file the paperwork in a timely fashion (withdraw her as needed from her current school arrangement, file the affidavit, etc), you&#39;re free and clear without hiding anything or being &quot;under the radar&quot; - you&#39;ll be &quot;off the radar&quot; instead.<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: I need serious advice!","postDate":"1321562198","msgId":47699,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGphM3I4bStxaDc3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGphM2t2ditmZWF0QGVHcm91cHMuY29tPg=="},"prevInTopic":47697,"nextInTopic":47700,"prevInTime":47698,"nextInTime":47700,"topicId":47697,"numMessagesInTopic":0,"msgSnippet":"To some extent, this is more of a homeschooling issue than unschooling per se and you would benefit from checking with homeschoolers in your area to find out","messageBody":"<div id=\"ygrps-yiv-1255460276\">To some extent, this is more of a homeschooling issue than unschooling per se and you would benefit from checking with homeschoolers in your area to find out what your legal options are. <br/>\n<br/>\nThat being said ;) here are a couple links to CA homeschooling laws and information: <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://unschoolers.com/california.html\">http://unschoolers.com/california.html</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://homeschooling.gomilpitas.com/regional/CaliforniaR4.htm\">http://homeschooling.gomilpitas.com/regional/CaliforniaR4.htm</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://homeschooling.gomilpitas.com/laws/blCA.htm\">http://homeschooling.gomilpitas.com/laws/blCA.htm</a><br/>\n<br/>\nThe second of those is about filing an affidavit to be a private school, which is apparently the way to go, homeschooling in CA. Becoming some type of private school - your own or via an umbrella organization - is the way to go in many US states, as the laws for private schools are less onerous than for home education. <br/>\n<br/>\nA more generally useful page for unschoolers who need to report what their kids are doing naturally to the Powers That Be:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschoolingcurriculum.html\">http://sandradodd.com/unschoolingcurriculum.html</a><br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":507060640,"authorName":"amy","from":"&quot;amy&quot; &lt;amy@...&gt;","profile":"amybergsd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"I need serious advice!","postDate":"1321555775","msgId":47697,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGphM2t2ditmZWF0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":47699,"prevInTime":47696,"nextInTime":47698,"topicId":47697,"numMessagesInTopic":0,"msgSnippet":"I m a wreak! I have 3 daughters. Ages 9, 3 and 2. I have tried 3 different public schools for my oldest in hopes to find the best one. I tried a home-school","messageBody":"<div id=\"ygrps-yiv-884879698\">I&#39;m a wreak! I have 3 daughters. Ages 9, 3 and 2. I have tried 3 different public schools for my oldest in hopes to find the best one. I tried a home-school curriculum which didn&#39;t work because I was having to teach her everything and my two little ones just don&#39;t give me the time. Now she is doing Connections Academy at home and it is overwhelming for all of us! She is 17 lessons overdue and I&#39;m pulling my hair out. I have thought about unschooling many times before but I&#39;m scared I will get into trouble or go to jail. We live in CA. Stupid? I would rather take all the money I would need to spend on hiring a private tutor for her to catch up and spend it on singing lessons and theater training which is her passion. How do I get her back under the radar so I can let my family be free to do and learn what they wish?!!</div>","specialLinks":[]}],"prevTopicId":47705,"nextTopicId":47738}}