{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: help me understand   (LONG)  dang.","postDate":"1089908988","msgId":2089,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNzE1LjEwMjk0OS4yNzYwLjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":2088,"nextInTime":2090,"topicId":2089,"numMessagesInTopic":0,"msgSnippet":"***i am wondering how your children learn  much when its just left up to them?*** The best thing you could do right now is relax and enjoy your baby. While you","messageBody":"<div id=\"ygrps-yiv-72869007\">***i am wondering how your children learn  much when its just left up to<br/>\nthem?***<br/>\n<br/>\nThe best thing you could do right now is relax and enjoy your baby. <br/>\nWhile you watch your baby learn to walk and talk and zoom around and<br/>\nthrow and climb and dress (and undress!&lt;g&gt;) and all the things babies and<br/>\ntoddlers do, you will begin to understand how and why kids learn. <br/>\n<br/>\nKids learn from living in an environment where interesting things are<br/>\nhappening.  They learn because they are part of the human race.  We are<br/>\ncreatures who are learning every minute of our lives. <br/>\n<br/>\n***...seems to me like the kids wouldn&#39;t want to learn on their own due<br/>\nto lack of motivation...***<br/>\n<br/>\nI&#39;m gently offering this as something to ponder;  Why do you think a<br/>\nperson wouldn&#39;t want to learn?  What about being ignorant and feeling<br/>\nleft out would appeal to a person? <br/>\n<br/>\nWhen my son was very little he watched us and saw that we took a glass<br/>\nfrom the cabinet when we wanted something to drink.  He understood where<br/>\nthe glasses where and what they were for.  He couldn&#39;t reach them, so he<br/>\nsurmised he could push a chair to the counter and climb for a glass. <br/>\nWhat made him do that?  He could have asked for a drink (he learned to<br/>\ntalk very early) so why did he want to find a way to get the glass<br/>\nhimself?   It&#39;s because that&#39;s what humans do.  We observe, think,<br/>\nparticipate, learn and finally &quot;do&quot;. <br/>\n <br/>\nThe bigger question in my mind is why anyone would ever imagine a person<br/>\nwouldn&#39;t want to?  Wait, I know!  Because of school.   In school we&#39;re<br/>\nmade to believe learning comes in categories with some aspects being much<br/>\nmore important than others.   We&#39;re made to feel we&#39;re empty vessels<br/>\nuntil an expert opens our head and pours the knowledge in.   It&#39;s just<br/>\nnot so.  Humans existed long before schools and if school was the only<br/>\nway to learn what we&#39;d needed to get along in the world no one would have<br/>\nbeen left.<br/>\n<br/>\n*** i cant imagine a 12 y.o. learning something &quot;important&quot; like math, or<br/>\nspelling<br/>\n, or whatever , without any structure.***<br/>\n<br/>\nConveniently, my son is twelve. &lt;g&gt;   He&#39;s never been to school and has<br/>\nalways been an unschooler.  This week he&#39;s learning to drive.  He told me<br/>\nhe wanted to learn and we&#39;ve been going out on the back roads and he&#39;s<br/>\nbeen driving.  He&#39;s doing very well.   He&#39;s a kind of natural at the<br/>\nwheel, maybe from all these years of playing video games and keeping<br/>\ncharacters aligned on narrow paths, avoiding obstacles.  <br/>\n<br/>\nHe&#39;s learning about  the life in Iraq for military men as his uncle is<br/>\nhere on R&R.   <br/>\nHe&#39;s learning more about Hitler after checking out &quot;The Rise and Fall of<br/>\nthe  Third Reich&quot; by William Shirer. <br/>\nIt&#39;s an enormous book, and dry, and he&#39;s plodding through it and looking<br/>\nup or asking about things he doesn&#39;t understand.<br/>\nHe&#39;s learning about Yellow Bellied Marmots because we pass a family of<br/>\nthem every evening on our walk and these are the first he&#39;s been able to<br/>\nreally observe.   He&#39;s looked up everything he can find about them. <br/>\n<br/>\nYou don&#39;t have time to read everything he&#39;s learning about in summer of<br/>\n2004. &lt;g&gt;  But he made coffee for my mom when she came and I was in the<br/>\nshower and they were happily chatting about hummingbirds when I came out.<br/>\n He bought me a Chai when he ran into the store for a Coke yesterday.  I<br/>\ndidn&#39;t ask for one, he just noticed them there in the cooler and knew I<br/>\nliked them and brought one out to me, paid for with his own money.   Last<br/>\nnight he did his own laundry and took out the trash.  I didn&#39;t ask him<br/>\nto, he just saw there were things needed to be done.   All of this is<br/>\nimportant life stuff and all of it came to him without lessons. <br/>\n<br/>\nThis is not a remarkable boy in any sense that would impress snobby IQ<br/>\ntesters or &quot;educational&quot; professionals.  He can add and subtract and form<br/>\na complete sentence but there&#39;s nothing wildly spectacular about him<br/>\nunless you consider his confidence and joy and fearlessness when learning<br/>\nand his perfect understanding of what it is to be a free, capable,<br/>\nlearning human being. <br/>\n<br/>\n***&quot;important&quot; like math, or spelling, or whatever ,***<br/>\n<br/>\nI&#39;m forty one and I couldn&#39;t recite the multiplication tables to you nor<br/>\ncould I spell &quot;multiplication&quot; correctly without the help of spell check.<br/>\n&lt;G&gt;  Yet I&#39;ll bet anyone who looks at this e-mail will be able to read<br/>\nthe words.  (Whether it will make sense to them is a different matter.<br/>\n&lt;g&gt;)   I&#39;ve owned my own business, worked for people who&#39;d have me back<br/>\nagain, I can balance my checkbook and I&#39;ve written letters to my senators<br/>\nand congressmen.   I&#39;m getting by!  I&#39;m not a math wiz nor a spelling wiz<br/>\nand I went to public school, had a structured education and somehow<br/>\nmissed those things anyway.   Still, without mastering those skills I&#39;ve<br/>\nhad a successful, happy life.  I&#39;ve lived all these years since school<br/>\nand I haven&#39;t needed to recite multiplication tables once.   I&#39;m sure<br/>\nit&#39;s on my permanent record somewhere that I&#39;ll never make it. &lt;g&gt; <br/>\n<br/>\n***i understand that they learn thru life experiences, but they don&#39;t<br/>\nnecessarily learn every thing they might need.***<br/>\n<br/>\nI went to school but I didn&#39;t learn everything I needed.  Lessons are no<br/>\nguarantee a person is learning, much less learning &quot;everything&quot;.   But<br/>\nwhat you come to understand about learning is that it&#39;s not a thing<br/>\nthat&#39;s ever accomplished.  It&#39;s a continual process.  When we need or<br/>\nwant information we find it.  When we need or want a skill we acquire it.<br/>\n People go on from school to hold jobs, pay taxes, vote, buy properties, <br/>\nfind life partners, have babies, cope with illness, travel, explore,<br/>\nclimb mountains... how did they learn that?  They learned by living.  <br/>\n<br/>\n***how do you get a child to want to learn instead of play video games,<br/>\netc?.***<br/>\n<br/>\nPlay *is* learning.  Playing video games might be one of the most<br/>\neffective ways to acquire skills I&#39;ve ever seen.  The player is<br/>\ninterested, challenged, but not beyond what she can eventually master and<br/>\nencouraged to go on by the thrill of accomplishment and ever increasing<br/>\nchallenge.   Just like life, only with pause, save, and restart. &lt;g&gt;<br/>\n<br/>\nYou don&#39;t have to get a child to want to learn.  All you have to do is<br/>\navoid turning leaning into a boring, terrible experience.  The way you<br/>\navoid that is by seeing your child as a whole and perfect learning<br/>\nindividual and then, helping that individual do the things he or she<br/>\nwants to do.  Don&#39;t give lessons, don&#39;t lecture, don&#39;t make learning out<br/>\nto be something that has to be done *to* your child.  Convince yourself<br/>\nlearning is what people are all about.  <br/>\n<br/>\nRead what you can about unschooling and let go of schoolish ideas about<br/>\nwhat people need.  Look at your remarkable child and watch how life<br/>\ncarries your baby along.  Provide him or her with interesting things and<br/>\na happy mom and days full of play and you will very quickly understand<br/>\nhow and why kids learn - how and why we all learn, our whole lives long. <br/>\n<br/>\n<br/>\nAnd ask lots of questions on lists like this. &lt;g&gt;<br/>\n<br/>\nDeb</div>","specialLinks":[]}],"prevTopicId":2039,"nextTopicId":1776}}