{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Finding our way back home","postDate":"1269350160","msgId":43474,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNjEyMGExMTAwMzIzMDYxNng0MDdhOWEzNnMxZDQ1ZWQyNmU1ZTJhMDkzQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDRhMmIyODQyMTAwMzIyMDgyM20xYWE1ODAyMWs1MjQyZjY0OTQ2NDIzMmJhQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDRhMmIyODQyMTAwMzIyMDgyM20xYWE1ODAyMWs1MjQyZjY0OTQ2NDIzMmJhQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":43470,"nextInTopic":0,"prevInTime":43473,"nextInTime":43475,"topicId":43464,"numMessagesInTopic":0,"msgSnippet":"I would like to write more but have limited time at the moment. I want to write something I have been thinking about for some time now. we have been rather","messageBody":"<div id=\"ygrps-yiv-1021302555\">I would like to write more but have limited time at the moment. I want to<br/>\nwrite something I have been thinking about for some time now. we have been<br/>\nrather tight financially the past couple of years. There are many more<br/>\n&quot;noes&quot; than I would like to have for my children. What I have decided for me<br/>\nand how I view life for my family is that we would be just scraping by<br/>\nwhether we unschooled or not. Parenting them the way we do and living the<br/>\nlife we do enables more joy than would be in my children&#39;s lives otherwise.<br/>\nSchool would just cause more problems instead of solve things, for us.<br/>\n<br/>\nSome things that work for us are an allowance. My two older kids have at<br/>\nleast a little of their own money. We have vision boards so when money is<br/>\navailable we can use it towards something that someone really wants rather<br/>\nthan a spur of the moment item. (not that spur of the moment is bad just it<br/>\nwasn&#39;t working for my kids). I read freecycle and craigslist daily. I seek<br/>\nout things that I know my kids will love or that they have requested. We<br/>\nbarter with folks. We shop at thrift stores and yard sales.<br/>\n<br/>\nI look for ways to turn a NO into a YES. It isn&#39;t always possible but often<br/>\nI a pleasantly surprised when it can be.<br/>\n<br/>\nFor now<br/>\nFaith<br/>\n<br/>\n<br/>\nOn Mon, Mar 22, 2010 at 11:23 AM, Tina Tarbutton<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tina.tarbutton@...\">tina.tarbutton@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Yesterday at the spring festival he saw a puppet he really liked. It was<br/>\n&gt; $12, and we honestly had exactly $12 to our name, and the gas tank is empty<br/>\n&gt; and we aren&#39;t getting a paycheck until Thursday, so I had to say no. I made<br/>\n&gt; the no as soft as possible (maybe we can try to find one after we get paid,<br/>\n&gt; we can look online and see if we can find them cheaper, and maybe we can<br/>\n&gt; find directions for making one that makes it even less expensive) but it<br/>\n&gt; was<br/>\n&gt; still a no, and he still gets very disappointed when we say no (although I<br/>\n&gt; do have to mention that his disapointment was less harsh since I didn&#39;t<br/>\n&gt; just<br/>\n&gt; say a flat out NO). We are a very low income family, with both of us making<br/>\n&gt; less than $8 an hour. It&#39;s a often a struggle just to keep the rent paid<br/>\n&gt; and the electric going. When it comes to buying things, unfortunately no is<br/>\n&gt; very often the answer. I don&#39;t know how to fix that.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  __.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>-- <br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Finding our way back home","postDate":"1269297631","msgId":43470,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvOHJrditlbzltQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRhMmIyODQyMTAwMzIyMDgyM20xYWE1ODAyMWs1MjQyZjY0OTQ2NDIzMmJhQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":43468,"nextInTopic":43474,"prevInTime":43469,"nextInTime":43471,"topicId":43464,"numMessagesInTopic":0,"msgSnippet":"... We ve had some ups and downs, financially, and still have a pretty lean budget, although not as bad as some points in the past. When finances have been the","messageBody":"<div id=\"ygrps-yiv-590299599\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Tina Tarbutton &lt;tina.tarbutton@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;We are a very low income family, with both of us making<br/>\n&gt; less than $8 an hour.  It&#39;s a often a struggle just to keep the rent paid<br/>\n&gt; and the electric going.  When it comes to buying things, unfortunately no is<br/>\n&gt; very often the answer.  I don&#39;t know how to fix that.<br/>\n<br/>\n </span></blockquote>We&#39;ve had some ups and downs, financially, and still have a pretty lean budget, although not as bad as some points in the past. When finances have been the tightest, we went to yard sales and thrift stores for the most part so that it was possible to say Yes more. If you have a &quot;Dollar Tree&quot; - one of those stores where everythings one dollar or less - that makes another place to have a &quot;yes fest&quot;. I know it helps my state of mind to be able to go out and get a couple candles, or some bath salts - something for a little self-love, and I know the kids brighten up, too, when things have been hard to say &quot;lets go out and spend this $5!&quot; <br/>\n<br/>\nEven now we tend to buy a lot second hand, and that can help slim finances go further. Pawn shops are good to browse, especially for things like electronics. <br/>\n<br/>\nSomething else that might help is to offer him a no-strings-attached allowance. I may not be as much as you&#39;d like, but it gives him the option of spending money without asking you, and that can feel really good to some kids. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; From what I&#39;ve read, radical unschooling is about being very close to your<br/>\n&gt; child at all times, well, we&#39;re a family where both of us have to work.<br/>\n<br/>\n </span></blockquote>With younger children, that&#39;s often true, but as kids get older they don&#39;t need quite as much of us. It sounds like you&#39;re trying to be creative with scheduling so that y&#39;all can be together as much as possible, and that&#39;s really the juggling act. With time and practice you get better at it - and as you said, things like realizing your guy staying up late means he&#39;s closer to your sleep schedule can make a big difference. Most of the time there&#39;s not one single solution, but a collection of strategies that all help sometimes (but not all the time). <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; Also, he spends somewhere between one and three months at his dad&#39;s house<br/>\n&gt; for the summer.  I can&#39;t even imagine the whirlwind it&#39;s going to cause in<br/>\n&gt; Draven&#39;s life if we&#39;re living this way, and his father is treating him like<br/>\n&gt; a kid instead of like a person.<br/>\n<br/>\n </span></blockquote>No matter what, you can&#39;t control his relationship with his dad or what happens over there. Ray&#39;s my stepson, and his bio mom isn&#39;t on board with unschooling at all. As he&#39;s gotten older, he&#39;s figured out how to have a relationship with her that feels okay to him, but it was rough for a couple years. Things are very different at her house. <br/>\n<br/>\nNo-one likes to be told how to parent if they haven&#39;t asked for help/information. You can offer him &quot;what&#39;s been working at our house&quot; comments and see how they&#39;re received, but be ready to back down at once. It won&#39;t help to have dad resistant. Its also a good idea to ask your son what, if anything, he thinks you could do to help. Would it help to make a push to shift his sleep habits back to &quot;normal&quot; a week or two before going to his dad&#39;s for instance? <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Finding our way back home","postDate":"1269285469","msgId":43468,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvOGZvdCs5bzEzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRhMmIyODQyMTAwMzIyMDgyM20xYWE1ODAyMWs1MjQyZjY0OTQ2NDIzMmJhQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":43464,"nextInTopic":43470,"prevInTime":43467,"nextInTime":43469,"topicId":43464,"numMessagesInTopic":0,"msgSnippet":"... Maybe that s a project your son can tackle sometime when you re at work - deciding what *he* can let go of in terms of toys. Its something he can do","messageBody":"<div id=\"ygrps-yiv-2055267263\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Tina Tarbutton &lt;tina.tarbutton@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; We now have half packed boxes of toys in his room and in the living room,<br/>\n&gt; art stuff that we found (it had been packed away in boxes) also all over the<br/>\n&gt; place, and I&#39;ve realized that to get the art stuff out, we&#39;re going to have<br/>\n&gt; to get rid of some stuff, so we can fit it all<br/>\n<br/>\n </span></blockquote>Maybe that&#39;s a project your son can tackle sometime when you&#39;re at work - deciding what *he* can let go of in terms of toys. Its something he can do watching tv ;) and it brings him into the decision making process. Is He interested in doing &quot;art stuff&quot;? If so, it might be sort-of obvious that y&#39;all need a little space. <br/>\n<br/>\nOr it may not be. We have a few masonite boards that are 18&quot;x24&quot; that are great for being hard, smooth, and portable surfaces. Mo uses them to draw or paint or write - even to build with legos - when things are on the cluttered end of the housekeeping spectrum. They&#39;re the sort of thing you can set on top of a anything - a box, a bed, a trash can - and make an instant table. I don&#39;t recall where we go them, but anything hard and flat about that size is super-handy. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I&#39;m not really sure how<br/>\n&gt; to let go of the fact that I had just grounded him (and still technically he<br/>\n&gt; would be grounded if I hadn&#39;t snapped out of it).<br/>\n<br/>\n </span></blockquote>Keep saying yes. If he asks &quot;am I still grounded?&quot; you can say &quot;No, I&#39;m sorry. I&#39;m trying to stop doing that, I don&#39;t think its very helpful, but its a bad habit I&#39;ve gotten into. Hopefully I&#39;ll do better next time.&quot; Statements like that (and I promise you&#39;ll get other opportunities to say things like that, one of the benefits of being human) help kids see that adults aren&#39;t super-heros, we&#39;re fallible people trying to figure things out. That&#39;s a Good thing, although popular &quot;wisdom&quot; often says otherwise. Kids need to know they aren&#39;t expected to grow up to Be superheros - its okay if They don&#39;t have everything figured out now, or when they&#39;re 18. Besides that, its more than a little obvious to kids that parents are human! Holding imaginary lines as though we&#39;re always in the right flies in the face of what they can clearly see as true (that sometimes we make mistakes). That&#39;s a mixed message that wears on relationships. <br/>\n<br/>\nI&#39;ll be back with more later - I&#39;m at work and my break is over ;)<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":196677035,"authorName":"Tina Tarbutton","from":"Tina Tarbutton &lt;tina.tarbutton@...&gt;","profile":"dravensmomhome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Finding our way back home","postDate":"1269271433","msgId":43464,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRhMmIyODQyMTAwMzIyMDgyM20xYWE1ODAyMWs1MjQyZjY0OTQ2NDIzMmJhQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":43468,"prevInTime":43463,"nextInTime":43465,"topicId":43464,"numMessagesInTopic":0,"msgSnippet":"I have a lot of questions, and I m honestly not sure where to start.  I think explaining what brought me back to unschooling, and then into radical unschooling","messageBody":"<div id=\"ygrps-yiv-1925996060\">I have a lot of questions, and I&#39;m honestly not sure where to start.  I<br/>\nthink explaining what brought me back to unschooling, and then into radical<br/>\nunschooling may give me a way to get them all out.<br/>\n<br/>\nMy wonderful 10 y/o son Draven has been homeschooled for most of his life.<br/>\n I joined the home-ed list when he was a few months old, quickly found out<br/>\nabout attachment parenting and did as much of that as possible, we had a<br/>\nparty the day he missed the kindergarten bus, and again when he missed the<br/>\nfirst grade bus.  By the beginning of his second grade year his father<br/>\n(Dominick) and I were in the middle of a mostly-easy-but-still-crazy<br/>\ndivorce, and the person I had moved in with insisted she couldn&#39;t have a<br/>\nchild in her house during the school hours, so he enrolled in school.  Up<br/>\nuntil then we had been very eclectic, almost-unschoolers.  A year and a half<br/>\nlater we had moved out of that person&#39;s house, his father had moved to<br/>\nmaryland (we live in florida) and I was six months into my relationship with<br/>\nmy partner (Parker).  Draven was bored to tears in school, the school didn&#39;t<br/>\nwant to do anything about it, and so over the winter break I sat down with<br/>\nDominick (who was visiting us for the holiday) and Parker, and said I wanted<br/>\nto bring him back home.  Dominick was all for it, Parker was very uneasy,<br/>\nbut she hadn&#39;t fully stepped into a parenting role at that point and said<br/>\nshe would go along with it and see how it worked.  We brought Draven into<br/>\nthe conversation and he lit up and then asked if he ever had to go back.<br/>\n<br/>\nSo, the day after Christmas break I started homeschooling in earnest, we<br/>\npulled out all the text books I could find, and I wrote up assignments, and<br/>\nwe did school.  When he left to go to his fathers for the summer, I sent 2<br/>\nboxes of work and text books for him to keep up his studies, and I checked<br/>\nin with them regularly to make sure he was doing school and not wasting his<br/>\nlife on those silly video games.<br/>\n<br/>\nI&#39;m honestly not sure how I made the switch to being such a die-hard<br/>\nschool-at-home-er.<br/>\n<br/>\nA year ago Parker and I both started working outside of the home.  We both<br/>\nhave 35+ hour a week jobs at gas stations, plus she works overnight 2 nights<br/>\na week doing private home heath care.  Our schedules vary constantly, and we<br/>\nboth work overnight quite often.  At first when we both worked the same 8<br/>\nhour shift Draven would spend that time at Parker&#39;s mom&#39;s house (which he<br/>\nHATED), and when our schedules only overlapped by a few hours he would stay<br/>\nhome, checking in with us by phone if needed.  Eventually he started just<br/>\nstaying home or if it was a weekend, at friends houses, because it was<br/>\nbetter than the alternative.  Things were pretty miserable.  When we worked<br/>\novernight, we&#39;d sleep most of the day, and since his bedtime was 9:30, he<br/>\nwas up early.  So even when he wasn&#39;t home alone, he was alone.  I would<br/>\ncheck his work weekly (or every other week, or every third week) just<br/>\nexpecting him to keep up with it and do X number of pages a day.  We were<br/>\nall pretty miserable.  He started asking to go to school.<br/>\n<br/>\nSo right before Christmas I went to check his work, and realized he hadn&#39;t<br/>\ntouched it in weeks.  When we asked him what he did that day, he would tell<br/>\nus he did some schoolwork, and would even tell us what he learned, but he<br/>\nwasn&#39;t really doing anything.  I flipped out about the lying, grounded him,<br/>\nno TV, no Computer, no going outside, and he cried and yelled at the same<br/>\ntime &quot;You promised me learning would always be fun, we used to do this<br/>\ntogether, now it&#39;s just me with these boring horrible books.&quot;  I started<br/>\ncrying, he was crying, and poor Parker was trying to figure out how to keep<br/>\nthe role of authoritarian in a house full of weeping people.  So I grabbed<br/>\nhim, and I hugged him, and I said I was sorry, and I was wrong, and we would<br/>\nfix the school work thing, but that he was still grounded for lying (Yes, I<br/>\nreally was that dense).<br/>\n<br/>\nSo, we decide to unschool.  We&#39;re let him decide what to learn and when, and<br/>\nwe do it through TV and computer and real books.  Parker and I start working<br/>\non our schedules with our managers to severely cut down on the time he&#39;s<br/>\nhome alone.<br/>\n<br/>\nI also get rid of the bedtime, knowing that if he stays up late at night,<br/>\nand sleeps in, he&#39;ll be more on our schedule, but the TV has to be off after<br/>\n9.  Parker leaves for work one night last week, but she forgot something, so<br/>\nshe comes back home, and he&#39;s sitting here watching TV, and he lies about<br/>\nfinishing a show he had been watching before she left (she let him finish<br/>\nhis show before she had him turn off the TV).  So the next day, I freak out,<br/>\ngrounded again, this time we&#39;re packing up your toys too.<br/>\n<br/>\nThe whole time in the back of my head I&#39;m thinking, he watched TV because he<br/>\nneeded some company while we were both at work, he lied because he knew he&#39;d<br/>\nget in trouble for the TV.  This is NOT his fault.<br/>\n<br/>\nAnd so I bring it up to Parker (who was raised by a military dad, and a<br/>\nteacher mom, and is already kind of freaking about the unschooling idea),<br/>\nand I say, that&#39;s it, we can&#39;t do this anymore.<br/>\n<br/>\nSo we talk and and I read, and we talk and I read, and we talk.  I called<br/>\nhis dad and let him know what was going on as well.  This weekend I managed<br/>\nto work 3 overnight shifts and still get us out of the house on both<br/>\nSaturday and Sunday to neat events in our community (something we hadn&#39;t<br/>\ndone in a long time).  Yesterday Parker said, &quot;This all makes sense, but how<br/>\ndo we do it&quot;.  I told her to just start saying Yes.  And we did.<br/>\n<br/>\nYesterday when we got home from the spring festival, and I had been up for<br/>\n20 hours straight and had to be to work 5 hours later, I hear Draven call<br/>\ndown the hall &quot;Mommy, Momma, can we cuddle before you go to sleep?&quot;  Yes!<br/>\n &quot;Can we watch TV while we&#39;re cuddling&quot; Yes!  Then later in the night after<br/>\nI had left for work, and Parker was just waking up before she had to leave<br/>\n&quot;Mommy can I cuddle before you leave?&quot;  Yes!  &quot;Can I lay in your bed and<br/>\nwatch TV while you&#39;re at work?&quot; Yes!<br/>\n<br/>\nHowever, I&#39;m also very lost in some areas.<br/>\n<br/>\nWe now have half packed boxes of toys in his room and in the living room,<br/>\nart stuff that we found (it had been packed away in boxes) also all over the<br/>\nplace, and I&#39;ve realized that to get the art stuff out, we&#39;re going to have<br/>\nto get rid of some stuff, so we can fit it all, and I&#39;m not really sure how<br/>\nto let go of the fact that I had just grounded him (and still technically he<br/>\nwould be grounded if I hadn&#39;t snapped out of it).<br/>\n<br/>\n Yesterday at the spring festival he saw a puppet he really liked.  It was<br/>\n$12, and we honestly had exactly $12 to our name, and the gas tank is empty<br/>\nand we aren&#39;t getting a paycheck until Thursday, so I had to say no.  I made<br/>\nthe no as soft as possible (maybe we can try to find one after we get paid,<br/>\nwe can look online and see if we can find them cheaper, and maybe we can<br/>\nfind directions for making one that makes it even less expensive) but it was<br/>\nstill a no, and he still gets very disappointed when we say no (although I<br/>\ndo have to mention that his disapointment was less harsh since I didn&#39;t just<br/>\nsay a flat out NO).  We are a very low income family, with both of us making<br/>\nless than $8 an hour.  It&#39;s a often a struggle just to keep the rent paid<br/>\nand the electric going.  When it comes to buying things, unfortunately no is<br/>\nvery often the answer.  I don&#39;t know how to fix that.<br/>\n<br/>\nFrom what I&#39;ve read, radical unschooling is about being very close to your<br/>\nchild at all times, well, we&#39;re a family where both of us have to work.  We<br/>\ndid make some huge changes to our schedule and hopefully last night was the<br/>\nLAST night we both work overnight at the same time.  We&#39;ve also changed our<br/>\nschedule on the days that we work daytime, so that hopefully they won&#39;t<br/>\noverlap more than 3-4 hours, and not more than once or twice a week.<br/>\n However, with me working 3-4 overnights a week, I don&#39;t know how to fix it<br/>\nto where I&#39;m not sleeping for 1/2 the day.  Advice would be wonderful,<br/>\nknowing that other households have 2 parents working and make this work<br/>\nwould be wonderful too.<br/>\n<br/>\nOn one side it seems SO simple, but at the same time logistically I can&#39;t<br/>\nfigure out how to fix it all so that we can get this bills paid and he gets<br/>\nhis needs and wants met.  Again, advice would be wonderful.<br/>\n<br/>\nAlso, he spends somewhere between one and three months at his dad&#39;s house<br/>\nfor the summer.  I can&#39;t even imagine the whirlwind it&#39;s going to cause in<br/>\nDraven&#39;s life if we&#39;re living this way, and his father is treating him like<br/>\na kid instead of like a person.   His father is not a reader, and doesn&#39;t<br/>\nreact well when I tell him how to parent.   I could use some serious advice<br/>\nin that area.<br/>\n<br/>\nI know the thing that mostly &quot;sold&quot; Parker on this style of living was when<br/>\nI brought up how much pride we take in our ability to communicate with each<br/>\nother, and then pointed out how horribly we communicate with Draven.<br/>\n<br/>\nI appreciate you taking the time to read this book I have just written, and<br/>\nI look forward to and advice and guidance I receive.<br/>\n<br/>\nTina<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":43449,"nextTopicId":43411}}