{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":27,"messages":[{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: public school","postDate":"1319033305","msgId":47578,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo3bWxrcCtyZzNmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PFNOVDE0My1XMTc5QkRFNTIxMzA1NTg1OTlERENEN0Y3RTUwQHBoeC5nYmw+"},"prevInTopic":47576,"nextInTopic":47625,"prevInTime":47577,"nextInTime":47579,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"Hmmm. . . yes, don t we all. :) It s not always easy being the parent. It s not always easy being the kid, either. This business of being a human being . . .","messageBody":"<div id=\"ygrps-yiv-1356027466\">Hmmm. . . yes, don&#39;t we all. :) <br/>\n<br/>\nIt&#39;s not always easy being the parent. It&#39;s not always easy being the kid, either. This business of being a human being . . . especially if you&#39;re not following someone else&#39;s set of rules. . . not always fun or easy. <br/>\n<br/>\nBut you could relax about it. You could decide that you, if not your daughter, are going to take a break from worrying about the &quot;to school or not to school&quot; question. <br/>\n<br/>\nMaybe tell her that? &quot;I hear you saying you miss school but that doesn&#39;t sound like exactly the answer to me. I need to think about this for a while. And talk to you when you have things to add about the subject. It&#39;s not a closed door but I need to mull, to stew, to put it in the back of my mind while we enjoy our days and see what happens.&quot;<br/>\n<br/>\nNance<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Denise Jordan &lt;denisejordan4@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; thank you Schuyler.  I do notice its when she is bored but then she&#39;s on to something else.  Just want to make the right decisions.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: public school","postDate":"1318976552","msgId":47576,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo3a3U3OCtwMWVmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PFNOVDE0My1XMTc5QkRFNTIxMzA1NTg1OTlERENEN0Y3RTUwQHBoeC5nYmw+"},"prevInTopic":47574,"nextInTopic":47578,"prevInTime":47575,"nextInTime":47577,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"... I think that s where you re getting stuck, actually. Can you step back from it? Maybe shift your thinking from good decision to thoughtful decision or","messageBody":"<div id=\"ygrps-yiv-368699588\">Denise Jordan &lt;denisejordan4@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Just want to make the right decisions.<br/>\n<br/>\n </span></blockquote>I think that&#39;s where you&#39;re getting stuck, actually. Can you step back from it? Maybe shift your thinking from &quot;good decision&quot; to &quot;thoughtful decision&quot; or &quot;mindful&quot; if you prefer. Somewhat ironically, that can include a lot of &quot;going with the flow&quot; - you said your daughter will bring up school when she&#39;s bored, but then shift to something else. That&#39;s an important point! My daughter has never been in school, but she often says &quot;I&#39;m bored&quot; when she&#39;s transitioning from one thing to the next. It took me awhile to step away from the word &quot;bored&quot; and learn to see her as being in the midst of a transition and trying to find a way to express that awkward uncomfortable feeling of being neither here nor there. Maybe your daughter uses &quot;I wish I was in school&quot; the same way. Say something positive or non-commital or nothing at all for awhile. There may not be a decision for you to make at all!<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: public school","postDate":"1318975476","msgId":47574,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo3a3Q1aytrZGMxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PFNOVDE0My1XMjE5NEY5NTY3ODhBOEQ1ODRDMUQ0NkY3RTUwQHBoeC5nYmw+"},"prevInTopic":47572,"nextInTopic":47576,"prevInTime":47573,"nextInTime":47575,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"... You also mentioned she doesn t say it all that often. In that case, I d let it go. Maybe ask what she d like to be doing in school right now, or something","messageBody":"<div id=\"ygrps-yiv-150297521\">Denise Jordan &lt;denisejordan4@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;&gt; &quot;does she really want to go to school or is it just something to say?&quot;<br/>\n&gt; <br/>\n&gt; thank you Nance.  My thoughts exactly.<br/>\n<br/>\n </span></blockquote>You also mentioned she doesn&#39;t say it all that often. In that case, I&#39;d let it go. Maybe ask what she&#39;d like to be doing in school right now, or something of that sort - something positive but non-commital. Don&#39;t jump to the conclusion its something she&#39;s going to want the next day - or even the next moment. <br/>\n<br/>\nIf its something she&#39;s yearning for, that&#39;s another matter!<br/>\n<br/>\nIf she wants to take classes or join clubs, then do that, but as Joyce mentioned, don&#39;t jump right away to the idea of a class as a way to do something. That does seem like an area of &quot;stuckness&quot; a place where you need to do more deschooling - maybe you and your daughter, both. In fact, it could be better to actively avoid anything class-like for awhile and learn to think outside the box more - ask for ideas on the list if you&#39;re struggling to come up with those &quot;out of the box&quot; ideas. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":76589361,"authorName":"Angela","from":"&quot;Angela&quot; &lt;argwolff@...&gt;","profile":"argwolff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: public school","postDate":"1318960613","msgId":47571,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo3a2VsNStrbGxvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PFNOVDE0My1XNjI4MEU4NzI5RTE4MDY1QTAzRTNCQ0Y3RTUwQHBoeC5nYmw+"},"prevInTopic":47570,"nextInTopic":47572,"prevInTime":47570,"nextInTime":47572,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"... Is that how often she s asking to bounce in and out of school? You said she d gone back before, but you didn t mention how long ago, how often, how long","messageBody":"<div id=\"ygrps-yiv-1441247404\"><blockquote><span title=\"ireply\">&gt;&gt;she only misses public school once in a while and is it really necessary to put her in and take her out every couple of weeks&lt;&lt;<br/>\n<br/>\n </span></blockquote>Is that how often she&#39;s asking to bounce in and out of school? You said she&#39;d gone back before, but you didn&#39;t mention how long ago, how often, how long she stayed last time. Are there other kids at home?<br/>\n<br/>\nShe&#39;s 9? Depending on her specific personality, etc., and especially if she&#39;s asking to bounce in and out every couple of weeks, maybe sit down with her and help her draw up a pros and cons list or a general goals list (I don&#39;t mean of achievement, but of what she envisions would make her happy) and then maybe she can figure out which setting would appeal to her most and you can switch gears into helping her get the most out of whichever setting that is.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I don&#39;t want her or me living the life we did while in public school. having to get on to your child every morning to get her up, every afternoon to do homework and every night to go to bed, that&#39;s not the kind of life anybody would want their child to grow up in. <br/>\n </span></blockquote>there was to much arguing, crying, stubborness, etc. &lt;&lt;<br/>\n<br/>\nDefinitely read the &quot;school choice&quot; link. It was very helpful to me when my kids decided to go back and &quot;try school&quot; last year after having been home for a year. There were no more battles about any of the things you mentioned (like there had been before we decided to homeschool the first go-round) because it was all my son&#39;s  (now 9) choice to go. He knew it was his choice and he knew he could come home at any point, and that in the meantime, I would help him negotiate the things he had found difficult the first time. I worked with his teacher to tweak some of the assignments -- and especially the homework assignments -- to better match his learning style, and the rest was totally his choice.<br/>\n<br/>\nWith homework, I sat with him to get it done and helped him when he needed it. He groused exactly once about doing it, and I said &quot;You know better than I what the consequence is of not doing your homework, so you can decide which is worse, doing the homework or dealing with Mrs. McCarthy.&quot; He usually chose doing homework because his teacher&#39;s consequence was missing recess, and he liked recess. Same with bedtime and getting up. He knew how much sleep he needed, and he knew he didn&#39;t like to be late to school, so he went to bed without complaint in time to get enough sleep and get up on time. <br/>\n<br/>\nI missed the kids. I missed the kids having lots of time to play together. But if it had been, ultimately, where they were happiest, I would have done what I could do to help them get the most of it.<br/>\n<br/>\nMy son stayed exactly one grading period and decided to come home. He hadn&#39;t missed a single day, he was never late, and he did his homework without complaint, all because he knew it was his choice. He even articulated exactly that when I asked him once (before I knew he would be returning home) why he thought it was going better than it had when he was in first grade.<br/>\n<br/>\nIt was a little harder for my daughter (kindergarten) to decide which she preferred. She asked to come home and then two weeks later said she wanted to go back. She went for three more weeks and then only wanted to go on art days. I told her that if she wanted to go most of the time and only stay home sometimes, we could probably swing that, but that if she only wanted to go one day per week we would get in trouble with the school. She decided to come home and we just worked really hard to get her more of what she liked about school -- time with other little girls her age and art -- and she was thrilled to ditch the worksheets, hours on end of sitting at a table, an no time to just sit and think by herself.<br/>\n<br/>\nIt&#39;s not like the decision to come back home has been made and now we &quot;don&#39;t have to worry about it any more.&quot; At 9, 6, and 4, my kids&#39; needs, wants, and interests are changing all the time and we need to reassess and adjust our routines and activities to keep everybody content.<br/>\n<br/>\n-Angela in NJ</div>","specialLinks":[]},{"userId":500196412,"authorName":"Denise Jordan","from":"Denise Jordan &lt;denisejordan4@...&gt;","profile":"juliadjordan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] public school","postDate":"1318958710","msgId":47572,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDE0My1XNTM0RTczNjYzNzlGRjZGOUM0MjMwOEY3RTUwQHBoeC5nYmw+","inReplyToHeader":"PDJERTgyN0JBRTgyRjQzMjA5MzVBMDlGNUQ0MTJFM0MyQHVscmlrZT4=","referencesHeader":"PDEzMTg5Mjk2ODUuMTgxMzkuWWFob29NYWlsUkNAd2ViODczMTQubWFpbC5pcmQueWFob28uY29tPiA8U05UMTQzLVc2MjgwRTg3MjlFMTgwNjVBMDNFM0JDRjdFNTBAcGh4LmdibD4sPDEzMTg5NDAzMTQuOTk0NjAuWWFob29NYWlsUkNAd2ViODczMTMubWFpbC5pcmQueWFob28uY29tPiA8U05UMTQzLVc1RDFFNEEzNUQ3MDgzRUVDRjJGNjFGN0U1MEBwaHguZ2JsPiw8N0IxNkY0OUNCODg0NDQ2MUE1RkZGMjhEN0FCNkU2QTNAdWxyaWtlPiA8U05UMTQzLVc0MzFGRDBGNEQwRDUyMzFEOEI0NTcyRjdFNTBAcGh4LmdibD4sPDJERTgyN0JBRTgyRjQzMjA5MzVBMDlGNUQ0MTJFM0MyQHVscmlrZT4="},"prevInTopic":47571,"nextInTopic":47574,"prevInTime":47571,"nextInTime":47573,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"Hi Ulrike,  I wasn t meaning to put you in your place but I do understand this comment you made  I did not ask this list for advice, because I knew (better)","messageBody":"<div id=\"ygrps-yiv-918572688\">Hi Ulrike,  I wasn&#39;t meaning to put you in your place but I do understand this comment you made &quot; I did not ask this list for advice, because I knew (better) already!<br/>\n I am learning as some are helping you see things different some make you feel as though you aren&#39;t doing your job as a parent, if that is the correct words.  Advice is good but you can&#39;t base every child on another.   I have issues with my daughter that others may not have but that&#39;s neither here nor there.  I do appreciate the advice because I am confused myself.</div>","specialLinks":[]},{"userId":500196412,"authorName":"Denise Jordan","from":"Denise Jordan &lt;denisejordan4@...&gt;","profile":"juliadjordan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] public school","postDate":"1318957824","msgId":47570,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDE0My1XMTc5QkRFNTIxMzA1NTg1OTlERENEN0Y3RTUwQHBoeC5nYmw+","inReplyToHeader":"PDEzMTg5NTYzMjguNTI3MTAuWWFob29NYWlsUkNAd2ViODczMDYubWFpbC5pcmQueWFob28uY29tPg==","referencesHeader":"PDEzMTg5Mjk2ODUuMTgxMzkuWWFob29NYWlsUkNAd2ViODczMTQubWFpbC5pcmQueWFob28uY29tPiw8U05UMTQzLVc2MjgwRTg3MjlFMTgwNjVBMDNFM0JDRjdFNTBAcGh4LmdibD4sLDwxMzE4OTQwMzE0Ljk5NDYwLllhaG9vTWFpbFJDQHdlYjg3MzEzLm1haWwuaXJkLnlhaG9vLmNvbT4sPFNOVDE0My1XNUQxRTRBMzVENzA4M0VFQ0YyRjYxRjdFNTBAcGh4LmdibD4sPDkzMDA0Rjc3LTc0OUQtNEExOC05NkUxLTZCRDEwQzI2RjkwREB2ZXJpem9uLm5ldD4gPFNOVDE0My1XMjk2M0M5MDNENERBQTQwNTc1MDc0QUY3RTUwQHBoeC5nYmw+LDwxMzE4OTU2MzI4LjUyNzEwLllhaG9vTWFpbFJDQHdlYjg3MzA2Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":47569,"nextInTopic":47571,"prevInTime":47569,"nextInTime":47571,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"thank you Schuyler.  I do notice its when she is bored but then she s on to something else.  Just want to make the right decisions.","messageBody":"<div id=\"ygrps-yiv-417550914\">thank you Schuyler.  I do notice its when she is bored but then she&#39;s on to something else.  Just want to make the right decisions.</div>","specialLinks":[]},{"userId":46477013,"authorName":"Ulrike Haupt","from":"&quot;Ulrike Haupt&quot; &lt;rica@...&gt;","profile":"ulrikehaupt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] public school","postDate":"1318957537","msgId":47569,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJERTgyN0JBRTgyRjQzMjA5MzVBMDlGNUQ0MTJFM0MyQHVscmlrZT4=","inReplyToHeader":"PFNOVDE0My1XNDMxRkQwRjREMEQ1MjMxRDhCNDU3MkY3RTUwQHBoeC5nYmw+","referencesHeader":"PDEzMTg5Mjk2ODUuMTgxMzkuWWFob29NYWlsUkNAd2ViODczMTQubWFpbC5pcmQueWFob28uY29tPiA8U05UMTQzLVc2MjgwRTg3MjlFMTgwNjVBMDNFM0JDRjdFNTBAcGh4LmdibD4sPDEzMTg5NDAzMTQuOTk0NjAuWWFob29NYWlsUkNAd2ViODczMTMubWFpbC5pcmQueWFob28uY29tPiA8U05UMTQzLVc1RDFFNEEzNUQ3MDgzRUVDRjJGNjFGN0U1MEBwaHguZ2JsPiw8N0IxNkY0OUNCODg0NDQ2MUE1RkZGMjhEN0FCNkU2QTNAdWxyaWtlPiA8U05UMTQzLVc0MzFGRDBGNEQwRDUyMzFEOEI0NTcyRjdFNTBAcGh4LmdibD4="},"prevInTopic":47568,"nextInTopic":47570,"prevInTime":47568,"nextInTime":47570,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"Hi Denise I read your reply and I am feeling a little bit put in my place . As I was contemplating my response, of which I am not sure that I should post it,","messageBody":"<div id=\"ygrps-yiv-1749037376\">Hi Denise<br/>\nI read your reply and I am feeling a little bit &#39;put in my place&#39;.<br/>\n<br/>\nAs I was contemplating my response, of which I am not sure that I should post it, but I&#39;ll<br/>\ndo it anyway, I asked what it is that you are really asking for?<br/>\n<br/>\nI also remember a sentence where you say, paraphrased, jumpig in and out of school every<br/>\ncouple of weeks. <br/>\n<br/>\nIs it that this is not really about your daughter who is doing fine even with some<br/>\nboulders along the way but about your good intentions about her?<br/>\nIf that is the case than I am off the bandwaggon this very moment because I do not intend<br/>\nto rattle anyone&#39;s good intentions. I got my fingers burnt on that just this afternoon by<br/>\nmy husband. &lt;grin&gt; Well, I have good intentions and he was so friendly as to give me flak.<br/>\n<br/>\nIf you truly think that you know that it is not good for your daughter to hop in andout of<br/>\nschool or classs or whatever then you are right. You know your daughter better than we do.<br/>\n<br/>\nI did not even contemplate sending my youngest son back t school for a day after I<br/>\nrealized what it did to him for the short while that he was indeed attending. Even when he<br/>\nmentioned about five years later that he thought it would be better for him to go back.<br/>\n<br/>\nI just &#39;knew&#39; that he would suffer as bad as before and that it would take even longer for<br/>\nhim to become his healthy self again even after a short term at public (or private)<br/>\nschool. But I did not ask this list for advice, because I knew (better) already!<br/>\n<br/>\nLearning whatever he learned out ofschool did not come that easy to my son all the time.<br/>\nBut that is not the issue. His emotional health away from the school environment, even if<br/>\nit contained his only friend, is more important that his nightmares, sleep issues,<br/>\naccidents, colds, stomach upsets and other things that are related to his schooling<br/>\nexperience.<br/>\n<br/>\nThough, I know that there are children who are ok or even thrive.<br/>\n<br/>\nOthers have commented enough,too.<br/>\n<br/>\nI really did not want to tell you how or what. My post was about decision making<br/>\nauthority.<br/>\n<br/>\nUlrike<br/>\n <br/>\n<br/>\n__________ Information from ESET NOD32 Antivirus, version of virus signature database 6553<br/>\n(20111018) __________<br/>\n<br/>\nThe message was checked by ESET NOD32 Antivirus.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.eset.com\">http://www.eset.com</a></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"1"},"subject":"Re: [unschoolingbasics] public school","postDate":"1318957049","msgId":47626,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTg5NTcwNDkuNDI0MTMuWWFob29NYWlsUkNAd2ViODczMTYubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PDEzMTg5NTYzMjguNTI3MTAuWWFob29NYWlsUkNAd2ViODczMDYubWFpbC5pcmQueWFob28uY29tPg==","referencesHeader":"PDEzMTg5Mjk2ODUuMTgxMzkuWWFob29NYWlsUkNAd2ViODczMTQubWFpbC5pcmQueWFob28uY29tPiw8U05UMTQzLVc2MjgwRTg3MjlFMTgwNjVBMDNFM0JDRjdFNTBAcGh4LmdibD4sLDwxMzE4OTQwMzE0Ljk5NDYwLllhaG9vTWFpbFJDQHdlYjg3MzEzLm1haWwuaXJkLnlhaG9vLmNvbT4sPFNOVDE0My1XNUQxRTRBMzVENzA4M0VFQ0YyRjYxRjdFNTBAcGh4LmdibD4sPDkzMDA0Rjc3LTc0OUQtNEExOC05NkUxLTZCRDEwQzI2RjkwREB2ZXJpem9uLm5ldD4gPFNOVDE0My1XMjk2M0M5MDNENERBQTQwNTc1MDc0QUY3RTUwQHBoeC5nYmw+IDwxMzE4OTU2MzI4LjUyNzEwLllhaG9vTWFpbFJDQHdlYjg3MzA2Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":47625,"nextInTopic":0,"prevInTime":47625,"nextInTime":47627,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"I would also add that she may feel like she s being asked to own her education in a way that she doesn t feel capable of doing. I have no way of knowing. But ","messageBody":"<div id=\"ygrps-yiv-1022367577\">I would also add that she may feel like she&#39;s being asked to own her education <br/>\nin a way that she doesn&#39;t feel capable of doing. I have no way of knowing. But <br/>\nshe may see the burden of becoming a fully functioning adult as resting on her 9 <br/>\nyear old shoulders in a way that makes her feel as though playing at home isn&#39;t <br/>\npreparing for it as well as going to school would do. School has done a fabulous <br/>\njob of convincing folks that it is fit to purpose. Among those folks are the <br/>\nchildren attending. She may not be seeing how what she is doing now, whatever <br/>\nshe wants, whenever she wants (99% of the time--which is phenomenal, there is no <br/>\nway that we achieve that level of response to Simon and Linnaea), is going to <br/>\nget her to the goal that seemed to be so very important when she was at school. <br/>\nSo important that you were, even if for a short time, putting her through what <br/>\nyou described as this: &quot;having to get on to your child every morning to get her <br/>\nup, every  afternoon to do homework and every night to go to bed, that&#39;s not the  <br/>\nkind of life anybody would want their child to grow up in.  there was to  much <br/>\narguing, crying, stubborness, etc.  I for one don&#39;t want my  child&#39;s childhood <br/>\nto be about getting angry and crying everyday.&quot;  It is hard to have that be a <br/>\npart of what is so important, I imagine, and to have it be completely taken away <br/>\nwithout a similar system being put in place. Maybe she doesn&#39;t know why it isn&#39;t <br/>\nthe system that you are using anymore. Maybe she doesn&#39;t believe that it can&#39;t <br/>\nbe important. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Schuyler &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Tuesday, 18 October, 2011 17:45:28<br/>\nSubject: Re: [unschoolingbasics] public school<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;is she just trying me to see how I will react?&lt;&lt;<br/>\n<br/>\n </span></blockquote>I really doubt it. My guess is that she doesn&#39;t know what to do. My guess is <br/>\nthat she is struggling to figure out what to do with herself. School frames so <br/>\nmuch of someone&#39;s time, so much of someone&#39;s thinking that it must feel like a <br/>\ngiant vacuum of space and time when it is gone. When she talks about going back <br/>\nto school the most is she tired? Is she hungry? Is she bored? Can you see a <br/>\npattern in her moments of thinking that something else would be better than what <br/>\n<br/>\nis? If you can&#39;t in this moment can you begin to look for one? If there is a <br/>\npattern, try and deal with that. Not in an obvious and overhanded way, but in a <br/>\ngentle and caring way. Offer her food when she&#39;s hungry; change the mood, the <br/>\nactivity when she&#39;s bored; cuddle up and watch a movie, do a slower, quieter <br/>\nthing when she&#39;s tired. See if those acts move her away from a buzzy unhappiness <br/>\n<br/>\nwith her right now moments. See if taking care of those more basic needs help <br/>\nher to enjoy her life without school more. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] public school","postDate":"1318956328","msgId":47568,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTg5NTYzMjguNTI3MTAuWWFob29NYWlsUkNAd2ViODczMDYubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PFNOVDE0My1XMjk2M0M5MDNENERBQTQwNTc1MDc0QUY3RTUwQHBoeC5nYmw+","referencesHeader":"PDEzMTg5Mjk2ODUuMTgxMzkuWWFob29NYWlsUkNAd2ViODczMTQubWFpbC5pcmQueWFob28uY29tPiw8U05UMTQzLVc2MjgwRTg3MjlFMTgwNjVBMDNFM0JDRjdFNTBAcGh4LmdibD4sLDwxMzE4OTQwMzE0Ljk5NDYwLllhaG9vTWFpbFJDQHdlYjg3MzEzLm1haWwuaXJkLnlhaG9vLmNvbT4sPFNOVDE0My1XNUQxRTRBMzVENzA4M0VFQ0YyRjYxRjdFNTBAcGh4LmdibD4sPDkzMDA0Rjc3LTc0OUQtNEExOC05NkUxLTZCRDEwQzI2RjkwREB2ZXJpem9uLm5ldD4gPFNOVDE0My1XMjk2M0M5MDNENERBQTQwNTc1MDc0QUY3RTUwQHBoeC5nYmw+"},"prevInTopic":47567,"nextInTopic":47569,"prevInTime":47567,"nextInTime":47569,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"... I really doubt it. My guess is that she doesn t know what to do. My guess is that she is struggling to figure out what to do with herself. School frames so","messageBody":"<div id=\"ygrps-yiv-1483929194\"><blockquote><span title=\"ireply\">&gt;&gt;is she just trying me to see how I will react?&lt;&lt;<br/>\n<br/>\n </span></blockquote>I really doubt it. My guess is that she doesn&#39;t know what to do. My guess is <br/>\nthat she is struggling to figure out what to do with herself. School frames so <br/>\nmuch of someone&#39;s time, so much of someone&#39;s thinking that it must feel like a <br/>\ngiant vacuum of space and time when it is gone. When she talks about going back <br/>\nto school the most is she tired? Is she hungry? Is she bored? Can you see a <br/>\npattern in her moments of thinking that something else would be better than what <br/>\nis? If you can&#39;t in this moment can you begin to look for one? If there is a <br/>\npattern, try and deal with that. Not in an obvious and overhanded way, but in a <br/>\ngentle and caring way. Offer her food when she&#39;s hungry; change the mood, the <br/>\nactivity when she&#39;s bored; cuddle up and watch a movie, do a slower, quieter <br/>\nthing when she&#39;s tired. See if those acts move her away from a buzzy unhappiness <br/>\nwith her right now moments. See if taking care of those more basic needs help <br/>\nher to enjoy her life without school more. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] public school","postDate":"1318955326","msgId":47625,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyMDdBM0ZGLTlBQkMtNDgxOS05MjE4LTg0OUU5MEM1RkQ5OEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PFNOVDE0My1XMjk2M0M5MDNENERBQTQwNTc1MDc0QUY3RTUwQHBoeC5nYmw+","referencesHeader":"PDEzMTg5Mjk2ODUuMTgxMzkuWWFob29NYWlsUkNAd2ViODczMTQubWFpbC5pcmQueWFob28uY29tPiwgPFNOVDE0My1XNjI4MEU4NzI5RTE4MDY1QTAzRTNCQ0Y3RTUwQHBoeC5nYmw+LCwgPDEzMTg5NDAzMTQuOTk0NjAuWWFob29NYWlsUkNAd2ViODczMTMubWFpbC5pcmQueWFob28uY29tPiwgPFNOVDE0My1XNUQxRTRBMzVENzA4M0VFQ0YyRjYxRjdFNTBAcGh4LmdibD4sIDw5MzAwNEY3Ny03NDlELTRBMTgtOTZFMS02QkQxMEMyNkY5MERAdmVyaXpvbi5uZXQ+IDxTTlQxNDMtVzI5NjNDOTAzRDREQUE0MDU3NTA3NEFGN0U1MEBwaHguZ2JsPg=="},"prevInTopic":47578,"nextInTopic":47626,"prevInTime":47624,"nextInTime":47626,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"I just realized you ve only been doing this for a very few weeks. You re all still getting your sea legs. Rather than trying to fix the problem focus on her","messageBody":"<div id=\"ygrps-yiv-390483045\">I just realized you&#39;ve only been doing this for a very few weeks.  <br/>\nYou&#39;re all still getting your sea legs.<br/>\n<br/>\nRather than trying to fix the problem focus on her comfort and  <br/>\ncreating a comfortable nest. She&#39;s still deschooling. As are you. It&#39;s  <br/>\nexpected that she will be missing the good parts of school.<br/>\n<br/>\nIf someone has a broken leg, it&#39;s not something you can fix. But you  <br/>\ncan do whatever you can to make them and their environment as cozy for  <br/>\nrecover as possible. That doesn&#39;t make the itchiness and pain go away.  <br/>\nBut it makes it more comfortable to live with it.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":500196412,"authorName":"Denise Jordan","from":"Denise Jordan &lt;denisejordan4@...&gt;","profile":"juliadjordan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] public school","postDate":"1318954596","msgId":47567,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDE0My1XNDMxRkQwRjREMEQ1MjMxRDhCNDU3MkY3RTUwQHBoeC5nYmw+","inReplyToHeader":"PDdCMTZGNDlDQjg4NDQ0NjFBNUZGRjI4RDdBQjZFNkEzQHVscmlrZT4=","referencesHeader":"PDEzMTg5Mjk2ODUuMTgxMzkuWWFob29NYWlsUkNAd2ViODczMTQubWFpbC5pcmQueWFob28uY29tPiA8U05UMTQzLVc2MjgwRTg3MjlFMTgwNjVBMDNFM0JDRjdFNTBAcGh4LmdibD4sPDEzMTg5NDAzMTQuOTk0NjAuWWFob29NYWlsUkNAd2ViODczMTMubWFpbC5pcmQueWFob28uY29tPiA8U05UMTQzLVc1RDFFNEEzNUQ3MDgzRUVDRjJGNjFGN0U1MEBwaHguZ2JsPiw8N0IxNkY0OUNCODg0NDQ2MUE1RkZGMjhEN0FCNkU2QTNAdWxyaWtlPg=="},"prevInTopic":47566,"nextInTopic":47568,"prevInTime":47566,"nextInTime":47568,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"Can you give her space to do nothing and more nothing and even more nothing? And don’t jump through hoops when she mentions that it might be nice to do X and","messageBody":"<div id=\"ygrps-yiv-1621799112\">Can you give<br/>\nher space to do nothing and more nothing and even more nothing? And don�t jump through<br/>\nhoops when she mentions that it might be nice to do X and provide the full spectrum of<br/>\nbecoming a master at X immeditely. Finding a way to do things your own way has so much<br/>\npotential for joy and achievement. Just because someone likes to draw does not mean that<br/>\nthey need structured art classes.<br/>\n<br/>\nShe has the space to do nothing.  she does what she&#39;s wants all day long.  she wants to take an art class.  Im not asking her or even wanting her to become a master at anything.  she does do things her own way.  I learned along time ago she has a different thought process than me or many other kids I know.    she is free to be who she is.  I do not limit that.<br/>\n <br/>\n<br/>\n<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rica@...\">rica@...</a><br/>\nDate: Tue, 18 Oct 2011 17:53:47 +0200<br/>\nSubject: RE: [unschoolingbasics] public school<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\nHi Denise<br/>\n<br/>\nOne sentencejumped out at me<br/>\n<br/>\n�She has a hard time making up her mind in doing anything. �<br/>\n<br/>\nTo me this sounds still so much of a person who is either not fully within their own<br/>\nauthority to come to their own conclusions and decisions � i.e. she may feel under<br/>\npressure to perform OR she just has her own way of coming to decisions and conclusions<br/>\nwhich does not necessarily conform to your style and time line.<br/>\n<br/>\nI for instance am a �snap decision maker� and I know of at least ten people around me who<br/>\nshould never make spontaneous decisions but sleep and maybe really sleep (like days to<br/>\nweeks) on anything a lot before they know what is right for them at the time.<br/>\n<br/>\nFor these people the opportunity does not go away until they come to their conclusion. <br/>\n<br/>\nFor me it is another matter. But I know enough about this process already to give others a<br/>\nlot of free space (time) when it comes to deciding what it is �they� really, really want<br/>\nfor themselves.<br/>\n<br/>\nI have one granddaughter (4 �) who is another snap decider. I can so relate to her. But<br/>\narranging our home front around her decisions, when all the others are still making up<br/>\ntheir minds induces a lot of drama on a daily basis. (She has already �shopped� the ice<br/>\ncream while the others still wonder if a pizza or a home cooked would be an option.) If<br/>\nyou are a snap decider and your daughter is not you might put a lot of pressure on her �<br/>\nunintended of course. &lt;grin&gt; I know that I do and I see it with Ariella every day.<br/>\n<br/>\nOr, the other idea is that she still needs decompression from �having to do�. Can you give<br/>\nher space to do nothing and more nothing and even more nothing? And don�t jump through<br/>\nhoops when she mentions that it might be nice to do X and provide the full spectrum of<br/>\nbecoming a master at X immeditely. Finding a way to do things your own way has so much<br/>\npotential for joy and achievement. Just because someone likes to draw does not mean that<br/>\nthey need structured art classes.<br/>\n<br/>\nBlissings<br/>\n<br/>\nUlrike<br/>\n<br/>\nfrom Namibia � somewhere in Africa � where I did take off early from work today � two<br/>\nhours! To do a little personal decompression. It was a snap decision, though.<br/>\n<br/>\nPS � Please forgive me if I misunderstood you. I do tend to read things into words that<br/>\nwere not intended.<br/>\n<br/>\n__________ Information from ESET NOD32 Antivirus, version of virus signature database 6553<br/>\n(20111018) __________<br/>\n<br/>\nThe message was checked by ESET NOD32 Antivirus.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.eset.com\">http://www.eset.com</a><br/>\n<br/>\n__________ Information from ESET NOD32 Antivirus, version of virus signature database 6553<br/>\n(20111018) __________<br/>\n<br/>\nThe message was checked by ESET NOD32 Antivirus.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.eset.com\">http://www.eset.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n \t\t \t   \t\t  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":500196412,"authorName":"Denise Jordan","from":"Denise Jordan &lt;denisejordan4@...&gt;","profile":"juliadjordan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] public school","postDate":"1318954346","msgId":47566,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDE0My1XMjk2M0M5MDNENERBQTQwNTc1MDc0QUY3RTUwQHBoeC5nYmw+","inReplyToHeader":"PDkzMDA0Rjc3LTc0OUQtNEExOC05NkUxLTZCRDEwQzI2RjkwREB2ZXJpem9uLm5ldD4=","referencesHeader":"PDEzMTg5Mjk2ODUuMTgxMzkuWWFob29NYWlsUkNAd2ViODczMTQubWFpbC5pcmQueWFob28uY29tPiw8U05UMTQzLVc2MjgwRTg3MjlFMTgwNjVBMDNFM0JDRjdFNTBAcGh4LmdibD4sLDwxMzE4OTQwMzE0Ljk5NDYwLllhaG9vTWFpbFJDQHdlYjg3MzEzLm1haWwuaXJkLnlhaG9vLmNvbT4sPFNOVDE0My1XNUQxRTRBMzVENzA4M0VFQ0YyRjYxRjdFNTBAcGh4LmdibD4sPDkzMDA0Rjc3LTc0OUQtNEExOC05NkUxLTZCRDEwQzI2RjkwREB2ZXJpem9uLm5ldD4="},"prevInTopic":47565,"nextInTopic":47567,"prevInTime":47565,"nextInTime":47567,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":" Be* with your daughter. Do fun things together. Find other kids for her to do fun things with. I am with my daughter and we do fun things.  She has kids to","messageBody":"<div id=\"ygrps-yiv-1800794104\">&quot; Be* with your daughter. Do fun things together. Find other kids for <br/>\nher to do fun things with.&quot;<br/>\n<br/>\n <br/>\nI am with my daughter and we do fun things.  She has kids to play with all the time.  We do what the kids want when they want 99% of the time.  we can&#39;t always do, go and be everywhere all the time.  My daughter has all the art supplies she wants here at home and we find things to draw.  Im not artistic but i do draw pics with her and we figure out what looks best etc.  I feel like I am doing all the right things so i get confused when she does say she wants to go back to school.  is she just trying me to see how I will react?  I ask her what she misses about school but when we try and do the things here she says she misses she doesnt&#39; want to do them.  that&#39;s where i don&#39;t know what to do.<br/>\n<br/>\n<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a><br/>\nDate: Tue, 18 Oct 2011 11:39:14 -0400<br/>\nSubject: Re: [unschoolingbasics] public school<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Oct 18, 2011, at 11:25 AM, Denise Jordan wrote:<br/>\n<br/>\n&gt; I have tried other options.<br/>\n<br/>\nSo, what does that mean? Are there just two choices? School and &quot;other <br/>\noptions&quot;?<br/>\n<br/>\nSchool is one option. &quot;Other options&quot; are thousands of things plus <br/>\nvariations on those thousands of things.<br/>\n<br/>\nI know you&#39;re getting frustrated.<br/>\n<br/>\nIt&#39;s easy to say no. It&#39;s really hard to see life from new points of <br/>\nview so that the problem looks different. And that&#39;s what unschooling <br/>\ncalls for.<br/>\n<br/>\nWe can&#39;t hand you the answer. We can *show* you new points of view. We <br/>\ncan *show* you what putting those new points of view into practice can <br/>\nlook like in other families. It&#39;s up to you to shift your view. It&#39;s <br/>\nup to you to play with those ideas, let them spark other ideas. See <br/>\nthe ideas in new ways.<br/>\n<br/>\nRight now you&#39;re stuck in your vision of what life needs to be. It <br/>\nmight help to back away from the problem, let life play out, let ideas <br/>\nswirl.<br/>\n<br/>\n*Be* with your daughter. Do fun things together. Find other kids for <br/>\nher to do fun things with. Yes, it&#39;s hard. But neither the hardness <br/>\nnor your inability so far to find ways to meet her needs make her less <br/>\nneedful. You can&#39;t change her. You can only change yourself.<br/>\n<br/>\n&gt; I didn&#39;t sign her up for the class without getting her opinion on it.<br/>\n<br/>\nWhy wouldn&#39;t she think of class as the way to explore art? That&#39;s the <br/>\nway art is for kids as far as she knows. It&#39;s up to you to show her <br/>\nthe wide open possibilities.<br/>\n<br/>\nWhat are her favorite things in art class?<br/>\n<br/>\n&gt; She has a hard time making up her mind in doing anything. I <br/>\n&gt; appreciate all the links and ideas but what works for one doesn&#39;t <br/>\n&gt; work for all.<br/>\n<br/>\nThe primary purpose of the list is to help people turn their thinking <br/>\naround. To look at their child rather than out at the world.<br/>\n<br/>\nThe ideas offered are what turned around thinking can be like for <br/>\nother unschoolers. They&#39;re not intended as &quot;plug and play&quot; ideas. <br/>\n(Though it&#39;s convenient when an idea can be that.) They&#39;re <br/>\nspringboards to get you thinking in new ways.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n \t\t \t   \t\t  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":46477013,"authorName":"Ulrike Haupt","from":"&quot;Ulrike Haupt&quot; &lt;rica@...&gt;","profile":"ulrikehaupt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] public school","postDate":"1318953227","msgId":47564,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdCMTZGNDlDQjg4NDQ0NjFBNUZGRjI4RDdBQjZFNkEzQHVscmlrZT4=","inReplyToHeader":"PFNOVDE0My1XNUQxRTRBMzVENzA4M0VFQ0YyRjYxRjdFNTBAcGh4LmdibD4=","referencesHeader":"PDEzMTg5Mjk2ODUuMTgxMzkuWWFob29NYWlsUkNAd2ViODczMTQubWFpbC5pcmQueWFob28uY29tPiA8U05UMTQzLVc2MjgwRTg3MjlFMTgwNjVBMDNFM0JDRjdFNTBAcGh4LmdibD4sPDEzMTg5NDAzMTQuOTk0NjAuWWFob29NYWlsUkNAd2ViODczMTMubWFpbC5pcmQueWFob28uY29tPiA8U05UMTQzLVc1RDFFNEEzNUQ3MDgzRUVDRjJGNjFGN0U1MEBwaHguZ2JsPg=="},"prevInTopic":47563,"nextInTopic":47565,"prevInTime":47563,"nextInTime":47565,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"Hi Denise One sentencejumped out at me “She has a hard time making up her mind in doing anything. “ To me this sounds still so much of a person who is","messageBody":"<div id=\"ygrps-yiv-678211425\">Hi Denise<br/>\n<br/>\nOne sentencejumped out at me<br/>\n<br/>\nShe has a hard time making up her mind in doing anything. <br/>\n<br/>\nTo me this sounds still so much of a person who is either not fully within their own<br/>\nauthority to come to their own conclusions and decisions  i.e. she may feel under<br/>\npressure to perform OR she just has her own way of coming to decisions and conclusions<br/>\nwhich does not necessarily conform to your style and time line.<br/>\n<br/>\nI for instance am a snap decision maker and I know of at least ten people around me who<br/>\nshould never make spontaneous decisions but sleep and maybe really sleep (like days to<br/>\nweeks) on anything a lot before they know what is right for them at the time.<br/>\n<br/>\nFor these people the opportunity does not go away until they come to their conclusion. <br/>\n<br/>\nFor me it is another matter. But I know enough about this process already to give others a<br/>\nlot of free space (time) when it comes to deciding what it is they really, really want<br/>\nfor themselves.<br/>\n<br/>\nI have one granddaughter (4 ½) who is another snap decider. I can so relate to her. But<br/>\narranging our home front around her decisions, when all the others are still making up<br/>\ntheir minds induces a lot of drama on a daily basis. (She has already shopped the ice<br/>\ncream while the others still wonder if a pizza or a home cooked would be an option.) If<br/>\nyou are a snap decider and your daughter is not you might put a lot of pressure on her <br/>\nunintended of course. &lt;grin&gt; I know that I do and I see it with Ariella every day.<br/>\n<br/>\nOr, the other idea is that she still needs decompression from having to do. Can you give<br/>\nher space to do nothing and more nothing and even more nothing? And dont jump through<br/>\nhoops when she mentions that it might be nice to do X and provide the full spectrum of<br/>\nbecoming a master at X immeditely. Finding a way to do things your own way has so much<br/>\npotential for joy and achievement. Just because someone likes to draw does not mean that<br/>\nthey need structured art classes.<br/>\n<br/>\nBlissings<br/>\n<br/>\nUlrike<br/>\n<br/>\nfrom Namibia  somewhere in Africa  where I did take off early from work today  two<br/>\nhours! To do a little personal decompression. It was a snap decision, though.<br/>\n<br/>\nPS  Please forgive me if I misunderstood you. I do tend to read things into words that<br/>\nwere not intended.<br/>\n<br/>\n<br/>\n__________ Information from ESET NOD32 Antivirus, version of virus signature database 6553<br/>\n(20111018) __________<br/>\n<br/>\n<br/>\nThe message was checked by ESET NOD32 Antivirus.<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.eset.com\">http://www.eset.com</a><br/>\n<br/>\n <br/>\n<br/>\n__________ Information from ESET NOD32 Antivirus, version of virus signature database 6553<br/>\n(20111018) __________<br/>\n<br/>\nThe message was checked by ESET NOD32 Antivirus.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.eset.com\">http://www.eset.com</a><br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] public school","postDate":"1318952354","msgId":47563,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkzMDA0Rjc3LTc0OUQtNEExOC05NkUxLTZCRDEwQzI2RjkwREB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PFNOVDE0My1XNUQxRTRBMzVENzA4M0VFQ0YyRjYxRjdFNTBAcGh4LmdibD4=","referencesHeader":"PDEzMTg5Mjk2ODUuMTgxMzkuWWFob29NYWlsUkNAd2ViODczMTQubWFpbC5pcmQueWFob28uY29tPiA8U05UMTQzLVc2MjgwRTg3MjlFMTgwNjVBMDNFM0JDRjdFNTBAcGh4LmdibD4sIDwxMzE4OTQwMzE0Ljk5NDYwLllhaG9vTWFpbFJDQHdlYjg3MzEzLm1haWwuaXJkLnlhaG9vLmNvbT4gPFNOVDE0My1XNUQxRTRBMzVENzA4M0VFQ0YyRjYxRjdFNTBAcGh4LmdibD4="},"prevInTopic":47562,"nextInTopic":47564,"prevInTime":47562,"nextInTime":47564,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"... So, what does that mean? Are there just two choices? School and other options ? School is one option. Other options are thousands of things plus ","messageBody":"<div id=\"ygrps-yiv-910465203\">On Oct 18, 2011, at 11:25 AM, Denise Jordan wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have tried other options.<br/>\n<br/>\n </span></blockquote>So, what does that mean? Are there just two choices? School and &quot;other  <br/>\noptions&quot;?<br/>\n<br/>\nSchool is one option. &quot;Other options&quot; are thousands of things plus  <br/>\nvariations on those thousands of things.<br/>\n<br/>\nI know you&#39;re getting frustrated.<br/>\n<br/>\nIt&#39;s easy to say no. It&#39;s really hard to see life from new points of  <br/>\nview so that the problem looks different. And that&#39;s what unschooling  <br/>\ncalls for.<br/>\n<br/>\nWe can&#39;t hand you the answer. We can *show* you new points of view. We  <br/>\ncan *show* you what putting those new points of view into practice can  <br/>\nlook like in other families. It&#39;s up to you to shift your view. It&#39;s  <br/>\nup to you to play with those ideas, let them spark other ideas. See  <br/>\nthe ideas in new ways.<br/>\n<br/>\nRight now you&#39;re stuck in your vision of what life needs to be. It  <br/>\nmight help to back away from the problem, let life play out, let ideas  <br/>\nswirl.<br/>\n<br/>\n*Be* with your daughter. Do fun things together. Find other kids for  <br/>\nher to do fun things with. Yes, it&#39;s hard. But neither the hardness  <br/>\nnor your inability so far to find ways to meet her needs make her less  <br/>\nneedful. You can&#39;t change her. You can only change yourself.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I didn&#39;t sign her up for the class without getting her opinion on it.<br/>\n<br/>\n<br/>\n </span></blockquote>Why wouldn&#39;t she think of class as the way to explore art? That&#39;s the  <br/>\nway art is for kids as far as she knows. It&#39;s up to you to show her  <br/>\nthe wide open possibilities.<br/>\n<br/>\nWhat are her favorite things in art class?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She has a hard time making up her mind in doing anything. I  <br/>\n&gt; appreciate all the links and ideas but what works for one doesn&#39;t  <br/>\n&gt; work for all.<br/>\n<br/>\n<br/>\n </span></blockquote>The primary purpose of the list is to help people turn their thinking  <br/>\naround. To look at their child rather than out at the world.<br/>\n<br/>\nThe ideas offered are what turned around thinking can be like for  <br/>\nother unschoolers. They&#39;re not intended as &quot;plug and play&quot; ideas.  <br/>\n(Though it&#39;s convenient when an idea can be that.) They&#39;re  <br/>\nspringboards to get you thinking in new ways.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":500196412,"authorName":"Denise Jordan","from":"Denise Jordan &lt;denisejordan4@...&gt;","profile":"juliadjordan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Re: public school","postDate":"1318951846","msgId":47565,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDE0My1XMjE5NEY5NTY3ODhBOEQ1ODRDMUQ0NkY3RTUwQHBoeC5nYmw+","inReplyToHeader":"PGo3azF0ZStsMGIyQGVHcm91cHMuY29tPg==","referencesHeader":"PFNOVDE0My1XNjI4MEU4NzI5RTE4MDY1QTAzRTNCQ0Y3RTUwQHBoeC5nYmw+LDxqN2sxdGUrbDBiMkBlR3JvdXBzLmNvbT4="},"prevInTopic":47564,"nextInTopic":47566,"prevInTime":47564,"nextInTime":47566,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"does she really want to go to school or is it just something to say? thank you Nance.  My thoughts exactly. To: unschoolingbasics@yahoogroups.com From:","messageBody":"<div id=\"ygrps-yiv-1009427641\">&quot;does she really want to go to school or is it just something to say?&quot;<br/>\n<br/>\nthank you Nance.  My thoughts exactly.   <br/>\n<br/>\n<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marbleface@...\">marbleface@...</a><br/>\nDate: Tue, 18 Oct 2011 14:19:26 +0000<br/>\nSubject: [unschoolingbasics] Re: public school<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\nHmmm. . . does she really want to go to school or is it just something to say? How rural are you? Are there any other organized activities that might appeal to your 9-yo daughter and her friends? Girl Scouts or volunteering or 4H or something they could do together outside of school? <br/>\n<br/>\nJust spitballing. . .<br/>\n<br/>\nNance<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I know my daughter well. To her school is being in a room with her 2 best friends. She hasn&#39;t always gottten the same teacher as her freinds so she doesn&#39;t see them at school any more than she does now. She isn&#39;t unhappy at home but Im sure she would like to be around kids more during the week. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n \t\t \t   \t\t  <br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] public school","postDate":"1318951540","msgId":47560,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERGNDQwQjE0LUI3NDYtNDI3MS04QTBDLUZFNTEyNkVBMDAzM0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PFNOVDE0My1XNjI4MEU4NzI5RTE4MDY1QTAzRTNCQ0Y3RTUwQHBoeC5nYmw+","referencesHeader":"PDEzMTg5Mjk2ODUuMTgxMzkuWWFob29NYWlsUkNAd2ViODczMTQubWFpbC5pcmQueWFob28uY29tPiA8U05UMTQzLVc2MjgwRTg3MjlFMTgwNjVBMDNFM0JDRjdFNTBAcGh4LmdibD4="},"prevInTopic":47556,"nextInTopic":47562,"prevInTime":47559,"nextInTime":47561,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"... No but we can read the words, phrases and ideas you re choosing to share and give you feedback on the picture the words are painting. People s phrasing","messageBody":"<div id=\"ygrps-yiv-645284181\">On Oct 18, 2011, at 7:15 AM, Denise Jordan wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but not completely knowing how things are with ones child you can&#39;t  <br/>\n&gt; really say Im hindering her.<br/>\n<br/>\n </span></blockquote>No but we can read the words, phrases and ideas you&#39;re choosing to  <br/>\nshare and give you feedback on the picture the words are painting.<br/>\n<br/>\nPeople&#39;s phrasing reveals more than they realize, sometimes more than  <br/>\nwhat they&#39;re able to see themselves.<br/>\n<br/>\nNo one here can tell you what&#39;s going on in your house, but people can  <br/>\nsee things in how you&#39;re choosing to paint the picture that ring alarm  <br/>\nbells and then point them out.<br/>\n<br/>\nWhen you said she likes art in school the only thing you mentioned --  <br/>\nsuggesting that in your mind that was the best of your responses to  <br/>\nher need -- you said you signed her up for a class.<br/>\n<br/>\nA class is one of thousands of ways to explore art. It shouldn&#39;t be  <br/>\nthe first thing to think of when unschooling. (Nor should it be the  <br/>\nlast. It will depend on the child.) But especially if you&#39;re  <br/>\nstruggling with a daughter wanting to jump in and out of school, right  <br/>\nnow look for the *other* opportunities that abound in life to explore  <br/>\nart so she isn&#39;t thinking the very very best way to explore art is in  <br/>\na classroom from a teacher. Let her experience what she *can&#39;t* get in  <br/>\nschool.<br/>\n<br/>\nFind out what it is your daughter likes about school and provide more  <br/>\nof that. If it&#39;s friends, find ways for her to connect with other  <br/>\nkids*.  Invite some over. Invite several on an outing to collect  <br/>\nleave, take a walk, go through a corn maze, pick out and carve  <br/>\npumpkins. (Loads of things to do in the fall!) Invite them over for an  <br/>\nactivity. Invite them over just to play :-)<br/>\n<br/>\n*(A class *could* be a way to connect with other kids but especially  <br/>\nwith your daughter *right now* I&#39;d think of other ways. My daughter  <br/>\nfound it hard to connect with other kids in a class. Though she did  <br/>\nenjoy being in a room full of people who enjoyed art. In fact she  <br/>\nenjoyed adult art and writing get togethers just as much or more as  <br/>\nkid classes.)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":500196412,"authorName":"Denise Jordan","from":"Denise Jordan &lt;denisejordan4@...&gt;","profile":"juliadjordan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] public school","postDate":"1318951518","msgId":47562,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDE0My1XNUQxRTRBMzVENzA4M0VFQ0YyRjYxRjdFNTBAcGh4LmdibD4=","inReplyToHeader":"PDEzMTg5NDAzMTQuOTk0NjAuWWFob29NYWlsUkNAd2ViODczMTMubWFpbC5pcmQueWFob28uY29tPg==","referencesHeader":"PDEzMTg5Mjk2ODUuMTgxMzkuWWFob29NYWlsUkNAd2ViODczMTQubWFpbC5pcmQueWFob28uY29tPiA8U05UMTQzLVc2MjgwRTg3MjlFMTgwNjVBMDNFM0JDRjdFNTBAcGh4LmdibD4sPDEzMTg5NDAzMTQuOTk0NjAuWWFob29NYWlsUkNAd2ViODczMTMubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":47560,"nextInTopic":47563,"prevInTime":47561,"nextInTime":47563,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"There is usually more than one way to deal with a situation. It may help you to see more options. I have tried other options. again this goes back to until","messageBody":"<div id=\"ygrps-yiv-1019780723\">&quot;There is <br/>\nusually more than one way to deal with a situation. It may help you to see more <br/>\noptions.&quot; <br/>\n<br/>\nI have tried other options. again this goes back to until you live in a situation and are dealing with the child in question you just don&#39;t have any idea.  We do go out and look at sunsets, starts, moon, flowers, etc.  Will she watch a show on art, no.  Nothing wrong with her going to an art class if that is what she wants to do.  I didn&#39;t sign her up for the class without getting her opinion on it.  She has a hard time making up her mind in doing anything.  I appreciate all the links and ideas but what works for one doesn&#39;t work for all.<br/>\n <br/>\n<br/>\n<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a><br/>\nDate: Tue, 18 Oct 2011 13:18:34 +0100<br/>\nSubject: Re: [unschoolingbasics] public school<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\nI linked a couple of things in my post. Given your response &quot; having to get on <br/>\nto your child every morning to get her up, every afternoon to do homework and <br/>\nevery night to go to bed, that&#39;s not the kind of life anybody would want their <br/>\nchild to grow up in. there was to much arguing, crying, stubborness, etc.&quot; I&#39;m <br/>\nguessing that you didn&#39;t read this one: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/schoolchoice\">http://sandradodd.com/schoolchoice</a> which <br/>\ntalks about letting a child experience school on their own terms. There is <br/>\nusually more than one way to deal with a situation. It may help you to see more <br/>\noptions. <br/>\n<br/>\nIf your daughter is flipping back and forth as frequently as you say she is than <br/>\nshe isn&#39;t really finding a happy life in either place. In that situation I would <br/>\nbe looking for ways of making one or the other better, or look for a third <br/>\nchoice. You say that your rural life is a limiting factor, maybe you need to <br/>\naddress that aspect. We live in a rural location but go into town regularly and <br/>\nhave found local activities to engage with. The UK&#39;s rural is distinctly <br/>\ndifferent from the US, but when I&#39;ve been in the wilds of Nebraska there were <br/>\nfolks to connect with and things to do. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&quot; As far as art, she loves to draw, she is 9. Why would I not let her take an <br/>\n&gt;&gt;art class if that is something she is missing?&quot;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Why would you stop with a class? Why would you start with a class? <br/>\n<br/>\nWhy wouldn&#39;t you start with exploring your local environment for art or using <br/>\nthe amazing resources that are on the internet? Why wouldn&#39;t you look at Georgia <br/>\nO&#39;Keefe&#39;s explorations of the natural world? Annie Dillard&#39;s discussions of the <br/>\nbeauty that is around you? Ansel Addams photography? The fabulous rice field <br/>\nplantings in Japan <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=ztF8xQpjQgA?\">http://www.youtube.com/watch?v=ztF8xQpjQgA?</a> The corn palace <br/>\nin Mitchell South Dakota? Crop circles in the UK <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Crop_circle\">http://en.wikipedia.org/wiki/Crop_circle</a> or this wonderful site: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.circlemakers.org?\">http://www.circlemakers.org?</a> The beauty in a chrysalis or a spider web dotted <br/>\nwith dew? I could go on and on and on. <br/>\n<br/>\nYesterday, looking out the kitchen window, I saw the most amazing pre-storm <br/>\nlight. Because I&#39;ve been using my film camera more lately in the run up to <br/>\nresetting up a darkroom, I&#39;ve been thinking about light. Because I use black and <br/>\nwhite mostly I was interested in the interplay of colour and light in that <br/>\nmoment. David, my husband, shoots primarily colour film and if his camera had <br/>\nbeen loaded I would have taken a picture of the red of the roof tiles against <br/>\nthe dark blue-grey of the storm clouds and the slate of the garage roof and the <br/>\ngreen of the grape vines. It was a boring image in terms of composition, but <br/>\namazing in terms of colour and contrast and light. I didn&#39;t need to be anywhere <br/>\nspecial to see that. The Telegraph has been running a series of photos of <br/>\nBritish autumn pictures: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.telegraph.co.uk/gardening/gardeningpicturegalleries/8827345/Our-third-gallery-of-Telegraph-readers-pictures-of-autumn-colour-in-Britain.html.\">http://www.telegraph.co.uk/gardening/gardeningpicturegalleries/8827345/Our-third-gallery-of-Telegraph-readers-pictures-of-autumn-colour-in-Britain.html.</a><br/>\nThese are small moments of wonder. Look for the wonder that is in your life. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.flickr.com/photos/juliepersons/\">http://www.flickr.com/photos/juliepersons/</a> is Julie Persons&#39; flickr stream. <br/>\nShe&#39;s an unschooling mom who lives a very rural life and finds wonder all around <br/>\nher. <br/>\n<br/>\nStarting with a class is a problem if both of you are still deschooling. <br/>\nStarting with a class means that you don&#39;t really grasp the notion that art <br/>\nisn&#39;t a subject to be studies outside of the rest of living, it is a part of all <br/>\nthe rest of life. It means that you are looking at learning as something that is <br/>\naccomplished best in a setting where one person tells a bunch of other people <br/>\nwhat to explore and when and how and not as something that happens at it&#39;s best <br/>\nwhen the individual is discovering the world in a fully engaged and interested <br/>\nfashion. That doesn&#39;t mean you don&#39;t seek out other people with more knowledge, <br/>\nbut it does mean that you seek them out when you know what it is you want to <br/>\nknow rather then looking to them to tell you what it is you need to learn first <br/>\nand second and third. <br/>\n<br/>\nStarting with a class means that you are telling your daughter that school is <br/>\nhonestly the best way to gain information about the things that you are <br/>\ninterested in. Starting with a class supports a schooling relationship with <br/>\nknowledge. It completely argues that art is a set of skills that need to be <br/>\nobtained in order to accomplish art and that it is best obtained by going to <br/>\nsomeone else to learn them. <a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/What_Is_Art%3F\">http://en.wikipedia.org/wiki/What_Is_Art%3F</a> is an <br/>\nentry on Leo Tolstoy&#39;s essay What Is Art? In his essay he writes &quot;In order <br/>\ncorrectly to define art, it is necessary, first of all, to cease to consider it <br/>\nas a means to pleasure and to consider it as one of the conditions of human <br/>\nlife. Viewing it in this way we cannot fail to observe that art is one of the <br/>\nmeans of intercourse between man and man.&quot; <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.csulb.edu/~jvancamp/361r14.html)\">http://www.csulb.edu/~jvancamp/361r14.html)</a>. I may have to spend some of the <br/>\nnext week reading through the book: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.archive.org/details/whatisart00tolsuoft.\">http://www.archive.org/details/whatisart00tolsuoft.</a> I really like that. I agree <br/>\nwith that. I believe that art is one of the conditions of human life. And <br/>\nbelieving that makes the idea of a general class on art tuition an odd concept <br/>\nto me. I can see seeking out tuition in some skill or another that was needed or <br/>\nin a general approach to something. But I would do that only after I had <br/>\nexplored other avenues, most likely. <br/>\n<br/>\nI&#39;m my into my second year of playing ukulele. I&#39;m not very good, but I&#39;m having <br/>\nfun. I&#39;ve not taken a class or had any formal tuition, but I&#39;ve watched lots of <br/>\nvideos and I&#39;ve asked a banjo player and a guitarist or two to show me how they <br/>\nhandle one thing or another. I&#39;ve never played an instrument before, well I had <br/>\nbrushes with piano, oboe and violin, but not long ones. If I were to approach <br/>\nsomeone to teach me how to play I know that I would struggle with the top down <br/>\napproach to knowledge acquisition. I learn best through my own exploration. I <br/>\nlearn best by following my own interests. I play far more than I expected that I <br/>\nwould. I am surprised that I am still curious after a year and a half of not <br/>\nplaying very well, but slowly and steadily better than before. If someone else <br/>\nwere defining my relationship with ukulele playing I am absolutely certain that <br/>\nI would have gotten bored by now. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n________________________________<br/>\nFrom: Denise Jordan &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:denisejordan4@...\">denisejordan4@...</a>&gt;<br/>\nTo: unschooling &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nSent: Tuesday, 18 October, 2011 12:15:58<br/>\nSubject: RE: [unschoolingbasics] public school<br/>\n<br/>\n&quot; If you see school <br/>\nas a tool that your daughter is choosing to use to explore the world maybe you <br/>\ncan help her with her choice instead of hindering her because you see the <br/>\nlimitations of that tool. Lots of tools have limitations, that doesn&#39;t mean they <br/>\n<br/>\naren&#39;t useful or valuable.&quot;<br/>\n<br/>\nI know my daughter well. To her school is being in a room with her 2 best <br/>\nfriends. She hasn&#39;t always gottten the same teacher as her freinds so she <br/>\ndoesn&#39;t see them at school any more than she does now. She isn&#39;t unhappy at <br/>\nhome but Im sure she would like to be around kids more during the week. As far <br/>\nas art, she loves to draw, she is 9. Why would I not let her take an art class <br/>\nif that is something she is missing? Not a lot of opportunity in my rural <br/>\narea. It&#39;s easy to say what you would do but not completely knowing how things <br/>\nare with ones child you can&#39;t really say Im hindering her. We have done the <br/>\nback and forth with public school more than once. I don&#39;t want her or me living <br/>\nthe life we did while in public school. having to get on to your child every <br/>\nmorning to get her up, every afternoon to do homework and every night to go to <br/>\nbed, that&#39;s not the kind of life anybody would want their child to grow up in. <br/>\nthere was to much arguing, crying, stubborness, etc. I for one don&#39;t want my <br/>\nchild&#39;s childhood to be about getting angry and crying everyday. she only <br/>\nmisses public school once in a while and is it really necessary to put her in <br/>\nand take her out every couple of weeks<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n \t\t \t   \t\t  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/ztF8xQpjQgA?wmode=opaque","type":"VIDEO"}]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: public school","postDate":"1318947566","msgId":47556,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo3azF0ZStsMGIyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PFNOVDE0My1XNjI4MEU4NzI5RTE4MDY1QTAzRTNCQ0Y3RTUwQHBoeC5nYmw+"},"prevInTopic":47555,"nextInTopic":47560,"prevInTime":47555,"nextInTime":47557,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"Hmmm. . . does she really want to go to school or is it just something to say? How rural are you? Are there any other organized activities that might appeal to","messageBody":"<div id=\"ygrps-yiv-822245787\">Hmmm. . . does she really want to go to school or is it just something to say? How rural are you? Are there any other organized activities that might appeal to your 9-yo daughter and her friends? Girl Scouts or volunteering or 4H or something they could do together outside of school? <br/>\n<br/>\nJust spitballing. . .<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n <br/>\n<blockquote><span title=\"qreply\"> &gt;  <br/>\n&gt; I know my daughter well.  To her school is being in a room with her 2 best friends.  She hasn&#39;t always gottten the same teacher as her freinds so she doesn&#39;t see them at school any more than she does now.  She isn&#39;t unhappy at home but Im sure she would like to be around kids more during the week. </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] public school","postDate":"1318943410","msgId":47555,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRTVCQUU2NjNEQThBOS0xNkQ4LThENDM1QHdlYm1haWwtZDE1MS5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PFNOVDE0My1XNjI4MEU4NzI5RTE4MDY1QTAzRTNCQ0Y3RTUwQHBoeC5nYmw+","referencesHeader":"PDEzMTg5Mjk2ODUuMTgxMzkuWWFob29NYWlsUkNAd2ViODczMTQubWFpbC5pcmQueWFob28uY29tPiA8U05UMTQzLVc2MjgwRTg3MjlFMTgwNjVBMDNFM0JDRjdFNTBAcGh4LmdibD4="},"prevInTopic":47553,"nextInTopic":47556,"prevInTime":47554,"nextInTime":47556,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"... From: Denise Jordan  I don t want her or me living the life we did while in public school.  having to get on to your child every","messageBody":"<div id=\"ygrps-yiv-1555120127\">-----Original Message-----<br/>\nFrom: Denise Jordan &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:denisejordan4@...\">denisejordan4@...</a>&gt;<br/>\n<br/>\n<br/>\n I don&#39;t want her or me living the life we did while in public school.  having to get on to your child every morning <br/>\nto get her up, every afternoon to do homework and every night to go to bed, that&#39;s not the kind of life anybody would <br/>\nwant their child to grow up in.  <br/>\n<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n<br/>\nI&#39;d say that&#39;s EXACTLY the life the vast majority of American parents choose for their children. Seriously. We are the tiny, tiny (but growing) minority.<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":250057382,"authorName":"Tova","from":"Tova &lt;ml_ja@...&gt;","profile":"ml_ja","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] public school","postDate":"1318941388","msgId":47553,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTg5NDEzODguMjIwOTEuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDEubWFpbC5iZjEueWFob28uY29tPg==","inReplyToHeader":"PDEzMTg5NDAzMTQuOTk0NjAuWWFob29NYWlsUkNAd2ViODczMTMubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":47551,"nextInTopic":47555,"prevInTime":47552,"nextInTime":47554,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"That doesn t mean you don t seek out other people with more knowledge, but it does mean that you seek them out when you know what it is you want to know","messageBody":"<div id=\"ygrps-yiv-769148659\">&quot;That doesn&#39;t mean you don&#39;t seek out other people with more knowledge,<br/>\n<br/>\nbut it does mean that you seek them out when you know what it is you<br/>\nwant to<br/>\n<br/>\nknow rather then looking to them to tell you what it is you need to<br/>\nlearn first<br/>\n<br/>\nand second and third.&quot;<br/>\n<br/>\nI like this.<br/>\n<br/>\nIt is very true.</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] public school","postDate":"1318940314","msgId":47550,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTg5NDAzMTQuOTk0NjAuWWFob29NYWlsUkNAd2ViODczMTMubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PFNOVDE0My1XNjI4MEU4NzI5RTE4MDY1QTAzRTNCQ0Y3RTUwQHBoeC5nYmw+","referencesHeader":"PDEzMTg5Mjk2ODUuMTgxMzkuWWFob29NYWlsUkNAd2ViODczMTQubWFpbC5pcmQueWFob28uY29tPiA8U05UMTQzLVc2MjgwRTg3MjlFMTgwNjVBMDNFM0JDRjdFNTBAcGh4LmdibD4="},"prevInTopic":47548,"nextInTopic":47551,"prevInTime":47549,"nextInTime":47551,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"I linked a couple of things in my post. Given your response  having to get on to your child every morning to get her up, every  afternoon to do homework and ","messageBody":"<div id=\"ygrps-yiv-1765725569\">I linked a couple of things in my post. Given your response &quot; having to get on <br/>\nto your child every morning to get her up, every  afternoon to do homework and <br/>\nevery night to go to bed, that&#39;s not the  kind of life anybody would want their <br/>\nchild to grow up in.  there was to  much arguing, crying, stubborness, etc.&quot; I&#39;m <br/>\nguessing that you didn&#39;t read this one: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/schoolchoice\">http://sandradodd.com/schoolchoice</a> which <br/>\ntalks about letting a child experience school on their own terms. There is <br/>\nusually more than one way to deal with a situation. It may help you to see more <br/>\noptions. <br/>\n<br/>\n<br/>\nIf your daughter is flipping back and forth as frequently as you say she is than <br/>\nshe isn&#39;t really finding a happy life in either place. In that situation I would <br/>\nbe looking for ways of making one or the other better, or look for a third <br/>\nchoice. You say that your rural life is a limiting factor, maybe you need to <br/>\naddress that aspect. We live in a rural location but go into town regularly and <br/>\nhave found local activities to engage with. The UK&#39;s rural is distinctly <br/>\ndifferent from the US, but when I&#39;ve been in the wilds of Nebraska there were <br/>\nfolks to connect with and things to do. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&quot; As far as art, she loves to draw, she is 9.  Why would I not let her take an <br/>\n&gt;&gt;art class if that is something she is missing?&quot;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Why would you stop with a class? Why would you start with a class? <br/>\n<br/>\nWhy wouldn&#39;t you start with exploring your local environment for art or using <br/>\nthe amazing resources that are on the internet? Why wouldn&#39;t you look at Georgia <br/>\nO&#39;Keefe&#39;s explorations of the natural world? Annie Dillard&#39;s discussions of the <br/>\nbeauty that is around you? Ansel Addams photography? The fabulous rice field <br/>\nplantings in Japan <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=ztF8xQpjQgA?\">http://www.youtube.com/watch?v=ztF8xQpjQgA?</a> The corn palace <br/>\nin Mitchell South Dakota? Crop circles in the UK <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Crop_circle\">http://en.wikipedia.org/wiki/Crop_circle</a> or this wonderful site: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.circlemakers.org?\">http://www.circlemakers.org?</a> The beauty in a chrysalis or a spider web dotted <br/>\nwith dew? I could go on and on and on. <br/>\n<br/>\n<br/>\nYesterday, looking out the kitchen window, I saw the most amazing pre-storm <br/>\nlight. Because I&#39;ve been using my film camera more lately in the run up to <br/>\nresetting up a darkroom, I&#39;ve been thinking about light. Because I use black and <br/>\nwhite mostly I was interested in the interplay of colour and light in that <br/>\nmoment. David, my husband, shoots primarily colour film and if his camera had <br/>\nbeen loaded I would have taken a picture of the red of the roof tiles against <br/>\nthe dark blue-grey of the storm clouds and the slate of the garage roof and the <br/>\ngreen of the grape vines. It was a boring image in terms of composition, but <br/>\namazing in terms of colour and contrast and light. I didn&#39;t need to be anywhere <br/>\nspecial to see that. The Telegraph has been running a series of photos of <br/>\nBritish autumn pictures: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.telegraph.co.uk/gardening/gardeningpicturegalleries/8827345/Our-third-gallery-of-Telegraph-readers-pictures-of-autumn-colour-in-Britain.html.\">http://www.telegraph.co.uk/gardening/gardeningpicturegalleries/8827345/Our-third-gallery-of-Telegraph-readers-pictures-of-autumn-colour-in-Britain.html.</a><br/>\n These are small moments of wonder. Look for the wonder that is in your life. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.flickr.com/photos/juliepersons/\">http://www.flickr.com/photos/juliepersons/</a> is Julie Persons&#39; flickr stream. <br/>\nShe&#39;s an unschooling mom who lives a very rural life and finds wonder all around <br/>\nher. <br/>\n<br/>\n<br/>\nStarting with a class is a problem if both of you are still deschooling. <br/>\nStarting with a class means that you don&#39;t really grasp the notion that art <br/>\nisn&#39;t a subject to be studies outside of the rest of living, it is a part of all <br/>\nthe rest of life. It means that you are looking at learning as something that is <br/>\naccomplished best in a setting where one person tells a bunch of other people <br/>\nwhat to explore and when and how and not as something that happens at it&#39;s best <br/>\nwhen the individual is discovering the world in a fully engaged and interested <br/>\nfashion. That doesn&#39;t mean you don&#39;t seek out other people with more knowledge, <br/>\nbut it does mean that you seek them out when you know what it is you want to <br/>\nknow rather then looking to them to tell you what it is you need to learn first <br/>\nand second and third. <br/>\n<br/>\n<br/>\nStarting with a class means that you are telling your daughter that school is <br/>\nhonestly the best way to gain information about the things that you are <br/>\ninterested in. Starting with a class supports a schooling relationship with <br/>\nknowledge. It completely argues that art is a set of skills that need to be <br/>\nobtained in order to accomplish art and that it is best obtained by going to <br/>\nsomeone else to learn them. <a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/What_Is_Art%3F\">http://en.wikipedia.org/wiki/What_Is_Art%3F</a> is an <br/>\nentry on Leo Tolstoy&#39;s essay What Is Art? In his essay he writes &quot;In order <br/>\ncorrectly to define art, it is necessary, first of all, to cease to consider it <br/>\nas a means to pleasure and to consider it as one of the conditions of human <br/>\nlife. Viewing it in this way we cannot fail to observe that art is one of the <br/>\nmeans of intercourse between man and man.&quot;  <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.csulb.edu/~jvancamp/361r14.html)\">http://www.csulb.edu/~jvancamp/361r14.html)</a>. I may have to spend some of the <br/>\nnext week reading through the book: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.archive.org/details/whatisart00tolsuoft.\">http://www.archive.org/details/whatisart00tolsuoft.</a> I really like that. I agree <br/>\nwith that. I believe that art is one of the conditions of human life. And <br/>\nbelieving that makes the idea of a general class on art tuition an odd concept <br/>\nto me. I can see seeking out tuition in some skill or another that was needed or <br/>\nin a general approach to something. But I would do that only after I had <br/>\nexplored other avenues, most likely. <br/>\n<br/>\n<br/>\nI&#39;m my into my second year of playing ukulele. I&#39;m not very good, but I&#39;m having <br/>\nfun. I&#39;ve not taken a class or had any formal tuition, but I&#39;ve watched lots of <br/>\nvideos and I&#39;ve asked a banjo player and a guitarist or two to show me how they <br/>\nhandle one thing or another. I&#39;ve never played an instrument before, well I had <br/>\nbrushes with piano, oboe and violin, but not long ones. If I were to approach <br/>\nsomeone to teach me how to play I know that I would struggle with the top down <br/>\napproach to knowledge acquisition. I learn best through my own exploration. I <br/>\nlearn best by following my own interests. I play far more than I expected that I <br/>\nwould. I am surprised that I am still curious after a year and a half of not <br/>\nplaying very well, but slowly and steadily better than before. If someone else <br/>\nwere defining my relationship with ukulele playing I am absolutely certain that <br/>\nI would have gotten bored by now. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Denise Jordan &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:denisejordan4@...\">denisejordan4@...</a>&gt;<br/>\nTo: unschooling &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nSent: Tuesday, 18 October, 2011 12:15:58<br/>\nSubject: RE: [unschoolingbasics] public school<br/>\n<br/>\n<br/>\n&quot; If you see school <br/>\nas a tool that your daughter is choosing to use to explore the world maybe you <br/>\ncan help her with her choice instead of hindering her because you see the <br/>\nlimitations of that tool. Lots of tools have limitations, that doesn&#39;t mean they <br/>\n<br/>\naren&#39;t useful or valuable.&quot;<br/>\n<br/>\nI know my daughter well.  To her school is being in a room with her 2 best <br/>\nfriends.  She hasn&#39;t always gottten the same teacher as her freinds so she <br/>\ndoesn&#39;t see them at school any more than she does now.  She isn&#39;t unhappy at <br/>\nhome but Im sure she would like to be around kids more during the week.  As far <br/>\nas art, she loves to draw, she is 9.  Why would I not let her take an art class <br/>\nif that is something she is missing?  Not a lot of opportunity in my rural <br/>\narea.  It&#39;s easy to say what you would do but not completely knowing how things <br/>\nare with ones child you can&#39;t really say Im hindering her.  We have done the <br/>\nback and forth with public school more than once.  I don&#39;t want her or me living <br/>\nthe life we did while in public school.  having to get on to your child every <br/>\nmorning to get her up, every afternoon to do homework and every night to go to <br/>\nbed, that&#39;s not the kind of life anybody would want their child to grow up in.  <br/>\nthere was to much arguing, crying, stubborness, etc.  I for one don&#39;t want my <br/>\nchild&#39;s childhood to be about getting angry and crying everyday.  she only <br/>\nmisses public school once in a while and is it really necessary to put her in <br/>\nand take her out every couple of weeks<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/ztF8xQpjQgA?wmode=opaque","type":"VIDEO"}]},{"userId":250057382,"authorName":"Tova","from":"Tova &lt;ml_ja@...&gt;","profile":"ml_ja","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] public school","postDate":"1318939585","msgId":47551,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTg5Mzk1ODUuODYyMjMuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDYubWFpbC5iZjEueWFob28uY29tPg==","inReplyToHeader":"PFNOVDE0My1XNjI4MEU4NzI5RTE4MDY1QTAzRTNCQ0Y3RTUwQHBoeC5nYmw+"},"prevInTopic":47550,"nextInTopic":47553,"prevInTime":47550,"nextInTime":47552,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"We use the library and I really recommend it as a social venue and basically in place of school because it offers everything that school does (and more) but in","messageBody":"<div id=\"ygrps-yiv-1474230176\">We use the library and I really recommend it as a social venue and basically in place of school because it offers everything that school does (and more) but in a more authentic sense (and the library doesn&#39;t give a child homework!)<br/>\n<br/>\nI&#39;ll grab my laptop and my daughter and I will spend hours there in the late afternoon. There&#39;s so much to do, so many people to chat with, and so much to learn at a library.<br/>\n<br/>\n<br/>\n--------<br/>\nI know my daughter well.  To her school is being in a room with her 2 best friends.  She hasn&#39;t always gottten the same teacher as her freinds so she doesn&#39;t see them at school any more than she does now.  She isn&#39;t unhappy at home but Im sure she would like to be around kids more during the week.  As far as art, she loves to draw, she is 9.  Why would I not let her take an art class if that is something she is missing?  Not a lot of opportunity in my rural area.  It&#39;s easy to say what you would do but not completely knowing how things are with ones child you can&#39;t really say Im hindering her.  We have done the back and forth with public school more than once.  I don&#39;t want her or me living the life we did while in public school.  having to get on to your child every morning to get her up, every afternoon to do homework and every night to go to bed, that&#39;s not the kind of life anybody would want their child to grow up in.  there was to much arguing,<br/>\n crying, stubborness, etc.  I for one don&#39;t want my child&#39;s childhood to be about getting angry and crying everyday.  she only misses public school once in a while and is it really necessary to put her in and take her out every couple of weeks</div>","specialLinks":[]},{"userId":500196412,"authorName":"Denise Jordan","from":"Denise Jordan &lt;denisejordan4@...&gt;","profile":"juliadjordan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] public school","postDate":"1318936558","msgId":47548,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDE0My1XNjI4MEU4NzI5RTE4MDY1QTAzRTNCQ0Y3RTUwQHBoeC5nYmw+","inReplyToHeader":"PDEzMTg5Mjk2ODUuMTgxMzkuWWFob29NYWlsUkNAd2ViODczMTQubWFpbC5pcmQueWFob28uY29tPg==","referencesHeader":"PDEzMTg5Mjk2ODUuMTgxMzkuWWFob29NYWlsUkNAd2ViODczMTQubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":47547,"nextInTopic":47550,"prevInTime":47547,"nextInTime":47549,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":" If you see school as a tool that your daughter is choosing to use to explore the world maybe you can help her with her choice instead of hindering her","messageBody":"<div id=\"ygrps-yiv-1137819252\">&quot; If you see school <br/>\nas a tool that your daughter is choosing to use to explore the world maybe you <br/>\ncan help her with her choice instead of hindering her because you see the <br/>\nlimitations of that tool. Lots of tools have limitations, that doesn&#39;t mean they <br/>\naren&#39;t useful or valuable.&quot;<br/>\n <br/>\nI know my daughter well.  To her school is being in a room with her 2 best friends.  She hasn&#39;t always gottten the same teacher as her freinds so she doesn&#39;t see them at school any more than she does now.  She isn&#39;t unhappy at home but Im sure she would like to be around kids more during the week.  As far as art, she loves to draw, she is 9.  Why would I not let her take an art class if that is something she is missing?  Not a lot of opportunity in my rural area.  It&#39;s easy to say what you would do but not completely knowing how things are with ones child you can&#39;t really say Im hindering her.  We have done the back and forth with public school more than once.  I don&#39;t want her or me living the life we did while in public school.  having to get on to your child every morning to get her up, every afternoon to do homework and every night to go to bed, that&#39;s not the kind of life anybody would want their child to grow up in.  there was to much arguing, crying, stubborness, etc.  I for one don&#39;t want my child&#39;s childhood to be about getting angry and crying everyday.  she only misses public school once in a while and is it really necessary to put her in and take her out every couple of weeks<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a><br/>\nDate: Tue, 18 Oct 2011 10:21:25 +0100<br/>\nSubject: Re: [unschoolingbasics] public school<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\nIt may help for you to read www.sandradodd.com/schoolchoice. If you see school <br/>\nas a tool that your daughter is choosing to use to explore the world maybe you <br/>\ncan help her with her choice instead of hindering her because you see the <br/>\nlimitations of that tool. Lots of tools have limitations, that doesn&#39;t mean they <br/>\naren&#39;t useful or valuable. <br/>\n<br/>\nIf she isn&#39;t happy at home or at school you should work to make either of those <br/>\nplaces better for her. What is it she wants from school? Does she want more time <br/>\nwith other people? Can you get out more each week, each day? Can you go where <br/>\nthere are more people to be around? Can you get out and about regularly? Can you <br/>\nfind other things to do in your community? Other things to be engaged by, other <br/>\nconnections? Join a choir or a dance troupe or get involved with volunteering <br/>\nat a local woods or animal shelter or whatever is available? Look for exciting <br/>\nand engaging things that you and she can add to your life instead of bemoaning <br/>\nthe fact that she keeps not being happy in one or the other of the two <br/>\nscenarios she has experienced. Make a bigger and brighter life. <br/>\n<br/>\nShe says she misses art and you respond by signing her up for art classes? You <br/>\nare doing the same thing as she is. When she comes to you with an interest you <br/>\nenroll her in a course. Why be surprised if she thinks school is an appropriate <br/>\nvenue for exploring life? <br/>\n<br/>\nArt is huge and vast and fabulous. Art, like science, is how you see the world. <br/>\nWhat art does she like? Does she like modern art, things like Sarah Lucas&#39; self <br/>\nportraits or Banksy&#39;swonderful public statements on politics and the world? Does <br/>\nshe know about that arena? You could get Exit Through the Gift Shop and think <br/>\nabout art as industry, if you wanted, or not. Could you go looking for art in <br/>\nyour environment? Find the little filigrees on buildings, the moments when the <br/>\nbuilder broke out of the mould and danced a bit for his or her imagined <br/>\naudience? Can you go to museums and explore art? Can you go walking around <br/>\ninteresting neighbourhoods and blocks of your city/town and look at <br/>\narchitectural styles? Have you seen this <a rel=\"nofollow\" target=\"_blank\" href=\"http://slinkachu.com/little-people?\">http://slinkachu.com/little-people?</a> <br/>\nHaving seen this I often find spots where I would place little figures when I&#39;m <br/>\nin town. Maybe, if that interested your daughter (or you), you could collect <br/>\nfigures and have a bit of guerrilla art going in and around your local <br/>\ntown/city. <br/>\n<br/>\nLinnaea likes to draw. She doesn&#39;t think of herself as an artist, or of her <br/>\ndrawings as art. But she enjoys drawing and working on getting the aspects of <br/>\nthe human face correct and she spends a fair bit of time working on it. She <br/>\nuploads some of her drawings to a forum she&#39;s on and asks for help with the <br/>\ndetails. For example, she couldn&#39;t figure out how to make it look like a woman <br/>\nwas sitting and she uploaded her picture and someone came along and downloaded <br/>\nit and drew on a few notes and uploaded it and she was able to see how to handle <br/>\nthat problem and fixed the picture. I was and am impressed with her ability to <br/>\nnetwork for information. No classes, just interest and connections and a desire <br/>\nto improve. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n________________________________<br/>\nFrom: Denise Jordan &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:denisejordan4@...\">denisejordan4@...</a>&gt;<br/>\nTo: unschooling &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nSent: Tuesday, 18 October, 2011 0:15:30<br/>\nSubject: [unschoolingbasics] public school<br/>\n<br/>\nMy daughter says she wants to go back to public school. She has been there <br/>\nbefore and when she is there she wants to homeschool and of course when she&#39;s <br/>\nhere she wants to go back to school. she likes to see her friends but she <br/>\nstill sees her friends when we are at home. so how do we handle this. She says <br/>\nshe misses art, I have signed her up for art classes. she doesn&#39;t do well in <br/>\npublic school as far as grades, paying attention, getting up early, going to bed <br/>\nearly, homework, etc. Any suggestions? she is free to do whatever she wants <br/>\nat home. thanks Denise <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n \t\t \t   \t\t  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] public school","postDate":"1318929685","msgId":47546,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTg5Mjk2ODUuMTgxMzkuWWFob29NYWlsUkNAd2ViODczMTQubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":47545,"nextInTopic":47547,"prevInTime":47545,"nextInTime":47547,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"It may help for you to read www.sandradodd.com/schoolchoice. If you see school as a tool that your daughter is choosing to use to explore the world maybe you ","messageBody":"<div id=\"ygrps-yiv-1552261676\">It may help for you to read www.sandradodd.com/schoolchoice. If you see school <br/>\nas a tool that your daughter is choosing to use to explore the world maybe you <br/>\ncan help her with her choice instead of hindering her because you see the <br/>\nlimitations of that tool. Lots of tools have limitations, that doesn&#39;t mean they <br/>\naren&#39;t useful or valuable. <br/>\n<br/>\n<br/>\nIf she isn&#39;t happy at home or at school you should work to make either of those <br/>\nplaces better for her. What is it she wants from school? Does she want more time <br/>\nwith other people? Can you get out more each week, each day? Can you go where <br/>\nthere are more people to be around? Can you get out and about regularly? Can you <br/>\nfind other things to do in  your community? Other things to be engaged by, other <br/>\nconnections? Join a  choir or a dance troupe or get involved with volunteering <br/>\nat a local  woods or animal shelter or whatever is available? Look for exciting <br/>\nand  engaging things that you and she can add to your life instead of  bemoaning <br/>\nthe fact that she keeps not being happy in one or the other of  the two <br/>\nscenarios she has experienced. Make a bigger and brighter life. <br/>\n<br/>\n<br/>\nShe says she misses art and you respond by signing her up for art classes? You <br/>\nare doing the same thing as she is. When she comes to you with an interest you <br/>\nenroll her in a course. Why be surprised if she thinks school is an appropriate <br/>\nvenue for exploring life? <br/>\n<br/>\n<br/>\nArt is huge and vast and fabulous. Art, like science, is how you see the world. <br/>\nWhat art does she like? Does she like modern art, things like Sarah Lucas&#39; self  <br/>\nportraits or Banksy&#39;swonderful public statements on politics and the world? Does <br/>\nshe know about that arena? You could get Exit Through the Gift Shop and think <br/>\nabout art as industry, if you wanted, or not.  Could you go looking for art in <br/>\nyour environment? Find the little filigrees on buildings, the moments when the <br/>\nbuilder broke out of the mould and danced a bit for his or her imagined <br/>\naudience?  Can you go to museums and explore art? Can you go walking around <br/>\ninteresting neighbourhoods and blocks of your city/town and look at <br/>\narchitectural styles? Have you seen this <a rel=\"nofollow\" target=\"_blank\" href=\"http://slinkachu.com/little-people?\">http://slinkachu.com/little-people?</a> <br/>\nHaving seen this I often find spots where I would place little figures when I&#39;m <br/>\nin town. Maybe, if that interested your daughter (or you), you could collect <br/>\nfigures and have a bit of guerrilla art going in and around your local <br/>\ntown/city. <br/>\n<br/>\n<br/>\nLinnaea likes to draw. She doesn&#39;t think of herself as an artist, or of her <br/>\ndrawings as art. But she enjoys drawing and working on getting the aspects of <br/>\nthe human face correct and she spends a fair bit of time working on it. She <br/>\nuploads some of her drawings to a forum she&#39;s on and asks for help with the <br/>\ndetails. For example, she couldn&#39;t figure out how to make it look like a woman <br/>\nwas sitting and she uploaded her picture and someone came along and downloaded <br/>\nit and drew on a few notes and uploaded it and she was able to see how to handle <br/>\nthat problem and fixed the picture. I was and am impressed with her ability to <br/>\nnetwork for information. No classes, just interest and connections and a desire <br/>\nto improve. <br/>\n<br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Denise Jordan &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:denisejordan4@...\">denisejordan4@...</a>&gt;<br/>\nTo: unschooling &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nSent: Tuesday, 18 October, 2011 0:15:30<br/>\nSubject: [unschoolingbasics] public school<br/>\n<br/>\n<br/>\nMy daughter says she wants to go back to public school.  She has been there <br/>\nbefore and when she is there she wants to homeschool and of course when she&#39;s <br/>\nhere she wants to go  back to school.  she likes to see her friends but she <br/>\nstill sees her friends when we are at home.  so how do we handle this.  She says <br/>\nshe misses art, I have signed her up for art classes.    she doesn&#39;t do well in <br/>\npublic school as far as grades, paying attention, getting up early, going to bed <br/>\nearly, homework, etc.    Any suggestions?  she is free to do whatever she wants <br/>\nat home.  thanks  Denise                           <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":500196412,"authorName":"Denise Jordan","from":"Denise Jordan &lt;denisejordan4@...&gt;","profile":"juliadjordan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] public school","postDate":"1318902884","msgId":47547,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDE0My1XNThERDQwNkJCMzk0MjlGRkI5MUU2NEY3RTUwQHBoeC5nYmw+","inReplyToHeader":"PDEzMTg5MDE4NTIuNTk3NDUuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MTkubWFpbC5iZjEueWFob28uY29tPg==","referencesHeader":"PFNOVDE0My1XMzFFQjE1RUQ4ODJGODhDQ0ZEN0U5QkY3RTQwQHBoeC5nYmw+LDwxMzE4OTAxODUyLjU5NzQ1LllhaG9vTWFpbENsYXNzaWNAd2ViMTYxNzE5Lm1haWwuYmYxLnlhaG9vLmNvbT4="},"prevInTopic":47546,"nextInTopic":47548,"prevInTime":47546,"nextInTime":47548,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"Thanks Tova but Im not under the county.  I am under an umbrella school.  not sure if they can do that when we are in what is considered a private school.","messageBody":"<div id=\"ygrps-yiv-1870031264\">Thanks Tova but Im not under the county.  I am under an umbrella school.  not sure if they can do that when we are in what is considered a private school.  guess i will check with the schools and see.  Thanks<br/>\n <br/>\n<br/>\n<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ml_ja@...\">ml_ja@...</a><br/>\nDate: Mon, 17 Oct 2011 18:37:32 -0700<br/>\nSubject: Re: [unschoolingbasics] public school<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\nMost pubic schools allow homescooled children to partake in some of the classes (they are public schools after all and your taxes are paying for them). Your daughter could just take the art class at public school and nothing else. My daughter goes to the recess at the public school down the road some days.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Mon, 10/17/11, Denise Jordan &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:denisejordan4@...\">denisejordan4@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Denise Jordan &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:denisejordan4@...\">denisejordan4@...</a>&gt;<br/>\nSubject: [unschoolingbasics] public school<br/>\nTo: &quot;unschooling&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nDate: Monday, October 17, 2011, 7:15 PM<br/>\n<br/>\n <br/>\n<br/>\nMy daughter says she wants to go back to public school. She has been there before and when she is there she wants to homeschool and of course when she&#39;s here she wants to go back to school. she likes to see her friends but she still sees her friends when we are at home. so how do we handle this. She says she misses art, I have signed her up for art classes. she doesn&#39;t do well in public school as far as grades, paying attention, getting up early, going to bed early, homework, etc. Any suggestions? she is free to do whatever she wants at home. thanks Denise <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n \t\t \t   \t\t  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":250057382,"authorName":"Tova","from":"Tova &lt;ml_ja@...&gt;","profile":"ml_ja","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] public school","postDate":"1318901852","msgId":47545,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTg5MDE4NTIuNTk3NDUuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MTkubWFpbC5iZjEueWFob28uY29tPg==","inReplyToHeader":"PFNOVDE0My1XMzFFQjE1RUQ4ODJGODhDQ0ZEN0U5QkY3RTQwQHBoeC5nYmw+"},"prevInTopic":47544,"nextInTopic":47546,"prevInTime":47544,"nextInTime":47546,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"Most pubic schools allow homescooled children to partake in some of the classes (they are public schools after all and your taxes are paying for them). Your","messageBody":"<div id=\"ygrps-yiv-1805556646\">Most pubic schools allow homescooled children to partake in some of the classes (they are public schools after all and your taxes are paying for them). Your daughter could just take the art class at public school and nothing else. My daughter goes to the recess at the public school down the road some days.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Mon, 10/17/11, Denise Jordan &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:denisejordan4@...\">denisejordan4@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Denise Jordan &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:denisejordan4@...\">denisejordan4@...</a>&gt;<br/>\nSubject: [unschoolingbasics] public school<br/>\nTo: &quot;unschooling&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>&gt;<br/>\nDate: Monday, October 17, 2011, 7:15 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      <br/>\n<br/>\nMy daughter says she wants to go back to public school.  She has been there before and when she is there she wants to homeschool and of course when she&#39;s here she wants to go back to school.  she likes to see her friends but she still sees her friends when we are at home.  so how do we handle this.  She says she misses art, I have signed her up for art classes.    she doesn&#39;t do well in public school as far as grades, paying attention, getting up early, going to bed early, homework, etc.    Any suggestions?  she is free to do whatever she wants at home.  thanks  Denise \t\t \t   \t\t  <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":500196412,"authorName":"Denise Jordan","from":"Denise Jordan &lt;denisejordan4@...&gt;","profile":"juliadjordan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"public school","postDate":"1318893330","msgId":47544,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDE0My1XMzFFQjE1RUQ4ODJGODhDQ0ZEN0U5QkY3RTQwQHBoeC5nYmw+"},"prevInTopic":0,"nextInTopic":47545,"prevInTime":47543,"nextInTime":47545,"topicId":47544,"numMessagesInTopic":0,"msgSnippet":"My daughter says she wants to go back to public school.  She has been there before and when she is there she wants to homeschool and of course when she s here","messageBody":"<div id=\"ygrps-yiv-1666135030\">My daughter says she wants to go back to public school.  She has been there before and when she is there she wants to homeschool and of course when she&#39;s here she wants to go back to school.  she likes to see her friends but she still sees her friends when we are at home.  so how do we handle this.  She says she misses art, I have signed her up for art classes.    she doesn&#39;t do well in public school as far as grades, paying attention, getting up early, going to bed early, homework, etc.    Any suggestions?  she is free to do whatever she wants at home.  thanks  Denise \t\t \t   \t\t  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":47580,"nextTopicId":47627}}