{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":222,"messages":[{"userId":266096457,"authorName":"Momma","from":"&quot;Momma&quot; &lt;southernbelle@...&gt;","profile":"centurykissed","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Has Anyone Had This Experience?","postDate":"1291733949","msgId":45405,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY1NDhCMEZERUM5MzQ5NDE5MDgwQTZCN0I3OERDMjQzQE1vbXNQQz4="},"prevInTopic":45404,"nextInTopic":45406,"prevInTime":45404,"nextInTime":45406,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"If MSG is a concern for you you really need to do some research. MSG is a naturally occurring amino acid, it is not a chemical mixed up in a lab somewhere. It","messageBody":"<div id=\"ygrps-yiv-372552627\">If MSG is a concern for you you really need to do some research. MSG is a naturally occurring amino acid, it is not a chemical mixed up in a lab somewhere. It is found naturally in many of the foods we eat, like hard cheeses. Yes, it enhances the flavor of food and that is why it is used. You need to do your own research about things and not believe everything you hear. That is very dangerous because you perpetuate ignorance. <br/>\nAubrey<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Has Anyone Had This Experience? - the behavior of parents","postDate":"1291726138","msgId":45404,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU5RUM2OTI2LTQwNUItNEEwNS1BQTczLTA5MzIxMTEzMDg3OEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDQwNTc3LjczMTg2LnFtQHdlYjExMjAwNi5tYWlsLmdxMS55YWhvby5jb20+","referencesHeader":"PGlkamNmZitmODRtQGVHcm91cHMuY29tPiA8OENENjNCMDc0RjM3MTQwLTFBQjAtMzdCRDFAV2VibWFpbC1tMTE0LnN5c29wcy5hb2wuY29tPiA8QUFOTGtUaW5adTk2dXNWRjlobmpyQ0RXZ0x6c0pXdFhnbzNtY3JxUG56czJ5QG1haWwuZ21haWwuY29tPiA8NzczODMzLjk1Njk2LnFtQHdlYjExMjAwMS5tYWlsLmdxMS55YWhvby5jb20+IDw2MTE3OTMuNTAxOTEucW1Ad2ViODYyMDMubWFpbC5pcmQueWFob28uY29tPiA8NDA1NzcuNzMxODYucW1Ad2ViMTEyMDA2Lm1haWwuZ3ExLnlhaG9vLmNvbT4="},"prevInTopic":45403,"nextInTopic":45405,"prevInTime":45403,"nextInTime":45405,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"... And some will find other writings not helpful. What s useful for the list is recognizing that people have different styles of learning so different","messageBody":"<div id=\"ygrps-yiv-2047600629\">On Dec 7, 2010, at 6:29 AM, Alix deBohun wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; These kind of comments are (admittedly in my opinion) not helpful,  <br/>\n&gt; completely<br/>\n&gt; unnecessary and quite rude.<br/>\n<br/>\n </span></blockquote>And some will find other writings not helpful.<br/>\n<br/>\nWhat&#39;s useful for the list is recognizing that people have different  <br/>\nstyles of learning so different approaches will help different people.  <br/>\nSome people appreciate the blunt, no nonsense answers.<br/>\n<br/>\nWhat&#39;s helpful for people reading is understanding that replies are  <br/>\ndirected at the ideas put onto the list not to people. The responses  <br/>\nshould be (potentially, depending on their learning style) useful even  <br/>\nto someone reading in the archives 5 years from now.<br/>\n<br/>\nThe purpose of the list is not to support people where they are but to  <br/>\nsupport the gathering of clear, honest information about unschooling  <br/>\nthat anyone can dip into and use. The purpose is to focus on the  <br/>\nchildren&#39;s free explorations, joy and relationships with them and help  <br/>\nparents do that too.<br/>\n<br/>\nIt does support the efforts of those who are letting go of the old and  <br/>\ntrying to make the new work. There&#39;s support for people working  <br/>\nthrough their fears. There isn&#39;t support for people who want to hold  <br/>\nonto their fears because that gets in the way of helping the people  <br/>\nthe list is targeted at: the people trying to do the hard work of  <br/>\nchanging.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Has Anyone Had This Experience?","postDate":"1291725213","msgId":45403,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBQzg4MEVFLTI2NTgtNDFGQy05NEI5LUYwN0I4MUIxNUE5OEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGlkazg4aitrNWdtQGVHcm91cHMuY29tPg==","referencesHeader":"PGlkazg4aitrNWdtQGVHcm91cHMuY29tPg=="},"prevInTopic":45402,"nextInTopic":45404,"prevInTime":45402,"nextInTime":45404,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"... It s not being ignored. It s being given a lower priority than relationships and joy. Some parents have decided the risks of having some chemicals in their","messageBody":"<div id=\"ygrps-yiv-2036296445\">On Dec 6, 2010, at 10:04 PM, maharaashlie wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I bring to the table something that seems to be going ignored here.  <br/>\n&gt; The truth of what IS in some of our foods that so many people do not  <br/>\n&gt; want to notice as hazardous to human health.<br/>\n<br/>\n </span></blockquote>It&#39;s not being ignored. It&#39;s being given a lower priority than  <br/>\nrelationships and joy. Some parents have decided the risks of having  <br/>\nsome chemicals in their food is much less than the risks of  <br/>\ncontrolling their children&#39;s food.<br/>\n<br/>\nHow can some parents do that when there&#39;s so much information about  <br/>\nhow bad some chemicals are?<br/>\n<br/>\nFirst by recognizing that a massive amount of the information is  <br/>\ncreated by people who are afraid of the chemicals. And fearful people  <br/>\nare really good at proving their fears and not very good at being  <br/>\nobjective.<br/>\n<br/>\nThat doesn&#39;t mean there isn&#39;t some truth buried in there but the level  <br/>\nof fear for some people is seen as out of proportion to the danger.  <br/>\nDrano is toxic. People shouldn&#39;t eat it. They&#39;ll probably die very  <br/>\nquickly.<br/>\n<br/>\nIf something in a food (whether it&#39;s a food chemical like the allergen  <br/>\nin wheat or some processing chemical) has an immediate effect, kids  <br/>\ncan learn what makes them feel good and what makes them feel bad if  <br/>\nthey&#39;re given the freedom to be aware of their bodies by trying  <br/>\ndifferent foods out.<br/>\n<br/>\nIf something in a food takes decades to have an effect, this is not an  <br/>\nimminent danger. And some parents have decided the risks of control,  <br/>\nthe risks of living in fear of food are far greater than the risks of  <br/>\nthe chemicals. (They will provide information they believe is  <br/>\nimportant as it comes up in life but won&#39;t use it to steer their  <br/>\nchildren to make particular choices. It&#39;s information for the kids to  <br/>\nturn over and decide for themselves.)<br/>\n<br/>\nSecond by recognizing that over the course of a childhood, in a home  <br/>\nwhere healthy meals and snacks are provided, the amount of processed  <br/>\nfood the child will add to that will be small and the amount of fear  <br/>\nand control needed to eliminate that small amount in a world where  <br/>\nit&#39;s readily available will be large.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How do we care for our children and allow them the freedom to eat  <br/>\n&gt; what we know is simply toxic?<br/>\n<br/>\n </span></blockquote>If you&#39;re absolutely certain some foods are toxic then you keep those  <br/>\naway from your children.<br/>\n<br/>\nTo make keeping toxic food from your kids a priority, when it clashes  <br/>\nwith other priorities like freedom to explore or experiencing the  <br/>\nguilt-free joy of a red dyed popsicle on a hot afternoon, then that  <br/>\npriority will need to override the others.<br/>\n<br/>\nEvery choice, even the best choices, has its pros and cons. For you  <br/>\nthe pro of what you believe is a healthier body outweighs the  <br/>\npotential con of the effects of control.<br/>\n<br/>\nFor others, they&#39;re not as convinced that the potential (if any)  <br/>\nhealth benefits of avoiding processed foods outweighs the effects of  <br/>\ncontrol.<br/>\n<br/>\nYou&#39;ve read, I&#39;m assuming, loads about the toxic effects of some  <br/>\nprocessed food. Don&#39;t you also want to know the toxic effects of  <br/>\ncontrol so you can make an informed choice? Don&#39;t you want to know  <br/>\nwhat you&#39;re giving up to get what you believe you&#39;ll get by keeping  <br/>\nprocessed foods from your kids?<br/>\n<br/>\nThat&#39;s what people are trying to do. There&#39;s very very little written  <br/>\nabout the effects of control on kids because it&#39;s a constant of most  <br/>\nchildren&#39;s lives. Most people don&#39;t know! They think kids act  <br/>\ndefiantly, are contrary, selfish because they&#39;re kids.<br/>\n<br/>\nUnschoolers, though, know differently. And we see how our kids aren&#39;t  <br/>\nacting like supposedly &quot;normal&quot; kids. We see how our teens aren&#39;t  <br/>\ndoing the antagonistic teen rebellion thing that supposedly comes with  <br/>\nbeing a teen. Because of that special knowledge, we can help people  <br/>\nmake more informed decisions around the idea of control.<br/>\n<br/>\nYour certainty in the rightness of your beliefs does not negate the  <br/>\neffects of control. Parents want it to! They want to be able to guide  <br/>\ntheir children to the right choices and have their kids embrace those  <br/>\nchoices because they&#39;re right choices.<br/>\n<br/>\nBut human nature doesn&#39;t work that way. A fundamentalist Christian is  <br/>\nabsolutely certain they&#39;re right, but that certainty doesn&#39;t  <br/>\nautomatically make me see their rightness. Their need to make me  <br/>\nbelieve makes me turn away. The more strongly someone wants me to  <br/>\nbelieve their version of truth, the more likely I am to back off.<br/>\n<br/>\nOn the other hand, if someone practices their values for themselves  <br/>\nand is careful to not impose them on me, if those values make them  <br/>\nhappy, I&#39;m more likely to be intrigued.<br/>\n<br/>\nKids are a special breed of person because they are more likely to  <br/>\naccept parents&#39; information. (Not all kids! Some kids very much need  <br/>\nto decide for themselves by exploring, not by being told what&#39;s the  <br/>\nright decision.) So they&#39;re likely to trust us when we say Santa&#39;s  <br/>\nreal, or that food has toxic chemicals in it, or that the positive  <br/>\ntreatment of witches and magic in that movie will corrupt your soul.<br/>\n<br/>\nBut if our information, our decisions for our kids are a roadblock  <br/>\nbetween kids and something they find intriguing, they start feeling  <br/>\nthe control in our &quot;help&quot; to help them be better people.<br/>\n<br/>\nWhether you&#39;re right about the toxicity of chemicals in processed  <br/>\nfood, or where a soul goes if someone hasn&#39;t accepted Jesus as their  <br/>\npersonal savior, or the ability of TV to zombify brains, it still  <br/>\nfeels like control to the one who doesn&#39;t have the freedom to choose  <br/>\nand explore according to their own interests.<br/>\n<br/>\nControl has some potentially negative consequences. I listed some  <br/>\nbefore (they&#39;re below). Here some others. You can dismiss them if you  <br/>\nwish. You can decide they&#39;re not as bad as the chemicals in processed  <br/>\nfood. But this list is about supporting people who want to put  <br/>\nrelationships and joy and freedom to explore first and then want to  <br/>\nfigure out how to fit the rest of life around that. Who want to figure  <br/>\nout how to hold strong beliefs without interfering with their  <br/>\nchildren&#39;s free explorations.<br/>\n<br/>\nControlling food or anything that most people have ready access to  <br/>\nlike books and movies has some special potential negative  <br/>\nconsequences. Kids will see other kids and adults eating the  <br/>\nsupposedly toxic foods and watching the supposedly toxic movies who  <br/>\nare not showing negative effects and:<br/>\n<br/>\n1) decide their parents are full of whooey and start taking their  <br/>\nadvice with a big load of salt.<br/>\n<br/>\n2) be afraid for those people and want to tell them how they&#39;re  <br/>\ndamaging themselves. (Unschooling parents have had fundamentalist  <br/>\nChristian kids say their kids are going to Hell because they read  <br/>\nHarry Potter.)<br/>\n<br/>\n3) be afraid the world is too complex and they&#39;re too ignorant to  <br/>\nfigure out what is safe so need experts to tell them. (Which is  <br/>\nsimilar to 4 below but slightly different.)<br/>\n<br/>\nHere&#39;s the ones I listed before:<br/>\n<br/>\n1) Kids can learn to sneak. If there&#39;s something they really want and  <br/>\nyou&#39;re a roadblock between them and it, they&#39;re put in a position of  <br/>\nneeding to find a way around you.<br/>\n<br/>\n2) Kids can be so irritated by the control, they choose to go the  <br/>\nopposite way &quot;just because&quot;. The goal becomes choosing the opposite of  <br/>\nwhat the parent wants, regardless of the negative effects. (This is  <br/>\nthe root cause of teen rebellion. When there is no control. when kids  <br/>\ntrust their parents are on their side trying to find safe, respectful  <br/>\ndoable ways to get what they want, rebellion doesn&#39;t exist.)<br/>\n<br/>\n3) Control focuses attention on what can&#39;t be had, elevating its  <br/>\nimportance. Freely accessible Pringles are not nearly as desirable as  <br/>\nforbidden Pringles. I can have as many Pringles as I want. I had a  <br/>\nfair number of them as a child. As an adult, I don&#39;t want them.<br/>\n<br/>\n4) Kids can tune out their own inner voices in favor of experts who  <br/>\nknow what&#39;s best for them.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This is not &quot;fear-mongering&quot;! As I said, If you do not agree with  <br/>\n&gt; this Look it up. Aren&#39;t we all about natural here when it comes to  <br/>\n&gt; growth of the human mind, etc? I DON&#39;T UNDERSTAND WHY IT DOESN&#39;T GO  <br/>\n&gt; HAND IN HAND.<br/>\n<br/>\n </span></blockquote>Because natural learning is about discovering for one&#39;s self. Limiting  <br/>\nkids to foods you believe is natural/healthful can only be done  <br/>\nthrough control.<br/>\n<br/>\nYou can control &quot;nicely&quot; by explaining why but it&#39;s still control. (If  <br/>\nyour husband patiently explained why your favorite genre of novels  <br/>\nwere bad for you every time you wanted one, it wouldn&#39;t feel like  <br/>\nenlightenment. It would feel like control.) Depending on the child&#39;s  <br/>\npersonality, they may feel the &quot;nice&quot; control more strongly than more  <br/>\ncompliant kids. But even &quot;nice&quot; control will have negative effects.  <br/>\nYou may decide the negative effects are worth it but that doesn&#39;t mean  <br/>\nthey won&#39;t be there.<br/>\n<br/>\nYou might find a list about natural living suits you better. Some  <br/>\npeople confuse unschooling with natural living and get further  <br/>\nconfused when unschoolers talk about processed foods, TV and video  <br/>\ngames. If someone&#39;s priority is natural living, then *natural  <br/>\nlearning* can be part of that. But if someone&#39;s priority is  <br/>\nunschooling, then freedom to explore will take precedence when a child  <br/>\nwants an Oreo or HoHo or Pringles. (Unschoolers who are into natural  <br/>\nfoods will choose natural foods as the foundation of the food in their  <br/>\nhome but support their children&#39;s explorations into other foods by  <br/>\nadding their children&#39;s choices to the home rather than seeing it as  <br/>\nan either/or situation.)<br/>\n<br/>\nBTW the ingredients of Pringles are:<br/>\n<br/>\nDRIED POTATOES, VEGETABLE OIL (CONTAINS ONE OR MORE OF THE FOLLOWING:  <br/>\nCORN OIL, COTTONSEED OIL, SOYBEAN OIL, AND/OR SUNFLOWER OIL), RICE  <br/>\nFLOUR, WHEAT STARCH, MALTODEXTRIN, SALT AND DEXTROSE.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":248233800,"authorName":"Alix deBohun","from":"Alix deBohun &lt;czarena_unrest@...&gt;","profile":"czarena_unrest","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Has Anyone Had This Experience? - the behavior of parents","postDate":"1291725080","msgId":45406,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkxOTU1NC40MTEzNy5xbUB3ZWIxMTIwMDUubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDUzNjQ5My42NTA1Ni5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PGlkamNmZitmODRtQGVHcm91cHMuY29tPiA8OENENjNCMDc0RjM3MTQwLTFBQjAtMzdCRDFAV2VibWFpbC1tMTE0LnN5c29wcy5hb2wuY29tPiA8QUFOTGtUaW5adTk2dXNWRjlobmpyQ0RXZ0x6c0pXdFhnbzNtY3JxUG56czJ5QG1haWwuZ21haWwuY29tPiA8NzczODMzLjk1Njk2LnFtQHdlYjExMjAwMS5tYWlsLmdxMS55YWhvby5jb20+IDw2MTE3OTMuNTAxOTEucW1Ad2ViODYyMDMubWFpbC5pcmQueWFob28uY29tPiA8NDA1NzcuNzMxODYucW1Ad2ViMTEyMDA2Lm1haWwuZ3ExLnlhaG9vLmNvbT4gPDUzNjQ5My42NTA1Ni5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":45405,"nextInTopic":45407,"prevInTime":45405,"nextInTime":45407,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"I guess I can see that, I just wish that people would be more careful with their words online. Tone is not conveyed as well as we d like sometimes and for ","messageBody":"<div id=\"ygrps-yiv-1865508258\">I guess I can see that, I just wish that people would be more careful with their <br/>\nwords online. Tone is not conveyed as well as we&#39;d like sometimes and for <br/>\nsomeone who is obviously not as far along the path as others it can sound ruder <br/>\nthan it was meant. <br/>\n<br/>\nKelly may be loud and funny and joking, I tend to be over sensitive about <br/>\nrudeness and am always more likely to speak up for someone else than myself. And <br/>\nI felt the need to stick up for someone who may or may not have needed it. Thank <br/>\nyou for frank and kind conversation. <br/>\n<br/>\nMichelle/Czarena<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Schuyler &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Tue, December 7, 2010 4:12:21 AM<br/>\nSubject: Re: [unschoolingbasics] Re: Has Anyone Had This Experience? - the <br/>\nbehavior of parents<br/>\n<br/>\n  <br/>\nIf you look at those phrases in context and with a layer of kindness placed on <br/>\nthe tone, you will see they aren&#39;t nearly as harsh or as rude as you think they <br/>\nare. <br/>\n<br/>\nKelly is loud and funny and joking. Her comment about her unschooled kid beating <br/>\n<br/>\nup your can of Pringles and your pitcher of Kool-aid is about how not powerless <br/>\nthey are in the face of those food choices. The OP wrote that she couldn&#39;t have <br/>\ncertain food in her house because of her own inability to not eat it. Kelly&#39;s <br/>\nresponse was about how those foods don&#39;t become the center of her unschooled <br/>\nkid&#39;s world when they enter into the house. I honestly don&#39;t think rude is at <br/>\nall what she was intending. <br/>\n<br/>\nSaying that pringles and kool-aid are poisonous is a lie. Or it&#39;s a lie on the <br/>\nsame level as saying that water is poisonous. Water can kill you if you drink to <br/>\n<br/>\nmuch, you drown internally. <a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Water_intoxication\">http://en.wikipedia.org/wiki/Water_intoxication</a> says <br/>\n<br/>\n&quot;Water can be considered a poison when over-consumed just like any other <br/>\nsubstance&quot; although I think that&#39;s a strange use of the word poison. Probably no <br/>\n<br/>\nmore strange than saying that pringles or kool-aid are poisonous though. <br/>\n<br/>\nAnd it is fear-mongering to talk about things as poison that aren&#39;t. To share a <br/>\nfear that isn&#39;t based in fact, to try and rally folks round to get them to be <br/>\nmore afraid of something than they already are. It is a kind of Chicken Little <br/>\napproach to food. The sky isn&#39;t falling. I don&#39;t even have ceiling in my soup. <br/>\n<br/>\nOh, and it is always okay to leave the stuff that doesn&#39;t appeal to you. The <br/>\ndiscussions on this list are about moving toward a greater understanding of <br/>\nunschooling. Lots of folks have different ways of approaching how they do that. <br/>\nSome offer more help to some people than do others and the alternate. What may <br/>\nnot work for you may have caused someone to snort their tea out with laughter <br/>\nand gotten them to see something they hadn&#39;t seen before. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Has Anyone Had This Experience? - the behavior of parents","postDate":"1291723941","msgId":45402,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUzNjQ5My42NTA1Ni5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDQwNTc3LjczMTg2LnFtQHdlYjExMjAwNi5tYWlsLmdxMS55YWhvby5jb20+","referencesHeader":"PGlkamNmZitmODRtQGVHcm91cHMuY29tPiA8OENENjNCMDc0RjM3MTQwLTFBQjAtMzdCRDFAV2VibWFpbC1tMTE0LnN5c29wcy5hb2wuY29tPiA8QUFOTGtUaW5adTk2dXNWRjlobmpyQ0RXZ0x6c0pXdFhnbzNtY3JxUG56czJ5QG1haWwuZ21haWwuY29tPiA8NzczODMzLjk1Njk2LnFtQHdlYjExMjAwMS5tYWlsLmdxMS55YWhvby5jb20+IDw2MTE3OTMuNTAxOTEucW1Ad2ViODYyMDMubWFpbC5pcmQueWFob28uY29tPiA8NDA1NzcuNzMxODYucW1Ad2ViMTEyMDA2Lm1haWwuZ3ExLnlhaG9vLmNvbT4="},"prevInTopic":45400,"nextInTopic":45403,"prevInTime":45401,"nextInTime":45403,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"If you look at those phrases in context and with a layer of kindness placed on the tone, you will see they aren t nearly as harsh or as rude as you think they ","messageBody":"<div id=\"ygrps-yiv-1211465914\">If you look at those phrases in context and with a layer of kindness placed on <br/>\nthe tone, you will see they aren&#39;t nearly as harsh or as rude as you think they <br/>\nare. <br/>\n<br/>\nKelly is loud and funny and joking. Her comment about her unschooled kid beating <br/>\nup your can of Pringles and your pitcher of Kool-aid is about how not powerless <br/>\nthey are in the face of those food choices. The OP wrote that she couldn&#39;t have <br/>\ncertain food in her house because of her own inability to not eat it. Kelly&#39;s <br/>\nresponse was about how those foods don&#39;t become the center of her unschooled <br/>\nkid&#39;s world when they enter into the house. I honestly don&#39;t think rude is at <br/>\nall what she was intending. <br/>\n<br/>\nSaying that pringles and kool-aid are poisonous is a lie. Or it&#39;s a lie on the <br/>\nsame level as saying that water is poisonous. Water can kill you if you drink to <br/>\nmuch, you drown internally. <a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Water_intoxication\">http://en.wikipedia.org/wiki/Water_intoxication</a> says <br/>\n&quot;Water can be considered a poison when over-consumed just like any other <br/>\nsubstance&quot; although I think that&#39;s a strange use of the word poison. Probably no <br/>\nmore strange than saying that pringles or kool-aid are poisonous though. <br/>\n<br/>\nAnd it is fear-mongering to talk about things as poison that aren&#39;t. To share a <br/>\nfear that isn&#39;t based in fact, to try and rally folks round to get them to be <br/>\nmore afraid of something than they already are. It is a kind of Chicken Little <br/>\napproach to food. The sky isn&#39;t falling. I don&#39;t even have ceiling in my soup. <br/>\n<br/>\nOh, and it is always okay to leave the stuff that doesn&#39;t appeal to you. The <br/>\ndiscussions on this list are about moving toward a greater understanding of <br/>\nunschooling. Lots of folks have different ways of approaching how they do that. <br/>\nSome offer more help to some people than do others and the alternate. What may <br/>\nnot work for you may have caused someone to snort their tea out with laughter <br/>\nand gotten them to see something they hadn&#39;t seen before. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":471102982,"authorName":"Kimberly Lenora Stansfied","from":"Kimberly Lenora Stansfied &lt;salillumkim@...&gt;","profile":"kimstansfield","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Has Anyone Had This Experience?","postDate":"1291722919","msgId":45400,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY3QzIwOTZFLTRFRTUtNDZCQy1COUE3LTRBQzU5QkRBQUE2NkBnbWFpbC5jb20+","inReplyToHeader":"PDhDRDYzQUYxRTcxRTkzRC0xQUIwLTM3OEQwQFdlYm1haWwtbTExNC5zeXNvcHMuYW9sLmNvbT4=","referencesHeader":"PDM0ODEwNTM4MDE2OTYwMDk4NEB1bmtub3dubXNnaWQ+IDw4Q0Q2M0FGMUU3MUU5M0QtMUFCMC0zNzhEMEBXZWJtYWlsLW0xMTQuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":45399,"nextInTopic":45402,"prevInTime":45399,"nextInTime":45401,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"Kids choosing what to eat based on pantries stocked in fear or personal diet failures is not any choice at all.  These moms seem to still say, I know best-","messageBody":"<div id=\"ygrps-yiv-591846470\">Kids choosing what to eat based on pantries stocked in fear or personal diet failures is not any choice at all.  These moms seem to still say, &quot;I know best- I&#39;ll stock the pantry and keep you from learning about desire, want, enjoyment, control. Nevermind darling, I&#39;ll just adequately describe to you what gas, nausea, acne feel like and I&#39;ll tell you based on my personal experience which foods will do what to your body.&quot;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Dec 6, 2010, at 5:50 PM, Kelly Lovejoy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a>&gt; wrote:<br/>\n<br/>\n&gt; <br/>\n&gt; -----Original Message-----<br/>\n&gt; From: Diane Targovnik &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dianetargovnik@...\">dianetargovnik@...</a>&gt;<br/>\n&gt; <br/>\n&gt; See this is where anxiety meets my checkbook and general thoughts of<br/>\n&gt; food. I just don&#39;t have pringles and kook aid in the house. They are<br/>\n&gt; processed foods and with no redeeming qualities (I assume pringles has<br/>\n&gt; MSG and food dye. Kool aid also with food dye).<br/>\n&gt; -=-=-=-=-<br/>\n&gt; Joy has no redeeming value in your home? Bummer.<br/>\n&gt; -=-=-=-=-=-<br/>\n&gt; When we go out I let<br/>\n&gt; my daughter choose her food and we talk about her choices. But she can<br/>\n&gt; get what she wants.<br/>\n&gt; -=-=-=-=-=-<br/>\n&gt; But her choices are questioned? Must she justify her decisions?<br/>\n&gt; -=-=-=-<br/>\n&gt; <br/>\n&gt; But at home I buy only stuff that is good for our bodies (and yes it<br/>\n&gt; is my definition of &quot;good&quot;). And stuff I feel comfortable with her<br/>\n&gt; eating... I also do this because if there is non-healthy food in the<br/>\n&gt; house I will eat it. And I don&#39;t want to. My two cents<br/>\n&gt; <br/>\n&gt; -=-=-=-<br/>\n&gt; <br/>\n&gt; I&#39;m sorry that you aren&#39;t as strong or powerful as a can of Pringles. Is that what you want for your daughter?<br/>\n&gt; <br/>\n&gt; My unschooled kid can beat up your can of Pringles AND your pitcher of Kool-aid.<br/>\n&gt; <br/>\n&gt; ~Kelly<br/>\n&gt; <br/>\n&gt; Kelly Lovejoy<br/>\n&gt; &quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":248233800,"authorName":"Alix deBohun","from":"Alix deBohun &lt;czarena_unrest@...&gt;","profile":"czarena_unrest","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Has Anyone Had This Experience? - the behavior of parents","postDate":"1291721361","msgId":45399,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwNTc3LjczMTg2LnFtQHdlYjExMjAwNi5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PDYxMTc5My41MDE5MS5xbUB3ZWI4NjIwMy5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PGlkamNmZitmODRtQGVHcm91cHMuY29tPiA8OENENjNCMDc0RjM3MTQwLTFBQjAtMzdCRDFAV2VibWFpbC1tMTE0LnN5c29wcy5hb2wuY29tPiA8QUFOTGtUaW5adTk2dXNWRjlobmpyQ0RXZ0x6c0pXdFhnbzNtY3JxUG56czJ5QG1haWwuZ21haWwuY29tPiA8NzczODMzLjk1Njk2LnFtQHdlYjExMjAwMS5tYWlsLmdxMS55YWhvby5jb20+IDw2MTE3OTMuNTAxOTEucW1Ad2ViODYyMDMubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":45398,"nextInTopic":45400,"prevInTime":45398,"nextInTime":45400,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"i do appreciate your response. yours was full of your perspective of things. I was specifically responding to the messages that said Do not lie to children or","messageBody":"<div id=\"ygrps-yiv-288102632\">i do appreciate your response. yours was full of your perspective of things. I<br/>\nwas specifically responding to the messages that said<br/>\n<br/>\n&quot;Do not lie to children or to us&quot;<br/>\n&quot;Your fear-mongering...&quot;<br/>\n&quot;My unschooled kid can beat up your can of Pringles AND your pitcher of<br/>\nKool-aid.&quot;<br/>\n<br/>\nThese kind of comments are (admittedly in my opinion) not helpful, completely<br/>\nunnecessary and quite rude.<br/>\n<br/>\n<br/>\nI was not trying to say that all of the posts were like what I described. My<br/>\napologies that it came across that way. I was trying to suggest educating rather<br/>\nthan accusing people of lying and being defensive. Which some people ARE doing<br/>\n(and I appreciate it), but others are not.<br/>\n<br/>\n<br/>\nPersonally, I am trying to navigate the food waters myself. Most of the<br/>\nresponses in this discussion have been wonderful.<br/>\n<br/>\n<br/>\nMy favorite from your response that I think sums it up for me<br/>\n<br/>\n&quot;And for each of those people they&#39;ve decided that the fear of those things<br/>\nisn&#39;t as great as their desire to help their children<br/>\n<br/>\nto negotiate the world on their own terms.&quot;<br/>\n<br/>\nThank you for that!<br/>\nMichelle/Czarena<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Schuyler</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Has Anyone Had This Experience? - the behavior of parents","postDate":"1291714712","msgId":45398,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxMTc5My41MDE5MS5xbUB3ZWI4NjIwMy5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDc3MzgzMy45NTY5Ni5xbUB3ZWIxMTIwMDEubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PGlkamNmZitmODRtQGVHcm91cHMuY29tPiA8OENENjNCMDc0RjM3MTQwLTFBQjAtMzdCRDFAV2VibWFpbC1tMTE0LnN5c29wcy5hb2wuY29tPiA8QUFOTGtUaW5adTk2dXNWRjlobmpyQ0RXZ0x6c0pXdFhnbzNtY3JxUG56czJ5QG1haWwuZ21haWwuY29tPiA8NzczODMzLjk1Njk2LnFtQHdlYjExMjAwMS5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":45397,"nextInTopic":45399,"prevInTime":45397,"nextInTime":45399,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"There is a question of relative health benefits. Is stress more or less detrimental to one s health then pringles and koolaid? Stress has been linked to a lot","messageBody":"<div id=\"ygrps-yiv-914606881\">There is a question of relative health benefits. Is stress more or less <br/>\ndetrimental to one&#39;s health then pringles and koolaid? Stress has been linked to <br/>\na lot of poor decision making and quite directly to early death. I&#39;m pretty sure <br/>\nthe jury is out on pringles and koolaid. Red dye number whatever may be a fear, <br/>\nbut it isn&#39;t nearly as awful on your immune system as stress is. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&quot;When someone points out that it&#39;s unhealthy, those parents become defensive <br/>\n&gt;&gt;and accuse them of lying, fear mongering,judging, and the like.&quot;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I don&#39;t think my lifestyle is an unhealthy life. I don&#39;t think the choices I <br/>\nmake and that I afford my children, and that&#39;s a big lot of choices, are ones <br/>\nthat make me feel in the least bit defensive. I can tell you that I have two <br/>\nhealthy children who have a very wide range of food choices. They drink soda and <br/>\nwater and juice and milk and lassis and koolaid and they eat chips, pringles <br/>\namong them, and melba toast and olives and pears and chocolate and broccoli and <br/>\nbread and beef jerky and chicken and pound cake ala Duncan Lovejoy and cabbage <br/>\nand apples and plums and clementines and bananas and, well, and and and. <br/>\n<br/>\nThe truth of what you don&#39;t seem to be reading, which I see written clearly in <br/>\nthe responses, is that limiting a food choice, saying that this is crap food and <br/>\nthis is good food is a great way to create a special and exciting class of <br/>\nfoods. I tend to eat what I&#39;m hungry for. I wanted fish and chips the other day <br/>\nand David and I went to a fish monger and bought lovely haddock and fried it up <br/>\nwith homemade chips (french fries) and had mushy peas as a side. It was <br/>\nwonderful. I thanked David and he said he likes to satisfy my cravings (eyebrows <br/>\nawaggling). Because we do the same with Simon and Linnaea there are often things <br/>\nthat come into our menu suddenly. Risotto is an oft requested food, or samosas <br/>\nor Simon was craving fry ups the last few days, so we got bacon and sausages <br/>\nfrom the local butcher and scrambled eggs and he had lovely homemade bread <br/>\ntoasted with lashings of butter. I asked him yesterday if he wanted us to get <br/>\nhim more of that, but he&#39;s moved on to other desires. Last night they had phad <br/>\nthai, we all had phad thai, but Simon and Linnaea supersized their bowlfuls <br/>\nwhile David and I had more modest portions to accommodate their desires. <br/>\n<br/>\nIf one food is crap and another food is good and you really want the crap what <br/>\ndoes that make you? If one food is crap and another food is good and the crap <br/>\nfood makes you feel better what does that mean? I love potatoes at the moment. <br/>\nIt&#39;s dark and cold here and potatoes make me feel lighter and better. A friend <br/>\njust sent me an NPR thing on chip butties which just spiked my craving for a <br/>\nlovely french fry sandwich. It will be good for lunch today. It isn&#39;t crap, it <br/>\nisn&#39;t nutritionally devoid, it isn&#39;t empty calories, it&#39;s a lovely food that <br/>\nincreases my beta-endorphins. I get happier with potatoes. It&#39;s so cool. <br/>\nPringles are made from potatoes, maybe they do a similar thing? More than that <br/>\nthough, sharing a can of pringles with someone happily and talking about <br/>\nhyperbolic paraboloids will be better for them than denying and degrading their <br/>\ndesire. It will be better for your relationship with them, it will be better for <br/>\ntheir whole self health, it will let the pringles be secondary to the <br/>\nrelationship instead of more powerful than the love and care and nurturing. <br/>\n<br/>\nYou write that &quot;dyes and chemicals in our food is NOT healthy, many think they <br/>\nare toxic even.&quot; And while there is some evidence for detrimental effects of <br/>\nchemicals on the health of people, much of those chemicals come from pollutants <br/>\nas opposed to ones that are directly in the food supply. Mercury in tuna comes <br/>\nto mind, or hormones from large scale meat production, the waste of hormonally <br/>\nmore than robust cattle washing into the water supply. Soy produces <br/>\nphytoestrogens which can screw with your hormonal balance in ways that have been <br/>\nshown to be both positive and negative. I don&#39;t know if pringles do that but <br/>\ntofu can. <br/>\n<br/>\nI bet you ever single person who has chosen to embrace choice in food for their <br/>\nchildren on this list is aware of at least the gist of the findings on sodium <br/>\nbenzoate or similar additives. And for each of those people they&#39;ve decided that <br/>\nthe fear of those things isn&#39;t as great as their desire to help their children <br/>\nto negotiate the world on their own terms. <br/>\n<br/>\nYou wrote &quot;What I&#39;m seeing here is that some parents have chosen to give their <br/>\nchildren free choice over their nutritional intake with little to no <br/>\nexceptions.&quot;  I imagine that there are lots of exceptions in my children&#39;s <br/>\nlives. Availability is an exception. Affordability is an exception. Kraft <br/>\nmacaroni and cheese is a treat reserved for arrivals of gift packages or gift <br/>\nbearing visitors from the U.S. It isn&#39;t readily available in the UK. Maybe with <br/>\nKraft&#39;s owning Cadbury&#39;s now it will give them access to this market, but maybe <br/>\nnot. There are conversations about hunger in our house. About food. I talk a lot <br/>\nand about lots of things. My guess is that they make informed choices about <br/>\ntheir hunger and how to satisfy it rather than free choices. A lot of their <br/>\ninformation will be from experience. Simon loves carrot cake, but he doesn&#39;t <br/>\nlike me to make it very often because it becomes less special, more mundane. He <br/>\nwants the carrot cake to remain a special occasion food. That&#39;s a lot of <br/>\nunderstanding, and it was understanding that he had at 6. If I had dictated to <br/>\nhim his relationship with carrot cake rather than letting him dictate his own <br/>\nterms he would have felt powerless in the face of the all powerful carrot cake. <br/>\nBut there is no rush to carrot cake, there is no carrot cake is the biggest <br/>\nthing in the room. Carrot cake is a pleasure among many. It&#39;s so cool. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&quot;Why the accusations? Why are people being so hateful to each other <br/>\n&gt;&gt;while preaching to be kind to the children? &quot;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Where is the hate? Where is the horribleness? I see people writing about <br/>\nunschooling in response to someone writing about fear. Sometimes it can feel <br/>\nlike someone is being attacked, but if you go back and reread it with your mind <br/>\ntuned to hear kindness in the words of the writers your perspective may change. <br/>\nIt may help if you start with the knowledge that all of these writers are <br/>\nworking to help get the philosophy of unschooling out clearly and precisely. And <br/>\nthey are doing this without recompense, or, at least, without financial <br/>\nrecompense. <br/>\n<br/>\n&quot;To tell someone that they are lying is the opposite of what we are trying to <br/>\ndo <br/>\nwith our children. &quot;<br/>\n<br/>\nI don&#39;t quite know what that means. I have questioned the veracity of what Simon <br/>\nor Linnaea have said. The other day it was about the core temperature of the <br/>\nearth. Simon was sound in his understanding. And it was fun to be proven wrong. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Alix deBohun &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:czarena_unrest@...\">czarena_unrest@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Tuesday, 7 December, 2010 2:28:56<br/>\nSubject: Re: [unschoolingbasics] Re: Has Anyone Had This Experience? - the <br/>\nbehavior of parents<br/>\n<br/>\nWhat I&#39;m seeing here is that some parents have chosen to give their children <br/>\nfree choice over their nutritional intake with little to no exceptions. <br/>\n<br/>\n<br/>\nWhen someone points out that it&#39;s unhealthy, those parents become defensive and <br/>\naccuse them of lying, fear mongering,judging, and the like.<br/>\n  <br/>\nI tell my son that it is better to be wrong than to make up a story. <br/>\n<br/>\nWhy not say yes, I know it&#39;s not the healthiest but I feel it&#39;s important to <br/>\nallow them these choices. And expound on why! <br/>\n<br/>\n<br/>\nI DO understand that many feel that you can damage a child by pumping them full <br/>\nof nutritional &quot;judgements&quot;, the same way you can harm them by doing the same <br/>\nwith religion, morality, sexuality, social norms, etc<br/>\n<br/>\ndyes and chemicals in our food is NOT healthy, many think they are toxic even. <br/>\nMany don&#39;t believe it to be so, or don&#39;t care.  But don&#39;t call someone&#39;s opinion <br/>\n<br/>\n- based on thier research a lie just becauise it goes against your practice. <br/>\n<br/>\n<br/>\nTo tell someone that they are lying is the opposite of what we are trying to do <br/>\nwith our children. <br/>\n<br/>\n<br/>\nWhy the accusations? Why are people being so hateful to each other while <br/>\npreaching to be kind to the children?  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":263488403,"authorName":"hmbpie","from":"&quot;hmbpie&quot; &lt;heatherpie@...&gt;","profile":"hmbpie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Has Anyone Had This Experience?","postDate":"1291698531","msgId":45396,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlka2ZoMytuaDE0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDRDYzQjA3NEYzNzE0MC0xQUIwLTM3QkQxQFdlYm1haWwtbTExNC5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":45395,"nextInTopic":45397,"prevInTime":45395,"nextInTime":45397,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"=I m willing to bet hard, cold cash that a year-long diet of only Pringles and Kool-aid would not end in death.= I can at least attest to death NOT occurring","messageBody":"<div id=\"ygrps-yiv-942084310\">=I&#39;m willing to bet hard, cold cash that a year-long diet of only Pringles and Kool-aid would not end in death.=<br/>\n<br/>\nI can at least attest to death NOT occurring after three days of Pringles and kool-aide. ;) I can also attest that since my son was given freedom to chose what he wanted to eat he has moved on. He is still eating pringles just not exclusively.  As we speak he is eating tuna and crackers with a kool aide jammer watching Animaniacs.  He is quite content and so am I.  It took a lot of hard work on my part, a lot of letting go to get to this place of peace with food choices (and I am still working hard).  I will say we are all happier because of it.  Even when I am in the closet sitting on my hands so I don&#39;t unleash my negative food opinions on him I am happier because I know when he is my age he will eat because he is hungry and won&#39;t feel guilty about what he eats like I do.  If I do it right.  I want him to be mightier than a can of pringles.<br/>\n<br/>\nI wonder if leading by example is a better way to go instead of reading labels and analyzing food. I don&#39;t eat meat and rarely eat dairy or eggs so, it&#39;s lots of fruit, veggies and grains for me.  My son is very curious about this and asks lots of questions.  He sees that my food looks different from his food.  Right now I get a &quot;What&#39;s that?&quot;  Maybe one day I&#39;ll get a &quot;Can I try that?&quot; If he decides to try a carrot one day does he need to know that is has beta carotene in it and the benefits of eating beta carotene if he only wants to try the carrot?  Can&#39;t he just eat it and like it or dislike it?  Does he need a whole lesson on carrots?<br/>\n<br/>\nI also read labels and books about food.  Maybe one day he&#39;ll ask why I do that and I can tell him.  Maybe he&#39;ll decide when he is older to do the same since he saw me do it his whole life.  Maybe he won&#39;t. If he can eat a bowl of coco krispies because he wanted something sweet and it doesn&#39;t keep him up all night with guilt when he is an adult then I think I will have done a good thing for him. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Kelly Lovejoy &lt;kbcdlovejo@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Pringles and Kool-aid aren&#39;t poisonous. They are whirred & dried potatoes and colored sugar water.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Don&#39;t lie to children or to us. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I&#39;m willing to bet hard, cold cash that a year-long diet of only Pringles and Kool-aid would not end in death. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; No one&#39;s child is &quot;feasting on nutrient void junk.&quot; Parents here have children who make their own dietary choices, and what we&#39;ve found is that they are very thoughtful about what they eat. If they *do* happen to chose a can of Pringles or a HoHo, they enJOY them. No guilt. No worry. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Your fear-mongering will result in more damage than the occasional bag of Lay&#39;s and a Dr Pepper.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  ~Kelly<br/>\n&gt; <br/>\n&gt; Kelly Lovejoy<br/>\n&gt; &quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; -----Original Message-----<br/>\n&gt; From: maharaashlie &lt;mahara@...&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; This is crazy stuff. Really, if you lived in the wild and gave your child free <br/>\n&gt; range choice for her diet, wouldn&#39;t you stop her if she reached for a poisonous <br/>\n&gt; berry or mushroom? It is one thing to offer free choice and it is another to <br/>\n&gt; avoid important information around what is healthy for the human body. Allowing <br/>\n&gt; your child to feast on nutrient void junk filled with toxic chemicals is to me <br/>\n&gt; the same as letting her eat poison. It just will take a bit longer to kill her. <br/>\n&gt; Our children need to learn about the dangers of eating toxic chemical laden <br/>\n&gt; foods, foods sprayed with pesticides, animal products pumped with hormones,etc. <br/>\n&gt; and foods genetically modified. Until they can read it for themselves labels <br/>\n&gt; should be a part of this free choice plan and education on what the ingredients <br/>\n&gt; are and where they come from, etc. I find my daughter makes very healthy choices <br/>\n&gt; for herself based on the facts that she understands about the ingredients in the <br/>\n&gt; foods. She does make exceptions and eats<br/>\n&gt;   items that are not the healthiest choice sometimes, but with the knowledge of <br/>\n&gt; exactly what she is eating, she tends to keep unhealthy choices to a minimum. <br/>\n&gt; She generally opts for very healthy foods. Our home is stocked with mostly <br/>\n&gt; healthy foods and when we shop, if she picks up an item that she wants to try I <br/>\n&gt; have her read the ingredients. Mostly she makes very wise choices to keep her <br/>\n&gt; body healthy. <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":466539614,"authorName":"maharaashlie","from":"&quot;maharaashlie&quot; &lt;mahara@...&gt;","profile":"maharaashlie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Has Anyone Had This Experience?","postDate":"1291691091","msgId":45395,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlkazg4aitrNWdtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDRDYzQjA3NEYzNzE0MC0xQUIwLTM3QkQxQFdlYm1haWwtbTExNC5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":45394,"nextInTopic":45396,"prevInTime":45394,"nextInTime":45396,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"I was not simply discussing Pringles and Kool aid, however anyone eating only those two items for a year would not be a healthy person. That would never be the","messageBody":"<div id=\"ygrps-yiv-1254407720\">I was not simply discussing Pringles and Kool aid, however anyone eating only those two items for a year would not be a healthy person. That would never be the goal I am sure of anyone in this group. I understand fostering individualism and inner knowing. I am not arguing with those concepts. I bring to the table something that seems to be going ignored here. The truth of what IS in some of our foods that so many people do not want to notice as hazardous to human health. And yes, How do we care for our children and allow them the freedom to eat what we know is simply toxic? This is not &quot;fear-mongering&quot;! As I said, If you do not agree with this Look it up. Aren&#39;t we all about natural here when it comes to growth of the human mind, etc? I DON&#39;T UNDERSTAND WHY IT DOESN&#39;T GO HAND IN HAND. <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Kelly Lovejoy &lt;kbcdlovejo@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Pringles and Kool-aid aren&#39;t poisonous. They are whirred & dried potatoes and colored sugar water.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Don&#39;t lie to children or to us. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I&#39;m willing to bet hard, cold cash that a year-long diet of only Pringles and Kool-aid would not end in death. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; No one&#39;s child is &quot;feasting on nutrient void junk.&quot; Parents here have children who make their own dietary choices, and what we&#39;ve found is that they are very thoughtful about what they eat. If they *do* happen to chose a can of Pringles or a HoHo, they enJOY them. No guilt. No worry. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Your fear-mongering will result in more damage than the occasional bag of Lay&#39;s and a Dr Pepper.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  ~Kelly<br/>\n&gt; <br/>\n&gt; Kelly Lovejoy<br/>\n&gt; &quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; -----Original Message-----<br/>\n&gt; From: maharaashlie &lt;mahara@...&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; This is crazy stuff. Really, if you lived in the wild and gave your child free <br/>\n&gt; range choice for her diet, wouldn&#39;t you stop her if she reached for a poisonous <br/>\n&gt; berry or mushroom? It is one thing to offer free choice and it is another to <br/>\n&gt; avoid important information around what is healthy for the human body. Allowing <br/>\n&gt; your child to feast on nutrient void junk filled with toxic chemicals is to me <br/>\n&gt; the same as letting her eat poison. It just will take a bit longer to kill her. <br/>\n&gt; Our children need to learn about the dangers of eating toxic chemical laden <br/>\n&gt; foods, foods sprayed with pesticides, animal products pumped with hormones,etc. <br/>\n&gt; and foods genetically modified. Until they can read it for themselves labels <br/>\n&gt; should be a part of this free choice plan and education on what the ingredients <br/>\n&gt; are and where they come from, etc. I find my daughter makes very healthy choices <br/>\n&gt; for herself based on the facts that she understands about the ingredients in the <br/>\n&gt; foods. She does make exceptions and eats<br/>\n&gt;   items that are not the healthiest choice sometimes, but with the knowledge of <br/>\n&gt; exactly what she is eating, she tends to keep unhealthy choices to a minimum. <br/>\n&gt; She generally opts for very healthy foods. Our home is stocked with mostly <br/>\n&gt; healthy foods and when we shop, if she picks up an item that she wants to try I <br/>\n&gt; have her read the ingredients. Mostly she makes very wise choices to keep her <br/>\n&gt; body healthy. <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":248233800,"authorName":"Alix deBohun","from":"Alix deBohun &lt;czarena_unrest@...&gt;","profile":"czarena_unrest","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Has Anyone Had This Experience? - the behavior of parents","postDate":"1291688936","msgId":45397,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3MzgzMy45NTY5Ni5xbUB3ZWIxMTIwMDEubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PEFBTkxrVGluWnU5NnVzVkY5aG5qckNEV2dMenNKV3RYZ28zbWNycVBuenMyeUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGlkamNmZitmODRtQGVHcm91cHMuY29tPiA8OENENjNCMDc0RjM3MTQwLTFBQjAtMzdCRDFAV2VibWFpbC1tMTE0LnN5c29wcy5hb2wuY29tPiA8QUFOTGtUaW5adTk2dXNWRjlobmpyQ0RXZ0x6c0pXdFhnbzNtY3JxUG56czJ5QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":45396,"nextInTopic":45398,"prevInTime":45396,"nextInTime":45398,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"What I m seeing here is that some parents have chosen to give their children free choice over their nutritional intake with little to no exceptions. When","messageBody":"<div id=\"ygrps-yiv-2079770416\">What I&#39;m seeing here is that some parents have chosen to give their children <br/>\nfree choice over their nutritional intake with little to no exceptions. <br/>\n<br/>\n<br/>\nWhen someone points out that it&#39;s unhealthy, those parents become defensive and <br/>\naccuse them of lying, fear mongering,judging, and the like.<br/>\n  <br/>\nI tell my son that it is better to be wrong than to make up a story. <br/>\n<br/>\nWhy not say yes, I know it&#39;s not the healthiest but I feel it&#39;s important to <br/>\nallow them these choices. And expound on why! <br/>\n<br/>\n<br/>\nI DO understand that many feel that you can damage a child by pumping them full <br/>\nof nutritional &quot;judgements&quot;, the same way you can harm them by doing the same <br/>\nwith religion, morality, sexuality, social norms, etc<br/>\n<br/>\ndyes and chemicals in our food is NOT healthy, many think they are toxic even. <br/>\nMany don&#39;t believe it to be so, or don&#39;t care.  But don&#39;t call someone&#39;s opinion <br/>\n- based on thier research a lie just becauise it goes against your practice. <br/>\n<br/>\n<br/>\nTo tell someone that they are lying is the opposite of what we are trying to do <br/>\nwith our children. <br/>\n<br/>\n<br/>\nWhy the accusations? Why are people being so hateful to each other while <br/>\npreaching to be kind to the children?  <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":196677035,"authorName":"Tina Tarbutton","from":"Tina Tarbutton &lt;tina.tarbutton@...&gt;","profile":"dravensmomhome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Has Anyone Had This Experience?","postDate":"1291680264","msgId":45394,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluWnU5NnVzVkY5aG5qckNEV2dMenNKV3RYZ28zbWNycVBuenMyeUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDhDRDYzQjA3NEYzNzE0MC0xQUIwLTM3QkQxQFdlYm1haWwtbTExNC5zeXNvcHMuYW9sLmNvbT4=","referencesHeader":"PGlkamNmZitmODRtQGVHcm91cHMuY29tPgk8OENENjNCMDc0RjM3MTQwLTFBQjAtMzdCRDFAV2VibWFpbC1tMTE0LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":45392,"nextInTopic":45395,"prevInTime":45393,"nextInTime":45395,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"My son was a very picky eater as a toddler.  He lived on chicken nuggets and french fries for at least 2 years.  I didn t know about radical unschooling back","messageBody":"<div id=\"ygrps-yiv-2069444420\">My son was a very picky eater as a toddler.  He lived on chicken nuggets and<br/>\nfrench fries for at least 2 years.  I didn&#39;t know about radical unschooling<br/>\nback then, and my mother insisted that I make him eat what we were eating<br/>\nfor dinner (I lived with her at the time).  He didn&#39;t eat dinner for almost<br/>\na month before I decided that wasn&#39;t going to work.  Even during that time<br/>\nI&#39;d give him chicken nuggets and french fries for breakfast and lunch, and<br/>\nadd veggies and other stuff to his plate which he would occasionally eat,<br/>\nbut not always.<br/>\n<br/>\nAfterwards he refused to try new foods for almost 3 years.<br/>\n<br/>\nNow he&#39;s 10 y/o.  He still loves chicken nuggets and french fries, but<br/>\nprefers homemade over mcdonalds or frozen ones.  He loves going into the<br/>\ngrocery store and picking out new foods to try.  He willingly tries almost<br/>\neverything I cook.  One of his favorite cooked veggies is brussel sprouts,<br/>\nanother is spinach.  I&#39;m allergic to spinach (will break out in a rash if I<br/>\ncome in contact with anything that has contacted spinach) and therefore he<br/>\nonly gets to have it when he cooks it himself or someone else is around to<br/>\ncook it, so it&#39;s a special treat for him.<br/>\n<br/>\nThe other day we were going to a movie, which was financially a stretch for<br/>\nus. We discussed beforehand that we wouldn&#39;t be able to buy much at the<br/>\nconcession stand.  He asked if we could buy him dibs (the chocolate covered<br/>\nice cream bits).  They&#39;re around $7 at the theatre for a tiny box of them,<br/>\nso I said we couldn&#39;t buy them there, but would  get some after the movie at<br/>\nthe grocery store.  He instead asked if he could take a bag of banana chips<br/>\nand some baby carrots into the movie with him, because he didn&#39;t want<br/>\npopcorn or candy.<br/>\n<br/>\nThe other day he made a banana and Hershey kisses sandwich for lunch.<br/>\n<br/>\nHe also went through a pringles phase, and I found them on sale at CVS for<br/>\nunder a dollar a can.  I think I bought 20 cans.  He went through 10 of them<br/>\nin a week, but it&#39;s been a few months now and we still have some unopened<br/>\ncans in the pantry.<br/>\n<br/>\nHe&#39;s a tall skinny kid who eats almost non stop throughout the day.  His<br/>\nchoices are wide and varied over the course of each week, however he tends<br/>\nto obsess on certian foods on any given day.<br/>\n<br/>\nHe&#39;s learned to listen to his body.  When he had some urinary problems after<br/>\ndrinking nothing but soda for weeks, we discussed that too much soda could<br/>\nbe part of the problem.  I didn&#39;t tell him he had to stop drinking soda, or<br/>\ntell him how much water he had to drink, but the next day he made a line in<br/>\nthe fridge of 2 bottles of water, followed by a can of soda, two more<br/>\nbottles of water, followed by a can of soda, etc. etc.  He asked everyone to<br/>\nleave those drinks alone because it was his way of making sure he drank<br/>\nenough water between sodas.  He no longer has to line them up in the fridge,<br/>\nbut when I offer to get him a drink he sometimes asks for water, sometimes<br/>\nfor soda, sometimes juice, sometimes tea.<br/>\n<br/>\nThere are no struggles over food here anymore.  Tonight we all decided on<br/>\ntaco&#39;s for dinner, then I realized we didn&#39;t have any ground beef.  I let<br/>\nhim know I was making them with chicken instead and he was hesitant, but<br/>\ntried them without an argument and said they were great.  If he wouldn&#39;t<br/>\nhave liked them I would have cooked him something else, or let him have a<br/>\n&quot;buffet&quot; dinner of various snacks.<br/>\n<br/>\nTina<br/>\n<blockquote><span title=\"qreply\"> On Mon, Dec 6, 2010 at 6:00 PM, Kelly Lovejoy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Pringles and Kool-aid aren&#39;t poisonous. They are whirred & dried potatoes<br/>\n&gt; and colored sugar water.<br/>\n&gt;<br/>\n&gt; Don&#39;t lie to children or to us.<br/>\n&gt;<br/>\n&gt; I&#39;m willing to bet hard, cold cash that a year-long diet of only Pringles<br/>\n&gt; and Kool-aid would not end in death.<br/>\n&gt;<br/>\n&gt; No one&#39;s child is &quot;feasting on nutrient void junk.&quot; Parents here have<br/>\n&gt; children who make their own dietary choices, and what we&#39;ve found is that<br/>\n&gt; they are very thoughtful about what they eat. If they *do* happen to chose a<br/>\n&gt; can of Pringles or a HoHo, they enJOY them. No guilt. No worry.<br/>\n&gt;<br/>\n&gt; Your fear-mongering will result in more damage than the occasional bag of<br/>\n&gt; Lay&#39;s and a Dr Pepper.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ~Kelly<br/>\n&gt;<br/>\n&gt; Kelly Lovejoy<br/>\n&gt; &quot;There is no single effort more radical in its potential for saving the<br/>\n&gt; world than a transformation of the way we raise our children.&quot; Marianne<br/>\n&gt; Williamson<br/>\n&gt;<br/>\n&gt; -----Original Message-----<br/>\n&gt; From: maharaashlie &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mahara@...\">mahara@...</a> &lt;mahara%40comcast.net&gt;&gt;<br/>\n&gt;<br/>\n&gt; This is crazy stuff. Really, if you lived in the wild and gave your child<br/>\n&gt; free<br/>\n&gt; range choice for her diet, wouldn&#39;t you stop her if she reached for a<br/>\n&gt; poisonous<br/>\n&gt; berry or mushroom? It is one thing to offer free choice and it is another<br/>\n&gt; to<br/>\n&gt; avoid important information around what is healthy for the human body.<br/>\n&gt; Allowing<br/>\n&gt; your child to feast on nutrient void junk filled with toxic chemicals is to<br/>\n&gt; me<br/>\n&gt; the same as letting her eat poison. It just will take a bit longer to kill<br/>\n&gt; her.<br/>\n&gt; Our children need to learn about the dangers of eating toxic chemical laden<br/>\n&gt;<br/>\n&gt; foods, foods sprayed with pesticides, animal products pumped with<br/>\n&gt; hormones,etc.<br/>\n&gt; and foods genetically modified. Until they can read it for themselves<br/>\n&gt; labels<br/>\n&gt; should be a part of this free choice plan and education on what the<br/>\n&gt; ingredients<br/>\n&gt; are and where they come from, etc. I find my daughter makes very healthy<br/>\n&gt; choices<br/>\n&gt; for herself based on the facts that she understands about the ingredients<br/>\n&gt; in the<br/>\n&gt; foods. She does make exceptions and eats<br/>\n&gt; items that are not the healthiest choice sometimes, but with the knowledge<br/>\n&gt; of<br/>\n&gt; exactly what she is eating, she tends to keep unhealthy choices to a<br/>\n&gt; minimum.<br/>\n&gt; She generally opts for very healthy foods. Our home is stocked with mostly<br/>\n&gt; healthy foods and when we shop, if she picks up an item that she wants to<br/>\n&gt; try I<br/>\n&gt; have her read the ingredients. Mostly she makes very wise choices to keep<br/>\n&gt; her<br/>\n&gt; body healthy.<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Has Anyone Had This Experience?","postDate":"1291676408","msgId":45392,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRDYzQjA3NEYzNzE0MC0xQUIwLTM3QkQxQFdlYm1haWwtbTExNC5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PGlkamNmZitmODRtQGVHcm91cHMuY29tPg==","referencesHeader":"PGlkamNmZitmODRtQGVHcm91cHMuY29tPg=="},"prevInTopic":45391,"nextInTopic":45394,"prevInTime":45391,"nextInTime":45393,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"Pringles and Kool-aid aren t poisonous. They are whirred & dried potatoes and colored sugar water. Don t lie to children or to us. I m willing to bet hard,","messageBody":"<div id=\"ygrps-yiv-1871628535\">Pringles and Kool-aid aren&#39;t poisonous. They are whirred & dried potatoes and colored sugar water.<br/>\n<br/>\n<br/>\nDon&#39;t lie to children or to us. <br/>\n<br/>\n<br/>\nI&#39;m willing to bet hard, cold cash that a year-long diet of only Pringles and Kool-aid would not end in death. <br/>\n<br/>\n<br/>\nNo one&#39;s child is &quot;feasting on nutrient void junk.&quot; Parents here have children who make their own dietary choices, and what we&#39;ve found is that they are very thoughtful about what they eat. If they *do* happen to chose a can of Pringles or a HoHo, they enJOY them. No guilt. No worry. <br/>\n<br/>\n<br/>\nYour fear-mongering will result in more damage than the occasional bag of Lay&#39;s and a Dr Pepper.<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: maharaashlie &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mahara@...\">mahara@...</a>&gt;<br/>\n<br/>\n<br/>\nThis is crazy stuff. Really, if you lived in the wild and gave your child free <br/>\nrange choice for her diet, wouldn&#39;t you stop her if she reached for a poisonous <br/>\nberry or mushroom? It is one thing to offer free choice and it is another to <br/>\navoid important information around what is healthy for the human body. Allowing <br/>\nyour child to feast on nutrient void junk filled with toxic chemicals is to me <br/>\nthe same as letting her eat poison. It just will take a bit longer to kill her. <br/>\nOur children need to learn about the dangers of eating toxic chemical laden <br/>\nfoods, foods sprayed with pesticides, animal products pumped with hormones,etc. <br/>\nand foods genetically modified. Until they can read it for themselves labels <br/>\nshould be a part of this free choice plan and education on what the ingredients <br/>\nare and where they come from, etc. I find my daughter makes very healthy choices <br/>\nfor herself based on the facts that she understands about the ingredients in the <br/>\nfoods. She does make exceptions and eats<br/>\n  items that are not the healthiest choice sometimes, but with the knowledge of <br/>\nexactly what she is eating, she tends to keep unhealthy choices to a minimum. <br/>\nShe generally opts for very healthy foods. Our home is stocked with mostly <br/>\nhealthy foods and when we shop, if she picks up an item that she wants to try I <br/>\nhave her read the ingredients. Mostly she makes very wise choices to keep her <br/>\nbody healthy. <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":9543528,"authorName":"The Coffee Goddess","from":"The Coffee Goddess &lt;hoffmanwilson@...&gt;","profile":"hoffmanwilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Has Anyone Had This Experience?","postDate":"1291676372","msgId":45391,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1MDQ2My4xOTgyMy5xbUB3ZWIxMTMyMDQubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDhDRDYzQUY3REM1QTFDOS0xQUIwLTM3OUQwQFdlYm1haWwtbTExNC5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":45390,"nextInTopic":45392,"prevInTime":45390,"nextInTime":45392,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"... It s not weak to eat something you enjoy, no matter what the nutritional value. I wish this were facebook and I could just click the like button! In","messageBody":"<div id=\"ygrps-yiv-1252802051\"><blockquote><span title=\"ireply\">&gt;&gt;It&#39;s obviously December. A lot of anxiety about food and Santa.<br/>\n<br/>\n<br/>\n </span></blockquote>It&#39;s not &quot;weak&quot; to eat something you enjoy, no matter what the nutritional value.&gt;&gt;<br/>\n<br/>\nI wish this were facebook and I could just click the &quot;like&quot; button!<br/>\n<br/>\nIn the back seat of the car this morning, my 12 yo was helping my 2 yo with a package of m n m&#39;s. She ate what she wanted, and then the next handfull he offered her, she said &quot;No, Thanks!&quot; <br/>\n<br/>\n&quot;Junk&quot; will not kill her. It might just make her aware of her own body, and able to politely state it to her brother ;) <br/>\n<br/>\nDana Ellis<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Has Anyone Had This Experience?","postDate":"1291675990","msgId":45390,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRDYzQUY3REM1QTFDOS0xQUIwLTM3OUQwQFdlYm1haWwtbTExNC5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PGlkajd2MStuNzk2QGVHcm91cHMuY29tPg==","referencesHeader":"PGlkajd2MStuNzk2QGVHcm91cHMuY29tPg=="},"prevInTopic":45389,"nextInTopic":45391,"prevInTime":45389,"nextInTime":45391,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"It s obviously December. A lot of anxiety about food and Santa. It s not weak to eat something you enjoy, no matter what the nutritional value. ~Kelly Kelly","messageBody":"<div id=\"ygrps-yiv-1444985455\">It&#39;s obviously December. A lot of anxiety about food and Santa.<br/>\n<br/>\n<br/>\nIt&#39;s not &quot;weak&quot; to eat something you enjoy, no matter what the nutritional value.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Diane &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dianetargovnik@...\">dianetargovnik@...</a>&gt;<br/>\n<br/>\n<br/>\nI do think there can be a happy balance that doesn&#39;t include buying pringles <br/>\n(which are expensive! $3 for a can on sale is a lot more then ten cents an <br/>\nhour). We talk about why we don&#39;t have some foods in the house. We talk. We <br/>\ntalk. We talk. <br/>\nMy daughter and I eat treats together and talk about how food affects us. Both <br/>\nthe good and bad food.  When we are out she decides the food and shares with me <br/>\nif she is eating &quot;crappy&quot; food. We talk about it. We joke about it. She doesn&#39;t <br/>\nhide her choices from me and I am weak too and show her that I too eat crappy <br/>\nfood.    I think there is more than one ru path here to walk down... If this was <br/>\n20,000 years ago I would let her eat what she wanted. But it&#39;s not. And I am <br/>\nhere to help guide<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Has Anyone Had This Experience?","postDate":"1291675831","msgId":45389,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRDYzQUYxRTcxRTkzRC0xQUIwLTM3OEQwQFdlYm1haWwtbTExNC5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PDM0ODEwNTM4MDE2OTYwMDk4NEB1bmtub3dubXNnaWQ+","referencesHeader":"PDM0ODEwNTM4MDE2OTYwMDk4NEB1bmtub3dubXNnaWQ+"},"prevInTopic":45388,"nextInTopic":45390,"prevInTime":45388,"nextInTime":45390,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"... From: Diane Targovnik  See this is where anxiety meets my checkbook and general thoughts of food. I just don t have pringles and","messageBody":"<div id=\"ygrps-yiv-783040908\">-----Original Message-----<br/>\nFrom: Diane Targovnik &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dianetargovnik@...\">dianetargovnik@...</a>&gt;<br/>\n<br/>\n<br/>\nSee this is where anxiety meets my checkbook and general thoughts of<br/>\nfood. I just don&#39;t have pringles and kook aid in the house. They are<br/>\nprocessed foods and with no redeeming qualities (I assume pringles has<br/>\nMSG and food dye. Kool aid also with food dye).<br/>\n-=-=-=-=-<br/>\nJoy has no redeeming value in your home? Bummer.<br/>\n-=-=-=-=-=-<br/>\n When we go out I let<br/>\nmy daughter choose her food and we talk about her choices. But she can<br/>\nget what she wants.<br/>\n-=-=-=-=-=-<br/>\nBut her choices are questioned? Must she justify her decisions?<br/>\n-=-=-=-<br/>\n<br/>\nBut at home I buy only stuff that is good for our bodies (and yes it<br/>\nis my definition of &quot;good&quot;). And stuff I feel comfortable with her<br/>\neating... I also do this because if there is non-healthy food in the<br/>\nhouse I will eat it. And I don&#39;t want to. My two cents<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nI&#39;m sorry that you aren&#39;t as strong or powerful as a can of Pringles. Is that what you want for your daughter?<br/>\n<br/>\n<br/>\nMy unschooled kid can beat up your can of Pringles AND your pitcher of Kool-aid.<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Has Anyone Had This Experience?","postDate":"1291672055","msgId":45388,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxODY3Ni44NjAxMC5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGlkajd2MStuNzk2QGVHcm91cHMuY29tPg==","referencesHeader":"PGlkajd2MStuNzk2QGVHcm91cHMuY29tPg=="},"prevInTopic":45387,"nextInTopic":45389,"prevInTime":45387,"nextInTime":45389,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":" Where you live mustbe really expensive because","messageBody":"<div id=\"ygrps-yiv-1283121595\">&lt;&lt;&lt;&quot;She doesn&#39;t hide her choices from me and I am weak too and show her that I <br/>\ntoo eat crappy food.&quot;&gt;&gt;&gt;&gt;<br/>\n<br/>\nWhere you live mustbe really expensive because prigles are a buck fifty around <br/>\nhere. I buy them all the time for my husband.<br/>\nYou daughter may not hide her food choices from you but she may feel guilty <br/>\nabout eating &quot;crappy&quot; food.<br/>\nFeeling guilty about eating somethingyouenjoy IS NOT healthy.<br/>\nI am going to go bake some browines with my 4 year old. I bvought two different <br/>\nkid of boxed brownies to try out ( one is Ghirardelli). That is something she <br/>\nahs been wating to do for a while. We just got the perfect brownie pan ( the <br/>\nones that sell on TV) that she so wanted.<br/>\nI don;t want her to feel guilty about eating them. I want her to have joy and <br/>\nenjoy them. I really don&#39;t care for brownies, maybe if they are made from <br/>\nscratch with lots of nuts ( she does not like nuts).<br/>\nI would take away from her joy to call her it eating &quot;crappy&quot; food.<br/>\nI think it is a lot healthier and creates a much healthier relationship with <br/>\nfood if we just call it food. No baggage attached!<br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Has Anyone Had This Experience?","postDate":"1291670842","msgId":45387,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVCQkI1MzBBLTg5QTktNDI4MC1BOEFFLUUyNzE2QTUzRUYxOEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGlkamNmZitmODRtQGVHcm91cHMuY29tPg==","referencesHeader":"PGlkamNmZitmODRtQGVHcm91cHMuY29tPg=="},"prevInTopic":45386,"nextInTopic":45388,"prevInTime":45386,"nextInTime":45388,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"... Food is not Drano. As someone recently said, Food is food. Kids can learn to listen to their bodies if voices aren t getting in the way telling them what","messageBody":"<div id=\"ygrps-yiv-128188344\">On Dec 6, 2010, at 2:10 PM, maharaashlie wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This is crazy stuff. Really, if you lived in the wild and gave your  <br/>\n&gt; child free range choice for her diet, wouldn&#39;t you stop her if she  <br/>\n&gt; reached for a poisonous berry or mushroom?<br/>\n<br/>\n </span></blockquote>Food is not Drano.<br/>\n<br/>\nAs someone recently said, Food is food.<br/>\n<br/>\nKids can learn to listen to their bodies if voices aren&#39;t getting in  <br/>\nthe way telling them what they&#39;re feeling and what&#39;s the best way to  <br/>\nfeel. They won&#39;t always make the choices mom would make for them.<br/>\n<br/>\nThis list is about helping kids explore and figure out what&#39;s right  <br/>\nfor their unique selves. It&#39;s about being their helpmate, offering  <br/>\ninformation and assistance but in a way that&#39;s without guilty strings.  <br/>\nIt&#39;s information for them to turn over, to use, to set aside until  <br/>\nthey want to use it.<br/>\n<br/>\nFor those that aren&#39;t comfortable with that, this list can&#39;t be much  <br/>\nhelp. No, this list will choose to not be much help!<br/>\n<br/>\nThe list is about joyful living, putting the relationship first and  <br/>\nthen figuring out how to fit everything else around that. There are  <br/>\nways to help kids be healthy eaters without control and without  <br/>\nbombarding them with the latest information about how bad such and  <br/>\nsuch is.<br/>\n<br/>\nFor those who want to know, the answers are only a question away :-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Has Anyone Had This Experience?","postDate":"1291670529","msgId":45386,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlkams2MStxYjE4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlkamNmZitmODRtQGVHcm91cHMuY29tPg=="},"prevInTopic":45385,"nextInTopic":45387,"prevInTime":45385,"nextInTime":45387,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"... Giving information can be helpful... but only if other people take it in, accept it. Expressing an opinion strongly, even to a child, doesn t guarantee","messageBody":"<div id=\"ygrps-yiv-1759153781\">&quot;maharaashlie&quot; &lt;mahara@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; It is one thing to offer free choice and it is another to avoid important information around what is healthy for the human body. *****************<br/>\n<br/>\n </span></blockquote>Giving information can be helpful... but only if other people take it in, accept it. Expressing an opinion strongly, even to a child, doesn&#39;t guarantee your child will come to agree with your opinion, however, even if they can parrot it back to your face. <br/>\n<br/>\nIts not a case of either-or: either tell your child all the evils of processed foods or poison them. Given access to lots of home-made foods *and* processed foods, kids don&#39;t automatically only pick processed foods - but they won&#39;t automatically only pick home-made, either. They&#39;ll listen to their bodies and make decisions. <br/>\n<br/>\nIt Sounds nuts, I know! We&#39;re given sooooooo much misinformation about the way children learn that it sounds unreasonable to say that kids can learn the difference between nutritionally dense foods and foods that are mostly fluff and preservatives with very little parental input. And yet unschooling kids who have been given lots of choices and *some* information (mostly on request) eat when they&#39;re hungry and make thoughful decisions about what to eat. <br/>\n<br/>\nIts a mindbending assertion - I&#39;ve been there. I thought it sounded totally crazy when I first started learning about radical unschooling -  you mean you let your kids eat Whatever they Want? Because I&#39;d been sold that same old bill of goods that kids only learn what&#39;s right via teaching. <br/>\n<br/>\nIt helped me a whole lot to read lots of stories of unschooling kids making choices about food. Those stories gave me confidence to approach food and eating from the same philosophical perspective I pretty easily brought to math and science and art, so I&#39;ll toss out a page with a lot of links so that other people can read too:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/food\">http://sandradodd.com/food</a><br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Has Anyone Had This Experience?","postDate":"1291670304","msgId":45385,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIzNTdCOUEzLUY4NjEtNDBBNy04Q0FELThGNzUwMjUxRTA5N0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGlkamhxZCtpdjVmQGVHcm91cHMuY29tPg==","referencesHeader":"PGlkamhxZCtpdjVmQGVHcm91cHMuY29tPg=="},"prevInTopic":45384,"nextInTopic":45386,"prevInTime":45384,"nextInTime":45386,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"... Then this list isn t going to be much help to you. Food is not poison though many people make it out to be like that. And there are ways to help kids","messageBody":"<div id=\"ygrps-yiv-1597406255\">On Dec 6, 2010, at 3:41 PM, Diane wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Thank you. Thank you. Thank you. You said this much clearer than I  <br/>\n&gt; did.<br/>\n<br/>\n </span></blockquote>Then this list isn&#39;t going to be much help to you.<br/>\n<br/>\nFood is not poison though many people make it out to be like that. And  <br/>\nthere are ways to help kids explore and find what&#39;s a healthy balance  <br/>\nfor their own bodies without treating some foods as poison.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Has Anyone Had This Experience?","postDate":"1291669154","msgId":45383,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4M0JCNDQ2LTlGMkEtNDIzRC04QUI3LUREMUY1RDI2MDZDMEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGlkajd2MStuNzk2QGVHcm91cHMuY29tPg==","referencesHeader":"PGlkajd2MStuNzk2QGVHcm91cHMuY29tPg=="},"prevInTopic":45382,"nextInTopic":45384,"prevInTime":45382,"nextInTime":45384,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"... If a child really wants Pringles, from the child s point of view no Pringles is not a balance. It s someone else deciding they can t have Pringles. If you","messageBody":"<div id=\"ygrps-yiv-1696093679\">On Dec 6, 2010, at 12:53 PM, Diane wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I do think there can be a happy balance that doesn&#39;t include buying  <br/>\n&gt; pringles<br/>\n<br/>\n </span></blockquote>If a child really wants Pringles, from the child&#39;s point of view no  <br/>\nPringles is not a balance. It&#39;s someone else deciding they can&#39;t have  <br/>\nPringles.<br/>\n<br/>\nIf you want to control Pringles and other foods you feel are  <br/>\nunhealthy, you&#39;re mixing other ingredients into radical unschooling  <br/>\nand won&#39;t get the same effect.<br/>\n<br/>\nMaybe you&#39;ll feel better about what you&#39;re doing, but your better  <br/>\nfeelings won&#39;t give you the same effect as radical unschooling. Just  <br/>\nbecause you feel better about that practice, doesn&#39;t make it radical  <br/>\nunschooling. Just because control soothes your fears about food, just  <br/>\nbecause you believe your ideas about food are the right ones to have,  <br/>\nwon&#39;t change the effects that control can have on people. Whether I  <br/>\nmake my daughter eat my idea of healthy, or make her cover up from  <br/>\nneck to wrist to ankle, or pray to Allah, whether my ideas are  <br/>\nultimately right or wrong, it doesn&#39;t erase the potential damage that  <br/>\ncontrol can do.<br/>\n<br/>\nAnd it isn&#39;t fair to the others who are working hard to let go of  <br/>\ntheir fears in order to get the great benefits of unschooling for you  <br/>\nto insist the definition of radical unschooling can be expanded to<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We talk about why we don&#39;t have some foods in the house. We talk. We  <br/>\n&gt; talk. We talk.<br/>\n<br/>\n<br/>\n </span></blockquote>Too much discussion. And the &quot;we&quot; is problematic. Since it&#39;s you  <br/>\ndeciding and talking until your daughter makes the decisions you want  <br/>\nto, it&#39;s not really &quot;we&quot; talking. It&#39;s you talking and her listening  <br/>\nand parroting back what you&#39;ve told her. She&#39;s not learning from her  <br/>\nown experience. She&#39;s learning from lectures. That&#39;s what they do in  <br/>\nschool. You have an agenda and  you want to make sure your daughter  <br/>\nfully understands it.<br/>\n<br/>\nIf you had a particular genre of books you liked, like English murder  <br/>\nmysteries, and every time you chose one it initiated  discussion from  <br/>\nyour husband about how books that were spiritually uplifting were so  <br/>\nmuch better for people and so on and so on, it would suck a lot of the  <br/>\njoy out of it.<br/>\n<br/>\nPersonally I&#39;d start hiding what I was doing so I could avoid the  <br/>\ndiscussion and just enjoy the book in peace.<br/>\n<br/>\nSame can happen with food.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My daughter and I eat treats together and talk about how food  <br/>\n&gt; affects us.<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;ve mentioned feelings after eating over the years. So has my  <br/>\ndaughter. We don&#39;t &quot;talk about&quot; how food effects us. And yet she has a  <br/>\ngreat deal of awareness of when she&#39;s hungry and when she isn&#39;t. She&#39;s  <br/>\nbeen known to leave a single bite on her plate because she knows when  <br/>\nshe&#39;s had enough.<br/>\n<br/>\nThat&#39;s not an intellectual process. It&#39;s an awareness that comes from  <br/>\nlistening to the body, not the head, and not the thoughts from someone  <br/>\nelse&#39;s head.<br/>\n<br/>\nBike riding doesn&#39;t come from talking and talking about bike riding.  <br/>\nIt comes 99.9% from doing.<br/>\n<br/>\nThere&#39;s something very off in terms of natural learning about all this  <br/>\ntalking and I hope someone else can pick up on it and explain it better.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  When we are out she decides the food and shares with me if she is  <br/>\n&gt; eating &quot;crappy&quot; food.<br/>\n<br/>\n </span></blockquote>Crappy food eaten with guilt and a disrespect for your body (which is  <br/>\nthe only way putting crap into your body can be thought of) is way  <br/>\nworse than eating something joyfully that is less nutritionally dense.<br/>\n<br/>\nIt would help the discussion a great deal if you would read the  <br/>\ninformation at the links:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/food\">http://sandradodd.com/food</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com\">http://joyfullyrejoycing.com</a> (scroll down the right side)<br/>\n<br/>\nRadical unschooling encourages kids to listen to their bodies. Counter  <br/>\nto what conventional wisdom would say, by the time they&#39;re ready to  <br/>\nleave home they aren&#39;t subsisting on nothing but junk food.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":432808875,"authorName":"Diane","from":"&quot;Diane&quot; &lt;dianetargovnik@...&gt;","profile":"dtargovnik","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Has Anyone Had This Experience?","postDate":"1291668109","msgId":45384,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlkamhxZCtpdjVmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlkamNmZitmODRtQGVHcm91cHMuY29tPg=="},"prevInTopic":45383,"nextInTopic":45385,"prevInTime":45383,"nextInTime":45385,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"Thank you. Thank you. Thank you. You said this much clearer than I did.","messageBody":"<div id=\"ygrps-yiv-1934214429\">Thank you. Thank you. Thank you. You said this much clearer than I did.<br/>\n<br/>\n<br/>\n&quot;maharaashlie&quot; &lt;mahara@...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; This is crazy stuff. Really, if you lived in the wild and gave your child free range choice for her diet, wouldn&#39;t you stop her if she reached for a poisonous berry or mushroom? It is one thing to offer free choice and it is another to avoid important information </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Has Anyone Had This Experience?","postDate":"1291666647","msgId":45382,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENCNDNENDhDLThBQzQtNDA4MC04M0I4LTNDQTk1NTk5QjBCOUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGlkajd2MStuNzk2QGVHcm91cHMuY29tPg==","referencesHeader":"PGlkajd2MStuNzk2QGVHcm91cHMuY29tPg=="},"prevInTopic":45381,"nextInTopic":45383,"prevInTime":45381,"nextInTime":45383,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"... It s much easier to help people understand and figure out radical unschooling if we re discussing one clear definition of radical unschooling. People can","messageBody":"<div id=\"ygrps-yiv-1275963631\">On Dec 6, 2010, at 12:53 PM, Diane wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think there is more than one ru path here to walk down..<br/>\n<br/>\n </span></blockquote>It&#39;s much easier to help people understand and figure out radical  <br/>\nunschooling if we&#39;re discussing one clear definition of radical  <br/>\nunschooling.<br/>\n<br/>\nPeople can then, in the comfort of their own homes, add to it,  <br/>\nsubtract from it, alter it however they please.<br/>\n<br/>\nAs an analogy, people can think of this list as directions on how to  <br/>\nget from wherever they are in the world to Times Square in New York  <br/>\nCity. Just Times Square. Not Central Park. Not Brooklyn. Not Albany.  <br/>\nThe only requirement for the list is the *discussion* be about getting  <br/>\nto and exploring Times Square.<br/>\n<br/>\nWhat people do outside the list is up to them. They can take off for  <br/>\nBroadway. Or New Jersey. If people want to discuss topics beyond Times  <br/>\nSquare they need a different list.<br/>\n<br/>\nThe analogy isn&#39;t great since radical unschooling is about opening the  <br/>\nworld to kids and the analogy implies a limited scope. But the kids  <br/>\nand their explorations aren&#39;t limited. What&#39;s limited are how parents  <br/>\ninteract with their kids. Which sounds limiting ;-) But it is. THe  <br/>\nlist isn&#39;t about spanking. Or humiliating kids. Or tricking them into  <br/>\ngiving up their binkies. Or manipulating them. Or imposing the  <br/>\nparents&#39; agenda on them. (Or 99% of what conventional parenting and  <br/>\nschooling is about.) Radical unschooling is about supporting their  <br/>\nexplorations. It&#39;s limited in a way that helps people move towards  <br/>\nthat goal in the same way that if someone wants to get to Times Square  <br/>\nin New York City then heading south from Miami is not going to be a  <br/>\nvery effective route.<br/>\n<br/>\nSo, no, as far as this list is concerned, there isn&#39;t more than one  <br/>\nradical unschooling path. For clarity&#39;s sake, the definitions is  <br/>\npretty well defined as helping kids explore their interests, joyful  <br/>\nliving, and what builds relationships.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":466539614,"authorName":"maharaashlie","from":"&quot;maharaashlie&quot; &lt;mahara@...&gt;","profile":"maharaashlie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Has Anyone Had This Experience?","postDate":"1291662639","msgId":45381,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlkamNmZitmODRtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlkamFxYytlZGJnQGVHcm91cHMuY29tPg=="},"prevInTopic":45380,"nextInTopic":45382,"prevInTime":45380,"nextInTime":45382,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"This is crazy stuff. Really, if you lived in the wild and gave your child free range choice for her diet, wouldn t you stop her if she reached for a poisonous","messageBody":"<div id=\"ygrps-yiv-1665243606\">This is crazy stuff. Really, if you lived in the wild and gave your child free range choice for her diet, wouldn&#39;t you stop her if she reached for a poisonous berry or mushroom? It is one thing to offer free choice and it is another to avoid important information around what is healthy for the human body. Allowing your child to feast on nutrient void junk filled with toxic chemicals is to me the same as letting her eat poison. It just will take a bit longer to kill her. Our children need to learn about the dangers of eating toxic chemical laden foods, foods sprayed with pesticides, animal products pumped with hormones,etc. and foods genetically modified. Until they can read it for themselves labels should be a part of this free choice plan and education on what the ingredients are and where they come from, etc. I find my daughter makes very healthy choices for herself based on the facts that she understands about the ingredients in the foods. She does make exceptions and eats items that are not the healthiest choice sometimes, but with the knowledge of exactly what she is eating, she tends to keep unhealthy choices to a minimum. She generally opts for very healthy foods. Our home is stocked with mostly healthy foods and when we shop, if she picks up an item that she wants to try I have her read the ingredients. Mostly she makes very wise choices to keep her body healthy. <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; &quot;Diane&quot; &lt;dianetargovnik@&gt; wrote:<br/>\n&gt; &gt;&gt; I do think there can be a happy balance that doesn&#39;t include buying pringles (which are expensive! $3 for a can on sale is a lot more then ten cents an hour). We talk about why we don&#39;t have some foods in the house. We talk. We talk. We talk.<br/>\n&gt; **************<br/>\n&gt; <br/>\n&gt; If your child wants something and you&#39;re saying &quot;not in my house&quot; that&#39;s not a happy balance, though, its a parent imposing her will on a child. If all that talk you&#39;re doing is framed in terms of weak-vs-strong and pure-vs-crapola that&#39;s not a happy balance, either, its a parent pushing her value system as a kind of educational agenda. <br/>\n&gt; <br/>\n&gt; If you&#39;re thinking in terms of &quot;not in the house&quot; or &quot;all junk all the time&quot; then a happy balance might include easing in to having some of the Other foods you like - the processed foods - in the house now and then. Easing in is good! <br/>\n&gt; <br/>\n&gt; Another way to get to a happy balance, though is to jump in and binge for awhile, treat yourself to all your guilty pleasures, one by one, until they no longer have that extra desirability and you can make clear decisions. Which strategy will work better for you is going to depend a lot on personality and past issues. Do you (and your kids) do better diving in or taking things slowly?<br/>\n&gt; <br/>\n&gt; &gt;I think there is more than one ru path here to walk down...<br/>\n&gt; <br/>\n&gt; Radical unschooling isn&#39;t some kind of set of parenting rules, the whole philosophy derives from an understanding that learning is the purview of the learner - that while people can and do choose to be taught, teaching is not the same as learning. <br/>\n&gt; <br/>\n&gt; So its not that radical unschoolers are saying &quot;don&#39;t teach, its bad&quot; its that teaching does not guarantee that your child is learning what you want her to learn. You *can* create an environment where your beliefs and principles are attractive to your child, but because your child isn&#39;t you, but a unique human being in her own right, she may not adopt all your principles and those she does may play out very differently in her life than in yours. <br/>\n&gt; <br/>\n&gt; &gt;&gt;I am weak too and show her that I too eat crappy food.<br/>\n&gt; <br/>\n&gt; I&#39;m sorry you&#39;ve learned to see yourself as less powerful than a can of pringles (dollar store $1, btw). One of the wonderful aspects of unschooling, of creating an environment which supports learning and discovery, is that our kids get to be More powerful. More powerful than junk food, more powerful than advertising, more powerful than technology. That&#39;s not a guess or a theory! Its the experience of families that have teen and adult unschoolers. My kids aren&#39;t &quot;weak&quot; in the face of sweets or processed snacks, they&#39;re active decision makers, and its wonderful to behold!<br/>\n&gt; <br/>\n&gt; ---Meredith (Mo 9, Ray 17)<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Has Anyone Had This Experience?","postDate":"1291660940","msgId":45380,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlkamFxYytlZGJnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlkajd2MStuNzk2QGVHcm91cHMuY29tPg=="},"prevInTopic":45379,"nextInTopic":45381,"prevInTime":45379,"nextInTime":45381,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"... ************** If your child wants something and you re saying not in my house that s not a happy balance, though, its a parent imposing her will on a","messageBody":"<div id=\"ygrps-yiv-379601476\">&quot;Diane&quot; &lt;dianetargovnik@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I do think there can be a happy balance that doesn&#39;t include buying pringles (which are expensive! $3 for a can on sale is a lot more then ten cents an hour). We talk about why we don&#39;t have some foods in the house. We talk. We talk. We talk.<br/>\n </span></blockquote>**************<br/>\n<br/>\nIf your child wants something and you&#39;re saying &quot;not in my house&quot; that&#39;s not a happy balance, though, its a parent imposing her will on a child. If all that talk you&#39;re doing is framed in terms of weak-vs-strong and pure-vs-crapola that&#39;s not a happy balance, either, its a parent pushing her value system as a kind of educational agenda. <br/>\n<br/>\nIf you&#39;re thinking in terms of &quot;not in the house&quot; or &quot;all junk all the time&quot; then a happy balance might include easing in to having some of the Other foods you like - the processed foods - in the house now and then. Easing in is good! <br/>\n<br/>\nAnother way to get to a happy balance, though is to jump in and binge for awhile, treat yourself to all your guilty pleasures, one by one, until they no longer have that extra desirability and you can make clear decisions. Which strategy will work better for you is going to depend a lot on personality and past issues. Do you (and your kids) do better diving in or taking things slowly?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I think there is more than one ru path here to walk down...<br/>\n<br/>\n </span></blockquote>Radical unschooling isn&#39;t some kind of set of parenting rules, the whole philosophy derives from an understanding that learning is the purview of the learner - that while people can and do choose to be taught, teaching is not the same as learning. <br/>\n<br/>\nSo its not that radical unschoolers are saying &quot;don&#39;t teach, its bad&quot; its that teaching does not guarantee that your child is learning what you want her to learn. You *can* create an environment where your beliefs and principles are attractive to your child, but because your child isn&#39;t you, but a unique human being in her own right, she may not adopt all your principles and those she does may play out very differently in her life than in yours. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I am weak too and show her that I too eat crappy food.<br/>\n<br/>\n </span></blockquote>I&#39;m sorry you&#39;ve learned to see yourself as less powerful than a can of pringles (dollar store $1, btw). One of the wonderful aspects of unschooling, of creating an environment which supports learning and discovery, is that our kids get to be More powerful. More powerful than junk food, more powerful than advertising, more powerful than technology. That&#39;s not a guess or a theory! Its the experience of families that have teen and adult unschoolers. My kids aren&#39;t &quot;weak&quot; in the face of sweets or processed snacks, they&#39;re active decision makers, and its wonderful to behold!<br/>\n<br/>\n---Meredith (Mo 9, Ray 17)</div>","specialLinks":[]},{"userId":432808875,"authorName":"Diane","from":"&quot;Diane&quot; &lt;dianetargovnik@...&gt;","profile":"dtargovnik","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Has Anyone Had This Experience?","postDate":"1291658017","msgId":45379,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlkajd2MStuNzk2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY0ODE0QjJELThEOEUtNDRFNS05RTFBLURBRUY3MDdCQ0ZCNkB2ZXJpem9uLm5ldD4="},"prevInTopic":45378,"nextInTopic":45380,"prevInTime":45378,"nextInTime":45380,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"I do think there can be a happy balance that doesn t include buying pringles (which are expensive! $3 for a can on sale is a lot more then ten cents an hour).","messageBody":"<div id=\"ygrps-yiv-1539083596\">I do think there can be a happy balance that doesn&#39;t include buying pringles (which are expensive! $3 for a can on sale is a lot more then ten cents an hour). We talk about why we don&#39;t have some foods in the house. We talk. We talk. We talk.<br/>\nMy daughter and I eat treats together and talk about how food affects us. Both the good and bad food.  When we are out she decides the food and shares with me if she is eating &quot;crappy&quot; food. We talk about it. We joke about it. She doesn&#39;t hide her choices from me and I am weak too and show her that I too eat crappy food.    I think there is more than one ru path here to walk down... If this was 20,000 years ago I would let her eat what she wanted. But it&#39;s not. And I am here to help guide</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Has Anyone Had This Experience?","postDate":"1291652976","msgId":45378,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY0ODE0QjJELThEOEUtNDRFNS05RTFBLURBRUY3MDdCQ0ZCNkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDM0ODEwNTM4MDE2OTYwMDk4NEB1bmtub3dubXNnaWQ+","referencesHeader":"PDM0ODEwNTM4MDE2OTYwMDk4NEB1bmtub3dubXNnaWQ+"},"prevInTopic":45377,"nextInTopic":45379,"prevInTime":45377,"nextInTime":45379,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"... Why talk about them, though? From her point of view it s like a test to see if she s learning the right answers. And if she chooses wrong she gets","messageBody":"<div id=\"ygrps-yiv-1683068580\">On Dec 6, 2010, at 9:17 AM, Diane Targovnik wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When we go out I let<br/>\n&gt; my daughter choose her food and we talk about her choices.<br/>\n<br/>\n </span></blockquote>Why talk about them, though? From her point of view it&#39;s like a test  <br/>\nto see if she&#39;s learning the right answers. And if she chooses &quot;wrong&quot;  <br/>\nshe gets quizzed.<br/>\n<br/>\nUnschooling is about exploring freely so kids can find what is good  <br/>\nand bad *to them*. Discrimination and thought isn&#39;t learned by  <br/>\nmemorizing someone else&#39;s list of good. It is learned by exploring the  <br/>\ngood and bad parts of choices.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  They are<br/>\n&gt; processed foods and with no redeeming qualities<br/>\n<br/>\n<br/>\n </span></blockquote>What about fun? Interesting textures? Unusual tastes? Food needn&#39;t be  <br/>\npurely for nutrition. If it were, then feasts and parties should not  <br/>\nhave the food they do!<br/>\n<br/>\nParents assume that if they train their kids the right way to do  <br/>\nthings, then they&#39;ve done their job. If the kids choose differently  <br/>\nafter they leave, then it&#39;s the kids fault, not the parents. The  <br/>\nparents did the best they could.<br/>\n<br/>\nBut training -- which involves control -- has some potentially  <br/>\nnegative consequences:<br/>\n<br/>\n1) Kids can learn to sneak. If there&#39;s something they really want and  <br/>\nyou&#39;re a roadblock between them and it, their put in a position to  <br/>\nfind a way around you.<br/>\n<br/>\n2) Kids can be so irritated by the control, they choose to go the  <br/>\nopposite way &quot;just because&quot;. The goal becomes choosing the opposite of  <br/>\nwhat the parent wants, regardless of the negative effects.<br/>\n<br/>\n3) Control focuses attention on what can&#39;t be had, elevating its  <br/>\nimportance. Freely accessible Pringles are not nearly as desirable as  <br/>\nforbidden Pringles. I can have as many Pringles as I want. I had a  <br/>\nfair number of them as a child. As an adult, I don&#39;t want them.<br/>\n<br/>\n4) Kids can tune out their own inner voices in favor of experts who  <br/>\nknow what&#39;s best for them.<br/>\n<br/>\nBut just because the above are very real possibilities -- and adults  <br/>\nhere have told stories of all of those they did as kids because of  <br/>\ncontrol -- doesn&#39;t mean the answer is to throw up your hands and turn  <br/>\nit into a free for all. KIds want a sense of a safe nest to explore  <br/>\nfrom. But they don&#39;t want bars around it.<br/>\n<br/>\nThere&#39;s loads written about food and radical unschooling at:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/food\">http://sandradodd.com/food</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com\">http://joyfullyrejoycing.com</a> (scroll down the right side)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But at home I buy only stuff that is good for our bodies (and yes it<br/>\n&gt; is my definition of &quot;good&quot;).<br/>\n<br/>\n </span></blockquote>Even radical unschooling parents will be choosing the bulk of the food  <br/>\nthat comes into the house, yes, based on their definition of good  <br/>\nbecause the details of daily meal planning is usually not the top  <br/>\npriority for most kids. What they want is being able to have what they  <br/>\nenjoy available. Kids have little power. Any power they have comes  <br/>\nthrough their parents. Would you want your husband dictating what you  <br/>\ncan and can&#39;t have available at home? If he requests that a few items  <br/>\nnot be brought in, like he&#39;s got a weakness for BBQ chips but a body  <br/>\nthat disapproves of them ;-), it&#39;s a kindness to not have them.<br/>\n<br/>\nBut if he dictates that you can&#39;t have access to any food that&#39;s not  <br/>\non his approved list, how does that affect your relationship with him?  <br/>\nDoes it make you feel less a part of the home and more like a visitor  <br/>\nthat&#39;s tolerated but only to a certain extent?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; See this is where anxiety meets my checkbook and general thoughts of<br/>\n&gt; food.<br/>\n<br/>\n </span></blockquote>If your checkbook and anxiety become priorities over the child&#39;s free  <br/>\nexploration then radical unschooling won&#39;t be a great fit for your  <br/>\nfamily. They&#39;ll take priority over exploration. They&#39;ll take priority  <br/>\nover building relationships.<br/>\n<br/>\nIf exploration becomes the priority, that doesn&#39;t mean other  <br/>\npriorities drop off the radar. It can take some creativity sometimes  <br/>\nto find ways for kids to explore while still be conscious of money.  <br/>\nOften the first step is asking yourself if &quot;costs too much&quot; is a knee  <br/>\njerk reaction and whether it really will cost &quot;too much&quot;.<br/>\n<br/>\nI balked for a while at using the space heater to heat the bathroom  <br/>\nfor my daughter because space heaters cost &quot;a lot&quot; to run.Yes, if  <br/>\nyou&#39;re trying to heat a room, running a space heater all day, it&#39;s  <br/>\nvery inefficiet. But even running it for an hour is only about 10  <br/>\ncents. Isn&#39;t it worth paying a dime to get a more pleasant shower?<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Has Anyone Had This Experience?","postDate":"1291649932","msgId":45377,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlkajAyYysyOW1wQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM0ODEwNTM4MDE2OTYwMDk4NEB1bmtub3dubXNnaWQ+"},"prevInTopic":45376,"nextInTopic":45378,"prevInTime":45376,"nextInTime":45378,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"... Its more where your anxiety turns to controlling - those aren t costly foods, you listed. Try to step back from the money arguement and see it as being","messageBody":"<div id=\"ygrps-yiv-2104277142\">Diane Targovnik &lt;dianetargovnik@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; See this is where anxiety meets my checkbook and general thoughts of<br/>\n&gt; food. I just don&#39;t have pringles and kook aid in the house.<br/>\n<br/>\n </span></blockquote>Its more where your anxiety turns to controlling - those aren&#39;t costly foods, you listed. Try to step back from the money arguement and see it as being about you, not about your child or money - or even health, really. Health and money and &quot;for the good of the child&quot; are pretty common ways to rationalize old baggage. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I also do this because if there is non-healthy food in the<br/>\n&gt; house I will eat it. And I don&#39;t want to.<br/>\n<br/>\n </span></blockquote>Have you told your dd that? That&#39;s really the big issue - you&#39;re controlling what you eat and extending that control to the people around you. <br/>\n<br/>\nIf moving away from control and toward partnership is important to you, one option is to offer your dd a &quot;no strings&quot; food budget of her own, supplemental to the main family budget. Her food is hers - no snitching! <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":432808875,"authorName":"Diane Targovnik","from":"Diane Targovnik &lt;dianetargovnik@...&gt;","profile":"dtargovnik","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Has Anyone Had This Experience?","postDate":"1291645062","msgId":45376,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0ODEwNTM4MDE2OTYwMDk4NEB1bmtub3dubXNnaWQ+"},"prevInTopic":45374,"nextInTopic":45377,"prevInTime":45375,"nextInTime":45377,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"See this is where anxiety meets my checkbook and general thoughts of food. I just don t have pringles and kook aid in the house. They are processed foods and","messageBody":"<div id=\"ygrps-yiv-488549126\">See this is where anxiety meets my checkbook and general thoughts of<br/>\nfood. I just don&#39;t have pringles and kook aid in the house. They are<br/>\nprocessed foods and with no redeeming qualities (I assume pringles has<br/>\nMSG and food dye. Kool aid also with food dye). When we go out I let<br/>\nmy daughter choose her food and we talk about her choices. But she can<br/>\nget what she wants.<br/>\nBut at home I buy only stuff that is good for our bodies (and yes it<br/>\nis my definition of &quot;good&quot;). And stuff I feel comfortable with her<br/>\neating... I also do this because if there is non-healthy food in the<br/>\nhouse I will eat it. And I don&#39;t want to. My two cents<br/>\n<br/>\nSent from my iPhone</div>","specialLinks":[]},{"userId":263488403,"authorName":"hmbpie","from":"&quot;hmbpie&quot; &lt;heatherpie@...&gt;","profile":"hmbpie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Has Anyone Had This Experience?","postDate":"1291583841","msgId":45374,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlkZ3ZoMStjYW0yQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":45376,"prevInTime":45373,"nextInTime":45375,"topicId":45374,"numMessagesInTopic":0,"msgSnippet":"=What about kids who aren t still eating other foods though? That s what we re struggling with here. After several months of hot chips (fries) several times a","messageBody":"<div id=\"ygrps-yiv-2064936847\">=What about kids who aren&#39;t still eating other foods though? That&#39;s what<br/>\nwe&#39;re struggling with here. After several months of hot chips (fries) <br/>\nseveral times a day, DD is cutting back on just about everything that she used to eat, and only eating chips! Finding it harder and harder to just keep letting go.=<br/>\n<br/>\nLast week for three days straight my son ate nothing but cheddar cheese pringles and kool aide jammers.  Nothing else.  It really freaked me out. I kept making monkey platters and he kept asking for pringles and kool aide jammers (I added these to the platters but when he ate what was there he just went and got the tube of chips for more.) I locked myself in the closet at one point and called a friend because my anxiety about it lasting much longer was getting really high.  I don&#39;t know what I would do if it lasted for months.  I don&#39;t have any advice but I feel for you and wanted to let you know.  Sometimes it&#39;s nice if I know I&#39;m not alone in a struggle.</div>","specialLinks":[]}],"prevTopicId":45823,"nextTopicId":45843}}