{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":115295995,"authorName":"crissyhall","from":"&quot;crissyhall&quot; &lt;crissyhall@...&gt;","profile":"crissyhall","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"postDate":"1132805693","msgId":7929,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRtM2VudCtzMnVrQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":7928,"nextInTime":7930,"topicId":7929,"numMessagesInTopic":0,"msgSnippet":"Thanks everyone for putting things into perspective! You ve given me great ideas and I ve been able to use them and see them work! hi Alex!!!  I m so sorry for","messageBody":"<div id=\"ygrps-yiv-1630757989\">Thanks everyone for putting things into perspective! You&#39;ve given me<br/>\ngreat ideas and I&#39;ve been able to use them and see them work!  <br/>\n<br/>\nhi Alex!!!  I&#39;m so sorry for your loss, but happy to hear that you&#39;re<br/>\nexpecting again. It would be great to get together with you again.  I<br/>\n helped start a local homeschool group this year, real laid-back and<br/>\njust for the kids to make friends and have fun, and would love to have<br/>\nanother unschooler around! Let me know if you&#39;re interested, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:crissyhall@...\">crissyhall@...</a>   I can&#39;t believe your son isn&#39;t 4 yet, I thought<br/>\nhe was older than Nate :)<br/>\n<br/>\nI love the conversations too. And the best part is not necessary<br/>\nhaving the answer to the questions, but just the interests it <br/>\n<br/>\nsparks.  I remember a quick trip to Target and catching an American<br/>\nGirl book from falling out of the van sparked a  <br/>\n<br/>\nconversation about WWII, & the Civil War, which lead to human rights,<br/>\nand wonderiing why woman don&#39;t have equal <br/>\n<br/>\nrights!!! My oldest dd and I just couldn&#39;t fathom why women make up<br/>\nover 50% of the population but we couldn&#39;t pass the <br/>\n<br/>\nERA???  Then I shared our conversation with someone who was old enough<br/>\nto vote in the 70s and found out that many <br/>\n<br/>\nwomen were frightened of having to share public bathrooms and being<br/>\nforced to fight in wars. Amazing!  <br/>\n<br/>\nI can&#39;t always &quot;see&quot; learning happening in my kids, but I see it in<br/>\nmyself so I trust it is working the same wonderful way with <br/>\n<br/>\nthem.  Wars and timelines were sooo boring to me in school and now<br/>\nafter watching the TV show &quot;Rome&quot; (which I&#39;m sure <br/>\n<br/>\nmany, many people find as a totally unredeeming waste of time full of<br/>\nviolence and sex)  has sparked an interest in history <br/>\n<br/>\nand religions.  My dh and I want to find a really good book about the<br/>\nRoman empire and find out more about Titus Pullo <br/>\n<br/>\nand Lucius Vorianus (sp?), how much was their story embellished and<br/>\nhow much was true :) And when did different <br/>\n<br/>\nreligions start in comparison to world events. Oh and what is the<br/>\nBuddism and Hinduism.... And, and, and...... :)<br/>\n<br/>\nI also HATE science and have no interest in writiing computer code<br/>\n(even though according to tests they are my <br/>\n<br/>\nstregthens???) until.... my dh wanted &quot;scientific&quot; proof and<br/>\ndocumentation that unschooling works. And after listening to <br/>\n<br/>\nPam&#39;s speech that there is  a study about the brain and how learning<br/>\nworks (thanks Pam!),  I&#39;m now looking forward to <br/>\n<br/>\nlooking up a scientific study and want to learn to write code so I can<br/>\nhave a blog!!!   <br/>\n<br/>\nAnastasia, my dh was like your dh and he happened to really question<br/>\nunschooling one day when I was PMSing, not a <br/>\n<br/>\ngood time for me to be the most persuasive and unemotional! And he<br/>\nwanted proof; studies on unschooling and <br/>\n<br/>\nunschooled kids that were sucessful, not just antidotal evidence. Ha!<br/>\nHe&#39;s knew he was asking for the impossible!  Luckily <br/>\n<br/>\nI was able to quote some smart woman from here (can&#39;t remember who?)<br/>\nthat he would have to trust me because I believe <br/>\n<br/>\nin it. I also remember him telling me about working with people from a<br/>\ncountry well esteemed for education  and while they <br/>\n<br/>\ncould quickly quote a fact from the top of their head (so it took him<br/>\n2 extra minutes to look it up ;),  they couldn&#39;t use the <br/>\n<br/>\ninformation to creatively solve a problem.  We want our kids to be<br/>\ncreative, curious, passionate, problem solvers that love <br/>\n<br/>\nlearning not kids crushed and just do what they are told.  He said  I<br/>\nwas right and that he would have to trust me, but it <br/>\n<br/>\nwould be helpful to him to have some of the highlights pointed out.  I<br/>\ncan do that!  He saw the kids at the end of the day when they were<br/>\nwinding down and missed out on a lot of the conversations, questions,<br/>\npassions, and fun places we had been to.<br/>\n<br/>\nRen, &quot;fan of obsessions&quot;  sounds like a good book title:)<br/>\n<br/>\nQuestion: I understand &quot;Principles vs Rules&quot; and I definitely agree<br/>\nthat discipline doesn&#39;t mean punishment, but I&#39;m struggling with what<br/>\nto do when a principle isn&#39;t being followed? What do you do when a<br/>\nchild is being hurtful even after it has been clearly stated that they<br/>\nare being hurtful?  Is finding out what the cause is and coming up<br/>\nwith other options enough???  What do you do when a child doesn&#39;t have<br/>\nthe language skills to say what&#39;s going on?  <br/>\n<br/>\n~Christine</div>","specialLinks":[]}],"prevTopicId":7925,"nextTopicId":7690}}