{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":185404027,"authorName":"Mama","from":"&quot;Mama&quot; &lt;jessandkennysmom@...&gt;","profile":"jessandkennysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unschooling with Asperger&#39;s","postDate":"1280350405","msgId":44609,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkycTVjNSs1dTVuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGlrN1p6dTFueDdoaCs5eEVma25aQUF3Y0FlVUdENFZ0WWg0blF0ZEBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":44605,"nextInTopic":0,"prevInTime":44608,"nextInTime":44610,"topicId":44599,"numMessagesInTopic":0,"msgSnippet":"... My opinion is that parents are the ones that really need to deschool. It took me years (and some unhappy times with Jessie) to learn this.  I felt quite","messageBody":"<div id=\"ygrps-yiv-57752950\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Faith Void &lt;littlemsvoid@...&gt; wrote:<br/>\n<br/>\nMy opinion is that parents are the ones that really need to deschool. <br/>\n<br/>\nIt took me years (and some unhappy times with Jessie) to learn this.  I felt quite proud of myself for allowing her deschooling time, it necer occured to me that it was MY education that needed to be undone!!<br/>\n<br/>\nThank fort he reminder, Faith.  Hope all is well in your neck of the woods.  We will be &quot;back home&quot; in Lancaster this weekend, excited to fill up on Dairy Queen, Chik-fil-A and Turkey Hill Iced Tea :) </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unschooling with Asperger&#39;s","postDate":"1280155105","msgId":44602,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyazZsMStjY2FoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkyaGU3MStnaHFqQGVHcm91cHMuY29tPg=="},"prevInTopic":44601,"nextInTopic":44603,"prevInTime":44601,"nextInTime":44603,"topicId":44599,"numMessagesInTopic":0,"msgSnippet":"... *************** It can help to think of deschooling in terms of decompression - kids get squashed in school and need time to expand back into their","messageBody":"<div id=\"ygrps-yiv-1219933122\">&quot;elguthaus&quot; &lt;eguthaus@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; What are people&#39;s experiences with this?  Especially in regards to deschooling. <br/>\n </span></blockquote>***************<br/>\n<br/>\nIt can help to think of deschooling in terms of &quot;decompression&quot; - kids get &quot;squashed&quot; in school and need time to expand back into their natural facility for and love of learning. That can be even more true of kids who have been labled with &quot;special needs&quot; and squashed into those little bitty boxes. They learn to doubt themselves fiercely in school, and can need a lot of time and loving support to heal from that. <br/>\n<br/>\nThe thing is, the same can be said of a lot of &quot;typical&quot; kids too. Some kids take a looooot longer to decompress than others. It can be more helpful to look for stories of kids who left school around the same age as yours - there are honestly more commonalities based on the number of years in school than any other factor. That will sound strange if you&#39;re used to the schoolish necessity of waving your child&#39;s lable like a flag to seek out and demand appropriate services - in the world of school, doing that is good, helpful parenting, but it doesn&#39;t really apply once you peel away &quot;the system&quot; and all its hoops. <br/>\n<br/>\nAre there specific worries you have? Probably the biggest bugaboo for parents with atypical kids is that the most common piece of schoolish &quot;wisdom&quot; applied to any and all possible issues is &quot;your child needs more structure&quot;. From the standpoint of trying to provide for your child&#39;s needs at home, its good to question that assessment. Its not necessarily true! Some people need a good bit of regularity and predictability. Some people do much better with a schedule. It can be worth experiementing together with your child to see if those are his or her real needs and then looking for ways to meet those needs. Its not *hard* to create a comfortable routine at home or to arrange the home in ways that generate a lot of predictability - but it can be an effort if you&#39;re used to relying on school to provide those stabilizing factors. Its also possible that, outside of school, your child needs much less in the way of structure or routine than you may have been led to believe. There&#39;s a whole range of human needs in this regard, and something like aspergers doesn&#39;t really change that. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Was making the switch from PS to US helpful?<br/>\n<br/>\n </span></blockquote>The only time it wouldn&#39;t be helpful is if parents aren&#39;t able to meet the needs of the specific child. When Ray lived with his bio mom for a few years, we insisted that he attend school because she couldn&#39;t provide any kind of routine or predictability in his life, and he needed those things in a big way. If you&#39;re worried that your own lifestyle is too chaotic for your child, that&#39;s something you could try experimenting with during summer holidays - see if you can adapt your home environment to better meet the needs of your child, so that you don&#39;t need to rely on school to do it for you. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":302010303,"authorName":"sharon","from":"&quot;sharon&quot; &lt;1drflmthr@...&gt;","profile":"sharonjemerson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling with Asperger&#39;s","postDate":"1280150509","msgId":44601,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyazI1ZCs5dXViQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkyaGU3MStnaHFqQGVHcm91cHMuY29tPg=="},"prevInTopic":44600,"nextInTopic":44602,"prevInTime":44600,"nextInTime":44602,"topicId":44599,"numMessagesInTopic":0,"msgSnippet":"Love this from Ren Allen s blog. I copied and pasted it. Or you can go to http://radicalunschooling.blogspot.com/2009_10_01_archive.html and scroll down to: We","messageBody":"<div id=\"ygrps-yiv-1410807555\">Love this from Ren Allen&#39;s blog. I copied and pasted it. Or you can go to <a rel=\"nofollow\" target=\"_blank\" href=\"http://radicalunschooling.blogspot.com/2009_10_01_archive.html\">http://radicalunschooling.blogspot.com/2009_10_01_archive.html</a> and scroll down to: We don&#39;t need any labels<br/>\nHope you find it helpful.<br/>\nSharon<br/>\n<br/>\nWe donât need any labels<br/>\n<br/>\nRen Allen refused to get a diagnosis for her son<br/>\n<br/>\nMy youngest child was born into our family in the year 2001, just about the time my husband and I were reconciling an almost failed marriage. He was born in the safety and comfort of home with his parents, Grandparents and siblings nearby in the early hours of morn. Breastfed before the cord was cut and nestled next to my body almost 24/7. He was perfect and beautiful and fully loved. By the time he has less than half a year of breathing experience, we knew something was &quot;different&quot;. Nothing drastic. Nothing we couldn&#39;t handle. We thought we had a very needy baby. We did.<br/>\n<br/>\nBy the time he was two years old we knew it was a lot more than simple &quot;neediness&quot;. Fortunately for my babsy boy, we had embraced unschooling before he was born and had started questioning many of our parenting practices with a lot more mindfulness than we had done with our older kids. Because of that questioning and growth, we all benefited as we journied down the road of &quot;atypical&quot;. The term &quot;breastfed on demand&quot; had a whole new meaning...emphasis on the &quot;demand&quot; portion. He didn&#39;t develop language until close to age three, creating a whole new line of questioning for well-intentioned family and friends who were sure I was negligent for not taking him to speech therapy. He was explosive and intense in ways I could hardly describe to outsiders. A &quot;melt-down&quot; often meant that he and I were locked in a room together as I tried to keep my other children safe from flying missiles. Rages could go on for an hour or more. There were days I questioned my ability to help this child safely navigate this world, days I cried in a heap on the floor because I felt so inadequate. Days I wondered if my intuition were correct that he just needed love, safety and lots of time to unfold as the person-he-is, rather than who anyone else wanted him to be.<br/>\n<br/>\nAll children deserve trust<br/>\n<br/>\nI had an ace in the hole though. I had unschooling lists and voices of other parents with &quot;intense&quot; children who were like a soothing balm when I read about the very same behaviors they were meeting with gentle response. Parents like Anne Ohman, Unschooling advocate and author, who wrote &quot;I am what I am&quot; which brought me to tears, recognizing my own child in her beautiful essay though her sonâs traits are far different. She wrote &quot;Unschooling has been a gift to our entire family, one that now defines our very way of life. And it has been this gift of unschooling that has saved my childâs spirit and his self-concept and all of our sanities.&quot;<br/>\n<br/>\nSaved my child&#39;s spirit and his self-concept. Exactly. I knew without a shred of doubt that therapy and schooling would shatter my child&#39;s vision of himself, make him doubt where there was only confidence, create &quot;broken&quot; where there was &quot;whole&quot;. I couldn&#39;t do it. So on dark days when I wasn&#39;t the best mother in that moment, or I wondered if we were indeed doing him a disservice by not seeking out more (more of what I&#39;m not sure) I found that quiet confidence born of tapping into community. Yes, that online community of words and thoughts given by strangers oft times. Strangers who had faith that their child needed no labels, needed no &quot;fix&quot; but needed the same trust that all children deserve.<br/>\n<br/>\nDiagnoses<br/>\n<br/>\nI came to a point a few years ago when I needed answers. It was more for my husband and children than for myself at that point. I had read about &quot;ODD&quot; and &quot;SID&quot;, &quot;Aspergers&quot; and &quot;ADHD&quot; by then. But it was getting harder and harder to convince the rest of the family that support and patience were needed. A child who looks like every other child is thought to be simply &quot;rude&quot; or &quot;ill-behaved&quot; when they don&#39;t behave in certain ways. I remember looking up descriptions of diagnoses and emailing them to my husband, asking him if it made him feel better that there could be a diagnosis if we chose to get one. Did we need a label from an expert to be the parents this child needed? I was willing to go get one if it would help him connect and support better. He took a step back and agreed that no diagnosis was needed. We would continue as we always had....taking over when one partner was struggling, loving Jalen even more when he was acting less loveable, using techniques with the intent to support our child, not &quot;fix&quot; him.<br/>\n<br/>\nCherry-picking<br/>\n<br/>\nReading up on the various labels, I looked up just what the therapies look like for those labels. Many of them seem disrespectful to the child and it was easy to discard those ideas. But I did find useful information too...pushing games, physical equipment that is comforting for children for whom sensory information can be overwhelming.<br/>\n<br/>\nOver the years we bought a Mayan hammock, a trampoline, we kept blankets everywhere for rolling him in when we discovered that he was purposely stuffing his clothes to create a swaddling effect. Roller blades and scooters became part of our indoor equipment, items he brought into the mix on his own, showing us new ways to help meet his needs. Brushes for scratching his back, massages (almost constantly sometimes), readily available snacks and swings are some of the ways we learned to be more supportive. We found water to be an almost magical elixir. Getting out to rivers and pools on a regular basis was (and remains) so important.<br/>\n<br/>\nEverything we did was geared towards support, geared towards helping him function in a world that is a difficult for him to navigate.<br/>\n<br/>\nAnd this is the difference between your average mainstream reaction to &quot;atypical&quot; children and the unschooling approach. In most circles the child is discussed as someone with a &quot;disability&quot; or &quot;disorder&quot;. They are broken. Therapy is there to make them fit in to mainstream society. Those children often become stunted versions of themselves in order to fit in.<br/>\n<br/>\nUnschooling families learn about therapy (or use it) in order to better support the child. The changes are being made within ourselves. I learned about the labels so that I could be a better parent, not to alter who-he-is. The motivation is to understand and connect, to support and embrace.<br/>\n<br/>\nTherapy for support, not for repair<br/>\n<br/>\nThe closest thing we did to therapy was a short round of Neuro-feedback. It&#39;s a non-invasive, gentle way of helping the brain function at it&#39;s best. For anyone. It&#39;s not a &quot;fix&quot; nor does it change the patient. A good friend was getting licensed as a Neuro-feedback practitioner and let us try it out. It was an unusual situation in the fact that my friend understood my child and supported us whole-heartedly in unschooling and gentle parenting. I knew she would be respectful of him and not take it personally if he was blunt with her. Our sessions went very well until one day he decided he was done and didn&#39;t want to go back. He was very weepy after this session so I believe it may have tapped some of the emotional trauma he experienced in the womb.<br/>\n<br/>\nJust recently he has been requesting that we start doing the &quot;brain games&quot; (his name for Nuerofeedback) again at our friend&#39;s house. We can bring options into his life but the choice of how and when and whether or not to use them will remain his. We are partners in this journey. He knows I support his decisions and will always be a safe place to land when things seem out of whack. I believe when we are at our worst it is the time we need gentle love the most.<br/>\n<br/>\nCertain treatment doesnât guarantee certain outcome<br/>\n<br/>\nIt is reassuring to know that other parents are traveling this path with us. We read on the unschooling lists occasionally things like &quot;if you&#39;re respectful to your child, they will be respectful&quot; or &quot;unschooled children are so sweet and______-fill-in-the-blank&quot;. I like to hear from the parents that don&#39;t fit these generalities.<br/>\n<br/>\nI&#39;m one of the parents sitting there thinking &quot;NOT!&quot;. It&#39;s not true that the way a child is raised equals certain behavior. Not always. Had I stopped with my first three children I would probably agree with those sentiments! I would never have thought that an attachment-parented child could be explosive and angry from birth. That a non-spanked, non-punished, deeply loved child could say things like &quot;You suck&quot; just because you ran out of bread or gum. I had never experienced a child wishing I was dead or throwing things at me. I didn&#39;t know how deeply and intensely I could love a child that did those things on a regular basis.<br/>\n<br/>\nTrust<br/>\n<br/>\nParents worry about their child reading or writing when they are first learning about unschooling and the trust it entails. Those seem such tawdry worries to me now. Reading and writing are easy to learn. What about human connections, learning how to show compassion when someone makes you angry? What about being able to converse in logical terms with your child, in order to make sense of a difficult moment? Or having a child that gets angry when you&#39;re trying to do the exact thing they requested? I longed for those subjects. Reading and writing would come. Human interactions are much more complicated.<br/>\n<br/>\nWe still have cycles of intensity. But the &quot;good days&quot; are more and more frequent, they seem to move into good weeks and good months. The low cycles are less intense, the melt-downs short-lived and easier to handle now.<br/>\n<br/>\nMy trust is not placed in therapy or a label. My trust is in my child, in who-he-is and where we all are today in this very moment. My trust is in the fact that we humans learn and grow in our own way, on our own terms and the freedom to do so is paramount to healthy development. My trust is in the fact that all of my children are perfect and beautiful and fully loved.<br/>\n<br/>\nRen Allen<br/>\n<br/>\nInfobox:<br/>\n<br/>\nThe good things<br/>\n<br/>\nWe often focus on the problems and difficult parts of having a child with âspecial needsâ, which is understandable. But there are so many very cool things they bring into our lives too.<br/>\n<br/>\n- They seem to hone in on the really cool people very quickly! If someone is unkind or impatient it will surface early on. The most incredible friends who stick will be the people who are deep wells of inspiration, kindness and creative thinking.<br/>\n<br/>\n- In my case, Jalen is as intensely happy and creative as he is angry and destructive. The phrases and thinking that come from him are amazing! He&#39;s a constant stream of interesting and funny moments.<br/>\n<br/>\n- A lot of these children fit the label &quot;right-brained&quot;. I think that the left-brain/right-brain model is outdated but if you look at the character traits the model displays, many of the &quot;sensitive&quot; or &quot;explosive&quot; types of children fit those traits. A left-brained focused educational model is disastrous for them. What a gift to see the world through their eyes... it&#39;s a world full of magic, hidden secrets, exploration and very unusual methods of discovery. I&#39;ll never forget the time he cut a hole in the couch; &quot;Tell me about this&quot; I query.<br/>\n<br/>\nHe went on to describe how he was curious about what was inside the couch and wanted to see what was in there. Often what looks like destruction is really a curious mind at work.<br/>\n<br/>\n- They dig deep into our own issues. Any kind of fear or baggage we carry, will be very quickly brought to the surface. There has been no greater growth in my life than parenting a child who stirs up stuff I didn&#39;t even know was there! He gives me many reasons to analyze my own behavior, to learn what it means to love unconditionally and face myself with compassion. When you can learn to love and hug a child that is angry or what is typically labeled as &quot;annoying&quot; you learn just what the depths of love can be.<br/>\n<br/>\n- You learn to accept the asynchronicities in other people. It&#39;s much easier to see people as unique and exactly-who-they-need-to-be when you realize that behavior stems from need and personality and a host of other factors. It&#39;s harder to lump people into &quot;mean&quot; or &quot;flaky&quot; or other such terms when you realize that. He&#39;s helped me learn that more completely.<br/>\n<br/>\n- Our entire family is much more open and willing to assist and support, to look at underlying needs and try to meet them rather than change someone else&#39;s behavior. We&#39;re still learning this but because of the intensities in some moments we&#39;re all better at supporting each other, even in the rough moments. He showed us that support is more important than any specific outcome.<br/>\n<br/>\n- Have I mentioned how very funny he is? According to the yin-yang of everything, people have both sides of whatever qualities they possess. It leads to some very interesting conversations, some of which I place at my blog so I never forget how wonderful they are!<br/>\n<br/>\n- He&#39;s helped me learn to truly BE in the moment. My best &quot;bhodisattva&quot; ever. I am reminded regularly, through his development that a person can only BE where they ARE today. Most &quot;intense&quot; or &quot;out-of-synch&quot; behaviors stem from a different developmental process. Just as babies learn to walk or talk at different times, each of us has a different developmental time table. There is no &quot;Normal&quot;, just what is normal for each of us. Comparing is disastrous. We live in the moment with each of our children, trusting that development is a lifelong unfolding that happens best in trust and support. You learn to trust more fully as an unschooling parent. He brings me back to trust over and over again.<br/>\n<br/>\n- A hug and a kiss can fix a lot. I&#39;ve learned to hug and/or kiss (depending on the child&#39;s willingness of course...Jalen is pretty physical) when that is the last thing I want to do. I find that when we tap into the love, even in the middle of a potentially stressful moment, it can diffuse it beautifully.<br/>\n<br/>\n- He&#39;s helped me learn to just go with the flow! Change directions, change a viewpoint, look deeper and trust that all is well.<br/>\n<br/>\nSpecial Tips for unusual needs<br/>\n<br/>\nRen Allen and Heather Newman have put some suggestions together for you. You will find out that the games and parenting tools for âspecial needsâ are also interesting and helpful for the normal everyday life with all kids. Allen and Newman point out that these suggestions are only a selection that helped themselves â&quot; without with no claim to be complete, and keeping in mind that all children are different.(1)<br/>\n<br/>\n&quot;Pushing&quot; games<br/>\n<br/>\nGames where partners push against each otherâs hands or press feet and &quot;pedal&quot; together. Resistance and pressure are helpful when these kids are feeling overwhelmed. Games that involve throwing balls (keep several styles with different textures and shapes) or large physical movement.<br/>\n<br/>\nEncourage Gross Motor Skills<br/>\n<br/>\nKeeping toys and areas available that involve gross motor skills; trampolines (mini size for indoors are great), climbing bars/walls, scooters, roller blades, obstacle courses etc...Swinging seems to be especially soothing.<br/>\n<br/>\nBrushes<br/>\n<br/>\nUsing a brush to rub the back, arms and legs. Standard brushes may be used, but some parents prefer the special therapy brushes. Some online shops carry many versions and other supportive tools.<br/>\n<br/>\nWater play<br/>\n<br/>\nGetting out to pools, lakes and rivers. At home very large bowls or buckets can be filled with water and pouring, squirting toys. Adding bubbles is a new layer of texture, not to mention a great way to get a child partially clean when they don&#39;t want a bath.<br/>\n<br/>\nSwaddling<br/>\n<br/>\nKeep enough blankets available, so that even older kids can swaddle; keep ace bandages around to wrap arms and legs.<br/>\n<br/>\nArt with no goal<br/>\n<br/>\nDrawing can frustrate at times (crayons and pencils break with too much pressure, too many ideas about what the drawing &quot;should&quot; look like etc..), so anything in which the textures are manipulated with hands or aimed at exploration rather than an end result,<br/>\n<br/>\ni.e. art that involves &quot;goo&quot; or textures of some kind... finger paint, melted crayons (press paper into pools of melted crayons), corn starch mixed with water (just to play with), tin foil sculptures etc...<br/>\n<br/>\nParenting tools that help:<br/>\n<br/>\nBeing proactive<br/>\n<br/>\nWhen going out of the home: bring toys, snacks etc... that you know will help you through a rough moment. True of all children but especially important if you know the senses might get overwhelmed.<br/>\n<br/>\nBeing creative<br/>\n<br/>\nFind ways to honor their need to stay home or go into situations where you might have difficulties. When going out, it helps to make sure that you have an &quot;out&quot; if a gathering might going to be difficult for the child.<br/>\n<br/>\nGo at their pace<br/>\n<br/>\nThis seems so obvious, but it can be important to mentally prepare yourself for instance that a normal grocery trip might be taking a lot longer or taking directions it wouldn&#39;t if it had been with other children. If for example grocery trips are especially difficult for the parent and/or the child, there mostly are solutions to carry shopping out without the child. Many parents try to never plan large trips.<br/>\n<br/>\nListening<br/>\n<br/>\nAgain, this seems obvious but sometimes when things are really intense or getting very illogical, itâs easy to follow the impulse to want to &quot;fix&quot; the situation. What many children need most in these situations, is someone to sit and sympathize and listen deeply. You can talk about the potential solutions or how to avoid the situation later. It can be difficult to sit and listen deeply when a child is hurling very angry statements at you. But the level of emotion can often times come back to balance much more quickly if children just feel heard... exactly what we all want when we feel out-of-control.<br/>\n<br/>\nBeing present<br/>\n<br/>\nWhen melt-downs are very intense and prolonged, for many parents it can be hard to know when to walk away and when to be near. For some children, touching or trying to hold them make things worse, plus for some of them, walking away makes it again even worse too.<br/>\n<br/>\nIt helps when parents are fully present, allowing all that intensity to roll right over. You can picture yourself for example as a mountain, with the wind and storms washing over but not affecting it. This picture makes it easier to stay connected to the child, but not react to the emotions of the moment. If canât decide between staying or leaving, the solution might be to stay near, just being present so that the child can feel safe.<br/>\n<br/>\nAdequate Clothing<br/>\n<br/>\nBe prepared to spend a lot of time finding socks or clothing that is comfortable! Don&#39;t insist on shoes unless absolutely necessary. Many kids are much happier barefoot. Slip-on sandals (the kind people wear at pools) are great!<br/>\n<br/>\nAvoid power struggles.<br/>\n<br/>\nThe most simple request can turn into a battle, even when you&#39;ve done everything &quot;right&quot;. Diffusing with humor is helpful. Turn it into a game if you can.<br/>\n<br/>\nGive lots of extra time for transitions<br/>\n<br/>\nTransitions can be very difficult. Being right next to the child as you try to transition to a different activity is best. Make them more appealing by keeping items/food nearby for helping smooth the transition.. Having to switching gears can also be hard for some people.<br/>\n<br/>\nWin-Win for everybody<br/>\n<br/>\nTo have &quot;How do we make this work for everyone?&quot; as your highest goal, helps the family to focus on working for better solutions, even if it seems nearly impossible at times, to find adequate solutions. If every family member knows their needs are important it smooths the process.<br/>\n<br/>\nAvoid thinking in labels!<br/>\n<br/>\nAvoid thinking of your child in terms of a label, even if you&#39;ve had a diagnosis. We all could attach labels to ourselves but it narrows our view of a person. Even &quot;gifted&quot; is harmful. Also the term &quot;intense&quot; can become a dangerous descriptor if it causes us to see that person through this lense. Maybe a behavior or moment was intense, rather than the person themselves.<br/>\n<br/>\nPeople need room to grow and change and not a description of something that they supposedly ARE. Labels don&#39;t help us stay connected to the changing people walking this journey with us. Itâs enough to just be ourselves.<br/>\n<br/>\n(1) Ren Allen and Heather Newman go an unusual way by dispensing with diagnoses and therapys. These suggestions and the reports neither replace a therapy, nor do they want to advice against an adequate or essential therapy. Please speak with your doctor or trusted expert if needed.<br/>\n<br/>\nInfobox<br/>\n<br/>\nReading suggestions:<br/>\n<br/>\n~The Explosive Child, by Ross Greene; explosivechild.com<br/>\n<br/>\n~Unconditional Parenting, by Alfie Kohn; Alfiekohn.org<br/>\n<br/>\n~The Highly Sensitive Child, by Elaine Aron; hsperson.com<br/>\n<br/>\n~I Am What I Am, article by Anne Ohman; livingjoyfully.ca/anneo/anne_o.htm</div>","specialLinks":[]},{"userId":458451437,"authorName":"couponlovinmama","from":"&quot;couponlovinmama&quot; &lt;wahmbrendamarie@...&gt;","profile":"couponlovinmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling with Asperger&#39;s","postDate":"1280149280","msgId":44605,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyazB2MCt0YXViQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkyaGU3MStnaHFqQGVHcm91cHMuY29tPg=="},"prevInTopic":44603,"nextInTopic":44609,"prevInTime":44604,"nextInTime":44606,"topicId":44599,"numMessagesInTopic":0,"msgSnippet":"My daughter has Asperger s but was never in school.  If you have any other questions, I d be glad to help. BrendaMarie TheChristianUnschool.com","messageBody":"<div id=\"ygrps-yiv-849072299\">My daughter has Asperger&#39;s but was never in school.  If you have any other questions, I&#39;d be glad to help.<br/>\n<br/>\nBrendaMarie<br/>\nTheChristianUnschool.com<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;elguthaus&quot; &lt;eguthaus@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; What are people&#39;s experiences with this?  Especially in regards to deschooling.  Was making the switch from PS to US helpful?  More challenging?  Any and everything would be helpful at this point, thanks!<br/>\n&gt; <br/>\n&gt; Grace!<br/>\n&gt; <br/>\n&gt; Erica<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":223327279,"authorName":"Faith Void","from":"Faith Void &lt;littlemsvoid@...&gt;","profile":"bloodyknucklesclub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] Unschooling with Asperger&#39;s","postDate":"1280142859","msgId":44600,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrN1p6dTFueDdoaCs5eEVma25aQUF3Y0FlVUdENFZ0WWg0blF0ZEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGkyaGU3MStnaHFqQGVHcm91cHMuY29tPg==","referencesHeader":"PGkyaGU3MStnaHFqQGVHcm91cHMuY29tPg=="},"prevInTopic":44599,"nextInTopic":44601,"prevInTime":44599,"nextInTime":44601,"topicId":44599,"numMessagesInTopic":0,"msgSnippet":"I have not dealt with this specifically. I have atypical kids, though. I think that the perspective shift is needed whether your child/ren are neuro-typical or","messageBody":"<div id=\"ygrps-yiv-16069460\">I have not dealt with this specifically. I have atypical kids, though. I<br/>\nthink that the perspective shift is needed whether your child/ren are<br/>\nneuro-typical or not. Unschooling does not look the same in all households<br/>\nbut there are a few similarities. One is loving guidance without arbitrary<br/>\nrules. This is NOT &quot;no rules&quot; &quot;free for all&quot; or &quot;chaos and craziness&quot;. This<br/>\nis how to partner with your child/ren and find ways to say &quot;yes&quot; more and<br/>\nfor everyone (including you) to feel listened to and considered. This means<br/>\nas a parent you may need to stretch your boundaries, be a bit uncomfortable<br/>\nand search for ways to heal yourself from the way you were raised. It is<br/>\nabout helping your child/ren be who they are in the world (however that may<br/>\nbe).<br/>\n<br/>\nMy opinion is that parents are the ones that really need to deschool. Take a<br/>\nbunch of time to read and watch videos about unschooling and gentle<br/>\nparenting. Take time to reflect on your &quot;reactive&quot; parenting, where is it<br/>\ncoming from? What can you do to heal? There is a wealth of great unschooling<br/>\nresources out there.<br/>\n<br/>\nA few to start:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n<br/>\nShine is a list (like this one) that is a fit for some families with<br/>\natypical kids. <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/ShineWithUnschooling/\">http://groups.yahoo.com/group/ShineWithUnschooling/</a><br/>\n<br/>\nwww.EnjoyLifeUnschooling<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling\">http://sandradodd.com/unschooling</a><br/>\n<br/>\nand some videos:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/user/DaynaLeighMartin\">http://www.youtube.com/user/DaynaLeighMartin</a><br/>\n<br/>\nThere is a wealth out there, this is only a small sampling. Most of these<br/>\nwebsites have links to other websites/resources on there. You could read and<br/>\nfollow all day :-)<br/>\n<br/>\nFaith<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sun, Jul 25, 2010 at 9:29 AM, elguthaus &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:eguthaus@...\">eguthaus@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; What are people&#39;s experiences with this? Especially in regards to<br/>\n&gt; deschooling. Was making the switch from PS to US helpful? More challenging?<br/>\n&gt; Any and everything would be helpful at this point, thanks!<br/>\n&gt;<br/>\n&gt; Grace!<br/>\n&gt;<br/>\n&gt; Erica<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nwww.bearthmama.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unschooling with Asperger&#39;s","postDate":"1280080774","msgId":44603,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyaHUyNis1aGViQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkyaGU3MStnaHFqQGVHcm91cHMuY29tPg=="},"prevInTopic":44602,"nextInTopic":44605,"prevInTime":44602,"nextInTime":44604,"topicId":44599,"numMessagesInTopic":0,"msgSnippet":"... ************* Exactly the same as any other kid - which is to say that while unschooling (and deschooling) are different for everyone, the principles","messageBody":"<div id=\"ygrps-yiv-1098265932\">&quot;elguthaus&quot; &lt;eguthaus@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; What are people&#39;s experiences with this?  Especially in regards to deschooling.<br/>\n </span></blockquote>*************<br/>\n<br/>\nExactly the same as any other kid - which is to say that while unschooling (and deschooling) are different for everyone, the principles remain the same. <br/>\n<br/>\nIt can be helpful to think of deschooling as a sort of &quot;decompression&quot; period - kids get squashed down in school and need time to expand back into their natural shapes, as it were. How that happens depends entirely on the personality and temperament of the child in question and how much he or she has been &quot;compressed&quot; by school. <br/>\n<br/>\nYou&#39;ll probably have better luck finding information useful to you if you look for stories about kids who&#39;ve left school at similar ages to yours. That&#39;s really a bigger common factor than anything else - and even there you&#39;ll find a big range of reactions.  <br/>\n<br/>\nHere are a few links to get you started, but it can be more helpful to ask specific questions - what are your actual concerns? That your kid will do little but watch tv? That&#39;s one way kids decompress, so you could see a Lot of tv watching for as much as a couple years. Watch together and enjoy rediscovering your child while he or she rediscovers joy. <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/beginning\">http://sandradodd.com/beginning</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n(left hand side, half way down the page to &quot;deschooling&quot;)<br/>\n<br/>\nThere are a lot of unschooling blogs linked here that might also be helpful for you:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://enjoylifeunschooling.com/\">http://enjoylifeunschooling.com/</a><br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":441747317,"authorName":"elguthaus","from":"&quot;elguthaus&quot; &lt;eguthaus@...&gt;","profile":"elguthaus","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Unschooling with Asperger&#39;s","postDate":"1280064545","msgId":44599,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyaGU3MStnaHFqQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":44600,"prevInTime":44598,"nextInTime":44600,"topicId":44599,"numMessagesInTopic":0,"msgSnippet":"What are people s experiences with this?  Especially in regards to deschooling.  Was making the switch from PS to US helpful?  More challenging?  Any and","messageBody":"<div id=\"ygrps-yiv-1150994307\">What are people&#39;s experiences with this?  Especially in regards to deschooling.  Was making the switch from PS to US helpful?  More challenging?  Any and everything would be helpful at this point, thanks!<br/>\n<br/>\nGrace!<br/>\n<br/>\nErica</div>","specialLinks":[]}],"prevTopicId":44607,"nextTopicId":44610}}