{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":193844353,"authorName":"Nicole Willoughby","from":"Nicole Willoughby &lt;cncnawilloughby@...&gt;","profile":"cncnawilloughby","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Fwd: Rethinking Education Conference Update: 4/21/07","postDate":"1177364049","msgId":23358,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5ODE5MC4zNDQwMS5xbUB3ZWIzMTkwMi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDcyNjQ5Ni4zMjA3OC5xbUB3ZWIzMjExNS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":23355,"nextInTopic":0,"prevInTime":23357,"nextInTime":23359,"topicId":23355,"numMessagesInTopic":0,"msgSnippet":"So I looked at this conferance then realized that its only an hour away from me !!! But Im still really broke :( . so my questions ....Do kids under a certain","messageBody":"<div id=\"ygrps-yiv-136440753\">So I looked at this conferance then realized that its only an hour away from me !!! But Im still really broke :( . <br/>\n   <br/>\n  so my questions ....Do kids under a certain age get in free? Im assuming kids can come? <br/>\n   <br/>\n  nicole <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nAhhh...imagining that irresistible &quot;new car&quot; smell?<br/>\n Check outnew cars at Yahoo! Autos.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":64419796,"authorName":"Nichole Fausey-Khosraviani","from":"Nichole Fausey-Khosraviani &lt;ms_fausey@...&gt;","profile":"nichole_fausey_khosraviani","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fwd: Rethinking Education Conference Update: 4/21/07","postDate":"1177347231","msgId":23355,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcyNjQ5Ni4zMjA3OC5xbUB3ZWIzMjExNS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":23358,"prevInTime":23354,"nextInTime":23356,"topicId":23355,"numMessagesInTopic":0,"msgSnippet":"If you have questions about attending the conference, payment, volunteering, or anything... just ask.  You can write me at ms_fausey@yahoo.com, or you can","messageBody":"<div id=\"ygrps-yiv-203219348\">If you have questions about attending the conference, payment, volunteering, or anything... just ask.  You can write me at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ms_fausey@...\">ms_fausey@...</a>, or you can contact Barb Lundgren at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb@...\">barb@...</a>. <br/>\n   <br/>\n  I can&#39;t wait to see you there!  It&#39;s going to be a great conference.  And remember, this is 100% unschooling, so come on out and immerse your family in all the joy and freedom this weekend affords.<br/>\n   <br/>\n  :o)<br/>\n  Nichole<br/>\n<br/>\nBarb Lundgren &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb@...\">barb@...</a>&gt; wrote:<br/>\n  Date: Mon, 23 Apr 2007 06:01:33 -0400 (EDT)<br/>\nFrom: Barb Lundgren &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb@...\">barb@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ms_fausey@...\">ms_fausey@...</a><br/>\nSubject: Rethinking Education Conference Update: 4/21/07<br/>\n<br/>\n                                  Rethinking Education Conference NEWS <br/>\n    Labor Day Weekend, Aug. 30 - Sept. 3 <br/>\n            In today&#39;s UPDATE: Monday, April 21<br/>\n  :: 2007 Highlights: Brenda Morgan<br/>\n  :: JOIN US!<br/>\n  :: Other 2007 Conference Speakers<br/>\n  :: Register Today for BIG SAVINGS!<br/>\n  :: Consensual Living for Unschool Families<br/>\n  :: What To Do NOW<br/>\n  :: MORE 2007 Highlights: JANEEN NICHOLAS<br/>\n<br/>\n              Greetings!<br/>\n    The 11th national conference on Rethinking Education is Labor Day Weekend: Thursday, August 30 - Monday, September 3, 2007 at the Sheraton Grand Hotel in Irving, Texas , just minutes from Dallas and the DFW Airport. A complimentary shuttle runs to and from the hotel - airport 24 hours a day.<br/>\n  Our website contains up to date information on our program, registration, and all details! Out-of-the-box, fun and provoking sessions for adults, teens, tweens and kids of all ages, all weekend... 5 days! <br/>\n  REGISTER by April 28 and receive a $50 discount per person! EARLY REGISTRATION ENDS IN ONE WEEK <br/>\n  ONE WEEK!!! <br/>\n  ONE WEEK!!! <br/>\n  VOLUNTEER to further reduce your cost. Check out the volunteer jobs available on our conference website. <br/>\n  We still have SO MUCH to tell you in our updates. Complete information and is available on our website, and we will be adding to the program throughout the summer. <br/>\n<br/>\n                      2007 Highlights: Brenda Morgan<br/>\n  <br/>\n   BRENDA MORGAN<br/>\n  &quot;The good traveler has no fixed plans and is not intent on arriving.&quot; -Lao Tzu <br/>\n<br/>\n<br/>\nBrenda hosts:<br/>\n  Re-Inventing the American Dream: Learning to Live with Less<br/>\n  Brenda will inspire/assist those willing in de-cluttering their lives of excessive material possessions, reconnecting with the dream we wish we were living, reforming our attitudes towards wilderness and wildlife, aligning our spiritual beliefs with the manner in which we walk in the world, and focusing on personal action that will lead to a healthier planet and unencumbered, debt free lives.<br/>\n<br/>\n                    JOIN US!<br/>\n  <br/>\n  Join hundreds of unschooling families from around the globe as we rethink the meanings of education, learning and parenting. Rethinking Education supports attachment parenting, unconditional love, support for each person&#39;s unique journey of life experience, freedom with responsibility, unschooling and you. YOU are the vital ingredient at this conference, as we come together and revel in the magic and mystery of kindred spirits and each other&#39;s rich diversity, as we challenge ourselves to trust the extraordinary process of living and learning, the wondrous ability to improve the ways we communicate, discovering new ways of listening to one another, giving full support to our dreams, no matter how wild or ordinary, large or small.<br/>\n  Unschooling is vital to the profoundly intelligent development of our children. And yes, as adults we can even unschool ourselves... as you will discover.<br/>\n            Sign up for Email Updates       [input]   [input]  Email:  [input]   [input]  <br/>\n   <br/>\n  <br/>\n<br/>\n                    <br/>\n   Let us put our minds together and see what we will make for our children.<br/>\n  Chief Sitting Bull<br/>\n<br/>\n  <br/>\nPlease forward this email update to your friends!<br/>\n  Did you know you can forward this entire, fully formatted update to all your friends and relatives who may want to attend the Rethinking Education 2007 conference? It&#39;s easy! Go to the bottom of this update and click on &quot;forward email&quot;. You can even send your friends a message to let them know how much you want them to attend. We look forward to having a broad and diverse community of unschool families with us this year.<br/>\n<br/>\n                    Other 2007 Conference Speakers<br/>\n  <br/>\n  These are just some of the OUTSTANDING speakers we&#39;ve lined up for the Rethinking Education Conference 2007:<br/>\n      <br/>\n   John Taylor Gatto  <br/>\n   Michael Mendizza  <br/>\n   Ren Allen  <br/>\n   Peter Kowalke<br/>\n  <br/>\n  And oh so many more!<br/>\n<br/>\n                    Register Today for BIG SAVINGS!<br/>\n    REGISTER by April 28 and receive a $50 discount per person! HURRY! EARLY REGISTRATION ENDS IN ONE WEEK!<br/>\n<br/>\n <br/>\n                        Consensual Living for Unschool Families<br/>\n  <br/>\n  For those of you wishing to effect revolutionary, egalitarian change within your families, you will want to sign up for the special seminar series conducted during the conference weekend by Tracy Liebman. Tracy is an unschool mom and consensual living therapist. For an additional fee of $100 per family, you will be guided, nurtured and privately counseled to implement consensual methods to your family&#39;s communication and decision-making. Rest assured, Tracy&#39;s style is very loving and supportive, open and heartfelt... and you will still have plenty of time to attend a huge number of the weekend&#39;s other sessions! See the conference website for full details on the Consensual Living program. Sign up on your Registration Form. Open to 8 families only, and there are only a few spots that remain.<br/>\n<br/>\n                    What To Do NOW<br/>\n    Register... You must attend!<br/>\n<br/>\n   The Early Bird Registration discount ends on April 28 - that&#39;s just 1 week away!<br/>\n  There are many ways to register!<br/>\n  CALL Barb at 817.540.6423<br/>\n  EMAIL <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb@...\">barb@...</a><br/>\n  DOWNLOAD a Registration Form & MAIL or FAX it.<br/>\n  Fax to: 817.545.3599<br/>\n  MAIL to: 3013 Hickory Hill, Colleyville, Texas... 76034<br/>\n<br/>\n                    MORE 2007 Highlights: JANEEN NICHOLAS<br/>\n  <br/>\n   Janeen Nicholas is a former career woman with two M.A. degrees in her past life, and is now a happy unschooling mom to one lively kindergartener, and life-long learner herself. After one career in education (teaching and being the special education director for a public school system), and another career in software design, and a third in six sigma consulting, I have come full-circle, educating my own child at home. She lives in the Dallas/Fort Worth area with her husband, daughter, dog, and fish. Active in my local homeschooling community, and currently the coordinator of Spirit Play programming in my UU (Unitarian Universalist) church, she regularly leads Spirit Play classes for young children. Janeen bakes all her own bread with wheat that she grinds herself, loves plays and roller coasters, and enjoys being able to travel to wonderful places as a family while the rest of the world is in school.<br/>\n  Janeen will host:<br/>\n  Child-Centered Spirituality: When Kids Ask the Big Questions<br/>\n  Explore how to become the facilitator in the process your child goes through in thinking about their own unique spiritual path, as differentiated from the traditional model of telling children what they should believe. Janeen will focus on introducing children to many different spiritual ideologies geared just for their young ages, and then prompt them to wonder about those ideas and continue a thoughtful inquiry. This session is particularly suited to parents and their children aged 3-8, but all ages are welcome. Janeen&#39;s guidance is directed toward parents, and one or more stories will be told to the children as examples. Stories will be drawn from the Unitarian Universalist Spirit Play Stories from the following list: The Wise People and the Elephant (Traditional Buddhist Parable) Hide and Seek with God by Mary Ann Moore (Many Paths/UU) Small Fry by Ruthilde Kronberg & Patricia C. McKissack (Secular Humanist) Day of the Dead by Tony Johnston (Mexican traditional<br/>\n celebration) The Empty Pot by Demi (Chinese folk tale) The Mountains of Tibet by Mordicai Gerstein (Hindu)<br/>\n  Child-Centered Spiritual Journeys<br/>\n  Throughout the weekend in short, 15 minute periods, Janeen will invite children to listen to thought-provoking stories of a spiritual nature and to explore them in their own ways. Stories are presented in the style shown in the Child Centered Spirituality session, in which children are encouraged to explore their own spiritual uniqueness, as differentiated from the more traditional model of telling children what to believe. The stories will be drawn from a variety of faiths, including Theist, Buddhist, Hindu, and Humanist, each with many possible interpretations. Each short session will include the presentation of one story, followed by encouragement of the children to process the ideas presented and to draw their own conclusions. Geared for ages 3-8, but all ages are welcome.<br/>\n<br/>\n        <br/>\n                      Our conference is provoking, outrageous, inspiring and mind-blowing... for the whole family. Grandparents attend free! Speakers include: <br/>\n  John Taylor Gatto, Ren Allen, Peter Kowalke, Tracy Liebmann, Michael Mendizza, Cindy Gaddis, Eli Gerzon, Debbie Shapiro ... so many more! <br/>\n  Our wildly popular kid and teen activities include: <br/>\n  Kid Village, Teen & Tween Village, non-stop, out-of-the-box art, unprom, yoga, dance, gobs of extraordinary sessions.... <br/>\n  Wait! There&#39;s more.... <br/>\n  Talent Show, Recycled Resource Fair, Family Vendor Fair, Silent Auction, Grateful Space, Monster Pickup Sticks... we&#39;re even building a Yurt! <br/>\n<br/>\nCall or email Barb Lundgren with questions or to register!   Rethinking Education <br/>\n  email: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb@...\">barb@...</a> <br/>\n  phone: 817.540.6423 <br/>\n  web: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.rethinkingeducation.com\">http://www.rethinkingeducation.com</a> <br/>\n<br/>\n<br/>\n        Register by April 28 for HUGE SAVINGS!!!    REGISTER by April 28 and receive a $50 discount per person . . .that&#39;s just $75 for 5 incredible, action-packed, life changing days... and Grandparents are free! <br/>\n  Check it out now... <br/>\n      <br/>\n<br/>\n<br/>\n                Forward email<br/>\n<br/>\n       This email was sent to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ms_fausey@...\">ms_fausey@...</a>, by <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb@...\">barb@...</a><br/>\n  Update Profile/Email Address | Instant removal with SafeUnsubscribe | Privacy Policy.<br/>\n    Email Marketing by<br/>\n     <br/>\nRethinking Education | 3013 Hickory Hill Lane | Colleyville | TX | 76034 <br/>\n<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nAhhh...imagining that irresistible &quot;new car&quot; smell?<br/>\n Check outnew cars at Yahoo! Autos.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":23348,"nextTopicId":23385}}