{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: computer usage","postDate":"1340074608","msgId":48638,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyb3BwZytkN28zQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBR0hqS3NVb0FoVy1MVXR6dU04QkFZR0Y2bzB3eE4yT1J4ZjB1YTdYTDU1dnJka2ZWd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":48635,"nextInTopic":0,"prevInTime":48637,"nextInTime":48639,"topicId":48630,"numMessagesInTopic":0,"msgSnippet":"... I hadn t read this yet when I posted my other message, where i asked about whether she likes to read. ... What does your husband do for a living? Is he","messageBody":"<div id=\"ygrps-yiv-1098598991\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, T McAdams &lt;tmcadams81670@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; .... I read to her for hours at a time. ... we watch television<br/>\n&gt; together, we go to the Library ALL of the time. She is an avid<br/>\n&gt; reader. <br/>\n<br/>\n </span></blockquote>I hadn&#39;t read this yet when I posted my other message, where i asked about whether she likes to read. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My husband just sees no intrinsic value to being on the computer,<br/>\n&gt; period.<br/>\n<br/>\n </span></blockquote>What does your husband do for a living? Is he disdainful of all the people who make their livings with computers? <br/>\n<br/>\nDoes he value knowledge? It seems to me that the internet is a window to the world - which I also think is true of TV. But with the internet, there&#39;s so much more choice! Music, art, theater, animals, gardening, space, (all sciences, actually), home repair, foreign languages, other cultures, news and politics, comedy/humor, literature, EVERYTHING is online! <br/>\n<br/>\nAnd then there&#39;s the whole keeping in touch with distant friends thing. Does your husband think that talking to friends is a waste of time? (I could see how some men might think that - some men who are not very talkative think that girls are TOO talkative/chatty; not sure what to say to a dad who doesn&#39;t respect his daughter&#39;s need to talk to friends, though.)<br/>\n<br/>\nWhen I was your daughter&#39;s age, I would have wanted to keep in touch with distant friends by phone. But toll calls were expensive back then, so my parents wouldn&#39;t have been able to afford to let me spend hours talking to a friend in another state. With the internet, and Skype or Facebook chat, your daughter can spend ours talking to her friend for no extra cost! That aspect of the internet makes the computer into a videophone - which we have all come to take for granted, but it&#39;s really pretty cool, when you think about it! (And, of course, the typing-chat develops literacy. Surely your husband didn&#39;t call THAT bullshit!) <br/>\n<br/>\nAnyway, with computers and the internet being a combination of the sum of almost all human knowledge and thought and literature and artistic expression, AND a medium for social interaction, that seems like an awful lot NOT to value!<br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":490338839,"authorName":"Tina M","from":"&quot;Tina M&quot; &lt;tmcadams81670@...&gt;","profile":"tinamc81670","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: computer usage","postDate":"1340057220","msgId":48635,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpybzhxNCtzMGRkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdDN0Q4QTA0LTE1ODUtNEI5Ny05QTY5LUY3MzlDRTVBQUE1RkB2ZXJpem9uLm5ldD4="},"prevInTopic":48632,"nextInTopic":48638,"prevInTime":48634,"nextInTime":48636,"topicId":48630,"numMessagesInTopic":0,"msgSnippet":"My husband has been slow to assimilate into unschooling. He is usually very laid back about what we do and does see instrinsic value in unschooling. In his","messageBody":"<div id=\"ygrps-yiv-415855113\">My husband has been slow to assimilate into unschooling. He is usually very laid back about what we do and does see instrinsic value in unschooling. In his words &quot;it makes sense for children to pursue what they want to learn.&quot;  It&#39;s great! From when we started to homeschool up until now he has changed so much. I&#39;m not sure what he thinks she&#39;s NOT learning, it&#39;s just that he sees her on the computer so much in his esteem. He&#39;s convinced that what she is doing cannot possibly be learning in any sense of the word. If she were visiting educational websites he would probably change his mind. I pretty much let her have her fill. And she does have her fill (it just doesn&#39;t seem that way sometimes). She is a very active 11.5 y/o. In addition to having pool & beach time she is a gymnast and is at practice 3 days a week at 4h at a time. She LOVES the New Moon magazines. She also gets Ask and Muse. She just does not stop reading. Thank you for those that tweaked my thinking into looking at if I am valuing what he values as her education. I don&#39;t want to undermine him or effect their relationship.<br/>\n<br/>\nTina<br/>\nin South Florida</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] computer usage","postDate":"1340041405","msgId":48632,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdDN0Q4QTA0LTE1ODUtNEI5Ny05QTY5LUY3MzlDRTVBQUE1RkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PENBR0hqS3NVb0FoVy1MVXR6dU04QkFZR0Y2bzB3eE4yT1J4ZjB1YTdYTDU1dnJka2ZWd0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBR0hqS3NVb0FoVy1MVXR6dU04QkFZR0Y2bzB3eE4yT1J4ZjB1YTdYTDU1dnJka2ZWd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":48631,"nextInTopic":48635,"prevInTime":48631,"nextInTime":48633,"topicId":48630,"numMessagesInTopic":0,"msgSnippet":"... But what does he want to see? What would make him feel comfortable that she s learning? What is his interaction with her on the computer? Is he coming home","messageBody":"<div id=\"ygrps-yiv-445077744\">On Jun 18, 2012, at 10:32 AM, T McAdams wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; These are the things she enjoys doing on the computer.<br/>\n<br/>\n </span></blockquote>But what does he want to see? What would make him feel comfortable that she&#39;s learning?<br/>\n<br/>\nWhat is his interaction with her on the computer? Is he coming home and then seeing nothing but computer use? It&#39;s bound to give him a skewed vision of what she&#39;s doing all day. Actions will speak louder than words.<br/>\n<br/>\nCan you get hold of some of the New Moon magazines? Your library might be able to borrow some if they don&#39;t&#39; have them. My husband actually enjoyed reading those with our daughter, especially the stories of girls from all over the world pursuing their passions.<br/>\n<br/>\nI really wouldn&#39;t try to convince him the computer is fine. I&#39;d focus on helping him feel comfortable that she&#39;s learning.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: computer usage","postDate":"1340040445","msgId":48631,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpybm9kdCtubGMyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBR0hqS3NVb0FoVy1MVXR6dU04QkFZR0Y2bzB3eE4yT1J4ZjB1YTdYTDU1dnJka2ZWd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":48630,"nextInTopic":48632,"prevInTime":48630,"nextInTime":48632,"topicId":48630,"numMessagesInTopic":0,"msgSnippet":"... *************** If he doesn t value the computer, it may be better to pitch all the other things your daughter is doing to show him she s not wasting","messageBody":"<div id=\"ygrps-yiv-332993091\">T McAdams &lt;tmcadams81670@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; My husband just sees no instrinsic value to being on the computer, period.<br/>\n </span></blockquote>***************<br/>\n<br/>\nIf he doesn&#39;t value the computer, it may be better to &quot;pitch&quot; all the other things your daughter is doing to show him she&#39;s not wasting away, doing nothing with her time. Rather than trying to change his mind, reassure him.<br/>\n<br/>\nYou didn&#39;t say what he thought about unschooling/natural learning. How does he define learning? What are his values? What are his hopes and fears where his daughter is concerned? You don&#39;t seem to be taking his concerns seriously, and that&#39;s a problem because it means you&#39;re undermining your daughter&#39;s relationship with her father. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":490338839,"authorName":"T McAdams","from":"T McAdams &lt;tmcadams81670@...&gt;","profile":"tinamc81670","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: computer usage","postDate":"1340029954","msgId":48630,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBR0hqS3NVb0FoVy1MVXR6dU04QkFZR0Y2bzB3eE4yT1J4ZjB1YTdYTDU1dnJka2ZWd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":48631,"prevInTime":48629,"nextInTime":48631,"topicId":48630,"numMessagesInTopic":0,"msgSnippet":"Hello all! Thanks for all of the good feedback. In response to the woman that mentioned being outdoors and in nature I wanted to respond that we spend a lot of","messageBody":"<div id=\"ygrps-yiv-1166248529\">Hello all!<br/>\n<br/>\nThanks for all of the good feedback. In response to the woman that<br/>\nmentioned being outdoors and in nature I wanted to respond that we spend a<br/>\nlot of time outside. We are at the pool or at the beach sometimes everyday.<br/>\n<br/>\nThese are the things she enjoys doing on the computer. We moved from MN to<br/>\nSouth Florida 8 months ago. She stays in close contact with a dear friend<br/>\nof hers. They will talk for hours sometimes. Her friend is older than her<br/>\nand she has asked him to correct her punctuation and grammar mistakes - so<br/>\nthat&#39;s a total plus since it&#39;s not coming from me it doesn&#39;t feel like<br/>\nschool. He needed punctuation to understand what she was saying and she<br/>\nneeds to stay in contact with a dear friend. She spends a lot of time on a<br/>\nwebsite called New Moon Girls. It&#39;s for girls her age where all things<br/>\ngirl-related are discussed. Puberty, boys, self esteem, bullying, et al.<br/>\nShe will just sometimes sit here and read thread after thread. She also is<br/>\nentrenched in another social media website Everloop. Everloop is like<br/>\nFacebook for the younger age set. Both websites have strong parental<br/>\ninvolvement and moderators to make sure that predators stay away and that<br/>\nthe conversation stays relevant and safe. On the Everloop website she posts<br/>\npictures, she creates detailed bios, she chats w/friends. She knows how to<br/>\ndo things that I don&#39;t know how to do with the computer. Also, to the woman<br/>\nthat was talking about music - my daughter does the same thing, too. She<br/>\nwill find a new artist she likes and will then wiki the person and even<br/>\ntake a step further and get the CD from the Library. I don&#39;t want to give<br/>\nthe impression that all that my daughter does is stay on the computer. We<br/>\nare a highly involved family with each other. She is an only child and<br/>\nright now because of a lot of different factors her Father and I are her<br/>\nonly playmates. It&#39;s working beautiful and it&#39;s very timely. It&#39;s what is<br/>\nmeant to be in this moment. I read to her for hours at a time. We take long<br/>\nbaths together, we have a lot of lap time, we watch television together, we<br/>\ngo to the Library ALL of the time. She is an avid reader. To say she is<br/>\npassionate about reading is an understatement. She doesn&#39;t visit<br/>\neducational websites. What interests her right now is being an adolescent<br/>\nand socializing with friends online. She&#39;s exploring who she is through<br/>\nmusic and books. She is going through a major growth spurt both physically<br/>\nand mentally. She&#39;s a good egg. I love the smell of summer on her<br/>\nshoulders. Bliss.<br/>\n<br/>\nMy husband just sees no instrinsic value to being on the computer, period.<br/>\n<br/>\nThanks again!<br/>\n<br/>\nTina<br/>\nin South Florida (soon to be back in the PNW in Salem, OR).<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":48603,"nextTopicId":48613}}