{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: On the fence with an almost first-grader...","postDate":"1333003461","msgId":48123,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsMTBjNStxOXBmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGprdG4zaytkbHB2QGVHcm91cHMuY29tPg=="},"prevInTopic":48121,"nextInTopic":48124,"prevInTime":48122,"nextInTime":48124,"topicId":48109,"numMessagesInTopic":0,"msgSnippet":"... Just as it s difficult for parents who went through the public school system to let go of the system s notions about grade levels and keeping up and","messageBody":"<div id=\"ygrps-yiv-676025529\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;stitchingmama&quot; &lt;stitchingmama@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; ... it is really hard for me to fully let go of the idea of some<br/>\n&gt; form of &quot;school at home.&quot; <br/>\n&gt; ... Her interests are almost exclusively centered around art - <br/>\n&gt; ... and I have to say, my limited exposure to and fondness for<br/>\n&gt; certain aspects of the Waldorf method have me feeling ENORMOUSLY<br/>\n&gt; guilty for letting her have any video game/TV access), <br/>\n&gt; ....I am having a hard time letting go of my own roots as a school-<br/>\n&gt; at-home homeschooler <br/>\n&gt; ... we were talking about how she&#39;s still having trouble reading<br/>\n&gt; numbers 30-100 and doesn&#39;t focus well when we do school time...how<br/>\n&gt; does one even begin to get away from these fears???<br/>\n&gt; ... Maybe what I&#39;m hoping to hear is some input from moms who have<br/>\n&gt; been this longer, but started &quot;from the beginning&quot; - who&#39;s kids DID<br/>\n&gt; eventually start reading (when they were ready), writing and doing<br/>\n&gt; math. ......<br/>\n<br/>\n </span></blockquote>Just as it&#39;s difficult for parents who went through the public school system to let go of the system&#39;s notions about grade levels and &quot;keeping up&quot; and &quot;what every child needs to know&quot;, it makes sense that it&#39;s difficult for you, who were raised with school-at-home to accept that that might not be the best way to raise your children.<br/>\n<br/>\nI didn&#39;t unschool my kids from the start. They did go to school for the first few years.<br/>\n<br/>\nBut one of the sources that gave me the most confidence in unschooling (other than actual older unschooling parents in my local group whose kids were unschooled from the start and who all ended up going to college or learning a trade) is the Sudbury Valley School website! sudval.org<br/>\n<br/>\nThe Sudbury Valley School has been letting its students choose how to spend their time, and what and when and how to learn, for nearly 50 years! There are some great articles on their website, and there are books about the school, and there&#39;s a documentary about it on YouTube (broken up into 14 parts, I think). ALL of the kids who went to SVS all along and graduated in their teens were able to read, write, and do whatever math they needed to do to accomplish their goals in life! And none of them had EVER been forced to sit and do &quot;schoolwork&quot;, or learn on someone else&#39;s schedule. <br/>\n<br/>\nNow, it&#39;s true that the kids at SVS have daily interaction with each other, and that the younger kids are influenced by the older ones, whereas unschooled kids are NOT spending their days with a large group of other kids all day, 5 days a week. But the fact that kids learn what they want or need to know, when they want/need to know it, as long as they have access to the necessary resources, applies equally to unschooled kids.<br/>\n<br/>\nAbout your guilt over not adhering to the Waldorf School&#39;s &quot;no electronic media&quot; principle - In my opinion, that part of their philosophy is ridiculous. My daughter&#39;s best friend, Jessie, went to a Waldorf School for a couple of years. I remember her parents asking me not to let her watch TV or play computer games when she was at our place. And I remember Jessie zoning out in front of the TV when the girls did turn it on anyway. It was almost impossible to get her away from the TV! I always assumed that was because her parents weren&#39;t letting her watch any TV at home, and it was like she was desperate to enjoy it while she could. My kids never had restrictions on TV watching, and they never got so sucked in to it that they tuned out the rest of the world or refused to stop watching if necessary. (We did always have a VCR to record something to watch later, if they had to stop watching in the middle of a show for any reason.)<br/>\n My daughter used to go to the Waldorf School festivals with her friend, and those festivals always included all kinds of really cool crafts. The school also had summer art camps that Jessie went to, where she created all kinds of awesome art projects. I loved their emphasis on art, and on folk tales. I loved the fact that the kids created their own &quot;textbooks&quot;, rather than using published ones. And I loved the fact that there was no homework. And that the same teachers taught the same group of children year after year, so as to develop an emotional bond with them. <br/>\n I would say, take what you really believe is good from the Waldorf approach, and forget the rest. If you think that using electronic media is good for kids, then you needn&#39;t feel guilty about it just because of the philosophy of a school that your daughter doesn&#39;t even go to. <br/>\n By the way, Jessie&#39;s parents took her out of the Waldorf school after 2 years and started homeschooling (starting in 6th grade). Throughout her teen years, she took art classes at a community college. She is now 19, is a phenomenal artist, and has a job teaching art at a boarding school in New Mexico!<br/>\n<br/>\nThere is no real reason that your child needs to be able to read a certain group of numbers (or read at all) by the time she&#39;s 5 or 6. Some kids really, developmentally, aren&#39;t ready to read until they&#39;re much older. Especially artistic kids, who are right-brain-dominant. A Right-Brained learner&#39;s NORMAL time-frame to start learning to read and write and do abstract math is ages 8-10, according to a lot of research. There is a Yahoo group for homeschool parents of Right-Brained kids, called homeschooling creatively. It&#39;s not an unschool list, so a lot of questions do come up about curriculum choices. But there are also a lot of unschoolers there. It&#39;s very reassuring to a lot of parents of kids who seem to be learning to read, write, and calculate &quot;late&quot; to see that &quot;late&quot; is &quot;normal&quot; for RB kids!<br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":333758624,"authorName":"Lisa Dixon","from":"Lisa Dixon &lt;lddixon@...&gt;","profile":"lddixon4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: On the fence with an almost first-grader...","postDate":"1333001016","msgId":48124,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxOTEwMWNkMGQ3MSRhZTkzN2ZhMCQwYmJhN2VlMCRAbmV0Pg=="},"prevInTopic":48123,"nextInTopic":0,"prevInTime":48123,"nextInTime":48125,"topicId":48109,"numMessagesInTopic":0,"msgSnippet":"I am fairly new to unschooling. I ve been doing it for about 2 years now with my younger two kids ages 8 and 5. My 8 year old went to kindergarten when she was","messageBody":"<div id=\"ygrps-yiv-1059202631\">I am fairly new to unschooling. I&#39;ve been doing it for about 2 years now<br/>\nwith my younger two kids ages 8 and 5. My 8 year old went to kindergarten<br/>\nwhen she was 5 and learned some sight words and beginning phonics, but did<br/>\nnot know how to read at the end of the year. We decided school was not for<br/>\nus and homeschooled in first grade. I had planned on doing a Waldorf style<br/>\nbut we quickly started just doing whatever she was interested in. (Waldorf<br/>\nencourages delayed academics.) The last half of first grade and all of this<br/>\nyear we have pretty much unschooled. I read aloud all kinds of books to them<br/>\nboth and we have done a few math pages in a book, but mostly because she<br/>\nasked. I have had a few days where I have told her we were doing some math.<br/>\n(We&#39;re with a public school homeschool program that gives us a $1800. each<br/>\nchild for an  allotment per year and we use it for any outside activities<br/>\nthey  want to do, so I have to turn in a few &quot;samples&quot; every quarter - no<br/>\nbig deal.) <br/>\n<br/>\n <br/>\n<br/>\nLast fall when she was 7.5 yrs. She started reading! I never did any formal<br/>\nreading lessons with her. I was shocked! It was really neat to see her pick<br/>\nit up on her own. I really had days where I doubted it would ever happen. I<br/>\nespecially did not think it would be so early. I think exposing her to books<br/>\nand reading and telling her stories all the time must have helped. WE LOVE<br/>\nREADING STORIES TOGETHER J<br/>\n<br/>\nShe also was very interested in writing her own little books and making<br/>\nbooks for her dolls. She often asked me how to spell words or would look at<br/>\nother books. She also made up a lot of spellings on her own that I never<br/>\ncorrected her on. She has pretty much been on her own for the last year and<br/>\na half.<br/>\n<br/>\n <br/>\n<br/>\nLisa<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":9543528,"authorName":"Dana Hoffman Ellis","from":"Dana Hoffman Ellis &lt;hoffmanwilson@...&gt;","profile":"hoffmanwilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: On the fence with an almost first-grader...","postDate":"1332992276","msgId":48121,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFEOTRGRjZGLUUzQTktNDNCQy04RkVFLUNDMTVBODIzQjNBNkB5YWhvby5jb20+","inReplyToHeader":"PGprdmlhditrMmdhQGVHcm91cHMuY29tPg==","referencesHeader":"PGprdmlhditrMmdhQGVHcm91cHMuY29tPg=="},"prevInTopic":48119,"nextInTopic":48123,"prevInTime":48120,"nextInTime":48122,"topicId":48109,"numMessagesInTopic":0,"msgSnippet":"My older kids are almost 20 and 14, always unschooled, and yes, they DO read, write and do math.  They are also happy, interesting, interested in many topics,","messageBody":"<div id=\"ygrps-yiv-55138452\">My older kids are almost 20 and 14, always unschooled, and yes, they DO read, write and do math.  They are also happy, interesting, interested in many topics, have traveled extensively, follow their passions, have friends, and are really awesome people :)<br/>\n<br/>\nDana<br/>\n<br/>\nSent from my iPad<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mar 29, 2012, at 12:38 AM, &quot;Meredith&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt; wrote:<br/>\n<br/>\n&gt; &quot;stitchingmama&quot; &lt;stitchingmama@...&gt; wrote:<br/>\n&gt;&gt; Maybe what I&#39;m hoping to hear is some input from moms who have been this longer, but started &quot;from the beginning&quot; - who&#39;s kids DID eventually start reading (when they were ready), writing and doing math. <br/>\n&gt; ******************<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ------------------------------------ </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: On the fence with an almost first-grader...","postDate":"1332972973","msgId":48119,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsMDJqZCsydWZyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGprdm1oOSttaXBlQGVHcm91cHMuY29tPg=="},"prevInTopic":48118,"nextInTopic":48121,"prevInTime":48118,"nextInTime":48120,"topicId":48109,"numMessagesInTopic":0,"msgSnippet":"... ************** If you re seeing the options as read or suffer a lack of information then reading would be helpful, but those aren t the only options. One","messageBody":"<div id=\"ygrps-yiv-1677614606\">&quot;stitchingmama&quot; &lt;stitchingmama@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I do think reading will help her be better as her self right now - she knows that video games and tv and computers involve reading...<br/>\n </span></blockquote>**************<br/>\n<br/>\nIf you&#39;re seeing the options as &quot;read or suffer a lack of information&quot; then reading would be helpful, but those aren&#39;t the only options. One other option is you read to her. That&#39;s how some kids learn to read - someone reads them what they want read, and over time they figure it out. How much time depends on when they&#39;re ready - and the age of readiness for reading is crazy broad: 4-14 is normal!<br/>\n<br/>\nReading for you daughter (if she wants - some kids would rather figure things out from context, and that works, too) also gives you a chance to spend more time with her, letting her know by your actions that you value her and her interests. That&#39;s a marvelous gift to give your child!  <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":469289138,"authorName":"stitchingmama","from":"&quot;stitchingmama&quot; &lt;stitchingmama@...&gt;","profile":"stitchingmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: On the fence with an almost first-grader...","postDate":"1332960617","msgId":48118,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGprdm1oOSttaXBlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDczMENDRTM1LTkzRkUtNEY1OC1BMDJBLTZDQzAzMTIxNDNDOEB2ZXJpem9uLm5ldD4="},"prevInTopic":48117,"nextInTopic":48119,"prevInTime":48117,"nextInTime":48119,"topicId":48109,"numMessagesInTopic":0,"msgSnippet":"I m replying from an iPhone so I ll probably miss something but I did want to say thank you for this post. Parts of it stung my ego a bit but it s given me so","messageBody":"<div id=\"ygrps-yiv-770328929\">I&#39;m replying from an iPhone so I&#39;ll probably miss something but I did want to say thank you for this post. Parts of it stung my ego a bit but it&#39;s given me so to think about. <br/>\n<br/>\nI hate to say it but until I started reading through this and the other helpful advice here, it didn&#39;t even occur to me that I&#39;ve spent all this time trying to teach her to read exactly the way I learned...but we are not at all alike except that we are both easily discouraged. So we&#39;ve both been frustrated with the method and each other because I&#39;ve been trying to use this one-size approach on my child who is her own quirky, unique little person...I&#39;ve always touted to my in-laws how the great thing about homeschooling is that we tailor what we do to the individual needs of our kids but then, here I am, trying to force my child into a classroom-designed reading curriculum. <br/>\n<br/>\nI do think reading will help her be better as her self right now - she knows that video games and tv and computers involve reading...but I think ultimately, you&#39;re right that my interference with her learning style may have done more harm than good. <br/>\n<br/>\nThis morning I woke up resolved to just let her be and the difference in her attitude and behavior is kind of amazing. I asked her when she woke up what SHE wanted to do today and she seemed astonished by the question. And very happy about it. So we&#39;re going to start there; saying yes more and letting her direct her days within reason and reading together more and ignoring the lessons. <br/>\n<br/>\nThank you so much to all of you for taking the time to reply and help out a newbie. <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; On Mar 27, 2012, at 8:47 PM, stitchingmama wrote:<br/>\n&gt; <br/>\n&gt; &gt; I have been following a reading curriculum of sorts with DD1<br/>\n&gt; &gt; for almost 2 years and she is so close to reading.<br/>\n&gt; <br/>\n&gt; That&#39;s the subversive thing about school and reading curriculums especially. It seems like her reading is due to the curriculum.<br/>\n&gt; <br/>\n&gt; But she&#39;s 2 years older than when you started. She has two more years of experience with the world and words she encounters naturally in her day. And her brain is also 2 years more developed. The brain areas needed for reading have been maturing. When they&#39;re mature enough to decode, she&#39;ll get reading. But not before. No curriculum in the world will get her reading faster than she will naturally read. Try to imagine a walking curriculum that would get kids walking sooner than they would naturally.<br/>\n&gt; <br/>\n&gt; I&#39;m absolutely positively convinced she&#39;d be where she is with reading if you&#39;d never opened a curriculum. Parents and teachers who only know school reading have no way of knowing this. Kids are being exposed to reading lessons even in kindergarten so they have no idea what kids are capable of. But unschoolers are the control group. We *know* kids can read without instruction. They read just fine when their brains are developed enough for it.<br/>\n&gt; <br/>\n&gt; &gt; She&#39;s at a point where if asked, she knows all the sounds letters make<br/>\n&gt; &gt; and if she puts her mind to it, she can read...but she chooses not<br/>\n&gt; &gt; to unless we sit down for &quot;school time.&quot; <br/>\n&gt; <br/>\n&gt; And she&#39;s learning to associate reading with pressure. It could very well be holding her back.<br/>\n&gt; <br/>\n&gt; If you drop the lessons, you probably won&#39;t see progress for a while because she&#39;ll need to feel free to choose to read. Which means for a while she&#39;ll choose not to to make up for all the times she wasn&#39;t allowed to.<br/>\n&gt; <br/>\n&gt; My daughter could read, she says, at 5. But she chose not to read a book on her own until she was 11sh. (Reading was too slow for what she wanted.) At 14 she picked up an adult novel from having heard several audio books by the author and has been reading for pleasure ever since. (At 20 the first online account she set up was at Amazon ;-) Until then I read books to her. I read any instructions she needed me to. She listened to audio books. And it didn&#39;t handicap her one bit. She absorbed what she needed in ways that are inconvenient for schools to support but were more natural for her. By focusing on what&#39;s convenient for 1 teacher to use on 30 kids at once schools imply that other ways are inferior. But for kids who are naturally drawn to hands on, to listening, to full body movement, to watching, focusing on a method that isn&#39;t their primary way of learning is what holds their learning back.<br/>\n&gt; <br/>\n&gt; &gt; &quot;do school&quot; a few times a week (which would consist<br/>\n&gt; &gt; of time spent doing phonograms, practicing writing, <br/>\n&gt; <br/>\n&gt; Many kids, especially artists, don&#39;t read by learning letters. They absorb whole words. They build up a huge repetoir of whole words. And *then* they see the sense in the breakdown. But trying to sound out words letter by letter confuses and frustrates them. It doesn&#39;t seem to make sense that kids could learn &quot;hard&quot; words before simple words but it&#39;s what comes naturally and easily to them.<br/>\n&gt; <br/>\n&gt; (In fact I&#39;m betting you don&#39;t sound out new words letter by letter or phoneme by phoneme. I bet you look for large chunks, patterns you recognize: acephalist, desquamate, ethrog, galligaskins. And even with foreign words: kimidori, otkrytka, nunguserak.)<br/>\n&gt; <br/>\n&gt; It sounds like she may grasp building up from simple to more complex, but it could be you&#39;ve interfered with a process that would have been more natural for her. A process that she would have been all hers.<br/>\n&gt; <br/>\n&gt; That&#39;s the problem with school. They need one method they can apply to everyone. But everyone is different. What helps one hinders another. <br/>\n&gt; <br/>\n&gt; &gt; and I have to say, my limited exposure to and fondness for certain aspects of the Waldorf method have me feeling ENORMOUSLY guilty for letting her have any video game/TV access)<br/>\n&gt; <br/>\n&gt; Imagine something you love that really speaks to you. Maybe a certain genre of books. Scrapbooking. Or gardening. Or go-kart racing.<br/>\n&gt; <br/>\n&gt; Imagine overhearing your husband say to a friend, &quot;I feel ENORMOUSLY guilting for letting her have any [fill in with what you love].&quot;<br/>\n&gt; <br/>\n&gt; Wouldn&#39;t it sound like he&#39;s more concerned about his agenda for you than about you? That he is focused on some ideal he wants you to be and doesn&#39;t care about who you are, when who you are includes what you love and find pleasure in? Wouldn&#39;t it feel controlling and maybe even a bit creepy that he wished what you loved wasn&#39;t even in your life?<br/>\n&gt; <br/>\n&gt; Parents want what&#39;s best for kids but in the process they focus on &quot;the best&quot; and lose sight of &quot;the kids&quot;. Doesn&#39;t what you find delight in enrich your life far more than anyone else&#39;s idea of what you should find delight in?<br/>\n&gt; <br/>\n&gt; &gt; knowing how his family is already judging us for home schooling<br/>\n&gt; <br/>\n&gt; If they bring it up, what can help is acknowledging that they could be right but saying &quot;This is working for us for now. If it stops working we&#39;ll try something different. So, how&#39;s your garden coming along?&quot;<br/>\n&gt; <br/>\n&gt; Just refuse to engage on the topic. Don&#39;t try to convince them you&#39;re right. It&#39;s as likely to work as them convincing you that they&#39;re right.<br/>\n&gt; <br/>\n&gt; &gt; how she&#39;s still having trouble reading numbers 30-100 <br/>\n&gt; <br/>\n&gt; Why does she need to read those numbers right now? Really think about it! How will she be better at being 6 by recognizing the numbers?<br/>\n&gt; <br/>\n&gt; In fact how will she be a better 6 yo by being able to read?<br/>\n&gt; <br/>\n&gt; She may be pressured to do those things *for the school*. But how do they help the person she is right now? How will they help her draw better or express her emotions better through painting? How will they help her absorb what she&#39;s picking up from video games and TV? If school didn&#39;t exist, would those be useful for her right now self?<br/>\n&gt; <br/>\n&gt; You&#39;re priming her not to be a better her but to be more uniform raw material for school so she isn&#39;t so much trouble for the teachers.<br/>\n&gt; <br/>\n&gt; Two pages that might help you are:<br/>\n&gt; <br/>\n&gt; Why You Can&#39;t Let Go<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/joyce/talk\">http://sandradodd.com/joyce/talk</a><br/>\n&gt; <br/>\n&gt; Products of Education<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/joyce/products\">http://sandradodd.com/joyce/products</a><br/>\n&gt; <br/>\n&gt; Joyce<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: On the fence with an almost first-grader...","postDate":"1332956319","msgId":48117,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGprdmlhditrMmdhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGprdG4zaytkbHB2QGVHcm91cHMuY29tPg=="},"prevInTopic":48116,"nextInTopic":48118,"prevInTime":48116,"nextInTime":48118,"topicId":48109,"numMessagesInTopic":0,"msgSnippet":"... ****************** We started out homeschooling my stepson, so I got to go through the process of watching learning go from being something fun to","messageBody":"<div id=\"ygrps-yiv-1293458707\">&quot;stitchingmama&quot; &lt;stitchingmama@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Maybe what I&#39;m hoping to hear is some input from moms who have been this longer, but started &quot;from the beginning&quot; - who&#39;s kids DID eventually start reading (when they were ready), writing and doing math. <br/>\n </span></blockquote>******************<br/>\n<br/>\nWe started out homeschooling my stepson, so I got to go through the process of watching learning go from being something fun to something required, and seeing his love of learning fade. With my daughter, unschooled from the beginning, nothing has faded. She plays happily with words, numbers and patterns, swirling effortlessly from patterns in numbers to patterns in language as though language and math were just two parts of some greater pattern. She gets excited about punctuation at times, the same way she gets excited about a new tv show, or a new lego kit. She has written game walk-throughs, short stories, graphic novels, and begun a few longer novels of her own, not as assignments or projects, but because that&#39;s what interests her. For the past couple weeks she&#39;s been fascinated by family trees and genetics. She&#39;s 10 - in a couple months I do my annual chore of finding the paperwork for homeschooling, and remember what grade that is, but I&#39;m not really concerned if she knows what other kids her age know. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] On the fence with an almost first-grader...","postDate":"1332943864","msgId":48116,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRURCMDNCRjA5MzE5Ny1BQzgtOTQwNkB3ZWJtYWlsLW0wODEuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PGprdG4zaytkbHB2QGVHcm91cHMuY29tPg==","referencesHeader":"PGprdG4zaytkbHB2QGVHcm91cHMuY29tPg=="},"prevInTopic":48114,"nextInTopic":48117,"prevInTime":48115,"nextInTime":48117,"topicId":48109,"numMessagesInTopic":0,"msgSnippet":"Go to a conference. That would be THE BEST place to start. There are two on the west coast: one in Vancouver WA in May and one in San Diego CA in September. ","messageBody":"<div id=\"ygrps-yiv-1842599444\">Go to a conference. That would be THE BEST place to start.<br/>\n<br/>\n<br/>\nThere are two on the west coast: one in Vancouver WA in May and one in San Diego CA in September.<br/>\n<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.wideskydays.com/\">http://www.wideskydays.com/</a>  <a rel=\"nofollow\" target=\"_blank\" href=\"http://lifeisgoodconference.com/\">http://lifeisgoodconference.com/</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: stitchingmama &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:stitchingmama@...\">stitchingmama@...</a>&gt;<br/>\n<br/>\nI came to this group through the SF Bay Unschooling Network...which I didn&#39;t <br/>\njoin because I haven&#39;t fully jumped into the whole idea of unschooling yet.<br/>\n<br/>\nI have two girls, almost 6 and almost 3 and another babe due in a few weeks. My <br/>\nhusband and I always wanted to homeschool and I was actually homeschooled...so <br/>\nour daughters have never been to any school or daycare outside the home. I love <br/>\nthat we have such a rich relationship with our daughters that has come from <br/>\nobserving them all day, every day. <br/>\nThere is so much about the whole ethic of unschooling that speaks to the <br/>\nwhisperings of my innermost maternal instincts. But it is really hard for me to <br/>\nfully let go of the idea of some form of &quot;school at home.&quot; I have been following <br/>\na reading curriculum of sorts with DD1 for almost 2 years and she is so close to <br/>\nreading. She&#39;s at a point where if asked, she knows all the sounds letters make <br/>\nand if she puts her mind to it, she can read...but she chooses not to unless we <br/>\nsit down for &quot;school time.&quot; <br/>\n<br/>\nHer interests are almost exclusively centered around art - she is an avid little <br/>\nartist. Drawing mostly (amazing, vibrant creations with imaginary creatures and <br/>\ncomplicated stories for each picture!), but also painting, sculpting with dough, <br/>\netc. So much of her emotions are processed through her art and it&#39;s sort of <br/>\namazing to get such a vivid window into her little heart and mind. Other than <br/>\nthat she&#39;s happy playing video games and watching TV (movies and shows like <br/>\nKipper...and I have to say, my limited exposure to and fondness for certain <br/>\naspects of the Waldorf method have me feeling ENORMOUSLY guilty for letting her <br/>\nhave any video game/TV access), she loves legos and blocks when they suit her <br/>\nmood, and puzzles sometimes. She loves being read to - we&#39;ve already devoured a <br/>\nfew of the Little House books and lots of other children&#39;s stories. She loves <br/>\nlistening to books on tape (the Francis collection is a favorite)...<br/>\n<br/>\nWhen I read websites like The Natural Child, it completely resonates with me as <br/>\na parent. And the simple piece of advice to just start saying &quot;yes&quot; more on the <br/>\nJoyfully Rejoycing page is completely where I am right now in my journey as a <br/>\nmom...<br/>\n<br/>\nBut I am having a hard time letting go of my own roots as a school-at-home <br/>\nhomeschooler (my parents were hard core about book learning ;-) - Saxon Math, <br/>\nAbeka, Rod & Staff, and I remember hearing the name John Holt whispered in <br/>\nhorror when the odd unschooling family would show up in our circle). Add to that <br/>\nthe fact that my husband and I have been sort of keeping an eye on &quot;where should <br/>\nshe be for her age?&quot; for so long and (this is a big deal for me, he doesn&#39;t care <br/>\nso much what others think) knowing how his family is already judging us for home <br/>\nschooling our kids (they&#39;re sure we&#39;re going to totally ruin them I think <br/>\n;-))...I&#39;m still torn.<br/>\nEven just this morning, my husband was saying &quot;DD1, you&#39;re going to be in first <br/>\ngrade soon!&quot; and asking me how she&#39;s doing on school, we were talking about how <br/>\nshe&#39;s still having trouble reading numbers 30-100 and doesn&#39;t focus well when we <br/>\ndo school time...how does one even begin to get away from these fears???<br/>\n<br/>\nI have never been aggressive about school time...mostly because of my own lack <br/>\nof discipline and scheduling. But we do generally &quot;do school&quot; a few times a week <br/>\n(which would consist of time spent doing phonograms, practicing writing, <br/>\nsomething centered around numbers and having her read a book from her set of <br/>\nreaders)...most of her days are spent drawing, playing by herself or with her <br/>\nsister, watching TV, etc. We go places - mostly playgrounds and the library, <br/>\ngrocery shopping, botanical gardens, the lake, etc) but less recently because I <br/>\nam pregnant and get more tired. <br/>\n<br/>\nThis is my first post here so I know I&#39;m rambling. Maybe what I&#39;m hoping to hear <br/>\nis some input from moms who have been this longer, but started &quot;from the <br/>\nbeginning&quot; - who&#39;s kids DID eventually start reading (when they were ready), <br/>\nwriting and doing math. DD1 has show an interest in science - mostly because DH <br/>\ndoes a lot with computers, and they&#39;ve already done things together like <br/>\nexperiments with how to make a battery, learning about how computer chips are <br/>\nmade, etc...I think it&#39;s sort of funny that she knows that metals are conductors <br/>\nand about positive and negative charges (in 5yo), but may or may not be able to <br/>\ntell you that 5+5=10. :) It&#39;s certainly telling that I have been trying <br/>\nliterally for years to teach her things like &quot;start lowercase a at the 2 <br/>\n0&#39;clock&quot; and she doesn&#39;t seem to remember...but one day I go to run errands and <br/>\ncome back to find she&#39;s learned all about computer chips with daddy and MONTHS <br/>\nlater she still remembers that chips are made out of silicon. T<br/>\n he child remembers what she learns through PLAY and this is why I do feel like <br/>\nunschooling is the direction we need to go...but I am having trouble letting go. <br/>\n:)<br/>\n<br/>\nI would truly love to hear more from moms who have BTDT. I&#39;m looking forward to <br/>\nfollowing discussions here and learning from all of you!<br/>\n<br/>\n-stitchingmama<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: On the fence with an almost first-grader...","postDate":"1332933426","msgId":48114,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGprdXJ2aStxY252QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGprdG4zaytkbHB2QGVHcm91cHMuY29tPg=="},"prevInTopic":48112,"nextInTopic":48116,"prevInTime":48113,"nextInTime":48115,"topicId":48109,"numMessagesInTopic":0,"msgSnippet":"It sounds like you know the answer already -- The child remembers what she learns through PLAY and this is why I do feel like unschooling is the direction we","messageBody":"<div id=\"ygrps-yiv-790236529\">It sounds like you know the answer already -- &quot;The child remembers what she learns through PLAY and this is why I do feel like unschooling is the direction we need to go.&quot;<br/>\n<br/>\nNow to deschool yourself and your DH and the kids. :)<br/>\n<br/>\nMaybe a talk with DH about all this to start with? How to present this to relatives -- or, very large possibility, not.<br/>\n<br/>\nMaybe sit down and enjoy reading a book with DD1, without calling it &quot;school.&quot; Let her ease into reading for enjoyment instead of thinking of that as only for school. <br/>\n<br/>\nStart letting go of a few of the schoolier habits and go from there. More time playing with computers and less time doing handwriting exercises, for instance. More time praising her for doing what she enjoys and less time checking her progress against some curriculum. Etc.<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;stitchingmama&quot; &lt;stitchingmama@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I came to this group through the SF Bay Unschooling Network...which I didn&#39;t join because I haven&#39;t fully jumped into the whole idea of unschooling yet.<br/>\n&gt; <br/>\n&gt; I have two girls, almost 6 and almost 3 and another babe due in a few weeks. My husband and I always wanted to homeschool and I was actually homeschooled...so our daughters have never been to any school or daycare outside the home. I love that we have such a rich relationship with our daughters that has come from observing them all day, every day. <br/>\n&gt; There is so much about the whole ethic of unschooling that speaks to the whisperings of my innermost maternal instincts. But it is really hard for me to fully let go of the idea of some form of &quot;school at home.&quot; I have been following a reading curriculum of sorts with DD1 for almost 2 years and she is so close to reading. She&#39;s at a point where if asked, she knows all the sounds letters make and if she puts her mind to it, she can read...but she chooses not to unless we sit down for &quot;school time.&quot; <br/>\n&gt; <br/>\n&gt; Her interests are almost exclusively centered around art - she is an avid little artist. Drawing mostly (amazing, vibrant creations with imaginary creatures and complicated stories for each picture!), but also painting, sculpting with dough, etc. So much of her emotions are processed through her art and it&#39;s sort of amazing to get such a vivid window into her little heart and mind. Other than that she&#39;s happy playing video games and watching TV (movies and shows like Kipper...and I have to say, my limited exposure to and fondness for certain aspects of the Waldorf method have me feeling ENORMOUSLY guilty for letting her have any video game/TV access), she loves legos and blocks when they suit her mood, and puzzles sometimes. She loves being read to - we&#39;ve already devoured a few of the Little House books and lots of other children&#39;s stories. She loves listening to books on tape (the Francis collection is a favorite)...<br/>\n&gt; <br/>\n&gt; When I read websites like The Natural Child, it completely resonates with me as a parent. And the simple piece of advice to just start saying &quot;yes&quot; more on the Joyfully Rejoycing page is completely where I am right now in my journey as a mom...<br/>\n&gt; <br/>\n&gt; But I am having a hard time letting go of my own roots as a school-at-home homeschooler (my parents were hard core about book learning ;-) - Saxon Math, Abeka, Rod & Staff, and I remember hearing the name John Holt whispered in horror when the odd unschooling family would show up in our circle). Add to that the fact that my husband and I have been sort of keeping an eye on &quot;where should she be for her age?&quot; for so long and (this is a big deal for me, he doesn&#39;t care so much what others think) knowing how his family is already judging us for home schooling our kids (they&#39;re sure we&#39;re going to totally ruin them I think ;-))...I&#39;m still torn.<br/>\n&gt; Even just this morning, my husband was saying &quot;DD1, you&#39;re going to be in first grade soon!&quot; and asking me how she&#39;s doing on school, we were talking about how she&#39;s still having trouble reading numbers 30-100 and doesn&#39;t focus well when we do school time...how does one even begin to get away from these fears???<br/>\n&gt; <br/>\n&gt; I have never been aggressive about school time...mostly because of my own lack of discipline and scheduling. But we do generally &quot;do school&quot; a few times a week (which would consist of time spent doing phonograms, practicing writing, something centered around numbers and having her read a book from her set of readers)...most of her days are spent drawing, playing by herself or with her sister, watching TV, etc. We go places - mostly playgrounds and the library, grocery shopping, botanical gardens, the lake, etc) but less recently because I am pregnant and get more tired. <br/>\n&gt; <br/>\n&gt; This is my first post here so I know I&#39;m rambling. Maybe what I&#39;m hoping to hear is some input from moms who have been this longer, but started &quot;from the beginning&quot; - who&#39;s kids DID eventually start reading (when they were ready), writing and doing math. DD1 has show an interest in science - mostly because DH does a lot with computers, and they&#39;ve already done things together like experiments with how to make a battery, learning about how computer chips are made, etc...I think it&#39;s sort of funny that she knows that metals are conductors and about positive and negative charges (in 5yo), but may or may not be able to tell you that 5+5=10. :) It&#39;s certainly telling that I have been trying literally for years to teach her things like &quot;start lowercase a at the 2 0&#39;clock&quot; and she doesn&#39;t seem to remember...but one day I go to run errands and come back to find she&#39;s learned all about computer chips with daddy and MONTHS later she still remembers that chips are made out of silicon. The child remembers what she learns through PLAY and this is why I do feel like unschooling is the direction we need to go...but I am having trouble letting go. :)<br/>\n&gt; <br/>\n&gt; I would truly love to hear more from moms who have BTDT. I&#39;m looking forward to following discussions here and learning from all of you!<br/>\n&gt; <br/>\n&gt; -stitchingmama<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] On the fence with an almost first-grader...","postDate":"1332931001","msgId":48112,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczMENDRTM1LTkzRkUtNEY1OC1BMDJBLTZDQzAzMTIxNDNDOEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGprdG4zaytkbHB2QGVHcm91cHMuY29tPg==","referencesHeader":"PGprdG4zaytkbHB2QGVHcm91cHMuY29tPg=="},"prevInTopic":48111,"nextInTopic":48114,"prevInTime":48111,"nextInTime":48113,"topicId":48109,"numMessagesInTopic":0,"msgSnippet":"... That s the subversive thing about school and reading curriculums especially. It seems like her reading is due to the curriculum. But she s 2 years older","messageBody":"<div id=\"ygrps-yiv-1499845242\">On Mar 27, 2012, at 8:47 PM, stitchingmama wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have been following a reading curriculum of sorts with DD1<br/>\n&gt; for almost 2 years and she is so close to reading.<br/>\n<br/>\n </span></blockquote>That&#39;s the subversive thing about school and reading curriculums especially. It seems like her reading is due to the curriculum.<br/>\n<br/>\nBut she&#39;s 2 years older than when you started. She has two more years of experience with the world and words she encounters naturally in her day. And her brain is also 2 years more developed. The brain areas needed for reading have been maturing. When they&#39;re mature enough to decode, she&#39;ll get reading. But not before. No curriculum in the world will get her reading faster than she will naturally read. Try to imagine a walking curriculum that would get kids walking sooner than they would naturally.<br/>\n<br/>\nI&#39;m absolutely positively convinced she&#39;d be where she is with reading if you&#39;d never opened a curriculum. Parents and teachers who only know school reading have no way of knowing this. Kids are being exposed to reading lessons even in kindergarten so they have no idea what kids are capable of. But unschoolers are the control group. We *know* kids can read without instruction. They read just fine when their brains are developed enough for it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She&#39;s at a point where if asked, she knows all the sounds letters make<br/>\n&gt; and if she puts her mind to it, she can read...but she chooses not<br/>\n&gt; to unless we sit down for &quot;school time.&quot; <br/>\n<br/>\n </span></blockquote>And she&#39;s learning to associate reading with pressure. It could very well be holding her back.<br/>\n<br/>\nIf you drop the lessons, you probably won&#39;t see progress for a while because she&#39;ll need to feel free to choose to read. Which means for a while she&#39;ll choose not to to make up for all the times she wasn&#39;t allowed to.<br/>\n<br/>\nMy daughter could read, she says, at 5. But she chose not to read a book on her own until she was 11sh. (Reading was too slow for what she wanted.) At 14 she picked up an adult novel from having heard several audio books by the author and has been reading for pleasure ever since. (At 20 the first online account she set up was at Amazon ;-) Until then I read books to her. I read any instructions she needed me to. She listened to audio books. And it didn&#39;t handicap her one bit. She absorbed what she needed in ways that are inconvenient for schools to support but were more natural for her. By focusing on what&#39;s convenient for 1 teacher to use on 30 kids at once schools imply that other ways are inferior. But for kids who are naturally drawn to hands on, to listening, to full body movement, to watching, focusing on a method that isn&#39;t their primary way of learning is what holds their learning back.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;do school&quot; a few times a week (which would consist<br/>\n&gt; of time spent doing phonograms, practicing writing, <br/>\n<br/>\n </span></blockquote>Many kids, especially artists, don&#39;t read by learning letters. They absorb whole words. They build up a huge repetoir of whole words. And *then* they see the sense in the breakdown. But trying to sound out words letter by letter confuses and frustrates them. It doesn&#39;t seem to make sense that kids could learn &quot;hard&quot; words before simple words but it&#39;s what comes naturally and easily to them.<br/>\n<br/>\n(In fact I&#39;m betting you don&#39;t sound out new words letter by letter or phoneme by phoneme. I bet you look for large chunks, patterns you recognize: acephalist, desquamate, ethrog, galligaskins. And even with foreign words: kimidori, otkrytka, nunguserak.)<br/>\n<br/>\nIt sounds like she may grasp building up from simple to more complex, but it could be you&#39;ve interfered with a process that would have been more natural for her. A process that she would have been all hers.<br/>\n<br/>\nThat&#39;s the problem with school. They need one method they can apply to everyone. But everyone is different. What helps one hinders another. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; and I have to say, my limited exposure to and fondness for certain aspects of the Waldorf method have me feeling ENORMOUSLY guilty for letting her have any video game/TV access)<br/>\n<br/>\n </span></blockquote>Imagine something you love that really speaks to you. Maybe a certain genre of books. Scrapbooking. Or gardening. Or go-kart racing.<br/>\n<br/>\nImagine overhearing your husband say to a friend, &quot;I feel ENORMOUSLY guilting for letting her have any [fill in with what you love].&quot;<br/>\n<br/>\nWouldn&#39;t it sound like he&#39;s more concerned about his agenda for you than about you? That he is focused on some ideal he wants you to be and doesn&#39;t care about who you are, when who you are includes what you love and find pleasure in? Wouldn&#39;t it feel controlling and maybe even a bit creepy that he wished what you loved wasn&#39;t even in your life?<br/>\n<br/>\nParents want what&#39;s best for kids but in the process they focus on &quot;the best&quot; and lose sight of &quot;the kids&quot;. Doesn&#39;t what you find delight in enrich your life far more than anyone else&#39;s idea of what you should find delight in?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; knowing how his family is already judging us for home schooling<br/>\n<br/>\n </span></blockquote>If they bring it up, what can help is acknowledging that they could be right but saying &quot;This is working for us for now. If it stops working we&#39;ll try something different. So, how&#39;s your garden coming along?&quot;<br/>\n<br/>\nJust refuse to engage on the topic. Don&#39;t try to convince them you&#39;re right. It&#39;s as likely to work as them convincing you that they&#39;re right.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; how she&#39;s still having trouble reading numbers 30-100 <br/>\n<br/>\n </span></blockquote>Why does she need to read those numbers right now? Really think about it! How will she be better at being 6 by recognizing the numbers?<br/>\n<br/>\nIn fact how will she be a better 6 yo by being able to read?<br/>\n<br/>\nShe may be pressured to do those things *for the school*. But how do they help the person she is right now? How will they help her draw better or express her emotions better through painting? How will they help her absorb what she&#39;s picking up from video games and TV? If school didn&#39;t exist, would those be useful for her right now self?<br/>\n<br/>\nYou&#39;re priming her not to be a better her but to be more uniform raw material for school so she isn&#39;t so much trouble for the teachers.<br/>\n<br/>\nTwo pages that might help you are:<br/>\n<br/>\nWhy You Can&#39;t Let Go<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/joyce/talk\">http://sandradodd.com/joyce/talk</a><br/>\n<br/>\nProducts of Education<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/joyce/products\">http://sandradodd.com/joyce/products</a><br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] On the fence with an almost first-grader...","postDate":"1332928578","msgId":48111,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzI5Mjg1NzguODY2NjIuWWFob29NYWlsTmVvQHdlYjg3MzA2Lm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGprdG4zaytkbHB2QGVHcm91cHMuY29tPg==","referencesHeader":"PGprdG4zaytkbHB2QGVHcm91cHMuY29tPg=="},"prevInTopic":48110,"nextInTopic":48112,"prevInTime":48110,"nextInTime":48112,"topicId":48109,"numMessagesInTopic":0,"msgSnippet":"... Relax. Things are probably going to get overwhelming in a few weeks, so enjoy the moments before you are utterly exhausted. Watch your girls enjoying","messageBody":"<div id=\"ygrps-yiv-84865086\"><blockquote><span title=\"ireply\">&gt;&gt;I have two girls, almost 6 and almost 3 and another babe due in a few weeks.&lt;&lt;<br/>\n<br/>\n </span></blockquote>Relax. Things are probably going to get overwhelming in a few weeks, so enjoy the moments before you are utterly exhausted. Watch your girls enjoying themselves, watch your daughters devour the knowledge that is nestled within the things they are interested in.<br/>\n<br/>\nSchool at home, or otherwise, makes clear rules and expectations about what is being learned. Even if rules and expectations don&#39;t lead to actual learning, they comfort you, they reassure you that you are doing the right thing. But&gt;&gt;&quot;I have been following a reading curriculum of sorts with DD1 for almost 2 years and she is so close to reading. She&#39;s at a point where if asked, <br/>\nshe knows all the sounds letters make and if she puts her mind to it, <br/>\nshe can read...but she chooses not to unless we sit down for &quot;school <br/>\ntime.&quot;&quot;&lt;&lt; is two years where intention and action did not lead to learning. Or, at least, not the learning intended. Your daughter now knows that her reading is a &quot;school time&quot; activity and it something that she must grin and bear. Not enjoy, not take pleasure in, not do as a part of uncovering the mysteries of the world, but as something ardous and unpleasant.<br/>\n<br/>\nSimon probably could do all the sounds of the letters and could sound out a word by age six, if asked. He wasn&#39;t asked a lot, but he could. He didn&#39;t read, he wasn&#39;t literate until he was 12. Linnaea, who is younger, read at 6. Because their environments aren&#39;t radically different, I&#39;ve attributed the difference in the ages at which they read to something internal to them. Linnaea was able to solve that puzzle earlier than Simon. If I&#39;d spent the 6 years, or the twelve years, pressing Simon to read, having a &quot;school time&quot; every couple of days with phonics and letter recognition and all that, I don&#39;t believe that his age at reading would have been much younger. My guess is that at some point he would have gotten either angry about it or assured that he was just too slow to read. And the jealousy, the sense that Linnaea was somehow better than he was because she&#39;d mastered this oh so difficult skill with ease, would have been really hard to overcome, I<br/>\n imagine. Without that pressure, he had no sense that Linnaea was better or worse than he was because of her reading. I was, still am, amazed that it didn&#39;t give him any apparent sense of envy or lack. He just used her as a resource when he needed to read something or if he wanted to spell something. Actually, he still uses her for spelling as his spelling is much poorer than hers. <br/>\n<br/>\n<br/>\nBut what will you do if even though she has all the tools for reading, she doesn&#39;t get there within the time that the &quot;what your child should know by age x&quot; people say? What will that mean about your decisions, about your daughter, about your methods? People aren&#39;t ready to read until they are ready and then the read. It&#39;s a hard point to get when you are focused on the notion that reading and writing and arithmetic are the fundamentals of an education. But reading is a tool. Writing is a tool. Arithmetic is a tool. They aren&#39;t knowledge, or critical thinking or understandings. They are ways of accessing information. And if they are in common use, they will be managed. If you read to her and words are a part of her day-to-day life, reading will come. If you count or add or subtract or whatever, numbers will come. Writing will come with the desire to communicate, or remember things, and as a sort of subset of reading. But it won&#39;t come on your timescale<br/>\n it will come on hers. It&#39;s hard to let go of the notion that you have any control. But you don&#39;t really. Make her life good and happy and engaging and that will make her more likely to be good and happy and engaged. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163621138,"authorName":"odiniella","from":"&quot;odiniella&quot; &lt;hgaimari@...&gt;","profile":"odiniella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: On the fence with an almost first-grader...","postDate":"1332913897","msgId":48110,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGprdTh0OSttNzZvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGprdG4zaytkbHB2QGVHcm91cHMuY29tPg=="},"prevInTopic":48109,"nextInTopic":48111,"prevInTime":48109,"nextInTime":48111,"topicId":48109,"numMessagesInTopic":0,"msgSnippet":"... forward to following discussions here and learning from all of you! ... I m happy to share my experiences and my opinions, for what they re worth.  I","messageBody":"<div id=\"ygrps-yiv-978570580\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;stitchingmama&quot;<br/>\n&lt;stitchingmama@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; I would truly love to hear more from moms who have BTDT. I&#39;m looking<br/>\n </span></blockquote>forward to following discussions here and learning from all of you!<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -stitchingmama<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I&#39;m happy to share my experiences and my opinions, for what they&#39;re<br/>\nworth.  I learned that kids learn through play. Whatever my kids choose<br/>\nto do with their lives as adults will be an extension of what they&#39;ve<br/>\nenjoyed as kids and teens.  Your kids play all day.  That&#39;s what kids<br/>\ndo.  And that&#39;s how they learn.  Not just those skills we identify as<br/>\nacademic (like math and science and language arts), but the kinds of<br/>\nskills that will help them think outside the box, take initiative, do<br/>\nsomething worth giving up those moments of time for.<br/>\n  I would encourage you to not worry about academics because it can<br/>\ndistract you from noting the skills and habits they are learning.   My<br/>\nkids are now at the ages where &quot;play&quot; takes on more mature interests and<br/>\nthey see the route to achieving their goals is through study of certain<br/>\nthings.  One child teaches himself math as it comes up in his science<br/>\ninterests (he&#39;s almost 17).  Another decides to do a math lesson every<br/>\nday (she&#39;s 14).   The youngest is only 12 and doing math every day<br/>\ndoesn&#39;t interest him.   When it becomes a skill that is relevant to what<br/>\ndoes interest him, I know he&#39;ll pursue it with vigor, like he does<br/>\neverything else he truly enjoys.  At ages 6 and 3, your kids have lots<br/>\nof time to learn through natural play.  And rest assured, that play<br/>\nmatures as they do.  ;)<br/>\nI think if you look at your kids, you&#39;ll see they have developed<br/>\nappropriate social and intellectual skills without having to sit down<br/>\nand learn a lesson formally.  Just by being observant yourself, you know<br/>\nwhat they need to know and what they might like to know.  This process<br/>\ndoesn&#39;t stop just because we&#39;re accustomed to  6 year olds being in<br/>\nschool all day.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":469289138,"authorName":"stitchingmama","from":"&quot;stitchingmama&quot; &lt;stitchingmama@...&gt;","profile":"stitchingmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"On the fence with an almost first-grader...","postDate":"1332895668","msgId":48109,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGprdG4zaytkbHB2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":48110,"prevInTime":48108,"nextInTime":48110,"topicId":48109,"numMessagesInTopic":0,"msgSnippet":"I came to this group through the SF Bay Unschooling Network...which I didn t join because I haven t fully jumped into the whole idea of unschooling yet. I have","messageBody":"<div id=\"ygrps-yiv-484059829\">I came to this group through the SF Bay Unschooling Network...which I didn&#39;t join because I haven&#39;t fully jumped into the whole idea of unschooling yet.<br/>\n<br/>\nI have two girls, almost 6 and almost 3 and another babe due in a few weeks. My husband and I always wanted to homeschool and I was actually homeschooled...so our daughters have never been to any school or daycare outside the home. I love that we have such a rich relationship with our daughters that has come from observing them all day, every day. <br/>\nThere is so much about the whole ethic of unschooling that speaks to the whisperings of my innermost maternal instincts. But it is really hard for me to fully let go of the idea of some form of &quot;school at home.&quot; I have been following a reading curriculum of sorts with DD1 for almost 2 years and she is so close to reading. She&#39;s at a point where if asked, she knows all the sounds letters make and if she puts her mind to it, she can read...but she chooses not to unless we sit down for &quot;school time.&quot; <br/>\n<br/>\nHer interests are almost exclusively centered around art - she is an avid little artist. Drawing mostly (amazing, vibrant creations with imaginary creatures and complicated stories for each picture!), but also painting, sculpting with dough, etc. So much of her emotions are processed through her art and it&#39;s sort of amazing to get such a vivid window into her little heart and mind. Other than that she&#39;s happy playing video games and watching TV (movies and shows like Kipper...and I have to say, my limited exposure to and fondness for certain aspects of the Waldorf method have me feeling ENORMOUSLY guilty for letting her have any video game/TV access), she loves legos and blocks when they suit her mood, and puzzles sometimes. She loves being read to - we&#39;ve already devoured a few of the Little House books and lots of other children&#39;s stories. She loves listening to books on tape (the Francis collection is a favorite)...<br/>\n<br/>\nWhen I read websites like The Natural Child, it completely resonates with me as a parent. And the simple piece of advice to just start saying &quot;yes&quot; more on the Joyfully Rejoycing page is completely where I am right now in my journey as a mom...<br/>\n<br/>\nBut I am having a hard time letting go of my own roots as a school-at-home homeschooler (my parents were hard core about book learning ;-) - Saxon Math, Abeka, Rod & Staff, and I remember hearing the name John Holt whispered in horror when the odd unschooling family would show up in our circle). Add to that the fact that my husband and I have been sort of keeping an eye on &quot;where should she be for her age?&quot; for so long and (this is a big deal for me, he doesn&#39;t care so much what others think) knowing how his family is already judging us for home schooling our kids (they&#39;re sure we&#39;re going to totally ruin them I think ;-))...I&#39;m still torn.<br/>\nEven just this morning, my husband was saying &quot;DD1, you&#39;re going to be in first grade soon!&quot; and asking me how she&#39;s doing on school, we were talking about how she&#39;s still having trouble reading numbers 30-100 and doesn&#39;t focus well when we do school time...how does one even begin to get away from these fears???<br/>\n<br/>\nI have never been aggressive about school time...mostly because of my own lack of discipline and scheduling. But we do generally &quot;do school&quot; a few times a week (which would consist of time spent doing phonograms, practicing writing, something centered around numbers and having her read a book from her set of readers)...most of her days are spent drawing, playing by herself or with her sister, watching TV, etc. We go places - mostly playgrounds and the library, grocery shopping, botanical gardens, the lake, etc) but less recently because I am pregnant and get more tired. <br/>\n<br/>\nThis is my first post here so I know I&#39;m rambling. Maybe what I&#39;m hoping to hear is some input from moms who have been this longer, but started &quot;from the beginning&quot; - who&#39;s kids DID eventually start reading (when they were ready), writing and doing math. DD1 has show an interest in science - mostly because DH does a lot with computers, and they&#39;ve already done things together like experiments with how to make a battery, learning about how computer chips are made, etc...I think it&#39;s sort of funny that she knows that metals are conductors and about positive and negative charges (in 5yo), but may or may not be able to tell you that 5+5=10. :) It&#39;s certainly telling that I have been trying literally for years to teach her things like &quot;start lowercase a at the 2 0&#39;clock&quot; and she doesn&#39;t seem to remember...but one day I go to run errands and come back to find she&#39;s learned all about computer chips with daddy and MONTHS later she still remembers that chips are made out of silicon. The child remembers what she learns through PLAY and this is why I do feel like unschooling is the direction we need to go...but I am having trouble letting go. :)<br/>\n<br/>\nI would truly love to hear more from moms who have BTDT. I&#39;m looking forward to following discussions here and learning from all of you!<br/>\n<br/>\n-stitchingmama</div>","specialLinks":[]}],"prevTopicId":48107,"nextTopicId":48159}}