{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unschooling fear","postDate":"1292788724","msgId":45695,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGllbG81ayt2M3JoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGllbDE0cCtqNDFqQGVHcm91cHMuY29tPg=="},"prevInTopic":45683,"nextInTopic":0,"prevInTime":45694,"nextInTime":45696,"topicId":45683,"numMessagesInTopic":0,"msgSnippet":"... ***************** That s part of it. Its normal to see what s going on now as The Way Things Are, when living with children is all about things changing.","messageBody":"<div id=\"ygrps-yiv-107837300\">&quot;Cornelia&quot; &lt;corneliablik@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Also, since my children are so young, am I just not quite tuned into the fact that they will have plenty of self elected external opportunities, should they desire?<br/>\n </span></blockquote>*****************<br/>\n<br/>\nThat&#39;s part of it. Its normal to see what&#39;s going on now as The Way Things Are, when living with children is all about things changing. Little kids have very different needs than tweens or teens. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Of course my family now is emotionally about a million miles away from my family of origin, but I still have a lingering doubt about providing this time and space away from powerful parental influences.<br/>\n </span></blockquote>****************<br/>\n<br/>\nDo your kids seem to want time away from you? You could look for ways to offer that -playdates with friends where you go do something else, or little classes... sunday school or dance class or whatever. If they want you close, then you can know they don&#39;t need time away from you. <br/>\n<br/>\nA good response to personal doubts is a little experimentation. You can&#39;t always know what your kids need - but you can offer and see what happens. That&#39;s an especially good strategy with kids who aren&#39;t terribly verbal. <br/>\n<br/>\nYou are not your parents. That&#39;s something to remind yourself maybe ;) That matters. Your kids have something you didn&#39;t have - they have you. If you&#39;re engaged with and responsive to your children, then its likely they won&#39;t need a way to escape from you. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Finally, is it simply a question of confidence and shaking off an entrenched idea of the superiority of school?<br/>\n </span></blockquote>****************<br/>\n<br/>\nThere&#39;s some of that, too. There are tons of cultural messages that kids &quot;need&quot; time away from parents. Young children often need a whooooole lot more time with parents than is culturally normal these days. And as kids get older, if you&#39;re engaged and responsive, you&#39;ll see when they need time to themselves and you&#39;ll be actively helping them get their space, or helping them find other things to do. <br/>\n<br/>\nI have a 17yo who spends time with friends, works, travels... I tell people he&#39;s more like a 21yo in a lot of ways. Home is where he touches base, his safety zone or backup plan, but not somewhere he Needs to be all the time. That&#39;s not going to be true of every teenager, but for comparison, four years ago this same kid rarely left the house, kept &quot;vampire hours&quot; and played Runescape most of his waking hours. Things do change with time ;)<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":111495799,"authorName":"Cornelia","from":"&quot;Cornelia&quot; &lt;corneliablik@...&gt;","profile":"corneliablik","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Unschooling fear","postDate":"1292765145","msgId":45683,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGllbDE0cCtqNDFqQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":45695,"prevInTime":45682,"nextInTime":45684,"topicId":45683,"numMessagesInTopic":0,"msgSnippet":"Hi, I have a question about an unschooling anxiety I have & I would love some input from you - either personal ideas or thoughts etc, or links to articles/book","messageBody":"<div id=\"ygrps-yiv-67278652\">Hi,<br/>\nI have a question about an unschooling anxiety I have & I would love some input from you - either personal ideas or thoughts etc, or links to articles/book recs etc.<br/>\nThe one issue I find difficult to resolve in my mind is a question of family dynamic, and school being a new reality and space away from home. When I was a child, my family was disturbed, and school was although less than ideal (ha!) it was a place where I could escape my family and have space to redefine myself away from the powerful influences of my parents and brother.<br/>\nOf course my family now is emotionally about a million miles away from my family of origin, but I still have a lingering doubt about providing this time and space away from powerful parental influences. Plus, I&#39;m not perfect (!) and aware I have foibles and ups and downs. I worry about immersing my children in too closed a world, emotionally. Some days I have issues to deal with, and am pre-occupied at times. Other days I am sure I act in response to what&#39;s going on internally. I believe my husband & I are pretty healthy emotionally but still this nagging doubt about room to escape the family.<br/>\nDo you think that it is a moot point and that a truly healthy relationship makes this a non-issue?<br/>\nAlso, since my children are so young, am I just not quite tuned into the fact that they will have plenty of self elected external opportunities, should they desire?<br/>\nDo you consider the school dynamic so emotionally broken and disruptive, that a healthy, loving child-led home side-steps this whole thought...?<br/>\nFinally, is it simply a question of confidence and shaking off an entrenched idea of the superiority of school?<br/>\nThank you!<br/>\nCornelia</div>","specialLinks":[]}],"prevTopicId":45641,"nextTopicId":45724}}