{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: helping around the house","postDate":"1288310395","msgId":45150,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhZDJwcis0MzY2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE3MTI2NC42Mzk3Mi5xbUB3ZWIxMTE2MjAubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":45135,"nextInTopic":0,"prevInTime":45149,"nextInTime":45151,"topicId":45081,"numMessagesInTopic":0,"msgSnippet":"... **************** One of the quirky things about unschooling answers to questions is they often start by going back a little further in time. Before you","messageBody":"<div id=\"ygrps-yiv-318388496\">M H &lt;vwmomof3@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Say, if there was a need to clean up quickly to make the house presentable; would I ask once and then do it all myself if the kids decide it&#39;s not in their intrest to help?<br/>\n </span></blockquote>****************<br/>\n<br/>\nOne of the quirky things about &quot;unschooling&quot; answers to questions is they often start by going back a little further in time. Before you ask, observe - what are your kids doing? Are they busy with something? Is now a good time to ask for help? Extend to them the courtesy of assuming that what they are doing may be as important to them as what you want to do. This is part of what I mean about living one&#39;s values (or principles) - most parents expect kids to be courteous without extending very much courtesy to the kids. <br/>\n<br/>\nIf you&#39;re generally courteous of and kind to your kids and they&#39;re in a position to help, they&#39;ll likely help. If they aren&#39;t interested in helping there&#39;s a reason! Maybe they don&#39;t realize how important it is to you - its okay to let them know - or maybe there&#39;s some other reason, but the reason is the important thing. If you don&#39;t know what the reason is (in this hypthetical situation) then you make a mental note to look into that reason later. Mostly if my kids aren&#39;t being helpful its because I&#39;ve been all wrapped up in my own stuff and haven&#39;t been very kind or courteous or thoughtful - woops! <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; To a point I do expect them to help out around the house because we are a family unit and I was raised that we all have our part to do<br/>\n </span></blockquote>*******************<br/>\n<br/>\nIf your kids are easy-going and being a part of the &quot;unit&quot; seems appealing to them, then your expectations aren&#39;t likely to hurt anything - after all, your kids get to be themselves and that works with your expectations. Its not your *expectations* that are working, though. The flip side of this is that people often come to unschooling because their kids aren&#39;t easy-going and don&#39;t fall in line with others&#39; agendas very easily. Expectations will hurt those families a looooot more - will create a lot of conflict, not because the expectations are &quot;bad&quot; but because its natural for people to resist expectations that aren&#39;t comfortable for them. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Like we&#39;re stacking wood because it&#39;sÂ half of our primary heat, and by stacking it we make room for all of it to stay dry, &#39;can you help us stack it so we can get it all in before it rains again?&#39;;Â and the kids helped (my 3 year old was out there theÂ whole time (it was 3 cords of wood, we were impressed by his facination with it), my 7 year old came and went, and when my 4 year oldÂ learned it was more work than a princess would do she decided her time was better spent on the computer. lol).<br/>\n </span></blockquote>***********************<br/>\n<br/>\nIf what you&#39;re expecting is that they&#39;ll help when they&#39;re ready, that&#39;s pretty darned close to radical unschooling - the main difference is that the definition of &quot;ready&quot; could include a whole lot of factors. Some people will be &quot;ready&quot; to help stack firewood at 4 (Ray was) while others aren&#39;t really ever ready to stack firewood - but maybe would be happy to keep you company while you do it. If you&#39;re seeing each person&#39;s unique contributions as equally valuable, then you&#39;re seeing the world very much like a radical unschooler. <br/>\n<br/>\nThe word &quot;expectations&quot; often gets a bad rap in unschooling circles because it has a whole lot of baggage. It doesn&#39;t help to bring along all that baggage. But unschoolers aren&#39;t devoid of expectations - its more that the expectations are softer and a result of observations. I expect my 9yo to work on a project before luch because that&#39;s her regular routine. I expect my 17yo to slam the door when he leaves the house because he does it ninety percent of the time, and I brace myself because I startle easily. I expect my 40yo partner to leave his socks draped over the backs of chairs because he&#39;s done that all his life regardless of other people&#39;s complaints or lack thereof. I expect I&#39;ll check my email tomorrow. <br/>\n<br/>\nUnschooling &quot;expects&quot; (works from the premise that) people are strongly motivated by what makes them feel good. So if family is important to you, do things that let your kids feel good about being part of the family so that there&#39;s a strong chance that they value family too, at a very primal level. Pushing &quot;lets do this as a family&quot; can be reasonably expected to put some people off in a big way (and I&#39;m not saying you&#39;re pushing anything, just offering a comparison). That&#39;s a reasonable expectation based on observations of human behavior. <br/>\n<br/>\nThe philosophy of radical unschooling is based on observations of human behavior seem through a surprisingly positive lens. That&#39;s probably the most dramatic aspect, the positivity. Given a good situation with lots of resources and support, people are curious, thoughtful, and sympathetic without any need to resort to rules or external pressure to &quot;chip in&quot;. The challenging part is...well okay, the challenging part is trusting that to be true! but the other challenging part is trusting oneself enough to be curious, thoughtful and sympathetic to our kids in a world that tells us that none of that is &quot;enough&quot;  and that kids need to be taught in order to learn what&#39;s right.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":402695638,"authorName":"M H","from":"M H &lt;vwmomof3@...&gt;","profile":"vwmomof3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: helping around the house","postDate":"1288283073","msgId":45135,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3MTI2NC42Mzk3Mi5xbUB3ZWIxMTE2MjAubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGlhYzFvZStyYjRoQGVHcm91cHMuY29tPg=="},"prevInTopic":45132,"nextInTopic":45150,"prevInTime":45134,"nextInTime":45136,"topicId":45081,"numMessagesInTopic":0,"msgSnippet":"Thank you for explaining it, we do ask the kids to help and most of the time they do choose to do it on their own (Roscoe, my 3 year old, I sometimes ask him","messageBody":"<div id=\"ygrps-yiv-340798840\">Thank you for explaining it, we do ask the kids to help and most of the time they do choose to do it on their own (Roscoe, my 3 year old, I sometimes ask him if he could take his plate to the sink and he smiles and is happy to do so), however there are times that I do ask again (when it comes to picking up toys, while I&#39;m coming through with a vacum or something like the owner of the house is coming by to fix something and I&#39;m overwhelmed with trying to get the whole house picked up and semi-presentable.).  To a point I do expect them to help out around the house because we are a family unit and I was raised that we all have our part to do, so those same things have followed into my parenting.  Ofcourse the things I have to do are much more than their part, basically for them I expect them to clean up after their selves, and help with some of the basic things around the house that benifit the family as a whole while practicing what we&#39;ve learned of<br/>\n why we do those things. lol  Does that make sense? Like we&#39;re stacking wood because it&#39;s half of our primary heat, and by stacking it we make room for all of it to stay dry, &#39;can you help us stack it so we can get it all in before it rains again?&#39;; and the kids helped (my 3 year old was out there the whole time (it was 3 cords of wood, we were impressed by his facination with it), my 7 year old came and went, and when my 4 year old learned it was more work than a princess would do she decided her time was better spent on the computer. lol).<br/>\n <br/>\nI don&#39;t say, Ok Nathaniel today your chore is to wash the windows, heck i don&#39;t even wash the windows (infact the last time I did I broke a window, so I took that as a sign that the windows were perfectly happy being unwashed. lol). <br/>\n <br/>\nWith that said I understand that &#39;expecting&#39; them to do some things isn&#39;t a radical unschooling way of thinking (I think) and I know that is one of the things holding me apart.  How would it be approched in an unschooling mannor? Say, if there was a need to clean up quickly to make the house presentable; would I ask once and then do it all myself if the kids decide it&#39;s not in their intrest to help?   <br/>\n <br/>\nI&#39;m not being contradicting, just courious on how it would be handled.<br/>\n <br/>\n~Megan</div>","specialLinks":[]},{"userId":279647515,"authorName":"d.lewis","from":"&quot;d.lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Deschooling and an intro of sorts..","postDate":"1288282553","msgId":45132,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgwQkI4M0Y0Q0JCMjRBM0M5RTkzMTI5NTNGOTY3MUUzQGRlYm9yYWg3NmE3OWh2Pg==","referencesHeader":"PGlhYzFvZStyYjRoQGVHcm91cHMuY29tPg=="},"prevInTopic":45131,"nextInTopic":45135,"prevInTime":45131,"nextInTime":45133,"topicId":45081,"numMessagesInTopic":0,"msgSnippet":"***My kids help out around the house, cleaning their rooms and helping with things like stacking wood or taking out compost, etc.*** My son helped, too.  I","messageBody":"<div id=\"ygrps-yiv-911071177\">***My kids help out around the house, cleaning their rooms and helping with <br/>\nthings like stacking wood or taking out compost, etc.***<br/>\n<br/>\nMy son helped, too.  I didn&#39;t make him help, but he helped.<br/>\n<br/>\nRue Kream makes an important point in her book, &quot;Parenting a Free Child: An <br/>\nUnschooled Life.&quot;   She reminds parents that the more they say yes to their <br/>\nchild&#39;s requests to play... the more they&#39;re willing to stop what they&#39;re <br/>\ndoing and do what their little child wants them to do, the more natural it <br/>\nwill be for their child, when he&#39;s older, to say yes to the parent&#39;s <br/>\nrequests.  When a child asks a mom to play he really is asking for help <br/>\ndoing something that&#39;s important to him in the same way a moms desire to <br/>\nhave the house tidy is important to her.   Parent&#39;s being generous with <br/>\ntheir own time describes a family lifestyle.   But like many other kinds of <br/>\nlearning, being willing to help depends on readiness and maturity.<br/>\n<br/>\nParents can ruin a child&#39;s natural desire to be helpful by dictating how and <br/>\nwhen a child should help, being critical of they way a child helps and being <br/>\nunwilling to help in return.   I&#39;ve seen many moms tell their child to clean <br/>\nup his own mess (not a nice way to talk about someone&#39;s toys) but insist the <br/>\nchild help with dinner dishes which could very easily be seen as the cook&#39;s <br/>\nmess.<br/>\n<br/>\nSome people believe that a child will never learn to take care of a house if <br/>\nhis parents don&#39;t make him do at least some chores.   My experience and the <br/>\nexperience of other unschooling parents is much different.<br/>\n<br/>\nI was recently away from home for two weeks and my son, who is eighteen and <br/>\nwho was never required to help out around the house, took care of things at <br/>\nhome.   He cleaned cat litter pans twice a day, changed water bowls, cleaned <br/>\nup after and fed the bird, kept fifteen outside bird feeders and  four water <br/>\ndishes full, washed dishes every day, washed out cat food cans for the <br/>\nrecycle bin, dusted, swept, vacuumed and cleaned the bathroom.<br/>\n<br/>\nHe&#39;s been helping for years, this is just the latest example.<br/>\n<br/>\nHow did he learn to do all that without being made to do it?   He saw me <br/>\ndoing it every day for years.  His offers to help were met with gratitude, <br/>\nhe helped sometimes when asked and when he didn&#39;t want to help, his refusal <br/>\nwas graciously accepted.<br/>\n<br/>\nSome people believe children should help because they&#39;re part of the family. <br/>\nAnd I&#39;ve seen some kids accept this as a fact of life and help without too <br/>\nmuch resentment.    The kids whose parents also help them can have a good <br/>\nrelationship with their parents, but too often kids can feel like servants <br/>\nand that damages the relationship.<br/>\n<br/>\nFor me, a strong relationship with my son was more important than help <br/>\naround the house.   And it turns out that when a parent can put relationship <br/>\nfirst, helping becomes a natural part of living together.   I never believed <br/>\nmy child should be the free labor for the maintenance of my chosen standard <br/>\nof living.<br/>\n<br/>\nSometime when Dylan was very little and I was first reading John Holt, I <br/>\nwatched Dylan get a wash cloth and clean off the table.  He&#39;d seen me do it <br/>\nso many times and that night he tried it himself.  And I thought then that <br/>\nmost, and maybe all of what adults believe children need to be taught would <br/>\ncome naturally and happily to children without any instruction if parents <br/>\nwould stop requiring and start helping.<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":151505017,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;carenkh@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Deschooling and an intro of sorts..","postDate":"1288276558","msgId":45131,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhYzFvZStyYjRoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlhOGJnNSs4N2tzQGVHcm91cHMuY29tPg=="},"prevInTopic":45125,"nextInTopic":45132,"prevInTime":45130,"nextInTime":45132,"topicId":45081,"numMessagesInTopic":0,"msgSnippet":"-=-On another note, I m not leaning towards radical unschooling.  My kids help out around the house, cleaning their rooms and helping with things like stacking","messageBody":"<div id=\"ygrps-yiv-1040671823\">-=-On another note, I&#39;m not leaning towards radical unschooling.  My kids help out around the house, cleaning their rooms and helping with things like stacking wood or taking out compost, etc.-=-<br/>\n<br/>\nMy kids help out around the house, too - but they do so voluntarily, without coercion or manipulation or punishment or reward. They have the option of NOT helping, of saying, &quot;Not now&quot;, of not finishing something they start. <br/>\n<br/>\nMy youngest will often enthusiastically say &quot;Yes!&quot; when I ask if he&#39;d help with dishes, or putting things away, and he will usually go with me to where I&#39;m working, realize he&#39;d rather be doing something else, then go do whatever it is he&#39;d rather do. I don&#39;t berate him or shame him - I sincerely hope he has fun doing what he&#39;s doing, then I continue with the work.<br/>\n<br/>\nTwo different families can look exactly the same, but be very different. I was thinking about that the other day - it was the night before trash & recycling day, and I asked the boys if they could help get things outside & get the bins pulled to the street. We went through the house, finding the cat food cans the dog had found, emptying all the wastebaskets, then we took the bags to the bins.<br/>\n<br/>\nWhile we were outside, I saw a family down the street, doing the same thing - but the mom was yelling at her son to &quot;Get out here! I *told* you to put down that *@%$ video game!&quot; and he came out, unhappily and reluctantly, to &quot;help&quot; her.<br/>\n<br/>\nSomeone taking a photograph would get the same picture - a mom and son, pulling the bins to the street - but the feelings and relationships are very different.<br/>\n<br/>\nOften, young kids LOVE to help out around the house. Can they say &quot;No&quot;? Do they have to finish what they start? Do you let them finish their chosen activity before they help? Do you believe they &quot;should&quot; help because &quot;they&#39;re part of the family&quot;?<br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"s.waynforth@btinternet.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Deschooling and an intro of sorts..","postDate":"1288254052","msgId":45125,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NTE2Ny4zMzY4My5xbUB3ZWI4NjIwMS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGlhOGJnNSs4N2tzQGVHcm91cHMuY29tPg==","referencesHeader":"PGlhOGJnNSs4N2tzQGVHcm91cHMuY29tPg=="},"prevInTopic":45081,"nextInTopic":45131,"prevInTime":45124,"nextInTime":45126,"topicId":45081,"numMessagesInTopic":0,"msgSnippet":"Deschooling is stepping away from any and all structured educational activities while your child gets used to life outside of school. It s like summer vacation","messageBody":"<div id=\"ygrps-yiv-568624356\">Deschooling is stepping away from any and all structured educational activities <br/>\nwhile your child gets used to life outside of school. It&#39;s like summer vacation <br/>\nwithout the knowledge that school is 3 months away. The recommended time for <br/>\ndeschooling is a month for every year that your child was in school. So only a <br/>\nfew months for your son. It sounds as though your mom really facilitated the <br/>\ndeschooling period for you. Although, having brought school back to the table in <br/>\nSeptember may mean that you need to revisit deschooling for a bit longer. <br/>\n<br/>\nDoing worksheets for one&#39;s own amusement is very different than being assigned <br/>\nworksheets. They are fun, like colouring books or dot to dots or logic puzzles. <br/>\nWe used to have a few workbooks around. When Simon was 5, 6, 7 and maybe on a <br/>\nbit one of the things he really loved was for me to type math problems on the <br/>\ntypewriter for him to solve. And he liked flash cards. I would organise them so <br/>\nthey were counting up, you know 1+1=2 and 1+2=3 and 1+3=4 and he&#39;d whip through <br/>\nthem. It was instructive to me, the additive effect, as much as it was to him. <br/>\nAnd he liked playing that way and when he was done we&#39;d go do something else. <br/>\n<br/>\nPart of the hope is that deschooling will help you and your children see how <br/>\nlearning is an inevitable part of life. You&#39;ll see that the structure that <br/>\nschools put around learning isn&#39;t what holds learning up, it&#39;s kind of like <br/>\nthinking the view through a window is all of the outside. There is a real drive <br/>\nto define education as the thing you get behind a  bricks and mortar façade and <br/>\nnot from a life of exploring and being curious and examining. Deschooling is a <br/>\ntime when you can see the individual&#39;s initiative to learn coming back to them. <br/>\nAnd their learning may never replicate the learning that they would get in <br/>\nschool, it may never be about worksheets and word problems and essays on a novel <br/>\nthat they read. But it may be engaging conversations and a deep knowledge about <br/>\nthe things that have fascinated them throughout the days and weeks and months <br/>\nand years and a continued curiosity about the way things work. <br/>\n<br/>\nIf your daughter is excited and wanting to go to school you could look for a <br/>\nlovely school for her to go to. If she knows that she can choose to not go she <br/>\nmay decide at some point that she wants to stay home. In the meantime if you <br/>\nmake it fun to not go to school and to play and explore from home she may decide <br/>\nnot to go when the time comes for her to go. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n------------------<br/>\n<br/>\nHow exactly do you deschool?  <br/>\n<br/>\nI don&#39;t think I&#39;ve ever introduced my self here, My name is Megan and I&#39;ve got 3 <br/>\nkids ages 3, 4, and 7.  I&#39;m married to a Navy submariner, and we&#39;ve just done a <br/>\ncross country move from GA to WA.  We&#39;ve been homeschooling since last November <br/>\n(&#39;09, pulled my oldest from 1st grade after a horrid kindergarden and beginning <br/>\nof 1st grade.) and I&#39;ve tried all kinds of curriculum and such.  And what I find <br/>\nis that we do really good and then drift away from it. So between last Nov. - <br/>\nApril.  We gave our best effort to do school at home.  <br/>\n<br/>\n<br/>\nThen in April my son went to my mom&#39;s farm for spring break (his choice), which <br/>\nturned in to an extended stay (his choice) and eventually an early summer break, <br/>\nwhich then led into our trip across country. lol  Between April to September he <br/>\ndid nothing but hang out at the farm, play outside, play with the animals, raise <br/>\nchickens (which he was responsible for feeding and checking on his clutch), <br/>\ngarden with my mom, play his video games and watch tv.  They attempted to do a <br/>\nfew worksheets here or there but usually it wasn&#39;t much and he enjoyed what ever <br/>\nwas given to him. When he got out here we explored the area and he&#39;s played his <br/>\ngames and watched his TV shows and everything. <br/>\n<br/>\n<br/>\nSo in September we decided to try starting &#39;school&#39; again at home.  I got <br/>\neverything together and we started and again... drifted away again.  A few weeks <br/>\nago a friend and I attended an unschooling siminar and I became really <br/>\ninterested in unschooling.  It sounds appealing to me because I hated being <br/>\n&#39;schooled&#39; in anything, but I loved learning, still do.  <br/>\n<br/>\n<br/>\nThe thing is occasionally my son does ask to do school work, worksheets and <br/>\nstuff, he really likes seeing that he&#39;s completed the work and knows how to do <br/>\nit.  My 4 year old adores &#39;school&#39; and is always asking to do &#39;school work&#39;  <br/>\ninfact she asks me constantly when I&#39;m going to sign her up for school.  She was <br/>\nin daycare in GA, she loved it, and it was very progressive and led into a full <br/>\nday pre-k which they were preparing her for and telling her all about. So now <br/>\nshe is completely focused on the fact that she has to be signed up for school <br/>\nand has to do school work.  <br/>\n<br/>\n<br/>\nSo what is deschooling exactly and how do I do it, AND how do I deschool when my <br/>\nkids really want to do worksheets and workbooks? <br/>\n<br/>\n<br/>\nOn another note, I&#39;m not leaning towards radical unschooling.  My kids help out <br/>\naround the house, cleaning their rooms and helping with things like stacking <br/>\nwood or taking out compost, etc. They have bed times but nap times are left up <br/>\nto them.  So we don&#39;t quite fit the radical part I don&#39;t think. <br/>\n<br/>\n<br/>\nOK, Sorry for the book when I&#39;m just asking a question.  ;-P<br/>\n<br/>\n~Megan <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":402695638,"authorName":"vwmomof3","from":"&quot;vwmomof3&quot; &lt;vwmomof3@...&gt;","profile":"vwmomof3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Deschooling and an intro of sorts..","postDate":"1288155461","msgId":45081,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhOGJnNSs4N2tzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":45125,"prevInTime":45080,"nextInTime":45082,"topicId":45081,"numMessagesInTopic":0,"msgSnippet":"How exactly do you deschool? I don t think I ve ever introduced my self here, My name is Megan and I ve got 3 kids ages 3, 4, and 7.  I m married to a Navy","messageBody":"<div id=\"ygrps-yiv-1303432343\">How exactly do you deschool?  <br/>\n<br/>\nI don&#39;t think I&#39;ve ever introduced my self here, My name is Megan and I&#39;ve got 3 kids ages 3, 4, and 7.  I&#39;m married to a Navy submariner, and we&#39;ve just done a cross country move from GA to WA.  We&#39;ve been homeschooling since last November (&#39;09, pulled my oldest from 1st grade after a horrid kindergarden and beginning of 1st grade.) and I&#39;ve tried all kinds of curriculum and such.  And what I find is that we do really good and then drift away from it. So between last Nov. - April.  We gave our best effort to do school at home.  <br/>\n<br/>\nThen in April my son went to my mom&#39;s farm for spring break (his choice), which turned in to an extended stay (his choice) and eventually an early summer break, which then led into our trip across country. lol  Between April to September he did nothing but hang out at the farm, play outside, play with the animals, raise chickens (which he was responsible for feeding and checking on his clutch), garden with my mom, play his video games and watch tv.  They attempted to do a few worksheets here or there but usually it wasn&#39;t much and he enjoyed what ever was given to him. When he got out here we explored the area and he&#39;s played his games and watched his TV shows and everything. <br/>\n<br/>\nSo in September we decided to try starting &#39;school&#39; again at home.  I got everything together and we started and again... drifted away again.  A few weeks ago a friend and I attended an unschooling siminar and I became really interested in unschooling.  It sounds appealing to me because I hated being &#39;schooled&#39; in anything, but I loved learning, still do.  <br/>\n<br/>\nThe thing is occasionally my son does ask to do school work, worksheets and stuff, he really likes seeing that he&#39;s completed the work and knows how to do it.  My 4 year old adores &#39;school&#39; and is always asking to do &#39;school work&#39;  infact she asks me constantly when I&#39;m going to sign her up for school.  She was in daycare in GA, she loved it, and it was very progressive and led into a full day pre-k which they were preparing her for and telling her all about. So now she is completely focused on the fact that she has to be signed up for school and has to do school work.  <br/>\n<br/>\nSo what is deschooling exactly and how do I do it, AND how do I deschool when my kids really want to do worksheets and workbooks? <br/>\n<br/>\nOn another note, I&#39;m not leaning towards radical unschooling.  My kids help out around the house, cleaning their rooms and helping with things like stacking wood or taking out compost, etc. They have bed times but nap times are left up to them.  So we don&#39;t quite fit the radical part I don&#39;t think. <br/>\n<br/>\nOK, Sorry for the book when I&#39;m just asking a question.  ;-P<br/>\n<br/>\n~Megan</div>","specialLinks":[]}],"prevTopicId":45118,"nextTopicId":45133}}