{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":171127956,"authorName":"G&M Contracting Inc., Kenneth Gillilan","from":"&quot;G&M Contracting Inc., Kenneth Gillilan&quot; &lt;gmcontractinginc@...&gt;","profile":"vermontones","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Corpse Flower live webcam","postDate":"1089398683","msgId":1691,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVBRUFJSkpKSURLSUFCTUVOT0hJQ0VKQUNEQUEuZ21jb250cmFjdGluZ2luY0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEJEMTAwMDU0LjI4QzcwJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":1446,"nextInTopic":0,"prevInTime":1690,"nextInTime":1692,"topicId":1215,"numMessagesInTopic":0,"msgSnippet":"Joyce, What happened to the corpse flower?!  Is it blooming or did it die?  It seems to have lost it s pod. AnnMarie My daughter and I were toying with the","messageBody":"<div id=\"ygrps-yiv-616234420\">Joyce,<br/>\n    What happened to the corpse flower?!  Is it blooming or did it die?  It<br/>\nseems to have lost it&#39;s pod.<br/>\n<br/>\nAnnMarie<br/>\nMy daughter and I were toying with the idea of going to see/smell it if we<br/>\ncould gauge when it was going to open.<br/>\n  -----Original Message-----<br/>\n  From: Fetteroll [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>]<br/>\n  Sent: Tuesday, July 06, 2004 7:08 AM<br/>\n  To:<br/>\n<br/>\n        Yahoo! Groups Sponsor<br/>\n              ADVERTISEMENT<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n----------------------------------------------------------------------------<br/>\n--<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n<br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Corpse Flower live webcam","postDate":"1089112084","msgId":1446,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJEMTAwMDU0LjI4QzcwJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDQwNjI4MDIyNi5pNVMyUXJRRjA5OTgzN0Bwcm94eTEuYWRkci5jb20+"},"prevInTopic":1215,"nextInTopic":1691,"prevInTime":1445,"nextInTime":1447,"topicId":1215,"numMessagesInTopic":0,"msgSnippet":"Apparently the corpse flower only blooms once every 75 years and then only for a few days. There s a webcam on one at the University of Connecticut. Apparently","messageBody":"<div id=\"ygrps-yiv-1264892269\">Apparently the corpse flower only blooms once every 75 years and then only<br/>\nfor a few days.<br/>\n<br/>\nThere&#39;s a webcam on one at the University of Connecticut. Apparently its<br/>\nblooming is imminent!<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.news.uconn.edu/2004/jun2004/rel04065.htm\">http://www.news.uconn.edu/2004/jun2004/rel04065.htm</a><br/>\n<br/>\nHere&#39;s the article from the webpage:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; STORRS, Conn.  Within the next few weeks, New Englanders will have the<br/>\n&gt; opportunity to see and smell one of the strangest productions of the vegetable<br/>\n&gt; kingdom: the titan arum, or corpse flower, which features a gigantic bloom <br/>\n&gt; and a mighty stench -- is expected to open sometime near the end of June, at<br/>\n&gt; the University of Connecticut&#39;s Department of Ecology and Evolutionary Biology<br/>\n&gt; Conservatory. Live Webcam<br/>\n&gt; <br/>\n&gt; The last time a corpse flower opened in the northeast was in the 1930s, at the<br/>\n&gt; New York Botanical Garden. Fewer than two-dozen have flowered in the United<br/>\n&gt; States since the titan arum bloomed for the first time in cultivation, at the<br/>\n&gt; Royal Botanic Gardens in Kew, England, in 1889.<br/>\n&gt; <br/>\n&gt; Currently, the UConn-based flower bud is more than three feet high and growing<br/>\n&gt; by several inches each day. Clint Morse, plant growth facilities manager and<br/>\n&gt; the researcher who obtained and planted the titan arum, is estimating the<br/>\n&gt; plant will flower between June 28 and July 2. He emphasizes, however, that<br/>\n&gt; those dates only represent his best guess.<br/>\n&gt; <br/>\n&gt; The fully open flower lasts only a few days, so visitors hoping to catch it at<br/>\n&gt; its peak will have to time their visit carefully. The infamous odor of the<br/>\n&gt; corpse flower is strongest just as the flower opens, becoming faint, for<br/>\n&gt; better or worse, after the first day. Already, gardeners, botanists and<br/>\n&gt; curiosity-seekers from across the northeast and beyond are making plans to<br/>\n&gt; travel to Storrs to experience the horticultural equivalent of twin NCAA<br/>\n&gt; basketball championships.<br/>\n&gt; <br/>\n&gt; The titan arum (Amorphophallus titanum) is a native of the sultry equatorial<br/>\n&gt; rainforests of the Indonesian island of Sumatra, where it is known as bunga<br/>\n&gt; bangkai, the corpse flower. Plants grow from a potato-like underground tuber,<br/>\n&gt; which produces umbrella-shaped leaves 10 feet high and 15 feet across. Only a<br/>\n&gt; single leaf is present at any one time, but it is dissected into many smaller<br/>\n&gt; leaflets. The whole looks something like a palm tree with a spotted green<br/>\n&gt; trunk, and is rather attractive. A leaf can last for several years before it<br/>\n&gt; withers and is replaced, all the time quietly capturing sunlight and storing<br/>\n&gt; food in the tuber. Eventually, after the tuber has grown to weigh as much as<br/>\n&gt; an average man, the corpse flower decides to bloom. The bud on the UConn plant<br/>\n&gt; could grow to more than six-feet-tall before it opens.<br/>\n&gt; <br/>\n&gt; Corpse flowers bloom directly from their tubers, in between cycles of leaf<br/>\n&gt; production (like an amaryllis). Flowers are about 6 feet high and 3 feet<br/>\n&gt; across, shaped like an urn, with a tall spike rising from the center.<br/>\n&gt; (Technically, this is a composite of many small flowers, but it looks like one<br/>\n&gt; gigantic flower.) They are similar in shape to the flowers of local woodland<br/>\n&gt; plants like jack-in-the-pulpit and skunk cabbage, or to calla lilies, all of<br/>\n&gt; which are distant relatives.<br/>\n&gt; <br/>\n&gt; The corpse flower is specifically adapted to attract carrion flies and<br/>\n&gt; beetles, which ferry pollen between plants so they can produce seed, a job<br/>\n&gt; accomplished for more ordinary plants by bees or butterflies. The colors of<br/>\n&gt; the corpse flower  a sickly yellow and blackish purple -- imitate a pot roast<br/>\n&gt; that sat out in the sun for a week. The fragrance is universally described as<br/>\n&gt; being powerful and revolting, with elements of old socks, dead fish and rotten<br/>\n&gt; vegetables. As if that isn&#39;t weird enough, the corpse flower is actually<br/>\n&gt; warm-blooded, heating itself up at the height of flowering, probably to help<br/>\n&gt; spread its putrid odor. All of this is totally irresistible to flies, who must<br/>\n&gt; think they&#39;ve chanced upon a dead elephant, and are tricked into pollinating<br/>\n&gt; the plant. <br/>\n&gt; <br/>\n&gt; The corpse flower is uncommon and difficult to locate in the wilds of Sumatra,<br/>\n&gt; and very rare in cultivation. Recent greenhouse flowerings in California,<br/>\n&gt; Washington, D.C., and London have attracted coverage from the international<br/>\n&gt; media, and thousands of visitors who braved longlines and foul odors for a<br/>\n&gt; glimpse of this botanical marvel. The UConn bloom will be the first ever in<br/>\n&gt; New England, and the only one anywhere in the northeast since the New York<br/>\n&gt; Botanical Gardens had a specimen in the 1930s. That earlier flowering inspired<br/>\n&gt; the designation of Amorphophallus titanum as the official flower of the Bronx,<br/>\n&gt; a title that was maintained until quite recently, when a more innocuous form<br/>\n&gt; of vegetation was chosen to replace it.<br/>\n&gt; <br/>\n&gt; The Connecticut corpse flower was started 10 years ago, from a seed the size<br/>\n&gt; of a lima bean, donated to UConn by botanical explorer James Symon. Since<br/>\n&gt; then, the plant has been nurtured in an environment of bright light, high<br/>\n&gt; humidity, and constant warmth. It also receives plenty of food, in the form of<br/>\n&gt; plain houseplant fertilizer. It is not carnivorous, as some people suppose.<br/>\n&gt; Only now, after growing a tuber that is splitting the sides of a pot bigger<br/>\n&gt; than a garbage can, has the plant stored enough resources to bloom. Readers<br/>\n&gt; may check the progress of the flower bud in person at the Department of<br/>\n&gt; Ecology and Evolutionary Biology&#39;s Conservatory, located behind the Torrey<br/>\n&gt; Life Sciences Building on North Eagleville Road, or on the web at:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://florawww.eeb.uconn.edu/Titanum/Titanum2004.html\">http://florawww.eeb.uconn.edu/Titanum/Titanum2004.html</a><br/>\n&gt; <br/>\n&gt; It tends to be warm in the greenhouse, so bring water and light clothing.<br/>\n&gt; Admission is free.<br/>\n&gt; <br/>\n&gt; About the University of Connecticut Ecology and Evolutionary Biology<br/>\n&gt; Conservatory <br/>\n&gt; <br/>\n&gt; The UConn EEB Conservatory is the finest collection of exotic plants under<br/>\n&gt; glass between New York and Montreal, with outstanding displays of orchids,<br/>\n&gt; cacti and succulents, carnivorous plants, tropical ferns, and many other<br/>\n&gt; groups. The collections are used for classes, public outreach, and research<br/>\n&gt; into plant biology and conservation.<br/>\n&gt; <br/>\n&gt; The Conservatory is open to the public from 8 a.m.-4 p.m. weekdays. While the<br/>\n&gt; corpse flower is open, the Conservatory will be open from 8 a.m.-8 p.m., daily<br/>\n&gt; and on weekends. [Update]<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Joyce</div>","specialLinks":[]},{"userId":121772804,"authorName":"Kate Sitzman","from":"&quot;Kate Sitzman&quot; &lt;kate@...&gt;","profile":"kate_sitzman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Killing Monsters / Flow States","postDate":"1088389608","msgId":1215,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNjI4MDIyNi5pNVMyUXJRRjA5OTgzN0Bwcm94eTEuYWRkci5jb20+"},"prevInTopic":0,"nextInTopic":1446,"prevInTime":1214,"nextInTime":1216,"topicId":1215,"numMessagesInTopic":0,"msgSnippet":"I found this passage in a book called Killing Monsters by Gerard Jones. I highly recommend it to anyone struggling with the TV issue. I typed out this ","messageBody":"<div id=\"ygrps-yiv-1371849456\">I found this passage in a book called &quot;Killing Monsters&quot; by Gerard Jones. I<br/>\nhighly recommend it to anyone struggling with the TV issue. I typed out this<br/>\nlengthy quote, because I feel like it really sums up how useful TV can be in<br/>\nan unschooling context. Bear with me.<br/>\n<br/>\n <br/>\n<br/>\n{Quote}<br/>\n<br/>\n&quot;[Mihaly] Csikszentmihalyi developed the concept of &#39;flow,&#39; a confluence of<br/>\nemotion, cognitive function, social affect, and self perception. In &#39;high<br/>\nflow&#39; states, people feel happy and learn quickly, present themselves<br/>\nappealingly to the world, and think well of themselves. In &#39;low flow&#39; they<br/>\nfeel depressed, have trouble processing information, chase the world away<br/>\nwith their affect, and criticize themselves harshly.  Csikszentmihalyi has<br/>\nfound that teenagers highest flow states occur when they are deeply immersed<br/>\nin a demanding activity or socializing. Their lowest states occur during<br/>\nclassroom lectures, when they feel bored, disaffected, passive, and trapped.<br/>\nAlmost as low are the flow states they experience during solitary passive<br/>\nentertainment, especially watching TV. The research indicates that teenagers<br/>\nwho engage in less passive entertainment and more activities, whether<br/>\nindividual or social, tend to do better later in life. &#39;Activities that<br/>\nencourage high flow states make demands of us,&#39; Csikszentmihalyi said,<br/>\n&#39;force us to expand our personalities and learn new dimensions of ourselves.<br/>\nThe difficulty is that the low flow state is so much easier to settle into<br/>\nand remain trapped in. The danger of television is that it is such a<br/>\nseductive medium. We may turn it on because there is something we truly want<br/>\nto learn from it, but once it&#39;s on it is so easy to just sit there. Our mood<br/>\nlowers, and still we sit.&#39; <br/>\n<br/>\n <br/>\n<br/>\nHe has pointed out, however, that the situation is more complex than<br/>\nTV-is-bad, activities-are-good. Research suggests that through the age of<br/>\nabout twelve, children considered &#39;talented&#39; tend to watch more television<br/>\nthan &#39;less talented&#39; children. From the age of about fourteen, that<br/>\nreverses; more talented teenagers watch less TV. &#39;I believe this is because<br/>\nyounger children use television as a source of ideas and fantasies,&#39; he<br/>\nsaid. &#39;They watch, they discover, and then they think about what they&#39;ve<br/>\ndiscovered, play games with it, and draw pictures of it. Then, at a certain<br/>\npoint, the medium becomes redundant. They&#39;ve seen just about everything it<br/>\nhas to offer, or they&#39;ve discovered more fertile sources of ideas. The young<br/>\npeople who continue to watch large amounts of television through adolescence<br/>\ntend to be using it as a relaxant or time killer, and so keep themselves in<br/>\na low mood.&#39;<br/>\n<br/>\n <br/>\n<br/>\nThe critical difference is in the viewer&#39;s relationship with the material.<br/>\nCsikszentmihalyi has found that flow states can be quite high when a child<br/>\nis watching TV with a friend or family member and talking about what he<br/>\nsees. Even solitary watching can be active: &#39;If a person watches a<br/>\nhistorical documentary because he wants to understand the topic, and he<br/>\nlooks at it very closely, perhaps saying &#39;Wait, that isn&#39;t true. Who<br/>\nproduced this? What are they trying to put across? Or if he watches a<br/>\nbasketball game and is wondering, why isn&#39;t Kobe Bryant playing his best<br/>\ngame? Or if he watches an action movie and tries to understand how the<br/>\neffects were achieved, or what&#39;s going to happen  next, or why the<br/>\nscreenwriter made that decision. These are very active states, and they can<br/>\nbe very valuable. Another activity, even a lecture or the opera, will be far<br/>\nless useful if we&#39;re only going through the motions.&quot;<br/>\n<br/>\n <br/>\n<br/>\n{END Quote}<br/>\n<br/>\n <br/>\n<br/>\nI think I had an intuitive sense of flow states before I heard the term, and<br/>\nthat intuition told me that TV was sort of a passive, depressing force,<br/>\nwhich made me feel like it wasn&#39;t necessary in my kids&#39; lives. I have since<br/>\ncome to feel differently (largely because of these unschooling lists) and I<br/>\nthink I finally turned the corner when I realized that TV wasn&#39;t solely a<br/>\npassive activity but could be as active as anything else.  This quote really<br/>\nmirrored my thought process on the issue and I just wanted to share it. I<br/>\nthink the flow states concept also is a useful concept in terms of<br/>\nunschooling, because it really encompasses the heart of what makes<br/>\nunschooling work. We are helping keep our children maintain high flow<br/>\nstates, and as long as they stay in that mental space, they are free to<br/>\nlearn.<br/>\n<br/>\n <br/>\n<br/>\nKate<br/>\n<br/>\nDuvall, WA<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":1381,"nextTopicId":1695}}