{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":65,"messages":[{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unlimited video games for six year old","postDate":"1238019578","msgId":39096,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdxZWFscSs1aG9jQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGEyYzdjODAxMDkwMzI0MTIwMHY1MGYzZGQ2OGxkMzk0ZWVlNDE3ODUzYWZAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":39094,"nextInTopic":39097,"prevInTime":39095,"nextInTime":39097,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"~~I really think this depends on the family and the kiddo. As the wife of a psychologist, I just cannot help but point out that video game addiction is a real","messageBody":"<div id=\"ygrps-yiv-1174938046\">~~I really think this depends on the family and the kiddo. As the wife of a psychologist, I just cannot help but point out that video game addiction is a real issue (as is the sedentary lifestyle it brings.~~<br/>\n<br/>\n<br/>\nPeople turn to addictions to escape. Happy unschooled kids aren&#39;t needing to escape very often (though life can throw some really painful stuff our way regardless and escaping into video games might be a great salve!).<br/>\n<br/>\nI think many psychologists and other &quot;experts&quot; have been taught to pathologize any and all behavior. It makes money. Trusting and supporting a person doesn&#39;t make as much money. If you can label something and drug a person, or put them in therapy, it&#39;s a lot more profitable. Not that people never need professional help....I cringe when they start labeling things &quot;addictions&quot; though and parents feel so justified in keeping their children from something they really, truly love. <br/>\n<br/>\n<br/>\n~~ It is not a problem for every kid. It is also not a healthy or safe<br/>\nchoice for every kid to have access to video games.~~<br/>\n<br/>\nIt&#39;s less healthy and safe to control other people.<br/>\nAny kid that loves video games should have access to them. As parents, it is up to us to find ways to support our children and give them tools to cope with challenges, not ban them from something they adore. Though that is really the easy way out. Takes a lot more creativity and willingness to deeply connect if you&#39;re going to support a child for whom video games can be challenging.<br/>\n<br/>\nControl only works for so long. What do you think happens as soon as that child is away from you?  How will you continue to control them as they get older and spend more and more time away from you? Because it happens pretty fast....trust me.<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":9543528,"authorName":"hoffmanwilson@yahoo.com","from":"hoffmanwilson@...","profile":"hoffmanwilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Unlimited video games for six year old","postDate":"1238001915","msgId":39092,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0NDE0NC42ODA3Ni5xbUB3ZWIzNjkwMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":39090,"nextInTopic":39093,"prevInTime":39091,"nextInTime":39093,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"{quote} http://addiction.lovetoknow.com/wiki/Video_Game_Addiction Video game addiction is not a physical addiction like alcoholism. However, it shares many","messageBody":"<div id=\"ygrps-yiv-1454962692\">{quote}<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://addiction.lovetoknow.com/wiki/Video_Game_Addiction\">http://addiction.lovetoknow.com/wiki/Video_Game_Addiction</a><br/>\n<br/>\nVideo game addiction is not a physical addiction like alcoholism. However,<br/>\nit shares many similarities with compulsive gambling. Many video game<br/>\naddicts spend 10 or more hours playing games each day. They often structure<br/>\ntheir lives around their favorite games and become defensive when confronted<br/>\nabout their behavior.<br/>\n<br/>\nIf you think you may be a video game<br/>\n addict, ask yourself the following<br/>\nquestions:<br/>\n<br/>\n   - Do you neglect relationships with your friends and family to spend more<br/>\n   time playing video games?<br/>\n   - Do you struggle to keep up with your schoolwork and/or professional<br/>\n   responsibilities? * Have you ever taken a “sick day” to play your favorite<br/>\n   game?<br/>\n   - Do you lie to others about your video game use? Have you ever been<br/>\n   criticized by someone close to you for spending too much time playing video<br/>\n   games?<br/>\n   - When you’re not playing video games, do you feel angry or depressed? Do<br/>\n   you spend your time wishing you could be playing your<br/>\n favorite game?<br/>\n   - Do you get so engrossed in video games that you neglect to eat, sleep,<br/>\n   or shower?<br/>\n   - Do you suffer from backaches, dry eyes, or headaches after playing<br/>\n   video games? Have you been diagnosed with carpal tunnel syndrome?<br/>\n<br/>\n{end quote}<br/>\n<br/>\nI find my daughter reading for fun 10 hours a day on most days.  She<br/>\n often structures her life around it--like, say, remembering to bring a book when she rides in the car, or planning her day around going to the library to further supply her &quot;addiction&quot;.  Would she become defensive if I confronted her and told her &quot;you read to much!  You&#39;re addicted!&quot;?  Probably, if by &quot;defensive&quot; you mean &quot;Uh, no I&#39;m not, I&#39;m reading just the right amount for me--and who are you and what have you done with my mother?&quot;.<br/>\n<br/>\nDoes she &quot;neglect&quot; spending time with her friends and family to read?  Well, yeah...but I&#39;m a big girl and I can handle it.<br/>\n<br/>\nDoes she have a hard time keeping up with her &quot;schoolwork&quot;?  Um, she might if she had any...<br/>\n<br/>\nDoes she have to lie about her time reading and get criticized for it?  Well, wouldn&#39;t that be a statement about those around her rather than her?  She would need to get more supportive friends!<br/>\n<br/>\nDoes she forget to eat?  She might, but I nicely bring her food when I think she might be hungry.  I often forget to eat when I get into things, too...<br/>\n<br/>\nDoes she get dry eyes?  Uh, yeah....does that mean she has an addiction or needs to see an opthamologist?  <br/>\n<br/>\nAgain, this addictive language is all about looking at someone else&#39;s interest from a negative point of view.  Hiking or knitting or listening to NPR can all be things people like to do to the exclusion of other things, but it&#39;s up to others to set their own priorities, not me....<br/>\n<br/>\nDana<br/>\nrabid unschooling mama (frothing at the mouth) to Lauren, 16, Otto, 11, and Miranda, 10 months!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unlimited video games for six year old","postDate":"1238001770","msgId":39094,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0MjQxOC4yMjI5My5xbUB3ZWI4NjIwMS5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PDIyMjAzMi40MTg1Ny5xbUB3ZWI2MzEwNS5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":39093,"nextInTopic":39096,"prevInTime":39093,"nextInTime":39095,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"Have you tried getting something like a small trampoline for him to jump on while playing on a video game? Or get a stationary bike or have races around the","messageBody":"<div id=\"ygrps-yiv-662885616\">Have you tried getting something like a small trampoline for him to jump on while playing on a video game? Or get a stationary bike or have races around the house. Linnaea likes time races from downstairs to upstairs. Movement makes a big difference to my mood. <br/>\n<br/>\nCan you watch what he&#39;s doing and offer a break in a moment when the game is at it&#39;s own break? Or ask him if this is a good moment to interrupt? Rather then seeing it as protecting himself from himself see it as offering to help and ask if he&#39;d like to take a break now. If he says no than that&#39;s a no. If he says yes than that&#39;s a yes. Treat either answer as his true answer, don&#39;t harangue, don&#39;t remind him that he asked you to do it, just accept his answer. If he really wants to stop playing the game at more regular intervals he&#39;ll do so with the reminder. You don&#39;t have to be more responsible for his decision to play or not to play than he is. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n--------------<br/>\n<br/>\nWe too have struggled with video game related irritability.  Andrew<br/>\n(almost 9) will play for long hours without breaks and becomes<br/>\nirritable and short tempered after about an hour or so, and<br/>\nincreasingly so when he plays for longer.<br/>\n <br/>\nI&#39;ve noticed the same<br/>\nthing in myself when I read for too long without a break, especially<br/>\nsomething really engrossing like a novel.  (I read fast and voraciously<br/>\nand have been known to go AWOL into a book for hours, not coming up<br/>\nuntil it&#39;s finished.)  When I finally stop, I feel sort of groggy and<br/>\nirritable.  It fades in less than an hour.  This doesn&#39;t mean to me<br/>\nthat I should never read, but I have been trying to discipline myself<br/>\nto take an hour off after reading for an hour, and that seems to help. <br/>\nI use a timer to remind myself.<br/>\n <br/>\nAnyway, I&#39;m trying to figure<br/>\nout a way to help my son find balance with the computer and the rest of<br/>\nlife, especially since he&#39;s begun to mention that he wishes the<br/>\ncomputer didn&#39;t suck up all of his time.  I do think that the computer<br/>\ncan be a sort of hyperstimulus, more attention grabbing than the<br/>\nactivities our brains are adapted for, and so can be harder to say<br/>\n&quot;enough&quot; to on one&#39;s own.<br/>\n <br/>\nHow do you respond to &quot;Odysseus<br/>\nrequests&quot; from children. (When a child asks you to protect him from<br/>\nhimself, like Odysseus when he tied himself to his ship&#39;s mast to hear<br/>\nthe Siren&#39;s but instructed his crew not to untie him, no matter what he<br/>\nsaid).  He gets really angry when I remind him of his desire to take a<br/>\nbreak after some amount of time or when he&#39;s becoming clearly extremely<br/>\nfrustrated, but he settles down and changes activities in a minute or<br/>\ntwo...and he gets angry later if I was unable to &quot;make&quot; him take a<br/>\nbreak.<br/>\n <br/>\nTamara<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"diana jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Problem solving WAS Unlimited video games for \tsix year old","postDate":"1237999275","msgId":39093,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDkwMzI1MDk0MWk3N2U2OGUzZG4yYmZmMTBkNTEzZGNiMWQwQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdxZGtqMSt0bWo1QGVHcm91cHMuY29tPg==","referencesHeader":"PDIyMjAzMi40MTg1Ny5xbUB3ZWI2MzEwNS5tYWlsLnJlMS55YWhvby5jb20+CSA8Z3Fka2oxK3RtajVAZUdyb3Vwcy5jb20+"},"prevInTopic":39092,"nextInTopic":39094,"prevInTime":39092,"nextInTime":39094,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"... This is brilliant! (and I was about to say the same thing :::bg:::) A real life recent example: Hayden wanted to spend our vacation on the day shift","messageBody":"<div id=\"ygrps-yiv-2050147601\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; Make some concrete plans with him, to try and review after the fact. Expect<br/>\n&gt; him to be upset in the moment - bc you know that he&#39;s going to be cranky<br/>\n&gt; from being on the computer anyway. Don&#39;t take it personally in the moment,<br/>\n&gt; wait and discuss the matter later - did that work for him? Wanna try it<br/>\n&gt; again or something different next time? Brainstorm a whole bunch of options<br/>\n&gt; - giving a five minute warning, having a snack available for him, but in<br/>\n&gt; another room, setting a timer, creating some &quot;transitional time&quot; between<br/>\n&gt; being on the computer and whatever else he wants to do where he can change<br/>\n&gt; gears (take a shower, jump on the trampoline, change clothes, whatever).<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>This is brilliant! (and I was about to say the same thing :::bg:::)<br/>\nA real life recent example: Hayden wanted to spend our vacation on &quot;the day<br/>\nshift&quot; which is usually a 3-4 day transition from his usual nocturnal hours.<br/>\n<br/>\nHe was still on &quot;the night shift&quot; when we left on Friday morning.  He slept<br/>\nin the car and requested I wake him after only a &quot;nap&quot; amount of time. We<br/>\ndiscussed this dedication to &quot;the day shift&quot; and it&#39;s importance to what we<br/>\nhad going on this week (it&#39;s his vacation too - I work to make things<br/>\nlate-day so he can get enough sleep). Internally, I prepared myself for some<br/>\nserious highway miles with a crabby, tired boy. When I woke him up, I was<br/>\nsure the landscape was interesting, that food, treats, stretch and potty<br/>\nopportunities, were all nearby. Protein within arms reach is important<br/>\n(cliff bar at the ready!) and some immediate blood sugar (sprite for him) so<br/>\nI can gently warm him up and release any and ALL attachment to his<br/>\ncrabbiness. I breathed a lot. and a lot more. I even told him that his<br/>\ngrumpiness was okay and that I totally understood how tired he was... and<br/>\ntalked of all day at Magic Mountain with our friends and playing together<br/>\n(they&#39;re &quot;day shift&quot; folk ::bg::) and the things important to him... he too<br/>\nbreathed and relaxed. We took a big break with a sit-down meal, got back in<br/>\nthe car.  All told, it was maybe 50 miles of his adjustment, not so bad out<br/>\nof an 800+ mile drive :D<br/>\nAnd he&#39;s on a late to bed, late to rise schedule, which works perfectly with<br/>\nmy pre-planned late start for most days :D  Yesterday he napped at Gramma&#39;s<br/>\nhouse and everyone thought it was adorable - so you never know!! ;)<br/>\nI use the Q-TIP mantra in those moments, sometimes reinforcing it with the<br/>\near-cleaning motion: Quit Taking It Personally.<br/>\nIt gets easier with practice ;)<br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.blogspot.com<br/>\nhannahsashes.blogspot.com<br/>\ndianas365.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: video gaming is a phase? or a passion.","postDate":"1237997813","msgId":39090,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdxZGxkbCtiNjY5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGQzMTc1M2M5MDkwMzI0MTk1MmliNzgzMWJrMzFmMDZjYWMwYWJhY2U0YUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":39087,"nextInTopic":39092,"prevInTime":39089,"nextInTime":39091,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"... It could be developmental - he s less interested in little kid activities and wanting more big kid fun and finding video games is filling that niche","messageBody":"<div id=\"ygrps-yiv-1111889836\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Karen James &lt;semajrak@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I was wondering if the moodiness and lack of interest in other activities is<br/>\n&gt; a phase, not video game playing.<br/>\n<br/>\n </span></blockquote>It could be developmental - he&#39;s less interested in &quot;little kid&quot; activities and wanting more &quot;big kid&quot; fun and finding video games is filling that niche right now. A lot of kids start saying &quot;I&#39;m bored&quot; around age 7 for this reason, so he&#39;s in the ballpark for that kind of shift to be happening.<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Problem solving WAS Unlimited video games for six year old","postDate":"1237996961","msgId":39087,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdxZGtqMSt0bWo1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIyMjAzMi40MTg1Ny5xbUB3ZWI2MzEwNS5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":39082,"nextInTopic":39090,"prevInTime":39086,"nextInTime":39088,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"... **************************** I don t see it so much as asking to be protected from himself as that he s problem solving with you in mind as a resource.","messageBody":"<div id=\"ygrps-yiv-1571913435\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Tamara Griesel &lt;griesellists@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; How do you respond to &quot;Odysseus requests&quot; from children. (When a child asks you to protect him from himself, like Odysseus when he tied himself to his ship&#39;s mast to hear the Siren&#39;s but instructed his crew not to untie him, no matter what he said).  He gets really angry when I remind him of his desire to take a break after some amount of time or when he&#39;s becoming clearly extremely frustrated, but he settles down and changes activities in a minute or two...and he gets angry later if I was unable to &quot;make&quot; him take a break.<br/>\n </span></blockquote>****************************<br/>\n<br/>\nI don&#39;t see it so much as asking to be &quot;protected from himself&quot; as that he&#39;s problem solving with you in mind as a resource. There are things *I* can&#39;t do without help, or don&#39;t do as well, or as promptly. One of the strategies I&#39;ve built up over the years is to tell people up front when I might need help with a personal challenge. One example is lending books - don&#39;t ever lend me a book unless you&#39;re prepared to come to my house to get it back. I&#39;m That bad at returning them! I make a point to tell people now. Other things, too - I don&#39;t know what kind of car I drive (a green one) ask George. I probably won&#39;t be at a playgroup unless someone calls to remind me that morning. Sometimes we Need other people to help us make decision, follow through on plans, to think clearly. The difference with unschooling is that we don&#39;t demand to do those things for our kids - but we are their most important resource.<br/>\n<br/>\nSo you&#39;re son is telling you he needs help getting away from the computer. Make some concrete plans with him, to try and review after the fact. Expect him to be upset in the moment - bc you know that he&#39;s going to be cranky from being on the computer anyway. Don&#39;t take it personally in the moment, wait and discuss the matter later - did that work for him? Wanna try it again or something different next time? Brainstorm a whole bunch of options - giving a five minute warning, having a snack available for him, but in another room, setting a timer, creating some &quot;transitional time&quot; between being on the computer and whatever else he wants to do where he can change gears (take a shower, jump on the trampoline, change clothes, whatever).</div>","specialLinks":[]},{"userId":117369878,"authorName":"Kelli Traaseth","from":"Kelli Traaseth &lt;kellitraas@...&gt;","profile":"kellitraas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] video gaming is a phase? or a passion.","postDate":"1237984236","msgId":39082,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1MTk4OS4xMDUzNi5xbUB3ZWI1MTExMi5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGQzMTc1M2M5MDkwMzI0MTk1MmliNzgzMWJrMzFmMDZjYWMwYWJhY2U0YUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":39080,"nextInTopic":39087,"prevInTime":39081,"nextInTime":39083,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"***If my son wanted to work in the video game industry, my husband said he would work for him! I was wondering if the moodiness and lack of interest in other","messageBody":"<div id=\"ygrps-yiv-1018124843\">***If my son wanted to work in the video<br/>\n<br/>\ngame industry, my husband said he would work for him!<br/>\n<br/>\nI was wondering if the moodiness and lack of interest in other activities is<br/>\n<br/>\na phase, not video game playing.****<br/>\n<br/>\nAh, I see.  Sorry for the misunderstanding,  I&#39;ve heard lots of parents refer to gaming as a phase.  <br/>\n<br/>\n<br/>\nAs far as a lack of interest in other activities, it seems to me that some of us love to do lots of different things and others like to hyper-focus on a particular interest.  I like everything but my son on the other hand is an intense study  &lt;g&gt;.  He&#39;ll learn everything and anything about what ever it is that he&#39;s interested in,  pretty amazing!  :)<br/>\n<br/>\nAs far as the emotions that are accompanying the gaming, he&#39;ll learn to deal with those frustrations.  We would and still do talk about taking breaths and maybe leaving the game for a bit.  It&#39;s amazing how my oldest two kids right now are so patient when it comes to problem solving.  I really think it has something to do with working through their challenges on games.  I think I saw a major change in Alec around 11-12, regarding his level of patience and calmheadedness, whether it was a challenging boss or level in a game or getting through a hard step in building legos.  He and my oldest daughter, she&#39;s 14, really do exhibit more patience and self understanding than myself sometimes, especially when it comes to something that is challenging them.  It&#39;s pretty cool :)<br/>\n<br/>\n***I was wondering if we started too soon<br/>\n<br/>\n<br/>\n(introducing unlimited play) and if we should allow more room for him to<br/>\n<br/>\n<br/>\ndiscover himself first, which I am sure we could still gently do.****<br/>\n<br/>\nI think by choosing unschooling, (complete unschooling, in my mind) you are allowing him the most room for him to discover himself.  If you limit him it seems like that&#39;s when you wouldn&#39;t be allowing him to find himself.<br/>\n<br/>\n<br/>\n<br/>\nKelli~<br/>\n     <a rel=\"nofollow\" target=\"_blank\" href=\"http://ourjoyfullife.blogspot.com/%c2%a0\">http://ourjoyfullife.blogspot.com/%c2%a0</a> <br/>\n<br/>\n&quot;There are no ordinary moments.&quot;   Dan Millman,  Peaceful Warrior<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Unlimited video games for six year old","postDate":"1237979012","msgId":39080,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0OTU5My41MDI1MC5xbUB3ZWI4NjIwOS5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PDYwMjI2Ni4zMDM1MS5xbUB3ZWIzNjkwNy5tYWlsLm11ZC55YWhvby5jb20+IDxhMmM3YzgwMTA5MDMyNDEyMDB2NTBmM2RkNjhsZDM5NGVlZTQxNzg1M2FmQG1haWwuZ21haWwuY29tPiA8NDA5Mzg1LjkzODYucW1Ad2ViODYyMTAubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":39079,"nextInTopic":39082,"prevInTime":39079,"nextInTime":39081,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"Rat Park article: http://www.walrusmagazine.com/articles/2007.12-health-rat-trap/. I sent an article by Dr. Alexander about addiction which is fascinating but","messageBody":"<div id=\"ygrps-yiv-169423272\">Rat Park article: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.walrusmagazine.com/articles/2007.12-health-rat-trap/.\">http://www.walrusmagazine.com/articles/2007.12-health-rat-trap/.</a> I sent an article by Dr. Alexander about addiction which is fascinating but isn&#39;t strictly speaking about Rat Park. The Walrus Magazine article on Rat Park is a very nice review of the study and his findings. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Unlimited video games for six year old","postDate":"1237978880","msgId":39079,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwOTM4NS45Mzg2LnFtQHdlYjg2MjEwLm1haWwuaXJkLnlhaG9vLmNvbT4=","referencesHeader":"PDYwMjI2Ni4zMDM1MS5xbUB3ZWIzNjkwNy5tYWlsLm11ZC55YWhvby5jb20+IDxhMmM3YzgwMTA5MDMyNDEyMDB2NTBmM2RkNjhsZDM5NGVlZTQxNzg1M2FmQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":39077,"nextInTopic":39080,"prevInTime":39078,"nextInTime":39080,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"As the wife of a psychology professor....hehehe I can play that game too. And he isn t a psychology professor anymore, he s at a medical school now, but he was","messageBody":"<div id=\"ygrps-yiv-801015185\">As the wife of a psychology professor....hehehe I can play that game too. And he isn&#39;t a psychology professor anymore, he&#39;s at a medical school now, but he was a psychology professor for about 5 years. Unfortunately he didn&#39;t funnel his credentials and knowledge into my body thereby making me a by proxy psychology professor too. <br/>\n<br/>\nHave you read about Rat Park? (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.parl.gc.ca/37/1/parlbus/commbus/senate/com-e/ille-e/presentation-e/alexender-e.htm\">http://www.parl.gc.ca/37/1/parlbus/commbus/senate/com-e/ille-e/presentation-e/alexender-e.htm</a> or you can read a review of the work at wikipedia) It&#39;s a wonderful examination of the nature of addiction. The researcher outright questions whether or not addictions exist. Addiction doesn&#39;t exist in a vaccuum. That is people who become addicted to one thing or another do so because of things in their environment and not because of whatever it is that they are using addictively. The substance itself is not causing the addiction, the life of the person (or the rat) is what is causing the addiction. <br/>\n<br/>\nOne of the reasons why people think video games is addictive is because they are looking at them with the biases that clearly exist in the questions you list: <br/>\n<br/>\n*Ask some key questions.* Determine whether your children might have a video<br/>\ngame problem by asking these questions about their involvement with video<br/>\ngames: “Do your kids play almost every day?”, “Do your kids often play for<br/>\nlong periods (more than three to four hours at a time)?”, “Do your kids play<br/>\nfor excitement?”, “Do your kids get restless and irritable if they can’t<br/>\nplay?”, “Do your kids sacrifice social and sporting activities to play?”,<br/>\n“Do your kids play instead of doing homework?”, “Do your kids try to cut<br/>\ndown their playing but can’t?”, and “Do your kids seem to be losing interest<br/>\nin real-life activities?”.<br/>\n<br/>\nFirst these are children in school. There is a huge post-school need for relaxation and zoning out. Video games are fantastic ways of zoning out to something engaging and involving and intensely focusing. School is a huge chunk of the day, you don&#39;t see people worrying about the fact that their children are being sedentary while in school or worried about the addictive nature of sitting at a desk while listening to someone drone on like Ben Stein in Ferris Beuller&#39;s Day Off. You don&#39;t because those are the life things that may go some way to producing the addictive behaviour. <br/>\n<br/>\nSecondly the question “Do your kids seem to be losing interest in real-life activities?” is so patronizing. How aren&#39;t video games real-life activities? Simon and Linnaea play Halo 3 with friends in the U.S. in the U.K or with strangers from all around the world. There are lots of things that are very clearly about the here and now that go on while they are killing people in the coolest ways. Or building amazing mazes that have very specific codes of behaviour while you play the game. Linnaea met this Palestinian who lives in Jordan while playing on WoW a while ago. He was amazing in the way he played. Linnaea&#39;s uncle is a Palestinian who lived in Jordan for much of his childhood and so it was cool to have that connection. And it was cool to watch this player grind his way through the levels. Seriously power-levelling dedicated. <br/>\n<br/>\nReal-life activities...is e-mailing not a real life activity? Talking on the phone? Reading a book? Watching a movie? Listening to a lecture? Listening to music? Really, what on earth separates those activities from video games? How are video games such a special case that they get hacked away from real life and all those other things remain within the realm of real life?<br/>\n<br/>\nIt helps a lot to examine the biases you come to the discussion with. I used to be very afraid of the influence that television and video games could hold over my children. Turns out I was wrong, they define their relationship with television and with video games, not the other way around. And I love being a part of that aspect of their lives. It&#39;s really cool. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Kathryn Lewis-Peacock &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kmlewpea@...\">kmlewpea@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Tuesday, 24 March, 2009 7:00:02 PM<br/>\nSubject: Re: [unschoolingbasics] Re: Unlimited video games for six year old<br/>\n<br/>\nI really think this depends on the family and the kiddo.  As the wife of a<br/>\npsychologist, I just cannot help but point out that video game addiction is<br/>\na real issue (as is the sedentary lifestyle it brings.)  It can really<br/>\ndepend on the graphic nature of the games and how they are stimulating the<br/>\nbrain.  It is not a problem for every kid.  It is also not a healthy or safe<br/>\nchoice for every kid to have access to video games.<br/>\n<br/>\nWhile I really like the premise of unschooling and use many of the precepts<br/>\nin how I am raising my kiddos, I think there are times when being the<br/>\nsteward of them requires me to ask if a particular thing I use (unschooling<br/>\nor anything) is beneficial for them.  I don&#39;t think the answer as it relates<br/>\nto video games is necessarily the same for every family or that a family is<br/>\na bad unschooling family if there are boundaries enforced around this<br/>\nactivity.  I think unschooling philosophy and how these boundaries are<br/>\ngenerated as a family may be the more important question if a family<br/>\ndetermines that there is a problem brewing around gaming.<br/>\n<br/>\nA video game passion can turn into a career in graphics or a load of other<br/>\nwonderful things.  A video game passion can also be an addiction with very<br/>\nreal consequences for the brain and body.  Only the kiddo and the parents<br/>\ncan figure out which is going on.  Video game addiction is quickly getting<br/>\nrecognized as an addiction very similar in operation to a gambling<br/>\naddiction.  Again, many people can go to Vegas, blow their designated amount<br/>\nand walk away viewing it solely as entertainment.  Some cannot.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen James","from":"Karen James &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unlimited video games for six year old","postDate":"1237954301","msgId":39097,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQzMTc1M2M5MDkwMzI0MjExMXAxMjI2MzcwN21kZDc0Y2RhNzg0MDFjODQwQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDYyNzM3MC4zODU2Ni5xbUB3ZWI1MDQxMC5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PGQzMTc1M2M5MDkwMzIxMjEyMW8zM2E0YjhlOXE5YjEwMjY2Y2RmN2E3MDM2QG1haWwuZ21haWwuY29tPgkgPDYyNzM3MC4zODU2Ni5xbUB3ZWI1MDQxMC5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":39096,"nextInTopic":39101,"prevInTime":39096,"nextInTime":39098,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"You mentioned several times that something was important to your husband ... Yes. ... Yes--now I do. ... My husband is away at work all day.  This is really","messageBody":"<div id=\"ygrps-yiv-1783289224\">You mentioned several times that something was important to your husband<br/>\n<blockquote><span title=\"ireply\"> &gt; and you.  Is it possible it isn&#39;t as important *right now* to your son?<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Yes.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; You&#39;ve told him in the past that he could only play once a week.  Now he<br/>\n&gt; can play whenever he wants, but you are also trying to get him to do other<br/>\n&gt; things instead.  Do you see the push/pull conflict?<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Yes--now I do.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; For example, going to the library to get books (or even hang out) is<br/>\n&gt; something I love to do.  But to Megan (7) it isn&#39;t important.  Even if I am<br/>\n&gt; getting things she likes - she just doesn&#39;t want to hang out at the<br/>\n&gt; library.<br/>\n&gt;<br/>\n&gt; Families who don&#39;t see each other all day and have to rush around in the<br/>\n&gt; morning and at night and after school and all that goes with it...they need<br/>\n&gt; that connection time at dinner because that might be the only time everyone<br/>\n&gt; is in the house at the same time.<br/>\n&gt;<br/>\n&gt; But if you with your child all day there are so many chances to connect.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>My husband is away at work all day.  This is really our time to get together<br/>\nas a family and it has always been a fun time for us before the introduction<br/>\nof video games unlimited.  I feel sad that is changing and so does my<br/>\nhusband.   Of course, it doesn&#39;t have to be this way.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; When you play video games with your son - are you enthusiastic?  As<br/>\n&gt; enthusiastic as he is?  Or is your attitude &quot;sure, I&#39;m playing this game,<br/>\n&gt; but we should be doing something else instead?&quot;  Kids can pick up on that.<br/>\n&gt; I&#39;m not very good at video games, but I love to support Megan.  And, lucky<br/>\n&gt; for us, the things she has trouble with are things I am actually pretty good<br/>\n&gt; at.  So we tag-team games (the mini games in Bolt were easy for me and<br/>\n&gt; impossible for Megan, for example).  We talk through the puzzles and figure<br/>\n&gt; them out together.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>We are really enthusiastic.  I think it would be unkind for us to be not<br/>\npresent with him.  I do realize that.  As I mentioned on another post we all<br/>\nlike video games.  We all play together most of the time.  The games we have<br/>\nare a lot of fun.  We are not high five kind of people.  But we laugh and<br/>\ncheer and that kind of thing.  I don&#39;t think we are being insincere at all<br/>\nin this regard.  Perhaps we could be more present when he is<br/>\nfrustrated--more encouraging.  We tend to suggest he take a break and come<br/>\nback to it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Megan played Ratatouille a lot last year.  She was six and got frustrated<br/>\n&gt; often.  Sometimes she&#39;d take a break and try again.   Sometimes she decided<br/>\n&gt; figuring it out was worth being frustrated (and then lots of whooping and<br/>\n&gt; high fives when she figured it out!).  I hung out with her the whole time<br/>\n&gt; she played.  She really needed me to share her joy.<br/>\n&gt;<br/>\n&gt; What else is going on in your life?  If someone thinks video games are bad<br/>\n&gt; (or sugar or junk food) then they might look to that to explain behavior,<br/>\n&gt; even if there are other factors (does cake at a birthday party kids &quot;hyper&quot;<br/>\n&gt; or are they just having fun?).<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Our life seems good to me.  My husband and I are best friends.  He does work<br/>\na lot, but he always has, so that hasn&#39;t changed.  It isn&#39;t a source of any<br/>\ntension that I am aware of, other than we do like having dinner<br/>\ntogether--but I don&#39;t think it is tension as much as a desire or perceived<br/>\nneed on our part.  The only real change in our life is that we started the<br/>\nunlimited games.  We are all well, health-wise.  My husband likes his job.<br/>\nI like painting and I love being able to be with Ethan during this time in<br/>\nhis life.  The winter was a bit long.  Not a lot of sunlight??  Ethan is<br/>\ndoing fewer activities and getting less exercise because of his game<br/>\nplaying.  I don&#39;t know what else to add.  Maybe we need more of a social<br/>\ngroup?  Doug and I are quiet people.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Gwen<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; --- On Sat, 3/21/09, Karen James &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:semajrak@...\">semajrak@...</a>&lt;semajrak%40gmail.com&gt;&gt;<br/>\n&gt; wrote:<br/>\n&gt; I could list many more examples, but this seems long enough. Mostly we are<br/>\n&gt; concerned about the lack of interest in other things besides video games<br/>\n&gt; and<br/>\n&gt; his change in moods. I am wondering if this is something others have seen.<br/>\n&gt; Are we starting too young with video games? Is this a phase? Should I be<br/>\n&gt; concerned?<br/>\n&gt;<br/>\n&gt; Thanks again for your time and thoughts. I look forward to your replies.<br/>\n&gt;<br/>\n&gt; Karen<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen James","from":"Karen James &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Unlimited video games for six year old","postDate":"1237951214","msgId":39073,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQzMTc1M2M5MDkwMzI0MjAyMHc2MjNlYTYxY243YTI0N2I0NzlkYWJiNDg4QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdxYnBxZStydWo2QGVHcm91cHMuY29tPg==","referencesHeader":"PGQzMTc1M2M5MDkwMzIxMjEyMW8zM2E0YjhlOXE5YjEwMjY2Y2RmN2E3MDM2QG1haWwuZ21haWwuY29tPgkgPGdxYnBxZStydWo2QGVHcm91cHMuY29tPg=="},"prevInTopic":39071,"nextInTopic":39074,"prevInTime":39072,"nextInTime":39074,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"Thanks Caren, That didn t seem shmoopy-woopy to me. I appreciate your insight.  I feel like I am being supportive, but I am afraid of this all-consumng","messageBody":"<div id=\"ygrps-yiv-1567546508\">Thanks Caren,<br/>\n<br/>\nThat didn&#39;t seem shmoopy-woopy to me.<br/>\n<br/>\nI appreciate your insight.  I feel like I am being supportive, but I am<br/>\nafraid of this all-consumng influence over him.  Perhaps he sense this, and<br/>\nit is making him anxious and therefore cranky and possessive about what he<br/>\nis doing.  I am not sure.  I think I just need to observe a little longer,<br/>\nmyself as well as him, and keep listening to everyone&#39;s insight.<br/>\n<br/>\nThanks so much again.<br/>\n<br/>\nKaren.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, Mar 24, 2009 at 7:19 PM, carenkh &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:carenkh@...\">carenkh@...</a>&gt; wrote:<br/>\n<br/>\n&gt;   I&#39;ve been trying to think of how to write this without going all<br/>\n&gt; shmoopy-woopy, as my friend Laura Endres puts it, but I haven&#39;t been able<br/>\n&gt; to, so I&#39;ll just delve in and be my shmoopy-woopy self.<br/>\n&gt;<br/>\n&gt; I have found if I harbor the *least* amount of resistance toward something,<br/>\n&gt; even if my words and actions say otherwise, my kids - especially my youngest<br/>\n&gt; - pick up on that and push against it. Am I thinking, &quot;Hmm... He sure has<br/>\n&gt; been eating a lot of sugar lately&quot; as I get his cookies? He&#39;ll ask for<br/>\n&gt; double the amount.<br/>\n&gt;<br/>\n&gt; It has to do with the nature of my son, and the energy that I&#39;m offering.<br/>\n&gt; You don&#39;t have to believe this; this is what I&#39;ve found for me.<br/>\n&gt;<br/>\n&gt; If, however, I&#39;ve done the work I need to do to make peace with What Is, if<br/>\n&gt; I&#39;m truly accepting of his choices, if I&#39;ve worked through the discomfort<br/>\n&gt; and really embrace what he&#39;s doing, there&#39;s nothing there for him to push up<br/>\n&gt; against, nothing to be contrary about.<br/>\n&gt;<br/>\n&gt; The problem isn&#39;t with his gaming/eating/picking his nose - the problem is<br/>\n&gt; that *I&#39;m* perceiving it&#39;s a problem.<br/>\n&gt;<br/>\n&gt; I don&#39;t know if this is making sense or not - I&#39;ve lived it for 10 years,<br/>\n&gt; and it&#39;s hard to put the learning of 10 years into a few paragraphs. Well,<br/>\n&gt; the learning of 43 years, really...<br/>\n&gt;<br/>\n&gt; In recognizing that my job with my youngest was to accept him *exactly* as<br/>\n&gt; he is, contrariness and all, I found my own contrary self. Not allowed to<br/>\n&gt; express that as a child, I found unhealthy outlets to do so: &#39;You can&#39;t<br/>\n&gt; control me! I&#39;m going to do these drugs to prove that to you!&#39;<br/>\n&gt;<br/>\n&gt; Any perceived control on my part elicits a big negative reaction from him,<br/>\n&gt; it&#39;s been that way since he was teeny-tiny. He&#39;s been a great teacher for<br/>\n&gt; Acceptance, and seeing Joy in their choices, even if they&#39;re different than<br/>\n&gt; I initially thought they &quot;should&quot; be. I long ago dropped the shoulds - until<br/>\n&gt; I catch myself NOT doing so, anyway - and I work on completely being in this<br/>\n&gt; moment with them, Super Smash Bros and all.<br/>\n&gt;<br/>\n&gt; If I&#39;m energetically not in acceptance, he senses it! And lets me know: You<br/>\n&gt; can&#39;t control me! And he&#39;s absolutely right, I can&#39;t. If I chose to, I could<br/>\n&gt; pretend like I was controlling him and his gametime, but once he was an<br/>\n&gt; adult... he&#39;d show me! And I&#39;d rather work on accepting him and his choices<br/>\n&gt; now.<br/>\n&gt;<br/>\n&gt; peace,<br/>\n&gt; Caren<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen James","from":"Karen James &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] video gaming is a phase? or a passion.","postDate":"1237949521","msgId":39071,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQzMTc1M2M5MDkwMzI0MTk1MmliNzgzMWJrMzFmMDZjYWMwYWJhY2U0YUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDM2ODU1MC43MjgucW1Ad2ViNTExMDIubWFpbC5yZTIueWFob28uY29tPg==","referencesHeader":"PGdxYW1iaStrc2djQGVHcm91cHMuY29tPgkgPDM2ODU1MC43MjgucW1Ad2ViNTExMDIubWFpbC5yZTIueWFob28uY29tPg=="},"prevInTopic":39066,"nextInTopic":39073,"prevInTime":39070,"nextInTime":39072,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"I think I should clarify: I was wondering if the moodiness and lack of interest in other activities is a phase, not video game playing.  I was wondering if we","messageBody":"<div id=\"ygrps-yiv-1238031801\">I think I should clarify:<br/>\n<br/>\nI was wondering if the moodiness and lack of interest in other activities is<br/>\na phase, not video game playing.  I was wondering if we started too soon<br/>\n(introducing unlimited play) and if we should allow more room for him to<br/>\ndiscover himself first, which I am sure we could still gently do.<br/>\n<br/>\nMy husband works in computer science at Cornell and is motivating his<br/>\nstudents to get excited about projects by making them into video games where<br/>\nthey can compete with each other.  If my son wanted to work in the video<br/>\ngame industry, my husband said he would work for him!<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, Mar 24, 2009 at 11:54 AM, Kelli Traaseth &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kellitraas@...\">kellitraas@...</a>&gt;wrote:<br/>\n<br/>\n&gt;   A phase?  Video game playing.  It could be.  Or not.  And hopefully<br/>\n&gt; that&#39;s ok.<br/>\n&gt;<br/>\n&gt; Maybe it&#39;s a real passion.  Would it be ok if your child was interested in<br/>\n&gt; science?  Would you be worried if your child wanted to learn all there is to<br/>\n&gt; know about science?  You know how many facets there are to know in regards<br/>\n&gt; to science?<br/>\n&gt;<br/>\n&gt; There are a lot of facets to video gaming.  Really.<br/>\n&gt;<br/>\n&gt; Is it ok if your child ends up in the video game industry?  Why wouldn&#39;t it<br/>\n&gt; be ok if they ended up creating games or testing games?   How about the<br/>\n&gt; marketing of games?  Or how about the research of the science behind the<br/>\n&gt; games?<br/>\n&gt;<br/>\n&gt; I think these are really important questions to ask yourself.<br/>\n&gt;<br/>\n&gt; If you, as a parent, are constantly questioning your child in what they are<br/>\n&gt; doing there is going to be a lot of frustration.  No matter what they are<br/>\n&gt; doing.  Video games can be frustrating, they can be challenging and that&#39;s a<br/>\n&gt; big reason why people like them,  they make you think!  &lt;g&gt;   One thing that<br/>\n&gt; can help with your child&#39;s frustration is being there for them and helping<br/>\n&gt; them with the game.  Not sitting and waiting for the moment that they go on<br/>\n&gt; to something else, but enjoying the moment where they are while playing that<br/>\n&gt; game.<br/>\n&gt;<br/>\n&gt; I know this may sound corny to some... but,  breathe and choose joy, it<br/>\n&gt; really is going to be ok :)  Actually better than ok!  It&#39;s great!<br/>\n&gt;<br/>\n&gt; Kelli~<br/>\n&gt;   <a rel=\"nofollow\" target=\"_blank\" href=\"http://ourjoyfullife.blogspot.com/\">http://ourjoyfullife.blogspot.com/</a><br/>\n&gt;<br/>\n&gt; &quot;There are no ordinary moments.&quot;  Dan Millman,  Peaceful Warrior<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":330912513,"authorName":"canamich","from":"&quot;canamich&quot; &lt;canamich@...&gt;","profile":"canamich","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unlimited video games for six year old","postDate":"1237945851","msgId":39074,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdxYzJsciszcnY0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMxODE3MS42NjkzOC5xbUB3ZWI4NjIwMy5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":39073,"nextInTopic":39077,"prevInTime":39073,"nextInTime":39075,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"I am relatively new to unschooling and find this thread interesting.  I have an 8 year old son and a 12 year old daughter.  They love video games, especially","messageBody":"<div id=\"ygrps-yiv-1784491448\">I am relatively new to unschooling and find this thread interesting.  I have an 8 year old son and a 12 year old daughter.  They love video games, especially on the Wii.  One game, Animal Crossing, I am sure has been played by someone almost everyday this year.  My husband and myself included.  <br/>\n<br/>\nI began thinking about how we play as a family.  We are discussing the games over meals, we are excited to show each other every new discovery, and in some games we do nice things for each other to find when they play. <br/>\n<br/>\nIn Animal Crossing, which is a community, my son was the bad neighbor.   He took things he knew other people really wanted and overcharged them, dug up mine and his sisters flowers and planted pitfalls for us all to fall into.  He thought this was great fun.  After a while he began to notice how the three of us would talk to each other about the nice things we did for the community.  He slowly began surprising us by planting flowers for his sister and leaving an item in the store he knew someone else would like.  He of course was thanked and enjoyed the positive feedback, not that we had been negative before.  Now he is the best kind of neighbor and enjoys making others happy.<br/>\n<br/>\nMy daughter was having difficulty with a task in a game today and my son offered to look it up on line for her.  They had an animated discussion about various strategies and solved the problem and were so excited.  <br/>\n<br/>\nWe do not have limits, but clearly video games are an integral part of all of our lives.  Maybe that is why we all enjoy it and each other so much.  We all play and respect that each person wants a turn.<br/>\n<br/>\nGood Luck</div>","specialLinks":[]},{"userId":151505017,"authorName":"carenkh","from":"&quot;carenkh&quot; &lt;carenkh@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unlimited video games for six year old","postDate":"1237936782","msgId":39064,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdxYnBxZStydWo2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGQzMTc1M2M5MDkwMzIxMjEyMW8zM2E0YjhlOXE5YjEwMjY2Y2RmN2E3MDM2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":39058,"nextInTopic":39065,"prevInTime":39063,"nextInTime":39065,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"I ve been trying to think of how to write this without going all shmoopy-woopy, as my friend Laura Endres puts it, but I haven t been able to, so I ll just","messageBody":"<div id=\"ygrps-yiv-1209826903\">I&#39;ve been trying to think of how to write this without going all shmoopy-woopy, as my friend Laura Endres puts it, but I haven&#39;t been able to, so I&#39;ll just delve in and be my shmoopy-woopy self.<br/>\n<br/>\nI have found if I harbor the *least* amount of resistance toward something, even if my words and actions say otherwise, my kids - especially my youngest - pick up on that and push against it. Am I thinking, &quot;Hmm... He sure has been eating a lot of sugar lately&quot; as I get his cookies? He&#39;ll ask for double the amount.<br/>\n<br/>\nIt has to do with the nature of my son, and the energy that I&#39;m offering. You don&#39;t have to believe this; this is what I&#39;ve found for me. <br/>\n<br/>\nIf, however, I&#39;ve done the work I need to do to make peace with What Is, if I&#39;m truly accepting of his choices, if I&#39;ve worked through the discomfort and really embrace what he&#39;s doing, there&#39;s nothing there for him to push up against, nothing to be contrary about.<br/>\n<br/>\nThe problem isn&#39;t with his gaming/eating/picking his nose - the problem is that *I&#39;m* perceiving it&#39;s a problem.<br/>\n<br/>\nI don&#39;t know if this is making sense or not - I&#39;ve lived it for 10 years, and it&#39;s hard to put the learning of 10 years into a few paragraphs. Well, the learning of 43 years, really...<br/>\n<br/>\nIn recognizing that my job with my youngest was to accept him *exactly* as he is, contrariness and all, I found my own contrary self. Not allowed to express that as a child, I found unhealthy outlets to do so: &#39;You can&#39;t control me! I&#39;m going to do these drugs to prove that to you!&#39;<br/>\n<br/>\nAny perceived control on my part elicits a big negative reaction from him, it&#39;s been that way since he was teeny-tiny. He&#39;s been a great teacher for Acceptance, and seeing Joy in their choices, even if they&#39;re different than I initially thought they &quot;should&quot; be. I long ago dropped the shoulds - until I catch myself NOT doing so, anyway - and I work on completely being in this moment with them, Super Smash Bros and all.<br/>\n<br/>\nIf I&#39;m energetically not in acceptance, he senses it! And lets me know: You can&#39;t control me! And he&#39;s absolutely right, I can&#39;t. If I chose to, I could pretend like I was controlling him and his gametime, but once he was an adult... he&#39;d show me! And I&#39;d rather work on accepting him and his choices now.<br/>\n<br/>\npeace,<br/>\nCaren</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Unlimited video games for six year old","postDate":"1237930921","msgId":39058,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxODE3MS42NjkzOC5xbUB3ZWI4NjIwMy5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":39055,"nextInTopic":39064,"prevInTime":39057,"nextInTime":39059,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"My first response to this is that it sounds like he isn t being taken care of while he s playing games. It helps a lot to offer food to a child while they are","messageBody":"<div id=\"ygrps-yiv-516388690\">My first response to this is that it sounds like he isn&#39;t being taken care of while he&#39;s playing games. It helps a lot to offer food to a child while they are doing something that takes a lot of energy and video games require a huge amount of energy. I just linked here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/eating/monkeyplatter\">http://sandradodd.com/eating/monkeyplatter</a> but it can be re-recommended. When Simon or Linnaea come home from somene else&#39;s they are hungry and thirsty and want for food and drink. It doesn&#39;t matter what they were doing when they were out. So feed him, care for him, don&#39;t blame the video games for his behaviour first, look for other causes. I&#39;m guessing that throwing the video system out the window would put a huge wedge in your relationship with him and it would help you much more to find other things that can help alleviate some of his stress. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I guess some kids can handle the unlimited play of video games but I<br/>\n </span></blockquote>don;t think all can be left to unlimited use.  <br/>\n<br/>\nNo one here is recommending leaving a child to unlimited use of video games. I don&#39;t leave Simon and Linnaea. I cuddle up with them while they play, I play the drums on Rock Band as an alternate, I level World of Warcraft characters, I play Da Blob through with lots of cheering as I paint the final building, I look up walkthroughs or how to digevolve a digimon on Digimon Dawn, or how to beat a boss, I navigate the galaxy in Mario Galaxy, I watch in amazement as Simon figures out new was of increasing the momentum of a character on Portal (what a beautiful game that is!), I read reviews and download trials and find information, and it goes on, the list of ways that I&#39;m not leaving them to unlimited use of video games. I am right there with them as they play. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I certainly see how kids<br/>\n </span></blockquote>have lost imagination and the joy of playing outdoors, like before we<br/>\nhad video games. <br/>\n<br/>\nFor Linnaea&#39;s birthday she wanted to go on a long bike ride at some trails near us. 5 miles or so. Great joy. She plays video games. No joy lost there. <br/>\n<br/>\nHave you played video games? Have you played Fable and watched with amazement as a character develops based on the player&#39;s actions. You can be good or evil or somewhere in between in that game. Have you played Katamari Damacy? Have you explored the extremely imaginative worlds that your son is enjoying? Nothing I experienced as a child compares with the imagination that runs riot in these games. Simon and Linnaea are not hindered by their immersion in the amazingly creative worlds that these programmers make part of our lives.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I call video games &quot;the babysitter of our kids<br/>\n </span></blockquote>generation&quot;.  <br/>\n<br/>\nI certainly don&#39;t see video games as babysitting Simon or Linnaea. They entertain them, engage them, inspire them, bore them sometimes, frustrate them, challenge them, and on and on. They aren&#39;t babysat by video games<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Each person knows &gt;their kids<br/>\n </span></blockquote>best, mine cannot handle unlimited use of video games.<br/>\n<br/>\nThere is a German man who was just tried for kidnapping his daughter and raping her. He had 7 children with her and murdered one. For less extreme cases of when parent&#39;s don&#39;t know best listen to this week&#39;s podcast of This American Life or watch About a Boy and think about how the mother didn&#39;t know what her son needed.  I do not think the argument that every person knows their kids best is a particularly valueable statement to hide behind. <br/>\n<br/>\nMust go, Linnaea wants the computer. <br/>\n<br/>\nSchuyelr<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: sugozzi2000 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sugozzi2000@...\">sugozzi2000@...</a>&gt;<br/>\n<br/>\n<br/>\nHi, I find myself in the same predicament.  I have a 9 yr old son who never saw a video game til he was about 6. We never had one.   Most of the time he wouldn;t even care to play video games.  He would rather be outside and exploring or reading or imaginary play. But as he got older his friend didn&#39;t play outside but were glued to the video games.  So wanting to be with friends he followed them.  He now gets very moody and very upset when he plays.  I noticed he is angry alot more and frustrated.  He won;t stop to come have dinner or if we have to leave. I walk out the door and start the car and he comes running all upset at me.  I swear I am ready to throw the thing out the window.  His personality has changed so much that it is upsetting.  He is angry all the time.  He comes home from friends houses after playing video games all day and he is furious.  Answers back and slams doors and throws himself on the couch.  <br/>\nHe doesn;t care to participate in anything anymore and when we go somewhere he says he is bored and starts complaining of stomach pain and headaches to the point he practically moans in pain.  He used to be able to entertain himself no matter where we went.  He still had some imagination left.<br/>\nI guess some kids can handle the unlimited play of video games but I don;t think all can be left to unlimited use.  I certainly see how kids have lost imagination and the joy of playing outdoors, like before we had video games.  I call video games &quot;the babysitter of our kids generation&quot;.  Anyhow, i am trying to figure out how to get my son back from being sucked into the world of video games.  When I don&#39;t let him play my happy imaginative son returns!    Each person knows their kids best, mine cannot handle unlimited use of video games.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unlimited video games for six year old","postDate":"1237929015","msgId":39055,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1NTEzNC42Njc1LnFtQHdlYjg2MjA5Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":39052,"nextInTopic":39058,"prevInTime":39054,"nextInTime":39056,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"How long is recently? It makes a big difference. Up until recently you ve set up a false economy when it comes to video games. You ve made them a treat, a rare","messageBody":"<div id=\"ygrps-yiv-580034118\">How long is recently? It makes a big difference. Up until recently you&#39;ve set up a false economy when it comes to video games. You&#39;ve made them a treat, a rare good that has a special day, like a weekend day. Only one day a week could he sit and really enjoy the games, and he was asking, regularly, to play. Think of it like a diet where one day a week you could eat the one thing you&#39;d denied yourself all week long and as much of it as you wanted. Suddenly that food would taste of dreams and delayed gratification as much as it would taste of itself, maybe more. You have to give it time for your son to stop having video games be colored by the false economy you created. It takes time to get over having your most precious desire, most favoritest thing put off for the one day a week when you are allowed to enjoy it. <br/>\n<br/>\nDon&#39;t just sit and wait, and don&#39;t ever expect him to stop enjoying video games. They may be the most favoritest thing for all of his life. Don&#39;t wait for him to come dancing out of his video game life and see it as a dim and dark world compared to sitting at the dinner table and sharing a conversation with his parents. Join him. Sit and play Zoombinis with him. Help them get to their new homeland. Find other games that he might enjoy and share those with him. If you have two computers get Runescape accounts and play together. Spend time acquainting yourself with his love. Just as with any other interest, find out why it is so fascinating. Find ways to enjoy it with him. <br/>\n<br/>\nAlso make sure that you are bringing him food and drink while he plays. One of the things that makes a huge difference to how well Simon and Linnaea move between activities is to make sure they aren&#39;t hungry or thirsty when they stop doing one thing or another. Moodiness can happen if you are hungry. I can get horribly grouchy if I get hungry without noticing. Bring easy to eat, relatively tidy food, finger sandwiches, protein rich foods, there are some great ideas here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/eating/monkeyplatter.\">http://sandradodd.com/eating/monkeyplatter.</a> It makes a huge difference. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Karen James &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:semajrak@...\">semajrak@...</a>&gt;<br/>\n<br/>\n<br/>\nMy question is about unlimited video games.  My son is six.  He turned six<br/>\nin November.  Up until fairly recently we had what we called &quot;VG day&quot; which<br/>\nwas basically unlimited video game play all day for one day per week.  He<br/>\nlooked forward to that and it seemed to work out well for our family.  Of<br/>\ncourse, he asked many times during the course of the week to play, but we<br/>\nwould say he could play on our VG day.  After following a few discussions<br/>\nposted here, we decided to allow him to play unlimited anytime.  What we are<br/>\nnoticing is that he is getting very moody, and I am wondering if he is too<br/>\nyoung for this kind of play.  He was always a really happy guy.  He had<br/>\nabundant energy, tons of ideas for play and stories, he loved exploring<br/>\noutdoors--generally very enthusiastic about life.  Lately, he is seeming<br/>\nkind of blue.  He talks all the time about video games.  His imaginary games<br/>\nrevolve around video games.  He doesn&#39;t want to tell stories very much any<br/>\nmore.  He is not interested in going outside.  And, he is very moody.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":12252351,"authorName":"Gwen","from":"Gwen &lt;willow_selene@...&gt;","profile":"willow_selene","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unlimited video games for six year old","postDate":"1237926615","msgId":39065,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyNzM3MC4zODU2Ni5xbUB3ZWI1MDQxMC5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGQzMTc1M2M5MDkwMzIxMjEyMW8zM2E0YjhlOXE5YjEwMjY2Y2RmN2E3MDM2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":39064,"nextInTopic":39066,"prevInTime":39064,"nextInTime":39066,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"You mentioned several times that something was important to your husband and you.  Is it possible it isn t as important *right now* to your son? You ve told","messageBody":"<div id=\"ygrps-yiv-1579891890\">You mentioned several times that something was important to your husband and you.  Is it possible it isn&#39;t as important *right now* to your son?<br/>\n<br/>\nYou&#39;ve told him in the past that he could only play once a week.  Now he can play whenever he wants, but you are also trying to get him to do other things instead.  Do you see the push/pull conflict?<br/>\n<br/>\nFor example, going to the library to get books (or even hang out) is something I love to do.  But to Megan (7) it isn&#39;t important.  Even if I am getting things she likes - she just doesn&#39;t want to hang out at the library.  <br/>\n<br/>\nFamilies who don&#39;t see each other all day and have to rush around in the morning and at night and after school and all that goes with it...they need that connection time at dinner because that might be the only time everyone is in the house at the same time.<br/>\n<br/>\nBut if you with your child all day there are so many chances to connect.<br/>\n<br/>\nWhen you play video games with your son - are you enthusiastic?  As enthusiastic as he is?  Or is your attitude &quot;sure, I&#39;m playing this game, but we should be doing something else instead?&quot;  Kids can pick up on that.  I&#39;m not very good at video games, but I love to support Megan.  And, lucky for us, the things she has trouble with are things I am actually pretty good at.  So we tag-team games (the mini games in Bolt were easy for me and impossible for Megan, for example).  We talk through the puzzles and figure them out together. <br/>\n<br/>\nMegan played Ratatouille a lot last year.  She was six and got frustrated often.  Sometimes she&#39;d take a break and try again.   Sometimes she decided figuring it out was worth being frustrated (and then lots of whooping and high fives when she figured it out!).  I hung out with her the whole time she played.  She really needed me to share her joy.<br/>\n<br/>\nWhat else is going on in your life?  If someone thinks video games are bad (or sugar or junk food) then they might look to that to explain behavior, even if there are other factors (does cake at a birthday party kids &quot;hyper&quot; or are they just having fun?).<br/>\n<br/>\nGwen<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Sat, 3/21/09, Karen James &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:semajrak@...\">semajrak@...</a>&gt; wrote:<br/>\nI could list many more examples, but this seems long enough.  Mostly we are<br/>\nconcerned about the lack of interest in other things besides video games and<br/>\nhis change in moods. I am wondering if this is something others have seen.<br/>\nAre we starting too young with video games?  Is this a phase?  Should I be<br/>\nconcerned?<br/>\n<br/>\nThanks again for your time and thoughts.  I look forward to your replies.<br/>\n<br/>\nKaren<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":117369878,"authorName":"Kelli Traaseth","from":"Kelli Traaseth &lt;kellitraas@...&gt;","profile":"kellitraas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Unlimited video games for six year old","postDate":"1237921351","msgId":39052,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgxNDA4NC44MTI2Ny5xbUB3ZWI1MTEwNy5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGdxYWRlaitxM29mQGVHcm91cHMuY29tPg=="},"prevInTopic":39049,"nextInTopic":39055,"prevInTime":39051,"nextInTime":39053,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"***I call video games the babysitter of our kids generation .*** If it looks like that in your home, and you ve only seen it that way, well then I know why","messageBody":"<div id=\"ygrps-yiv-1217691163\">***I call video games &quot;the babysitter of our kids generation&quot;.***<br/>\n<br/>\nIf it looks like that in your home, and you&#39;ve only seen it that way, well then I know why your son would be frustrated.  It doesn&#39;t have to be that way.  Sometimes my kids will play on their own, but other times we play together.  Even 1 player games can be enjoyed together.<br/>\n<br/>\nNot every kid will enjoy video games as much as others, obviously, and if a child is choosing to play just because others are playing then maybe a parent needs to brainstorm with that kid and help them think of ways to do other stuff with friends.  <br/>\n<br/>\n***I guess some kids can handle the unlimited play of video games but I don;t think all can be left to unlimited use. ***<br/>\n<br/>\nI think kids can handle video game use if it&#39;s looked at as just another activity and also if there are also other things going on too so they have lots of choices.  Not all kids want to do lots of different things but having them available will help if they decide they want to switch it up.<br/>\n<br/>\nAlso look at that statement  &quot;left to unlimited use&quot;..   don&#39;t leave them.  Participate in it, have fun with it,  embrace what your kids like to do and you&#39;ll be wowed by the results!<br/>\n<br/>\n***Anyhow, i am trying to figure out how to get my son back from being sucked into the world of video games. ***<br/>\n<br/>\nWhy not go there with him?  Why not be part of his world.  It really isn&#39;t that awful place that so many are depicting.  I bet you if you played with him and made his world bigger instead of smaller you&#39;d both end up having a great time and end up doing other things too.  I&#39;ve seen it happen, really, I&#39;ve lived it.  We didn&#39;t always embrace these freedoms.<br/>\n<br/>\n **I certainly see how kids have lost imagination and the joy of playing outdoors, like before we had video games**<br/>\n<br/>\nI&#39;ve seen how it has enhanced life, it actually brings out the imagination.  I remember when Alec was smaller, he and his friends would run around outside pretending to be different characters from games.  My daughters draw and create things that will include themes from video games. <br/>\n<br/>\n   ***Each person knows their kids best, mine cannot handle unlimited use of video games.***<br/>\n<br/>\nI wonder if they&#39;ve had enough time with unlimited use for you to actually see the benefits of video gaming.  When something is a scarce commodity it&#39;s held on to very tightly, even obsessively.  If you feel like something is going to be taken away you aren&#39;t likely to give it up or want to walk away from it.<br/>\n<br/>\nTV watching, video game playing, computer use.. none of them have to be looked at with such fear and worry.  If you can see them as just another activity it will really open up a wonderfully joyful life.  <br/>\n<br/>\n<br/>\nKelli~<br/>\n     <a rel=\"nofollow\" target=\"_blank\" href=\"http://ourjoyfullife.blogspot.com/%c2%a0\">http://ourjoyfullife.blogspot.com/%c2%a0</a> <br/>\n<br/>\n&quot;There are no ordinary moments.&quot;   Dan Millman,  Peaceful Warrior<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":235865494,"authorName":"Kathryn Lewis-Peacock","from":"Kathryn Lewis-Peacock &lt;kmlewpea@...&gt;","profile":"burdiegirltoo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Unlimited video games for six year old","postDate":"1237921202","msgId":39077,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGEyYzdjODAxMDkwMzI0MTIwMHY1MGYzZGQ2OGxkMzk0ZWVlNDE3ODUzYWZAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDYwMjI2Ni4zMDM1MS5xbUB3ZWIzNjkwNy5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDYwMjI2Ni4zMDM1MS5xbUB3ZWIzNjkwNy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":39074,"nextInTopic":39079,"prevInTime":39076,"nextInTime":39078,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"I really think this depends on the family and the kiddo.  As the wife of a psychologist, I just cannot help but point out that video game addiction is a real","messageBody":"<div id=\"ygrps-yiv-326583204\">I really think this depends on the family and the kiddo.  As the wife of a<br/>\npsychologist, I just cannot help but point out that video game addiction is<br/>\na real issue (as is the sedentary lifestyle it brings.)  It can really<br/>\ndepend on the graphic nature of the games and how they are stimulating the<br/>\nbrain.  It is not a problem for every kid.  It is also not a healthy or safe<br/>\nchoice for every kid to have access to video games.<br/>\n<br/>\nWhile I really like the premise of unschooling and use many of the precepts<br/>\nin how I am raising my kiddos, I think there are times when being the<br/>\nsteward of them requires me to ask if a particular thing I use (unschooling<br/>\nor anything) is beneficial for them.  I don&#39;t think the answer as it relates<br/>\nto video games is necessarily the same for every family or that a family is<br/>\na bad unschooling family if there are boundaries enforced around this<br/>\nactivity.  I think unschooling philosophy and how these boundaries are<br/>\ngenerated as a family may be the more important question if a family<br/>\ndetermines that there is a problem brewing around gaming.<br/>\n<br/>\nA video game passion can turn into a career in graphics or a load of other<br/>\nwonderful things.  A video game passion can also be an addiction with very<br/>\nreal consequences for the brain and body.  Only the kiddo and the parents<br/>\ncan figure out which is going on.  Video game addiction is quickly getting<br/>\nrecognized as an addiction very similar in operation to a gambling<br/>\naddiction.  Again, many people can go to Vegas, blow their designated amount<br/>\nand walk away viewing it solely as entertainment.  Some cannot.<br/>\n<br/>\nHere are some questions you can ask around gaming related to addiction.  Two<br/>\ndifferent sources - not perfect sources, but a decent set of addiction<br/>\nrelated questions that I could find fast.  The first article is kid related,<br/>\nbut written from a rather authoritarian type mentality.  The second article<br/>\nis geared towards adults and looks mostly at functionality.  Questions<br/>\nposted.  Sources cited before questions. peace,  kathryn<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.crosswalk.com/parenting/teens/11581852/page1/\">http://www.crosswalk.com/parenting/teens/11581852/page1/</a><br/>\n<br/>\n*Ask some key questions.* Determine whether your children might have a video<br/>\ngame problem by asking these questions about their involvement with video<br/>\ngames: �Do your kids play almost every day?�, �Do your kids often play for<br/>\nlong periods (more than three to four hours at a time)?�, �Do your kids play<br/>\nfor excitement?�, �Do your kids get restless and irritable if they can�t<br/>\nplay?�, �Do your kids sacrifice social and sporting activities to play?�,<br/>\n�Do your kids play instead of doing homework?�, �Do your kids try to cut<br/>\ndown their playing but can�t?�, and �Do your kids seem to be losing interest<br/>\nin real-life activities?�.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://addiction.lovetoknow.com/wiki/Video_Game_Addiction\">http://addiction.lovetoknow.com/wiki/Video_Game_Addiction</a><br/>\n<br/>\nVideo game addiction is not a physical addiction like alcoholism. However,<br/>\nit shares many similarities with compulsive gambling. Many video game<br/>\naddicts spend 10 or more hours playing games each day. They often structure<br/>\ntheir lives around their favorite games and become defensive when confronted<br/>\nabout their behavior.<br/>\n<br/>\nIf you think you may be a video game addict, ask yourself the following<br/>\nquestions:<br/>\n<br/>\n   - Do you neglect relationships with your friends and family to spend more<br/>\n   time playing video games?<br/>\n   - Do you struggle to keep up with your schoolwork and/or professional<br/>\n   responsibilities? * Have you ever taken a �sick day� to play your favorite<br/>\n   game?<br/>\n   - Do you lie to others about your video game use? Have you ever been<br/>\n   criticized by someone close to you for spending too much time playing video<br/>\n   games?<br/>\n   - When you�re not playing video games, do you feel angry or depressed? Do<br/>\n   you spend your time wishing you could be playing your favorite game?<br/>\n   - Do you get so engrossed in video games that you neglect to eat, sleep,<br/>\n   or shower?<br/>\n   - Do you suffer from backaches, dry eyes, or headaches after playing<br/>\n   video games? Have you been diagnosed with carpal tunnel syndrome?<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nOn Tue, Mar 24, 2009 at 10:41 AM, The Coffee Goddess &lt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hoffmanwilson@...\">hoffmanwilson@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   &gt;&gt;So wanting to be with friends he followed them.  He now gets very<br/>\n&gt; moody<br/>\n&gt; and very upset when he plays.  I noticed he is angry alot more and<br/>\n&gt; frustrated.  He won;t stop to come have dinner or if we have to leave.<br/>\n&gt; I walk out the door and start the car and he comes running all upset at<br/>\n&gt; me.  I swear I am ready to throw the thing out the window.  His<br/>\n&gt; personality has changed so much that it is upsetting.  He is angry all<br/>\n&gt; the time.  He comes home from friends houses after playing video games<br/>\n&gt; all day and he is furious.  Answers back and slams doors and throws<br/>\n&gt; himself on the couch.<br/>\n&gt; He doesn;t care to participate in anything<br/>\n&gt; anymore and when we go somewhere he says he is bored and starts<br/>\n&gt; complaining of stomach pain and headaches to the point he practically<br/>\n&gt; moans in pain.  He used to be able to entertain himself no matter where<br/>\n&gt; we went.  He still had some imagination left.&gt;&gt;<br/>\n&gt;<br/>\n&gt; Just a comment--If my loved ones treated my interests with disdain, always<br/>\n&gt; examining how much better I was before I took them up, blaming my taking<br/>\n&gt; them up on trying to fit in with friends, and having their attitude towards<br/>\n&gt; me be &quot;I am ready to throw your (books, knitting, NPR, whatever) out the<br/>\n&gt; window&quot;--I would be angry and moody, too.<br/>\n&gt;<br/>\n&gt; Just something to think about...<br/>\n&gt;<br/>\n&gt; Dana<br/>\n&gt; rabid unschooling mama (frothing at the mouth) to Lauren, 16, Otto, 11, and<br/>\n&gt; Miranda Grace, 10 months this week :)<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>-- <br/>\nNonviolence is absolute commitment to the way of love. Love is not emotional<br/>\nbash; it is not empty sentimentalism. It is the active outpouring of one&#39;s<br/>\nwhole being into the being of another.<br/>\n--Martin Luther King, Jr. 1957<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":317857527,"authorName":"Tamara Griesel","from":"Tamara Griesel &lt;griesellists@...&gt;","profile":"griesellists","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Unlimited video games for six year old","postDate":"1237918774","msgId":39066,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyMjAzMi40MTg1Ny5xbUB3ZWI2MzEwNS5tYWlsLnJlMS55YWhvby5jb20+","inReplyToHeader":"PENPTDEwNy1XMjNEMEQ1QjhGQjVFMzdEREIyMzlDRENFOTIwQHBoeC5nYmw+"},"prevInTopic":39065,"nextInTopic":39071,"prevInTime":39065,"nextInTime":39067,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"We too have struggled with video game related irritability.  Andrew (almost 9) will play for long hours without breaks and becomes irritable and short","messageBody":"<div id=\"ygrps-yiv-1164282835\">We too have struggled with video game related irritability.  Andrew (almost 9) will play for long hours without breaks and becomes irritable and short tempered after about an hour or so, and increasingly so when he plays for longer.<br/>\n <br/>\nI&#39;ve noticed the same thing in myself when I read for too long without a break, especially something really engrossing like a novel.  (I read fast and voraciously and have been known to go AWOL into a book for hours, not coming up until it&#39;s finished.)  When I finally stop, I feel sort of groggy and irritable.  It fades in less than an hour.  This doesn&#39;t mean to me that I should never read, but I have been trying to discipline myself to take an hour off after reading for an hour, and that seems to help.  I use a timer to remind myself.<br/>\n <br/>\nAnyway, I&#39;m trying to figure out a way to help my son find balance with the computer and the rest of life, especially since he&#39;s begun to mention that he wishes the computer didn&#39;t suck up all of his time.  I do think that the computer can be a sort of hyperstimulus, more attention grabbing than the activities our brains are adapted for, and so can be harder to say &quot;enough&quot; to on one&#39;s own.<br/>\n <br/>\nHow do you respond to &quot;Odysseus requests&quot; from children. (When a child asks you to protect him from himself, like Odysseus when he tied himself to his ship&#39;s mast to hear the Siren&#39;s but instructed his crew not to untie him, no matter what he said).  He gets really angry when I remind him of his desire to take a break after some amount of time or when he&#39;s becoming clearly extremely frustrated, but he settles down and changes activities in a minute or two...and he gets angry later if I was unable to &quot;make&quot; him take a break.<br/>\n <br/>\nTamara<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Mon, 3/23/09, Jet Lakey &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Jetlakey@...\">Jetlakey@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Jet Lakey &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Jetlakey@...\">Jetlakey@...</a>&gt;<br/>\nSubject: RE: [unschoolingbasics] Unlimited video games for six year old<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Monday, March 23, 2009, 7:56 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nBodhi is same age and does the exact same thing. he does his learning on computer (its his thing) and if he is playing games (they are jumpstart learning games but they are still something to lock into) he doesn&#39;t want to stop-for anything. He does all the same thing your son does. he became a different kid. He did the same thing with TV..which is why we no longer have it. We switched to dvd&#39;s which we usually watch once a week as a family. he locks in to the tv or computer and then that is all he can think about and acts the same way as your son. After removing tv/computer time for about 3 weeks he goes back to his &quot;normal&quot; happy self and doesn&#39;t even bother to ask about it. i really think he forgets about it because he is too busy playing and having fun. I am curious to hear what others have to say on this because i could use the same advice! Good luck<br/>\nJet Lakey <br/>\n<br/>\n-live simply so others may simply live-<br/>\n<br/>\nTo: unschoolingbasics@ yahoogroups. com<br/>\nFrom: semajrak@gmail. com<br/>\nDate: Sun, 22 Mar 2009 00:21:12 -0400<br/>\nSubject: [unschoolingbasics] Unlimited video games for six year old<br/>\n<br/>\nI just want to take a quick moment and thank everyone in this group for all<br/>\nof the energy and time they put into the questions and concerns posted.<br/>\nReading along with you all has exposed our family to so many wonderful<br/>\nresources that we wouldn&#39;t likely have found on our own. The greatest so<br/>\nfar has been the book &quot;Raising Our Children, Raising Ourselves&quot;-- a truly<br/>\nenlightened and generous perspective on relationships.<br/>\n<br/>\nMy question is about unlimited video games. My son is six. He turned six<br/>\nin November. Up until fairly recently we had what we called &quot;VG day&quot; which<br/>\nwas basically unlimited video game play all day for one day per week. He<br/>\nlooked forward to that and it seemed to work out well for our family. Of<br/>\ncourse, he asked many times during the course of the week to play, but we<br/>\nwould say he could play on our VG day. After following a few discussions<br/>\nposted here, we decided to allow him to play unlimited anytime. What we are<br/>\nnoticing is that he is getting very moody, and I am wondering if he is too<br/>\nyoung for this kind of play. He was always a really happy guy. He had<br/>\nabundant energy, tons of ideas for play and stories, he loved exploring<br/>\noutdoors--generally very enthusiastic about life. Lately, he is seeming<br/>\nkind of blue. He talks all the time about video games. His imaginary games<br/>\nrevolve around video games. He doesn&#39;t want to tell stories very much any<br/>\nmore. He is not interested in going outside. And, he is very moody.<br/>\n<br/>\nWhenever he is asked to stop playing and join us, he really takes it hard.<br/>\nFor example, tonight, I told him and dad that dinner was almost ready. He<br/>\nwas playing with dad helping. Dad got up and moved toward the kitchen, and<br/>\nEthan continued playing. So, we said that when he was done his level (on<br/>\nZoombinis) he could join us. He chose not to and went on to doing something<br/>\ndifferent in the game. Usually, in the past, he has bounded out into the<br/>\nkitchen turned on the music and munched on whatever was laying around. If<br/>\nwe asked him to help set the table, he would often say sure--and would<br/>\nhappily place all the cutlery in interesting patterns at our places. We<br/>\nhave always enjoyed eating together and lately this too has not been<br/>\nsomething he has wanted to participate in. Dad went in and requested that<br/>\nhe join us. He closed the computer and came to the table, but he ate very<br/>\nlittle and then wanted to go back. This family time is important to my<br/>\nhusband and I, and it has always been a pleasure for all of us, before the<br/>\ngames.<br/>\n<br/>\nWhen we are out in nature he talks a lot about is going home to play a<br/>\ngame. Of course, lately, going out to explore a bit isn&#39;t what he wants to<br/>\nbe doing in the first place, so it takes some creativity on my part to get<br/>\nus there to begin with. It wasn&#39;t like that before. He loved being<br/>\noutside--doing whatever. He loved adventure and he loved exploring. Now he<br/>\nseems to feel burdened to &quot;have to&quot; do it. I didn&#39;t feel like I &quot;had to&quot;<br/>\nget him out before. I do believe that outdoor play is an important part of<br/>\nchildren&#39;s early mental development. At least, it is another important<br/>\nexperience for me and my husband--that he have a good amount of time<br/>\noutside.<br/>\n<br/>\nI could list many more examples, but this seems long enough. Mostly we are<br/>\nconcerned about the lack of interest in other things besides video games and<br/>\nhis change in moods. I am wondering if this is something others have seen.<br/>\nAre we starting too young with video games? Is this a phase? Should I be<br/>\nconcerned?<br/>\n<br/>\nThanks again for your time and thoughts. I look forward to your replies.<br/>\n<br/>\nKaren.<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n____________ _________ _________ _________ _________ _________ _<br/>\nExpress your personality in color! Preview and select themes for Hotmail®.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.windowsl\">http://www.windowsl</a> ive-hotmail. com/LearnMore/ personalize. aspx?ocid= TXT_MSGTX_ WL_HM_express_ 032009#colorthem e<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":117369878,"authorName":"Kelli Traaseth","from":"Kelli Traaseth &lt;kellitraas@...&gt;","profile":"kellitraas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"video gaming is a phase?  or a passion.","postDate":"1237910047","msgId":39049,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2ODU1MC43MjgucW1Ad2ViNTExMDIubWFpbC5yZTIueWFob28uY29tPg==","inReplyToHeader":"PGdxYW1iaStrc2djQGVHcm91cHMuY29tPg=="},"prevInTopic":39048,"nextInTopic":39052,"prevInTime":39048,"nextInTime":39050,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"A phase?  Video game playing.  It could be.  Or not.  And hopefully that s ok. Maybe it s a real passion.  Would it be ok if your child was interested in","messageBody":"<div id=\"ygrps-yiv-1523265086\">A phase?  Video game playing.  It could be.  Or not.  And hopefully that&#39;s ok.<br/>\n<br/>\nMaybe it&#39;s a real passion.  Would it be ok if your child was interested in science?  Would you be worried if your child wanted to learn all there is to know about science?  You know how many facets there are to know in regards to science?<br/>\n<br/>\nThere are a lot of facets to video gaming.  Really.  <br/>\n<br/>\nIs it ok if your child ends up in the video game industry?  Why wouldn&#39;t it be ok if they ended up creating games or testing games?   How about the marketing of games?  Or how about the research of the science behind the games?  <br/>\n<br/>\nI think these are really important questions to ask yourself.<br/>\n<br/>\nIf you, as a parent, are constantly questioning your child in what they are doing there is going to be a lot of frustration.  No matter what they are doing.  Video games can be frustrating, they can be challenging and that&#39;s a big reason why people like them,  they make you think!  &lt;g&gt;   One thing that can help with your child&#39;s frustration is being there for them and helping them with the game.  Not sitting and waiting for the moment that they go on to something else, but enjoying the moment where they are while playing that game.<br/>\n<br/>\nI know this may sound corny to some... but,  breathe and choose joy, it really is going to be ok :)  Actually better than ok!  It&#39;s great!<br/>\n<br/>\nKelli~<br/>\n     <a rel=\"nofollow\" target=\"_blank\" href=\"http://ourjoyfullife.blogspot.com/%c2%a0\">http://ourjoyfullife.blogspot.com/%c2%a0</a> <br/>\n<br/>\n&quot;There are no ordinary moments.&quot;   Dan Millman,  Peaceful Warrior<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":9543528,"authorName":"The Coffee Goddess","from":"The Coffee Goddess &lt;hoffmanwilson@...&gt;","profile":"hoffmanwilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Unlimited video games for six year old","postDate":"1237909299","msgId":39048,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwMjI2Ni4zMDM1MS5xbUB3ZWIzNjkwNy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":39045,"nextInTopic":39049,"prevInTime":39047,"nextInTime":39049,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"... and very upset when he plays.  I noticed he is angry alot more and frustrated.  He won;t stop to come have dinner or if we have to leave. I walk out the","messageBody":"<div id=\"ygrps-yiv-1540121140\"><blockquote><span title=\"ireply\">&gt;&gt;So wanting to be with friends he followed them.  He now gets very moody<br/>\n </span></blockquote>and very upset when he plays.  I noticed he is angry alot more and<br/>\nfrustrated.  He won;t stop to come have dinner or if we have to leave.<br/>\nI walk out the door and start the car and he comes running all upset at<br/>\nme.  I swear I am ready to throw the thing out the window.  His<br/>\npersonality has changed so much that it is upsetting.  He is angry all<br/>\nthe time.  He comes home from friends houses after playing video games<br/>\nall day and he is furious.  Answers back and slams doors and throws<br/>\nhimself on the couch.  <br/>\nHe doesn;t care to participate in anything<br/>\nanymore and when we go somewhere he says he is bored and starts<br/>\ncomplaining of stomach pain and headaches to the point he practically<br/>\nmoans in pain.  He used to be able to entertain himself no matter where<br/>\nwe went.  He still had some imagination left.&gt;&gt;<br/>\n<br/>\nJust a comment--If my loved ones treated my interests with disdain, always examining how much better I was before I took them up, blaming my taking them up on trying to fit in with friends, and having their attitude towards me be &quot;I am ready to throw your (books, knitting, NPR, whatever) out the window&quot;--I would be angry and moody, too.  <br/>\n<br/>\nJust something to think about...<br/>\n<br/>\nDana<br/>\nrabid unschooling mama (frothing at the mouth) to Lauren, 16, Otto, 11, and Miranda Grace, 10 months this week :)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":222835102,"authorName":"Verna","from":"&quot;Verna&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unlimited video games for six year old","postDate":"1237905496","msgId":39045,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdxYXI4bys2bHZoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGQzMTc1M2M5MDkwMzIxMjEyMW8zM2E0YjhlOXE5YjEwMjY2Y2RmN2E3MDM2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":39043,"nextInTopic":39048,"prevInTime":39044,"nextInTime":39046,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"my kids are 3,5,6,7.  they have all had unlimited access to video games.  t.v. is a little more limited because we dont have cable but what we have they can","messageBody":"<div id=\"ygrps-yiv-1811617132\">my kids are 3,5,6,7.  they have all had unlimited access to video games.  t.v. is a little more limited because we dont have cable but what we have they can watch.   for the most part they go through phases.  will play alot, or watch alot then go days without turning it on.  some days that is all they do, others they dont look at it.  i know when they get a new game they play it alot, but then it tapers off.<br/>\nmy 6 year is the most likely to get stuck in or on a game.  it will affect his moods and at one point i asked the same question you have asked about (is he too young).  in the end i changed some of the ways we approached my son about the games and that has helped.  <br/>\n1.  if he gets a new game we try to arrange for several days for him to explore it, relatively uninteruped by other things.<br/>\n2.  if we do have to go somewhere, i let him know before he starts playing that day and we let him know the schedule.<br/>\n3.  i relax about him playing and enjoy it with him.<br/>\nthese things have helped alot.  today he hasnt played at all.  yesterday he did for about an hour and then went outside with his little brother and sister for several hours.</div>","specialLinks":[]},{"userId":328087230,"authorName":"Melissa","from":"&quot;Melissa&quot; &lt;ckent001@...&gt;","profile":"ckent9511","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unlimited video games for six year old","postDate":"1237900466","msgId":39042,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdxYW1iaStrc2djQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNTg3NC4xOTcxOC5xbUB3ZWIzNzQwMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":39041,"nextInTopic":39043,"prevInTime":39041,"nextInTime":39043,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"... I would say it is a phase.  If you could watch TV all day, you might do it for a while.  Then it would get old.  My son did the same thing with VG.  He","messageBody":"<div id=\"ygrps-yiv-1426671330\"><blockquote><span title=\"ireply\">&gt;   Is this a phase?  &gt; <br/>\n&gt; <br/>\n&gt; &gt; <br/>\n&gt; Karen.<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>  I would say it is a phase.  If you could watch TV all day, you might do it for a while.  Then it would get old.  My son did the same thing with VG.  He still plays a bunch, but not as much as when we first took away the strict limitations.  At first he didn&#39;t want to eat or play outside.  It took about 2 months for the obsession to wear off.  Can you play with him?  Or watch?  It might help your mind set.<br/>\n<br/>\nMelissa -Ocala</div>","specialLinks":[]},{"userId":117369878,"authorName":"Kelli Traaseth","from":"Kelli Traaseth &lt;kellitraas@...&gt;","profile":"kellitraas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unlimited video games for six year old","postDate":"1237899870","msgId":39033,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgxNzAyLjk4ODkyLnFtQHdlYjUxMTA2Lm1haWwucmUyLnlhaG9vLmNvbT4=","inReplyToHeader":"PDEzNTg3NC4xOTcxOC5xbUB3ZWIzNzQwMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":39029,"nextInTopic":39036,"prevInTime":39032,"nextInTime":39034,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"***Are we starting too young with video games?*** I don t think so.  If he s interested and engaged in it I d say it s the perfect age. ***When we are out in","messageBody":"<div id=\"ygrps-yiv-1508242991\">***Are we starting too young with video games?***<br/>\n<br/>\nI don&#39;t think so.  If he&#39;s interested and engaged in it I&#39;d say it&#39;s the perfect age.<br/>\n<br/>\n<br/>\n***When we are out in nature he talks a lot about is going home to play a<br/>\n<br/>\n<br/>\n<br/>\ngame.  Of course, lately, going out to explore a bit isn&#39;t what he wants to<br/>\n<br/>\n<br/>\n<br/>\nbe doing in the first place, so it takes some creativity on my part to get<br/>\n<br/>\n<br/>\n<br/>\nus there to begin with.  It wasn&#39;t like that before.  He loved being<br/>\n<br/>\n<br/>\n<br/>\noutside--doing whatever.  He loved adventure and he loved exploring.***<br/>\n<br/>\nBut see, he is still loving the adventure and exploring, he&#39;s just doing it via the games too now.  Isn&#39;t that cool?  Another way he can explore!  It&#39;s a big wonderful world, he can do both.  :)  I would keep offering fun things outside too but not be too disappointed or make him feel bad if he chooses gaming over it.  I know for us when we first started unschooling (about 8 years ago now) and Alec (ds16) would choose staying home over doing something with the rest of us I would feel personally offended, that needed to stop!  &lt;g&gt;<br/>\n<br/>\nI also needed to see that if I just offered something that he&#39;d done over and over again it isn&#39;t as interesting as a new game.  Asking him if he wanted to go outside and explore the backwoods wasn&#39;t as much of a pull for him as trying to figure out how to defeat the latest boss in one of his games.  <br/>\n<br/>\nNow zoom up to current time, he&#39;ll often choose to go with us to walk the dog and if there is something new that we are doing away from home he&#39;ll choose to go with.  We just returned from an unschooling gathering in TN and he had asked if we could hike up Roan Mountain like we did the first time we were there, so he does like both :)<br/>\n<br/>\n***He had<br/>\n<br/>\n<br/>\n<br/>\nabundant energy, tons of ideas for play and stories, he loved exploring<br/>\n<br/>\n<br/>\n<br/>\noutdoors--generally very enthusiastic about life.  Lately, he is seeming<br/>\n<br/>\n<br/>\n<br/>\nkind of blue. ***<br/>\n<br/>\nAre you joining him in his adventures in gaming?  Are you playing along when you can?  Or even when you can&#39;t play along you can sit by him and watch what he&#39;s doing.  I know we can&#39;t do that all the time but I think it&#39;s important to spend some time there so you can see what they&#39;re doing, why is it fun?  Why is there a draw?  Ask him why he likes it, get to know the game.  It&#39;s an amazing connection knowing what your child is doing, not in a controlling way but in a connecting way.  It&#39;s great!<br/>\n<br/>\nDoes he have someone else to share with about the game?  <br/>\n<br/>\nI see Alec&#39;s interest in video games just like any other interest.  Just like if he had an interest in bike riding or raising horses, no difference.  We bring in any other items too that might be tied to the current game, think themes; like countries that the game took place in or also what type of game is the most interesting.  Is it figuring out puzzles or strategy,  get more puzzle books and games, find more strategy games  :)<br/>\n<br/>\n***I do believe that outdoor play is an important part of<br/>\n<br/>\n<br/>\n<br/>\nchildren&#39;s early mental development.  At least, it is another important<br/>\n<br/>\n<br/>\n<br/>\nexperience for me and my husband--that he have a good amount of time<br/>\n<br/>\n<br/>\n<br/>\noutside.***<br/>\n<br/>\nMaybe he enjoys being inside more than being outside.  What comes to my mind right away is my mother-in-law, she really doesn&#39;t enjoy the outdoors but you know what.. you should see the beautiful quilts she makes or the things that she sews!  She also can throw a dinner party like no one else I know.  I think we need all sorts of people who enjoy different things and it&#39;s cool that our children can explore all sorts of interests.<br/>\n<br/>\n<br/>\nKeep life interesting, keep having fun inside and out and life will be good!<br/>\n<br/>\n<br/>\nKelli~<br/>\n     <a rel=\"nofollow\" target=\"_blank\" href=\"http://ourjoyfullife.blogspot.com/%c2%a0\">http://ourjoyfullife.blogspot.com/%c2%a0</a> <br/>\n<br/>\n&quot;There are no ordinary moments.&quot;   Dan Millman,  Peaceful Warrior<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":358899274,"authorName":"mommameow","from":"&quot;mommameow&quot; &lt;stephaniedenaples@...&gt;","profile":"mommameow","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unlimited video games for six year old","postDate":"1237898719","msgId":39043,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdxYWtrditnMWoxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGQzMTc1M2M5MDkwMzIxMjEyMW8zM2E0YjhlOXE5YjEwMjY2Y2RmN2E3MDM2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":39042,"nextInTopic":39045,"prevInTime":39042,"nextInTime":39044,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"Hi- I am usually a passive listener to these boards b/c I really like alot of the ideas that come from the conversations. I felt compelled to write b/c I have","messageBody":"<div id=\"ygrps-yiv-340159111\">Hi-<br/>\nI am usually a passive listener to these boards b/c I really like alot of the ideas that come from the conversations. I felt compelled to write b/c I have recently gone through the same dilemma with my six year old boy. I tried to go the unlimited video game route, actually I tried every route i could imagine. Regardless of how much freedom I gave him with the games, he was obviously changing for the worse. He used to be obsessed with skateboarding and snowboarding until he got the skate and snow games fro the Wii. He actually begged to leave the mountain once to go home and play snowboarding. I also noticed that his ability to handle the endurance needed to master real activities was diminishing, what I attribute to his being able to master the game version so easily, the real thing felt like too much work. I also noticed he no longer looked people in the eye when he met them. Actually he barely even said hello. One of the things I cherished about most home schooled kids is how confident and social they mostly are with adults. That just vanished. The last straw was the mood swings and eventual violence. One night I suggested he take a break for his Wii and play guitar with his Dad who had just come home from work and my son had barely even acknowledged. He calmly walked into his room, smashed his guitar in half and brought it out to show me. The games have been removed since.<br/>\nSince then, my son has returned to be his joyful self. He is into bugs and climbing trees and building legos and cooking again. He is far from perfect, I still would love to see him pick up a book, but that is just him. Over all I believe the games were stunting his growth from a holistic perspective. These games are so much more then the pac-man and donkey kong we grew up with. For the same reason some games have been known to send epileptic children into seizures, these games can be over stimulating for some kids. <br/>\nUndoubtedly you will hear from some parents on this board that their kids know how to regulate themselves and it all works fine for them. That just wasn&#39;t the case for my kids. Be careful, unschooling can become as dogmatic as the philosophies it seeks to avoid. Maybe I am not a good unschooler. Oh well. My kids don&#39;t fit into any one box either. <br/>\nI wish I had the answer for you, for me it was to take them away, and now I have my kids back. I still unschool in many ways, but I don&#39;t believe the philosophy that kids are little adults and to understand them we need to ask ourselves &quot;how would I react if someone told me no to  ect..&quot; Children are different emotionally, neurologically, and physically. They need our guidance in an open, rational and compassionate way. Not an expectation that they have the mental facilities to have the internal dialogue necessary for introspection and behavioral regulation, in the face of some external inputs such as video games. Some kids do. Cheers to them.<br/>\nBecause I talk with my kids about everything, (sometime to an exhausting degree) they have since verbalized that they missed doing specific activities and also that they felt &#39;weird&#39; after playing for extended amounts of time.<br/>\nYou know your children. What works for some may not work for your kids. Stick with your gut.<br/>\nBest of luck.</div>","specialLinks":[]},{"userId":209900516,"authorName":"sugozzi2000","from":"&quot;sugozzi2000&quot; &lt;sugozzi2000@...&gt;","profile":"sugozzi2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unlimited video games for six year old","postDate":"1237891347","msgId":39041,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdxYWRlaitxM29mQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGQzMTc1M2M5MDkwMzIxMjEyMW8zM2E0YjhlOXE5YjEwMjY2Y2RmN2E3MDM2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":39036,"nextInTopic":39042,"prevInTime":39040,"nextInTime":39042,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"Hi, I find myself in the same predicament.  I have a 9 yr old son who never saw a video game til he was about 6. We never had one.   Most of the time he","messageBody":"<div id=\"ygrps-yiv-1413833117\">Hi, I find myself in the same predicament.  I have a 9 yr old son who never saw a video game til he was about 6. We never had one.   Most of the time he wouldn;t even care to play video games.  He would rather be outside and exploring or reading or imaginary play. But as he got older his friend didn&#39;t play outside but were glued to the video games.  So wanting to be with friends he followed them.  He now gets very moody and very upset when he plays.  I noticed he is angry alot more and frustrated.  He won;t stop to come have dinner or if we have to leave. I walk out the door and start the car and he comes running all upset at me.  I swear I am ready to throw the thing out the window.  His personality has changed so much that it is upsetting.  He is angry all the time.  He comes home from friends houses after playing video games all day and he is furious.  Answers back and slams doors and throws himself on the couch.  <br/>\nHe doesn;t care to participate in anything anymore and when we go somewhere he says he is bored and starts complaining of stomach pain and headaches to the point he practically moans in pain.  He used to be able to entertain himself no matter where we went.  He still had some imagination left.<br/>\nI guess some kids can handle the unlimited play of video games but I don;t think all can be left to unlimited use.  I certainly see how kids have lost imagination and the joy of playing outdoors, like before we had video games.  I call video games &quot;the babysitter of our kids generation&quot;.  Anyhow, i am trying to figure out how to get my son back from being sucked into the world of video games.  When I don&#39;t let him play my happy imaginative son returns!    Each person knows their kids best, mine cannot handle unlimited use of video games.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Karen James &lt;semajrak@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I just want to take a quick moment and thank everyone in this group for all<br/>\n&gt; of the energy and time they put into the questions and concerns posted.<br/>\n&gt; Reading along with you all has exposed our family to so many wonderful<br/>\n&gt; resources that we wouldn&#39;t likely have found on our own.  The greatest so<br/>\n&gt; far has been the book &quot;Raising Our Children, Raising Ourselves&quot;--a truly<br/>\n&gt; enlightened and generous perspective on relationships.<br/>\n&gt; <br/>\n&gt; My question is about unlimited video games.  My son is six.  He turned six<br/>\n&gt; in November.  Up until fairly recently we had what we called &quot;VG day&quot; which<br/>\n&gt; was basically unlimited video game play all day for one day per week.  He<br/>\n&gt; looked forward to that and it seemed to work out well for our family.  Of<br/>\n&gt; course, he asked many times during the course of the week to play, but we<br/>\n&gt; would say he could play on our VG day.  After following a few discussions<br/>\n&gt; posted here, we decided to allow him to play unlimited anytime.  What we are<br/>\n&gt; noticing is that he is getting very moody, and I am wondering if he is too<br/>\n&gt; young for this kind of play.  He was always a really happy guy.  He had<br/>\n&gt; abundant energy, tons of ideas for play and stories, he loved exploring<br/>\n&gt; outdoors--generally very enthusiastic about life.  Lately, he is seeming<br/>\n&gt; kind of blue.  He talks all the time about video games.  His imaginary games<br/>\n&gt; revolve around video games.  He doesn&#39;t want to tell stories very much any<br/>\n&gt; more.  He is not interested in going outside.  And, he is very moody.<br/>\n&gt; <br/>\n&gt; Whenever he is asked to stop playing and join us, he really takes it hard.<br/>\n&gt; For example, tonight, I told him and dad that dinner was almost ready.  He<br/>\n&gt; was playing with dad helping.  Dad got up and moved toward the kitchen, and<br/>\n&gt; Ethan continued playing.  So, we said that when he was done his level (on<br/>\n&gt; Zoombinis) he could join us.  He chose not to and went on to doing something<br/>\n&gt; different in the game.  Usually, in the past, he has bounded out into the<br/>\n&gt; kitchen turned on the music and munched on whatever was laying around.  If<br/>\n&gt; we asked him to help set the table, he would often say sure--and would<br/>\n&gt; happily place all the cutlery in interesting patterns at our places.  We<br/>\n&gt; have always enjoyed eating together and lately this too has not been<br/>\n&gt; something he has wanted to participate in.  Dad went in and requested that<br/>\n&gt; he join us.  He closed the computer and came to the table, but he ate very<br/>\n&gt; little and then wanted to go back.  This family time is important to my<br/>\n&gt; husband and I, and it has always been a pleasure for all of us, before the<br/>\n&gt; games.<br/>\n&gt; <br/>\n&gt; When we are out in nature he talks a lot about is going home to play a<br/>\n&gt; game.  Of course, lately, going out to explore a bit isn&#39;t what he wants to<br/>\n&gt; be doing in the first place, so it takes some creativity on my part to get<br/>\n&gt; us there to begin with.  It wasn&#39;t like that before.  He loved being<br/>\n&gt; outside--doing whatever.  He loved adventure and he loved exploring.  Now he<br/>\n&gt; seems to feel burdened to &quot;have to&quot; do it.  I didn&#39;t feel like I &quot;had to&quot;<br/>\n&gt; get him out before.  I do believe that outdoor play is an important part of<br/>\n&gt; children&#39;s early mental development.  At least, it is another important<br/>\n&gt; experience for me and my husband--that he have a good amount of time<br/>\n&gt; outside.<br/>\n&gt; <br/>\n&gt; I could list many more examples, but this seems long enough.  Mostly we are<br/>\n&gt; concerned about the lack of interest in other things besides video games and<br/>\n&gt; his change in moods. I am wondering if this is something others have seen.<br/>\n&gt; Are we starting too young with video games?  Is this a phase?  Should I be<br/>\n&gt; concerned?<br/>\n&gt; <br/>\n&gt; Thanks again for your time and thoughts.  I look forward to your replies.<br/>\n&gt; <br/>\n&gt; Karen.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":193844353,"authorName":"Nicole Willoughby","from":"Nicole Willoughby &lt;cncnawilloughby@...&gt;","profile":"cncnawilloughby","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Unlimited video games for six year old","postDate":"1237860637","msgId":39029,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTg3NC4xOTcxOC5xbUB3ZWIzNzQwMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":39017,"nextInTopic":39033,"prevInTime":39028,"nextInTime":39030,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"Karen, I m getting my schoolers showered and settled so I have to write more later but for now imagine this........ Someone hands you a credit card with no","messageBody":"<div id=\"ygrps-yiv-419122065\">Karen,<br/>\n<br/>\nI&#39;m getting my schoolers showered and settled so I have to write more later but for now imagine this........<br/>\n<br/>\nSomeone hands you a credit card with no limit . You can buy as much as you want whatever you want. Storage space is no concern , you arent worried about reducing your carbon foot print , you arent going to get into any legal troubl and you wont ever have to pay any of this money back. Only thing is you arent quite sure if or when the credit card is going to get taken from you. <br/>\n<br/>\nWhat are you going to do ?<br/>\n<br/>\n<br/>\n<br/>\nNicole <br/>\n<br/>\nNever play with hot lava in the house ~Alyssa,5<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Sat, 3/21/09, Karen James &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:semajrak@...\">semajrak@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Karen James &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:semajrak@...\">semajrak@...</a>&gt;<br/>\nSubject: [unschoolingbasics] Unlimited video games for six year old<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nDate: Saturday, March 21, 2009, 11:21 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n            I just want to take a quick moment and thank everyone in this group for all<br/>\n<br/>\nof the energy and time they put into the questions and concerns posted.<br/>\n<br/>\nReading along with you all has exposed our family to so many wonderful<br/>\n<br/>\nresources that we wouldn&#39;t likely have found on our own.  The greatest so<br/>\n<br/>\nfar has been the book &quot;Raising Our Children, Raising Ourselves&quot;-- a truly<br/>\n<br/>\nenlightened and generous perspective on relationships.<br/>\n<br/>\n<br/>\n<br/>\nMy question is about unlimited video games.  My son is six.  He turned six<br/>\n<br/>\nin November.  Up until fairly recently we had what we called &quot;VG day&quot; which<br/>\n<br/>\nwas basically unlimited video game play all day for one day per week.  He<br/>\n<br/>\nlooked forward to that and it seemed to work out well for our family.  Of<br/>\n<br/>\ncourse, he asked many times during the course of the week to play, but we<br/>\n<br/>\nwould say he could play on our VG day.  After following a few discussions<br/>\n<br/>\nposted here, we decided to allow him to play unlimited anytime.  What we are<br/>\n<br/>\nnoticing is that he is getting very moody, and I am wondering if he is too<br/>\n<br/>\nyoung for this kind of play.  He was always a really happy guy.  He had<br/>\n<br/>\nabundant energy, tons of ideas for play and stories, he loved exploring<br/>\n<br/>\noutdoors--generally very enthusiastic about life.  Lately, he is seeming<br/>\n<br/>\nkind of blue.  He talks all the time about video games.  His imaginary games<br/>\n<br/>\nrevolve around video games.  He doesn&#39;t want to tell stories very much any<br/>\n<br/>\nmore.  He is not interested in going outside.  And, he is very moody.<br/>\n<br/>\n<br/>\n<br/>\nWhenever he is asked to stop playing and join us, he really takes it hard.<br/>\n<br/>\nFor example, tonight, I told him and dad that dinner was almost ready.  He<br/>\n<br/>\nwas playing with dad helping.  Dad got up and moved toward the kitchen, and<br/>\n<br/>\nEthan continued playing.  So, we said that when he was done his level (on<br/>\n<br/>\nZoombinis) he could join us.  He chose not to and went on to doing something<br/>\n<br/>\ndifferent in the game.  Usually, in the past, he has bounded out into the<br/>\n<br/>\nkitchen turned on the music and munched on whatever was laying around.  If<br/>\n<br/>\nwe asked him to help set the table, he would often say sure--and would<br/>\n<br/>\nhappily place all the cutlery in interesting patterns at our places.  We<br/>\n<br/>\nhave always enjoyed eating together and lately this too has not been<br/>\n<br/>\nsomething he has wanted to participate in.  Dad went in and requested that<br/>\n<br/>\nhe join us.  He closed the computer and came to the table, but he ate very<br/>\n<br/>\nlittle and then wanted to go back.  This family time is important to my<br/>\n<br/>\nhusband and I, and it has always been a pleasure for all of us, before the<br/>\n<br/>\ngames.<br/>\n<br/>\n<br/>\n<br/>\nWhen we are out in nature he talks a lot about is going home to play a<br/>\n<br/>\ngame.  Of course, lately, going out to explore a bit isn&#39;t what he wants to<br/>\n<br/>\nbe doing in the first place, so it takes some creativity on my part to get<br/>\n<br/>\nus there to begin with.  It wasn&#39;t like that before.  He loved being<br/>\n<br/>\noutside--doing whatever.  He loved adventure and he loved exploring.  Now he<br/>\n<br/>\nseems to feel burdened to &quot;have to&quot; do it.  I didn&#39;t feel like I &quot;had to&quot;<br/>\n<br/>\nget him out before.  I do believe that outdoor play is an important part of<br/>\n<br/>\nchildren&#39;s early mental development.  At least, it is another important<br/>\n<br/>\nexperience for me and my husband--that he have a good amount of time<br/>\n<br/>\noutside.<br/>\n<br/>\n<br/>\n<br/>\nI could list many more examples, but this seems long enough.  Mostly we are<br/>\n<br/>\nconcerned about the lack of interest in other things besides video games and<br/>\n<br/>\nhis change in moods. I am wondering if this is something others have seen.<br/>\n<br/>\nAre we starting too young with video games?  Is this a phase?  Should I be<br/>\n<br/>\nconcerned?<br/>\n<br/>\n<br/>\n<br/>\nThanks again for your time and thoughts.  I look forward to your replies.<br/>\n<br/>\n<br/>\n<br/>\nKaren.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n      <br/>\n<br/>\n    <br/>\n    <br/>\n\t<br/>\n\t <br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t<br/>\n<br/>\n<br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":150989429,"authorName":"Jet Lakey","from":"Jet Lakey &lt;Jetlakey@...&gt;","profile":"wiccankungfu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [unschoolingbasics] Unlimited video games for six year old","postDate":"1237852609","msgId":39036,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENPTDEwNy1XMjNEMEQ1QjhGQjVFMzdEREIyMzlDRENFOTIwQHBoeC5nYmw+","inReplyToHeader":"PGQzMTc1M2M5MDkwMzIxMjEyMW8zM2E0YjhlOXE5YjEwMjY2Y2RmN2E3MDM2QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGQzMTc1M2M5MDkwMzIxMjEyMW8zM2E0YjhlOXE5YjEwMjY2Y2RmN2E3MDM2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":39033,"nextInTopic":39041,"prevInTime":39035,"nextInTime":39037,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"Bodhi is same age and does the exact same thing. he does his learning on computer (its his thing) and if he is playing games (they are jumpstart learning games","messageBody":"<div id=\"ygrps-yiv-1267441707\">Bodhi is same age and does the exact same thing. he does his learning on computer (its his thing) and if he is playing games (they are jumpstart learning games but they are still something to lock into) he doesn&#39;t want to stop-for anything. He does all the same thing your son does. he became a different kid. He did the same thing with TV..which is why we no longer have it. We switched to dvd&#39;s which we usually watch once a week as a family. he locks in to the tv or computer and then that is all he can think about and acts the same way as your son. After removing  tv/computer time for about 3 weeks he goes back to his &quot;normal&quot; happy self and doesn&#39;t even bother to ask about it. i really think he forgets about it because he is too busy playing and having fun. I am curious to hear what others have to say on this because i could use the same advice! Good luck<br/>\nJet Lakey  <br/>\n <br/>\n-live simply so others may simply live-<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:semajrak@...\">semajrak@...</a><br/>\nDate: Sun, 22 Mar 2009 00:21:12 -0400<br/>\nSubject: [unschoolingbasics] Unlimited video games for six year old<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI just want to take a quick moment and thank everyone in this group for all<br/>\nof the energy and time they put into the questions and concerns posted.<br/>\nReading along with you all has exposed our family to so many wonderful<br/>\nresources that we wouldn&#39;t likely have found on our own. The greatest so<br/>\nfar has been the book &quot;Raising Our Children, Raising Ourselves&quot;--a truly<br/>\nenlightened and generous perspective on relationships.<br/>\n<br/>\nMy question is about unlimited video games. My son is six. He turned six<br/>\nin November. Up until fairly recently we had what we called &quot;VG day&quot; which<br/>\nwas basically unlimited video game play all day for one day per week. He<br/>\nlooked forward to that and it seemed to work out well for our family. Of<br/>\ncourse, he asked many times during the course of the week to play, but we<br/>\nwould say he could play on our VG day. After following a few discussions<br/>\nposted here, we decided to allow him to play unlimited anytime. What we are<br/>\nnoticing is that he is getting very moody, and I am wondering if he is too<br/>\nyoung for this kind of play. He was always a really happy guy. He had<br/>\nabundant energy, tons of ideas for play and stories, he loved exploring<br/>\noutdoors--generally very enthusiastic about life. Lately, he is seeming<br/>\nkind of blue. He talks all the time about video games. His imaginary games<br/>\nrevolve around video games. He doesn&#39;t want to tell stories very much any<br/>\nmore. He is not interested in going outside. And, he is very moody.<br/>\n<br/>\nWhenever he is asked to stop playing and join us, he really takes it hard.<br/>\nFor example, tonight, I told him and dad that dinner was almost ready. He<br/>\nwas playing with dad helping. Dad got up and moved toward the kitchen, and<br/>\nEthan continued playing. So, we said that when he was done his level (on<br/>\nZoombinis) he could join us. He chose not to and went on to doing something<br/>\ndifferent in the game. Usually, in the past, he has bounded out into the<br/>\nkitchen turned on the music and munched on whatever was laying around. If<br/>\nwe asked him to help set the table, he would often say sure--and would<br/>\nhappily place all the cutlery in interesting patterns at our places. We<br/>\nhave always enjoyed eating together and lately this too has not been<br/>\nsomething he has wanted to participate in. Dad went in and requested that<br/>\nhe join us. He closed the computer and came to the table, but he ate very<br/>\nlittle and then wanted to go back. This family time is important to my<br/>\nhusband and I, and it has always been a pleasure for all of us, before the<br/>\ngames.<br/>\n<br/>\nWhen we are out in nature he talks a lot about is going home to play a<br/>\ngame. Of course, lately, going out to explore a bit isn&#39;t what he wants to<br/>\nbe doing in the first place, so it takes some creativity on my part to get<br/>\nus there to begin with. It wasn&#39;t like that before. He loved being<br/>\noutside--doing whatever. He loved adventure and he loved exploring. Now he<br/>\nseems to feel burdened to &quot;have to&quot; do it. I didn&#39;t feel like I &quot;had to&quot;<br/>\nget him out before. I do believe that outdoor play is an important part of<br/>\nchildren&#39;s early mental development. At least, it is another important<br/>\nexperience for me and my husband--that he have a good amount of time<br/>\noutside.<br/>\n<br/>\nI could list many more examples, but this seems long enough. Mostly we are<br/>\nconcerned about the lack of interest in other things besides video games and<br/>\nhis change in moods. I am wondering if this is something others have seen.<br/>\nAre we starting too young with video games? Is this a phase? Should I be<br/>\nconcerned?<br/>\n<br/>\nThanks again for your time and thoughts. I look forward to your replies.<br/>\n<br/>\nKaren.<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nExpress your personality in color! Preview and select themes for Hotmail®.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.windowslive-hotmail.com/LearnMore/personalize.aspx?ocid=TXT_MSGTX_WL_HM_express_032009#colortheme\">http://www.windowslive-hotmail.com/LearnMore/personalize.aspx?ocid=TXT_MSGTX_WL_HM_express_032009#colortheme</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen James","from":"Karen James &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Unlimited video games for six year old","postDate":"1237695672","msgId":39017,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQzMTc1M2M5MDkwMzIxMjEyMW8zM2E0YjhlOXE5YjEwMjY2Y2RmN2E3MDM2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":39029,"prevInTime":39016,"nextInTime":39018,"topicId":39017,"numMessagesInTopic":0,"msgSnippet":"I just want to take a quick moment and thank everyone in this group for all of the energy and time they put into the questions and concerns posted. Reading","messageBody":"<div id=\"ygrps-yiv-1255254984\">I just want to take a quick moment and thank everyone in this group for all<br/>\nof the energy and time they put into the questions and concerns posted.<br/>\nReading along with you all has exposed our family to so many wonderful<br/>\nresources that we wouldn&#39;t likely have found on our own.  The greatest so<br/>\nfar has been the book &quot;Raising Our Children, Raising Ourselves&quot;--a truly<br/>\nenlightened and generous perspective on relationships.<br/>\n<br/>\nMy question is about unlimited video games.  My son is six.  He turned six<br/>\nin November.  Up until fairly recently we had what we called &quot;VG day&quot; which<br/>\nwas basically unlimited video game play all day for one day per week.  He<br/>\nlooked forward to that and it seemed to work out well for our family.  Of<br/>\ncourse, he asked many times during the course of the week to play, but we<br/>\nwould say he could play on our VG day.  After following a few discussions<br/>\nposted here, we decided to allow him to play unlimited anytime.  What we are<br/>\nnoticing is that he is getting very moody, and I am wondering if he is too<br/>\nyoung for this kind of play.  He was always a really happy guy.  He had<br/>\nabundant energy, tons of ideas for play and stories, he loved exploring<br/>\noutdoors--generally very enthusiastic about life.  Lately, he is seeming<br/>\nkind of blue.  He talks all the time about video games.  His imaginary games<br/>\nrevolve around video games.  He doesn&#39;t want to tell stories very much any<br/>\nmore.  He is not interested in going outside.  And, he is very moody.<br/>\n<br/>\nWhenever he is asked to stop playing and join us, he really takes it hard.<br/>\nFor example, tonight, I told him and dad that dinner was almost ready.  He<br/>\nwas playing with dad helping.  Dad got up and moved toward the kitchen, and<br/>\nEthan continued playing.  So, we said that when he was done his level (on<br/>\nZoombinis) he could join us.  He chose not to and went on to doing something<br/>\ndifferent in the game.  Usually, in the past, he has bounded out into the<br/>\nkitchen turned on the music and munched on whatever was laying around.  If<br/>\nwe asked him to help set the table, he would often say sure--and would<br/>\nhappily place all the cutlery in interesting patterns at our places.  We<br/>\nhave always enjoyed eating together and lately this too has not been<br/>\nsomething he has wanted to participate in.  Dad went in and requested that<br/>\nhe join us.  He closed the computer and came to the table, but he ate very<br/>\nlittle and then wanted to go back.  This family time is important to my<br/>\nhusband and I, and it has always been a pleasure for all of us, before the<br/>\ngames.<br/>\n<br/>\nWhen we are out in nature he talks a lot about is going home to play a<br/>\ngame.  Of course, lately, going out to explore a bit isn&#39;t what he wants to<br/>\nbe doing in the first place, so it takes some creativity on my part to get<br/>\nus there to begin with.  It wasn&#39;t like that before.  He loved being<br/>\noutside--doing whatever.  He loved adventure and he loved exploring.  Now he<br/>\nseems to feel burdened to &quot;have to&quot; do it.  I didn&#39;t feel like I &quot;had to&quot;<br/>\nget him out before.  I do believe that outdoor play is an important part of<br/>\nchildren&#39;s early mental development.  At least, it is another important<br/>\nexperience for me and my husband--that he have a good amount of time<br/>\noutside.<br/>\n<br/>\nI could list many more examples, but this seems long enough.  Mostly we are<br/>\nconcerned about the lack of interest in other things besides video games and<br/>\nhis change in moods. I am wondering if this is something others have seen.<br/>\nAre we starting too young with video games?  Is this a phase?  Should I be<br/>\nconcerned?<br/>\n<br/>\nThanks again for your time and thoughts.  I look forward to your replies.<br/>\n<br/>\nKaren.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":39311,"nextTopicId":39400}}