{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":150527288,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"more on pros-cons","postDate":"1104617141","msgId":4526,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNyNzZybCtyODMxQGVHcm91cHMuY29tPg=="},"prevInTopic":4522,"nextInTopic":0,"prevInTime":4525,"nextInTime":4527,"topicId":4522,"numMessagesInTopic":0,"msgSnippet":"being afraid your child wont know enough to even pass the GED exam and get a good job-to name a few.","messageBody":"<div id=\"ygrps-yiv-994453387\">&quot;&gt;&gt;&gt;&gt;&gt;&gt;&gt;being afraid your child wont<br/>\nknow enough to even pass the GED exam and get a good job-to name a<br/>\nfew.&lt;&lt;&lt;&lt;&lt;&quot;<br/>\n<br/>\nHmmmm....how many kids come out of the school system like this? <br/>\nQuite a few.<br/>\nYou&#39;re fearing lack of education, but what kind of education did the <br/>\nschools give you and your dh? Seems pretty easy to see that <br/>\nschooling (of any kind) does not equal confidence and learning.<br/>\n<br/>\nI can tell you about my kids, but I guess I&#39;ll just tell you about <br/>\nmy 15 y.o., since his age is more relevant to the above statement.<br/>\nHe&#39;s WAaaaaay into computers, has built his own, knows how to <br/>\nnetwork them, do repairs and is learning programming.<br/>\nHe&#39;s a major video gamer...plays many hours. He likes television <br/>\ntoo...but is pretty choosy about what he watches. He can spout off <br/>\nmore facts about every American war (and a few others) than I can, <br/>\nknows the weaponry inside and out, oh, and he&#39;s a peace activist to <br/>\nboot.:)<br/>\nHe works with my dh building decks right now, so he&#39;s learning <br/>\nconstruction. He hates the work, but loves the pay and his boss.;)<br/>\nHe KNOWS he will make money in technology, not construction...but <br/>\nheck, it&#39;s good pay for a just-turned 15 y.o. ($8 per hour).<br/>\n<br/>\nI don&#39;t worry that he won&#39;t be smart enough to pass a GED, I think <br/>\nhe could pass it now with a little coaching and test prep.<br/>\nEven without all his computer knowledge, I don&#39;t worry that he won&#39;t <br/>\nbe able to find good work. You know why?<br/>\nBecause all of my children are able to truly KNOW themselves.<br/>\nUnschooling allows them a unique opportunity to possess that quiet <br/>\nconfidence that they can learn anything at anytime!! A child with <br/>\nthat kind of confidence, with a creative, curious mind, will have no <br/>\nproblem finding work that they enjoy.<br/>\nLife is a journey.<br/>\nMy kids aren&#39;t waiting to turn 18 for theirs to begin. They&#39;re <br/>\nliving their dreams NOW and that will continue for them all their <br/>\nlives.<br/>\nMy 7 y.o. has been making money running her own little &quot;coffee shop&quot; <br/>\n(she&#39;s been selling biscotti and has the equipment for selling hot <br/>\nchocolate and cappucino, which she will do shortly).<br/>\nWhen she expressed an interest in selling hot chocolate, did I just <br/>\nsmile and say &quot;that&#39;s nice&quot;?<br/>\nHeck NO!!<br/>\nWe jumped in the car and went to buy her the supplies. If I didn&#39;t <br/>\nhave money for that, I would have gotten creative and done some more <br/>\nplanning....but I always support their interests and dreams to the <br/>\nbest of my ability.<br/>\n<br/>\nUnschooling has NO limits. The limits are only within each <br/>\nindividual, and how creative and curious they&#39;re willing to become.<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"more on pros-cons","postDate":"1104615806","msgId":4522,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNyNzVodSs0dXRkQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":4526,"prevInTime":4521,"nextInTime":4523,"topicId":4522,"numMessagesInTopic":0,"msgSnippet":" do think there are a lot of children(like you said) who would love an unschooling life but I think some children do prefer more structure.I was pretty much","messageBody":"<div id=\"ygrps-yiv-2047090726\">&quot; do think<br/>\nthere are a lot of children(like you said) who would love an<br/>\nunschooling life but I think some children do prefer more structure.I<br/>\nwas pretty much unschooled(when not in school) because I was alone to<br/>\ndo what I please.&quot;<br/>\n<br/>\nIf a child wants structure, we help them have it. Unschooling is <br/>\nabout meeting the child where they are and helping them where they <br/>\nneed it.<br/>\n&quot;alone to do what I please&quot; is not unschooling. You can&#39;t unschool <br/>\nand go to school. Your mother didn&#39;t show enough interest in you, <br/>\nthat isn&#39;t freedom, it&#39;s neglect.<br/>\nOur children have an attentive, interested parent available and with <br/>\nthem whenever they need it. My kids aren&#39;t forced to clean their <br/>\nrooms, but they have my help with their rooms all the time. Being <br/>\ninterested in what they need at each moment takes a LOT more effort <br/>\nthan plugging in some curriculum or chores in my opinion.<br/>\n<br/>\nUnschooling is about being creative, it&#39;s about thinking outside the <br/>\nbox, it&#39;s about learning ALL the time. If YOU are interested in <br/>\nlife, if YOU are leading the life of your dreams, how could your <br/>\nchildren not learn in that environment?<br/>\nYou listed &quot;cons&quot; of unschooling, but they weren&#39;t about unschooling <br/>\nat all...they were about the fears you have in your own life and <br/>\nlack of trust in your own abilities.<br/>\nI bet school did some of that to you.;)<br/>\n<br/>\nIf you see lack in your life, how can you turn that around and see <br/>\nabundance? If you have fear about being able to provide the things <br/>\nyour children are interested in, and the wonderful things they need, <br/>\nthen why do you think even homeschooling will work? How does <br/>\nimplementing a curriculum or lessons overcome the deficits you <br/>\nlisted?<br/>\nHow about finding creative ways to get them to the places they need? <br/>\nHow about seeing the abundance all around you and taking advantage <br/>\nof unique situations that allow you all to get where you want to go?<br/>\nWe&#39;ve had some really tight years where we couldn&#39;t afford much, but <br/>\nwe always found ways to help them explore the things they were <br/>\ninterested in.<br/>\n<br/>\nRen</div>","specialLinks":[]}],"prevTopicId":4524,"nextTopicId":4518}}