{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":254073704,"authorName":"sbroo2","from":"&quot;sbroo2&quot; &lt;samantha.nuttycombe@...&gt;","profile":"sbroo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Yet another food question, but a little different","postDate":"1372889246","msgId":49839,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtyMjdhdStuYnJyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtxdnA5citha2UyQGVHcm91cHMuY29tPg=="},"prevInTopic":49837,"nextInTopic":0,"prevInTime":49838,"nextInTime":49840,"topicId":49807,"numMessagesInTopic":0,"msgSnippet":"Thank you, Meredith! I LOVE that: Being skeptical of my own certainties. Wow. That really sums up so much. I think I need to make a bumper sticker, and also a","messageBody":"<div id=\"ygrps-yiv-134461552\">Thank you, Meredith! I LOVE that: Being skeptical of my own certainties. Wow. That really sums up so much. I think I need to make a bumper sticker, and also a poster for in my house to remind me, that states &quot;Be Skeptical of Your Own Certainties&quot;. :)<br/>\n<br/>\nThat&#39;s fantastic about Ray, too. He sounds like a very lucky young man, to have the opportunity to live with you and learn in a trusting home.<br/>\n<br/>\nSo I&#39;m not alone in feeling like I need to verify through research every little thing they ask about and that leaves my mouth, eh? lol What an awesome life-path. I will learn so much.<br/>\n<br/>\nSamantha</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Yet another food question, but a little different","postDate":"1372809339","msgId":49837,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtxdnA5citha2UyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtxdjZpMSszM2M4QGVHcm91cHMuY29tPg=="},"prevInTopic":49836,"nextInTopic":49839,"prevInTime":49836,"nextInTime":49838,"topicId":49807,"numMessagesInTopic":0,"msgSnippet":"... *********** Yes! It still amazes me too, sometimes. There are so many messages everywhere that kids Have To be taught what s right or they ll automatically","messageBody":"<div id=\"ygrps-yiv-565612463\"><blockquote><span title=\"ireply\">&gt; I know you guys know this, but it&#39;s still amazing to me: when we approach kids assuming intelligence, they respond intelligently, even when they&#39;re very little.<br/>\n </span></blockquote>***********<br/>\n<br/>\nYes! It still amazes me too, sometimes. There are so many messages everywhere that kids Have To be taught what&#39;s right or they&#39;ll automatically do their worst. I love watching my kids prove the common &quot;wisdom&quot; wrong. <br/>\n<br/>\nIt was really cool watching this play out with Ray when he was a young teen at the skate park. He&#39;s my stepson and had been back and forth a bit between homes, schooling and homeschooling before his mom agreed to let him live with us full time and unschool - so he had a lot of baggage and deschooling to do. I was nervous about letting him make up his own mind about wearing protective gear to skate - it seemed like a crazy thing, to let a young teen, fresh out of school, decide for himself, but I also knew if he felt forced into it he&#39;d find ways to sabotage the gear so it wasn&#39;t providing any protection. That&#39;s the joy of having a strong willed teen! So I told him it was up to him. <br/>\n<br/>\nDuring the weekends, there were a lot of kids, not all wearing helmets, but there was a steady presence of adults in helmets on weekends and during the week. While he was there, Ray watched people, talked to people, decided who was worth listening to, who was helpful and interesting, and who was full of shit.  And after awhile, Ray wore all his protective gear every time. He Especially did when he started carving - just one time he dropped down into the bowl with no helmet and came right back out to get it, having completely freaked himself out by doing something which Felt really stupid (he said later). He wanted to be safe. And not just Be safe, he decided he&#39;d rather be Seen as one of the safe guys, rather than one of the bozos - a funny kind of twist on peer relationships. He wanted to be like the people he found worthy of respect. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I do wonder how I would have taken it if they just chose to ignore what I told them instead. Or maybe that doesn&#39;t happen when you have a healthy relationship with your kids.<br/>\n </span></blockquote>***********<br/>\n<br/>\nI don&#39;t see my kids ignore information, but they are skeptical. With Ray, some of that has to do with years of school etc - he wants to be the one making his own decisions and doesn&#39;t Entirely trust other people not to try to push him around. <br/>\n<br/>\nMy daughter has always been unschooled, though, and she&#39;s also a very skeptical person. She doesn&#39;t take answers at face value and never has, preferring to come up with her own theories and test them over time. That&#39;s her personality. <br/>\n<br/>\nSo I&#39;ve learned to be very careful about How I offer my kids information so I don&#39;t run into their skepticism in a way that sets Me up to look untrustworthy. That&#39;s challenging! But it gives me the opportunity to be be very skeptical of my own certainties - and then I get to learn and grow more as a person. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":254073704,"authorName":"sbroo2","from":"&quot;sbroo2&quot; &lt;samantha.nuttycombe@...&gt;","profile":"sbroo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Yet another food question, but a little different","postDate":"1372790145","msgId":49836,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtxdjZpMSszM2M4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGttZjNvYysyYTBxQGVHcm91cHMuY29tPg=="},"prevInTopic":49812,"nextInTopic":49837,"prevInTime":49835,"nextInTime":49837,"topicId":49807,"numMessagesInTopic":0,"msgSnippet":"I want to thank you all for weighing in on this for me. Sorry it took so long to respond. We moved, which threw everything off from our normal routine of chill","messageBody":"<div id=\"ygrps-yiv-823350839\">I want to thank you all for weighing in on this for me. Sorry it took so long to respond. We moved, which threw everything off from our normal routine of chill time each day. I wanted to share some of what has happened.<br/>\n<br/>\nI discussed good oral practices with the kids, and why it matters. I explained how cavities work- bacteria poop in our teeth and that the poop rots them, and that bacteria love breads and sugars the most, or anything that sticks between our teeth. They also know brushing and flossing like we already do helps, and that drinking water after eating sweets helps. They like to discuss it with both us parents, and ask more questions each time, and have internalized the information so it is no longer coming from us.<br/>\n<br/>\nThey took it all in, and adjusted their practices accordingly. I&#39;m somewhat shocked at how earnestly they took it all in, and changed their behavior accordingly. They still request a treat almost daily, but they swish water afterwards. They also love the smoothie popsicles I have started making, and by eating more of those (multiple a day) they are satisfying whatever urge it is to have something special, so there are less requests for cookies and other bread-based carbs. In fact, I greatly increased the fruit available to them.<br/>\n<br/>\nI spoke with my daughter about wheat and gluten, and asked her to notice how it makes her feel. She now chooses alternatives 75% of the time, and doesn&#39;t seem to mind.<br/>\n<br/>\nThe result has been a stabilizing of my son&#39;s teeth with no new cavities, and no battle with either kid because I&#39;m not intervening. In fact, they remember to tend to their teeth better than I do. My daughter asks me if things have gluten in them now, and will either decide to go ahead and eat it, or will explore alternatives that make her just as happy.<br/>\n<br/>\nI&#39;m so happy to find a win-win situation emerging. They still make the decisions, but I feel like they are making more informed decisions and are mitigating the impact of their food choices. I am not having to police them, but the situation has changed to make me more comfortable. And I&#39;ve loosened up a bit which now feels safe for me to do, and also makes me a more relaxed, happy mom. Does it always end up this good? lol<br/>\n<br/>\nI know you guys know this, but it&#39;s still amazing to me: when we approach kids assuming intelligence, they respond intelligently, even when they&#39;re very little. I knew this when we went diaper-free from the start, but I guess there&#39;s so much cultural conditioning on various topics that it&#39;s hard to consistently approach everything that way, especially when our own parents modeled something different.<br/>\n<br/>\nI know this is the right path, seeing how empowered my kids are, and how incredibly happy they are. Thanks for helping this newbie sort through stuff!  Philosophically, I do wonder how I would have taken it if they just chose to ignore what I told them instead. Or maybe that doesn&#39;t happen when you have a healthy relationship with your kids.<br/>\n<br/>\nThanks again,<br/>\nSamantha</div>","specialLinks":[]},{"userId":4185092,"authorName":"cyberbreadbowl","from":"&quot;cyberbreadbowl&quot; &lt;jredwine@...&gt;","profile":"cyberbreadbowl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Yet another food question, but a little different","postDate":"1368300670","msgId":49812,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGttbTY5dSsyODNnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4M0M5RTIxOTdAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":49811,"nextInTopic":49836,"prevInTime":49811,"nextInTime":49813,"topicId":49807,"numMessagesInTopic":0,"msgSnippet":"Xylitol is also highly poisonous to dogs, so if you have a dog the xylitol must be kept away from your dogs (and if they tend to mooch off kids, then it might","messageBody":"<div id=\"ygrps-yiv-56365361\">Xylitol is also highly poisonous to dogs, so if you have a dog the xylitol must be kept away from your dogs (and if they tend to mooch off kids, then it might be a problem). <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Debra Rossing &lt;debra.rossing@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Just a caveat about xylitol (and any other -itol products): too much of it can cause digestive yuck (diarrhea and such) and for some people one lollipop is too much.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Yet another food question, but a little different","postDate":"1368201979","msgId":49811,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4M0M5RTIxOTdAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":49810,"nextInTopic":49812,"prevInTime":49810,"nextInTime":49812,"topicId":49807,"numMessagesInTopic":0,"msgSnippet":"Just a caveat about xylitol (and any other -itol products): too much of it can cause digestive yuck (diarrhea and such) and for some people one lollipop is too","messageBody":"<div id=\"ygrps-yiv-1271962523\">Just a caveat about xylitol (and any other -itol products): too much of it can cause digestive yuck (diarrhea and such) and for some people one lollipop is too much.<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":469007280,"authorName":"Jen Beeman","from":"Jen Beeman &lt;taxicrab@...&gt;","profile":"taxicrab87","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Yet another food question, but a little different","postDate":"1368136605","msgId":49810,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBUHVtWGE3NUx5Y2hGWjlfaV9vZkxOd3lyUWlVMkt2QjJ5WGZYVFhyYy1fWWdSTUIyZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49809,"nextInTopic":49811,"prevInTime":49809,"nextInTime":49811,"topicId":49807,"numMessagesInTopic":0,"msgSnippet":" On idea for this point is to keep a bunch of xylitol lollipops around. Xylitol is supposed to be good for dental","messageBody":"<div id=\"ygrps-yiv-737282633\">&lt;&lt;Sucking on lollipops daily is NOT good.&gt;&gt;<br/>\n<br/>\nOn idea for this point is to keep a bunch of xylitol lollipops around.<br/>\nXylitol is supposed to be good for dental health, combating the bacteria<br/>\nthat cause cavities. There are several different brands of xylitol based<br/>\n lollipops and candies and you can also buy xylitol crystals that looks<br/>\njust like sugar for baking and whatever else you usually use sugar for. It<br/>\nmay help ease your mind a bit while still letting him have as much &quot;sweet&quot;<br/>\nas he wants.<br/>\n<br/>\nJen<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Yet another food question, but a little different","postDate":"1368120173","msgId":49809,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGttZ20xZCtjdjVhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGttZjNvYysyYTBxQGVHcm91cHMuY29tPg=="},"prevInTopic":49808,"nextInTopic":49810,"prevInTime":49808,"nextInTime":49810,"topicId":49807,"numMessagesInTopic":0,"msgSnippet":"... ************* It s so tempting to blame sugar as The culprit, but there are a lot of factors which contribute to oral health and the remineralization","messageBody":"<div id=\"ygrps-yiv-458813862\">&quot;sbroo2&quot; &lt;samantha.nuttycombe@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;My son has weak enamel on his teeth, and at the ripe old age of 3 already has 2 cavities and we had to put a sealant on some other teeth. Sucking on lollipops daily is NOT good. <br/>\n </span></blockquote>*************<br/>\n<br/>\nIt&#39;s so tempting to blame sugar as The culprit, but there are a lot of factors which contribute to oral health and the remineralization cycle. If you want to grab onto food as something to control, it would be a good idea to look into that more deeply and see what you can add to your son&#39;s diet to support better digestive health. Adding options is also a good way to help your kid explore and learn more generally - when you take things away, kids learn negative things about relationships and power and their own bodies. Offer him interesting, exciting, fun things to learn by exploring the world of food. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;ve tried to talk to him about it, but he&#39;s only three and doesn&#39;t seem able to keep perspective.<br/>\n </span></blockquote>************<br/>\n<br/>\nYou&#39;re telling him things which aren&#39;t supported by his experience and don&#39;t make sense to him. That&#39;s going to undermine your credibility in his eyes.<br/>\n<br/>\nOn top of that, you&#39;re giving him a &quot;no&quot; without at &quot;yes&quot; - and that&#39;s hugely frustrating for anyone. Don&#39;t think of a purple elephant! Create a whole host of options and additions. If you&#39;re worried about sugar, offer him foods and drinks after he eats sweets which are going to re-balance the chemistry of his saliva (although with straight-up sugar, a glass of water will do as much as anything - it&#39;s real food that sticks to the teeth which causes the most problems as the saliva can&#39;t re-balance). If you&#39;re worried about digestive health overall, look for more fun alternatives to the foods he enjoys so he really can have his cake and eat it ;)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;She has noticed she gets an upset stomach after eating wheat-based cereals, and has requested other cereals, so I have hope, but she&#39;s still a total bread-lover.<br/>\n </span></blockquote>**************<br/>\n<br/>\nSo you&#39;ve seen that she&#39;s learning to identify foods which are problematic for her - that&#39;s great! She&#39;s already beaten out your fear that she&#39;ll spend decades eating foods which are hard on her.<br/>\n<br/>\nOne of the things that makes gluteny foods attractive is they leave a pleasant &quot;full&quot; feeling - so look for things to add to the offerings which also help her feel full. Fatty things are good for that, so look for bread like things made with more nuts and less of things like rice or quinoa - or get lots of nutty spreads (Nutella!!!) for sandwiches and toast.<br/>\n<br/>\nHave fun trying new things in the kitchen together - play around with making your own nut butters and spreads, for instance, or with making all sorts of fanciful desserts. Someone I know did a cupcake challenge where she made a new variety of wheat-free, low sugar cupcakes every week that her kids adored. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Yet another food question, but a little different","postDate":"1368093136","msgId":49808,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg5MTEwNzUwLTI1NEEtNDYzRC04NDRGLTA4NkIxREU1ODhFMUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGttZjNvYysyYTBxQGVHcm91cHMuY29tPg==","referencesHeader":"PGttZjNvYysyYTBxQGVHcm91cHMuY29tPg=="},"prevInTopic":49807,"nextInTopic":49809,"prevInTime":49807,"nextInTime":49809,"topicId":49807,"numMessagesInTopic":0,"msgSnippet":"... It will help not to think of it as self-disciplined. They re not denying themselves something they want. They re listening to their bodies and stopping","messageBody":"<div id=\"ygrps-yiv-97516820\">On May 8, 2013, at 11:04 PM, sbroo2 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; they are wayy more self-disciplined than I ever was at that age.<br/>\n<br/>\n </span></blockquote>It will help not to think of it as self-disciplined. They&#39;re not denying themselves something they want. They&#39;re listening to their bodies and stopping when they&#39;re done.<br/>\n<br/>\nThey&#39;re making choices. :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The problem is the incessant prodding from stores, banks, friends,<br/>\n&gt; coaches to eat more and more sweets and add sugar to otherwise decent foods.<br/>\n<br/>\n </span></blockquote>You&#39;re hyper conscious of the sugar so it&#39;s seeming larger than it is. Incessant means never ceasing. How many times does it happen a day? Is it happening right now?<br/>\n<br/>\nKids bodies need fast energy because they have high energy needs and small stomachs. Sugars and carbs fill that bill. They&#39;re listening to their bodies when they choose quick energy foods. Make or buy nutritionally dense sweet foods that are as easy to grab and tasty *to them* available so they have choices. Try monkey platters so they have a variety to choose from:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/monkeyplatters/\">http://sandradodd.com/monkeyplatters/</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My son has weak enamel on his teeth, and at the ripe old<br/>\n&gt; age of 3 already has 2 cavities and we had to put a sealant<br/>\n&gt; on some other teeth. Sucking on lollipops daily is NOT good.<br/>\n<br/>\n </span></blockquote>Sugar dissolves with saliva rather quickly. Food that sticks to the teeth like raisins are worse. Keep a bottle of water with you. Offer it to him after he has candy. Don&#39;t make it a requirement or you&#39;ll attach negative feelings to the water :-/ Suggest it can help wash away the sugar that causes cavities. Information for them to turn over and use when they feel it&#39;s important is way better in the long run than rules and force.<br/>\n<br/>\nHis teeth are because of genetics. Mothers have said they did everything right and their kids still got cavities. So you&#39;re surrounding him with negative energy every time he has sweets for what may not have any impact.<br/>\n<br/>\nHere:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com\">http://joyfullyrejoycing.com</a><br/>\n<br/>\non the right is Brushing Teeth. There are lots of ideas about keeping teeth healthy.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She has noticed she gets an upset stomach after eating wheat-based<br/>\n&gt; cereals, and has requested other cereals, so I have hope, but she&#39;s still a total bread-lover.<br/>\n<br/>\n </span></blockquote>If you allow her listen to her body, she&#39;ll listen to her body :-)<br/>\n<br/>\nHer young body needs the carbs. Give her choices like breads made from other flours. Not as something better, or something she should like, but so she has choices. Let her know they don&#39;t have gluten or wheat or whatever might be triggering a stomach ache. Let her explore.<br/>\n<br/>\nKeep in the forefront of you mind that you might be wrong. It might be something else. It might be coincidence. The more choice and freedom and support you give her, the easier it will be for her to figure out what&#39;s right for her.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":254073704,"authorName":"sbroo2","from":"&quot;sbroo2&quot; &lt;samantha.nuttycombe@...&gt;","profile":"sbroo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Yet another food question, but a little different","postDate":"1368068684","msgId":49807,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGttZjNvYysyYTBxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":49808,"prevInTime":49806,"nextInTime":49808,"topicId":49807,"numMessagesInTopic":0,"msgSnippet":"Hello! We re new to the unschooling world, and relieved to find it. This forum is great- I see I have much reading to do! My husband and I instinctively agree","messageBody":"<div id=\"ygrps-yiv-1366551715\">Hello! We&#39;re new to the unschooling world, and relieved to find it. This forum is great- I see I have much reading to do! <br/>\n<br/>\nMy husband and I instinctively agree with the lifestyle, respect, and natural approach to life, and our two children (almost 4 and 6) are quite happy with things, however, we are having a hard time taking one of these ideas from theoretical into reality. <br/>\n<br/>\nI understand the argument for letting kids regulate their food intake. For a couple years, I have not interfered with my kids&#39; management of their holiday candies, for example, and let them store them where they can get to them whenever they want, and I don&#39;t enforce a limit on quantity or timing for consumption. For the most part, it works just fine- they are wayy more self-disciplined than I ever was at that age. The problem is the incessant prodding from stores, banks, friends, coaches to eat more and more sweets and add sugar to otherwise decent foods. My son has weak enamel on his teeth, and at the ripe old age of 3 already has 2 cavities and we had to put a sealant on some other teeth. Sucking on lollipops daily is NOT good. I&#39;ve tried to talk to him about it, but he&#39;s only three and doesn&#39;t seem able to keep perspective. I feel like I need to intervene some here and would love input.<br/>\n<br/>\nSecondly, I have bad wheat and grain reactions, and suspect my daughter has the same. I don&#39;t want her to reach the same point as me, with neurological reactions, and that can be avoided if her gut doesn&#39;t get damaged as a child. When there are health concerns, how do you broach that with small kids (5) in a way that doesn&#39;t make them feel put-upon, or like they are missing out? She gets these bags under her eyes and is lower energy when she eats all the breads, pastas, and cereals she loves. She will eat these things all day every day, and nothing else- we&#39;ve let her for short periods, and then discussed the constipation that resulted, so she&#39;ll eat a bit of veggie/smoothie/fruit, too. She has noticed she gets an upset stomach after eating wheat-based cereals, and has requested other cereals, so I have hope, but she&#39;s still a total bread-lover.<br/>\n<br/>\nSo the theme here is, health is being compromised, and I feel it&#39;s my job to look out for their long-term health, even in the face of wanting them to get to learn to self-regulate. How do I do that, without them feeling deprived? Any suggestions?<br/>\n<br/>\nThank you all,<br/>\nSamantha</div>","specialLinks":[]}],"prevTopicId":12006,"nextTopicId":49840}}