{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":181212675,"authorName":"Mindy Evans","from":"Mindy Evans &lt;mindyevans@...&gt;","profile":"sethnmommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:Another sleep post","postDate":"1166457977","msgId":19887,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYxMjE4MTYwNjE3LjQ5NTM0LnFtYWlsQHdlYjgxMDEzLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":19859,"nextInTopic":0,"prevInTime":19886,"nextInTime":19888,"topicId":19853,"numMessagesInTopic":0,"msgSnippet":"My son is almost 6 and he is exactly the same. I have always been a night owl so the late nights made sense to me, but when he was not napping and only","messageBody":"<div id=\"ygrps-yiv-1856394121\">My son is almost 6 and he is exactly the same. I have always been a night owl so the late nights made sense to me, but when he was not napping and only sleeping 9 hours a night, I was freaking out about him sleeping. I have come to realize though that my husband sleeps an average of 5 to 6 hours a night. He has always been that way. I can&#39;t grasp that because I am a 12 hour a day person if you let me! He doesn&#39;t actually &quot;sleep&quot; until around 1030-1100, and gets up around 730. <br/>\n  When he was little, he would not go to bed until like 2 in the morning, (but would sleep until 1000) despite my best efforts. I just started laying down with him around 1100 and making him stay in his room until whenever it was he fell asleep. Sometimes he would get up and play with his toys while I slept, which was fine as long as the door was locked and he couldn&#39;t get out. Now that has paid off as like I said he is sleepy around 1000. <br/>\n  About 7-8 at night EVERY NIGHT, he has this wind up hour where he is basically a little nut ball. He runs around in circles, does gymnastics in the living room, rolls around the floor, etc. He is just a little ball of energy. Then he crashes at like 9 and is mellow again. He gets plenty of exercise during the day, (we walk about a mile a day).<br/>\n  After many years of trying to figure it out, I had to just accept that this is his being. We all have rhythms, and I think the more you try to fight it the worse off you are. <br/>\n  My best advice is to get your rest when you need it, lock him in his room with you in there, turn on the tv (during the day if you need a nap since you are pregnant, not at night though) and sleep. He will learn to play on his own. <br/>\n  Worrying was the biggest thing I had to give up and I still do that so be encouraged, your child will figure out his needs. Baby whispers, well, never worked on my son and he is just fine!!!<br/>\n   <br/>\n<br/>\n<br/>\nGod Bless You and yours <br/>\nMindy Evans <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mindyevans@...\">mindyevans@...</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Another sleep post","postDate":"1166385000","msgId":19859,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWEwMWM3MjIxNCQ4OTk0ODIxMCRmYzY4OTA0NUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":19853,"nextInTopic":19887,"prevInTime":19858,"nextInTime":19860,"topicId":19853,"numMessagesInTopic":0,"msgSnippet":"***Does anyone else have any similar stories? *** Dylan was not a napper.  Naps made him cranky because he thought he was missing something while asleep.  He","messageBody":"<div id=\"ygrps-yiv-889546065\">***Does anyone else have any similar stories? ***<br/>\n<br/>\nDylan was not a napper.  Naps made him cranky because he thought he was <br/>\nmissing something while asleep.  He still does not like to sleep, though <br/>\nright now he&#39;s sleeping about nine hours a night.  He still thinks it&#39;s a <br/>\nwaste of time. &lt;g&gt;<br/>\n<br/>\nIn the evenings I used to quiet the house.   I&#39;d turn down the lights, turn <br/>\ndown the volume on the TV if it was on.  I&#39;d turn the heat up a little, put <br/>\nmy pj&#39;s on and get cozy on the sofa with a blanket.   Lots of times Dylan <br/>\nwould join me.  Sometimes he&#39;d fall asleep.  Sometimes David (dh) would go <br/>\nto bed and invite Dylan to join him for a story.  Sometimes Dylan would fall <br/>\nasleep, sometimes not, but we would make his environment sleep friendly. &lt;g&gt;<br/>\n<br/>\nDylan had a little tent in the living room and I would make a nest in there <br/>\nwith blankets and pillows and he would wiggle in there and sometimes fall <br/>\nasleep.<br/>\n<br/>\nYou said you&#39;re pregnant, are you maybe doing fewer energy burning <br/>\nactivities with your little guy during the day?   That might account for his <br/>\nabundance of energy at night.   If you could get to the park to play and run <br/>\nit might help to make him more ready for sleep in the evenings.   Maybe hard <br/>\non you though, if you&#39;re way pregnant. &lt;g&gt;<br/>\n<br/>\nIs there a young person in your neighborhood who might come and play with <br/>\nyour son, in your house, for an hour or so in the afternoon so you could <br/>\nnap?   You&#39;d be right there if you were needed but he&#39;d be busy and safe. <br/>\n(Sometimes two year olds just want mom, though. &lt;g&gt;)<br/>\n<br/>\nMy son is fourteen.  He sleeps when he&#39;s tired and he sleeps almost every <br/>\nnight. &lt;g&gt;  He has never been happy about needing to sleep but he learned <br/>\nwhat his body was capable of and when he needs sleep, he sleeps.    He did <br/>\nnot nap as a toddler, not since he was about fourteen months old.  He had <br/>\nsome late nights and some times of feeling cranky because he didn&#39;t have <br/>\nenough sleep, but here he is, a big kid who sleeps anyway! &lt;g&gt;<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":210732740,"authorName":"Carrie","from":"&quot;Carrie&quot; &lt;cyandell@...&gt;","profile":"carrieyandell","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Another sleep post","postDate":"1166373859","msgId":19853,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVtM3M1MytsMjFhQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":19859,"prevInTime":19852,"nextInTime":19854,"topicId":19853,"numMessagesInTopic":0,"msgSnippet":"Hi all, After the resounding success of implementing the suggestions from my last diaper problem post, I have another lifestyle question.. this time","messageBody":"<div id=\"ygrps-yiv-959560222\">Hi all, <br/>\n<br/>\nAfter the resounding success of implementing the suggestions from my<br/>\nlast diaper problem post, I have another &quot;lifestyle&quot; question.. this<br/>\ntime involving sleep. Once again I need a new perspective, new points<br/>\nof view, or someone to just reassure me that I am not being a terrible<br/>\nparent. I did troll the archives but haven&#39;t found exactly what I&#39;m<br/>\nlooking for.<br/>\n<br/>\nMy son, Nathan, turned 2 in October. Since he was 4 months old it&#39;s<br/>\nbeen very obvious when he was tired -- yawning, rubbing eyes, etc. He<br/>\nwas ready for bed around 7pm, which considering my husband and I are<br/>\nnight owls was a bit of a shock for us.<br/>\n<br/>\nWell, since around September, Nathan has decided he&#39;s no longer into<br/>\nsleeping. I&#39;ve read many of the posts here about respecting and<br/>\ntrusting your children and I&#39;m trying to do that. He simultaneously<br/>\nstarted dropping naps and staying up very late. I can understand<br/>\ndropping naps, I know that happens eventually. I can understand<br/>\nwanting to stay up with us, that seems only natural.<br/>\n<br/>\nWhat mystifies me is how he keeps going. He&#39;s like the energizer<br/>\nbunny. All sleepy signals are GONE. It can be midnight and I&#39;m yawning<br/>\nand fighting to stay up myself, and he&#39;s just go go go. It was like a<br/>\nswitch went off and he&#39;s just no longer tired. I do try and make it to<br/>\nbed myself around 10 and he&#39;ll come with me (I&#39;m pregnant and need the<br/>\nsleep what with no naps!). But often we just don&#39;t make it until midnight.<br/>\n<br/>\nI am concerned that he&#39;s becoming utterly exhausted though. A few<br/>\ntimes a week now he&#39;ll fall asleep during dinner, literally, in his<br/>\nfood. He&#39;ll sleep for a few hours and then won&#39;t want to go to bed, of<br/>\ncourse. He&#39;s started sleeping in later, which is fine, unless we have<br/>\nsomething planned and then of course I get irritated and he&#39;s a bear<br/>\nto wake up. Things are better if he falls asleep in the car on the way<br/>\nhome, even if briefly. Then he&#39;s able to stay up until bedtime.<br/>\n<br/>\nHe gets maybe 8 sometimes 9 or 10 hours of sleep a night, and that&#39;s<br/>\npretty much it. I know that since I&#39;ve read &quot;the books&quot; that there are<br/>\nalarm bells going off in my head because that&#39;s not &quot;normal&quot;. I&#39;m not<br/>\noverly concerned about following normality, but I do worry that he&#39;s<br/>\ngetting chronically tired. He gets grouchier throughout the afternoon<br/>\nand evening, and if he sleeps in the evening he doesn&#39;t sleep as well<br/>\nat night. It&#39;s impossible to keep him up though.<br/>\n<br/>\nI&#39;ve asked several people about this and of course the advice I get is<br/>\njust to put him to bed earlier. This seems wrong to me -- he&#39;s not<br/>\nacting tired. I can&#39;t force him to sleep. He does come by it honestly<br/>\n-- both DH and I have trouble sleeping and are night owls too. So many<br/>\npeople are telling us this is unhealthy, that it will stunt his<br/>\ngrowth, etc.<br/>\n<br/>\nI guess I&#39;m just worried that he&#39;s not getting enough sleep. I&#39;m<br/>\nconfident this will work itself out in time, but it is a struggle now.<br/>\n Does anyone else have any similar stories? Anyone else have a child<br/>\nwho switched sleeping habits like this? I&#39;m not harming him by<br/>\nfacilitating his staying up late, am I? I guess I thought we wouldn&#39;t<br/>\nlose BOTH naps and bedtime at the same time! :)<br/>\n<br/>\nThanks for listening,<br/>\nCarrie Yandell</div>","specialLinks":[]}],"prevTopicId":19748,"nextTopicId":19870}}