{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Distracted...","postDate":"1350518626","msgId":49170,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs1bmgxMit1MnJyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBRC1uRnR2OFlQVUZveXJ4eldOTFJ6Tnh2eFFZckItdEpuckZDamVQaW8wTi1XYzMxZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49167,"nextInTopic":0,"prevInTime":49169,"nextInTime":49172,"topicId":49161,"numMessagesInTopic":0,"msgSnippet":"... If she s content, don t push your anxiety or insecurity or whatever off on her. She s happy with the way she swims and the kind of fun she s having in the","messageBody":"<div id=\"ygrps-yiv-223439676\">Jennifer Zone-Villasenor &lt;securepleasantlotps16@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I guess my concern is that she is<br/>\n&gt; watching her friends move up and she is not.  Apparently, she is content<br/>\n&gt; with that and I should let it go.<br/>\n<br/>\n </span></blockquote>If she&#39;s content, don&#39;t push your anxiety or insecurity or whatever off on her. She&#39;s happy with the way she swims and the kind of fun she&#39;s having in the pool - how wonderful! There are adults taking classes to learn to be content with themselves the way they are. Cherish and nurture that in your daughter now. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;this is where I am not sure.  How can a 7 year old<br/>\n&gt; determine if something is worth it?<br/>\n<br/>\n </span></blockquote>Trying seeing that from another angle: how can one person determine for another if something is worth it? At best, you can make educated guesses about what your kid will enjoy and then support their choices whether or not you&#39;re right. <br/>\n<br/>\nIt&#39;s not uncommon for 7yos to drop things easily. It&#39;s also not uncommon for 11yo unschoolers to push themselves to do things they find very difficult. There&#39;s a bit of development involved and a bit of personality, but it&#39;s a story I hear/read over and over from other radical unschoolers: my kid is working sooooo hard to do this thing. Often it starts with video games! Sometimes it starts with a kid suddenly being developmentally ready to read and going from zero to fluent over the course of one book. Sometimes it starts with skateboarding, or animation, or drawing. I&#39;ve seen my daughter (11) burst into tears over a drawing which isn&#39;t coming out the way she wants it only to go back and work on it more an hour later. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Distracted...","postDate":"1350499899","msgId":49167,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVFMjExMjEyLThDRkUtNDNFNi04RDMzLTk5NDkzNjIzNTZEN0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PENBRC1uRnR2OFlQVUZveXJ4eldOTFJ6Tnh2eFFZckItdEpuckZDamVQaW8wTi1XYzMxZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGs1bGxjZyt1Y2ptQGVHcm91cHMuY29tPiA8NTEyMUUyMDQtQTNGMi00NTRGLTlBMjQtMjMyRkZDMjU4MzU3QHZlcml6b24ubmV0PiA8Q0FELW5GdHY4WVBVRm95cnh6V05MUnpOeHZ4UVlyQi10Sm5yRkNqZVBpbzBOLVdjMzFnQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":49166,"nextInTopic":49170,"prevInTime":49166,"nextInTime":49168,"topicId":49161,"numMessagesInTopic":0,"msgSnippet":"... If the journey is one of discovery, the destination is little more than a signal it s time for a new journey. :-) There s way too much emphasis on the","messageBody":"<div id=\"ygrps-yiv-1672302518\">On Oct 17, 2012, at 1:23 PM, Jennifer Zone-Villasenor wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I totally get that sometimes the journey is so not worth the destination.<br/>\n<br/>\n </span></blockquote>If the journey is one of discovery, the destination is little more than a signal it&#39;s time for a new journey. :-)<br/>\n<br/>\nThere&#39;s way too much emphasis on the destination, especially with children. It&#39;s all about getting the final course grade, getting the degree, getting the great job. It&#39;s like childhood is something to pass through as quickly as possible to get to the &quot;good stuff&quot;. But how many people who&#39;ve been rushed through childhood have found that adulthood really is the good stuff? How many are wondering when the good stuff comes?<br/>\n<br/>\nAnd the destination isn&#39;t all that important for adults either. If The End is important, what&#39;s the point of all the pages of a book, all the minutes of a movie between the beginning and end ;-)<br/>\n<br/>\nThere&#39;s a thread on Facebook in the Radical Unschooling Info group about a trip to Europe. While the journey -- the flight -- does tend to be more something to be endured, my husband, daughter and I have discovered that rushing to see the important sites in a city -- destinations in most people&#39;s minds -- makes us enjoy the sites less and really not enjoy the getting there. What we&#39;ve found we enjoy is visiting 1 important thing in a city but then spend the rest of the day wandering. And what we discover on our wanderings is what we remember the most from our trips.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But, if I don&#39;t experience the destination, then how can I appreciate the<br/>\n&gt; journey?<br/>\n<br/>\n </span></blockquote>Occasionally someone will miss out on something great because they don&#39;t want the journey.<br/>\n<br/>\nBut there&#39;s far greater damage done to relationships, to people&#39;s confidence in their ability to choose when someone overrides their decision. They are in essence saying &quot;Your ability to make decisions isn&#39;t very good. Mine&#39;s better. Trust me. Don&#39;t trust yourself.&quot;<br/>\n<br/>\nWhen kids are young, their ability *isn&#39;t* as good as an adult&#39;s. But they get better at choosing by experiencing their choices. They learn more from less stellar choices than they do by &quot;right&quot; choices. And a parent short-circuits that learning by focusing on the destination -- the &quot;right&quot; choice -- being what&#39;s important. What&#39;s important is discovery.<br/>\n<br/>\nWhat&#39;s important for unschooling is creating a safe environment for kids to choose in. Don&#39;t stand back while they make hurtful choices, or choices that destroy things. Create an environment where they can explore choices. Step in when they&#39;re about to do something destructive. But see the exploring as what&#39;s most important in who they are and who they&#39;ll become.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; For instance, we just flew to Hawaii. I was terrified b/c I H A<br/>\n&gt; T E to fly. I was extremely scared, frightened, unnerved, etc...but when<br/>\n&gt; I got to paradise, I was in awe at how close I came to missing out on such<br/>\n&gt; a beautiful place. I suppose it could be argued that it was my decision<br/>\n&gt; and so I went for it. But I&#39;m almost 40.<br/>\n<br/>\n </span></blockquote>And if someone had pushed you? And the weather had been unexpectedly bad, you had picked up some intestinal bug the first day, or you just hadn&#39;t enjoyed it? What then?<br/>\n<br/>\nFear is not a great basis for decision making.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Now, don&#39;t get me wrong, I get the concept of unschooling and agree with a<br/>\n&gt; ton of it...but this is where I am not sure. How can a 7 year old<br/>\n&gt; determine if something is worth it?<br/>\n<br/>\n </span></blockquote>She doesn&#39;t know. But each time she makes a choice she learns more about herself and about how the world works. *That&#39;s* far more valuable than the experiences she might miss out on.<br/>\n<br/>\n*If* something big comes up and you, with your greater knowledge of the world, are absolutely certain she&#39;ll enjoy it, play a &quot;mom card&quot; and tell her to trust you.<br/>\n<br/>\nBut you only get a handful of &quot;mom cards&quot; to play throughout her childhood. If you push and the experience is a dud, the less she&#39;ll trust your judgement, the less she&#39;ll trust you understand her. Your success rate will need to be *much* higher than your failure rate. <br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Distracted...","postDate":"1350498292","msgId":49166,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTA0OTgyOTIuMjQ0MzcuWWFob29NYWlsTmVvQHdlYjgxNTAyLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PENBRC1uRnR2OFlQVUZveXJ4eldOTFJ6Tnh2eFFZckItdEpuckZDamVQaW8wTi1XYzMxZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGs1bGxjZyt1Y2ptQGVHcm91cHMuY29tPiA8NTEyMUUyMDQtQTNGMi00NTRGLTlBMjQtMjMyRkZDMjU4MzU3QHZlcml6b24ubmV0PiA8Q0FELW5GdHY4WVBVRm95cnh6V05MUnpOeHZ4UVlyQi10Sm5yRkNqZVBpbzBOLVdjMzFnQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":49165,"nextInTopic":49167,"prevInTime":49165,"nextInTime":49167,"topicId":49161,"numMessagesInTopic":0,"msgSnippet":"If she is happy where she is then I do not understand what the problem is? Does she want to be  training for competition? I go to my local health club indoor","messageBody":"<div id=\"ygrps-yiv-1419645297\">If she is happy where she is then I do not understand what the problem is?<br/>\nDoes she want to be  training for competition?<br/>\nI go to my local health club indoor pool   here in town and it is heated. No need to<br/>\nbe part of anything .<br/>\nIf your daughter likes it and is happy  then that is all that matters right?<br/>\nThe issue is not her really but it is you. You see her as distracted and not a go getter.<br/>\nShe may be  the happy person that stop to smell the roses or look around and enjoy life!!!<br/>\nMaybe you can learn that with her :)<br/>\n <br/>\nAlex Polikowsky<br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n________________________________<br/>\n From: Jennifer Zone-Villasenor &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:securepleasantlotps16@...\">securepleasantlotps16@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSent: Wednesday, October 17, 2012 12:23 PM<br/>\nSubject: Re: [unschoolingbasics] Distracted...<br/>\n <br/>\n<br/>\n  <br/>\nShe is not taking swimming lessons. She already knows how to swim.  We<br/>\nspent almost everyday at the pool this summer and then some.  The weather<br/>\nis warm here in So Cal, but the pool is not heated.  She is part of a swim<br/>\nclub that is training kids to compete in meets.  She is not interested<br/>\ncompeting, which is fine.  The pool there is heated, so we are taking<br/>\nadvantage of that.  The coaches are not pushy either, so they are not upset<br/>\nthat she is not moving up the ranks.  I guess my concern is that she is<br/>\nwatching her friends move up and she is not.  Apparently, she is content<br/>\nwith that and I should let it go.<br/>\n<br/>\nI totally get that sometimes the journey is so not worth the destination.<br/>\nBut, if I don&#39;t experience the destination, then how can I appreciate the<br/>\njourney?  For instance, we just flew to Hawaii.  I was terrified b/c I H A<br/>\nT E  to fly.  I was extremely scared, frightened, unnerved, etc...but when<br/>\nI got to paradise, I was in awe at how close I came to missing out on such<br/>\na beautiful place.  I suppose it could be argued that it was my decision<br/>\nand so I went for it.  But I&#39;m almost 40.<br/>\n<br/>\nNow, don&#39;t get me wrong, I get the concept of unschooling and agree with a<br/>\nton of it...but this is where I am not sure.  How can a 7 year old<br/>\ndetermine if something is worth it?<br/>\n<br/>\nI suppose I need to, as you said, trust her interests and her journey...<br/>\n<br/>\nThank you.  I am so grateful for this group.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Oct 17, 2012 at 3:16 AM, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On Oct 17, 2012, at 3:05 AM, securepleasantlot16 wrote:<br/>\n&gt;<br/>\n&gt; &gt; Is this something to be concerned about or will she do what she needs to<br/>\n&gt; do when she wants to do it?<br/>\n&gt;<br/>\n&gt; Yes.<br/>\n&gt;<br/>\n&gt; Let go of your time schedule and let her own naturally play out.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; she finds everything and anything to not do what she needs<br/>\n&gt; &gt; to do...even though it&#39;s what she wants to do...<br/>\n&gt;<br/>\n&gt; Wanting the end result isn&#39;t the same as wanting the journey to get there.<br/>\n&gt;<br/>\n&gt; There are several skills I&#39;d like to have -- like playing guitar, speaking<br/>\n&gt; Japanese -- that I don&#39;t get enough enjoyment out of playing around with in<br/>\n&gt; order to get better at them.<br/>\n&gt;<br/>\n&gt; There are loads of skills I&#39;ve gotten better at -- like writing, drawing,<br/>\n&gt; sewing, knitting, cooking, skiing, swimming -- because I enjoy the skill<br/>\n&gt; enough at whatever level I&#39;m at and enjoy the challenges I set for myself.<br/>\n&gt; It&#39;s the process I enjoy. Getting better as I enjoy using it keeps it<br/>\n&gt; challenging and interesting.<br/>\n&gt;<br/>\n&gt; While she&#39;s struggling with something that doesn&#39;t interest her, she&#39;s not<br/>\n&gt; doing something else that does interest her and that will increase her<br/>\n&gt; skill as a side effect of being engaged. Just because something&#39;s hard<br/>\n&gt; doesn&#39;t make it better! A challenge that someone is enjoying is 100 times<br/>\n&gt; better than hard.<br/>\n&gt;<br/>\n&gt; Trust her interest.<br/>\n&gt;<br/>\n&gt; &gt; she isn&#39;t getting better because she will swIm a few strokes stop,<br/>\n&gt; &gt; take a look around then duck back into the water<br/>\n&gt;<br/>\n&gt; Do you take her to the pool often enough that she can learn to swim by<br/>\n&gt; playing and trying things and challenging herself? It&#39;s how humans learn<br/>\n&gt; best. Swimming lessons are for parents who won&#39;t take their kids swimming<br/>\n&gt; often enough ;-) and for those worried about what other parents say.<br/>\n&gt;<br/>\n&gt; I don&#39;t think I went to the pool that often as a kid. Maybe once or twice<br/>\n&gt; on the weekends. But I learned to swim just fine by playing with family and<br/>\n&gt; friends.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; when it comes to reading, something she does show some interest<br/>\n&gt; &gt; in, as soon as it gets hard, she finds everything and anything to not<br/>\n&gt; &gt; do what she needs to do<br/>\n&gt;<br/>\n&gt; Despite the message from schools, reading isn&#39;t a skill that can be taught<br/>\n&gt; or acquired by practice UNLESS someone is developmentally ready. And if<br/>\n&gt; they&#39;re developmentally ready then they don&#39;t need taught or to practice!<br/>\n&gt; :-) All they need do is read.<br/>\n&gt;<br/>\n&gt; Reading is like walking. Kids are being tortured in school by reading<br/>\n&gt; lessons when they don&#39;t have the ability to process the written word yet,<br/>\n&gt; just as it would be torture -- and a waste of time -- to give kids walking<br/>\n&gt; lessons before they can walk. Kids need the freedom to move their bodies<br/>\n&gt; freely in order to walk when they&#39;re developmentally ready. Just as kids<br/>\n&gt; need the freedom to absorb print that&#39;s meaningful and fun *to them* --<br/>\n&gt; which will happen naturally in a home where people enjoy reading for<br/>\n&gt; pleasure or information -- in order read when they&#39;re developmentally ready.<br/>\n&gt;<br/>\n&gt; The reason teachers and parents believe reading lessons are necessary is<br/>\n&gt; that they&#39;re giving reading lessons as kids&#39; brains are developing. So by<br/>\n&gt; the time kids are developmentally able to read it *seems* like the reading<br/>\n&gt; lessons caused their ability to read. But since all unschooling kids learn<br/>\n&gt; without instruction, it&#39;s obviously not true. Growing up interacting with<br/>\n&gt; print in a print rich environment is what allows people to figure out<br/>\n&gt; reading.<br/>\n&gt;<br/>\n&gt; Trust her interest and her journey. She&#39;ll get where *she* needs to go.<br/>\n&gt; Which won&#39;t necessarily be where you think she should or needs to go.<br/>\n&gt;<br/>\n&gt; Joyce<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":482623530,"authorName":"Lesley Cross","from":"Lesley Cross &lt;lesleycross@...&gt;","profile":"decldc1992","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Distracted...","postDate":"1350497609","msgId":49165,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVDMUU3RTQwLUQ1OUQtNEY4Ny1CNjIxLUNCRjVCNUM3MjQxMkBhdHQubmV0Pg==","inReplyToHeader":"PENBRC1uRnR2OFlQVUZveXJ4eldOTFJ6Tnh2eFFZckItdEpuckZDamVQaW8wTi1XYzMxZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGs1bGxjZyt1Y2ptQGVHcm91cHMuY29tPiA8NTEyMUUyMDQtQTNGMi00NTRGLTlBMjQtMjMyRkZDMjU4MzU3QHZlcml6b24ubmV0PiA8Q0FELW5GdHY4WVBVRm95cnh6V05MUnpOeHZ4UVlyQi10Sm5yRkNqZVBpbzBOLVdjMzFnQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":49164,"nextInTopic":49166,"prevInTime":49164,"nextInTime":49166,"topicId":49161,"numMessagesInTopic":0,"msgSnippet":" I suppose it could be argued that it was my decision and so I went for it. But I m almost 40. Now, don t get me wrong, I get the concept of unschooling and","messageBody":"<div id=\"ygrps-yiv-906492815\">&quot; I suppose it could be argued that it was my decision<br/>\nand so I went for it. But I&#39;m almost 40.<br/>\n<br/>\nNow, don&#39;t get me wrong, I get the concept of unschooling and agree with a<br/>\nton of it...but this is where I am not sure. How can a 7 year old<br/>\ndetermine if something is worth it?&quot;<br/>\n<br/>\nAre you perhaps confusing age with being a complete person?  Or confusing the cognitive ability to weigh abstract concepts with an ability to make decisions for oneself?  A 7yo allowed to make her own decisions will make them and learn from them...though not necessarily from the same level of cognitive development and adult would.  Many adults pay good money to learn how to make decisions like a 7yo.... to simply sink into their bodies and who they are and choose from the best feeling place.  And they seem to find that they make *better* decisions this way, vs. weighing pros and cons and making a decision based only on thoughts.  <br/>\n<br/>\nLesley <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://euphorialifedesignstudio.com\">http://euphorialifedesignstudio.com</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":533592018,"authorName":"Jennifer Zone-Villasenor","from":"Jennifer Zone-Villasenor &lt;securepleasantlotps16@...&gt;","profile":"securepleasantlot16","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Distracted...","postDate":"1350494602","msgId":49164,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRC1uRnR2OFlQVUZveXJ4eldOTFJ6Tnh2eFFZckItdEpuckZDamVQaW8wTi1XYzMxZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDUxMjFFMjA0LUEzRjItNDU0Ri05QTI0LTIzMkZGQzI1ODM1N0B2ZXJpem9uLm5ldD4=","referencesHeader":"PGs1bGxjZyt1Y2ptQGVHcm91cHMuY29tPgk8NTEyMUUyMDQtQTNGMi00NTRGLTlBMjQtMjMyRkZDMjU4MzU3QHZlcml6b24ubmV0Pg=="},"prevInTopic":49162,"nextInTopic":49165,"prevInTime":49163,"nextInTime":49165,"topicId":49161,"numMessagesInTopic":0,"msgSnippet":"She is not taking swimming lessons. She already knows how to swim.  We spent almost everyday at the pool this summer and then some.  The weather is warm here","messageBody":"<div id=\"ygrps-yiv-286572716\">She is not taking swimming lessons. She already knows how to swim.  We<br/>\nspent almost everyday at the pool this summer and then some.  The weather<br/>\nis warm here in So Cal, but the pool is not heated.  She is part of a swim<br/>\nclub that is training kids to compete in meets.  She is not interested<br/>\ncompeting, which is fine.  The pool there is heated, so we are taking<br/>\nadvantage of that.  The coaches are not pushy either, so they are not upset<br/>\nthat she is not moving up the ranks.  I guess my concern is that she is<br/>\nwatching her friends move up and she is not.  Apparently, she is content<br/>\nwith that and I should let it go.<br/>\n<br/>\nI totally get that sometimes the journey is so not worth the destination.<br/>\nBut, if I don&#39;t experience the destination, then how can I appreciate the<br/>\njourney?  For instance, we just flew to Hawaii.  I was terrified b/c I H A<br/>\nT E  to fly.  I was extremely scared, frightened, unnerved, etc...but when<br/>\nI got to paradise, I was in awe at how close I came to missing out on such<br/>\na beautiful place.  I suppose it could be argued that it was my decision<br/>\nand so I went for it.  But I&#39;m almost 40.<br/>\n<br/>\nNow, don&#39;t get me wrong, I get the concept of unschooling and agree with a<br/>\nton of it...but this is where I am not sure.  How can a 7 year old<br/>\ndetermine if something is worth it?<br/>\n<br/>\nI suppose I need to, as you said, trust her interests and her journey...<br/>\n<br/>\nThank you.  I am so grateful for this group.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Oct 17, 2012 at 3:16 AM, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On Oct 17, 2012, at 3:05 AM, securepleasantlot16 wrote:<br/>\n&gt;<br/>\n&gt; &gt; Is this something to be concerned about or will she do what she needs to<br/>\n&gt; do when she wants to do it?<br/>\n&gt;<br/>\n&gt; Yes.<br/>\n&gt;<br/>\n&gt; Let go of your time schedule and let her own naturally play out.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; she finds everything and anything to not do what she needs<br/>\n&gt; &gt; to do...even though it&#39;s what she wants to do...<br/>\n&gt;<br/>\n&gt; Wanting the end result isn&#39;t the same as wanting the journey to get there.<br/>\n&gt;<br/>\n&gt; There are several skills I&#39;d like to have -- like playing guitar, speaking<br/>\n&gt; Japanese -- that I don&#39;t get enough enjoyment out of playing around with in<br/>\n&gt; order to get better at them.<br/>\n&gt;<br/>\n&gt; There are loads of skills I&#39;ve gotten better at -- like writing, drawing,<br/>\n&gt; sewing, knitting, cooking, skiing, swimming -- because I enjoy the skill<br/>\n&gt; enough at whatever level I&#39;m at and enjoy the challenges I set for myself.<br/>\n&gt; It&#39;s the process I enjoy. Getting better as I enjoy using it keeps it<br/>\n&gt; challenging and interesting.<br/>\n&gt;<br/>\n&gt; While she&#39;s struggling with something that doesn&#39;t interest her, she&#39;s not<br/>\n&gt; doing something else that does interest her and that will increase her<br/>\n&gt; skill as a side effect of being engaged. Just because something&#39;s hard<br/>\n&gt; doesn&#39;t make it better! A challenge that someone is enjoying is 100 times<br/>\n&gt; better than hard.<br/>\n&gt;<br/>\n&gt; Trust her interest.<br/>\n&gt;<br/>\n&gt; &gt; she isn&#39;t getting better because she will swIm a few strokes stop,<br/>\n&gt; &gt; take a look around then duck back into the water<br/>\n&gt;<br/>\n&gt; Do you take her to the pool often enough that she can learn to swim by<br/>\n&gt; playing and trying things and challenging herself? It&#39;s how humans learn<br/>\n&gt; best. Swimming lessons are for parents who won&#39;t take their kids swimming<br/>\n&gt; often enough ;-) and for those worried about what other parents say.<br/>\n&gt;<br/>\n&gt; I don&#39;t think I went to the pool that often as a kid. Maybe once or twice<br/>\n&gt; on the weekends. But I learned to swim just fine by playing with family and<br/>\n&gt; friends.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; when it comes to reading, something she does show some interest<br/>\n&gt; &gt; in, as soon as it gets hard, she finds everything and anything to not<br/>\n&gt; &gt; do what she needs to do<br/>\n&gt;<br/>\n&gt; Despite the message from schools, reading isn&#39;t a skill that can be taught<br/>\n&gt; or acquired by practice UNLESS someone is developmentally ready. And if<br/>\n&gt; they&#39;re developmentally ready then they don&#39;t need taught or to practice!<br/>\n&gt; :-) All they need do is read.<br/>\n&gt;<br/>\n&gt; Reading is like walking. Kids are being tortured in school by reading<br/>\n&gt; lessons when they don&#39;t have the ability to process the written word yet,<br/>\n&gt; just as it would be torture -- and a waste of time -- to give kids walking<br/>\n&gt; lessons before they can walk. Kids need the freedom to move their bodies<br/>\n&gt; freely in order to walk when they&#39;re developmentally ready. Just as kids<br/>\n&gt; need the freedom to absorb print that&#39;s meaningful and fun *to them* --<br/>\n&gt; which will happen naturally in a home where people enjoy reading for<br/>\n&gt; pleasure or information -- in order read when they&#39;re developmentally ready.<br/>\n&gt;<br/>\n&gt; The reason teachers and parents believe reading lessons are necessary is<br/>\n&gt; that they&#39;re giving reading lessons as kids&#39; brains are developing. So by<br/>\n&gt; the time kids are developmentally able to read it *seems* like the reading<br/>\n&gt; lessons caused their ability to read. But since all unschooling kids learn<br/>\n&gt; without instruction, it&#39;s obviously not true. Growing up interacting with<br/>\n&gt; print in a print rich environment is what allows people to figure out<br/>\n&gt; reading.<br/>\n&gt;<br/>\n&gt; Trust her interest and her journey. She&#39;ll get where *she* needs to go.<br/>\n&gt; Which won&#39;t necessarily be where you think she should or needs to go.<br/>\n&gt;<br/>\n&gt; Joyce<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Distracted...","postDate":"1350468972","msgId":49162,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxMjFFMjA0LUEzRjItNDU0Ri05QTI0LTIzMkZGQzI1ODM1N0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGs1bGxjZyt1Y2ptQGVHcm91cHMuY29tPg==","referencesHeader":"PGs1bGxjZyt1Y2ptQGVHcm91cHMuY29tPg=="},"prevInTopic":49161,"nextInTopic":49164,"prevInTime":49161,"nextInTime":49163,"topicId":49161,"numMessagesInTopic":0,"msgSnippet":"... Yes. Let go of your time schedule and let her own naturally play out. ... Wanting the end result isn t the same as wanting the journey to get there. There","messageBody":"<div id=\"ygrps-yiv-426353639\">On Oct 17, 2012, at 3:05 AM, securepleasantlot16 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is this something to be concerned about or will she do what she needs to do when she wants to do it?<br/>\n<br/>\n </span></blockquote>Yes.<br/>\n<br/>\nLet go of your time schedule and let her own naturally play out.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; she finds everything and anything to not do what she needs <br/>\n&gt; to do...even though it&#39;s what she wants to do... <br/>\n<br/>\n </span></blockquote>Wanting the end result isn&#39;t the same as wanting the journey to get there. <br/>\n<br/>\nThere are several skills I&#39;d like to have -- like playing guitar, speaking Japanese -- that I don&#39;t get enough enjoyment out of playing around with in order to get better at them.<br/>\n<br/>\nThere are loads of skills I&#39;ve gotten better at -- like writing, drawing, sewing, knitting, cooking, skiing, swimming -- because I enjoy the skill enough at whatever level I&#39;m at and enjoy the challenges I set for myself. It&#39;s the process I enjoy. Getting better as I enjoy using it keeps it challenging and interesting.<br/>\n<br/>\nWhile she&#39;s struggling with something that doesn&#39;t interest her, she&#39;s not doing something else that does interest her and that will increase her skill as a side effect of being engaged. Just because something&#39;s hard doesn&#39;t make it better! A challenge that someone is enjoying is 100 times better than hard.<br/>\n<br/>\nTrust her interest. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; she isn&#39;t getting better because she will swIm a few strokes stop,<br/>\n&gt; take a look around then duck back into the water<br/>\n<br/>\n<br/>\n </span></blockquote>Do you take her to the pool often enough that she can learn to swim by playing and trying things and challenging herself? It&#39;s how humans learn best. Swimming lessons are for parents who won&#39;t take their kids swimming often enough ;-) and for those worried about what other parents say.<br/>\n<br/>\nI don&#39;t think I went to the pool that often as a kid. Maybe once or twice on the weekends. But I learned to swim just fine by playing with family and friends.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; when it comes to reading, something she does show some interest<br/>\n&gt; in, as soon as it gets hard, she finds everything and anything to not <br/>\n&gt; do what she needs to do<br/>\n<br/>\n </span></blockquote>Despite the message from schools, reading isn&#39;t a skill that can be taught or acquired by practice UNLESS someone is developmentally ready. And if they&#39;re developmentally ready then they don&#39;t need taught or to practice! :-) All they need do is read.<br/>\n<br/>\nReading is like walking. Kids are being tortured in school by reading lessons when they don&#39;t have the ability to process the written word yet, just as it would be torture -- and a waste of time -- to give kids walking lessons before they can walk. Kids need the freedom to move their bodies freely in order to walk when they&#39;re developmentally ready. Just as kids need the freedom to absorb print that&#39;s meaningful and fun *to them* -- which will happen naturally in a home where people enjoy reading for pleasure or information -- in order read when they&#39;re developmentally ready.<br/>\n<br/>\nThe reason teachers and parents believe reading lessons are necessary is that they&#39;re giving reading lessons as kids&#39; brains are developing. So by the time kids are developmentally able to read it *seems* like the reading lessons caused their ability to read. But since all unschooling kids learn without instruction, it&#39;s obviously not true. Growing up interacting with print in a print rich environment is what allows people to figure out reading.<br/>\n<br/>\nTrust her interest and her journey. She&#39;ll get where *she* needs to go. Which won&#39;t necessarily be where you think she should or needs to go.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":533592018,"authorName":"securepleasantlot16","from":"&quot;securepleasantlot16&quot; &lt;securepleasantlotps16@...&gt;","profile":"securepleasantlot16","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Distracted...","postDate":"1350457551","msgId":49161,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs1bGxjZyt1Y2ptQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":49162,"prevInTime":49160,"nextInTime":49162,"topicId":49161,"numMessagesInTopic":0,"msgSnippet":"My sweet girl (7), is so easily distracted even when she is doing things she has picked and she enjoys.  For instance, she decided she wanted to do swim and","messageBody":"<div id=\"ygrps-yiv-1861155435\">My sweet girl (7), is so easily distracted even when she is doing things she has picked and she enjoys.  For instance, she decided she wanted to do swim and loves going to swim practice and seeing her friends.  However, her friends are moving levels because they are getting better...she isn&#39;t getting better because she will swIm a few strokes stop, take a look around then duck back into the water, do two strokes, stop, take a look around....  Now I really don&#39;t care about her making the Olympics in swimming or anything like that, but I am concerned about how distracted she is.  So, when it comes to reading, something she does show some interest in, as soon as it gets hard, she finds everything and anything to not do what she needs to do...even though it&#39;s what she wants to do...  <br/>\n<br/>\nIs this something to be concerned about or will she do what she needs to do when she wants to do it?<br/>\n<br/>\n-Jennifer</div>","specialLinks":[]}],"prevTopicId":49156,"nextTopicId":49095}}