{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":486390669,"authorName":"Clare","from":"&quot;Clare&quot; &lt;cmccaughren@...&gt;","profile":"cmccaughren","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Little ones, bedtimes, help!","postDate":"1340541244","msgId":48656,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpzNzFmcys0dDFjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNDA0NjA3NzguODMxOTYuWWFob29NYWlsTmVvQHdlYjgxNTAzLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":48655,"nextInTopic":0,"prevInTime":48655,"nextInTime":48657,"topicId":48649,"numMessagesInTopic":0,"msgSnippet":"Thanks so much for all your responses. I will read and digest them carefully. We have a routine of sorts (dinner, Bible time, bath, stories, in their","messageBody":"<div id=\"ygrps-yiv-792116123\">Thanks so much for all your responses. I will read and digest them carefully. We have a routine of sorts (dinner, Bible time, bath, stories, in their rooms/beds by 9pm ish with books, drink and snack.) But we could be more consistent with it and do more to create a sleepy atmosphere, low lights etc. Thanks for the ideas. <br/>\n<br/>\nDH and I had a chat and decided to trial a tag-team kind of effort - someone would be present with the children, and the other do jobs around the house. That way at least every other evening or so he would get some time to do the things he wants to do, even if it is only DIY or the washing up! (It&#39;s hard for him to relax in a messy house.) Meredith, thanks for the advice to &quot;bring the relationship out of the bedroom&quot; :-) DH is very affectionate in general and I could definitely put more effort into small hugs and kisses which I know he would appreciate. (That&#39;s not naturally me at all, unfortunately - if I haven&#39;t seen someone for 6 months they might get a hug hello!). <br/>\n<br/>\nThere is generally still time for us to watch a bit of TV together even if the kids settle late. We&#39;ve been watching things that aren&#39;t appropriate for them at this stage really (Buffy! Lol. My son asks us to turn the scary music down if he can hear it from upstairs). I think next we&#39;ll choose something that we can all enjoy, so that it doesn&#39;t matter if they want to join us. <br/>\n<br/>\nThanks again for all the advice,<br/>\n<br/>\nClare<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://smoothandeasydays.wordpress.com\">http://smoothandeasydays.wordpress.com</a></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Little ones, bedtimes, help!","postDate":"1340460778","msgId":48655,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDA0NjA3NzguODMxOTYuWWFob29NYWlsTmVvQHdlYjgxNTAzLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PEJDRUE0NUQ2LTk0MkQtNDE2RC05QzJCLUFEMkJDMEExRjQzRUB2ZXJpem9uLm5ldD4=","referencesHeader":"PGpzMzAwaSs3bDJlQGVHcm91cHMuY29tPiA8QkNFQTQ1RDYtOTQyRC00MTZELTlDMkItQUQyQkMwQTFGNDNFQHZlcml6b24ubmV0Pg=="},"prevInTopic":48654,"nextInTopic":48656,"prevInTime":48654,"nextInTime":48656,"topicId":48649,"numMessagesInTopic":0,"msgSnippet":"One of the biggest misunderstandings people have when they read about no bedtimes is that they think they should just wait until their child either asks to","messageBody":"<div id=\"ygrps-yiv-1763644859\">One of the biggest misunderstandings people have when they read about no bedtimes is that they think they should just wait until their child either asks to go to bed of finally  passes out cold.<br/>\nSpecially with young kids the parent should be there with them creating a routine or/and an environment conducive to sleep.<br/>\nYou have a 2 and 4 year old right? At those ages I definitely got them ready to sleep. Turned the lights down, put a nice movie on or nurse them to sleep.<br/>\nMy youngest now is 6 and I go to be with her and she puts some Netflix on the TV and then she  usually is done and asks me to turn it off. Or we read a book together.<br/>\nYes there has been times my kids fell asleep out of being very tired and just crashed in the family room. There were also times they asked me to go to bed. Yep they do that ! <br/>\nBut most of the time I help them, they have no bad feelings towards going to sleep because I have not created a battle of wills or forced them to go to bed.<br/>\nIf I want to be with my husband I go up to bed and my 6 year old will come, I will come back down when she is asleep. <br/>\nI have taken toys and games to bed so they could wind down too.<br/>\nI go with the flow but making sure that I help them go to sleep. It is very different than just waiting for it to happen or forcing them to go at a certain time. <br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Little ones, bedtimes, help!","postDate":"1340457859","msgId":48654,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpzNGcyMytia3JyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBTHA1eTRqNWpvWUt1cXhCYVlWdEpNZ1RLOUFGMEY0Q01pZ19oa0wteWFvMTBrdC1EZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":48653,"nextInTopic":48655,"prevInTime":48653,"nextInTime":48655,"topicId":48649,"numMessagesInTopic":0,"msgSnippet":"... That reminds me! It does help to separate the ideas of sleep and bed sometimes. There s some good stuff here, including a bunch of cute pix of kids","messageBody":"<div id=\"ygrps-yiv-633886203\">Rachel &lt;athenagwis@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;My son hasn&#39;t slept in his own bed in months, but that&#39;s<br/>\n&gt; okay, he is getting sleep, and plenty of it now, so that&#39;s what matters<br/>\n&gt; most.<br/>\n<br/>\n </span></blockquote>That reminds me! It does help to separate the ideas of &quot;sleep&quot; and &quot;bed&quot; sometimes. There&#39;s some good stuff here, including a bunch of cute pix of kids sleeping in all sorts of ways and places:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/sleeping\">http://sandradodd.com/sleeping</a></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Little ones, bedtimes, help!","postDate":"1340457680","msgId":48653,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpzNGZzZytodmoxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpzMzAwaSs3bDJlQGVHcm91cHMuY29tPg=="},"prevInTopic":48652,"nextInTopic":48654,"prevInTime":48652,"nextInTime":48654,"topicId":48649,"numMessagesInTopic":0,"msgSnippet":"... Don t forget that! And remind your husband, too. You re looking for a New solution to an older problem, and may have to do some experimenting to figure","messageBody":"<div id=\"ygrps-yiv-1426533882\">&quot;Clare&quot; &lt;cmccaughren@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; The problem was, bedtime wasn&#39;t working really anyway.<br/>\n<br/>\n </span></blockquote>Don&#39;t forget that! And remind your husband, too. You&#39;re looking for a New solution to an older problem, and may have to do some experimenting to figure things out. Chances are, you&#39;ll find that you don&#39;t end up with A Solution, but a set of tools to help people in the family get their needs met. That&#39;s what Good problem solving gets you - because &quot;one size fits all&quot; solutions mostly don&#39;t exist in real life. There are too many variables. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; How can I... give my husband the break for a couple of hours or so before bed <br/>\n </span></blockquote>**************<br/>\n<br/>\nJust that? Do y&#39;all co-sleep? Shut the door and keep the kids out of the bedroom until dad is ready for company. If the tv is in the bedroom, it might help to move it, or get another for the living room.  If there are favorite toys in there, move them out. Make a sanctuary where he can relax.<br/>\n<br/>\n Alternately, depending on the specific situation, can he go someplace other than home for an hour or so after work? Go for a run, or to the library, or a yoga class? If what he needs is &quot;time&quot; then look at that as a separate problem from the fact that the kids aren&#39;t ready to sleep at 8pm. You already know you can&#39;t make them go to sleep ;) This is part of what I mean by getting away from the idea of A Solution. <br/>\n<br/>\nBut! I can hear you say, that&#39;s Not the only problem! Your husband has other needs, too, right? And so do you. But holding on to a solution which doesn&#39;t actually work isn&#39;t going to make things better. You need to deal with the other issues, too, and for that it helps to be clear about what all y&#39;all&#39;s needs really are. And it Really Helps to keep in mind that &quot;bedtime&quot; the way it was didn&#39;t work, and will continue to not work for y&#39;all - cross that idea right off the list. <br/>\n<br/>\nSo, what else... adult conversation? Learn to do that around your kids to some extent. It won&#39;t happen the same way, but it Is possible to talk to your spouse in the company of your children. Look for moments when the kids are otherwise engaged - tv is helpful for this, and playing simple board games, and sometimes meals or even baths can be times to have short adult conversations. While your kids are small, they will mostly be Short conversations because kids take a lot of time and attention. They&#39;ll grow out of that ;) <br/>\n<br/>\nPhysical intimacy? That&#39;s one where it helps to break things down into touch, flirting, and outright sex. Touch and flirting can go a long way toward helping a couple feel connected when you have kids around. Play footsie at the table. Catch a bit of grab-ass passing in the kitchen. Give your husband a wink. Ambush him in the bathroom. And figure out when the kids are most likely to be asleep and plan to wake up and have sex then (if you even feel like it right now - sometimes when you&#39;re pregnant sex isn&#39;t what you want, but you can still find ways to help your husband feel good about himself). <br/>\n<br/>\nWhen you bring your relationship out of the bedroom, that hour and a half of &quot;time&quot; in the evening won&#39;t seem nearly so important. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Little ones, bedtimes, help!","postDate":"1340441841","msgId":48651,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDRUE0NUQ2LTk0MkQtNDE2RC05QzJCLUFEMkJDMEExRjQzRUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpzMzAwaSs3bDJlQGVHcm91cHMuY29tPg==","referencesHeader":"PGpzMzAwaSs3bDJlQGVHcm91cHMuY29tPg=="},"prevInTopic":48650,"nextInTopic":48652,"prevInTime":48650,"nextInTime":48652,"topicId":48649,"numMessagesInTopic":0,"msgSnippet":"... You could try getting them up earlier. Maybe ease back the time a bit a day if they re hard to wake. Get the sun in their room. Turn on lively music or the","messageBody":"<div id=\"ygrps-yiv-2044598611\">On Jun 22, 2012, at 7:44 PM, Clare wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How can I ease us into this, give my husband the break for a<br/>\n&gt; couple of hours or so before bed that he feels he needs, while not<br/>\n&gt; controlling, coercing and rejecting the kids who are just not tired<br/>\n&gt; and want to spend time with us?<br/>\n<br/>\n </span></blockquote>You could try getting them up earlier. Maybe ease back the time a bit a day if they&#39;re hard to wake. Get the sun in their room. Turn on lively music or the TV. Bring them breakfast. (All depends on what they like and need.)<br/>\n<br/>\nAnd then try a different routine in the evening. Wind down earlier. Do calm activities, easing the lights down. Or do energetic activities if they have a lot of energy in the evening. Or both.<br/>\n<br/>\nThose are all pretty standard so hopefully others will have better evening ideas.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":331638196,"authorName":"Rachel","from":"Rachel &lt;athenagwis@...&gt;","profile":"athenagwis2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Little ones, bedtimes, help!","postDate":"1340418519","msgId":48652,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTHA1eTRqNWpvWUt1cXhCYVlWdEpNZ1RLOUFGMEY0Q01pZ19oa0wteWFvMTBrdC1EZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGpzMzAwaSs3bDJlQGVHcm91cHMuY29tPg==","referencesHeader":"PGpzMzAwaSs3bDJlQGVHcm91cHMuY29tPg=="},"prevInTopic":48651,"nextInTopic":48653,"prevInTime":48651,"nextInTime":48653,"topicId":48649,"numMessagesInTopic":0,"msgSnippet":"I am fairly new to unschooling myself, but prior to whole life unschooling I had the same struggles with bed time that you did.  My 8 yo would be up and down","messageBody":"<div id=\"ygrps-yiv-151813422\">I am fairly new to unschooling myself, but prior to whole life unschooling<br/>\nI had the same struggles with bed time that you did.  My 8 yo would be up<br/>\nand down all night, so when we made the switch to no bed times, we found he<br/>\nwould be awake until 10:30, which left very little time for us at night.<br/>\nWhat works for us now is my son will watch TV in one room, while my husband<br/>\nand I do our own thing in another.  My son usually falls asleep in front of<br/>\nthe TV and we have found it to be no different than when he was in his room<br/>\n&quot;sleeping&quot;.  Is there a TV or computer that your kids can use in one room<br/>\nquietly while they are up that late?  Perhaps finding activities that keep<br/>\nthem occupied in one space will help.  Your husband may be relieved since<br/>\nit would be no different than if they were in their room sleeping (maybe<br/>\neven better since they would be more likely to stay there).  Give them<br/>\nsnacks, perhaps even pillow and blankets.  Make it a comfortable place for<br/>\nthem to stay.  My son hasn&#39;t slept in his own bed in months, but that&#39;s<br/>\nokay, he is getting sleep, and plenty of it now, so that&#39;s what matters<br/>\nmost.<br/>\n<br/>\nGood luck!<br/>\nRachel<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":482623530,"authorName":"Lesley Cross","from":"Lesley Cross &lt;lesleycross@...&gt;","profile":"decldc1992","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Little ones, bedtimes, help!","postDate":"1340412283","msgId":48650,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFGRDU4RTI1LUY1QzgtNDU3OS05NEU4LTgzQUQxNzJBNEFFN0BhdHQubmV0Pg==","inReplyToHeader":"PGpzMzAwaSs3bDJlQGVHcm91cHMuY29tPg==","referencesHeader":"PGpzMzAwaSs3bDJlQGVHcm91cHMuY29tPg=="},"prevInTopic":48649,"nextInTopic":48651,"prevInTime":48649,"nextInTime":48651,"topicId":48649,"numMessagesInTopic":0,"msgSnippet":"It s not always about allowing everything whether or not it works for the rest of the family.  If your 2yo needed to sleep, and the older siblings kept waking","messageBody":"<div id=\"ygrps-yiv-967153104\">It&#39;s not always about allowing everything whether or not it works for the rest of the family.  If your 2yo needed to sleep, and the older siblings kept waking her/him, ie. s/he wasn&#39;t getting that need for sleep met, what would you do?  You&#39;d probably want to find a way everyone could get what they need.  If your dh is asking for time with you, time when neither of you is responsible to someone else, when the children are sleeping is one good solution.  There are probably others....but I&#39;ll just address having a bedtime without *imposing* a bedtime.  <br/>\n<br/>\nAt the most simple you can both make efforts to be sure the children will be ready to sleep by the time you need some down time.  Are they getting enough physical activity early enough in the day? (closer to bedtime can be more stimulating than relaxing).  When do they wake in the morning?  Can you get them up earlier?  Do you still have nappers?  Can you eliminate the nap...create a lower energy time to recharge like a story time instead?  Also, what sort of bedtime do the children enjoy?  Reading stories?  Guided meditation (not kidding, this is what worked for one of mine for a while)?  Music?  Massage? A bath? What kind of light levels are in the house in the evening?  8pm may not work as a bedtime during summer because we&#39;re biologically wired to sleep when it&#39;s dark, for the most part.  Light inhibits melatonin production/release- the chemical that makes us sleepy.  My own family went through a period where we didn&#39;t use electric lights in the evening, or tv, or computers....because it was the only way we could get our child to get sleepy.  He&#39;d go and go and go if there was more than candle/lantern light.  This was during a time when my dh and I both worked full time and had less flexible schedules.  I worked with heavy machinery.  Sleep was essential.  <br/>\n<br/>\nYou may have to play around with it.  My family, always unschoolers, have had bedtimes when it was necessary for everyone to get enough rest.  But they were bedtimes that were mutually agreed upon, handled in ways that were agreed upon by everyone, and adjusted to work for the youngest when they were not old enough to really know what they wanted.... we experimented, we figured out what was needed on our part to make bedtime happen at a certain time.  Now, we don&#39;t have a specific bedtime.   I still help at least one of my children go to sleep most nights- and I know myself well enough to offer my assistance before I&#39;m too tired to manage.  <br/>\n<br/>\nLesley <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.euphorialifedesignstudio.com\">http://www.euphorialifedesignstudio.com</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":486390669,"authorName":"Clare","from":"&quot;Clare&quot; &lt;cmccaughren@...&gt;","profile":"cmccaughren","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Little ones, bedtimes, help!","postDate":"1340408658","msgId":48649,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpzMzAwaSs3bDJlQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":48650,"prevInTime":48648,"nextInTime":48650,"topicId":48649,"numMessagesInTopic":0,"msgSnippet":"Little ones, bedtimes, help! Ok, I know the advice to newbies is just to try saying yes a bit more, not change everything all at once. Read a little, try a","messageBody":"<div id=\"ygrps-yiv-447900288\">Little ones, bedtimes, help!<br/>\n<br/>\nOk, I know the advice to newbies is just to try saying yes a bit more, not change everything all at once. &quot;Read a little, try a little, wait a while, watch.&quot; Which I love. But I mucked up. I was so excited reading about all this stuff that I dived in head first and kind of &quot;cancelled&quot; bedtime for my 6, 4 and 2 year olds. <br/>\n<br/>\nThe problem was, bedtime wasn&#39;t working really anyway. They&#39;re just not tired around 8pm (or 9, or 10... Actually they&#39;ve all just settled at 11). We were putting them back numerous times. I just decided to stop getting stressed about it. <br/>\n<br/>\nBut my husband is flipping out. He&#39;s very supportive of homeschooling and even what I&#39;ve told him of unschooling, but the reality of having the kids around all the time is not great. He works full time and does a lot with them and around the house (I am 20 weeks pregnant, and also poss suffering with mild depression and PTSD) so come last thing at night it feels like we have very little left to give. <br/>\n<br/>\nHow can I ease us into this, give my husband the break for a couple of hours or so before bed that he feels he needs, while not controlling, coercing and rejecting the kids who are just not tired and want to spend time with us? Can everyone really win?<br/>\n<br/>\nThank you :-)</div>","specialLinks":[]}],"prevTopicId":48644,"nextTopicId":48663}}