{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":212934673,"authorName":"Pampered Chef Michelle","from":"&quot;Pampered Chef Michelle&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] taking turns?","postDate":"1143900235","msgId":11235,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA0MDEwNjAzdjMxZjY1NjFkbWEwZmVmMjA2NWU4MmZiYTFAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PEJBWTExMC1EQVY2MTY4Mjg1RjYyRTMwRUY3OURERUM5OUQ3MEBwaHguZ2JsPg==","referencesHeader":"PEJBWTExMC1EQVY2MTY4Mjg1RjYyRTMwRUY3OURERUM5OUQ3MEBwaHguZ2JsPg=="},"prevInTopic":11233,"nextInTopic":0,"prevInTime":11234,"nextInTime":11236,"topicId":11233,"numMessagesInTopic":0,"msgSnippet":"... How about, Why don t you watch your brother/sister play on the computer until they are finished.  Then  you can have a turn.  You can also make ","messageBody":"<div id=\"ygrps-yiv-23719657\">On 4/1/06, Maisha Khalfani &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:earthspirit393@...\">earthspirit393@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Alas....here is my question for a specific example:  We have one computer<br/>\n&gt; that 5 of us share.  (dh has his own, me and the kids share mine).  I&#39;ve<br/>\n&gt; been letting them all use the computer as much as they&#39;d like, but they will<br/>\n&gt; have to take turns.  It&#39;s not working out too well.  There&#39;s too much &quot;he<br/>\n&gt; was on longer&quot; and &quot;I didn&#39;t get a chance today&quot;.  So I&#39;m thinking I&#39;m going<br/>\n&gt; to have to get a timer???  I don&#39;t see any other solution to this.  And my 3<br/>\n&gt; yo doesn&#39;t understand that he has to wait his turn, and gets frustrated<br/>\n&gt; whenever I say &quot;yes, you can play on the computer after fill-in-the-blank<br/>\n&gt; has their turn.  I know he doesn&#39;t understand the concept of &quot;later&quot; yet,<br/>\n&gt; and it sounds like &quot;no&quot; to him.  Is there something else I can say instead?<br/>\n<br/>\n<br/>\n </span></blockquote>How about, &quot;Why don&#39;t you watch your brother/sister play on the computer<br/>\nuntil they are finished.  Then  you can have a turn.&quot;  You can also make<br/>\n&quot;bargains&quot; with your older kids that they can stay up after the little ones<br/>\ngo to bed to get more time in.  We did that for a long time when we had one<br/>\ncomputer.  Also is there anyway that your dh could allow your oldest child<br/>\nto have access to his computer?  They could have an agreement like no<br/>\ndownloads and only certain websites on his computer?  We are fortunate to<br/>\ncurrently have 3 working computers.  Another option is to find an<br/>\nalternative activity for whomever it is that is feeling momentarily<br/>\ncomputerless.  For instance a movie they have wanted to see, helping you<br/>\nwith something, a video game or some other something that is a &quot;hot<br/>\ncommodity&quot; but only available one at a time.  It doesn&#39;t always pacify the<br/>\nneed, but can sometimes help ease things over.<br/>\n<br/>\nAlso, how much time would your 3yo spend in the computer once on it?  You<br/>\nmight ask whoever is currently on the computer if the 3yo could be on it.<br/>\nTalk to them about this ahead of time.  I remember when my son was that age<br/>\nhe would beg to be on the computer (this is when we also had just one).  But<br/>\nhe would be on it for no more than an hour if that (usually 15 minutes).  It<br/>\nwas that &quot;right to be on it&quot; thing more than really wanting to be on it.  We<br/>\nlearned very quickly that if we just let him on it he would be done<br/>\nrelatively soon and then someone else could use the computer.<br/>\n<br/>\nAnd no, they cannot use dh&#39;s computer.<br/>\n<br/>\n<br/>\nOoops didn&#39;t see this.  Does he have a reason why they can&#39;t?  My co-parent<br/>\nhas a computer that is his &quot;work computer.&quot;  It has stuff on it that would<br/>\nbe detrimental to his company if it got messed up.  He has that part of the<br/>\ncomputer password protected.  And there are certain restrictions on his<br/>\ncomputer such as no downloading of programs, only going to certain websites<br/>\nthat we know are safe from viruses and spyware, saving any word documents to<br/>\na disk or e-mailing them to ourselves so we can open them on another<br/>\ncomputer.  He only uses it when he works from home so it just sits here most<br/>\nof the time.<br/>\n<br/>\nI&#39;m open to suggestions.<br/>\n<br/>\n<br/>\nYou could always start a computer fund jar.  Donations gladly accepted to<br/>\npurchase a second family computer.  I&#39;ve noticed as my kids get older their<br/>\ncomputer time has also gotten longer.  It&#39;s how they keep in contact with<br/>\ntheir friends, play games, keep up with the latest music, write in their<br/>\nblogs or fanfiction websites, etc.  I also found that the older they get the<br/>\nless games they play and the more interaction they want with people on the<br/>\nother end.  My kids wanted a Play Station.  Actually Emily wanted a Play<br/>\nStation, but we never seemed to have that much chunk of spare change left<br/>\neach month, so she started saving to buy one.  It was something that was<br/>\nimportant to her and she worked to get it by doing odd jobs, saving any<br/>\n&quot;allowance&quot; (although it is far from the traditionall &quot;allowance&quot;) and<br/>\njumping on every penny, quarter and nickel she found on the street.  Now she<br/>\nis wanting a video camera.<br/>\n<br/>\nPS - we have the same problem with the television as well.  You know &quot;I<br/>\n<blockquote><span title=\"ireply\"> &gt; don&#39;t want to watch that!&quot; etc , etc.<br/>\n<br/>\n<br/>\n </span></blockquote>Three letters - DVR (or one word Tivo!)  We didn&#39;t get a DVR for the longest<br/>\ntime because we thought it would be so much more expensive.  We found out it<br/>\nwas only an extra $6 a month.  $6 I will gladly pay to appease the need to<br/>\nsee a certain show!  If you still have a VCR (so few do now) you could<br/>\nalways teach your kids how to record the shows they want to see.<br/>\n<br/>\n<br/>\n<br/>\n--<br/>\nMichelle<br/>\nIndependent Kitchen Consultant #413652<br/>\nThe Pampered Chef<br/>\n850-474-0817<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.pamperedchef.biz/michellelr\">http://www.pamperedchef.biz/michellelr</a><br/>\nCatch our new wave of color!<br/>\nBook a March show!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":257390633,"authorName":"Maisha Khalfani","from":"&quot;Maisha Khalfani&quot; &lt;earthspirit393@...&gt;","profile":"earthspirit393","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"taking turns?","postDate":"1143897943","msgId":11233,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExMC1EQVY2MTY4Mjg1RjYyRTMwRUY3OURERUM5OUQ3MEBwaHguZ2JsPg=="},"prevInTopic":0,"nextInTopic":11235,"prevInTime":11232,"nextInTime":11234,"topicId":11233,"numMessagesInTopic":0,"msgSnippet":"So I m working on the whole gentle-parenting thing.  Admittedly it s frustrating for me because I m working full time right now, and will be for another week","messageBody":"<div id=\"ygrps-yiv-965949189\">So I&#39;m working on the whole gentle-parenting thing.  Admittedly it&#39;s frustrating for me because I&#39;m working full time right now, and will be for another week or so (temp), and hubby and I don&#39;t see eye-to-eye on this issue at all.  And also because two of my kids are in school so that I can work (bummer).<br/>\n<br/>\nAlas....here is my question for a specific example:  We have one computer that 5 of us share.  (dh has his own, me and the kids share mine).  I&#39;ve been letting them all use the computer as much as they&#39;d like, but they will have to take turns.  It&#39;s not working out too well.  There&#39;s too much &quot;he was on longer&quot; and &quot;I didn&#39;t get a chance today&quot;.  So I&#39;m thinking I&#39;m going to have to get a timer???  I don&#39;t see any other solution to this.  And my 3 yo doesn&#39;t understand that he has to wait his turn, and gets frustrated whenever I say &quot;yes, you can play on the computer after fill-in-the-blank has their turn.  I know he doesn&#39;t understand the concept of &quot;later&quot; yet, and it sounds like &quot;no&quot; to him.  Is there something else I can say instead?<br/>\n<br/>\nAnd no, they cannot use dh&#39;s computer.  <br/>\n<br/>\nI&#39;m open to suggestions.<br/>\n<br/>\nPS - we have the same problem with the television as well.  You know &quot;I don&#39;t want to watch that!&quot; etc , etc.<br/>\n<br/>\nMaisha <br/>\nWife to Jabari<br/>\nMom to Rohana - 16, Safiya - 7, Dakari - 6, Khalid - 3, Khidar - who will be one this Tuesday.<br/>\n<br/>\n&quot;Live each season as it passes; breathe the air, drink the drink, taste the fruit, and dance with the Earth in all her glorious colors.&quot; ~ Henry David Thoreau (1817 - 1862)<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":11217,"nextTopicId":11230}}