{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":181212675,"authorName":"Mindy Evans","from":"&quot;Mindy Evans&quot; &lt;mindyevans@...&gt;","profile":"sethnmommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:How to tell......","postDate":"1165506796","msgId":19575,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVsOWRkYyt1ZzloQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1MjYyRUQyQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":19555,"nextInTopic":0,"prevInTime":19574,"nextInTime":19576,"topicId":19533,"numMessagesInTopic":0,"msgSnippet":"Wow! You all are an awesome group of information and encouragement, thank-you! I started to respond to several comments made and realized it would be a book by","messageBody":"<div id=\"ygrps-yiv-747048171\">Wow! You all are an awesome group of information and encouragement, <br/>\nthank-you! I started to respond to several comments made and realized <br/>\nit would be a book by the time I was done!!<br/>\nI am really blessed by this group. I have been so concentrated on <br/>\nwhat &quot;the other kids his age&quot; are doing in school, that even though I <br/>\ndon&#39;t want to admit it, I am really bowing to the pressure. One minute <br/>\nI am thinking what a great thing it is to let him learn at his own <br/>\npace, the next I am comparing him again. <br/>\nI hope as I go through this journey, my confidence level in <br/>\nunschooling becomes solid, because my heart tells me it&#39;s the right <br/>\nthing to do. I am doing lots of reading on it, but I tell you, you <br/>\nladies gave me info I hadn&#39;t read yet. <br/>\nHopefully I can contribute this kind of advice as my son becomes older <br/>\nand &quot;I&quot; get wiser. <br/>\nSeems I&#39;m the one who needs concentrate on learning a few things, not <br/>\nhim!<br/>\nAll of your responses were so helpful, I am printing them out for <br/>\nfuture encouragement!<br/>\nThanks! Mindy</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How to tell......","postDate":"1165444535","msgId":19555,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVsN2dqbit2djY1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVsNzkzcCttZnZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":19554,"nextInTopic":19575,"prevInTime":19554,"nextInTime":19556,"topicId":19533,"numMessagesInTopic":0,"msgSnippet":"... but ... Morgan used to write letters and numbers with a pen (no crayons or pencils) only on paper. She d only draw on the chalkboard or floor in chalk, or","messageBody":"<div id=\"ygrps-yiv-190691440\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Laurie&quot; &lt;bieberl@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Also, my DS flat refused any writing utensils as a<br/>\n&gt; baby and toddler.  Wouldn&#39;t color for anything - not that I pushed <br/>\n </span></blockquote>but<br/>\n<blockquote><span title=\"ireply\"> &gt; any kind of group setting at that age involves coloring for some<br/>\n&gt; reason.  Guess they&#39;re not thinking outside the box.  ;)  When he<br/>\n&gt; turned 4, my 2yr old DD started drawing on the MagnaDoodle.<br/>\n<br/>\n </span></blockquote>Morgan used to write letters and numbers with a pen (no crayons or <br/>\npencils) only on paper. She&#39;d only draw on the chalkboard or floor <br/>\nin chalk, or with her magnetic drawing board - it got so I&#39;d take a <br/>\npicture with my digital camera so I&#39;d have something to &quot;save&quot; ;) <br/>\nOver the last year she&#39;s just exploded into drawing on paper and <br/>\nusing a wide variety of implements. Now I have more kid-art than I <br/>\nknow what to do with.<br/>\n<br/>\nShe also started writing letters by using stencils - we came across <br/>\na set one day at the dollar store and she was soooooo excited. <br/>\nBefore then she&#39;d trace things but would get really frustrated if <br/>\nshe tried to write on her own and it didn&#39;t come out the way she <br/>\nwanted. <br/>\n<br/>\nOne of the (never-ending) complaints from my stepson&#39;s now ex school <br/>\nwas that his handwriting was terrible. On Monday he spray-painted a <br/>\nbig box for Mo to play in and one of the things he painted was her <br/>\nname. His handwriting is lots better in spray-paint! Maybe it was <br/>\njust that he was choosing to do something rather than being forced, <br/>\nor maybe he&#39;s finally found his &quot;preferred writing implement&quot;.<br/>\n<br/>\n---Meredith (Mo 5, Ray 13)</div>","specialLinks":[]},{"userId":7453674,"authorName":"Laurie","from":"&quot;Laurie&quot; &lt;bieberl@...&gt;","profile":"bieberl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How to tell......","postDate":"1165436857","msgId":19554,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVsNzkzcCttZnZ1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVsNGZkdStwbDhyQGVHcm91cHMuY29tPg=="},"prevInTopic":19545,"nextInTopic":19555,"prevInTime":19553,"nextInTime":19555,"topicId":19533,"numMessagesInTopic":0,"msgSnippet":"When I noticed my son slipping that he knew words, he was also reluctant to let me know that he could read.  After talking about it [his reluctance] many","messageBody":"<div id=\"ygrps-yiv-945337114\">When I noticed my son &quot;slipping&quot; that he knew words, he was also<br/>\nreluctant to let me know that he could read.  After talking about it<br/>\n[his reluctance] many times, he finally told me that he was scared I<br/>\nwould stop reading to him if he could read for himself.  As soon as I<br/>\nreassured him that I would read to him anytime, anywhere for as long<br/>\nas he wants me to read to him, he started openly reading.  He&#39;s a very<br/>\nskilled avid reader now, well beyond his schooled friends reading levels.<br/>\n<br/>\nPerhaps there&#39;s a reason that he doesn&#39;t want you to know he can read<br/>\nsimilar to that.  Also, my DS flat refused any writing utensils as a<br/>\nbaby and toddler.  Wouldn&#39;t color for anything - not that I pushed but<br/>\nany kind of group setting at that age involves coloring for some<br/>\nreason.  Guess they&#39;re not thinking outside the box.  ;)  When he<br/>\nturned 4, my 2yr old DD started drawing on the MagnaDoodle.  And of<br/>\ncourse, she&#39;d bring it to us to draw things and eventually, someone<br/>\nwould write the names of family members.  DS started playing with it<br/>\nand within a week, he was writing his name as well as any other 4yr<br/>\nold.  It was a slow process and I never pushed anything on him but I<br/>\ndid comment on &quot;great job!&quot; (not overly pushy though) when he would<br/>\nshow me something he wrote.  He still wasn&#39;t a big fan of it but he<br/>\nand DD have gotten into scrapbooking with me the last year.  When I<br/>\npull out my supplies, they pull out theirs.  And of course this<br/>\ninvolves some writing after you get the basics of cutting and gluing<br/>\ndown.  Now, just over 6, he&#39;s copying words from books for &quot;fun&quot; in a<br/>\njournal.  It&#39;s not daily and he doesn&#39;t have a love of writing but the<br/>\npoint is that he&#39;s picked up the basics with very minimal practice and<br/>\nwould be considered at a &quot;normal 6yr old level&quot; for schools.<br/>\n<br/>\nHe&#39;ll get there.  My opinion is that someone would have to work very<br/>\nhard to not learn to read and write when exposed to it daily as our<br/>\nchildren are.  I didn&#39;t use them for this purpose but I&#39;ve heard that<br/>\nvideo games are also a great way to get them to want to read<br/>\n(especially boys).  Not the cheesy &quot;educational&quot; ones but just a good<br/>\n RPG that requires reading or even something that has a menu you have<br/>\nto sort through to choose weapons and armor, etc. for your character.  ;)<br/>\n<br/>\nLaurie<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Mindy Evans&quot;<br/>\n&lt;mindyevans@...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; How do you tell if your child is not ready to learn certain things or <br/>\n&gt; is just being lazy and disobedient?He know certain words on <br/>\n&gt; sight, but I only know that because he has let it slip a few times <br/>\n&gt; that he knows what words are on the page. <br/>\n&gt; Mindy<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:How to tell......","postDate":"1165416847","msgId":19545,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVsNmxpZittcXZ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEMwMzBFMkQ2LUE3NkMtNEZCRS1BQkU2LTM2NzVDNDRBQkMwOEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":19543,"nextInTopic":19554,"prevInTime":19544,"nextInTime":19546,"topicId":19533,"numMessagesInTopic":0,"msgSnippet":"~~How do you tell if your child is not ready to learn certain things or is just being lazy and disobedient?~~ I think it would help you a lot to drop not only","messageBody":"<div id=\"ygrps-yiv-398810175\">~~How do you tell if your child is not ready to learn certain things or<br/>\nis just being lazy and disobedient?~~<br/>\n<br/>\nI think it would help you a lot to drop not only these terms in<br/>\nrelation to your child, but the mere thought that he is either of<br/>\nthose negative descriptions.<br/>\n<br/>\nLazy happens because someone else has an idea of what a person&#39;s<br/>\nactivity level should look like, rather than trusting the person<br/>\nthemselves. &quot;Lazy&quot; doesn&#39;t exist in my world, neither does<br/>\n&quot;disobedience&quot; because having my children obey me is not a goal.<br/>\n<br/>\nI want them to think for themselves, have their own barometer of what<br/>\nis good and right for their lives and they won&#39;t get that from obeying<br/>\nme but from discussing, pondering, experimenting and learning in their<br/>\nown way. We all listen to each other when something important comes<br/>\nup, rather than having any one group in the house subvert themselves<br/>\nto authority.<br/>\n<br/>\nSo if learning is the goal, then trust is the first and most important<br/>\nfactor.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re:How to tell......","postDate":"1165414420","msgId":19543,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMwMzBFMkQ2LUE3NkMtNEZCRS1BQkU2LTM2NzVDNDRBQkMwOEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1MjYyRUQyQEJPWC5DTkNTT0ZUV0FSRS5DT00+","referencesHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1MjYyRUQyQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":19542,"nextInTopic":19545,"prevInTime":19542,"nextInTime":19544,"topicId":19533,"numMessagesInTopic":0,"msgSnippet":"... It s helpful to understand that schools use the techniques they do not because they re the best to teach kids but because they re best for *mass","messageBody":"<div id=\"ygrps-yiv-1012525953\">On Dec 6, 2006, at 8:41 AM, Debra Rossing wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He sounds like an auditory learner but what you&#39;re trying to get<br/>\n&gt; him to practice is a visual style (looking at print on a page, that  <br/>\n&gt; sort<br/>\n&gt; of thing).<br/>\n<br/>\n </span></blockquote>It&#39;s helpful to understand that schools use the techniques they do  <br/>\nnot because they&#39;re the best to teach kids but because they&#39;re best  <br/>\nfor *mass education*.<br/>\n<br/>\nWhile teachers and administrators may have the goal of providing the  <br/>\nbest for each child, they ultimately can&#39;t because they&#39;re using a  <br/>\nsystem designed to raise the general level of education of the masses  <br/>\nas cheaply as possible.<br/>\n<br/>\nThe methods they use conform to that goal, *not* to the goal of  <br/>\nhelping each child be the best he can be.<br/>\n<br/>\nHaving all kids read by 4th grade serves the needs of the schools and  <br/>\nteachers *not* the children. No child *needs* to read at 9. Though  <br/>\nmany manage to and many *want* to, there is nothing that a 9 yo needs  <br/>\nto be a better 9 yo by reading. But it&#39;s convenient for the schools  <br/>\nto have every child reading by 4th grade so they can use the same  <br/>\ncurriculum on them, and tap into children taking in information  <br/>\nthat&#39;s handed to them to speed things up. (But not all children in  <br/>\nschool are reading by 4th grade. The ones who aren&#39;t are pulled out  <br/>\nand given special instruction which, no matter how gently done, gives  <br/>\nthem the idea that they&#39;re stupid because they can&#39;t do what the  <br/>\n&quot;smart&quot; kids can do. :-/)<br/>\n<br/>\nIt doesn&#39;t take years to learn how to read. It takes years (usually)  <br/>\nof being around printed matter being exposed to it. It takes needing  <br/>\nand wanting to read. It takes brain development that allows it to  <br/>\nhappen (which for some kids happens at 3 and for some kids doesn&#39;t  <br/>\nhappen until 13 or 14 or 15.) When the brain is ready, kids are  <br/>\nreading in a very short amount of time after they begin. A 15 yo who  <br/>\nhas just begun to read is not 9 years behind a 6 yo who has just  <br/>\nbegun to read. The 15 yo will be reading at age level within months  <br/>\nand be indistinguishable from peers who started at 6.<br/>\n<br/>\nHere&#39;s something about Gardner&#39;s Intelligences that Sandra Dodd  <br/>\nposted. What&#39;s important in unschooling is providing what your child  <br/>\nneeds, not what a school -- who is trying to keep 30 kids together at  <br/>\nthe same level of skills so they can be mass educated by just one  <br/>\nteacher -- would do. If a child needs to run around, then that&#39;s the  <br/>\nway he&#39;s going to learn best. If a child needs to listen, then that&#39;s  <br/>\nthe way he&#39;s going to learn best.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Gardner&#39;s Intelligences....<br/>\n&gt; I found a clear article about this.  There are lots out there, but  <br/>\n&gt; many are very specialized or focussed in a particular way.  This  <br/>\n&gt; one seemed general enough, and I&#39;ve lifted the descriptions:<br/>\n&gt;<br/>\n&gt; Howard Gardner initially formulated a list of seven intelligences.  <br/>\n&gt; His listing was provisional. The first two are ones that have been  <br/>\n&gt; typically valued in schools; the next three are usually associated  <br/>\n&gt; with the arts; and the final two are what Howard Gardner called  <br/>\n&gt; &#39;personal intelligences&#39; (Gardner 1999: 41-43).<br/>\n&gt;<br/>\n&gt; Linguistic intelligence involves sensitivity to spoken and written  <br/>\n&gt; language, the ability to learn languages, and the capacity to use  <br/>\n&gt; language to accomplish certain goals. This intelligence includes  <br/>\n&gt; the ability to effectively use language to express oneself  <br/>\n&gt; rhetorically or poetically; and language as a means to remember  <br/>\n&gt; information. Writers, poets, lawyers and speakers are among those  <br/>\n&gt; that Howard Gardner sees as having high linguistic intelligence.<br/>\n&gt;<br/>\n&gt; Logical-mathematical intelligence consists of the capacity to  <br/>\n&gt; analyze problems logically, carry out mathematical operations, and  <br/>\n&gt; investigate issues scientifically. In Howard Gardner&#39;s words, in  <br/>\n&gt; entails the ability to detect patterns, reason deductively and  <br/>\n&gt; think logically. This intelligence is most often associated with  <br/>\n&gt; scientific and mathematical thinking.<br/>\n&gt;<br/>\n&gt; Musical intelligence involves skill in the performance,  <br/>\n&gt; composition, and appreciation of musical patterns. It encompasses  <br/>\n&gt; the capacity to recognize and compose musical pitches, tones, and  <br/>\n&gt; rhythms. According to Howard Gardner musical intelligence runs in  <br/>\n&gt; an almost structural parallel to linguistic intelligence.<br/>\n&gt;<br/>\n&gt; Bodily-kinesthetic intelligence entails the potential of using  <br/>\n&gt; one&#39;s whole body or parts of the body to solve problems. It is the  <br/>\n&gt; ability to use mental abilities to coordinate bodily movements.  <br/>\n&gt; Howard Gardner sees mental and physical activity as related.<br/>\n&gt;<br/>\n&gt; Spatial intelligence involves the potential to recognize and use  <br/>\n&gt; the patterns of wide space and more confined areas.<br/>\n&gt;<br/>\n&gt; Interpersonal intelligence is concerned with the capacity to  <br/>\n&gt; understand the intentions, motivations and desires of other people.  <br/>\n&gt; It allows people to work effectively with others. Educators,  <br/>\n&gt; salespeople, religious and political leaders and counsellors all  <br/>\n&gt; need a well-developed interpersonal intelligence.<br/>\n&gt;<br/>\n&gt; Intrapersonal intelligence entails the capacity to understand  <br/>\n&gt; oneself, to appreciate one&#39;s feelings, fears and motivations. In  <br/>\n&gt; Howard Gardner&#39;s view it involves having an effective working model  <br/>\n&gt; of ourselves, and to be able to use such information to regulate  <br/>\n&gt; our lives.<br/>\n&gt;<br/>\n&gt; Added a few years later:<br/>\n&gt;<br/>\n&gt; Naturalist intelligence enables human beings to recognize,  <br/>\n&gt; categorize and draw upon certain features of the environment. It  <br/>\n&gt; &#39;combines a description of the core ability with a characterization  <br/>\n&gt; of the role that many cultures value&#39; (ibid.: 48).<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Other intelligences being considered (and discussed a bit in that  <br/>\n&gt; article) are spiritual, existential and moral (or some blend of  <br/>\n&gt; those, because though people talk about them, they&#39;re not settled).<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.infed.org/thinkers/gardner.htm\">http://www.infed.org/thinkers/gardner.htm</a><br/>\n<br/>\n </span></blockquote>Joyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How to tell......","postDate":"1165414149","msgId":19542,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVsNml1NStqMGg3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDZFMEJGNTkxLUQ0NjktNDc1MC05NTIzLTM5RUQ2N0FENzAxN0BlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":19541,"nextInTopic":19543,"prevInTime":19541,"nextInTime":19543,"topicId":19533,"numMessagesInTopic":0,"msgSnippet":"... table ... you ... Or flat-out intimidated, especially if he were watching. I know that when *I m* learning something new, the very last thing I want is an ","messageBody":"<div id=\"ygrps-yiv-1065777844\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joyce Fetteroll <br/>\n&lt;fetteroll@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; And if your husband plunked a carburetor down on the kitchen <br/>\n </span></blockquote>table  <br/>\n<blockquote><span title=\"ireply\"> &gt; and wanted you to rebuild it, would your disinterest be because <br/>\n </span></blockquote>you  <br/>\n<blockquote><span title=\"ireply\"> &gt; weren&#39;t interested or because you were lazy?<br/>\n<br/>\n </span></blockquote>Or flat-out intimidated, especially if he were watching. I know that <br/>\nwhen *I&#39;m* learning something new, the very last thing I want is an <br/>\naudience - even if that person is there to help me, its too much <br/>\npressure. <br/>\n<br/>\nThis summer I learned to juggle. A friend of mine offered to teach <br/>\nme. I listened to his explanations, but never picked up a bean-bag <br/>\nin his presence. I went home and tried the various tips and <br/>\nsuggestions he had offered - but never once let him see me juggle <br/>\nuntil I could do several passes without dropping anything. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; *Lots* of kids in school either don&#39;t read or can&#39;t read.<br/>\n<br/>\n </span></blockquote>I used to volunteer for an adult-literacy program. Every single <br/>\nadult in the program had been to school. Each one had been &quot;taught <br/>\nto read&quot; - the vast majority with a phonics based approach. <br/>\n<br/>\nSome people like phonics - my 5yr old loves to play games where she <br/>\nwill think of a word and change one letter and try to pronounce it <br/>\nor have me pronounce it. That&#39;s *her* method, though, not mine. <br/>\n<br/>\n---Meredith (Mo 5, Ray 13)</div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"&quot;Debra Rossing&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:How to tell......","postDate":"1165412507","msgId":19541,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Q0U5M0ZFMjRGMTcwNEM4QkIyOEQ1RkM5MTNENEQ1MjYyRUQyQEJPWC5DTkNTT0ZUV0FSRS5DT00+"},"prevInTopic":19539,"nextInTopic":19542,"prevInTime":19540,"nextInTime":19542,"topicId":19533,"numMessagesInTopic":0,"msgSnippet":"... ask him to try to sound out a word ... and subtraction in his head, ... shutting down . ???????? ... refuses. These pieces jumped out at me - have you done","messageBody":"<div id=\"ygrps-yiv-410856464\"><blockquote><span title=\"ireply\">&gt;I could read books to him all day and he would be content, but don&#39;t<br/>\n </span></blockquote>ask him to try to sound out a word<br/>\n<blockquote><span title=\"ireply\"> &gt;He does know his numbers to about 100, and he can do simple addition<br/>\n </span></blockquote>and subtraction in his head, <br/>\n<blockquote><span title=\"ireply\"> &gt;but the minute I put it into a visual, he tells me &quot;my brain is<br/>\n </span></blockquote>shutting down&quot;. ???????? <br/>\n<blockquote><span title=\"ireply\"> &gt;Anytime we sit down to do any kind of practice like that, he just<br/>\n </span></blockquote>refuses.<br/>\n <br/>\nThese pieces jumped out at me - have you done any reading on learning<br/>\nstyles? He sounds like an auditory learner but what you&#39;re trying to get<br/>\nhim to practice is a visual style (looking at print on a page, that sort<br/>\nof thing). He IS learning to read (you said so) and learning numbers and<br/>\nwriting WILL happen when HE has a need to put his thoughts down on<br/>\npaper. Then again, he may just want a tape recorder or voice recognition<br/>\nsoftware so it can get from his head to the printed page without the<br/>\nphysical act of hand writing it (&quot;penmanship&quot; is a whole other topic<br/>\nfrom communicating with words).<br/>\n <br/>\nAlso, don&#39;t discount his reading ability just because he *chooses* not<br/>\nto read books - is he reading signs, cereal boxes, toy catalogs, etc?<br/>\nThat all &quot;counts&quot; as reading even if it isn&#39;t what school would consider<br/>\nvalid.<br/>\n <br/>\nOh, and you don&#39;t say how old he is but I&#39;m guessing he&#39;s under age 8<br/>\nsomewhere (maybe 6ish?) - one thing that I did with my DS when he was in<br/>\nthat &quot;almost reading on his own&quot; stage was to flat out ask him if it<br/>\nwould be okay for me to sometimes still read aloud to him because I<br/>\nliked the cuddling. That made it &quot;okay&quot; for him inside himself to take<br/>\nthat final step to independently reading - he didn&#39;t want to because he<br/>\ndidn&#39;t want to lose that time together, but once I brought it out in the<br/>\nopen, that it was something *I* didn&#39;t want to miss, he said Sure we can<br/>\nread together sometimes...and proceeded to go from 0 to 60 and be<br/>\nreading on his own in no time flat. Now he will sometimes ask to read<br/>\ntogether and other times he&#39;ll get up in the morning and mention<br/>\nsomething he was reading the night before because he woke up after<br/>\nfalling asleep and read a while before falling back asleep (he&#39;s 8 now).<br/>\n <br/>\nAnd, as someone mentioned, he did NOT learn via the standard sound it<br/>\nout phonics method (we didn&#39;t use any curriculum or &#39;practice&#39; lessons<br/>\nnor did we try to make him sound words out). Best I can figure, he<br/>\nswallowed words whole, chewed on them a bit, digested the combinations<br/>\nand sounds, and built his own &quot;phonics&quot; inside himself that he could<br/>\napply to new words. By learning the sound patterns in context (instead<br/>\nof disembodied letters), he was able to skip the &quot;exceptions&quot; to the<br/>\nrules and just add to his sound pattern &#39;blocks&#39; that this combination<br/>\ndoes that.<br/>\n <br/>\nDeb<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nCNC Software, Inc.<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] How to tell......","postDate":"1165401669","msgId":19539,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZFMEJGNTkxLUQ0NjktNDc1MC05NTIzLTM5RUQ2N0FENzAxN0BlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGVsNGZkdStwbDhyQGVHcm91cHMuY29tPg==","referencesHeader":"PGVsNGZkdStwbDhyQGVHcm91cHMuY29tPg=="},"prevInTopic":19538,"nextInTopic":19541,"prevInTime":19538,"nextInTime":19540,"topicId":19533,"numMessagesInTopic":0,"msgSnippet":"... Believe him. *Trust* him. He knows what s going on inside his head better than you do. Three pieces of advice to help you see this differently: 1) Write","messageBody":"<div id=\"ygrps-yiv-1232536328\">On Dec 5, 2006, at 1:57 PM, Mindy Evans wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He does know his numbers to<br/>\n&gt; about 100, and he can do simple addition and subtraction in his head,<br/>\n&gt; but the minute I put it into a visual, he tells me &quot;my brain is<br/>\n&gt; shutting down&quot;. ????????<br/>\n<br/>\n </span></blockquote>Believe him. *Trust* him. He knows what&#39;s going on inside his head  <br/>\nbetter than you do.<br/>\n<br/>\nThree pieces of advice to help you see this differently:<br/>\n<br/>\n1) Write down what he *is* doing. So you can see the tremendous  <br/>\namount of learning that he&#39;s doing, even when he&#39;s not doing  <br/>\nsomething that resembles school.<br/>\n<br/>\n2) Pretend it&#39;s summer vacation. Do what he would enjoy without  <br/>\nthoughts of school.<br/>\n<br/>\n3) Live as though school didn&#39;t exist. Look at all the things that  <br/>\nyou&#39;re trying to get him to do that you wouldn&#39;t think of doing if  <br/>\nschool didn&#39;t exist.<br/>\n<br/>\nWhy are you worried about reading? Because schools do it now.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Which I guess thats what unschooling is all about, however, I<br/>\n&gt; feel like he just doesn&#39;t even want to try.<br/>\n<br/>\n </span></blockquote>And if your husband plunked a carburetor down on the kitchen table  <br/>\nand wanted you to rebuild it, would your disinterest be because you  <br/>\nweren&#39;t interested or because you were lazy?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He has no interest now, but how do you<br/>\n&gt; know they ever will?<br/>\n<br/>\n </span></blockquote>When he was an infant without showing signs of talking or walking,  <br/>\ndid you worry?<br/>\n<br/>\nI haven&#39;t read of any unschooling kids -- kids who have a rich  <br/>\nenvironment and parents who understand unschooling -- who don&#39;t  <br/>\neventually read.<br/>\n<br/>\n*Lots* of kids in school either don&#39;t read or can&#39;t read.<br/>\n<br/>\nThe difference *can&#39;t* be because the kids aren&#39;t taught because  <br/>\nunschooled kids aren&#39;t taught to read. The difference is that  <br/>\nschooled kids have reading forced on them before they&#39;re interested  <br/>\nor ready.<br/>\n<br/>\nYou can&#39;t make kids read. But you can make them not *want to* read!<br/>\n<br/>\nBut you can, while making sure they have positive experiences with  <br/>\nreading, foster an environment where they do eventually read.<br/>\n<br/>\nAsk yourself if what you&#39;re doing is creating positive experiences  <br/>\nwith what you want him to do. If not, it&#39;s very likely you&#39;re pushing  <br/>\nhim further and further away from ever wanting anything to do with it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am torn between wanting<br/>\n&gt; to let him lead the way and feeling like he will never lead the way to<br/>\n&gt; certain things. Is this normal?<br/>\n<br/>\n </span></blockquote>Yes. Perfectly.<br/>\n<br/>\nWhile you pretend it&#39;s vacation, read more about unschooling. That  <br/>\nwill give you something to do instead of hover over him worrying  <br/>\nabout what he&#39;s not doing.<br/>\n<br/>\nRead through these two sites and that will keep you plenty occupied  <br/>\nwhile he goes about the business of learning ;-)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com\">http://joyfullyrejoycing.com</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com\">http://sandradodd.com</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":145246818,"authorName":"Christy Mahoney","from":"&quot;Christy Mahoney&quot; &lt;unschooling1@...&gt;","profile":"unschooling1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How to tell......","postDate":"1165395331","msgId":19538,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVsNjBpMytrYzVlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVsNGZkdStwbDhyQGVHcm91cHMuY29tPg=="},"prevInTopic":19536,"nextInTopic":19539,"prevInTime":19537,"nextInTime":19539,"topicId":19533,"numMessagesInTopic":0,"msgSnippet":"Maybe you could look at it a bit differently.  You said that he  will have nothing to do with reading, writing or numbers  But then said I could read books","messageBody":"<div id=\"ygrps-yiv-488869050\">Maybe you could look at it a bit differently.  You said that he &quot; <br/>\nwill have nothing to do with reading, writing or numbers&quot;  But then <br/>\nsaid &quot;I could read books to him all day and he would be content&quot;.  <br/>\nYour reading to him is having a LOT to do with reading.  In fact, <br/>\nthat&#39;s how a lot (most?) kids learn how to read naturally.<br/>\n<br/>\n&lt;but don&#39;t ask him to try to sound out a word. <br/>\n-A lot of kids don&#39;t learn to read this way.  Really.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Because he is doing it in his head, I know he has the capacity for <br/>\n </span></blockquote>it. <br/>\n-This is contradictory.  He is doing it in his head, so he IS doing <br/>\nit.  He may not want to perform for you.  My daughter was a lot like <br/>\nthis.  She knew how to read but shut down if I or anyone else ever <br/>\nasked her to read something aloud.  Occasionally she would read <br/>\nsomething to me, but never if I asked her to.  She just wanted to do <br/>\nit on her own terms.  <br/>\n<br/>\n&lt; And are you doing them a diservice if they NEVER learn to read or <br/>\nwrite?  <br/>\n-He is learning to read.  You already said so.<br/>\n<br/>\nI admit that I was a little worried at times that my dd would never <br/>\nwrite much.  She has difficulty with the physical act of writing and <br/>\njust plain didn&#39;t do it for a long time.  But now (at 11yo) she can <br/>\ncertainly write legibly, if not neatly, and she&#39;s getting to be <br/>\nquite a good typist.  Without &quot;practicing&quot; or pressure.  And now <br/>\nshe&#39;s writing stories and starting to post them online.  <br/>\n<br/>\nI would stop asking him to practice things for you and step back for <br/>\na while.  If he loves for you to read to him - that&#39;s huge!  It&#39;s <br/>\namazing to me that my younger daughter is suddenly reading when I <br/>\ndon&#39;t read to her nearly as much as I read to her older sister.  Not <br/>\neven close!  She likes it, but my older dd really really loved it.  <br/>\n<br/>\nEveryone can get a little freaked out sometimes, but it can <br/>\ninterfere with your son&#39;s learning if he thinks that you think he <br/>\nshould be practicing for you and performing for you.<br/>\n<br/>\n-Christy M.</div>","specialLinks":[]},{"userId":287618285,"authorName":"TheWildTribe","from":"TheWildTribe &lt;thewildtribe@...&gt;","profile":"blackhillsdoula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] How to tell......","postDate":"1165381203","msgId":19536,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVkYTM3ZTg0MDYxMjA1MjEwMGcyNzYwMWU0N25iOTYyN2M2MWViMDM2MDlmQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGVsNGZkdStwbDhyQGVHcm91cHMuY29tPg==","referencesHeader":"PGVsNGZkdStwbDhyQGVHcm91cHMuY29tPg=="},"prevInTopic":19533,"nextInTopic":19538,"prevInTime":19535,"nextInTime":19537,"topicId":19533,"numMessagesInTopic":0,"msgSnippet":"Oh, Mindy! You are sure to get many responses to this.  But I have one very simple question for you: Do you *really* think he ll never learn to read or write?","messageBody":"<div id=\"ygrps-yiv-916976382\">Oh, Mindy!<br/>\nYou are sure to get many responses to this.  But I have one very simple<br/>\nquestion for you:<br/>\n<br/>\nDo you *really* think he&#39;ll never learn to read or write?  Honestly and<br/>\ntruly?<br/>\n<br/>\nSurely you have more trust and faith in your child; and that&#39;s all you need<br/>\nto have a beautiful unschooling life!<br/>\n<br/>\nEnjoy your boy for just who he is right now, that&#39;s all we have is RIGHT<br/>\nHERE and RIGHT NOW...<br/>\n<br/>\nDon&#39;t waste precious time worrying about things that certainly will never<br/>\ncome to pass if he has a loving, supportive mother, which it&#39;s obivous that<br/>\nyou are.<br/>\n<br/>\nBest of luck, and keep reading here and search the archives, you&#39;ll learn<br/>\noodles and more!<br/>\nKaren<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 12/5/06, Mindy Evans &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mindyevans@...\">mindyevans@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   How do you tell if your child is not ready to learn certain things or<br/>\n&gt; is just being lazy and disobedient?<br/>\n&gt; My son has never gone to school. He has a great mind for science,<br/>\n&gt; biology and history, but will have nothing to do with reading, writing<br/>\n&gt; or numbers. I could read books to him all day and he would be content,<br/>\n&gt; but don&#39;t ask him to try to sound out a word. He know certain words on<br/>\n&gt; sight, but I only know that because he has let it slip a few times<br/>\n&gt; that he knows what words are on the page. He does know his numbers to<br/>\n&gt; about 100, and he can do simple addition and subtraction in his head,<br/>\n&gt; but the minute I put it into a visual, he tells me &quot;my brain is<br/>\n&gt; shutting down&quot;. ????????<br/>\n&gt; Because he is doing it in his head, I know he has the capacity for it.<br/>\n&gt; Anytime we sit down to do any kind of practice like that, he just<br/>\n&gt; refuses. Which I guess thats what unschooling is all about, however, I<br/>\n&gt; feel like he just doesn&#39;t even want to try. I am torn between wanting<br/>\n&gt; to let him lead the way and feeling like he will never lead the way to<br/>\n&gt; certain things. Is this normal?<br/>\n&gt; When you are unschooling, is it always nervous like this? I trying to<br/>\n&gt; be openminded, but I am scared I guess. Scared he will one day<br/>\n&gt; say, &quot;Why didn&#39;t you put me is school?&quot; &quot;Why didnt you ever MAKE me<br/>\n&gt; practice writing and reading?&quot; He has no interest now, but how do you<br/>\n&gt; know they ever will? And are you doing them a diservice if they NEVER<br/>\n&gt; learn to read or write?<br/>\n&gt; A little freaked out here......<br/>\n&gt; Mindy<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.thewildtribe.blogspot.com\">http://www.thewildtribe.blogspot.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":181212675,"authorName":"Mindy Evans","from":"&quot;Mindy Evans&quot; &lt;mindyevans@...&gt;","profile":"sethnmommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"How to tell......","postDate":"1165345022","msgId":19533,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVsNGZkdStwbDhyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":19536,"prevInTime":19532,"nextInTime":19534,"topicId":19533,"numMessagesInTopic":0,"msgSnippet":"How do you tell if your child is not ready to learn certain things or is just being lazy and disobedient? My son has never gone to school. He has a great mind","messageBody":"<div id=\"ygrps-yiv-519826716\">How do you tell if your child is not ready to learn certain things or <br/>\nis just being lazy and disobedient?<br/>\nMy son has never gone to school. He has a great mind for science, <br/>\nbiology and history, but will have nothing to do with reading, writing <br/>\nor numbers. I could read books to him all day and he would be content, <br/>\nbut don&#39;t ask him to try to sound out a word. He know certain words on <br/>\nsight, but I only know that because he has let it slip a few times <br/>\nthat he knows what words are on the page. He does know his numbers to <br/>\nabout 100, and he can do simple addition and subtraction in his head, <br/>\nbut the minute I put it into a visual, he tells me &quot;my brain is <br/>\nshutting down&quot;. ???????? <br/>\nBecause he is doing it in his head, I know he has the capacity for it. <br/>\nAnytime we sit down to do any kind of practice like that, he just <br/>\nrefuses. Which I guess thats what unschooling is all about, however, I <br/>\nfeel like he just doesn&#39;t even want to try. I am torn between wanting <br/>\nto let him lead the way and feeling like he will never lead the way to <br/>\ncertain things. Is this normal?<br/>\nWhen you are unschooling, is it always nervous like this? I trying to <br/>\nbe openminded, but I am scared I guess. Scared he will one day <br/>\nsay, &quot;Why didn&#39;t you put me is school?&quot; &quot;Why didnt you ever MAKE me <br/>\npractice writing and reading?&quot; He has no interest now, but how do you <br/>\nknow they ever will? And are you doing them a diservice if they NEVER <br/>\nlearn to read or write?<br/>\nA little freaked out here......<br/>\nMindy</div>","specialLinks":[]}],"prevTopicId":19551,"nextTopicId":19571}}