{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":348735811,"authorName":"amflowers71","from":"&quot;amflowers71&quot; &lt;eurochamp99@...&gt;","profile":"amflowers71","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 4 year old behaviour","postDate":"1241631142","msgId":39948,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd0c2hqNitsbG1qQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd0czBwNSsyM2NrQGVHcm91cHMuY29tPg=="},"prevInTopic":39947,"nextInTopic":0,"prevInTime":39947,"nextInTime":39949,"topicId":39931,"numMessagesInTopic":0,"msgSnippet":"For annoying behavior, like name calling, poking, repetitive talking, distraction very often works. I can often find something of interest that he will","messageBody":"<div id=\"ygrps-yiv-1524374044\">&quot;For &quot;annoying&quot; behavior, like name calling, poking, repetitive talking,<br/>\ndistraction very often works. I can often find something of interest that he will focus on instead of annoying his older brother.&quot;<br/>\n<br/>\nMy 3.5 yr old does this a lot to my 8 yr old and has done for quite a long time.  My difficulty is, whatever I do to try to &quot;deal&quot; with the situation, whether it is distraction, removing younger one to do something else, explaining, yelling etc etc, I always find that it is the 3.5 yr old that ends up with my full attention whilst the 8 yr old ends up with none.  The 8 yr old knows this and it makes him feel angry and hurt - I think the 3.5 yr old may know it too.  <br/>\n<br/>\nExcept for locking the 3.5 yr old out of the room (which I don&#39;t do) I haven&#39;t come up with anything that stops the problem without leaving the older child feeling that he is the &quot;loser&quot; in the situation.  This is because whatever I do the 3.5 yr old is very very persistant and very loud.  I can&#39;t actually seperate them or stop the aggressive or annoying behaviour without giving my full attention to the younger one.</div>","specialLinks":[]},{"userId":280469198,"authorName":"Bethany","from":"&quot;Bethany&quot; &lt;coconutandbroccoli@...&gt;","profile":"greenbeanbanshee","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 4 year old behaviour","postDate":"1241622029","msgId":39947,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd0czhtZCtjMW5nQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd0czBwNSsyM2NrQGVHcm91cHMuY29tPg=="},"prevInTopic":39935,"nextInTopic":39948,"prevInTime":39946,"nextInTime":39948,"topicId":39931,"numMessagesInTopic":0,"msgSnippet":"This type of thing can be really hard to manage.  I have three kids and we run into these situations all the time.  You might want to check out a great","messageBody":"<div id=\"ygrps-yiv-1766819085\">This type of thing can be really hard to manage.  I have three kids and we run into these situations all the time.  You might want to check out a great resource called The Consciously Parenting Project.  They have tons of free articles, free forums that are moderated by experts in children&#39;s behaviors, and have ongoing Tele-Parenting classes for all types of situations.<br/>\n<br/>\nI hope that helps!<br/>\n<br/>\n~Bethany</div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 4 year old behaviour","postDate":"1241613925","msgId":39935,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd0czBwNSsyM2NrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDcxODY5OS43MzM3OS5xbUB3ZWI0NTMwMS5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":39933,"nextInTopic":39947,"prevInTime":39934,"nextInTime":39936,"topicId":39931,"numMessagesInTopic":0,"msgSnippet":"... ******I have a 4 year old (and a 10 year old and a 10month old).  He does all those things you guys have described.  He can also be quite aggressive.  He","messageBody":"<div id=\"ygrps-yiv-210348993\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Tammy Curry &lt;mamabeart00@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I am having some of the things with my 4 yr old son, except he is acting this way mainly towards his older sister. <br/>\n<br/>\n </span></blockquote>******I have a 4 year old (and a 10 year old and a 10month old).  He does all those things you guys have described.  He can also be quite aggressive.  He hits and kicks and punches. <br/>\n<br/>\nI find that for the aggressive behavior, I have to jump right in and state &quot;I won&#39;t let you hurt (insert name here)&quot;.  And I mean it, I won&#39;t.  I won&#39;t let him hurt anyone else even if that means I pick him up and carry him away.  When he gets to that point, I usually have to wait until things are calm before we can talk about a better way or find a way to meet his needs.  Just by being observant I began see the things that would set him off and recognize the tone of voice that preceded it all.  At times he was REALLY hurting his older brother.  For a 4 year old he is quite strong.  I needed to stop that and make it clear that this was not ok with me.  Sometimes he would do it out of frustration or anger, sometimes he seemed to do it for fun. <br/>\n<br/>\nFor &quot;annoying&quot; behavior, like name calling, poking, repetitive talking, distraction very often works.  I can often find something of interest that he will focus on instead of annoying his older brother.  I also find that trying to spend some alone time with each one of them helps tremendously.  That way each child gets to spend some time with me, but also gets some much needed space.  Having snacks around at all times really helps them throughout the day.  I can remember times when I would just offer the 4 year old a few bites and within minutes his whole demeanor would change.  <br/>\n<br/>\nI tend to handle these issues more directly and less emotionally.  He doesn&#39;t seem to quite understand that he is hurting or bothering anyone at all.  I do think it is developmental and I do think that as they mature they will learn new ways of handling of their frustrations.  They just need our help to get there.  :-)<br/>\n<br/>\n-Heather<br/>\n======================================================================</div>","specialLinks":[]},{"userId":122460111,"authorName":"Tammy Curry","from":"Tammy Curry &lt;mamabeart00@...&gt;","profile":"mamabeart00","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] 4 year old behaviour","postDate":"1241575632","msgId":39933,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcxODY5OS43MzM3OS5xbUB3ZWI0NTMwMS5tYWlsLnNwMS55YWhvby5jb20+","inReplyToHeader":"PGd0cWl0aCtuaXVpQGVHcm91cHMuY29tPg==","referencesHeader":"PGd0cWl0aCtuaXVpQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":39935,"prevInTime":39932,"nextInTime":39934,"topicId":39931,"numMessagesInTopic":0,"msgSnippet":"I am having some of the things with my 4 yr old son, except he is acting this way mainly towards his older sister. I sit him down and tell him that it isn t","messageBody":"<div id=\"ygrps-yiv-1588035953\">I am having some of the things with my 4 yr old son, except he is acting this way mainly towards his older sister. I sit him down and tell him that it isn&#39;t nice to hurt someone and ask him why. He actually said he likes to make his sissy scream. Which at 10 yrs old is a perfected art anyway. LOL It started a few weeks ago. I can at least tell the 10 yr old to get up and stop playing with him and go to another room. For your 2.5 yr old she may not understand that quite yet. The 10 yr old&#39;s initial response was to do whatever it was right back to him, endless cycle and then everyone ends up with hurt feelings at the very least. It has lessened after talking to him. Short, sweet and to the point. Hitting, spitting, generally being mean and rude are not the way we live and it is not funny to make someone cry (daughter thought it might make him stop if he thought he really hurt her). He is normally full of love, hugs and kisses. One of the things I have also<br/>\n done to try and head off one of these episodes is to offer a snack or if i see it coming on intervene by playing with both of them. Blowing bubbles, building with blocks, etc. It has really helped to be down on the floor or out in the back yard with them in the afternoons. <br/>\n<br/>\n <br/>\nTammy Curry, Director of Chaos<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tammycurry.blogspot.com/\">http://tammycurry.blogspot.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://crazy-homeschool-adventures.blogspot.com/\">http://crazy-homeschool-adventures.blogspot.com/</a><br/>\n<br/>\n&quot;If a child is to keep alive his inborn sense of wonder, he needs the companionship of at least one adult who can share it, rediscovering with him the joy, excitement and mystery of the world we live in.&quot;<br/>\n<br/>\nRachel Carson<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Agnieszka &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mama_agnieszka@...\">mama_agnieszka@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Tuesday, May 5, 2009 7:42:41 PM<br/>\nSubject: [unschoolingbasics] 4 year old behaviour<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nHi all,<br/>\nI don&#39;t know the last time I posted here so I&#39;ll start with a brief intro: I&#39;m Agnieszka, sahm to Kalina (4) and Tosia (2.5).  We&#39;ve been unschooling/ homeschooling/ deschooling from the get-go over here, and these days we&#39;re having some questions.<br/>\n<br/>\nAnd really, we&#39;ve been just kind of happily coasting along, doing quite well with the simple daily life we&#39;ve been living... But recently I&#39;ve found myself really not *liking* the company of my 4 year old lovely daughter, but only in the afternoons when it seems she becomes quite a different little girl...<br/>\n<br/>\nSee, I have been experimenting with &quot;nothing to do&quot; time. I&#39;m a very uneducated unschooler - meaning, I&#39;ve not read the many fantastic books on uschooling that I have cover to cover. The result is that I&#39;m probably reinventing the wheel over here... but bear with me (and plus, it&#39;s not really reinventing THE wheel... this is a very specific and unique wheel). <br/>\n<br/>\nSo, a few afternoons a week, we are at home and we have nothing to do. There are no shows, no prepared activities that I would encourage the kids to do. There are all of our toys and books and the kitchen is available for whatever the kids want to experiment with...<br/>\n<br/>\nIn that time, the girls find all sorts of things that they enjoy: building forts, playing tag, reading books, making music, building with blocks, whatever else they want to do. But recently, much if not nearly all activities end up with the 4 year old essentially doing whatever it takes to make the younger one scream and cry.<br/>\n<br/>\nI know that it&#39;s normal, please tell me how you would respond. I&#39;m experimenting with yelling at her to stop (which a)does not help, b)makes me feel like an idiot, and c)only encourages the same<br/>\nbehaviour). I&#39;m also experimenting with letting the two of them work it out, while keeping a watchful eye on them so no one gets hurt, but this is where I&#39;ve started to notice my dislike of the 4 year old behaviours. It&#39;s almost cruel, actually.And when I hear her laughing while the littler one screams, I simply lose mycool...<br/>\n<br/>\nSo, to recap my questions: how to respond to those behaviours (without resorting to time-outs and *logical consequences* )? How to address my own dislike and frustrations with this current stage of development? Is this &quot;nothing to do&quot;experiment really a good idea? In my own upbringing back in the Old Country(Poland) the message always was (and my mom keeps repeating it to me now with my children around), kids must must must be kept busy or else... But I don&#39;t buy it! I think it insults the kids intelligence. .. except that I&#39;m not so sure right now seeing as my younger child seems to be paying a price here.<br/>\n<br/>\nThanks all!<br/>\nAgnieszka<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":39901,"nextTopicId":39932}}