{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Panic Attack","postDate":"1344385107","msgId":48890,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDQzODUxMDcuMjI5NjkuWWFob29NYWlsTmVvQHdlYjg3OTAxLm1haWwuaXIyLnlhaG9vLmNvbT4=","inReplyToHeader":"PDEzNDQzODQ0NDAuOTc2MzIuWWFob29NYWlsTmVvQHdlYjg3OTA1Lm1haWwuaXIyLnlhaG9vLmNvbT4=","referencesHeader":"PGp2cDl0citoZjU5QGVHcm91cHMuY29tPiA8anZzMGVkK2dqYXBAZUdyb3Vwcy5jb20+IDwxMzQ0Mzg0NDQwLjk3NjMyLllhaG9vTWFpbE5lb0B3ZWI4NzkwNS5tYWlsLmlyMi55YWhvby5jb20+"},"prevInTopic":48889,"nextInTopic":0,"prevInTime":48889,"nextInTime":48891,"topicId":48883,"numMessagesInTopic":0,"msgSnippet":"Ohh, I was just looking at the Cartoon Laws of Physics: http://will.ph/odonnells-laws-of-cartoon-motion is the","messageBody":"<div id=\"ygrps-yiv-17922266\">Ohh, I was just looking at the Cartoon Laws of Physics: <a rel=\"nofollow\" target=\"_blank\" href=\"http://will.ph/odonnells-laws-of-cartoon-motion%c2%a0is\">http://will.ph/odonnells-laws-of-cartoon-motion%c2%a0is</a> the original,  <a rel=\"nofollow\" target=\"_blank\" href=\"http://remarque.org/~doug/cartoon-physics.html%c2%a0has\">http://remarque.org/~doug/cartoon-physics.html%c2%a0has</a> some additions that are quite amusing. <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.dailymotion.com/video/xcocbs_chris-signore-the-cartoon-laws-of-p_fun%c2%a0is\">http://www.dailymotion.com/video/xcocbs_chris-signore-the-cartoon-laws-of-p_fun%c2%a0is</a> a video roughly applying Mark O&#39;Donnell&#39;s original ideas using cartoon examples. That&#39;s an understanding and an exploration that could tick quite a few boxes on an evernote entry. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.dailymotion.com/embed/video/xcocbs?wmode=opaque","type":"VIDEO"}]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Panic Attack","postDate":"1344384440","msgId":48889,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDQzODQ0NDAuOTc2MzIuWWFob29NYWlsTmVvQHdlYjg3OTA1Lm1haWwuaXIyLnlhaG9vLmNvbT4=","inReplyToHeader":"PGp2czBlZCtnamFwQGVHcm91cHMuY29tPg==","referencesHeader":"PGp2cDl0citoZjU5QGVHcm91cHMuY29tPiA8anZzMGVkK2dqYXBAZUdyb3Vwcy5jb20+"},"prevInTopic":48888,"nextInTopic":48890,"prevInTime":48888,"nextInTime":48890,"topicId":48883,"numMessagesInTopic":0,"msgSnippet":"... Yugi-oh cards and Pokemon cards and books have formed a huge part of Simon, in particular, but also Linnaea s understanding of numbers. Simon used to get","messageBody":"<div id=\"ygrps-yiv-1183114671\"><blockquote><span title=\"ireply\">&gt;&gt;Some examples of creative ways to learn math:&lt;&lt;<br/>\n<br/>\n<br/>\n </span></blockquote>Yugi-oh cards and Pokemon cards and books have formed a huge part of Simon, in particular, but also Linnaea&#39;s understanding of numbers. Simon used to get me to show him how tall each Pokemon was using whatever measures I had to hand. We have a game called Asterix and Obelix XXL that had multipliers as part of the scoring system. The more Roman Legions you slayed the more multipliers you get for slaying others, or so I remember. Simon figured out base 10 multiplication from that, sitting on my lap, giggling and multiplying. He also got really comfortable with Roman numerals. Linnaea loved Yahtzee, she even made a playing board for it, and got a fair bit of familiarity with numbers that way. Recently she&#39;s read a bit of a book called Alex&#39;s Adventures in Numberland. There were interesting ideas about numbers and cultural relationships with numbers in the bits she read. It spurred a few conversations about imagining what it is to be without the same framing<br/>\n of the world that you&#39;ve grown up as your own framing. <br/>\n<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/math/pamdice%c2%a0are\">http://sandradodd.com/math/pamdice%c2%a0are</a> some dice game ideas that Pam Sorooshian has played with her daughters that might be fun in your family. <br/>\n<br/>\nTanagrams are cool, there are online versions like: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.abcya.com/tangrams.htm,\">http://www.abcya.com/tangrams.htm,</a> looks like there are ipad apps,  or you can buy sets of tanagram blocks to play with. <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Square-Root-00013-Tangram/dp/B00000IZYC/ref=pd_sbs_op_5/191-0416213-7270121%c2%a0is\">http://www.amazon.com/Square-Root-00013-Tangram/dp/B00000IZYC/ref=pd_sbs_op_5/191-0416213-7270121%c2%a0is</a> similar to the set we have. Pattern blocks, magnetix (we have tons of those about, really good when you are just sitting watching television), lego, minecraft, puzzles, building blocks, kapla, fort building, all of those things are working on spatial awareness, mental rotation skills, approximating sizes and fractions, like cuisenaire blocks are used as math manipulatives (<a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Cuisenaire_rods)\">http://en.wikipedia.org/wiki/Cuisenaire_rods)</a>. <br/>\n<br/>\nThere are these wonderful videos that this woman Vi Hart does on youtube. <a rel=\"nofollow\" target=\"_blank\" href=\"http://vihart.com/%c2%a0is\">http://vihart.com/%c2%a0is</a> her blog. You can also get updates from her via facebook or subscribe to her channels on youtube. She doodles and talks about math and numbers and relationships. They are lovely videos. Linnaea and I have doodled as Vi Hart on more than one occasion. I often don&#39;t understand all that she is talking about, but she is wonderful to watch and listen to. And she&#39;s opened the world up to me in ways that it hadn&#39;t been opened before. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Panic Attack","postDate":"1344376549","msgId":48888,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2NjM4RjE1LUM0ODItNDVGNi05NDMzLTEyN0MxQzVBRTMzNUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGp2czBlZCtnamFwQGVHcm91cHMuY29tPg==","referencesHeader":"PGp2czBlZCtnamFwQGVHcm91cHMuY29tPg=="},"prevInTopic":48887,"nextInTopic":48889,"prevInTime":48887,"nextInTime":48889,"topicId":48883,"numMessagesInTopic":0,"msgSnippet":"... And maybe don t think in terms of learning math -- though they will be :-) Because if you have some image of what learning math looks like -- and it","messageBody":"<div id=\"ygrps-yiv-1840825319\">On Aug 7, 2012, at 5:13 PM, lindaguitar wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Some examples of creative ways to learn math:<br/>\n<br/>\n </span></blockquote>And maybe don&#39;t think in terms of learning math -- though they will be :-) Because if you have some image of what &quot;learning math&quot; looks like -- and it looks like school math or looks like them learning a certain aspect of math -- then it will be harder to see what they&#39;re actually doing.<br/>\n<br/>\nThink of it as ways they&#39;ll use numbers to figure out what they want to know.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":142480739,"authorName":"lindaguitar","from":"&quot;lindaguitar&quot; &lt;lindaguitar@...&gt;","profile":"lindaguitar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Panic Attack","postDate":"1344374029","msgId":48887,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp2czBlZCtnamFwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp2cDl0citoZjU5QGVHcm91cHMuY29tPg=="},"prevInTopic":48885,"nextInTopic":48888,"prevInTime":48886,"nextInTime":48888,"topicId":48883,"numMessagesInTopic":0,"msgSnippet":"A lot of the suggestions that Schuyler mentioned are things I would also recommend. Creating a journal, taking photos (and videos), categorizing your kids","messageBody":"<div id=\"ygrps-yiv-940939182\">A lot of the suggestions that Schuyler mentioned are things I would also recommend. Creating a journal, taking photos (and videos), categorizing your kids&#39; activities, after-the-fact, into school subject categories, etc.<br/>\n<br/>\nYou mentioned your 11 y.o. feeling stressed and &quot;put out&quot; about having to do a test that that seems to him like a waste of time.<br/>\n<br/>\n&quot;Doing math&quot; does NOT mean &quot;doing school&quot;. &quot;Math&quot; is not tests or boring, abstract problems in workbooks. It is using numbers, and playing with numbers.<br/>\n<br/>\nHave you asked him if there are other math and spelling/vocabulary (and other &quot;academic&quot; subject) activities that he would feel better about doing, to calm/reassure his father (and you)? <br/>\n<br/>\nAre there any math and word games he might enjoy playing? Would any of your other kids play with him?<br/>\n<br/>\nSome examples of creative ways to learn math:<br/>\n<br/>\nWould he (or any of your other kids) be interested in doing some geometric art, and learning, through the art process, how to bisect a line, construct a perpendicular line, add up the angles in a triangle, etc, by playing with a compass, protractor, straight edge, and some colored pencils? (Just an example of a math-art activity.)<br/>\n<br/>\nWould your older kids be interested in sitting with you when you pay the bills, and go over the household budget with you? That&#39;s also math.<br/>\n<br/>\nMy daughter was the bookkeeper for her scout group for a couple of 6-month periods, over the last 5 years. The scouts planned fundraisers, shopped for supplies, kept records of all funds spent and received, etc. That was math.<br/>\n<br/>\nWatching Schoolhouse Rock multiplication videos and singing along is a math learning activity that many kids enjoy.<br/>\n<br/>\nMeasuring ingredients while cooking is a math activity. <br/>\n<br/>\nWould any of your kids enjoy learning about binary math, and converting our regular base 10 numbers to binary numbers for a little while? (They could spend a while on Roman numerals, too.) Maybe they&#39;d enjoy watching a video about the evolution of computers, and how the binary system is the basis of computer programming. That would count as both math and science!<br/>\n<br/>\nWhat would your school-aged kids think of playing Scrabble, or Boggle, or an online game like Text Twist? Or even a simple game like Hangman? Or sitting with you and going through one of the Reader&#39;s Digest &quot;Word Power&quot; quizzes. You could then copy the word list (or just a link to it online), and put it into their homeschool folders.<br/>\n<br/>\nI used to play Text Twist myself (I love word games), and if a word came up that I thought my kids might not know, I&#39;d ask them if they knew it, and if not, I&#39;d tell them what it means, how it&#39;s spelled, and then add it to a list of vocabulary words we had discussed. (I did that for record-keeping, as a part of my compliance with a state law requiring homeschool parents to create and keep a year-end evaluation/assessment of some sort.) <br/>\n<br/>\nI kept a list of vocabulary words that came up in read-alouds, too, for a couple of years. I simply kept a notebook handy, and, after reading aloud, I went back and wrote down words that I had defined and spelled out for the kids while reading.<br/>\n<br/>\nI also looked up good definitions in a dictionary or online, if I wasn&#39;t sure of the definition. (Just last night, I looked up a word that was used in a TV show that I was watching with my daughter, when she asked what it meant. I thought I knew what it meant, but checked just to be sure I had defined it right.) I never turned looking up words or information into an &quot;assignment&quot; for my kids. But they saw me doing it all the time, and by the time they were in their teens, they had also picked up the habit of looking up answers to questions, and definitions to words, etc.<br/>\n<br/>\nJust looking at your message again ... I was thinking that you could take out the workbooks that you found for spelling and English, and just talk to your kids about a page or two, while they either look at the pages with you, or play or draw or something. They don&#39;t necessarily have to write anything in order to have learned from it.<br/>\n<br/>\nOn the other hand, you could just sell the workbooks, or keep them as reference books, but use vocabulary words that come up in stories or articles your kids read (or listen to), and on signs and labels, and in information they may look up online, as their &quot;spelling list&quot;. (Just discuss the spelling of each word once, and list those words in your journals.) <br/>\nSchool spelling lists are just arbitrary lists of words that some publishing company came up with. The words that your kids use are the words that they will need to know how to spell, whenever they want to write/type or look up information for their own purposes.<br/>\n<br/>\nLearning - even &quot;academic&quot; information, to try to satisfy their father&#39;s demands - does not have to be anything like &quot;doing school&quot;.<br/>\n<br/>\nLinda     <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;messy_boys&quot; &lt;messy_boys@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I&#39;m starting to have a school panic attack.  Going through some boxes to find misc things, I have come across our workbooks for spelling and English.  I thumbed through them and now I&#39;m feeling like we should be doing all that stuff!!!<br/>\n&gt; <br/>\n&gt; My ex is insisting we do some math.  I have my 11 yo taking an online diagnostic right now...just a diagnostic, and he is stressed and put out that he is having to waste his time.<br/>\n&gt; <br/>\n&gt; The thought of &quot;doing school&quot; makes me physically ill...but I can&#39;t shake the little voice that says I have to.  Not to mention my ex.<br/>\n&gt; <br/>\n&gt; Someone had said before that if I am satisfying the requirements of the state that I shouldn&#39;t worry about what my ex thinks.<br/>\n&gt; <br/>\n&gt; I don&#39;t know...I&#39;m just feeling really confused.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Panic Attack","postDate":"1344302572","msgId":48885,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdFNzVBNkY4LUI3NzQtNDZERS1BQTM0LUFDRTEyMzZEMzEzOUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEzNDQyOTc5NzAuNDU2NDMuWWFob29NYWlsTmVvQHdlYjg3OTAzLm1haWwuaXIyLnlhaG9vLmNvbT4=","referencesHeader":"PGp2cDl0citoZjU5QGVHcm91cHMuY29tPiA8MTM0NDI5Nzk3MC40NTY0My5ZYWhvb01haWxOZW9Ad2ViODc5MDMubWFpbC5pcjIueWFob28uY29tPg=="},"prevInTopic":48884,"nextInTopic":48887,"prevInTime":48884,"nextInTime":48886,"topicId":48883,"numMessagesInTopic":0,"msgSnippet":"... You can also take notes and records of things found on the internet with Evernote: http://evernote.com Here s a video: How to use Evernote to create an","messageBody":"<div id=\"ygrps-yiv-1060916666\">On Aug 6, 2012, at 8:06 PM, Schuyler wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Spend 20 minutes a day, or however long it takes, typing it into a computer with a folder for each child.<br/>\n<br/>\n </span></blockquote>You can also take notes and records of things found on the internet with Evernote:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://evernote.com\">http://evernote.com</a><br/>\n<br/>\nHere&#39;s a video: How to use Evernote to create an Unschooling Portfolio that Brie Jontry did:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=wIJxTjA_zK0\">http://www.youtube.com/watch?v=wIJxTjA_zK0</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/wIJxTjA_zK0?wmode=opaque","type":"VIDEO"}]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Panic Attack","postDate":"1344297970","msgId":48884,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDQyOTc5NzAuNDU2NDMuWWFob29NYWlsTmVvQHdlYjg3OTAzLm1haWwuaXIyLnlhaG9vLmNvbT4=","referencesHeader":"PGp2cDl0citoZjU5QGVHcm91cHMuY29tPiA="},"prevInTopic":48883,"nextInTopic":48885,"prevInTime":48883,"nextInTime":48885,"topicId":48883,"numMessagesInTopic":0,"msgSnippet":"You will probably always have to worry about what your ex thinks regarding your children. I don t think his opinion can not be a part of your decision making","messageBody":"<div id=\"ygrps-yiv-1491399205\">You will probably always have to worry about what your ex thinks regarding your children. I don&#39;t think his opinion can not be a part of your decision making regarding your children&#39;s lives and educational choices. <br/>\n<br/>\nThat said, there are ways to approach things and going at it from a panicked or fearful perspective is unlikely to help you or help your ex-husband to see how you are dealing with his children in a good and instructive manner. It will help a lot more if you can figure out how to look at your life for the learning that is already going on and see how you can frame that learning in a way that will help your husband to see more of it. <br/>\n<br/>\nYour ex-husband wants evidence of school work. Your children cover a fairly large range of ages, I&#39;m not sure if I remember all their ages, but they run from 2 to 14? You can probably do a lot of scholastic looking work with your younger children more easily than with your older children. I remember having far more pages of busy-work when I was younger than when I was older. When I was older it was more pages of writing and maths. One tends to worry less about the learning going on at 2 than one does at the learning going on at 14, but they work the same way. It&#39;s about exploration and incorporation and deduction and synthesis. It&#39;s about experience. <br/>\n<br/>\nSo, how do you demonstrate to your ex-husband that your children are learning when what he wants to see is paper and pencil work? Maybe flood him with evidence along the lines that Kelly mentioned in an earlier post. Look to write up your children&#39;s learning everyday. Get a notebook and carry it round with you, a little notebook that will fit in your back pocket, and fill in moments of learning that you see going on. Spend 20 minutes a day, or however long it takes, typing it into a computer with a folder for each child. Take pictures and use those in your documentation as well. Gather what they&#39;ve done over the day if there was any paper and pencil (or crayon) work and scan it into the computer to go into their file. Make it a habit. And print each one out and give them to your ex-husband, or a synopsis of them, on a regular basis. <br/>\n<br/>\nHere is a review and then an attached synopsis that Kelly Lovejoy wrote a while back in response to someone wanting to demonstrate the learning that her daughter had achieved: <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/message/28937.\">http://groups.yahoo.com/group/unschoolingbasics/message/28937.</a> Look to deconstruct and reconstruct your children&#39;s activity into school type headings. You could set up each of their files with a series of subject headings and drop what you&#39;d written in your back pocket notebook under the appropriate heading in your educational accounting moments. English; Maths; Science; Social Studies; Health and Physical Education; Applied Arts and Vocation/Technical Education and so on. A day in a life is filled with those, but it takes looking at it from a slightly skewed perspective to see it. And the more you look, the more you account it, the less panicked you will feel when someone questions the validity of your educational approach. Build up unschooling in your mind until you truly see<br/>\n the learning that is inherent in life. When your ex-husband worries about what his children are doing, you will know and you can comfort him and fill him up with a sense of wonder at how much they are learning and do know.<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":237699340,"authorName":"messy_boys","from":"&quot;messy_boys&quot; &lt;messy_boys@...&gt;","profile":"messy_boys","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Panic Attack","postDate":"1344285435","msgId":48883,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp2cDl0citoZjU5QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":48884,"prevInTime":48882,"nextInTime":48884,"topicId":48883,"numMessagesInTopic":0,"msgSnippet":"I m starting to have a school panic attack.  Going through some boxes to find misc things, I have come across our workbooks for spelling and English.  I","messageBody":"<div id=\"ygrps-yiv-1117935258\">I&#39;m starting to have a school panic attack.  Going through some boxes to find misc things, I have come across our workbooks for spelling and English.  I thumbed through them and now I&#39;m feeling like we should be doing all that stuff!!!<br/>\n<br/>\nMy ex is insisting we do some math.  I have my 11 yo taking an online diagnostic right now...just a diagnostic, and he is stressed and put out that he is having to waste his time.<br/>\n<br/>\nThe thought of &quot;doing school&quot; makes me physically ill...but I can&#39;t shake the little voice that says I have to.  Not to mention my ex.<br/>\n<br/>\nSomeone had said before that if I am satisfying the requirements of the state that I shouldn&#39;t worry about what my ex thinks.<br/>\n<br/>\nI don&#39;t know...I&#39;m just feeling really confused.</div>","specialLinks":[]}],"prevTopicId":48880,"nextTopicId":48886}}