{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":224193221,"authorName":"Tonya Matthews","from":"&quot;Tonya Matthews&quot; &lt;godzilla.matthews@...&gt;","profile":"auburntonya","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Suggestions for my dilemma? sorry... long","postDate":"1156625212","msgId":16801,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVjcWJ2cytkcmF1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY4NWIyZjIwNjA4MjQwNzEycjQ4MTFiNThjcjJmNTQ4ZTZjZGI0ZGU2Y0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":16704,"nextInTopic":0,"prevInTime":16800,"nextInTime":16802,"topicId":16694,"numMessagesInTopic":0,"msgSnippet":"... object. ... ~~~~ I m not sure I agree, Michelle. Maybe you d have to know my son to know what I mean. I m sure *I* could be more helpful to him but I don t","messageBody":"<div id=\"ygrps-yiv-2059441824\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Michelle/Melbrigða&quot; <br/>\n&lt;pamperedmichelle@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; On 8/22/06, Tonya Matthews &lt;godzilla.matthews@...&gt; wrote:<br/>\n&gt; &gt;  He clearly needs activities to help him<br/>\n&gt; &gt; feel upbeat, have something to look forward to, etc.<br/>\n&gt; <br/>\n&gt; This really struck me.  I&#39;m not sure why.  Your son needs *you* to<br/>\n&gt; help him feel upbeat.  Not things and activities are just active<br/>\n&gt; things.  No different really than a book, game, toy, or other <br/>\n </span></blockquote>object.<br/>\n<blockquote><span title=\"ireply\"> &gt; Just something to think about.<br/>\n </span></blockquote>~~~~<br/>\n<br/>\nI&#39;m not sure I agree, Michelle. Maybe you&#39;d have to know my son to <br/>\nknow what I mean. I&#39;m sure *I* could be more helpful to him but I <br/>\ndon&#39;t think there&#39;s much I can do to make him feel upbeat when I&#39;ve <br/>\ntried everything I know and he&#39;s still down. One thing that helps is <br/>\nexactly what I said and to get him out and in an activity. Whether <br/>\nthat&#39;s going somewhere, shopping for something or having a friend <br/>\nover. It used to be a shower/bath could change his mindset but not <br/>\nso much anymore :-( When he&#39;s truly down and in a mood like that, I <br/>\ntry and try and so does my husband and we can&#39;t pull him out of it <br/>\nsometimes. <br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I know I am asking a lot of questions and they are mainly <br/>\n </span></blockquote>rhetorical.<br/>\n<blockquote><span title=\"ireply\"> &gt; They are for you to ponder and think about. <br/>\n<br/>\n </span></blockquote>~~~ I appreciate it and I&#39;ve been thinking about all those questions.<br/>\n<br/>\nI did call his therapist again and I&#39;m going to talk to him in a <br/>\nweek. I think it&#39;s a combination of &#39;too much&#39; relaxing and perhaps, <br/>\na new stage of deschooling. Many old behaviors have reared their <br/>\nugly head around here and it&#39;s making me, in turn, fall back on old <br/>\nparenting behaviors(but I keep reading here and trying!!).<br/>\n<br/>\nI&#39;m going to be more mindful and try to consider each of my children <br/>\nand their needs. It sure is a juggling act, as many of you know!<br/>\n<br/>\nI appreciate the feedback and the food for thought.<br/>\n<br/>\nRegards,<br/>\nTonya</div>","specialLinks":[]},{"userId":212934673,"authorName":"Michelle/Melbrigða","from":"&quot;=?ISO-8859-1?Q?Michelle/Melbrig=F0a?=&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Suggestions for my dilemma? sorry... long","postDate":"1156428740","msgId":16704,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA4MjQwNzEycjQ4MTFiNThjcjJmNTQ4ZTZjZGI0ZGU2Y0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGVjZ2ptOSttMzVkQGVHcm91cHMuY29tPg==","referencesHeader":"PGVjZ2ptOSttMzVkQGVHcm91cHMuY29tPg=="},"prevInTopic":16694,"nextInTopic":16801,"prevInTime":16703,"nextInTime":16705,"topicId":16694,"numMessagesInTopic":0,"msgSnippet":"... This really struck me.  I m not sure why.  Your son needs *you* to help him feel upbeat.  Not things and activities are just active things.  No different","messageBody":"<div id=\"ygrps-yiv-1806986950\">On 8/22/06, Tonya Matthews &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:godzilla.matthews@...\">godzilla.matthews@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;  He clearly needs activities to help him<br/>\n&gt; feel upbeat, have something to look forward to, etc.<br/>\n<br/>\n </span></blockquote>This really struck me.  I&#39;m not sure why.  Your son needs *you* to<br/>\nhelp him feel upbeat.  Not things and activities are just active<br/>\nthings.  No different really than a book, game, toy, or other object.<br/>\nJust something to think about.<br/>\n<br/>\nOK, now some other thoughts.  Your son was upset that he slept so late<br/>\nand &quot;missed&quot; much of the day.  Three things keep running through my<br/>\nhead.  1.  Does he have an alarm clock of his own that he can control<br/>\nwhen he wakes up?  Can he determine when he would like to get up using<br/>\nan alarm clock.  I believe I bought an inexpensive radio alarm clock<br/>\nfor less than $10 a few years back.  2.  What does he feel he is<br/>\n&quot;missing&quot; by sleeping so late?  Is it a show on tv that could be<br/>\nrecorded?  Is it the notion that daytime is active time?  Can you help<br/>\nhim see that whenever he is awake things are going to happen?  3.<br/>\nDoes his medication play a part in how he sleeps?  Does it cause him<br/>\nto sleep longer than normal or more deeply?  Does it cause him to stay<br/>\nup later than he would like (or his he just a night owl)?  could the<br/>\ntime he takes it be changed so that he would naturally fall asleep<br/>\nbefore midnight?<br/>\n<br/>\nI have a child who used to be reluctant to join in things and then<br/>\nafterwards was glad that she did.  This has gone away since we started<br/>\nlearning to trust each other.  She has gone from &quot;No; I don&#39;t want to<br/>\ndo that even though it sounds like fun or is something I asked to do&quot;<br/>\nto &quot;Sure; I&#39;ll give it a try because I know if I truly don&#39;t enjoy it<br/>\nI know I don&#39;t have to finish or come back.&quot;  Does your son have that<br/>\noption?  Does he have the option or not completing something or not<br/>\nreturning to something?  Does he know he has this option?  Have you<br/>\ngone to activities where you and he could do things together?  What<br/>\ndoes *he* want to do?  What are his interests?  Doing things just to<br/>\ndo them is like collecting trading cards just to have them.  If you<br/>\nhave no joy in the cards, no interest in them, no delight in finding<br/>\nthat rare foil card, just collect them &quot;&#39;cause&quot; then what&#39;s the point?<br/>\n Do you have a playgroup or homeschool group that you can hang out<br/>\nwith on a regular basis (preferably one that has unschoolers<br/>\nattending)?<br/>\n<br/>\nI know I am asking a lot of questions and they are mainly rhetorical.<br/>\nThey are for you to ponder and think about.  I believe that one of the<br/>\nbiggest things when it comes to unschooling is trust.  If your<br/>\nchildren don&#39;t trust you they aren&#39;t going to trust themselves.  Be<br/>\nengaged in his world for a while.  Stay up with him to 1 am and find<br/>\nout what is so interesting for him at that time.  Strew his interests<br/>\nto help him expand his world.<br/>\n<br/>\n-- <br/>\nMichelle<br/>\naka Melbrigða<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://eventualknitting.blogspot.com\">http://eventualknitting.blogspot.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MedHS@yahoogroups.com\">MedHS@yahoogroups.com</a> - Homeschooling for the Medieval Recreationist</div>","specialLinks":[]},{"userId":224193221,"authorName":"Tonya Matthews","from":"&quot;Tonya Matthews&quot; &lt;godzilla.matthews@...&gt;","profile":"auburntonya","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Suggestions for my dilemma? sorry... long","postDate":"1156305417","msgId":16694,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVjZ2ptOSttMzVkQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":16704,"prevInTime":16693,"nextInTime":16695,"topicId":16694,"numMessagesInTopic":0,"msgSnippet":"Hi, I ve posted here before so I hope my story is a bit familiar. It s a lengthy one but I ll try to make it brief. My oldest son, Christian/11, attended","messageBody":"<div id=\"ygrps-yiv-1198810738\">Hi,<br/>\n<br/>\nI&#39;ve posted here before so I hope my story is a bit familiar. It&#39;s a <br/>\nlengthy one but I&#39;ll try to make it brief.<br/>\n<br/>\nMy oldest son, Christian/11, attended school through to the 4th <br/>\ngrade. He has been tested, diagnosed, medicated, tutored, in <br/>\ntherapy, in &#39;pull out&#39;.. etc etc etc.<br/>\n<br/>\n Let me talk about right now. We decided to homeschool him when he <br/>\nwas late to school EVERY day because he didn&#39;t want to go. He was <br/>\nseriously depressed and suicidal. It was mostly because of the other <br/>\nkids and not feeling like he fit in. He didn&#39;t necessarily mind the <br/>\nteacher (liked her, actually) or the classroom learning style. We&#39;re <br/>\ngoing on our second year at home. We&#39;ve been deschooling and have <br/>\ndecided to unschool the kids after some soul searching.<br/>\n<br/>\nWe&#39;re not radical unschoolers completely, but that&#39;s just for a <br/>\nframe of reference. I&#39;m all over the place here, so forgive me, but <br/>\nmy thoughts are racing and I&#39;m trying to get enough info out to get <br/>\nsome suggestions.<br/>\n<br/>\nI believe in not &quot;making&quot; a child do things. Christian will often be <br/>\nup late(1 am and beyond) and sleep until noon. I try to get him up <br/>\nby noonish (if there&#39;s no where we have plans to be). Yesterday, I <br/>\ncouldn&#39;t get him to rouse so I let him sleep. At 3:30 a friend <br/>\ncalled and invited us over to shoot off rockets. I woke Christian <br/>\nand told him and asked him if he wanted to go. Firstly, he was upset <br/>\nthat it was 3:30 and that he&#39;d missed so much of the day. Secondly, <br/>\nhe didn&#39;t know if he wanted to go. I, in my heart, felt that he was <br/>\nrather depressed and was reluctant to go because of that. I know him <br/>\nenough to know that he&#39;d typically really enjoy this activity. I <br/>\nurged him to shower and said that that would probably make him feel <br/>\nbetter and then he could decide. He did that, he hemmed and hawed <br/>\nand stressed over his decision. I told him we would all go and if he <br/>\nwanted to leave, we&#39;d leave. So we went. He had a fabulous time, as <br/>\nwe all did, and we came home. <br/>\n<br/>\nI&#39;ll leave out the rest because I want to try to get to my point. <br/>\nWhen he was stressing over whether he should go or not, we touched <br/>\non the idea that maybe he needs things to do, scheduled things, that <br/>\nhe enjoys to help him through the week. My two boys are signed up to <br/>\nstart Karate in Sept. They both are excited to start this. Christian <br/>\nis a little fretful because he saw his blackbelt bound friend and <br/>\nthought it looked too hard. I did let him know that you don&#39;t START <br/>\nout that way, you work up to it. We also have a group we belong to <br/>\nthat has some structured activities. I know.. not unschooly of me.. <br/>\nbut the kids really enjoy it.<br/>\n<br/>\nThis is my question. Christian, if he keeps along the same way he&#39;s <br/>\nalways been, will want to sign up for these things and then give me <br/>\na LOT of trouble about going the day of the event. He has a very <br/>\ndifficult time with transitions, typically. Lots of times he&#39;ll <br/>\nfight me about going, he&#39;ll balk and complain the whole way and then <br/>\ndig his heels in about joining in. Then, once he joins in and the <br/>\nevent is over, he&#39;ll thank me, he&#39;ll apologize for having been <br/>\ndifficult and he&#39;ll be in a super mood.<br/>\n<br/>\nWhat do I do with this? I&#39;ll admit, I used to &#39;make&#39; him do whatever <br/>\nit was .. most of the time. He clearly needs activities to help him <br/>\nfeel upbeat, have something to look forward to, etc. He felt awful <br/>\ntoday when I came back home and found him sleeping and it was 3pm. I <br/>\nhad tried to wake him before I left and so did my husband, to no <br/>\navail. He even went so far to say he hated himself.<br/>\n<br/>\nSo what I&#39;m asking is what do I do when he balks about doing <br/>\nsomething when I know he enjoys it and will enjoy it after?<br/>\n<br/>\nThanks in advance,<br/>\nJust one more fyi, he is on Zoloft for depression and anxiety.<br/>\n<br/>\nWarm regards,<br/>\nTonya</div>","specialLinks":[]}],"prevTopicId":16682,"nextTopicId":16835}}