{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":7644358,"authorName":"Kidgie@aol.com","from":"Kidgie@...","profile":"mama_de_julian_y_julia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: You don&#39;t make them do anything??Radical Unschool...","postDate":"1191364120","msgId":26660,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQxNy4xNzc0OTdhMy4zNDM0MjAxOEBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":26659,"nextInTime":26661,"topicId":26660,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/2/2007 1:50:26 P.M. Pacific Daylight Time, luvbullbreeds@gmail.com writes: Thank  you Karen!  That really is all I m trying to get.  It s","messageBody":"<div id=\"ygrps-yiv-23295357\">In a message dated 10/2/2007 1:50:26 P.M. Pacific Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:luvbullbreeds@...\">luvbullbreeds@...</a> writes:<br/>\n<br/>\nThank  you Karen!  That really is all I&#39;m trying to get.  It&#39;s  radically<br/>\ndifferent from how life looks to me at least from a wide angle  view.  <br/>\nNarrowing the view might help for now. *I* take one issue at a time and  work <br/>\non developing it with the kids. It helps me to do that, to move a it slowly  <br/>\n- first in thought, then in action. Its been good!<br/>\n<br/>\nHere<br/>\nmy kids (11 and 9) do help decide what&#39;s for dinner.  They  pick out their<br/>\nown clothes (within reason) and they collaborated with us on  the new<br/>\nfurniture we bought.  <br/>\nMay I ask you, what &quot;in reason&quot; means for you? It means different things to  <br/>\ndifferent people, so I&#39;d like to understand your ideas on that. <br/>\n<br/>\nBUT we  made the final decision.  <br/>\nOne day, they will have their own furniture to choose, and that&#39;s great!  <br/>\nFamilies lookingat what is important as a group, is what makes sense to me. <br/>\n<br/>\nWhat  I&#39;ve been<br/>\nreading *looks like* kids get the final say no matter what and  that is both<br/>\ndifferent and to my mind irresponsible.  And no, not just  on this list.<br/>\nOther places too.  I&#39;ve been doing a pretty hefty amount  of reading.  One<br/>\nsite mentioned her daughter (age 4) has been eating  only ice cream for 6<br/>\nmonths because that&#39;s all she&#39;s wanted!  The  writer was joyous about this.<br/>\nThat sounds confusing. *I* don&#39;t read this stuff that way, and obviously  <br/>\nneither do others here. But taking the developmental aspects into more than just  <br/>\nconsideration I DO see. I see people trying to help each family member feel  <br/>\nequally valued and as important as the other. That may appear to be  <br/>\nirresponsible, especially when the parental convention is in place. And that&#39;s  ok! I <br/>\nthink the biggest issue &quot;we&quot; have here, is that you are, dare I say, still  <br/>\nthinking within convention. That&#39;s no crime! But here, we seem to mainly think  <br/>\nas creatively as possible, with parent-child equality being top and foremost.  <br/>\nYou may not see it that way. We tend to go for the idea that husbands, older  <br/>\nkids, smaller kids - all have the SAME say in things. Now, when my DH eats <br/>\nwhat  I call &quot;crap&quot; all day, for weeks, he does hear from me! I worry about his  <br/>\nhealth, I am concerned, we talk about it. But I don&#39;t &quot;ban&quot; it. Even if I <br/>\nCOLD,  should I? Should I limit his crappy food intake? Or would it be best for me <br/>\nto  help him out by eating well myself, providing healthy foods at home and <br/>\nhave  patience, hoping he comes around to healthier ways of living? Partners do <br/>\nthat  latter, while convention tells us otherwise. Ice cream only for 6 <br/>\nmonths? Not  possible here - too many financial constraints first off. The rest is <br/>\ntoo  personal for me to delve into. Do I agree? Nope. But is it MY child, and <br/>\nMY life  and MY situation? Nope. But I can appreciate the idea behind it - <br/>\neven if I  would chose a different way to mange it with my child. I&#39;m not in that <br/>\nfamily&#39;s  shoes, I haven&#39;t walked a mile in them, so I can only guess. And I <br/>\nthink that is  one of the main points. You are not in our shoes, we are not in <br/>\nyours. but what  can we ALL learn from these exchanges? Focusing on our <br/>\nsimilarities will help.  But instead, the differences have been highlighted. <br/>\nHopefully, that makes sense,  lol! <br/>\n<br/>\n<br/>\nIt&#39;s  these kinds of things that have me befuddled.  If this is what is  meant<br/>\nby the philosophy well, I can&#39;t abdicate parenting.  That&#39;s  negligence.  If<br/>\nit&#39;s more a matter of treating kids like they have a  brain in their heads<br/>\nand can be a part of life then that&#39;s totally  different and how I&#39;ve been<br/>\nraising mine all along.  HOWEVER, I still  insist they move their bodies, try<br/>\nto eat well, and clean their rooms and  bathroom.  They are a part of the<br/>\nfamily, not reigning over  it.<br/>\nI understand, but do not agree with your terminology. I can&#39;t &quot;insist&quot; my  <br/>\nkids exercise, though I do have my daughter (15) walk home from school (which  <br/>\nI&#39;d rather her not be, lol, but that&#39;s a long story) I close their doors in  <br/>\ntheir rooms (since then, they have come to hate mess and their rooms look better <br/>\n than the living room, lol!) I am the sole grocery shopper. I buy the <br/>\nhealthiest  food I know of that suits us all, and I do say &quot;no.&quot; But I say &quot;no&quot; due <br/>\nto  financial constraints, not just because. We talk, we shop together,  they <br/>\nwant something, I read the label, we talk about what it is and I offer  <br/>\nalternatives if it&#39;s an expensive or an item I have issues with health-wise. (I  have <br/>\nhuge high Fructose Corn Syrup issues and Hydrogenated oils...other than  <br/>\nthat, I&#39;m ok, lol). But not all of us are like that here. I tend to think I&#39;m  <br/>\nmore conventional (and for the first time in my life EVER is this the case,  <br/>\nlol!) than a few others here. And that&#39;s ok. I have lots to learn - and the  thing <br/>\nis, we ALL can learn from one another here. I am enjoying letting go of  <br/>\nconvention more and more...especially with my older teens. I now have them  <br/>\ntalking to me. Honestly. About their lives, their REAL lives, not just what they  <br/>\ndisplay to most adults. I am so damned lucky and my heart is so full because of  <br/>\nthis. The more I let go, the safer they are, but by their own volition, NOT <br/>\ndue  to my controlling their choices and behaviors. It&#39;s been a long road in <br/>\nmany  ways - from my children- actually, from my parents and THIER parents, to <br/>\nmine,  to theirs...Life is becoming more and more joyful. And it&#39;s STILL <br/>\nexasperating  and STILL wrought with teen angst, lol...and parental ;) But it&#39;s ok. <br/>\nThe  process is enjoyable. I get to be equal, not the same, as my kids - from <br/>\nalmost  20 to just turned 2. Equality feels so good. <br/>\n<br/>\n<br/>\n<br/>\nBut I thank you for your honest attempt at an  explaination.  That was very<br/>\nkind of you. I hope you get to feeling  better soon! =)<br/>\n<br/>\nKaren<br/>\nYou are VERY welcome. I am a mediator at heart :) I hope that the  <br/>\nconversation continues here. There is much out there that we can all benefit  from. <br/>\nLearning is a Neverending Story, is it not? :) (my son&#39;s middle name is  Atreyu - <br/>\nfrom The Neverending Story :) ) <br/>\n <br/>\nTake care, stay open as possible...<br/>\nKaren PS<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n************************************** See what&#39;s new at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com\">http://www.aol.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":26596,"nextTopicId":26664}}