{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":170260284,"authorName":"sandrewmama","from":"sandrewmama &lt;sandrewmama@...&gt;","profile":"sandrewmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: kids asking for things (long)","postDate":"1096559020","msgId":3368,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJEODE5M0RDLjI1ODclc2FuZHJld21hbWFAbWNoc2kuY29tPg==","inReplyToHeader":"PDEwOTY1NDA2NzYuMzY3LjYzNjY4Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":3367,"nextInTime":3369,"topicId":3368,"numMessagesInTopic":0,"msgSnippet":"Colleen and all, I don t have any help for you but have a similar concern.  I ve been trying to figure out how to pose this question to this list for some time","messageBody":"<div id=\"ygrps-yiv-2017154135\">Colleen and all,<br/>\n<br/>\nI don&#39;t have any help for you but have a similar concern.  I&#39;ve been trying<br/>\nto figure out how to pose this question to this list for some time now.  My<br/>\n13 yo is clever and kind and gentle and loving and principled and extremely<br/>\nsensitive to other&#39;s criticisms, real or perceived.  Unfortunately, I didn&#39;t<br/>\nstop trying to fix him until very recently and so he has 13+ years of built<br/>\nup something, I don&#39;t know what to call it.  So often he is timid about<br/>\nasserting his wishes, afraid to try new activities, afraid of being judged,<br/>\nincredibly self-effacing, moody (which I suspect is partly due to his age)<br/>\nand is struggling to find what his passions are.<br/>\n<br/>\nI was raised in a dysfunctional household where I learned to keep a low<br/>\nprofile and stay off my father&#39;s radar screen as much as possible.  Although<br/>\nI don&#39;t have vivid memories, I know that every time I opened my mouth I was<br/>\nsetting myself up to be fixed -- grammar corrected, concept explained,<br/>\nopinion belittled, etiquette corrected.  I know this because I recognize<br/>\nthese tendencies in myself as a parent and I can just feel it coming from<br/>\nthat &quot;innate&quot; what-I-learned-from-my-parents place inside of me. Over the<br/>\nyears I&#39;ve become more aware of these tendencies, identified them as they&#39;re<br/>\nabout to appear and suppressed or released them but not, I&#39;m afraid, before<br/>\ncausing damage to my dear son.<br/>\n<br/>\nWe&#39;d gone along doing what I thought was unschooling for many years.  Last<br/>\nyear I was frustrated by the lack of self-direction he exhibited so I<br/>\ndecided to take back control.  I started giving him daily assignments while<br/>\nat the same time imploring him to tell me what his interests were.  I<br/>\nassured him that as soon as he found a topic of interest we would let that<br/>\nlead his &quot;school work.&quot;<br/>\n<br/>\nThen, in January he got sick.  For six weeks he went undiagnosed despite<br/>\nfive trips to the doctor&#39;s office.  His illness derailed, thank goodness,<br/>\nall the structure that I&#39;d imposed.  He was ill for several months.  There<br/>\nwere aspects to his illness that were very disconcerting and confusing for<br/>\nhim and his father and I.  There was a strong psycho-somatic aspect to the<br/>\nlingering symptoms but it was very difficult for any of us, especially my<br/>\nson, to understand when his symptoms were psycho-somatic and when they were<br/>\ngenuinely caused by disease.  The symptoms were so severe that they<br/>\ninterfered with every aspect of his daily life. Although he was&#39;t in pain,<br/>\nhe was bedridden or homeridden most of 6 months. He became so confused, as<br/>\ndid I, and didn&#39;t trust himself to know up from down.  He quit playing his<br/>\nmusical instrument, something he&#39;d loved and had particpated in our school&#39;s<br/>\nband, jazz band and received recognition for his talent.<br/>\n<br/>\nAs you can tell, I&#39;m still processing all that happened last winter and<br/>\nspring.  He didn&#39;t completely recover until June.  He&#39;s barely touched his<br/>\ninstrument again.  He does not wish to return to playing with the school<br/>\nband, which I totally understand (being the only homeschooler amongst 70+<br/>\nmiddle-school kids -- rough!) nor does he want to restart his private<br/>\nlessons. He is a voracious reader -- mostly of the medeival fantasy and<br/>\nhistorical fiction genres.  He is also very into RPG Video Games.<br/>\n<br/>\nBut, for whatever myriad of reasons he seems to have a low self-esteem, is<br/>\nanxious to the point of frequent tears around those who he perceives as<br/>\npassing judgement on him (ie. grandparents who don&#39;t understand our<br/>\nhomeschooling/lifestyle/politics/lack of religion, clarinet teacher,<br/>\nfriends&#39; parents) and is not willing to take chances putting himself in<br/>\nsituations where he might experience this anxiety -- like any kinds of<br/>\nclasses, contests, competition or even hanging out with his cousins.<br/>\n<br/>\nI&#39;ve done a fine job of teaching him what is wrong with him and now I need a<br/>\nway to undo as much of that as possible and show him what a beautiful,<br/>\nbright, talented, compassionate, and interesting fellow he is.   Any ideas?<br/>\n<br/>\nChris<br/>\n<br/>\non 9/30/04 5:37 AM, technomom4 wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Hey Dear Readers:<br/>\n&gt; for those of you that attended the recent Live and Learn Conf,  I am referring<br/>\n&gt; to Kelly Lovejoy&#39;s article in our attendee&#39;s binder entitled: &quot;The Three<br/>\n&gt; Stages of Unschooling&quot; Stage 1. To reference my thoughts, here is part of<br/>\n&gt; Kelly&#39;s writing:<br/>\n&gt; <br/>\n&gt; &quot;Two of my passions as a child were dogs and horses. Dogs and horses are NOT<br/>\n&gt; taught in any grade, Middle or HIgh School *!* know of. But I wanted to learn<br/>\n&gt; everything I could about them. My parents gave me dogs and horses. They bought<br/>\n&gt; me books and paid for me to take riding lessons and dog obedience classes,<br/>\n&gt; They paid for dog and horse shows and equipment..........&quot;<br/>\n&gt; <br/>\n&gt; Now Kelly, as a child, was &quot;bold&quot; (bold may not be the proper  nference here!)<br/>\n&gt; enough to ask, mention or suggest to her parents , her interests. and they<br/>\n&gt; responded. But what if you have a child ( maybe a really shy one in the<br/>\n&gt; family)  who may not want to &quot;bother &quot; his parents with his needs (maybe<br/>\n&gt; really feel not worthy to deserve them) or just afraid to ask, for feeling<br/>\n&gt; that he may be rejected,,,,,, Some kids are truly gifted to be frugal and may<br/>\n&gt; not see the need or feel the need to buy things for just themselves. They may<br/>\n&gt; be thinking that spending the money on themselves is/would be a waste of<br/>\n&gt; money. <br/>\n&gt; How do you go about telling a child that it is OK to think about their<br/>\n&gt; personal wants as not being selfish, self-centered or such.? And let the child<br/>\n&gt; to gradually see that their wants are important too!<br/>\n&gt; Colleen in GA<br/>\n&gt; PS maybe Kelly was raised as an only child !!<br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":3364,"nextTopicId":3350}}