{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":136871563,"authorName":"ENSEMBLE S-WAYNFORTH","from":"ENSEMBLE S-WAYNFORTH &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [unschoolingbasics] tv, violence, passion","postDate":"1195478669","msgId":27816,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwODU4Mi4yNjcucW1Ad2ViODYyMDkubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":27808,"nextInTopic":0,"prevInTime":27815,"nextInTime":27817,"topicId":27806,"numMessagesInTopic":0,"msgSnippet":"====================== - Son is deschooling via tv, computer games. Noise from it is bothersome, but he agrees to turn it down. Now, the very electronic energy","messageBody":"<div id=\"ygrps-yiv-432833307\">======================<br/>\n<br/>\n- Son is deschooling via tv, computer games. Noise from it is <br/>\nbothersome, but he agrees to turn it down. Now, the very electronic <br/>\nenergy of it bugs me. Our small house feels different with the <br/>\nelectronic gadgets going in it, compared to when they are off and <br/>\nphysical-world activities are going on. I greatly prefer the latter. I <br/>\nwant to be open and accepting of him. Question - how to tolerate my <br/>\nson&#39;s choces when I just don&#39;t like them? <br/>\n====================== <br/>\nIs your son deschooling from school at home or from school at school? Surely just his presence, either way, his more free, less controlled presence is changing the feeling of your small house? Are you blaming your adjustment to his more constant presence on &quot;electronic gadgets&quot; as some sort of scapegoat? Are there other things that are wearing at you? Could you buy a nice set of wireless headphones so that he could listen to his shows without bothering you? Although I would recommend that you sit down with him and watch with him instead of isolating his television watching to some corner of the house because it irritates you. The best part of unschooling that I practice is getting involved with my children in what they are doing. I love to play video games with them or to find movies or television programs that I think they will like and watch them with them. Or to find card games to play or to build playdoh structures with Linnaea. Or to find a new<br/>\n Asterix and Obelix comic to read with Simon, or an old one that we haven’t read for a while. I love to feather their nests with engaging and interesting ideas that I can enjoy with them. And they love to share the things they find with me. I love being able to help them with something, right now I’m helping Simon to figure out how to put a telescope together on Sims 2 Castaway. In the process of searching through the internet we didn’t find the telescope blueprint, but we did find how to access the map and how to find the Chef, who he didn’t know existed and he and I got to talk and work through a problem and get distracted and use the internet as an amazing reference.<br/>\nYesterday I took the compost out in the dark and as I walked back up to the house the light from the sunroom and the images of Pete and Pete on the television felt so welcoming and so homey to me. I loved walking into the noise and light and the warmth and the action. I loved hearing the voices of conversation and engagement in our home. It was even more so because Simon invited me to watch Pete and Pete with him. David, Linnaea, Simon and I had watched Naussica the night before and I commented that I enjoyed sitting and watching a DVD together and he said, &quot;let&#39;s watch Pete and Pete tomorrow&quot; so the television with Pete and Pete on was also about him and I connecting and getting together to laugh at Artie the Strongest Man in the World together (or is that with Artie the strongest Man in the World?). <br/>\n<br/>\n=============================<br/>\n- Most video and computer games seem to involve one character whacking <br/>\nanother. I&#39;m so tired of sights and sounds of whacking. I know being a <br/>\nfemale and a Quaker make this harder for me to understand. How do <br/>\nothers cope with constant battling sights and sounds?<br/>\n===============<br/>\nI love some of the noise from video games. Since Live and Learn David has gotten into Guitar Heroes in a big way. I love sitting and watching that man o’ mine on a yoga ball, playing guitar for all he is worth. I love hearing the rock songs of my teen years and beyond and watching him hit and miss notes. <br/>\nThere is amazing music in video games: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=qUc88sGfE-M\">http://www.youtube.com/watch?v=qUc88sGfE-M</a> is a really fun video looking at the music. Here is a wonderful biography of Nobuo Uematsu who composes music for video games <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nobuouematsu.com/bio.html.\">http://www.nobuouematsu.com/bio.html.</a> You can find some of his work on you tube as well: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=9A_MsqiiO08\">http://www.youtube.com/watch?v=9A_MsqiiO08</a> is one. There is an amazing looking game for the Xbox 360 called Eternal Sonata that is about Chopin: <a rel=\"nofollow\" target=\"_blank\" href=\"http://eternalsonata.namcobandaigames.com/.\">http://eternalsonata.namcobandaigames.com/.</a> One of my favorite ds games is Electroplankton, a complete performance art piece that you get to perform. Explore here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://electroplankton.nintendods.com/flash.html\">http://electroplankton.nintendods.com/flash.html</a> . Really cool!!! I should say that much of my awareness of the glory of the music of video games comes via Kelli Traaseth pointing it out, thanks Kelli. <br/>\nBut the sound I most love, the sound that makes my most happy, is the sound of Simon and Linnaea laughing and shouting and playing with such joy and excitement and focus. Even when there are moments of tension, they come not because the games are making them violent, or because they are having a hard time watching blood spurt from the face of one of the people they are wrestling, but because they are so focussed, so interested, so engaged, and are working so hard to master the difficult skills that are required to move from level to level, that the distraction of other things makes them tense. <br/>\n=====================<br/>\n<br/>\n- I am taking to heart the advice to follow my passions. That, also, <br/>\nseems to interfere with ds&#39;s choices. I also envision him joining me in <br/>\nsome of these things - hiking, learning Aikido, bicycling, etc. I <br/>\nreally like doing things with him (which is a reason I love <br/>\nhomeschooling. He declines my offers to joni me in those activities. <br/>\nHe&#39;s old enough to left alone for a few hours. <br/>\n=========================<br/>\nMaybe he doesn’t trust your motivation for inviting him? Maybe he thinks you are inviting him more to get him to stop him from doing something than because you want to have him join you? Maybe you’ve used outside activities in the past as a way of controlling what he was doing? Maybe he doesn’t have a positive relationship with the things you love? Simon doesn’t like to go out on hikes very often, but because we don’t force him, when he does chose to go he usually has a blast. He has no negative associations with going out hiking and he gets to choose freely to come along. I would guess that your son, given enough time, will choose to come with you sometimes. But you need to give him time. <br/>\n======================<br/>\nThe one in-home activity <br/>\nI&#39;d like to do is playing music, which would interfere with his choice <br/>\nof screen activities. I think I&#39;ll ask him for some time to play my <br/>\nmusic, and we can agree on a good time for that. <br/>\n=====================<br/>\nCan you get him headphones so that he can play his games and watch his shows without having your desire to play music hinder that? <br/>\n <br/>\n ==========================<br/>\nEventually, the basement will be fixed up and we will move the tv down there, but for <br/>\nnow, we share one open kitchen/office/music/living space. Do I just <br/>\nleave him alone to watch tv while I go do something fun? That seems odd <br/>\nto me. Any ideas.<br/>\n=======================<br/>\nThe idea of moving the TV down to the basement makes me uncomfortable. The basement of my childhood was damp and dark and a place where my toys were relegated when my parents decided I had outgrown them. I would play down there with little interaction with other family members. It is were I used to sneak cigarettes when it was too cold to go outside because it was so removed from the rest of the house. Are you planning on putting the television down there so that it doesn’t effect your life so much? Are you planning on thus relegating your son and his interests to an area where he will be isolated from you and your life? I would think long and hard before I sent my boy to the basement to do the things he loves. We have a 3 bedroom house with a smallish living room, a kitchen/dining room and a small sunroom, and a small room off the living room where the desktop computer and the sewing machine sit. Everyone hangs out in the main rooms of the house.<br/>\n Unless I’m in one of the bedrooms, they are almost never used except for sleeping or when a friend is over. But even then, everyone really wants to be with everyone else. If I were to put the Wii or the PS2 in the back bedroom with a really nice television and some comfy chairs I imagine it would never get used. We like to be together. And I love that.<br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/qUc88sGfE-M?wmode=opaque","type":"VIDEO"},{"url":"http://www.youtube.com/embed/9A_MsqiiO08?wmode=opaque","type":"VIDEO"}]},{"userId":288405080,"authorName":"diana jenner","from":"&quot;diana jenner&quot; &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] tv, violence, passion","postDate":"1195427257","msgId":27808,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDcxMTE4MTUwN2ozNDIxYzkzYXI3YjFiYWU2ZWM1NjEwMmIzQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGZocGdybSs0dmk0QGVHcm91cHMuY29tPg==","referencesHeader":"PGZocGdybSs0dmk0QGVHcm91cHMuY29tPg=="},"prevInTopic":27806,"nextInTopic":27816,"prevInTime":27807,"nextInTime":27809,"topicId":27806,"numMessagesInTopic":0,"msgSnippet":"... Breathe deep. And again. Then remember his choices don t have to be yours; They don t even have to look like or feel like yours, they re his. You have a","messageBody":"<div id=\"ygrps-yiv-1439060025\">On Nov 18, 2007 6:05 AM, rpindc04 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robbin_mp@...\">robbin_mp@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   -Question - how to tolerate my son&#39;s choces when I just don&#39;t like them?<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Breathe deep. And again. Then remember his choices don&#39;t have to be yours;<br/>\nThey don&#39;t even have to look like or feel like yours, they&#39;re his. You have<br/>\na chance right here to be *that* parent, the one who loves whatever it is<br/>\nthe kid loves, simply because you love your kid and want to provide and<br/>\nshare opportunities for joy in his short life. It&#39;s tough, not impossible...<br/>\nworthwhile shift!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; - Most video and computer games seem to involve one character whacking<br/>\n&gt; another. I&#39;m so tired of sights and sounds of whacking. I know being a<br/>\n&gt; female and a Quaker make this harder for me to understand. How do<br/>\n&gt; others cope with constant battling sights and sounds?<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Honestly, I still cringe sometimes... then I remember we&#39;re talking about<br/>\npixels, not people and not property. Dancing dots on a screen. Not a<br/>\nreflection of who he is, a source of entertainment (that could lead to<br/>\nbigger and better things: Kirby Dodd just got a job working for a major<br/>\nvideo game corporation out of his love for their product!)<br/>\nIt is a sense of disconnect that creates a need to act out violently, not<br/>\ngames (folks have been beating one another over the head with the proverbial<br/>\nclub since the dawn of humanity, it seems.... video games are certainly not<br/>\nas old as humans as a species!) - by creating a place of connection<br/>\n(trust/respect/honor/safety/LOVE) within your family you&#39;re taking the first<br/>\nand biggest step away from raising a sociopath! I&#39;ve never heard of a serial<br/>\nkiller who was attachment parented and respected and listened to his whole<br/>\nlife long...<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; - I am taking to heart the advice to follow my passions. That, also, p<br/>\n&gt; seems to interfere with ds&#39;s choices. I also envision him joining me in<br/>\n&gt; some of these things - hiking, learning Aikido, bicycling, etc. I<br/>\n&gt; really like doing things with him (which is a reason I love<br/>\n&gt; homeschooling.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I have had to examine &quot;is this something *I* want to do, or is it something<br/>\nI want to do *with X*&quot;<br/>\nIf it&#39;s important to me, I&#39;ll find a way to carve out a way to do it.<br/>\nSometimes that means I wait until my child is old enough to not have to be<br/>\ndragged along. Sometimes it means being creative with how to make it happen.<br/>\nThere&#39;s not an *interference* when both sides are respecting what gives joy<br/>\nto the other.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He declines my offers to joni me in those activities.<br/>\n&gt; He&#39;s old enough to left alone for a few hours. The one in-home activity<br/>\n&gt; I&#39;d like to do is playing music, which would interfere with his choice<br/>\n&gt; of screen activities.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>When I&#39;ve been honoring Hayden&#39;s wishes, fulfilling his needs (as a mama,<br/>\nnot as a martyr), he is quick to do the same for me. [though I have to say,<br/>\nI&#39;ve seen the martyr in the mirror of my son sometimes and as much as it<br/>\nbreaks my heart that I modeled such a thing to him, it is a hilarious<br/>\nversion of me that always makes me chuckle - and knock it the heck off!]<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think I&#39;ll ask him for some time to play my<br/>\n&gt; music, and we can agree on a good time for that.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>A great idea!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Eventually, the<br/>\n&gt; basement will be fixed up and we will move the tv down there, but for<br/>\n&gt; now, we share one open kitchen/office/music/living space.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Don&#39;t be surprised if the separation of floors feels lonely! Hayden would<br/>\nrather watch the portable DVD player with headphones than for me to leave<br/>\nthe room to read in quiet. He wants to be near me, with me (what an<br/>\nhonor!!).<br/>\n<br/>\nDo I just<br/>\n<blockquote><span title=\"ireply\"> &gt; leave him alone to watch tv while I go do something fun? That seems odd<br/>\n&gt; to me.<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Then think of it as &quot;I&#39;m leaving him to do what he loves and going to do<br/>\nwhat I love - win/win&quot;<br/>\n-- <br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":90144972,"authorName":"rpindc04","from":"&quot;rpindc04&quot; &lt;robbin_mp@...&gt;","profile":"rpindc04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"tv, violence, passion","postDate":"1195394742","msgId":27806,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZocGdybSs0dmk0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":27808,"prevInTime":27805,"nextInTime":27807,"topicId":27806,"numMessagesInTopic":0,"msgSnippet":"- Son is deschooling via tv, computer games. Noise from it is bothersome, but he agrees to turn it down. Now, the very electronic energy of it bugs me. Our","messageBody":"<div id=\"ygrps-yiv-1928688415\">- Son is deschooling via tv, computer games. Noise from it is <br/>\nbothersome, but he agrees to turn it down. Now, the very electronic <br/>\nenergy of it bugs me. Our small house feels different with the <br/>\nelectronic gadgets going in it, compared to when they are off and <br/>\nphysical-world activities are going on. I greatly prefer the latter. I <br/>\nwant to be open and accepting of him. Question - how to tolerate my <br/>\nson&#39;s choces when I just don&#39;t like them?<br/>\n<br/>\n- Most video and computer games seem to involve one character whacking <br/>\nanother. I&#39;m so tired of sights and sounds of whacking. I know being a <br/>\nfemale and a Quaker make this harder for me to understand. How do <br/>\nothers cope with constant battling sights and sounds?<br/>\n<br/>\n- I am taking to heart the advice to follow my passions. That, also, <br/>\nseems to interfere with ds&#39;s choices. I also envision him joining me in <br/>\nsome of these things - hiking, learning Aikido, bicycling, etc. I <br/>\nreally like doing things with him (which is a reason I love <br/>\nhomeschooling. He declines my offers to joni me in those activities. <br/>\nHe&#39;s old enough to left alone for a few hours. The one in-home activity <br/>\nI&#39;d like to do is playing music, which would interfere with his choice <br/>\nof screen activities. I think I&#39;ll ask him for some time to play my <br/>\nmusic, and we can agree on a good time for that. Eventually, the <br/>\nbasement will be fixed up and we will move the tv down there, but for <br/>\nnow, we share one open kitchen/office/music/living space. Do I just <br/>\nleave him alone to watch tv while I go do something fun? That seems odd <br/>\nto me. Any ideas.<br/>\n<br/>\nThanks.<br/>\nRobbin</div>","specialLinks":[]}],"prevTopicId":27813,"nextTopicId":27153}}