{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":96057767,"authorName":"Katharine Wise","from":"Katharine Wise &lt;katharinewise@...&gt;","profile":"katharinewise","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"angry chaos","postDate":"1176518958","msgId":23159,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc4MDI2MS4xOTMxOC5xbUB3ZWI2MDMxNS5tYWlsLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":23158,"nextInTime":23160,"topicId":23159,"numMessagesInTopic":0,"msgSnippet":"I feel like everything we re doing is backfiring and everything is getting worse. Kids are angry, yelling, or whiny.  Typical scene:  4yo reading to me while","messageBody":"<div id=\"ygrps-yiv-684688148\">I feel like everything we&#39;re doing is backfiring and everything is getting worse.<br/>\n<br/>\nKids are angry, yelling, or whiny.  Typical scene:  4yo &quot;reading&quot; to me while 7yo reads to self nearby.  7yo grunts, &quot;Be quiet&quot;.  4yo continues reading (in a normal voice).  7yo quickly progresses to screaming, &quot;You&#39;re too loud.  He&#39;s evil.  Make him be quiet.&quot;  I explain to 7yo that if it&#39;s distracting he can go to a different room but he objects because he wants to be near us.  Return to screaming, &quot;You&#39;re too loud.&quot;  Ultimately 7yo starts pushing 4yo out of my lap -- and 4yo gives up and leaves so 7yo actually gets my lap this way.<br/>\n<br/>\nI recently posted about our experiences with food.  Now 7yo and 4yo will both often sit and whine, &quot;I&#39;m hungry, I&#39;m hungry, I&#39;m hungry,&quot; and then turn down everything I offer but not make any suggestions of what they want instead.  And, yes, I will  have recently brought them a snack.  I&#39;ve also set up a cabinet where they can help themselves, but that hasn&#39;t helped.  My 7yo especially, I don&#39;t even know what to offer him to eat anymore -- it seems as though he turns down everything.<br/>\n<br/>\nNight-time has also been challenging.  I&#39;m drained.  11yo gets up at 6:30 and goes to bed at 9:30 as he always has (religiously -- his choice).  7yo sleeps from about 10 or 10:30 until 8 or 9ish, but with much more variation than 11yo.  I do kind of guide him toward bed.  4yo is up until we go to bed at 11 or 12, often still climbing around and chattering as dh and I fall asleep, then sleeps until 11ish.  The pluses -- 4yo and 7yo get along better in the late evening than any other time of day (except tonight which I described above); mornings are also fairly pleasant until 4yo wakes up.  Minuses -- I&#39;m exhausted.  Dh is exhausted.  We get no time alone.  (Since 7yo is so volatile, we really can&#39;t leave kids alone at all when they&#39;re awake.)<br/>\n<br/>\nEverybody&#39;s really edgy, testy.  They&#39;re all competing in a major way for individual attention.  11yo is constantly trying to prove his &quot;alpha-dog&quot; status.  7yo is cross, irritable, and grumpy.  4yo is acting out in some clearly very deliberate ways (you&#39;re reading to *him*, then I&#39;m going to start tearing the pages in this other book so you have to pay attention to me instead).  They yell at each other the instant something isn&#39;t the way they want it, &quot;You&#39;re the evilest thing in the world!!!&quot;  I won&#39;t say we never yell (I don&#39;t think I&#39;ve ever met someone with children who could say that), but dh and I are generally not yellers -- this isn&#39;t something they&#39;ve learned from us -- although the current household atmosphere is definitely pushing our limits.  The younger two will also hit, push, or kick -- at each other and at us.  I can&#39;t remember the last time anyone asked me nicely for something.  (And I don&#39;t mean saying please, but just *asking* in a nice tone of voice --<br/>\n &quot;Mom, could you get the xyz for me?&quot; instead of &quot;I want xyz!!!&quot;)<br/>\n<br/>\nI&#39;m afraid I&#39;m so stubborn I&#39;m sticking to a philosophy that doesn&#39;t work and that maybe my children do need time-outs or &quot;logical&quot; consequences.  Even dh, who never had a violent thought in his life before as far as I know, looked at me tonight and said something about wanting to beat them into submission (and he didn&#39;t really mean obedience but rather into treating one-another nicely).  Yes, we both know that&#39;s absurd.<br/>\n<br/>\nI can&#39;t even believe I&#39;m writing this about my children!  Up until about a year ago, my older two got along so well -- I thought I&#39;d at least done the sibling thing right!  No longer.  <br/>\n<br/>\nKatharine<br/>\n<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]}],"prevTopicId":23108,"nextTopicId":4760}}