{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":101111430,"authorName":"Sunny","from":"&quot;Sunny&quot; &lt;sunny_sof@...&gt;","profile":"sunny_sof","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Starting deschooling/unschooling with a teen- three questions","postDate":"1343407750","msgId":48786,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp1dWdxNiszdjNpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp1cnBsMStnMzRpQGVHcm91cHMuY29tPg=="},"prevInTopic":48779,"nextInTopic":0,"prevInTime":48785,"nextInTime":48787,"topicId":48776,"numMessagesInTopic":0,"msgSnippet":"Thank you for your replies everyone!","messageBody":"<div id=\"ygrps-yiv-1399993779\">Thank you for your replies everyone!</div>","specialLinks":[]},{"userId":523138593,"authorName":"Evelyn Callioux","from":"&quot;Evelyn Callioux&quot; &lt;evelyn.calliou@...&gt;","profile":"abby987_sask","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Starting deschooling/unschooling with a teen- three questions","postDate":"1343318497","msgId":48779,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp1cnBsMStnMzRpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp1cHBzNyttYmhhQGVHcm91cHMuY29tPg=="},"prevInTopic":48778,"nextInTopic":48786,"prevInTime":48778,"nextInTime":48780,"topicId":48776,"numMessagesInTopic":0,"msgSnippet":"I will say up front, I don t feel qualified to give advice as I have only been unschooling for a couple years, but I can share my experience, hopefully it will","messageBody":"<div id=\"ygrps-yiv-172025704\">I will say up front, I don&#39;t feel qualified to give advice as I have only been unschooling for a couple years, but I can share my experience, hopefully it will help.<br/>\n<br/>\nI pulled my daughter out of school when she was 14, grade 9 because she begged me to.  We tried goal-setting, discussing responsibilities, trying to have a &#39;plan&#39;, curriculum-type things I thought she might be interested in, but every time we started talking she shut right down...so I left her alone.  For 4-5 months, she slept and kept in touch with friends on FB and not much else.  She stayed up all night and slept all day.  It was very stressful for me :), so I focussed on unschooling lists/websites and stepping back.  This is known as deschooling and is much harder for the parent than the child!<br/>\n<br/>\nEventually she started getting herself up in the morning and taking an interest in life.  I am a single parent and work full time, I made sure I was available by phone at work, came home at lunch time as much as I could, stayed around in the evenings, but I let her set the pace.  Looking back, she really needed time to heal.<br/>\n<br/>\nNow at almost 17, she is actively involved in our church, spending many volunteer hours there, she is interested in fitness and plans to work toward certification for personal training, and she is learning guitar - among other things.  None of these things were on the list of interests at the time we started out, these developed over time. My role in all this?  I had to change my way of looking at things, learn to give her room and just make things available.  When she was ready we started having fun together.  We travelled, she travelled alone, I bought musical instruments and goofy dance costumes and lots of other stuff that has fallen by the wayside.  We recently sold our house and moved across the country to be closer to the &#39;big city&#39; and more opportunities for both of us.<br/>\n<br/>\nI dont&#39; have any expectations of her contributing to household expenses, I consider her to be still in her educational years, we tell people she&#39;s &#39;doing her last year of school&#39;.<br/>\nI should mention I have three sons, all in their 20&#39;s now, and each one &#39;dropped out&#39; and I required them to work and pay rent since they weren&#39;t going to school.  All three of them have had difficulties in life and it has taken years to get back to a good relationship between us.  My daughter, on the other hand, is happy, confident, and we have a great relationship.  Some of that may be personality, but I really feel it&#39;s because of having the freedom of unschooling.<br/>\n<br/>\nMy suggestion for your friend is to get on some unschooling mailing lists, read the websites suggested here, try not to worry, trust her son to figure things out; the biggest challenge is in our own heads!</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Starting deschooling/unschooling with a teen- three questions","postDate":"1343310987","msgId":48778,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI2NDU1QjUzLTYwQjMtNENGRS04NTRELTA5Q0EyMkRBM0I5OUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGp1cHBzNyttYmhhQGVHcm91cHMuY29tPg==","referencesHeader":"PGp1cHBzNyttYmhhQGVHcm91cHMuY29tPg=="},"prevInTopic":48777,"nextInTopic":48779,"prevInTime":48777,"nextInTime":48779,"topicId":48776,"numMessagesInTopic":0,"msgSnippet":"... It s common to talk about x-age kids as though they were a species with common needs. Physically he ll have some typical 16 yo traits. But his personality","messageBody":"<div id=\"ygrps-yiv-2011649583\">On Jul 25, 2012, at 5:53 PM, Sunny wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I mean, how much support does a teen unschooler need?<br/>\n<br/>\n </span></blockquote>It&#39;s common to talk about x-age kids as though they were a species with common needs.<br/>\n<br/>\nPhysically he&#39;ll have some typical 16 yo traits. But his personality and his unique needs are what she needs to be aware of.<br/>\n<br/>\nRight now, since he&#39;s been in school so long, she probably doesn&#39;t know. *He* probably doesn&#39;t know! He&#39;s been shaping himself to fit into the school mold so long, many of his own needs may be buried to the point he doesn&#39;t trust or realize they&#39;re important.<br/>\n<br/>\nSo the best approach is not to lock themselves into one answer. Try lots of things. Be *aware* that they&#39;re experimenting to find what works and what doesn&#39;t work. Be *aware* that what works today may not work next week because he&#39;s going to be changing everyday. As he recovers from school, he&#39;ll be peeling back layers so there may be new issues to deal with.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Should she take some time off to be with him during the day? Should she say, Okay, you&#39;re on your own but if you want me, give me a call at work?<br/>\n<br/>\n </span></blockquote>I would mix it up to see what works.<br/>\n<br/>\nTake some time off to do things together. Give him space to explore being alone with no pressures.<br/>\n<br/>\nI *wouldn&#39;t* say &quot;You&#39;re on your own.&quot; Legally he shouldn&#39;t be! Depending on the compulsory school age in her state, she&#39;s legally responsible for his education, not him. Emotionally, the words are saying &quot;I&#39;m washing my hands of my responsibility of you.&quot;<br/>\n<br/>\nA new vision is being his partner. Provide what he -- the unique person he is -- needs. At 16 my daughter still needed me around. She *liked* having someone to share experiences with. At 16 Alex Polikowski was in the US, far from her Brazilian family (but with their blessing), showing dogs. (And I&#39;m sure she&#39;ll correct me if I got some of the details wrong.) The point is what was right for Alex would have felt like abandonment to my daughter. What was right for my daughter would have felt like crushing confinement to Alex. Different people have different needs. Unschooling is all about getting to know who our kids are so we can meet those unique needs.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It would be lovely if a parent could be around all day, but it&#39;s not going to happen in this case.<br/>\n<br/>\n </span></blockquote>Unschooling doesn&#39;t change reality! <br/>\n<br/>\nBut unschooling parents can change what they&#39;re doing. She *could* change jobs.<br/>\n<br/>\nI&#39;m not saying she *should*! I&#39;m saying only that people often lock the doors to many solutions before they&#39;ve even thought about them. Thinking outside the box is opening all the doors and exploring. It&#39;s not dangerous -- or even messy -- to *think* outside the box. :-) Consider *all* options, even the ones you&#39;d eliminate immediately as unworkable because thinking about them might open up other doors you hadn&#39;t even seen.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is that dangerous?<br/>\n<br/>\n </span></blockquote>For some kids it would be. For others it wouldn&#39;t. It would depend on what they needed and what was missing from their lives.<br/>\n<br/>\nWhat does he need? What does he want? What will he want next week? A month from now? They may all be different.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 2. Goal setting-<br/>\n<br/>\n </span></blockquote>Again, it depends what he wants and needs.<br/>\n<br/>\nAnd he&#39;ll be changing over the next few months. It&#39;s likely that any goals he sets won&#39;t feel right 6 months from now.<br/>\n<br/>\nOr he could be someone who has always been very focused and has a really good idea of what he wants.<br/>\n<br/>\nHe may be someone who needs to chill with as few obligations hanging over him as possible.<br/>\n<br/>\nHe may be someone who needs to plunge into all the projects he hasn&#39;t had time for because of school and schoolwork.<br/>\n<br/>\nIt depends.<br/>\n<br/>\nThe only thing that is likely to happen is: Things will change :-) And the best approach is adaptability.<br/>\n<br/>\nThey could try it. With the understanding that it&#39;s not a permanent solution. It&#39;s a &quot;let&#39;s see what part of this works and what part doesn&#39;t&quot; deal.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but is it kosher to actually have a formal conversation to clarify a teen&#39;s goals at the start of unschooling?<br/>\n<br/>\n </span></blockquote>Formal? No.<br/>\n<br/>\nCasual conversations? In depth conversations? It depends on his personality. If he needs to chill, a few words about letting him chill and checking in on how his needs are changing might be what he needs.<br/>\n<br/>\nAcknowledgement that she doesn&#39;t know what he needs but is willing to explore with him to discover would be helpful to him. Acknowledgement that he will be changing and his needs will be changing over the next few months will be helpful.<br/>\n<br/>\nLeast helpful will be assuming she has the right answer. As is assuming there *is* a right answer. There are better answers. There are answers that aren&#39;t as good.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know these goals wouldn&#39;t be set in stone, and will change over time, but is this a process unschoolers use?<br/>\n<br/>\n </span></blockquote>It depends on the kid! <br/>\n<br/>\nSorry to keep repeating that, but it&#39;s common for beginners to look to unschooling for new rules to live by. The only &quot;rules&quot; -- helpful strategies really -- of unschooling, are look at your child not outside experts to tell you what he needs, get to know your child, help him get his wants and needs met.<br/>\n<br/>\nIf the mom doesn&#39;t know what his needs are THAT&#39;S OKAY!! At this point she probably shouldn&#39;t. And his needs will be changing.<br/>\n<br/>\nIt&#39;s okay not to know the answers. It&#39;s expected.<br/>\n<br/>\nIt&#39;s not helpful to feel paralyzed because you don&#39;t know The Answers. There aren&#39;t any ultimate right answers. <br/>\n<br/>\nWhat&#39;s helpful is exploring. Trying things out. Doing different things to find what&#39;s fun and not fun. There&#39;s thinking about what parts weren&#39;t fun and why. We&#39;re all growing and changing everyday. What&#39;s right for today for this person may be wrong next month. What was wrong this month may be right next month.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; For example, could a parent ask, What do you want to do in the next x months?<br/>\n<br/>\n </span></blockquote>Maybe. Depends on the child.<br/>\n<br/>\nMaybe better, depending on him, is a few ideas of interesting possibilities for tomorrow or &quot;this week&quot; including chilling.<br/>\n<br/>\nIf he feels pressured by plans, it won&#39;t be a good idea.<br/>\n<br/>\nIf he likes plans, if he knows part of the plan can be &quot;nothing&quot;, if he knows he can scrap the plans at any point to draw up new plans or have no plans, then that&#39;s good.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; and actually write down a bit of a plan? For example, I know this boy is interested<br/>\n&gt; in robotics, so could you both make a plan to join a robotics club, buy a robot kit,<br/>\n&gt; etc, and then actually ask him to be accountable to follow through on the plan?<br/>\n&gt; Or is that too coersive? Could you have weekly goal setting meetings? Is that too structured?<br/>\n<br/>\n </span></blockquote>Finding robotics clubs could be good. Or it could feel like pressure. Again, depends on him!<br/>\n<br/>\nShe shouldn&#39;t be wary of offering and trying various things. She shouldn&#39;t be wary of finding out with him what&#39;s working and what isn&#39;t.<br/>\n<br/>\nShe *should* be wary of having an agenda that gets him where she thinks he should be headed. Even if it&#39;s where *he* deep inside wants to go. If he feels pressured to go that direction, he&#39;ll want to back away.<br/>\n<br/>\nIf he has the freedom to choose, as much support as he needs to make choices, then he&#39;ll make those choices that feel right.<br/>\n<br/>\nThe goal should be to help him unfold, to recover, to discover who he is, what he likes, what he dislikes. Treat him like a tree that needs nurtured after a long drought. The tree doesn&#39;t need dug up and put on a truck on a journey to Health. It needs water and sun and good food and freedom from insects that want to bore into its skin, and freedom to reach out its branches and spread its leaves in the way that feel right to *him*.<br/>\n<br/>\nHe&#39;s recovering from being told what to do and where he needs to be heading. He needs nurtured right now, not pressured onto a &quot;freer&quot; pathway.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; However, when do those contributions (e.g. income, household chores) actually<br/>\n&gt; become an expectation of being part of the family? And what if the child chooses<br/>\n&gt; not to contribute- what is a natural consequence of that? <br/>\n<br/>\n </span></blockquote>It depends what someone&#39;s goal is for her child.<br/>\n<br/>\nIf the primary goal is independence, then moving the child as quickly to that as possible will meet that goal. (It&#39;s very likely to severely damage any trust the child has in the parent being their support, and damage the relationship.)<br/>\n<br/>\nIf the primary goal is supporting him exploring what fascinates him, then pressuring him in some way he &quot;should&quot; go will interfere. (And, depending on how severely damaged the child is, depending on their personality, it may take them a while before they are making more moving-to-adult-indepence type of choices. It helps to read about grown unschoolers who have been supported in exploring independence when *they* were ready. It really *is* natural for kids to want to make their own independent choices when *they&#39;re* developmentally ready to do so.)<br/>\n<br/>\nA really good book for parents of teens is Parent/Teen Breakthrough: The relationship approach by Mira Kirschenbaum:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tinyurl.com/3mnbf52\">http://tinyurl.com/3mnbf52</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Starting deschooling/unschooling with a teen- three questions","postDate":"1343257890","msgId":48777,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp1cHVmMitiMmZ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp1cHBzNyttYmhhQGVHcm91cHMuY29tPg=="},"prevInTopic":48776,"nextInTopic":48778,"prevInTime":48776,"nextInTime":48778,"topicId":48776,"numMessagesInTopic":0,"msgSnippet":"... **************** I ll start with this because things get a little more muddy and complex with older teens, teens old enough to deal with the social and","messageBody":"<div id=\"ygrps-yiv-533313657\">&quot;Sunny&quot; &lt;sunny_sof@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; 2. Goal setting- I know that unschooling means no curriculum, but is it kosher to actually have a formal conversation to clarify a teen&#39;s goals at the start of unschooling? <br/>\n </span></blockquote>****************<br/>\n<br/>\nI&#39;ll start with this because things get a little more muddy and complex with older teens, teens old enough to deal with the social and personal reaction to the idea of &quot;dropping out&quot; - and going from school to full blown unschooling is going to look and feel like &quot;dropping out&quot; to a lot of people, including (possibly) the kid involved. So it&#39;s a good idea to talk with him about options which don&#39;t look and feel so much like &quot;quitting school&quot;. Maybe he&#39;d like to take some online courses in the subjects which interest him. Maybe some community college courses. Maybe he&#39;d like to work. Maybe he&#39;d like to really take a break from school and get his GED (if he&#39;s in the US) later. Maybe he&#39;d like to travel. A good book to look at is The Teenage Liberation Handbook. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; how much support does a teen unschooler need?<br/>\n<br/>\n </span></blockquote>It varies. How much does he think? Compared to whatever support he&#39;s getting in school? <br/>\n<br/>\nAnother thought to consider, though, is that his schedule may not be the same outside of school. If he&#39;s up nights, the issue kind of changes - he&#39;ll be asleep while mom is at work. If he&#39;s working or taking classes during the day, those will also have an impact on what he needs in terms of support.<br/>\n<br/>\nAnd regardless of what he chooses, it doesn&#39;t hurt one bit for mom to look for more ways to hang out with her teen. Do things with him whenever possible. Stretch your own interests (mom) to appreciate his. That sets mom up to be more supportive no matter what he decides. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;when do those contributions (e.g. income, household chores) actually become an expectation of being part of the family? And what if the child chooses not to contribute- what is a natural consequence of that?<br/>\n </span></blockquote>***************<br/>\n<br/>\nIt helps me to think in terms of the opportunities I can offer my kids. I have an 18yo stepson. I also happen to have a small outbuilding we&#39;ve converted to a tiny apartment - basically a detached bedroom from our minuscule house. I could ask that he pay rent, but instead I see it as a gift of a better chance in life. For now, while he&#39;s still figuring things out, he doesn&#39;t have to worry about a place to live. He&#39;s studying woodworking and blacksmithing, learning from local artisans and on his own, going to events and shows to sell things. Self employment can be rough going. Learning to be an artisan has a lot of ups and downs - and I know from my own life how disappointing it can be to come home from the day job and be too tired to do the things I love. Ray doesn&#39;t have to life that life. He gets to learn to be a professional craftsperson without the onus of paying the bills. <br/>\n<br/>\nIn return, when he&#39;s around he helps out, offers money, shares foodstuffs when he trades art for food at local farms, offers the use of his van if we need to haul something big. He&#39;s not &quot;taking advantage&quot; he&#39;s getting something wonderful, something most 18yos don&#39;t get. He&#39;s not required to produce or assist or excel, and yet he continues to exceed our expectations. <br/>\n<br/>\nI posted a link to the Zombie Princess blog in an earlier post - that family has grown kids and different stories than mine. One idea which comes up in many unschooling families, though, is that there&#39;s nothing magic about 18. It&#39;s okay - wonderful even! to allow the transition to adulthood to be a slower, gentler transition. It&#39;s okay for kids to grow up in their own way, on their own timetable. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":101111430,"authorName":"Sunny","from":"&quot;Sunny&quot; &lt;sunny_sof@...&gt;","profile":"sunny_sof","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Starting deschooling/unschooling with a teen- three questions","postDate":"1343253191","msgId":48776,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp1cHBzNyttYmhhQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":48777,"prevInTime":48775,"nextInTime":48777,"topicId":48776,"numMessagesInTopic":0,"msgSnippet":"Hello, and thanks for this forum as I am newbie to unschooling! I have a close friend who is considering unschooling her teenage son (16 years) and we ve been","messageBody":"<div id=\"ygrps-yiv-1845229076\">Hello, and thanks for this forum as I am newbie to unschooling!<br/>\nI have a close friend who is considering unschooling her teenage son (16 years) and we&#39;ve been discussing how it might look. He&#39;s a bright boy, interested in math and physics, but become increasingly uninterested in attending high school these past years, and doing required work for the courses he doesn&#39;t like. He still does well in the courses he likes, but doesn&#39;t bother to show up for most classes, including the ones he does well in. He spends a lot of time on the computer surfing and gaming, which has been an issue because of the incomplete schoolwork. So, I suggested unschooling as a possible option to end the constant struggles between them, as well as facing the reality that school for him is obviously not working now.<br/>\n<br/>\nSo our questions are:<br/>\n1. Time together and working parents- Because she is a single parent, she has to work outside the home during standard business hours. This can&#39;t really be modified because it&#39;s a government type of job. He&#39;s obviously old enough to be on his own for some hours, but how does this practically work for a deschooler who is just starting? Should she take some time off to be with him during the day? Should she say, Okay, you&#39;re on your own but if you want me, give me a call at work? I mean, how much support does a teen unschooler need? It would be lovely if a parent could be around all day, but it&#39;s not going to happen in this case. Is that dangerous? I mean, he still spends a lot of time alone at home now because he&#39;s skipping school, but permanently unschooling, will that change anything? <br/>\n<br/>\n2. Goal setting- I know that unschooling means no curriculum, but is it kosher to actually have a formal conversation to clarify a teen&#39;s goals at the start of unschooling? I know these goals wouldn&#39;t be set in stone, and will change over time, but is this a process unschoolers use? For example, could a parent ask, What do you want to do in the next x months? and actually write down a bit of a plan? For example, I know this boy is interested in robotics, so could you both make a plan to join a robotics club, buy a robot kit, etc, and then actually ask him to be accountable to follow through on the plan? Or is that too coersive? Could you have weekly goal setting meetings? Is that too structured?<br/>\n<br/>\n3. Responsibilities to the family- How does this fit into unschooling philosophy? For example, in the &quot;old days&quot;, if you quit school, you were often expected to get a job and contribute to the family income. For a teen, getting a job is a possibility and obviously if it&#39;s something s/he&#39;s interested, I understand how an unschooling parent would support that. However, when do those contributions (e.g. income, household chores) actually become an expectation of being part of the family? And what if the child chooses not to contribute- what is a natural consequence of that? <br/>\n<br/>\nThanks in advance!</div>","specialLinks":[]}],"prevTopicId":48775,"nextTopicId":48814}}