{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":209676473,"authorName":"Joanne","from":"&quot;Joanne&quot; &lt;oh.kneel@...&gt;","profile":"kc2ark","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Asking vs. Arguing","postDate":"1149262872","msgId":13916,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1cG02bytxOTcyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":13915,"nextInTime":13917,"topicId":13916,"numMessagesInTopic":0,"msgSnippet":"I have been reading the various posts and I would, if I may, like to say two things.  Most importantly, it is very hard to be a leader. There are always some","messageBody":"<div id=\"ygrps-yiv-1526056561\">I have been reading the various posts and I would, if I may, like to<br/>\nsay two things.  Most importantly, it is very hard to be a leader.<br/>\nThere are always some people who like what is being done, while<br/>\nothers who do not.  Yet in general the leaders (or in this case our<br/>\nlist moderators) put in the most time and work.  I would like to<br/>\nexpress great appreciation for their commitment to this particular<br/>\nlist and also the service they are providing to those in need of<br/>\nsupport, information and/or community.<br/>\n<br/>\nSecondly, asking questions and responding with further questions is<br/>\nvery different then presenting questions and then responding with an<br/>\nongoing argumentative tone.  Negativity without giving any of the<br/>\nsuggestions a real chance is not about struggling to grow out of<br/>\none&#39;s comfort zone.  I believe it is driven by an unconscious desire<br/>\nto justify why one &quot;can&#39;t&quot; change.  It allows us to feel we can make<br/>\na case for why things won&#39;t work without really bearing the<br/>\nuncomfortability of trying.  We have all been there before.<br/>\nSometimes as the one not ready and sometimes as the one listening to<br/>\nsomeone who is so painfully stuck.  As we can all well remember,<br/>\nwhen this persists it can be incredibly draining for the person the<br/>\narguer is either trying to engage or convince.<br/>\n<br/>\nOf course, we all have feeling when we consider change.  We are<br/>\nleaving that which is familiar to that which is unknown.  It can be<br/>\nexciting but it can also be frightening.  The intensity of our<br/>\nreaction will be colored by many factors including current life<br/>\ncircumstances and/or stressors not to mention those unresolved<br/>\nhurts, fears and unchallenged messages from our own pasts.  Support<br/>\nand information can be given to a seeker but not one who is still<br/>\nfighting within oneself.<br/>\n<br/>\nWhen invited into that kind of circular &quot;debate&quot;, the case of any<br/>\nenergy or paradigm shift is greatly diminished.  Even if the arguer<br/>\nfeels the desire, it will do neither them nor us any good to fight<br/>\nwith someone who is struggling that intensely.  Perhaps their<br/>\nanswers will emerge when they are given the space to fight it out<br/>\nwith themselves.  The fight will end when the person battling is<br/>\nready to let go of the fear.  No one can bring them to that place.<br/>\n<br/>\nWe each ultimately must decide alone when and if we are willing.  It<br/>\nrequires different impetus for different people. For some it takes<br/>\nthe willingness to take the risk and just dive in.  Others need to<br/>\nfind the courage to proceed even when uncertain.  Some may use the<br/>\nconviction of blind faith.  The assurance of it has worked for<br/>\nothers before me.   Others may need to be still so that they may<br/>\nfind that centered quiet space of peace or knowing or trust.<br/>\n<br/>\nIn closing, I would like to encourage us all to remember not judge<br/>\nour moderators harshly.  When anything is done well, it appears<br/>\neasy.  Such is the case of moderating a list like this.  Even though<br/>\nfurther along the journey then many of us, they are still life<br/>\nlearners who also need support and community and like all of us are<br/>\nstill learning as they live.<br/>\n<br/>\nThere are many lists.  Those who do not get what they need here have<br/>\nmany other options of places to explore.  Some may even come back at<br/>\na later date.  After all, we all grow and learn in different ways,<br/>\nat different times. :)<br/>\n<br/>\n<br/>\nRespectfully,<br/>\nJoanne, Charlie (dh) and Kevin (ds/age; 5)<br/>\nLake Carmel, NY</div>","specialLinks":[]}],"prevTopicId":13914,"nextTopicId":13769}}