{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":226163813,"authorName":"tibetandesertdragon","from":"&quot;tibetandesertdragon&quot; &lt;licia@...&gt;","profile":"tibetandesertdragon","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: hello and introductions (long-ish)","postDate":"1118764967","msgId":5624,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ4bXYzNys2NmlkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZiLjczMDY3ZDIyLjJmZGZmOWI3QGFvbC5jb20+"},"prevInTopic":5623,"nextInTopic":0,"prevInTime":5623,"nextInTime":5625,"topicId":5618,"numMessagesInTopic":0,"msgSnippet":"Thanks Kathryn!  I needed that reflection!  You are right, schooling is ingrained; not only am I a product of the public schools, but I was actually an art","messageBody":"<div id=\"ygrps-yiv-1820154047\">Thanks Kathryn!  I needed that reflection!  You are right, schooling <br/>\nis ingrained; not only am I a &quot;product&quot; of the public schools, but I <br/>\nwas actually an art teacher (years ago) in the Atlanta Public Schools <br/>\nfor 4 years.  I left because I was disgusted with what I saw there, <br/>\nbut in my classroom it was very process oriented, very much about <br/>\nallowing the kids to express their unique understanding of the world, <br/>\nlots of freedom...but it was still through the lens of whatever art <br/>\nlesson I was supposed to teach them.  My motto, however, was that <br/>\nchildren were not an empty vessel to be filled, but a full vessel <br/>\nawaiting their own discovery.  The &quot;students&quot; taught me every day. I <br/>\nwas considered a very rebellious teacher.  <br/>\n<br/>\nNOW, this unschooling thing is so much what we are wanting to embody <br/>\nin our lives; trust, partnership, inner reference point, etc.  It <br/>\nfeels like the pioneering that we have done in our lives by leaving <br/>\nour old world behind and embracing the unknown.  You are so <br/>\nright....it seems a contradiction that we have lived our lives this <br/>\nway and yet I have been sort of hanging on to an old paradigm way of <br/>\nlearning. I feel like I need psychic surgery to remove the old ideas <br/>\nof schooling from my head!  Maybe the conference will help me over <br/>\nthe edge!<br/>\n<br/>\nI want to thank you for your response; I have been unsure whether we <br/>\nwill &quot;fit&quot; into the unschooling community as I have seen some pretty <br/>\nconfrontational discussion on some other groups.  This has been part <br/>\nof my resistance, I think.  The way you responded was loving, <br/>\npositive and empowering.  Thank you!   <br/>\n<br/>\nNamaste,<br/>\nlicia<br/>\nwww.liciaberry.com<br/>\nwww.berrytrip.us<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, KathrynJB@a... wrote:<br/>\n&gt;  <br/>\n&gt; In a message dated 6/13/2005 8:01:03 AM Eastern Standard Time,  <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> writes:<br/>\n&gt; <br/>\n&gt; We are  considering <br/>\n&gt; attending the unschooling conference in St Louis (it would be  our <br/>\n&gt; first) because, as I told Kelly, we are &quot;teetering&quot; on the brink <br/>\nof  <br/>\n&gt; being full unschoolers, but my own fears are getting in the way.   <br/>\n&gt; Perhaps being around some wonderful unschooling folks who are so  <br/>\n&gt; trusting of themselves would be good for me (and my children).  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ************************************<br/>\n&gt; licia, I just read your introduction, and I realized just how <br/>\ningrained  this <br/>\n&gt; whole school thing is. You were able to totally pick up everything, <br/>\nsell  <br/>\n&gt; your house, drift until you found the right place, etc. Most of us <br/>\nwould NEVER  <br/>\n&gt; be brave enough to do that -- but totally unschooling scares you!!!<br/>\n&gt;  <br/>\n&gt; You&#39;re braver than that, and you already trust your kids. Come to <br/>\nthe Live  <br/>\n&gt; and Learn conference, and give yourself over to the REALLY BRIGHT <br/>\nside of the  <br/>\n&gt; force!  ;)<br/>\n&gt;  <br/>\n&gt; Kathryn<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":779600,"authorName":"KathrynJB@aol.com","from":"KathrynJB@...","profile":"kathrynbeth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: hello and introductions (long-ish)","postDate":"1118740407","msgId":5623,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZiLjczMDY3ZDIyLjJmZGZmOWI3QGFvbC5jb20+"},"prevInTopic":5618,"nextInTopic":5624,"prevInTime":5622,"nextInTime":5624,"topicId":5618,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/13/2005 8:01:03 AM Eastern Standard Time, unschoolingbasics@yahoogroups.com writes: We are  considering attending the unschooling","messageBody":"<div id=\"ygrps-yiv-1925462866\">In a message dated 6/13/2005 8:01:03 AM Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> writes:<br/>\n<br/>\nWe are  considering <br/>\nattending the unschooling conference in St Louis (it would be  our <br/>\nfirst) because, as I told Kelly, we are &quot;teetering&quot; on the brink of  <br/>\nbeing full unschoolers, but my own fears are getting in the way.   <br/>\nPerhaps being around some wonderful unschooling folks who are so  <br/>\ntrusting of themselves would be good for me (and my children).  <br/>\n<br/>\n<br/>\n<br/>\n************************************<br/>\nlicia, I just read your introduction, and I realized just how ingrained  this <br/>\nwhole school thing is. You were able to totally pick up everything, sell  <br/>\nyour house, drift until you found the right place, etc. Most of us would NEVER  <br/>\nbe brave enough to do that -- but totally unschooling scares you!!!<br/>\n <br/>\nYou&#39;re braver than that, and you already trust your kids. Come to the Live  <br/>\nand Learn conference, and give yourself over to the REALLY BRIGHT side of the  <br/>\nforce!  ;)<br/>\n <br/>\nKathryn<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":226163813,"authorName":"tibetandesertdragon","from":"&quot;tibetandesertdragon&quot; &lt;licia@...&gt;","profile":"tibetandesertdragon","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"hello and introductions (long-ish)","postDate":"1118602571","msgId":5618,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ4aTBnYiszODM4QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":5623,"prevInTime":5617,"nextInTime":5619,"topicId":5618,"numMessagesInTopic":0,"msgSnippet":"Greetings to All, I just signed on to this group at Kelly s recommendation and am just getting around to letting you know we are here!  I m so appreciative ","messageBody":"<div id=\"ygrps-yiv-1525998532\">Greetings to All,<br/>\n<br/>\nI just signed on to this group at Kelly&#39;s recommendation and am just <br/>\ngetting around to letting you know we are here!  I&#39;m so appreciative <br/>\nthat there is such a &quot;safe&quot; place to bring unschooling questions.  I <br/>\nam a member of a couple of other unschooling groups and have been <br/>\nterrified to post my questions due to some pretty intense <br/>\ndiscussion!  It feels so wonderful to read what others are up to and <br/>\nto know that I&#39;m not alone.  I am graced with 11 year old and 8 year <br/>\nold boys.  Our story: <br/>\n<br/>\nIn 2003 we were living in Asheville, NC (my home state, I&#39;m from the <br/>\nOuter Banks), living the American Dream life with a beautiful, old <br/>\nhistoric farmhouse on acres of land with organic gardens and <br/>\norchards.  The kids were in school (actually a fairly good one for <br/>\npublic schools) and I was PTO president for 2 years, supermommy <br/>\nvolunteer.  My husband was working for Toshiba as sales manager over <br/>\nNC and SC, and I had a thriving energy-work practice in downtown <br/>\nAsheville.  We were had a community of friends and resources, and on <br/>\nthe surface one would think we were living the ideal life.<br/>\n<br/>\nBut in my inner most heart, I was getting messages that things were <br/>\noff.  I think it started when my now 11 year old, Jess, graduated <br/>\nfrom his 1st-2nd grade combo class.  His teacher and principal <br/>\nstrongly urged us to skip him ahead a grade because he would be too <br/>\nbored.  We agreed because Jess is so mature physically, emotionally, <br/>\nmentally, spiritually, so he was schooched ahead to 3rd grade from <br/>\nbeing a 1st grader.  This turned out to be a huge mistake.  Well, <br/>\nreally the mistake was leaving him in  school at all.  I was getting <br/>\nmessages (I work with my inner guidance) that I was to homeschool him <br/>\nat that point, very strongly.  I even saw visions of him learning the <br/>\nhealing work from me as an apprentice, similar to the old days when a <br/>\nchild went off to learn a trade at age 11 after schooling at home.  <br/>\nBut I didn&#39;t do it....I was wrapped up in my practice, and my younger <br/>\nson, Aidan, was eager for his Montessori preschool, and I finally had <br/>\nhands free time!  I was loathe to give up my new found freedom, so I <br/>\nignored my guidance.<br/>\n<br/>\nWell, the long story short is that Jess learned over the next 2 and a <br/>\nhalf years to hate himself.  Because he was the youngest but <br/>\nthe &quot;smartest&quot; in the class, and because he is a sensitive, big-<br/>\nhearted person, he was picked on.  He internalized the self doubt and <br/>\nself hatred that was all around him, which mostly came from the other <br/>\nchildren and the environment that school creates of everyone having <br/>\nto be on board at the same time doing the same thing and excelling at <br/>\nit.  I watched him grow a little sadder each year, shrinking more and <br/>\nmore into himself.  My bright, beautiful butterfly of a son was <br/>\nwithering away.  In the mean time, I&#39;d put Aidan in school, too and <br/>\nhe was having different but similarly spirit-killing experiences.  <br/>\nThank goodness I woke up.  <br/>\n<br/>\nThe wake up happened over a couple of years, but my guidance got so <br/>\nloud and so uncomfortable to ignore that I finally spilled the beans <br/>\nto my husband one night (October 2003).  I told him that I felt we <br/>\nwere living someone else&#39;s idea of success, and that if we continued <br/>\nwhat I saw on the horizon was that we would have disaster as a <br/>\nfamily, perhaps not even be together any more.  I felt so strongly <br/>\nthat my personal spiritual path was diverting from what we had <br/>\ncreated, and that I was going to have to choose.  He really heard me, <br/>\nand over a long, tear-filled night, we came to the realization that <br/>\nthere was nothing more important than our family and love for <br/>\neachother- all else were trappings.  <br/>\n<br/>\nWe were guided to give it ALL up....to close my practice, Pete to <br/>\nquit his job, to sell our beloved home, to pull the kids out of <br/>\nschool, and to buy a used RV and travel the country together.  Over a <br/>\n6 WEEK period, everything materialized in miraculous ways to get us <br/>\nout of there; from start to finish, 6 weeks was all it took.  I later <br/>\ntook this to mean that we were on the right track and being wholly <br/>\nsupported by the universe!  For example, the day after we were guided <br/>\nto sell the house, I told ONE person and she bought it; no realtors, <br/>\nno fuss.  We opened our home to the community at large and over 4 <br/>\nweekends sold our possessions.   We left ASheville in December of <br/>\n2003, and have been on the road until this last month, when we have <br/>\nsettled (for now) in Alburquerque NM.  Why here?  This area picked us <br/>\n(another whole story), and our guidance told us to stay. We have met <br/>\namazing folks here already, and feel ourselves becoming part of this <br/>\ncommunity.  (We have a website that talks about the &quot;wake up&quot; and <br/>\nwhat we have done over the last 17 months with photos.  <br/>\nwww.berrytrip.us )<br/>\n<br/>\nThe subsequent time has been amazing, a true gift to all of us.  Our <br/>\nfamily has re-coalesced, we have all gotten back in touch with our <br/>\nSpirits and are actively cultivating that relationship through <br/>\nmediation and mind/body/spirit work.  We met so many wonderful folks <br/>\non the road, and had so many magical experiences that guided us.  My <br/>\nenergy practice made the transition to phone, although I am being <br/>\napproached here in NM already to work in the physical realm with <br/>\nfolks.  Peter has found meaningful work with a local venture capital <br/>\nnon-profit that funds New Mexico businesses.  As to home learning, we <br/>\nseem to do a balance of several types...some formal, some <br/>\nunschooling, and then of course a blend of esoteric teachings.  I <br/>\nfeel that I have been charged with raising two leaders of a hopefully <br/>\nnew earth.  I know in my heart that to create a more peaceful, loving <br/>\ncivilization my children will have to do, think, speak and BE <br/>\ndifferently than previous generations.  We do alot of talking about <br/>\nand exploring feelings, listening to our intuition, feeling how our <br/>\nenergy fields are impacted by other people or events (like the recent <br/>\nearth dynamics), taking responsibility for ourselves and not being <br/>\nvictims.  Really, the spiritual/emotional/mental components are the <br/>\nmain thrust of our &quot;home schooling&quot;, even though we do some of the <br/>\nacademic stuff so that the kids have the tools they need to be <br/>\narticulate and resourceful in the world.  Sometimes I fall into doubt <br/>\nand wonder what the heck I&#39;m doing, but 99% of the time I am so clear <br/>\nthat we are doing what we are supposed to be doing.  <br/>\n<br/>\nRobyn, I found your recent post about what unschooling is to be so <br/>\nhelpful and great food for thought for me.  We are considering <br/>\nattending the unschooling conference in St Louis (it would be our <br/>\nfirst) because, as I told Kelly, we are &quot;teetering&quot; on the brink of <br/>\nbeing full unschoolers, but my own fears are getting in the way.  <br/>\nPerhaps being around some wonderful unschooling folks who are so <br/>\ntrusting of themselves would be good for me (and my children). <br/>\n<br/>\nSo that&#39;s my tale!  Thank you so much for this wonderful <br/>\nnewsgroup...I cherish reading it, especially when folks share deeply <br/>\nand respond to questions in a thoughtful, balanced way.<br/>\n<br/>\nWith Gratitude,<br/>\nlicia Berry<br/>\nwww.berrytrip.us<br/>\nwww.liciaberry.com</div>","specialLinks":[]}],"prevTopicId":5493,"nextTopicId":5627}}