{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":22,"messages":[{"userId":209361242,"authorName":"JJ","from":"&quot;JJ&quot; &lt;jrossedd@...&gt;","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: late readers- reassurance needed","postDate":"1288497400","msgId":45217,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhaXBkbytuMnBzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlhaW9xNCtxdmY5QGVHcm91cHMuY29tPg=="},"prevInTopic":45216,"nextInTopic":0,"prevInTime":45216,"nextInTime":45218,"topicId":45184,"numMessagesInTopic":0,"msgSnippet":"I want to apologize. I confused this post s source with the recent litany from another name (a similar three-word phrase starting with finding rather than","messageBody":"<div id=\"ygrps-yiv-2136087420\">I want to apologize. I confused this post&#39;s source with the recent litany from another name (a similar three-word phrase starting with &quot;finding&quot; rather than &quot;flying&quot;) and I probably shouldn&#39;t have said anything even if it HAD been the same poster. <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;JJ&quot; &lt;jrossedd@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I don&#39;t think that&#39;s what others are trying to get you to hear. Better sounding school subject labels are not the hurdle between unschooling and your family. And I promise you, &quot;she should be proud of herself&quot; and &quot;she just needs to relax and LOL&quot; are not what&#39;s coming through to me.<br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;flyingtwinsmom&quot; &lt;flyingtwinsmom@&gt; wrote:<br/>\n&gt; I&#39;m proud of myself when I think of them pulling rocks out of the woods as geology. LOL The relaxing is clearly my biggest hurdle.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":209361242,"authorName":"JJ","from":"&quot;JJ&quot; &lt;jrossedd@...&gt;","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: late readers- reassurance needed","postDate":"1288496772","msgId":45216,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhaW9xNCtxdmY5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlhaWdhcStzZ2pjQGVHcm91cHMuY29tPg=="},"prevInTopic":45215,"nextInTopic":45217,"prevInTime":45215,"nextInTime":45217,"topicId":45184,"numMessagesInTopic":0,"msgSnippet":"I don t think that s what others are trying to get you to hear. Better sounding school subject labels are not the hurdle between unschooling and your family.","messageBody":"<div id=\"ygrps-yiv-2115416281\">I don&#39;t think that&#39;s what others are trying to get you to hear. Better sounding school subject labels are not the hurdle between unschooling and your family. And I promise you, &quot;she should be proud of herself&quot; and &quot;she just needs to relax and LOL&quot; are not what&#39;s coming through to me.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;flyingtwinsmom&quot; &lt;flyingtwinsmom@...&gt; wrote:<br/>\nI&#39;m proud of myself when I think of them pulling rocks out of the woods as geology. LOL The relaxing is clearly my biggest hurdle. </span></blockquote></div>","specialLinks":[]},{"userId":191799655,"authorName":"flyingtwinsmom","from":"&quot;flyingtwinsmom&quot; &lt;flyingtwinsmom@...&gt;","profile":"flyingtwinsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: late readers- reassurance needed","postDate":"1288489068","msgId":45215,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhaWg5Yys4NDdvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDJBQjhDREQzLUZERDEtNEEyNy1BNTZCLTAwRDg3MDM2RTUxNUB2ZXJpem9uLm5ldD4="},"prevInTopic":45214,"nextInTopic":45216,"prevInTime":45214,"nextInTime":45216,"topicId":45184,"numMessagesInTopic":0,"msgSnippet":"... ** How would you react if they were being quizzed about bike riding or swimming? Or guitar playing? Or knowledge of the 90 s? If you can imagine yourself","messageBody":"<div id=\"ygrps-yiv-156800555\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n** How would you react if they were being quizzed about bike riding or swimming? Or guitar playing? Or knowledge of the 90&#39;s?<br/>\n<br/>\nIf you can imagine yourself being bothered by those too, then there&#39;s something deeper than the reading.**<br/>\n<br/>\nPoint taken. There is definitely more going on than reading. I need to relax. <br/>\n<br/>\n**Did you read the links to Sandra&#39;s site and mine? I really really urge you to read those before posting again. *We* can&#39;t get rid of your fears. Only you can.**<br/>\n<br/>\nI started, but there is so much to read so I haven&#39;t gotten through it all. I&#39;ve always been a worrier. So now I need to get rid of my fears and enjoy life. I have no idea where to start. If you&#39;ve never been a worrier, you won&#39;t understand, but I sometimes struggle with close to panic attacks about very, very ordinary things. It is happening less and less since we&#39;ve been deschooling though.<br/>\n <br/>\n** You begin where they are with the skills and personalities they have. Live in the now. Make now better.**<br/>\n<br/>\nThank you for that reminder. I need to get a tattoo to remind me. :)<br/>\n<br/>\n**Stop seeing where you want them to be and start seeing where they are right now. For this deschooling time, live in the moment. Put it all on vacation.**<br/>\n<br/>\nLiving in the moment is foreign to me. I need to saturate my mind/life with these ideas in order to live it.<br/>\n <br/>\n**Sandra Dodd recommended a book that she said is like &quot;cognitive therapy.&quot;<br/>\n<br/>\nSlowing Down to the Speed of Life: How to create a more peaceful,  <br/>\nsimpler life from the inside out<br/>\nRichard Carlson and Joseph Bailey**<br/>\n<br/>\nI&#39;ll be looking for that tomorrow. Thanks.<br/>\n<br/>\n**Let them be happy in who they are instead of putting pressure on them to be who you think they need to be in order to be successful and happy.**<br/>\n<br/>\nThanks again Joyce. I have no prior concept of letting people be who they are. This is all so new to me. <br/>\nOff to play games and fix snack for girls. Will read more later.<br/>\nThank you everyone. I plan on printing and rereading everything. Thanks again.<br/>\nB </span></blockquote></div>","specialLinks":[]},{"userId":191799655,"authorName":"flyingtwinsmom","from":"&quot;flyingtwinsmom&quot; &lt;flyingtwinsmom@...&gt;","profile":"flyingtwinsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: late readers- reassurance needed","postDate":"1288488090","msgId":45214,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhaWdhcStzZ2pjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlhaTloMythMDBmQGVHcm91cHMuY29tPg=="},"prevInTopic":45213,"nextInTopic":45215,"prevInTime":45213,"nextInTime":45215,"topicId":45184,"numMessagesInTopic":0,"msgSnippet":"... Thank you for all of that. I don t have the ability or knack to pull all that out of what they do the way you did. I m proud of myself when I think of them","messageBody":"<div id=\"ygrps-yiv-2097097763\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You&#39;ve got a great curriculum going there ;) The hard part is relaxing into it a bit - your kids Know how to learn. And the more they have the freedom to learn about the world their own way, the better they&#39;ll feel about the very real ways they do learn. Okay, the Other hard part is figuring out how to present all this in a way that works for your evaluator. Ask if you can present photos instead of written work - maybe say you&#39;re doing a lot of hands-on learning (which is true) and that your girls &quot;got behind&quot; on reading and writing in school so you&#39;re going slowly and trying to rebuild their confidence (also true). <br/>\n&gt; <br/>\n&gt; ---Meredith<br/>\n&gt;<br/>\n </span></blockquote>Thank you for all of that. I don&#39;t have the ability or knack to pull all that out of what they do the way you did. I&#39;m proud of myself when I think of them pulling rocks out of the woods as geology. LOL The relaxing is clearly my biggest hurdle. <br/>\nThanks again<br/>\nB</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: late readers- reassurance needed","postDate":"1288487373","msgId":45213,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhaWZrZCtlZDhmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlhaGR2dit2NWF2QGVHcm91cHMuY29tPg=="},"prevInTopic":45212,"nextInTopic":45214,"prevInTime":45212,"nextInTime":45214,"topicId":45184,"numMessagesInTopic":0,"msgSnippet":"What state are you in? FL I know about. And there are other choices here. I don t know what the choices are in other states but I do know there are unschoolers","messageBody":"<div id=\"ygrps-yiv-851326748\">What state are you in? FL I know about. And there are other choices here. I don&#39;t know what the choices are in other states but I do know there are unschoolers in every state. So there must be a way to prevent the eval from messing up everything else.<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;flyingtwinsmom&quot; &lt;flyingtwinsmom@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;marbleface@&quot; &lt;marbleface@&gt; wrote:<br/>\n&gt; <br/>\n&gt; **What DO they do that is fun? Is there any reading involved? **<br/>\n&gt; They love to play outside. They ride quads and take imaginary friends on tours that they&#39;ve designed. They watch TV-a lot. They sometimes cook or make up recipes but never read a recipe. They pull out craft supplies and do art type stuff. We were volunteering at an animal shelter, but that may stop. Totally different topic. We/They visit grandma and work or play with her. So all that to say that there is very little reading involved in anything they do. They like to be physical as much as possible. <br/>\n&gt; <br/>\n&gt; **Have you checked with other hsers in your area to see how they satisfy the annual evaluation requirement -- does it have to be papers? can it be something else? **<br/>\n&gt; Evaluators are hard to come by here. I don&#39;t know of many other local unschoolers, and those that I know, do math, English, etc in papers to give to the evaluator. So I have yet to be able to let go of that in our unschoolig for fear I won&#39;t be able to pass evaluations with them. The evaluator that I&#39;ve found now would like to see 2 or 3 actual samples of work for each of the 5 required subjects, my log and a list of books read, field trips taken, etc. She is the most relaxed that I&#39;ve found. I know I&#39;m blowing my deschooling when I want to ask them to do a page just for evaluations. I don&#39;t think I&#39;ll ever stop the cycle like this.<br/>\n&gt; <br/>\n&gt; **And stop checking on unschooling with your soon-to-be-public-school-teacher friend. :)**<br/>\n&gt; Very good point!! I don&#39;t have any unschooling friends IRL that I can actually talk with, and I love to work things out verbally. I tried using DH, but then it seems he absorbs my fears and multiplies them. I quickly stopped doing that. I have cut out all other forms of more traditional homeschool support such as magazines because I found them pulling me back into the &quot;oh, I&#39;ve got to do that with the kids&quot; attitude. They weren&#39;t helping me grow and feel safe in unschooling.<br/>\n&gt; B<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: late readers- reassurance needed","postDate":"1288481123","msgId":45212,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhaTloMythMDBmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlhaTBqZStkbWFkQGVHcm91cHMuY29tPg=="},"prevInTopic":45211,"nextInTopic":45213,"prevInTime":45211,"nextInTime":45213,"topicId":45184,"numMessagesInTopic":0,"msgSnippet":"... **************** I m going to pull a quote from another of your posts and see if I can highlight some of the hands on learning for you - you actually","messageBody":"<div id=\"ygrps-yiv-1299179933\">&quot;flyingtwinsmom&quot; &lt;flyingtwinsmom@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; When I hear hands on learner, I think unit study. I have so far to go in deschooling. I have yet to see how my children learn in a hands on way<br/>\n </span></blockquote>****************<br/>\n<br/>\nI&#39;m going to pull a quote from another of your posts and see if I can highlight some of the &quot;hands on learning&quot; for you - you actually gave a really good description of kids who are very busy learning!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; They ride quads and take imaginary friends on tours<br/>\n </span></blockquote>that they&#39;ve designed. They watch TV-a lot. They sometimes cook or make up<br/>\nrecipes but never read a recipe. They pull out craft supplies and do art type<br/>\nstuff. We were volunteering at an animal shelter, but that may stop. Totally<br/>\ndifferent topic. We/They visit grandma and work or play with her.<br/>\n*****************<br/>\n<br/>\nTons of hands on learning in there! <br/>\n<br/>\nThey&#39;ve created their own &quot;tours&quot; - that involves a lot of thinking and planning, sequencing, storytelling. Working with imaginary friends (or dolls and stuffed toys for that matter) is essentially character creation - an aspect of literature. Depending on what they&#39;re touring, there may well be some natural science involved. Watch out for snakes!<br/>\n<br/>\nTV - you can&#39;t watch tv without running into all aspects of literature. They&#39;re seeing comedy, drama, melodrama, action, maybe even some non-fiction, too. Even in a cheesy sit-com they&#39;ll see character development, foreshadowing, plot development, inference, reference, juxtaposition, and timing - Plus scene and setting, costuming, lighting, and how those all are used to set moods and give messages to the audience. TV is a literary gold-mine even if what they&#39;re watching seems very simple. And! popular television is rich in references to history, science, mathematics, philosophy, religion and psychology. Its good that they watch it a lot!<br/>\n<br/>\nCooking without a recipe? They&#39;re scientists! That&#39;s pure scientific method at work - have an idea, test it - does it work? If not, what can you change? Tada! Instant chemistry lesson (but don&#39;t tell them, let them have fun while you take pictures to show the evaluator: look, science!). Without even trying they&#39;ll be learning things about solids and liquids, acids and bases, solutions, temperature, and the five senses.  Even without measuring, cooking also relies on that most difficult of math principles to teach: ratios. And I&#39;ll bet there&#39;s some dramatic play involved, so you&#39;ve got literature again. <br/>\n<br/>\nArts and crafts are, of course, arts and crafts, but they are also math and science. More ratios, more experiments, patterns, sequencing, geometry, layering, color theory, aesthetics, two vs three dimensions, more scientific method, planning, prioritizing, problem solving. <br/>\n<br/>\nVolunteering at an animal shelter? Life sciences, for sure, but also social sciences - there are social forces in play that make animal shelters necessary/valuable And there are reasons y&#39;all are there. Those forces and reasons have to do with economics, social status, cultural values and expectations, even politics. You don&#39;t have to talk about any of that in those kinds of terms for your kids to be learning a whole lot about the world and the kinds of decisions people make, and why. <br/>\n<br/>\nVisiting grandma they&#39;ll learn about life cycles, development, history, genetics, and more &quot;social studies&quot; - even if grandma doesn&#39;t tell many stories about her past, they&#39;ll see that she lives differently from y&#39;all  and make some inferences about the world from that. In time they might ask about those, or they might simply make connections. If they see an elderly person on tv, they&#39;ll compare that person and his or her lifestyle to grandma&#39;s. If they see or hear something about the past, they may well connect that to grandma - or you! Kids often connect things to people they know, like that - when that happened, mommy would have been a little girl. <br/>\n<br/>\nYou&#39;ve got a great curriculum going there ;) The hard part is relaxing into it a bit - your kids Know how to learn. And the more they have the freedom to learn about the world their own way, the better they&#39;ll feel about the very real ways they do learn. Okay, the Other hard part is figuring out how to present all this in a way that works for your evaluator. Ask if you can present photos instead of written work - maybe say you&#39;re doing a lot of hands-on learning (which is true) and that your girls &quot;got behind&quot; on reading and writing in school so you&#39;re going slowly and trying to rebuild their confidence (also true). <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: late readers- reassurance needed","postDate":"1288478989","msgId":45211,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhaTdlZCtzMmhqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlhaHJoNStmZGxxQGVHcm91cHMuY29tPg=="},"prevInTopic":45210,"nextInTopic":45212,"prevInTime":45210,"nextInTime":45212,"topicId":45184,"numMessagesInTopic":0,"msgSnippet":"... ************ To some extent, that s a good thing - they ve worked out a strategy for how to handle people who won t help them in specific circumstances.","messageBody":"<div id=\"ygrps-yiv-857728604\">&quot;flyingtwinsmom&quot; &lt;flyingtwinsmom@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;They won&#39;t do anything with friends/family that might require reading because they try to hide the fact that they can&#39;t. <br/>\n </span></blockquote>************<br/>\n<br/>\nTo some extent, that&#39;s a good thing - they&#39;ve worked out a strategy for how to handle people who won&#39;t help them in specific circumstances. Its not much different from turning down a bike-ride because they aren&#39;t steady on a bike. And its self-defense. Avoidance is one way to deal with stressful situations.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I&#39;m curious about the text-rich vs text-poor environment. If they have no interest in books, magazines, etc., how can I create a text-rich environment <br/>\n </span></blockquote>******************<br/>\n<br/>\nYou have print materials in the house, there are examples of print on tv and in games, they see you and other people read, they see signs and lables, clocks and license plates. Unless you live pretty far from civilization with no books or computer they Have a print-rich environment. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I still feel like I&#39;m missing something because they aren&#39;t interested.<br/>\n </span></blockquote>**************<br/>\n<br/>\nThey&#39;re still deschooling *and* they may not be ready to read, yet. In fact, if they can read a little but struggle with it, then that&#39;s a Reeeeeaaaaalllllly good indicator that they aren&#39;t ready. They can bludgeon their way through a few basics, but are physically unable to bring all the necessary skills into play at the same time - yet! <br/>\n<br/>\nIf they aren&#39;t reading at 10, chances are they won&#39;t be reading for a few more years. I know that&#39;s Not what you want to hear, but there are a few ages where there tend to be big &quot;clumps&quot; of kids learning to read, and those are 4ish, 7ish and 13ish. <br/>\n<br/>\nThat&#39;s important to know if you&#39;re going to be dealing with an evaluator. You&#39;re going to need to find a way to explain &quot;still struggling to read... not much progress&quot; for awhile - you&#39;ll need to explain that even if you give up unschooling and go all the way with a curriculum, too, though. If there are other options besides an evaluator, like an umbrella school, look into those for sure. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: late readers- reassurance needed","postDate":"1288473776","msgId":45210,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFRDVDREY4RUQ3QjRDQTE4NTkzODgwNDcwMjJGNzBDQENvbm5pZVBDPg==","inReplyToHeader":"PGlhaHJoNStmZGxxQGVHcm91cHMuY29tPg==","referencesHeader":"PGlhaHJoNStmZGxxQGVHcm91cHMuY29tPg=="},"prevInTopic":45209,"nextInTopic":45211,"prevInTime":45209,"nextInTime":45211,"topicId":45184,"numMessagesInTopic":0,"msgSnippet":"From: flyingtwinsmom Sent: Saturday, October 30, 2010 2:26 PM To: unschoolingbasics@yahoogroups.com Subject: [unschoolingbasics] Re: late readers- reassurance","messageBody":"<div id=\"ygrps-yiv-95322846\">From: flyingtwinsmom <br/>\nSent: Saturday, October 30, 2010 2:26 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> <br/>\nSubject: [unschoolingbasics] Re: late readers- reassurance needed<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;I&#39;m curious about the text-rich vs text-poor environment. If they have no interest in books, magazines, etc., how can I create a text-rich environment without putting pressure on them to read. I do order kids magazines for them, but I tend to get frustrated (never shown/voiced in front of them) that the magazines don&#39;t even really get looked at. I&#39;ll be the one to pick it up and say &quot;oh this is cool. Did you know that...&quot; I put posters up around the house. I cook from recipes and let them see me reading them. I read a lot. But I still feel like I&#39;m missing something because they aren&#39;t interested.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>A text rich environment is one where there is a lot of text. The text doesn&#39;t have to be in the form of books and magazines either. I look around my house and there are DVD&#39;s that have text on them. The TV Guide menu on the satellite has text on it. We have posters that have text. I have a calendar where I keep up with my schedule. I have a white board where my husband and I write little reminders. I have books everywhere. I don&#39;t buy books for my girls because they aren&#39;t really that interested. My husband and I are both librarians so we collect books that interest us. We have a lot of reference type books that we can use for reference rather than fun. We also have computers and gaming systems, both of which cannot be played without seeing some kind of text. Something else to think about is how often you go out of the house. The next time you are driving down the road or are in the grocery store, look around and see how much text you encounter. We have books and magazines everywhere but my girls aren&#39;t interested. They would rather listen to music on YouTube and watch YouTube videos of stuff that interests them. My 3 year old has certain YouTube searches that she likes to go through and listen to. She will ask me to type in the search for her. After a couple of requests for the same search, I will bookmark it for her so she can get to it herself. My 6 year old can&#39;t read but she has a couple of accounts on different sites. We log in for her and read anything to her that she can&#39;t figure out. <br/>\n<br/>\nA text poor environment is one where there are no print materials, no computers, and very little interaction with the outside world. <br/>\n<br/>\nConnie<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: late readers- reassurance needed","postDate":"1288473310","msgId":45209,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJBQjhDREQzLUZERDEtNEEyNy1BNTZCLTAwRDg3MDM2RTUxNUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGlhaHJoNStmZGxxQGVHcm91cHMuY29tPg==","referencesHeader":"PGlhaHJoNStmZGxxQGVHcm91cHMuY29tPg=="},"prevInTopic":45208,"nextInTopic":45210,"prevInTime":45208,"nextInTime":45210,"topicId":45184,"numMessagesInTopic":0,"msgSnippet":"On Oct 30, 2010, at 3:26 PM, flyingtwinsmom wrote: A bit may be social pressure. But I feel a great deal of tension in ... And I would bet that s affecting how","messageBody":"<div id=\"ygrps-yiv-14047427\"><blockquote><span title=\"qreply\">On Oct 30, 2010, at 3:26 PM, flyingtwinsmom wrote:<br/>\n<br/>\nA bit may be social pressure. But I feel a great deal of tension in  <br/>\nyour posts:<br/>\n<br/>\n&gt; I need some reassurance<br/>\n&gt; I&#39;m feeling like I will never<br/>\n&gt; I keep thinking<br/>\n&gt; I told her that they weren&#39;t reading well<br/>\n&gt; I&#39;m having so many other insecurities with unschooling<br/>\n&gt; I&#39;m hurting my children&#39;s futures<br/>\n&gt; can read a little but really struggle and would never read a book  <br/>\n&gt; for fun.<br/>\n&gt; I&#39;m afraid<br/>\n&gt; I try not to<br/>\n&gt; They feel no real desire to read, or become fluent at reading<br/>\n<br/>\nAnd I would bet that&#39;s affecting how they react to others and to books  <br/>\nand to reading.<br/>\n<br/>\nHow would you react if they were being quizzed about bike riding or  <br/>\nswimming? Or guitar playing? Or knowledge of the 90&#39;s?<br/>\n<br/>\nIf you can imagine yourself being bothered by those too, then there&#39;s  <br/>\nsomething deeper than the reading.<br/>\n<br/>\nIf you can&#39;t imagine yourself being bothered by those, then treat  <br/>\nreading like those. Your girls *will* get to it when *they* need and  <br/>\nwant it (and are developmentally ready for it.)<br/>\n<br/>\nDid you read the links to Sandra&#39;s site and mine? I really really urge  <br/>\nyou to read those before posting again. *We* can&#39;t get rid of your  <br/>\nfears. Only you can.<br/>\n<br/>\nAnd I really really really -- even more importantly! -- urge you to go  <br/>\nspend joyful time with your daughters, looking at the world through  <br/>\ntheir delight instead of your worries and fears.<br/>\n<br/>\n<br/>\n&gt; They weren&#39;t terribly premature, but I always believe that the month  <br/>\n&gt; early has a lot to do with them being &quot;behind&quot; in many areas even  <br/>\n&gt; though they were healthy and &quot;normal&quot; at birth.<br/>\n<br/>\n<br/>\nLet this go. They are who they are. Don&#39;t compare with others. Don&#39;t  <br/>\ncompare with who you imagine they might be. You can&#39;t know and it  <br/>\ndoesn&#39;t matter.<br/>\n<br/>\nYou begin where they are with the skills and personalities they have.  <br/>\nLive in the now. Make now better.<br/>\n<br/>\nI have a psychologist friend whose son is on the autistic spectrum.  <br/>\nShe pointed out how he couldn&#39;t do several things her younger daughter  <br/>\ncould do easily. But the things she pointed out my not-in-the-least- <br/>\nautistic daughter couldn&#39;t do either. The comparisons, even the idea  <br/>\nthat he was autistic spectrum was preventing her from seeing how to  <br/>\nhelp who he was right now do what he wanted to do right now. She kept  <br/>\ntrying to change him, move him to where she thought he should be.<br/>\n<br/>\n&gt; I&#39;m curious about the text-rich vs text-poor environment.<br/>\n<br/>\n<br/>\nWe&#39;re living in a text rich environment. Unless you&#39;re keeping print  <br/>\nout of the house, they&#39;re surrounded by it.<br/>\n<br/>\n&gt; I do order kids magazines for them<br/>\n<br/>\nPut it this way. If you had no interest in cooking and your husband  <br/>\nkept ordering cooking magazines and bringing cookbooks home, how would  <br/>\nthat feel to you? Wouldn&#39;t that feel like pressure? Wouldn&#39;t that feel  <br/>\nlike him saying there was something wrong with you that he was subtly  <br/>\ntrying to fix?<br/>\n<br/>\n*For now* as part of deschooling, don&#39;t bring in anything they aren&#39;t  <br/>\ninterested in. Look at what they are interested in and help them  <br/>\n*joyfully!* explore that.<br/>\n<br/>\n&gt; If they have no interest in books, magazines, etc., how can I create  <br/>\n&gt; a text-rich environment without putting pressure on them to read.<br/>\n<br/>\nHow could your husband create a cooking rich environment for you  <br/>\nwithout putting pressure on you to cook?<br/>\n<br/>\nYou can&#39;t seek to change someone without 1) sending the message  <br/>\nthey&#39;re not good enough as they are and 2) pressuring them.<br/>\n<br/>\nI know you&#39;re trying to help them. Parents have been trying to do that  <br/>\nfrom the beginning of time! But from their point of view, they can  <br/>\nfeel they&#39;re not meeting your expectations, that they&#39;re disappointing  <br/>\nyou.<br/>\n<br/>\nStop seeing where you want them to be and start seeing where they are  <br/>\nright now. For this deschooling time, live in the moment. Put it all  <br/>\non vacation.<br/>\n<br/>\n&gt;  tend to get frustrated (never shown/voiced in front of them) that  <br/>\n&gt; the magazines don&#39;t even really get looked at.<br/>\n<br/>\n<br/>\nTrust me, they know, even if you don&#39;t voice it. It&#39;s undoubtedly in  <br/>\nyour body language and tone of voice.<br/>\n<br/>\nBreathe. Let go of the tension. Look at the right now. Look at this  <br/>\nmoment and turn your thoughts to happy ones.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/breathing\">http://sandradodd.com/breathing</a><br/>\n<br/>\nSandra Dodd recommended a book that she said is like &quot;cognitive  <br/>\ntherapy.&quot;<br/>\n<br/>\nSlowing Down to the Speed of Life: How to create a more peaceful,  <br/>\nsimpler life from the inside out<br/>\nRichard Carlson and Joseph Bailey<br/>\n<br/>\n&gt;  But I still feel like I&#39;m missing something because they aren&#39;t  <br/>\n&gt; interested.<br/>\n<br/>\n<br/>\nLet this go, really.<br/>\n<br/>\nWhat if they weren&#39;t interested in coloring books? What if they  <br/>\nweren&#39;t interested in television? What if they weren&#39;t interested in  <br/>\nmakeup?<br/>\n<br/>\nWe&#39;re each individuals. Maybe they won&#39;t ever want to read for  <br/>\npleasure. They *will* read but maybe only for information. Let them be  <br/>\nhappy in who they are instead of putting pressure on them to be who  <br/>\nyou think they need to be in order to be successful and happy.<br/>\n<br/>\nJoyce </span></blockquote></div>","specialLinks":[]},{"userId":191799655,"authorName":"flyingtwinsmom","from":"&quot;flyingtwinsmom&quot; &lt;flyingtwinsmom@...&gt;","profile":"flyingtwinsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: late readers- reassurance needed","postDate":"1288471982","msgId":45208,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhaTBqZStkbWFkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEM0MkIxMDc5LTIxRUMtNEMyMy1CMDc5LTFEREEyQjUxNzQ1NkB2ZXJpem9uLm5ldD4="},"prevInTopic":45207,"nextInTopic":45209,"prevInTime":45207,"nextInTime":45209,"topicId":45184,"numMessagesInTopic":0,"msgSnippet":"... ** Yes, there is a window. The window is that schools stop including reading in classrooms and make it part of special ed. Schools are designed to operate","messageBody":"<div id=\"ygrps-yiv-1509703922\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; On Oct 29, 2010, at 9:50 PM, flyingtwinsmom wrote:<br/>\n&gt; <br/>\n&gt; &gt; there is a &quot;window of opportunity that closes at 9&quot; if they aren&#39;t  <br/>\n&gt; &gt; fluent at reading<br/>\n&gt; <br/>\n </span></blockquote>** Yes, there is a window. The window is that schools stop including  <br/>\n reading in classrooms and make it part of special ed. Schools are  <br/>\n designed to operate with kids reading fluently by 4th grade. Those  <br/>\n kids who are failing the school&#39;s needs get pulled out for correction.**<br/>\n<br/>\nThat makes a lot of sense. I&#39;ve never stopped to think about the &quot;window&quot; being forced by the schools. <br/>\n<br/>\n** Making a hands on learner learn through reading is almost as handicapping as making a deaf child learn through listening.**<br/>\n<br/>\nWhen I hear hands on learner, I think unit study. I have so far to go in deschooling. I have yet to see how my children learn in a hands on way. <br/>\n<br/>\n**But this culture has shoved all other modes of learning way down on the admirable list and elevated reading on a pedestal. All modes of learning should be seen as valuable. Some will be more useful for some things but all are equally valuable. Do you want your hair stylist to cut your hair based on what she read in a book?**<br/>\n<br/>\nI am very guilty of putting reading on that pedestal. I am a reader. I read a lot. I look to books and the printed word to learn. I can learn from a lecture, but it doesn&#39;t sink in until I can visualize it. I turn to TV and outdoors for relaxation so I have no idea or understanding of learning in any other way. <br/>\n<br/>\n**Two things that will help:<br/>\nOne, stop listening to people talk about schooled kids&#39; learning. They *only* know the behaviors of schooled kids. Zoo keepers who only know animals in cages have no clue about how animals behave in the wild. No matter how extensive their cage knowledge is, it is useless for discussing the behavior of animals in their natural habitat.** <br/>\n<br/>\nYou&#39;re absolutely right, but I don&#39;t get to talk to other unschoolers. I&#39;ve cut out all other media dealing with schooled and traditionally homeschooled kids, but I still like to actually talk with people so I&#39;ve tried to pick the most unschool friendly friends I have to talk with about this stuff.  <br/>\n<br/>\n**You&#39;re hurting your kids &quot;right nows&quot; with your worry by giving credence to knowledge of caged kids having anything to do with natural kids.**<br/>\n<br/>\nDo unschooling parents not worry they might be hurting their kids future? I guess the longer we do this the more comfortable I&#39;ll become in the knowledge that I am doing the right thing, but just starting out, it&#39;s an obstacle for me. I want my children to have the greatest &quot;right nows&quot; that I can give them. In thinking about this, I realize that I need to remind myself that &quot;right now&quot; is all we really have. I&#39;ve bought into the mainstream idea that we have to worry about the future, plan for the future, look to the future. I need to find a balance between the &quot;right now&quot; and the future. My fears for the future shouldn&#39;t ruin &quot;right now.&quot;<br/>\n<br/>\n**I assume you read something here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/reading\">http://sandradodd.com/reading</a><br/>\n <br/>\nIt&#39;s worth clicking on all the links. And all the links on each page  <br/>\ntoo. Also:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a> scroll down the left side<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://SandraDodd.com/bookworship\">http://SandraDodd.com/bookworship</a><br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/bookchange\">http://sandradodd.com/bookchange</a><br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/bookmotif\">http://sandradodd.com/bookmotif</a> **<br/>\n<br/>\nThe first link is the page I&#39;ve seen. Thank you for the other links.<br/>\n<br/>\n**But here&#39;s something to think about, an idea that we&#39;ve turned over a few times. Lots of us loved reading as kids, always with a nose in a book. But that doesn&#39;t seem as prevalent among unschooled kids --   though there certainly are some that do immerse themselves in books.  It seems likely that what many of us loved to do was escape. Our unschooled kids don&#39;t need to escape. **<br/>\n<br/>\nThanks for this thought. I still read sometimes now to escape. I will by a cheap romance when I need a break from life. I think my girls turn to TV for an escape though. I could be wrong on this because I do watch with them, but it seems that their viewing hours tend to be regular so I think they use it to zone out for awhile. <br/>\nB</div>","specialLinks":[]},{"userId":191799655,"authorName":"flyingtwinsmom","from":"&quot;flyingtwinsmom&quot; &lt;flyingtwinsmom@...&gt;","profile":"flyingtwinsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: late readers- reassurance needed","postDate":"1288466789","msgId":45207,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhaHJoNStmZGxxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlhaGJhbCtmaGVtQGVHcm91cHMuY29tPg=="},"prevInTopic":45206,"nextInTopic":45208,"prevInTime":45206,"nextInTime":45208,"topicId":45184,"numMessagesInTopic":0,"msgSnippet":"... **She s wrong - reading is actually far easier for adults to learn than for children *provided that* those adults haven t been judged stupid for not","messageBody":"<div id=\"ygrps-yiv-1005221369\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &quot;flyingtwinsmom&quot; &lt;flyingtwinsmom@&gt; wrote:<br/>\n&gt; &gt;She went on to tell me that I better get help because there is a &quot;window of opportunity that closes at 9&quot; if they aren&#39;t fluent at reading.<br/>\n&gt; ******************<br/>\n </span></blockquote>**She&#39;s wrong - reading is actually far easier for adults to learn than for children *provided that* those adults haven&#39;t been judged &quot;stupid&quot; for not being ready to learn at some arbitrarily chose age. **<br/>\n<br/>\nI&#39;m afraid that the judging part is happening from others. I try not to judge. Since we&#39;ve been deschooling, I never force reading. I don&#39;t make statements that they &quot;have to&quot; read anything. But I still think that the social pressure from friends and other family is bothering them. They feel no real desire to read, or become fluent at reading, but they feel that they are being labeled stupid because they aren&#39;t reading well yet. They won&#39;t do anything with friends/family that might require reading because they try to hide the fact that they can&#39;t. <br/>\n<br/>\n* But other than for people who live in text-poor environments, reading isn&#39;t hard to learn... once all the necessary brain functions are sufficiently developed.*<br/>\n<br/>\nThey weren&#39;t terribly premature, but I always believe that the month early has a lot to do with them being &quot;behind&quot; in many areas even though they were healthy and &quot;normal&quot; at birth. I keep it in mind, but since they&#39;ve never had major issues, others tend to forget it. I&#39;m curious about the text-rich vs text-poor environment. If they have no interest in books, magazines, etc., how can I create a text-rich environment without putting pressure on them to read. I do order kids magazines for them, but I tend to get frustrated (never shown/voiced in front of them) that the magazines don&#39;t even really get looked at. I&#39;ll be the one to pick it up and say &quot;oh this is cool. Did you know that...&quot; I put posters up around the house. I cook from recipes and let them see me reading them. I read a lot. But I still feel like I&#39;m missing something because they aren&#39;t interested. <br/>\n<br/>\n<br/>\n**Happily, while natural learning means that people learn what interests them, its not true that kids only choose to learn things they see as fun. That&#39;s one of the fabulous parts of unschooling, getting to see kids choose to learn things that they don&#39;t necessarily value for the sake of that thing, but to reach some other goal. So kids given the chance to follow their interests will learn to read (when their brains are ready) because its such a valuable tool. **<br/>\n<br/>\nThanks. I haven&#39;t had the chance to meet any unschoolers and only know about unschooling from lists like this so I guess I don&#39;t know what unschooled kids are like. And since we&#39;ve basically just started deschooling again and again ;) I don&#39;t understand what true learning can be.<br/>\nB</div>","specialLinks":[]},{"userId":191799655,"authorName":"flyingtwinsmom","from":"&quot;flyingtwinsmom&quot; &lt;flyingtwinsmom@...&gt;","profile":"flyingtwinsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: late readers- reassurance needed","postDate":"1288465813","msgId":45206,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhaHFpbCsxMDVyZkBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PGlhaDczZitobmJwQGVHcm91cHMuY29tPg=="},"prevInTopic":45205,"nextInTopic":45207,"prevInTime":45205,"nextInTime":45207,"topicId":45184,"numMessagesInTopic":0,"msgSnippet":"... **You did not say if you are doing reading lessons or making them read things, but if you are I would stop. Whenever they need something read to them, read","messageBody":"<div id=\"ygrps-yiv-1770451825\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;siep_1&quot; &lt;cUUrious@...&gt; wrote:<br/>\n**You did not say if you are doing reading lessons or making them read things, but if you are I would stop. Whenever they need something read to them, read it. You can point things out about the words *every so often*, but do not make it a lesson. They just need to have something read for them. It is quite natural that you are not going to be immediately available for everything and eventually they will start figuring out a word here and there. If you&#39;re not right next to them ask them to spell the word so you can tell them what it says so they can go on with the game (or whatever needed reading). Read books to them *for fun*. I think it also helped my son that he wanted to write (birthday card, thank you note, etc.). Spell it out so they can write. It absolutely will happen, but you can make it happen later by making reading a miserable thing for them.**<br/>\n<br/>\nWe stopped reading and phonics lessons in Feb when we started to deschool. I do what you say and just read it for them or ask them to spell it if I&#39;m into something else. Most of the time this works great. They don&#39;t want to read anything *for fun.* In Feb, I was reading novels to them, but it was like pulling teeth to get them to listen. Since then, I&#39;ve not read anything unless asked. They never have been into books. Never even enjoyed picture books.<br/>\nB </span></blockquote></div>","specialLinks":[]},{"userId":191799655,"authorName":"flyingtwinsmom","from":"&quot;flyingtwinsmom&quot; &lt;flyingtwinsmom@...&gt;","profile":"flyingtwinsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: late readers- reassurance needed","postDate":"1288454046","msgId":45205,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhaGYydStoM2NzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTE0NS13MTFCOTAzQ0U4OEJENThEMkJBQkU3NEJCNDYwQHBoeC5nYmw+"},"prevInTopic":45204,"nextInTopic":45206,"prevInTime":45204,"nextInTime":45206,"topicId":45184,"numMessagesInTopic":0,"msgSnippet":"... Thank you! It s a great clip. B","messageBody":"<div id=\"ygrps-yiv-194082702\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Shell K. &lt;HGEFREE@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=NFG71nPgUe0\">http://www.youtube.com/watch?v=NFG71nPgUe0</a><br/>\n&gt; <br/>\n </span></blockquote>Thank you! It&#39;s a great clip.<br/>\nB</div>","specialLinks":[{"url":"http://www.youtube.com/embed/NFG71nPgUe0?wmode=opaque","type":"VIDEO"}]},{"userId":191799655,"authorName":"flyingtwinsmom","from":"&quot;flyingtwinsmom&quot; &lt;flyingtwinsmom@...&gt;","profile":"flyingtwinsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: late readers- reassurance needed","postDate":"1288453313","msgId":45204,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhaGVjMStyanNxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlhaDRmYitmbmRyQGVHcm91cHMuY29tPg=="},"prevInTopic":45203,"nextInTopic":45205,"prevInTime":45203,"nextInTime":45205,"topicId":45184,"numMessagesInTopic":0,"msgSnippet":"... **Your girls will be okay. Let it all go.** Thank you. I keep telling myself that, but it doesn t sink in like I would like. **He never asked me to read to","messageBody":"<div id=\"ygrps-yiv-72684652\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Elli&quot; &lt;elinorsparks@...&gt; wrote:<br/>\n**Your girls will be okay. Let it all go.**<br/>\nThank you. I keep telling myself that, but it doesn&#39;t sink in like I would like.<br/>\n<br/>\n**He never asked me to read to him once we started unschooling   This was a big change from the old days when i would read to him at bedtime.**<br/>\nI&#39;m glad to hear this. They never liked being read to so when we stopped doing lessons, I stopped that. They&#39;ve never asked for it, and don&#39;t usually like books on tape unless in the car. I bring some on car trips but other than that, if they think it&#39;s a book, they will stay a mile away.  <br/>\n<br/>\n**I did my best to help without judging him and without goading him to read on his own and with a cheerful attitude.   Over time he started figuring out words on his own.  And now he reads just fine.**<br/>\nI try to do the same and not pass judgement, but I think they feel &quot;dumb&quot; because their friends read so much better and it bothers them. I think they want to read better but only to be equal to friends, not because they really want to. KWIM?<br/>\nB </span></blockquote></div>","specialLinks":[]},{"userId":191799655,"authorName":"flyingtwinsmom","from":"&quot;flyingtwinsmom&quot; &lt;flyingtwinsmom@...&gt;","profile":"flyingtwinsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: late readers- reassurance needed","postDate":"1288452927","msgId":45203,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhaGR2dit2NWF2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlhaDA2YytrZTMxQGVHcm91cHMuY29tPg=="},"prevInTopic":45198,"nextInTopic":45204,"prevInTime":45202,"nextInTime":45204,"topicId":45184,"numMessagesInTopic":0,"msgSnippet":"... **What DO they do that is fun? Is there any reading involved? ** They love to play outside. They ride quads and take imaginary friends on tours that","messageBody":"<div id=\"ygrps-yiv-696941215\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;marbleface@...&quot; &lt;marbleface@...&gt; wrote:<br/>\n<br/>\n**What DO they do that is fun? Is there any reading involved? **<br/>\nThey love to play outside. They ride quads and take imaginary friends on tours that they&#39;ve designed. They watch TV-a lot. They sometimes cook or make up recipes but never read a recipe. They pull out craft supplies and do art type stuff. We were volunteering at an animal shelter, but that may stop. Totally different topic. We/They visit grandma and work or play with her. So all that to say that there is very little reading involved in anything they do. They like to be physical as much as possible. <br/>\n<br/>\n**Have you checked with other hsers in your area to see how they satisfy the annual evaluation requirement -- does it have to be papers? can it be something else? **<br/>\nEvaluators are hard to come by here. I don&#39;t know of many other local unschoolers, and those that I know, do math, English, etc in papers to give to the evaluator. So I have yet to be able to let go of that in our unschoolig for fear I won&#39;t be able to pass evaluations with them. The evaluator that I&#39;ve found now would like to see 2 or 3 actual samples of work for each of the 5 required subjects, my log and a list of books read, field trips taken, etc. She is the most relaxed that I&#39;ve found. I know I&#39;m blowing my deschooling when I want to ask them to do a page just for evaluations. I don&#39;t think I&#39;ll ever stop the cycle like this.<br/>\n<br/>\n**And stop checking on unschooling with your soon-to-be-public-school-teacher friend. :)**<br/>\nVery good point!! I don&#39;t have any unschooling friends IRL that I can actually talk with, and I love to work things out verbally. I tried using DH, but then it seems he absorbs my fears and multiplies them. I quickly stopped doing that. I have cut out all other forms of more traditional homeschool support such as magazines because I found them pulling me back into the &quot;oh, I&#39;ve got to do that with the kids&quot; attitude. They weren&#39;t helping me grow and feel safe in unschooling.<br/>\nB </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: late readers- reassurance needed","postDate":"1288450197","msgId":45198,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhaGJhbCtmaGVtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlhZnRsMCtoNGgzQGVHcm91cHMuY29tPg=="},"prevInTopic":45197,"nextInTopic":45203,"prevInTime":45197,"nextInTime":45199,"topicId":45184,"numMessagesInTopic":0,"msgSnippet":"... ****************** She s wrong - reading is actually far easier for adults to learn than for children *provided that* those adults haven t been judged","messageBody":"<div id=\"ygrps-yiv-901988101\">&quot;flyingtwinsmom&quot; &lt;flyingtwinsmom@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;She went on to tell me that I better get help because there is a &quot;window of opportunity that closes at 9&quot; if they aren&#39;t fluent at reading.<br/>\n </span></blockquote>******************<br/>\n<br/>\nShe&#39;s wrong - reading is actually far easier for adults to learn than for children *provided that* those adults haven&#39;t been judged &quot;stupid&quot; for not being ready to learn at some arbitrarily chose age. Even adults who have been through the mill of the school system without learning to read (and there is a substantial number, far far more than schools want to admit, I used to work in adult literacy) can learn to read once the biggest emotional hurdles are overcome. What&#39;s more, they generally learn in months, rather than years they way children are &quot;taught&quot;. <br/>\n<br/>\nThe biggest barrier to reading, period, is teaching. That&#39;s a pretty extreme statment! But other than for people who live in text-poor environments, reading isn&#39;t hard to learn... once all the necessary brain functions are sufficiently developed. The catch is that the &quot;necessary functions&quot; have a good bit of variation to them, so much so that in print-rich environments some people pick up reading intuitively at 4, or work it out as a logic puzzle at 6, or have it all suddenly come together at 14. That variation plays havoc with &quot;teaching&quot; - how can you teach something that a person may not be ready to learn for a decade? The whole idea is bonkers. People learning to read sometimes need support and encouragement, but its such an idiosyncratic skill-set that the best even a &#39;teacher&#39; can do is follow the lead of the learner.<br/>\n<br/>\nThe best thing you can do to &quot;promote reading&quot; is to help your kids in whatever way *they* like. If they like you to read to them, do that - read comic books, or the dialog/instructions in video games, or the information on Pokemon cards, or the text on webpages, or even novels. If your kids are trying to read and are frustrated, reassure them however you can. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;BTW-both my girls are 10 and can read a little but really struggle and would never read a book for fun. <br/>\n </span></blockquote>*******************<br/>\n<br/>\nMy 9yo rarely reads anything more wordy than a short story in Spider magazine - and most of the time she skims those and looks at the pictures a lot. She&#39;s been reading since she was 4, but long passages of text don&#39;t interest her. She&#39;d rather read a set of instructions, or a map, or a comic book or graphic novel. <br/>\n<br/>\nSome adults never read books for fun. I&#39;m not sure how or when the idea got started that the point of reading was to read books for fun, but its kind of a weird idea if you think about it. I live in the US where driving cars is nearly ubiquitious - its hard to get around, outside of some big cities, without driving - and yet we don&#39;t expect everyone to Drive for fun.<br/>\n<br/>\nHappily, while natural learning means that people learn what interests them, its not true that kids only choose to learn things they see as fun. That&#39;s one of the fabulous parts of unschooling, getting to see kids choose to learn things that they don&#39;t necessarily value for the sake of that thing, but to reach some other goal. So kids given the chance to follow their interests will learn to read (when their brains are ready) because its such a valuable tool. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":348983609,"authorName":"siep_1","from":"&quot;siep_1&quot; &lt;cUUrious@...&gt;","profile":"siep_1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: late readers- reassurance needed","postDate":"1288445871","msgId":45197,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhaDczZitobmJwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlhZnRsMCtoNGgzQGVHcm91cHMuY29tPg=="},"prevInTopic":45196,"nextInTopic":45198,"prevInTime":45196,"nextInTime":45198,"topicId":45184,"numMessagesInTopic":0,"msgSnippet":"Unless your girls have something that causes them to be unable to learn to read, you will not be able to stop them from learning eventually, because, yes,","messageBody":"<div id=\"ygrps-yiv-1914114326\">Unless your girls have something that causes them to be unable to learn to read, you will not be able to stop them from learning eventually, because, yes, reading is everywhere and needed for so many things. But they have no real need to read at this point. They are not buying a house or signing any other contract (and even if they were, wouldn&#39;t you read to them what it said before they signed it?).<br/>\nMy son did not read until he was 11. I never taught him in the traditional sense. You did not say if you are doing reading lessons or making them read things, but if you are I would stop. Whenever they need something read to them, read it. You can point things out about the words *every so often*, but do not make it a lesson. They just need to have something read for them. It is quite natural that you are not going to be immediately available for everything and eventually they will start figuring out a word here and there. If you&#39;re not right next to them ask them to spell the word so you can tell them what it says so they can go on with the game (or whatever needed reading). Read books to them *for fun*. I think it also helped my son that he wanted to write (birthday card, thank you note, etc.). Spell it out so they can write. It absolutely will happen, but you can make it happen later by making reading a miserable thing for them.<br/>\nBTW once my son read, he read Harry Potter within a month.<br/>\nAlso, he has an *amazing* memory for anything he&#39;s heard, since he trained it so well for the first 10 years, not being able to re-read something. I personally see &#39;late&#39; reading as an advantage, not a disadvantage. At 16 my son just started some college classes, because he wanted to.<br/>\nIt will all be ok!<br/>\nSybelle</div>","specialLinks":[]},{"userId":93561159,"authorName":"Shell K.","from":"Shell K. &lt;HGEFREE@...&gt;","profile":"imagine7generations","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Re: late readers- reassurance needed","postDate":"1288444860","msgId":45196,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTE0NS13MTFCOTAzQ0U4OEJENThEMkJBQkU3NEJCNDYwQHBoeC5nYmw+","inReplyToHeader":"PGlhaDRmYitmbmRyQGVHcm91cHMuY29tPg==","referencesHeader":"PGlhZnRsMCtoNGgzQGVHcm91cHMuY29tPiw8aWFoNGZiK2ZuZHJAZUdyb3Vwcy5jb20+"},"prevInTopic":45194,"nextInTopic":45197,"prevInTime":45195,"nextInTime":45197,"topicId":45184,"numMessagesInTopic":0,"msgSnippet":"http://www.youtube.com/watch?v=NFG71nPgUe0 I love this clip: This self made real estate millionaire did not read or write until 7th grade, listen to her","messageBody":"<div id=\"ygrps-yiv-710550856\"><a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=NFG71nPgUe0\">http://www.youtube.com/watch?v=NFG71nPgUe0</a><br/>\n<br/>\nI love this clip: This self made real estate millionaire did not read or write until 7th grade, listen to her describe it here.<br/>\nBarbara Corcoran is the Founder of Corcoran Group and the Chairman of Barbara Corcoran, Inc. Her credentials include straight Ds in high school and college and twenty jobs by the time she turned twenty-three. It was her next job, however, that would make her one of the most successful entrepreneurs in the country, when she borrowed $1,000 from her boyfriend and quit her job as a waitress to start a tiny real estate company in New York City. Over the next twenty-five years, shed parlay that $1,000 loan into a five-billion-dollar real estate business and the largest and best-known brand in the business.</div>","specialLinks":[{"url":"http://www.youtube.com/embed/NFG71nPgUe0?wmode=opaque","type":"VIDEO"}]},{"userId":237471585,"authorName":"Elli","from":"&quot;Elli&quot; &lt;elinorsparks@...&gt;","profile":"sistergoddesselli","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: late readers- reassurance needed","postDate":"1288443179","msgId":45194,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhaDRmYitmbmRyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlhZnRsMCtoNGgzQGVHcm91cHMuY29tPg=="},"prevInTopic":45193,"nextInTopic":45196,"prevInTime":45193,"nextInTime":45195,"topicId":45184,"numMessagesInTopic":0,"msgSnippet":"Hi Your girls will be okay. Let it all go.  We started unschooling 2 years ago after several years in public school. My son was in a remedial reading class in","messageBody":"<div id=\"ygrps-yiv-1687704450\">Hi<br/>\n<br/>\nYour girls will be okay. Let it all go.  We started unschooling 2 years ago after several years in public school. My son was in a remedial reading class in school. He felt like a looser and didn&#39;t like reading.  As soon as we started unschooling I dropped the issue of reading.  He used to tell me he was lousy at reading.  And that he didn&#39;t like it.  Now, after 2 years of playing video games he reads just fine.  And he feels pretty neutral about it, which is a far cry from the negative assessment he used to give himself in regards to reading. <br/>\n<br/>\nHe never asked me to read to him once we started unschooling   This was a big change from the old days when i would read to him at bedtime. So...how did he learn to read?   From the computer games.  At first he needed help, with the most basic words.  Sometimes he needed me to read something to him on the screen and other times he needed help writing. I did my best to help without judging him and without goading him to read on his own and with a cheerful attitude.   Over time he started figuring out words on his own.  And now he reads just fine.  I recently printed a list of &quot;cheats&quot; for one of his game.  He read the four page list on his own asking only for help with the meaning of technical words. <br/>\n<br/>\nIs he going to be a novelist some day?   I don&#39;t know.  And frankly, I don&#39;t care.  He will figure it out when the time comes.  In the meantime, he is feeling much better about himself.  He is learning how to read because he is exposed to the written word and wants to decode it on his own now. <br/>\n<br/>\nYour girls will figure it out.   <br/>\n<br/>\nIn Finland, where the largest percentage of adults read for pleasure and where the largest percentage of men read for pleasure, they don&#39;t start teaching reading in school until 2nd grade.  Up until then, they read to the kids.  They pick fabulous interesting complex stuff to read.  The kids love listening.  feeling no pressure from adults, they often come to figure out reading on their own.  In US schools we inflict reading lessons on our kids when they are way too young.  We do so because we are driven by fear.  The things they are forced to read have been dumbed down.  The stuff is boring and irrelevant.  Educators have argued for decades as to the best way to teach reading.  I&#39;m guessing they can&#39;t figure it out because they are trying too early on a child&#39;s life.  Each of us should be given the respect to come to reading on our own schedule. <br/>\n<br/>\nWarmly,<br/>\n<br/>\nElli</div>","specialLinks":[]},{"userId":193064123,"authorName":"marbleface@bellsouth.net","from":"&quot;marbleface@...&quot; &lt;marbleface@...&gt;","profile":"marbleface@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: late readers- reassurance needed","postDate":"1288438796","msgId":45193,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhaDA2YytrZTMxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlhZnRsMCtoNGgzQGVHcm91cHMuY29tPg=="},"prevInTopic":45188,"nextInTopic":45194,"prevInTime":45192,"nextInTime":45194,"topicId":45184,"numMessagesInTopic":0,"msgSnippet":"What DO they do that is fun? Is there any reading involved? Have you checked with other hsers in your area to see how they satisfy the annual evaluation","messageBody":"<div id=\"ygrps-yiv-148559875\">What DO they do that is fun? Is there any reading involved? <br/>\n<br/>\nHave you checked with other hsers in your area to see how they satisfy the annual evaluation requirement -- does it have to be papers? can it be something else? <br/>\n<br/>\nAnd stop checking on unschooling with your soon-to-be-public-school-teacher friend. :)<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;flyingtwinsmom&quot; &lt;flyingtwinsmom@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I need some reassurance that late readers will be ok. We started deschooling in Feb, and I&#39;m feeling like I will never get out of deschooling. I keep thinking about what I need for &quot;proof&quot; of education-which is actually papers done by the girls. But I was talking to an older friend today. She mentioned doing some web-quests with the girls, and I told her that they weren&#39;t reading well and had no desire to read yet. She went on to tell me that I better get help because there is a &quot;window of opportunity that closes at 9&quot; if they aren&#39;t fluent at reading. She is getting this from experience with her own 6 kids and from the classes she is now taking to be a teacher. She reasoned that in order to do anything in life, you HAVE TO know how to read well. I know that a lot of that is bunk, but I&#39;m having so many other insecurities with unschooling and if I&#39;m hurting my children&#39;s futures now that I need some reassurance. I&#39;ve found Sandra&#39;s page on late readers. If anyone has any other great pages or can personally share, I would love to hear. BTW-both my girls are 10 and can read a little but really struggle and would never read a book for fun. <br/>\n&gt; Thanks<br/>\n&gt; B<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] late readers- reassurance needed","postDate":"1288429693","msgId":45188,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM0MkIxMDc5LTIxRUMtNEMyMy1CMDc5LTFEREEyQjUxNzQ1NkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGlhZnRsMCtoNGgzQGVHcm91cHMuY29tPg==","referencesHeader":"PGlhZnRsMCtoNGgzQGVHcm91cHMuY29tPg=="},"prevInTopic":45184,"nextInTopic":45193,"prevInTime":45187,"nextInTime":45189,"topicId":45184,"numMessagesInTopic":0,"msgSnippet":"... Yes, there is a window. The window is that schools stop including reading in classrooms and make it part of special ed. Schools are designed to operate","messageBody":"<div id=\"ygrps-yiv-356918244\">On Oct 29, 2010, at 9:50 PM, flyingtwinsmom wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; there is a &quot;window of opportunity that closes at 9&quot; if they aren&#39;t  <br/>\n&gt; fluent at reading<br/>\n<br/>\n </span></blockquote>Yes, there is a window. The window is that schools stop including  <br/>\nreading in classrooms and make it part of special ed. Schools are  <br/>\ndesigned to operate with kids reading fluently by 4th grade. Those  <br/>\nkids who are failing the school&#39;s needs get pulled out for correction.<br/>\n<br/>\n99% of the people in this society have *zero* experience with kids who  <br/>\nlearn naturally. Zero. Their only experience is with kids who are  <br/>\nbeing force fed learning.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She reasoned that in order to do anything in life, you HAVE TO know  <br/>\n&gt; how to read well<br/>\n<br/>\n </span></blockquote>Reading is certainly useful but that attitude very much dismisses all  <br/>\nthe other ways of learning, which to many people, are more tied to how  <br/>\nthey learn. Some learn better hands on. Some visually. Some by  <br/>\nlistening. Reading about multiple intelligences should help. Making a  <br/>\nhands on learner learn through reading is almost as handicapping as  <br/>\nmaking a deaf child learn through listening.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/intelligences/\">http://sandradodd.com/intelligences/</a><br/>\n<br/>\nIf I had the choice between listening to an orchestra who learned to  <br/>\nplay from books and one who learned to play by playing and discussing  <br/>\nand listening, I&#39;d choose the latter!<br/>\n<br/>\nBooks are *convenient* for schools. They allow one teacher to pour  <br/>\nknowledge into 30 kids. They allow schools to run as factories.<br/>\n<br/>\nI&#39;m no way dismissing books. I love books. But this culture has shoved  <br/>\nall other modes of learning way down on the admirable list and  <br/>\nelevated reading on a pedestal. All modes of learning should be seen  <br/>\nas valuable. Some will be more useful for some things but all are  <br/>\nequally valuable. Do you want your hair stylist to cut your hair based  <br/>\non what she read in a book?<br/>\n<br/>\nThe worship of books has ancient roots and back then, if you wanted to  <br/>\nlearn more about the world than the few hundred farmers or merchants  <br/>\naround you, books were the best way. But today, if you wanted to learn  <br/>\nmore about what it&#39;s like to live in Mongolia and couldn&#39;t travel  <br/>\nthere, would a book give you a better beginning or a video  <br/>\ndocumentary? How about a trip to a Mongolian restaurant? How about  <br/>\nlistening to some Mongolian music? Listening to or watching interviews  <br/>\nso you can hear their language or accented English? Books do some  <br/>\nthings very well, but they do other things very poorly.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know that a lot of that is bunk, but I&#39;m having so many other  <br/>\n&gt; insecurities with unschooling and if I&#39;m hurting my children&#39;s  <br/>\n&gt; futures now that I need some reassurance.<br/>\n<br/>\n&gt; I&#39;ve found Sandra&#39;s page on late readers. If anyone has any other  <br/>\n&gt; great pages or can personally share, I would love to hear.<br/>\n<br/>\n<br/>\n </span></blockquote>Two things that will help:<br/>\n<br/>\nOne, stop listening to people talk about schooled kids&#39; learning. They  <br/>\n*only* know the behaviors of schooled kids. Zoo keepers who only know  <br/>\nanimals in cages have no clue about how animals behave in the wild. No  <br/>\nmatter how extensive their cage knowledge is, it is useless for  <br/>\ndiscussing the behavior of animals in their natural habitat. You&#39;re  <br/>\nhurting your kids &quot;right nows&quot; with your worry by giving credence to  <br/>\nknowledge of caged kids having anything to do with natural kids.<br/>\n<br/>\nTwo, we&#39;re not talking theory! John Holt coined the term unschooling  <br/>\nin the 70s. We&#39;ve been doing, observing, writing about, analyzing  <br/>\nunschooling  online -- and so pooling the knowledge and experience of  <br/>\nvaster amounts of people -- for over 15 years. In academic terms,  <br/>\nthat&#39;s several doctorates worth ;-)<br/>\n<br/>\nI assume you read something here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/reading\">http://sandradodd.com/reading</a><br/>\n<br/>\nIt&#39;s worth clicking on all the links. And all the links on each page  <br/>\ntoo. Also:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a> scroll down the left side<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://SandraDodd.com/bookworship\">http://SandraDodd.com/bookworship</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/bookchange\">http://sandradodd.com/bookchange</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/bookmotif\">http://sandradodd.com/bookmotif</a><br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; BTW-both my girls are 10 and can read a little but really struggle  <br/>\n&gt; and would never read a book for fun.<br/>\n<br/>\n </span></blockquote>Thoroughly, completely not unusual. My daughter didn&#39;t read a book for  <br/>\npleasure until ... 14ish? We listened to loads of audio books and she  <br/>\ndiscovered an adult series she really enjoyed and then started reading  <br/>\nthat on her own. She could read before that but it didn&#39;t flow for  <br/>\nher. Though, still, at 19 she hasn&#39;t read a lot of books. (Though she  <br/>\nhas read some weighty books. For a while she was into the early  <br/>\nhistory of baseball and read a couple of books with lots of data and  <br/>\nloads of footnotes.)<br/>\n<br/>\nBut here&#39;s something to think about, an idea that we&#39;ve turned over a  <br/>\nfew times. Lots of us loved reading as kids, always with a nose in a  <br/>\nbook. But that doesn&#39;t seem as prevalent among unschooled kids --  <br/>\nthough there certainly are some that do immerse themselves in books.  <br/>\nIt seems likely that what many of us loved to do was escape. Our  <br/>\nunschooled kids don&#39;t need to escape. The unschooled kids who love to  <br/>\nread, really do love to read and their number isn&#39;t inflated by kids  <br/>\nwho seek to escape their lives.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/bookandsax\">http://sandradodd.com/bookandsax</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":191799655,"authorName":"flyingtwinsmom","from":"&quot;flyingtwinsmom&quot; &lt;flyingtwinsmom@...&gt;","profile":"flyingtwinsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"late readers- reassurance needed","postDate":"1288403424","msgId":45184,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhZnRsMCtoNGgzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":45188,"prevInTime":45183,"nextInTime":45185,"topicId":45184,"numMessagesInTopic":0,"msgSnippet":"I need some reassurance that late readers will be ok. We started deschooling in Feb, and I m feeling like I will never get out of deschooling. I keep thinking","messageBody":"<div id=\"ygrps-yiv-1506233239\">I need some reassurance that late readers will be ok. We started deschooling in Feb, and I&#39;m feeling like I will never get out of deschooling. I keep thinking about what I need for &quot;proof&quot; of education-which is actually papers done by the girls. But I was talking to an older friend today. She mentioned doing some web-quests with the girls, and I told her that they weren&#39;t reading well and had no desire to read yet. She went on to tell me that I better get help because there is a &quot;window of opportunity that closes at 9&quot; if they aren&#39;t fluent at reading. She is getting this from experience with her own 6 kids and from the classes she is now taking to be a teacher. She reasoned that in order to do anything in life, you HAVE TO know how to read well. I know that a lot of that is bunk, but I&#39;m having so many other insecurities with unschooling and if I&#39;m hurting my children&#39;s futures now that I need some reassurance. I&#39;ve found Sandra&#39;s page on late readers. If anyone has any other great pages or can personally share, I would love to hear. BTW-both my girls are 10 and can read a little but really struggle and would never read a book for fun. <br/>\nThanks<br/>\nB</div>","specialLinks":[]}],"prevTopicId":45192,"nextTopicId":45190}}