{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":280005589,"authorName":"Solé","from":"=?ISO-8859-1?Q?Sol=E9?= &lt;solelokuai@...&gt;","profile":"solelokua","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"OT: singing/passions was: I should always get...","postDate":"1159827387","msgId":17747,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyQjUzOTE5LTNGNDMtNDRENi05ODgwLTQ0OTFFMTc3RUI1N0BnbWFpbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":17746,"nextInTime":17748,"topicId":17747,"numMessagesInTopic":0,"msgSnippet":"Hello, I don t know how to reply to so many replies, I don t want to trash the mailing list with my personal passions :-D But I still did want to reply and","messageBody":"<div id=\"ygrps-yiv-1742351059\">Hello,<br/>\n<br/>\nI don&#39;t know how to reply to so many replies, I don&#39;t want to trash  <br/>\nthe mailing list with my personal passions :-D But I still did want  <br/>\nto reply and clarify, but also wanted to thank you again for taking  <br/>\nyour time answering my silly questions.<br/>\n<br/>\nIt&#39;s way too long so I put headlines, so you can skip things that  <br/>\ndon&#39;t interest you ;-)<br/>\n<br/>\nSinging:<br/>\nFor me, singing is not just &quot;itself&quot; fun, most of the time it has to  <br/>\nbe in front of an audience (of at least one person) who enjoys what  <br/>\nI&#39;m singing, or else it&#39;s not even half the joy. Of course I can sing  <br/>\nin the kitchen and that may relax or feel good in a way, but mostly,  <br/>\nsinging without a hearer is not really satisfying. It&#39;s like an actor  <br/>\nwho acts all alone, or a mirror which nobody sees. It feels incomplete!<br/>\n<br/>\nSinging lessons:<br/>\nSinging lessons are extremely good! I have taken some and the voice  <br/>\nreally really improves quite quickly if you have a personal coach.  <br/>\nAnd also, you can ruin your voice if you are singing incorrectly. Now  <br/>\nprobably this doesn&#39;t apply to me anymore because I have experience,  <br/>\nbut it can really happen that if you sing whole heartedly in a wrong  <br/>\nmanner, you can ruin your vocal lips (takes a lot of time though).  <br/>\nAnd singing lessons are fun! And it&#39;s great to widen the spectrum of  <br/>\nnotes you can reach! And I would recommend it to anybody, even if  <br/>\nthey think they can&#39;t sing – you can take singing lessons even if you  <br/>\nare not &quot;talented&quot; and get better. I have seen incredible changes in  <br/>\npeople&#39;s voices while observing my teacher&#39;s students. Unfortunately  <br/>\nI cannot take classes at the moment. On my website (where I offer my  <br/>\nlanguage courses), I have offered free spanish lessons or discount  <br/>\nfor anyone who could teach me singing in return.<br/>\n<br/>\nGiving up:<br/>\nBy the time I said that I didn&#39;t have any other passions than the  <br/>\ncomputer, I had already given up that old passion of singing, because  <br/>\nfor years it didn&#39;t work out for me.<br/>\n<br/>\nWhining:<br/>\nI have been whining but not to the list (I thought). It was just  <br/>\nmeant as an example of how one cannot always achieve what we want.  <br/>\nIt&#39;s ok for me if you think this was a good example because I could  <br/>\nhave gotten what I wanted if I had only done the right things. I  <br/>\nunderstand the things you pointed out about how unschooled kids will  <br/>\nalways be looking outside the box, whereas I wasn&#39;t as much as you  <br/>\nare used to :-)<br/>\n<br/>\nDoing the right things:<br/>\nMany of the suggestions you said I didn&#39;t come up with back then.  <br/>\nThis may be &quot;wrong&quot; but if I don&#39;t think of it, i just don&#39;t think of  <br/>\nit. I tried everything which was possible for me at the time.<br/>\n<br/>\nSupport of parents:<br/>\nI don&#39;t think I blame my parents so much anymore. Of course I took  <br/>\n(and had to take) all responsibility of my own life (see cleaning  <br/>\nother people&#39;s houses, living on my own etc, taking singing lessons  <br/>\ninstead of studying music etc.) I know all would have been a lot  <br/>\neasier if they had supported me, but they just didn&#39;t, and just  <br/>\nwanted &quot;the best&quot; for me. They didn&#39;t mean it in a bad way.<br/>\n<br/>\nMy mother :-)<br/>\nActually, we had a big fight a few weeks ago where she did it again  <br/>\n(hurt me and say it&#39;s my fault to be hurt) ;-) And this time I chose  <br/>\nexactly what you proposed, not to be around her anymore, because she  <br/>\nobviously won&#39;t choose to change her behaviour towards me. I was very  <br/>\nproud on one hand, but on the other, it&#39;s not that easy you know...  <br/>\nShe&#39;s my mother! And I&#39;m the needy child always waiting for her to  <br/>\nfinally support me and accept me as I am, remember? I&#39;m what we are  <br/>\ntrying to avoid in our children :-) In theory, it looks easy &quot;just  <br/>\ndon&#39;t be around your mother anymore&quot;, but in practise these kind of  <br/>\nadvice is not that easy. I still did it though – I dunno what feels  <br/>\nbetter, being hurt from time to time, or being constantly a little  <br/>\nbit sad that our relationship doesn&#39;t work out and probably never  <br/>\nwill. Can you all be so radical?!<br/>\n<br/>\nMy children:<br/>\nOf course, I prefer the little risk of them being disappointed one  <br/>\nday (after all, I&#39;ll be there for them) over the high possibility  <br/>\nthat they might not even try things for fear or because they can&#39;t  <br/>\nthink outside the box (and many other negative things). I hope I can  <br/>\nlearn it myself so I can model it. Don&#39;t be so hard on me, I&#39;m taking  <br/>\nlittle steps :-)<br/>\n<br/>\nEqual opportunities:<br/>\nHere I don&#39;t agree at all. Some have way more opportunities, some  <br/>\nhave less, some even none. I think it&#39;s unfair to say so because  <br/>\nthere really are people who don&#39;t have the means or possibilities or  <br/>\nthe knowledge or the support to do better than they are – though I&#39;m  <br/>\nnot one of them. You are right when you say that *I* have quite good  <br/>\nopportunities and that for *me* it&#39;s an excuse to say that, but I  <br/>\ndon&#39;t believe we aaaaaall have equal opportunities around the world  <br/>\nand that it&#39;s up to each individual to make his dream come true. I&#39;m  <br/>\naware that there is a guarantee you won&#39;t getting it if you don&#39;t  <br/>\ntry, that&#39;s for sure, but this is not invertable. But this of course,  <br/>\nis highly off-topic, sorry :-)<br/>\n<br/>\nTime:<br/>\nWhen I said that I used all my free time on the computer this didn&#39;t  <br/>\nmean I have a lot of time. I have to work and be there for my  <br/>\ndaughter who at the time says &quot;Mama?&quot; or &quot;Mama!&quot; almost every 5  <br/>\nminutes (and before unschooling we would argue every five  <br/>\nminutes ;-)). The time I have is just time in between of work,  <br/>\nhousework, children. Mostly it&#39;s just 10 minutes, then 1 minute ,  <br/>\nthen maybe 7 minutes, then 5 minutes... these are perfect times to  <br/>\nhop on the computer and write something, because you can always  <br/>\nfinish later if you are interrupted, but horrible times for singing,  <br/>\ncomposing, recording. And at nights, when there would finally be some  <br/>\nlonger time, we are really too exhausted to do anything, we either  <br/>\nsleep or watch something to destress and that&#39;s it.<br/>\nThe time I had the most freedom to do this was when after 6 years of  <br/>\ncoercion I finally had succeeded to press my daughter into a sleep  <br/>\nschedule each day at 8 pm, and I wasn&#39;t pregnant with my second  <br/>\nyet ;-) That lasted like 9 months and then it was over :-D Nowadays  <br/>\nshe goes to bed when she wants and the same is to say about my son,  <br/>\nhe usually goes at 11pm, when I&#39;m almost ready to go to bed as well.  <br/>\nIt didn&#39;t occur to me trading babysitting yet, because he is so young  <br/>\nand I dunno! Maybe I&#39;ll do that.<br/>\n<br/>\nBeing famous:<br/>\nI never said I wanted that.<br/>\n<br/>\nFears:<br/>\nI&#39;m afraid of picking up that dream again. I fear that maybe you are  <br/>\njust right – I don&#39;t have &quot;enough&quot; passion about it. I dunno if that  <br/>\npassion has died, was never there, was destroyed by non supporting  <br/>\nparents, is there but is too much &quot;in the box&quot;. I don&#39;t know! I&#39;m  <br/>\ntired. It makes sense when you say it&#39;s &quot;not enough&quot; – on the other  <br/>\nhand I can&#39;t just say tomorrow I&#39;ll sing and not work anymore. Of  <br/>\ncourse I could &quot;choose&quot;, as you say, to just leave the house at 8 in  <br/>\nthe morning and sing all day on the streets and come home at 6 pm.  <br/>\nThen we all have nothing to eat, so it&#39;s not really a &quot;choice&quot;, is it?<br/>\n<br/>\nChoices:<br/>\nI&#39;m impressed you all manage to do what you want! It seems I&#39;m not  <br/>\nready for it yet, for I feel I &quot;have to&quot; do a lot of things, like  <br/>\nworking and so on. I&#39;ve never quite understood your sense of  <br/>\n&quot;choices&quot; anyway. Of course we cann always say &quot;well nobody &quot;forces&quot;  <br/>\nyou, you &quot;choose&quot; to work because you don&#39;t like the consequences of  <br/>\nnot having money&quot; – I dunno, this is pretty much a &quot;have to&quot; for me,  <br/>\nfor we cannot live without the money. I have already chosen to do a  <br/>\njob, self employed, teaching languages through singing (Learn Spanish  <br/>\nby Singing) – but it&#39;s still a have-to which takes time. And of  <br/>\ncourse I &quot;choose&quot; to prioritize my children – but it&#39;s also a &quot;have- <br/>\nto&quot;, of course I don&#39;t want the consequences of letting them alone...  <br/>\nhm I don&#39;t quite get it :-)<br/>\n<br/>\nSince I got to know about unschooling, I got rid of one &quot;have-to&quot;  <br/>\nthough: I quit my stupid, horrible, boring studies YAY! With this I  <br/>\nhave been struggling soooo long, I&#39;ve been studying for like 5 years  <br/>\nnow (we can stretch it as long as we want/can afford costs of living  <br/>\n(university is free in Germany)) and it&#39;s been so slowly because I  <br/>\ndidn&#39;t like it, but thought I &quot;had to&quot;. (Oh, this was the fight with  <br/>\nmy mom by the way ;-) She absolutely didn&#39;t like the idea and  <br/>\ninsulted me big time.) I was so convinced by unschooling that I  <br/>\nstarted looking at myself and realised I really didn&#39;t have to  <br/>\ncontinue studying. You can&#39;t imagine how relieved I was when I made  <br/>\nthis decission.<br/>\n<br/>\nMaybe one day I will be able to re-discover my singing passion again  <br/>\nand look outside the box.<br/>\n<br/>\nOk, now it&#39;s really really enough.<br/>\nGood night<br/>\nJohanna</div>","specialLinks":[]}],"prevTopicId":17728,"nextTopicId":17706}}