{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":136334171,"authorName":"Marcia Coakley","from":"&quot;Marcia Coakley&quot; &lt;m.coakley@...&gt;","profile":"coakley4m","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: food and control","postDate":"1086217839","msgId":248,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5GQkJLTUdPRE9EUE5LSUNJS0VLSUVMQ0REQUEubS5jb2FrbGV5QHZlcml6b24ubmV0Pg==","inReplyToHeader":"PDEwODYxOTYyMDIuMjA0My40NDc1Mi5tMjJAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":247,"nextInTime":249,"topicId":248,"numMessagesInTopic":0,"msgSnippet":"This is (another) Marcia from MA The comments about food and control have sounded very familiar to me...and I agree with everything suggested about ease of","messageBody":"<div id=\"ygrps-yiv-1935125606\">This is (another) Marcia from MA<br/>\n<br/>\nThe comments about food and control have sounded very familiar to me...and I<br/>\nagree with everything suggested about ease of access to a good assortment of<br/>\nhealthy but appealing food.  (See below)<br/>\nThis is long...I have thought a lot about all of this, recently.<br/>\n<br/>\nBut the most important journey I have had is...that it is all the SAME<br/>\nconversation about the control.   I am learning about letting go...in every<br/>\narea of my relationship with my son (11, just out of school this last<br/>\nNovember).  The journey about encouraging him to take responsibility for his<br/>\nown choices...about food and EVERYTHING else...is part and parcel with his<br/>\njourney of de-schooling.  I have had to let go of my fear (which makes me<br/>\n&quot;need&quot; to control things) about his future, and trust both/each of us, in<br/>\nthe present.  I often need to stop and redirect myself...but at least I am<br/>\ncatching myself more quickly, now!<br/>\n<br/>\nHe is slowly beginning to initiate more calmly and easily...letting go of<br/>\nhis anxiety and stuckness about being &quot;told what to do&quot; in school and<br/>\nelsewhere.  I sometimes give him my opinion/remind him of a notion we feel<br/>\nstrongly about in our family, if I think that he may have missed something<br/>\nabout the bigger picture...but I let him know that, ultimately, it is up to<br/>\nhim.  And there are ongoing conversations with his Dad and me (often at<br/>\nnight, in bed, sort of debriefing).  I am blessed to have a husband who is<br/>\nnot only on board...but working at home - although he is in school full time<br/>\nat the moment, on top of his office schedule...a little nuts around here -<br/>\nhe is as involved with hands-on unschool family learning as possible.<br/>\n<br/>\nWe occasionally revisit the idea that he is now in charge of what and<br/>\nwhen...and he is relishing being able to read and play as much as he likes.<br/>\nSome days I do suggest changes in the flow...to encourage there being a mix<br/>\nof physical activity and mental stimulus, varied visual opportunity and<br/>\nhands on stuff to &quot;stir the pot&quot; and not be stuck, inadvertently.   I invite<br/>\nhim to do things with me: make pottery/play with clay - my work, cook,<br/>\ngarden, ride bikes, walk, play games - chess, Scrabble, Equate,<br/>\nBoggle....sometimes he joins me and other times, not.  This helps him feel<br/>\nthe difference in his body and mind as we explore things together.  I am<br/>\nlearning about sharing and teaching without controlling...a challenge for<br/>\nme!  And I throw in a bit of Brain Gym activities to keep integrating the<br/>\nhemispheres.<br/>\n<br/>\nHe now knows how this way (unschooling) is different from school<br/>\nparticularly because...&quot;they&quot; used to make all the decisions (this could be<br/>\nsaid to be easier) but that the cost of this is having to do what &quot;they &quot;<br/>\nthink is a good idea when &quot;they&quot; tell you to....they have the responsibility<br/>\nfor all of the decisions.  Being unschoolers REQUIRES (and therefore can be<br/>\nseen as harder!) a new level of being responsible for one&#39;s own<br/>\ndecisions/choices.  These are the most important lessons!  This impacts<br/>\neverything in life...how well we do at having friends, learning skills,<br/>\nbeing successful at it ALL!  Yes, we as parents help facilitate...but the<br/>\ninitiation and follow through comes from the child!  And the only way this<br/>\ncan happen is if we grownups get out of the way and trust our children to<br/>\n&quot;do it&quot;.<br/>\n<br/>\nDe-schooling is very similar to de-junk fooding, and letting go of<br/>\ncontrolling electronics (for example).  There is a period of trusting the<br/>\nchild to make the RIGHT mistakes and learn about themselves and the world<br/>\nalong the way.  They also learn to TRUST us to: 1) do what we say we are<br/>\ngoing to do; 2) really let them make their own choices...REALLY!  This<br/>\nremoves the need to be sneaky and greedy about things that may have been<br/>\navailable under huge strictures previously.  It takes time to get used to<br/>\nthis shift!  This is not to say that we have no opinions or that we say<br/>\nnothing...we absolutely want our &quot;family culture&quot; to guide all of us...and<br/>\nif we &quot;walk our talk&quot;...lead by example, as another said earlier...then<br/>\nthere is value in the journey.  I believe we all know that the journey IS<br/>\nthe important part...not the destination!<br/>\n<br/>\nOur food issues are a bit less extreme because I have always had them eat<br/>\nsome of everything our whole family is having, even if things are not as<br/>\nspicy/flavored as before children!  And I offered them the alternative to<br/>\nhave whole grain cereal (we have a family policy that they must have at<br/>\nleast two kinds together!) if they still wanted more to eat after having had<br/>\nsome of the meals they found less desirable.  I have always baked most our<br/>\nbread (yay, bread machines!) and often make other baked goods...all with<br/>\nwhole wheat pastry flour, other whole grains (write to me about the BEST and<br/>\neasiest way to make yummy brown rice, and my favorite homemade pancake mix)<br/>\nand so on.<br/>\n<br/>\nBut mostly we have always talked about the wholesomeness of whole foods (and<br/>\nunwholesomeness of food additives - synthetic colors, flavorings and<br/>\npreservatives)...how things are made/grown/and have involved the children in<br/>\ngardening, butchering, baking and cooking.  They go through phases of<br/>\ninterest and enthusiasm.  We are very healthy as a family (my husband&#39;s<br/>\nbeing a chiropractor and giving us all regular care helps a great deal, I am<br/>\nsure!), but we have stressed our belief that we stay healthy because &quot;you<br/>\nare what you eat!&quot;   I share ideas such as lemonade being quite pretty with<br/>\njust a tiny dash of beet juice...(no, you cannot taste it!)...and eventually<br/>\ngetting them to enjoy beets along with me.  The pink lemonade sells better<br/>\nat their lemonade stands!  My kids have been seen reading candy wrappers and<br/>\nrefusing goodies at events because of the garish colors, etc!   I stress<br/>\nlots of fruit and protein sources.  I usually have a banana (or other quick)<br/>\nbread made, an extra in the freezer, and everyone loves this with cream<br/>\ncheese on it!  Frozen banana chunks in the freezer make great smoothies<br/>\n(with other fruit or a hit of chocolate syrup), too...leftover smoothies<br/>\nmake for easy, more interesting frozen pops, too.<br/>\n<br/>\nThere are also really good alternatives to most &quot;junk food&quot;<br/>\nnowadays...Newman&#39;s cookies, and Barbara&#39;s Puffs, Annie&#39;s Cheese Popcorn etc<br/>\netc.  Belonging to a whole foods coop is also a great place to meet like<br/>\nminded eaters AND homeschoolers!<br/>\n<br/>\nI have grown immensely since we made the shift to<br/>\nhomeschool/unschooling...and it has naturally expanded the current direction<br/>\nof our family...all in about seven months (with help from many friends).<br/>\nAmazing to me, and so &quot;right&quot; for us.<br/>\n<br/>\nMarcia<br/>\n(Dennis, Will 11, Amanda almost 9...will join her brother staying home from<br/>\nnow on!)<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.693 / Virus Database: 454 - Release Date: 05/31/2004</div>","specialLinks":[]}],"prevTopicId":199,"nextTopicId":227}}