{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Further discussion...please","postDate":"1272462605","msgId":43798,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyOEFERUFCNzI0QjQ4M0M4RTk1RDAzMzY1M0FDMzk5QGRlYm9yYWg0M2YxM2ZkPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":43797,"nextInTime":43799,"topicId":43798,"numMessagesInTopic":0,"msgSnippet":"Haven t found Pam s high energy kid post yet but found this lovely bit she wrote about sibling rivalry and helping super active kids get the physical play they","messageBody":"<div id=\"ygrps-yiv-1868795710\">Haven&#39;t found Pam&#39;s high energy kid post yet but found this lovely bit she wrote about sibling rivalry and helping super active kids get the physical play they need.<br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n***<br/>\n<br/>\nPosted at unschoolingbasics Sept. 28, 2008  Message #36256<br/>\nBy Pam Sorooshian  <br/>\n<br/>\nThose of us with older kids had young kids once.<br/>\n<br/>\nDon&#39;t rule out the possibility that we remember and we have<br/>\nperspective and can look back with the benefit of hindsight being<br/>\n20/20, of course &lt;G&gt;.<br/>\n<br/>\nYou&#39;re in the very very beginning stages of unschooling - life is a<br/>\nlittle wild and crazy with kids the ages of yours - so expect that and<br/>\ngo with it, don&#39;t resist it. Support their interests - that is your<br/>\nunschooling mantra. Their interests are being physical and wild, right?<br/>\n<br/>\nDo things together out of the house really often in places that<br/>\nencourage really active hard play. They need the burn-off time. Maybe<br/>\nstop now and make a list of ALL the places you can think of that are<br/>\nwithin, say, an hour of home. Every different park, beach, playground,<br/>\nice-skating and roller-skating rinks, bowling, play places at fast<br/>\nfood restaurants. Water play is the BEST - a pool is ideal, playing in<br/>\nsprinklers, with a hose, with lots of containers, a slip-n-slide, or<br/>\neven in the bathtub, is great. Put down a bunch of towels all over the<br/>\nfloor and let them splash and have fun. Let them do that alone, not<br/>\nalways with their brother, too, because water play is very centering<br/>\nand brings a deep sense of peace. With little boys that age, I&#39;d be<br/>\ngoing out every single day. Also, be sure you have plenty of play<br/>\nequipment at home - a trampoline in the back yard, a swing set and<br/>\nother climbing equipment?<br/>\n<br/>\nInitiate fun activity that use a lot of energy. I used to set up<br/>\n&quot;obstacle courses&quot; in the house when the weather was bad. After I&#39;d<br/>\nset one up, we&#39;d time them on it, over and over. Then they&#39;d get<br/>\nstarted making their own obstacle courses and would spend a long time<br/>\ndoing them. When I was out at thrift stores or Big Lots or 99 cent<br/>\nstores, I&#39;d find things that could be used as part of an obstacle<br/>\ncourse. Be really creative.<br/>\n<br/>\nIF they&#39;re interested, they might like a martial arts activity that is<br/>\ngeared toward young children. Martial arts programs can sometimes be<br/>\nreally really fun for little kids with a lot of focus on games. Shop<br/>\naround and choose carefully, though.<br/>\n<br/>\nSibling rivalry will be lessened the more you find many ways to<br/>\nsupport their interests and provide an abundance of what they need. It<br/>\nwon&#39;t disappear entirely, probably, because these are kids who are<br/>\njust learning to be social and they&#39;re living in very close proximity<br/>\nto others who are also just learning. Conflict is pretty much<br/>\ninevitable, to some degree. Expect it and don&#39;t get all emotional over<br/>\nit, yourself. Try distracting them toward something cool/positive/<br/>\ndesired as often as possible - in a way that meets the child&#39;s needs<br/>\nto the maximum extent you can manage. Sometimes &quot;give it to them in<br/>\nfantasy&quot; is an amazing tension-reducer in sibling rivalry situations.<br/>\nFor example, if the kids are fighting over which tv show to watch or<br/>\nover using the video game console or over who gets to sit where in the<br/>\ncar or .... give it to them in fantasy in a big way. Say, &quot;Gosh, you<br/>\nknow what I really wish? I wish someone would invent a tv that showed<br/>\neach person just what THAT person wanted to see - all at the same<br/>\ntime.&quot; IF you become skilled at staying cool, calm and collected in<br/>\nthe face of conflict, you can sense whether or not these kinds of<br/>\nthings will help or add fuel to the fire. Depends. Also, be sure to<br/>\ngive them plenty of time apart from each other. Maybe they need a lot<br/>\nmore of that than is convenient for you, but making the effort to find<br/>\nways to do it will pay off.<br/>\n<br/>\nNothing will just &quot;fix&quot; the sibling rivalry or the exhaustion that<br/>\ncomes of having 3 and 5 yo little boys around all the time. Change<br/>\nyour expectations and remember it is all a process. Try to experience<br/>\nthe feeling of life flowing like a river, rather than expecting it to<br/>\nbe static like a lake.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":43786,"nextTopicId":43790}}