{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: bedtime and TV","postDate":"1323446922","msgId":47744,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4MzUxNjNBNzVAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":47743,"nextInTopic":0,"prevInTime":47743,"nextInTime":47745,"topicId":47740,"numMessagesInTopic":0,"msgSnippet":"... Me too - I d love to sleep more but my paycheck doesn t allow for that (and my paycheck allows us to live the lifestyle we love). What is harder for DS is","messageBody":"<div id=\"ygrps-yiv-610565344\"><blockquote><span title=\"ireply\">&gt; Some people naturally sleep more in the &quot;dark&quot; time of the year - I do.<br/>\n<br/>\n </span></blockquote>Me too - I&#39;d love to sleep more but my paycheck doesn&#39;t allow for that (and my paycheck allows us to live the lifestyle we love). What is harder for DS is not the deeps of winter but the transitions in the fall and spring. Losing the sunlight before dinner tends to be the start of a few bumpy weeks that even out once he adjusts to the dark setting in earlier. The additional daylight is a happier transition, for the most part, but it tends to be accompanied by staying awake much longer than usual and dealing with tiredness as a result.  Oh, and both transitions tend to also need more food (and for a growing 13 yr old, that&#39;s a LOT of food LOL!)<br/>\n<br/>\nThen again, he&#39;s always had something akin to a 26 hour day since he was born so his sleep schedule kinda rotates a bit year round. He can adapt as needed (when there&#39;s something that he wants or needs to be at that might cross his at-that-time sleep pattern) and we try to work with him to sort out things - advance notice of events (whether it&#39;s the premiere of a favorite TV program, a movie opening, a holiday party, etc - so it isn&#39;t necessarily &quot;get up and out to appointment&quot;), favorite foods/snacks on hand, current &quot;portable&quot; stuff (sketchpad, book, etc) if we&#39;re going out, work ahead of time to figure out possible &quot;sleepy&quot; plans (is there a place he can curl up to nap? For instance, when we have a craft fair scheduled, if it&#39;s more than a 15 minute drive from home, we prefer him to be with us even though he&#39;s 13 - craft fairs are LONG days, leaving the house usually before 7 am and getting home somewhere after 4 pm. We bring a couple fav throw pillows and a relatively comfy folding camp chair that he can curl up in - he&#39;s amazingly flexible! - and he often naps for a few hours once we&#39;re settled in). It&#39;s a partnership. And we do many of the same things at home - before I head to bed, I check in with him and see if there&#39;s anything he needs me to prepare for his overnight. I&#39;ll also try to spend as much time with him as possible given overlapping schedules - sometimes that means leaving little notes and treats for him to find when he wakes up if he&#39;s asleep when I head up to bed (I&#39;m the only one with a somewhat fixed &#39;bedtime&#39; so I can get up for work).<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: bedtime and TV","postDate":"1323385869","msgId":47743,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpicmc2ZCs4cDlyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpib2s0cCtwNTdnQGVHcm91cHMuY29tPg=="},"prevInTopic":47742,"nextInTopic":47744,"prevInTime":47742,"nextInTime":47744,"topicId":47740,"numMessagesInTopic":0,"msgSnippet":"... **************** It might be for other reasons, too - the kids will be a year older, and things will have changed. But that being said, there are also","messageBody":"<div id=\"ygrps-yiv-811905024\">&quot;irelandkelly10&quot; &lt;irelandkelly10@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I think the fact that our new house is freezing cold is probably an extra incentive!!!  Next year when we&#39;ve sorted out the heating issues it might be a different story.<br/>\n </span></blockquote>****************<br/>\n<br/>\nIt might be for other reasons, too - the kids will be a year older, and things will have changed. But that being said, there are also natural seasonal variations that you get to see more when you aren&#39;t locked down to an artificial timetable like school. Some people naturally sleep more in the &quot;dark&quot; time of the year - I do. I generally start reminding myself of this around the beginning of December when I notice myself getting tired more easily - the month either side of the winter solstice are the hardest for me, when I need the most sleep but ironically there are often More demands on my time.  I notice light more than cold as an issue in that sense. I&#39;ve spent Februaries wrapped up watching a lot of movies and tv when the house wasn&#39;t as well insulated as it is now, but not necessarily sleeping more - just huddling more!<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":333930247,"authorName":"irelandkelly10","from":"&quot;irelandkelly10&quot; &lt;irelandkelly10@...&gt;","profile":"irelandkelly10","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: bedtime and TV","postDate":"1323291609","msgId":47742,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpib2s0cCtwNTdnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpibTZtZitoYTA4QGVHcm91cHMuY29tPg=="},"prevInTopic":47741,"nextInTopic":47743,"prevInTime":47741,"nextInTime":47743,"topicId":47740,"numMessagesInTopic":0,"msgSnippet":"... We do have headphones, so I ll offer this....good thinking. But something else to consider is there may not seem to be much to do besides go to bed. If","messageBody":"<div id=\"ygrps-yiv-364820857\"><blockquote><span title=\"ireply\">&gt; &quot;If you&#39;re concerned that someone might want the option of hanging out downstairs while also watching tv, you could look into getting headphones, perhaps, or a laptop so someone can watch a movie.&quot;<br/>\n<br/>\n </span></blockquote>We do have headphones, so I&#39;ll offer this....good thinking.<br/>\n<br/>\n&quot;But something else to consider is there may not seem to be much to do besides go to bed. If you&#39;re not available because you&#39;re working, and are using the only computer, then that could curtail some night time interests. Is the upstairs tv set up to play video games? Again, adding games or something like a laptop might shift the dynamics a bit. If the kids are happy, though, these are things to watch for but not stress over - its good to have options, but some kids actually do go to bed fairly early by nature. My 10yo does&quot;<br/>\n<br/>\nI think this is what is bothering me, whether they are going to bed because they&#39;re bored.....there is plenty of other stuff not screen based (I only have one real screen lover) and they do pootle about with stuff.  I&#39;ve tried getting out a few things that might interest them....and sometimes it does.<br/>\n<br/>\nMy 10yo goes to bed early too!  Mainly because she gets up early to tend to her horse so she is always done in by about 7:30!  My night owl is my 8yo, but he likes to take a warm drink upstairs and snuggle up with a pile of books and lego.  I&#39;ve offered him the travel dvd player but he has never yet taken me up on the offer.  Maybe I&#39;ll offer it again.<br/>\n<br/>\nI think the fact that our new house is freezing cold is probably an extra incentive!!!  Next year when we&#39;ve sorted out the heating issues it might be a different story.<br/>\n<br/>\nThanks for the feedback, and the ideas.<br/>\n<br/>\nKelly</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: bedtime and TV","postDate":"1323212303","msgId":47741,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpibTZtZitoYTA4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpibTVoZCtsbG1lQGVHcm91cHMuY29tPg=="},"prevInTopic":47740,"nextInTopic":47742,"prevInTime":47740,"nextInTime":47742,"topicId":47740,"numMessagesInTopic":0,"msgSnippet":"... From your description, its more a matter of scheduling/routine than anything else, right? In your case, its so you can work, but it could just as easily be","messageBody":"<div id=\"ygrps-yiv-1572150461\">&quot;irelandkelly10&quot; &lt;irelandkelly10@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Is this OK?<br/>\n<br/>\n </span></blockquote>From your description, its more a matter of scheduling/routine than anything else, right? In your case, its so you can work, but it could just as easily be so that a family member could get to sleep (working parent, or baby, for instance). That&#39;s not some kind of weird rule, its family logistics. In our house, the tv in the bedroom goes off when someone needs to sleep (big family bedroom). <br/>\n<br/>\nIf you&#39;re concerned that someone might want the option of hanging out downstairs while also watching tv, you could look into getting headphones, perhaps, or a laptop so someone can watch a movie.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Within days of being told there was no set bedtime they all found their patterns and no one is staying up to scary o&#39; clock.<br/>\n </span></blockquote>***************<br/>\n<br/>\nSometimes you get lucky! <br/>\nBut something else to consider is there may not seem to be much to do besides go to bed. If you&#39;re not available because you&#39;re working, and are using the only computer, then that could curtail some night time interests. Is the upstairs tv set up to play video games? Again, adding games or something like a laptop might shift the dynamics a bit. If the kids are happy, though, these are things to watch for but not stress over - its good to have options, but some kids actually do go to bed fairly early by nature. My 10yo does. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":333930247,"authorName":"irelandkelly10","from":"&quot;irelandkelly10&quot; &lt;irelandkelly10@...&gt;","profile":"irelandkelly10","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"bedtime and TV","postDate":"1323211117","msgId":47740,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpibTVoZCtsbG1lQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":47741,"prevInTime":47739,"nextInTime":47741,"topicId":47740,"numMessagesInTopic":0,"msgSnippet":"We re new to radical unschooling.  I think I ve taken the longest path you possibly could....school, then school at home, then autonomous-with-rules and then","messageBody":"<div id=\"ygrps-yiv-2010967814\">We&#39;re new to radical unschooling.  I think I&#39;ve taken the longest path you possibly could....school, then school at home, then autonomous-with-rules and then here, the radical stuff.<br/>\n<br/>\nI normally switch the TV off at 8pm.  The kids know they can go and watch the upstairs TV if they want to, but no one seems to want to.  The big three tend to take themselves off to bed when they&#39;re tired, which is normally between 7:30 and 9:30.<br/>\n<br/>\nI don&#39;t turn the TV back on for myself, except at weekends occasionally.<br/>\n<br/>\nIs this OK?  I&#39;m amazed that the kids have self regulated their bedtimes so quickly.  Within days of being told there was no set bedtime they all found their patterns and no one is staying up to scary o&#39; clock.<br/>\n<br/>\nI often wonder if I left the TV on whether they would do this still.  No one has moaned about the TV because there is the other option, but I&#39;ve said to the kids that I have no problem with the TV being on all day if they want it, as long as I get a bit of time without it.  Our house is open plan so I can&#39;t get away from it and our internet connection doesn&#39;t work upstairs so if I&#39;m working I need to be down here in the thick of it!  I normally work between 8-10 in the evening.<br/>\n<br/>\nWhat are other people thoughts about this?<br/>\n<br/>\nKelly</div>","specialLinks":[]}],"prevTopicId":47706,"nextTopicId":47745}}