{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":475251512,"authorName":"Deb","from":"&quot;Deb&quot; &lt;vwb777@...&gt;","profile":"vwb777","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Working with intense 3.5 year old (and intense sibling/family)","postDate":"1324583512","msgId":47791,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpkMDFvbysyMzRtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpjbGVzaytxNjdoQGVHcm91cHMuY29tPg=="},"prevInTopic":47771,"nextInTopic":0,"prevInTime":47790,"nextInTime":47792,"topicId":47762,"numMessagesInTopic":0,"msgSnippet":"I ve read a lot online about food allergies in children causing this kind of behavior. Wheat, gluten, and some dyes are some of the culprits. Maybe you could","messageBody":"<div id=\"ygrps-yiv-291000717\">I&#39;ve read a lot online about food allergies in children causing this kind of behavior. Wheat, gluten, and some dyes are some of the culprits. Maybe you could go online and find a suggestion about a trial food allergy diet. I also have a homeschooling friend who did this for her son and she found a couple of the things that really caused some ugly behavior and once she pulled them from his diet, he was like another kid altogether. Just a thought that might be helpful. I hope you find something that works for you. My daughter who is now 18 was the exact same way at that age. I ignorantly let the doctor put her on add meds. This was before I knew so much about them and the damage they can do. Anyway, my thoughts are with you.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;meadowgirl11&quot; &lt;tamithameadow@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi all<br/>\n&gt; <br/>\n&gt; So I first came to this list 3 years ago for help with my son (now 11) around intensity and explosions among other things. Now it seems I am having a lot of the same challenges with my 3.5 year old daughter and really being challenged to find ways to work with her while still considering the needs of everyone else in the family. <br/>\n&gt; <br/>\n&gt; I am not even sure how to frame this struggle though. Basically I am finding myself in several situations a day where her wants and needs conflict with someone else in the family, either my own or her brothers usually. In this case I try to be really calm and reasonable, but she is 3 and often just starts screaming, or worse (hitting, kicking, etc) if she is being asked to do something or stop doing something that doesn&#39;t feel right to her. This very often happens around transitions where there is an activity for her brother or something we have pre-planned and she doesn&#39;t feel ready. It has happened more frequently than I&#39;d like that I have had to pick her up and take her without her consent, even putting her into the car seat against her will, which feels horrible, but if I don&#39;t I will be late to pick up her brother from an activity. I have tried offering her preferred activities, treats for the car (oh just had an idea to have something she likes like skittles in the car that is JUST for the car in those times, wonder if that would help). I almost always manage to do this while using a lot of empathy and validation about how it doesn&#39;t feel good to be forced, offering to let her do it herself if she will, etc, but lately I have been losing my cool more often. I feel like a big bully, but I also feel frustrated about not just being able to do what needs to be done if I don&#39;t do this kind of thing. It makes me not want to go anywhere with her which isn&#39;t fair to her or her brother since they both have high social needs and want to go and do often. <br/>\n&gt; <br/>\n&gt; It&#39;s not just the car either, it&#39;s in stores if she wants something we can&#39;t afford (we are renting a house that is much more than we can afford and slowly sinking into deeper debt). It&#39;s in her brothers room when I am trying to spend some time with him and she of course needs to be with my but drives him crazy (he doesn&#39;t have much patience with her to begin with and much less when she is trying to take my attention away from him when he barely gets it as it is). I am really struggling to balance her needs with her brother&#39;s, mine and my partner&#39;s, who is pretty supportive of unschooling in general but getting pretty tired of so much intensity and not having time or energy for us at all. For my son it is particularly hard because I was a single mom with him for many years and now he has to share me with two new people, his step dad and sister. I think Meredith recently posted on another list about a child around the same age feeling replaced and I know Terran has struggled with that feeling too. My intention with unschooling was to make sure he had lots of connection with me, and I have done my best, but because they don&#39;t get along at all, it is really hard. He is really into his gaming and anime and I just can&#39;t sit in his room with him all the time while he plays when his sister isn&#39;t into that at all and she&#39;s 3. I would like to move his computer somewhere more central in the house but he isn&#39;t interested, likes it in his room, so he is left alone there a lot of the time because of this.<br/>\n&gt; <br/>\n&gt; I am not sure exactly what I am asking here, more just recognizing that I have really felt off track with the kids lately, to the point of talking to Terran about going back to school so that there is less time I feel caught in balancing both their needs. He is SO not willing to do that (responds with terrified tears in fact) and I don&#39;t think it is a real solution, more like a band-aid that would lead to its own problems. What I need to is to get back on track with finding ways to work with both their needs, big BIG feelings and still feel like we have a semi-functional family life. <br/>\n&gt; <br/>\n&gt; Hoping for some good insights into this situation. <br/>\n&gt; <br/>\n&gt; Thanks<br/>\n&gt; Tammy<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":78282269,"authorName":"Debra Rossing","from":"Debra Rossing &lt;debra.rossing@...&gt;","profile":"scoopmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Working with intense 3.5 year old (and intense sibling/family)","postDate":"1324399950","msgId":47771,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MDREOUJDRjA0MEI0NDA5MjMxQzkyOTg0N0RERUU4MzUxQjNGMzJAVU5JQkxBQi5DTkNTT0ZUV0FSRS5jb20+"},"prevInTopic":47766,"nextInTopic":47791,"prevInTime":47770,"nextInTime":47772,"topicId":47762,"numMessagesInTopic":0,"msgSnippet":"... I just wanted to pull this out as a reminder that replies to any post are not necessarily *personal* - they are written (at least by most of the regular","messageBody":"<div id=\"ygrps-yiv-1597829789\"><blockquote><span title=\"ireply\">&gt; Hopefully you&#39;ll get lots of responses and ideas and I&#39;ll be able to use them too ;)<br/>\n<br/>\n </span></blockquote>I just wanted to pull this out as a reminder that replies to any post are not necessarily *personal* - they are written (at least by most of the regular posters) with exactly this in mind. Person A might have brought a thought, idea, post to the group but the reply is being read by Persons B through Z as well. Ideas will be discussed, analyzed, &quot;picked apart&quot; to seek where it can bring people reading a step (or two) along the path of radical unschooling (which, BTW, is not an &quot;end goal&quot; but truly a path that winds and twists and turns on beyond the horizon)<br/>\n<br/>\nDeb R<br/>\n<br/>\n<br/>\n<br/>\n**********************************************************************<br/>\nThis email and any files transmitted with it are confidential and<br/>\nintended solely for the use of the individual or entity to whom they<br/>\nare addressed. If you have received this email in error please notify<br/>\nthe system manager.<br/>\n<br/>\nThis footnote also confirms that this email message has been swept by<br/>\nMIMEsweeper for the presence of computer viruses.<br/>\n<br/>\nwww.mastercam.com<br/>\n**********************************************************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Working with intense 3.5 year old (and intense sibling/family)","postDate":"1324334643","msgId":47766,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjb2VuaitwY3F1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpjbGVzaytxNjdoQGVHcm91cHMuY29tPg=="},"prevInTopic":47765,"nextInTopic":47771,"prevInTime":47765,"nextInTime":47767,"topicId":47762,"numMessagesInTopic":0,"msgSnippet":"Especially with a younger child, the most important thing to keep in mind is you re not looking for One solution, but an assortment of strategies and tools.","messageBody":"<div id=\"ygrps-yiv-523935760\">Especially with a younger child, the most important thing to keep in mind is you&#39;re not looking for One solution, but an assortment of strategies and tools. The other most important thing to keep in mind, especially with a more intense child, is not to set yourself up for failure by expecting perfection. There Will be meltdowns. And while it&#39;s good to commiserate and apologize, that doesn&#39;t make the upset go away, or make it shorter. When my kids were little, it helped me to have a goal of &quot;don&#39;t make things worse!&quot;<br/>\n<br/>\n&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; This very often happens around transitions where there is an activity for her brother or something we have pre-planned and she doesn&#39;t feel ready.<br/>\n </span></blockquote>*********************<br/>\n<br/>\nIt&#39;s really worth cutting down on transitions as much as you can by cutting down on outings for awhile and/or combining outings - one longer trip rather than two short ones. Even with a really social kid, that can end up being a better option for awhile. If going to the store is stressful because of finances, don&#39;t bring your daughter at all. When we were at our poorest (knock wood!) I&#39;d only take Mo places she could get something free or almost free - like the bank, or garage sales with big Free boxes right by the road. <br/>\n<br/>\nBut if your son is going out doing things which don&#39;t need the younger child, look into ride sharing and carpooling so you&#39;re not the one who&#39;s running him around. Alternately, when you go to drop him off, don&#39;t go home, do something with your daughter until its time to pick him up. <br/>\n<br/>\nIf big social needs are an issue, can other people come to Your home? That&#39;s a way to skip the transition issue (mostly).<br/>\n<br/>\nSomething else that helped me when my kids were younger was to plan to arrive anywhere waaaaaaaay early. I&#39;d bring things to do in case we actually made it early, but most of the time what I Really needed was to plan in more time to transition. It could take an hour to get in the car! But if you plan for that, know it&#39;s going to be a loooooong slow process, then its less stressful and you can focus more on the details. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;For my son it is particularly hard because I was a single mom with him for many years and now he has to share me with two new people, his step dad and sister.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nCan you arrange some &quot;special time&quot; where your daughter does something one-on-one with her dad and your son one with you? That could help. <br/>\n<br/>\nAnother thought, crazy as it might sound, is to text with your son (I mean, like from the kitchen to the bedroom!), if you have the ability to do that. It&#39;s a way to make little connections even when you&#39;re busy doing something else. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I have really felt off track with the kids lately, to the point of talking to Terran about going back to school so that there is less time I feel caught in balancing both their needs. He is SO not willing to do that (responds with terrified tears in fact)<br/>\n </span></blockquote>****************<br/>\n<br/>\nWhat about the reverse of that option - is your daughter interested in going to, for instance, a day-care for a few hours each week? That might help meet her social needs, too. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":283914803,"authorName":"Jo","from":"Jo &lt;jokirby2004@...&gt;","profile":"jokirby2004","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Working with intense 3.5 year old (and intense sibling/family)","postDate":"1324325251","msgId":47765,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENEREEyNkU0LUQzOUItNDc4RC1BQjIzLTgwMjkwN0E0QkY5REB5YWhvby5jby51az4=","inReplyToHeader":"PGpjbGVzaytxNjdoQGVHcm91cHMuY29tPg==","referencesHeader":"PGpjbGVzaytxNjdoQGVHcm91cHMuY29tPg=="},"prevInTopic":47764,"nextInTopic":47766,"prevInTime":47764,"nextInTime":47766,"topicId":47762,"numMessagesInTopic":0,"msgSnippet":"Hi Tammy, is it possible for you to get a bit of help from somewhere (relatives, friends, neighbours, husband on the weekend?), so that someone else could mind","messageBody":"<div id=\"ygrps-yiv-401236012\">Hi Tammy, is it possible for you to get a bit of help from somewhere (relatives, friends, neighbours, husband on the weekend?), so that someone else could mind your daughter for a bit so that you and your son could get some quality time together, where you can just do whatever he wants to do, but be properly present? <br/>\n<br/>\nAlso, could you hang out with him after your daughter goes to bed? <br/>\n<br/>\nIt sounds like your son could really do with some of your time. And spending some with him might be calming and centering for you. <br/>\n<br/>\nUnless you are still considering it (and assuming he still does not want to go), I would apologise to him about the school suggestion and reassure him it was just a crazy spur of the moment thought because you were stressed.<br/>\n<br/>\nTry to get close to your son again. You might find you feel so good about that that struggles with your daughter feel a little easier. Also, they WILL pass, she is only three and a half...<br/>\n<br/>\nAnd it will mean SO much to him...<br/>\n<br/>\nAll the best,<br/>\nJo<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 18 Dec 2011, at 19:28, &quot;meadowgirl11&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tamithameadow@...\">tamithameadow@...</a>&gt; wrote:<br/>\n<br/>\n&gt; Hi all<br/>\n&gt; <br/>\n&gt; So I first came to this list 3 years ago for help with my son (now 11) around intensity and explosions among other things. Now it seems I am having a lot of the same challenges with my 3.5 year old daughter and really being challenged to find ways to work with her while still considering the needs of everyone else in the family. <br/>\n&gt; <br/>\n&gt; I am not even sure how to frame this struggle though. Basically I am finding myself in several situations a day where her wants and needs conflict with someone else in the family, either my own or her brothers usually. In this case I try to be really calm and reasonable, but she is 3 and often just starts screaming, or worse (hitting, kicking, etc) if she is being asked to do something or stop doing something that doesn&#39;t feel right to her. This very often happens around transitions where there is an activity for her brother or something we have pre-planned and she doesn&#39;t feel ready. It has happened more frequently than I&#39;d like that I have had to pick her up and take her without her consent, even putting her into the car seat against her will, which feels horrible, but if I don&#39;t I will be late to pick up her brother from an activity. I have tried offering her preferred activities, treats for the car (oh just had an idea to have something she likes like skittles in the car that is JUST for the car in those times, wonder if that would help). I almost always manage to do this while using a lot of empathy and validation about how it doesn&#39;t feel good to be forced, offering to let her do it herself if she will, etc, but lately I have been losing my cool more often. I feel like a big bully, but I also feel frustrated about not just being able to do what needs to be done if I don&#39;t do this kind of thing. It makes me not want to go anywhere with her which isn&#39;t fair to her or her brother since they both have high social needs and want to go and do often. <br/>\n&gt; <br/>\n&gt; It&#39;s not just the car either, it&#39;s in stores if she wants something we can&#39;t afford (we are renting a house that is much more than we can afford and slowly sinking into deeper debt). It&#39;s in her brothers room when I am trying to spend some time with him and she of course needs to be with my but drives him crazy (he doesn&#39;t have much patience with her to begin with and much less when she is trying to take my attention away from him when he barely gets it as it is). I am really struggling to balance her needs with her brother&#39;s, mine and my partner&#39;s, who is pretty supportive of unschooling in general but getting pretty tired of so much intensity and not having time or energy for us at all. For my son it is particularly hard because I was a single mom with him for many years and now he has to share me with two new people, his step dad and sister. I think Meredith recently posted on another list about a child around the same age feeling replaced and I know Terran has struggled with that feeling too. My intention with unschooling was to make sure he had lots of connection with me, and I have done my best, but because they don&#39;t get along at all, it is really hard. He is really into his gaming and anime and I just can&#39;t sit in his room with him all the time while he plays when his sister isn&#39;t into that at all and she&#39;s 3. I would like to move his computer somewhere more central in the house but he isn&#39;t interested, likes it in his room, so he is left alone there a lot of the time because of this.<br/>\n&gt; <br/>\n&gt; I am not sure exactly what I am asking here, more just recognizing that I have really felt off track with the kids lately, to the point of talking to Terran about going back to school so that there is less time I feel caught in balancing both their needs. He is SO not willing to do that (responds with terrified tears in fact) and I don&#39;t think it is a real solution, more like a band-aid that would lead to its own problems. What I need to is to get back on track with finding ways to work with both their needs, big BIG feelings and still feel like we have a semi-functional family life. <br/>\n&gt; <br/>\n&gt; Hoping for some good insights into this situation. <br/>\n&gt; <br/>\n&gt; Thanks<br/>\n&gt; Tammy<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":414490706,"authorName":"sarahrandom78","from":"&quot;sarahrandom78&quot; &lt;bdb1978@...&gt;","profile":"sarahrandom78","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Working with intense 3.5 year old (and intense sibling/family)","postDate":"1324322923","msgId":47764,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjbzM5YitqM3FsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpjbGVzaytxNjdoQGVHcm91cHMuY29tPg=="},"prevInTopic":47763,"nextInTopic":47765,"prevInTime":47763,"nextInTime":47765,"topicId":47762,"numMessagesInTopic":0,"msgSnippet":"I totally feel your pain! I m in the exact same boat with my 12 and 4 year olds. As for having Skittles in the car, it works for us (we use smarties but the","messageBody":"<div id=\"ygrps-yiv-2084623877\">I totally feel your pain! I&#39;m in the exact same boat with my 12 and 4 year olds. As for having Skittles in the car, it works for us (we use smarties but the same idea) My son, age 6, and daughter age 12 really dislike having to go anywhere. I have a DVD player in the car and they also have their leapsters and DS, so that helps too. Some days it feels like a total struggle to just get through the day though. Hopefully you&#39;ll get lots of responses and ideas and I&#39;ll be able to use them too ;)<br/>\n<br/>\nSarah<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;meadowgirl11&quot; &lt;tamithameadow@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi all<br/>\n&gt; <br/>\n&gt; So I first came to this list 3 years ago for help with my son (now 11) around intensity and explosions among other things. Now it seems I am having a lot of the same challenges with my 3.5 year old daughter and really being challenged to find ways to work with her while still considering the needs of everyone else in the family. <br/>\n&gt; <br/>\n&gt; I am not even sure how to frame this struggle though. Basically I am finding myself in several situations a day where her wants and needs conflict with someone else in the family, either my own or her brothers usually. In this case I try to be really calm and reasonable, but she is 3 and often just starts screaming, or worse (hitting, kicking, etc) if she is being asked to do something or stop doing something that doesn&#39;t feel right to her. This very often happens around transitions where there is an activity for her brother or something we have pre-planned and she doesn&#39;t feel ready. It has happened more frequently than I&#39;d like that I have had to pick her up and take her without her consent, even putting her into the car seat against her will, which feels horrible, but if I don&#39;t I will be late to pick up her brother from an activity. I have tried offering her preferred activities, treats for the car (oh just had an idea to have something she likes like skittles in the car that is JUST for the car in those times, wonder if that would help). I almost always manage to do this while using a lot of empathy and validation about how it doesn&#39;t feel good to be forced, offering to let her do it herself if she will, etc, but lately I have been losing my cool more often. I feel like a big bully, but I also feel frustrated about not just being able to do what needs to be done if I don&#39;t do this kind of thing. It makes me not want to go anywhere with her which isn&#39;t fair to her or her brother since they both have high social needs and want to go and do often. <br/>\n&gt; <br/>\n&gt; It&#39;s not just the car either, it&#39;s in stores if she wants something we can&#39;t afford (we are renting a house that is much more than we can afford and slowly sinking into deeper debt). It&#39;s in her brothers room when I am trying to spend some time with him and she of course needs to be with my but drives him crazy (he doesn&#39;t have much patience with her to begin with and much less when she is trying to take my attention away from him when he barely gets it as it is). I am really struggling to balance her needs with her brother&#39;s, mine and my partner&#39;s, who is pretty supportive of unschooling in general but getting pretty tired of so much intensity and not having time or energy for us at all. For my son it is particularly hard because I was a single mom with him for many years and now he has to share me with two new people, his step dad and sister. I think Meredith recently posted on another list about a child around the same age feeling replaced and I know Terran has struggled with that feeling too. My intention with unschooling was to make sure he had lots of connection with me, and I have done my best, but because they don&#39;t get along at all, it is really hard. He is really into his gaming and anime and I just can&#39;t sit in his room with him all the time while he plays when his sister isn&#39;t into that at all and she&#39;s 3. I would like to move his computer somewhere more central in the house but he isn&#39;t interested, likes it in his room, so he is left alone there a lot of the time because of this.<br/>\n&gt; <br/>\n&gt; I am not sure exactly what I am asking here, more just recognizing that I have really felt off track with the kids lately, to the point of talking to Terran about going back to school so that there is less time I feel caught in balancing both their needs. He is SO not willing to do that (responds with terrified tears in fact) and I don&#39;t think it is a real solution, more like a band-aid that would lead to its own problems. What I need to is to get back on track with finding ways to work with both their needs, big BIG feelings and still feel like we have a semi-functional family life. <br/>\n&gt; <br/>\n&gt; Hoping for some good insights into this situation. <br/>\n&gt; <br/>\n&gt; Thanks<br/>\n&gt; Tammy<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":362298307,"authorName":"Nancy Valimaki","from":"&quot;Nancy Valimaki&quot; &lt;nmvalimaki@...&gt;","profile":"nmvalimaki","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Working with intense 3.5 year old (and intense sibling/family)","postDate":"1324310775","msgId":47763,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjbm5kbittYTJjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpjbGVzaytxNjdoQGVHcm91cHMuY29tPg=="},"prevInTopic":47762,"nextInTopic":47764,"prevInTime":47762,"nextInTime":47764,"topicId":47762,"numMessagesInTopic":0,"msgSnippet":"Good Morning, Tammy. You may have highly sensitive children.  If you  agree, I would recommend you check out a site for HSPs - Highly Sensitive People at","messageBody":"<div id=\"ygrps-yiv-1506735739\">Good Morning, Tammy.<br/>\n<br/>\nYou may have highly sensitive children.  If you  agree, I would recommend you check out a site for HSPs - Highly Sensitive People at www.hsperson.com   <br/>\n<br/>\nIf you think your children are highly sensitive know that you are NOT alone!  I have 2 highly sensitive kids, my husband is highly sensitive and so am I.  I really makes life challenging at times!   But understanding this about my family and self helps me tremendously. <br/>\n<br/>\nI hope this is helpful.<br/>\nNancy<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;meadowgirl11&quot; &lt;tamithameadow@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi all<br/>\n&gt; <br/>\n&gt; So I first came to this list 3 years ago for help with my son (now 11) around intensity and explosions among other things. Now it seems I am having a lot of the same challenges with my 3.5 year old daughter and really being challenged to find ways to work with her while still considering the needs of everyone else in the family. <br/>\n&gt; <br/>\n&gt; I am not even sure how to frame this struggle though. Basically I am finding myself in several situations a day where her wants and needs conflict with someone else in the family, either my own or her brothers usually. In this case I try to be really calm and reasonable, but she is 3 and often just starts screaming, or worse (hitting, kicking, etc) if she is being asked to do something or stop doing something that doesn&#39;t feel right to her. This very often happens around transitions where there is an activity for her brother or something we have pre-planned and she doesn&#39;t feel ready. It has happened more frequently than I&#39;d like that I have had to pick her up and take her without her consent, even putting her into the car seat against her will, which feels horrible, but if I don&#39;t I will be late to pick up her brother from an activity. I have tried offering her preferred activities, treats for the car (oh just had an idea to have something she likes like skittles in the car that is JUST for the car in those times, wonder if that would help). I almost always manage to do this while using a lot of empathy and validation about how it doesn&#39;t feel good to be forced, offering to let her do it herself if she will, etc, but lately I have been losing my cool more often. I feel like a big bully, but I also feel frustrated about not just being able to do what needs to be done if I don&#39;t do this kind of thing. It makes me not want to go anywhere with her which isn&#39;t fair to her or her brother since they both have high social needs and want to go and do often. <br/>\n&gt; <br/>\n&gt; It&#39;s not just the car either, it&#39;s in stores if she wants something we can&#39;t afford (we are renting a house that is much more than we can afford and slowly sinking into deeper debt). It&#39;s in her brothers room when I am trying to spend some time with him and she of course needs to be with my but drives him crazy (he doesn&#39;t have much patience with her to begin with and much less when she is trying to take my attention away from him when he barely gets it as it is). I am really struggling to balance her needs with her brother&#39;s, mine and my partner&#39;s, who is pretty supportive of unschooling in general but getting pretty tired of so much intensity and not having time or energy for us at all. For my son it is particularly hard because I was a single mom with him for many years and now he has to share me with two new people, his step dad and sister. I think Meredith recently posted on another list about a child around the same age feeling replaced and I know Terran has struggled with that feeling too. My intention with unschooling was to make sure he had lots of connection with me, and I have done my best, but because they don&#39;t get along at all, it is really hard. He is really into his gaming and anime and I just can&#39;t sit in his room with him all the time while he plays when his sister isn&#39;t into that at all and she&#39;s 3. I would like to move his computer somewhere more central in the house but he isn&#39;t interested, likes it in his room, so he is left alone there a lot of the time because of this.<br/>\n&gt; <br/>\n&gt; I am not sure exactly what I am asking here, more just recognizing that I have really felt off track with the kids lately, to the point of talking to Terran about going back to school so that there is less time I feel caught in balancing both their needs. He is SO not willing to do that (responds with terrified tears in fact) and I don&#39;t think it is a real solution, more like a band-aid that would lead to its own problems. What I need to is to get back on track with finding ways to work with both their needs, big BIG feelings and still feel like we have a semi-functional family life. <br/>\n&gt; <br/>\n&gt; Hoping for some good insights into this situation. <br/>\n&gt; <br/>\n&gt; Thanks<br/>\n&gt; Tammy<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":370007365,"authorName":"meadowgirl11","from":"&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt;","profile":"meadowgirl11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Working with intense 3.5 year old (and intense sibling/family)","postDate":"1324236500","msgId":47762,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjbGVzaytxNjdoQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":47763,"prevInTime":47761,"nextInTime":47763,"topicId":47762,"numMessagesInTopic":0,"msgSnippet":"Hi all So I first came to this list 3 years ago for help with my son (now 11) around intensity and explosions among other things. Now it seems I am having a","messageBody":"<div id=\"ygrps-yiv-1264952692\">Hi all<br/>\n<br/>\nSo I first came to this list 3 years ago for help with my son (now 11) around intensity and explosions among other things. Now it seems I am having a lot of the same challenges with my 3.5 year old daughter and really being challenged to find ways to work with her while still considering the needs of everyone else in the family. <br/>\n<br/>\nI am not even sure how to frame this struggle though. Basically I am finding myself in several situations a day where her wants and needs conflict with someone else in the family, either my own or her brothers usually. In this case I try to be really calm and reasonable, but she is 3 and often just starts screaming, or worse (hitting, kicking, etc) if she is being asked to do something or stop doing something that doesn&#39;t feel right to her. This very often happens around transitions where there is an activity for her brother or something we have pre-planned and she doesn&#39;t feel ready. It has happened more frequently than I&#39;d like that I have had to pick her up and take her without her consent, even putting her into the car seat against her will, which feels horrible, but if I don&#39;t I will be late to pick up her brother from an activity. I have tried offering her preferred activities, treats for the car (oh just had an idea to have something she likes like skittles in the car that is JUST for the car in those times, wonder if that would help). I almost always manage to do this while using a lot of empathy and validation about how it doesn&#39;t feel good to be forced, offering to let her do it herself if she will, etc, but lately I have been losing my cool more often. I feel like a big bully, but I also feel frustrated about not just being able to do what needs to be done if I don&#39;t do this kind of thing. It makes me not want to go anywhere with her which isn&#39;t fair to her or her brother since they both have high social needs and want to go and do often. <br/>\n<br/>\nIt&#39;s not just the car either, it&#39;s in stores if she wants something we can&#39;t afford (we are renting a house that is much more than we can afford and slowly sinking into deeper debt). It&#39;s in her brothers room when I am trying to spend some time with him and she of course needs to be with my but drives him crazy (he doesn&#39;t have much patience with her to begin with and much less when she is trying to take my attention away from him when he barely gets it as it is). I am really struggling to balance her needs with her brother&#39;s, mine and my partner&#39;s, who is pretty supportive of unschooling in general but getting pretty tired of so much intensity and not having time or energy for us at all. For my son it is particularly hard because I was a single mom with him for many years and now he has to share me with two new people, his step dad and sister. I think Meredith recently posted on another list about a child around the same age feeling replaced and I know Terran has struggled with that feeling too. My intention with unschooling was to make sure he had lots of connection with me, and I have done my best, but because they don&#39;t get along at all, it is really hard. He is really into his gaming and anime and I just can&#39;t sit in his room with him all the time while he plays when his sister isn&#39;t into that at all and she&#39;s 3. I would like to move his computer somewhere more central in the house but he isn&#39;t interested, likes it in his room, so he is left alone there a lot of the time because of this.<br/>\n<br/>\nI am not sure exactly what I am asking here, more just recognizing that I have really felt off track with the kids lately, to the point of talking to Terran about going back to school so that there is less time I feel caught in balancing both their needs. He is SO not willing to do that (responds with terrified tears in fact) and I don&#39;t think it is a real solution, more like a band-aid that would lead to its own problems. What I need to is to get back on track with finding ways to work with both their needs, big BIG feelings and still feel like we have a semi-functional family life. <br/>\n<br/>\nHoping for some good insights into this situation. <br/>\n<br/>\nThanks<br/>\nTammy</div>","specialLinks":[]}],"prevTopicId":2296,"nextTopicId":47786}}