{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: thoughts about the intrinsic value of toys?","postDate":"1168130041","msgId":20338,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVucGY1cCtibmVuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQxMTEzMS4yNzgzNS5xbUB3ZWIzODcwOC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":20283,"nextInTopic":0,"prevInTime":20337,"nextInTime":20339,"topicId":20260,"numMessagesInTopic":0,"msgSnippet":"... Sometimes I buy a book because I like something in particular about it - the artwork, the cover even ! Since I mostly buy books at thrift stores and","messageBody":"<div id=\"ygrps-yiv-296902392\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Tracy Willis <br/>\n&lt;tracywil0701@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;After all, every time you add a book to your home library, aren&#39;t <br/>\n&gt;you doing so with the idea in mind that your child will learn <br/>\n&gt;something from that book.<br/>\n<br/>\n </span></blockquote>Sometimes I buy a book because I like something in particular about <br/>\nit - the artwork, the cover even &lt;g&gt;! Since I mostly buy books at <br/>\nthrift stores and library sales I can afford to do things like that. <br/>\nMany times I have bought books with the thought that &quot;maybe one <br/>\nday&quot;  I or Mo will be interested in some part of that book - an idea <br/>\nfor rainy day fun, or a chance to decoupage the bathroom walls with <br/>\nscraps of text (my secret fantasy). But I don&#39;t buy books with the <br/>\nexpectation that learning will come as a result of the purchase.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I was reading on a website this evening about a mom who says her <br/>\n&gt;home is<br/>\n&gt;  like a museum, filled to capacity with toys and trinkets and <br/>\n&gt;gadgets that will foster imagination, creativity, and learning.<br/>\n<br/>\n </span></blockquote>Sounds like Sandra&#39;s site. Its a great place to read. One thing to <br/>\nkeep in mind with all this &quot;strewing&quot; is exactly what I mentioned <br/>\nabove - don&#39;t Expect kids will learn something just because you <br/>\noffered them some neato thingummy. <br/>\n<br/>\nIts great to have lots and lots of options and ideas on hand for <br/>\nthose times when everyone feels a little stale or stuck in a rut, or <br/>\njust in need of some rainy-day fun. Its also great, if you have a <br/>\nbusy, explorative child, to have things stashed away for her <br/>\nto &quot;discover&quot; - it makes home a magical, exciting place to be. It <br/>\ncan be really fun to leave something out on a table, or in the <br/>\nbathroom, whatever, for family members to discover and either be <br/>\ninterested in or ignore - but be prepared to have them ignore it! <br/>\n<br/>\nSince you brought up Montessori, I&#39;ll toss a bit back at ya - if you <br/>\noffer a child a new &quot;material&quot; and the child is not interested, put <br/>\nit away. She&#39;s not ready. That&#39;s true of strewing, too, although I <br/>\nprefer to think of &quot;ready&quot; in a more wholistic sense than teachers <br/>\ngenerally do. *I&#39;m* still not ready to learn about a lot of things - <br/>\nwiring and plumbing come to mind. George could leave Do-it-yourself <br/>\nbooks all over the house and I still wouldn&#39;t be *ready* ;)<br/>\n<br/>\n---Meredith (Mo 5, Ray 13)</div>","specialLinks":[]},{"userId":278107510,"authorName":"alisonslp","from":"&quot;alisonslp&quot; &lt;alisonslp@...&gt;","profile":"alisonslp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: thoughts about the intrinsic value of toys?","postDate":"1168051356","msgId":20280,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVubjJhcys1djdyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGM5NS42OGY4MDI1LjMyZDAzN2E5QGFvbC5jb20+"},"prevInTopic":20278,"nextInTopic":20283,"prevInTime":20279,"nextInTime":20281,"topicId":20260,"numMessagesInTopic":0,"msgSnippet":"Thanks Julie and Leslie... your insight really helps.  Leslie, you ought to copy what you wrote an place it in your blog, if you have one. The portion about","messageBody":"<div id=\"ygrps-yiv-2044608589\">Thanks Julie and Leslie... your insight really helps.  Leslie, you<br/>\nought to copy what you wrote an place it in your blog, if you have<br/>\none. The portion about what we as adult might do if we had no other<br/>\nresponsibilities really hits it home.  <br/>\n<br/>\nI have been doing more observing and I&#39;m routinely amazed when I just<br/>\nsit back and realize what it really going on - not on the surface, but<br/>\ndeeper down. I have started a blog to help me chronicle it all. Just<br/>\nfor myself for now...maybe it will help new US someday...<br/>\n<br/>\nalison</div>","specialLinks":[]},{"userId":234201726,"authorName":"Tracy Willis","from":"Tracy Willis &lt;tracywil0701@...&gt;","profile":"tracywil0701","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] thoughts about the intrinsic value of toys?","postDate":"1168046375","msgId":20283,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMTEzMS4yNzgzNS5xbUB3ZWIzODcwOC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGM5NS42OGY4MDI1LjMyZDAzN2E5QGFvbC5jb20+"},"prevInTopic":20280,"nextInTopic":20338,"prevInTime":20282,"nextInTime":20284,"topicId":20260,"numMessagesInTopic":0,"msgSnippet":"I m new to the group and just learning the basics of unschooling, so if I m out of line, please forgive me. I don t see a problem with learning toys or toys","messageBody":"<div id=\"ygrps-yiv-879429302\">I&#39;m new to the group and just learning the basics of unschooling, so if I&#39;m out of line, please forgive me. I don&#39;t see a problem with &quot;learning toys&quot; or toys that contribute to a child&#39;s education. There&#39;s a big difference with drilling a child to learn their alphabet by 5 years old, or giving your child a set of alphabet cookie cutters to play in with some homemade play dough. From what I&#39;ve read, a big part of unschooling is to fill your home with materials of educational value and letting the child explore them in their own way and on their own terms. So, if you buy or are given a toy with some educational value, you haven&#39;t broken any moral codes by thinking to yourself &quot;Gee, I bet that will really help Junior to learn to recognize his numbers.&quot;  After all, every time you add a book to your home library, aren&#39;t you doing so with the idea in mind that your child will learn something from that book. I was reading on a website this evening about a mom who says her home is<br/>\n like a museum, filled to capacity with toys and trinkets and gadgets that will foster imagination, creativity, and learning. She&#39;s collected things over the years with all of this in mind. I think it is our job to introduce our children to new concepts (I don&#39;t mean through worksheets and textbooks) but by bringing these interesting objects into our homes, then letting the child examine them and decide where to go from there. Maybe it will spark a lifetime love for the idea, or a five minute discovery that is never touched again. But, at least they had an introduction and can store the information away for a rainy day.<br/>\n  Tracy<br/>\n  A homeschool rookie!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Leslie530@...\">Leslie530@...</a> wrote:<br/>\n          <br/>\nIn a message dated 1/5/2007 12:49:46 A.M. Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:alisonslp@...\">alisonslp@...</a> writes:<br/>\n<br/>\nI am trying so hard to just view my kids&#39; toys, games, activities as<br/>\njust that, with no underlying expectations. But enevitably, the<br/>\nthoughts enter my mind - this is great for their ____ {fill in the<br/>\nblank}. For the holidays and recently at a consignment sale, I have<br/>\ndone a better job of asking &quot;will they like this?&quot; instead of &quot;what<br/>\ncan they get from this?&quot; But as they play with toys, my thoughts<br/>\nrevert back. <br/>\n<br/>\nIs this something that you all think about as well?<br/>\n<br/>\n***************<br/>\n<br/>\nHi Alison. My first thought when reading your post was about something I <br/>\nread a long time ago about Maria Montessori. She noticed a child walking down <br/>\nthe street with his mother, she stopped to have a chat with someone. The <br/>\nchild picked up a piece of paper and explored it. Montessori watched the child, <br/>\nnoticing that he played with this paper and &quot;came to know it&quot;. What are <br/>\nyour children coming to know about the things they are doing?<br/>\n<br/>\nThe truth is.....you will probably never know! Experiencing life is all in <br/>\nthe mind of the individual. Can you truly know what &quot;green&quot; is like to <br/>\nanother person? We all point to something and agree that it is green, but does <br/>\nthat other person see what you see? <br/>\n<br/>\nSo step back and observe your children, not to see what they are learning <br/>\nbut to watch how they explore the world around them. It is really cool. <br/>\nEinstein (I have heard) said that 90% of the physics a person will know in a <br/>\nlifetime is learned in the first three years of life. I have read that a study in <br/>\nthe sixties concluded that school learning only accounts for 5 % of a <br/>\nperson&#39;s total learning (long before the tech age). Where are we getting the other <br/>\n95%???? Life. Experience. Just being. Totally cool!<br/>\n<br/>\nI also like to think what life would look like if you got to take an <br/>\nunlimited vacation and have the ability to do nothing or everything. All your needs <br/>\nare completely taken care of, food and cleaning, money. You can do anything <br/>\nyou want, no worries. How would you spend your time? At first you would <br/>\nprobably indulge yourself, but then you might find yourself in rhythms of doing <br/>\nand resting, wanting to be with others and being alone, &quot;mindless&quot; TV <br/>\nwatching to reading classic novels to NYTimes Crosswords. You might crave cleaning <br/>\nup after yourself or cooking for yourself. You might lie on the grass and <br/>\nstare at the clouds while your brain is in complete creative mode...composing <br/>\na symphony or thinking on how to solve the worlds problems. You might start <br/>\nan organic garden or chop wood. Your brain and body would find the optimum <br/>\nstates and rhythms of each moment and preparing for tomorrow&#39;s whims or plans. <br/>\nIt is what we are programmed to do by nature, after taking care of our <br/>\nbasic needs for survival.<br/>\n<br/>\nKeep reading and examining your thoughts. Figure out where you might be <br/>\ngetting in the way of your children&#39;s natural learning and life rhythms. Don&#39;t <br/>\nworry when those old thoughts creep in, they will! Make a cup of tea and <br/>\nwatch your kids instead. Or get down on the floor and play a mindless game, <br/>\ntoo. :)<br/>\n<br/>\nHave fun!<br/>\nLeslie in SC<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n         <br/>\n<br/>\n __________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":92643757,"authorName":"Leslie530@aol.com","from":"Leslie530@...","profile":"lescather","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [unschoolingbasics] thoughts about the intrinsic value of toys?","postDate":"1168039337","msgId":20278,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5NS42OGY4MDI1LjMyZDAzN2E5QGFvbC5jb20+"},"prevInTopic":20272,"nextInTopic":20280,"prevInTime":20277,"nextInTime":20279,"topicId":20260,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/5/2007 12:49:46 A.M. Eastern Standard Time, alisonslp@nc.rr.com writes: I am  trying so hard to just view my kids toys, games, activities","messageBody":"<div id=\"ygrps-yiv-721546038\">In a message dated 1/5/2007 12:49:46 A.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:alisonslp@...\">alisonslp@...</a> writes:<br/>\n<br/>\nI am  trying so hard to just view my kids&#39; toys, games, activities as<br/>\njust that,  with no underlying expectations. But enevitably, the<br/>\nthoughts enter my mind  - this is great for their ____ {fill in the<br/>\nblank}. For the holidays and  recently at a consignment sale, I have<br/>\ndone a better job of asking &quot;will  they like this?&quot; instead of &quot;what<br/>\ncan they get from this?&quot; But as they play  with toys, my thoughts<br/>\nrevert back. <br/>\n<br/>\nIs this something that you all  think about as well?<br/>\n<br/>\n<br/>\n***************<br/>\n <br/>\nHi Alison.  My first thought when reading your post was about  something I <br/>\nread a long time ago about Maria Montessori.  She noticed a  child walking down <br/>\nthe street with his mother, she stopped to have a chat with  someone.  The <br/>\nchild picked up a piece of paper and explored it.   Montessori watched the child, <br/>\nnoticing that he played with this paper and &quot;came  to know it&quot;.  What are <br/>\nyour children coming to know about the things they  are doing?<br/>\n <br/>\nThe truth is.....you will probably never know!  Experiencing life is  all in <br/>\nthe mind of the individual.  Can you truly know what &quot;green&quot; is like  to <br/>\nanother person?  We all point to something and agree that it is green,  but does <br/>\nthat other person see what you see?  <br/>\n <br/>\nSo step back and observe your children, not to see what they are learning  <br/>\nbut to watch how they explore the world around them.  It is really  cool.  <br/>\nEinstein (I have heard) said that 90% of the physics a person will  know in a <br/>\nlifetime is learned in the first three years of life.  I  have read that a study in <br/>\nthe sixties concluded that school  learning only accounts for 5 % of a <br/>\nperson&#39;s total learning (long before  the tech age).  Where are we getting the other <br/>\n95%????  Life.   Experience.  Just being.  Totally cool!<br/>\n <br/>\nI also like to think what life would look like if you got to take an  <br/>\nunlimited vacation and have the ability to do nothing or everything.   All your needs <br/>\nare completely taken care of, food and cleaning, money.  You  can do anything <br/>\nyou want, no worries.  How would you spend your time?   At first you would <br/>\nprobably indulge yourself, but then you might find yourself  in rhythms of doing <br/>\nand resting, wanting to be with others and being alone,  &quot;mindless&quot; TV <br/>\nwatching to reading classic novels to NYTimes Crosswords.   You might crave cleaning <br/>\nup after yourself or cooking for yourself.  You  might lie on the grass and <br/>\nstare at the clouds while your brain is in complete  creative mode...composing <br/>\na symphony or thinking on how to solve the worlds  problems.  You might start <br/>\nan organic garden or chop wood.  Your brain  and body would find the optimum <br/>\nstates and rhythms of each moment and preparing  for tomorrow&#39;s whims or plans. <br/>\n It is what we are programmed to do by  nature, after taking care of our <br/>\nbasic needs for survival.<br/>\n <br/>\nKeep reading and examining your thoughts.  Figure out where you might  be <br/>\ngetting in the way of your children&#39;s natural learning and  life rhythms.  Don&#39;t <br/>\nworry when those old thoughts creep in, they  will!  Make a cup of tea and <br/>\nwatch your kids instead.  Or get down on  the floor and play a mindless game, <br/>\ntoo.  :)<br/>\n <br/>\nHave fun!<br/>\nLeslie in SC<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":216914372,"authorName":"riasplace3","from":"&quot;riasplace3&quot; &lt;riasplace3@...&gt;","profile":"riasplace3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: thoughts about the intrinsic value of toys?","postDate":"1168018290","msgId":20272,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVubTIxaStwMTRzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVua29pNSs2bzVxQGVHcm91cHMuY29tPg=="},"prevInTopic":20261,"nextInTopic":20278,"prevInTime":20271,"nextInTime":20273,"topicId":20260,"numMessagesInTopic":0,"msgSnippet":"... The more you read...groups like this, Sandra s site, Joyce s site...the more you internalize it, even though you might not notice it at first, it begins to","messageBody":"<div id=\"ygrps-yiv-250432229\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;alisonslp&quot; &lt;alisonslp@...&gt; <br/>\nwrote: <br/>\n<blockquote><span title=\"ireply\"> &gt; Is this something that you all think about as well? Is it an ongoing<br/>\n&gt; battle that gradually gets easier until you don&#39;t notice anymore or is<br/>\n&gt; it something that stays with you, though you might not express it to<br/>\n&gt; your children? <br/>\n<br/>\n </span></blockquote>The more you read...groups like this, Sandra&#39;s site, Joyce&#39;s site...the <br/>\nmore you internalize it, even though you might not notice it at first, <br/>\nit begins to make a difference in your thinking.  I&#39;ve been reading on <br/>\nunschooling for something like 3 years, and there is a huge difference <br/>\nin the way I think.  Some things just sneak up on me...I&#39;ll be doing <br/>\nsomething and it comes out unschooley, and I&#39;m surprised. : ) Other <br/>\ntimes I realize it&#39;s different than I would have done in the past, and <br/>\nit makes me glad. <br/>\nJust keep reading, keep studying, keep learning all you can about <br/>\nunschooling.  Some day you&#39;ll be surprised that you haven&#39;t thought <br/>\nabout &quot;school&quot; in days, then weeks, then years. ; )<br/>\nRia</div>","specialLinks":[]},{"userId":227739966,"authorName":"Julie Peters","from":"&quot;Julie Peters&quot; &lt;julieannpeters@...&gt;","profile":"julie_a_peters","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: thoughts about the intrinsic value of toys?","postDate":"1168005858","msgId":20261,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVubGx0Mis1ZGZ1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVua29pNSs2bzVxQGVHcm91cHMuY29tPg=="},"prevInTopic":20260,"nextInTopic":20272,"prevInTime":20260,"nextInTime":20262,"topicId":20260,"numMessagesInTopic":0,"msgSnippet":"Alison, ...I have done a better job of asking [WILL] they like this? instead of what [CAN] they get from this? But as they play with toys, my thoughts","messageBody":"<div id=\"ygrps-yiv-676349399\">Alison,<br/>\n<br/>\n&lt;&lt;&gt;&gt;...I have done a better job of asking &quot;[WILL] they like this?&quot; <br/>\ninstead of &quot;what [CAN] they get from this?&quot; But as they play with <br/>\ntoys, my thoughts revert back.&lt;&lt;&gt;&gt;  <br/>\n<br/>\nHave you thought about asking yourself &quot;WHY will they like this?&quot; or <br/>\nas you are watching them play asking yourself, &quot;what ARE *THEY* <br/>\ngetting from THIS?&quot;.  (I see your question above more as &quot;what do <br/>\n*I* want them to get from this?&quot;.)  Training yourself to re-word <br/>\nyour questions may satisfy both your want to meet their interests <br/>\nand your need for &quot;educational&quot; play.<br/>\n<br/>\nMy son loves toys, and yes, I tend to think some of them <br/>\nare &quot;mindless&quot;.  However, if I stop to think about &quot;why&quot; he likes a <br/>\ntoy or &quot;how&quot; he is playing with it my perpective usually changes.  <br/>\n<br/>\nAll play is practice for something...whether it is &quot;mindless&quot; or not.<br/>\n<br/>\nI started thinking this way when I began trying to explain how <br/>\nunschooling works to others.  I kept referring to things like my son <br/>\nplaying with Legos.  As he plays he&#39;s developing skills like <br/>\ncreativity, architecture, physics, math, etc.  Same goes for cars, <br/>\nconstruction vehicles, etc.  <br/>\n<br/>\nIf he&#39;s simply playing with a straw at a restraunt <br/>\n(pretty &quot;mindless&quot;, right?) he&#39;s experimenting with the flexibility <br/>\nand strength of polymers, air flow & pressure, suction, and several <br/>\nfluid theories all of which are classified as advanced physics (not <br/>\nso &quot;mindless&quot; anymore, huh?). <br/>\n<br/>\nI used to think that my son couldn&#39;t read b/c he wasn&#39;t reading what <br/>\nwe asked him to.  So I would put reading &quot;stuff&quot; in his path.  <br/>\nNeedless, to say I wasted money and time.  The &quot;mindless&quot; <br/>\nvideo/computer games, cartoons, and comics were what he WAS <br/>\nreading...and doing a mighty fine job of it.  I just didn&#39;t see it <br/>\nbecause I was too caught up in the activities being &quot;mindless&quot;.  <br/>\nKWIM?<br/>\n<br/>\nWhat we would consider &quot;mindless&quot; simply isn&#39;t to a child.  No more <br/>\nthan the &quot;mindless&quot; soaking in a bubble bath is for you.  You&#39;re <br/>\npondering, daydreaming, relaxing, letting go of stress, possibly <br/>\nplanning the day, collecting yourself, getting clean, exfoliating, <br/>\netc.  In other words, you&#39;re becoming a better Mommy.  &quot;Mindless&quot; <br/>\nplay makes kids better kids.  <br/>\n<br/>\nJust because it seems &quot;mindless&quot; doesn&#39;t mean it&#39;s not worth doing.<br/>\n<br/>\nHTH, <br/>\nJulie Peters</div>","specialLinks":[]},{"userId":278107510,"authorName":"alisonslp","from":"&quot;alisonslp&quot; &lt;alisonslp@...&gt;","profile":"alisonslp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"thoughts about the intrinsic value of toys?","postDate":"1167975813","msgId":20260,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVua29pNSs2bzVxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":20261,"prevInTime":20259,"nextInTime":20261,"topicId":20260,"numMessagesInTopic":0,"msgSnippet":"I am trying so hard to just view my kids toys, games, activities as just that, with no underlying expectations. But enevitably, the thoughts enter my mind -","messageBody":"<div id=\"ygrps-yiv-1952634351\">I am trying so hard to just view my kids&#39; toys, games, activities as<br/>\njust that, with no underlying expectations. But enevitably, the<br/>\nthoughts enter my mind - this is great for their ____ {fill in the<br/>\nblank}. For the holidays and recently at a consignment sale, I have<br/>\ndone a better job of asking &quot;will they like this?&quot; instead of &quot;what<br/>\ncan they get from this?&quot; But as they play with toys, my thoughts<br/>\nrevert back.  <br/>\n<br/>\nIs this something that you all think about as well? Is it an ongoing<br/>\nbattle that gradually gets easier until you don&#39;t notice anymore or is<br/>\nit something that stays with you, though you might not express it to<br/>\nyour children? <br/>\n<br/>\nI have been working on the type of comments I make to the children -<br/>\nmaking sure they are in the moment and related to my observations of<br/>\ntheir joy or frustrations, rather that relatin gthem to what they<br/>\nmay/may not be learning. But in my head, those comments are still<br/>\nthere, if that makes sense.<br/>\n<br/>\nalison</div>","specialLinks":[]}],"prevTopicId":20306,"nextTopicId":20341}}