{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: OT-Troubled mother relationships","postDate":"1167157556","msgId":20022,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVtcnBmaytxOWU5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDYxMjI2MDMzOTI2LjYyNjYyLnFtYWlsQHdlYjM4NTE1Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":20019,"nextInTopic":0,"prevInTime":20021,"nextInTime":20023,"topicId":20019,"numMessagesInTopic":0,"msgSnippet":"... I know we re talking about an adult here, not a child, but it really made me think of how some kids have what Danielle calls an internal autonomy meter -","messageBody":"<div id=\"ygrps-yiv-897968402\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Lorrie <br/>\n&lt;iamhisservant4ever@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; She was fine for about an hour and then Dr. Jekyll kicked in. I <br/>\n&gt;said that it was time for her to open her gifts and she gave me a <br/>\n&gt;look like she wanted to kill me and rudely said that she didn&#39;t <br/>\n&gt;want any gifts. My 15 year old daughter handed her a gift and <br/>\n&gt;said. &quot;this is from me&quot;. She then put it on top of her purse and <br/>\n&gt;said she would take it home and maybe open them tomorrow.<br/>\n<br/>\n </span></blockquote>I know we&#39;re talking about an adult here, not a child, but it really <br/>\nmade me think of how some kids have what Danielle calls an &quot;internal <br/>\nautonomy meter&quot; - and when too much of the world is out of their <br/>\ncontrol they get overwhelmed. In your mom&#39;s case, lets see, it was a <br/>\nholiday, so her regular routine is gone, she&#39;s going to someone <br/>\nelse&#39;s house, someone else has to drive her, and then other people <br/>\nstart telling her what to do, and when. Broken down like that, its a <br/>\npretty stressful situation. Maybe *she* gets overwhelmed when so <br/>\nmany things are out-of-control, and doesn&#39;t have the skills to <br/>\nexpress herself gracefully.<br/>\n<br/>\nWhy was it suddenly &quot;time&quot; for her to open her gifts? Why did you <br/>\nannounce it rather than asking if she&#39;d like to open some presents? <br/>\nIf you are talking to your mom this way, I can&#39;t help but wonder if <br/>\nyou talk to your kids this way, too. Is it possible that you get <br/>\noverwhelmed when things don&#39;t go your way?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; After another round trip to take her back home, I saw her calling <br/>\n&gt;when I got back. The message from Mr. Hyde was, &quot;thank you for the <br/>\n&gt;gifts, I didn&#39;t even know I had any.&quot; Then she went on about how <br/>\n&gt;great it was to be here today.<br/>\n<br/>\n </span></blockquote>Try looking at this without the lens of resentment. She called to <br/>\napologise and thank you. Maybe she didn&#39;t say &quot;sorry&quot; but I think it <br/>\nwas implied. If you are in the habit of resenting your mom for not <br/>\nbeing the kind of mom you want, how does that impact your own self-<br/>\nimage? How much are your kids learning from you about control and <br/>\nresentment in relationships?<br/>\n<br/>\n---Meredith (Mo 5, Ray 13)</div>","specialLinks":[]},{"userId":269152394,"authorName":"Lorrie","from":"Lorrie &lt;iamhisservant4ever@...&gt;","profile":"iamhisservant4ever","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"OT-Troubled mother relationships/was Sad situation/Crystal","postDate":"1167104366","msgId":20019,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYxMjI2MDMzOTI2LjYyNjYyLnFtYWlsQHdlYjM4NTE1Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":20022,"prevInTime":20018,"nextInTime":20020,"topicId":20019,"numMessagesInTopic":0,"msgSnippet":"I agree with you. How could anyone throw out precious pictures of their children? Not to mention how can your children not be a priority? Today I had to endure","messageBody":"<div id=\"ygrps-yiv-1245451062\">I agree with you. How could anyone throw out precious pictures of their children? Not to mention how can your children not be a priority?<br/>\n <br/>\nToday I had to endure 4 hours of wondering when the argument would break out. I found that by just going upstairs for a few minutes of quiet time helped me throughout the day.<br/>\nAfter driving an hour and 20 minutes round trip to pick my mother up to come have dinner with us, I could see that it wasn&#39;t going to be the best of days.<br/>\nShe was fine for about an hour and then Dr. Jekyll kicked in. I said that it was time for her to open her gifts and she gave me a look like she wanted to kill me and rudely said that she didn&#39;t want any gifts. My 15 year old daughter handed her a gift and said. &quot;this is from me&quot;. She then put it on top of her purse and said she would take it home and maybe open them tomorrow. Her and my son just looked at me and at that point I just walked out and went into the kitchen and started cleaning. After about 15 minutes I could hear that she had opened the kids gifts any way. I went and got the ones I had gotten her and took them into the kitchen and threw them into a bag of stuff that was going back to her house.<br/>\n <br/>\nAfter another round trip to take her back home, I saw her calling when I got back. The message from Mr. Hyde was, &quot;thank you for the gifts, I didn&#39;t even know I had any.&quot; Then she went on about how great it was to be here today.<br/>\nBefore anyone thinks that she has alzheimers or any problem to do with her age, she has been up and down like this my entire life. When I try to suggest that she is bi-polar, or anything that involves finding out about the mood swings she argues with me then hangs up on me. It usually calls for about a 2 or 3 week silent treatment. Anytime things don&#39;t go her way, or she disagrees with me, the silent treatments start. It used to bother me when I was younger, but to be honest I feel so much better when she does this and I don&#39;t have to deal with her.<br/>\n <br/>\nOther then that I had a great day with my kids and feel so Blessed to have them.<br/>\nI hope everyone had a wonderful day!<br/>\n <br/>\npeace,<br/>\nlorrie<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: Crystal Miller &lt;willowsfortress@...&gt;<br/>\nTo: unschoolingbasics@yahoogroups.com<br/>\nSent: Monday, December 25, 2006 3:09:41 PM<br/>\nSubject: [unschoolingbasics] OT-Troubled mother relationships/was Sad situation<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 1b. OT-Troubled mother relationships/ was Sad situation<br/>\n </span></blockquote>++++++++++++ +++++++++ +++<br/>\nAhhh, but so interesting was not seeing my mother for over 20 years then <br/>\ntrying to help her and my brother out this past year (homeless) and when she <br/>\nwas living in my home she said to me, &quot;Crystal, I did not keep any pictures <br/>\nof you because I thought that I was never going to see you again.&quot; Then she <br/>\nadded, &quot;You just weren&#39;t a priority to me.&quot;<br/>\n<br/>\nNot a priority? It was an interesting statement considering my Sorscha is a <br/>\nhuge priority to me and I cannot imagine not seeing her for over 20 years. <br/>\nThe thought of even throwing away one picture of Sorscha flabbergast me...I <br/>\neven keep the smeary ones. It is important that I chose not to wallow in <br/>\nmy losses (parent, love, childhood) and create what I wanted. I guess that <br/>\nis why I love RUing. It&#39;s about the relationship I create with Sorscha.<br/>\n~Crystal~<br/>\nhttp://daikinicross roads.blogspot. com/<br/>\n<br/>\nHey PS...YOU Albuquerque Tribe...Thanks for being there for me this year <br/>\nwhen I was going thru that mess! Ya&#39;ll are awesome friends! <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\nhttp://mail.yahoo.com <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":20015,"nextTopicId":19518}}