{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":132876517,"authorName":"AECANGORA@aol.com","from":"AECANGORA@...","profile":"amy_aec","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Shakspere, etc.","postDate":"1271254834","msgId":43671,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQ0E5RjRDODQzOTE0Qy1BMUMtQUYwMkB3ZWJtYWlsLWQwMDYuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":43670,"nextInTime":43672,"topicId":43671,"numMessagesInTopic":0,"msgSnippet":"Thanks Joyce for that perspective.  Reading the picture books before hand is a great idea! I ve been thinking a lot lately about the way schools like to","messageBody":"<div id=\"ygrps-yiv-1540580700\">Thanks Joyce for that perspective.  Reading the picture books before hand is a great idea!<br/>\n<br/>\nI&#39;ve been thinking a lot lately about the way schools like to dissect things.  I keep thinking about the scene from Dead Poet&#39;s Society where Robin Williams&#39; character tells the class to tear the page out of their poetry book that talks about how to examine and evaluate poems.  <br/>\n<br/>\nMy older daughter is in ps by choice right now.  She is in the 3rd grade and gets all A&#39;s and B&#39;s.  However, the same thing comes up in every parent/teacher conference.  She has a hard time responding when asked in reading group why a particular author might have chosen to write a particular story or why the author chose to write in this style.  To me that&#39;s like asking a child to get inside someone&#39;s head.  &quot;Why did I choose to wear my summer pj&#39;s on a cold night?&quot;  Seems ridiculous to me. Of course I didn&#39;t say this to the teacher.  <br/>\n<br/>\nThey are preparing for the NY state Eng./Language Arts test, and I think it is one of the types of questions that is asked.  I talked with my daughter about it, and we came up with some examples of answers she could give.  Then I pointed out to her that half of essay questions is being able to support your answer with why you choose your position.  There really is no one right answer.  You just have to support you ideas.  (In other words BS your way through it, although I didn&#39;t say it this way to my daughter.)<br/>\n<br/>\nAmy C.<br/>\n<br/>\n<br/>\n               Re: Concert and 11 y/o          <br/>\n    <br/>\nPosted by:      &quot;Joyce Fetteroll&quot;            <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>                                       jfetteroll                   <br/>\n    <br/>\n      Tue Apr 13, 2010 6:31 am        (PDT)    <br/>\n                      <br/>\n<br/>\n      <br/>\n<blockquote><span title=\"qreply\"> On Apr 12, 2010, at 12:07 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AECANGORA@...\">AECANGORA@...</a> wrote:<br/>\n<br/>\n&gt; Weren&#39;t Shakespeare productions considered to be crude and unseemly  <br/>\n&gt; when first preformed in England?<br/>\n<br/>\nThey were meant to appeal to a broad audience, both high and low. They  <br/>\nhave references that would have been understandable to the educated as  <br/>\nwell as bawdy humor that everyone would have understood. (My total  <br/>\nguess is that would have been standard practice for the plays put on  <br/>\nfor the general public, not something unique to Shakespeare.<br/>\n)<br/>\n<br/>\nThe language and centuries-old references have made the plays more  <br/>\nobscure so even the bawdy humor needs explanation to fully get.  But  <br/>\nthey&#39;re not as obscure as schools lead people to believe. I took  <br/>\nKathryn to see A Midsummer&#39;s Night Dream when she was 4 and she was  <br/>\nperfectly content to sit through the whole thing and said she had no  <br/>\nproblem following the story. (We had read a couple of picture book  <br/>\nversions before hand.) I suspect the fact at 4 she was used to living  <br/>\nin the world of conversation where she wasn&#39;t getting every word but  <br/>\npicking up the gist from a few words she got and tone and context. So  <br/>\nShakespeare wasn&#39;t that much different. It&#39;s only later when people  <br/>\nget used to understanding 90% of what they hear that they freak out  <br/>\nwhen they can&#39;t ;-) They tools of drawing meaning from everything else  <br/>\nthat&#39;s going on get rusty.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]}],"prevTopicId":43670,"nextTopicId":43680}}