{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":13,"messages":[{"userId":187549037,"authorName":"techwritercsbn","from":"&quot;techwritercsbn&quot; &lt;techwritercsbn@...&gt;","profile":"techwritercsbn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Fear and Food (VERY VERY LONG)","postDate":"1152827364","msgId":15736,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU5NmY1NCtjaGF2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU5MzkyYStpYXZhQGVHcm91cHMuY29tPg=="},"prevInTopic":15735,"nextInTopic":0,"prevInTime":15735,"nextInTime":15737,"topicId":15629,"numMessagesInTopic":0,"msgSnippet":"I m seeing some themes that it seems like many respondants believe (correct me if I m wrong): 1) If eating unhealthfully does not cause immediate and apparent ","messageBody":"<div id=\"ygrps-yiv-176689703\">I&#39;m seeing some themes that it seems like many respondants believe <br/>\n(correct me if I&#39;m wrong):<br/>\n<br/>\n1) If eating unhealthfully does not cause immediate and apparent <br/>\nnegative effects, children won&#39;t trust parents that tell them about <br/>\nthe dangers of certain dietary choices because they can&#39;t see/feel <br/>\nsaid effects<br/>\n<br/>\n2) Humans crave, and thus eat, only what the body needs and will <br/>\nachieve a healthy dietary balance if raised in a family that imposes <br/>\nno dietary limits<br/>\n<br/>\n3) Smoking leads to disease, but the link between nutrition and <br/>\ndisease is not as strong<br/>\n<br/>\nDoes everyone out there (besides me) believe these to be true?<br/>\n<br/>\nAlso, why does a comparison with cigarettes make people upset?  Is it <br/>\nnot the same philosophical point i.e. limiting choice in a child that <br/>\nyou would not limit in an adult?  <br/>\n<br/>\nEven if you don&#39;t believe that the link between nutrition and disease <br/>\nis as strong as that between smoking and disease, the philosophy is <br/>\nthe same (we give our kids the information and then let them choose, <br/>\nfully support the choice even if it isn&#39;t one we&#39;d make if the danger <br/>\nisn&#39;t apparent right then lest they not trust us, etc.).  Isn&#39;t it?  <br/>\n<br/>\nThe dangers of smoking and the dangers of eating are both not like <br/>\nthe dangers of running into traffic.  A kid isn&#39;t likely to drop dead <br/>\nfrom smoking 10 packs of cigarettes or eating 10 gallons of ice <br/>\ncream.  They are both likely to look and feel equally healthy.<br/>\n<br/>\nIs there no one who sees this as a valid parallel?<br/>\n<br/>\n(and my apologies to those of you donating your time who might be <br/>\nsick to death of the food discussions :)  I did read archives and am <br/>\ntrying to get a different perspective, I swear.</div>","specialLinks":[]},{"userId":187549037,"authorName":"techwritercsbn","from":"&quot;techwritercsbn&quot; &lt;techwritercsbn@...&gt;","profile":"techwritercsbn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Fear and Food (VERY VERY LONG)","postDate":"1152822836","msgId":15735,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU5NmFuayt0bm5iQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEQxQ0NFOTZCLTgyNzYtNDc0NC1CRjQ3LTkwQTYxNjZBMUQ0RUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":15707,"nextInTopic":15736,"prevInTime":15734,"nextInTime":15736,"topicId":15629,"numMessagesInTopic":0,"msgSnippet":"... avoid ... If we have worked to release fear, though, the other options are truly just alternates based on the facts (or what we perceive to be facts). ... ","messageBody":"<div id=\"ygrps-yiv-10994620\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Joyce Fetteroll <br/>\n&lt;fetteroll@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; On Jul 12, 2006, at 5:16 PM, Christe Bruderlin wrote:<br/>\n&gt; &gt; I think this is probably true for most of the choices most  <br/>\n&gt; &gt; individuals make (not necessarily OMG FEAR!, but wanting to <br/>\n </span></blockquote>avoid  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; the alternate option).<br/>\n&gt; <br/>\n&gt; I think it&#39;s wanting to avoid what they *fear* will happen.  <br/>\n&gt; &quot;Alternate option&quot; suggests that there&#39;s equal likelihood of the  <br/>\n&gt; outcomes.<br/>\n<br/>\n </span></blockquote>If we have worked to release fear, though, the other options are <br/>\ntruly just alternates based on the facts (or what we perceive to be <br/>\nfacts).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; People fear that if they don&#39;t control how much candy their <br/>\n </span></blockquote>children  <br/>\n<blockquote><span title=\"ireply\"> &gt; eat, then their children will eat nothing but candy.<br/>\n<br/>\n </span></blockquote>I don&#39;t fear that as I know many children without limits who eat lots <br/>\nof veggies, too.  It is more about the percentage.  I do think that <br/>\nmany people might have tastebuds that can&#39;t differentiate very well <br/>\nbetween what the body needs and the fake alternatives out there.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;There are no studies on children with free access to  <br/>\n&gt; food, growing up in mindful homes that has shown that to be true. <br/>\n </span></blockquote>But  <br/>\n<blockquote><span title=\"ireply\"> &gt; they fear it&#39;s true. And, so, better safe than sorry.<br/>\n<br/>\n </span></blockquote>And there are no studies that show that kids without limits are <br/>\nhealthier than their limited counterparts either.  Though if you tell <br/>\nme that no food-unlimited kid out there has weight problems or Type <br/>\nII diabetes or other food-related health problems (with the caveat <br/>\nthat we know that *most* problems will not show up until later), I <br/>\nmight be a little more convinced...However, I know A LOT of kids <br/>\n(unschooled and not) who have have whatever they want in the fridge <br/>\nand house (and where money isn&#39;t an issue).  I&#39;m not seeing this <br/>\nhealthy balance that everyone keeps talking about.  That&#39;s just my <br/>\nreality.  <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; Not every choice is nutritious but overall, the choices balance <br/>\n </span></blockquote>out.  <br/>\n<br/>\nMaybe it is just semantics.  What is the definition of balance?  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What most people fear is that kids will *only* eat nonnutritious  <br/>\n&gt; foods unless the parent controls those foods. That isn&#39;t true.<br/>\n<br/>\n </span></blockquote>You&#39;re right, it isn&#39;t.  I&#39;ve never seen a kid shun all nutritious <br/>\nfood -- though my nephew (always unlimited) will not eat anything <br/>\nresembling a vegetable.  He will eat apples, though.  LOL.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   Unrestricted access doesn&#39;t end up looking like organic vegan <br/>\n </span></blockquote>diets  <br/>\n<blockquote><span title=\"ireply\"> &gt; (for most kids!) any more than unschooling looks like kids doing  <br/>\n&gt; school at home without mom making them ;-) But it also doesn&#39;t <br/>\n </span></blockquote>look  <br/>\n<blockquote><span title=\"ireply\"> &gt; like most schooled kids&#39; diets that are heavily weighted with  <br/>\n&gt; convenience foods either. It looks like nutritious food mixed with  <br/>\n&gt; some snacks.<br/>\n<br/>\n </span></blockquote>I agree here, except that most schooled kids I know have diets that <br/>\nsound exactly like the diets described on this and other unschooling <br/>\nboards (some healthy, some not).  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What do you mean by want the item more? (Let&#39;s not talk about  <br/>\n&gt; cigarettes, just food.) Do you mean addictive?<br/>\n<br/>\n </span></blockquote>Not necessarily &quot;addictive,&quot; although I believe some foods are.  <br/>\nThere are quite a few valid definitions of &quot;addiction&quot; out there, <br/>\nwhich would make it hard to focus specifically on that word, however. <br/>\nI mean that if candy is in front of me, I&#39;m more likely to eat it <br/>\nthan if I have to go out and get it.  Same with fruit, etc.  During a <br/>\nmindless urge to munch, I might just grab that which is most <br/>\nconvenient.   <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; What do you mean by &quot;feasibly*? <br/>\n<br/>\n </span></blockquote>&quot;possibly,&quot; etc.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; happened? Are there studies that show children *raised with  <br/>\n&gt; unrestricted food choice* whose diets skew towards one particular  <br/>\n&gt; food because the food itself has created a craving? If there are <br/>\n </span></blockquote>no  <br/>\n<blockquote><span title=\"ireply\"> &gt; studies, then it isn&#39;t &quot;feasible&quot;, it&#39;s a fear.<br/>\n<br/>\n </span></blockquote>Not one particular food, no.  I didn&#39;t make myself clear, but <br/>\nhopefully the above paragraph clarified that.  <br/>\n<br/>\nI appreciate everyone sharing what their kids eat, but it has made me <br/>\nrealize something.  I&#39;m perhaps offending some people (hence the need <br/>\nto defend personal household diets?).  I&#39;m sorry.  I&#39;ve really been <br/>\nthinking about this and trying to say everything as gently as <br/>\npossible.  I really HONOR everyone&#39;s right to eat what they choose, <br/>\nincluding my children&#39;s.  I know we all draw the line at different <br/>\nplaces.  I&#39;m more talking about where I draw MY line.  Everyone wants <br/>\nto talk about their definition of healthy.  We differ there.  That is <br/>\nOKAY.  For me, I see the overall health of the child a bit <br/>\ndifferently, but still want to live in harmony with my children.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Why does your conclusion that kids will eat an excessive amount of  <br/>\n&gt; some addictive food not match what is happening in our families?<br/>\n<br/>\n </span></blockquote>If this was my reasoning (though not what I said), it could be <br/>\nbecause it isn&#39;t like someone would get hooked on &quot;chips,&quot; but <br/>\nperhaps something within the chips (fat, salt, crunchiness, etc.) <br/>\nthat they get in a variety of healthy and unhealthy foods.  Having <br/>\nthe chips there would be an easy way to meet say the craving for <br/>\ncrunchiness that could be met with a carrot or a cracker or whatever <br/>\nor the craving for fat that could be met with a nut or a steak or a <br/>\npiece of cake or whatever.  But whatever is sitting in a bowl might <br/>\nbe easiest for a kid to pick.   <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Could the same line of reasoning apply to food choices (e.g. <br/>\n </span></blockquote>after  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; years of exposure, the food choice could lead to heart disease <br/>\n </span></blockquote>and  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; cancer)?<br/>\n<br/>\n </span></blockquote>Absolutely, now that we&#39;ve clarified the line of reasoning.<br/>\n<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; The connection between smoking and cancer is pretty clear. The  <br/>\n&gt; connection between foods and cancer is  less clear.<br/>\n<br/>\n </span></blockquote>Actually, the connections are very clear.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s just my gut feeling from seeing the &quot;latest studies&quot; come and <br/>\n </span></blockquote>go  <br/>\n<blockquote><span title=\"ireply\"> &gt; over the last 40+ years that the body is pretty adaptable. A bag <br/>\n </span></blockquote>of  <br/>\n<blockquote><span title=\"ireply\"> &gt; chips won&#39;t hurt anyone. (Barring allergies of course.) <br/>\n<br/>\n </span></blockquote>No, but the trans saturated fat from the bag of chips combined with <br/>\nlots of other sources of food with trans or saturated fat will (or <br/>\nthe salt or insert whatever here).<br/>\n<br/>\nAlso, yes, the studies viewed together are key.  The news picks out a <br/>\nstudy here or there out of context.  It takes several studies to make <br/>\ntrue scientific evidence.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I suspect that for some people who are prone to cancer, if their <br/>\n </span></blockquote>diet is heavily laden with &quot;junk&quot; food,  <br/>\n<blockquote><span title=\"ireply\"> &gt; that their risk of cancer goes up. <br/>\n<br/>\n </span></blockquote>Yes, and in many cancers, the science shows that diet has a much <br/>\nstronger impact than genetics (breast and prostate, for example).  <br/>\n<br/>\nThat&#39;s a far cry from a belief  <br/>\n<blockquote><span title=\"ireply\"> &gt; that eating any amount of certain foods will greatly increase the  <br/>\n&gt; risk of cancer. It&#39;s a far cry from a belief that eating nothing <br/>\n </span></blockquote>but  <br/>\n<blockquote><span title=\"ireply\"> &gt; food of a certain type (organic, raw, vegan, wheat free or <br/>\n </span></blockquote>whatever)  <br/>\n<blockquote><span title=\"ireply\"> &gt; will greatly reduce the risk of cancer.<br/>\n<br/>\n </span></blockquote>Actually, what you&#39;ve said goes against the science out there if you <br/>\nlook at a unprocessed, plant-based diet vs. any other diet.  Most <br/>\nhumans, it appears, can afford about 100-200 calories of non-<br/>\nnutritious (meaning high nutrient) foods a day before the disease <br/>\nrates start climbing.  I&#39;ve been doing nutrition research for years <br/>\nand all of you may have been too.  However, if not, I recently read a <br/>\ngreat book (mentioned in my earlier post) called &quot;Eat to Live&quot; while <br/>\npreparing to write a review of a book coming out in paperbook <br/>\ncalled &quot;Disease Proof your Child.&quot;  Whether you agree with the <br/>\noutcomes or not, the information sections in the beginning of each <br/>\nare excellent sources of information compiling 1000s of scientific <br/>\nstudies (which you can verify by getting the articles on PubMed or <br/>\nyour local library that carries peer-reviewed journals).  &quot;The China <br/>\nStudy&quot; (recently on bestseller list) is also great for a more <br/>\nspecific look at nutrition.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -- kids who  <br/>\n&gt; are not dropping dead, adults who appear perfectly healthy --  <br/>\n&gt; enjoying the foods that you forbid, they&#39;re going to want them.. <br/>\n<br/>\n </span></blockquote>And that&#39;s the problem with most Americans, isn&#39;t it?  That the <br/>\neffects of diet are not immediate in many cases.  Many people <br/>\n*appear* healthy when they are not.  There are autopsy studies of <br/>\nkids who died in accidents and the majority of kids between 4-7 years <br/>\nstudied ALREADY had plaques in their arteries.  Yet they looked and <br/>\nseemed happy and healthy.  <br/>\n<br/>\nThey  <br/>\n<blockquote><span title=\"ireply\"> &gt; may feel guilty for wanting and guilt is definitely not good for  <br/>\n&gt; health. <br/>\n<br/>\n </span></blockquote>Agree.  Guilt is a bummer. <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; Think about your favorite genre of movie or book. What if your  <br/>\n&gt; husband had read that those genres would shorten your lifespan and <br/>\n </span></blockquote>he  <br/>\n<blockquote><span title=\"ireply\"> &gt; wanted you to stop. How could he get you to stop *and* maintain a  <br/>\n&gt; good relationship with you? That scenario seems ridiculous, but <br/>\n </span></blockquote>when  <br/>\n<blockquote><span title=\"ireply\"> &gt; we&#39;re imposing our beliefs -- no matter how certain we are of our  <br/>\n&gt; beliefs -- on someone else, it feels exactly like that.<br/>\n<br/>\n </span></blockquote>I do get that point.  That is why I originally wrote.  How do we <br/>\nprotect our kids (according to our own definitions of safety and <br/>\nprotection) and do so joyfully, creatively, etc.?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If the danger is imminent and our kids aren&#39;t aware of it, our <br/>\n </span></blockquote>kids  <br/>\n<blockquote><span title=\"ireply\"> &gt; -- all people in fact! -- would want someone to interfere! <br/>\n<br/>\n </span></blockquote>Yes.  But define imminent.  The damage happens now.  The results <br/>\nhappen later.  Just because we can&#39;t see the danger right now doesn&#39;t <br/>\nmean it isn&#39;t there right now.  Anyway, I do believe that it is <br/>\nimminent and so that is the reason for stocking my house with what I <br/>\ndo.  I still want to do this respectfully, etc. however.  <br/>\n<br/>\nI used cigarettes because they illustrate the point without picking <br/>\nout a particular lifestyle, and they make a fine point about <br/>\nmoderation.  If I smoke 1, will it do damage?  Yes.  Will I see the <br/>\ndamage?  No.  (and alternatively I could be that rare person who can <br/>\nsmoke oodles and see no ill come of it). etc. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But the more adamantly certain we&#39;re right  <br/>\n&gt; and most of their friends are wrong, the more pressure we put on <br/>\n </span></blockquote>them  <br/>\n<blockquote><span title=\"ireply\"> &gt; to not venture beyond what we believe to be right, the greater the  <br/>\n&gt; wall we erect between ourselves and them.<br/>\n<br/>\n </span></blockquote>I totally agree.  And is there ever one &quot;right&quot; anyway?  Nah.  :)  <br/>\n<br/>\nOh, and we&#39;re going to Disneyland tomorrow and then camping for a <br/>\nweek and so I might seem like I&#39;ve disappeard, but I will respond as <br/>\nI can.</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"Melissa &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Fear and Food (VERY VERY LONG)","postDate":"1152806719","msgId":15707,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE3NUFBMDNELTBCNUMtNDlCQy04RDFELTUxRDM2QTE3NEYzRUBjb3gubmV0Pg==","inReplyToHeader":"PEQxQ0NFOTZCLTgyNzYtNDc0NC1CRjQ3LTkwQTYxNjZBMUQ0RUBlYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PDIwMDYwNzExMjAzODQ2LjQwNTEwLnFtYWlsQHdlYjMyNjA1Lm1haWwubXVkLnlhaG9vLmNvbT4gPEQxQ0NFOTZCLTgyNzYtNDc0NC1CRjQ3LTkwQTYxNjZBMUQ0RUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":15705,"nextInTopic":15735,"prevInTime":15706,"nextInTime":15708,"topicId":15629,"numMessagesInTopic":0,"msgSnippet":"exactly me...I m still fighting that fear if I don t eat it all, I won t get more. And that s precisely why I don t want my kids growing up restricted...and","messageBody":"<div id=\"ygrps-yiv-947709042\">exactly me...I&#39;m still fighting that fear if I don&#39;t eat it all, I  <br/>\nwon&#39;t get more. And that&#39;s precisely why I don&#39;t want my kids growing  <br/>\nup restricted...and even more so why it&#39;s important for me to provide  <br/>\nwhat they need.<br/>\n<br/>\nI also grew up with a mom who had her special snacks, and we were  <br/>\nnever allowed to touch, much less eat them. To this day, I have to  <br/>\nfight the impulse to hide and eat those things....or tell the kids  <br/>\nthey&#39;re mine. :-(<br/>\n<br/>\nI really appreciate you saying that you gave yourself permission to  <br/>\neat what you wanted. I thought I was the only one who had very verbal  <br/>\nconversations with myself, soothing that mommy voice and saying, You  <br/>\ncan go buy more, you&#39;re a grownup now, with money and transportation  <br/>\nof your own.<br/>\n<br/>\nMelissa<br/>\nMom to Josh (11), Breanna (8), Emily (7), Rachel (6), Sam (4), Dan  <br/>\n(2), and Avari Rose<br/>\n<br/>\nshare our lives at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://360.yahoo.com/multimomma\">http://360.yahoo.com/multimomma</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jul 13, 2006, at 10:12 AM, Joyce Fetteroll wrote:<br/>\n&gt;<br/>\n&gt; We have a collection of chips that come with sandwiches piling up on<br/>\n&gt; the refrigerator that no one is eating. We have Dove chocolates in a<br/>\n&gt; bowl that I bought several weeks ago. (At one time I was certain if I<br/>\n&gt; had chocolate in the house that *I* would eat it all. But once I gave<br/>\n&gt; myself permission to eat as much as I wanted, to go out and buy more<br/>\n&gt; if I ran out, though I did eat more at the beginning, I now have<br/>\n&gt; only one small piece 4 or 5 times a week.)<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Fear and Food (VERY VERY LONG)","postDate":"1152803546","msgId":15705,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQxQ0NFOTZCLTgyNzYtNDc0NC1CRjQ3LTkwQTYxNjZBMUQ0RUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDYwNzExMjAzODQ2LjQwNTEwLnFtYWlsQHdlYjMyNjA1Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDIwMDYwNzExMjAzODQ2LjQwNTEwLnFtYWlsQHdlYjMyNjA1Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":15690,"nextInTopic":15707,"prevInTime":15704,"nextInTime":15706,"topicId":15629,"numMessagesInTopic":0,"msgSnippet":"... I think it s wanting to avoid what they *fear* will happen. Alternate option suggests that there s equal likelihood of the outcomes. People fear that if","messageBody":"<div id=\"ygrps-yiv-266731228\">On Jul 12, 2006, at 5:16 PM, Christe Bruderlin wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I think this is probably true for most of the choices most  <br/>\n&gt; individuals make (not necessarily OMG FEAR!, but wanting to avoid  <br/>\n&gt; the alternate option).<br/>\n<br/>\n </span></blockquote>I think it&#39;s wanting to avoid what they *fear* will happen.  <br/>\n&quot;Alternate option&quot; suggests that there&#39;s equal likelihood of the  <br/>\noutcomes.<br/>\n<br/>\nPeople fear that if they don&#39;t control how much candy their children  <br/>\neat, then their children will eat nothing but candy.<br/>\n<br/>\nHow do they know that outcome is possible?<br/>\n<br/>\nThey don&#39;t. There are no studies on children with free access to  <br/>\nfood, growing up in mindful homes that has shown that to be true. But  <br/>\nthey fear it&#39;s true. And, so, better safe than sorry.<br/>\n<br/>\nSome people try letting go of controls and usually their kids go wild  <br/>\nfor what was controlled, which supports their theory that their kids  <br/>\naren&#39;t like the kids of parents who don&#39;t need to control. So the  <br/>\ncontrols are returns and the kids know -- from experience now -- that  <br/>\nif the controls are lifted, it&#39;s only temporary and they need to cram  <br/>\nin as much as they can while they&#39;re gone.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Anyway, the problem I struggle with is that I fairly strongly  <br/>\n&gt; disagree with the majority of people on these boards who say they  <br/>\n&gt; don&#39;t limit foods and that their kids make great choices when I  <br/>\n&gt; read the list of choices.<br/>\n<br/>\n </span></blockquote>Not every choice is nutritious but overall, the choices balance out.  <br/>\nWhat most people fear is that kids will *only* eat nonnutritious  <br/>\nfoods unless the parent controls those foods. That isn&#39;t true.<br/>\n<br/>\nWill kids want to try snack foods they&#39;ve heard about or see? Sure!  <br/>\nWill kids (and adults!) like some foods that aren&#39;t nutritious? Yes,  <br/>\nof course. But will kids shun nutritious foods and eat only  <br/>\nnonnutritious foods? No.<br/>\n<br/>\n  Unrestricted access doesn&#39;t end up looking like organic vegan diets  <br/>\n(for most kids!) any more than unschooling looks like kids doing  <br/>\nschool at home without mom making them ;-) But it also doesn&#39;t look  <br/>\nlike most schooled kids&#39; diets that are heavily weighted with  <br/>\nconvenience foods either. It looks like nutritious food mixed with  <br/>\nsome snacks.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; that I won&#39;t supply based on safety that could feasibly make them  <br/>\n&gt; want the given item more<br/>\n<br/>\n </span></blockquote>What do you mean by want the item more? (Let&#39;s not talk about  <br/>\ncigarettes, just food.) Do you mean addictive?<br/>\n<br/>\nWhat do you mean by &quot;feasibly*? As in there are cases where that has  <br/>\nhappened? Are there studies that show children *raised with  <br/>\nunrestricted food choice* whose diets skew towards one particular  <br/>\nfood because the food itself has created a craving? If there are no  <br/>\nstudies, then it isn&#39;t &quot;feasible&quot;, it&#39;s a fear.<br/>\n<br/>\nWe have kids who aren&#39;t showing signs of being addicted to a  <br/>\nparticular food. If you can look beyond the fact that they are  <br/>\nchoosing -- in *addition to nutritious food -- foods you wouldn&#39;t  <br/>\nserve, they aren&#39;t scarfing down endless bags of chips and Oreos,  <br/>\ndrinking gallons of Coke, hoarding candy. In addition to a variety*  <br/>\nof nutritious food, they&#39;re eating an eclectic collection of  <br/>\nnonnutritious food, not gravitating towards one type which is what  <br/>\n&quot;make them want the given item more&quot; implies.<br/>\n<br/>\n(*Variety within their personal preferences for food. My daughter ate  <br/>\nfew foods between 4 and 11 but still didn&#39;t concentrate on any one  <br/>\ntype of snack food.)<br/>\n<br/>\nWe have children who -- while they aren&#39;t eating nothing but whole  <br/>\ngrains and unrefined sweets -- are not skewing towards foods that you  <br/>\nsay will &quot;make&quot; them want more. They are not showing signs of  <br/>\naddictive behavior.<br/>\n<br/>\nWe have a collection of chips that come with sandwiches piling up on  <br/>\nthe refrigerator that no one is eating. We have Dove chocolates in a  <br/>\nbowl that I bought several weeks ago. (At one time I was certain if I  <br/>\nhad chocolate in the house that *I* would eat it all. But once I gave  <br/>\nmyself permission to eat as much as I wanted, to go out and buy more  <br/>\nif I ran out, though I did  eat more at the beginning, I now have  <br/>\nonly one small piece 4 or 5 times a week.)<br/>\n<br/>\nWhy does your conclusion that kids will eat an excessive amount of  <br/>\nsome addictive food not match what is happening in our families?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Could the same line of reasoning apply to food choices (e.g. after  <br/>\n&gt; years of exposure, the food choice could lead to heart disease and  <br/>\n&gt; cancer)?<br/>\n<br/>\n </span></blockquote>The connection between smoking and cancer is pretty clear. The  <br/>\nconnection between foods and cancer is  less clear.<br/>\n<br/>\nIt&#39;s just my gut feeling from seeing the &quot;latest studies&quot; come and go  <br/>\nover the last 40+ years that the body is pretty adaptable. A bag of  <br/>\nchips won&#39;t hurt anyone. (Barring allergies of course.) Even several  <br/>\ndozen bags of chips won&#39;t. I suspect that for some people who are  <br/>\nprone to cancer, if their diet is heavily laden with &quot;junk&quot; food,  <br/>\nthat their risk of cancer goes up. That&#39;s a far cry from a belief  <br/>\nthat eating any amount of certain foods will greatly increase the  <br/>\nrisk of cancer. It&#39;s a far cry from a belief that eating nothing but  <br/>\nfood of a certain type (organic, raw, vegan, wheat free or whatever)  <br/>\nwill greatly reduce the risk of cancer.<br/>\n<br/>\nModeration is key, I believe. And when given unrestricted access to  <br/>\nfood, kids, overall, eat what they want and what they want is what  <br/>\nwould look like moderation (without denying themselves what they want.)<br/>\n<br/>\nThat&#39;s just speculation. What *is* very likely to happen is that when  <br/>\nyour kids are out of your sight, when they see other kids -- kids who  <br/>\nare not dropping dead, adults who appear perfectly healthy --  <br/>\nenjoying the foods that you forbid, they&#39;re going to want them.. They  <br/>\nmay feel guilty for wanting and guilt is definitely not good for  <br/>\nhealth. They may sneak and when nothing bad happens, they&#39;ll want not  <br/>\nonly more but the freedom to want more. And their trust in what you  <br/>\nsay will go down.<br/>\n<br/>\nThink about your favorite genre of movie or book. What if your  <br/>\nhusband had read that those genres would shorten your lifespan and he  <br/>\nwanted you to stop. How could he get you to stop *and* maintain a  <br/>\ngood relationship with you? That scenario seems ridiculous, but when  <br/>\nwe&#39;re imposing our beliefs -- no matter how certain we are of our  <br/>\nbeliefs -- on someone else, it feels exactly like that.<br/>\n<br/>\nIf the danger is imminent and our kids aren&#39;t aware of it, our kids  <br/>\n-- all people in fact! -- would want someone to interfere! If the  <br/>\ndanger is not imminent kids -- and other people -- want others to  <br/>\ntrust their explorations. That doesn&#39;t mean we shouldn&#39;t share what  <br/>\nwe understand with them. But the more adamantly certain we&#39;re right  <br/>\nand most of their friends are wrong, the more pressure we put on them  <br/>\nto not venture beyond what we believe to be right, the greater the  <br/>\nwall we erect between ourselves and them.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":257390633,"authorName":"Maisha Khalfani","from":"&quot;Maisha Khalfani&quot; &lt;earthspirit393@...&gt;","profile":"earthspirit393","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Fear and Food (VERY VERY LONG)","postDate":"1152747848","msgId":15690,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExMC1EQVYxNkZBODlEOTk3RTYxQUQwNzBERDcxOTk2OTBAcGh4LmdibD4=","referencesHeader":"PGU5M2pjOCtpbnJsQGVHcm91cHMuY29tPg=="},"prevInTopic":15677,"nextInTopic":15705,"prevInTime":15689,"nextInTime":15691,"topicId":15629,"numMessagesInTopic":0,"msgSnippet":"***My dh grew up as the youngest of 4 boys, who were several years older and always (as he remembers it) hogging all the food. He remembers that he never got","messageBody":"<div id=\"ygrps-yiv-971487371\">***My dh grew up as the youngest of 4 boys, who were several years <br/>\nolder and always (as he remembers it) hogging all the food. He <br/>\nremembers that he never got &quot;enough&quot; (they harrassed him in other <br/>\nways as well). To this day, he STILL eats as if there isn&#39;t <br/>\nenough, or someone is going to eat it all, or there won&#39;t be any <br/>\nleftovers (and we&#39;ve talked about this lots, he&#39;s very aware of <br/>\nit). I almost ALWAYS make extra, partially so it appears that <br/>\nthere&#39;s plenty in his eyes, but I also like leftovers (less <br/>\ncooking!).***<br/>\n<br/>\nJann, that&#39;s how my dh grew up too.  At times there was no food in his house.  And even as an adult he is always keeping tabs on the food.  He gets mad when something is &quot;all gone&quot;.  I have to explain to him that it&#39;s just food and we can go to the store to get more.  I want to create a home where food is not an issue and a worry.  This group is helping me with that.<br/>\n<br/>\nMaisha Khalfani<br/>\nKhalfani Family Adventures<br/>\nhttp://khalfanifamilyadventures.blogspot.com&lt;http://khalfanifamilyadventures.blogspot.com/&gt;<br/>\nEarthSpirit Readings<br/>\nhttp://www.geocities.com/maitai373/EarthSpirit.html&lt;http://www.geocities.com/maitai373/EarthSpirit.html&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":213809267,"authorName":"jlh44music","from":"&quot;jlh44music&quot; &lt;jlh44music@...&gt;","profile":"jlh44music","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Fear and Food (VERY VERY LONG)","postDate":"1152733384","msgId":15677,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU5M2pjOCtpbnJsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU5M2ZzditsdDNnQGVHcm91cHMuY29tPg=="},"prevInTopic":15676,"nextInTopic":15690,"prevInTime":15676,"nextInTime":15678,"topicId":15629,"numMessagesInTopic":0,"msgSnippet":"... them ALL MYSELF.  No brothers & sisters to share with.  I really do believe that what seems scarce is what we want more of.  If we feel like we can never","messageBody":"<div id=\"ygrps-yiv-835507238\">&lt;unschooling1@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Once I was able to, I would buy bags of chips so that I could eat <br/>\n </span></blockquote>them ALL MYSELF.  No brothers & sisters to share with.  I really do <br/>\nbelieve that what seems scarce is what we want more of.  If we feel <br/>\nlike we can never have as much of something as we really want, we <br/>\nwill at some point go overboard with whatever it is&gt;&gt;&gt;&gt;<br/>\n<br/>\nI can imagine how DELICIOUS that must have felt to be able to have <br/>\nsomething all to yourself!   I only have 2 younger brothers, both <br/>\npicky eaters, so it wasn&#39;t too much of a problem, I like most <br/>\neverything!<br/>\n<br/>\nMy dh grew up as the youngest of 4 boys, who were several years <br/>\nolder and always (as he remembers it) hogging all the food.   He <br/>\nremembers that he never got &quot;enough&quot; (they harrassed him in other <br/>\nways as well).   To this day, he STILL eats as if there isn&#39;t <br/>\nenough, or someone is going to eat it all, or there won&#39;t be any <br/>\nleftovers (and we&#39;ve talked about this lots, he&#39;s very aware of <br/>\nit).   I almost ALWAYS make extra, partially so it appears that <br/>\nthere&#39;s plenty in his eyes, but I also like leftovers (less <br/>\ncooking!).<br/>\n<br/>\nDanielle, on the other hand, eats when she&#39;s hungry, stops when <br/>\nshe&#39;s full (even if there&#39;s some left on her plate!  GASP!) and <br/>\nknows she can have whatever she wants whenever.   Even before I <br/>\nfound unschooling a few years ago, when she was born almost 14 yrs <br/>\nago I vowed I would not have food battles with her (I grew up like <br/>\nmany of you being lectured etc about cleaning your plate, starving <br/>\nchildren in &quot;whatever country&quot;, etc etc).   I like most everything, <br/>\nshe&#39;s a little more discriminating (we don&#39;t use the word picky, <br/>\nnever have, she &quot;knows&quot; what she likes and doesn&#39;t like).  I offer <br/>\ndifferent foods, but it&#39;s her choice.    If she said she didn&#39;t like <br/>\nit, I asked if she&#39;d tasted it, well, NO, I suggested that in order <br/>\nto actually SAY she doesn&#39;t like something (flavor, texture etc) she <br/>\nmight want to consider even just putting her tongue on it to see.   <br/>\nSometimes, she WOULD like the taste, and try it, other times no.  Or <br/>\nshe didn&#39;t even want to do that, which was fine too.   I always <br/>\nthought about what she ate over the course of a week if I was <br/>\nconcerned she wasn&#39;t eating &quot;healthy&quot; or well balanced, not per <br/>\nday.  We&#39;re not big on having dessert after every meal, usually have <br/>\ncookies or ice cream in the house, didn&#39;t withhold &quot;treats&quot; or <br/>\nsweets unless the &quot;regular&quot; food was completely gone.   Often <br/>\nsomething desserty (sweets, or fruit) is desired later on, not <br/>\nusually right after the meal.   Even if she had the sweet food, a <br/>\nwhile later she was just as likely to ask for a pickle, or a carrot.<br/>\nJann</div>","specialLinks":[]},{"userId":145246818,"authorName":"Christy Mahoney","from":"&quot;Christy Mahoney&quot; &lt;unschooling1@...&gt;","profile":"unschooling1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Fear and Food (VERY VERY LONG)","postDate":"1152729823","msgId":15676,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU5M2ZzditsdDNnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU5MzY3YythM3Z2QGVHcm91cHMuY29tPg=="},"prevInTopic":15670,"nextInTopic":15677,"prevInTime":15675,"nextInTime":15677,"topicId":15629,"numMessagesInTopic":0,"msgSnippet":"That story of the girl at the house with candy canes reminded me of something I hadn t thought of in a long time.  When I was a teenager, I used to babysit a","messageBody":"<div id=\"ygrps-yiv-1622640631\">That story of the girl at the house with candy canes reminded me of <br/>\nsomething I hadn&#39;t thought of in a long time.  When I was a <br/>\nteenager, I used to babysit a lot.  There was this one family that <br/>\nalways had loads of candy & chips in the house, and the kids didn&#39;t <br/>\ncare about them at all because they were used to it.  I used to wait <br/>\nuntil the kids were asleep and then I would eat lots of stuff even <br/>\nwhen I wasn&#39;t hungry because it was stuff that we didn&#39;t have at our <br/>\nhouse.  And I didn&#39;t even grow up in a house where things were <br/>\nrestricted for being &quot;bad&quot;.  My mom was a great cook and baked <br/>\nreally yummy cookies & pies, but we were a family of 8.  We usually <br/>\ndidn&#39;t have store-bought cookies or chips because it was expensive.  <br/>\nA lot of my friends thought I was SO lucky to have homemade cookies <br/>\naround all the time, but I used to think Oreos were cool because we <br/>\nnever had them.  <br/>\n<br/>\nOnce I was able to, I would buy bags of chips so that I could eat <br/>\nthem ALL MYSELF.  No brothers & sisters to share with.  I really do <br/>\nbelieve that what seems scarce is what we want more of.  If we feel <br/>\nlike we can never have as much of something as we really want, we <br/>\nwill at some point go overboard with whatever it is.  <br/>\n<br/>\n-Christy<br/>\n<br/>\n*BTW my daughter will also save lemon & orange candies for me <br/>\nbecause she knows I like those flavors.  Whenever she has a rocket <br/>\npop, she never fails to offer me a bite of the middle lemon-flavored <br/>\npart.  She likes it too, but she doesn&#39;t feel like she has to hoard <br/>\nit in case she can&#39;t have one again for a long time.  There&#39;s a <br/>\nwhole box in the freezer.  On really hot days, she&#39;ll sometimes have <br/>\nseveral popsicles, but other days she doesn&#39;t even think about them.</div>","specialLinks":[]},{"userId":141440271,"authorName":"drusila00","from":"&quot;drusila00&quot; &lt;drusila00@...&gt;","profile":"drusila00","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Fear and Food (VERY VERY LONG)","postDate":"1152722826","msgId":15670,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU5MzkyYStpYXZhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU5MzY3YythM3Z2QGVHcm91cHMuY29tPg=="},"prevInTopic":15669,"nextInTopic":15676,"prevInTime":15669,"nextInTime":15671,"topicId":15629,"numMessagesInTopic":0,"msgSnippet":"Previously in our family we had the sweets after substance rule because I (being a dufas lol) believed that because *I* had a problem with sugar imballance","messageBody":"<div id=\"ygrps-yiv-2087499240\">Previously in our family we had the &quot;sweets after substance&quot; rule <br/>\nbecause I (being a dufas lol) believed that because *I* had a problem <br/>\nwith sugar imballance that that is how it should be with food (gee <br/>\nthanks mom)<br/>\n<br/>\n Anyway, my husband and son hate most vegies. serruously they have <br/>\nsome kind of gross gag reflex when eating just about anything green. <br/>\nEven as a small baby I would feed my son pured vegies and he would gag <br/>\nthem and spit up without swallowing. My husband and son both LOVE <br/>\nmeat, I am not real fond of meat- I eat chicken or fish (the guys HATE <br/>\nfish) when I do eat meat- we have alot of meals with chicken in them, <br/>\nor turkey. My husband and son Both LOVE starches and sugar and could <br/>\neat starch and sugar all day long. I need somthing more ballanced when <br/>\nI eat I need ballance- obviously they do not.<br/>\n<br/>\n When I dropped the limit we had about substance before sweets my son <br/>\nate more sweets but he also eats other things too. I don&#39;t know that <br/>\nthe previous limits caused him to eat more sweets, I just think he is <br/>\n*a LOT* like his father and less like me in this way.<br/>\n <br/>\nI suppose my point is that I am realizing that my dietary needs are <br/>\nvastly difernet from the other 2 members of my family. I still look at <br/>\nwhat they eat and think &quot;gee how can they not feel like shit?&quot; but I <br/>\nget over it heh, if they felt like shit they wouldnt be eating that <br/>\nway.  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Mary Hickman&quot; <br/>\n&lt;mfhickman@...&gt; wrote:<br/>\n We eat a wide variety of <br/>\n<blockquote><span title=\"qreply\"> &gt; foods and we exercise regularly which I think is very important. I <br/>\n&gt; was a mom who was afraid of the bad foods. I no longer am. I am <br/>\n&gt; aware of what my world has to offer and I help myself and children <br/>\n&gt; be safe and joyful in this world of strange chemicals.<br/>\n&gt; <br/>\n&gt; Mary<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":202023256,"authorName":"Mary Hickman","from":"&quot;Mary Hickman&quot; &lt;mfhickman@...&gt;","profile":"maryhickman517","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Fear and Food (VERY VERY LONG)","postDate":"1152719916","msgId":15669,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU5MzY3YythM3Z2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU5MXUzNytubHRnQGVHcm91cHMuY29tPg=="},"prevInTopic":15653,"nextInTopic":15670,"prevInTime":15668,"nextInTime":15670,"topicId":15629,"numMessagesInTopic":0,"msgSnippet":"Hi, I m hearing what you have to say. You have done research and have developed strong opinions about healthful eating. I want to ask you how old your kids","messageBody":"<div id=\"ygrps-yiv-200565366\">Hi,<br/>\n<br/>\nI&#39;m hearing what you have to say. You have done research and have <br/>\ndeveloped strong opinions about healthful eating. I want to ask you <br/>\nhow old your kids are? Things change very much when children start <br/>\nfrequenting others homes.<br/>\n<br/>\nHere is a story from a few years ago. 3 kids playing at 1 girls <br/>\nhome. The girl who lived there was never controlled with sweets and <br/>\nshe and her sister had tons of candy from various things and a huge <br/>\ncollection of candy canes. 1 of the girls came from a home whose mom <br/>\nhad done tons of research about food, and every bite was considered <br/>\nonly healthy. Raw sugar if any, honey, whole wheat, lots of various <br/>\ngrains fruits, vegies, tofu. All really good stuff, but healthful <br/>\neating was the mom&#39;s main focus at this point. So the 3 girls are <br/>\nplaying and the girl who lives in the healthful eating house only <br/>\nwants to eat candy canes. And after asks the host for cookies, and <br/>\nthen eats more candy canes. The entire time this little 6 year old <br/>\nwas over was spent focused on eating the forbidden. At least what <br/>\nher mom had told her was so bad for her.<br/>\n<br/>\nI also want to warn you that feeling good because your kids make <br/>\ngood to you choices sets you up to feel bad when they don&#39;t. So your <br/>\ndd eating only a little cake just means she knows her body and that <br/>\nis the goal. As does my dd who will eat a huge slice of cake she <br/>\nbaked for her dad with joy together, Neither is better or worse. <br/>\nthey know what they like.<br/>\n<br/>\nOne last thought. My dd (6) was given 3 starbursts the other day at <br/>\nFriday Fun Day swimming. She has never had food limits. She came up <br/>\nto me and said I&#39;m going to give this one to Riley, he loves orange. <br/>\nShe ate 2 on the ride home and gave her 9 year old brother the 3rd. <br/>\nNot sure how this would have worked if candy was only on special <br/>\nparty days and she got her 3, would she have eaten them all herself? <br/>\n<br/>\nI hear you about the vast array of easy to grab unnatural food <br/>\nproducts out there. We try them, we talk about them, we discuss what <br/>\nwe like, we don&#39;t forbid things at all. We eat a wide variety of <br/>\nfoods and we exercise regularly which I think is very important. I <br/>\nwas a mom who was afraid of the bad foods. I no longer am. I am <br/>\naware of what my world has to offer and I help myself and children <br/>\nbe safe and joyful in this world of strange chemicals.<br/>\n<br/>\nMary</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Re: Fear and Food (VERY VERY LONG)","postDate":"1152704769","msgId":15653,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDODczQkZFNzExREU0My1CNjAtMkFFMUBtYmxrLXIxNC5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PGU5MXUzNytubHRnQGVHcm91cHMuY29tPg=="},"prevInTopic":15652,"nextInTopic":15669,"prevInTime":15652,"nextInTime":15654,"topicId":15629,"numMessagesInTopic":0,"msgSnippet":"... From: techwritercsbn@yahoo.com Perhaps I will never be convinced and that is okay, but I d love to hear more ideas from people who embrace as much of RU as","messageBody":"<div id=\"ygrps-yiv-62320023\">-----Original Message-----<br/>\n From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:techwritercsbn@...\">techwritercsbn@...</a><br/>\n<br/>\n Perhaps I<br/>\n will never be convinced and that is okay, but I&#39;d love to hear more<br/>\n ideas from people who embrace as much of RU as they can, and find ways<br/>\n to make certain household limitations regarding food peaceful, joyful,<br/>\n and so on.<br/>\n<br/>\n -=-=-=-=-<br/>\n<br/>\n  I think the biggest difference to me is in how we approach it. You can <br/>\n*know* that some foods are &quot;good&quot; and some are &quot;bad&#39;---but it&#39;s the way <br/>\nyour ideas are forced onto someone else.<br/>\n<br/>\n  If your kids know how you feel (and even think so too), but chose <br/>\nanother path, what will be your reaction?<br/>\n<br/>\n  And a beer and a cigarette AND McNuggets and a Coke enjoyed in *peace* <br/>\nare better---emotionally. spiritually, psychologically, <br/>\nphysically---than tofu and a salad eaten in shame or under duress.<br/>\n<br/>\n  The damage to your relationship with your kids is more important than <br/>\nwhether they snarf a HoHo one afternoon.<br/>\n<br/>\n  You may present your ideas so rationally and so passionately that your <br/>\nkids latch on and never let you of your ideas on food. BUT what if they <br/>\ndon&#39;t? Now or in the future? You can&#39;t control what they eat forever. <br/>\nIf they choose to be McEaters, how will that effect you?<br/>\n<br/>\n  I remember when Ben and I first started dating, there was an article <br/>\ninSports Illustrated about a kid who had never eaten a big Mac (that <br/>\nseemed to be the focus of the article in a strange way). Dad had <br/>\nplanned on raising the next Heisman trophy winner. He was given a <br/>\nfootball in the crib. He academics were controlled by dad (although he <br/>\nwas in public school. His daily exercise---from the time he could walk <br/>\nwas controlled by dad. What he ate was controlled---every bite because <br/>\nan athlete must be pure. No artificial crap for this child! No beer, no <br/>\ncigarettes, no Coke, No Big Macs.<br/>\n<br/>\n  So he goes to college. That was what they story was about---how this <br/>\n&quot;pure&quot; athlete was going to fare in college and be the next superstar.<br/>\n<br/>\n I asked Ben about him not too long ago &#39;cause that story stuck with me.<br/>\n<br/>\n Kid&#39;s in prison. Never finished college.<br/>\n<br/>\n  If the dad had spent half as much time investing in his relationship <br/>\nwith this child instead of worrying about all the *outside* stuff, who <br/>\nknows?<br/>\n<br/>\n  I think the bigger issue is how the child perceives what you&#39;re <br/>\nlimiting and how those limitations you&#39;re imposing will alter your <br/>\nrelationship.<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\n Kelly Lovejoy<br/>\n Conference Coordinator<br/>\n Live and Learn Unschooling Conference<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a><br/>\n<br/>\n  School&#39;s goal is to prepare them to be anything they want. But the <br/>\nprocess is so dullifying and kids haven&#39;t explored the possibilities of <br/>\nwhat they could be that many set their sites as low as possible. They <br/>\ngo to college to get a job to buy stuff. ~Joyce Fetteroll<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nCheck out AOL.com today. Breaking news, video search, pictures, email <br/>\nand IM. All on demand. Always Free.</div>","specialLinks":[]},{"userId":187549037,"authorName":"techwritercsbn","from":"&quot;techwritercsbn&quot; &lt;techwritercsbn@...&gt;","profile":"techwritercsbn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Fear and Food (VERY VERY LONG)","postDate":"1152678823","msgId":15652,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU5MXUzNytubHRnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY4NWIyZjIwNjA3MTExNjIydzRmZDA0MTQweTJhNzMyMWI3NjM3NzM4ZmJAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":15631,"nextInTopic":15653,"prevInTime":15651,"nextInTime":15653,"topicId":15629,"numMessagesInTopic":0,"msgSnippet":"... I have too, and it is really challenging.  I m nowhere close in my own life.  I try to remove value judgments with food and even more extreme things","messageBody":"<div id=\"ygrps-yiv-1521207561\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Michelle/Melbriga&quot;<br/>\n&lt;pamperedmichelle@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n&gt; I&#39;ve been trying very hard over the past year to quit categorizing<br/>\n&gt; food into &quot;good and bad&quot; or thinking in terms of &quot;good choices and<br/>\n&gt; poor choices&quot; when it comes to food.<br/>\n<br/>\n </span></blockquote>I have too, and it is really challenging.  I&#39;m nowhere close in my own<br/>\nlife.  I try to remove value judgments with food and even more extreme<br/>\nthings (philosophically, is choosing to drive sober vs. drunk &quot;good&quot; vs.<br/>\n&quot;bad?&quot; for example).   However, I keep coming back to the fact that some<br/>\nthings humans ingest are very, very good for the body, and some things<br/>\nare not.   Maybe someday I&#39;ll be past making value judgments on every<br/>\ndecision I make (though how will I ever decide then?  :)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I still think it is fear.<br/>\n<br/>\n </span></blockquote>I can see where you are coming from, but I could argue that every choice<br/>\nis based on fear.  For example, the choice never to limit food could be<br/>\nbased on fear -- fear that one&#39;s children will sneak and thus become all<br/>\nthe things you mentioned (obese, etc.) , or fear that they will be<br/>\nemotionally/mentally/spiritually damaged by certain limits or whatever.<br/>\nEven if you then responded that  it was actually based on your belief in<br/>\nmindful RU, gentle parenting, etc., I could turn it around and say, &quot;I<br/>\nstill think it is fear,&quot; but would that make it true?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What drives my mother up the wall is that they have eaten this food in<br/>\n </span></blockquote>little spurts and bits rather than sitting down for *meals.*<br/>\n<br/>\nYes, my husband had a bit of trouble with this, too (mealtimes were<br/>\nforced and generally miserable at his house on many occasions -- and yet<br/>\nhe wanted to carry the tradition on.  Oh, the intricacies of the human<br/>\npsyche!).  We still have mealtimes, but the kids also eat whenever they<br/>\nwant and I figure it is my job to make time together at the table a<br/>\npleasant and fun time to reconnect -- whether they want to eat or not. <br/>\nBecause of RU and the comments on these boards, I no longer force the<br/>\nissue and they can come to the table if they choose.  I&#39;ve never had<br/>\nconcerns about amounts (e.g. &quot;clean your plate&quot; or &quot;have 3 more bites,&quot;<br/>\netc.).  I just have never seen the value of forcing someone to eat when<br/>\nthey aren&#39;t hungry or forbidding them to eat when they are.  I have<br/>\nalways had them try one bite, but I&#39;ve moved away from that and have<br/>\ninstead explained that sometimes new foods take several tries to like,<br/>\netc., and with that simple explanation, they are willing to continue<br/>\ntrying new things.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Ah, BUT have you known UNSCHOOLED individuals who have not had food<br/>\n&gt; restrictions.<br/>\n<br/>\n </span></blockquote>Yes, in person and online although I admit not very well (e.g. park<br/>\ndays, via individual discussion and lots of reading on this and other<br/>\nlists about the choices RU children are making).  In all but one case I<br/>\nhave known of, we would not stock our kitchens similarly *at all* and<br/>\nthat is part of what has always concerned me about fully embracing RU. <br/>\nI admit I am fairly &quot;radical&quot; when it comes to nutrition.  I&#39;d be as<br/>\nlikely to take my kids to a bar for a beer and a smoke as I would to<br/>\nMcD&#39;s for McNuggets and a Coke (I feel a bad country song coming on<br/>\nLOLOL).  But in all seriousness, I see these as pretty much equal<br/>\nchoices from a health standpoint, which makes me quite radical, I know.<br/>\n<br/>\nI really appreciate your input, and I get the points you and others are<br/>\nmaking.  I really do.  I also enjoy you and others sharing how your<br/>\nfamilies eat, even if it makes me feel more convinced I&#39;m way outside<br/>\nthe norm.   I think the points you and many others have made are good<br/>\nwith regards to forbidden fruit, etc., which is why I&#39;ve struggled with<br/>\nthese things so much.  I&#39;d like to be convinced.  Life would be so much<br/>\neasier.  The problem is, I&#39;m still very far from convinced.  Perhaps I<br/>\nwill never be convinced and that is okay, but  I&#39;d love to hear more<br/>\nideas from people who embrace as much of RU as they can, and find ways<br/>\nto make certain household limitations regarding food peaceful, joyful,<br/>\nand so on.<br/>\n<br/>\nMake sense?<br/>\n<br/>\nThanks again, Michelle!<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":212934673,"authorName":"Michelle/Melbriga","from":"&quot;=?ISO-8859-1?Q?Michelle/Melbrig=F0a?=&quot; &lt;pamperedmichelle@...&gt;","profile":"scrapgal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] Fear and Food (VERY VERY LONG)","postDate":"1152660179","msgId":15631,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NWIyZjIwNjA3MTExNjIydzRmZDA0MTQweTJhNzMyMWI3NjM3NzM4ZmJAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDIwMDYwNzExMjAzODQ2LjQwNTEwLnFtYWlsQHdlYjMyNjA1Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDIwMDYwNzExMjAzODQ2LjQwNTEwLnFtYWlsQHdlYjMyNjA1Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":15629,"nextInTopic":15652,"prevInTime":15630,"nextInTime":15632,"topicId":15629,"numMessagesInTopic":0,"msgSnippet":"... I ve been trying very hard over the past year to quit categorizing food into good and bad or thinking in terms of good choices and poor choices when it","messageBody":"<div id=\"ygrps-yiv-72112076\">On 7/11/06, Christe Bruderlin &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:techwritercsbn@...\">techwritercsbn@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Hi RU Food Readers/Writers,<br/>\n&gt; as I know we each have our own beliefs about what is &quot;healthy&quot; or &quot;junk food&quot; -- or perhaps a strong distaste for the categorizing of foods into &quot;good&quot; or &quot;bad&quot; terminology.<br/>\n<br/>\n </span></blockquote>I&#39;ve been trying very hard over the past year to quit categorizing<br/>\nfood into &quot;good and bad&quot; or thinking in terms of &quot;good choices and<br/>\npoor choices&quot; when it comes to food.  This is a little hard for me as<br/>\nI am prone to gallstones when I eat too much cholesterol rich foods,<br/>\nso lately I have had to categorize some foods *for me* but also trying<br/>\nnot to let that slip over to the kids either.  I don&#39;t want the kids<br/>\nto think of food in terms of &quot;good and bad&quot; but let them experience<br/>\nfood and have control over it.  To be able to listen to their bodies<br/>\nand hear their bodies ask for certain foods and be able to meet that<br/>\n*and* to recognize such cues as hunger and full.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; First, on FEAR:<br/>\n&gt; I&#39;ve noticed pretty consistently that the majority of comments directed to parents who control/limit diet have been that their thoughts are based on &quot;fear&quot;.  While this might be true in some cases, the comments of many writers might also be based on fact.<br/>\n<br/>\n </span></blockquote>I still think it is fear.  Fearful that their children will become<br/>\nobese, unhealthy, diabetic, etc.  Yes; the facts are out there that<br/>\neating a well-balanced diet is better for you.  But I find that my<br/>\nchildren&#39;s choices tend to be fairly balanced.  Today they have eaten<br/>\nfruits, vegetables, rice, a bagel, some cheese, and for dinner we are<br/>\nhaving a nice vegetarian stir fry (with tofu).  I see this as fairly<br/>\nbalanced. There may be a bowl of ice cream in there somewhere if<br/>\nsomeone gets the urge or someone may decide to make a crumb cake or<br/>\nbatch of brownies.  But all in all balanced.  What drives my mother up<br/>\nthe wall is that they have eaten this food in little spurts and bits<br/>\nrather than sitting down for *meals.*  My mom kept my younger two a<br/>\nfew weeks ago while the three of us went out of town and when I came<br/>\nhome my mom bragged that the kids had had 3 *meals* and 2 snacks and<br/>\nthat was it.  Later they said, &quot;Grandmother wouldn&#39;t let us eat when<br/>\nwe were hungry!  For the next few days I think that they ate more food<br/>\nthan they normally would have to get back to their &quot;safe spot&quot; where<br/>\nfood is concerned.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Now, on children (or adults!) LEARNING OR KNOWING WHAT IS BEST FOR THEIR BODIES.  I know many, many unhealthy people (anecdotal, so of course doesn&#39;t entirely count) that had NO restrictions whatsoever on what they ate.  Most individuals who have not had food restrictions still do not make ideal or close-to-ideal health choices.<br/>\n<br/>\n </span></blockquote>Ah, BUT have you known UNSCHOOLED individuals who have not had food<br/>\nrestrictions.  Unschooling food does not mean filling your house with<br/>\njunk food only.  It means providing a choice of foods and not making<br/>\nchocolate brownies the forbidden fruit.  I would hazard to guess that<br/>\nmost individuals that have had &quot;no food restrictions&quot; actually did<br/>\nhave food restrictions as they were restricted from making choices<br/>\nthat included food from the full spectrum.  Fruits, veggies, lean<br/>\nmeats, cheese, yogurt, breads, candy, ice cream, cake, chips, etc.<br/>\nTheir limitations were what their parents purchased.<br/>\n<br/>\nI think that my children are learning things such as &quot;when I eat a lot<br/>\nof this food I feel sluggish the rest of the afternoon&quot; or &quot;foods with<br/>\nMSG don&#39;t agree with me so I think I will avoid those foods in lieu of<br/>\nfoods that don&#39;t have it.&quot; I think that they are eating foods that<br/>\ntheir bodies are requesting.  I&#39;ve seen my oldest opening all the<br/>\ncabinets, staring in the pantry, digging through the freezer and when<br/>\nI&#39;ve asked her what she wants she has said, &quot;I need some protein, like<br/>\nchicken.&quot;  Her body is asking for protein and she is trying to find<br/>\nthat protein and knows that chicken will fill this need.  I&#39;ve also<br/>\nseen my son looking for carrots or cucumbers because he wants<br/>\nsomething cold and crunchy.  I&#39;ve been known to jump in the car and<br/>\ndrive up to Whataburger to get a chicken sandwich for my daughter or<br/>\ntromp back into the garden to see if we have any carrots that can be<br/>\npulled or cucumbers ripe for picking.  And I&#39;ve also seen my kids<br/>\nlooking for something to satisfy a sweet tooth.  And helped them find<br/>\nthat as well.<br/>\n<br/>\nSince I have started unschooling myself I have found that I am able to<br/>\nstart trusting myself more with choices.  Today I had a craving for<br/>\nchocolate (I usually do on the first day of my menstrual cycle so I<br/>\ndidn&#39;t find this odd.)  I found one of those &quot;bake in a minute dessert<br/>\nbowl things&quot; in the cabinet and decided to make that.  I had 2 bites<br/>\nof it and realized that it was not what I was looking for.  No one<br/>\nelse was interested in it either.  I had that old momentary panic<br/>\nabout wasting food but then remembered that it wasn&#39;t waste if I ate<br/>\nit when didn&#39;t want it.  I&#39;m trying to trust myself and learn to<br/>\nlisten to my own body.  That is what I want for my children as well.<br/>\nThat they will learn to trust themselves with food and not ignore what<br/>\nit is telling them.<br/>\n<br/>\n-- <br/>\nMichelle<br/>\naka Melbriga<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://eventualknitting.blogspot.com\">http://eventualknitting.blogspot.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MedHS@yahoogroups.com\">MedHS@yahoogroups.com</a> - Homeschooling for the Medieval Recreationist</div>","specialLinks":[]},{"userId":187549037,"authorName":"Christe Bruderlin","from":"Christe Bruderlin &lt;techwritercsbn@...&gt;","profile":"techwritercsbn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fear and Food (VERY VERY LONG)","postDate":"1152650326","msgId":15629,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNzExMjAzODQ2LjQwNTEwLnFtYWlsQHdlYjMyNjA1Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":15631,"prevInTime":15628,"nextInTime":15630,"topicId":15629,"numMessagesInTopic":0,"msgSnippet":"Hi RU Food Readers/Writers, I ve been thinking and reading a lot about food issues forever, but in a new light considering my rapidly evolving RU lifestyle","messageBody":"<div id=\"ygrps-yiv-526218329\">Hi RU Food Readers/Writers,<br/>\n <br/>\nI&#39;ve been thinking and reading a lot about food issues forever, but in a new light considering my rapidly evolving RU lifestyle (it&#39;s not official...yet...:).  I&#39;ve got a long way to go, I know, but there are several issues that continually come up for me.  This is a long one, but I&#39;ve been thinking about it in depth for a while.  (For the record, I&#39;m avoiding most specific food examples purposely so that I don&#39;t inadvertently insult someone who then retorts with, &quot;Hey!  My kid eats XYZ.  Are you saying I&#39;m promoting ill health?&quot; etc.).  I&#39;d love to hear other people&#39;s ideas on this (particularly new ones).  Lots of this is background on my thoughts, but ultimately I am interested in talking about gentle parenting and the ways RU can fit around food rather than specific food choices, as I know we each have our own beliefs about what is &quot;healthy&quot; or &quot;junk food&quot; -- or perhaps a strong distaste for the categorizing of foods into &quot;good&quot; or &quot;bad&quot; terminology.  <br/>\n <br/>\nFirst, on FEAR:<br/>\nI&#39;ve noticed pretty consistently that the majority of comments directed to parents who control/limit diet have been that their thoughts are based on &quot;fear&quot;.  While this might be true in some cases, the comments of many writers might also be based on fact.  There are a lot of everyday things most of us do based on &quot;fear&quot; that don&#39;t really interfere with my personal joy in life.  For example and for the sake of discussion, I&#39;ll first pretend red light behavior is entirely based on fear.  Most of us stop at them most of the time out of &quot;fear&quot; -- whether it be fear of getting a ticket, fear of not doing what&#39;s &quot;right,&quot; fear of a collision or whatever.  But this choice is also based on fact, since if you ignore red lights most of the time, or even far less than most of the time...say even 15% of the time...you will eventually get into an accident or get a ticket or both.  And even if that &quot;fact&quot; was really &quot;fear,&quot; it isn&#39;t really affecting my life in any way.  It is just<br/>\n something I do.  I think the same argument can be made for many individual food choices or the choice to limit access.  Is moderation everything?  Not in every case.  Since learning about RU, I&#39;ve really had to consider the following: Are my personal food choices and those I make with my family based on fear or fact?<br/>\n <br/>\nOn FOOD and FEAR:<br/>\nIt is unfortunate that the American diet has moved in so many directions that what is best for human consumption is unclear to most people in our country.  The current diet that the majority of Americans eat is unlike what many of our ancestors ate before.  Many people are not really sure what is best.  The headlines say one thing and then another days later.  The &quot;4 basic food groups&quot; and the subsequent &quot;food pyramids&quot; are based on political agendas and social norms rather than fact (even the AHA and ADA admit that).  I&#39;m not going to go into my opinions of what to eat or not to eat (though I will say &quot;Eat to Live&quot; is a great scientific resource and easy read as is &quot;Disease Proof Your Child.&quot;  Great info regardless of the choices we make.).  As I have seen written on this board, it is true that humans will grow if they take in calories -- any calories.  They will grow despite whether these calories are high-nutrient or non-nutritive calories, and they might feel energetic<br/>\n for years and years doing so.  Telling them they will not grow is not true.  They will.  <br/>\n <br/>\nHowever, it is a fact that disease development processes are insidious.  Like with cigarettes, the harmful effects of dietary choices might not be apparent for years or decades.  Heart disease (almost entirely lifestyle related) and cancer (many, many proved lifestyle related) are the two biggest human disease killers, and together are responsible for over 90% of disease-related deaths.  Many of these can be prevented - and even reversed - by diet and lifestyle choices.  For example, diet-related heart disease kills more people than smoking-related lung cancer.  Many people quit smoking after learning about lung and other smoking-associated cancers (out of &quot;fear&quot; or &quot;fact&quot;?), but eating is socially acceptable, comfortable, pleasurable, so &quot;moderation&quot; is taught, despite the fact that it might not be best based on information about what certain foods do to our bodies.  Now, is it fear or fact that might motivate someone like me to steer my family toward tough dietary choices<br/>\n based on scientific evidence?  -- not headline news, but combinations of hundreds of studies that have been performed over decades (the books mentioned above reference thousands, but the scientist in me did fact check several of them for accuracy)?  <br/>\n <br/>\nFor me, I&#39;d have to say it is fact.  And for me, raising happy children isn&#39;t just about their mental, emotional and spiritual health (which I think the RU lifestyle is so overwhelmingly great for in so many ways), it is about their physical health as well, which I believe integrates inextricably with overall health and the aforementioned subcategories.  I might not see it now, but feeding my kids non-nutritive foods is practically guaranteeing their poor health later on (unless they happen to have those rare drink-smoke-chew-the-fat genes that makes them invincible to almost everything...but not a gamble I&#39;m willing to take any more than I&#39;m willing to gamble and buy them unlimited cigarettes or let them play in an intersection).  Telling a child the truth of what will happen after years of taking in unhealthy foods is no different than telling a child what will happen if they run into the street or smoke for decades -- there is a chance they will be fine, but there is a<br/>\n much greater chance that they will not.  Its a safety issue to me.<br/>\n <br/>\nNow, on children (or adults!) LEARNING OR KNOWING WHAT IS BEST FOR THEIR BODIES.  I know many, many unhealthy people (anecdotal, so of course doesn&#39;t entirely count) that had NO restrictions whatsoever on what they ate.  Most individuals who have not had food restrictions still do not make ideal or close-to-ideal health choices.  Even with smoking, before the facts were out, people did not &quot;instinctively&quot; know not to smoke.  It was initially just about taste preference, predominantly socially acceptable, and something people either enjoyed or did not.  Is there anything healthy about it?  No, yet many individuals chose to damage the hell out of their bodies anyway though they were never limited on that choice (no one new better than to limit it at first).  We can see this behavior with all addictive substances from caffeine to nicotine to stimulants to depressants to certain foods.  The majority of humans, especially Americans, don&#39;t automatically do what is best for our<br/>\n bodies (as the majority of Americans are now overweight and 40% of Americans are obese).  Americans eat many unnatural foods (as in, food not in its natural form) that likely confuse the body&#39;s normal signaling mechanisms.  Likewise, pleasure is so powerful a drive that its pursuit in the short run can overwhelm what an individual might know or believe is best for themselves at present or in the future.<br/>\n<br/>\nOn FREE WILL and where I am today: I believe that children should have choices as adults do, but within the context of the information they have available to them and their ability to process that information (and I believe sensitive parents are aware of how much their children process regarding complex topics -- trusting their children, yet knowing their experience is limited).  The limitations I place on my children are household-only limits.  We no longer supply the house with low- or no-nutrient foods.  If we go out, they get what they want, and when we stay in, they get what they want within those options (which means me making lots of fruit-only Popsicles and so on).  Now my oldest is still very young (4 in September) so when we go to the store, she picks the fruits and veggies and if she points at something unhealthy and I tell her it isn&#39;t healthy, she is good with that.  On the rare occasions when she isn&#39;t and wants it anyway, I buy it.  Still, when we go to a<br/>\n party, she does look forward to the cake, yet eats very little and chooses lots of fruit, etc. (even though I am the total cheerleader for sweets and all party fun in this context -- e.g. &quot;Yea!  We get to go to a party and see our friends and eat cake and ice-cream and dress up!,&quot; etc.).  I agree totally on not policing kids, but the fact that I limit what is in the house has NOT AT ALL made her a cake-in-the-corner hoarder of sweets, etc. (maybe some will say &quot;not yet&quot; and I guess only time will tell). <br/>\n <br/>\nThis means being EXTREMELY careful to give facts without guilt and to avoid looking at them with judgment when they make a choice I don&#39;t love, etc.  However, all of our children will know our opinions of certain foods either way, just as they know any parent&#39;s opinion of smoking based on the facts shared with them and the parent&#39;s choice to smoke or not to smoke.  My children know I love them -- and always will -- unconditionally despite what choices they make -- even if those are not the choices I might make and even if they know I don&#39;t love a given choice. <br/>\n <br/>\nAt these young ages, I have the opportunity to really shape their tastes and have done so very successfully thus far.  At restaurants, parties and friend&#39;s houses, my children tend to gravitate to the foods served at home -- probably because those are familiar and comfortable (although people find it really weird that my children pick the things they do!  LOL)  I hope their childhood comfort foods will be vastly different than those of myself or my peers (or their peers for that matter -- as the case is thus far).  As they get older, I anticipate that this might become more challenging.  <br/>\n <br/>\nAlso, I haven&#39;t read &quot;Let Them Eat Cake&quot; yet, but it is on the (increasingly long!) list.  Another I&#39;ve heard is good regarding food choices is &quot;The Pleasure Trap,&quot; but I haven&#39;t gotten to it yet, so cannot give an opinion yet.<br/>\n <br/>\nI appreciate this board tremendously for removing the authoritarian &quot;no&quot; from my vocabulary (in most cases :) and for constantly challenging me (albeit indirectly) on my parenting choices.  I&#39;d love to hear feedback, as well as ideas of more ways to help my children learn to avoid dangerous situations (and I believe some food choices fit in the dangerous category) in gentle, non-coercive, loving and joyous ways.  So far, my best technique is trying to keep the house stocked with high-nutrient alternatives and saying lots of &quot;yes! yes! yes!.&quot;  <br/>\n <br/>\nLooking forward to the hole-poking  <br/>\n <br/>\nChriste<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":15703,"nextTopicId":15681}}