{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"UPDATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":150527288,"authorName":"Ren","from":"&quot;Ren&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"four year olds and boundaries","postDate":"1088345971","msgId":1175,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNjI3LjA3MTk0Ni4zODYuMTE5MjI2QHdlYm1haWwxMi5ueWMudW50ZC5jb20+"},"prevInTopic":1171,"nextInTopic":0,"prevInTime":1174,"nextInTime":1176,"topicId":1144,"numMessagesInTopic":0,"msgSnippet":"I guess it comes down to intent.  If I sense the intent is destructive I will pull the reigns.  If the intent is normal curiosity and learning and making","messageBody":"<div id=\"ygrps-yiv-1315445726\">&quot;I guess it comes down to intent.  If I sense the intent is destructive<br/>\nI will pull the reigns.  If the intent is normal curiosity and learning and<br/>\nmaking mistakes it is a different story.&quot;<br/>\n<br/>\nYou&#39;re reading intent into something that probably isn&#39;t there. You may see his intelligence as somewhere near 8, but he&#39;s still 4! If he&#39;s purposely destructive (which I doubt) then it&#39;s time to look at the &quot;why&quot; rather than trying to fix or change his behavior by force.<br/>\nYou won&#39;t teach him the lesson you think.<br/>\nYou&#39;ll teach him that a big person can force themselves on a smaller person and that your needs are more important than his at the moment. He can&#39;t/won&#39;t have empathy for the mess and what you feel about it, by forcing him to do something when he really doesn&#39;t want to.<br/>\nYou&#39;re also teaching him that clean up is drudgery....not the best way to help him find joy in even mundane tasks.<br/>\n<br/>\nWhen I start to feel a nudge of resentment welling up, I look at my dear, sweet children and the activity they are participating in at the moment. I see that the thing they are doing has more value for them, than the clean up and I start doing it usually. I won&#39;t ask for help, if I see they are actively involved in something that interests them...be it television, computer, a book or building legos.<br/>\nIf I catch them at an opportune moment, I&#39;ll say &quot;this playdough mess is everywhere, could you help me get it picked up so I can use the table&quot; or something similar. Usually I get an &quot;OH, I&#39;m sorry Mom, I&#39;ll come help in just a minute&quot;....OR &quot;no, I&#39;m not done with that yet&quot; OR &quot;I&#39;m busy right now, I&#39;ll clean it up in a little bit Ok?&quot;<br/>\nAnd all of those responses are acceptable.<br/>\nIf I really, really care deeply about some clean up thing...I let them know. &quot;Hey, we have company in an hour, I&#39;d really like to get the laundry and dishes taken care of, I need help right away!&quot;<br/>\nThey&#39;re great about it.<br/>\nMy three year old is learning from that which surrounds him. Last night, he mushed a bunch of noodles on the floor. I don&#39;t know if it was an accident or not, I didn&#39;t see what happened although it was right behind me while I was on the computer.<br/>\nWe have a wood floor, so mess doesn&#39;t phase me. I noticed he had grabbed the little dustpan and brush, and was trying to scoop the wet noodles into it. It was mushing them about, and not really doing much good, but he was happy and feeling useful so I left him alone.<br/>\nA minute later, he was watching tv and I finished cleaning up what was left.<br/>\nI think his happiness is FAR more important than any mess.<br/>\nBooks on the floor? That&#39;s easy!:)<br/>\nI certainly would not let my dh&#39;s expectations create unhappiness for my children. We tried that, it&#39;s awful.<br/>\nMy dh is a total NEAT FREAK. But he&#39;s learned that it&#39;s not healthy for the kids. We created an area for him to escape to, that is exactly what HE needs, and the kids get to have a house that isn&#39;t uptight or focused on clean up when they need to make messes.<br/>\nMesses are productive.<br/>\nMesses are for learning.<br/>\nMesses help children be creative.<br/>\nMesses also cause stress for some adults, so those adults should try to remember what is truly more important (learning) and try to be an assistant to their child, rather than a task master. Instead of imparting some &quot;lesson&quot; on clean up, how about a lesson in joy?<br/>\nHow about teaching your child that even when they are curious enough to create a disaster, that you view them as whole and perfect and intelligent, and happily clean up after your little genius?:)<br/>\nIf you knew for a fact that you had the next Einstein, or Picasso...that your child was destined for absolute GREATNESS, would you continue to focus on lessons in clean up, or allow them to explore their genius uninhibited?<br/>\nIf you knew for a fact that your child would be gone from your life forever, next week...or next month, would you focus on lessons in clean up, or focus on living joyfully together?<br/>\nThere is a much bigger picture to look at.<br/>\nWe can step back from our frustrations as parents, and try to see the world through our child&#39;s unique view, realizing that a pile of books, or food on the floor, or any number of messes are all part of the learning process. There is no ill-intent behind their actions, just a small person trying to find their way in this big, wide world.<br/>\nA small person that needs kind, empathetic adults, with joy and curiosity in their hearts, to explore with them.<br/>\n<br/>\nRen<br/>\n<br/>\nLearn about unschooling at:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a></div>","specialLinks":[]},{"userId":779600,"authorName":"KathrynJB@aol.com","from":"KathrynJB@...","profile":"kathrynbeth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:four year olds and boundaries","postDate":"1088342783","msgId":1171,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5LjJkMGQwZmQ5LjJlMTAyNGZmQGFvbC5jb20+"},"prevInTopic":1164,"nextInTopic":1175,"prevInTime":1170,"nextInTime":1172,"topicId":1144,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/27/2004 1:47:20 AM Eastern Standard Time, unschoolingbasics@yahoogroups.com writes: He was involved in an art project when I came","messageBody":"<div id=\"ygrps-yiv-920829440\">In a message dated 6/27/2004 1:47:20 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> writes:<br/>\nHe was<br/>\ninvolved in an art project when I came downstairs to check email.  He was<br/>\nmaking a great card to send to his grandmom.  He came down after awhile and<br/>\nsaid he wanted to do braingame on the computer.  I found a site that<br/>\nsatisfied him and went upstairs.  Lo and behold a beautiful card but when I<br/>\nwent into the tv room I saw that he had taken about thirty board books off<br/>\nthe top shelf of the bookcase and strewn them all over the floor.   So, I<br/>\nwent downstairs and ended his computer fun and &quot;required&quot; him to pick up the<br/>\nbooks he had strewn all over the floor.  He was not in a particularly joyful<br/>\nmood and neither was I.  He apologized which I told him would mean more if<br/>\nthe behavior changed.  I forgot to mention he is not a typical four year<br/>\nold.  I have not tested him as far as where his IQ is but his verbal and<br/>\ncognitive skills are probably that of someone closer to eight years old.<br/>\nHis Karate teacher once told me if there was ever an adult in a child&#39;s body<br/>\nit would be him.  So, yes, it is wonderful when he is sharing in the joys of<br/>\nthe household and we are playing/working as a team but it just does not work<br/>\nout that way all the time.  I would have been seriously resentful toward him<br/>\nif I had just picked up the mess he intentionally created and not had him<br/>\nclean it up himself.  He grumbled but it was a situation he created himself.<br/>\n**********************************<br/>\nWhat would it be like, since you say he&#39;s so mature, if you said to him, &quot;You <br/>\nlook like you&#39;re having a great time with that game, so I don&#39;t want to <br/>\ninterrupt, but please pick up these books as soon as you&#39;re done.&quot;?<br/>\n<br/>\nIf he doesn&#39;t do it when he&#39;s done, then I suppose you could &quot;require&quot; him to <br/>\ndo it then. The advantage is that you don&#39;t ruin his play, you get the books <br/>\npicked up, AND it actually lets him be more responsible than you&#39;re standing <br/>\nthere and making him do it.<br/>\n<br/>\nIf it happened again, all you&#39;d really have to say is, &quot;The books...&quot;<br/>\nKathryn<br/>\nKathryn<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] four year olds and boundaries","postDate":"1088330858","msgId":1156,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDAwMGIwMWM0NWJmNyRmZjgxYzE4MCQxYTkxZmVhOUBkZWZhdWx0Mjc1NThtMj4="},"prevInTopic":1148,"nextInTopic":1164,"prevInTime":1155,"nextInTime":1157,"topicId":1144,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1072781309\">&lt;&lt;&lt;when I<br/>\nwent into the tv room I saw that he had taken about thirty board books off<br/>\nthe top shelf of the bookcase and strewn them all over the floor.   So, I<br/>\nwent downstairs and ended his computer fun and &quot;required&quot; him to pick up the<br/>\nbooks he had strewn all over the floor.  He was not in a particularly joyful<br/>\nmood and neither was I.  He apologized which I told him would mean more if<br/>\nthe behavior changed.  .......I would have been seriously resentful toward<br/>\nhim if I had just picked up the mess he intentionally created and not had<br/>\nhim clean it up himself.  He grumbled but it was a situation he created<br/>\nhimself.&gt;&gt;&gt;<br/>\n<br/>\nHow do you know that he had no intention of coming back to it later? What a<br/>\ndelightful surprise it would have been for him, if he had come back to the<br/>\nroom and found it all cleaned up for him. What a shame that you missed an<br/>\nopportunity to give him a gift of 5 minutes of your time, and turned it into<br/>\nan unpleasant interruption of what he was doing - which is punitive in<br/>\nitself.<br/>\n<br/>\nWhat if your dh said &quot;stop what you are doing right now regardless of what<br/>\nit is, and do this thing that is important to *me* instead - NOW&quot; ? You<br/>\nmight stop your activity and do his, because you love your dh, but I bet you<br/>\nwouldn&#39;t feel very cordial towards him, or joyous about it.<br/>\nWhat if he said, &quot;Gee, I wish you would do this really important to me<br/>\nthing, as soon as you get a chance. I can help you when you&#39;re ready&quot; ? <br/>\n<br/>\nIf it were Jayn&#39;s (4.5) mess, and it often is just like this, I might ask<br/>\nher to clean it up later, when she has a moment. I find if I bite my tongue<br/>\nand wait, she starts the tidy up spontaneously more and more often -<br/>\nsometimes asking for help. Then we get to do something kind for each other.<br/>\nThat happened earlier this evening with almost her entire soft doll<br/>\ncollection which she had pulled out onto the floor of the (shared with us)<br/>\nbedroom to search for something. I had mentioned it hours before. Much later<br/>\nshe went to clean it up (without further reminders - she just noticed all<br/>\nthe toys out), and I asked her if she wanted help, and I got the<br/>\nincalculably valuable reward of a heartfelt &quot;thank you&quot; and a nice story she<br/>\nhad invented about a couple of her characters.<br/>\n<br/>\nSometimes her messes are just too daunting for her, and I ask if I can go<br/>\nahead and get started. Then she helps me (usually) and is always so grateful<br/>\nand happy to have her clean slate for play back. BTW, we live in a one<br/>\nbedroom apartment, typical L-shaped living/dining room, and our dining area<br/>\nis the office, so we are all pretty much cramped in here.<br/>\n<br/>\nYesterday, I was stripping the bed and said something about wanting to put<br/>\nnew sheets on after it had aired a while, before Daddy got home. To my<br/>\nsurprise Jayn came up with a plan that she could make the bed while I talked<br/>\nto Daddy later on. She really wanted to help. I smiled to myself, because I<br/>\nthought that likely she would forget, and anyhow she really is too little to<br/>\nput on new sheets and lift the mattress to tuck them in etc. But I didn&#39;t<br/>\ndiscourage her.<br/>\n<br/>\nA little while later, dh came home sooner than expedted and we were talking<br/>\nabout the business of the day, and I noticed that Jayn was gone. So I<br/>\ntiptoed to the bedroom door. Sure enough there she was carefully hauling up<br/>\nthe pillows (sans pillowcases) and arranging them in place on the bed - all<br/>\nshe was physically capable of. I crept back to the living room to whisper to<br/>\ndh the whole story so that he would understand the state of the bed and make<br/>\nsome nice comment to Jayn. A few moments later she very seriously came out<br/>\nto me, and asked me to help her with the comforter. In the end, she allowed<br/>\nme to put the bottom sheet on (me &quot;assisting&quot; her in the job) and she put on<br/>\nthe pillowcases with very little help. She was so proud of herself, and I am<br/>\njust about bursting with it.<br/>\n<br/>\nJust because something is &quot;reasonable&quot; doesn&#39;t mean it is the kindest<br/>\nsolution, or the one which will have the longest term positive effect on our<br/>\ntrust relationship with our kids.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.707 / Virus Database: 463 - Release Date: 6/15/2004</div>","specialLinks":[]},{"userId":51071079,"authorName":"Kimberly","from":"&quot;Kimberly&quot; &lt;Kontessa_Rose@...&gt;","profile":"kontessa_rose","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: four year olds and boundaries","postDate":"1088325167","msgId":1164,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNibTBuZit2YjBtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMGIwMWM0NWJmNyRmZjgxYzE4MCQxYTkxZmVhOUBkZWZhdWx0Mjc1NThtMj4="},"prevInTopic":1156,"nextInTopic":1171,"prevInTime":1163,"nextInTime":1165,"topicId":1144,"numMessagesInTopic":0,"msgSnippet":"... this ... fence about ... lives. ... ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Kay, I understand where you are coming from. Not every child is the same and I","messageBody":"<div id=\"ygrps-yiv-1818080269\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; He is a great kid.  He is gifted, creative and a handful and he at <br/>\n </span></blockquote>this<br/>\n<blockquote><span title=\"ireply\"> &gt; point needs guidelines and boundaries.  That is why I am on the <br/>\n </span></blockquote>fence about<br/>\n<blockquote><span title=\"ireply\"> &gt; incorporating the entire unschooling lifestyle in all areas of our <br/>\n </span></blockquote>lives.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Kay<br/>\n </span></blockquote>~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\n<br/>\n Kay, I understand where you are coming from. Not every child is the <br/>\nsame and I do not think your son thinks you care more about the house <br/>\nthen you do him, and if he does think that, I do not think it will <br/>\nlast. <br/>\n<br/>\n  My point, one of the strongest emotions I had as a small child was <br/>\nmy mother leaving my father for another man. Goddess how I hated her <br/>\nand her new husband. It went on for a few years and at some point <br/>\nwhen I was only enough to understand it all seemed clear, why she did <br/>\nit, and I could not blame her at all. The same I have found was true <br/>\nof many things I thought true when I was little but latter learned <br/>\nwas wrong when I got older. <br/>\n<br/>\n  I do not think having him clean then up as you did was the best <br/>\nway, but it is what you did, and it is not as if you bent him over, <br/>\nand spanked him for it as some I know have. We all have our path, and <br/>\nthis is the point you are at in yours. I think you are at the right <br/>\nplace here though, and you could learn other ways of re-acting. Like <br/>\nyou though, I refuse to become a cleaning slave for my childs <br/>\ncreativity or live in a mess. There is a middle ground I think.<br/>\n<br/>\n  Advanced or not though, others sound right about him still having <br/>\nthe emotions of a 4 year old even if he has the smarts of a 8 year <br/>\nold, some things are only learned with time. I live with a gifted 4 <br/>\nyear old and though he is very smart, far smarter then my little one <br/>\nin many ways, he is parented by a hard hand and has no self <br/>\nconfidence is very whiney about every thing. Everyone is different, <br/>\nand though I think most 4 year olds fit in a class by themselves, all <br/>\nof them are different from eachother too. <br/>\n<br/>\n I do feel for you. What ever works for all of you. <br/>\n<br/>\n   Blessings,<br/>\n   Kimmy</div>","specialLinks":[]},{"userId":171127956,"authorName":"G&M Contracting Inc., Kenneth Gillilan","from":"&quot;G&M Contracting Inc., Kenneth Gillilan&quot; &lt;gmcontractinginc@...&gt;","profile":"vermontones","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] four year olds and boundaries","postDate":"1088310460","msgId":1148,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVBRUFJSkpKSURLSUFCTUVOT0hJTUVDR0NEQUEuZ21jb250cmFjdGluZ2luY0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDAwMGIwMWM0NWJmNyRmZjgxYzE4MCQxYTkxZmVhOUBkZWZhdWx0Mjc1NThtMj4="},"prevInTopic":1147,"nextInTopic":1156,"prevInTime":1147,"nextInTime":1149,"topicId":1144,"numMessagesInTopic":0,"msgSnippet":"... old.  I have not tested him as far as where his IQ is but his verbal and cognitive skills are probably that of someone closer to eight years old. This","messageBody":"<div id=\"ygrps-yiv-1374770334\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;I forgot to mention he is not a typical four year<br/>\n </span></blockquote>old.  I have not tested him as far as where his IQ is but his verbal and<br/>\ncognitive skills are probably that of someone closer to eight years old.&gt;&gt;&gt;<br/>\n<br/>\nThis statement bothers me because I&#39;ve heard it so many times from parents<br/>\nof gifted children.  Please don&#39;t forget that even if he acts 8 he is still<br/>\n4 and has age 4 impulses and feelings.  Sometimes when we see our kids as<br/>\nolder than what they are we take away their childhood.  Don&#39;t rush it, he<br/>\nsounds absolutely charming and I would hate to see him burning out and<br/>\nfeeling bad about himself.<br/>\n   I have seen the burnout first hand and let me tell you it&#39;s not pretty.<br/>\nYou would find yourself wishing you just picked the books up and left well<br/>\nenough alone.<br/>\n<br/>\nAnnMarie<br/>\nJust my opinion, take it or leave it.<br/>\n<br/>\n<br/>\n  -----Original Message-----<br/>\n  From: kay alina [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:angelsguard@...\">angelsguard@...</a>]<br/>\n  Sent: Saturday, June 26, 2004 11:37 PM<br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\n  Subject: [unschoolingbasics] four year olds and boundaries<br/>\n<br/>\n<br/>\n  Ren wrote:<br/>\n<br/>\n  Maybe it&#39;s not anti-unschooling, but the word &quot;required&quot; conjures up<br/>\n  feelings of anti-joy for me.<br/>\n  Four years old is very little. Understanding child development and the<br/>\nfour<br/>\n  year old mind (in general) has helped me see that the priorities are very<br/>\n  different in their world, as well they should be.<br/>\n  My toddlers joyfully help me, it&#39;s part of trying out the adult world,<br/>\nwhich<br/>\n  they mimic intensely at times...all part of the learning process.<br/>\n<br/>\n  &&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&<br/>\n<br/>\n  True Ren.  It is not always joyful.  Example of this evening.  He was<br/>\n  involved in an art project when I came downstairs to check email.  He was<br/>\n  making a great card to send to his grandmom.  He came down after awhile<br/>\nand<br/>\n  said he wanted to do braingame on the computer.  I found a site that<br/>\n  satisfied him and went upstairs.  Lo and behold a beautiful card but when<br/>\nI<br/>\n  went into the tv room I saw that he had taken about thirty board books off<br/>\n  the top shelf of the bookcase and strewn them all over the floor.   So, I<br/>\n  went downstairs and ended his computer fun and &quot;required&quot; him to pick up<br/>\nthe<br/>\n  books he had strewn all over the floor.  He was not in a particularly<br/>\njoyful<br/>\n  mood and neither was I.  He apologized which I told him would mean more if<br/>\n  the behavior changed.  I forgot to mention he is not a typical four year<br/>\n  old.  I have not tested him as far as where his IQ is but his verbal and<br/>\n  cognitive skills are probably that of someone closer to eight years old.<br/>\n  His Karate teacher once told me if there was ever an adult in a child&#39;s<br/>\nbody<br/>\n  it would be him.  So, yes, it is wonderful when he is sharing in the joys<br/>\nof<br/>\n  the household and we are playing/working as a team but it just does not<br/>\nwork<br/>\n  out that way all the time.  I would have been seriously resentful toward<br/>\nhim<br/>\n  if I had just picked up the mess he intentionally created and not had him<br/>\n  clean it up himself.  He grumbled but it was a situation he created<br/>\nhimself.<br/>\n<br/>\n  I agree with you that having a clutter free home is an issue of mine.  His<br/>\n  father does not appeciate a messy house either though.  If the sink is<br/>\nfull<br/>\n  of dishes and there is an abundance of laundry around I am expected to<br/>\ntake<br/>\n  care of it.  Seems reasonable to me.  He goes to work and provides for our<br/>\n  care and I am required to maintain a reasonable environment.  I wish I<br/>\ncould<br/>\n  have made a game out of the situation this afternoon but I just didn&#39;t<br/>\nknow<br/>\n  how.  I guess it comes down to intent.  If I sense the intent is<br/>\ndestructive<br/>\n  I will pull the reigns.  If the intent is normal curiosity and learning<br/>\nand<br/>\n  making mistakes it is a different story.<br/>\n<br/>\n  He is a great kid.  He is gifted, creative and a handful and he at this<br/>\n  point needs guidelines and boundaries.  That is why I am on the fence<br/>\nabout<br/>\n  incorporating the entire unschooling lifestyle in all areas of our lives.<br/>\n<br/>\n  Kay<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor<br/>\n              ADVERTISEMENT<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n----------------------------------------------------------------------------<br/>\n--<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n<br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics-unsubscribe@yahoogroups.com\">unschoolingbasics-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [unschoolingbasics] four year olds and boundaries","postDate":"1088309393","msgId":1147,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2NC4zMTNjYzQxMy4yZTBmYTI5MUBhb2wuY29tPg=="},"prevInTopic":1144,"nextInTopic":1148,"prevInTime":1146,"nextInTime":1148,"topicId":1144,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/26/2004 11:39:33 PM Eastern Daylight Time, angelsguard@sbcglobal.net writes: So, yes,  it is wonderful when he is sharing in the joys of ","messageBody":"<div id=\"ygrps-yiv-1240462482\">In a message dated 6/26/2004 11:39:33 PM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:angelsguard@...\">angelsguard@...</a> writes:<br/>\n<br/>\nSo, yes,  it is wonderful when he is sharing in the joys of<br/>\nthe household and we are  playing/working as a team but it just does not work<br/>\nout that way all the  time.  I would have been seriously resentful toward him<br/>\nif I had just  picked up the mess he intentionally created and not had him<br/>\nclean it up  himself.  He grumbled but it was a situation he created  himself.<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;<br/>\n <br/>\nFrom a four year old&#39;s point of view (and mine as well), what he learned is  <br/>\nthat you care more about the house than about him.<br/>\n <br/>\nYou can choose to look at it differently. You could have chosen to feel  <br/>\nseriously resentful OR you could have chosen to ask him to help you clean up the  <br/>\nmess while talking about his new creation. He won&#39;t be four forever. *He* may  <br/>\nnot even be around forever. My goal is to treat my son as I would if  today <br/>\nwere his last day on earth. When angry or frustrated, I try really hard to  <br/>\nstop and think: &quot;what would I do if...&quot;<br/>\n <br/>\nAnd he may learn that creativity just isn&#39;t *worth* the clean-up! My boys&#39;  <br/>\ncreativity is so much more valuable than any clean house I could have. I would  <br/>\nhate for them to stop creating to keep from having to clean up a mess. I <br/>\nwould  have happily cleaned it up.<br/>\n <br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":157863786,"authorName":"kay alina","from":"&quot;kay alina&quot; &lt;angelsguard@...&gt;","profile":"angelsguardalways","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"four year olds and boundaries","postDate":"1088307416","msgId":1144,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGIwMWM0NWJmNyRmZjgxYzE4MCQxYTkxZmVhOUBkZWZhdWx0Mjc1NThtMj4=","referencesHeader":"PDEwODgyOTkwOTIuMTI4Ny43NDA2OC5tMjVAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":1147,"prevInTime":1143,"nextInTime":1145,"topicId":1144,"numMessagesInTopic":0,"msgSnippet":"Ren wrote: Maybe it s not anti-unschooling, but the word required conjures up feelings of anti-joy for me. Four years old is very little. Understanding child","messageBody":"<div id=\"ygrps-yiv-1086958330\">Ren wrote:<br/>\n<br/>\nMaybe it&#39;s not anti-unschooling, but the word &quot;required&quot; conjures up<br/>\nfeelings of anti-joy for me.<br/>\nFour years old is very little. Understanding child development and the four<br/>\nyear old mind (in general) has helped me see that the priorities are very<br/>\ndifferent in their world, as well they should be.<br/>\nMy toddlers joyfully help me, it&#39;s part of trying out the adult world, which<br/>\nthey mimic intensely at times...all part of the learning process.<br/>\n<br/>\n&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&<br/>\n<br/>\nTrue Ren.  It is not always joyful.  Example of this evening.  He was<br/>\ninvolved in an art project when I came downstairs to check email.  He was<br/>\nmaking a great card to send to his grandmom.  He came down after awhile and<br/>\nsaid he wanted to do braingame on the computer.  I found a site that<br/>\nsatisfied him and went upstairs.  Lo and behold a beautiful card but when I<br/>\nwent into the tv room I saw that he had taken about thirty board books off<br/>\nthe top shelf of the bookcase and strewn them all over the floor.   So, I<br/>\nwent downstairs and ended his computer fun and &quot;required&quot; him to pick up the<br/>\nbooks he had strewn all over the floor.  He was not in a particularly joyful<br/>\nmood and neither was I.  He apologized which I told him would mean more if<br/>\nthe behavior changed.  I forgot to mention he is not a typical four year<br/>\nold.  I have not tested him as far as where his IQ is but his verbal and<br/>\ncognitive skills are probably that of someone closer to eight years old.<br/>\nHis Karate teacher once told me if there was ever an adult in a child&#39;s body<br/>\nit would be him.  So, yes, it is wonderful when he is sharing in the joys of<br/>\nthe household and we are playing/working as a team but it just does not work<br/>\nout that way all the time.  I would have been seriously resentful toward him<br/>\nif I had just picked up the mess he intentionally created and not had him<br/>\nclean it up himself.  He grumbled but it was a situation he created himself.<br/>\n<br/>\nI agree with you that having a clutter free home is an issue of mine.  His<br/>\nfather does not appeciate a messy house either though.  If the sink is full<br/>\nof dishes and there is an abundance of laundry around I am expected to take<br/>\ncare of it.  Seems reasonable to me.  He goes to work and provides for our<br/>\ncare and I am required to maintain a reasonable environment.  I wish I could<br/>\nhave made a game out of the situation this afternoon but I just didn&#39;t know<br/>\nhow.  I guess it comes down to intent.  If I sense the intent is destructive<br/>\nI will pull the reigns.  If the intent is normal curiosity and learning and<br/>\nmaking mistakes it is a different story.<br/>\n<br/>\nHe is a great kid.  He is gifted, creative and a handful and he at this<br/>\npoint needs guidelines and boundaries.  That is why I am on the fence about<br/>\nincorporating the entire unschooling lifestyle in all areas of our lives.<br/>\n<br/>\nKay</div>","specialLinks":[]}],"prevTopicId":1172,"nextTopicId":1153}}