{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":317857527,"authorName":"Tamara Griesel","from":"Tamara Griesel &lt;griesellists@...&gt;","profile":"griesellists","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] RE: Messy post about a messy situation","postDate":"1239670587","msgId":39494,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3NTk2LjE4MzkxLnFtQHdlYjYzMTA4Lm1haWwucmUxLnlhaG9vLmNvbT4=","inReplyToHeader":"PGdzMGhsMitlMzgxQGVHcm91cHMuY29tPg==","referencesHeader":"PGdzMGhsMitlMzgxQGVHcm91cHMuY29tPg=="},"prevInTopic":39489,"nextInTopic":0,"prevInTime":39493,"nextInTime":39495,"topicId":39434,"numMessagesInTopic":0,"msgSnippet":"Hi Meredith,   I have got to put the white noise generator on my to buy soon list.  That would help with both of them, I think, since Andrew s bed is right","messageBody":"<div id=\"ygrps-yiv-438786687\">Hi Meredith,<br/>\n <br/>\nI have got to put the white noise generator on my to buy soon list.  That would help with both of them, I think, since Andrew&#39;s bed is right near a vent that carries sound from upstairs.  I hesitate to complain to the upstairs tenant about it, because it&#39;s not something he can do much about (Andrew&#39;s upper closet is actually continuous with this gentleman&#39;s bedroom, something I learned when I found out Andrew was storing things in there, not realizing it was part of someone else&#39;s area.)  I actually thought for the longest time that the upstairs neighbor was having loud fights with an unseen girlfriend until finally one night I recognized one of the shouting voices as...Eddie Murphy.<br/>\n <br/>\n(Nothing can be on the &quot;to buy now&quot; list.  Except food, soap, toilet paper.  I have to plan all of my purchases extremely carefully because after fixed expenses and transportation costs we only have about 600 dollars a month to cover food, household expenses, and any savings we can put in.  It&#39;s tight living here, another stress for all of us, since we have to say no much more often than we&#39;d like to about things that are really needs not even wants.  that&#39;s why we&#39;ve been having Andrew participate more fully than a lot of kids in spending decisions, so he can help us decide whether going to a movie for his birthday is more important than pants without holes this month (and at that time, it was.  We saw Monsters vs. Aliens and had five pair of pants worth of fun.)<br/>\n <br/>\nTamara<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"RE: Messy post about a messy situation","postDate":"1239665122","msgId":39489,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzMGhsMitlMzgxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDkxNjM2MS45OTMyOS5xbUB3ZWI2MzEwNS5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":39476,"nextInTopic":39494,"prevInTime":39488,"nextInTime":39490,"topicId":39434,"numMessagesInTopic":0,"msgSnippet":"... ***************************************** Just brainstorming... would something like a white noise machine help he sleep through? You could also try soft","messageBody":"<div id=\"ygrps-yiv-937316354\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, Tamara Griesel &lt;griesellists@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Rosalie would like to go to sleep earlier, but Andrew has difficulty keeping from running around and yelling after she&#39;s asleep, which then wakes her back up.<br/>\n </span></blockquote>*****************************************<br/>\n<br/>\nJust brainstorming... would something like a white noise machine help he sleep through? You could also try soft music or a little table-top fountain in the room - the idea is to sort of blur the sounds from the rest of the house so they&#39;re not as jarring.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; They both want me to lie with them until they go to sleep, but they don&#39;t want to lie with each other, either because of jealousy or just because when they lie down to sleep they seem to develop more than the usual number of knees and elbows <br/>\n </span></blockquote>******************************************<br/>\n<br/>\nDo they wake up at the same time, too? I&#39;m wondering if there&#39;s a way for you to do some one-on-one snuggling at other times in the day. Can you snuggle with one or both while watching tv?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;There&#39;s just not enough me to go around.<br/>\n<br/>\n </span></blockquote>I know what you mean, but at the same time, it might help to consider that there certainly is enough of your Love to go around - its just not always clear how to convey that to both kids in the moment. In those moments when you can&#39;t find any way to spread your physical self around, you can still hold the intention to spread your love around. When you remember to hold that intention you may find other ways to connect - a look, a smile, a few words.... Deschooling is a healing process, first and foremost. As your kids heal from the stress of school (the whole family was impacted, after all) they&#39;ll become better able to trust that there Is enough of your love to go around, and as that trust builds, and their belief in being loved, they&#39;ll have more love and compassion to offer each other. For now, though, you have to be a fountain of love for both of them. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I could leave him all day with the small number of children he knows well enough to feel safe with, but he really sees the world as a hostile, scary place right now and he&#39;s got his defensive stance up.<br/>\n </span></blockquote>*******************************<br/>\n<br/>\nInstead of leaving him, can you go too and bring your dd along? That way he&#39;s in a safe place, And you&#39;re accessible in an emergency. It might be a way for him to expand his comfort zone a little.<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":317857527,"authorName":"Tamara Griesel","from":"Tamara Griesel &lt;griesellists@...&gt;","profile":"griesellists","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Messy post about a messy situation","postDate":"1239639881","msgId":39476,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkxNjM2MS45OTMyOS5xbUB3ZWI2MzEwNS5tYWlsLnJlMS55YWhvby5jb20+","inReplyToHeader":"PGdydGJ2YitkZXNnQGVHcm91cHMuY29tPg==","referencesHeader":"PGdydGJ2YitkZXNnQGVHcm91cHMuY29tPg=="},"prevInTopic":39458,"nextInTopic":39489,"prevInTime":39475,"nextInTime":39477,"topicId":39434,"numMessagesInTopic":0,"msgSnippet":"Hmmm, maybe, maybe not. Did he Want you with him at all times? At nine, he may not. Its something you could talk with him about, that if he stays closer to","messageBody":"<div id=\"ygrps-yiv-1701942044\">&quot;Hmmm, maybe, maybe not. Did he Want you with him at all times? At nine, he may not. Its something you could talk with him about, that if he stays closer to you then you&#39;re available sooner to help him out.&quot;<br/>\n<br/>\nHe does.  They both do...but they don&#39;t want to be with each other.  He&#39;s not at a point yet in which he feels safe around other kids, at least, not around kids he doesn&#39;t know well.  I could leave him all day with the small number of children he knows well enough to feel safe with, but he really sees the world as a hostile, scary place right now and he&#39;s got his defensive stance up.  There&#39;s just not enough me to go around.<br/>\n<br/>\nThat extends into other areas, like bedtime (not a set time we select for them, just a word for that time when they both want to go to sleep).  They both want me to lie with them until they go to sleep, but they don&#39;t want to lie with each other, either because of jealousy or just because when they lie down to sleep they seem to develop more than the usual number of knees and elbows (they get in each other&#39;s way).  Rosalie would like to go to sleep earlier, but Andrew has difficulty keeping from running around and yelling after she&#39;s asleep, which then wakes her back up.<br/>\n<br/>\nTamara<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Messy post about a messy situation","postDate":"1239561003","msgId":39458,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdydGJ2YitkZXNnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdyb2R0NSs1bjA2QGVHcm91cHMuY29tPg=="},"prevInTopic":39448,"nextInTopic":39476,"prevInTime":39457,"nextInTime":39459,"topicId":39434,"numMessagesInTopic":0,"msgSnippet":"... ********************** Hmmm, maybe, maybe not. Did he Want you with him at all times? At nine, he may not. Its something you could talk with him about,","messageBody":"<div id=\"ygrps-yiv-1059479093\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;griesellists&quot; &lt;griesellists@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I didn&#39;t stay with Andrew AT ALL TIMES.  I should have never left him, not even for a minute.  I should have found a way to keep both children with me<br/>\n </span></blockquote>**********************<br/>\n<br/>\nHmmm, maybe, maybe not. Did he Want you with him at all times? At nine, he may not. Its something you could talk with him about, that if he stays closer to you then you&#39;re available sooner to help him out. I&#39;ve had that conversation with Mo (7)- usually After some social catastrophe. Then, next time we&#39;re approaching a similar situation, I&#39;ll remind her of our conversation and whatever strategy she&#39;s decided to try. Right now, she has a hard time playing with smaller children - she&#39;s too big and too used to playing hard. She doesn&#39;t have the skills to &quot;pull her punches&quot; as it were (not that she&#39;s punching, but she has been known to tackle other children all in good fun).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; I didn&#39;t recognize the dynamic between Andrew and this other girl from the beginning and make sure I monitored their interactions.  Andrew was mercilessly bullied before I removed him from school (six months after I should have) and has a hair trigger defense response with people he believes dislike him.<br/>\n </span></blockquote>***********************************<br/>\n<br/>\nI understand why you think you should have been more involved, seen it coming - we stuck like glue to Ray for years, but to some extent, that was because we Could. We didn&#39;t live in a neighborhood, didn&#39;t have younger children of our own, and he was younger too, less able to process and plan some strategies. Definitiely talk to him and appologise to him for not getting involved sooner, tell him you&#39;re not sure you handled things well. Ask him how he&#39;d rather you handled things in the future and make some strategies to accomplish that. Maybe he needs a timer so that periodically he can say &quot;oh, that&#39;s my mom, I have to go&quot; if he needs a break. Maybe, if he likes to be off on his own, a cell phone would be a useful way to keep in touch. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I didn&#39;t defend him to the other parent and I got out of there fast<br/>\n<br/>\n </span></blockquote>Getting out fast is a reasonable option in the moment. There&#39;s not necessarily a Need to defend him, especially if he&#39;s upset. The first priority at that point is to tend to his needs. When he&#39;s calm and able to talk about things, then you could ask him if he wants you to go explain things to the other parent. If she has a bunch of kids, she may well be familiar with the idea that you don&#39;t always know &quot;what happened&quot; right away.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How can I deschool myself so I&#39;m not reliving my own failures with my son&#39;s challenges before it&#39;s too late?<br/>\n </span></blockquote>****************************<br/>\n<br/>\nSpend more time with friends you can trust. Seriously, that&#39;s important. Everyone learns social skills best when feeling comfortable and supported, so put more energy into putting your whole familiy in situations where everyone can feel that. There will be misunderstandings and bad days even with close friends - but there&#39;s much more opportunity to learn to prevent those, too.<br/>\n<br/>\n---Meredith (Mo 7, Ray 15)</div>","specialLinks":[]},{"userId":317857527,"authorName":"Tamara Griesel","from":"Tamara Griesel &lt;griesellists@...&gt;","profile":"griesellists","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [unschoolingbasics] Re: Messy post about a messy situation","postDate":"1239489995","msgId":39448,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwOTIyNC41MjYyMy5xbUB3ZWI2MzEwMS5tYWlsLnJlMS55YWhvby5jb20+","inReplyToHeader":"PGdycTRhcSt2aG5kQGVHcm91cHMuY29tPg==","referencesHeader":"PGdycTRhcSt2aG5kQGVHcm91cHMuY29tPg=="},"prevInTopic":39439,"nextInTopic":39458,"prevInTime":39447,"nextInTime":39449,"topicId":39434,"numMessagesInTopic":0,"msgSnippet":"Thanks, I seem to need people to tell me I m not terrible.  I will look up those books right away.  They may help both me and DH. Tamara   ","messageBody":"<div id=\"ygrps-yiv-2076527336\">Thanks,<br/>\n<br/>\nI seem to need people to tell me I&#39;m not terrible.  I will look up those books right away.  They may help both me and DH.<br/>\n<br/>\nTamara<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: sistergoddesselli &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elinorsparks@...\">elinorsparks@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a><br/>\nSent: Saturday, April 11, 2009 9:01:14 AM<br/>\nSubject: [unschoolingbasics] Re: Messy post about a messy situation<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nTamara - <br/>\n<br/>\nYou are a brilliant mama!!!!<br/>\n<br/>\nI&#39;d love to respond to your questions... because I am working on this myself. I&#39;ve got an 8 year old son who struggles because of a childhood trauma (11 heart surgeries) and a daughter who sometimes struggles because of the neglect she suffered while I was dealing with the medical issues of her brother.<br/>\n<br/>\nAnyway, I have found two fabulous resources to help me get a new paradigm on the situation - a paradigm that is working beautifully. Un-schooling mamas on this group and in town recommended these resources to me!<br/>\n<br/>\nHere they are:<br/>\n<br/>\n&quot;Beyond Consequences Logic and Control: A Love Based Approach to Helping Children with Severe Behaviors&quot;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.beyondco\">http://www.beyondco</a> nsequences. com/index. html<br/>\n<br/>\nI invited my parents to read this book and my mom said to me the other day, &quot;Now I finally get why you are homeschooling and why you are homeschooling in this un-schooling way.&quot; While the book is not about homeschooling or un-schooling it is about shifting your paradigm as you love your challenging kid. And, first step is looking inward to your own fears. That kinda answers your first question.<br/>\n<br/>\nThe other books are &quot;Non-Violent Communication&quot; and &quot;Respectful Parents - Respectful Kids&quot; I like this for their overall approach. And, I think that the Beyond Consequences book/theory dovetails nicely with these books.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nonviole\">http://www.nonviole</a> ntcommunication. com/index. htm<br/>\n<br/>\nI highly recommend all three!<br/>\n<br/>\nGood luck, you are on the right track and your kids are lucky to have you as mom. <br/>\n<br/>\nLove,<br/>\n<br/>\nElli<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":237471585,"authorName":"sistergoddesselli","from":"&quot;sistergoddesselli&quot; &lt;elinorsparks@...&gt;","profile":"sistergoddesselli","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Messy post about a messy situation","postDate":"1239454874","msgId":39439,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdycTRhcSt2aG5kQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdyb2R0NSs1bjA2QGVHcm91cHMuY29tPg=="},"prevInTopic":39434,"nextInTopic":39448,"prevInTime":39438,"nextInTime":39440,"topicId":39434,"numMessagesInTopic":0,"msgSnippet":"Tamara - You are a brilliant mama!!!! I d love to respond to your questions... because I am working on this myself.  I ve got an 8 year old son who struggles","messageBody":"<div id=\"ygrps-yiv-1290862178\">Tamara - <br/>\n<br/>\nYou are a brilliant mama!!!!<br/>\n<br/>\nI&#39;d love to respond to your questions... because I am working on this myself.  I&#39;ve got an 8 year old son who struggles because of a childhood trauma (11 heart surgeries) and a daughter who sometimes struggles because of the neglect she suffered while I was dealing with the medical issues of her brother.<br/>\n<br/>\nAnyway, I have found two fabulous resources to help me get a new paradigm on the situation - a paradigm that is working beautifully.  Un-schooling mamas on this group and in town recommended these resources to me!<br/>\n<br/>\nHere they are:<br/>\n<br/>\n&quot;Beyond Consequences Logic and Control: A Love Based Approach to Helping Children with Severe Behaviors&quot;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.beyondconsequences.com/index.html\">http://www.beyondconsequences.com/index.html</a><br/>\n<br/>\nI invited my parents to read this book and my mom said to me the other day, &quot;Now I finally get why you are homeschooling and why you are homeschooling in this un-schooling way.&quot;  While the book is not about homeschooling or un-schooling it is about shifting your paradigm as you love your challenging kid.  And, first step is looking inward to your own fears.  That kinda answers your first question.<br/>\n<br/>\n<br/>\nThe other books are &quot;Non-Violent Communication&quot; and &quot;Respectful Parents - Respectful Kids&quot;  I like this for their overall approach.  And, I think that the Beyond Consequences book/theory dovetails nicely with these books.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nonviolentcommunication.com/index.htm\">http://www.nonviolentcommunication.com/index.htm</a><br/>\n<br/>\n<br/>\nI highly recommend all three!<br/>\n<br/>\nGood luck, you are on the right track and your kids are lucky to have you as mom.  <br/>\n<br/>\nLove,<br/>\n<br/>\nElli</div>","specialLinks":[]},{"userId":317857527,"authorName":"griesellists","from":"&quot;griesellists&quot; &lt;griesellists@...&gt;","profile":"griesellists","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Messy post about a messy situation","postDate":"1239399141","msgId":39434,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyb2R0NSs1bjA2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":39439,"prevInTime":39433,"nextInTime":39435,"topicId":39434,"numMessagesInTopic":0,"msgSnippet":"Story first, then background.  Comment on any part you like. Yesterday started out a good day.  I was practicing my good habits...making monkey platters,","messageBody":"<div id=\"ygrps-yiv-2060811872\">Story first, then background.  Comment on any part you like.<br/>\n<br/>\nYesterday started out a good day.  I was practicing my good habits...making monkey platters, dividing my time between the children (9 and 3) about equally.  Yes, ordinarily more time should go to the littler one, but the older has regressed emotionally due to trauma, and I really should allocate his time as though he were four, as I learned in the afternoon.<br/>\n<br/>\nThere are about six neighbor children next door, age range about 5 to 12.  They are related to each other some siblings, some cousins.  Andrew and Rosalie and the other children were going back and forth between the two houses while I tried to follow as best I could, staying mostly with Rosalie to make sure she remembered about the street.  They played reasonably well for a while, then while I was with Rosalie, there was an altercation.  The children were playing with a twelve foot length of narrow metal pipe.  A girl Andrew&#39;s age began baiting him.  He responded.  She picked up the pipe, he took it away.  In the process three children were hit by one end or the other of the pipe (Andrew, the girl, and an uninvolved younger child who was in the way of the other end of the pipe.  The other children piled onto Andrew, hitting him with sticks.  They stopped as I arrived, Andrew was screaming and incoherent, and the other children were all insisting the altercation was all his fault.<br/>\n<br/>\nAndrew couldn&#39;t articulate any explanation at that point (he generally can&#39;t when upset).  I was asked by an adult at that house to take him home.  I took him home, still screaming and crying and then had to leave him while I retrieved Rosalie.  He paced about the house beside himself, saying that he will never have friends, he hates himself, he wishes he were never born, and so on until he eventually calmed down.  He was irritable and easily frustrated by everything else for the rest of the night.<br/>\n<br/>\nI fear that the fallout from this will be not only that he will no longer be able to play with these children (not sure that&#39;s a great loss at this point) but that they will poison his chances to make friends with any other kids in the neighborhood.<br/>\n<br/>\nHow I made it worse:<br/>\nI didn&#39;t stay with Andrew AT ALL TIMES.  I should have never left him, not even for a minute.  I should have found a way to keep both children with me.<br/>\nI didn&#39;t recognize the dynamic between Andrew and this other girl from the beginning and make sure I monitored their interactions.  Andrew was mercilessly bullied before I removed him from school (six months after I should have) and has a hair trigger defense response with people he believes dislike him.<br/>\nI didn&#39;t defend him to the other parent and I got out of there fast, then after delivering apologies (Andrew wanted to apologize, I didn&#39;t force him), I avoided, and told Andrew to avoid) the entire family for the rest of the day.  Hard to do, because they&#39;re everywhere.  Why did I do that?  Because I avoid conflict at all costs.  I fear conflict, so I never defend myself.<br/>\n<br/>\nOne tiny thing I did right:<br/>\nI didn&#39;t ground Andrew or punish him.  He punished himself plenty.  I encouraged him and his sister to take a walk with me to another child he knows to play, then took both children to the park to play with this other little boy and some others in the evening so he could have another opportunity to succeed, before the feelings of irredeemable failure got too ingrained.  <br/>\n<br/>\nBoth of us crave social interactions and at the same time are not very good at them.  We just don&#39;t get the subtleties in real time.  His dad is a bit &quot;odd&quot; as well but doesn&#39;t mind being alone as much. (We all have characteristics in common with people with autism spectrum disorders, and I at least met DSM-IV criteria for Asperger&#39;s syndrome as a child, but they didn&#39;t call it that at the time.)  We cpe very differently, though.  I just assume that I&#39;m always wrong.  Which means I apologize a lot, take blame for things I&#39;m not sure I actually did, to avoid conflict, and avoid situations or people once I believed I have made a significant social error with them, even if they haven&#39;t reacted badly to me at all.  I&#39;ll even avoid places where I have embarrassed myself.  Andrew, on the other hand, goes on the offense to protect himself.  <br/>\n<br/>\nI think the difference is probably that when I was bullied, it was with insults, exclusion, and harassment.  When Andrew was being bullied, the threats and attacks were more often physical.<br/>\n<br/>\nQuestions:<br/>\nHow can I deschool myself so I&#39;m not reliving my own failures with my son&#39;s challenges before it&#39;s too late?<br/>\n<br/>\nWhat would you have done (after the fact).  What have you done when you know you have messed up?<br/>\n<br/>\nI know some other moms have had issues with children&#39;s social development (been reading those threads).<br/>\n<br/>\nAny ideas?<br/>\n<br/>\nTamara</div>","specialLinks":[]}],"prevTopicId":39487,"nextTopicId":39424}}