{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":165889631,"authorName":"Syndi","from":"&quot;Syndi&quot; &lt;justlikemama@...&gt;","profile":"justlikemama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Guns and uncomfortable feelings (long)","postDate":"1093299686","msgId":2918,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNnZHFsNis1dThzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEhJRVBLT09FRUlBSUJISFBKRUJQQUVQQUNQQUEuc2FsZ2Vub3Zlc2VAd29ybGRuZXQuYXR0Lm5ldD4="},"prevInTopic":2910,"nextInTopic":0,"prevInTime":2917,"nextInTime":2919,"topicId":2890,"numMessagesInTopic":0,"msgSnippet":"Hi Joan, I ll might not have any answers here but will share my story with kids and guns. My oldest DS (who would be 22 now) was NEVER allowed to play with ","messageBody":"<div id=\"ygrps-yiv-1070859706\">Hi Joan, <br/>\n  I&#39;ll might not have any answers here but will share my story with <br/>\nkids and guns.<br/>\n  My oldest DS (who would be 22 now) was NEVER allowed to play with <br/>\npretend guns!  I was very young when I had him and just sorta <br/>\nfollowed the crowd in the family in not letting kids have them.  By <br/>\nthe time he was 13 he owned his 1st BB gun, and after that a (Bb?) <br/>\npistol (not a real pistol but shot bb&#39;s i think or pellets).<br/>\n  So when my 2nd ds came along I TRIED to keep him from the toy guns <br/>\nalso.  But by now we were in a new family with different ideas.  All <br/>\nhis cousins had their guns and mine didn&#39;t , so what did he do?  He <br/>\ngrabbed anything that looked like a gun and used it!  Needless to say <br/>\ni&#39;ve given up the fight on &quot;gun (toy) control at home&quot;!<br/>\n  So these guns of ours do get taken with us sometimes everywhere we <br/>\ngo.  Parks, stores, and such.  And i&#39;ve basically discussed with my <br/>\nboys (6 and 11) that there are some people that do not care for guns <br/>\nof any kind, and out of respect for them that we should not take our <br/>\nguns into the stores or to the parks.  Reminding them that if it were <br/>\nthe other way around, we would hope that people would respect our <br/>\nwish&#39;s.  Well, so far so good.  They&#39;ve never been upset at not <br/>\ntaking them any place we knew others wouldn&#39;t appriciate them.  But <br/>\nthen there were the times we didn&#39;t think anyone else would <br/>\nbe &quot;packin&quot; and sure enough they were! <br/>\nwell, thats how its been for us<br/>\nsyndi</div>","specialLinks":[]},{"userId":105977377,"authorName":"Alison Broadbent","from":"Alison Broadbent &lt;abzb@...&gt;","profile":"tttrrrsz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Guns and uncomfortable feelings (long)","postDate":"1093263165","msgId":2910,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJENEYyRDRDLjg4NDQlYWJ6YkBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":2909,"nextInTopic":2918,"prevInTime":2909,"nextInTime":2911,"topicId":2890,"numMessagesInTopic":0,"msgSnippet":"Now I m wondering about my reaction to my ds s gun play.  He has a few small guns.  I too have felt uncomfortable w/ guns but bc of his desire to play w/ them","messageBody":"<div id=\"ygrps-yiv-2028171969\">Now I&#39;m wondering about my reaction to my ds&#39;s gun play.  He has a few small<br/>\nguns.  I too have felt uncomfortable w/ guns but bc of his desire to play w/<br/>\nthem and reading about the wrangling of others on unschooling lists, I&#39;ve<br/>\nshifted my thinking.  But, I have asked my ds not to point it at anybody. T<br/>\ndate he hadn&#39;t payed guns w. any of his friends.  Only on his own when at<br/>\nhome.  He has a gun that shoots little plastic pellets and if anything were<br/>\nto get in there, it could shoot it out.   It also has seemed to me logical<br/>\nin that if he ever was in a situation where he found a gun, it would be<br/>\ningrained in him not to point it.  Maybe I&#39;m selling him short here thinking<br/>\nhe possibly wouldn&#39;t know the danger.  I don&#39;t know.  I do know though that<br/>\nI&#39;m comfortable in asking him not to point it at me.  I do think it&#39;s fine<br/>\nto share what makes me uncomfortable even if I get to a point where I think<br/>\npointing it at someone else is fine.<br/>\n<br/>\nMore thinking to do on this one.  Thanks for sharing your thoughts in this.<br/>\n<br/>\nAlison</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [unschoolingbasics] Guns and uncomfortable feelings (long)","postDate":"1093243363","msgId":2909,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PEhJRVBLT09FRUlBSUJISFBKRUJQQUVQQUNQQUEuc2FsZ2Vub3Zlc2VAd29ybGRuZXQuYXR0Lm5ldD4="},"prevInTopic":2908,"nextInTopic":2910,"prevInTime":2908,"nextInTime":2910,"topicId":2890,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-179526875\">&lt;&lt;&lt;Actually after watching all the joy go out of dd&#39;s face at my sister&#39;s<br/>\ncomments, I am pretty determined to not superimpose my own discomfort on her<br/>\njoy and to try to see what she is doing through her eyes instead of mine<br/>\nbefore I speak. &gt;&gt;&gt;<br/>\n<br/>\nThis is a terrific expression of a huge concept that could apply, not just<br/>\ntoy guns, but all kinds of areas where we as adults have a value judgment<br/>\nthat may be different from the child&#39;s. Recently somewhere (was it here?)<br/>\nthere was a thread about (schooled) teens appearing unmotivated, and one of<br/>\nthe reasons suggested was that they may be keeping their passions secret<br/>\nfrom their parents because of the interests being judged and invalidated as<br/>\ntrivial or less worthy (ie not educational or vocational) over the course of<br/>\ntheir childhood.<br/>\n<br/>\nIt can be hard to remain open minded when it is a toy gun, because there is<br/>\na pervasive belief in the wider community that playing with guns equates to<br/>\na child becoming a violent person - not unlike playing violent video games.<br/>\nThis is a theory that is not borne out by the experiences related by long<br/>\nterm Unschoolers. <br/>\n<br/>\nOne of the wonderful moments from the Conference last year was when I was<br/>\nchatting with a mother in the hall (sorry I don&#39;t remember who) when she<br/>\nspotted her dd passing by. She called out to her and politely but excitedly<br/>\nasked if she would mind letting her brother know that some other kids (pre<br/>\nand early teen) were nearby playing some pretend game with long sticks (made<br/>\nfrom pvc pipe) and he would be interested in joining it. <br/>\n<br/>\nThis struck me most forcibly as being the exact opposite of how many parents<br/>\nwould react to the whole idea of that kind of game, including assuming the<br/>\nchildren would be careless and dangerous, as well as spiritually/emotionally<br/>\nharmed by the fighting fantasy. They would want it stopped at once. <br/>\n<br/>\nI have faith that the kids were responsible, careful and experienced. I am<br/>\ntotally sure that if there was a kid in the game who seemed to be lacking<br/>\nself-control and dangerous to others, there would be a halt called and they<br/>\nwould seek the help of a familiar adult if the problem could not be<br/>\nresolved. I can only assume that the other mother had equal faith. <br/>\n<br/>\nOn a related note, the kids were playing absolutely openly and publicly in<br/>\nthe funshop room (more like a ballroom sized chamber). There was no secrecy<br/>\nor hiding. There was acceptance and encouragement.<br/>\n<br/>\n&lt;&lt;&lt;It seems to me now that it&#39;s really not about the gun, but<br/>\nabout what she perceives she&#39;s doing with it that actually has an impact on<br/>\nhow I feel.  I am wondering though how to deal with the comments of others,<br/>\nsuch as my sister, since we do know at least one family who has strong<br/>\nfeelings about guns.  I want to preserve my daughter&#39;s joy at playing with<br/>\nthem but also honor the feelings they evoke in others (and I can relate to<br/>\nthat since I have many of them).&gt;&gt;&gt; <br/>\n<br/>\nMy first thought is to not take the gun to that other family&#39;s home. On<br/>\nother occasions, especially in your (her) home, it is more important to<br/>\nhonor your daughter&#39;s feelings than the possible feelings of other people,<br/>\nnone of whom you can control. You can continue to observe your dd and take<br/>\ncomfort in her evident grasp of the difference between fantasy play and<br/>\nreality.<br/>\n<br/>\nPerhaps, another thing is to give her time for the newness of this toy to<br/>\nwear off before necessarily having a play date with that particular family,<br/>\nso that suggesting different games may be less of a privation for her. <br/>\n<br/>\nThis issue has come up on occasion on my local group list in relation to<br/>\nPark Days. Rarely, a family is anti-gun on broad principle; others subscribe<br/>\nto the bad-toys-breed-psychos theory (see above); others are concerned about<br/>\nimmediate safety - the kids getting too excited and there being accidents in<br/>\n&quot;violent&quot; play. These are some of the reasons our group tends to look for<br/>\ngood sized parks to allow the kids to separate into different groups for<br/>\ndifferent games. <br/>\n<br/>\nIt is sometimes harder for people to deal with very realistic looking guns,<br/>\nrather than colorful &quot;ray guns&quot; or something other weapon like faux swords.<br/>\nOn occasion people have been concerned that other park users will get &quot;the<br/>\nwrong impression&quot; about our kids, especially during war-time. It is possible<br/>\nto get tied into knots of non-logic worrying about pretty unlikely scenarios<br/>\nand the opinions of unconnected strangers. <br/>\n<br/>\nOne of the responses has been to reassure everyone that although there have<br/>\nbeen the odd accidents at park days, none have been related to fantasy<br/>\nweapons role playing. Another has been to talk about the kids&#39; needs to<br/>\nprocess some of their fears and feelings about the war news, or societal<br/>\nviolence in general, to feel powerful in a safe environment with the surety<br/>\nof their parents available to step in if it all got too much at any time.<br/>\n<br/>\nThese are ideas that have been expressed by some of the parents of mostly<br/>\nboys in our group who continue to engage in gun or weapons games. Jayn has<br/>\nto date shown no interest in these games at the park. She does enjoy playing<br/>\n&quot;On guard&quot; with us at home with her swords and shields - lots of collapsing<br/>\n&quot;dead&quot; cured with the following incantation, &quot;magic, magic back alive!&quot; <br/>\n<br/>\nGun playing doesn&#39;t bother me. A child getting upset enough to use any toy<br/>\nor object as an actual weapon, as against a fantasy weapon, is much more<br/>\nworrying. Sand is more dangerous at the park than one kid&#39;s habitual bow and<br/>\nsuction cup arrows have ever been.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.740 / Virus Database: 494 - Release Date: 8/16/2004</div>","specialLinks":[]},{"userId":31945013,"authorName":"Joan Labbe & Salvatore Genovese","from":"&quot;Joan Labbe & Salvatore Genovese&quot; &lt;salgenovese@...&gt;","profile":"jrl01760","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Guns and uncomfortable feelings (long)","postDate":"1093218756","msgId":2908,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEhJRVBLT09FRUlBSUJISFBKRUJQQUVQQUNQQUEuc2FsZ2Vub3Zlc2VAd29ybGRuZXQuYXR0Lm5ldD4=","inReplyToHeader":"PGNnOGY2cyt2OGFmQGVHcm91cHMuY29tPg=="},"prevInTopic":2906,"nextInTopic":2909,"prevInTime":2907,"nextInTime":2909,"topicId":2890,"numMessagesInTopic":0,"msgSnippet":"Hi all, I ve always had a negative visceral reaction to toy guns (or cannons, or other imlements of destruction) and I guess I was kind of hoping my kids might","messageBody":"<div id=\"ygrps-yiv-1891315006\">Hi all,<br/>\n<br/>\nI&#39;ve always had a negative visceral reaction to toy guns (or cannons, or<br/>\nother imlements of destruction) and I guess I was kind of hoping my kids<br/>\nmight not really be attacted to them, like EVER.  But being on this list and<br/>\nespecially the discussions we&#39;ve had about values and kids choices helped<br/>\nprepare me for today!  I went with my sister and all our kids to a nearby<br/>\nplaypark that has a gift shop on the way out.  I was nursing my tired son<br/>\noutside the gift shop while my sister was in there with her kids and my<br/>\ndaughter (5.9).  I knew my dd was picking out a toy and offered one to my<br/>\nson also.  When we got inside, my sister was heading for the exit ... I<br/>\nasked my dd, who was a ways away, if she had something she wanted and she<br/>\nwaved something at me I couldn&#39;t see, saying &quot;Aunt Marie already got it for<br/>\nme!&quot;  My sister was tired and had a toddler diving out of her stroller so<br/>\nshe said &quot;Meet you at the van...&quot; and headed for the door with her kids and<br/>\nmy dd.<br/>\n<br/>\nAfter getting my son&#39;s toy we got to the car and turns out my daughter had<br/>\npicked out this Western play kit that had two guns in it - a rifle and an<br/>\nold fashioned western gun.  I was less than thrilled and sort of wished I<br/>\nhad the opportunity to have talked to her a bit before we bought it....YES,<br/>\nif she insisted on it I would have bought it, but I would have likely<br/>\nmentioned that toy guns remind me of real guns which I find upsetting, and<br/>\nas it turns out after I mildly mentioned this in my sister&#39;s van, turns out<br/>\nit was the handcuffs that attracted her in the first place - possibly we<br/>\ncould have just found those without the guns.  But she said &quot;Well, mom,<br/>\nthese are PRETENDIE...They can&#39;t hurt anyone.&quot;  She&#39;s right.  In any event,<br/>\nshe had the guns and I knew that it was going to be interesting figuring out<br/>\nhow to honor my own feelings about them and express those while allowing her<br/>\nto do what she needed to and wanted to do with them.  But I did feel better<br/>\njust asking her questions and listening to her talk about them in the van,<br/>\nhow she could play police officer and bandit (there was a mask) with them at<br/>\nthe same time.  She was really excited by the possibilities of play, and it<br/>\nwasn&#39;t about hurting.  I calmed down.<br/>\n<br/>\nShe played with them in the car - mostly figuring out how they worked - then<br/>\nwe got back to my sister&#39;s house where we played for a while before coming<br/>\nhome.  Dd was playing with the rifle and my brother in law came in the room.<br/>\nShe was showing it off to him and pointed it at him and pulled the trigger.<br/>\nHe seemed unbothered by it, but my sister all of a sudden came out with &quot;You<br/>\nshouldn&#39;t point that at someone and shoot.  You should learn about gun<br/>\nsafety because if that was a real gun you shouldn&#39;t ever do that...&quot; and<br/>\nthen she left the room.  Aline came over to me, very upset, and said &quot;I<br/>\ndon&#39;t understand Aunt Marie&#39;s rule ... these are pretend guns, they don&#39;t<br/>\nhurt anyone...&quot;  I said &quot;Yes, they are pretend.  Let me go talk to Aunt<br/>\nMarie and find out what&#39;s up..&quot;  I talked to my sister about her comments,<br/>\npointed out these guns were pretend and Aline knew that, pointed out that a<br/>\nmajor way to play with them was in fact to point and pretend to shoot them,<br/>\npointed out that there are plenty of times we&#39;re glad police officers have<br/>\nthem, and asked if what she was trying to do was possibly express that she<br/>\npersonally is uncomfortable with Aline playing with them.  She said yes,<br/>\nthat was what she was trying to say (which of course makes me wonder a lot<br/>\nabout her purchasing them for Aline without talking to me first if she felt<br/>\nthat uncomfortable...)<br/>\n<br/>\nDd, Aline, seems to have gotten over my sister&#39;s comment - in the car on the<br/>\nway home I told her I talked to her aunt and found out what she really<br/>\nmeant, but dd said &quot;No, I don&#39;t want to hear it&quot; so I respected that.<br/>\nActually after watching all the joy go out of dd&#39;s face at my sister&#39;s<br/>\ncomments, I am pretty determined to not superimpose my own discomfort on her<br/>\njoy and to try to see what she is doing through her eyes instead of mine<br/>\nbefore I speak.  It seems to me now that it&#39;s really not about the gun, but<br/>\nabout what she perceives she&#39;s doing with it that actually has an impact on<br/>\nhow I feel.  I am wondering though how to deal with the comments of others,<br/>\nsuch as my sister, since we do know at least one family who has strong<br/>\nfeelings about guns.  I want to preserve my daughter&#39;s joy at playing with<br/>\nthem but also honor the feelings they evoke in others (and I can relate to<br/>\nthat since I have many of them).<br/>\n<br/>\nAny ideas?  Anybody been through anything similar with their kids?<br/>\n<br/>\nI&#39;ll be on vacation this week but reading replies in digest form when I get<br/>\nback on Friday...Thanks!<br/>\n<br/>\nJoan<br/>\n<br/>\n************************<br/>\n&quot;I would rather live in a world where my life is surrounded by mystery than<br/>\nlive in a world so small that my mind could comprehend it.&quot;  ... Harry<br/>\nEmerson Fosdick</div>","specialLinks":[]},{"userId":150688296,"authorName":"Kiersten Pasciak","from":"&quot;Kiersten Pasciak&quot; &lt;kjl8@...&gt;","profile":"kierstenpasciak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Sleep Regulation","postDate":"1093210493","msgId":2906,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNnYjNodCs5cWptQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNnOGY2cyt2OGFmQGVHcm91cHMuY29tPg=="},"prevInTopic":2904,"nextInTopic":2908,"prevInTime":2905,"nextInTime":2907,"topicId":2890,"numMessagesInTopic":0,"msgSnippet":"Hi Syndi, Yes, her name is Emma :) Well, actually she didn t go to bed till 4:45 in the morning! That night was really hard. But, I DO think it was because she","messageBody":"<div id=\"ygrps-yiv-1752267575\">Hi Syndi,<br/>\n<br/>\nYes, her name is Emma :)<br/>\nWell, actually she didn&#39;t go to bed till 4:45 in the morning!<br/>\nThat night was really hard.<br/>\nBut, I DO think it was because she has a cold.<br/>\nShe and Jacob are both faucets of snot today.<br/>\nI bet that is why I started feeling so overwhelmed!<br/>\n<br/>\nI have been trying to make the bedtime experience an even more <br/>\npeaceful, happy time.<br/>\nI rearranged her room, to give her the option of sleeping on the <br/>\ntoddler bed or on the bed on the floor. I also have found that if I <br/>\nleave the door wide open and pretty much &quot;shut down&quot; all the <br/>\nstimulus in the rest of the house, she will eventually come and lay <br/>\nwith me. It is almost like she is happy to know she has the option <br/>\nto leave at any time so she is content to stay.<br/>\n(Before I was shutting her in with me during the attempts for sleep <br/>\nand only opening the door when I thought she was ready to sleep)<br/>\n<br/>\nI think she is probably very similar to the child you describe.<br/>\nIt is all &quot;learning time&quot;<br/>\nShe has hit every milestone early, crawling at 5 months, walking at <br/>\n9, etc.<br/>\nWe have always joked that it was because she spent so many more <br/>\nhours a day practicing, LOL<br/>\nGuess I should be happy she is so interested in everything around <br/>\nher.<br/>\nHopefully, it will make unschooling that much easier.<br/>\nWouldn&#39;t want to lose that spark :)<br/>\n<br/>\nThanks for the reminder that all will get better.<br/>\nI feel very positive about everything today, like it is all back in <br/>\nperspective!<br/>\nI do think that the more I quit trying to control things (and/or <br/>\npeople), the calmer I feel which makes the world better for all.<br/>\n<br/>\nKiersten<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &quot;Syndi&quot; <br/>\n&lt;justlikemama@y...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Hi Kiersten !<br/>\n&gt;  I&#39;ve just now found some time this week to read thru the post.  I <br/>\n&gt; was wondering if Emma got to bed alittle easier after her 30 min <br/>\n </span></blockquote>nap <br/>\n<blockquote><span title=\"ireply\"> &gt; the other day?  My boys are 6 and 11 now, but I have raised <br/>\n </span></blockquote>another <br/>\n<blockquote><span title=\"ireply\"> &gt; one also, and I can certainly remember those times being up at <br/>\n </span></blockquote>night <br/>\n<blockquote><span title=\"ireply\"> &gt; and feeling like I&#39;m never going to get caught up on sleep again!  <br/>\n&gt; Now, I&#39;M  the one taking naps, ALL the time!  <br/>\n&gt;   Though my kids didn&#39;t go thru quite what your daughter is, I <br/>\n </span></blockquote>have a <br/>\n<blockquote><span title=\"ireply\"> &gt; friend who&#39;s daughter never slept from her 1st day home!  Ok, she <br/>\n </span></blockquote>had <br/>\n<blockquote><span title=\"ireply\"> &gt; to sleep sometime, but I had never seen anything like it before. <br/>\n&gt;    Anyway, her 13 year old was and still is extremely bright.  I <br/>\n&gt; could rattle on at what she was doing at what age, but that really <br/>\n&gt; isn&#39;t important. But what I do want to say is if your reading John <br/>\n&gt; Holts books, remember, he says children learn by playing.  I have <br/>\n </span></blockquote>a <br/>\n<blockquote><span title=\"ireply\"> &gt; feeling Emma is so thrilled with the world around her she is <br/>\n </span></blockquote>afraid <br/>\n<blockquote><span title=\"qreply\"> &gt; she is going to miss something by sleeping!<br/>\n&gt;   This won&#39;t last forever and before you know it, she&#39;ll be going <br/>\n&gt; thru some other stage!  I do hope she&#39;s feeling better today!<br/>\n&gt;  Syndi----ps....I hope i got her name right! </span></blockquote></div>","specialLinks":[]},{"userId":165889631,"authorName":"Syndi","from":"&quot;Syndi&quot; &lt;justlikemama@...&gt;","profile":"justlikemama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Sleep Regulation","postDate":"1093124124","msgId":2904,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNnOGY2cyt2OGFmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNnNmhzcCs4Zm1uQGVHcm91cHMuY29tPg=="},"prevInTopic":2896,"nextInTopic":2906,"prevInTime":2903,"nextInTime":2905,"topicId":2890,"numMessagesInTopic":0,"msgSnippet":"Hi Kiersten ! I ve just now found some time this week to read thru the post.  I was wondering if Emma got to bed alittle easier after her 30 min nap the other","messageBody":"<div id=\"ygrps-yiv-711789552\">Hi Kiersten !<br/>\n I&#39;ve just now found some time this week to read thru the post.  I <br/>\nwas wondering if Emma got to bed alittle easier after her 30 min nap <br/>\nthe other day?  My boys are 6 and 11 now, but I have raised another <br/>\none also, and I can certainly remember those times being up at night <br/>\nand feeling like I&#39;m never going to get caught up on sleep again!  <br/>\nNow, I&#39;M  the one taking naps, ALL the time!  <br/>\n  Though my kids didn&#39;t go thru quite what your daughter is, I have a <br/>\nfriend who&#39;s daughter never slept from her 1st day home!  Ok, she had <br/>\nto sleep sometime, but I had never seen anything like it before. <br/>\n   Anyway, her 13 year old was and still is extremely bright.  I <br/>\ncould rattle on at what she was doing at what age, but that really <br/>\nisn&#39;t important. But what I do want to say is if your reading John <br/>\nHolts books, remember, he says children learn by playing.  I have a <br/>\nfeeling Emma is so thrilled with the world around her she is afraid <br/>\nshe is going to miss something by sleeping!<br/>\n  This won&#39;t last forever and before you know it, she&#39;ll be going <br/>\nthru some other stage!  I do hope she&#39;s feeling better today!<br/>\n Syndi----ps....I hope i got her name right!</div>","specialLinks":[]},{"userId":150688296,"authorName":"Kiersten Pasciak","from":"&quot;Kiersten Pasciak&quot; &lt;kjl8@...&gt;","profile":"kierstenpasciak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Sleep Regulation","postDate":"1093061337","msgId":2896,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNnNmhzcCs4Zm1uQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDQwODIxMDAzNzA2LjQ3MDM1LnFtYWlsQHdlYjExMzAyLm1haWwueWFob28uY29tPg=="},"prevInTopic":2890,"nextInTopic":2904,"prevInTime":2895,"nextInTime":2897,"topicId":2890,"numMessagesInTopic":0,"msgSnippet":"Jennefer, She gave up nursing about a month ago on her own. She just got more and more squirmy and seemed like she would rather get down and play. Started","messageBody":"<div id=\"ygrps-yiv-216113313\">Jennefer,<br/>\n<br/>\nShe gave up nursing about a month ago on her own.<br/>\nShe just got more and more squirmy and seemed like she would rather <br/>\nget down and play. Started being unable to nurse with anyone else <br/>\naround first, then just stopped wanting to at all.<br/>\nSo, unfortunately, no nursing as comfort :(<br/>\n(That did work with my son)<br/>\n<br/>\nThe overtired part is very hard because both of my kids are so <br/>\nlittle. Her feelings spill over onto Jacob and he gets all worked up <br/>\ntoo.<br/>\n<br/>\nHopefully, part of the puzzle is getting clearer today.<br/>\nI wasn&#39;t really sure why it was bothering me all of a sudden.<br/>\nI didn&#39;t know if she was being more difficult or I was just getting <br/>\nmore run down. <br/>\nThe books and posts were definitely making me think a lot about her <br/>\nneeds and what she might be wanting.<br/>\nTonight, she was really congested at bedtime and she had some GI <br/>\nissues earlier this week.<br/>\nI think maybe she has a little bit of a bug and is really <br/>\nuncomfortable (on top of teething)<br/>\nShe was fussy at bedtime in the past and was having trouble going <br/>\ndown, but nothing like this.<br/>\nHopefully, I can bear with her and things will get better soon.<br/>\n<br/>\nShe is up again (it is midnight here) so I need to go.<br/>\nThank you for the ideas and support<br/>\n<br/>\n<br/>\nKiersten</div>","specialLinks":[]},{"userId":86181566,"authorName":"jennefer harper","from":"jennefer harper &lt;jenneferh2000@...&gt;","profile":"jenneferh2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Sleep Regulation","postDate":"1093048626","msgId":2890,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODIxMDAzNzA2LjQ3MDM1LnFtYWlsQHdlYjExMzAyLm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":2896,"prevInTime":2889,"nextInTime":2891,"topicId":2890,"numMessagesInTopic":0,"msgSnippet":"... If you mean by self-regulate sleep when tired, awake when not tired enough to fall asleep, then I say children are born with the ability. ... for you? I","messageBody":"<div id=\"ygrps-yiv-1905314493\"><blockquote><span title=\"ireply\">&gt;&gt;So, I guess my questions are...<br/>\n&gt;&gt;Is 14 months old enough to self-regulate?<br/>\n<br/>\n </span></blockquote>If you mean by &#39;self-regulate&#39; sleep when tired, awake<br/>\nwhen not tired enough to fall asleep, then I say<br/>\nchildren are born with the ability.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;If you have experience with this, how did it work<br/>\n </span></blockquote>for you?<br/>\n<br/>\nI never have/never will give my children &quot;bed times&quot;. <br/>\nThey fall asleep when and where they want to.  I can<br/>\ntell when my children are tired and ready to fall<br/>\nasleep.  If they don&#39;t just pass out on the spot, I<br/>\nhelp them fall asleep by &#39;nursing them down&#39;.  Do you<br/>\nstill nurse your 14 month old?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;My main concern is that she will be overtired and<br/>\n&gt;&gt;not function well <br/>\n&gt;&gt;during the day.<br/>\n<br/>\n </span></blockquote>I think this happens to us all when we don&#39;t get<br/>\nenough sleep.  But, it&#39;s not the end of the world. <br/>\nNaps help.  They may also fall asleep earlier the next<br/>\nday.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I don&#39;t want to &quot;force her to sleep&quot;<br/>\n<br/>\n </span></blockquote>Then don&#39;t.  Do you want to be forced to sleep?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;She, even now, has the ability to play quietly or<br/>\n&gt;&gt;look at books or <br/>\n&gt;&gt;move around when in her room.<br/>\n<br/>\n </span></blockquote>I assume she sleeps in her room, and you sleep<br/>\nseparately in yours?  Have you tried letting her play<br/>\nin your room and do the things above in your room<br/>\nwhile you are sleeping?  Perhaps you can close the<br/>\ndoor and child proof the knob so she can&#39;t get out if<br/>\nthere are safety issues.  Then she can fall asleep<br/>\nwhen *she* is ready to; not necessarily when *you* are<br/>\nready for her to.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;She sleeps on a mattress on the floor.<br/>\n<br/>\n </span></blockquote>Have you tried sleeping with her?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;If we close the door, she screams and screams until<br/>\n&gt;&gt;we either bring <br/>\n&gt;&gt;her out to be with us or falls asleep eventually. I<br/>\n&gt;&gt;do not want to <br/>\n&gt;&gt;continue this way.<br/>\n<br/>\n </span></blockquote>This sounds scarey.  What message is this sending her?<br/>\nAbandonment.  No one cares about her feelings. <br/>\nHelplessness.  All the reasons I hate Ferber. I am<br/>\nglad you want to try something different.<br/>\n<br/>\n-Jennefer<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n_______________________________<br/>\nDo you Yahoo!?<br/>\nWin 1 of 4,000 free domain names from Yahoo! Enter now.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://promotions.yahoo.com/goldrush\">http://promotions.yahoo.com/goldrush</a></div>","specialLinks":[]}],"prevTopicId":2913,"nextTopicId":2925}}