{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":241586873,"authorName":"barefootmamax4","from":"&quot;barefootmamax4&quot; &lt;barefootmamax4@...&gt;","profile":"barefootmamax4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: reply: delayed speach","postDate":"1208991883","msgId":32071,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ1b2ZhYitpbGptQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDgwNDIzMTA1NjUyLkpBMzhBLjI0MTk5OC5yb290QGZlcHdlYjEzPg=="},"prevInTopic":32066,"nextInTopic":0,"prevInTime":32070,"nextInTime":32072,"topicId":32066,"numMessagesInTopic":0,"msgSnippet":"... Laura, your post was great! I also did EC with two of my kids and I do know what you mean about the telepathy, although I feel that their talking was just","messageBody":"<div id=\"ygrps-yiv-635786628\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a>, &lt;lauramae117@...&gt; wrote:<br/>\n<br/>\nLaura, your post was great! I also did EC with two of my kids and I <br/>\ndo know what you mean about the telepathy, although I feel that their <br/>\ntalking was just another additional way of communication,instead of a <br/>\ntrade in. When they are little and you have them right there in arms <br/>\nand they nurse freely without needing to ask, they sleep with you or <br/>\non you as they doze when they are tired... they do not need to talk <br/>\nor cry because all of their needs are met. They are content.<br/>\n<br/>\nIn my personal experience with my four kids and my friends, some who <br/>\nhave many children(one family has 7, another has 5), kids will <br/>\ndevelop outside of the range of &quot;normal&quot; and be just fine.One of mine <br/>\nwalked at 8 months, but he didn&#39;t utter a word until well after 2. <br/>\nTwo talked very well and early. One was &quot;right on schedule&quot;. I have <br/>\nseen an 18 month old who did not walk or talk, she just sat around <br/>\nsmiling. We called her the Budda Baby. Eventually she did just get up <br/>\nand walk and talk. No problems at all.She was from the family of 7 <br/>\nkids. They also had an 8 month old walking baby, so they have had <br/>\nboth extremes and everything in between.<br/>\n<br/>\nBy contast, my sister has a son,her only child, who is now 4. When he <br/>\nwas born his esophegus was connected to his trachea, andwas not <br/>\nconnected to his stomach. He had surgery right away and many <br/>\ncomplications.  He stopped breathing two times as an infant. As he <br/>\nhas grown,he was delayed in his development in crawling, walking, <br/>\ntalking and eating. Yet at 18 months I saw him catch up to <br/>\nthe &quot;average&quot; child. Yet,my sister and his Dr&#39;s were still saying he <br/>\nwas delayed in speach , and physical development. He did talk with <br/>\nfew words, but more than the Budda Baby!  He was walking, but didn&#39;t <br/>\nlike to get his hands dirty. They called this a sensory issue. I have <br/>\na kid who never liked to get dirt on his hands, not as a baby and not <br/>\nnow at 11. He is a very neat and tidy person.<br/>\n At 4 years old a therapist told my sister that her son was not <br/>\nspeaking properly,that he was just repeating phrases that other <br/>\npeople have said to him. He tells me all sorts of things,not <br/>\nrepeated, but he does repeat one thing I&#39;m sure he was told, he <br/>\nsays &quot;I have issues&quot;.<br/>\n Honestly, 8 months old is so little and there is still such a wide <br/>\nrange of development. I personally would just choose the wait and see <br/>\nmethod.<br/>\n-Kelly </span></blockquote></div>","specialLinks":[]},{"userId":335239006,"authorName":"lauramae117@charter.net","from":"&lt;lauramae117@...&gt;","profile":"lauramae117","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"reply: delayed speach","postDate":"1208962612","msgId":32066,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDgwNDIzMTA1NjUyLkpBMzhBLjI0MTk5OC5yb290QGZlcHdlYjEzPg=="},"prevInTopic":0,"nextInTopic":32071,"prevInTime":32065,"nextInTime":32067,"topicId":32066,"numMessagesInTopic":0,"msgSnippet":"Hi, I m not sure if this is how to respond, i just hit reply, but i would like to add my two cents to the topic of delayed speech in the eight month old. My","messageBody":"<div id=\"ygrps-yiv-2072870225\">Hi, I&#39;m not sure if this is how to respond, i just hit reply, but i would like <br/>\nto add my two cents to the topic of &quot;delayed speech in the eight month old.&quot; <br/>\n <br/>\nMy daughter, Ani, began making sounds on a &quot;normal&quot; timetable, then just stopped <br/>\n&quot;progressing&quot; at about ten months.  She didn&#39;t say ANY words at all.  She would <br/>\n&quot;woof&quot; when the dog was at the door, and that was it.  I was becoming concerned <br/>\nthat perhaps she was deaf or hard-of-hearing, as I have some exp. within deaf <br/>\nculture, and thought perhaps i was blessed with a &quot;special&quot; child after all.  <br/>\n <br/>\nShe and I communicated beautifully, however, it was just all telepathic.  She <br/>\nhas been E.C&#39;d since three months, and we always made it to the potty without <br/>\nher vocalizing any thing. <br/>\n <br/>\nFast forward to this Christmas:  she was nineten months old, still not saying <br/>\nany words.  She&#39;d been making tons of sounds, trying out each one, practicing <br/>\ndiff. pitches and tones for each new sound, incorporating the new sounds with <br/>\nher reproitoire of previously mastered one, yet, no words.  Then we introduced <br/>\nthe Santa story to her.  Suddenly, everything&#39;s Santa!  santa, santa, <br/>\nsanta...within the month, she was speaking, quite clearly, appx. 18 words.  <br/>\n <br/>\nAs I looked back on the time, I realize that a lie was the reason she began <br/>\ncommunicxation in spoken language.  Our telepathy worked perfectly until that <br/>\npoint, because all i&#39;d told her was the TRUTH.  As soon as an untruth was <br/>\nintroduced, she was removed from the purity of complete truth, had fallen to <br/>\nthis earth and had to adopt the &quot;normal&quot; way of communicating, i.e., through <br/>\nspoken language. <br/>\n <br/>\nNow, at 22 months, she is stringing together two and three word phrases.  She <br/>\nand I are still telepathic and I feel this is the future of human <br/>\ncommunications.  As we learn to live in light, in complete openness and freedom, <br/>\nwe will lose the need to decieve, to hide our true thoughs and intentions from <br/>\none another.  When we all begin to speak the truth, we will no longer need to <br/>\nspeak at all. <br/>\n <br/>\nlaura <br/>\n---- <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingbasics@yahoogroups.com\">unschoolingbasics@yahoogroups.com</a> wrote:</div>","specialLinks":[]}],"prevTopicId":32065,"nextTopicId":32104}}